{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] help! starting to panic","postDate":"1159012146","msgId":17555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwMkM5QUY4LTU5QzEtNEE0OS04MTVELUFBRkJBRUQ1N0QyRkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDUwNTFFNDIyLUYyNjgtNDg0QS1CRDEzLTMyOUM0RjFFRDc0NkBnbWFpbC5jb20+","referencesHeader":"PDUwNTFFNDIyLUYyNjgtNDg0QS1CRDEzLTMyOUM0RjFFRDc0NkBnbWFpbC5jb20+"},"prevInTopic":17549,"nextInTopic":0,"prevInTime":17554,"nextInTime":17556,"topicId":17540,"numMessagesInTopic":0,"msgSnippet":"... She needs what she needs. You can t rush her into needing or wanting something different! I watched a *lot* of television when I was a kid. (Read books and","messageBody":"<div id=\"ygrps-yiv-1458292873\">On Sep 22, 2006, at 7:22 PM, Solé wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I wonder if she (7) will ever stop deschooling in our situation,<br/>\n&gt; because she&#39;s still going to school!<br/>\n<br/>\n </span></blockquote>She needs what she needs. You can&#39;t rush her into needing or wanting  <br/>\nsomething different!<br/>\n<br/>\nI watched a *lot* of television when I was a kid. (Read books and  <br/>\nplayed with friends too. Did homework.) But I did watch several hours  <br/>\nof TV after school and in the evening. It was relaxing after the  <br/>\nstress of school. And my parents didn&#39;t say anything -- didn&#39;t add to  <br/>\nthe stress. (Probably because I got good grades and they figured why  <br/>\ntamper with what was working? ;-) Now I watch very little. I don&#39;t  <br/>\nhave the stress in my life that  i needed to relax from.<br/>\n<br/>\nI learned loads from TV. It fed an interest in history (through  <br/>\nmovies) that school tried really hard to crush with it&#39;s dry history  <br/>\nbooks. It fed an interest in science and science fiction. It fed an  <br/>\ninterest in character based story telling. And trivia with game  <br/>\nshows. (I had forgotten how many game shows I used to watch!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I&#39;m worried that she will not go to bed in<br/>\n&gt; time,<br/>\n<br/>\n </span></blockquote>These all sound like bad consequences you&#39;re trying to prevent. Help  <br/>\nher explore. Be supportive. Give her some information to help her  <br/>\ndecide but leave the decision up to her. If she&#39;s grumpy the next  <br/>\nday, do give her feedback that you don&#39;t want to be treated that way.  <br/>\nSympathize with her feelings. Help her work through it. She&#39;s  <br/>\nexploring limits.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I start saying that these programs are not for children<br/>\n<br/>\n </span></blockquote>Which, you&#39;re right, says &quot;I don&#39;t trust you. You can&#39;t handle this.&quot;  <br/>\nTo many kids that&#39;s a challenge to test themselves against.<br/>\n<br/>\nTreat it as you would about a program you don&#39;t think she&#39;d find  <br/>\ninteresting. Give her information to help her decide if she wants to  <br/>\ntry. If she wants to try it, be with her.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; so I can&#39;t really trust her either<br/>\n<br/>\n </span></blockquote>The more you do trust her, the faster she&#39;ll be able to trust you.<br/>\n<br/>\nDon&#39;t trust her to make the right decisions. Trust her to need to  <br/>\nexplore. Yes, she&#39;s probably testing *your* boundaries too! It&#39;s  <br/>\nperfectly normal.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I dunno if it would be ok to say &quot;you can<br/>\n&gt; watch scary movies, and you can ask for help if you want&quot; or<br/>\n&gt; something, I have the feeling she&#39;ll just watch them then without<br/>\n&gt; asking and then I have a child crying each night because of<br/>\n&gt; nightmares<br/>\n<br/>\n </span></blockquote>Has this happened?<br/>\n<br/>\nI think you&#39;re still thinking in terms of how you can get her to make  <br/>\nthe reasonable, rational decisions that you know are right.<br/>\n<br/>\nBut she needs to explore first. Talk about the *possible*  <br/>\nconsequences (she might not have nightmares, for instance, she might  <br/>\nnot be grumpy the next day) and brainstorm some solutions. If she has  <br/>\nnightmares, she could come into bed with you. Give her tools so she  <br/>\nfeels more powerful. Then she won&#39;t feel like she needs to keep  <br/>\ntesting the same things, seeking a way to feel competent and powerful.<br/>\n<br/>\nIt&#39;s very typical for people who have advanced in martial arts to  <br/>\nwant to defuse situations where they might end up in a fight. When  <br/>\nyou know you can beat someone to a pulp there isn&#39;t a reason to  <br/>\ntry! ;-) If she knows you&#39;re there to support her through the  <br/>\nconsequences and she doesn&#39;t have to figure out how to do it on her  <br/>\nown, she won&#39;t need to keep testing those particular waters,  <br/>\nsearching for competence.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but whenever<br/>\n&gt; something goes wrong, I&#39;m a bad mother (?) (according to my (new)<br/>\n&gt; standarts!)<br/>\n<br/>\n </span></blockquote>No. See it as her exploring. And see it as you learning to make  <br/>\nbetter choices too.<br/>\n<br/>\nTesting limits involves risking consequences. But consequences can be  <br/>\nlearned from too. *Not* just learning to avoid the consequence but  <br/>\nlearning to deal with them. The lesson learned from a scratched knee  <br/>\nisn&#39;t to learn how to stop doing things that will scratch knees. The  <br/>\nlessons can be how to treat a scratched knee, how to make a better  <br/>\njump to land in a way that won&#39;t hurt. Being grumpy after a too late  <br/>\nnight watching TV can be a time to learn about what will help  <br/>\ngrumpiness, because sometimes we do need to function on little sleep.  <br/>\n(Like moms need to do sometimes! ;-)<br/>\n<br/>\nBut do let her see that *everyone&#39;s* explorations in the family are a  <br/>\nprivilege, not a right. None of us has a right to make the family  <br/>\nsuffer while we try things out. Approach that as a given, rather than  <br/>\na rule. Her meeting of her needs and wants can&#39;t come at the expense  <br/>\nof the others in the family, but you&#39;re there to help her find ways  <br/>\nto meet her needs *and* help others meet their needs too. If for  <br/>\ninstance she wants to be loud when the baby wants to nap, approach it  <br/>\nas &quot;I&#39;m trying to meet two needs here, your need to play and his need  <br/>\nto sleep. Can you help me figure out ways to do that?&quot; Make her part  <br/>\nof the solution rather than turning her into the problem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And of course I have doubts and I wonder if tv doesn&#39;t<br/>\n&gt; just make you addicted to it, so maybe it never stops and she becomes<br/>\n&gt; an addict (of tv)!<br/>\n<br/>\n </span></blockquote>I have several posts on my website about TV (and &quot;addiction&quot;). They  <br/>\nmight be helpful. Scroll down to the bottom on the left and there are  <br/>\nlinks:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133390932,"authorName":"Mara","from":"Mara &lt;mamadeluz@...&gt;","profile":"mamadeluz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] help! starting to panic","postDate":"1158990984","msgId":17549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwOTIzMDU1NjI0LjU0MTYyLnFtYWlsQHdlYjUzMjA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDUwNTFFNDIyLUYyNjgtNDg0QS1CRDEzLTMyOUM0RjFFRDc0NkBnbWFpbC5jb20+"},"prevInTopic":17543,"nextInTopic":17555,"prevInTime":17548,"nextInTime":17550,"topicId":17540,"numMessagesInTopic":0,"msgSnippet":"Johanna, first of all, lots or virtual hugs. What you are trying to do in Germany is very hard - I know because I am German, but happily unschooling my","messageBody":"<div id=\"ygrps-yiv-1162524556\">Johanna,<br/>\nfirst of all, lots or virtual hugs. What you are<br/>\ntrying to do in Germany is very hard - I know because<br/>\nI am German, but happily unschooling my children in<br/>\nthe States. I would love to know where in Germany you<br/>\nare?<br/>\nI have been working on responding to your situation<br/>\nfor a few days now, so here it goes:<br/>\n I grew up in Germany (Dortmund) and never know there<br/>\nexisted such a thing as unschooling or even<br/>\nhomeschooling and now that I am unschooling still get<br/>\nlots of questions and criticism from my German family<br/>\n.<br/>\nAnyways, here are some things that helped me growing<br/>\nup in that system - the first 8 years I went to a<br/>\nWaldorf school where they did not do grades and I had<br/>\nsome very wonderful experiences there. My parents<br/>\ndrove me to another town to attend this school and it<br/>\nwas well worth it. There is no cheating there, more<br/>\ncooperation, more hands-on work like woodworking,<br/>\ngardening, cooking, music...And in 8th grade we worked<br/>\non a play full-time for months with no other classes.<br/>\nEveryone got to do what they wanted within that frame<br/>\nat least. My father taught there for some time and his<br/>\nclasses were mostly discussions about life, whatever<br/>\nthe students wanted to discuss. Sometimes there are<br/>\nsome &#39;freie schulen&#39; that at least do things a bit<br/>\nmore differently and fun than the public schools, and<br/>\nif it has to be public, is there a &#39;gesamtschule&#39; near<br/>\nyou? - do you have any options about the school? If<br/>\nyou do, why not visit them with your daughter and in<br/>\nthe end, have her pick one she feels she could handle?<br/>\nIf you are out in the boonies, that is not an option<br/>\nof course,  but if you can move within Germany, it<br/>\nmight well be worth it.<br/>\nHere are some more thoughts that could help:<br/>\nOnce I switched school to a regular gymnasium (public<br/>\nschool) It helped to have my parents on my side<br/>\nalways. To  be able to joke about the mean or drunk<br/>\nteachers with them and to know that grades are totally<br/>\narbitrary and don&#39;t mean a thing about who you are or<br/>\nwhat you (need to) know. <br/>\n- Tell her if she could not finish her homework, that<br/>\nyou could write an excuse for her sometimes, some<br/>\nfamily issue or other. <br/>\nSometimes when I wanted to do other things (like go on<br/>\na jugglers meeting in highschool and skip school for<br/>\nit) my parents just wrote me excuses. <br/>\nYou could always have her miss a day here and there<br/>\nand have her stay home - even the work she would miss<br/>\nand have to make up is not as bad as a whole day of<br/>\nschool. You could make it your secret special day,<br/>\nwatch T.V all day  together, with some ice cream or<br/>\nwhatever fun, or bake cookies too...Tell her you wish<br/>\nit could always be like this, and some day it will,<br/>\nand that school is not important but could  be viewed<br/>\nlike some interesting adventure you have to get<br/>\nthrough. <br/>\n I had a friend in Berlin who was a single mom and had<br/>\nto go on a trip to Africa (business - she was an<br/>\nartist) and was able to take her daughter with her and<br/>\njust had her teachers give her the material to be<br/>\ncovered. Maybe you just need to attend a conference<br/>\n(unschooling?) somewhere and HAVE to take you<br/>\ndaughter...? :-)<br/>\n<br/>\nAbout the t.v. watching. It does sound like she is<br/>\ndeschooling - or destressing after school and also<br/>\ntesting the new freedom. Will it go away again? Will<br/>\nyou really trust her to make her own choices? i think<br/>\nshow her as much as possible in the rest of her day<br/>\nhow much you value her as a person. Sit down with her<br/>\nand get into her world. Really indulge her in it, talk<br/>\nto her about what she is watching. If she does not<br/>\nlike to play with her friends when they are there,<br/>\ncould she maybe invite them to a movie party? Watch a<br/>\nwhole  bunch of special movies in a row, dress up like<br/>\nthe theme of the movies, get comfortable with lots of<br/>\npillows, food etc. And, have fun yourself! Happiness<br/>\nultimately is something that has to come from the<br/>\ninside. And in Germany, as I recall, many people do<br/>\nNOT have that. All through my school days I remember a<br/>\ncertain gloominess and dread. This does not have to be<br/>\nso where you are of course -<br/>\n<br/>\nMaybe sometimes  you could think of something that<br/>\nwould really give you joy, something new, some place<br/>\nyou would like to travel to on the weekend, and just<br/>\nask her to come along. <br/>\nIt is funny, now when I get back to Germany I see all<br/>\nthese things that were there right under my nose when<br/>\nI was growing up but never went to. Beautiful medieval<br/>\ncastles to explore, caves, museums etc. My sons had a<br/>\nwonderful time the last time we went -<br/>\n<br/>\nWhen our then 13 y.o. left school he only wanted to<br/>\nwatch t.v. or play video games all day long for maybe<br/>\na year. He did not even want to see his friends and<br/>\nhad us turn them away when they came looking for him.<br/>\nHe did not want to go anywhere or do anything. <br/>\nNow, at 15 he is the most social person. He is making<br/>\nall his own choices, seeing lots of friends, spending<br/>\nlots of time outdoors and is calm and relaxed and<br/>\n&#39;happy&#39;. It made all the difference in the world.<br/>\nWhen I first released the control of t.v. for my now 5<br/>\ny.o. ( he was 4 at the time) he would watch a lot at<br/>\nfirst and we would sit down together and had some<br/>\nwonderful special times. Now he mostly could not care<br/>\nless and much prefers to play or build his Legos.<br/>\n<br/>\nI don&#39;t know if that helps at all. For now, all I<br/>\nwould concentrate on is to love you daughter and be<br/>\nhappy with her. <br/>\nSorry if there was a lot of rambling here. You are<br/>\nwelcome to also write to me in German of-list<br/>\nsometimes. I do have a German unschooling blog that I<br/>\nhave not written in much lately but intend to get<br/>\ngoing again soon -<br/>\nHere is my site: <a rel=\"nofollow\" target=\"_blank\" href=\"http://lebenohneschule.blogg.de\">http://lebenohneschule.blogg.de</a><br/>\n<br/>\nMuch love and all the best,<br/>\nMara<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- Solé &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:solelokuai@...\">solelokuai@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Dear List,<br/>\n&gt; <br/>\n&gt; I&#39;m starting to panic a bit. So before it grows, I<br/>\n&gt; want to seek your  <br/>\n&gt; advice.<br/>\n&gt; <br/>\n&gt; (As some of you probably remember I&#39;m the one trying<br/>\n&gt; to unschool in  <br/>\n&gt; Germany as much as it is possible, but still sending<br/>\n&gt; my daughter to  <br/>\n&gt; school because of German law.)<br/>\n&gt; <br/>\n&gt; We&#39;ve been quite happy with this new lifestyle. It&#39;s<br/>\n&gt; probably common  <br/>\n&gt; that parents tend to panic when their children<br/>\n&gt; deschool and only hang  <br/>\n&gt; out in front of the tv or computer. I understand<br/>\n&gt; that they would find  <br/>\n&gt; a healthy middle and interest in other things and<br/>\n&gt; that tv and  <br/>\n&gt; computer must not be regarded as a bad thing.<br/>\n&gt; <br/>\n&gt; But I wonder if she (7) will ever stop deschooling<br/>\n&gt; in our situation,  <br/>\n&gt; because she&#39;s still going to school! So I guess she<br/>\n&gt; needs to  <br/>\n&gt; &quot;deschool&quot; each afternoon from the school in the<br/>\n&gt; morning. I maybe  <br/>\n&gt; wouldn&#39;t start panicking if she was completely<br/>\n&gt; unschooled, but I&#39;m  <br/>\n&gt; starting to panic because I know she&#39;ll have to be<br/>\n&gt; in school for a  <br/>\n&gt; few years until we can move :-( I&#39;m imagining her  <br/>\n&gt; deschooling=watching tv everyday from now on until<br/>\n&gt; we move away (and  <br/>\n&gt; then even more time). And I&#39;m worried that she will<br/>\n&gt; not go to bed in  <br/>\n&gt; time, she&#39;s starting to watch more and more tv and<br/>\n&gt; going later to bed  <br/>\n&gt; each day despite my offers to cuddle and read a<br/>\n&gt; story and brushing  <br/>\n&gt; teeth together and the things we had been doing<br/>\n&gt; which helped her  <br/>\n&gt; settle down in the first weeks. When she has friends<br/>\n&gt; over, she just  <br/>\n&gt; goes in front of the tv, even if THEY are saying,<br/>\n&gt; hey, it&#39;s boring,  <br/>\n&gt; let&#39;s go out and play, she goes &quot;no, that&#39;s really<br/>\n&gt; interesting&quot; or  <br/>\n&gt; just says nothing and keeps watching, ignoring her<br/>\n&gt; guests. She  <br/>\n&gt; doesn&#39;t say good bye to them when they are about to<br/>\n&gt; leave, she sits  <br/>\n&gt; less than half a meter away from the tv and keeps<br/>\n&gt; watching *sigh*.  <br/>\n&gt; And it&#39;s getting later and later every day, and so<br/>\n&gt; the program  <br/>\n&gt; changes... I start saying that these programs are<br/>\n&gt; not for children  <br/>\n&gt; and we could look at the information (which comes<br/>\n&gt; with the program if  <br/>\n&gt; you press a button) to see if it&#39;s going to be scary<br/>\n&gt; and so on, but I  <br/>\n&gt; guess with this behaviour I&#39;m making it a whole lot<br/>\n&gt; more interesting.  <br/>\n&gt; When I asked about tv the other day you explained<br/>\n&gt; how your always  <br/>\n&gt; unschooled kids (or unschooled since years) would<br/>\n&gt; ask you to watch  <br/>\n&gt; scary things with you, ask for help and so on  but<br/>\n&gt; with never  <br/>\n&gt; unschooled kids, this just doesn&#39;t happen because<br/>\n&gt; she doesn&#39;t know  <br/>\n&gt; yet that she could trust me and ask for help or that<br/>\n&gt; I&#39;m trying to  <br/>\n&gt; change, so I can&#39;t really trust her either. It&#39;s a<br/>\n&gt; loop I cannot  <br/>\n&gt; easily break out from. I dunno if it would be ok to<br/>\n&gt; say &quot;you can  <br/>\n&gt; watch scary movies, and you can ask for help if you<br/>\n&gt; want&quot; or  <br/>\n&gt; something, I have the feeling she&#39;ll just watch them<br/>\n&gt; then without  <br/>\n&gt; asking and then I have a child crying each night<br/>\n&gt; because of  <br/>\n&gt; nightmares :-(<br/>\n&gt; <br/>\n&gt; It will be hard for me to try to explain my ideas in<br/>\n&gt; English, but  <br/>\n&gt; I&#39;ll try: I wonder if one can separate this issue in<br/>\n&gt; two parts, the  <br/>\n&gt; school/education part and the parenting part. I&#39;ve<br/>\n&gt; seen a lot of  <br/>\n&gt; other names, gentle parenting, attachment parenting<br/>\n&gt; etc... it&#39;s so  <br/>\n&gt; much information and this list already sends sooo<br/>\n&gt; many emails I can  <br/>\n&gt; hardly handle them, that i can&#39;t start informing<br/>\n&gt; myself about these  <br/>\n&gt; other things; and I think unschooling is what I<br/>\n&gt; want, despite that  <br/>\n&gt; fact that i can&#39;t really do it right now. If I<br/>\n&gt; understood right,  <br/>\n&gt; these &quot;other&quot; gentle parents do use some kind of<br/>\n&gt; limits system and  <br/>\n&gt; send their kids to school  do you think that can<br/>\n&gt; work? Do you think  <br/>\n&gt; it&#39;s possible that she is &quot;deparenting&quot;(instead of<br/>\n&gt; &quot;deschooling&quot;)  <br/>\n&gt; from the parenting part (over reacting  to the new<br/>\n&gt; freedoms she has)  <br/>\n&gt; and that this process of healing could finish even<br/>\n&gt; though she still  <br/>\n&gt; goes to school? Do you know what I mean? &lt;:-[  hmmm<br/>\n&gt; I was just  <br/>\n&gt; thinking that maybe it&#39;s not terrible because maybe<br/>\n&gt; it&#39;s two separate  <br/>\n&gt; things, deschooling and deparenting (or whatever one<br/>\n&gt; could call it),  <br/>\n&gt; and so maybe one thing won&#39;t affect the other. It&#39;s<br/>\n&gt; so hard for me to  <br/>\n&gt; juggle with these two things. I try to relax and<br/>\n&gt; whenever I panic  <br/>\n&gt; when she&#39;s been eating tons of chocolate, I go to<br/>\n&gt; the kitchen and  <br/>\n&gt; chop some fruits and then she takes that too and<br/>\n&gt; then I think &quot;ah,  <br/>\n&gt; you see, just needed to chop some fruit, no wonder&quot;.<br/>\n&gt; But then ALL the  <br/>\n&gt; responsibility lies on me  of course it does<br/>\n&gt; anyway, but whenever  <br/>\n&gt; something goes wrong, I&#39;m a bad mother (?)<br/>\n&gt; (according to my (new)  <br/>\n&gt; standarts!)  It feels strange sometimes and I&#39;m not<br/>\n&gt; sure how to cope  <br/>\n&gt; with this. As you can see, I&#39;m highly confused... I<br/>\n&gt; know that this  <br/>\n&gt; sounds like I didn&#39;t understand that unschooling<br/>\n&gt; isn&#39;t just another  <br/>\n&gt; method to make kids do what we want. I&#39;m not so<br/>\n&gt; desperately waiting  <br/>\n&gt; for the deschooling to be finished  I think that<br/>\n&gt; this deschooling  <br/>\n&gt; time, the healing time is a good part, but nobody<br/>\n&gt; wants to be healing  <br/>\n&gt; for years and years... if it doesnt end sometime and<br/>\n&gt; there is never  <br/>\n&gt; this True Happiness, and just Living. It&#39;s more like<br/>\n&gt; being constantly  <br/>\n&gt; on the way and not really &quot;healing&quot;. I see her<br/>\n&gt; anxious, not relaxed   <br/>\n&gt; so it&#39;s not that I want her to &quot;stop watching tv&quot;, I<br/>\n&gt; just want her to  <br/>\n&gt; be happy and wonder if this can be achieved at all<br/>\n&gt; under our  <br/>\n&gt; circumstances. And of course I have doubts and I<br/>\n&gt; wonder if tv doesn&#39;t  <br/>\n&gt; just make you addicted to it, so maybe it never<br/>\n&gt; stops and she becomes  <br/>\n&gt; an addict (of tv)! Sometimes I regret that i started<br/>\n&gt; going this path,  <br/>\n&gt; but mostly I think it&#39;s worth it, so much has<br/>\n&gt; changed and it&#39;s  <br/>\n&gt; beautiful too.<br/>\n&gt; <br/>\n&gt; So I guess I just want your thoughts on this, and<br/>\n&gt; maybe some opinion  <br/>\n&gt; on wether or not you think this can work or will<br/>\n&gt; always be  <br/>\n&gt; contradicting itself. I know I&#39;ve asked this before,<br/>\n&gt; but I guess I  <br/>\n&gt; didn&#39;t get a satisfying answer to this one because<br/>\n&gt; of my many other  <br/>\n&gt; questions in my last posting, please help!<br/>\n&gt; <br/>\n&gt; Greetings (I hope you understood what I was trying<br/>\n&gt; to say. Not only  <br/>\n&gt; am I confused, I also cannot put this into words<br/>\n&gt; that easily)<br/>\n&gt; <br/>\n&gt; Johanna<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;     (Yahoo! ID required)<br/>\n&gt; <br/>\n&gt;<br/>\n </span></blockquote>mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-fullfeatured@yahoogroups.com\">unschoolingbasics-fullfeatured@yahoogroups.com</a><br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>=== message truncated ===<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] help! starting to panic","postDate":"1158968251","msgId":17543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA5MjIxNjM3bzI1ZTVlMzAwcTQ3NDUzOWM0NDc5YTgzMDVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDUwNTFFNDIyLUYyNjgtNDg0QS1CRDEzLTMyOUM0RjFFRDc0NkBnbWFpbC5jb20+","referencesHeader":"PDUwNTFFNDIyLUYyNjgtNDg0QS1CRDEzLTMyOUM0RjFFRDc0NkBnbWFpbC5jb20+"},"prevInTopic":17540,"nextInTopic":17549,"prevInTime":17542,"nextInTime":17544,"topicId":17540,"numMessagesInTopic":0,"msgSnippet":"... I think that once she realizes that YOU aren t going to limit the things that she wants to do (be it watch tv, play video games or twirl in circles until","messageBody":"<div id=\"ygrps-yiv-1138643099\">On 9/22/06, Solé &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:solelokuai@...\">solelokuai@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; But I wonder if she (7) will ever stop deschooling in our situation,<br/>\n&gt; because she&#39;s still going to school!<br/>\n<br/>\n </span></blockquote>I think that once she realizes that YOU aren&#39;t going to limit the<br/>\nthings that she wants to do (be it watch tv, play video games or twirl<br/>\nin circles until she throws up :) ) she will start relaxing and trust<br/>\nyou to help her work towards her passions.  And who knows, perhaps<br/>\ntelevision will be one of her passions!  :)  Yes; school will be a<br/>\ndistraction to her deschooling, but the home life that you provide is<br/>\ngoing to be more important an influence.  And you haven&#39;t been<br/>\n&quot;deschooling&quot; for very long either, so it is going to take time!<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":280005589,"authorName":"Solé","from":"=?ISO-8859-1?Q?Sol=E9?= &lt;solelokuai@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"help! starting to panic","postDate":"1158967359","msgId":17540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNTFFNDIyLUYyNjgtNDg0QS1CRDEzLTMyOUM0RjFFRDc0NkBnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":17543,"prevInTime":17539,"nextInTime":17541,"topicId":17540,"numMessagesInTopic":0,"msgSnippet":"Dear List, I m starting to panic a bit. So before it grows, I want to seek your advice. (As some of you probably remember I m the one trying to unschool in ","messageBody":"<div id=\"ygrps-yiv-240328570\">Dear List,<br/>\n<br/>\nI&#39;m starting to panic a bit. So before it grows, I want to seek your  <br/>\nadvice.<br/>\n<br/>\n(As some of you probably remember I&#39;m the one trying to unschool in  <br/>\nGermany as much as it is possible, but still sending my daughter to  <br/>\nschool because of German law.)<br/>\n<br/>\nWe&#39;ve been quite happy with this new lifestyle. It&#39;s probably common  <br/>\nthat parents tend to panic when their children deschool and only hang  <br/>\nout in front of the tv or computer. I understand that they would find  <br/>\na healthy middle and interest in other things and that tv and  <br/>\ncomputer must not be regarded as a bad thing.<br/>\n<br/>\nBut I wonder if she (7) will ever stop deschooling in our situation,  <br/>\nbecause she&#39;s still going to school! So I guess she needs to  <br/>\n&quot;deschool&quot; each afternoon from the school in the morning. I maybe  <br/>\nwouldn&#39;t start panicking if she was completely unschooled, but I&#39;m  <br/>\nstarting to panic because I know she&#39;ll have to be in school for a  <br/>\nfew years until we can move :-( I&#39;m imagining her  <br/>\ndeschooling=watching tv everyday from now on until we move away (and  <br/>\nthen even more time). And I&#39;m worried that she will not go to bed in  <br/>\ntime, she&#39;s starting to watch more and more tv and going later to bed  <br/>\neach day despite my offers to cuddle and read a story and brushing  <br/>\nteeth together and the things we had been doing which helped her  <br/>\nsettle down in the first weeks. When she has friends over, she just  <br/>\ngoes in front of the tv, even if THEY are saying, hey, it&#39;s boring,  <br/>\nlet&#39;s go out and play, she goes &quot;no, that&#39;s really interesting&quot; or  <br/>\njust says nothing and keeps watching, ignoring her guests. She  <br/>\ndoesn&#39;t say good bye to them when they are about to leave, she sits  <br/>\nless than half a meter away from the tv and keeps watching *sigh*.  <br/>\nAnd it&#39;s getting later and later every day, and so the program  <br/>\nchanges... I start saying that these programs are not for children  <br/>\nand we could look at the information (which comes with the program if  <br/>\nyou press a button) to see if it&#39;s going to be scary and so on, but I  <br/>\nguess with this behaviour I&#39;m making it a whole lot more interesting.  <br/>\nWhen I asked about tv the other day you explained how your always  <br/>\nunschooled kids (or unschooled since years) would ask you to watch  <br/>\nscary things with you, ask for help and so on – but with never  <br/>\nunschooled kids, this just doesn&#39;t happen because she doesn&#39;t know  <br/>\nyet that she could trust me and ask for help or that I&#39;m trying to  <br/>\nchange, so I can&#39;t really trust her either. It&#39;s a loop I cannot  <br/>\neasily break out from. I dunno if it would be ok to say &quot;you can  <br/>\nwatch scary movies, and you can ask for help if you want&quot; or  <br/>\nsomething, I have the feeling she&#39;ll just watch them then without  <br/>\nasking and then I have a child crying each night because of  <br/>\nnightmares :-(<br/>\n<br/>\nIt will be hard for me to try to explain my ideas in English, but  <br/>\nI&#39;ll try: I wonder if one can separate this issue in two parts, the  <br/>\nschool/education part and the parenting part. I&#39;ve seen a lot of  <br/>\nother names, gentle parenting, attachment parenting etc... it&#39;s so  <br/>\nmuch information and this list already sends sooo many emails I can  <br/>\nhardly handle them, that i can&#39;t start informing myself about these  <br/>\nother things; and I think unschooling is what I want, despite that  <br/>\nfact that i can&#39;t really do it right now. If I understood right,  <br/>\nthese &quot;other&quot; gentle parents do use some kind of limits system and  <br/>\nsend their kids to school – do you think that can work? Do you think  <br/>\nit&#39;s possible that she is &quot;deparenting&quot;(instead of &quot;deschooling&quot;)  <br/>\nfrom the parenting part (over reacting  to the new freedoms she has)  <br/>\nand that this process of healing could finish even though she still  <br/>\ngoes to school? Do you know what I mean? &lt;:-[  hmmm I was just  <br/>\nthinking that maybe it&#39;s not terrible because maybe it&#39;s two separate  <br/>\nthings, deschooling and deparenting (or whatever one could call it),  <br/>\nand so maybe one thing won&#39;t affect the other. It&#39;s so hard for me to  <br/>\njuggle with these two things. I try to relax and whenever I panic  <br/>\nwhen she&#39;s been eating tons of chocolate, I go to the kitchen and  <br/>\nchop some fruits and then she takes that too and then I think &quot;ah,  <br/>\nyou see, just needed to chop some fruit, no wonder&quot;. But then ALL the  <br/>\nresponsibility lies on me – of course it does anyway, but whenever  <br/>\nsomething goes wrong, I&#39;m a bad mother (?) (according to my (new)  <br/>\nstandarts!)  It feels strange sometimes and I&#39;m not sure how to cope  <br/>\nwith this. As you can see, I&#39;m highly confused... I know that this  <br/>\nsounds like I didn&#39;t understand that unschooling isn&#39;t just another  <br/>\nmethod to make kids do what we want. I&#39;m not so desperately waiting  <br/>\nfor the deschooling to be finished – I think that this deschooling  <br/>\ntime, the healing time is a good part, but nobody wants to be healing  <br/>\nfor years and years... if it doesnt end sometime and there is never  <br/>\nthis True Happiness, and just Living. It&#39;s more like being constantly  <br/>\non the way and not really &quot;healing&quot;. I see her anxious, not relaxed –  <br/>\nso it&#39;s not that I want her to &quot;stop watching tv&quot;, I just want her to  <br/>\nbe happy and wonder if this can be achieved at all under our  <br/>\ncircumstances. And of course I have doubts and I wonder if tv doesn&#39;t  <br/>\njust make you addicted to it, so maybe it never stops and she becomes  <br/>\nan addict (of tv)! Sometimes I regret that i started going this path,  <br/>\nbut mostly I think it&#39;s worth it, so much has changed and it&#39;s  <br/>\nbeautiful too.<br/>\n<br/>\nSo I guess I just want your thoughts on this, and maybe some opinion  <br/>\non wether or not you think this can work or will always be  <br/>\ncontradicting itself. I know I&#39;ve asked this before, but I guess I  <br/>\ndidn&#39;t get a satisfying answer to this one because of my many other  <br/>\nquestions in my last posting, please help!<br/>\n<br/>\nGreetings (I hope you understood what I was trying to say. Not only  <br/>\nam I confused, I also cannot put this into words that easily)<br/>\n<br/>\nJohanna</div>","specialLinks":[]}],"prevTopicId":17383,"nextTopicId":17537}}