{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":139136574,"authorName":"Jeanette Crichton","from":"Jeanette Crichton &lt;jeanettec_99@...&gt;","profile":"jeanettec_99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics]Clean bedroom was What the Unschooling Gurus teach is so true!","postDate":"1211689014","msgId":33086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMzk2LjYxNDc0LnFtQHdlYjM1NDA4Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":33085,"nextInTime":33087,"topicId":33086,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-304437767\">&lt;&lt;&lt;&lt;.at what point do you think it could become an issue where the <br/>\nchild comes to expect that you just do it for them and they don&#39;t <br/>\nhave to and at what point is it still appreciated?&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nA child does not HAVE to clean his/her room.  This may be a wish for the parent and some kids may do it because they like to clean their room or whatever.  And, a child does not HAVE to appreciate someone else cleaning their room.  Again, it may be a wish that a parent has, but I don&#39;t personally do things because I expect something (even appreciation) in return.  I do things for others because I like to make life easier for others when I can.  <br/>\n<br/>\nWhen I was a child, I used to hate cleaning my room but I loved to clean out the bathroom closet and organize it, do laundry, and go grocery shopping.  My mom was way better at cleaning my room than I was.  I always felt lost.  But now, as an adult, I use the same techniques on my son&#39;s room that she used on my room.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;i want my children to be able to feel the pride and joy that comes <br/>\nfrom being able to tackle a big task like a messy room... this isn&#39;t <br/>\nsomething i expect them to be able to accomplish at a young age but i <br/>\nwould like to do what i need to do to help them gain that ability <br/>\neventually. if it means simply modeling it now, then great...i just <br/>\nwant to make sure i&#39;m not also setting them up to just expect others <br/>\nto do for them. there are so many different ideas on that subject, i <br/>\nknow.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nGive your child the opportunity to help in any way that she can and continue modeling helpfulness and appreciation.  Let her define her special talents and then let them grow and change with her naturally.  I love to take everything out of closets and cabinets, make a big mess, play in the mess with my sons and then make the closet/room/cabinet look really good.  They usually help out in some way too.  Then we just sit back and admire it : )<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;it is something i frequently have on my mind because i had a college <br/>\nroommate who&#39;s mother cleaned her room for her and did probably <br/>\neverything for her growing up and she was the WORST roommate...she <br/>\nabsolutely refused to help with the cleaning. she was the biggest <br/>\nslob i&#39;ve ever met. and very lazy. (there was a lot more of her life <br/>\nthat was affected by never having to do anything for herself, but <br/>\nthat&#39;s a whole &#39;nother story) &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI too had a very messy college room mate.  I used to clean our entire apartment every Saturday morning (while she slept) and I would clean her room for her before we had people over.  I also used to make her breakfast and pack her lunch while she spent 2 hours getting ready for our 8am class.  I don&#39;t think she ever said thank you.  But I never judged her, I tried to understand her and I let her be helpful in her own ways.  She usually did a lot of the cooking in the evenings.  Her troubles didn&#39;t come from not having to do anything for herself, but rather the negative emotions that were always attached to cleaning up.  We were best friends from 7th grade and she has now married my sister&#39;s brother in-law.  She still isn&#39;t that neat, but now she knows how to clean better and without so many negative emotions.  <br/>\n<br/>\nMy husband never did anything when he lived at home because he never did anything &quot;right&quot; according to his mother&#39;s standards.  We&#39;re a perfect match for cleaning because he is super fast at picking up (which I hate to do because I like to organize as I go, which takes way too long), and I love to clean and organize.  <br/>\n<br/>\nMake work a positive thing and your daughter will figure out what she&#39;s good at and enjoys.  Maybe it&#39;s cleaning out the cars, or working in a garden, or cooking, or organizing. And if she gets to adulthood and still hates cleaning, she could always hire someone that&#39;s good at it : )<br/>\n<br/>\n<br/>\nJeanette<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33012,"nextTopicId":1251}}