{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Education Week article on u/s&#39;ing","postDate":"1166643381","msgId":19975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYyRkQ5QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":19967,"nextInTopic":0,"prevInTime":19974,"nextInTime":19976,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"Gee they re losing lots of credibility with me already and I m only into the second section - they intimate that CT requires notice and review (not required by","messageBody":"<div id=\"ygrps-yiv-100071297\">Gee they&#39;re losing lots of credibility with me already and I&#39;m only into<br/>\nthe second section - they intimate that CT requires notice and review<br/>\n(not required by law) and they say that Sandra Dodd has two children<br/>\n(she&#39;s got 3).<br/>\n <br/>\nYou&#39;d think an educator focused magazine would do a bit more fact<br/>\nchecking...<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":61290046,"authorName":"Maisha Khalfani","from":"Maisha Khalfani &lt;maitai373@...&gt;","profile":"maitai373","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Education Week article on u/s&#39;ing","postDate":"1166630801","msgId":19967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjIwMTYwNjQxLjcyMTU1LnFtYWlsQHdlYjUyMjA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDYxMjIwMDIzMDQ5LjQ4NzgwLnFtYWlsQHdlYjUyMTEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":19963,"nextInTopic":19975,"prevInTime":19966,"nextInTime":19968,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"Jane!  Great article!  And the artwork was great.  I ll have to play the clip once I get speakers  I ll give you a call.....I promise  Namaste Maisha ","messageBody":"<div id=\"ygrps-yiv-1212376594\">Jane!  Great article!  And the artwork was great.  I&#39;ll have to play the clip once I get speakers &lt;g&gt;<br/>\n  I&#39;ll give you a call.....I promise &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n          Namaste<br/>\n  Maisha <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://khalfanifamilyadventures.blogspot.com\">http://khalfanifamilyadventures.blogspot.com</a><br/>\n&quot;The period of greatest gain in knowledge and experience is the most difficult period in one&#39;s life&quot; ~ The Dalai Lama<br/>\n      <br/>\n           <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Education Week article on u/s&#39;ing","postDate":"1166620968","msgId":19958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjIwMTMyMjQ4LjE3MDA1LnFtYWlsQHdlYjUzODEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDhDOEYyNEE1OUY5QUNGQy0xN0YwLTY5QTVARldNLU00My5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":19955,"nextInTopic":19963,"prevInTime":19957,"nextInTime":19959,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"I d like to read it, but I m not willing to subscribe. Can you cut and paste it here for us? ~Kell ****** It s free to subscribe as a guest -- which lets you","messageBody":"<div id=\"ygrps-yiv-831860182\">I&#39;d like to read it, but I&#39;m not willing to subscribe.<br/>\n<br/>\nCan you cut and paste it here for us?<br/>\n<br/>\n~Kell<br/>\n<br/>\n******<br/>\n   <br/>\n  It&#39;s free to subscribe as a guest -- which lets you view two articles a month.  I must have subscribed some time ago and forgotten, since it signed me in when I hit the site.<br/>\n   <br/>\n  Here&#39;s the article, cut & pasted as requested:<br/>\n   <br/>\n  I have to wonder, tho, how much credence to give someone who got the number of Dodd kids wrong.  I&#39;m sure Sandra would have told them she has three, tho they said she has two. <br/>\n   <br/>\n  From Education Week<br/>\n  Published: December 20, 2006 <br/>\n  Unschooling Stresses Curiosity More Than Traditional Academics  By Michelle R. Davis <br/>\n  As yellow school buses rumble through Nicole Pucketts Spokane, Wash., neighborhood, her eight children are often asleep in bed. When they wake up, instead of heading to school, they go downstairs to begin another day of &quot;unschooling,&quot; an educational approach that is the subject of much debate among home-schoolers and traditional school advocates. <br/>\n  Ms. Puckett keeps her children at home for their education, but she doesnt have a textbook in the house. Instead, she follows the philosophy of letting the child decide each day what activities to pursueor avoid. <br/>\n  On a typical day, Ms. Pucketts childrenwho range in age from 4 to 17 and have never gone to a traditional schoolmight watch a few hours of television, read the Bible, amuse themselves with video games, play with their siblings, practice the violin, or learn Russian. On many days, theyre out of the house visiting museums, going to concerts, or attending theatrical plays. <br/>\n  &quot;I believe that each child is gifted, but each has different gifts,&quot; said Ms. Puckett, who sees it as her job to help facilitate the learning that her children choose. &quot;When I see them veering toward something, I guide them toward it. If theyre showing no interest, then we dont do it.&quot; <br/>\n  This child-led method of home schooling means that what children do during a typical school day is entirely up to them. In an era of increased standardized testing, top-down curricula, and the mandates of the federal No Child Left Behind Act, unschooling is attractive to some parents, who say learning should be a more organic, curiosity-inspired exercise. Advocates say it allows children to become passionate about, and invested in, their own learning. <br/>\n  Risks Involved  But critics, including some of those who opt for more-structured home schooling and proponents of &quot;child centered&quot; classrooms in regular schools, say that there are risks involved, and that learning deficits can result from letting children basically learn whatever they want. Nel Noddings, an education professor emeritus at Stanford University, describes herself as an advocate of child-centered education when it is done right. But she said unschooling raises many questions of concern. <br/>\n  For instance, she said, an unschooling parent who never liked science might de-emphasize the subject because of those feelings or a lack of knowledge about it. And she worries that religious fundamentalist parents, for example, might use unschooling &quot;to keep their kids away from the breadth of ideas they might be exposed to.&quot; <br/>\n  The term &quot;unschooling&quot; was coined by the late John Holt, one of the godfathers of the home-schooling movement, who wrote a stack of books about alternative ways of educating children. Mr. Holt first used the word in 1977 and equated it with home schooling. <br/>\n  The term resonated with many home-schooling parents who didnt want to use traditional methods, such as textbooks and organized subjects, to educate their children, said Patrick Farenga, the president of Holt Associates, based in Wakefield, Mass. Mr. Farenga took over leadership of the company, a home schooling publishing and advocacy organization, when Mr. Holt died in 1985. <br/>\n  Unschooling should not mean &quot;schooling without a plan,&quot; Mr. Farenga said in an interview. &quot;Its self-directed learning. I define unschooling as allowing children as much freedom to explore the world as you can comfortably bear.&quot; <br/>\n  Brian D. Ray, the president of the Salem, Ore.-based Home Schooling Institute, estimates that 10 to 15 percent of the 1.9 to 2.4 million K-12 children being home-schooled in the United States also fall into the unschooling category, also sometimes called &quot;relaxed home schooling.&quot; <br/>\n  &quot;Were talking about people who purposely, intentionally, philosophically make learning an integral and organic part of everyday life,&quot; he said. <br/>\n  State laws on home schooling also pertain to unschooling and vary considerably around the country, Mr. Ray said. Some states require home-schooled children to take several standardized tests during their K-12 years. Other states have few or no requirements of home-schoolers, he said. <br/>\n  For instance, in Washington state, where Ms. Pucketts family lives, the law requires that home-schooled students take an annual achievement test, though theyre not required to meet a particular educational achievement target, according to a listing of each states requirements compiled by Home Education Magazine, a bi-monthly magazine about home schooling that has been around since 1983. Connecticut asks that parents who engage in home schooling file an annual plan for their childs education and meet once a year with local education officials to review the plan. Pennsylvania requires that home-schooling parents provide at least 180 days of instruction and maps out what subjects must be taught. Pennsylvania also requires annual testing and detailed documentation from parents to prove instruction is occurring. <br/>\n  Sandra Dodd, a longtime advocate of unschooling who lives in Albuquerque, N.M., and whose two children never attended a traditional school, said when her oldest child was of school age she believed he was already soaking up more on his own than he would in kindergarten. <br/>\n  &quot;If you dont separate the world into educational and noneducational, your child wants to learn everything, so everything around them is what hes learning from,&quot; she said. &quot;Theyre learning in natural, real world ways, the way you learn to drive or cook or sew.&quot; <br/>\n  Less Structured Place   Unschoolers argue that if a child is intrigued by a book, for example, they dont have to quit reading it to make way for a science lesson; or if they love dinosaurs, they can study them for weeks at a time, and visit museums to bolster the experience. <br/>\n  Jane Powell, a Bowie, Md., mother of four children who practices unschooling, said she never taught her oldest son, now 9, to read. He learned how to read by playing video games, she said. <br/>\n  &quot;As he was playing his games, he was asking me to read, so I was reading what he needed. Then he was asking me less and less frequently, and then it stopped.  He learned to read,&quot; she said. &quot;I didnt teach him. I didnt prod him. I didnt give him any helpful shoves in the appropriate direction. He learned to read when he was ready.&quot; <br/>\n  Likewise, Ms. Dodd said she never taught her children mathematics by using worksheets or word problems. Her children learned math by figuring out how many weeks of allowance it would take to save up for a certain toy, by calculating percentage discounts on items at stores, and by estimating tips at restaurants, she said. <br/>\n  Ms. Dodd said her son, at his own request, took his first formal math class at age 18 at a local community college. When he took the initial placement test, she had to explain to him that multiplication could be represented by an X or by a dot or by a parenthesis. He scored well on the initial test, she said and by the end of the class he had pushed his scores even higher, she said. <br/>\n  With unschooling, &quot;how you learn something is because you want to learn it,&quot; Ms. Dodd said, adding that her children have been able to follow their own interestsrather than a list of subjects determined by others. &quot;My kids have had a glorious full life of absence of school,&quot; she said. <br/>\n  Of course, those from more traditional education circles worry that such free-form education could make it difficult for a child to adjust as an adult to the more structured world of college or work. <br/>\n  But Ms. Noddings of Stanford, despite her reservations about unschooling, believes just the opposite. <br/>\n  &quot;Perhaps these kids may help the world be a less miserable and less structured place,&quot; she said. &quot;Perhaps theyll have something to say against the overly bureaucratic system we have now.&quot; <br/>\n  Different Approaches   To those who have chosen unschooling, Mr. Farenga of Holt Associates said, the method can take a variety of forms. <br/>\n  He doesnt espouse any particular way of unschooling, but &quot;some parents take a very laissez-faire approach,&quot; while others choose more structure, he said. <br/>\n  Ms. Puckett, for example, limits her children to two hours a day of television time, a practice that makes some of the more extreme unschoolers wince. <br/>\n  &quot;Unschooling is not unparenting,&quot; Ms. Puckett said. &quot;My choice is that too much TV is not good for their brains, and it inhibits their natural curiosity.&quot; <br/>\n  Ms Dodd, on the other hand, said her family has TVs and video games in many rooms, and her childrens time using them is not limited. More often than not, though, the TVs will be off because her children find more creative and interesting things to do, she said. <br/>\n  But some educators, even within the home-schooling world, argue that unschooling can leave children with a lopsided education. <br/>\n  Manfred Smith, the president of the Maryland Home Education Association, based in Columbia, Md., said members of his organization once considered themselves unschoolers. &quot;It meant we were not going to replicate a traditional school-like focus on curriculum and text,&quot; he said. &quot;We wanted to focus on the needs and interests of our children.&quot; <br/>\n  But Mr. Smith said his group stopped using the term unschooling when it concluded the word had become tainted. &quot;You have people claiming to be unschoolers, providing minimal or no supervision,&quot; he said. &quot;Unschooling can be this great rationalization or outright excuse not to make an effort.&quot; <br/>\n  Alfie Kohn, a well-known education author who is an expert on progressive and child-centered education, said theres wide variation in the definition of unschooling. <br/>\n  &quot;There are those levels of extreme unschooling where parents will say, our children can figure out life on their own and well let them do it themselves,&quot; he said. &quot;Other levels are not as structured [as typical homeschooling], but parents make sure children are on par or even excel over where they should be.&quot; <br/>\n  Mr. Kohn said &quot;theres no question that unschooling leaves behind most of the bad stuff in a lot of schools. The question is whether some good stuff or potential good stuff is missing.&quot; <br/>\n   <br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":23699411,"authorName":"Geoffrey D. Bennett","from":"&quot;Geoffrey D. Bennett&quot; &lt;g@...&gt;","profile":"gb7au","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Education Week article on u/s&#39;ing","postDate":"1166620656","msgId":19963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjIwMTMxNzM2LkdBMjAyODRAYXByaWwubmV0Y3JhZnQuY29tLmF1Pg==","inReplyToHeader":"PDhDOEYyNEE1OUY5QUNGQy0xN0YwLTY5QTVARldNLU00My5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDIyNTI5NC4xMjAxLnFtQHdlYjUyMTA0Lm1haWwueWFob28uY29tPiA8OEM4RjI0QTU5RjlBQ0ZDLTE3RjAtNjlBNUBGV00tTTQzLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":19958,"nextInTopic":19967,"prevInTime":19962,"nextInTime":19964,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"On Wed, Dec 20, 2006 at 07:34:39AM -0500, kbcdlovejo@aol.com wrote: [...] ... I got immediate access (no confirmation email or anything like that needed) by","messageBody":"<div id=\"ygrps-yiv-103463444\"><blockquote><span title=\"qreply\">On Wed, Dec 20, 2006 at 07:34:39AM -0500, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n[...]<br/>\n&gt; I&#39;d like to read it, but I&#39;m not willing to subscribe.<br/>\n&gt; <br/>\n&gt; Can you cut  and paste it here for us?<br/>\n<br/>\nI got immediate access (no confirmation email or anything like that<br/>\nneeded) by filling in bogus data.  They don&#39;t verify the email address<br/>\nbeyond making sure it has an &quot;@&quot; and a &quot;.&quot; in it.<br/>\n<br/>\n-- <br/>\nGeoffrey D. Bennett, RHCE, RHCX               mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:g@...\">g@...</a><br/>\nSenior Systems Engineer                          sip:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:g@...\">g@...</a><br/>\nNetCraft Australia Pty Ltd        <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.netcraft.com.au/geoffrey/\">http://www.netcraft.com.au/geoffrey/</a> </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Education Week article on u/s&#39;ing","postDate":"1166618079","msgId":19955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOEYyNEE1OUY5QUNGQy0xN0YwLTY5QTVARldNLU00My5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDIyNTI5NC4xMjAxLnFtQHdlYjUyMTA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":19954,"nextInTopic":19958,"prevInTime":19954,"nextInTime":19956,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"... From: tribecus@yahoo.com Bah humbug!!  It seems that you cannot circumvent the need to register on the site -- even if you do follow the link.  Sorry!! ","messageBody":"<div id=\"ygrps-yiv-1431658602\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tribecus@...\">tribecus@...</a><br/>\n<br/>\n    Bah humbug!!  It seems that you cannot circumvent the need to <br/>\nregister on the<br/>\nsite -- even if you do follow the link.  Sorry!!<br/>\n<br/>\n  www.edweek.org is the website.<br/>\n<br/>\n   Btw, I wanted to add that the picture with Marinia standing in front <br/>\nof posted<br/>\nartwork is a collection that she and her brothers did while I was <br/>\nasleep one<br/>\nnight.  I woke up the next morning and *BAM!!* there they were -- the <br/>\nwhole<br/>\ngallery!!  An art attack, I tell you!!<br/>\n<br/>\n-=-=-=-<br/>\nI&#39;d like to read it, but I&#39;m not willing to subscribe.<br/>\n<br/>\nCan you cut  and paste it here for us?<br/>\n<br/>\n~Kell<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]},{"userId":174819350,"authorName":"Jane","from":"Jane &lt;tribecus@...&gt;","profile":"tribecus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Education Week article on u/s&#39;ing","postDate":"1166591527","msgId":19954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyNTI5NC4xMjAxLnFtQHdlYjUyMTA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNlYS41Mjk2NGU5LjMyYjlmYzk2QGFvbC5jb20+"},"prevInTopic":19952,"nextInTopic":19955,"prevInTime":19953,"nextInTime":19955,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"Bah humbug!!  It seems that you cannot circumvent the need to register on the site -- even if you do follow the link.  Sorry!! www.edweek.org is the website. ","messageBody":"<div id=\"ygrps-yiv-639255200\">Bah humbug!!  It seems that you cannot circumvent the need to register on the site -- even if you do follow the link.  Sorry!!  <br/>\n   <br/>\n  www.edweek.org is the website.  <br/>\n   <br/>\n  Btw, I wanted to add that the picture with Marinia standing in front of posted artwork is a collection that she and her brothers did while I was asleep one night.  I woke up the next morning and *BAM!!* there they were -- the whole gallery!!  An art attack, I tell you!!  <br/>\n   <br/>\n  TTFN!!<br/>\n  Jane <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Jane Powell <br/>\n  Tribe&#39;s Partner<br/>\n   <br/>\n  &quot;You must be the change you wish to see in the world.&quot; - Gandhi <br/>\n   <br/>\n  &quot;There is no right way to do the wrong thing.&quot; - unknown <br/>\n<br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Education Week article on u/s&#39;ing","postDate":"1166589784","msgId":19952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVtYWYwbytlazhvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYxMjIwMDIzMDQ5LjQ4NzgwLnFtYWlsQHdlYjUyMTEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":19949,"nextInTopic":19954,"prevInTime":19951,"nextInTime":19953,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"~~Education Week is a national publication. The tribe and I were interviewed (we appear in photos) and the article s up. ~~ I was called repeatedly for that","messageBody":"<div id=\"ygrps-yiv-775613882\">~~Education Week is a national publication. &quot;The tribe&quot; and I were<br/>\ninterviewed<br/>\n(we appear in photos) and the article&#39;s up. ~~<br/>\n<br/>\nI was called repeatedly for that interview and when they never called<br/>\nme at the time I told them I&#39;d be home, I gave up. Glad to know they<br/>\ngot some great unschoolers for the piece. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":285800846,"authorName":"SquishyMommyof2@aol.com","from":"SquishyMommyof2@...","profile":"steveshotwife2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Education Week article on u/s&#39;ing","postDate":"1166582422","msgId":19949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlYS41Mjk2NGU5LjMyYjlmYzk2QGFvbC5jb20+"},"prevInTopic":19948,"nextInTopic":19952,"prevInTime":19948,"nextInTime":19950,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"The link didn t work.  Could you copy and paste the article to  me?  Thanks in advance In a message dated 12/19/2006 8:36:40 P.M. Central Standard Time, ","messageBody":"<div id=\"ygrps-yiv-505614393\">The link didn&#39;t work.  Could you copy and paste the article to  me?  Thanks <br/>\nin advance<br/>\n <br/>\nIn a message dated 12/19/2006 8:36:40 P.M. Central Standard Time,  <br/>\ntribecus@... writes:<br/>\n<br/>\nEducation Week is a national publication. &quot;The tribe&quot; and I were  interviewed <br/>\n(we appear in photos) and the article&#39;s up. Sandra Dodd&#39;s quoted  in there, <br/>\nAlfie Kohn, and there&#39;s a lot from Nicole Puckett from Spokane, WA  (who, btw, <br/>\nhas 8 small people. I&#39;d love to meet her!!). <br/>\n<br/>\nIt&#39;s a long  link, but I hope it will allow you to circumvent the need to <br/>\nregister at the  site. <br/>\n<br/>\nI hope I did OK. As I told the woman who interviewed me when  you&#39;re part of <br/>\na minority, every step you take is 10 times louder than the  average. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Alyssa in IL<br/>\n_http://squishymommy.blogspot.com_ (http://squishymommy.blogspot.com/) <br/>\n<br/>\n<br/>\n&quot; Work like you don&#39;t need the money, love like you&#39;ve  never been hurt, and <br/>\ndance like you do when nobody&#39;s watching.&quot;<br/>\n<br/>\n&quot;All that  is necessary for the triumph of evil is that good people  do<br/>\nnothing.&quot;<br/>\n<br/>\n&quot; Knowledge is power but how you use that power defines  wether you are good <br/>\nor evil.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":174819350,"authorName":"Jane","from":"Jane &lt;tribecus@...&gt;","profile":"tribecus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Education Week article on u/s&#39;ing","postDate":"1166581849","msgId":19948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjIwMDIzMDQ5LjQ4NzgwLnFtYWlsQHdlYjUyMTEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":19949,"prevInTime":19947,"nextInTime":19949,"topicId":19948,"numMessagesInTopic":0,"msgSnippet":"Education Week is a national publication.  The tribe and I were interviewed (we appear in photos) and the article s up.  Sandra Dodd s quoted in there, Alfie","messageBody":"<div id=\"ygrps-yiv-294513825\">Education Week is a national publication.  &quot;The tribe&quot; and I were interviewed (we appear in photos) and the article&#39;s up.  Sandra Dodd&#39;s quoted in there, Alfie Kohn, and there&#39;s a lot from Nicole Puckett from Spokane, WA (who, btw, has 8 small people.  I&#39;d love to meet her!!).  <br/>\n   <br/>\n  It&#39;s a long link, but I hope it will allow you to circumvent the need to register at the site.  <br/>\n   <br/>\n  I hope I did OK.  As I told the woman who interviewed me when you&#39;re part of a minority, every step you take is 10 times louder than the average.  <br/>\n   <br/>\n  Here&#39;s the link:  <br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.edweek.org/ew/articles/2006/12/20/16unschool.h26.html?levelId=1000&rale2=KQE5d7nM%2FXAYPsVRXwnFWYRqIIX2bhy1%2BKNA5buLAWGoKt77XHI2terRpWBSgktL4bXgTCDsilHt%0Ae3C1y2NtyJrpYK8k2TIOLTtu9OX%2B%2FjXh%2F9BFEakU7ZHII%2Fmu01CUEpLNhfZ%2FY5RTSAFMoROfwTsH%0AAsyDLJnT9czpjKHi7khQUPRB5iYdtxnVDLWilnOfSFuuh%2BDKRjsfK0VXJju5P%2BH%2F0EURqRTtkcgj%0A%2Ba7TUJQeYmNFXnHsAe%2FI6gIsfsHGDThnKAzPST0%2B3OCj%2BvO831LHWg7Qm7v%2FZPCyHXV6pxaUEG%2Fm%0ACRlmHeSqGJQ2FDVChKtU06lB14HqOVqMH6NH1KlehWnUCSLo5KoYlDYUNUKEq1TTqUHXgYJ4VFF%2F%0AscAEBBaHFPDuaQ8Gf8gsnKo2UQ8WpDRncuS7vZIDHGwAQihjDRFI%2FMHGZvp7AYn757AGK9k6PL7m%0AOx7Hn5yacD0zylDCCOdgBLy9xFaKycTQ3MxGIl5HAcnT56qYKZCR97H4ndLFbftvYnD%2BrUwRBTlg%0ASL%2FEO40ulCl1iiyeTqzq%2F5aIaU7N9NI4Ht9bd01ykqstvQvDSr2mS2fDhBh3P3Ld5ZRJAEZcWy6v%0AS4AJeL54Q2KXxSM4pv6pThyPT%2B4ny9zOxr3AxeOMpTQ%3D\">http://www.edweek.org/ew/articles/2006/12/20/16unschool.h26.html?levelId=1000&rale2=KQE5d7nM%2FXAYPsVRXwnFWYRqIIX2bhy1%2BKNA5buLAWGoKt77XHI2terRpWBSgktL4bXgTCDsilHt%0Ae3C1y2NtyJrpYK8k2TIOLTtu9OX%2B%2FjXh%2F9BFEakU7ZHII%2Fmu01CUEpLNhfZ%2FY5RTSAFMoROfwTsH%0AAsyDLJnT9czpjKHi7khQUPRB5iYdtxnVDLWilnOfSFuuh%2BDKRjsfK0VXJju5P%2BH%2F0EURqRTtkcgj%0A%2Ba7TUJQeYmNFXnHsAe%2FI6gIsfsHGDThnKAzPST0%2B3OCj%2BvO831LHWg7Qm7v%2FZPCyHXV6pxaUEG%2Fm%0ACRlmHeSqGJQ2FDVChKtU06lB14HqOVqMH6NH1KlehWnUCSLo5KoYlDYUNUKEq1TTqUHXgYJ4VFF%2F%0AscAEBBaHFPDuaQ8Gf8gsnKo2UQ8WpDRncuS7vZIDHGwAQihjDRFI%2FMHGZvp7AYn757AGK9k6PL7m%0AOx7Hn5yacD0zylDCCOdgBLy9xFaKycTQ3MxGIl5HAcnT56qYKZCR97H4ndLFbftvYnD%2BrUwRBTlg%0ASL%2FEO40ulCl1iiyeTqzq%2F5aIaU7N9NI4Ht9bd01ykqstvQvDSr2mS2fDhBh3P3Ld5ZRJAEZcWy6v%0AS4AJeL54Q2KXxSM4pv6pThyPT%2B4ny9zOxr3AxeOMpTQ%3D</a><br/>\n   <br/>\n  TTFN!!<br/>\n  Jane<br/>\n<br/>\n<br/>\n  Jane Powell <br/>\n  Tribe&#39;s Partner<br/>\n   <br/>\n  &quot;You must be the change you wish to see in the world.&quot; - Gandhi <br/>\n   <br/>\n  &quot;There is no right way to do the wrong thing.&quot; - unknown <br/>\n<br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":19750,"nextTopicId":19978}}