{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Video gaming","postDate":"1212711394","msgId":33549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTk1ODFCNUU0QTdBRS0xMjIwLTU2NkB3ZWJtYWlsLW1lMTQuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDhDQTk1NzQ5NTVDQkYwNC0xNjdDLTg5Q0BXRUJNQUlMLU1CMTkuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PDM5NTEyLjEyMTI2OTE2NDFAbGlnaHR3YXlzY2hvb2xzLm9yZz4gPDhDQTk1NzQ5NTVDQkYwNC0xNjdDLTg5Q0BXRUJNQUlMLU1CMTkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":33548,"nextInTime":33550,"topicId":33549,"numMessagesInTopic":0,"msgSnippet":"More video gaming positives from Ode Magazine   www.odemagazine.com ~Kelly Kelly Lovejoy Conference Coordinator Live and Learn Unschooling Conference ","messageBody":"<div id=\"ygrps-yiv-149481719\">More video gaming positives from Ode Magazine   www.odemagazine.com<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\nReading, writing and playing The Sims<br/>\n<br/>\nWhat video games can teach educators about improving our schools<br/>\n<br/>\nMarco Visscher | September 2006 issue<br/>\n<br/>\nThe door closes with a squeak and a creak. Oh no! Is it locked? Let’s <br/>\ncheck… No, thank God, you can open it… So now, another go at getting to <br/>\nthe ladder. Maybe through this narrow hallway? … No, it’s a dead end.<br/>\n<br/>\nFifteen children between the ages of 9 and 11 are staring at the <br/>\ncomputer screen, mesmerized, as the adventure game Myst III: Exile is <br/>\nplayed. In the middle of the group sits Tim Rylands, the most popular <br/>\nteacher at the small elementary school Chew Magna, in the village of <br/>\nthe same name near the English city of Bristol. Once more he manuevers <br/>\nhis cordless mouse to guide the cursor along the dark walls of a hollow <br/>\nmountainside. Rylands then tells his students, “Okay, now write down <br/>\nwhich way we should go to get to the ladder. What do you come across? <br/>\nWhat do you experience on your journey?” The only sound heard is the <br/>\nfurious scribbling of pens.<br/>\n<br/>\nRylands has found a way to make writing fun for kids. Myst is a <br/>\nbeautifully designed series of computer games set on a mysterious <br/>\ndeserted island that can be endlessly navigated. According to Rylands, <br/>\nthe visually rich landscape inspires his students’ creativity.<br/>\n<br/>\n<br/>\nHe can back up that claim with data. An average of 75 percent of <br/>\nEnglish children between the ages of 9 and 11 reach so-called “level <br/>\nfour literacy levels” in reading and writing (including spelling, <br/>\ngrammar, vocabulary, etc.). At Chew Magna, that percentage stood at 77 <br/>\nin 2000, rising to 93 four years later after Rylands began using <br/>\ncomputers to help teach writing. Boys in particular, who normally score <br/>\nlower in these areas, have made tremendous progress. One hundred <br/>\npercent reach level four, compared to 67 percent in 2000.<br/>\n<br/>\n<br/>\nNolan Bushnell wishes his children had a teacher like Tim Rylands. “The <br/>\ndigital life in which kids live today is turned off at school. That <br/>\nleaves them with boredom and frustration. A man in front of a <br/>\nblackboard with a piece of chalk is just very boring.”<br/>\n<br/>\n<br/>\nBushnell should know. He watched as his eight children became <br/>\nincreasingly alienated in the U.S. educational system. He believes <br/>\nschools and teachers haven’t sufficiently adjusted to changes in the <br/>\nworld around them. Young people should not be memorizing facts or <br/>\nspending long hours on multiple-choice tests, says Bushnell, but <br/>\nlearning to think, analyze, make connections. These are the talents <br/>\nthat more than ever are rewarded in this new century, he says.<br/>\n<br/>\n<br/>\nBushnell also sees a solution for the educational system—the very idea <br/>\nTim Rylands is already putting into practise: using video and computer <br/>\ngames to inspire learning. He’s an expert in the field. Back in 1972, <br/>\nNolan Bushnell founded Atari, the pioneering computer company. As the <br/>\ncreator of classics like Pong—remember the Ping-Pong game between two <br/>\ndiscs on opposite sides of the screen?—Bushnell is generally recognized <br/>\nas “the father of the game industry.”<br/>\n<br/>\n<br/>\nAnd because he is also the father of a 12-year-old son who can <br/>\ndistinguish between 200 different Pokémon characters (“If they were <br/>\nplant and animal species, he would be able to pass sophomore biology”), <br/>\nBushnell now spreads the word about how video games can help kids <br/>\nlearn. Games, he asserts, teach you creative problem-solving. They <br/>\nteach you to formulate hypotheses (“First I have to get the key from <br/>\nthe magician so I can open the door”), to test these hypotheses (“Game <br/>\nover”) and revise them (“Oh no, I have to drink my elixir to get to the <br/>\nmagician!”). Games can even teach you the fundamental principles of <br/>\nscientific research.<br/>\n<br/>\n<br/>\nBack at Chew Magna school, Tim Rylands believes his students are <br/>\nlearning more than writing skills. “While going through a game, <br/>\nchildren listen and talk,” he explains as the classroom empties. “They <br/>\ndiscuss. They explore. It’s like going on a school trip, but this is a <br/>\nlot cheaper, and it saves on insurance premiums,” he jokes.<br/>\n<br/>\nMany people envision that the school of the future—and Bushnell would <br/>\nlove to open one himself—doesn’t use books as its primary teaching <br/>\nmaterials, but video games.<br/>\n<br/>\n<br/>\nIn the words of another game developer, Marc Prensky, who wrote Digital <br/>\nGame-Based Learning: “Because schools haven’t adapted to the world <br/>\ntheir students know and live in, they simply get bored in the <br/>\nclassroom. They tune out. You can get engagement, even among apathetic <br/>\nstudents, simply because games are constructed in a way so players want <br/>\nto finish the level. Games offer players the chance to make decisions, <br/>\nget feedback, level up and become heroes. That’s how education should <br/>\nbe organized. You learn more and more, you apply that knowledge, and <br/>\nyou’ll get a great job.”<br/>\n<br/>\n<br/>\nComputer games have already become part of the lesson plans in some <br/>\nschools. But these are usually simple games for elementary-school <br/>\nchildren. They use bright colours and amusing sounds to make math or <br/>\nspelling “fun.” But these only take the edge off the age-old practise <br/>\nof rote learning. This is not the type of game-based education Bushnell <br/>\nand Prensky advocate.<br/>\n<br/>\n<br/>\nTeachers like Tim Rylands (who won a teaching award last year from <br/>\nBECTA, the British government’s partner in the development and delivery <br/>\nof its Internet-based learning strategy for schools, for his use of <br/>\nMyst) who have found ways to include exciting games in their teaching <br/>\nmaterials continue to be the exceptions. Some progressive secondary <br/>\nschools use SimCity (a simulation game in which you build cities) and <br/>\nCivilization (a strategy game that involves building a complete <br/>\ncivilization).<br/>\n<br/>\n<br/>\nBut supporters of the video-game industry—a $28 billion business in <br/>\nwhich annual sales in the U.S. now outstrip the Hollywood box <br/>\noffice—see an opportunity to develop products tailored to schools. The <br/>\nnumber of games designed for educational or other purposes beyond play <br/>\nis a new, growing sector of the industry.<br/>\n<br/>\nOne example is a game recently developed by the United Nations called <br/>\nFood Force, in which young people learn about hunger issues by leading <br/>\ntheir own virtual food-aid campaign. It’s now common in the corporate <br/>\nworld to use computer and video games as part of refresher courses in <br/>\nnumerous fields. And public-health officials are exploring the <br/>\npossibilities of games that encourage good health (see “Watch out for <br/>\nthat cancer cell!” page XX).<br/>\n<br/>\n<br/>\nIn Got Game: How the Gamer Generation Is Reshaping Business Forever <br/>\n(Harvard Business School Press, 2004), two organizational-development <br/>\nconsultants explain that gamers are, in fact, ideal employees. They <br/>\ntake more risks, react better to disappointments or mistakes, are open <br/>\nto the possibility that their plan may need to be adjusted and strive <br/>\nfor excellence and promotions. Surprisingly, they also work better in <br/>\nteams—perhaps because of their experience working toward the same goal <br/>\nwith others when they are playing computer games.<br/>\n<br/>\n<br/>\nMany other people, of course, line up on the other side of the issue <br/>\nand their arguments are well known: The only thing kids learn from <br/>\ncomputer games is how to stare at a screen for hours. They’re not using <br/>\ntheir brains and imaginations, just a few tendons in their fingers to <br/>\noperate the joystick. A salient detail: Most gamers are under the age <br/>\nof 40, while most critics are older and have rarely played the games <br/>\nthemselves.<br/>\n<br/>\n<br/>\nParents are concerned that video games will make their children violent <br/>\nor uncommunicative. They get a lot of backing from vote-seeking <br/>\npoliticians who voice their disgust with the violence and sexism seen <br/>\nin games. The media tend to focus on extreme examples like Grand Theft <br/>\nAuto, in which the player is a criminal who must survive by breaking <br/>\ninto cars, robbing people and running over hapless pedestrians, and <br/>\ngets bonus points for killing cops. While arguably justified in such <br/>\ncases, the fear surrounding video games makes it difficult to look at <br/>\nthe reality. The fact is that both youth crime and violent crime in <br/>\nWestern countries has fallen spectacularly over the past 10 years as <br/>\nvideo-game popularity has risen. If video games inspire aggression, it <br/>\nis not reflected in the figures.<br/>\n<br/>\n<br/>\nMoreover, the shooting games are not the most popular. Usually, only <br/>\none or two violent titles rank among the top 10 best-selling games. The <br/>\nProgress %amp% Freedom Foundation, a liberal think tank in Washington, <br/>\ncalculated that over 80 percent of the most popular video and computer <br/>\ngames of the past five years were rated “E” for everyone or “T” for <br/>\n“teen,” i.e. they are not particularly violent.<br/>\n<br/>\n<br/>\nThere is also the concern that young people will become isolated by <br/>\nplaying video games. But many games, particularly those played on the <br/>\ncomputer or the Internet, are designed for teams. Kid’s social lives <br/>\nhave changed a lot over the last 20 years, when few households had <br/>\ncomputers. Kids relied more on reading (certainly an isolating pursuit) <br/>\nand gamers were often lonely outsiders. But today, gaming is a very <br/>\nnormal activity for most young people. In fact, nowadays a kid who’s <br/>\nnever played Nintendo or PlayStation is considered odd and often can’t <br/>\nrelate to others about an important leisure activity.<br/>\n<br/>\n<br/>\nWhat is hard to grasp for those who aren’t familiar with video <br/>\ngames—people who grew up playing chess and Scrabble—is that these new <br/>\ngames invite creativity, promote problem-solving abilities and inspire <br/>\nperseverance. As Marc Prensky points out, it can take up to 100 hours <br/>\nto complete a video game: “This is not just biding time on a rainy <br/>\nday.” Games stimulate the development of self-confidence and social <br/>\ncontact with others. For people who have never experienced the <br/>\nsensation of reaching the final moment of the role-playing game Deus Ex <br/>\n(for which there are three possible endings!), these positive aspects <br/>\nare difficult to fathom—just as it’s hard to understand what’s so great <br/>\nabout golf if you have never played it.<br/>\n<br/>\n<br/>\nThe best-selling computer game ever, The Sims, which has sold 6 million <br/>\ncopies worldwide, is a simulation game (hence, The Sims) that allows <br/>\nyou to control the lives of virtual characters. The Sims must spend <br/>\nenough time on education, physical activities, hygiene, eating and <br/>\nsleeping or they get sick. Players learn that you need to work to buy <br/>\nthings, that you can earn more money if you spend time on personal <br/>\ndevelopment and social contacts and that you get depressed if your <br/>\n“pleasure meter” is empty. That’s a far cry from a round of Parcheesi.<br/>\n<br/>\n<br/>\nGames are interesting because they’re difficult. That is the essential <br/>\nmessage the world of game culture offers to education: Learning is fun <br/>\nwhen it’s intellectually stimulating. James Paul Gee, a professor of <br/>\neducational learning sciences at the University of Wisconsin as well as <br/>\na fervent gamer and author of What Video Games Have to Teach Us About <br/>\nLearning and Literacy, explains it this way: “The game industry is <br/>\nselling products that are complex and hard to master, and take a lot of <br/>\ntime to master. The fact that people are buying them contradicts the <br/>\nidea that everything should be fast and easy. In fact, a game that is <br/>\ntoo easy will get criticized in reviews and will not become a success. <br/>\nA game should be challenging, fair and deep. If it’s not, it won’t <br/>\nsell.”<br/>\n<br/>\n<br/>\nThe insight that games are—in Ryland’s words—“mind-expanding” rather <br/>\nthan “mind-numbing” has not (yet) reached school curriculum developers. <br/>\nThey continue to battle apathy among young people by trying to make <br/>\nteaching materials more fun and presenting them in bite-sized bits so <br/>\nthey’re easier to digest. It doesn’t appear to be working. Kids are <br/>\nstill bored in class. Teachers shake their heads, complain about the <br/>\nzap culture and the youth of today who can’t keep their focus on <br/>\nanything, say that kids are quickly distracted and can’t sit still. But <br/>\nif you put these bored kids in front of a PlayStation, they’ll remain <br/>\nfocused for hours. What happened to the short attention spans? Where’s <br/>\nthe apathy?<br/>\n<br/>\n<br/>\nVideo games support the great gift that young people possess to learn <br/>\nby themselves. Games call on their natural need to develop themselves, <br/>\nto feel masterful and competent. When they taste that thrill of <br/>\npossibility, it can bring feelings of pleasure and pride. Anyone who <br/>\nhas played Legend of Zelda or Morrowind knows what it’s like to <br/>\ncomplete the game at last after many lengthy periods of frustration.<br/>\n<br/>\n<br/>\nIn this context, video games present a radically different vision of <br/>\neducation: kids who are able to learn by themselves. Even when schools <br/>\nfail, students actively look for ways to learn. Experts don’t need to <br/>\nimpose an education program to tap into that innate need.<br/>\n<br/>\n<br/>\nMaking History is a good example of a computer game especially <br/>\ndeveloped for education that fulfils young people’s requirements for <br/>\nquality and challenging entertainment. The game is used to teach the <br/>\nhistory of World War II. Even before our meeting in Boston, Nick <br/>\ndeKanter, co-founder and vice president of Muzzy Lane Software, throws <br/>\nout a challenge. “Does the game simplify history? Why don’t you play <br/>\nfirst and ask me later?”<br/>\n<br/>\n<br/>\nDeKanter is right. Making History: The Calm and the Storm sketches a <br/>\nsimplified image of a particular moment in human history. During the <br/>\ngame you take on the role of a head of state who leads his country <br/>\nbased on historical events and data. You have to make decisions (on <br/>\nspending, trading partners, military strategies and much more) as well <br/>\nas conduct negotiations with other government leaders. Military, <br/>\ndiplomatic and economic advisers are built into the game and prompt you <br/>\nat crucial moments. The instruction booklet is 58 pages long.<br/>\n<br/>\n<br/>\nDavid McDivitt, a history teacher at Oak Hill High School in the U.S. <br/>\nstate of Indiana, uses the game. His research shows that the students <br/>\nwho didn’t read textbooks or attend classes but played and discussed <br/>\nMaking History learned more about World War II than students in other <br/>\nclasses. Moreover, answers to essay questions in the classes <br/>\nexclusively using the game were more reflective and better reasoned.<br/>\n<br/>\n<br/>\nBut what most struck McDivitt was that his students talked about the <br/>\ngame outside the classroom. “There were conversations about game <br/>\nscenarios spilling out in the hallways, the lunch room and even after <br/>\nschool,” he notes, “with some kids coming in after 3 wanting another <br/>\nturn! Once I heard someone say: ‘Hey dude, you weren’t supposed to <br/>\ninvade my country, we had a defence agreement!’ Extracurricular <br/>\nconversations about the politics of leadership are not something I <br/>\ntypically see after reading a chapter of a textbook.<br/>\n<br/>\n<br/>\nDeKanter agrees. “A textbook is much better than a video game at <br/>\ndelivering names and dates,” he explains. “But in today’s world, data <br/>\nis available anywhere on the Internet. What’s more important now than <br/>\nlearning names and data are the skills to analyze that data and to <br/>\napply information to gain insight and make decisions. In the <br/>\nInformation Age it’s all about connecting the dots—and games are, much <br/>\nmore than books, extremely good at helping students learn this.”<br/>\n<br/>\n<br/>\nBut he is also realistic. “People learn from other people, not from <br/>\nmachines. That’s why games should never be played in a vacuum, and they <br/>\nshould never be used as a babysitter. A game needs to be introduced and <br/>\nevaluated. Have students write a paper on how they performed in the <br/>\ngame and what they learned. I don’t see games as a replacement for <br/>\ntextbooks, but as a valuable enhancement.”<br/>\n<br/>\n<br/>\nAtari founder Nolan Bushnell disagrees. He would love to set up a <br/>\nprivate school at which children learn through games. Textbooks would <br/>\nnot be used. “We don’t need books,” he says decidedly. “Sure, kids need <br/>\nto read, but not necessarily books. Books are obsolete.” The restaurant <br/>\nchain he is currently developing as part of his new company uWink (see <br/>\n“Playing together,” page XX) could be a good model for his school; <br/>\nthere, small groups sit around tables playing stimulating games <br/>\nsurrounded by walls onto which facts and data are projected.<br/>\n<br/>\n<br/>\nBut won’t educational games always lose out to their commercial <br/>\nequivalents purely focused on entertainment? “That’s not the <br/>\ncompetition here,” Bushnell replies. “Educational games are competing <br/>\nagainst the boring teacher in the front of the class who is just not <br/>\ncapable of engaging his students.”<br/>\n<br/>\n<br/>\nThe resistance to games shows all the signs of a ritual conflict <br/>\nbetween generations. At one time, rock ’n’ roll was thought to have a <br/>\nclearly negative influence: Parents, preachers and politicians thought <br/>\nit changed young people into—according to one U.S. preacher—“devil <br/>\nworshippers” who defied both the law and common decency. Further back, <br/>\njazz and even the waltz were criticized as corrupting influences, as <br/>\nwere novels, comic books and movies—all said to dull the minds of young <br/>\npeople. In retrospect, I think we can all agree those influences <br/>\nweren’t so bad.<br/>\n<br/>\n<br/>\nMore to the point, we currently consider books a higher form of <br/>\nculture, but one of history’s most eminent philosophers, Socrates, was <br/>\na declared opponent of reading. Books would render people forgetful, he <br/>\nclaimed. According to Plato’s Phaedrus, Socrates believed you shouldn’t <br/>\neven write down a speech because the written word always provides “one <br/>\nunvarying answer.” This recently led The Economist to suggest that <br/>\nSocrates was criticizing books’ lack of interactivity and that if alive <br/>\ntoday he might be a champion of video games.<br/>\n<br/>\n<br/>\nIt is evident that digital culture has society ever more firmly in its <br/>\ngrasp. It is clear that computers and the Internet are creating endless <br/>\nnew opportunities. And it is inevitable that this powerful cultural <br/>\ninfluence won’t stop at the classroom door. Standard classroom <br/>\nteaching, from which Tim Rylands’ students momentarily escape when Myst <br/>\nis played, would appear to be better suited to a time when young people <br/>\nwere being prepared to work in an economy based on factories and mass <br/>\nproduction. <br/>\n<br/>\n<br/>\nIt doesn’t take a lot of insight to recognize that the modern economy <br/>\nrequires very different talents—talents that may not be fully developed <br/>\nusing traditional textbooks. The advance of video games into classroom <br/>\neducation, therefore, is not only unavoidable; it is necessary.</div>","specialLinks":[]}],"prevTopicId":33505,"nextTopicId":33504}}