{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":242246858,"authorName":"dscme98","from":"&quot;dscme98&quot; &lt;healthyjourney@...&gt;","profile":"dscme98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Introducing myself","postDate":"1237874011","msgId":39040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxOXNncitxYjRvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxNmtkdStxaXZlQGVHcm91cHMuY29tPg=="},"prevInTopic":39014,"nextInTopic":0,"prevInTime":39039,"nextInTime":39041,"topicId":10457,"numMessagesInTopic":0,"msgSnippet":"Hi Meredith, Thank you for the welcome, and the ideas, my son has already settled down a bit, he is still wanting to do the marbles plan, but has calmed about","messageBody":"<div id=\"ygrps-yiv-1638868697\">Hi Meredith, <br/>\nThank you for the welcome, and the ideas, my son has already settled down a bit, he is still wanting to do the marbles plan, but has calmed about it a bit and has begun to show a bit of interest in other things as well, mostly though he is spending a lot of time doing nothing... <br/>\nOne thing that is a bit of concern is his defiant attitude, it is almost as if he is on some power trip, he continually tells us &quot;no&quot;, &quot;I don&#39;t have to&quot; &quot;you can&#39;t make me&quot; he has a total disreguard for the basic family rules... speak nice, no hitting, ect... is this normal... should I be concerned or will this fade with time? <br/>\n<br/>\nThanks again, <br/>\nDiana</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Introducing myself","postDate":"1237767422","msgId":39014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxNmtkdStxaXZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxMjVwMitucjFwQGVHcm91cHMuY29tPg=="},"prevInTopic":39005,"nextInTopic":39040,"prevInTime":39013,"nextInTime":39015,"topicId":10457,"numMessagesInTopic":0,"msgSnippet":"Welcome, Diana! I m Meredith, mom to Mo 7, who s been always unschooled, and also stepmom to Ray who is 15 and has only been living and unschooling with us","messageBody":"<div id=\"ygrps-yiv-463425754\">Welcome, Diana! I&#39;m Meredith, mom to Mo 7, who&#39;s been &quot;always&quot; unschooled, and also stepmom to Ray who is 15 and has only been living and unschooling with us for two and a half years.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He has been thinking, planning and talking about his plan all day long, being released from the constraints of learning from a book has given me my child back and given my child his life back!! <br/>\n&gt; I even saw his smile today :-)<br/>\n<br/>\n </span></blockquote>That&#39;s wonderful. Ray&#39;s whole first week &quot;free&quot; he was head over heels with giddy delight. That&#39;s tempered a good bit, naturally, but he&#39;s still a much much happier person than he ever was in school. In fact, just last weekend we went on a campout with a whole pack of unschooling families, many with teens, and I was really struck by how joyful they all were. I don&#39;t mean they were giggling like four year olds or something, but they weren&#39;t the sullen, angry people that so many teens are. It really makes a Huge difference.<br/>\n<br/>\nIts exciting that both your kids are diving into plans whole-hog (as they say in my neck of the woods). Don&#39;t worry if that tapers off, or even disappears for awhile - and don&#39;t let *them* worry if their enthusiasm dwindles, either. Its normal for people of all ages to have cycles of greater and lesser intensity. Its also normal for teens, especially, to go through periods of introspection and quiet. In fact, given the kinds of pressures school can exert, it would be a good idea to actively create some opportunities for them to do some serious relaxation. <br/>\n<br/>\nTake some time to do fun things together - go hiking or fishing or visit a museum just for the sake of hanging out together. Rent a bunch of movies and spend a day curled up on the couch. Buy some jigsaw puzzles. Whatever sort of &quot;relaxation&quot; works well for your kids and family. <br/>\n<br/>\nLet your kids know that they don&#39;t have to have it all &quot;figured out&quot; by the time they&#39;re 18 - that&#39;s one of the insidious messages school sends. Its stressful. They don&#39;t have to figure out what they&#39;re going to do with &quot;the rest of their lives&quot; - not at 18, or 28, or 58.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":242246858,"authorName":"dscme98","from":"&quot;dscme98&quot; &lt;healthyjourney@...&gt;","profile":"dscme98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Introducing myself","postDate":"1237621346","msgId":39005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxMjVwMitucjFwQGVHcm91cHMuY29tPg=="},"prevInTopic":38950,"nextInTopic":39014,"prevInTime":39004,"nextInTime":39006,"topicId":10457,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I am Diana, my husband and I have 2 children Sarah (15) and Brian (14) we also have 1 dog (Buster), 1 cat (baby) and 2 shetland ponies (Bonnie and","messageBody":"<div id=\"ygrps-yiv-1970629007\">Hi everyone, <br/>\nI am Diana, my husband and I have 2 children Sarah (15) and Brian (14) we also have 1 dog (Buster), 1 cat (baby) and 2 shetland ponies (Bonnie and Delight) <br/>\nWhen Daughter was 3 I decided that rather than put her in a preschool we would do preschool at home, by the time she turned 5 I let the world and my inner critic convince me that I was not capable of schooling my children and that the best place for them to learn was in a public school... my children and I have been banging out heads against a brick wall ever sence! I did pull my kids out for 1 year of homeschool, but ended up putting them back in the next year. <br/>\nFive weeks ago I finally found the courage to begin to listen to and trust what my kids were saying, I pulled them out of school and started traditional homeschooling... a week ago we let go of that as well and started on our unschooling journey...<br/>\n<br/>\n24 hours I can not believe how excited my son is!! <br/>\nWe talked today and set a plan in motion to start this new adventure, the goal is to make and sell glass marbles, tomorrow we will go get the supplies needed to start making clay marbles, set up a website to keep track of progress, set up an ebay sales account to sell things to earn money for a shed that he is going to build in our back yard to use as a workshop, purchase all the supplies needed to make glass marbles and then move on to making a glass yo-yo! For a kid with aspergers syndrome who walks around the house eating his dinner because he can&#39;t focus on eating or sitting that long, he totally blew me away today when he announced that he figured it would take a good 2 years after he got the equipment to make the marbles, before he would be experianced enough to make the one he wanted. (he saw a picture of it today, totally awesome with a dragon in the middle) he has even arranged to sell one to one of his friends.<br/>\nHe has been thinking, planning and talking about his plan all day long, being released from the constraints of learning from a book has given me my child back and given my child his life back!! <br/>\nI even saw his smile today :-)<br/>\nMy daughter is excited as well, she wants to be a horse trainer and now she can focus on that full time, rather than &quot;on learning what she needs to know to pass a state test so that she can graduate and recieve a diploma that in the long run means nothing anyway&quot; her words, I agree:-) <br/>\n<br/>\nWow, I did not intend for this introduction to be so long, anyway I am so glad to be here and to get to know you all. <br/>\n<br/>\nDiana C</div>","specialLinks":[]},{"userId":329923860,"authorName":"Vanessa","from":"&quot;Vanessa&quot; &lt;vanessalowe@...&gt;","profile":"vlo4827","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Introducing myself","postDate":"1237273480","msgId":38950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdwbmkyOCtsMXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":10466,"nextInTopic":39005,"prevInTime":38949,"nextInTime":38951,"topicId":10457,"numMessagesInTopic":0,"msgSnippet":"Hello, I d like to introduce myself.  My name is Vanessa and I have 3 children 9 yr old daughter, 23 month old son, and 6 month old daughter.  We just started","messageBody":"<div id=\"ygrps-yiv-1261428980\">Hello, <br/>\n  I&#39;d like to introduce myself.  My name is Vanessa and I have 3 children 9 yr old daughter, 23 month old son, and 6 month old daughter.  We just started unschooling Halloween 2007.  Before that we were a part of the public school system.  Homeschool let alone unschooling was something that I stumbled upon last year and I&#39;m very greatful that I did.  <br/>\n<br/>\nI love my children and I&#39;m so glad I get an opportunity to see them as the learners they are. <br/>\n<br/>\nVanessa</div>","specialLinks":[]},{"userId":233219230,"authorName":"Homeschlfor2@aol.com","from":"Homeschlfor2@...","profile":"chrissysspoiled","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Introducing myself","postDate":"1141659107","msgId":10466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyLjY2NjAwMGZkLjMxM2RhZmUzQGFvbC5jb20+"},"prevInTopic":10463,"nextInTopic":38950,"prevInTime":10465,"nextInTime":10467,"topicId":10457,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/5/2006 10:22:16 P.M. Central Standard Time, zenmomma@comcast.net writes: (This is John Holt s 1981 book as revised and updated by Patrick","messageBody":"<div id=\"ygrps-yiv-1584543241\">In a message dated 3/5/2006 10:22:16 P.M. Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zenmomma@...\">zenmomma@...</a> writes:<br/>\n<br/>\n(This is  <br/>\nJohn Holt&#39;s 1981 book as revised and updated by Patrick  Farenga<br/>\n<br/>\n<br/>\nI just had to share  we have a conference coming up this weekend and  Im <br/>\nattending one of his workshops I cant WAIT!!!!<br/>\n <br/>\nChrissy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Introducing myself","postDate":"1141617891","msgId":10463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMDYyMDA2MDQwNC4xNjM0OC40NDBCQjRFMzAwMDdGQTU2MDAwMDNGREMyMjA1ODg5MTE2MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":10457,"nextInTopic":10466,"prevInTime":10462,"nextInTime":10464,"topicId":10457,"numMessagesInTopic":0,"msgSnippet":"Welcome Sarah. I have a son named Conor. :o) ... Here s Pam Sorooshian s reading list. Moving a Puddle, and other essays by Sandra Dodd www.","messageBody":"<div id=\"ygrps-yiv-17398805\">Welcome Sarah. I have a son named Conor. :o)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;if you have any books to reccomend I&#39;d love to keep right on reading...&gt;&gt;<br/>\n<br/>\n </span></blockquote>Here&#39;s Pam Sorooshian&#39;s reading list. <br/>\n<br/>\nMoving a Puddle, and other essays by Sandra Dodd <br/>\nwww. Sandradodd.com/puddlebook<br/>\nEssays on learning in a home without school, on living respectfully <br/>\nwith children and of creating a nest in which learning flourishes.<br/>\n<br/>\nParenting a Free Child by Rue Kream &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechild.info/\">http://www.freechild.info/</a>&gt;<br/>\n<br/>\nThe Unschooling Handbook : How to Use the Whole World As Your Child&#39;s  <br/>\nClassroom by Mary Griffith<br/>\n<br/>\nHomeschooling Our Children Unschooling Ourselves by Alison McKee<br/>\n<br/>\nThe Unprocessed Child: Living Without School by Valerie Fitzenreiter<br/>\n<br/>\nThe Teenage Liberation Handbook: How to Quit School and Get a Real  <br/>\nLife and Education by Grace Llewellyn<br/>\n<br/>\nReal Lives: Eleven Teenagers Who Don&#39;t Go to School Tell Their Own  <br/>\nStories by Grace Llewellyn<br/>\n<br/>\nDeschooling Our Lives by Matt Hern<br/>\n<br/>\nChild&#39;s Work: Taking Children&#39;s Choices Seriously by Nancy Wallace<br/>\n<br/>\nBetter Than School: One Family&#39;s Declaration of Independence by Nancy  <br/>\nWallace<br/>\n<br/>\nI Learn Better by Teaching Myself and Still Teaching Ourselves by Agnes Leistico<br/>\n<br/>\nThe Homeschooling Book of Answers : The 101 Most Important Questions  <br/>\nAnswered by Homeschooling&#39;s Most Respected Voices (Prima Home  <br/>\nLearning Library) by Linda Dobson<br/>\n<br/>\nThe Art of Education by Linda Dobson<br/>\n<br/>\n<br/>\nHomeschooling: A Patchwork of Days: Share a Day With 30 Homeschooling  <br/>\nFamilies by Nancy Lande<br/>\n<br/>\nFundamentals of Homeschooling: Notes on Successful Family Living by  <br/>\nAnn Lahrson-Fisher<br/>\n<br/>\nTrust the Children: A Manual and Activity Guide for Homeschooling and  <br/>\nAlternative Learning by Anna Kealoha<br/>\n<br/>\nHomeschooling for Excellence by David Colfax, Micki Colfax<br/>\n<br/>\nHard Times in Paradise: An American Family&#39;s Struggle to Carve Out a  <br/>\nHomestead in California&#39;s Redwood Mountains by David Colfax, Micki  <br/>\nColfax<br/>\n<br/>\nHave Fun. Learn Stuff. Grow. : Homeschooling and the Curriculum of  <br/>\nLove by David H. Albert<br/>\n<br/>\nAnd the Skylark Sings with Me - Adventures in Homeschooling and  <br/>\nCommunity-Based Education by David H. Albert<br/>\n<br/>\nHomeschooling and the Voyage of Self-Discovery by David H. Albert<br/>\n<br/>\n<br/>\nPLUS the following books are by John Holt. I&#39;d start with the most  <br/>\nrecent ones - he changed his mind through the years as he gave up on  <br/>\nschool reform and began to increasingly understand what children  <br/>\nliving in freedom were truly capable of.<br/>\n<br/>\nHow Children Fail, 1964<br/>\nHow Children Learn, 1967<br/>\nThe Underachieving School, 1969<br/>\nWhat Do I Do Monday? 1970<br/>\nFreedom and Beyond, 1972<br/>\nEscape from Childhood: The Needs and Rights of Children, 1975<br/>\nInstead of Education: Ways to Help People Do Things Better, 1976<br/>\nNever Too late: My Musical Life Story, 1978<br/>\nTeach Your Own: A Hopeful Path for Education, 1981<br/>\nTeach Your Own: The John Holt Book of Homeschooling, 2003 (This is <br/>\nJohn Holt&#39;s 1981 book as revised and updated by Patrick Farenga.)<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: &quot;Sarah Dickinson&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yahoo@...\">yahoo@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246186758,"authorName":"Sarah Dickinson","from":"&quot;Sarah Dickinson&quot; &lt;yahoo@...&gt;","profile":"sarah_bighter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Introducing myself","postDate":"1141600292","msgId":10457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5MDZiZjlkMDYwMzA1MTUxMWk0Yzc4ZTE3Y2thYjUxMzIwZWMwYTgwZjExQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":10463,"prevInTime":10456,"nextInTime":10458,"topicId":10457,"numMessagesInTopic":0,"msgSnippet":"Hi, I just wanted to introduce myself - I ve just joined this list and have been reading some of your posts with interest so I thought I d be polite and not ","messageBody":"<div id=\"ygrps-yiv-1370491772\">Hi,<br/>\n<br/>\nI just wanted to introduce myself - I&#39;ve just joined this list and have been<br/>\nreading some of your posts with interest so I thought I&#39;d be polite and not<br/>\njust lurk!<br/>\n<br/>\nMy name is Sarah and I live in Northern Ireland - on the North Coast, with<br/>\nmy husband Conchúr (pronounced Connor) and son Jack.  Jack is only nine<br/>\nmonths old but I&#39;ve been reading alot since he was born (mostly walking<br/>\naround the room!).  We both work from home, running our own business - IT,<br/>\ndatabases and so on...<br/>\n<br/>\nHaving spent far too much time in formal eduation myself I&#39;m a compulsive<br/>\nresearcher so I&#39;ve consumed a ludicrous number of articles, books, messages<br/>\nand websites.  Reading on Attachment Parenting led me on to thinking about<br/>\nhome-schooling and from there I found John Holt&#39;s &quot;Instead of Education&quot;,<br/>\nwhich completely blew me away.  What an amazing and inspiring book!  I<br/>\nhonestly don&#39;t know how you could read it and then send your child to<br/>\nschool, if you had any other option at all!  That book led me to look for,<br/>\nand find you lot!<br/>\n<br/>\nAnyway, I look forward to getting to know you all - if you have any books to<br/>\nreccomend I&#39;d love to keep right on reading...<br/>\n<br/>\nSarah<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39035,"nextTopicId":38996}}