{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"keeping the peace","postDate":"1091290563","msgId":2400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzMxLjA5MTY0My41Njg0LjE0MDc2MkB3ZWJtYWlsMTgubnljLnVudGQuY29tPg=="},"prevInTopic":2397,"nextInTopic":0,"prevInTime":2399,"nextInTime":2401,"topicId":2362,"numMessagesInTopic":0,"msgSnippet":"Thanks, Ren, for giving me some language for that situation that she responded to so well and that felt empowering to me.... Wow, glad that worked out so","messageBody":"<div id=\"ygrps-yiv-1238567839\">&quot;Thanks, Ren, for giving me some language for that situation that she<br/>\nresponded to so well and that felt empowering to me....&quot;<br/>\n<br/>\nWow, glad that worked out so well.<br/>\nThe language I wrote in that post was something I&#39;ve used for the older kids usually. With the youngers, I tend to be a bit more straightforward &quot;I don&#39;t like the way you&#39;re talking to me, I can help you better if you just talk instead of _____________&quot;(whatever they&#39;re doing that is bothering me).<br/>\nThey all hear me talk about negative/positive energy though...so it&#39;s really all the same. I&#39;m glad she responded well to it. <br/>\n<br/>\nRen<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New Online Positive Parenting Resource","postDate":"1091280149","msgId":2397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQTUVMT0NPQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVMRkNPQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":2396,"nextInTopic":2400,"prevInTime":2396,"nextInTime":2398,"topicId":2362,"numMessagesInTopic":0,"msgSnippet":"For anyone looking for more online resources for positive parenting, I just found out about a new group called AP Discipline that seems fabulous. Here is a","messageBody":"<div id=\"ygrps-yiv-1397404970\">For anyone looking for more online resources for positive parenting, I just<br/>\nfound out about a new group called &quot;AP Discipline&quot; that seems fabulous.<br/>\nHere is a description followed by the link to join.<br/>\n<br/>\n<br/>\n&quot;Many families begin parenting with an belief in AP tools and values and<br/>\nyet, over time, as children become more independent, sometimes the parents<br/>\nfeel at a loss, often reacting in ways that are not respectful or nurturing<br/>\nbecause they feel they have no options. We have created a supportive<br/>\ncommunity to explore our options and raise our children- of any age-<br/>\nconsistently with the values we have expressed in attachment parenting in<br/>\nearly childhood.<br/>\n<br/>\nThis group focuses on the area of discipline (from an AP perspective). It is<br/>\nnot a general discussion group for other AP related issues like nursing,<br/>\nco-sleeping etc- unless those topics overlap in regard to our focus topic.<br/>\n<br/>\n&quot;Positive Discipline&quot; is one of the 8 ideals of Attachment Parenting (see<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.attachmentparenting.org/idealdisc.shtml)\">http://www.attachmentparenting.org/idealdisc.shtml)</a>.  Positive, non-violent<br/>\nmethods of discipline and loving guidance promote the development of<br/>\nself-control and empathy towards others. The word &quot;discipline&quot; means to<br/>\nteach.<br/>\n<br/>\nThe term &quot;Positive Discipline&quot; describes a wide range of philosophies, and<br/>\nwe draw from many of those (e.g., the work of Jane Nelsen, Becky Bailey,<br/>\nLawrence Cohen, Thomas Gordon, and Marshall Rosenberg).  All of these share<br/>\na focus on respectful, non-punitive discipline with a connection-based<br/>\nmodel, as opposed to a behavioral training model in their approach to<br/>\nchildren&#39;s behavior.  (As an interesting side note, although Dr. Sears<br/>\ncoined the term Attachment Parenting, his book, &quot;The Discipline Book&quot;, is<br/>\nonly partially positive and has punitive parts to it, so that is not one of<br/>\nour base philosophies).<br/>\n<br/>\nOur goal is to develop and maintain a strong, healthy connection with our<br/>\nchildren as our basis for discipline. Therefore, this list supports only<br/>\nnon-punitive discipline tools.  Punishment is defined as &quot;Any pain,<br/>\nsuffering, or loss inflicted on a person because of a crime or offense.&quot;<br/>\nInflicting or threatening to inflict these is punitive. We do not believe in<br/>\nhitting or spanking children, contrived consequences, or forced isolation.<br/>\n<br/>\nMost of us have reflexively used some form of punitive discipline when we<br/>\nare low on resources.  We are all on this learning path together.  However,<br/>\nwe do not believe punitive discipline is an ideal way to parent effectively,<br/>\nand justification or proposing of these methods will not be tolerated.&quot;<br/>\n<br/>\nTo join, go to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AP-Discipline/\">http://groups.yahoo.com/group/AP-Discipline/</a><br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] keeping the peace","postDate":"1091210078","msgId":2396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVMRkNPQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDIwMDQwNzI4LjA3MzU0MS4xNTc0Ny4xMDQ3MzlAd2VibWFpbDEwLm55Yy51bnRkLmNvbT4="},"prevInTopic":2362,"nextInTopic":2397,"prevInTime":2395,"nextInTime":2397,"topicId":2362,"numMessagesInTopic":0,"msgSnippet":"Ren wrote: I might say you re bringing a lot of negativity into this room and I don t like it, do you want to go talk? or Are you hungry/tired/frustrated","messageBody":"<div id=\"ygrps-yiv-1316573843\">Ren wrote:<br/>\n<br/>\n&quot;I might say &quot;you&#39;re bringing a lot of negativity into this room and I don&#39;t<br/>\nlike it, do you want to go talk?&quot; or &quot;Are you hungry/tired/frustrated about<br/>\nsomething?&quot; and so on....<br/>\nI try to help them pinpoint where anger or other emotions are coming from,<br/>\nso they can better read themselves.&quot;<br/>\n<br/>\nI liked this language a lot and tried something like it yesterday with my<br/>\njust turning 5 year old niece and it worked SO well.  My dd, niece and I<br/>\nwere playing a card game (Dr. Seuss &quot;The Lorax&quot; game) and my niece was<br/>\nstarting to pout and whine and groan about every card she picked up that she<br/>\ndidn&#39;t like and also the outcome of the games.  I asked if she was feeling<br/>\nfrustrated at the way it was going, she said yes, I empathized for a bit<br/>\nsaying &quot;yes, it&#39;s frustrating when you play win/lose games ...&quot; etc.  I<br/>\nsuggested that she could ask her cousin to play the game differently<br/>\n(cooperatively) for a change, she could ask for different rules, she could<br/>\nask for us to play a different game, she could take a break and go play with<br/>\nher other cousin, my son, for a bit ... She insisted, still in that whining,<br/>\npetulant way, that she wanted to keep on sitting there playing this game.  I<br/>\ntold her &quot;Okay, but the way that you&#39;re talking and acting is bringing a lot<br/>\nof negative energy into this space and I don&#39;t like it.  It&#39;s no fun for me<br/>\nto play with someone who is acting this way.  I need you to find a way to<br/>\nget rid of the negative energy and bring some positive energy to what you<br/>\nwant to do.&quot;  And she did!  And when she got frustrated later on, she<br/>\nself-selected out to go sit with my son for a bit in the other room and came<br/>\nback a bit later all by herself with more positive energy.<br/>\n<br/>\nThanks, Ren, for giving me some language for that situation that she<br/>\nresponded to so well and that felt empowering to me....<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"keeping the peace","postDate":"1091025298","msgId":2362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzI4LjA3MzU0MS4xNTc0Ny4xMDQ3MzlAd2VibWFpbDEwLm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":2396,"prevInTime":2361,"nextInTime":2363,"topicId":2362,"numMessagesInTopic":0,"msgSnippet":"For me, it s a one time deal. I mean: don t do it again PERIOD. Do your children understand what you re saying? I don t mean stop just this time and next time","messageBody":"<div id=\"ygrps-yiv-316430401\">&quot;For me, it&#39;s a one time deal. I mean: don&#39;t do it again PERIOD. Do your  <br/>\nchildren understand what you&#39;re saying? I don&#39;t mean stop just this time and  <br/>\nnext <br/>\ntime it&#39;s fine. I mean stop being mean to your sibling forever!&quot;<br/>\n<br/>\nI agree. Although the patterns that siblings display, won&#39;t stop after saying stop one time, they need to know you won&#39;t accept meanness to anyone in the household...EVER.<br/>\nIf there is meanness, I sit down with the two children having the problem and let them each tell me what is going on. They need to be heard, sometimes away from each other so the other sibling won&#39;t interrupt. After that, I try to point out how it could have been handled better....like Trevor getting frustrated with Jared and calling him a name. I accept that he is annoyed, but I don&#39;t accept that he couldn&#39;t find a better way to handle his frustration.<br/>\n<br/>\nWe talk a lot about putting positive energy out into the universe around here. I tell them there is enough negative energy and we all need to work at filling the world with positive stuff. When someone is being cranky and bringing us all down, I might say &quot;you&#39;re bringing a lot of negativity into this room and I don&#39;t like it, do you want to go talk?&quot; or &quot;Are you hungry/tired/frustrated about something?&quot; and so on....<br/>\nI try to help them pinpoint where anger or other emotions are coming from, so they can better read themselves. It takes years of guidance to help some kids understand their own triggers better, but it works. I&#39;ve noticed that when I start talking about how badly someone&#39;s feelings got hurt by his actions, Trevor is way more likely to soften up and apologize now. He&#39;s had a lot of anger issues (some were due to our separation a few years ago) and it&#39;s taken a LONG time to help him try and deal with frustration in a more positive manner.<br/>\n<br/>\nAs to the Mom with toddler difficulties:<br/>\nWith younger children, I like using distractions. When you know two children are problematic together, you either have to be very, very present (difficult with a new baby in the house) or find things they like doing where they aren&#39;t too close physically. If the two year old wants something the four year old has, let them know you&#39;ll help them get one at the store, but try to find a distraction in the mean time. Whipped cream or shaving cream sprayed on the table is a great one.<br/>\nKeeping some new dollar store toys hidden away, to be pulled out during tense moments is another I use.<br/>\nInteresting foods, music or games are all useful in getting them involved in something where they are interacting with you rather than each other. If you&#39;re doing some tactile thing, couldn&#39;t they sit on opposite sides of the table?<br/>\nI think preventing the problems is your best bet right now, they are obviously having a hard time dealing with each other. And they&#39;re both socially immature (I don&#39;t mean for their age, I just mean toddlers are in general) and need a lot of adult intervention right now.<br/>\n<br/>\nIt&#39;s hard and I sympatize. Try not to feel overly stressed when they do start yelling, it&#39;s part of their development to handle social problems poorly and need a lot of help. Try to see it as a stage...that&#39;s all it is. A stage where they need you a lot, but a temporary stage.<br/>\nI bet by the time your two year old is close to 4, they&#39;ll be playing a lot better together. Jalen is finally becoming a lot more fun for the older kids, and more capable of listening when they say &quot;stop&quot;. He&#39;s 3.5 and FULL of energy.<br/>\n<br/>\nAnd I totally agree about the dynamics of four or more children!! Mine all have almost four years between them, so we have a HUGE spread of interests and needs...sometimes it&#39;s a challenge to meet all of them. Luckily, my dh is more available than most Dads and very into being a gentle parent. <br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]}],"prevTopicId":2398,"nextTopicId":2414}}