{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Myth #3 Mom Needs to be a Teacher","postDate":"1285615008","msgId":44889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDJDOEZBQTdEQzZENS1FNDQtQzdGQHdlYm1haWwtbTAzNy5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44888,"nextInTime":44890,"topicId":44889,"numMessagesInTopic":0,"msgSnippet":"And another ~Kelly Kelly Lovejoy There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our","messageBody":"<div id=\"ygrps-yiv-1498683936\">And another<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\nHomeschooling Myth #3: Mom Needs to Be a Teacher<br/>\n<br/>\nwere  usually  under  the  spell  of  this  myth,  too.  Our  conditioning  led  us  to<br/>\nbelieve  we  had  to  don  yet  another  hat  and  stand  at  the  head  of  the  class<br/>\npouring forth facts, acting as we presumed teachers are supposed to act.<br/>\nThere  are  two  misconceptions  rolled  into  this  one  myth.  The  first  and<br/>\nmost  obvious  is  you  have  already  spent  years  filling  the  role  of  teacher<br/>\nunder the label of parent. With every interaction with your child during her<br/>\nfirst  five  years  of  life  you  teach  her  with  your  words,  your  actions,  your<br/>\nexamples.  With  your  guidance  she  learned  how  to  walk,  talk,  throw  and<br/>\ncatch  a  ball,  ride  a  bike,  drink  from  a  cup,  kiss  good-night.  These  feats<br/>\ndidn’t  require  a  different  hat;  they  required  your  commitment,  your  love,<br/>\nand your trust that when she was ready your child would accomplish all of<br/>\nthese and more. Consider just one of these accomplishments. Let’s take the<br/>\nincredibly  complex  action  of  talking  and  making  sense  of  sounds  as  they<br/>\nbecome  meaningful  communication.  You  didn’t  have  a  text  book  (or<br/>\naccompanying  teacher’s  manual).  You  didn’t  break  the  subject  of  speech<br/>\ninto  minute  sections  and  drill  her  endlessly  on  each  piece.  You  simply<br/>\nspoke with her, encouraging her babbling each time you replied and smiled<br/>\nand hugged her.<br/>\nShe  listened. She  experimented.  She  happily  drooled  while  rolling  and<br/>\nteasing  her  tongue  into  new  positions  until  that  momentous  day  she<br/>\nstumbled upon “Dada.”<br/>\nDid  you  look at  her  with scorn and say, “The proper way to pronounce<br/>\nyour father’s name is Dad (points off for adding an A at the end) or Daddy<br/>\n(go  back  and  say  it  fifty  times  with  a  Y)?”  You,  as  parent/teacher,  giddy<br/>\nwith happiness in what she did accomplish, showed her through your love<br/>\nand  approval  that  she  was  on  the  right  track.  Her  inner  motivation<br/>\ncompelled her; your attention guided her. She learned.<br/>\nThe  method  you  use  as  parent  in  your  child’s  first  five  years  is  nature’s<br/>\nway.  Your sustained relationship  in an atmosphere  of safety and trust and<br/>\nacceptance  is  the  essence  of  education  as  art.  The  “information”  doesn’t<br/>\ncome  from  you,  it  flows  through  you,  through  your  conscious  and<br/>\nsubconscious  messages;  the  tone  of  your  voice,  your  face,  your  body<br/>\nlanguage, your deeds. The “learning” isn’t done to your baby, it comes from<br/>\nher.  It’s  when  we  go  against  that nature  that  mankind  gets  in  trouble.  As<br/>\nthey are set up now, schools work against nature. You don’t have to.<br/>\nThrow the teacher’s  hat away. The  hat you are already  wearing fits  you<br/>\njust fine. And it’s beautiful.<br/>\nThe  second  misconception  associated  with  this  myth  about<br/>\nhomeschooling is that even if you choose to follow public school’s method,<br/>\nteaching  is  not  as  difficult  a  task  as  all  the  college  years,  certificates,  and<br/>\nteachers  unions  would  lead  you  to  conclude  it  is.  Remember,  you  begin<br/>\nwith a more intimate knowledge of your child’s likes and dislikes, strengths<br/>\nand  weaknesses,  needs  and  personality  than  any  teacher  will  ever  glean<br/>\nabout her in a classroom filled with dozens of other children. If you need to<br/>\nchoose between three text books, for instance, you have a pretty good idea<br/>\nwhich  one  your  son  would  prefer  (better  yet,  you  can  ask  him!).  In  the<br/>\nclassroom, one book must fit all.<br/>\nIf  you’ve  never  examined  materials  provided  to  teachers  for  classroom<br/>\nuse, you’ll be surprised, perhaps shocked, at how simplistic their directions<br/>\nare.  I  attended  a  two-day  long  teachers’  seminar  sponsored,  in  part,  by  a<br/>\npublic  television  station.  Its  purpose  was  to  help  teachers  integrate  public<br/>\nTV  into  their  day.  In  each  of  the  eight  or  so  workshops,  the  trained<br/>\ninstructors spent much of the time teaching us how to press a VCR’s pause<br/>\nbutton,  showing  us  where  the  accompanying  paperwork  told  us  exactly<br/>\nwhere in the program to stop it, and what to say / ask while it was stopped.<br/>\nChoreographed  down  to  the  minute,  the  presentations  intended  for<br/>\nclassroom-use  appeared  to  my  non-teacher-trained  eyes  like  a  play<br/>\nrehearsal. Here’s the script, say this now, ask that then, push the button here<br/>\n(smile and take a bow).<br/>\n<br/>\n<br/>\n<br/>\nIn  the  workshop  on  presenting  the  function  of  skeletal  bones  to<br/>\nelementary-age  children,  my  group  received  a  box  of  popsicle  sticks<br/>\nfrom which we were to construct a three-dimensional frame. When that<br/>\nwas  complete,  we  connected  bones  for  a  paper  skeleton  with  brass<br/>\nfasteners.  After  class  I  called  home.  While  I  had  been  sitting  inside<br/>\nplaying with popsicle sticks, my three “teacherless” children were out<br/>\nin the woods in the fresh air constructing a fort which, within a short<br/>\nperiod of time, sported a roof, smoke hole, and a second story lookout<br/>\ndeck.<br/>\n<br/>\nStandardized  tests  contain  the  same  type  of  step-by-step  directions  for<br/>\nadministration,  easily  followed  by  anyone  who  can  read.  Some  states<br/>\nrequire home educators to attend a training class before giving the tests to<br/>\ntheir  children.  Before  I  attended  a  seminar  I  couldn’t  imagine  the  class<br/>\nneeding  to  last  more  than  five  minutes,  but now I  see how the  presenters<br/>\ncould fill a couple of hours. If teachers’ lessons are a community playhouse<br/>\nproduction, management techniques are full-scale Broadway productions.<br/>\nBrowsing  through  the  February,  1994  issue  of  Education  Digest  (the<br/>\nReader’s  Digest  of  the  education  world),  I  encountered  two  enlightening<br/>\narticles about classroom management.<br/>\n<br/>\n1. “When  Parents  Get  Aggressive,”  Lorna  Brooks-Bonner,  from  School<br/>\nSafety: You (teacher) have to diffuse “angry mama’s” hostility, so “a strong,<br/>\nclear, forceful voice demonstrates your concern.” “Position your body at an<br/>\nangle – keeping a distance of at least three feet.” “Keep your hands open; do<br/>\nnot make a fist.” “Do not break eye contact.” When a school counselor joins<br/>\nin  the  action  “…the  counselor  and  I  will  play  roles  of  ‘good  guy  vs.  bad<br/>\nguy.’”<br/>\nAnd you thought you went into those parent-teacher meetings prepared?<br/>\n2. “Practical Peacemaking for Educators,” Peter Martin Commanday: To<br/>\novercome their “sense of powerlessness in today’s classroom,” teachers are<br/>\nadvised “to formulate…a guide for practical behavior in school each day.”<br/>\nThe goal, we’re told, “is to win small, sequential victories.” I’m taking these<br/>\nexcerpts from Concept 3 of the six explained, and the summary.<br/>\nA student (John) has picked up a chair during words with another student.<br/>\nGet his visual attention with a comment. “Using both hands, not one, with<br/>\npalms up and fingers together, you motion toward the area [where you want<br/>\nthe chair]. Be sure that one hand is slightly in front of the other…” “Take a<br/>\nstep to the side, on a diagonal” “No longer can we assume that we will be<br/>\nable to command immediate obedience.”<br/>\n<br/>\nObviously  you  won’t  have  to  deal with  these  problems  in  your  home.  I<br/>\nshare them with you because I know you may believe the myth, and these<br/>\nare  just  two  examples  of  where  today’s  teachers  must,  of  necessity,  focus<br/>\ntheir  training  and  professionalism. You  can  spend  your  time  focused  on<br/>\ntasks important to and only related to learning.<br/>\nI  am  not  saying  there  are  not  good  teachers  out  there.  The  difference<br/>\nbetween a good and bad teacher is not which script she’s using, but whether<br/>\nor not she’s also using  her heart and  her soul. You will  naturally use  your<br/>\nheart and soul, and you can read the script. And if you’re fortunate, there<br/>\nwill  come  a  day  when  you  throw  the  script  away,  work  with  nature,  and<br/>\nenjoy learning as a process, not a show.<br/>\nThis is the art of education.<br/>\nFrom The Art of Education: Reclaiming Your Family, Community and Self by Linda Dobson (Home Education Press, 1995)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44881,"nextTopicId":44890}}