{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146075373","msgId":12493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENERjg3RTI5LTIyOUEtNEU0Mi05OEI5LUI5NDA1RUU0NTBDQ0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDI2MTYwMzIxLjg3OTUxLnFtYWlsQHdlYjM1OTE0Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNDI2MTYwMzIxLjg3OTUxLnFtYWlsQHdlYjM1OTE0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12492,"nextInTopic":12499,"prevInTime":12492,"nextInTime":12494,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... Everything here is offered to take or leave. No one s trying to tell you how to live. But I think you were looking for a support list where people can chat","messageBody":"<div id=\"ygrps-yiv-463375881\">On Apr 26, 2006, at 12:03 PM, Annette W wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and so we come back to unschoolers deciding for me<br/>\n<br/>\n </span></blockquote>Everything here is offered to take or leave.<br/>\n<br/>\nNo one&#39;s trying to tell you how to live. But I think you were looking  <br/>\nfor a support list where people can chat and share their lives and  <br/>\nunload their burdens and have others sympathize.<br/>\n<br/>\nI hope you don&#39;t leave because this is a very good list. :-) But it  <br/>\nis a discussion list rather than support list. It&#39;s a list for  <br/>\nsharing problems people have in getting closer to unschooling.  <br/>\nAnything people post about it&#39;s assumed they want help and advice  <br/>\nabout because that&#39;s how discussion lists work. :-) Discussion lists  <br/>\nare great places to get advice and new ideas and new ways of looking  <br/>\nat old problems. They aren&#39;t great places to unload stress and *just*  <br/>\nget sympathy.<br/>\n<br/>\nIt sounds like your life has been very stressful recently. I&#39;m sorry  <br/>\nfor that. If there are any things you think people *could* give you  <br/>\nnew ways to look at things, or new ideas, don&#39;t hesitate to ask.<br/>\n<br/>\nIf you need links to local unschooling support groups, people can  <br/>\npoint you in the right direction if you say where you live.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146071995","msgId":12492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDI2MTcxOTU1Ljk1MDIyLnFtYWlsQHdlYjU0NDE1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDYwNDI2MTYwMzIxLjg3OTUxLnFtYWlsQHdlYjM1OTE0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12491,"nextInTopic":12493,"prevInTime":12491,"nextInTime":12493,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... Nobody is deciding anything for you. Nobody is peeping into your house to see how you live. You chose to join this list and this list s goal is to move","messageBody":"<div id=\"ygrps-yiv-546049423\">--- Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and so we come back to unschoolers deciding for me<br/>\n&gt; <br/>\n </span></blockquote>Nobody is deciding anything for you. Nobody is peeping<br/>\ninto your house to see how you live. You chose to join<br/>\nthis list and this list&#39;s goal is to move towards<br/>\nunschooling. So anything you say on the list is going<br/>\nto be looked through the unschooling lens.<br/>\n<br/>\nI thought we were talking about how to guide our<br/>\nchildren around/thru scary movies instead of banning<br/>\nthem completely. Perhaps we should&#39;ve changed the<br/>\nsubject to Scary movies or something like that to make<br/>\nit clear that it wasn&#39;t about you at all. At least in<br/>\nmy mind it wasn&#39;t<br/>\n<br/>\nManisha<br/>\n<br/>\n <br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146071503","msgId":12491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MjYxMDExcjgyMTIwNmRpOWY4MWE2ODJkYjhjNjg0NEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDIwMDYwNDI2MTYzNzU3LjM4ODc2LnFtYWlsQHdlYjM1OTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDhDODM3MDgxRjBEMzc1My03NjgtNzA1QG1ibGstcjI3LnN5c29wcy5hb2wuY29tPgkgPDIwMDYwNDI2MTYzNzU3LjM4ODc2LnFtYWlsQHdlYjM1OTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12489,"nextInTopic":12492,"prevInTime":12490,"nextInTime":12492,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... I m sorry you feel that way.  That is not anyone s intent here at all.  I have come to find that this group poses questions to new members ina way to get","messageBody":"<div id=\"ygrps-yiv-1673345195\">On 4/26/06, Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Well good for you. I am in a new city without ANYKIND of support system.<br/>\n&gt; Every minute of the day is dedicated to be with children. I actually thought<br/>\n&gt; this group was to help and support. Not to undermine someone quest for a<br/>\n&gt; peacefull life. I have seen nothing but mean entries from some members here.<br/>\n&gt; It&#39;s actually disturbing.<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m sorry you feel that way.  That is not anyone&#39;s intent here at all.  I<br/>\nhave come to find that this group poses questions to new members ina way to<br/>\nget them to start thinking about things in a different light.  If you are<br/>\nfeelig trapped and alone then you need to find a way to feel less trapped<br/>\nand less alone.  there is a city (town, village, hamlet, whatever you live<br/>\nin) that has the support you need.  You just need to find a creative way of<br/>\nfinding it.  Look on the internet, call some of the homeschooling groups in<br/>\nyour area, hang out at the park and look for other &quot;truant&quot; kids, join a<br/>\nchurch, knitting circle, class, find La Leche League (if you are<br/>\nbreastfeeding) or other community group you have an interest in.  Explore<br/>\nsome of your interests.  You don&#39;t have to be alone!!  You don&#39;t have to<br/>\nfeel trapped.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seem that unschoolers - acomplished ones - take out all their controll<br/>\n&gt; issues on people that try to have a plan, make lists. Everything is wrong.<br/>\n&gt; There is no system, even if it works for one family that an UNSCHOOLER will<br/>\n&gt; not find a way to attack.<br/>\n<br/>\n<br/>\n </span></blockquote>Again, I am sorry you feel that way because that is NOT what I have found.<br/>\nNone of us wants to control you.  What we want to do is let you explore<br/>\nother options.  I consider myself radical unschooler and I&#39;m a list maker<br/>\nplanner!  We are planning a family vacation soon and you should see my list<br/>\n:)  I make grocery lists, lists of things I need to do each week and all<br/>\nsorts of other lists.  I like lists.  It helps me remember things that I<br/>\nwould otherwise forget.<br/>\n<br/>\nI really don&#39;t see anything that anyone has said that I would classify as an<br/>\n&quot;attack.&quot;  There is a difference between attacking something and questioning<br/>\nit.  I hope that you take some time to look at the things that some of us<br/>\nhave said, questioned and suggested and see if your prejudice (although that<br/>\nisn&#39;t the word I&#39;m wanting, but language is difficult for me today)  isn&#39;t<br/>\nkeeping you from accepting them?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":242520548,"authorName":"Annette W","from":"Annette W &lt;annette75093@...&gt;","profile":"annette75093","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146069477","msgId":12489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDI2MTYzNzU3LjM4ODc2LnFtYWlsQHdlYjM1OTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDhDODM3MDgxRjBEMzc1My03NjgtNzA1QG1ibGstcjI3LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":12487,"nextInTopic":12491,"prevInTime":12488,"nextInTime":12490,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... From: Annette W  Well I agree that I tend to overprotect my children and I m working on it. But I already sleep in the same room","messageBody":"<div id=\"ygrps-yiv-1060798951\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:    <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt;<br/>\n<br/>\n    Well I agree that I tend to overprotect my children and I&#39;m working <br/>\non it. But I<br/>\nalready sleep in the same room with my children and they know a good <br/>\nbit about<br/>\nmovie making. Scary images don&#39;t get better by knowing how they were <br/>\ngenerated.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSometimes they do. Depends on the person.<br/>\n   <br/>\n  Yeah, but I&#39;m being made out as somebody that doesn&#39;t know their children. In his case I know, he has seen a lot of things I found objectionable ( know this spelling is wrong, english is my 3rd language, can&#39;t know everything).<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nWatching a movie a few minutes at a time is no enjoyment to me.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWell,....isn&#39;t your goal to make this enjoyable for your *son*?<br/>\n   <br/>\n  No, my goal IN THIS INSTANCE was to have a couple of hours of enjoyment for myself. I know I&#39;m never gonna be as holy as you. I actually need times to myself. bad bad bad.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nIf unschooling means that I have to do everything at the pace of my <br/>\nchildren and every aspect<br/>\nof my life has to be geared towards what they want/need then I will be <br/>\nleft out of my life.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nUnschooling means you don&#39;t *have* to do anything. But if you want a <br/>\npeaceful home full of respect and trust, you may want to see that your <br/>\nlife *with* children won&#39;t look much like your life *without* children.<br/>\n   <br/>\n  What if what I want for my personnal interest is to watch scary/ gory wjhatever movies by myself and I make the time for it, or so I think and then kids walk in on me. My efforts to help them go back to sleep to keep pursuing my interest of a time awake without holding a kid, nursing a kid. Everybody here says they take a couple hours a week to do their crocheting outside of the house. Having an interest at home is not respectable?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nIf real unschoolers are able to put their interests that are not<br/>\nshared or movie watching that is not beneficial to young children or <br/>\nhaving sex<br/>\nwith their spouse on hold for several years ecause there are 3 kids in <br/>\nthe bed<br/>\nand they can&#39;t get antagonized by being asked to give the parents a <br/>\nlittle<br/>\nprivate time (we already never have any, so it&#39;s not something I have <br/>\nto turn<br/>\noff - I haven&#39;t had time alone with my husband in months).<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI&#39;m a real unschooler! &lt;g&gt;<br/>\n<br/>\nI have many interests that aren&#39;t shared by other family members. They <br/>\neach have interests that I don&#39;t share.<br/>\n<br/>\nI don&#39;t watch movies that I think wouldn&#39;t be beneficial to my young <br/>\nchild when he is around. I watched Kill Bill one night when Duncan was <br/>\nplaying a new game---he was engrossed for hours. I thik he came <br/>\ndownstairs once during. I pasued it. Hit play again when he&#39;d left. He <br/>\nasked about he movie. I said it was *very* violent. He didn&#39;t *want* to <br/>\nwatch it.<br/>\n<br/>\nI simly tell the boys that Ben and I need some alone time. They&#39;ll <br/>\nwatch a movie or play a game or do something together for a while. <br/>\nThey&#39;re now 10 and 18. they *know* what&#39;s going on, but they&#39;re kind <br/>\nenought o understand.<br/>\n<br/>\nWhen they were younger, we would get up early, move to another room, <br/>\nask a neighbor whether they could come over for a bit, have them spend <br/>\nthe night with cousins or grandparents. It&#39;s not an all or nothing <br/>\ndeal.<br/>\n<br/>\n  Well good for you. I am in a new city without ANYKIND of support system. Every minute of the day is dedicated to be with children. I actually thought this group was to help and support. Not to undermine someone quest for a peacefull life. I have seen nothing but mean entries from some members here. It&#39;s actually disturbing.<br/>\n  So, again I am sorry I even tried. We had agood thing going. Homeschooling unschooliong. Whatever you want to call it. Me and my kids and husband (when home) lead a good life with a lot of input from every family member. If I then once in a blue moon decide that I in the dead of night I&#39;d like the living room to be my spot I am being vilified, then there is a problem with radical unschooling. Because it put so much pressure on me that then will have to go some where. In order for me and my kids to keep our life in harmony with a few times where I will assert my position as non negotiable I will not try to get any deeper into unschooling. <br/>\n  It seem that unschoolers - acomplished ones - take out all their controll issues on people that try to have a plan, make lists. Everything is wrong. There is no system, even if it works for one family that an UNSCHOOLER will not find a way to attack.<br/>\n-=-=-=-<br/>\n<br/>\nSo watching a gory movie like Kill Bill is going to be no fun<br/>\n  for me if I have to watch it a few minutes at a time. In order to <br/>\nwatch that<br/>\nmovie I tried to help everybody go to sleep and stole out of the room. <br/>\nNext<br/>\nthing you know Arthur is coming into the living  room.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWell, it&#39;s not *that* fun a movie! &lt;g&gt; With or without interruptions! <br/>\n   <br/>\n  true, but I wanted to see it. ME wanting to see it is not enough reason for me to try to watch it? Other people in my house have to approve of it?<br/>\n&lt;g&gt;<br/>\n<br/>\nYou can whine or you can get creative. being sneaky---stealing out of <br/>\nthe room---is probably not the best idea. Being honest---saying that <br/>\nyou want to watch a movie that is rough and violent and that it would <br/>\nprobably scare them---would be better.<br/>\n   <br/>\n  Getting up after 2 kids are fast asleep is hardly being sneeky. Telling the 3rd one to give me some time alone is not unschooly, but the 2 other ones where in dream heaven and had no use for me.<br/>\n<br/>\nBut they won&#39;t be this little for long---it gors waaaay faster than you <br/>\nthink it will right now. You can put off these kinds of movies until <br/>\nthe kids are old enough to be out of the house for a bit.<br/>\n   <br/>\n  But I DON&#39;T WANT TO put watchiong a movie on hold until my kids are off to college (wait thats not unschooly) are of playing the guitar with buddies.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n   Is this unschool thing another way to make parents feel incompetent, <br/>\nnot<br/>\nreasonable? When my children watch Snow White for the 15th time and <br/>\nthey kick me<br/>\nout because they don&#39;t want me to see it with them then that&#39;s fine. If <br/>\nI choose<br/>\na movie to watch by myself and I make all the effort to be out of <br/>\neverybodies<br/>\nway, it&#39;s after midnight I still have to bend to what&#39;s good for him. I <br/>\nmust not<br/>\nlove my children enough.<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWHOA! WHOA! WHOA! WHOA!!!!!!<br/>\n<br/>\nYou&#39;re an adult. They are children with very fews coping skills. They <br/>\nneed time to learn how to deal with things. You&#39;re 30-something (?) and <br/>\nstill haven&#39;t? Yet you expect *them* to already be capable?????<br/>\n   <br/>\n  What do you know about my coping skills? I have coped with the New Orleans evacuation. Not on TV, I myself. 12 people in a 2 bedroom appartment  I have coped with 3 kids being uprooted, crying for their home.2 bedroom place  Loosing all their friends. I have coped with loosing my supprt system. I have coped with a city that smells like shit everwhere you turn The neighbors are all on crack or prescription drugs, the play grounds are contaminated with flood residue. So, no I have no f****ing coping skills for not watching a movie after I took all the measures possible to have that amout of time to me.<br/>\n<br/>\nI think you might need to step back and see things from a 7 year old&#39;s <br/>\npoint of view--and whatever other aged children you have.<br/>\n   <br/>\n  If I did that I would cry every night for my lost home, my lost friends. I spend all day long taking to them in a friendly voice. Being patient and trying to figura out ways for all 4 of us to have a nice day, get out a bit in the fresh air and maybe start meeting new people. At night I will soothe crying from homesick children. So there is really not stepping back any further possible at this time.<br/>\n<br/>\nIs there a reason they&#39;re kicking you out (and why would you want to <br/>\nwatch Snow White *again*?) ?? Is there a reason you *have* to watch <br/>\nsuch a movie (Kill Bill) right now?  Can&#39;t *that* wait? if not, why not?<br/>\n   <br/>\n  It can not wait. If one of my kids wants something I don&#39;t make him wait until he&#39;s 18, yet I have to wait for my interest until he&#39;s 18?<br/>\n<br/>\nThe unschooling parents I know are THE most competent and reasonable <br/>\npeople on the planet! But they didn&#39;t get there overnight. They worked <br/>\nat it---and *keep* working at it because it&#39;s important to them.<br/>\n   <br/>\n  Of course. All of you are enlightend. I am not and I am not ever going to be. No matter what I come up with for a solution that is non violent, does not include yelling or spanking. Somebody within my family will be inconvienienced for a while. That person will not be unschooled for 24 hours a day. So failure is built in. <br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Secondary school education   Graduate school education   Home school education     Graduate school education online   High school education   Chicago school education <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! Mail goes everywhere you do.  Get it on your phone.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":242520548,"authorName":"Annette W","from":"Annette W &lt;annette75093@...&gt;","profile":"annette75093","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146067401","msgId":12487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDI2MTYwMzIxLjg3OTUxLnFtYWlsQHdlYjM1OTE0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDhDODM3MDQzMTdDRDdBQi03NjgtNkFGQG1ibGstcjI3LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":12481,"nextInTopic":12489,"prevInTime":12486,"nextInTime":12488,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"and so we come back to unschoolers deciding for me ... From: Annette W  Thanks for this one. I do think it is my job to shelter him","messageBody":"<div id=\"ygrps-yiv-904753038\">and so we come back to unschoolers deciding for me<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:  <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt;<br/>\n<br/>\n    Thanks for this one. I do think it is my job to shelter him from <br/>\npsychological<br/>\nharm or scary pictures, even if it means not giving him a choice. <br/>\nArthur (7) has<br/>\nno inhibitions to watch something really gory as long as I am in the <br/>\nroom. But<br/>\nlater he&#39;ll report back that he has nightmares.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI think choice is everything.<br/>\n<br/>\nI think not providing him with enough information so that he *can* <br/>\nchoose is cruel. Just letting him watch because he says he wants to is <br/>\nnot kind when you have knowledge about it that you could share.<br/>\n<br/>\nThere are so many things you could do to help him make the best <br/>\ndecision he can. You sould check on the ScreenIt site and let him know <br/>\nwhether it might be too scary or gory or lovey-dovey. You could watch <br/>\nit withhim, pause, discuss, reassure, and fast forward. You could get <br/>\nthe bonus DVD and see how it was made---that often helps.<br/>\n<br/>\nIf he *does* watch something too scary---it&#39;s better to learn what can <br/>\ndiminish the fear than forbidding it or something similar.<br/>\n<br/>\nA lot of adults watch scary movies *in order to* be scared! &lt;g&gt; They <br/>\njust then need to figure out how to deal with the fear. They *want* it! <br/>\nBut they need to compartmentalize it. That&#39;s a good thing!<br/>\n<br/>\n-=-=-=-<br/>\n   So protecting him from scary movies, while not limiting myself only <br/>\nto Disney<br/>\nand the like is an option.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThere are plenty of movies that aren&#39;t scary AND aren&#39;t Disney! &lt;g&gt;<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! Messenger with Voice. PC-to-Phone calls for ridiculously low rates.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics]   was  Annette Intro","postDate":"1146062144","msgId":12481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDI2MTQzNTQ0LjYxMDU2LnFtYWlsQHdlYjU0NDA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA0MjUxNTIzbDc3YzYxNjA1cDVlODg0OWY0MmI5Mzc5M2ZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":12480,"nextInTopic":12487,"prevInTime":12480,"nextInTime":12482,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... Yes. And you also help them deal with the consequences instead of smugly saying I told you so . My daughter watched Scooby Doo at a friend s house and got","messageBody":"<div id=\"ygrps-yiv-1864651430\">--- Pampered Chef Michelle<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamperedmichelle@...\">pamperedmichelle@...</a>&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; The difference between<br/>\n&gt; unschooling and &quot;regular<br/>\n&gt; parenting&quot; is that with unschooling you give your<br/>\n&gt; children the information<br/>\n&gt; that they need to make a decision rather than<br/>\n&gt; deciding for them!  <br/>\n&gt;<br/>\n </span></blockquote>Yes. And you also help them deal with the consequences<br/>\ninstead of smugly saying &quot;I told you so&quot;.<br/>\n<br/>\nMy daughter watched Scooby Doo at a friend&#39;s house and<br/>\ngot scared. It was too much for her. A few weeks later<br/>\nwe were in a hotel room with cable TV and Scooby Doo<br/>\ncame on. She wanted to watch it. I reminded her that<br/>\nshe got nightmares last time, but she was convinced<br/>\nthat now things are different because now she was<br/>\nolder. Then her cousin who was there explained to her<br/>\nthat the good guys always win in the end. That made<br/>\nall the difference. She watched Scooby Doo and did not<br/>\nget nightmares.<br/>\n<br/>\nAnother incident - we were watching Princess Bride.<br/>\nBoth kids got scared and we stopped watching. A few<br/>\nmonths later some friends were visiting and all of<br/>\nthem have watched PB before and wanted to watch it<br/>\nagain. DD watched it with them  but I could tell by<br/>\nthe look on her face that she was on edge. Later she<br/>\nasked me &quot;Aren&#39;t you scared of those big rats?&quot;. I<br/>\nexplained to her that they&#39;re supposed to be scary. I<br/>\nget scared and then go phew! because everyone is safe.<br/>\nI think that has made her see it in a different light.<br/>\n<br/>\nThen there is stuff that I can&#39;t handle. My kids<br/>\nwatched Inspector Gadget. There were scenes in the<br/>\nfirst part of the movie where I had to leave,<br/>\nespecially because I was eating dinner! But it didn&#39;t<br/>\nbother my kids at all.<br/>\n<br/>\nManisha<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Everyone/Needback","postDate":"1146060492","msgId":12480,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBQzE3RkQ5LTdBQjctNDVDOS1BOTc3LTU4MDBCMzU0MjYxNEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDI2MDIxMDI2Ljk4MjAucW1haWxAd2ViMzczMDUubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDIwMDYwNDI2MDIxMDI2Ljk4MjAucW1haWxAd2ViMzczMDUubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":12476,"nextInTopic":12481,"prevInTime":12479,"nextInTime":12481,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... One person s post can be read as dogmatic by one and as clarity by another and just plain confusing by another. Which is why lists are great! Lots of","messageBody":"<div id=\"ygrps-yiv-952722274\">On Apr 25, 2006, at 10:10 PM, Sandy Deby wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that once again in all of this there is no right or wrong  <br/>\n&gt; and I did feel with one point that an email seemed slightly dogmatic.<br/>\n<br/>\n </span></blockquote>  One person&#39;s post can be read as dogmatic by one and as clarity by  <br/>\nanother and just plain confusing by another. Which is why lists are  <br/>\ngreat! Lots of people can same the same thing in different ways that  <br/>\nwill reach different people. :-)<br/>\n<br/>\nAnd I feel very strongly that there is right and wrong. Hurting a  <br/>\nchild is wrong. Neglecting a pet is wrong. Posting &quot;I don&#39;t want to  <br/>\ndo that and you can&#39;t make me,&quot; to a discussion list is wrong ;-)  <br/>\n(It&#39;s better -- because it doesn&#39;t waste posters and readers time --  <br/>\nto post about things people *do* want to change. :-)<br/>\n<br/>\nI think the principles of unschooling are universally right. That  <br/>\ndoesn&#39;t mean I&#39;m going to go out and hold people down on the street  <br/>\nand make them accept my principles ;-) It does mean when someone  <br/>\njoins a list *to get help moving towards unschooling* I won&#39;t  <br/>\nhesitate to point out what&#39;s getting in their way. It&#39;s what they  <br/>\nimply they want by signing onto a list like this one that says &quot;this  <br/>\nis a place for you to discuss,question, ponder and become deeply  <br/>\nfamiliar with natural learning and how it affects our entire lives.&quot;<br/>\n<br/>\nBut if anyone can&#39;t read my words without hearing dogma, feel free to  <br/>\ndelete. I&#39;m not in the least insulted! :-) I often write to clarify  <br/>\nan idea for myself and it surprises me that it actually helps some  <br/>\npeople ;-) On a list there are others writing similar ideas in  <br/>\ndifferent ways.<br/>\n<br/>\nIn terms of whether there is right and wrong, there are two issues, I  <br/>\nthink:<br/>\n<br/>\nOne is when people give specific suggestions for a situation. No one  <br/>\ncan know exactly what the whole situation looks like at someone&#39;s  <br/>\nhouse. And while suggestions help someone see how the principles are  <br/>\nput into action in some homes, what&#39;s really important is to  <br/>\nunderstand the principles behind the suggestion. No one can say do x  <br/>\nand y will happen. Unschooling isn&#39;t like a curriculum ;-)  <br/>\nUnschooling is a mindset and set of principles, seeing children as  <br/>\ncompetent beings and ourselves as their partners as they explore.<br/>\n<br/>\nTwo is that not everyone has the same goals. A family who wants their  <br/>\nchildren to get into Harvard is going to make different choices than  <br/>\na family who is supporting a child&#39;s exploration of the world (which  <br/>\nmay or may not lead to Harvard depending on what the child decides he  <br/>\nwants.) Neither is &quot;right&quot; or &quot;wrong&quot; but there are practices that  <br/>\nwill help (be right) and hinder (be wrong) their movement toward  <br/>\ntheir goal.<br/>\n<br/>\n*But* by signing onto an unschooling list someone is implying they  <br/>\nwant unschooling as a goal so the principles (and illustrative  <br/>\npractices) presented will be ones that will help people unschool.  <br/>\nMembers don&#39;t have to accept everything that is presented on the  <br/>\nlist. They can pick and choose what they take away. But what&#39;s  <br/>\npresented will be helping people move towards unschooling.<br/>\n<br/>\nThat&#39;s why discussion lists are different than support lists.  <br/>\nDiscussion lists are for discussing how to get to a specific place.  <br/>\nSupport lists are for supporting each other where they are as they  <br/>\nare as they try to figure things out and grow and change. Discussion  <br/>\ngroups aren&#39;t *unsupportive*. They just aren&#39;t intended to meet the  <br/>\nneeds of people who need others to say &quot;Yes, you&#39;re still a good  <br/>\nmommy if you prevent your child from watching R rated movies.&quot; And  <br/>\nsupport groups aren&#39;t uninformative. They just aren&#39;t intended to  <br/>\nhelp people self examine. The two types of lists serve different  <br/>\nroles and functions.<br/>\n<br/>\nJoyce<br/>\nAnswers to common unschooling questions:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\nBlog of writing prompts for speculative fiction writers:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dragonwritingprompts.blogsome.com/\">http://dragonwritingprompts.blogsome.com/</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146028766","msgId":12473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODM3MDgxRjBEMzc1My03NjgtNzA1QG1ibGstcjI3LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDIwMDYwNDI1MTY1ODAxLjc3Mzg3LnFtYWlsQHdlYjM1OTE1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12472,"nextInTopic":12476,"prevInTime":12472,"nextInTime":12474,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... From: Annette W  Well I agree that I tend to overprotect my children and I m working on it. But I already sleep in the same room","messageBody":"<div id=\"ygrps-yiv-1478831043\">-----Original Message-----<br/>\nFrom: Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt;<br/>\n<br/>\n    Well I agree that I tend to overprotect my children and I&#39;m working <br/>\non it. But I<br/>\nalready sleep in the same room with my children and they know a good <br/>\nbit about<br/>\nmovie making. Scary images don&#39;t get better by knowing how they were <br/>\ngenerated.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSometimes they do. Depends on the person.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nWatching a movie a few minutes at a time is no enjoyment to me.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWell,....isn&#39;t your goal to make this enjoyable for your *son*?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nIf unschooling means that I have to do everything at the pace of my <br/>\nchildren and every aspect<br/>\nof my life has to be geared towards what they want/need then I will be <br/>\nleft out of my life.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nUnschooling means you don&#39;t *have* to do anything. But if you want a <br/>\npeaceful home full of respect and trust, you may want to see that your <br/>\nlife *with* children won&#39;t look much like your life *without* children.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nIf real unschoolers are able to put their interests that are not<br/>\nshared or movie watching that is not beneficial to young children or <br/>\nhaving sex<br/>\nwith their spouse on hold for several years ecause there are 3 kids in <br/>\nthe bed<br/>\nand they can&#39;t get antagonized by being asked to give the parents a <br/>\nlittle<br/>\nprivate time (we already never have any, so it&#39;s not something I have <br/>\nto turn<br/>\noff - I haven&#39;t had time alone with my husband in months).<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI&#39;m a real unschooler! &lt;g&gt;<br/>\n<br/>\nI have many interests that aren&#39;t shared by other family members. They <br/>\neach have interests that I don&#39;t share.<br/>\n<br/>\nI don&#39;t watch movies that I think wouldn&#39;t be beneficial to my young <br/>\nchild when he is around. I watched Kill Bill one night when Duncan was <br/>\nplaying a new game---he was engrossed for hours. I thik he came <br/>\ndownstairs once during. I pasued it. Hit play again when he&#39;d left. He <br/>\nasked about he movie. I said it was *very* violent. He didn&#39;t *want* to <br/>\nwatch it.<br/>\n<br/>\nI simly tell the boys that Ben and I need some alone time. They&#39;ll <br/>\nwatch a movie or play a game or do something together for a while. <br/>\nThey&#39;re now 10 and 18. they *know* what&#39;s going on, but they&#39;re kind <br/>\nenought o understand.<br/>\n<br/>\nWhen they were younger, we would get up early, move to another room, <br/>\nask a neighbor whether they could come over for a bit, have them spend <br/>\nthe night with cousins or grandparents. It&#39;s not an all or nothing <br/>\ndeal.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n So watching a gory movie like Kill Bill is going to be no fun<br/>\n  for me if I have to watch it a few minutes at a time. In order to <br/>\nwatch that<br/>\nmovie I tried to help everybody go to sleep and stole out of the room. <br/>\nNext<br/>\nthing you know Arthur is coming into the living  room.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWell, it&#39;s not *that* fun a movie! &lt;g&gt; With or without interruptions! <br/>\n&lt;g&gt;<br/>\n<br/>\nYou can whine or you can get creative. being sneaky---stealing out of <br/>\nthe room---is probably not the best idea. Being honest---saying that <br/>\nyou want to watch a movie that is rough and violent and that it would <br/>\nprobably scare them---would be better.<br/>\n<br/>\nBut they won&#39;t be this little for long---it gors waaaay faster than you <br/>\nthink it will right now. You can put off these kinds of movies until <br/>\nthe kids are old enough to be out of the house for a bit.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n   Is this unschool thing another way to make parents feel incompetent, <br/>\nnot<br/>\nreasonable? When my children watch Snow White for the 15th time and <br/>\nthey kick me<br/>\nout because they don&#39;t want me to see it with them then that&#39;s fine. If <br/>\nI choose<br/>\na movie to watch by myself and I make all the effort to be out of <br/>\neverybodies<br/>\nway, it&#39;s after midnight I still have to bend to what&#39;s good for him. I <br/>\nmust not<br/>\nlove my children enough.<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWHOA! WHOA! WHOA! WHOA!!!!!!<br/>\n<br/>\nYou&#39;re an adult. They are children with very fews coping skills. They <br/>\nneed time to learn how to deal with things. You&#39;re 30-something (?) and <br/>\nstill haven&#39;t? Yet you expect *them* to already be capable?????<br/>\n<br/>\nI think you might need to step back and see things from a 7 year old&#39;s <br/>\npoint of view--and whatever other aged children you have.<br/>\n<br/>\nIs there a reason they&#39;re kicking you out (and why would you want to <br/>\nwatch Snow White *again*?) ?? Is there a reason you *have* to watch <br/>\nsuch a movie (Kill Bill) right now?  Can&#39;t *that* wait? if not, why not?<br/>\n<br/>\nThe unschooling parents I know are THE most competent and reasonable <br/>\npeople on the planet! But they didn&#39;t get there overnight. They worked <br/>\nat it---and *keep* working at it because it&#39;s important to them.<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146027079","msgId":12472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODM3MDQzMTdDRDdBQi03NjgtNkFGQG1ibGstcjI3LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDIwMDYwNDI1MDQxMzA2LjY1MDM2LnFtYWlsQHdlYjM1OTEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12465,"nextInTopic":12473,"prevInTime":12471,"nextInTime":12473,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... From: Annette W  Thanks for this one. I do think it is my job to shelter him from psychological harm or scary pictures, even if it","messageBody":"<div id=\"ygrps-yiv-2004746505\">-----Original Message-----<br/>\nFrom: Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt;<br/>\n<br/>\n    Thanks for this one. I do think it is my job to shelter him from <br/>\npsychological<br/>\nharm or scary pictures, even if it means not giving him a choice. <br/>\nArthur (7) has<br/>\nno inhibitions to watch something really gory as long as I am in the <br/>\nroom. But<br/>\nlater he&#39;ll report back that he has nightmares.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI think choice is everything.<br/>\n<br/>\nI think not providing him with enough information so that he *can* <br/>\nchoose is cruel. Just letting him watch because he says he wants to is <br/>\nnot kind when you have knowledge about it that you could share.<br/>\n<br/>\nThere are so many things you could do to help him make the best <br/>\ndecision he can. You sould check on the ScreenIt site and let him know <br/>\nwhether it might be too scary or gory or lovey-dovey. You could watch <br/>\nit withhim, pause, discuss, reassure, and fast forward. You could get <br/>\nthe bonus DVD and see how it was made---that often helps.<br/>\n<br/>\nIf he *does* watch something too scary---it&#39;s better to learn what can <br/>\ndiminish the fear than forbidding it or something similar.<br/>\n<br/>\nA lot of adults watch scary movies *in order to* be scared! &lt;g&gt; They <br/>\njust then need to figure out how to deal with the fear. They *want* it! <br/>\nBut they need to compartmentalize it. That&#39;s a good thing!<br/>\n<br/>\n-=-=-=-<br/>\n   So protecting him from scary movies, while not limiting myself only <br/>\nto Disney<br/>\nand the like is an option.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThere are plenty of movies that aren&#39;t scary AND aren&#39;t Disney! &lt;g&gt;<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":205985676,"authorName":"Sandy Deby","from":"Sandy Deby &lt;pod6freedom@...&gt;","profile":"pod6freedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Everyone/Needback","postDate":"1146017426","msgId":12476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDI2MDIxMDI2Ljk4MjAucW1haWxAd2ViMzczMDUubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PEY3NkQwOUI0LUMwQzYtNDQxNy1CODUzLURFMzUyQjRDNUQxRkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":12473,"nextInTopic":12480,"prevInTime":12475,"nextInTime":12477,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, I m new to the group and find myself being so inspired by most things put out. I have to admit Joyce I Like the way you expressed your self and I","messageBody":"<div id=\"ygrps-yiv-1337592450\">Hi Everyone,<br/>\n   <br/>\n  I&#39;m new to the group and find myself being so inspired by most things put out. <br/>\n   <br/>\n  I have to admit Joyce I Like the way you expressed your self and I feel that when ever we have to defend something we are really afraid were wrong you, feel very solid in your own knowingest<br/>\n   <br/>\n  To me what I&#39;m listening to and observing is about are own knowings and trusting that and our children&#39;s. <br/>\n   <br/>\n  I&#39;m not sure what email it was  but it was one about violent movies. I think that once again in all of this there is no right or wrong and I did feel with one point that an email seemed slightly dogmatic.  <br/>\n  The reason I&#39;m leaving the Waldorf school with one of my children and looking at the unschooling.<br/>\n   <br/>\n  It feels so right yet, fundamental anything makes me nervous. Passion in what we believe is good but when I sense this is the way and the only way it makes me nervous.<br/>\n   <br/>\n  I was asked by Kelly a while ago what I want for my kids in the way of goals and the first one that popped into my mind and could be the influence of A course In miracles is that I want them to have inner peace and to accept themselves and others equally.<br/>\n  To live a passionate lifes and find there divine purpose.<br/>\n   <br/>\n  I struggle with these things myself from being royally messed up by the system, and want my children to live there dreams.<br/>\n   <br/>\n  I did have a day today of wondering in my low energy state , which I thought was odd for a raw food and living foods vegetarian but it happens. I felt also not like hanging around with my kids its as if my own inerchild needed to be taken care of and didn&#39;t have much to offer and didn&#39;t feel present at all.<br/>\n   <br/>\n  Of course my ego went crazy with this and said see you  will never be able to do this ma bey your pipe dreaming  you just wish you could be a unschooler,   your way to self absorbed.<br/>\n   <br/>\n  Just letting it all out guys for I know when we make big life changes the opp site will come in louder than ever.<br/>\n   <br/>\n  I know this to shall pas , but needing some support and feedback.<br/>\n   <br/>\n  I am also aware of making so many mistakes because of my own woundness that I&#39;m afraid as my eldest said today who calls herself my Ginnie pig if I&#39;m just on another tangent trying to help everyone??<br/>\n   <br/>\n  Gee wonder why I&#39;m getting my degree right now in psychology.<br/>\n   <br/>\n  Namaste..................Sandy<br/>\nJoyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt; wrote:<br/>\n  <br/>\n<blockquote><span title=\"qreply\"> On Apr 25, 2006, at 10:37 AM, trektheory wrote:<br/>\n<br/>\n&gt; How could my son ask about something of which he had no knowledge?<br/>\n<br/>\nYou said he saw Scooby Doo at a friend&#39;s house. That&#39;s where he got  <br/>\nthe knowledge. And when you found out his reaction that&#39;s how you got  <br/>\nyour knowledge of him.<br/>\n<br/>\nBut I&#39;m not saying what you think I&#39;m saying. I&#39;m not giving advice  <br/>\non what to do with kids who are scared of movies. I&#39;m trying to point  <br/>\nout how changing a view point can help us see things in a different way.<br/>\n<br/>\nHelping a child avoid what he knows he doesn&#39;t want to see *is*  <br/>\ndifferent than protecting them. It just is and I don&#39;t know how to  <br/>\nexplain it any better. I&#39;m not discussing what you did or didn&#39;t do,  <br/>\nonly discussing semantics and how to help people see things  <br/>\ndifferently. But my words aren&#39;t working so it&#39;s pointless for me to  <br/>\nthrow more words at it. Maybe someone else can say it in a different  <br/>\nway.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Secondary school education   Graduate school education   Home school education     Graduate school education online   High school education   Chicago school education <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nHave a question? Yahoo! Canada Answers. Go to Yahoo! Canada Answers  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146003826","msgId":12465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MjUxNTIzbDc3YzYxNjA1cDVlODg0OWY0MmI5Mzc5M2ZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDIwMDYwNDI1MTY1ODAxLjc3Mzg3LnFtYWlsQHdlYjM1OTE1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PEZDNjY0QjRCLTE1QTctNDY1QS1CNDkxLTFCMDY4OUM0QzlCQkBlYXJ0aGxpbmsubmV0PgkgPDIwMDYwNDI1MTY1ODAxLjc3Mzg3LnFtYWlsQHdlYjM1OTE1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12464,"nextInTopic":12472,"prevInTime":12464,"nextInTime":12466,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... Depending on your child it can!  Mary Elayne didn t want to watch LOTR for the longest time until she learned how all the creatures were made after we got","messageBody":"<div id=\"ygrps-yiv-1311660902\">On 4/25/06, Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  Scary images don&#39;t get better by knowing how they were generated.<br/>\n<br/>\n<br/>\n </span></blockquote>Depending on your child it can!  Mary Elayne didn&#39;t want to watch LOTR for<br/>\nthe longest time until she learned how all the creatures were made after we<br/>\ngot the DVD with all the bonus features including make up and CG work.<br/>\nAfter she realized how all the wraiths and goblins and trolls and other ugly<br/>\nhorrifying creatures were built it made watching the move easier and now she<br/>\ngets all excited about watching movies that have fantasy creatures in them!<br/>\n<br/>\n<br/>\nWatching a movie a few minutes at a time is no enjoyment to me. If<br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling means that I have to do everything at the pace of my children<br/>\n&gt; and every aspect of my life has to be geared towards what they want/need<br/>\n&gt; then I will be left out of my life.<br/>\n<br/>\n<br/>\n </span></blockquote>Are your children not part of your life?  I&#39;m not saying that you need to<br/>\nspend 24/7 with your children and only do their interests.  I mean how are<br/>\nthey going to learn to live life joyfully if you are living your life<br/>\nbegrudgingly?  Parents need to find creative ways in which to spend some<br/>\ntime pursuing their own interests. Sometimes, especially when our babies are<br/>\nsmall, that may mean putting our current interests on a back burner and<br/>\nfinding something that is more manageable.  I LOVE movies but hate being<br/>\ninterupted or talked to or interupted :) while I am watching them.  When my<br/>\nchildren were smaller I would leave them with their father and run to the<br/>\nmovies and watch them alone!  No one talked to me, no one ate my popcorn<br/>\n(actually, I rarely got any), no one asked me to take them to the bathroom,<br/>\nand no one interupted me.  It cost around $5 (It&#39;s now $6.50-$8) but I<br/>\nconsidered it buying time to myself.  If going out is a problem, then<br/>\nconsider watching your movie when they are asleep - late at night or (as can<br/>\nhappen in my house) early in the morning.  Keon and I have shared some great<br/>\nmovie time at 5am!<br/>\n<br/>\nI have scheduled time when I do some of my arts.  I have a monthly time when<br/>\nI go to a rubber stamp class and challenge, a monthly time when I go<br/>\nscrapbook, and a weekly time when my kids know I am in my studio working.<br/>\nI&#39;ve been known to get up in the middle of the night or wee hours of the<br/>\nmorning and go create or write.  I still actively pursue my interests<br/>\nbecause I need that creativity in my life and my children need to see me<br/>\ndoing those things!<br/>\n<br/>\n If real unschoolers are able to put their interests that are not shared or<br/>\n<blockquote><span title=\"ireply\"> &gt; movie watching that is not beneficial to young children or having sex with<br/>\n&gt; their spouse on hold for several years ecause there are 3 kids in the bed<br/>\n&gt; and they can&#39;t get antagonized by being asked to give the parents a little<br/>\n&gt; private time (we already never have any, so it&#39;s not something I have to<br/>\n&gt; turn off - I haven&#39;t had time alone with my husband in months).<br/>\n<br/>\n<br/>\n </span></blockquote>Well, somehow you managed to have children number 2 and 3 :)  Just because<br/>\nthere are multiple bodies in your bed doesn&#39;t mean that you can&#39;t find time<br/>\nfor intimate relationships.  You have to be creative.  I have a friend who<br/>\nhad a family bed.  Every once in a while her family would have a &quot;camp out&quot;<br/>\nin the living room.  Mom and Dad would spread out sleeping bags and pop<br/>\ncorn, rent a bunch of new movies, have hotdogs and s&#39;mores (or some other<br/>\ntheme) and the kids would all sleep in the living room while Mom and Dad<br/>\nsnuck off to their own room for some privatel time.  Take advantage of play<br/>\ndates, sleepovers at grandma&#39;s, midafternoon surprise naps, and other<br/>\nopportunities when you find yourself alone.  Heck, ask a friend if you can<br/>\ndrop the kids off for an hour while you go have a romantic lunch with your<br/>\nhubby!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Is this unschool thing another way to make parents feel incompetent, not<br/>\n&gt; reasonable? When my children watch Snow White for the 15th time and they<br/>\n&gt; kick me out because they don&#39;t want me to see it with them then that&#39;s fine.<br/>\n&gt; If I choose a movie to watch by myself and I make all the effort to be out<br/>\n&gt; of everybodies way, it&#39;s after midnight I still have to bend to what&#39;s good<br/>\n&gt; for him. I must not love my children enough.<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s not what unschooling is all about at all.  One way you could approach<br/>\nthis is by saying, &quot;I&#39;m watching Kill Bill.  It&#39;s quite a gory and violent<br/>\nmovie.  I know you get upset when you see such angry scenes.  If you want to<br/>\ncurl up here and watch it with me, you may, but you may want to go find<br/>\nsomething else to do or maybe go read a book in another room.&quot;  IT IS OK FOR<br/>\nPARENTS TO DO SOME OF THE THINGS THAT THEY WANT TO DO!  Yes; I yelled that.<br/>\nI hope you heard it.  The difference between unschooling and &quot;regular<br/>\nparenting&quot; is that with unschooling you give your children the information<br/>\nthat they need to make a decision rather than deciding for them!  And if<br/>\nyour child decides that he wants to watch the movie with you and then finds<br/>\nit to frightening you can always say, &quot;You feel frightened by this movie<br/>\nbecause it is so violent.  Would you like me to pause it and go tuck you in<br/>\nbed or help you find something else to do while I finish watching it?&quot;  Then<br/>\nyou have met the needs of yourself and your child!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146000993","msgId":12464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3NkQwOUI0LUMwQzYtNDQxNy1CODUzLURFMzUyQjRDNUQxRkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGUybGM2bitlODBwQGVHcm91cHMuY29tPg==","referencesHeader":"PGUybGM2bitlODBwQGVHcm91cHMuY29tPg=="},"prevInTopic":12463,"nextInTopic":12465,"prevInTime":12463,"nextInTime":12465,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... You said he saw Scooby Doo at a friend s house. That s where he got the knowledge. And when you found out his reaction that s how you got your knowledge of","messageBody":"<div id=\"ygrps-yiv-1860475700\">On Apr 25, 2006, at 10:37 AM, trektheory wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How could my son ask about something of which he had no knowledge?<br/>\n<br/>\n </span></blockquote>You said he saw Scooby Doo at a friend&#39;s house. That&#39;s where he got  <br/>\nthe knowledge. And when you found out his reaction that&#39;s how you got  <br/>\nyour knowledge of him.<br/>\n<br/>\nBut I&#39;m not saying what you think I&#39;m saying. I&#39;m not giving advice  <br/>\non what to do with kids who are scared of movies. I&#39;m trying to point  <br/>\nout how changing a view point can help us see things in a different way.<br/>\n<br/>\nHelping a child avoid what he knows he doesn&#39;t want to see *is*  <br/>\ndifferent than protecting them. It just is and I don&#39;t know how to  <br/>\nexplain it any better. I&#39;m not discussing what you did or didn&#39;t do,  <br/>\nonly discussing semantics and how to help people see things  <br/>\ndifferently. But my words aren&#39;t working so it&#39;s pointless for me to  <br/>\nthrow more words at it. Maybe someone else can say it in a different  <br/>\nway.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1146000526","msgId":12463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxQkNFQTdFLUYwMTQtNDU4NS1BREM4LUE5RkE4Nzg1QjYwRUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDI1MTY1ODAxLjc3Mzg3LnFtYWlsQHdlYjM1OTE1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNDI1MTY1ODAxLjc3Mzg3LnFtYWlsQHdlYjM1OTE1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12460,"nextInTopic":12464,"prevInTime":12462,"nextInTime":12464,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... The discussions are meant to help people view their role in their children s lives differently and solve problems from a different perspective. It s","messageBody":"<div id=\"ygrps-yiv-924971297\">On Apr 25, 2006, at 12:58 PM, Annette W wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is this unschool thing another way to make parents feel  <br/>\n&gt; incompetent, not reasonable?<br/>\n<br/>\n </span></blockquote>The discussions are meant to help people view their role in their  <br/>\nchildren&#39;s lives differently and solve problems from a different  <br/>\nperspective.<br/>\n<br/>\nIt&#39;s exhausting to cast ourselves in the role of Problem Solver and  <br/>\nChild Protector! It removes a lot of weight to see ourselves as their  <br/>\npartners.<br/>\n<br/>\nThat probably doesn&#39;t make much sense but it does after you&#39;ve read a  <br/>\nlot of the advice from unschoolers and see where they&#39;re coming from  <br/>\nand what they&#39;re goals are.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So watching a gory movie like Kill Bill is going to be no fun for  <br/>\n&gt; me if I have to watch it a few minutes at a time.<br/>\n<br/>\n </span></blockquote>I think it will help you to step back and see goals rather than  <br/>\nsolutions to a particular incident. Watching adult movies with kids  <br/>\nin the house means during some movie there will be kids wandering in.  <br/>\nIt&#39;s a choice with known consequences and we need to be prepared to  <br/>\nhandle the consequences.<br/>\n<br/>\nIf our goal is to be their partner, helping them avoid what they  <br/>\ndon&#39;t want to see, then there are options: pause while the child&#39;s  <br/>\nneeds are tended to, tell the child we&#39;d be happy to watch it with  <br/>\nhim tomorrow a little at a time but that this late at night he&#39;ll  <br/>\nhave problems with the images. When kids see us as their partner,  <br/>\nthey&#39;ll trust that information -- assuming it *is* true! If we&#39;ve  <br/>\nfollowed through in the past and they know they can trust us to watch  <br/>\nit with them the next day (or whatever solution we know we can stick  <br/>\nwith) then they won&#39;t be needy to have it right then.<br/>\n<br/>\nThat&#39;s a goal. It&#39;s not something anyone can jump right to if we  <br/>\nhaven&#39;t built up that trust with them.<br/>\n<br/>\nIf the goal is to have alone time, putting on Kill Bill with kids in  <br/>\nthe house isn&#39;t the best solution. The movie is more than likely  <br/>\ngoing to get interrupted. Ask people on the list how they&#39;ve gotten  <br/>\nalone time, how they&#39;ve recharged their batteries. Long time  <br/>\nunschoolers are good at seeing *other* solutions than the standard ones!<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1145985949","msgId":12460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MjUyMDA2MTcyNS4xNzk1My40NDRFNUI5RDAwMDAwNDZDMDAwMDQ2MjEyMjAwNzM1ODM0MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":12458,"nextInTopic":12463,"prevInTime":12459,"nextInTime":12461,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... for me if I have to watch it a few minutes at a time. Watching a movie like Kill Bill would be no fun for me no matter how I watched it.  That s why I","messageBody":"<div id=\"ygrps-yiv-887205022\"><blockquote><span title=\"ireply\">&gt;&gt;So watching a gory movie like Kill Bill is going to be no fun<br/>\n </span></blockquote>for me if I have to watch it a few minutes at a time.&gt;&gt;<br/>\n<br/>\nWatching a movie like Kill Bill would be no fun for me no matter how I watched it. &lt;g&gt; That&#39;s why I chose to be somewhere else when my husband and son rented it.<br/>\n<br/>\nI don&#39;t think anyone is suggesting you *recommend* scary or gory movies to children. Far from it. It&#39;s a given that  we&#39;re there to guide, protect and direct them as the need arises. <br/>\n<br/>\nI often save movies to watch when my kids are otherwise occupied. Sometimes it&#39;s because I think they won&#39;t like them. Sometimes it&#39;s because I want to watch something alone. I do that with my dh sometimes too. <br/>\n<br/>\nThat&#39;s not the same as telling them they are forbidden from watching a particular movie or certain tyoe of movie without discussion. I am NOT saying you are doing this BTW. I&#39;m just trying to focus the discussion a little bit.<br/>\n<br/>\nWas Arthur asking to watch the movie? Was it important to him? If so, why do you think that was?<br/>\n<br/>\n--<br/>\n<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt;</div>","specialLinks":[]},{"userId":242520548,"authorName":"Annette W","from":"Annette W &lt;annette75093@...&gt;","profile":"annette75093","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1145984281","msgId":12458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDI1MTY1ODAxLjc3Mzg3LnFtYWlsQHdlYjM1OTE1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEZDNjY0QjRCLTE1QTctNDY1QS1CNDkxLTFCMDY4OUM0QzlCQkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":12452,"nextInTopic":12460,"prevInTime":12457,"nextInTime":12459,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"Well I agree that I tend to overprotect my children and I m working on it. But I already sleep in the same room with my children and they know a good bit about","messageBody":"<div id=\"ygrps-yiv-65893750\">Well I agree that I tend to overprotect my children and I&#39;m working on it. But I already sleep in the same room with my children and they know a good bit about movie making. Scary images don&#39;t get better by knowing how they were generated. Watching a movie a few minutes at a time is no enjoyment to me. If unschooling means that I have to do everything at the pace of my children and every aspect of my life has to be geared towards what they want/need then I will be left out of my life. If real unschoolers are able to put their interests that are not shared or movie watching that is not beneficial to young children or having sex with their spouse on hold for several years ecause there are 3 kids in the bed and they can&#39;t get antagonized by being asked to give the parents a little private time (we already never have any, so it&#39;s not something I have to turn off - I haven&#39;t had time alone with my husband in months). So watching a gory movie like Kill Bill is going to be no fun<br/>\n for me if I have to watch it a few minutes at a time. In order to watch that movie I tried to help everybody go to sleep and stole out of the room. Next thing you know Arthur is coming into the living   room. <br/>\n  Is this unschool thing another way to make parents feel incompetent, not reasonable? When my children watch Snow White for the 15th time and they kick me out because they don&#39;t want me to see it with them then that&#39;s fine. If I choose a movie to watch by myself and I make all the effort to be out of everybodies way, it&#39;s after midnight I still have to bend to what&#39;s good for him. I must not love my children enough.<br/>\n<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"qreply\"> On Apr 25, 2006, at 12:13 AM, Annette W wrote:<br/>\n<br/>\n&gt; Arthur (7) has no inhibitions to watch something really gory as  <br/>\n&gt; long as I am in the room. But later he&#39;ll report back that he has  <br/>\n&gt; nightmares.<br/>\n<br/>\nThe only options aren&#39;t letting and not letting.<br/>\n<br/>\nIn terms of unschooling, in terms of helping our children explore the  <br/>\nworld and learn more about themselves, if a child is drawn to  <br/>\nsomething it&#39;s our job to help them explore and help them deal with  <br/>\nthe consequences.<br/>\n<br/>\nYou could watch scary movies together early in the day. You could  <br/>\nwatch just a few minutes at a time. You could discuss together ways  <br/>\nthe special effects could have been done and you could watch the  <br/>\n&quot;Making of&quot; segments to see how they really did them. You could sleep  <br/>\nwith him to give him support as he&#39;s exploring the boundaries of his  <br/>\ncomfort zone.<br/>\n<br/>\nIf a child is determined to master skateboard techniques, they&#39;re  <br/>\ngoing to get banged up. The answer isn&#39;t to  take the skateboard  <br/>\naway. The answer is to help them explore.<br/>\n<br/>\nTraditional parenting has two answers to most questions about raising  <br/>\nkids: 1) Teach them they can&#39;t and 2) Protect them from harm.<br/>\n<br/>\nNeither of those helps unschooling to flourish.<br/>\n<br/>\nThe purpose of this list is to help parents see their role in a new  <br/>\nway: as their children&#39;s partners in exploring the world rather than  <br/>\ntheir protectors from the world.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! Messenger with Voice. PC-to-Phone calls for ridiculously low rates.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Annette Intro","postDate":"1145975831","msgId":12452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUybGM2bitlODBwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYxQjRDMTJFLTg2ODItNDAxMy04RjA5LUVBMkU3Qjg4NUJFREBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":12447,"nextInTopic":12458,"prevInTime":12451,"nextInTime":12453,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... see ... something ... Doo, ... How could my son ask about something of which he had no knowledge? (BTW, I wasn t there -- he had slept over the friend s","messageBody":"<div id=\"ygrps-yiv-606005929\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll <br/>\n&lt;fetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 24, 2006, at 4:40 PM, trektheory wrote:<br/>\n&gt; <br/>\n&gt; &gt;&gt; There&#39;s a difference -- an important difference -- between a  <br/>\n&gt; &gt;&gt; child  who wants help avoiding something they don&#39;t want to <br/>\n </span></blockquote>see  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt; and a parent  deciding the child won&#39;t be able to handle <br/>\n </span></blockquote>something  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt; they are asking  to see.<br/>\n&gt; &gt; But if I KNOW something will be psychologically harmful<br/>\n&gt; &gt; to my child at that stage of development, I guide him away from<br/>\n&gt; &gt; harm.<br/>\n&gt; <br/>\n&gt; You missed my point.<br/>\n&gt; <br/>\n&gt; My point is that if a child is asking &quot;Don&#39;t let me see Scooby <br/>\n </span></blockquote>Doo,&quot;  <br/>\n<blockquote><span title=\"ireply\"> &gt; then we should help them not see Scooby Doo.<br/>\n<br/>\n </span></blockquote>How could my son ask about something of which he had no knowledge?  <br/>\n(BTW, I wasn&#39;t there -- he had slept over the friend&#39;s house, and <br/>\nthey watched it in the morning.  And had I known, I would not have <br/>\nsuspected that that particular show would evoke the response it did.)<br/>\n<br/>\nI&#39;m viewing it in a different way.  If my son had food allergies <br/>\n(fortunately, to the best of my knowledge he doesn&#39;t, but I know a <br/>\nnumber of kids who do), it would be my job to guide him away from <br/>\nfoods -- foods that are perfectly fine for other kids -- that would <br/>\ncause a negative reaction in his body.  In this case, I was guiding <br/>\nhim away from tv and books that would have a negative reaction to <br/>\nhis mind.  Big difference, though, is that he was about to grow out <br/>\nof this &quot;mental allergy&quot; (to carry the analogy).  I used him as a <br/>\nguide for what was/wasn&#39;t acceptable.  But I had to have the <br/>\nknowledge of both him and the story.  Having a very sensitive child <br/>\ndoes bring with it different issues than the &quot;typical&quot; child.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; We can&#39;t know what a child can handle until they&#39;ve tested the <br/>\n </span></blockquote>waters  <br/>\n<blockquote><span title=\"ireply\"> &gt; beyond their boundaries.<br/>\n<br/>\n </span></blockquote>There&#39;s the rub -- the boundaries may be blurred for some children, <br/>\nclear-cut for others.  Things that seemed innocuous were sometimes <br/>\nharmful to my son.  (Again, this was years ago, and for the most <br/>\npart, has outgrown it.)  <br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We don&#39;t need to put them in front of Texas  <br/>\n&gt; Chainsaw Massacres. We need to be with them as they explore so we <br/>\n </span></blockquote>can  <br/>\n<blockquote><span title=\"ireply\"> &gt; learn along with them what they want to see and what they don&#39;t so <br/>\n </span></blockquote>we  <br/>\n<blockquote><span title=\"ireply\"> &gt; can help them.<br/>\n<br/>\n </span></blockquote>As a family, we watch things together, and do use the medium that <br/>\nway.  (Books can run the gamut, and there have been occasions when <br/>\nhe read something he wished he hadn&#39;t.  He is 14 now, btw.)  Scooby <br/>\nDoo was at a friend&#39;s house.  But even at our house, when he was <br/>\nyounger, he could watch something, and appear fine -- until later.  <br/>\nThe ramifications were often difficult to deal with.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; It helps people to think clearer and make better decisions if we <br/>\n </span></blockquote>see  <br/>\n<blockquote><span title=\"ireply\"> &gt; the difference between a parent judging for the child what they <br/>\n </span></blockquote>can  <br/>\n<blockquote><span title=\"ireply\"> &gt; and can&#39;t handle -- e.g., I don&#39;t want my child to watch Scooby <br/>\n </span></blockquote>Doo  <br/>\n<blockquote><span title=\"ireply\"> &gt; because it has scary images that might frighten him -- and the <br/>\n </span></blockquote>parent  <br/>\n<blockquote><span title=\"ireply\"> &gt; helping the child get what the child has said he wants and avoid <br/>\n </span></blockquote>what  <br/>\n<blockquote><span title=\"ireply\"> &gt; he&#39;s said he doesn&#39;t want.<br/>\n<br/>\n </span></blockquote>Again, how can he tell ahead of time what will be too much for him?  <br/>\nHe has no basis to judge.  If someone handed me a book, just a <br/>\ntitle, and asked me to rate it for what age, how could I?  I would <br/>\nknow nothing about it!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Children don&#39;t know to not run out in front of a running car<br/>\n&gt; &gt; before being taught it, but that&#39;s and easy danger for them to<br/>\n&gt; &gt; visually learn about.<br/>\n&gt; <br/>\n&gt; No child wants to be killed.<br/>\n&gt; <br/>\n&gt; Every child could to be seriously injured if they&#39;re hit by a bus.<br/>\n&gt; <br/>\n&gt; It&#39;s up to us to protect kids from imminent death. It&#39;s what our  <br/>\n&gt; children trust us to do.<br/>\n<br/>\n </span></blockquote>No child wants to be killed -- but do they know what will kill <br/>\nthem?  My son can (and often does) eat nuts, but a friend who has an <br/>\nanaphalactic reaction can be killed by it.  A child isn&#39;t born with <br/>\nthat knowledge - or that there may well be nuts in other foods that <br/>\nlook like they don&#39;t have nuts.  (Or dairy, or....)<br/>\n<br/>\nNo child wants psychological damage, either.  And what is damaging <br/>\nto one child may not be to another.  And the child may not KNOW it <br/>\nis damaging, until the damage is done.<br/>\n<br/>\nI DID protect my son from things that would have been <br/>\npsychologically damaging to him, and that he now can handle.  I <br/>\nwould do the same again, if I had a &quot;do-over&quot;.  (I do wish life gave <br/>\ndo-overs!)  Your child can guide you without having to watch dubious <br/>\nthings, read dubious stories.  <br/>\n<br/>\nI love the fact that we can all choose different paths, and do what <br/>\nis right for OUR children, without dictating to others what they <br/>\nshould do for theirs.  I don&#39;t believe that lockstep learning (or, <br/>\nas is usually the case in schools, memorizing and regurgitating!) is <br/>\nappropriate, that people learn differently, and I don&#39;t believe that <br/>\ndevelopment is lockstep, either.  I parent according to my child&#39;s <br/>\nneeds, and have a better feel for what he needs than someone who has <br/>\nnever met him.  You have found something that works for you and your <br/>\nfamily and that is great.  I have, too, and that, to me, is also <br/>\ngreat.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1145969768","msgId":12447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MjUwNTU2a2NiNWYxOWZ1YTIzYmM3MzUzZjU5OTQ4MkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDIwMDYwNDI1MDQxMzA2LjY1MDM2LnFtYWlsQHdlYjM1OTEyLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGUyamQzdis0N3Z2QGVHcm91cHMuY29tPgkgPDIwMDYwNDI1MDQxMzA2LjY1MDM2LnFtYWlsQHdlYjM1OTEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12443,"nextInTopic":12452,"prevInTime":12446,"nextInTime":12448,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... I still get nightmares from scary movies (although I think the definition of what I find scary now as an adult is different from when I was a child LOL!)","messageBody":"<div id=\"ygrps-yiv-2049228277\">On 4/24/06, Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thanks for this one. I do think it is my job to shelter him from<br/>\n&gt; psychological harm or scary pictures, even if it means not giving him a<br/>\n&gt; choice. Arthur (7) has no inhibitions to watch something really gory as long<br/>\n&gt; as I am in the room. But later he&#39;ll report back that he has nightmares.<br/>\n<br/>\n<br/>\n </span></blockquote>I still get nightmares from &quot;scary movies&quot; (although I think the definition<br/>\nof what I find scary now as an adult is different from when I was a child<br/>\nLOL!)  but I still enjoy watching some genre of &quot;scary movies.&quot;  Does he<br/>\nenjoy the movies despite the nightmares?  If so then limiting his exposure<br/>\nto them is cutting out a part of his life that he does enjoy.  Helping him<br/>\ndeal with the nightmares is a better option.  If an obstacle is in our way<br/>\nto joyful living, then our job, as parents, is to help remove the obstacle<br/>\nso that joyful living can be its fullest!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1145964131","msgId":12443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZDNjY0QjRCLTE1QTctNDY1QS1CNDkxLTFCMDY4OUM0QzlCQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDI1MDQxMzA2LjY1MDM2LnFtYWlsQHdlYjM1OTEyLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNDI1MDQxMzA2LjY1MDM2LnFtYWlsQHdlYjM1OTEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12442,"nextInTopic":12447,"prevInTime":12442,"nextInTime":12444,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... The only options aren t letting and not letting. In terms of unschooling, in terms of helping our children explore the world and learn more about","messageBody":"<div id=\"ygrps-yiv-873895180\">On Apr 25, 2006, at 12:13 AM, Annette W wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Arthur (7) has no inhibitions to watch something really gory as  <br/>\n&gt; long as I am in the room. But later he&#39;ll report back that he has  <br/>\n&gt; nightmares.<br/>\n<br/>\n </span></blockquote>The only options aren&#39;t letting and not letting.<br/>\n<br/>\nIn terms of unschooling, in terms of helping our children explore the  <br/>\nworld and learn more about themselves, if a child is drawn to  <br/>\nsomething it&#39;s our job to help them explore and help them deal with  <br/>\nthe consequences.<br/>\n<br/>\nYou could watch scary movies together early in the day. You could  <br/>\nwatch just a few minutes at a time. You could discuss together ways  <br/>\nthe special effects could have been done and you could watch the  <br/>\n&quot;Making of&quot; segments to see how they really did them. You could sleep  <br/>\nwith him to give him support as he&#39;s exploring the boundaries of his  <br/>\ncomfort zone.<br/>\n<br/>\nIf a child is determined to master skateboard techniques, they&#39;re  <br/>\ngoing to get banged up. The answer isn&#39;t to  take the skateboard  <br/>\naway. The answer is to help them explore.<br/>\n<br/>\nTraditional parenting has two answers to most questions about raising  <br/>\nkids: 1) Teach them they can&#39;t and 2) Protect them from harm.<br/>\n<br/>\nNeither of those helps unschooling to flourish.<br/>\n<br/>\nThe purpose of this list is to help parents see their role in a new  <br/>\nway: as their children&#39;s partners in exploring the world rather than  <br/>\ntheir protectors from the world.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1145963289","msgId":12442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxQjRDMTJFLTg2ODItNDAxMy04RjA5LUVBMkU3Qjg4NUJFREBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGUyamQzdis0N3Z2QGVHcm91cHMuY29tPg==","referencesHeader":"PGUyamQzdis0N3Z2QGVHcm91cHMuY29tPg=="},"prevInTopic":12435,"nextInTopic":12443,"prevInTime":12441,"nextInTime":12443,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... You missed my point. My point is that if a child is asking Don t let me see Scooby Doo, then we should help them not see Scooby Doo. We can t know what a","messageBody":"<div id=\"ygrps-yiv-499871137\">On Apr 24, 2006, at 4:40 PM, trektheory wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; There&#39;s a difference -- an important difference -- between a  <br/>\n&gt;&gt; child  who wants help avoiding something they don&#39;t want to see  <br/>\n&gt;&gt; and a parent  deciding the child won&#39;t be able to handle something  <br/>\n&gt;&gt; they are asking  to see.<br/>\n&gt; But if I KNOW something will be psychologically harmful<br/>\n&gt; to my child at that stage of development, I guide him away from<br/>\n&gt; harm.<br/>\n<br/>\n </span></blockquote>You missed my point.<br/>\n<br/>\nMy point is that if a child is asking &quot;Don&#39;t let me see Scooby Doo,&quot;  <br/>\nthen we should help them not see Scooby Doo.<br/>\n<br/>\nWe can&#39;t know what a child can handle until they&#39;ve tested the waters  <br/>\nbeyond their boundaries. We don&#39;t need to put them in front of Texas  <br/>\nChainsaw Massacres. We need to be with them as they explore so we can  <br/>\nlearn along with them what they want to see and what they don&#39;t so we  <br/>\ncan help them.<br/>\n<br/>\nIt helps people to think clearer and make better decisions if we see  <br/>\nthe difference between a parent judging for the child what they can  <br/>\nand can&#39;t handle -- e.g., I don&#39;t want my child to watch Scooby Doo  <br/>\nbecause it has scary images that might frighten him -- and the parent  <br/>\nhelping the child get what the child has said he wants and avoid what  <br/>\nhe&#39;s said he doesn&#39;t want.<br/>\n<br/>\nAnd if we&#39;re helping them avoid something they don&#39;t want to see it  <br/>\nhelps to see how it is different from sheltering them. Kids will grow  <br/>\nand change and they need to keep testing their boundaries to see what  <br/>\nthey&#39;re capable of. If we&#39;re sheltering them we&#39;re preventing them  <br/>\nfrom testing what they&#39;re capable of.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Children don&#39;t know to not run out in front of a running car<br/>\n&gt; before being taught it, but that&#39;s and easy danger for them to<br/>\n&gt; visually learn about.<br/>\n<br/>\n </span></blockquote>No child wants to be killed.<br/>\n<br/>\nEvery child could to be seriously injured if they&#39;re hit by a bus.<br/>\n<br/>\nIt&#39;s up to us to protect kids from imminent death. It&#39;s what our  <br/>\nchildren trust us to do.<br/>\n<br/>\nThe same is not true of Scooby Doo and R rated movies. Some kids can  <br/>\nhandle violence. Some can&#39;t. It&#39;s up to us to learn what children  <br/>\nwant to see and what they don&#39;t want to see and help them do that. To  <br/>\nhelp unschooling flourish we need to give them the freedom to  <br/>\nexplore, not shelter them. Help them avoid what they&#39;ve said they  <br/>\ndon&#39;t want, yes. But also give them the freedom to test their  <br/>\nboundaries knowing we&#39;re there to help them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":242520548,"authorName":"Annette W","from":"Annette W &lt;annette75093@...&gt;","profile":"annette75093","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1145938386","msgId":12435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDI1MDQxMzA2LjY1MDM2LnFtYWlsQHdlYjM1OTEyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGUyamQzdis0N3Z2QGVHcm91cHMuY29tPg=="},"prevInTopic":12426,"nextInTopic":12442,"prevInTime":12434,"nextInTime":12436,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"Thanks for this one. I do think it is my job to shelter him from psychological harm or scary pictures, even if it means not giving him a choice. Arthur (7) has","messageBody":"<div id=\"ygrps-yiv-422111109\">Thanks for this one. I do think it is my job to shelter him from psychological harm or scary pictures, even if it means not giving him a choice. Arthur (7) has no inhibitions to watch something really gory as long as I am in the room. But later he&#39;ll report back that he has nightmares. <br/>\n  So protecting him from scary movies, while not limiting myself only to Disney and the like is an option.<br/>\n  Annette.<br/>\n<br/>\nThere is also a difference between protecting a child from harm -- <br/>\nwhether physical or emotional -- and letting them find out the hard <br/>\nway!  Children don&#39;t know to not run out in front of a running car <br/>\nbefore being taught it, but that&#39;s and easy danger for them to <br/>\nvisually learn about.  The other kinds can be harder, because less <br/>\nconcrete.  But if I KNOW something will be psychologically harmful <br/>\nto my child at that stage of development, I guide him away from <br/>\nharm.  <br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Secondary school education   Graduate school education   Home school education     Graduate school education online   High school education   Chicago school education <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n      <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n\t\t\t<br/>\n---------------------------------<br/>\nCelebrate Earth Day everyday!  Discover 10 things you can do to help slow climate change. Yahoo! Earth Day<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Annette Intro","postDate":"1145917214","msgId":12426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUyaml1dStma3Y2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12410,"nextInTopic":12435,"prevInTime":12425,"nextInTime":12427,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"Hi Annette and welcome. ~ Joanne ~ Mom to Jacqueline (7), Shawna (10) & Cimion (13) Adopted into our hearts October 30, 2003 ","messageBody":"<div id=\"ygrps-yiv-790294662\">Hi Annette and welcome. <br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (7), Shawna (10) & Cimion (13)<br/>\nAdopted into our hearts October 30, 2003<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://foreverparents.com\">http://foreverparents.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Annette W <br/>\n&lt;annette75093@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hallo Group.<br/>\n&gt;    <br/>\n&gt;   My name is Annette. I have three sons, Arthur (7), Henry (4) and <br/>\n </span></blockquote>Linus (2). <br/>\n<blockquote><span title=\"ireply\"> &gt;   Before I had kids I was a pediatric nurse. I thought kids are <br/>\n </span></blockquote>always ill, they need set routines and are best kept in sterile <br/>\nconditions away from their parents who only do harm. Not quite as <br/>\nstrict as I state it here, but basically I had very little trust in <br/>\nme or anybody to know what&#39;s right for kids. <br/>\n<blockquote><span title=\"ireply\"> &gt;   Then I had Arthur, read a couple of books, some free magazines <br/>\n </span></blockquote>and that&#39;s when the confusion started. Who&#39;s right who&#39;s wrong? <br/>\nObviously I am wrong, my child doesn&#39;t read and write by 2. <br/>\n<blockquote><span title=\"ireply\"> &gt;   I&#39;ve tried Waldorf, because that sheltered me from early <br/>\n </span></blockquote>literacy and gave me a little help during Arthurs preschool time. <br/>\nThen Waldorf became all inclusive. Can&#39;t watch movies, TV, play <br/>\ncomputer games or for that matter have INFORMATION about Arthurs <br/>\nactivities while at school. All clouded in a veil of waldorfian <br/>\nwisdom that I as a mere mortal (by that time) mother of 3 could not <br/>\npossibly understand. <br/>\n<blockquote><span title=\"ireply\"> &gt;   A very brief stint at a blue ribbon, awards public school <br/>\n </span></blockquote>(exactly 5 schooldays) made it clear that&#39;s not the way to go.<br/>\n<blockquote><span title=\"ireply\"> &gt;   So we came to homeschooling and through the internet I found out <br/>\n </span></blockquote>about unschooling. So here we are. <br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   The things that I need to work on and hope to get input for are:<br/>\n&gt;   -peacefull parenting,<br/>\n&gt;   -what limits are reasonable to set (mostly media contents, rated <br/>\n </span></blockquote>R movies etc),<br/>\n<blockquote><span title=\"ireply\"> &gt;   -there are 3 kids - sometimes a member of the family will not <br/>\n </span></blockquote>get what they want so we can adress the need of all of us better <br/>\n(one wants TV, 2 want Park)<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   I will never write a mail this long again, promise.<br/>\n&gt;   Annette.<br/>\n&gt; <br/>\n&gt; \t\t<br/>\n&gt; ---------------------------------<br/>\n&gt; New Yahoo! Messenger with Voice. Call regular phones from your PC <br/>\n </span></blockquote>and save big.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Annette Intro","postDate":"1145911231","msgId":12410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUyamQzdis0N3Z2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlGOTIzQkU1LTc5RDktNDM1QS05MERCLTIzRkI1NkQyQTYwM0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":12405,"nextInTopic":12426,"prevInTime":12409,"nextInTime":12411,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... repercussions ... Doo ... child ... parent ... asking ... There is also a difference between protecting a child from harm -- whether physical or emotional","messageBody":"<div id=\"ygrps-yiv-2112142570\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll <br/>\n&lt;fetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 24, 2006, at 10:34 AM, trektheory wrote:<br/>\n&gt; <br/>\n&gt; &gt; I&#39;ve had to with my son.  [shelter from media] The <br/>\n </span></blockquote>repercussions  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; otherwise were too<br/>\n&gt; &gt; awful.  He&#39;s the sensitive type.  I remember when he saw Scooby-<br/>\n </span></blockquote>Doo<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; on Zombie Island at a friends and had a problem with that.<br/>\n&gt; <br/>\n&gt; There&#39;s a difference -- an important difference -- between a <br/>\n </span></blockquote>child  <br/>\n<blockquote><span title=\"ireply\"> &gt; who wants help avoiding something they don&#39;t want to see and a <br/>\n </span></blockquote>parent  <br/>\n<blockquote><span title=\"ireply\"> &gt; deciding the child won&#39;t be able to handle something they are <br/>\n </span></blockquote>asking  <br/>\n<blockquote><span title=\"ireply\"> &gt; to see.<br/>\n<br/>\n </span></blockquote>There is also a difference between protecting a child from harm -- <br/>\nwhether physical or emotional -- and letting them find out the hard <br/>\nway!  Children don&#39;t know to not run out in front of a running car <br/>\nbefore being taught it, but that&#39;s and easy danger for them to <br/>\nvisually learn about.  The other kinds can be harder, because less <br/>\nconcrete.  But if I KNOW something will be psychologically harmful <br/>\nto my child at that stage of development, I guide him away from <br/>\nharm.  <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Annette Intro","postDate":"1145905936","msgId":12405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGOTIzQkU1LTc5RDktNDM1QS05MERCLTIzRkI1NkQyQTYwM0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGUyaW5tNyttZTRiQGVHcm91cHMuY29tPg==","referencesHeader":"PGUyaW5tNyttZTRiQGVHcm91cHMuY29tPg=="},"prevInTopic":12391,"nextInTopic":12410,"prevInTime":12404,"nextInTime":12406,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... There s a difference -- an important difference -- between a child who wants help avoiding something they don t want to see and a parent deciding the child","messageBody":"<div id=\"ygrps-yiv-1984207639\">On Apr 24, 2006, at 10:34 AM, trektheory wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve had to with my son.  [shelter from media] The repercussions  <br/>\n&gt; otherwise were too<br/>\n&gt; awful.  He&#39;s the sensitive type.  I remember when he saw Scooby-Doo<br/>\n&gt; on Zombie Island at a friends and had a problem with that.<br/>\n<br/>\n </span></blockquote>There&#39;s a difference -- an important difference -- between a child  <br/>\nwho wants help avoiding something they don&#39;t want to see and a parent  <br/>\ndeciding the child won&#39;t be able to handle something they are asking  <br/>\nto see.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Annette Intro","postDate":"1145889287","msgId":12391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUyaW5tNyttZTRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA0MjQwNDM1ajJkMGI2ODBjdDY0MmZkMDM4NjAxMjU5NzRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":12386,"nextInTopic":12405,"prevInTime":12390,"nextInTime":12392,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... wonderful ... the media, ... I ve had to with my son.  The repercussions otherwise were too awful.  He s the sensitive type.  I remember when he saw","messageBody":"<div id=\"ygrps-yiv-1572458552\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Pampered Chef Michelle&quot; <br/>\n&lt;pamperedmichelle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Oy, read the archives from the past two weeks.  We just had a <br/>\n </span></blockquote>wonderful<br/>\n<blockquote><span title=\"ireply\"> &gt; discussion about limits.  I haven&#39;t &quot;sheltered&quot; my children from <br/>\n </span></blockquote>the media,<br/>\n<blockquote><span title=\"ireply\"> &gt; ever.  <br/>\n<br/>\n </span></blockquote>I&#39;ve had to with my son.  The repercussions otherwise were too <br/>\nawful.  He&#39;s the sensitive type.  I remember when he saw Scooby-Doo <br/>\non Zombie Island at a friends and had a problem with that.  His <br/>\nfriend was younger, and watched things that would have freaked my son <br/>\nout.  Kids are so different.  (People are, but then, kids are people, <br/>\nso we have to expect them to be different, I guess!)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And I don&#39;t see my<br/>\n&gt; children as being juvenile.  :)<br/>\n<br/>\n </span></blockquote>Whereas I don&#39;t see myself as mature!  ;-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I will never write a mail this long again, promise.<br/>\n&gt; &gt; Annette.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Oh don&#39;t promise that!  I tend to ramble for pages and pages (if e-<br/>\n </span></blockquote>mail<br/>\n<blockquote><span title=\"ireply\"> &gt; actually had pages) :)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I&#39;m prone to long rambles, myself.  I didn&#39;t think her intro was long!<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Annette Intro","postDate":"1145878535","msgId":12386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MjQwNDM1ajJkMGI2ODBjdDY0MmZkMDM4NjAxMjU5NzRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12384,"nextInTopic":12391,"prevInTime":12385,"nextInTime":12387,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... OK, I m jealous.  Those are all names I wanted to name our children and got the thumbs down,  One would think having been married to a medievalist who also","messageBody":"<div id=\"ygrps-yiv-1869241251\">On 4/23/06, Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hallo Group.<br/>\n&gt;<br/>\n&gt; My name is Annette. I have three sons, Arthur (7), Henry (4) and Linus<br/>\n&gt; (2).<br/>\n<br/>\n<br/>\n </span></blockquote>OK, I&#39;m jealous.  Those are all names I wanted to name our children and got<br/>\nthe thumbs down,  One would think having been married to a medievalist who<br/>\nalso loved open sourc computers that he would have loved those names.  :)<br/>\nWelcome, Annette.<br/>\n<br/>\nI think most of us had odd ideals about what raising children was like until<br/>\nwe actually had them.  There is something about holding that tiny bundle and<br/>\nwishing you could spend the rest of your life with them that makes some of<br/>\nus actually seek to do that.  I wish everyone had the ability to trust<br/>\nthemselves in raising their own children!<br/>\n<br/>\nThe things that I need to work on and hope to get input for are:<br/>\n<blockquote><span title=\"ireply\"> &gt; -peacefull parenting,<br/>\n&gt; -what limits are reasonable to set (mostly media contents, rated R movies<br/>\n&gt; etc),<br/>\n&gt; -there are 3 kids - sometimes a member of the family will not get what<br/>\n&gt; they want so we can adress the need of all of us better (one wants TV, 2<br/>\n&gt; want Park)<br/>\n<br/>\n<br/>\n </span></blockquote>Oy, read the archives from the past two weeks.  We just had a wonderful<br/>\ndiscussion about limits.  I haven&#39;t &quot;sheltered&quot; my children from the media,<br/>\never.  Even during the 9-11 disaster my children were aware of what was<br/>\ngoing on.  My (then) 2yo went about playing other things and my older two<br/>\nasked lots of questions.  As far as rated R movies, I&#39;ve never been very<br/>\nstrict about such.  I&#39;ll let the kids know what kind of content a movie has<br/>\nin it.  For instance, &quot;There may be lots of kissing and naked bodies&quot; or<br/>\n&quot;Lots of people get killed in this movie in very violent ways.&quot;  Usually my<br/>\nchildren will decide that they don&#39;t want to watch those themes and so will<br/>\nnot watch them.  I also will watch movies with my children that I have<br/>\nconcerns might upset them.  I find that mostly they aren&#39;t quite interested<br/>\nin movies that have strong nudity or violence in them anyway.  I recently<br/>\nhad a friend who was shocked that I let my girls (almost 11 and 14) to watch<br/>\nBrokeback Mountain.  &quot;But it has such mature themes!&quot;  And I don&#39;t see my<br/>\nchildren as being juvenile.  :)<br/>\n<br/>\nI will never write a mail this long again, promise.<br/>\n<blockquote><span title=\"ireply\"> &gt; Annette.<br/>\n<br/>\n<br/>\n </span></blockquote>Oh don&#39;t promise that!  I tend to ramble for pages and pages (if e-mail<br/>\nactually had pages) :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Annette Intro","postDate":"1145875744","msgId":12384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDlBMjQxLUY5ODctNDJDRS1BNTY1LTNCQjFDM0NFODczRkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12383,"nextInTopic":12386,"prevInTime":12383,"nextInTime":12385,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... What R rated movies have they asked to watch? What do you fear will happen if they do watch those movies? By forbidding you re making the movies more","messageBody":"<div id=\"ygrps-yiv-20232078\">On Apr 23, 2006, at 4:50 PM, Annette W wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what limits are reasonable to set (mostly media contents, rated R  <br/>\n&gt; movies etc)<br/>\n<br/>\n </span></blockquote>What R rated movies have they asked to watch?<br/>\n<br/>\nWhat do you fear will happen if they do watch those movies?<br/>\n<br/>\nBy forbidding you&#39;re making the movies more powerful than your kids.  <br/>\nYou&#39;re telling them that they aren&#39;t competent in this area in a  <br/>\nworld that is constantly telling them aren&#39;t competent because  <br/>\nthey&#39;re kids.<br/>\n<br/>\nEmpower them. Help them gain the information and skills so they&#39;re  <br/>\nmore powerful than a thing.<br/>\n<br/>\nIf you see your job as helping them get what they want and avoid what  <br/>\nthey don&#39;t want, then how can you help them? Give them information to  <br/>\nhelp them make more informed decisions. (Real information for them to  <br/>\nthink over. Not said in &quot;Here&#39;s why you obviously don&#39;t want to see  <br/>\nthis and if you decide otherwise, I&#39;m not responsible because I told  <br/>\nyou so,&quot; way. Be there with them to give them support. Give them  <br/>\npower over it: fast forward through parts they want to skip, stop  <br/>\nwhen they want to stop. Watch the making of features to see how scary  <br/>\nparts are done. Find out where the parts are that will frighten them  <br/>\n(ScreenIt! is a good place http://www.screenit.com).<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Annette Intro","postDate":"1145874906","msgId":12383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEQUNDMzA2LUQyQkQtNEFCOS04NEYyLUI1ODlFMUFEMTY0OEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDhDODM1NzMyRjJEMTkzOS0xODI4LTI0MEZAbWJsay1yMzIuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4gPDhDODM1NzMyRjJEMTkzOS0xODI4LTI0MEZAbWJsay1yMzIuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":12382,"nextInTopic":12384,"prevInTime":12382,"nextInTime":12384,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... *I* don t know it. I just go to Sandra s site and click on Joyce ;-) http://home.earthlink.net/~fetteroll/rejoycing/ Joyce [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-1777775206\">On Apr 24, 2006, at 1:00 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Joyce&#39;s site: rejoycing----I should know that by heart, but I don&#39;t.<br/>\n&gt; Hot link Fairy???<br/>\n<br/>\n </span></blockquote>*I* don&#39;t know it. I just go to Sandra&#39;s site and click on &quot;Joyce&quot; ;-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152271008,"authorName":"Rue Kream","from":"&quot;Rue Kream&quot; &lt;skreams@...&gt;","profile":"ruekream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Annette Intro","postDate":"1145864746","msgId":12382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWIwMWM2Njc3MyQxOWI0MTRkMCQwNDAyYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PDhDODM1NzMyRjJEMTkzOS0xODI4LTI0MEZAbWJsay1yMzIuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":12381,"nextInTopic":12383,"prevInTime":12381,"nextInTime":12383,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... http://home.earthlink.net/~fetteroll/rejoycing/ ~Rue [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-973710938\"><blockquote><span title=\"ireply\">&gt;&gt;Joyce&#39;s site: rejoycing----I should know that by heart, but I don&#39;t. <br/>\n<br/>\n<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\n<br/>\n~Rue<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Annette Intro","postDate":"1145854847","msgId":12381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODM1NzMyRjJEMTkzOS0xODI4LTI0MEZAbWJsay1yMzIuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":12378,"nextInTopic":12382,"prevInTime":12380,"nextInTime":12382,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"... From: Annette W  The things that I need to work on and hope to get input for are: -peacefull parenting, -=-=-=- Great place for","messageBody":"<div id=\"ygrps-yiv-1639981737\">-----Original Message-----<br/>\nFrom: Annette W &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annette75093@...\">annette75093@...</a>&gt;<br/>\n<br/>\n  The things that I need to work on and hope to get input for are:<br/>\n  -peacefull parenting,<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nGreat place for this! &lt;g&gt; You also might want to get Rue&#39;s book, <br/>\nParenting a Free Child: An Unschooled Life<br/>\n<br/>\nSandra&#39;s site: www.sandradodd.com/unschooling<br/>\n<br/>\nJoyce&#39;s site: rejoycing----I should know that by heart, but I don&#39;t. <br/>\nHot link Fairy???<br/>\n<br/>\n-=-=-=-<br/>\n   -what limits are reasonable to set (mostly media contents, rated R <br/>\nmovies<br/>\netc),<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nOur limits are set by the individuals. Cameron (18) likes scary movies. <br/>\nDuncan (10) likes anime. Ben (husband) likes independent films. I <br/>\nreally like comedies.<br/>\n<br/>\nDuncan and I watched Pirates of the Carribean the other night. Ferris <br/>\nBueller&#39;s on tap for tomorrow (we&#39;ll all watch that). Ben & I watched <br/>\nWit last week. Cameron and I watched Drumline Friday. Rent&#39;s in the <br/>\nqueue right now---I doubt Duncan will be interested. He tends to shy <br/>\naway from too much violence, really scary things, and romance---things <br/>\nthat are generally rated R. He&#39;s fine with rough language. But he won&#39;t <br/>\n*choose* movies with sex/love scenes or things that may frighten him or <br/>\none with real looking violence.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n   -there are 3 kids - sometimes a member of the family will not get <br/>\nwhat they<br/>\nwant so we can adress the need of all of us better (one wants TV, 2 <br/>\nwant Park)<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nThat can be really hard, but working out &quot;if..thens&quot; can help: If we go <br/>\nto the park, then we can stop by the game store on the way home. If we <br/>\nwatch the rest of this show, then we can leave for the park. OH! And <br/>\nTIVO! Then there&#39;s no more TV anxiety! &lt;g&gt; We keep a portable DVD <br/>\nplayer in the car for Duncan when he doesn&#39;t particularly want to go/do <br/>\nwhatever. That&#39;s helped a bunch---for long trips too!<br/>\n<br/>\n-==-=-<br/>\n<br/>\n<br/>\n  I will never write a mail this long again, promise.<br/>\n<br/>\n--=-=-=-<br/>\n<br/>\nChances are you&#39;ll have much longer future posts! &lt;G&gt; Don&#39;t sweat it!<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":242520548,"authorName":"Annette W","from":"Annette W &lt;annette75093@...&gt;","profile":"annette75093","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Annette Intro","postDate":"1145825445","msgId":12378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDIzMjA1MDQ1LjI2MjQ4LnFtYWlsQHdlYjM1OTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":12381,"prevInTime":12377,"nextInTime":12379,"topicId":12378,"numMessagesInTopic":0,"msgSnippet":"Hallo Group. My name is Annette. I have three sons, Arthur (7), Henry (4) and Linus (2). Before I had kids I was a pediatric nurse. I thought kids are always","messageBody":"<div id=\"ygrps-yiv-1006925990\">Hallo Group.<br/>\n   <br/>\n  My name is Annette. I have three sons, Arthur (7), Henry (4) and Linus (2). <br/>\n  Before I had kids I was a pediatric nurse. I thought kids are always ill, they need set routines and are best kept in sterile conditions away from their parents who only do harm. Not quite as strict as I state it here, but basically I had very little trust in me or anybody to know what&#39;s right for kids. <br/>\n  Then I had Arthur, read a couple of books, some free magazines and that&#39;s when the confusion started. Who&#39;s right who&#39;s wrong? Obviously I am wrong, my child doesn&#39;t read and write by 2. <br/>\n  I&#39;ve tried Waldorf, because that sheltered me from early literacy and gave me a little help during Arthurs preschool time. Then Waldorf became all inclusive. Can&#39;t watch movies, TV, play computer games or for that matter have INFORMATION about Arthurs activities while at school. All clouded in a veil of waldorfian wisdom that I as a mere mortal (by that time) mother of 3 could not possibly understand. <br/>\n  A very brief stint at a blue ribbon, awards public school (exactly 5 schooldays) made it clear that&#39;s not the way to go.<br/>\n  So we came to homeschooling and through the internet I found out about unschooling. So here we are. <br/>\n   <br/>\n  The things that I need to work on and hope to get input for are:<br/>\n  -peacefull parenting,<br/>\n  -what limits are reasonable to set (mostly media contents, rated R movies etc),<br/>\n  -there are 3 kids - sometimes a member of the family will not get what they want so we can adress the need of all of us better (one wants TV, 2 want Park)<br/>\n   <br/>\n  I will never write a mail this long again, promise.<br/>\n  Annette.<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nNew Yahoo! Messenger with Voice. Call regular phones from your PC and save big.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":12526,"nextTopicId":12570}}