{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247088336,"authorName":"e_mckinney@hotmail.com","from":"e_mckinney@...","profile":"erinanddavey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to group...","postDate":"1307545004","msgId":46817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbzJqYytzNXE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbGw4NStzN2FnQGVHcm91cHMuY29tPg=="},"prevInTopic":46805,"nextInTopic":0,"prevInTime":46816,"nextInTime":46818,"topicId":46804,"numMessagesInTopic":0,"msgSnippet":"Noelle, We are still fairly new on the path of unschooling, but I hear your worry and frustration because we just went through the same thing.  I have 3 boys","messageBody":"<div id=\"ygrps-yiv-265741949\">Noelle,<br/>\n<br/>\nWe are still fairly new on the path of unschooling, but I hear your worry and frustration because we just went through the same thing.  I have 3 boys and one of them just turned 14(the oldest) and video games pretty much all day and into the night.  I did post here, maybe a couple of months ago, about some media issues we had in our house and have since met everyone&#39;s need on that one...thank you to all that supplied suggestions!<br/>\n<br/>\nDs has done a couple years of school, homeschooled, wanted to try again and went back for 3 months over a year ago and now we are walking, slowly, down the unschooling path.  When we started saying &quot;yes&quot; more, in our house, it was totally media for him.  In the beginning he was mean, rude, yelling, impatient, did not want to participate in anything that was not about his gaming, and it was also HARD for us because we were also fighting every instinct in our body not to yank it all away!  But instead, I kept reading (Prarent/Teen Breakthrough by Mira Kirshenbaum and Charles Foster , which was suggested here and such a helpful book!), researching, and talking with my husband. Listening to DS&#39;s &quot;no&quot;s whenever we asked him if he would like to participate...dinners, outings, etc...(also HARD because I missed him)  But I now know it&#39;s all been for the better because we are now starting to see this kid emerge that will stop his gaming to help one of his brothers or say things like &quot;not this time mom, but next time you go, I will&quot; and he does!  He still plays a ton, especially by today&#39;s standards, but he has become less irritable, kinder, helpful, more willing to participate, and so much more!  Like I said, we are still definitely in the beginning and all still learning, but even with the small steps, our family life has improved all around!  This was just a quick, straight forward snippet because I had such a hard time finding someone else in the same situation, but please feel free to email me if you just need to talk or vent or whatever.  It is definitely a path that requires so much internal searching, exploring, and examination.<br/>\n<br/>\n...Erin</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to group...","postDate":"1307467973","msgId":46805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbG5jNSs5N3VzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbGw4NStzN2FnQGVHcm91cHMuY29tPg=="},"prevInTopic":46804,"nextInTopic":46817,"prevInTime":46804,"nextInTime":46806,"topicId":46804,"numMessagesInTopic":0,"msgSnippet":"... **************** There could be any number of things going on, there. He needs time to decompress from school. There s a contrast between having a Little","messageBody":"<div id=\"ygrps-yiv-338399988\">&quot;ncg30&quot; &lt;ncg30@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My son is very into his video games and computer (mostly watching You Tube videos from other gamers, their game reviews, watching them play the games he likes). This is all he does when he is home after his homework.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThere could be any number of things going on, there. He needs time to decompress from school. There&#39;s a contrast between having a Little time to do something he enjoys vs the hours and hours of boredom he&#39;s expected to endure every day - those hours feel sooooo much longer that its natural for him to want to try to get some of those hours back while playing. And! (and this is important) he likes gaming. All of those will play into wanting to do nothing but game, read about gaming, talk about gaming. <br/>\n<br/>\nOne of the advantage of bringing him home is that he can have more time to do what he enjoys. That will reduce some of the urgency to play (seemingly) all the time - but not at first. At first, he&#39;s not going to trust that he really Can play all he wants, so he&#39;ll be trying to play even More!. That&#39;s a natural human reaction. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I know another mom whose son is older (19) and was always into his games and computers and has now basically shut himself off from his parents and will lock himself in his room and just play and not talk to them hardly at all. He will be extremely nasty and rude to his mother.  This scares me. <br/>\n </span></blockquote>*************<br/>\n<br/>\nThe way to prevent it is to get interested in your son&#39;s interests - yes, that means his games. Be as curious and supportive as if he was on a sports team or some other club - this is important to him! Sit with him while he plays - I don&#39;t mean for days on end, but enough for you to have a grasp of the games and can talk about them. If you&#39;ve never played video games, find a game that appeals to you and learn to play it so you can have an understanding of the basic process and vocabulary and a sense of what&#39;s so intriguing. <br/>\n<br/>\nDo kind things like bring him easy-to-eat snacks and drinks while he&#39;s playing. Learn game etiquette so you&#39;re not interrupting at terribly rude moments - look for save point and times when screens are loading to chat or ask questions. Understand which games save automatically and which depend on save points, too. <br/>\n<br/>\nBe a friend! Be someone he wants to hang out with and talk to, not someone he wants to avoid. <br/>\n<br/>\nKnow that you can transition to unschooling slowly - in fact, its a good idea. If its going to cause trouble at home to say &quot;now you can play games all you want&quot; then don&#39;t do that right away ;) Do say Yes to more and longer gaming, though and make a concerted effort to take that time as seriously as though he was doing something you value more (read, play an instrument). Also, offer other fun things to do together so he&#39;s not stuck between &quot;go find something to do&quot; or play his games - Help him find other fun things. <br/>\n<br/>\nMy stepson moved (back) in with us at 13 and started unschooling shortly after, and he played a loooot of Runescape for a couple years, but we embraced that the way we would any big interest. Now, at almost-18 (he would &quot;graduate&quot; this year) he rarely plays, but still enjoys it now and then. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":108731863,"authorName":"ncg30","from":"&quot;ncg30&quot; &lt;ncg30@...&gt;","profile":"ncg30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New to group...","postDate":"1307465797","msgId":46804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbGw4NStzN2FnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46805,"prevInTime":46803,"nextInTime":46805,"topicId":46804,"numMessagesInTopic":0,"msgSnippet":"Hello I am just finishing the Big Book of Unschooling.  I have one son who is almost 13, going into 7th grade next year. I live in New Jersey. My son is very","messageBody":"<div id=\"ygrps-yiv-1860025407\">Hello I am just finishing the Big Book of Unschooling.  I have one son who is almost 13, going into 7th grade next year. I live in New Jersey. My son is very into his video games and computer (mostly watching You Tube videos from other gamers, their game reviews, watching them play the games he likes). This is all he does when he is home after his homework. My husband wants it to be cut back drastically.  I know another mom whose son is older (19) and was always into his games and computers and has now basically shut himself off from his parents and will lock himself in his room and just play and not talk to them hardly at all. He will be extremely nasty and rude to his mother.  This scares me.  So I don&#39;t know what to do, if anything, since my son is still younger.  He&#39;s already starting with some of the rudeness and anger either towards his games or towards me.<br/>\n<br/>\nI am considering unschooling but would love to hear from others who pulled their children out of school at a later age like this.  Also from others whose children are very into gaming and/or computers.  I know in the book it talks about how parents would feel if they let their kids do what they want that all day (for example) they would play video games all day and I&#39;m having a hard time not thinking that way myself about my son.  But I do know I&#39;ve never been thrilled with the public school system and my son doesn&#39;t really like school, never has.  Mostly because overall he is on the quiet side and hasn&#39;t really made any friends, he talks to some kids at school but never had a close friend or buddy he hangs out with outside of school  He&#39;s been picked on somewhat.  We&#39;ve moved twice since he started school and are moving again this summer.  So I&#39;m trying to decide if I should send him to the school in our new town or not.  Any feedback from others would be greatly appreciated.  It&#39;s wonderful to read the book but to hear from others and their real life current experiences, especially if they are similar to mine, would be most helpful. <br/>\n<br/>\nThank you and I&#39;m glad to be a part of the group!<br/>\n<br/>\nNoelle :)</div>","specialLinks":[]}],"prevTopicId":46813,"nextTopicId":46710}}