{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":121,"messages":[{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203111160","msgId":29782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNTBkbys0aG1nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYTcwMWM4NzAwZSQ0MzQxZmJmMCQzNDAxYThjMEBsZXNsZXlwYz4="},"prevInTopic":29781,"nextInTopic":29783,"prevInTime":29781,"nextInTime":29783,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"... That s always my biggest problem - I start out with different voices for the characters but by about 1/4 of the way in it all sort of blends into a mush.","messageBody":"<div id=\"ygrps-yiv-1728315223\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lesley Cross&quot; &lt;lcross@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  And I<br/>\n&gt; get to have fun making up voices!<br/>\n&gt; <br/>\n </span></blockquote>That&#39;s always my biggest problem - I start out with different voices <br/>\nfor the characters but by about 1/4 of the way in it all sort of blends <br/>\ninto a mush. DH is much better at keeping all the voices separate (and <br/>\ninventing really fun ones).<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203110898","msgId":29781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNTA1aStzcGQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjE1MTIxMXY1ZGYyYTk3YWk3OWQ0MTI4MDI2ZGFjMzBAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":29780,"nextInTopic":29782,"prevInTime":29780,"nextInTime":29782,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"Whoa there! You *were* talking about training dyslexics and pushing a child s physical therapy to screaming pain - in both cases, the children involved are","messageBody":"<div id=\"ygrps-yiv-1531878779\">Whoa there! You *were* talking about &quot;training dyslexics&quot; and pushing <br/>\na child&#39;s physical therapy to screaming pain - in both cases, the <br/>\nchildren involved are fully capable of choosing, considering, and <br/>\ndiscussing options. Yes, in most cases (including where this thread <br/>\nstarted from), we&#39;re talking about children with generally age-<br/>\nappropriate development in terms of physical, emotional and <br/>\npsychological development - which does NOT include school grade &quot;age <br/>\nlevel&quot; stuff. Your little one is not on that level yet (you indicate <br/>\nshe&#39;s at about a year old in terms of development). I *know* I <br/>\ndidn&#39;t &quot;ask&quot; DS when he was a year old if he wanted medication for <br/>\nhis ear infection(s) - I&#39;d just give it to him. But, once he was able <br/>\nto communicate (which your little one will someday do), there were <br/>\nway more options. For that matter, I *chose* to stop giving him a <br/>\nparticular medication when he was a wee one because it caused his <br/>\nbody to shake - not a lot, not earthshaking, but not &quot;normal&quot; for him <br/>\neither. It meant that I spent a lot of time sitting in a steamy <br/>\nbathroom instead of just giving him this medication (for a minor <br/>\nrespiratory infection), way less convenient and more time consuming <br/>\nthat just giving him the medication (BTW it was a listed side effect <br/>\nof the medication at that). <br/>\n<br/>\nBut jumping from the discussion of &quot;dyslexics need special training <br/>\nfor their own good&quot; to the complex parenting needed for a very unique <br/>\nand painful situation is really not a reasonable jump. Kind of like <br/>\nthe saying that hard cases make bad law. In some ways, it sounds <br/>\nlike, while we (in general) may be presuming a fairly neurotypical, <br/>\nphysically average, child in a fairly average parenting situation, <br/>\nyou seem to be going over the opposite extreme, presuming that &quot;for <br/>\nthe child&#39;s own good&quot; is an overall good strategy in general. While <br/>\nit is perhaps necessary for now with your own little one, that is in <br/>\nno way the typical situation for the majority of people. And, if the <br/>\nchild who is being pushed to screaming is capable of discussing the <br/>\nsituation, that should be happening (as some here have indicated that <br/>\nthey have personal experience with similar situations and it should <br/>\nnot be pushed to that extreme). As much freedom and choice as is <br/>\n*possible* is the overall idea.<br/>\n<br/>\nWhile you have a difficult and unique situation, please do not expect <br/>\nthat giving a recommendation of &quot;doing it for the child&#39;s own good&quot; <br/>\nis going to go unquestioned here.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203109960","msgId":29780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNHY4OCs1dTBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI4MTM0NS40MTAwMi5xbUB3ZWI1NDEwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":29778,"nextInTopic":29781,"prevInTime":29779,"nextInTime":29781,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"Chiming in here as a dyslexic person who s parents spent a small fortune on special training   My parents drove 3 hrs one way once a week to bring me from","messageBody":"<div id=\"ygrps-yiv-1685321396\">Chiming in here as a dyslexic person who&#39;s parents spent a small<br/>\nfortune on &quot;special training&quot;   My parents drove 3 hrs one way once a<br/>\nweek to bring me from the Coast of NC to a specialized center in<br/>\nDurham NC at the Hill Center for tutoring, spent summers sending me to<br/>\nexpensive boarding school programs at LD schools, put me in all sorts<br/>\nof private schools and so on and on.   <br/>\nLong story short... I could read at age 3!   I have no word attack and<br/>\ncouldn&#39;t learn phonics no matter how much money was paid to a tutor! <br/>\n I memorized MILLIONS of words and was a fluent reader and speller<br/>\nfrom a very early age... I don&#39;t remember not being able to read so it<br/>\nmight have been before age 3 but that&#39;s when my mother realized I<br/>\ncould read (I spelled biscuit for my brother for his homework!)   <br/>\n<br/>\nI also realized ON MY OWN that closing one eye made the words stop<br/>\ntheir dance across the page!   I still do that sometimes!   Anyway my<br/>\npoint is that I wasn&#39;t exactly left to figure it out on  my own or<br/>\nunschooled to learn to read consciously on the part of my parents<br/>\nbecause I did it before they ever considered any formal education!   I<br/>\ncan&#39;t imagine what would have happened if I had been dragged to all<br/>\nthose places in order to learn to read at all!!!  <br/>\n<br/>\nI am so thankful to have been born into a print rich house where<br/>\neveryone read, where there were books and I was read to extensively<br/>\nfor hours and hours and the relationship between print and words was<br/>\nmade naturally without coercive behavior on the part of my parents...<br/>\nwait!  HEY that sounds like unschooling!   Too bad they bought the<br/>\nparty line at the traditional schools that without specialized<br/>\ntraining and tutoring I would never make it through school!   I like<br/>\nto think I made it DESPITE the training!<br/>\n<br/>\nLisa Blocker</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203107185","msgId":29778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNHNoaCtyMXB0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":29777,"nextInTopic":29780,"prevInTime":29777,"nextInTime":29779,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"Early on, before I was connected with many unschoolers, I took a LOT of comfort from reading books and articles about Sudbury Valley School, a school where","messageBody":"<div id=\"ygrps-yiv-1397459134\">Early on, before I was connected with many unschoolers, I took a LOT<br/>\nof comfort from reading books and articles about Sudbury Valley<br/>\nSchool, a &quot;school&quot; where kids choose what to do, not from a preset<br/>\nmenu, but are allowed true freedom. They have never, in their 40 years<br/>\nof existence, had a child diagnosed with a &quot;reading disorder&quot;, and all<br/>\ngraduates of the school know how to read. As Kelly so very eloquently<br/>\nand firmly put it, a child will read *when they are ready to*. I have<br/>\nno doubt my youngest would have *developed* dyslexia if he was in a<br/>\nschool setting, or I pushed reading on him at all. He used to<br/>\nfrequently *say* things in a jumbled-up way, and he didn&#39;t even hear<br/>\nthat&#39;s what he&#39;d done - to him, it sounded just like what had been<br/>\nsaid to him. That&#39;s lessened a LOT as he&#39;s gotten older.<br/>\n<br/>\nIt probably would have gotten worse if I felt as if I had to TRAIN him<br/>\nto say things right, and TRAIN him to read. Instead, I kept trusting<br/>\nthat he it would all straighten out, and he would read when he was<br/>\nready. Even when he was frustrated with not knowing how to read. He<br/>\ndidn&#39;t want any type of lessons, following along with a finger, etc.<br/>\nSo he was frustrated for a time. I kept reminding him that when he was<br/>\nready, he would read, and until then, either his brother or I would<br/>\nread to him.<br/>\n<br/>\nIt&#39;s working out. In its (and his) own time.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203106289","msgId":29776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjE1MTIxMXY1ZGYyYTk3YWk3OWQ0MTI4MDI2ZGFjMzBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDhDQTNFMUZGQUFFQjQwOS1FODQtM0JFQUB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPgkgPDUzOTgyOS40NDEzOC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+CSA8NjdhOWQ3NTAwODAyMTUxMDIzdDM1MTllMTI1eGYzNDE3Y2Q0MjQwMzQ4OTNAbWFpbC5nbWFpbC5jb20+CSA8OENBM0UxRkZBQUVCNDA5LUU4NC0zQkVBQHdlYm1haWwtbWUxNS5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":29775,"nextInTopic":29777,"prevInTime":29775,"nextInTime":29777,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"... **My daughter is from an orphanage in China.  She has NO language.  No Chinese, no English.  She was beaten and neglected.  Being left in the same diaper","messageBody":"<div id=\"ygrps-yiv-438666695\"><blockquote><span title=\"ireply\">&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; Children like clean butts. Adults too.<br/>\n&gt;<br/>\n&gt; Why would a child choose not to have a diaper changed?<br/>\n&gt;<br/>\n&gt; Why would an adult choose not to have a diaper changed?<br/>\n&gt;<br/>\n&gt; What could you do to change that? And make it more appealing?<br/>\n&gt;<br/>\n </span></blockquote>**My daughter is from an orphanage in China.  She has NO language.  No<br/>\nChinese, no English.  She was beaten and neglected.  Being left in the<br/>\nsame diaper for days until wounds formed was not unusual for her.  She<br/>\nwould choose not to have her diaper changed because when she was<br/>\nchanged she was beaten for not being potty trained.  She has to<br/>\novercome the fear of being beaten.  AND it&#39;s my duty to make sure she<br/>\ndoesn&#39;t have enormous sores that cover 50% or more of her bottom.  So<br/>\nshe&#39;s being changed against her will, and every time we do it, she<br/>\nlearns a beating isn&#39;t part of the changing process.  Each time, the<br/>\ndiapering process becomes easier on us both and slowly the tension and<br/>\nfear is losing it&#39;s grip on my daughter.  The problem with this list<br/>\nis you all *seem* to presuppose bio children who share a common<br/>\nlanguage with their parents.&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; She doesn&#39;t want to be treated for a<br/>\n&gt; nasty inner ear infection...should I say &quot;Oh hell, whatever...if she<br/>\n&gt; wants the meds she&#39;ll ask?&quot; Meanwhile she&#39;s suffering tremendous pain<br/>\n&gt; and fevers and her ear drum could perforate.<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; Either THIS *or* THAT---no other options/possibilities?<br/>\n<br/>\n </span></blockquote>**What is the other option Kelly?  Perf her ear drum for her?  Maybe<br/>\ngeneral anesthesia for 2 weeks?  Hiding meds in food is a big NO NO<br/>\nfor children that were starved, food should be comfort not punishment.<br/>\n So she gets the meds, and then we do our best to comfort her.  And we<br/>\nrecognize that this is temporary.  With good care she shouldn&#39;t have<br/>\nthese issues anymore.  Eventually, when she&#39;s ready, she will acquire<br/>\nlanguage.  Once she does and truly understands the words we can talk<br/>\nabout consequences and choices.  But until then, you would suggest<br/>\nwhat?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; What&#39;s more important?<br/>\n&gt; Health and safety or choosing everything?<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; I&#39;d say 99% of humans choose health and safety, so I believe that<br/>\n&gt; choosing everything is more important.<br/>\n&gt;<br/>\n </span></blockquote>**Children who have learned NO ONE cares about their comfort and<br/>\nsafety, emotional security and happiness DO NOT choose health and<br/>\nsafety.  That is false.  Children who have never been given anything<br/>\nare frequently overwhelmed by choices and so those choices have to be<br/>\nlimited until they can process their new situations.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When the smaller, weaker human is not honored.<br/>\n&gt;<br/>\n </span></blockquote>**I&#39;d say that making sure my daughter&#39;s body is cared for, that her<br/>\nsafety is my top concern and her feelings of comfort and meeting her<br/>\nneeds are honored IS the most important thing I can do for her at this<br/>\npoint.  Until she can understand what it means to have choices and she<br/>\ncan figures out that when she needs something her parents will provide<br/>\nit she can&#39;t make decisions for herself.  (Additionally she&#39;s<br/>\ndevelopmentally about 12 months old and how many choices do you give a<br/>\n1 yr old anyway?)  Do you allow a 12 month old child to decide not to<br/>\ntake meds?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; First off, why DOESN&#39;T the child know the consequences?<br/>\n&gt;<br/>\n&gt; ANd why do you think a child cannot appreciate the consequences and<br/>\n&gt; make a rational decision concerning them???<br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>** Speaking for my child, see above as to why she doesn&#39;t know the<br/>\nconsequences and why it&#39;s beyond her capability at this point in time<br/>\nto make a rational decision.  Do you think she can?  How do you<br/>\nsuggest a child home 4 weeks and neglected and abused for 3.5 yrs be<br/>\nmade to understand how to make a rational decision concerning any<br/>\nchoice?  Right now she can choose between two colors of sippy cups<br/>\nbecause she knows what she likes and language isn&#39;t necessary.   I<br/>\ngive her the ability to choose what she can at this point in time and<br/>\nI make decisions for her when choices aren&#39;t easy to make.  Deciding<br/>\nfor her is preferable to her dissolving into frustration because it&#39;s<br/>\ntoo overwhelming for her to make the choices herself.<br/>\n<br/>\nI know you all don&#39;t like my opinions and that&#39;s OK but you all seem<br/>\nvery quick to attribute abusive and cruel intentions to all parents<br/>\nwhen I think more often than not parents do what they know (right or<br/>\nwrong) and they are scared to do anything different.  And FWIW you<br/>\nshould not assume all parents have blank slate kids with no issues to<br/>\novercome.  Some of us have special circumstances.<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":147745368,"authorName":"Lesley Cross","from":"&quot;Lesley Cross&quot; &lt;lcross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203105993","msgId":29777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTcwMWM4NzAwZSQ0MzQxZmJmMCQzNDAxYThjMEBsZXNsZXlwYz4="},"prevInTopic":29776,"nextInTopic":29778,"prevInTime":29776,"nextInTime":29778,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"RE: training it may be a poor choice of words but she s right. People with dyslexia don t grow out of it, they have to practice and learn to work through it.","messageBody":"<div id=\"ygrps-yiv-208373493\">&quot;RE: training it may be a poor choice of words but she&#39;s right. People<br/>\nwith dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\nwork through it. We can like it or not but there are things we have<br/>\nto do TO our children for their own good whether or not they like it<br/>\nor it respects them as a person.&quot;<br/>\n<br/>\n <br/>\n<br/>\nI absolutely disagree.  No, they don&#39;t grow out of it, but people with<br/>\ndyslexia can learn to work through it without having anything forced upon<br/>\nthem.    Anything that can be trained can be learned and discovered without<br/>\nforce or coercion.  <br/>\n<br/>\n <br/>\n<br/>\nMy oldest child has never received any sort of diagnosis officially, but<br/>\nwould qualify for many (and what gives me so little faith in diagnoses is<br/>\nthat I think *most* people could get at least one diagnoses of something<br/>\nthat would be labeled a &quot;learning disability&quot;- probably the biggest misnomer<br/>\nout there).  Dyslexia is one of them.  His path to reading and writing on<br/>\nhis own has been amazing to watch.  No one has ever told him that he is<br/>\ndisabled.  We have had discussions about things he finds frustrating (not a<br/>\nwhole lot as he keeps most of that to himself) and the way he sees things<br/>\nand how there are other people out in the world who see things the same way,<br/>\neven though it&#39;s not the same way the majority of people do.  We&#39;ve talked<br/>\nabout how there are different approaches that he can take to help him<br/>\ninterpret written words and write things in a way they will be more<br/>\nunderstandable for any audience, and the possibility of exploring those if<br/>\nhe ever thinks it would be useful to him.  But mostly, he&#39;s taken his time<br/>\nand worked things out on his own.  From what I can tell, his personal<br/>\napproach is about making meaning vs. detailed phonics.   We live in a<br/>\nreading household.  We enjoy stories.  We&#39;ve never limited his access to<br/>\nbooks on tape or cd, which I think has given him the ability to learn to<br/>\nlove reading and stories and the way words can be put together without the<br/>\npressure of having to deal with text.  He still prefers to have long books<br/>\nread to him and I do on occasions that we can&#39;t get the book on cd.  His own<br/>\nreading is generally of a more informational nature.  But he definitely<br/>\nkeeps most of this to himself and it did take time.  He began to do some<br/>\nreading independently at about the age of 10, and unlike many stories about<br/>\nkids who suddenly can read anything, he has gradually gained proficiency.<br/>\nDecoding and reading aren&#39;t really the same thing.  My son has difficulty<br/>\ndecoding and maybe that won&#39;t ever come easily to him (and maybe someday it<br/>\nwill, because I don&#39;t believe any prognosis can take into account the<br/>\namazing things that can happen when your life is based in absolute freedom<br/>\nand joy), but he has a great understanding of the complexities of story and<br/>\nmeaning, as well as a heck of a vocabulary.  He&#39;s just joined an online book<br/>\nclub to discuss Star Wars books with adults and he&#39;s thrilled about it.  Of<br/>\ncourse, I already know more about Star Wars than I ever imagined I&#39;d want to<br/>\nknow and I&#39;ll be reading the book out loud for him..but it also makes a<br/>\nconnection and gives us yet one more thing we can discuss together.    And I<br/>\nget to have fun making up voices!<br/>\n<br/>\n <br/>\n<br/>\nLesley<br/>\n<br/>\nIn SC w. Logan (ds13), Ayden (dd7) and Alethia (dd3)<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling and Dyslexia","postDate":"1203103780","msgId":29775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4NTkyLjk1NjEwLnFtQHdlYjU0MTExLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGZwNG92MCtrbGNnQGVHcm91cHMuY29tPg=="},"prevInTopic":29774,"nextInTopic":29776,"prevInTime":29774,"nextInTime":29776,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"I was just sharing with my dad this morning about the differences between the 2 groups I belong to.  One is Canadian, and we are Oh So Polite about our","messageBody":"<div id=\"ygrps-yiv-2136604212\">I was just sharing with my dad this morning about the differences between the 2 groups I belong to.  One is Canadian, and we are Oh So Polite about our opinions.  We have them, but are ever so slightly more careful to not offend you or piss you off.  Then there is this group that is seriously straight up.  I for one need to hear straight up right now because I&quot;m still such a newbie RU that when I hear a mainstream opinion I still kind of go &#39;really, could that be true??&#39;, then I hear from Kelly and company and find out, once again, it&#39;s all just bullshit.  Thank god I only buy into it for a nanosecond now!  Love it love it love it.<br/>\n  Jodi<br/>\n<br/>\nswissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt; wrote:<br/>\n          And this is why I love this board. No nonsense. I hate nonsense. <br/>\nWell, I hate this sort of nonsense anyway. <br/>\n<br/>\nThis board is my backup! I&#39;m one of the most experienced unschoolers<br/>\nover at the other board. But here, I am just a little tiny baby! LOL<br/>\nThanks for all of this! Seriously! Thank you! When I tell someone<br/>\nover there that they are being assholes to their children, I have my<br/>\nvalidation.<br/>\n<br/>\nI can&#39;t wait to meet some of you in person!!! I made the Waterpark<br/>\ngathering, but we swam too much, and I don&#39;t know if I will make the<br/>\nNortheast gathering or the Live and Learn. $$$$$$$$$$$$$ rules<br/>\nsometimes. :-(<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: swissarmy_wife &lt;heatherbean@...&gt;<br/>\n&gt; <br/>\n&gt; 10<br/>\n&gt; <br/>\n&gt; and if any of you want to pop on over and give a few people a serious<br/>\n&gt; ass whooping... please feel free!<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; OhMyGAWD! Ten???<br/>\n&gt; <br/>\n&gt; And if they don&#39;t hurry and intervene his future ability to read and <br/>\n&gt; write will disappear forever!<br/>\n&gt; <br/>\n&gt; Call the National Guard! Call the NEA! Call Dr Seuss!!!<br/>\n&gt; <br/>\n&gt; Bunch of nuts!<br/>\n&gt; <br/>\n&gt; Joyce will be by soon with a calm head and fingers. &lt;g&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt; <br/>\n&gt; __________________________________________________________<br/>\n&gt; More new features than ever. Check out the new AOL Mail ! - <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a><br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNever miss a thing.   Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203103666","msgId":29774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTNFMUZGQUFFQjQwOS1FODQtM0JFQUB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDgwMjE1MTAyM3QzNTE5ZTEyNXhmMzQxN2NkNDI0MDM0ODkzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPgkgPDUzOTgyOS40NDEzOC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+IDw2N2E5ZDc1MDA4MDIxNTEwMjN0MzUxOWUxMjV4ZjM0MTdjZDQyNDAzNDg5M0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":29773,"nextInTopic":29775,"prevInTime":29773,"nextInTime":29775,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"... From: Karen Swanay  I said it wasn t unschooly.  However are you suggesting that kids aren t ever made to do anything? -=-==- yep ","messageBody":"<div id=\"ygrps-yiv-1570169793\">-----Original Message-----<br/>\nFrom: Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt;<br/>\n<br/>\n<br/>\nI said it wasn&#39;t unschooly.  However are you suggesting that kids<br/>\naren&#39;t ever made to do anything?<br/>\n<br/>\n-=-==-<br/>\n<br/>\nyep<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nMy 3 yr old would rather not have<br/>\nher diaper changed.  Should I let it be full of poop because she<br/>\ndoesn&#39;t want to have it changed?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nChildren like clean butts. Adults too.<br/>\n<br/>\nWhy would a child choose not to have a diaper changed?<br/>\n<br/>\nWhy would an adult choose not to have a diaper changed?<br/>\n<br/>\nWhat could you do to change that? And make it more appealing?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nShe doesn&#39;t want to be treated for a<br/>\nnasty inner ear infection...should I say &quot;Oh hell, whatever...if she<br/>\nwants the meds she&#39;ll ask?&quot;  Meanwhile she&#39;s suffering tremendous pain<br/>\nand fevers and her ear drum could perforate.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nEither THIS *or* THAT---no other options/possibilities?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n What&#39;s more important?<br/>\nHealth and safety or choosing everything?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI&#39;d say 99% of humans choose health and safety, so I believe that <br/>\nchoosing everything is more important.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIt&#39;s one thing to say a 15<br/>\nyr old can play as much WOW as they want and it&#39;s quite another to<br/>\nsuggest that a child with CP not be stretched or a child with CF not<br/>\nhave her lungs drained because they would rather not.  One is no big<br/>\ndeal, the other is life altering or death inducing.  Where do you draw<br/>\nthe line?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWhen the smaller, weaker human is not honored.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI think my neighbors want their daughter to be as functional as she<br/>\ncan be so that as an adult she can be as functional as she can be.<br/>\n<br/>\n-=-=-=--<br/>\n<br/>\nI think we all do.<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\nAre you suggesting they just leave her to seize up and say &quot;Hey, it&#39;s<br/>\nher choice!&quot;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo, I&#39;m suggesting that they talk with her about how she&#39;d like to <br/>\nproceed.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n  IMO there are things we can leave to them, and things we<br/>\ncan&#39;t.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nMany of your emails have clued us in to these opinions of yours. Many <br/>\nof us disagree.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I don&#39;t like taking my meds but I do it because I know what<br/>\nwill happen if I don&#39;t.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWhat will happen?<br/>\n<br/>\nBut you&#39;ve been informed of the potentialities, so you choose the meds <br/>\nover the possible eventuality, right?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n In children, they don&#39;t always know the<br/>\nconsquences nor can they appreciate them.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nFirst off, why DOESN&#39;T the child know the consequences?<br/>\n<br/>\nANd why do you think a child cannot appreciate the consequences and <br/>\nmake a rational decision concerning them???<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd to compare stretching a<br/>\nchild with CF with abuse is a disservice to all those parents with SN<br/>\nkids that are doing their best every day to help their kids.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIt IS abusive to force pain on a child.<br/>\n<br/>\nIt is a completely different issue if the *child* chooses it and is <br/>\nallowed to say &quot;when.&quot;<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n________________________________________________________________________<br/>\nMore new features than ever.  Check out the new AOL Mail ! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a></div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203103520","msgId":29773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNG92MCtrbGNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQTNFMURCNThBRjMyOS1FODQtM0FGRUB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":29772,"nextInTopic":29774,"prevInTime":29772,"nextInTime":29774,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"And this is why I love this board.  No nonsense.  I hate nonsense. Well, I hate this sort of nonsense anyway. This board is my backup!  I m one of the most","messageBody":"<div id=\"ygrps-yiv-1187052414\">And this is why I love this board.  No nonsense.  I hate nonsense. <br/>\nWell, I hate this sort of nonsense anyway.  <br/>\n<br/>\nThis board is my backup!  I&#39;m one of the most experienced unschoolers<br/>\nover at the other board.  But here, I am just a little tiny baby!  LOL<br/>\n Thanks for all of this!  Seriously!  Thank you!  When I tell someone<br/>\nover there that they are being assholes to their children, I have my<br/>\nvalidation.<br/>\n<br/>\nI can&#39;t wait to meet some of you in person!!!  I made the Waterpark<br/>\ngathering, but we swam too much, and I don&#39;t know if I will make the<br/>\nNortheast gathering or the Live and Learn.  $$$$$$$$$$$$$ rules<br/>\nsometimes.  :-(<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: swissarmy_wife &lt;heatherbean@...&gt;<br/>\n&gt; <br/>\n&gt; 10<br/>\n&gt; <br/>\n&gt; and if any of you want to pop on over and give a few people a serious<br/>\n&gt; ass whooping...  please feel free!<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; OhMyGAWD! Ten???<br/>\n&gt; <br/>\n&gt; And if they don&#39;t hurry and intervene his future ability to read and <br/>\n&gt; write will disappear forever!<br/>\n&gt; <br/>\n&gt; Call the National Guard! Call the NEA! Call Dr Seuss!!!<br/>\n&gt; <br/>\n&gt; Bunch of nuts!<br/>\n&gt; <br/>\n&gt; Joyce will be by soon with a calm head and fingers. &lt;g&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt; <br/>\n&gt; ________________________________________________________________________<br/>\n&gt; More new features than ever.  Check out the new AOL Mail ! - <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling and Dyslexia","postDate":"1203102946","msgId":29772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NjU5NS41NDA4My5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDhDQTNFMURCNThBRjMyOS1FODQtM0FGRUB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":29771,"nextInTopic":29773,"prevInTime":29771,"nextInTime":29773,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"Have I mentioned today that I love you guys?? And omg I m still rolling on the floor :o))))) Jodi ... From: swissarmy_wife  10 and if","messageBody":"<div id=\"ygrps-yiv-712809050\">Have I mentioned today that I love you guys??<br/>\n   <br/>\n  And omg I&#39;m still rolling on the floor :o)))))<br/>\n   <br/>\n  Jodi<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n          <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;<br/>\n<br/>\n10<br/>\n<br/>\nand if any of you want to pop on over and give a few people a serious<br/>\nass whooping... please feel free!<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nOhMyGAWD! Ten???<br/>\n<br/>\nAnd if they don&#39;t hurry and intervene his future ability to read and <br/>\nwrite will disappear forever!<br/>\n<br/>\nCall the National Guard! Call the NEA! Call Dr Seuss!!!<br/>\n<br/>\nBunch of nuts!<br/>\n<br/>\nJoyce will be by soon with a calm head and fingers. &lt;g&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n__________________________________________________________<br/>\nMore new features than ever. Check out the new AOL Mail ! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a><br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling and Dyslexia","postDate":"1203102691","msgId":29771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTNFMURCNThBRjMyOS1FODQtM0FGRUB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGZwNG40cytnYTY2QGVHcm91cHMuY29tPg=="},"prevInTopic":29770,"nextInTopic":29772,"prevInTime":29770,"nextInTime":29772,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"... From: swissarmy_wife  10 and if any of you want to pop on over and give a few people a serious ass whooping...  please feel free! ","messageBody":"<div id=\"ygrps-yiv-839646125\">-----Original Message-----<br/>\nFrom: swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;<br/>\n<br/>\n10<br/>\n<br/>\nand if any of you want to pop on over and give a few people a serious<br/>\nass whooping...  please feel free!<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nOhMyGAWD! Ten???<br/>\n<br/>\nAnd if they don&#39;t hurry and intervene his future ability to read and <br/>\nwrite will disappear forever!<br/>\n<br/>\nCall the National Guard! Call the NEA! Call Dr Seuss!!!<br/>\n<br/>\nBunch of nuts!<br/>\n<br/>\nJoyce will be by soon with a calm head and fingers. &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n________________________________________________________________________<br/>\nMore new features than ever.  Check out the new AOL Mail ! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203102623","msgId":29770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3OENBRjFFLThFM0MtNEU5OS04MkRCLTkwQzk0RDczNDU0N0Bjb3gubmV0Pg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjE1MTAyM3QzNTE5ZTEyNXhmMzQxN2NkNDI0MDM0ODkzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPiA8NTM5ODI5LjQ0MTM4LnFtQHdlYjU0MTExLm1haWwucmUyLnlhaG9vLmNvbT4gPDY3YTlkNzUwMDgwMjE1MTAyM3QzNTE5ZTEyNXhmMzQxN2NkNDI0MDM0ODkzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29767,"nextInTopic":29771,"prevInTime":29769,"nextInTime":29771,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"In actuality, having some experience with CP, it should not be so excruciating that she is screaming. They need to consult with their OT and PT and receive","messageBody":"<div id=\"ygrps-yiv-1663464857\">In actuality, having some experience with CP, it should not be so  <br/>\nexcruciating that she is screaming. They need to consult with their  <br/>\nOT and PT and receive additional training. My son has ligament  <br/>\nproblems, and he could not stretch, run, walk completely upright. His  <br/>\ntherapy has never been painful, he has been stretched to the limit,  <br/>\nbut we always stop when he says he&#39;s ready to stop. He is willing to  <br/>\nundergo that, because he knows that we will respect his needs. I have  <br/>\na daughter with severe autism, and we were castigated for not forcing  <br/>\n40 hours of ABA on her every week. However, the therapy that we DID  <br/>\ndo was acceptable for her because it wasn&#39;t too much, it was on her  <br/>\nterms, and we could stop when she was ready for a break.  Kids like  <br/>\nJosh and Bre are dragged, kicking and screaming to the exact same  <br/>\ntherapy that we do. They are bribed, and spend about half of the time  <br/>\nworking because of the need for constant rewards. And yet, they still  <br/>\ndon&#39;t want to be there.<br/>\n<br/>\nVery rarely to kids want to be in discomfort or pain, but often  <br/>\nchildren who are parented in a mainstream way CHOOSE to defy those  <br/>\nthings that make them feel better because it is a struggle for  <br/>\nautonomy. Yes, I have left my two year old in a dirty diaper. No, it  <br/>\ndid not kill her or even cause a terrible rash. When she was ready,  <br/>\nshe asked for a diaper change.<br/>\n<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 15, 2008, at 12:23 PM, Karen Swanay wrote:<br/>\n<br/>\n&gt; I said it wasn&#39;t unschooly. However are you suggesting that kids<br/>\n&gt; aren&#39;t ever made to do anything? My 3 yr old would rather not have<br/>\n&gt; her diaper changed. Should I let it be full of poop because she<br/>\n&gt; doesn&#39;t want to have it changed? She doesn&#39;t want to be treated for a<br/>\n&gt; nasty inner ear infection...should I say &quot;Oh hell, whatever...if she<br/>\n&gt; wants the meds she&#39;ll ask?&quot; Meanwhile she&#39;s suffering tremendous pain<br/>\n&gt; and fevers and her ear drum could perforate. What&#39;s more important?<br/>\n&gt; Health and safety or choosing everything? It&#39;s one thing to say a 15<br/>\n&gt; yr old can play as much WOW as they want and it&#39;s quite another to<br/>\n&gt; suggest that a child with CP not be stretched or a child with CF not<br/>\n&gt; have her lungs drained because they would rather not. One is no big<br/>\n&gt; deal, the other is life altering or death inducing. Where do you draw<br/>\n&gt; the line?<br/>\n&gt;<br/>\n&gt; I think my neighbors want their daughter to be as functional as she<br/>\n&gt; can be so that as an adult she can be as functional as she can be.<br/>\n&gt; Are you suggesting they just leave her to seize up and say &quot;Hey, it&#39;s<br/>\n&gt; her choice!&quot; IMO there are things we can leave to them, and things we<br/>\n&gt; can&#39;t. I don&#39;t like taking my meds but I do it because I know what<br/>\n&gt; will happen if I don&#39;t. In children, they don&#39;t always know the<br/>\n&gt; consquences nor can they appreciate them. And to compare stretching a<br/>\n&gt; child with CF with abuse is a disservice to all those parents with SN<br/>\n&gt; kids that are doing their best every day to help their kids.<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt;<br/>\n&gt; On Fri, Feb 15, 2008 at 12:16 PM, Jodi Bezzola  <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;&gt;We can like it or not but there are things we have to do TO our  <br/>\n&gt; children<br/>\n&gt; &gt; for their own good whether or not they like it or it respects  <br/>\n&gt; them as a<br/>\n&gt; &gt; person.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Man, IMHO this is very dangerous thinking. If we don&#39;t like it  <br/>\n&gt; and the<br/>\n&gt; &gt; children don&#39;t like it we&#39;ll just keep doing it?? I do understand  <br/>\n&gt; the<br/>\n&gt; &gt; examples that were given, however, how can those parents really  <br/>\n&gt; ever know if<br/>\n&gt; &gt; the girl with CP would in fact choose the *treatment* that makes her<br/>\n&gt; &gt; scream?? &quot;For their own good&quot; is the title of a book by Alice Miller<br/>\n&gt; &gt; referring to all that we have historically done TO children  <br/>\n&gt; (*abuse*) &quot;for<br/>\n&gt; &gt; their own good&quot;. What you are talking about clearly is your  <br/>\n&gt; opinion, but in<br/>\n&gt; &gt; my opinion is not &#39;unschooly&#39; at all.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Jodi<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n&gt; &gt; RE: training it may be a poor choice of words but she&#39;s right.  <br/>\n&gt; People<br/>\n&gt; &gt; with dyslexia don&#39;t grow out of it, they have to practice and  <br/>\n&gt; learn to<br/>\n&gt; &gt; work through it. We can like it or not but there are things we have<br/>\n&gt; &gt; to do TO our children for their own good whether or not they like it<br/>\n&gt; &gt; or it respects them as a person. My neighbor&#39;s daughter has CP and<br/>\n&gt; &gt; three times a day they have to stretch her arms and legs. She hates<br/>\n&gt; &gt; it. It is uncomfortable and she screams the whole time. But if her<br/>\n&gt; &gt; parents do not do this, she will be unable to function on any level.<br/>\n&gt; &gt; It&#39;s only the stretching that keeps her flexible enough to use her<br/>\n&gt; &gt; walker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\n&gt; &gt; are some things that kids would choose not to do but have to be done<br/>\n&gt; &gt; anyway. Like giving medication, and other such issues. Once this<br/>\n&gt; &gt; child learns to recognize letter groups and can read despite his<br/>\n&gt; &gt; issues, he will be able to play WOW, read comics, and read which<br/>\n&gt; &gt; cereal he wants for breakfast. There are other methods for reading,<br/>\n&gt; &gt; like sight line marking but that won&#39;t work in a computer game or a<br/>\n&gt; &gt; word document. To ignore that he has a problem or leave it up to him<br/>\n&gt; &gt; to work on when he feels like it he won&#39;t be ahead of others, he  <br/>\n&gt; will<br/>\n&gt; &gt; be behind. It&#39;s likely she&#39;s just worried because our society is one<br/>\n&gt; &gt; based on literacy and without this practice, he is essentially<br/>\n&gt; &gt; illiterate.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Karen<br/>\n&gt; &gt;<br/>\n&gt; &gt; ---------------------------------<br/>\n&gt; &gt; Never miss a thing. Make Yahoo your homepage.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203101962","msgId":29767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTNFMUMwMjdBMzNDOS1FODQtM0E2MEB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPiA8NjdhOWQ3NTAwODAyMTUwOTE2bDNmNDM0MjA0ZzQ4ZTMyZDZmYWM0NzA0ODJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":29766,"nextInTopic":29770,"prevInTime":29766,"nextInTime":29768,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"... From: Karen Swanay  RE: training it may be a poor choice of words but she s right.  People with dyslexia don t grow out of it,","messageBody":"<div id=\"ygrps-yiv-1466787973\">-----Original Message-----<br/>\nFrom: Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt;<br/>\n<br/>\nRE: training it may be a poor choice of words but she&#39;s right.  People<br/>\nwith dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\nwork through it.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nAnd your proof for this is where?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWe can like it or not but there are things we have<br/>\nto do TO our children for their own good whether or not they like it<br/>\nor it respects them as a person.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI don&#39;t think so.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nMy neighbor&#39;s daughter has CP and<br/>\nthree times a day they have to stretch her arms and legs.  She hates<br/>\nit.  It is uncomfortable and she screams the whole time.  But if her<br/>\nparents do not do this, she will be unable to function on any level.<br/>\nIt&#39;s only the stretching that keeps her flexible enough to use her<br/>\nwalker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nHave they asked *her* what *she* would like to do about it?<br/>\n<br/>\nAssuming that we must MAKE others who are smaller and weaker do things <br/>\nbecause we say so is WRONG. There are many other possibilities that are <br/>\nnot being discussed and explored.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\nare some things that kids would choose not to do but have to be done<br/>\nanyway.  Like giving medication, and other such issues.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nMIne have *never* chosen not to take medication that they knew would <br/>\nhelp them. Many of us choose to do some pretty nasty, horrid things. <br/>\nBut that&#39;s our CHOICE.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n  Once this child learns to recognize letter groups and can read despite <br/>\nhis<br/>\nissues, he will be able to play WOW, read comics, and read which<br/>\ncereal he wants for breakfast.<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nHe needs to READ which cereal he wants for breakfast? My two years olds <br/>\ncouldn&#39;t read, but they knew which *box* to choose.<br/>\n<br/>\nAmazingly, there are kids who *already* play WoW and read comics <br/>\nwithout having been forced to &quot;recognize letter groups.&quot;<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n There are other methods for reading,<br/>\nlike sight line marking but that won&#39;t work in a computer game or a<br/>\nword document.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nThat&#39;s why children have PARENTS---to do those things *for* them until <br/>\nthey are ready.<br/>\n<br/>\n-=-=-==-<br/>\n<br/>\n To ignore that he has a problem or leave it up to him<br/>\nto work on when he feels like it he won&#39;t be ahead of others, he will<br/>\nbe behind.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAhead of WHAT? Behind WHOM???<br/>\n<br/>\nNo one&#39;s ignoring anything except these frantic parents who need for <br/>\ntheir children to be taking college level courses at ten.<br/>\n<br/>\nThe only *problem* is parents who are to hurried and impatient with <br/>\ntheir children.<br/>\n<br/>\nA child who has a print-rich world *WILL* learn to read when he&#39;s <br/>\nready. On his own schedule. In his own time.<br/>\n<br/>\nPeriod.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n It&#39;s likely she&#39;s just worried because our society is one<br/>\nbased on literacy and without this practice, he is essentially<br/>\nilliterate.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nAt what age? Two year olds are illiterate, and they are SUPPOSED to be. <br/>\nAnd yet there are nuts out there who are trying to teach two year olds <br/>\nto read. WTF??!!<br/>\n<br/>\nChildren *want* to do what adults do. That&#39;s hard-wired into them. They <br/>\nwill read when they are ready---but not a moment sooner, no matter <br/>\n*what* crazy teacher/parents DO to them.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nMore new features than ever.  Check out the new AOL Mail ! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a></div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203101660","msgId":29766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNG40cytnYTY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQTNFMUEzODIwQzJFOS1FODQtMzlBNUB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":29765,"nextInTopic":29767,"prevInTime":29765,"nextInTime":29767,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"10 and if any of you want to pop on over and give a few people a serious ass whooping...  please feel free!","messageBody":"<div id=\"ygrps-yiv-1330938009\">10<br/>\n<br/>\nand if any of you want to pop on over and give a few people a serious<br/>\nass whooping...  please feel free!<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Of course I disagree with her completely. I am quite aware of dyslexia. <br/>\n&gt; I do not need her to tell me that parents/teachers need to force a <br/>\n&gt; child to do anything.<br/>\n&gt; <br/>\n&gt; But before I start arguing:<br/>\n&gt; <br/>\n&gt; How old is the &quot;dyslexic&quot; child in question?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________________________________________________<br/>\n&gt; More new features than ever.  Check out the new AOL Mail ! - <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203101193","msgId":29765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTNFMUEzODIwQzJFOS1FODQtMzlBNUB3ZWJtYWlsLW1lMTUuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":29764,"nextInTopic":29766,"prevInTime":29764,"nextInTime":29766,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"... From: swissarmy_wife  She says: with dyslexia you HAVE to be trained in how to get past it. this isnt just some person that could","messageBody":"<div id=\"ygrps-yiv-173084044\">-----Original Message-----<br/>\nFrom: swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;<br/>\n<br/>\nShe says:<br/>\n<br/>\n&quot;with dyslexia you HAVE to be trained in how to get past it. this isnt<br/>\njust some person that could read at some point. if he isnt trained HOW<br/>\nto see letters in groups that form words he never will be able to do<br/>\nit and it will ALWAYS be frustrating for him. since neither of you are<br/>\nvery aware of dyslexia I am going to tell you that some of the<br/>\nunschooling pracitces just do not apply to dyslexics. the whole<br/>\nconcept of not insisting they do things doesnt work. people with<br/>\ndyslexia are forced to do these types of eye and mind training so that<br/>\nat some point things suddenly get easier for them. &quot;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nOf course I disagree with her completely. I am quite aware of dyslexia. <br/>\nI do not need her to tell me that parents/teachers need to force a <br/>\nchild to do anything.<br/>\n<br/>\nBut before I start arguing:<br/>\n<br/>\nHow old is the &quot;dyslexic&quot; child in question?<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nMore new features than ever.  Check out the new AOL Mail ! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webmail.aol.com\">http://webmail.aol.com</a></div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203101090","msgId":29764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjE1MTA0NGo2NjRkOWU2Y2diNjMzODYwN2NiMzVmYTFhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDc5MDYzOC41MjY4OC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDY3YTlkNzUwMDgwMjE1MTAyM3QzNTE5ZTEyNXhmMzQxN2NkNDI0MDM0ODkzQG1haWwuZ21haWwuY29tPgkgPDc5MDYzOC41MjY4OC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":29763,"nextInTopic":29765,"prevInTime":29763,"nextInTime":29765,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"Hey that s OK.  I misunderstood what you were saying.  Absolutely, for their own good is sometimes used to justify abuse.  (And I m living that now with my","messageBody":"<div id=\"ygrps-yiv-791354986\">Hey that&#39;s OK.  I misunderstood what you were saying.  Absolutely,<br/>\n&quot;for their own good&quot; is sometimes used to justify abuse.  (And I&#39;m<br/>\nliving that now with my 3.5 yr old...a lot was &quot;done for her own good&quot;<br/>\nbefore we brought her home and the results are heart breaking.)  I was<br/>\nreading it as you saying there isn&#39;t ever a time we have to do<br/>\nsomething for kids they&#39;d rather not have done.  Sorry I<br/>\nmisunderstood.<br/>\n<br/>\nRe: this mother, maybe she&#39;s just scared that if she doesn&#39;t do what<br/>\nshe&#39;s being told to do by &quot;experts&quot; her son&#39;s life will be destroyed<br/>\nand it will be all her fault.  Perhaps you could offer a list of<br/>\npeople she could talk to that are doing it now or have BTDT?<br/>\n<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Feb 15, 2008 at 12:32 PM, Jodi Bezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Karen, you are reading alot of what I *didn&#39;t* say into what I *did* say. I<br/>\n&gt; wasn&#39;t comparing anything, simply noting that the phrase you chose (&#39;for<br/>\n&gt; your own good&#39;) makes me feel icky because I associate it with a very valid<br/>\n&gt; piece of literature I read when I was doing healing from my childhood.<br/>\n&gt;<br/>\n&gt; My intention is not to start a debate. I am very clear about my beliefs (and<br/>\n&gt; when I say that I am *not* saying you aren&#39;t clear about yours!), and I<br/>\n&gt; respectfully decline to take this any further today.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Jodi<br/>\n&gt;<br/>\n&gt; Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n&gt; I said it wasn&#39;t unschooly. However are you suggesting that kids<br/>\n&gt; aren&#39;t ever made to do anything? My 3 yr old would rather not have<br/>\n&gt; her diaper changed. Should I let it be full of poop because she<br/>\n&gt; doesn&#39;t want to have it changed? She doesn&#39;t want to be treated for a<br/>\n&gt; nasty inner ear infection...should I say &quot;Oh hell, whatever...if she<br/>\n&gt; wants the meds she&#39;ll ask?&quot; Meanwhile she&#39;s suffering tremendous pain<br/>\n&gt; and fevers and her ear drum could perforate. What&#39;s more important?<br/>\n&gt; Health and safety or choosing everything? It&#39;s one thing to say a 15<br/>\n&gt; yr old can play as much WOW as they want and it&#39;s quite another to<br/>\n&gt; suggest that a child with CP not be stretched or a child with CF not<br/>\n&gt; have her lungs drained because they would rather not. One is no big<br/>\n&gt; deal, the other is life altering or death inducing. Where do you draw<br/>\n&gt; the line?<br/>\n&gt;<br/>\n&gt; I think my neighbors want their daughter to be as functional as she<br/>\n&gt; can be so that as an adult she can be as functional as she can be.<br/>\n&gt; Are you suggesting they just leave her to seize up and say &quot;Hey, it&#39;s<br/>\n&gt; her choice!&quot; IMO there are things we can leave to them, and things we<br/>\n&gt; can&#39;t. I don&#39;t like taking my meds but I do it because I know what<br/>\n&gt; will happen if I don&#39;t. In children, they don&#39;t always know the<br/>\n&gt; consquences nor can they appreciate them. And to compare stretching a<br/>\n&gt; child with CF with abuse is a disservice to all those parents with SN<br/>\n&gt; kids that are doing their best every day to help their kids.<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt;<br/>\n&gt; On Fri, Feb 15, 2008 at 12:16 PM, Jodi Bezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt;<br/>\n&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;&gt;We can like it or not but there are things we have to do TO our children<br/>\n&gt; &gt; for their own good whether or not they like it or it respects them as a<br/>\n&gt; &gt; person.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Man, IMHO this is very dangerous thinking. If we don&#39;t like it and the<br/>\n&gt; &gt; children don&#39;t like it we&#39;ll just keep doing it?? I do understand the<br/>\n&gt; &gt; examples that were given, however, how can those parents really ever know<br/>\n&gt; if<br/>\n&gt; &gt; the girl with CP would in fact choose the *treatment* that makes her<br/>\n&gt; &gt; scream?? &quot;For their own good&quot; is the title of a book by Alice Miller<br/>\n&gt; &gt; referring to all that we have historically done TO children (*abuse*) &quot;for<br/>\n&gt; &gt; their own good&quot;. What you are talking about clearly is your opinion, but<br/>\n&gt; in<br/>\n&gt; &gt; my opinion is not &#39;unschooly&#39; at all.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Jodi<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n&gt; &gt; RE: training it may be a poor choice of words but she&#39;s right. People<br/>\n&gt; &gt; with dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\n&gt; &gt; work through it. We can like it or not but there are things we have<br/>\n&gt; &gt; to do TO our children for their own good whether or not they like it<br/>\n&gt; &gt; or it respects them as a person. My neighbor&#39;s daughter has CP and<br/>\n&gt; &gt; three times a day they have to stretch her arms and legs. She hates<br/>\n&gt; &gt; it. It is uncomfortable and she screams the whole time. But if her<br/>\n&gt; &gt; parents do not do this, she will be unable to function on any level.<br/>\n&gt; &gt; It&#39;s only the stretching that keeps her flexible enough to use her<br/>\n&gt; &gt; walker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\n&gt; &gt; are some things that kids would choose not to do but have to be done<br/>\n&gt; &gt; anyway. Like giving medication, and other such issues. Once this<br/>\n&gt; &gt; child learns to recognize letter groups and can read despite his<br/>\n&gt; &gt; issues, he will be able to play WOW, read comics, and read which<br/>\n&gt; &gt; cereal he wants for breakfast. There are other methods for reading,<br/>\n&gt; &gt; like sight line marking but that won&#39;t work in a computer game or a<br/>\n&gt; &gt; word document. To ignore that he has a problem or leave it up to him<br/>\n&gt; &gt; to work on when he feels like it he won&#39;t be ahead of others, he will<br/>\n&gt; &gt; be behind. It&#39;s likely she&#39;s just worried because our society is one<br/>\n&gt; &gt; based on literacy and without this practice, he is essentially<br/>\n&gt; &gt; illiterate.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Karen<br/>\n&gt; &gt;<br/>\n&gt; &gt; ---------------------------------<br/>\n&gt; &gt; Never miss a thing. Make Yahoo your homepage.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; ---------------------------------<br/>\n&gt; Looking for last minute shopping deals? Find them fast with Yahoo! Search.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:Unschooling and Dyslexia","postDate":"1203101013","msgId":29763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2Nzk1OS43ODcwNS5xbUB3ZWI1NDEwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDAwYjkwMWM4NzAwMCQ2ZmZjMzY1MCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":29762,"nextInTopic":29764,"prevInTime":29762,"nextInTime":29764,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"I hereby nominate this for Post Of The Week.  I m still rolling on the floor!  Jodi Deb Lewis  wrote: *** help me formulate some sort","messageBody":"<div id=\"ygrps-yiv-196830300\">I hereby nominate this for Post Of The Week.  I&#39;m still rolling on the floor! &lt;BWG&gt;<br/>\n   <br/>\n  Jodi<br/>\n<br/>\nDeb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n          *** help me formulate some sort of answer here.***<br/>\n<br/>\nPeople with all the same claimed &quot;symptoms&quot; of dyslexia who are not pressured to read or given reading lessons or &quot;trained,&quot; learn to read when they&#39;re ready. They might learn later but they learn for the same reason everyone who learns to read earlier learns: They learn because their brains are ready. I might read differently than you read. You might read (and I mean see the words, process the words, organize the words) differently than the next person reads. No matter how we process letters and words we all do that when our brains are ready to organize written language in the way that world for us. The goal should not be to get all people to see and process and organize written words in the same way, but unfortunately we seem to be attached to the idea that there is one right way to learn to read. <br/>\n<br/>\nPeople don&#39;t learn to read by being taught how to read. Because there&#39;s some portion of people who endure reading lessons and also learn to read is not proof that teaching equals learning. <br/>\n<br/>\nTell her people who spew nonsense need to be trained to shut the fuck up and then you can borrow my brass knuckles to begin her training, if you want.&lt;g&gt; <br/>\n<br/>\nThere&#39;s an interesting chapter about &quot;dyslexia&quot; in the book Teach Your Own by John Holt. I think it&#39;s chapter eleven titled &quot;Learning Difficulties.&quot; Maybe you could suggest it to her between sound wollopings. <br/>\n<br/>\n(Or, wait for Joyce to deliver one of her arrestingly sophisticated replies and pass it along.) <br/>\n<br/>\nDeb Lewis, sick up to here (jabbing hand way up in the air) with people who think a brain can make sense of every other effing shape on the effing planet but can&#39;t makes sense of letter shapes without &quot;training.&quot; What a load of bleeping blanketyblank. <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNever miss a thing.   Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Unschooling and Dyslexia","postDate":"1203100730","msgId":29762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNG03cSs1MHF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYjkwMWM4NzAwMCQ2ZmZjMzY1MCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":29761,"nextInTopic":29763,"prevInTime":29761,"nextInTime":29763,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"Maybe if I were not pregnant my words would make more sense.  I feel so much more PUNCHY when I m pregnant.  I am not well spoken (written) right now.  I m am","messageBody":"<div id=\"ygrps-yiv-1389916437\">Maybe if I were not pregnant my words would make more sense.  I feel<br/>\nso much more PUNCHY when I&#39;m pregnant.  I am not well spoken (written)<br/>\nright now.  I&#39;m am frustrated beyond belief with that board.  There<br/>\nare a few people who seem to hang around just to argue and it really<br/>\ntakes away from those who are there to discuss and learn.  i could<br/>\nstop, but I just keep replying!  It&#39;s a terrible cycle!!!<br/>\n<br/>\ni really appreciate this answer.  i think its exactly what I was<br/>\nlooking for!  You are so beautifully spoken!  If the situation weren&#39;t<br/>\nalready tense, I might quote you.  Oh... you know which paragraph I<br/>\nmean!  LOL<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deb Lewis&quot; &lt;d.lewis@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; *** help me formulate some sort of answer here.***<br/>\n&gt; <br/>\n&gt; People with all the same claimed &quot;symptoms&quot; of dyslexia who are not<br/>\npressured to read or given reading lessons or &quot;trained,&quot; learn to read<br/>\nwhen they&#39;re ready.   They might learn later but they learn for the<br/>\nsame reason everyone who learns to read earlier learns:  They learn<br/>\nbecause their brains are ready.   I might read differently than you<br/>\nread.  You might read (and I mean see the words, process the words,<br/>\norganize the words) differently than the next person reads.  No matter<br/>\nhow we process letters and words we all do that when our brains are<br/>\nready to organize written language in the way that world for us.  The<br/>\ngoal should not be to get all people to see and process and organize<br/>\nwritten words in the same way, but unfortunately we seem to be<br/>\nattached to the idea that there is one right way to learn to read.  <br/>\n&gt; <br/>\n&gt; People don&#39;t learn to read by being taught how to read.   Because<br/>\nthere&#39;s some portion of people who endure reading lessons and also<br/>\nlearn to read is not proof that teaching equals learning.  <br/>\n&gt; <br/>\n&gt; Tell her people who spew nonsense need to be trained to shut the<br/>\nfuck up and then you can borrow my brass knuckles to begin her<br/>\ntraining, if you want.&lt;g&gt;  <br/>\n&gt; <br/>\n&gt; There&#39;s an interesting chapter about &quot;dyslexia&quot; in the book Teach<br/>\nYour Own by John Holt.  I think it&#39;s chapter eleven titled &quot;Learning<br/>\nDifficulties.&quot;  Maybe you could suggest it to her between sound<br/>\nwollopings. <br/>\n&gt; <br/>\n&gt; (Or, wait for Joyce to deliver one of her arrestingly sophisticated<br/>\nreplies and pass it along.)  <br/>\n&gt; <br/>\n&gt; Deb Lewis, sick up to here (jabbing hand way up in the air) with<br/>\npeople who think a brain can make sense of every other effing shape on<br/>\nthe effing planet but can&#39;t makes sense of letter shapes without<br/>\n&quot;training.&quot;  What a load of bleeping blanketyblank.   <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling and Dyslexia","postDate":"1203100470","msgId":29761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzIwMWM4NzAwMSQ2NzFmZTFjMCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":29760,"nextInTopic":29762,"prevInTime":29760,"nextInTime":29762,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"***organize written language in the way that world for us*** Should have been in the way that *works* for us. Some people organize without typos and others","messageBody":"<div id=\"ygrps-yiv-775906849\">***organize written language in the way that world for us***<br/>\nShould have been &quot;in the way that *works* for us.&quot;<br/>\n<br/>\nSome people organize without typos and others don&#39;t<br/>\n.<br/>\nDeb Lewis, who was trained to spell and to type, by golly..<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203100451","msgId":29760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5MDI1OS42MDg5MC5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":29759,"nextInTopic":29761,"prevInTime":29759,"nextInTime":29761,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"This is anecdotal, but, I know 4 people who are dyslexic and none had any real training. Two of them would always rewrite what they had written for clarity s","messageBody":"<div id=\"ygrps-yiv-1891579045\">This is anecdotal, but, I know 4 people who are dyslexic and none had any real training. Two of them would always rewrite what they had written for clarity&#39;s sake and the other two weren&#39;t diagnosed until late into their school experience. They didn&#39;t have any special training. They just figured out how to read even with dyslexia. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Friday, 15 February, 2008 5:04:32 PM<br/>\nSubject: [unschoolingbasics] Unschooling and Dyslexia<br/>\n<br/>\nI <br/>\nbelong <br/>\nto <br/>\nand <br/>\nin <br/>\nsomeways <br/>\nhelp <br/>\nmoderate <br/>\nan <br/>\nunschooling <br/>\nboard <br/>\non<br/>\nmyspace.  <br/>\nUnfortunately, <br/>\nwe <br/>\ndo <br/>\nnot <br/>\nhave <br/>\nthe <br/>\nluxury <br/>\nof <br/>\nmoderation <br/>\nof<br/>\nposts.  <br/>\nRight <br/>\nnow, <br/>\nmy <br/>\nfriend <br/>\nTara <br/>\nand <br/>\nI <br/>\nare <br/>\nstruggling <br/>\nto <br/>\nkeep <br/>\nthe<br/>\nboard <br/>\n&quot;unschooly&quot;.  <br/>\nMany <br/>\npeople <br/>\noffer <br/>\nup <br/>\nadvice <br/>\nthat <br/>\nis <br/>\nin <br/>\ndirect<br/>\ncontradiction <br/>\nof <br/>\nunschooling.  <br/>\nSo <br/>\nwhile <br/>\nwe <br/>\ndo <br/>\nthat...  <br/>\nThe <br/>\ntopic <br/>\nof<br/>\nunschooling <br/>\na <br/>\ndyslexic <br/>\ncame <br/>\nup.  <br/>\n<br/>\nI <br/>\ndo <br/>\nnot <br/>\nknow <br/>\nmuch <br/>\nabout <br/>\ndyslexias <br/>\nbut <br/>\nI <br/>\ncan&#39;t <br/>\nagree <br/>\nwith <br/>\nwhat <br/>\nthis<br/>\nwoman <br/>\nis <br/>\nsaying.  <br/>\nSo <br/>\nI&#39;m <br/>\ngoing <br/>\nto <br/>\ncopy <br/>\nand <br/>\npaste <br/>\nit <br/>\nhere <br/>\nand <br/>\nsee <br/>\nif<br/>\nanyone <br/>\ncan <br/>\nhelp <br/>\nme <br/>\nformulate <br/>\nsome <br/>\nsort <br/>\nof <br/>\nanswer <br/>\nhere.  <br/>\n<br/>\nShe <br/>\nsays:<br/>\n<br/>\n&quot;with <br/>\ndyslexia <br/>\nyou <br/>\nHAVE <br/>\nto <br/>\nbe <br/>\ntrained <br/>\nin <br/>\nhow <br/>\nto <br/>\nget <br/>\npast <br/>\nit. <br/>\nthis <br/>\nisnt<br/>\njust <br/>\nsome <br/>\nperson <br/>\nthat <br/>\ncould <br/>\nread <br/>\nat <br/>\nsome <br/>\npoint. <br/>\nif <br/>\nhe <br/>\nisnt <br/>\ntrained <br/>\nHOW<br/>\nto <br/>\nsee <br/>\nletters <br/>\nin <br/>\ngroups <br/>\nthat <br/>\nform <br/>\nwords <br/>\nhe <br/>\nnever <br/>\nwill <br/>\nbe <br/>\nable <br/>\nto <br/>\ndo<br/>\nit <br/>\nand <br/>\nit <br/>\nwill <br/>\nALWAYS <br/>\nbe <br/>\nfrustrating <br/>\nfor <br/>\nhim. <br/>\nsince <br/>\nneither <br/>\nof <br/>\nyou <br/>\nare<br/>\nvery <br/>\naware <br/>\nof <br/>\ndyslexia <br/>\nI <br/>\nam <br/>\ngoing <br/>\nto <br/>\ntell <br/>\nyou <br/>\nthat <br/>\nsome <br/>\nof <br/>\nthe<br/>\nunschooling <br/>\npracitces <br/>\njust <br/>\ndo <br/>\nnot <br/>\napply <br/>\nto <br/>\ndyslexics. <br/>\nthe <br/>\nwhole<br/>\nconcept <br/>\nof <br/>\nnot <br/>\ninsisting <br/>\nthey <br/>\ndo <br/>\nthings <br/>\ndoesnt <br/>\nwork. <br/>\npeople <br/>\nwith<br/>\ndyslexia <br/>\nare <br/>\nforced <br/>\nto <br/>\ndo <br/>\nthese <br/>\ntypes <br/>\nof <br/>\neye <br/>\nand <br/>\nmind <br/>\ntraining <br/>\nso <br/>\nthat<br/>\nat <br/>\nsome <br/>\npoint <br/>\nthings <br/>\nsuddenly <br/>\nget <br/>\neasier <br/>\nfor <br/>\nthem. <br/>\n&quot;<br/>\n<br/>\nI <br/>\ncan&#39;t <br/>\nagree!  <br/>\nbut <br/>\nI <br/>\ncan&#39;t <br/>\nanswer <br/>\nher <br/>\neither.  <br/>\nAnyone <br/>\nhere <br/>\nhave<br/>\nexperience <br/>\nwith <br/>\nthis?  <br/>\nShe <br/>\nis <br/>\ninsistent <br/>\non <br/>\nTRAINING <br/>\nthis <br/>\nchild.  <br/>\nI&#39;m<br/>\nnot <br/>\ntrying <br/>\nto <br/>\nchange <br/>\nher <br/>\nmind, <br/>\nbut <br/>\ngive <br/>\nher <br/>\nanother <br/>\nperspective <br/>\nand<br/>\nother <br/>\nways <br/>\nof <br/>\nhelping <br/>\nher <br/>\nson.  <br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! <br/>\nGroups <br/>\nLinks<br/>\n<br/>\nyour <br/>\ngroup <br/>\non <br/>\nthe <br/>\nweb, <br/>\ngo <br/>\nto:<br/>\n  <br/>\n  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\nsettings:<br/>\n  <br/>\n  <br/>\nIndividual <br/>\nEmail <br/>\n| <br/>\nTraditional<br/>\n<br/>\nsettings <br/>\nonline <br/>\ngo <br/>\nto:<br/>\n  <br/>\n  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/join\">http://groups.yahoo.com/group/unschoolingbasics/join</a><br/>\n  <br/>\n  <br/>\n(Yahoo! <br/>\nID <br/>\nrequired)<br/>\n<br/>\nsettings <br/>\nvia <br/>\nemail:<br/>\n  <br/>\n  <br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-digest@yahoogroups.com\">unschoolingbasics-digest@yahoogroups.com</a> <br/>\n  <br/>\n  <br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-fullfeatured@yahoogroups.com\">unschoolingbasics-fullfeatured@yahoogroups.com</a><br/>\n<br/>\nfrom <br/>\nthis <br/>\ngroup, <br/>\nsend <br/>\nan <br/>\nemail <br/>\nto:<br/>\n  <br/>\n  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nof <br/>\nYahoo! <br/>\nGroups <br/>\nis <br/>\nsubject <br/>\nto:<br/>\n  <br/>\n  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203100347","msgId":29759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5MDYzOC41MjY4OC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDgwMjE1MTAyM3QzNTE5ZTEyNXhmMzQxN2NkNDI0MDM0ODkzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29758,"nextInTopic":29760,"prevInTime":29758,"nextInTime":29760,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"Karen, you are reading alot of what I *didn t* say into what I *did* say.  I wasn t comparing anything, simply noting that the phrase you chose ( for your own","messageBody":"<div id=\"ygrps-yiv-67755846\">Karen, you are reading alot of what I *didn&#39;t* say into what I *did* say.  I wasn&#39;t comparing anything, simply noting that the phrase you chose (&#39;for your own good&#39;) makes me feel icky because I associate it with a very valid piece of literature I read when I was doing healing from my childhood.<br/>\n   <br/>\n  My intention is not to start a debate.  I am very clear about my beliefs (and when I say that I am *not* saying you aren&#39;t clear about yours!), and I respectfully decline to take this any further today.<br/>\n   <br/>\n  Jodi<br/>\n<br/>\nKaren Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n          I said it wasn&#39;t unschooly. However are you suggesting that kids<br/>\naren&#39;t ever made to do anything? My 3 yr old would rather not have<br/>\nher diaper changed. Should I let it be full of poop because she<br/>\ndoesn&#39;t want to have it changed? She doesn&#39;t want to be treated for a<br/>\nnasty inner ear infection...should I say &quot;Oh hell, whatever...if she<br/>\nwants the meds she&#39;ll ask?&quot; Meanwhile she&#39;s suffering tremendous pain<br/>\nand fevers and her ear drum could perforate. What&#39;s more important?<br/>\nHealth and safety or choosing everything? It&#39;s one thing to say a 15<br/>\nyr old can play as much WOW as they want and it&#39;s quite another to<br/>\nsuggest that a child with CP not be stretched or a child with CF not<br/>\nhave her lungs drained because they would rather not. One is no big<br/>\ndeal, the other is life altering or death inducing. Where do you draw<br/>\nthe line?<br/>\n<br/>\nI think my neighbors want their daughter to be as functional as she<br/>\ncan be so that as an adult she can be as functional as she can be.<br/>\nAre you suggesting they just leave her to seize up and say &quot;Hey, it&#39;s<br/>\nher choice!&quot; IMO there are things we can leave to them, and things we<br/>\ncan&#39;t. I don&#39;t like taking my meds but I do it because I know what<br/>\nwill happen if I don&#39;t. In children, they don&#39;t always know the<br/>\nconsquences nor can they appreciate them. And to compare stretching a<br/>\nchild with CF with abuse is a disservice to all those parents with SN<br/>\nkids that are doing their best every day to help their kids.<br/>\n<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Feb 15, 2008 at 12:16 PM, Jodi Bezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;We can like it or not but there are things we have to do TO our children<br/>\n&gt; for their own good whether or not they like it or it respects them as a<br/>\n&gt; person.<br/>\n&gt;<br/>\n&gt; Man, IMHO this is very dangerous thinking. If we don&#39;t like it and the<br/>\n&gt; children don&#39;t like it we&#39;ll just keep doing it?? I do understand the<br/>\n&gt; examples that were given, however, how can those parents really ever know if<br/>\n&gt; the girl with CP would in fact choose the *treatment* that makes her<br/>\n&gt; scream?? &quot;For their own good&quot; is the title of a book by Alice Miller<br/>\n&gt; referring to all that we have historically done TO children (*abuse*) &quot;for<br/>\n&gt; their own good&quot;. What you are talking about clearly is your opinion, but in<br/>\n&gt; my opinion is not &#39;unschooly&#39; at all.<br/>\n&gt;<br/>\n&gt; Jodi<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n&gt; RE: training it may be a poor choice of words but she&#39;s right. People<br/>\n&gt; with dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\n&gt; work through it. We can like it or not but there are things we have<br/>\n&gt; to do TO our children for their own good whether or not they like it<br/>\n&gt; or it respects them as a person. My neighbor&#39;s daughter has CP and<br/>\n&gt; three times a day they have to stretch her arms and legs. She hates<br/>\n&gt; it. It is uncomfortable and she screams the whole time. But if her<br/>\n&gt; parents do not do this, she will be unable to function on any level.<br/>\n&gt; It&#39;s only the stretching that keeps her flexible enough to use her<br/>\n&gt; walker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n&gt;<br/>\n&gt; I know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\n&gt; are some things that kids would choose not to do but have to be done<br/>\n&gt; anyway. Like giving medication, and other such issues. Once this<br/>\n&gt; child learns to recognize letter groups and can read despite his<br/>\n&gt; issues, he will be able to play WOW, read comics, and read which<br/>\n&gt; cereal he wants for breakfast. There are other methods for reading,<br/>\n&gt; like sight line marking but that won&#39;t work in a computer game or a<br/>\n&gt; word document. To ignore that he has a problem or leave it up to him<br/>\n&gt; to work on when he feels like it he won&#39;t be ahead of others, he will<br/>\n&gt; be behind. It&#39;s likely she&#39;s just worried because our society is one<br/>\n&gt; based on literacy and without this practice, he is essentially<br/>\n&gt; illiterate.<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt;<br/>\n&gt; ---------------------------------<br/>\n&gt; Never miss a thing. Make Yahoo your homepage.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":187841659,"authorName":"Janet","from":"Janet &lt;janeteg@...&gt;","profile":"janeteg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203100204","msgId":29758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMjY3NDQzNTg1QHJydi5uZXQ+","inReplyToHeader":"PDUzOTgyOS40NDEzOC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPiA8NTM5ODI5LjQ0MTM4LnFtQHdlYjU0MTExLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":29757,"nextInTopic":29759,"prevInTime":29757,"nextInTime":29759,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"FWIW my son with dyslexia - the one we did nothing for who went to college and did fine, is an artist. He is now 20. He struggled to read and didn t do so","messageBody":"<div id=\"ygrps-yiv-1725231839\">FWIW my son with dyslexia - the one we did nothing for who went to <br/>\ncollege and did fine, is an artist. He is now 20. He struggled to <br/>\nread and didn&#39;t do so fluently till he was almost 12... He reads fine <br/>\nnow. When he&#39;s tired it&#39;s a little harder to keep the letters flowing <br/>\nin the right direction, but he knows what he needs to do - slow down, <br/>\nuse a finger or tool to keep the letters in line (things he picked up <br/>\non the way.)  My dd with dyslexia is not asking for help at this <br/>\npoint and we are not coercing her to take it. I have offered. She was <br/>\na slower-than-my-other-kids reader, but we didn&#39;t care. She is 10 and <br/>\nreads pretty well - again, unless she is distracted or tired! I <br/>\nhonestly think there are plenty of tools out there to help her, and <br/>\nshe does not need any &quot;training&quot;. We will go with the flow. If she <br/>\nwants help, we&#39;ll look for it. She is very much like older son in a <br/>\nlot of ways - really struggled with sensory problems as a little one!<br/>\n<br/>\nJanet in MN<br/>\n<br/>\nAt 12:16 PM 2/15/2008, you wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Karen Swanay <br/>\n&gt;&lt;&lt;mailto:luvbullbreeds%40gmail.com&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n&gt;RE: training it may be a poor choice of words but she&#39;s right. People<br/>\n&gt;with dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\n&gt;work through it. We can like it or not but there are things we have<br/>\n&gt;to do TO our children for their own good whether or not they like it<br/>\n&gt;or it respects them as a person. My neighbor&#39;s daughter has CP and<br/>\n&gt;three times a day they have to stretch her arms and legs. She hates<br/>\n&gt;it. It is uncomfortable and she screams the whole time. But if her<br/>\n&gt;parents do not do this, she will be unable to function on any level.<br/>\n&gt;It&#39;s only the stretching that keeps her flexible enough to use her<br/>\n&gt;walker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n&gt;<br/>\n&gt;I know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\n&gt;are some things that kids would choose not to do but have to be done<br/>\n&gt;anyway. Like giving medication, and other such issues. Once this<br/>\n&gt;child learns to recognize letter groups and can read despite his<br/>\n&gt;issues, he will be able to play WOW, read comics, and read which<br/>\n&gt;cereal he wants for breakfast. There are other methods for reading,<br/>\n&gt;like sight line marking but that won&#39;t work in a computer game or a<br/>\n&gt;word document. To ignore that he has a problem or leave it up to him<br/>\n&gt;to work on when he feels like it he won&#39;t be ahead of others, he will<br/>\n&gt;be behind. It&#39;s likely she&#39;s just worried because our society is one<br/>\n&gt;based on literacy and without this practice, he is essentially<br/>\n&gt;illiterate.<br/>\n&gt;<br/>\n&gt;Karen </span></blockquote></div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203100058","msgId":29756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzMC4yNTRkNWM5OC4zNGU3MzM5YUBhb2wuY29tPg=="},"prevInTopic":29755,"nextInTopic":29757,"prevInTime":29755,"nextInTime":29757,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"I personally think unschooling for dyslexia would be a positive thing, and would work quite well - I can t see why not, and yes, I do have some experience with","messageBody":"<div id=\"ygrps-yiv-488211744\">I personally think unschooling for dyslexia would be a positive thing, and  <br/>\nwould work quite well - I can&#39;t see why not, and yes, I do have some experience <br/>\n with it...Hmmm...<br/>\n <br/>\nKaren (the other one, lol, in So. Cal)<br/>\n<br/>\n<br/>\n<br/>\n**************The year&#39;s hottest artists on the red carpet at the Grammy <br/>\nAwards. Go to AOL Music.      <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://music.aol.com/grammys?NCID=aolcmp00300000002565)\">http://music.aol.com/grammys?NCID=aolcmp00300000002565)</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Unschooling and Dyslexia","postDate":"1203100055","msgId":29757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjkwMWM4NzAwMCQ2ZmZjMzY1MCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":29756,"nextInTopic":29758,"prevInTime":29756,"nextInTime":29758,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"*** help me formulate some sort of answer here.*** People with all the same claimed symptoms of dyslexia who are not pressured to read or given reading","messageBody":"<div id=\"ygrps-yiv-415733953\">*** help me formulate some sort of answer here.***<br/>\n<br/>\nPeople with all the same claimed &quot;symptoms&quot; of dyslexia who are not pressured to read or given reading lessons or &quot;trained,&quot; learn to read when they&#39;re ready.   They might learn later but they learn for the same reason everyone who learns to read earlier learns:  They learn because their brains are ready.   I might read differently than you read.  You might read (and I mean see the words, process the words, organize the words) differently than the next person reads.  No matter how we process letters and words we all do that when our brains are ready to organize written language in the way that world for us.  The goal should not be to get all people to see and process and organize written words in the same way, but unfortunately we seem to be attached to the idea that there is one right way to learn to read.  <br/>\n<br/>\nPeople don&#39;t learn to read by being taught how to read.   Because there&#39;s some portion of people who endure reading lessons and also learn to read is not proof that teaching equals learning.  <br/>\n<br/>\nTell her people who spew nonsense need to be trained to shut the fuck up and then you can borrow my brass knuckles to begin her training, if you want.&lt;g&gt;  <br/>\n<br/>\nThere&#39;s an interesting chapter about &quot;dyslexia&quot; in the book Teach Your Own by John Holt.  I think it&#39;s chapter eleven titled &quot;Learning Difficulties.&quot;  Maybe you could suggest it to her between sound wollopings. <br/>\n<br/>\n(Or, wait for Joyce to deliver one of her arrestingly sophisticated replies and pass it along.)  <br/>\n<br/>\nDeb Lewis, sick up to here (jabbing hand way up in the air) with people who think a brain can make sense of every other effing shape on the effing planet but can&#39;t makes sense of letter shapes without &quot;training.&quot;  What a load of bleeping blanketyblank.   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203099806","msgId":29755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjE1MTAyM3QzNTE5ZTEyNXhmMzQxN2NkNDI0MDM0ODkzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDUzOTgyOS40NDEzOC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPgkgPDUzOTgyOS40NDEzOC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":29754,"nextInTopic":29756,"prevInTime":29754,"nextInTime":29756,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"I said it wasn t unschooly.  However are you suggesting that kids aren t ever made to do anything?  My 3 yr old would rather not have her diaper changed.","messageBody":"<div id=\"ygrps-yiv-496290563\">I said it wasn&#39;t unschooly.  However are you suggesting that kids<br/>\naren&#39;t ever made to do anything?  My 3 yr old would rather not have<br/>\nher diaper changed.  Should I let it be full of poop because she<br/>\ndoesn&#39;t want to have it changed?  She doesn&#39;t want to be treated for a<br/>\nnasty inner ear infection...should I say &quot;Oh hell, whatever...if she<br/>\nwants the meds she&#39;ll ask?&quot;  Meanwhile she&#39;s suffering tremendous pain<br/>\nand fevers and her ear drum could perforate.  What&#39;s more important?<br/>\nHealth and safety or choosing everything?  It&#39;s one thing to say a 15<br/>\nyr old can play as much WOW as they want and it&#39;s quite another to<br/>\nsuggest that a child with CP not be stretched or a child with CF not<br/>\nhave her lungs drained because they would rather not.  One is no big<br/>\ndeal, the other is life altering or death inducing.  Where do you draw<br/>\nthe line?<br/>\n<br/>\nI think my neighbors want their daughter to be as functional as she<br/>\ncan be so that as an adult she can be as functional as she can be.<br/>\nAre you suggesting they just leave her to seize up and say &quot;Hey, it&#39;s<br/>\nher choice!&quot;  IMO there are things we can leave to them, and things we<br/>\ncan&#39;t.  I don&#39;t like taking my meds but I do it because I know what<br/>\nwill happen if I don&#39;t.  In children, they don&#39;t always know the<br/>\nconsquences nor can they appreciate them.  And to compare stretching a<br/>\nchild with CF with abuse is a disservice to all those parents with SN<br/>\nkids that are doing their best every day to help their kids.<br/>\n<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Feb 15, 2008 at 12:16 PM, Jodi Bezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;We can like it or not but there are things we have to do TO our children<br/>\n&gt; for their own good whether or not they like it or it respects them as a<br/>\n&gt; person.<br/>\n&gt;<br/>\n&gt; Man, IMHO this is very dangerous thinking. If we don&#39;t like it and the<br/>\n&gt; children don&#39;t like it we&#39;ll just keep doing it?? I do understand the<br/>\n&gt; examples that were given, however, how can those parents really ever know if<br/>\n&gt; the girl with CP would in fact choose the *treatment* that makes her<br/>\n&gt; scream?? &quot;For their own good&quot; is the title of a book by Alice Miller<br/>\n&gt; referring to all that we have historically done TO children (*abuse*) &quot;for<br/>\n&gt; their own good&quot;. What you are talking about clearly is your opinion, but in<br/>\n&gt; my opinion is not &#39;unschooly&#39; at all.<br/>\n&gt;<br/>\n&gt; Jodi<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n&gt; RE: training it may be a poor choice of words but she&#39;s right. People<br/>\n&gt; with dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\n&gt; work through it. We can like it or not but there are things we have<br/>\n&gt; to do TO our children for their own good whether or not they like it<br/>\n&gt; or it respects them as a person. My neighbor&#39;s daughter has CP and<br/>\n&gt; three times a day they have to stretch her arms and legs. She hates<br/>\n&gt; it. It is uncomfortable and she screams the whole time. But if her<br/>\n&gt; parents do not do this, she will be unable to function on any level.<br/>\n&gt; It&#39;s only the stretching that keeps her flexible enough to use her<br/>\n&gt; walker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n&gt;<br/>\n&gt; I know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\n&gt; are some things that kids would choose not to do but have to be done<br/>\n&gt; anyway. Like giving medication, and other such issues. Once this<br/>\n&gt; child learns to recognize letter groups and can read despite his<br/>\n&gt; issues, he will be able to play WOW, read comics, and read which<br/>\n&gt; cereal he wants for breakfast. There are other methods for reading,<br/>\n&gt; like sight line marking but that won&#39;t work in a computer game or a<br/>\n&gt; word document. To ignore that he has a problem or leave it up to him<br/>\n&gt; to work on when he feels like it he won&#39;t be ahead of others, he will<br/>\n&gt; be behind. It&#39;s likely she&#39;s just worried because our society is one<br/>\n&gt; based on literacy and without this practice, he is essentially<br/>\n&gt; illiterate.<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt;<br/>\n&gt; ---------------------------------<br/>\n&gt; Never miss a thing. Make Yahoo your homepage.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203099389","msgId":29754,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzOTgyOS40NDEzOC5xbUB3ZWI1NDExMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29753,"nextInTopic":29755,"prevInTime":29753,"nextInTime":29755,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"... Man, IMHO this is very dangerous thinking.  If we don t like it and the children don t like it we ll just keep doing it??  I do understand the examples","messageBody":"<div id=\"ygrps-yiv-2008549574\"><blockquote><span title=\"ireply\">&gt;&gt;We can like it or not but there are things we have to do TO our children for their own good whether or not they like it or it respects them as a person.<br/>\n   <br/>\n </span></blockquote>  Man, IMHO this is very dangerous thinking.  If we don&#39;t like it and the children don&#39;t like it we&#39;ll just keep doing it??  I do understand the examples that were given, however, how can those parents really ever know if the girl with CP would in fact choose the *treatment* that makes her scream??  &quot;For their own good&quot; is the title of a book by Alice Miller referring to all that we have historically done TO children (*abuse*) &quot;for their own good&quot;.  What you are talking about clearly is your opinion, but in my opinion is not &#39;unschooly&#39; at all.<br/>\n   <br/>\n  Jodi <br/>\n<br/>\nKaren Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n          RE: training it may be a poor choice of words but she&#39;s right. People<br/>\nwith dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\nwork through it. We can like it or not but there are things we have<br/>\nto do TO our children for their own good whether or not they like it<br/>\nor it respects them as a person. My neighbor&#39;s daughter has CP and<br/>\nthree times a day they have to stretch her arms and legs. She hates<br/>\nit. It is uncomfortable and she screams the whole time. But if her<br/>\nparents do not do this, she will be unable to function on any level.<br/>\nIt&#39;s only the stretching that keeps her flexible enough to use her<br/>\nwalker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n<br/>\nI know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\nare some things that kids would choose not to do but have to be done<br/>\nanyway. Like giving medication, and other such issues. Once this<br/>\nchild learns to recognize letter groups and can read despite his<br/>\nissues, he will be able to play WOW, read comics, and read which<br/>\ncereal he wants for breakfast. There are other methods for reading,<br/>\nlike sight line marking but that won&#39;t work in a computer game or a<br/>\nword document. To ignore that he has a problem or leave it up to him<br/>\nto work on when he feels like it he won&#39;t be ahead of others, he will<br/>\nbe behind. It&#39;s likely she&#39;s just worried because our society is one<br/>\nbased on literacy and without this practice, he is essentially<br/>\nilliterate.<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNever miss a thing.   Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187841659,"authorName":"Janet","from":"Janet &lt;janeteg@...&gt;","profile":"janeteg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203098412","msgId":29753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMjY3NDQxMjU2QHJydi5uZXQ+","inReplyToHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":29752,"nextInTopic":29754,"prevInTime":29752,"nextInTime":29754,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"I don t know how much help I can be but it wasn t until my ds was about 15 that we realized he had what others called dyslexia . He was labeling boxes for a","messageBody":"<div id=\"ygrps-yiv-70064729\">I don&#39;t know how much help I can be but it wasn&#39;t until my ds was <br/>\nabout 15 that we realized he had what others called &quot;dyslexia&quot;. He <br/>\nwas labeling boxes for a friend who was moving and wrote every single <br/>\nnumber down as a mirror image!! I was floored. I had never made him <br/>\nwrite much (he did a lot on the computer though) and just saw a few <br/>\ntimes when things were reversed and didn&#39;t worry about it. I laughed, <br/>\ntold him &quot;you probably are dyslexic!&quot; and that was it. He went on to <br/>\nget a very high GPA in college - took about 30 credit hours in <br/>\nvarious subjects and is now taking a break from college. We never did <br/>\na thing and he&#39;s managing just fine. I don&#39;t know if that helps or <br/>\nnot! I have a feeling my ten yodd has dyslexia also. She always reads <br/>\nwords &quot;backwards&quot; and we just either ignore it or ask her to &quot;look <br/>\nagain&quot; if we all laugh and she wonders why. She sometimes reads <br/>\nphrases backwards. I figure she&#39;ll figure it out.<br/>\n<br/>\nJanet in MN<br/>\n<br/>\nAt 11:04 AM 2/15/2008, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I belong to and in someways help moderate an unschooling board on<br/>\n&gt;myspace. Unfortunately, we do not have the luxury of moderation of<br/>\n&gt;posts. Right now, my friend Tara and I are struggling to keep the<br/>\n&gt;board &quot;unschooly&quot;. Many people offer up advice that is in direct<br/>\n&gt;contradiction of unschooling. So while we do that... The topic of<br/>\n&gt;unschooling a dyslexic came up.<br/>\n&gt;<br/>\n&gt;I do not know much about dyslexias but I can&#39;t agree with what this<br/>\n&gt;woman is saying. So I&#39;m going to copy and paste it here and see if<br/>\n&gt;anyone can help me formulate some sort of answer here.<br/>\n&gt;<br/>\n&gt;She says:<br/>\n&gt;<br/>\n&gt;&quot;with dyslexia you HAVE to be trained in how to get past it. this isnt<br/>\n&gt;just some person that could read at some point. if he isnt trained HOW<br/>\n&gt;to see letters in groups that form words he never will be able to do<br/>\n&gt;it and it will ALWAYS be frustrating for him. since neither of you are<br/>\n&gt;very aware of dyslexia I am going to tell you that some of the<br/>\n&gt;unschooling pracitces just do not apply to dyslexics. the whole<br/>\n&gt;concept of not insisting they do things doesnt work. people with<br/>\n&gt;dyslexia are forced to do these types of eye and mind training so that<br/>\n&gt;at some point things suddenly get easier for them. &quot;<br/>\n&gt;<br/>\n&gt;I can&#39;t agree! but I can&#39;t answer her either. Anyone here have<br/>\n&gt;experience with this? She is insistent on TRAINING this child. I&#39;m<br/>\n&gt;not trying to change her mind, but give her another perspective and<br/>\n&gt;other ways of helping her son.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203095783","msgId":29752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjE1MDkxNmwzZjQzNDIwNGc0OGUzMmQ2ZmFjNDcwNDgyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":29751,"nextInTopic":29753,"prevInTime":29751,"nextInTime":29753,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"RE: training it may be a poor choice of words but she s right.  People with dyslexia don t grow out of it, they have to practice and learn to work through it.","messageBody":"<div id=\"ygrps-yiv-240487811\">RE: training it may be a poor choice of words but she&#39;s right.  People<br/>\nwith dyslexia don&#39;t grow out of it, they have to practice and learn to<br/>\nwork through it.  We can like it or not but there are things we have<br/>\nto do TO our children for their own good whether or not they like it<br/>\nor it respects them as a person.  My neighbor&#39;s daughter has CP and<br/>\nthree times a day they have to stretch her arms and legs.  She hates<br/>\nit.  It is uncomfortable and she screams the whole time.  But if her<br/>\nparents do not do this, she will be unable to function on any level.<br/>\nIt&#39;s only the stretching that keeps her flexible enough to use her<br/>\nwalker and feed herself (she&#39;s 7) and that&#39;s the way it has to be.<br/>\n<br/>\nI know it&#39;s not &quot;unschooly&quot; to force a kid to do anything but there<br/>\nare some things that kids would choose not to do but have to be done<br/>\nanyway.  Like giving medication, and other such issues.  Once this<br/>\nchild learns to recognize letter groups and can read despite his<br/>\nissues, he will be able to play WOW, read comics, and read which<br/>\ncereal he wants for breakfast.  There are other methods for reading,<br/>\nlike sight line marking but that won&#39;t work in a computer game or a<br/>\nword document.  To ignore that he has a problem or leave it up to him<br/>\nto work on when he feels like it he won&#39;t be ahead of others, he will<br/>\nbe behind.  It&#39;s likely she&#39;s just worried because our society is one<br/>\nbased on literacy and without this practice, he is essentially<br/>\nilliterate.<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and Dyslexia","postDate":"1203095520","msgId":29751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4MTM0NS40MTAwMi5xbUB3ZWI1NDEwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":29750,"nextInTopic":29752,"prevInTime":29750,"nextInTime":29752,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"My dh was diagnosed dyslexic in school and still doesn t read well or enjoy reading inspite of specialized training (can you hear the scorn in my voice??).","messageBody":"<div id=\"ygrps-yiv-1775191650\">My dh was diagnosed dyslexic in school and still doesn&#39;t read well or enjoy reading inspite of specialized &quot;training&quot; (can you hear the scorn in my voice??).  All the &quot;training&quot; did was help him feel dumb.  The thing that finally is working (a tip from an unschoolers dh) is for him to simply place a red ruler under the line he&#39;s reading.  There is documented science behind this method that requires no &quot;training&quot;.  Lots comes up when you google this topic.  Perhaps share some personal experiences with her?  I don&#39;t have much love left in me for &quot;experts&quot;.  The foundation of unschooling to me is that we are each our own expert.  Just my two cents.<br/>\n  Jodi <br/>\n<br/>\nswissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt; wrote:<br/>\n          I belong to and in someways help moderate an unschooling board on<br/>\nmyspace. Unfortunately, we do not have the luxury of moderation of<br/>\nposts. Right now, my friend Tara and I are struggling to keep the<br/>\nboard &quot;unschooly&quot;. Many people offer up advice that is in direct<br/>\ncontradiction of unschooling. So while we do that... The topic of<br/>\nunschooling a dyslexic came up. <br/>\n<br/>\nI do not know much about dyslexias but I can&#39;t agree with what this<br/>\nwoman is saying. So I&#39;m going to copy and paste it here and see if<br/>\nanyone can help me formulate some sort of answer here. <br/>\n<br/>\nShe says:<br/>\n<br/>\n&quot;with dyslexia you HAVE to be trained in how to get past it. this isnt<br/>\njust some person that could read at some point. if he isnt trained HOW<br/>\nto see letters in groups that form words he never will be able to do<br/>\nit and it will ALWAYS be frustrating for him. since neither of you are<br/>\nvery aware of dyslexia I am going to tell you that some of the<br/>\nunschooling pracitces just do not apply to dyslexics. the whole<br/>\nconcept of not insisting they do things doesnt work. people with<br/>\ndyslexia are forced to do these types of eye and mind training so that<br/>\nat some point things suddenly get easier for them. &quot;<br/>\n<br/>\nI can&#39;t agree! but I can&#39;t answer her either. Anyone here have<br/>\nexperience with this? She is insistent on TRAINING this child. I&#39;m<br/>\nnot trying to change her mind, but give her another perspective and<br/>\nother ways of helping her son. <br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and Dyslexia","postDate":"1203095072","msgId":29750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwNGduMCt0aGJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":29751,"prevInTime":29749,"nextInTime":29751,"topicId":29750,"numMessagesInTopic":0,"msgSnippet":"I belong to and in someways help moderate an unschooling board on myspace.  Unfortunately, we do not have the luxury of moderation of posts.  Right now, my","messageBody":"<div id=\"ygrps-yiv-154656249\">I belong to and in someways help moderate an unschooling board on<br/>\nmyspace.  Unfortunately, we do not have the luxury of moderation of<br/>\nposts.  Right now, my friend Tara and I are struggling to keep the<br/>\nboard &quot;unschooly&quot;.  Many people offer up advice that is in direct<br/>\ncontradiction of unschooling.  So while we do that...  The topic of<br/>\nunschooling a dyslexic came up.  <br/>\n<br/>\nI do not know much about dyslexias but I can&#39;t agree with what this<br/>\nwoman is saying.  So I&#39;m going to copy and paste it here and see if<br/>\nanyone can help me formulate some sort of answer here.  <br/>\n<br/>\nShe says:<br/>\n<br/>\n&quot;with dyslexia you HAVE to be trained in how to get past it. this isnt<br/>\njust some person that could read at some point. if he isnt trained HOW<br/>\nto see letters in groups that form words he never will be able to do<br/>\nit and it will ALWAYS be frustrating for him. since neither of you are<br/>\nvery aware of dyslexia I am going to tell you that some of the<br/>\nunschooling pracitces just do not apply to dyslexics. the whole<br/>\nconcept of not insisting they do things doesnt work. people with<br/>\ndyslexia are forced to do these types of eye and mind training so that<br/>\nat some point things suddenly get easier for them. &quot;<br/>\n<br/>\nI can&#39;t agree!  but I can&#39;t answer her either.  Anyone here have<br/>\nexperience with this?  She is insistent on TRAINING this child.  I&#39;m<br/>\nnot trying to change her mind, but give her another perspective and<br/>\nother ways of helping her son.</div>","specialLinks":[]}],"prevTopicId":30083,"nextTopicId":30155}}