{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":236897304,"authorName":"frozenandcold","from":"&quot;frozenandcold&quot; &lt;fivefreebirds@...&gt;","profile":"frozenandcold","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"clarifications","postDate":"1130881389","msgId":7388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRrOG5oZCtqZW5mQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7387,"nextInTime":7389,"topicId":7388,"numMessagesInTopic":0,"msgSnippet":"*But if I had asked her if she was sleepy and felt she needed a rest and let it go at that she would have said no.* I think what people here are trying to tell","messageBody":"<div id=\"ygrps-yiv-636435473\">*But if I had asked<br/>\nher if she was sleepy and felt she needed a rest and let it go at<br/>\nthat she would have said no.*<br/>\n<br/>\nI think what people here are trying to tell you is that when there is <br/>\nno control over those kinds of things children learn to listen to <br/>\ntheir bodies and know when they need rest, etc.  In our home, if I <br/>\nasked one of my kids if they were tired, and they were, in fact tired, <br/>\nthey would say yes!  If they needed a nap they would probably come to <br/>\nme and tell me that they wanted to lay down, or what usually happens <br/>\nis that they would just go find a quiet place and lay down and sleep. <br/>\nIf you were to let go of those controls, initially it would seem like <br/>\nchaos until they learned how to listen to their bodies, on their own, <br/>\nwithout someone telling them how they feel.  There are times that my <br/>\nkids push the limits but I feel that it is there body and nine times <br/>\nout of ten when they do that they realize it doesn&#39;t make them feel <br/>\nvery good and the next time they put more thought into their choices.  <br/>\nThe first clue for your situation should have been that she didn&#39;t <br/>\nfall asleep which is a good indication that she wasn&#39;t tired, so she <br/>\nwas being honest with you in the first place.  <br/>\n<br/>\nMy children are that way with everything......they have figured out <br/>\nhow they need to eat to feel good and healthy, how much sleep they <br/>\nneed, how much exercise.  In fact, my oldest son was just telling me <br/>\nthat he has been sitting too much and his legs hurt, the kids have <br/>\ndecided that we need to go for a swim tonight.<br/>\n<br/>\nI was just remembering a time (a long time ago) when Kevin was about 1 <br/>\nyear old or so and my mother-in-law came to visit.  She is VERY <br/>\ntraditional and, at that time, so was I so it is really cool her <br/>\nadvice.  I was having a struggle with getting Kevin down for a nap and <br/>\nhe was fighting it and things were escalating into anger and <br/>\nfrustration.  My mother-in-law very gently says &quot;Why don&#39;t you just <br/>\nlet him go until he is tired and he will probably find a spot and <br/>\ncrash, that is what I did with Martin.&quot;  I was a little taken back but <br/>\nI decided to give it a shot.............he fell asleep at his high <br/>\nchair at dinner, we got a good laugh and then I put him in his crib <br/>\nfor a nice little nap; no coercing, no frustration, just his natural <br/>\ncycle, it was so great!  I learned a great lesson that day!<br/>\n<br/>\nHeidi</div>","specialLinks":[]}],"prevTopicId":7382,"nextTopicId":7390}}