{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling Teens-feeling like I failed them","postDate":"1287946745","msgId":45004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDQxQzRBQTQ1RDdGRC0yMkZDLTE1MkQ1QHdlYm1haWwtZDA1Mi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGlhMXQxNysydjBhQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhMXQxNysydjBhQGVHcm91cHMuY29tPg=="},"prevInTopic":45003,"nextInTopic":0,"prevInTime":45003,"nextInTime":45005,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"... From: plaidpanties666  One of the advantages of still being able to live at home and have someone else paying the bills is that","messageBody":"<div id=\"ygrps-yiv-570879243\">-----Original Message-----<br/>\n<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nOne of the advantages of still being able to live at home and have someone else <br/>\npaying the bills is that teens have more flexibility in the kinds of work they <br/>\ncan do. They can do volunteer work more easily than if they were trying to make <br/>\nrent and utilities every month, for instance, take temporary work, internships, <br/>\neven agree to work for less than the regular going rate. They can experiment <br/>\nwith self-employment without the same risks adults run. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<br/>\nYeah---I totally forgot the volunteer job that turned into a paying gig! He volunteered at the local independent movie theatre because it got him in free to the movies. But they asked him to come in a learn how to string the film because one of the managers would be out of the country for several months and they needed someone who could work the projector. It was a short-term (3 month) job, and the salary was a bonus---he would have done it for free! And now he has &quot;Manager for Independent Movie Theatre&quot; on his resume&#39;,<br/>\n<br/>\n<br/>\nA job like that requires someone who is flexible and willing to take a short-term gig. Nothing like a livin&#39; at home unschooler! &lt;G&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling Teens-feeling like I failed them","postDate":"1287944039","msgId":45003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhMXQxNysydjBhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDRDQxQjVDM0IzM0JGRS0yMkZDLTE0NTU5QHdlYm1haWwtZDA1Mi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":45001,"nextInTopic":45004,"prevInTime":45002,"nextInTime":45004,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"... **************** Adding to Kelly s list - Ray s just 17 (like a month ago) and he s worked at a cabinet shop, a christmas tree farm, a large animal rescue","messageBody":"<div id=\"ygrps-yiv-1098287272\">Kelly Lovejoy &lt;kbcdlovejo@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; As for jobs---seriously: how many jobs require a diploma? There&#39;s a HUGE number of jobs tailor-made for the under-18 crowd.<br/>\n </span></blockquote>****************<br/>\n<br/>\nAdding to Kelly&#39;s list - Ray&#39;s just 17 (like a month ago) and he&#39;s worked at a cabinet shop, a christmas tree farm, a large animal rescue shelter/clinic, and makes and sells his own small handmade wood crafts. He has also traded work for lessons with various craftspeople and does assorted agricultural work in season. This is all in an area that&#39;s pretty depressed, economically - small businesses can&#39;t afford to keep him on as more than a temporary worker, but are happy to recommend him and call him back any time there&#39;s enough money to bring in one more employee.<br/>\n<br/>\nOne of the advantages of still being able to live at home and have someone else paying the bills is that teens have more flexibility in the kinds of work they can do. They can do volunteer work more easily than if they were trying to make rent and utilities every month, for instance, take temporary work, internships, even agree to work for less than the regular going rate. They can experiment with self-employment without the same risks adults run. <br/>\n<br/>\nFinding work is the sort of thing that&#39;s hard to start doing - but once a teen has some work experience the process is really easier than an adult looking for work, especially in the current (U.S.) market. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Unschooling Teens-feeling like I failed them","postDate":"1287940346","msgId":45001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDQxQjVDM0IzM0JGRS0yMkZDLTE0NTU5QHdlYm1haWwtZDA1Mi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGk5bmY5MSs4NWh0QGVHcm91cHMuY29tPg==","referencesHeader":"PGk5bmY5MSs4NWh0QGVHcm91cHMuY29tPg=="},"prevInTopic":44989,"nextInTopic":45003,"prevInTime":45000,"nextInTime":45002,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"... NEVER had before) can t wait to get out of here....move away... etc etc. That is the main goal of most public schoolers -=-=-=-=- Ya know, it s the goal","messageBody":"<div id=\"ygrps-yiv-67312249\">-----Original Message-----<br/>\n<br/>\n&quot;stephanie&quot; &lt;scruffybc@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;my oldest seems to be of that mindset (w/ hint of teenage attitude that she <br/>\n </span></blockquote>NEVER had before) &quot;can&#39;t wait to get out of here....move away...&quot; etc etc. That <br/>\nis the main goal of most public schoolers<br/>\n-=-=-=-=- <br/>\nYa&#39; know, it&#39;s the goal of MOST children. <br/>\nThat&#39;s what they&#39;re supPOSED to do. The great thing about home/unschooling is that we get to enjoy their child/teenhoods.<br/>\n-=-=-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt; To be accepted to college etc or just get a job PERIOD---they want to see you <br/>\n </span></blockquote>graduated HS or have GED<br/>\n-=-=-=-=-=-=-=-<br/>\nThat&#39;s just NOT true. Many colleges---especially community colleges---have classes specifically FOR highschoolers. And many accept highschoolers for regular classes with permission.<br/>\n<br/>\n<br/>\nAs for jobs---seriously: how many jobs require a diploma? There&#39;s a HUGE number of jobs tailor-made for the under-18 crowd. Cameron&#39;s first job was with a locally owned deli. He also worked as a babysitter, as a house/petsitter, for an electronics-repair business, as a (paid) drummer in a band, on the floor for a caterer and later in the kitchen for the same caterer, for a moving company, and as a housepainter/handyman---all before he was 17/18 and before he was &quot;graduated.&quot; I&#39;m sure there were other jobs (many he held at the same time).<br/>\n<br/>\n<br/>\nHe never took the GED. I *just* made him a transcript and a diploma (for a talk I was giving on diplomas and transcripts---NOT for any job!). He&#39;s 22 and has never been asked for proof of a GED or diploma. He&#39;s never needed it. He&#39;s sat in on classes at the University of South Carolina because he knew the professor and asked. He&#39;s worked at Not Back to School Camp and the East Tennessee Unschoolers&#39; Summer Camp as a counselor/kitchen staff/first aid staff. He&#39;s worked on several organic farms for months at a time. He&#39;s working now for Unschool Adventures and has put on his own unschooling conference (The Autodidact Symposium).<br/>\n<br/>\n<br/>\nNever did he lack of a diploma/GED hold him back.<br/>\n-==-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; then I feel like a failure&lt;<br/>\n </span></blockquote>-=-=-=-=-=-=-<br/>\n<br/>\nWell, maybe you did. We can&#39;t know. <br/>\n<br/>\n<br/>\nDid you offer cool things? Did you strew cool things? Did you take them to cool places?<br/>\n<br/>\n<br/>\nWere you interested and interesting? Did you feed passions?<br/>\n<br/>\n<br/>\nYou don&#39;t need to answer these things here. You can think about them long and hard at home.<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;how to graduate/ged or is there something else she should be doing/taking? &#92;<br/>\n </span></blockquote>-=-=-=-=-=-=-=-<br/>\nEach state has its own laws as to what&#39;s required to graduate. GED is simple to prepare for: there are books galore as well as websites and practice tests.<br/>\n<br/>\n<br/>\n<br/>\nMore important is to find a passion and run with it.<br/>\n<br/>\n<br/>\nHave they considered Not Back  to School Camp or The East Tennessee Unschoolers&#39; Summer Camp? Meeting tons of other unschoolers helps SOOO much! Cameron (the 22 year old above) felt stuck until he went to camp and saw all those other kids who were so passionate and super-charged. He came away a different person---full of ideas and excitement. <br/>\n<br/>\n<br/>\nConferences and NonCons are also a great way to meet other unschoolers. There&#39;s one near you---guaranteed: they&#39;re everywhere now! They need to see kids in the same boat who are THRIVING and unstoppable!<br/>\n<br/>\n-==-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Where are all the other parents of teens? or single parent stories?<br/>\n </span></blockquote>-=-=-=-=-=-<br/>\nWe&#39;re here and there. There&#39;s a LOT of us. But I&#39;d say that many of us don&#39;t need the lists as much as we did years ago.<br/>\n<br/>\nAnd we have proof it works now!<br/>\n<br/>\n<br/>\nI have Cameron (22) and Duncan (14.5). Duncan&#39;s a bit of a homebody (seems typical) with few outside interests. But I can see that changing now. You saw some of Cameron&#39;s interests above---plus he&#39;s an avid traveler and is writing a novel. But at 14, he was skateboarding and IMing most of the days. He&#39;s serious about not accepting $$ from us anymore and wants to establish his own home now. It&#39;s hard to see him go, but I know that I&#39;ve done what I&#39;m supposed to do---he&#39;s supposed to move out and be on his own.<br/>\n<br/>\n<br/>\nDuncan&#39;s on the computer a lot but has recently shown an interest in traveling more. He has all the time in the world, so we feed whatever passion he&#39;s into at the moment.<br/>\n<br/>\n<br/>\nBecause I&#39;m not needed as much, I have more time for my passions. That also means I&#39;m not on the lists as I used to be.<br/>\n<br/>\n<br/>\nThere are more single parents than you&#39;d think. There&#39;s a yahoogroup: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingSingleParents/\">http://groups.yahoo.com/group/UnschoolingSingleParents/</a>  It&#39;s not very active, but each group is as active as its members, so you could drum up some chat if you wanted to.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Unschooling Teens-feeling like I failed them","postDate":"1287710442","msgId":44989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlraG84YzQyYitlK0NmOD1UWU9zQU5ZT1l1bzMxR3NpMUwxOUJtSkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg==","referencesHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44987,"nextInTopic":45001,"prevInTime":44988,"nextInTime":44990,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"... ***First I think that calling something a teen-ager attitude is dismissive. It will get in the way of really figuring out what is bothering your child. ","messageBody":"<div id=\"ygrps-yiv-524799596\">On Tue, Oct 19, 2010 at 8:34 AM, stephanie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scruffybc@...\">scruffybc@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   .<br/>\n&gt;<br/>\n&gt; I read about other&#39;s stories (life in hs/unschoolers lives) and I feel like<br/>\n&gt; we haven&#39;t done much...I didn&#39;t have a man influence and they weren&#39;t<br/>\n&gt; involved in big volunteer events or big projects like I&#39;ve heard out there.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***Why is this important to you?<br/>\n--------------------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The time has gone by so fast and now they are 14 and 16. The last 2 years<br/>\n&gt; they have befriended a mainstream/public schooler....eversince my oldest<br/>\n&gt; seems to be of that mindset (w/ hint of teenage attitude that she NEVER had<br/>\n&gt; before) &quot;can&#39;t wait to get out of here....move away...&quot; etc etc. That is the<br/>\n&gt; main goal of most public schoolers---ASAP outta here! My girls were never in<br/>\n&gt; a hurry...now it&#39;s all she thinks about now that she has since then met even<br/>\n&gt; MORE public school kids/friends.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***First I think that calling something a &quot;teen-ager attitude&quot; is<br/>\ndismissive. It will get in the way of really figuring out what is bothering<br/>\nyour child.<br/>\n<br/>\nMy oldest was the exact same way when we lived in a rural town. It was too<br/>\nsmall for her. She craved the big world and big world experiences. Our<br/>\nlittle PA town of 500 didn&#39;t offer the depth and scope of people or the<br/>\narray of experiences she needed/wanted. She wanted me to emancipate her so<br/>\nshe could travel at 12! We decided as a family that we needed to move, She<br/>\nis very happy and a whole different person in Portland.<br/>\n----------------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Well, I can&#39;t change this...fine (not) but if she really is going to &#39;get<br/>\n&gt; outta here&#39; the instant she turns 18 (like THEY all talk about) then I feel<br/>\n&gt; like a failure and I don&#39;t know where to begin to pick up the pieces or what<br/>\n&gt; to do to help prepare her...<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***These are your feelings, they are not necessarily the true thoughts,<br/>\nfeelings, ideas of your teens.  There are no pieces to pick up, it sounds<br/>\nmore like it is where you are not who you are. Though you are in danger of<br/>\nbecoming an unbarable mom if you keep taking it personally. A good reminder<br/>\nis QTIP---Quit Taking It Personally.<br/>\n---------------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m so torn frustrated (and so are they) at knowing that life is learning<br/>\n&gt; etc...and the crazy unrelated things the education system requires of you to<br/>\n&gt; do anything...<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>To be accepted to college etc or just get a job PERIOD---they want to see<br/>\nyou graduated HS or have GED. We have looked at sample questions etc of GED<br/>\nonline----my god who can answer half of these questions? and if as<br/>\nunschoolers we don&#39;t &#39;do school&#39; we certainly have not covered even half of<br/>\nthe questions they ask. My daughters are worried now...also feeling inferior<br/>\nto their public school friends who know what some basic labels/know how of<br/>\nmath etc.<br/>\n***So much comes up in life, but its also true that certain things may not<br/>\ncome up. My dd13 tried school after having been always unschooled. She<br/>\ncaught up to where her age peers were in 2 weeks or less. You can get some<br/>\nsample tests online and have the girls practice them. There is also 6-8 week<br/>\nGED classes.<br/>\n<br/>\nI also have found it not true that you need a GED or diploma to get a job.<br/>\nMost of the money making endeavors both my husband or I have been involved<br/>\nwith have never required any sort of &quot;educational&quot; background. SO I think<br/>\nthat really depends. I have heard that many unschoolers go to college and<br/>\ncan only imagine that they and their parents figured out a way to manage<br/>\nthat.<br/>\n-----------------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I feel the coming of my daughter being mad at me blaming me in a couple<br/>\n&gt; years when she DOES go out there on her own.....how I must&#39;ve kept her in a<br/>\n&gt; bubble and compares herself to the mainstream. I feel like now that she is<br/>\n&gt; mixing w/ some of these kids and getting an &#39;earful&#39; also of some of the<br/>\n&gt; &#39;crap&#39; that goes on with this age---she can&#39;t seem to relate and has &#39;missed<br/>\n&gt; out&#39; and finger pointed at me for her being so &#39;different&#39; and like a forty<br/>\n&gt; year old instead of a teenager....just b/c she has been taught some<br/>\n&gt; morals....<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***Feelings and thoughts are not always real. Just because you think it<br/>\ndoesn&#39;t mean it is truth. Stop worrying about these other influences and be<br/>\nthe mother your children need.<br/>\n<br/>\nYou are talking about a possibility a &quot;what-if&quot;. Live in the moment now,<br/>\nwhat do your daughters need? It sounds like they want more BIG experiences.<br/>\nCan you find ways to make that happen? For us that was trips to visit<br/>\nfriends in other places, both with the family and by herself. There are<br/>\nprograms like Unschooling Adventure where groups of unschooled teens travel<br/>\nto other countries.<br/>\n-----------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; anyway....i&#39;m feeling that loss inching it&#39;s way too....empty nest<br/>\n&gt; syndrome...but that isn&#39;t what this is all about...it&#39;s there too<br/>\n&gt; naturally...but i&#39;m frustrated with how to deal with unschool lifestyle<br/>\n&gt; teens vs/meets the mainstream teens....how to graduate/ged or is there<br/>\n&gt; something else she should be doing/taking? how do i go about any of<br/>\n&gt; it....and how do i prepare them in one year for things mainstream has been<br/>\n&gt; doing from k-12....how do i prepare them for the &#39;real world&#39;....i say that<br/>\n&gt; in quotes b/c in our unschool life the &#39;real world&#39; is truly &#39;real&#39;---live<br/>\n&gt; life and learn what you need when and now.....yeah that sounds all sweet and<br/>\n&gt; true and how it should be and it makes sense!! but unfortunately the &#39;real<br/>\n&gt; world&#39; is ruled by DOE and whatever other title the big wigs out there are<br/>\n&gt; called---the real world requires you to know how to basket weave to be a<br/>\n&gt; chef...the real world requires you to pass these crazy questions on a GED<br/>\n&gt; and manage thru life on campus etc....or how to &#39;really DO math&#39; THEIR way.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>*** There are parts of real life that require none of that. I know many<br/>\nchefs and I don&#39;t know any that had to basket weave. Most were self taught<br/>\nthrough a passion for cooking. These all sound like things that shed light<br/>\non a need for de-schooling.<br/>\n<br/>\nHelping children grow in their independence is a process. I have a 13 year<br/>\nold. She is well versed at the public transportation in the city that we<br/>\njust moved to. At first she was nervous and found a friend to ride with and<br/>\nshow her the ropes. Now (after a month) she is able to ride by herself and<br/>\nfigure things out. We use to let her drive our car in our driveway and yard<br/>\n(in the little town). I know that she will have a series of car driving<br/>\nexperiences to build up to that moment of driving by herself. My kids all<br/>\ncook to varying degrees according to ability and interest. As my dd13 gets<br/>\nolder she has asked for more knowledge pertaining to self care. I know she<br/>\nis capable of doing any house chore.<br/>\n<br/>\nHave you talked to you daughters to find out what they would like to know in<br/>\norder to be prepared for moving out? Or what they might find helpful to make<br/>\ntheir next couple of years more pleasant until they can leave?<br/>\n<br/>\nOur house is open to all my kids friends. We frequently have schooled, home<br/>\nschooled and unschooled kids over. I try to make my childrens home welcoming<br/>\nto them and their friends.<br/>\n----------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My girls and I totally agree that so many of these things are ridiculous<br/>\n&gt; and you don&#39;t even use half of these things in &#39;real life&#39;....but when we<br/>\n&gt; unschoolers speak of the real world i am seeing that it isn&#39;t realistic<br/>\n&gt; after all....sadly!!! So, how do and what do i teach/do? where do i go for<br/>\n&gt; all of this? i feel like i have failed them in so many ways now....i am fear<br/>\n&gt; they will resent me for &#39;homeschooling&#39; them and making them<br/>\n&gt; &#39;different&#39;.....to top it off, we ended up &#39;stuck&#39; rural area no support no<br/>\n&gt; friends and the time went by so fast...always thought we&#39;d get out of the<br/>\n&gt; area....so now that wonderful unschool/homeschool life doesn&#39;t look so<br/>\n&gt; great...it looks like IT is to blame for them not having all those friends<br/>\n&gt; that others have and it this lifestyle has caused them to feel very<br/>\n&gt; different from the other kids out there...even fellow unschoolers that we<br/>\n&gt; met at a conference we got to manage attending ONCE. the other kids<br/>\n&gt; stories---they all seem to have friends and very active in different<br/>\n&gt; things...even if it were just scouts or something. or they all have some<br/>\n&gt; amazing passion that they have mastered (dance, karate, music.....etc)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***This is a rhetorical question, by why are you &quot;stuck&quot;? We felt like we<br/>\nwere stuck in our rural house for a while. When we started to realize that<br/>\nthat place was now right for us we came up with a plan to move. It took us<br/>\nabout a year. We had to work together to do it but we were able to move. We<br/>\nare now in our second month in a new place, a wonderful urban location full<br/>\nof places to explore and a wonderful supportive unschooling community.<br/>\n---------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I need to help my daughters and I don&#39;t know where to begin or what exactly<br/>\n&gt; I need. Where are all the other parents of teens? or single parent stories?<br/>\n&gt; I mostly see posts from families who have both parents, lots of friends in<br/>\n&gt; area with groups/people, and with younger children. It was easier then b/c<br/>\n&gt; there were so many &#39;childrens&#39; activities out there...but older kids and<br/>\n&gt; teens are in school getting activities etc....and those lil fun cutsie<br/>\n&gt; games/activities/experiments are just not exciting to teens...what to do<br/>\n&gt; with the older ones? Especially, since they can&#39;t even think of interests on<br/>\n&gt; their own either---i sense a lil depression hitting them too. They miss<br/>\n&gt; being younger too....<br/>\n&gt;<br/>\n </span></blockquote>***I noticed that my daughter struggled with depression when we were in a<br/>\ntown that was too small to meet her needs. I drove a lot. We took lots of<br/>\nroad trips. I have 3 kids (13, 7 and 3) so that was s lot to give but she<br/>\nneeded it. We don&#39;t have a lot of income but we managed what we could when<br/>\nwe could. I drove her almost 2 hours each way to see her closest friend in<br/>\nanother rural town (slightly bigger than ours). I drove her into the nearby<br/>\ncities to do fun stuff when we could, 1-2 hours each way. It is a lot to<br/>\ngive but we found it very necessary.<br/>\n<br/>\nI am not a single mama anymore but I have been. I found that worked best<br/>\nwhen I had a great support system. I am not sure what you would need to do<br/>\nbut consider moving.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling Teens-feeling like I failed them","postDate":"1287603407","msgId":44987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzNDI1NC41NzI0My5xbUB3ZWIxMTMyMDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGk5bmY5MSs4NWh0QGVHcm91cHMuY29tPg==","referencesHeader":"PGk5bmY5MSs4NWh0QGVHcm91cHMuY29tPg=="},"prevInTopic":44986,"nextInTopic":44989,"prevInTime":44986,"nextInTime":44988,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"... I was going to say something like this, too....I sounds like you re taking it personally that your kids are bored with where you live and that you begrudge","messageBody":"<div id=\"ygrps-yiv-1260513099\"><blockquote><span title=\"ireply\">&gt;&gt;Its the goal of a lot of people who grow up in small towns, too - that&#39;s  not <br/>\n&gt;&gt;necessarily a &quot;school&quot; thing so much as a matter of people wanting  more choices <br/>\n&gt;&gt;than what&#39;s available. If you moved out to a rural area  thinking your kids <br/>\n&gt;&gt;would love it there and stay forever, then you  goofed, you didn&#39;t look at the <br/>\n&gt;&gt;data. But that&#39;s not a catastrophe, it&#39;t  time to adjust your mindset - you kids <br/>\n&gt;&gt;want more than what you have  where you are, how can you help them get that?&gt;&gt;<br/>\n<br/>\n </span></blockquote>I was going to say something like this, too....I sounds like you&#39;re taking it <br/>\npersonally that your kids are bored with where you live and that you begrudge <br/>\nthem excitement and new adventures!  I have a late teen, and early teen, and a <br/>\ntoddler, all always unschooled.  My late teen just got back from Japan, is <br/>\ntaking a couple of classes at the local community college (with no high school <br/>\ndiploma or GED, and FOR FREE...yay, washington state programs!) and then is off <br/>\nto Thailand at the end of December.  My early teen is always chatting with <br/>\npeople elsewhere, visiting friends in other states or across the border in <br/>\nCanada.  He also loves to go to the big city and hang out, find his way around, <br/>\nmeet up with friends.  I know they want to explore the world!  I want to HELP <br/>\nthem do that!  They are wonderful people, don&#39;t have a &quot;rebellious&quot; bone in <br/>\ntheir bodies, as they&#39;ve always had me there to help them get what they want.  <br/>\nMy young teen is thinking he may want to do a culinary arts program (again for <br/>\nfree) through the community college/technical colleges in the state, and I told <br/>\nhim you pick out the best school for it, and we&#39;ll move there for 2 years.  <br/>\nWhat&#39;s two years?  What&#39;s a house rental?  Let your kids know you&#39;re willing to <br/>\ngo out of your way to help them explore the world, and be HAPPY about it :)<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling Teens-feeling like I failed them","postDate":"1287602273","msgId":44986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5bmY5MSs4NWh0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44984,"nextInTopic":44987,"prevInTime":44985,"nextInTime":44987,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"... *************** Its the goal of a lot of people who grow up in small towns, too - that s not necessarily a school thing so much as a matter of people","messageBody":"<div id=\"ygrps-yiv-2050235538\">&quot;stephanie&quot; &lt;scruffybc@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;my oldest seems to be of that mindset (w/ hint of teenage attitude that she NEVER had before) &quot;can&#39;t wait to get out of here....move away...&quot; etc etc. That is the main goal of most public schoolers<br/>\n </span></blockquote>***************<br/>\n<br/>\nIts the goal of a lot of people who grow up in small towns, too - that&#39;s not necessarily a &quot;school&quot; thing so much as a matter of people wanting more choices than what&#39;s available. If you moved out to a rural area thinking your kids would love it there and stay forever, then you goofed, you didn&#39;t look at the data. But that&#39;s not a catastrophe, it&#39;t time to adjust your mindset - you kids want more than what you have where you are, how can you help them get that?<br/>\n<br/>\nHere&#39;s the good bit - since they&#39;re not in school, they don&#39;t have to wait for that &quot;more&quot; like their friends do. The catch is, you&#39;re the parent; its up to you to help them get what they want right now, not two to four years from now. <br/>\n<br/>\nIt might be good to look into unschooling conferences, campouts, events like Not Back to School Camp, music festivals, and whatnot. What kinds of things do your kids like? Find ways to travel to see/do those things - either as a family or as individuals.<br/>\n<br/>\nThat may involve some creative financing - looking for people to ride with and stay with, looking for work-exchange options for festivals, scholarships for conferences and camps. Do you have extended family you can ask for help? Either with finances or as places for your kids to crash while travelling? Those are things to look into. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; (like THEY all talk about)<br/>\n<br/>\n </span></blockquote>You make several comments that are very dismissive of teens - I can&#39;t help but think that you need to do some deschooling about the teen years! Its really normal for parents to discover ourselves deschooling bits or our past as our kids get to ages that were important to Us when we were that age - old baggage comes up and needs to be worked through. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To be accepted to college etc or just get a job PERIOD---they want to see you graduated HS or have GED<br/>\n </span></blockquote>*************<br/>\n<br/>\nWhy wait, though? Remember, this is one of the Good Parts of home/unschooling, they&#39;re not stuck in school all day. They Don&#39;t need a diploma or GED to look for work or take classes right Now, at 14 and 16. What they do need is help - its harder for kids to find jobs. They&#39;ll need your help looking and help with things like transportation. They may also need your help looking into adult or community college classes. And once they have some real college credits, the question stops being &quot;did you graduate/GED?&quot; and becomes &quot;do these credits transfer?&quot;. Job experience, too, looks great when applying anywhere - to college Or another job. There are plenty of kids with diplomas and no skills. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; then I feel like a failure<br/>\n<br/>\n </span></blockquote>All that being said... brace yourself. Maybe you *have* failed in your original goals or dreams, but that doesn&#39;t mean you have to keep those goals/dreams or go on failing. You can start afresh, think about what&#39;s important in terms of your relationship with your kids. Dream new dreams. Will you stop loving your kids if they move away? Probably not, but will your Resent them? It sounds as though you might, and that&#39;s something for you to work on Now. You don&#39;t have to think that a good relationship means your kids live next door - time to broaden your thinking. How can you go build a partnership with people who may not stay right there at your side for very much longer? That&#39;s the important thing. <br/>\n<br/>\nTake some time to grieve, don&#39;t just shrug and say &quot;fine (not)&quot; actually take some time to mourn the loss of your fantasy family life. And then set that fantasy aside so that you can figure out what your real kids really need from you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;how to graduate/ged or is there something else she should be doing/taking? <br/>\n </span></blockquote>**********<br/>\n<br/>\nWhat does she Want to do or take? <br/>\nIf she doesn&#39;t know and you don&#39;t know, maybe school would be better. You&#39;ve fallen down a little in terms of doing the research - maybe because you haven&#39;t had time or support, but the reasons don&#39;t really matter. As I said before, having blown it doesn&#39;t mean you have to keep on blowing it. Do some research. Contact area homeschool groups for specific information about graduation requirements. If your dd wants to take the GED, help her - get practice tests and look for classes if you don&#39;t think you can help personally. Also check local laws about the GED - some places you can&#39;t take it before you&#39;re 18 anyway, so you may find its easier to jump through the graduation hoops, whatever they may be - in my area there really aren&#39;t any, my umbrella program merely prints out a &quot;diploma&quot; for a small fee. Tada. But if you don&#39;t live in TN, that doesn&#39;t help you! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Where are all the other parents of teens? or single parent stories?<br/>\n<br/>\n </span></blockquote>There are single parents who home/unschool but not very many - for reasons that are probably pretty obvious to you ;) If you wait a couple days a few may come out of the woodwork (they won&#39;t have as much time online, though so it may take a few days!). Also do a search through the archives for &quot;single mom&quot; and see what comes up.<br/>\n<br/>\nHere&#39;s a good all purpose link on teens:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/\">http://sandradodd.com/teen/</a><br/>\n<br/>\nand one on single parenting:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/singleparent\">http://sandradodd.com/singleparent</a><br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling Teens-feeling like I failed them","postDate":"1287594276","msgId":44984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5bjdmNCtnaDdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5bjZtYit0dWJjQGVHcm91cHMuY29tPg=="},"prevInTopic":44983,"nextInTopic":44986,"prevInTime":44983,"nextInTime":44985,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"Our son at 15 now, isn t interested in or imo ready at all for school either as high school or community college. He is engaged and happy both at home and in","messageBody":"<div id=\"ygrps-yiv-1048705211\">Our son at 15 now, isn&#39;t interested in or imo ready at all for &quot;school&quot; either as high school or community college. He is engaged and happy both at home and in many activities but much less aware of or able so far to handle, the complex social pressures that Favorite Daughter took on at the same age. Which is fine too --<br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt; Our daughter started fulltime &quot;school&quot; at the community college by her own choice, at age 15. No academic preparation for it at all, no SAT or other testing -- although she did dance with a private company for several years and it was set up in a typically schoolish, conformist way. I think about how that may have influenced her attitudes toward institutional demands and conformity, but what I think doesn&#39;t matter that much, because it really always was her own choice whether to keep doing it, how to handle it and how to leave (which she finally did.) She learned a lot about authority and comformity in groups, how to accommodate conflict and when to go along versus when to take a stand. She learned about what she wanted enough to compromise on things that didn&#39;t matter that much, and what she would not accept no matter what -- and that most of her peers didn&#39;t see the world as she did. A valuable lesson for sure! </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling Teens-feeling like I failed them","postDate":"1287593483","msgId":44983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5bjZtYit0dWJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5a3FtMSt1dWZzQGVHcm91cHMuY29tPg=="},"prevInTopic":44982,"nextInTopic":44984,"prevInTime":44982,"nextInTime":44984,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"Both Schuyler and Nance said what I would say, except better. :) I wish I knew how to convey the dramatic difference between the conventional view of the teen","messageBody":"<div id=\"ygrps-yiv-209277751\">Both Schuyler and Nance said what I would say, except better. :)<br/>\n<br/>\nI wish I knew how to convey the dramatic difference between the conventional view of the teen years (even as most teens themselves see it) and what my family has experienced as lifelong unschoolers. Our children are now 20 and 15. I know how unbelievable this will sound but never ONCE, honestly, have they had what conventional society considers a &quot;typical&quot; teen moment. I have a hard time believing it myself, and it&#39;s hard to explain without feeling like you&#39;re bragging. It is SO wonderful.<br/>\n<br/>\nOur daughter started fulltime &quot;school&quot; at the community college by her own choice, at age 15. No academic preparation for it at all, no SAT or other testing -- although she did dance with a private company for several years and it was set up in a typically schoolish, conformist way. I think about how that may have influenced her attitudes toward institutional demands and conformity, but what I think doesn&#39;t matter that much, because it really always was her own choice whether to keep doing it, how to handle it and how to leave (which she finally did.) She learned a lot about authority and comformity in groups, how to accommodate conflict and when to go along versus when to take a stand. She learned about what she wanted enough to compromise on things that didn&#39;t matter that much, and what she would not accept no matter what -- and that most of her peers didn&#39;t see the world as she did. A valuable lesson for sure!<br/>\n<br/>\nBtw I was thoroughly schooled myself and even earned an education doctorate in my 20s, but it doesn&#39;t compare to what I&#39;ve learned from my kids, unschooling with them. I heard Margaret Mead&#39;s daughter Dr. Bateson interviewed on NPR the other day about her new book:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ikedacenter.org/thinkers/bateson_int.htm\">http://www.ikedacenter.org/thinkers/bateson_int.htm</a><br/>\n<br/>\nShe&#39;s about 70 now and learns from her teen grandchildren, which she says is a key lesson for THEM to learn, that they can teach. It changes their self-image as a passive receptable like too many other teens, and therefore it changes your relationship with them. ANd that makes a big difference for everyone.</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling Teens-feeling like I failed them","postDate":"1287579607","msgId":44981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5bXA0bitsOWsxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44980,"nextInTopic":44982,"prevInTime":44980,"nextInTime":44982,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"As hard as it is to be 40-something and a single Mom, it is even harder to be a teenager. And to run up against some teens who seem to have it all figured out.","messageBody":"<div id=\"ygrps-yiv-1280992621\">As hard as it is to be 40-something and a single Mom, it is even harder to be a teenager. And to run up against some teens who seem to have it all figured out. . . that&#39;s not helping. <br/>\n<br/>\nOne public school thing my DD is taking this semester (all her choice, believe me! :) ) is some sort of career guidance course. She&#39;s in 10th grade at the local charter school. <br/>\n<br/>\nThis course started with having the kids do a budget. And it was overwhelming. They went through all the adult decisions we all make -- insurance and car choice and housing costs and groceries and all those other decisions/costs we juggle all the time. <br/>\n<br/>\nI believe the point was to tell the kids to &quot;stay in school and get a college degree and thereby get a good job and life will be just peachy.&quot; <br/>\n<br/>\nBut the lesson DD took home was that she&#39;s not ready to move out into the real world and won&#39;t be for a long time. My part of the conversation was to reassure her that she never has to leave and I hope she stays for a long, long time. <br/>\n<br/>\nI don&#39;t know exactly how that might fit in your discussions with your daughters but I think the public school kids they are hanging out with are misinterpreting the message they are getting. At least from school. Maybe they are being told to get out of their home by their parents. This, sadly, does happen.<br/>\n<br/>\nAs for the rest of it, talk to them. See what they want to do. Do they want to try an online class? Get a job? Volunteer? I don&#39;t know what practical options you have near you but getting out into the world and/or continuing to homeschool with a goal in mind -- one they figure out -- might give them a taste of what leaving home would be like. <br/>\n<br/>\nTo me, this is one of the nice parts of living as unschoolers. The kids are making decisions for themselves more and more, trying things in the full knowledge that they can always stop if it doesn&#39;t work but generally being very committed to whatever they choose because it is their choice. And that we support them in every way.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;stephanie&quot; &lt;scruffybc@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Everyone!<br/>\n&gt; I am not sure how to make this as short as possible or get &#39;my&#39; story in written form...I just keep crying and my anxiety attacks are driving me crazy. <br/>\n&gt; <br/>\n&gt; It&#39;s been a long road...<br/>\n&gt; I&#39;m a single mother (father not involved in pic at all)<br/>\n&gt; The girls are teens now.<br/>\n&gt; When they were little we were left in a rural area no homeschooling (let alone unschooling) support/friends at all.<br/>\n&gt; I did the best I could.<br/>\n&gt; I read about other&#39;s stories (life in hs/unschoolers lives) and I feel like we haven&#39;t done much...I didn&#39;t have a man influence and they weren&#39;t involved in big volunteer events or big projects like I&#39;ve heard out there.<br/>\n&gt; <br/>\n&gt; The time has gone by so fast and now they are 14 and 16. The last 2 years they have befriended a mainstream/public schooler....eversince my oldest seems to be of that mindset (w/ hint of teenage attitude that she NEVER had before) &quot;can&#39;t wait to get out of here....move away...&quot; etc etc. That is the main goal of most public schoolers---ASAP outta here! My girls were never in a hurry...now it&#39;s all she thinks about now that she has since then met even MORE public school kids/friends. <br/>\n&gt; <br/>\n&gt; Well, I can&#39;t change this...fine (not) but if she really is going to &#39;get outta here&#39; the instant she turns 18 (like THEY all talk about) then I feel like a failure and I don&#39;t know where to begin to pick up the pieces or what to do to help prepare her...<br/>\n&gt; <br/>\n&gt; I&#39;m so torn frustrated (and so are they) at knowing that life is learning etc...and the crazy unrelated  things the education system requires of you to do anything...<br/>\n&gt; <br/>\n&gt; To be accepted to college etc or just get a job PERIOD---they want to see you graduated HS or have GED. We have looked at sample questions etc of GED online----my god who can answer half of these questions? and if as unschoolers we don&#39;t &#39;do school&#39; we certainly have not covered even half of the questions they ask. My daughters are worried now...also feeling inferior to their public school friends who know what some basic labels/know how of math etc.<br/>\n&gt; <br/>\n&gt; I feel the coming of my daughter being mad at me blaming me in a couple years when she DOES go out there on her own.....how I must&#39;ve kept her in a bubble and compares herself to the mainstream. I feel like now that she is mixing w/ some of these kids and getting an &#39;earful&#39; also of some of the &#39;crap&#39; that goes on with this age---she can&#39;t seem to relate and has &#39;missed out&#39; and finger pointed at me for her being so &#39;different&#39; and like a forty year old instead of a teenager....just b/c she has been taught some morals....<br/>\n&gt; <br/>\n&gt; anyway....i&#39;m feeling that loss inching it&#39;s way too....empty nest syndrome...but that isn&#39;t what this is all about...it&#39;s there too naturally...but i&#39;m frustrated with how to deal with unschool lifestyle teens vs/meets the mainstream teens....how to graduate/ged or is there something else she should be doing/taking? how do i go about any of it....and how do i prepare them in one year for things mainstream has been doing from k-12....how do i prepare them for the &#39;real world&#39;....i say that in quotes b/c in our unschool life the &#39;real world&#39; is truly &#39;real&#39;---live life and learn what you need when and now.....yeah that sounds all sweet and true and how it should be and it makes sense!! but unfortunately the &#39;real world&#39; is ruled by DOE and whatever other title the big wigs out there are called---the real world requires you to know how to basket weave to be a chef...the real world requires you to pass these crazy questions on a GED and manage thru life on campus etc....or how to &#39;really DO math&#39; THEIR way. <br/>\n&gt; <br/>\n&gt; My girls and I totally agree that so many of these things are ridiculous and you don&#39;t even use half of these things in &#39;real life&#39;....but when we unschoolers speak of the real world i am seeing that it isn&#39;t realistic after all....sadly!!! So, how do and what do i teach/do? where do i go for all of this? i feel like i have failed them in so many ways now....i am fear they will resent me for &#39;homeschooling&#39; them and making them &#39;different&#39;.....to top it off, we ended up &#39;stuck&#39; rural area no support no friends and the time went by so fast...always thought we&#39;d get out of the area....so now that wonderful unschool/homeschool life doesn&#39;t look so great...it looks like IT is to blame for them not having all those friends that others have and it this lifestyle has caused them to feel very different from the other kids out there...even fellow unschoolers that we met at a conference we got to manage attending ONCE. the other kids stories---they all seem to have friends and very active in different things...even if it were just scouts or something. or they all have some amazing passion that they have mastered (dance, karate, music.....etc)<br/>\n&gt; <br/>\n&gt; I need to help my daughters and I don&#39;t know where to begin or what exactly I need. Where are all the other parents of teens? or single parent stories? I mostly see posts from families who have both parents, lots of friends in area with groups/people, and with younger children. It was easier then b/c there were so many &#39;childrens&#39; activities out there...but older kids and teens are in school getting activities etc....and those lil fun cutsie games/activities/experiments are just not exciting to teens...what to do with the older ones? Especially, since they can&#39;t even think of interests on their own either---i sense a lil depression hitting them too. They miss being younger too....<br/>\n&gt; <br/>\n&gt; Tears...<br/>\n&gt; Thank you in advance.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling Teens-feeling like I failed them","postDate":"1287576742","msgId":44980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGNzg3MDIzRTRDMzQ1QkRCRDZBNURFRjZEOTVBQzc0QENvbm5pZVBDPg==","inReplyToHeader":"PEJMVTE1MC13NDQ4NjhBQzZCOTFDRkI0MTdBMTBDOEEzNUMwQHBoeC5nYmw+","referencesHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPiA8QkxVMTUwLXc0NDg2OEFDNkI5MUNGQjQxN0ExMEM4QTM1QzBAcGh4LmdibD4="},"prevInTopic":44979,"nextInTopic":44981,"prevInTime":44979,"nextInTime":44981,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"From: Linda Panek Sent: Wednesday, October 20, 2010 3:34 AM To: unschoolingbasics@yahoogroups.com Subject: RE: [unschoolingbasics] Unschooling Teens-feeling","messageBody":"<div id=\"ygrps-yiv-1945152447\">From: Linda Panek <br/>\nSent: Wednesday, October 20, 2010 3:34 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: RE: [unschoolingbasics] Unschooling Teens-feeling like I failed them<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I also think kids sometimes want to go to school but don&#39;t understand what a straight-jacket or pressure school is. DO they realise they would have so little free time and so few choices?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>School isn&#39;t some big bad scary place. Yes, there are trade offs if a child is in school. A kid can go to school and still have free time if they don&#39;t sign up for a ton of extra curricular activities. A kid can still have free time if a parent is their advocate. I am not saying that school is great but I am also not saying that it is horrible. Some kids benefit greatly from going to school. My nephew gets to take choir and drama, which is something that his mom can&#39;t afford outside of school. I get annoyed with how there seems to be a large homeschooling/unschooling population that paints school out to be a really evil place that should be avoided at all costs. It is just another choice that comes with advantages and disadvantages. My sister has her children in school but she is still their advocate. She doesn&#39;t think twice about setting the school straight when it comes to her kids. If there is something that her kids need from the school, she makes sure they get it. If a kid goes to school and likes it, that&#39;s great. If a kid goes to school and hates it, then there is always the option of them going back to homeschooling. There is a huge difference between a kid that is in school because he or she wants to be there and a kid that is being forced to go. If mom is emotionally absent and depressed, then unschooling might not be the best choice because it does require a parent to be physically and emotionally present. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling Teens-feeling like I failed them","postDate":"1287574607","msgId":44979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNDAwMS40MDQ1Ni5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PEJMVTE1MC13NDQ4NjhBQzZCOTFDRkI0MTdBMTBDOEEzNUMwQHBoeC5nYmw+","referencesHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPiA8QkxVMTUwLXc0NDg2OEFDNkI5MUNGQjQxN0ExMEM4QTM1QzBAcGh4LmdibD4="},"prevInTopic":44978,"nextInTopic":44980,"prevInTime":44978,"nextInTime":44980,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"My experience is that teens are never easy whatever you do!  My experience is with unschooled teenagers is radically different from what you write. My own 13","messageBody":"<div id=\"ygrps-yiv-565254206\">&quot;My experience is that teens are never easy whatever you do! &quot;<br/>\n<br/>\nMy experience is with unschooled teenagers is radically different from what you <br/>\nwrite. My own 13 year old son is someone whose company I enjoy. I know a fair <br/>\nnumber of teenaged unschooled folks and they are often very polite and <br/>\ninteresting and a pleasure to be around. It seems that having been trusted and <br/>\nrespected for much of their lives leads to being much more adept at riding <br/>\nthrough one of many hormonally fuelled periods of life. <br/>\n<br/>\n&quot;I also think kids sometimes want to go to school but don&#39;t understand what a <br/>\nstraight-jacket or pressure school is. DO they realise they would have so little <br/>\nfree time and so few choices? One of mine wanted to go to school because he <br/>\nthought they made fudge at school!&quot;<br/>\n<br/>\nMaybe they did make fudge at school. <br/>\n<br/>\nThere is a wonderful account by Heidi Snavley&#39;s son Kevin of his year of <br/>\nchoosing to go to <br/>\nschool: <a rel=\"nofollow\" target=\"_blank\" href=\"http://fivefreebirds.blogspot.com/2008/07/unschool-v-school.html.\">http://fivefreebirds.blogspot.com/2008/07/unschool-v-school.html.</a> <br/>\nDismissing your child&#39;s desire to go school as something whimsical or half-baked <br/>\nisn&#39;t particularly respectful. Often younger children see school as something <br/>\nfun and light and engaging in a way that those of us who have chosen not to send <br/>\nthem may argue isn&#39;t true. It is important to really explore what it is that <br/>\nthey are hoping to get from school and see if their desire to go to school stems <br/>\nfrom something that can easily be offered to them within the home or a <br/>\nhomeschooling life. But a child who is allowed to freely make a choice about <br/>\ngoing to school or not will have a very different experience than one that is <br/>\nforced to go or one that is excluded from going. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Linda Panek &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:linda.panek@...\">linda.panek@...</a>&gt;<br/>\n<br/>\nHi there,<br/>\n<br/>\nI am a home-schooler who veers towards unschooling but doesn&#39;t have the courage <br/>\nto drop my structure completely. I feel like we miss out from the freedom and <br/>\nthe opportunuity to really allow each person to be themselves, to make their own <br/>\nchoices, and so on. I admire you for having the courage of your convictions and <br/>\ngoing for it!<br/>\n<br/>\nMy experience is that teens are never easy whatever you do! They are not sure <br/>\nwhat direction to go in, but if we decide for them we are robbing them I think. <br/>\n<br/>\n<br/>\nBeing a single Mum is never easy, or a married Mum who&#39;s husband doesn&#39;t get <br/>\ninvolved... that&#39;s not easy either. I think we just have to do the best we can <br/>\neach day, with whatever resources we do have of time energy and so on. Nobody <br/>\ndoes a &#39;refect job of parenting;&#39; whatever a perfect job is anyway. I suppose we <br/>\nall want our kids to come out happy and knowing where they are going but that <br/>\noften takes a little longer.<br/>\n<br/>\nMy oldest two struggled in teen years, one of them in particular I really was <br/>\nvery worried,  but they are now in their early twenties and deeply grateful for <br/>\nwhat I have done for them, and I think they are both able to hold their own in <br/>\nthe world now. They are true characters because I haven&#39;t squashed them.<br/>\n<br/>\nI think if you can, talk to your girls, get ideas of what they want to do, even <br/>\nif just this week, don&#39;t think too far ahead. Just let them know you&#39;ll support <br/>\nthem as much as you are able, but it&#39;s their life in the end!<br/>\n<br/>\nI also think kids sometimes want to go to school but don&#39;t understand what a <br/>\nstraight-jacket or pressure school is. DO they realise they would have so little <br/>\nfree time and so few choices? One of mine wanted to go to school because he <br/>\nthought they made fudge at school!<br/>\n<br/>\nYEs I miss the times whe n my kids were younger and things were relatively <br/>\nsimple. But they ahve to grow up and the benefits when they are grown are <br/>\nenormous! <br/>\n<br/>\n<br/>\nI&#39;d say hang on in there and try to think it will all be worth it in a few years <br/>\ntime!! Not easy I know. But don&#39;t beat yourself up for doing the best you could <br/>\nin hard circumstances.<br/>\n<br/>\nI say well done to you!<br/>\n<br/>\nMy very best wishes to you!<br/>\n<br/>\nLInda<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling Teens-feeling like I failed them","postDate":"1287573632","msgId":44977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MDI4MS40MzkxMy5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":44976,"nextInTopic":44978,"prevInTime":44976,"nextInTime":44978,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"I feel the coming of my daughter being mad at me blaming me in a couple years when she DOES go out there on her own.....how I must ve kept her in a bubble and","messageBody":"<div id=\"ygrps-yiv-559609813\">&quot;I feel the coming of my daughter being mad at me blaming me in a couple years <br/>\nwhen she DOES go out there on her own.....how I must&#39;ve kept her in a bubble and <br/>\ncompares herself to the mainstream. I feel like now that she is mixing w/ some <br/>\nof these kids and getting an &#39;earful&#39; also of some of the &#39;crap&#39; that goes on <br/>\nwith this age---she can&#39;t seem to relate and has &#39;missed out&#39; and finger pointed <br/>\nat me for her being so &#39;different&#39; and like a forty year old instead of a <br/>\nteenager....just b/c she has been taught some morals....&quot;<br/>\n---------------------<br/>\n<br/>\nThis doesn&#39;t read as though you are looking to bridge the gap that is growing <br/>\nbetween you and your eldest daughter. This reads as though you are working very <br/>\nhard to justify the choices you made that she is now feeling limited by and <br/>\nbound to. If it were me and Simon or Linnaea came to me feeling left out by the <br/>\nchoices that David and I have made, if they were feeling horrible for being odd, <br/>\nI would apologise. I would probably tell them that the decisions that I made I <br/>\nfelt were done with the best of all intentions and I would ask them what I could <br/>\ndo to help them now. <br/>\n<br/>\nDeciding that your daughter&#39;s complaints are all about the influence of both <br/>\nbeing a teenager and her new friends isn&#39;t a particularly helpful approach. <br/>\nRather than looking for something to blame it on it would be much more effective <br/>\nfor you to look for things that you can do to help your daughter deal with both <br/>\nhaving new friends and moving toward adulthood. What does she think would help <br/>\nher to catch up with her friends? What kind of experiences would she like to <br/>\nhave? What kind of access to things would make a difference? Or is it not <br/>\nsomething that can be solved, just something that acknowledging might help to <br/>\nsettle her mind? <br/>\n<br/>\n-----------------<br/>\n&quot;My girls and I totally agree that so many of these things are ridiculous and <br/>\nyou don&#39;t even use half of these things in &#39;real life&#39;....but when we <br/>\nunschoolers speak of the real world i am seeing that it isn&#39;t realistic after <br/>\nall....sadly!!! So, how do and what do i teach/do? where do i go for all of <br/>\nthis? i feel like i have failed them in so many ways now....i am fear they will <br/>\nresent me for &#39;homeschooling&#39; them and making them &#39;different&#39;.....to top it <br/>\noff, we ended up &#39;stuck&#39; rural area no support no friends and the time went by <br/>\nso fast...always thought we&#39;d get out of the area....so now that wonderful <br/>\nunschool/homeschool life doesn&#39;t look so great...it looks like IT is to blame <br/>\nfor them not having all those friends that others have and it this lifestyle has <br/>\ncaused them to feel very different from the other kids out there...even fellow <br/>\nunschoolers that we met at a conference we got to manage attending ONCE. the <br/>\nother kids stories---they all seem to have friends and very active in different <br/>\nthings...even if it were just scouts or something. or they all have some amazing <br/>\npassion that they have mastered (dance, karate, music.....etc)&quot;<br/>\n--------------<br/>\n<br/>\nI&#39;m not sure what unschooling looks like from your perspective. We live fairly <br/>\nrurally, Simon and Linnaea have a few friends and we go dancing once a week, but <br/>\nmostly we are home, hanging out together, laughing and playing and watching <br/>\nvideos and television and chatting and finding things that engage us and walking <br/>\nthe dog and feeding the cats and sewing and knitting and making bread and trying <br/>\nmy hand at cheese, spray painting a desk, sharing stories, fixing meals for sick <br/>\nfriends. Our lives are quiet and fairly simple things. We have company come <br/>\nsometimes. Friends from L.A. stayed for 2 weeks with a break of a few weeks <br/>\nbetween each week and left on Monday. A cousin and uncle are coming next weekend <br/>\nand then no long term visitors probably until April. It isn&#39;t a hermit&#39;s life, <br/>\nbut it is a life more rich in the company of each other than enriched by more <br/>\nthan us. <br/>\n<br/>\nI work hard to help to my children achieve the things they want from video games <br/>\nto segway riding to specific meals. I listen to them, I talk to them, I watch <br/>\nthem. So far, at 13 and 10, they are largely happy people. They aren&#39;t needy and <br/>\nthey are generous and kind and considerate. They have never been instructed in <br/>\nmorality, although I have worked to talk about how treating people kindly can <br/>\nhelp them to enjoy you more. Most of their kindness comes from having <br/>\nexperienced a life filled with gentle kindness and generosity. If you can reach <br/>\nwith kindness and generosity to your girls now it will go a long way to help <br/>\nthem to feel kinder and more generous from today forward. <br/>\n<br/>\n<br/>\n---------------<br/>\n&quot;I need to help my daughters and I don&#39;t know where to begin or what exactly I <br/>\nneed. Where are all the other parents of teens? or single parent stories? I <br/>\nmostly see posts from families who have both parents, lots of friends in area <br/>\nwith groups/people, and with younger children. It was easier then b/c there were <br/>\nso many &#39;childrens&#39; activities out there...but older kids and teens are in <br/>\nschool getting activities etc....and those lil fun cutsie <br/>\ngames/activities/experiments are just not exciting to teens...what to do with <br/>\nthe older ones? Especially, since they can&#39;t even think of interests on their <br/>\nown either---i sense a lil depression hitting them too. They miss being younger <br/>\ntoo....&quot;<br/>\n-------------------<br/>\n<br/>\nI think maybe you are seeing lack where there is none. There are a fair number <br/>\nof posters with older children. Maybe it feels like you are all alone because <br/>\nyou are looking for more stories of difficult teen years. Ronnie Maier writes a <br/>\nblog that is filled with stories of her two teenaged <br/>\ngirls. <a rel=\"nofollow\" target=\"_blank\" href=\"http://sites.google.com/site/dragonflykaizen/unschooling-1\">http://sites.google.com/site/dragonflykaizen/unschooling-1</a> is a list of <br/>\nthe more specifically unschooling related things. Sandra Dodd&#39;s children are all <br/>\nteens and older, Joyce Fetteroll&#39;s daughter is no longer a little girl. My two <br/>\nare 10 and 13, both dancing with puberty. Your writing again looks like you are <br/>\nlooking for external explanations of why it isn&#39;t all smooth sailing with you. <br/>\n<br/>\n<br/>\n-------------------<br/>\n&quot;To be accepted to college etc or just get a job PERIOD---they want to see you <br/>\ngraduated HS or have GED. We have looked at sample questions etc of GED <br/>\nonline----my god who can answer half of these questions? and if as unschoolers <br/>\nwe don&#39;t &#39;do school&#39; we certainly have not covered even half of the questions <br/>\nthey ask. My daughters are worried now...also feeling inferior to their public <br/>\nschool friends who know what some basic labels/know how of math etc.&quot;<br/>\n-------------------<br/>\n<br/>\nIf your daughters need to take a GED there are often courses at a local <br/>\ncommunity college to prepare them for it. I know that when Sandra Dodd&#39;s <br/>\nchildren applied for jobs they filled in homeschooled for their educational <br/>\ninformation. If the employer needed more information Sandra put together the <br/>\nmore information. <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/jobs\">http://sandradodd.com/teen/jobs</a> has a few case studies in how <br/>\nthings have gone for other teenagers when they looked for employment. Here&#39;s <br/>\nmore stories about unschooled teens: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/people\">http://sandradodd.com/teen/people</a> <br/>\n<br/>\nI think it is easy to feel afraid in the face of the whole wide world that you <br/>\nhaven&#39;t done enough. Sometimes what you haven&#39;t done feels so vast and what you <br/>\nhave done seems so little. Well, probably all the time that&#39;s true. There is so <br/>\nmuch in the world to do and such a finite time to do it in. Rather than dwell in <br/>\na fearful whirlpool, look for ways to help your girls to do what they want to <br/>\ndo. Instead of going and seeing the GED as some insurmountable task that society <br/>\nhas set against your two girls, look for ways to either surmount the GED or ways <br/>\nto get what they want without taking the GED. For example, going to community <br/>\ncollege trumps a GED on a job application, even just one class. <br/>\n<br/>\nWhen your daughter is unhappy be kind to her, just as you were, or wanted to be <br/>\nwhen she was littler girl. Look for things that will lift her up. If she likes <br/>\nmakeup, a cool new palette of eyeshadow, or sitting and watching Lauren Luke <br/>\nfrom South Shields do her fantastic makeup tutorials on youtube. I love her <br/>\nvoice. If she&#39;s excited by clothes go thrift shopping and play with clothes, <br/>\nwhatever it is that will help her feel fuller and less needy, go with that. <br/>\nConnect, don&#39;t look for ways that it isn&#39;t about you, look for things that you <br/>\ncan do. And remember that however lost you may feel, your daughters may feel <br/>\nsimilarly. Coddle and comfort them. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":331372850,"authorName":"Linda Panek","from":"Linda Panek &lt;linda.panek@...&gt;","profile":"lindap346","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Unschooling Teens-feeling like I failed them","postDate":"1287563693","msgId":44978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE1MC13NDQ4NjhBQzZCOTFDRkI0MTdBMTBDOEEzNUMwQHBoeC5nYmw+","inReplyToHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg==","referencesHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44977,"nextInTopic":44979,"prevInTime":44977,"nextInTime":44979,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"Hi there, I am a home-schooler who veers towards unschooling but doesn t have the courage to drop my structure completely. I feel like we miss out from the","messageBody":"<div id=\"ygrps-yiv-435146256\">Hi there,<br/>\n<br/>\nI am a home-schooler who veers towards unschooling but doesn&#39;t have the courage to drop my structure completely. I feel like we miss out from the freedom and the opportunuity to really allow each person to be themselves, to make their own choices, and so on. I admire you for having the courage of your convictions and going for it!<br/>\n<br/>\nMy experience is that teens are never easy whatever you do! They are not sure what direction to go in, but if we decide for them we are robbing them I think. <br/>\n<br/>\nBeing a single Mum is never easy, or a married Mum who&#39;s husband doesn&#39;t get involved... that&#39;s not easy either. I think we just have to do the best we can each day, with whatever resources we do have of time energy and so on. Nobody does a &#39;refect job of parenting;&#39; whatever a perfect job is anyway. I suppose we all want our kids to come out happy and knowing where they are going but that often takes a little longer.<br/>\n<br/>\nMy oldest two struggled in teen years, one of them in particular I really was very worried,  but they are now in their early twenties and deeply grateful for what I have done for them, and I think they are both able to hold their own in the world now. They are true characters because I haven&#39;t squashed them.<br/>\n<br/>\nI think if you can, talk to your girls, get ideas of what they want to do, even if just this week, don&#39;t think too far ahead. Just let them know you&#39;ll support them as much as you are able, but it&#39;s their life in the end!<br/>\n<br/>\nI also think kids sometimes want to go to school but don&#39;t understand what a straight-jacket or pressure school is. DO they realise they would have so little free time and so few choices? One of mine wanted to go to school because he thought they made fudge at school!<br/>\n<br/>\nYEs I miss the times whe n my kids were younger and things were relatively simple. But they ahve to grow up and the benefits when they are grown are enormous! <br/>\n<br/>\nI&#39;d say hang on in there and try to think it will all be worth it in a few years time!! Not easy I know. But don&#39;t beat yourself up for doing the best you could in hard circumstances.<br/>\n<br/>\nI say well done to you!<br/>\n<br/>\nMy very best wishes to you!<br/>\n<br/>\nLInda<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scruffybc@...\">scruffybc@...</a><br/>\nDate: Tue, 19 Oct 2010 15:34:55 +0000<br/>\nSubject: [unschoolingbasics] Unschooling Teens-feeling like I failed them<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      Hi Everyone!<br/>\n<br/>\nI am not sure how to make this as short as possible or get &#39;my&#39; story in written form...I just keep crying and my anxiety attacks are driving me crazy. <br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s been a long road...<br/>\n<br/>\nI&#39;m a single mother (father not involved in pic at all)<br/>\n<br/>\nThe girls are teens now.<br/>\n<br/>\nWhen they were little we were left in a rural area no homeschooling (let alone unschooling) support/friends at all.<br/>\n<br/>\nI did the best I could.<br/>\n<br/>\nI read about other&#39;s stories (life in hs/unschoolers lives) and I feel like we haven&#39;t done much...I didn&#39;t have a man influence and they weren&#39;t involved in big volunteer events or big projects like I&#39;ve heard out there.<br/>\n<br/>\n<br/>\n<br/>\nThe time has gone by so fast and now they are 14 and 16. The last 2 years they have befriended a mainstream/public schooler....eversince my oldest seems to be of that mindset (w/ hint of teenage attitude that she NEVER had before) &quot;can&#39;t wait to get out of here....move away...&quot; etc etc. That is the main goal of most public schoolers---ASAP outta here! My girls were never in a hurry...now it&#39;s all she thinks about now that she has since then met even MORE public school kids/friends. <br/>\n<br/>\n<br/>\n<br/>\nWell, I can&#39;t change this...fine (not) but if she really is going to &#39;get outta here&#39; the instant she turns 18 (like THEY all talk about) then I feel like a failure and I don&#39;t know where to begin to pick up the pieces or what to do to help prepare her...<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m so torn frustrated (and so are they) at knowing that life is learning etc...and the crazy unrelated  things the education system requires of you to do anything...<br/>\n<br/>\n<br/>\n<br/>\nTo be accepted to college etc or just get a job PERIOD---they want to see you graduated HS or have GED. We have looked at sample questions etc of GED online----my god who can answer half of these questions? and if as unschoolers we don&#39;t &#39;do school&#39; we certainly have not covered even half of the questions they ask. My daughters are worried now...also feeling inferior to their public school friends who know what some basic labels/know how of math etc.<br/>\n<br/>\n<br/>\n<br/>\nI feel the coming of my daughter being mad at me blaming me in a couple years when she DOES go out there on her own.....how I must&#39;ve kept her in a bubble and compares herself to the mainstream. I feel like now that she is mixing w/ some of these kids and getting an &#39;earful&#39; also of some of the &#39;crap&#39; that goes on with this age---she can&#39;t seem to relate and has &#39;missed out&#39; and finger pointed at me for her being so &#39;different&#39; and like a forty year old instead of a teenager....just b/c she has been taught some morals....<br/>\n<br/>\n<br/>\n<br/>\nanyway....i&#39;m feeling that loss inching it&#39;s way too....empty nest syndrome...but that isn&#39;t what this is all about...it&#39;s there too naturally...but i&#39;m frustrated with how to deal with unschool lifestyle teens vs/meets the mainstream teens....how to graduate/ged or is there something else she should be doing/taking? how do i go about any of it....and how do i prepare them in one year for things mainstream has been doing from k-12....how do i prepare them for the &#39;real world&#39;....i say that in quotes b/c in our unschool life the &#39;real world&#39; is truly &#39;real&#39;---live life and learn what you need when and now.....yeah that sounds all sweet and true and how it should be and it makes sense!! but unfortunately the &#39;real world&#39; is ruled by DOE and whatever other title the big wigs out there are called---the real world requires you to know how to basket weave to be a chef...the real world requires you to pass these crazy questions on a GED and manage thru life on campus etc....or how to &#39;really DO math&#39; THEIR way. <br/>\n<br/>\n<br/>\n<br/>\nMy girls and I totally agree that so many of these things are ridiculous and you don&#39;t even use half of these things in &#39;real life&#39;....but when we unschoolers speak of the real world i am seeing that it isn&#39;t realistic after all....sadly!!! So, how do and what do i teach/do? where do i go for all of this? i feel like i have failed them in so many ways now....i am fear they will resent me for &#39;homeschooling&#39; them and making them &#39;different&#39;.....to top it off, we ended up &#39;stuck&#39; rural area no support no friends and the time went by so fast...always thought we&#39;d get out of the area....so now that wonderful unschool/homeschool life doesn&#39;t look so great...it looks like IT is to blame for them not having all those friends that others have and it this lifestyle has caused them to feel very different from the other kids out there...even fellow unschoolers that we met at a conference we got to manage attending ONCE. the other kids stories---they all seem to have friends and very active in different things...even if it were just scouts or something. or they all have some amazing passion that they have mastered (dance, karate, music.....etc)<br/>\n<br/>\n<br/>\n<br/>\nI need to help my daughters and I don&#39;t know where to begin or what exactly I need. Where are all the other parents of teens? or single parent stories? I mostly see posts from families who have both parents, lots of friends in area with groups/people, and with younger children. It was easier then b/c there were so many &#39;childrens&#39; activities out there...but older kids and teens are in school getting activities etc....and those lil fun cutsie games/activities/experiments are just not exciting to teens...what to do with the older ones? Especially, since they can&#39;t even think of interests on their own either---i sense a lil depression hitting them too. They miss being younger too....<br/>\n<br/>\n<br/>\n<br/>\nTears...<br/>\n<br/>\nThank you in advance.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling Teens-feeling like I failed them","postDate":"1287536451","msgId":44976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MDEyRTMyQTFDRDQ4NEQ4M0IxNUEyQUUyOEVFM0RFQENvbm5pZVBDPg==","inReplyToHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg==","referencesHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44975,"nextInTopic":44977,"prevInTime":44975,"nextInTime":44977,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"I am not a single mom and I don t have teens but felt that I should reply because you sound like you are really distressed. My big sister has been in your","messageBody":"<div id=\"ygrps-yiv-1670497807\">I am not a single mom and I don&#39;t have teens but felt that I should reply because you sound like you are really distressed. My big sister has been in your shoes and she and I have talked extensively about the trials and tribulations of a single mom, especially one that is trying to homeschool/unschool. <br/>\n<br/>\nIf your girls are 14 and 16, what have they been doing? Have you always homeschooled or unschooled? Have you thought of letting your girls go to school? Homeschooling/unschooling is much easier if you have support. My sister, who is a single mom, homeschooled her kids for a couple of years. She ended up putting them back in school because she could not work 2/3 jobs and still give her kids all of the opportunities that she wanted them to have. She said that school was a great babysitter and that was about it. It also kept child&#39;s protective services off of her back. Her split was very ugly and she went through hell. She gave her oldest son the option of going back to school or going to college. He chose to go back to high school but eventually dropped out. There is no shame in letting your kids go to school. My 13 year old nephew and I talk about his school experiences and he jokes about being able to sit in an air conditioned school and sleep a lot. Oh, and he gets to meet cute girls. I have extended the offer to let him homeschool/unschool with me and my girls but he has declined. Her kids do cool stuff in the evening and on weekends. <br/>\n<br/>\nHave you talked to your girls about why they want to get out of there? It is not uncommon for people to want to get out of a small town no matter what type of parenting they receive. My husband grew up in a small town and almost everybody has left because there weren&#39;t many opportunities for jobs or recreation. Perhaps it has nothing to do with you but everything to do with the area itself. Instead of throwing your hands up in the air and blaming the local kids for their attitude, perhaps it would be a good idea to sit down with them and talk it out. You sound like you are really depressed and stressed out too. My sister&#39;s kids don&#39;t always talk to her about stuff because they know how stressed she is and they don&#39;t want to add to her stress. Maybe your kids are afraid to open up to you. <br/>\n<br/>\nAre you in the US? If so, it is very possible to go to college without a high school diploma or GED. My nephew dropped out of high school and was able to enroll in the local community college. He had to take placement tests and take some remedial courses but that hasn&#39;t stopped him. What do your girls want to do? Do they want to go to college or high school? If so, you can get books and they can start preparing for whatever it is they want to do. There are tons of resources out there about college without high school. <br/>\n<br/>\nAre there any volunteering opportunities in your area that your kids might like? Are there any local libraries? Are all of the activities in your town sponsored by the local school or are there some dance academies, etc. that might be of interest to your girls? My girls are younger but they don&#39;t go for the cutesie stuff either. We found a local karate school that they tried out for a while. Sometimes you just have to dig deeper and get creative. <br/>\n<br/>\nConnie        <br/>\n<br/>\n<br/>\n<br/>\nFrom: stephanie <br/>\nSent: Tuesday, October 19, 2010 10:34 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Unschooling Teens-feeling like I failed them<br/>\n<br/>\n<br/>\n  <br/>\nHi Everyone!<br/>\nI am not sure how to make this as short as possible or get &#39;my&#39; story in written form...I just keep crying and my anxiety attacks are driving me crazy. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":468394682,"authorName":"stephanie","from":"&quot;stephanie&quot; &lt;scruffybc@...&gt;","profile":"scruffybc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling Teens-feeling like I failed them","postDate":"1287515649","msgId":44982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5a3FtMSt1dWZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44981,"nextInTopic":44983,"prevInTime":44981,"nextInTime":44983,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"PS.... A lil side note....I just scrolled through my message (did NOT proofread it please excuse any typos etc)....but uhhhh.....I guess that was my SHORT","messageBody":"<div id=\"ygrps-yiv-1684508373\">PS....<br/>\nA lil side note....I just scrolled through my message (did NOT proofread it please excuse any typos etc)....but uhhhh.....I guess that was my SHORT version LOL I can&#39;t imagine how many pages the full version would be</div>","specialLinks":[]},{"userId":72058189,"authorName":"stephanie","from":"&quot;stephanie&quot; &lt;scruffybc@...&gt;","profile":"scruffybc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling Teens-feeling like I failed them","postDate":"1287502495","msgId":44975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5a2RxditkcDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44976,"prevInTime":44974,"nextInTime":44976,"topicId":44975,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone! I am not sure how to make this as short as possible or get my story in written form...I just keep crying and my anxiety attacks are driving me","messageBody":"<div id=\"ygrps-yiv-466140372\">Hi Everyone!<br/>\nI am not sure how to make this as short as possible or get &#39;my&#39; story in written form...I just keep crying and my anxiety attacks are driving me crazy. <br/>\n<br/>\nIt&#39;s been a long road...<br/>\nI&#39;m a single mother (father not involved in pic at all)<br/>\nThe girls are teens now.<br/>\nWhen they were little we were left in a rural area no homeschooling (let alone unschooling) support/friends at all.<br/>\nI did the best I could.<br/>\nI read about other&#39;s stories (life in hs/unschoolers lives) and I feel like we haven&#39;t done much...I didn&#39;t have a man influence and they weren&#39;t involved in big volunteer events or big projects like I&#39;ve heard out there.<br/>\n<br/>\nThe time has gone by so fast and now they are 14 and 16. The last 2 years they have befriended a mainstream/public schooler....eversince my oldest seems to be of that mindset (w/ hint of teenage attitude that she NEVER had before) &quot;can&#39;t wait to get out of here....move away...&quot; etc etc. That is the main goal of most public schoolers---ASAP outta here! My girls were never in a hurry...now it&#39;s all she thinks about now that she has since then met even MORE public school kids/friends. <br/>\n<br/>\nWell, I can&#39;t change this...fine (not) but if she really is going to &#39;get outta here&#39; the instant she turns 18 (like THEY all talk about) then I feel like a failure and I don&#39;t know where to begin to pick up the pieces or what to do to help prepare her...<br/>\n<br/>\nI&#39;m so torn frustrated (and so are they) at knowing that life is learning etc...and the crazy unrelated  things the education system requires of you to do anything...<br/>\n<br/>\nTo be accepted to college etc or just get a job PERIOD---they want to see you graduated HS or have GED. We have looked at sample questions etc of GED online----my god who can answer half of these questions? and if as unschoolers we don&#39;t &#39;do school&#39; we certainly have not covered even half of the questions they ask. My daughters are worried now...also feeling inferior to their public school friends who know what some basic labels/know how of math etc.<br/>\n<br/>\nI feel the coming of my daughter being mad at me blaming me in a couple years when she DOES go out there on her own.....how I must&#39;ve kept her in a bubble and compares herself to the mainstream. I feel like now that she is mixing w/ some of these kids and getting an &#39;earful&#39; also of some of the &#39;crap&#39; that goes on with this age---she can&#39;t seem to relate and has &#39;missed out&#39; and finger pointed at me for her being so &#39;different&#39; and like a forty year old instead of a teenager....just b/c she has been taught some morals....<br/>\n<br/>\nanyway....i&#39;m feeling that loss inching it&#39;s way too....empty nest syndrome...but that isn&#39;t what this is all about...it&#39;s there too naturally...but i&#39;m frustrated with how to deal with unschool lifestyle teens vs/meets the mainstream teens....how to graduate/ged or is there something else she should be doing/taking? how do i go about any of it....and how do i prepare them in one year for things mainstream has been doing from k-12....how do i prepare them for the &#39;real world&#39;....i say that in quotes b/c in our unschool life the &#39;real world&#39; is truly &#39;real&#39;---live life and learn what you need when and now.....yeah that sounds all sweet and true and how it should be and it makes sense!! but unfortunately the &#39;real world&#39; is ruled by DOE and whatever other title the big wigs out there are called---the real world requires you to know how to basket weave to be a chef...the real world requires you to pass these crazy questions on a GED and manage thru life on campus etc....or how to &#39;really DO math&#39; THEIR way. <br/>\n<br/>\nMy girls and I totally agree that so many of these things are ridiculous and you don&#39;t even use half of these things in &#39;real life&#39;....but when we unschoolers speak of the real world i am seeing that it isn&#39;t realistic after all....sadly!!! So, how do and what do i teach/do? where do i go for all of this? i feel like i have failed them in so many ways now....i am fear they will resent me for &#39;homeschooling&#39; them and making them &#39;different&#39;.....to top it off, we ended up &#39;stuck&#39; rural area no support no friends and the time went by so fast...always thought we&#39;d get out of the area....so now that wonderful unschool/homeschool life doesn&#39;t look so great...it looks like IT is to blame for them not having all those friends that others have and it this lifestyle has caused them to feel very different from the other kids out there...even fellow unschoolers that we met at a conference we got to manage attending ONCE. the other kids stories---they all seem to have friends and very active in different things...even if it were just scouts or something. or they all have some amazing passion that they have mastered (dance, karate, music.....etc)<br/>\n<br/>\nI need to help my daughters and I don&#39;t know where to begin or what exactly I need. Where are all the other parents of teens? or single parent stories? I mostly see posts from families who have both parents, lots of friends in area with groups/people, and with younger children. It was easier then b/c there were so many &#39;childrens&#39; activities out there...but older kids and teens are in school getting activities etc....and those lil fun cutsie games/activities/experiments are just not exciting to teens...what to do with the older ones? Especially, since they can&#39;t even think of interests on their own either---i sense a lil depression hitting them too. They miss being younger too....<br/>\n<br/>\nTears...<br/>\nThank you in advance.</div>","specialLinks":[]}],"prevTopicId":44990,"nextTopicId":45005}}