{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are we doing them a disservice?","postDate":"1194016024","msgId":27486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnZmVlbysybXJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgxMTU0My4zODA5LnFtQHdlYjI3MzA3Lm1haWwudWtsLnlhaG9vLmNvbT4="},"prevInTopic":27467,"nextInTopic":0,"prevInTime":27485,"nextInTime":27487,"topicId":27460,"numMessagesInTopic":0,"msgSnippet":"Thanks Sharon, Yes you are right, the kids are developing good self esteem, they don t have notions about who should play with them  and don t ever feel left","messageBody":"<div id=\"ygrps-yiv-877341501\">Thanks Sharon,<br/>\nYes you are right, the kids are developing good self esteem, they<br/>\ndon&#39;t have notions about who should play with them  and don&#39;t ever<br/>\nfeel left out. They don&#39;t have any sense of being &quot;different&quot; , they<br/>\nare just happy. Happy kids. and I think hubby does see this. I think<br/>\nhe was just having nostalgia about his own childhood. LOL<br/>\nI am glad my kids don&#39;t have the feelings of having to be with a<br/>\ncertain group, they have their group of friends that we spend time<br/>\nwith. they are here a lot, we are there a lot. they all live withing<br/>\n10-15 miles of us as well.<br/>\nI like your ideas of what I can say to hubby, he actually is coming<br/>\nmore and more around to the unschooling idea. I still don&#39;t say the<br/>\nword unschooling, I am just letting him see it in action. And he knows<br/>\nits good, but he just occasionally doubts, and I suppose that is<br/>\nnormal, we all question ourselves, especially with the kids!<br/>\nDiane</div>","specialLinks":[]},{"userId":274933479,"authorName":"sharon currie","from":"sharon currie &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Are we doing them a disservice?","postDate":"1193952550","msgId":27467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMTU0My4zODA5LnFtQHdlYjI3MzA3Lm1haWwudWtsLnlhaG9vLmNvbT4="},"prevInTopic":27466,"nextInTopic":27486,"prevInTime":27466,"nextInTime":27468,"topicId":27460,"numMessagesInTopic":0,"msgSnippet":"Hi Diane, We live in the middle of the school route (and we have 3 schools near us). We don t socialise with any of my kid s friends from school anymore,","messageBody":"<div id=\"ygrps-yiv-1978912959\">Hi Diane,<br/>\n   <br/>\n  We live in the middle of the school route (and we have 3 schools near us). We don&#39;t socialise with any of my kid&#39;s friends from school anymore, afterall he&#39;s only been to the 1st school for 1 yr( we kinda fell out of the social loop when we moved out of the village to get son into another school)  and because he was only in the 2nd school for only 1 term, we never had the chance to really make any new friends.  He is not part  of any local communitty activity groups like football or karate or scouts either because my son&#39;s not interested to be part of those groups too. It doesn&#39;;t bother my 7 yr old son at all.<br/>\n  We now have home-educating friends, all living within 10 - 15 miles away.  <br/>\n   Especially yesterday, me and hubby and son went trick and treating with another HEing 9 yr old friend. The kids&#39; didn&#39;t feel out of place at all, and had a fantastic time. <br/>\n   <br/>\n   <br/>\n  &quot;my kids did not care, did notice who was walking with who, they were just happy to be trick or treating. they have their friends they play with all the time , just<br/>\nnot the same ones in the neighborhood anymore. I am glad my kids are not part of<br/>\nit, because frankly the kids are snotty and rude, they don&#39;t know how<br/>\nto socialize with other kids not their exact same age. the ones that<br/>\nare 1 or 2 years older will not even acknowledge my kids if they say<br/>\nhi. I have said things to them in the past, but I don&#39;t like to point<br/>\nit out to my kids too much, because they don&#39;t seem to care or even<br/>\nnotice even though I do. They have their group of close friends, they<br/>\njust don&#39;t happen to live in our neighborhood.&quot; <br/>\n   <br/>\n   <br/>\n    I find when children is being unschooled, they are usually very sure of thier identity, they seems so much more confident in themselves, and is very comfortable with the fact that they are different, simply because they don&#39;t go to school, and they are aware that they had a choice in doing things, differently from school.  I noticed in my son, that there isn&#39;t any competitive streak in him, simply because he didn&#39;t have to compete with anyone to stand out of the crowd, like in a classroom. Hence, it just doensn&#39;t bother him when everybody is doing this and that, and he&#39;s not. This is the case simply because he knows it was his preferance to be doing something different.  <br/>\n   <br/>\n<br/>\n  &quot;any thoughts on this? any good things I can say to hubby when he says<br/>\nthings like this? &quot; I also told him he has to let go of those notions of what he thinks the kids &quot;should be doing&quot; .  He says it bothers him that they don&#39;t have the structure like school kids do. They don&#39;t have set bedtimes, or a set in stone schedule. he said he thinks this is wrong. any thoughts on how I can approach this without becoming defensive.<br/>\n   <br/>\n  This is how I said to my husband in the beginning, trying to convince him of us unschooling, tyring to get him to see sense, trying to get him to understand that our child is also equally deserving of all this freedom in choices that we adults make, evry minute and every hour of our life! <br/>\n   <br/>\n  1. How would you like it if I tell you that you have to go to bed everynight at 8 oclock, tv off, light off? <br/>\n  2. How would you like it if I tell you, you HAVE to go to sports events, or socialise with your workmates, everyday? <br/>\n  3.  If you feel our son needs to be part of the local community, how come you&#39;re not make any effort to be part of our community? I told my hubby, how would you like it if I told you, you have to go play football with our neighbours, evry weekend, whether you like it or not, how would you feel?<br/>\n  4. If he thinks son should be like other kids, doing the same thing, then perhaps I should be the same too, doing what other mothers are doing. So does this means I can have my brand new sports car, and go buy £1,000 Fendi handbags, because that&#39;s what most mothers I know, is doing!!! I think this trick help convinced my hubby the logic in doing things differently LOL!  My point is, just because that&#39;s what everybody is doing, doesn&#39;t mean we have to!  <br/>\n   <br/>\n  I felt, by placing my hubby in my son&#39;s shoes, it did help make hubby see how ridiculous and unfair it is to impose on our son, what he felt our son should be doing and how to behave. <br/>\n   <br/>\n  Can you hubby see the difference in your kids? Can he see the positiveness in them unschooling? Can he see them being so happy, all the time? Can he, at least acknowledge that it is a fantastic thing when your chidlren is so confident in themselves, that they are not even bothered about not being in the crowd? Isn&#39;t this what&#39;s gonna help them when they grow up? The confidence to be themslevs and not be swayed by other people&#39;s ideas, I think this is very important, especially nowadays, chidlren is exposed to so much options and influences like drugs and all.  <br/>\n   <br/>\n  Hope I&#39;m able to help. All the best. <br/>\n   <br/>\n  Sharon.<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\n For ideas on reducing your carbon footprint visit Yahoo! For Good this month.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Are we doing them a disservice?","postDate":"1193941109","msgId":27466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiMi4xZmE2NDJhNi4zNDViNzI3NUBhb2wuY29tPg=="},"prevInTopic":27464,"nextInTopic":27467,"prevInTime":27465,"nextInTime":27467,"topicId":27460,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/1/2007 5:44:24 A.M. Pacific Daylight Time, danielle.conger@gmail.com writes: At one  point, Em said to Julia that she was going to give","messageBody":"<div id=\"ygrps-yiv-1495289515\">In a message dated 11/1/2007 5:44:24 A.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\nAt one  point, Em said to Julia that she was going to give Jules and Sam <br/>\nall the  candy she can&#39;t eat because of her braces. Jules launched into <br/>\nthis firm,  &quot;No Em, I&#39;m going to *trade* you because I want you to have <br/>\njust as much  candy as we do.&quot; At the end of the night, they were all <br/>\ntrading and trying  different candies, pulling out the couple candy bars <br/>\nI like from their  stash and handing them to me because they wanted me to <br/>\nhave candy,  too.<br/>\n<br/>\n<br/>\n____________________________<br/>\n <br/>\nJust wanted to say, that is what is happening here too - same with the  <br/>\n&quot;thank you&quot; and all of that. It&#39;s wonderful...<br/>\n <br/>\nK. <br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are we doing them a disservice?","postDate":"1193930095","msgId":27464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnY3FoZitlOWVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3MjlDQTJDLjUwOTA5MDJAZ21haWwuY29tPg=="},"prevInTopic":27462,"nextInTopic":27466,"prevInTime":27463,"nextInTime":27465,"topicId":27460,"numMessagesInTopic":0,"msgSnippet":"Danielle, Yes!  My kids would say happy halloween, trick or treat, etc etc.........and the vast majority of the kids that came to our door, just ran up,","messageBody":"<div id=\"ygrps-yiv-118528953\">Danielle,<br/>\nYes!  My kids would say happy halloween, trick or treat, etc<br/>\netc.........and the vast majority of the kids that came to our door,<br/>\njust ran up, grabbed candy and ran off.......i would call out happy<br/>\nhalloween!  and even the parents would stand off in the road.....no<br/>\nhello, nothing.......so they learn by example I guess. Me, I march<br/>\nright up with the kids, I say hello to the person answering the door,<br/>\nwish them a nice evening, etc.......<br/>\nAt one point my kids wanted to take a break, and hubby was on candy<br/>\nduty, so we stopped home to help him......so I had the candy bowl and<br/>\na group of pre teens, came, they just ran up, grabbed<br/>\ncandy.......kiddingly i said &quot; gee no one is saying the magic<br/>\nhalloween words&quot; so one girl gave me the big eye roll and said &quot;trick<br/>\nor treat&quot;........LOL.<br/>\nDiane</div>","specialLinks":[]},{"userId":229237531,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Are we doing them a disservice?","postDate":"1193921068","msgId":27462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MjlDQTJDLjUwOTA5MDJAZ21haWwuY29tPg==","inReplyToHeader":"PGZnYmhhZytvMHZoQGVHcm91cHMuY29tPg==","referencesHeader":"PGZnYmhhZytvMHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":27460,"nextInTopic":27464,"prevInTime":27461,"nextInTime":27463,"topicId":27460,"numMessagesInTopic":0,"msgSnippet":"... I m about to write a blog post about our night last night (url in my sig line) if you want to read the whole write up, but the gist of it is what amazing","messageBody":"<div id=\"ygrps-yiv-97068974\">rn9302000 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There are other kids in the neighborhood of the same age<br/>\n&gt; range that are also not friends in that particular group either. and<br/>\n&gt; its kind of a clique and i hate it. I am glad my kids are not part of<br/>\n&gt; it, because frankly the kids are snotty and rude, they don&#39;t know how<br/>\n&gt; to socialize with other kids not their exact same age. the ones that<br/>\n&gt; are 1 or 2 years older will not even acknowledge my kids if they say<br/>\n&gt; hi. I have said things to them in the past, but I don&#39;t like to point<br/>\n&gt; it out to my kids too much, because they don&#39;t seem to care or even<br/>\n&gt; notice even though I do. They have their group of close friends, they<br/>\n&gt; just don&#39;t happen to live in our neighborhood.<br/>\n&gt; any thoughts on this? any good things I can say to hubby when he says<br/>\n&gt; things like this?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m about to write a blog post about our night last night (url in my sig <br/>\nline) if you want to read the whole write up, but the gist of it is what <br/>\namazing kids I have--how generous and considerate they so often are.<br/>\n<br/>\nLast night while trick-or-treating, they were so polite to every person <br/>\nwho gave them candy, wishing them a Happy Halloween, and the surprise <br/>\nand gratitude was evident in so many people&#39;s voices as they responded, <br/>\n&quot;Why *thank* you!&quot;<br/>\n<br/>\nAt one point, Em said to Julia that she was going to give Jules and Sam <br/>\nall the candy she can&#39;t eat because of her braces. Jules launched into <br/>\nthis firm, &quot;No Em, I&#39;m going to *trade* you because I want you to have <br/>\njust as much candy as we do.&quot; At the end of the night, they were all <br/>\ntrading and trying different candies, pulling out the couple candy bars <br/>\nI like from their stash and handing them to me because they wanted me to <br/>\nhave candy, too.<br/>\n<br/>\nDoes school preclude any of those behaviors?  Not necessarily, but it&#39;s <br/>\ncertainly not what one might expect from &quot;typical&quot; kids or &quot;typical&quot; <br/>\nsiblings.<br/>\n<br/>\n<br/>\n-- <br/>\n~~Danielle<br/>\nEmily (10), Julia (8), Sam (7)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.organiclearning.blogspot.com\">http://www.organiclearning.blogspot.com</a><br/>\n<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*<br/>\n<br/>\nConnections: ezine of unschooling and mindful parenting<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://connections.organiclearning.org\">http://connections.organiclearning.org</a></div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Are we doing them a disservice?","postDate":"1193887888","msgId":27460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnYmhhZytvMHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":27462,"prevInTime":27459,"nextInTime":27461,"topicId":27460,"numMessagesInTopic":0,"msgSnippet":"This is what my hubby said to me tonight. Usually he is onboard 100% with the homeschooling,but he has his doubts, like tonight, i know why he said this. there","messageBody":"<div id=\"ygrps-yiv-1625657954\">This is what my hubby said to me tonight. Usually he is onboard 100%<br/>\nwith the homeschooling,but he has his doubts, like tonight, i know why<br/>\nhe said this.<br/>\nthere are about 3 families in our neighborhood with kids the same ages<br/>\nor within a year of my dd, my dd used to play with these kids when<br/>\nthey were all little, before anyone went to school, now they all go to<br/>\nschool, my dd doesn&#39;t and they don&#39;t play with her as much. they were<br/>\nall trick or treating together,.........my kids did not care, did<br/>\nnotice who was walking with who, they were just happy to be trick or<br/>\ntreating. they have their friends they play with all the time , just<br/>\nnot the same ones in the neighborhood anymore.<br/>\nso i think hubby saw them all together, and our kids were not part of<br/>\nthat group............he won&#39;t admit this is why he said it, but I<br/>\nknow it is. There are other kids in the neighborhood of the same age<br/>\nrange that are also not friends in that particular group either. and<br/>\nits kind of a clique and i hate it. I am glad my kids are not part of<br/>\nit, because frankly the kids are snotty and rude, they don&#39;t know how<br/>\nto socialize with other kids not their exact same age. the ones that<br/>\nare 1 or 2 years older will not even acknowledge my kids if they say<br/>\nhi. I have said things to them in the past, but I don&#39;t like to point<br/>\nit out to my kids too much, because they don&#39;t seem to care or even<br/>\nnotice even though I do. They have their group of close friends, they<br/>\njust don&#39;t happen to live in our neighborhood.<br/>\nany thoughts on this? any good things I can say to hubby when he says<br/>\nthings like this? I tend to get defensive because I am so anti school.<br/>\nI told him tonight that he is nervous about being perceived as<br/>\n&quot;different&quot;. Our neighborhood is filled with families of kids that all<br/>\ngo to school ( there is one other homeschool family in our immediate<br/>\nneighborhood)........they all play the same sports, do the same<br/>\nactivities, play together, etc etc.....and we are different, my kids<br/>\ndon&#39;t go to school, they do different activities and sports. They used<br/>\nto play some town sports with some of these kids but they do different<br/>\nthings now. Gymnastics for instance which is thru a private club, not<br/>\nthe town. but anyway..........I also told him he has to let go of<br/>\nthose notions of what he thinks the kids &quot;should be doing&quot; . He says<br/>\nit bothers him that they don&#39;t have the structure like school kids do.<br/>\nThey don&#39;t have set bedtimes, or a set in stone schedule. he said he<br/>\nthinks this is wrong.<br/>\nany thoughts on how I can approach this without becoming defensive,<br/>\nbecause I feel like I lose credibility when I get defensive.<br/>\nDiane</div>","specialLinks":[]}],"prevTopicId":27481,"nextTopicId":27488}}