{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":53,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Hitting was: chores/helping clean up","postDate":"1361221047","msgId":49592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3QzM5MDVCLTA3Q0MtNEFCRi05NEIzLUEwQTg5QTM4MzU2MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTzZEOWVuTmRXZmc0Q0JlWl9NcW9BV1YrLUdpRkNHYUNZQkxVMnFnQy1CMkFWeXFyZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTzZEOWVuQU1KdzNDY0s5VWZHNStDNEIycHdCNk9nK2hRblJHWjV4VjF0ZWk0YmFqZ0BtYWlsLmdtYWlsLmNvbT4gPGtmdHYxbis0NWw1QGVHcm91cHMuY29tPiA8Q0FPNkQ5ZW5OZFdmZzRDQmVaX01xb0FXVistR2lGQ0dhQ1lCTFUycWdDLUIyQVZ5cXJnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49591,"nextInTopic":49593,"prevInTime":49591,"nextInTime":49593,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... See the tantrums as communication rather than him being manipulative. He s *desperately* asking for help and no one s helping. So he melts down. (And  some","messageBody":"<div id=\"ygrps-yiv-527041721\">On Feb 18, 2013, at 3:02 PM, Beth Ann Espinoza wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But if anyone knows of other<br/>\n&gt; ways to handle or talk to him, that would be helpful.<br/>\n<br/>\n </span></blockquote>See the tantrums as communication rather than him being manipulative. He&#39;s *desperately* asking for help and no one&#39;s helping. So he melts down. (And  some kids are more sensitive so it takes less for them to melt down.)<br/>\n<br/>\nFocus less on trying to change his way of communication and more on meeting his needs well before he gets to the tantrum stage.<br/>\n<br/>\nThis will be hard! Try not to see his needs as unreasonable or trivial. They *feel* important and at this age he can only react to his feelings. As he gets older his thoughts will be more in control, but right now the feelings feel like aliens invading him and taking over. And your reaction from his point of view is stop reacting. You&#39;re not doing anything about the aliens just complaining that he&#39;s letting the aliens take him over.<br/>\n<br/>\nThe advice sounds like a recipe for disaster! Practically every parenting book will tell you to nip the behavior in the bud. But if you were thirsty but couldn&#39;t speak the language well. If you asked for some water and everyone you asked corrected the way you were asking totally ignoring your thirst, how long before you broke down in frustration?<br/>\n<br/>\nHis power to meet his needs comes through you. If you&#39;re blocking that, switching the agenda from his needs to your need for him to behave as you want, it&#39;s got to be enormously frustrating!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Life would<br/>\n&gt; just go a lot smoother for everyone if he could stop the tantrums.<br/>\n<br/>\n </span></blockquote>And he would feel less like tantruming if he could count on the one with the power to lend him so some he could meet his needs! ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361220220","msgId":49590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1Qjg5ODAxLUFDQTEtNDg2Ny1CRjE5LTM2MjkzODQzNTVBM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTzZEOWVuQU1KdzNDY0s5VWZHNStDNEIycHdCNk9nK2hRblJHWjV4VjF0ZWk0YmFqZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPiA8RTQzOEZDNDAtMzJERS00QjM4LUEyMjItMzBFRTUzQTkwRjc2QHZlcml6b24ubmV0PiA8Q0FPNkQ5ZT1RaDVYclhhbi02N3BWQktKelRuQ1UxS0YyYVdZaHhIRTlyVlpUeXdjRUZRQG1haWwuZ21haWwuY29tPiA8ODQ2RTE5NDItRjA3OC00MzRFLUEwQkMtQjAwQUZEQjBDMUZFQHZlcml6b24ubmV0PiA8Q0FPNkQ5ZW5BTUp3M0NjSzlVZkc1K0M0QjJwd0I2T2craFFuUkdaNXhWMXRlaTRiYWpnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49586,"nextInTopic":49591,"prevInTime":49589,"nextInTime":49591,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... By not letting them feel they need to compete with each other for resources (including you). But it s a big topic! I think it might be harder to focus on","messageBody":"<div id=\"ygrps-yiv-1876588787\">On Feb 18, 2013, at 1:26 PM, Beth Ann Espinoza wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am curious about learning more on how to encourage good relationships<br/>\n<br/>\n </span></blockquote>By not letting them feel they need to compete with each other for resources (including you). <br/>\n<br/>\nBut it&#39;s a big topic! I think it might be harder to focus on encouraging good relationships -- especially if they&#39;re fighting! -- than on focusing for now on eliminating the things that shift kids to bad relationships. (Like the above competition.)<br/>\n<br/>\nA good book is Siblings Without Rivalry. It should be available in your library.<br/>\n<br/>\nAnother good resource is Scott Noelle&#39;s daily attentive parenting emails:<br/>\nSubscribe: <a rel=\"nofollow\" target=\"_blank\" href=\"http://dailygroove.net\">http://dailygroove.net</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and<br/>\n&gt; discourage tantrums <br/>\n<br/>\n </span></blockquote>Since it&#39;s a radical unschooling list it&#39;s perfectly on target. :-)<br/>\n<br/>\nYou discourage tantrums by not giving them something to tantrum about ;-) If you see a tantrum as a child having reached the last straw, the child is saying &quot;MY GOD WHY ISN&#39;T ANYONE LISTENING TO ME?!?&quot;<br/>\n<br/>\nIf you can give examples of when the tantrums happen, people can give you more targeted examples.<br/>\n<br/>\nIn general, be more aware of their moods. Keep them well fed and watered. Cut short or redirect activities before they get too tired. Avoid situations they&#39;ve shown they can&#39;t yet handle.<br/>\n<br/>\nIt&#39;s possible more acceptable ways of letting you know he has a need get ignored and he only gets your attention when he tantrums so he&#39;s learned to jump right to a tantrum. <br/>\n<br/>\nWhile you may not be able to stop all tantrums, the more proactive you are, the fewer you and he will have to deal with so the more energy and patience you&#39;ll both have.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and physical attacks both to myself and siblings,<br/>\n<br/>\n </span></blockquote>Be more present.<br/>\n<br/>\nIf the mood is turning, redirect. Change the atmosphere. Introduce something new. Call one away to do something fun with you like preparing snacks. Bring food. Take the kids outside for something new.<br/>\n<br/>\nAgain, you may not stop everything, but being more aware, being more proactive, will give you fewer to handle.<br/>\n<br/>\nSandra has several good pages on siblings, including fighting.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/siblings\">http://sandradodd.com/siblings</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; especially in a way that enables the child to make these choices on their own. <br/>\n<br/>\n </span></blockquote>Expecting a child to navigate social relationships is unreasonable. Getting others to do what you want is way more complex than rocket science! ;-) If child A asks child B for the toy and child B says no, then what? That would have adults scratching their heads! ;-)<br/>\n<br/>\nOn Sandra&#39;s siblings fighting page she has some tools for kids to use: a 3 step process for solving problems. But don&#39;t expect that to be the end of fighting. It&#39;s a tool. And they just aren&#39;t going to be able to use it effectively all the time. Or even be able to pick it up in the heat of the moment. They need you to hear them and their concerns, to talk over options. But not too much talking! Do lots of listening. Ask some questions.<br/>\n<br/>\nBut do expect to be more present. If fights are breaking out while you&#39;re not there, you needed to be there. If they&#39;re fighting when you&#39;re cooking dinner, for instance, bring one with you to help. Or provide food. But at any rate right now at the ages your kids are, they need you to be with them as much as possible. It can even mean taking one to the bathroom with you ;-)<br/>\n<br/>\nIt will get better! But the more you put in now, the easier it will be later.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":547166826,"authorName":"Beth Ann Espinoza","from":"Beth Ann Espinoza &lt;iheartsims84@...&gt;","profile":"webegoingreen3105","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Hitting was: chores/helping clean up","postDate":"1361217722","msgId":49591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTzZEOWVuTmRXZmc0Q0JlWl9NcW9BV1YrLUdpRkNHYUNZQkxVMnFnQy1CMkFWeXFyZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtmdHYxbis0NWw1QGVHcm91cHMuY29tPg==","referencesHeader":"PENBTzZEOWVuQU1KdzNDY0s5VWZHNStDNEIycHdCNk9nK2hRblJHWjV4VjF0ZWk0YmFqZ0BtYWlsLmdtYWlsLmNvbT4JPGtmdHYxbis0NWw1QGVHcm91cHMuY29tPg=="},"prevInTopic":49590,"nextInTopic":49592,"prevInTime":49590,"nextInTime":49592,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"Our 6 year old son hits, bites, and screams at me, his older sister and he has bitten his baby brother also. Stomping and throwing things as well as kicking","messageBody":"<div id=\"ygrps-yiv-153491283\">Our 6 year old son hits, bites, and screams at me, his older sister and he<br/>\nhas bitten his baby brother also. Stomping and throwing things as well as<br/>\nkicking his bed and breaking things on purpose are also part of his<br/>\ntantrums when he feels he is not getting his way. Take into mind two<br/>\ndifferent parenting styles in the house and it feels like a mess. Dh is<br/>\nauthoritarian, more as a reaction to the bad behavior it feels like. I am<br/>\ntrying the talking, explaining what is acceptable and what is not,<br/>\nespecially when you are mad and trying to give him options to communicate<br/>\nor express his feelings. We are going to therapy as a family because, of<br/>\ncourse, we are a blended family and there are issues stemming from that and<br/>\nwe have anxiety issues with my daughter who might be suffering from genetic<br/>\ndepression and anxiety. But we are trying to do positive reinforcement with<br/>\nstickers in good days to break him from the habit of throwing a fit when he<br/>\nisn&#39;t getting his way, along with rewards. But if anyone knows of other<br/>\nways to handle or talk to him, that would be helpful. We did used to spank.<br/>\nWe also used to ground or take away privileges. As you can imagine, it<br/>\nseemed like nothing worked. Since I started homeschooling though, I have<br/>\nseen so much more of his personality and his good qualities. Life would<br/>\njust go a lot smoother for everyone if he could stop the tantrums.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Hitting was: chores/helping clean up","postDate":"1361215351","msgId":49586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmdHYxbis0NWw1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTzZEOWVuQU1KdzNDY0s5VWZHNStDNEIycHdCNk9nK2hRblJHWjV4VjF0ZWk0YmFqZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49583,"nextInTopic":49590,"prevInTime":49585,"nextInTime":49587,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"What is happening when the tantrums happen? When physical attacks happen? What else has happened in their lives that has led up to these situations? My recent","messageBody":"<div id=\"ygrps-yiv-819453986\">What is happening when the tantrums happen? When physical attacks happen? What else has happened in their lives that has led up to these situations?<br/>\n<br/>\nMy recent experience was explaining to my 6-year-old Dear Nephew when he hit me (he was frustrated with something I was not doing right in one of his many projects), that I didn&#39;t want him to hit me, that we don&#39;t hit each other in this house.<br/>\n<br/>\nHe explained that he gets spanked at home. I explained that he would not be spanked by me, that nobody in this house would hit him and I didn&#39;t want him to hit me.<br/>\n<br/>\nA couple of hours later, out watering something, he patted my butt. I told him I didn&#39;t want him to hit me. He explained that he wasn&#39;t hitting me, he was patting my butt because I was doing a &quot;good job&quot; watering. <br/>\n<br/>\nI said, something like, hmmm, I&#39;ll have to think about that, I still don&#39;t like getting hit but I see how you meant it and it was a pat and not a hit. Hmm. . . <br/>\n<br/>\nNow, this likely has nothing to do with your particular situation. But it had everything to do with my 6-year-old Dear Nephew learning how different people parent and how he gets to talk about it and use his judgement and he&#39;ll get a response from me that won&#39;t be me hitting him back but will be about whether he should hit me, etc., etc. More a matter of engaging him in discussing the idea of not hitting/hurting each other instead of justifying hitting him for some things but not for others. <br/>\n<br/>\nSo, what&#39;s going on in your children&#39;s lives that leads up to the incidents you don&#39;t like? Are they all the same sort of thing or are there different circumstances?<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I am curious about learning more on how to encourage good relationships and<br/>\n&gt; discourage tantrums and physical attacks both to myself and siblings,<br/>\n&gt; especially in a way that enables the child to make these choices on their<br/>\n&gt; own. Sorry if that is off-topic.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361214582","msgId":49583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN0ZBNDk3LUM0QjItNEZCQS1CNTdDLUQ1NDc5NTVERTVGQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTzZEOWVuQU1KdzNDY0s5VWZHNStDNEIycHdCNk9nK2hRblJHWjV4VjF0ZWk0YmFqZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPiA8RTQzOEZDNDAtMzJERS00QjM4LUEyMjItMzBFRTUzQTkwRjc2QHZlcml6b24ubmV0PiA8Q0FPNkQ5ZT1RaDVYclhhbi02N3BWQktKelRuQ1UxS0YyYVdZaHhIRTlyVlpUeXdjRUZRQG1haWwuZ21haWwuY29tPiA8ODQ2RTE5NDItRjA3OC00MzRFLUEwQkMtQjAwQUZEQjBDMUZFQHZlcml6b24ubmV0PiA8Q0FPNkQ5ZW5BTUp3M0NjSzlVZkc1K0M0QjJwd0I2T2craFFuUkdaNXhWMXRlaTRiYWpnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49579,"nextInTopic":49586,"prevInTime":49582,"nextInTime":49584,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... It depends on the context. If the goal is to radically unschool, mom s primary goal should be creating the environment for exploring. Part of that","messageBody":"<div id=\"ygrps-yiv-828444142\">On Feb 18, 2013, at 1:26 PM, Beth Ann Espinoza wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And to be able to say &quot;no I don&#39;t want to do that<br/>\n&gt; because I have no interest.&quot;<br/>\n<br/>\n </span></blockquote>It depends on the context. If the goal is to radically unschool, mom&#39;s primary goal should be creating the environment for exploring. Part of that environment will be her! :-) My daughter preferred exploring with me. Sharing the experience, being social was an important part of exploring for her.<br/>\n<br/>\nIf mom has sad a few hundred Yeses, then the kids will understand when she says &quot;No, thanks.&quot; They&#39;ll understand even more if she helps them find others who share that interest.<br/>\n<br/>\nBut if a mom finds herself saying she has no interest to more than a few things, she&#39;s, one, missing out on connections with the kids, and two, potentially saying &quot;No, I don&#39;t want to spend time with you.&quot; It&#39;s not what she intends to say! But it&#39;s what might get heard if the *kids* feel she&#39;s more likely to say no to a request than yes.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"","from":"unschoolingbasics-owner@yahoogroups.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores/helping clean up","postDate":"1361212956","msgId":49578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmdHNtcytoN24zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTzZEOWVrd0JpTC1ZdDJVQTAwZjFvdHc1MEJNTmcyR2Jlc01nY242bWgzS2R4Z1B6d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49577,"nextInTopic":49579,"prevInTime":49577,"nextInTime":49579,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... It s not a one size fits all group, it s a group for getting down to the basics of what allows natural learning to flow freely in the home.","messageBody":"<div id=\"ygrps-yiv-1542126377\">Beth Ann Espinoza &lt;iheartsims84@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I thought this was unschoolingbasics not radical unschooling brought to you<br/>\n&gt; by Joyce.<br/>\n<br/>\n </span></blockquote>It says in the first line of the list description that it&#39;s a radical unschooling list. First line. Joyce is one of the moderators as well as being one of the &quot;experienced whole life unschoolers&quot; described in the second line. The description also states:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Newcomers to the philosophy of radical unschooling are encouraged to ask questions, but please take some time to read and get a &quot;feel&quot; for the list before posting. Whole life unschooling goes so far beyond academics that it involves a whole different approach to family relationships. Everything you think you know is about to be questioned. &lt;<br/>\n<br/>\n </span></blockquote>It&#39;s not a &quot;one size fits all&quot; group, it&#39;s a group for getting down to the basics of what allows natural learning to flow freely in the home. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores/helping clean up","postDate":"1361212263","msgId":49577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmdHMxNytka3JyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjExNDM0NTYuMjY4NTguQlBNYWlsX2hpZ2hfbm9uY2FycmllckB3ZWIxODYxMDUubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":49574,"nextInTopic":49578,"prevInTime":49576,"nextInTime":49578,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... ***************** I m coming into this discussion late and haven t read all the replies, but want to comment on this, in particular, because the first","messageBody":"<div id=\"ygrps-yiv-879867206\">Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; It reads as though you have separated the house into mone and yours spaces. I would rethink that.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nI&#39;m coming into this discussion late and haven&#39;t read all the replies, but want to comment on this, in particular, because the first thought I had was &quot;can you install a door?&quot; It&#39;s not Reasonable to expect little kids to just stay out of a room, but you can lock it up and keep them out - and that could be a compromise, a way of eating your cake and having it. <br/>\n<br/>\nWith younger kids, it can help to find ways to make a big house act like a smaller house -not just to &quot;contain the mess&quot; but as a way of making it easy for mom and kids to be in the same spaces. Having toys in a central location works well in that sense... but it&#39;s unreasonable to expect all the toys will stay there. So if you&#39;re really pulling out your hair, install a door. Don&#39;t make it something to fight over - make it a non-issue. <br/>\n<br/>\nIf putting in a door is somehow structurally impossible, look for some other way to make it a non-issue. Trying to get kids to help you clean up will make cleaning an issue every time. So what else will help you maintain a sense of space and order? Will having some nice shelves with a lovely collection of teapots or china dolls do it? Setting aside a smaller room - a guest room, maybe, as a kind of parlor, or as a meditation room? Taking a weekly yoga class or joining a book club? It may be that you&#39;re not getting enough of your needs met in general and are fixating on cleaning as something that Seems to be controllable - if you step back from that and look for ways to meet Other needs, you might find you can relax about the inevitable chaos which comes of having young children at home. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":547166826,"authorName":"Beth Ann Espinoza","from":"Beth Ann Espinoza &lt;iheartsims84@...&gt;","profile":"webegoingreen3105","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361212016","msgId":49579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTzZEOWVuQU1KdzNDY0s5VWZHNStDNEIycHdCNk9nK2hRblJHWjV4VjF0ZWk0YmFqZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDg0NkUxOTQyLUYwNzgtNDM0RS1BMEJDLUIwMEFGREIwQzFGRUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPgk8RTQzOEZDNDAtMzJERS00QjM4LUEyMjItMzBFRTUzQTkwRjc2QHZlcml6b24ubmV0Pgk8Q0FPNkQ5ZT1RaDVYclhhbi02N3BWQktKelRuQ1UxS0YyYVdZaHhIRTlyVlpUeXdjRUZRQG1haWwuZ21haWwuY29tPgk8ODQ2RTE5NDItRjA3OC00MzRFLUEwQkMtQjAwQUZEQjBDMUZFQHZlcml6b24ubmV0Pg=="},"prevInTopic":49578,"nextInTopic":49583,"prevInTime":49578,"nextInTime":49580,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"I guess I didn t mean the you as in you personally in that statement. One of the things I am realizing with unschooling is that mom needs to be unschooling","messageBody":"<div id=\"ygrps-yiv-957157346\">I guess I didn&#39;t mean the &quot;you&quot; as in &quot;you personally&quot; in that statement.<br/>\nOne of the things I am realizing with unschooling is that mom needs to be<br/>\nunschooling also for it to really work. Because I personally have been from<br/>\nsingle working mom to at home wife to homeschooling, it was interesting to<br/>\nme that I might actually get to find something that I like to do. Just as<br/>\nwe give our kids that freedom we also need to give ourselves the freedom to<br/>\nbe and do what we want. And to be able to say &quot;no I don&#39;t want to do that<br/>\nbecause I have no interest.&quot;<br/>\n<br/>\nI am curious about learning more on how to encourage good relationships and<br/>\ndiscourage tantrums and physical attacks both to myself and siblings,<br/>\nespecially in a way that enables the child to make these choices on their<br/>\nown. Sorry if that is off-topic.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361210540","msgId":49574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0NkUxOTQyLUYwNzgtNDM0RS1BMEJDLUIwMEFGREIwQzFGRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTzZEOWU9UWg1WHJYYW4tNjdwVkJLSnpUbkNVMUtGMmFXWWh4SEU5clZaVHl3Y0VGUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPiA8RTQzOEZDNDAtMzJERS00QjM4LUEyMjItMzBFRTUzQTkwRjc2QHZlcml6b24ubmV0PiA8Q0FPNkQ5ZT1RaDVYclhhbi02N3BWQktKelRuQ1UxS0YyYVdZaHhIRTlyVlpUeXdjRUZRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49569,"nextInTopic":49577,"prevInTime":49573,"nextInTime":49575,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... But some mothers will believe a child not fussing is because he doesn t care without realizing what they ve done to stop him from expressing what he really","messageBody":"<div id=\"ygrps-yiv-872390154\">On Feb 18, 2013, at 10:32 AM, Beth Ann Espinoza wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I haven&#39;t trained my kids not to fuss.<br/>\n<br/>\n </span></blockquote>But some mothers will believe a child not fussing is because he doesn&#39;t care without realizing what they&#39;ve done to stop him from expressing what he really feels.<br/>\n<br/>\nThe list isn&#39;t about your kids. It&#39;s about ideas that anyone might find useful to grow better relationships with.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; His cars<br/>\n&gt; and other toys that just accumulated at the bottom of his toy chest were<br/>\n&gt; just adding unnecessary mess and frustration. We went thru everything<br/>\n&gt; together.<br/>\n<br/>\n </span></blockquote>Whether that works for a child depends on their personality. Some kids are more attached to their things, even stuff that&#39;s buried deep. Some kids are more people pleasers and can end up choosing something because it would make mom happy.<br/>\n<br/>\nThat&#39;s why it&#39;s more useful for this list to discuss principles of helping a child meet *his* needs in ways that are kind to others rather than finding ways for a child to meet mom&#39;s needs in a kind way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I also feel that while we pay ultra-attention to their feelings<br/>\n&gt; and personalities, they should also learn to have respect for others,<br/>\n<br/>\n </span></blockquote>WHen it&#39;s phrased as what they should learn it&#39;s difficult for most people to come up with ideas that aren&#39;t about teaching them or moving them to that idea against their wills. That&#39;s because most of us have grown up with nothing but ideas that focus on changing children.<br/>\n<br/>\nIf instead it&#39;s trusted that kids want to be thoughtful and kind, that they will be when they&#39;re capable, then it&#39;s much easier to support them as they figure that out. It&#39;s much easier to do that parts for them that they can&#39;t yet.<br/>\n<br/>\nBut it will be hard for kids to see value in the principles if the principles are used to impose mom&#39;s learning agenda on the child before the child can get what he wants.<br/>\n<br/>\nMaybe you don&#39;t do that. What your&#39;e doing or not isn&#39;t what the list is for. The list is for ideas to help *lots* of parents not impose their agenda on their kids. On this list that works by using posted ideas as a jumping off point to discuss how that works.<br/>\n<br/>\nSo to help kids think of others, we help them meet their needs in ways that are kind, respectful, doable, safe. The less the extras impose on meeting their needs, the more positively they&#39;ll feel to being thoughtful of others. It feels good to think of others! :-) But not so good when that thoughtfulness is paid for by being made to sacrifice.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; including their moms and if all you expect is for us as parents is to slave<br/>\n&gt; for these children&#39;s wants, I feel that is unreasonable.<br/>\n<br/>\n </span></blockquote>If you&#39;re perceiving what&#39;s read through a lens of mom being a slave, it will be harder to understand what&#39;s actually being said.<br/>\n<br/>\nTo understand new ideas it&#39;s useful to let go of what you believe you know about the ideas first:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nIf you don&#39;t like the new ideas it&#39;s easy to pick the old ones back up.<br/>\n<br/>\nIt&#39;s helpful to assume that people here have many of the same values as you, one of which is not being a slave to our kids. If something sounds off, ask how it&#39;s done! Accusing people of doing something they aren&#39;t muddies the explanations.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":361189100,"authorName":"Melissa Jones","from":"Melissa Jones &lt;momnerd@...&gt;","profile":"agape_mel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361205497","msgId":49569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0NEZBOUVGLUNFNTctNEU5MC04RjNCLUEzRTZFRUQwODlCQkBnbWFpbC5jb20+","inReplyToHeader":"PENBTzZEOWU9UWg1WHJYYW4tNjdwVkJLSnpUbkNVMUtGMmFXWWh4SEU5clZaVHl3Y0VGUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPiA8RTQzOEZDNDAtMzJERS00QjM4LUEyMjItMzBFRTUzQTkwRjc2QHZlcml6b24ubmV0PiA8Q0FPNkQ5ZT1RaDVYclhhbi02N3BWQktKelRuQ1UxS0YyYVdZaHhIRTlyVlpUeXdjRUZRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49568,"nextInTopic":49574,"prevInTime":49568,"nextInTime":49570,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"I don t know you. I can t know what you mean exactly. But from where I have been, it sounds to me like you are acting out of what you think motherhood *ought*","messageBody":"<div id=\"ygrps-yiv-510927368\">I don&#39;t know you. I can&#39;t know what you mean exactly. But from where I have been, it sounds to me like you are acting out of what you think motherhood *ought* to be. And I don&#39;t only mean the undercurrent thought that things *should* or *ought* to be in a correct place. Those are your standards for your own reasons. So then you tend to it, if it is truly important to you. Maybe that isn&#39;t what you want afterall, but what you think you should want. Maybe you are still pleasing an authority figure, and haven&#39;t made this issue your own. You are in charge of your own happiness. It&#39;s not the children&#39;t responsibility to make you happy. You can&#39;t expect your children to have the same standards you do. It&#39;s obvious from over here based on what they actually do, that they think otherwise. <br/>\n<br/>\nTaking others into account... Your overall writing manner makes it sound like your baggage is calling the shots here. If this is the case, there is a paradigm change that eventually occurs. You go from looking through your mom grid, usually anchored into place by our mothers. We believe reality re-inforces that particular grid.  But the fact is that your wounded inner child is calling the shots, which disrupts some else&#39;s inner child. Where that over lap takes place looks like affirmation of your grid. It can play right into it. Where in fact, you need to let that part of you heal and then grow. Then you can have the paradigm shift. But don&#39;t force your kids to heal your inner child. That is your confrontation to take up. It sounds like that might be occurring with you. <br/>\n<br/>\nOur day to day interactions are a window into some of our innermost thoughts and instincts. I encourage you to use your interactions as a way to gain insight into your grid. Until you tap into that, your going to continue to see life as an Either Or issue. In your case, you are the slave or the children are the slaves. And you won&#39;t be able to hear what good advice folks have for you, because it overlaps with your frustrated inner-child that needs some attention.<br/>\n<br/>\nMel<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 18, 2013, at 9:32 AM, Beth Ann Espinoza wrote:<br/>\n<br/>\n&gt; &gt; If you have trained your son not to fuss when you take away his toys,that<br/>\n&gt; doesn&#39;t mean he doesn&#39;t want or need them<br/>\n&gt; <br/>\n&gt; I haven&#39;t trained my kids not to fuss. My daughter has more stuffed animals<br/>\n&gt; than I would like but they are her little family so she keeps them. I would<br/>\n&gt; only like a place for everything. My son would have melt downs about<br/>\n&gt; cleaning his room. I came to the conclusion that he had too many toys that<br/>\n&gt; he didn&#39;t really like. He loves his legos and he loves star wars. His cars<br/>\n&gt; and other toys that just accumulated at the bottom of his toy chest were<br/>\n&gt; just adding unnecessary mess and frustration. We went thru everything<br/>\n&gt; together.<br/>\n&gt; <br/>\n&gt; Our role is to provide a supportive environment AND explore ways to take<br/>\n&gt; others into account.<br/>\n&gt; <br/>\n&gt; I agree. I also feel that while we pay ultra-attention to their feelings<br/>\n&gt; and personalities, they should also learn to have respect for others,<br/>\n&gt; including their moms and if all you expect is for us as parents is to slave<br/>\n&gt; for these children&#39;s wants, I feel that is unreasonable.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores/helping clean up","postDate":"1361204954","msgId":49568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmdGtzcSsxNzY0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTzZEOWU9UWg1WHJYYW4tNjdwVkJLSnpUbkNVMUtGMmFXWWh4SEU5clZaVHl3Y0VGUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49566,"nextInTopic":49569,"prevInTime":49567,"nextInTime":49569,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... They will. They will learn everything you show them. They won t act on it all today but everything you do is registering. Whether that is your intention or","messageBody":"<div id=\"ygrps-yiv-285252324\">--- <br/>\n<blockquote><span title=\"ireply\"> &gt; I agree. I also feel that while we pay ultra-attention to their feelings<br/>\n&gt; and personalities, they should also learn to have respect for others,<br/>\n&gt; including their moms and if all you expect is for us as parents is to slave<br/>\n&gt; for these children&#39;s wants, I feel that is unreasonable.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>They will. They will learn everything you show them. They won&#39;t act on it all today but everything you do is registering. Whether that is your intention or not. <br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores/helping clean up","postDate":"1361204268","msgId":49566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5QjIyQjJAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49563,"nextInTopic":49568,"prevInTime":49565,"nextInTime":49567,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... BTW in the interests of clarification (because in re-reading this I realized it could be taken differently than I said it because it doesn t have a whole","messageBody":"<div id=\"ygrps-yiv-1873318024\"><blockquote><span title=\"ireply\">&gt; LOL one or two chewed Legos (and multi-colored &#39;leavings&#39; in the yard!) and DS was quite happy to help us pick up Legos.<br/>\n<br/>\n </span></blockquote>BTW in the interests of clarification (because in re-reading this I realized it could be taken differently than I said it because it doesn&#39;t have a whole lot of backstory): the Legos didn&#39;t get left out for the dog to chew as a &quot;lesson&quot; for DS to learn to pick up after himself - we all just simply got involved in other stuff and a few Legos didn&#39;t make it back into the bin. They got chewed up by silly lab mix who seemed to have a taste for plastic. When it was discovered (partially chewed Legos on the floor), we shared DS&#39; sorrow, worked through the anger, brainstormed better ways for all of us to avoid the problem in the future (both to keep the Legos unchewed and to avoid a potentially sick dog). There was no blaming, finger pointing, &quot;you should have&quot; messages. It was a cooperative learning experience where we partnered as a family to address the situation.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361202163","msgId":49562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjEyMDIxNjMuMjc2ODQuWWFob29NYWlsTmVvQHdlYjE4MjIwMS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PENBTzZEOWVrd0JpTC1ZdDJVQTAwZjFvdHc1MEJNTmcyR2Jlc01nY242bWgzS2R4Z1B6d0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPiA8OEZGRTA5NDEtQjJDQi00QTBBLTgxMDktN0M4MjI4QTBDRTI5QGdtYWlsLmNvbT4gPDRENzBDRDEzLUQxMDAtNDA3RC05NzE3LTJEREFCRkMyNUEzN0B2ZXJpem9uLm5ldD4gPENBTzZEOWVrd0JpTC1ZdDJVQTAwZjFvdHc1MEJNTmcyR2Jlc01nY242bWgzS2R4Z1B6d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49557,"nextInTopic":49563,"prevInTime":49561,"nextInTime":49563,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"     I have been reading about unschooling since my son","messageBody":"<div id=\"ygrps-yiv-625058727\"> <br/>\n  <br/>\n&lt;&lt;&lt;&lt;&lt;I thought this was unschoolingbasics not radical unschooling brought to you<br/>\nby Joyce. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI have been reading about unschooling since my son was 2 and he is going to be 11 . I have been reading and applaying principles and ideas from Joyce Feteroll for that long, she has been  a huge influence in my unschooling jorney. Her daughter is an adult and she still helps many people on a daily basis.<br/>\nShe has a great website that I send people to  read about unschooling:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nMy home is peaceful and happy and still does get messy but is is not stressful or the reason from stress. My kids are learning and healthy. My son is a fabulous writer and his knowledge is amazing and he is only 10. He loves his room clean and will ask me from time to time to clean it and he helps as much as he can.<br/>\nWhen my kids help it is really sweet and they are really doing it to help mom.<br/>\n  <br/>\n<br/>\n &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;Unschooling is about letting your kids pursue their interests<br/>\nand learning styles not letting your kids do whatever they want.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n  Here is something I wrote about this:<br/>\n&quot;I am going to make a point and maybe it is not the case of the mom above [this was originally on the Unschooling Basics list] but it may be the case for others new to unschooling. I am making this point because I have seen it and I have seen it in person and it does not work and the results are not pretty and have nothing to do with unschooling and being a mindful parent.<br/>\nUnschooling is not letting children take care of themselves or work out things alone or without help and guidance, it is not letting them do whatever they want, it is not about freedom, it is not about only saying yes, it is not about letting them figure out things by themselves, it is not child-led learning.<br/>\n<br/>\nUnschooling takes more, more presence, more guidance, more attention, more mindfulness, more connection, more thinking and questioning, more choices and better choices.<br/>\n<br/>\nThere are some people that come to unschooling because they read blogs or ideas of families having fun and going about doing fun things and not being bogged down by a curriculum or rules and control. They may read a little and think all they have to do is not have rules, not have curriculum, not have bedimes, not have limits in TV, computers and food.<br/>\n<br/>\nWhat they are not reading is all the things an unschooling parent IS doing. They are sitting and playing computer games with their children, they are present, attentive, connected, facilitating, guiding, preventing, strewing, sharing, discovering together, learning right along, creating a learning environment, interested and interesting.<br/>\nSo if you are new to unschooling Sandra has a good suggestion: Read a little, try a little, wait a while, watch.<br/>\n<br/>\nIt takes time to get it. I have been reading and applying unschooling in my home for almost eight years and I am still getting it. It takes time to deschool. Most of us has a minimum of 13 years of schooling and some way more. Ask questions and just sit on the answers, re-read them, think about them, read them again, try them, wait a while and watch!<br/>\nSo all this to say that if someone comes to usnchooling thinking that it will be just sitting there while the kids fend for themselves and it is a piece of cake think again! That is not to say it is not wonderful and yes easier and more peaceful, but not in the way many think it is.<br/>\nAlex Polikowsky&quot;<br/>\n<br/>\n-=-=-=-=-=-=-=-=-<br/>\nAnd what should the OP do then that was suggested?<br/>\nbe with your kids more, create a system to make it easy for you and the kids ( because you are partners) to clean up and keep things tidy. Sometimes toys need to stay out longer so the child can play and go back and play again the next day. It does not mean all toys are out. Making your kids put all the toys away or they cannot do something can really hinder they play and damage your relationship creating making it antagonistic. For unschooling to  happen it is better if the parents are partners.<br/>\nAnd example would be if your  was cooking all happy for the family and the kitchen was all upside down . Think about two options:<br/>\nYou can tell him: &quot;You made a mess you clean it now&quot;<br/>\nor<br/>\n&quot;I will help you &quot; and happily join in and help him with a smile<br/>\nWhich option would bring you closer and make him want to cook for the family again? Which would create an antagonistic me X you?<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":547166826,"authorName":"Beth Ann Espinoza","from":"Beth Ann Espinoza &lt;iheartsims84@...&gt;","profile":"webegoingreen3105","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361201554","msgId":49563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTzZEOWU9UWg1WHJYYW4tNjdwVkJLSnpUbkNVMUtGMmFXWWh4SEU5clZaVHl3Y0VGUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEU0MzhGQzQwLTMyREUtNEIzOC1BMjIyLTMwRUU1M0E5MEY3NkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPgk8RTQzOEZDNDAtMzJERS00QjM4LUEyMjItMzBFRTUzQTkwRjc2QHZlcml6b24ubmV0Pg=="},"prevInTopic":49562,"nextInTopic":49566,"prevInTime":49562,"nextInTime":49564,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... doesn t mean he doesn t want or need them I haven t trained my kids not to fuss. My daughter has more stuffed animals than I would like but they are her","messageBody":"<div id=\"ygrps-yiv-308841868\"><blockquote><span title=\"ireply\">&gt; If you have trained your son not to fuss when you take away his toys,that<br/>\n </span></blockquote>doesn&#39;t mean he doesn&#39;t want or need them<br/>\n<br/>\nI haven&#39;t trained my kids not to fuss. My daughter has more stuffed animals<br/>\nthan I would like but they are her little family so she keeps them. I would<br/>\nonly like a place for everything. My son would have melt downs about<br/>\ncleaning his room. I came to the conclusion that he had too many toys that<br/>\nhe didn&#39;t really like. He loves his legos and he loves star wars. His cars<br/>\nand other toys that just accumulated at the bottom of his toy chest were<br/>\njust adding unnecessary mess and frustration. We went thru everything<br/>\ntogether.<br/>\n<br/>\nOur role is to provide a supportive environment AND explore ways to take<br/>\nothers into account.<br/>\n<br/>\nI agree. I also feel that while we pay ultra-attention to their feelings<br/>\nand personalities, they should also learn to have respect for others,<br/>\nincluding their moms and if all you expect is for us as parents is to slave<br/>\nfor these children&#39;s wants, I feel that is unreasonable.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361195423","msgId":49557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0MzhGQzQwLTMyREUtNEIzOC1BMjIyLTMwRUU1M0E5MEY3NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPg==","referencesHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPg=="},"prevInTopic":49556,"nextInTopic":49562,"prevInTime":49556,"nextInTime":49558,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... This is a good point. If a parent doesn t approve of how a child feels towards something, kids learn to hide their feelings. That doesn t mean their","messageBody":"<div id=\"ygrps-yiv-987023704\">On Feb 18, 2013, at 7:39 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you have trained your son not to fuss when you take away<br/>\n&gt; his toys, that doesn&#39;t mean he doesn&#39;t want or need them<br/>\n<br/>\n </span></blockquote>This is a good point. If a parent doesn&#39;t approve of how a child feels towards something, kids learn to hide their feelings. That doesn&#39;t&#39; mean their feeling have changed! It means they know you don&#39;t like who they really are and will pretend something different to avoid being criticized.<br/>\n<br/>\n*Some* people aren&#39;t attached to things. Some people are. If your son was upset by giving up his toys and you told him why he shouldn&#39;t feel that way, if he responds differently next time you can&#39;t know if he no longer feels as he did or whether he&#39;s learned to not express what he feels.<br/>\n<br/>\nIf he didn&#39;t care at one time but now does but feels he doesn&#39;t have a choice, it can look the same as not caring.<br/>\n<br/>\nThat can be the outcome of imposing our values on them. By telling them &quot;This is the way you need to see life. This is what you need to value,&quot; we get in the way of them trying things out to discover what they value. Our role is to provide a supportive environment AND explore ways to take others into account.<br/>\n<br/>\nIf we would like our kids to at least respect our values if not value for themselves, we begin by respecting their values.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361194858","msgId":49556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ODYzNTBFLTBFQUMtNDhDMi1BNDFGLTg0NzFGQTZCNzkxMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTzZEOWVrd0JpTC1ZdDJVQTAwZjFvdHc1MEJNTmcyR2Jlc01nY242bWgzS2R4Z1B6d0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPiA8OEZGRTA5NDEtQjJDQi00QTBBLTgxMDktN0M4MjI4QTBDRTI5QGdtYWlsLmNvbT4gPDRENzBDRDEzLUQxMDAtNDA3RC05NzE3LTJEREFCRkMyNUEzN0B2ZXJpem9uLm5ldD4gPENBTzZEOWVrd0JpTC1ZdDJVQTAwZjFvdHc1MEJNTmcyR2Jlc01nY242bWgzS2R4Z1B6d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49555,"nextInTopic":49557,"prevInTime":49555,"nextInTime":49557,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... In groups gathered for social and support purposes not everyone will have the same values and goals. Which is why people in such groups politely exchange","messageBody":"<div id=\"ygrps-yiv-978701000\">On Feb 18, 2013, at 1:50 AM, Beth Ann Espinoza wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Everyone has different boundaries and limitations and<br/>\n&gt; expectations.<br/>\n<br/>\n </span></blockquote>In groups gathered for social and support purposes not everyone will have the same values and goals. Which is why people in such groups politely exchange ideas of what they do without criticizing other people. The purpose isn&#39;t to offer help around a singular goal but to make everyone comfortable with their differences.<br/>\n<br/>\nThis list is different. It offers what life looks like when the primary goal is supporting relationships and free exploration. So its intent is very different than groups whose primary purpose is support and social.<br/>\n<br/>\nThis group is for analyzing whether ideas for a parenting problem will ALSO grow relationships and open the world to exploration. So the list works differently. The purpose is to offer how to make life with kids work when parents don&#39;t use arbitrary (parent imposed) boundaries and limitations.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is about letting your kids pursue their interests<br/>\n&gt; and learning styles not letting your kids do whatever they want.<br/>\n<br/>\n </span></blockquote>If the list is read through a lens of &quot;let your kids do whatever they want&quot; it will be harder to understand what people are saying instead.<br/>\n<br/>\nRadical unschooling is about supporting kids learning in all aspects of life not just the academic ones. It&#39;s about supporting kids exploring what they like and don&#39;t like to discover what values are right for them. If they grow up in that atmosphere, they will continue to do that as they grow and change. They won&#39;t assume there&#39;s one right answer for all time. (For example that toys need to be put away when done with.) They will discover what feels right to them for their right now view of the world.<br/>\n<br/>\nWhat helps that process is by living our own values. If a parent would like to pass on kindness, generosity, patience, thoughtfulness and so on she begins by using those as tools to solve her children&#39;s problems. Also by building those into her solutions. She finds ways for the kids to meet their needs AND be kind, polite, safe and so on. They aren&#39;t values to impose on kids but principles for mom to use in her decision making. If a child finds the principles useful, if those values make them feel loved and nurtured and warm towards others, they&#39;ll very likely use them in their own decision making. (Though it&#39;s best to accept it will take years. Kids have different priorities than adults. They&#39;ll need help meeting their needs AND being kind and so forth. They&#39;ll need help until they don&#39;t need help any more ;-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But at 6 and 8 the kids are responsible for<br/>\n&gt; cleaning up their toys before leaving the room.<br/>\n<br/>\n </span></blockquote>Parents often use the word responsibility differently for kids then treat it as if it were the word they apply to their own responsibilities. And when kids &quot;fail&quot; at their &quot;responsibilities&quot; they&#39;re judged harshly.<br/>\n<br/>\nResponsibilities are the tasks we&#39;ve chosen to accept. We get to decide what level of effort we&#39;ll put into those tasks to feel we&#39;ve done a good job. Not all tasks will need the same level of effort. If we decide to turn the lawn into a meadow -- and the town doesn&#39;t have ordinances and no one else in the family cares -- we can do that!  :-)<br/>\n<br/>\nBut many responsibilities we take on have expectations from others and it&#39;s responsible to be aware of that *before* taking on the responsibilities. If we decide on a level that&#39;s lower than what other people need, then people will be grumpy. There&#39;s a reason why kids can&#39;t sign contracts before they&#39;re 18. They aren&#39;t expect they have enough experience to understand what they&#39;re agreeing to. What they agree to may sound good at first, but they don&#39;t have the experience to know what it&#39;s actually like. (WHich is why kids shouldn&#39;t be made to promise to take care of a pet.)<br/>\n<br/>\nSometimes responsibilities are thrust on us, like caring for an aging parent. Sometimes we feel like we don&#39;t have a choice but we always do. There will be choices we won&#39;t want to take because of our values, but to dismiss them as not being choices is to feel trapped.<br/>\n<br/>\nEveryday you choose not to empty the bank account and run off to Tahiti is a day you&#39;ve chosen to be with your family. That&#39;s so much more empowering than believing you can&#39;t run away! You *can* run away. There are no armed guards preventing you. But you&#39;re *choosing* not to.<br/>\n<br/>\nHere&#39;s a couple of really good pages on how empowering viewing the world through choice and letting go of the feeling of &quot;have to&quot; can be. If you don&#39;t want to read them, that&#39;s fine. But the list works as a dialogue with everyone reading. The pages are offered to whoever might find them interesting.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nBut as far as kid &quot;responsibilities&quot; are concerned, if someone doesn&#39;t have a choice to do something, if they can&#39;t do it to their own standards, if they can&#39;t give it up for someone else to do when they realize they&#39;ve taken on more than they can handle, then it isn&#39;t a responsibility. It&#39;s task imposed on them. It&#39;s conscripted labor. Kids recognize the difference. They react exactly as adults do to being conscripted: anger, doing a half-assed job, finding excuses not to do it. But their reaction is judged as if they&#39;re shirking responsibilities. Kids recognize the dichotomy and feel like parents don&#39;t understand them. (Which they don&#39;t!) It undermines relationships.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sorry<br/>\n&gt; Joyce but it seems like you are being a little ornery today...<br/>\n<br/>\n </span></blockquote>I&#39;m answering as I always do. Which is why it&#39;s a good idea to sit back in any group and observe for a while. If my posts read ornery to you then it&#39;s best to skip my posts. But I don&#39;t believe I should be criticized for being the only one up at the time to provide what the group was formed for.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was just<br/>\n&gt; giving advice that was asked for by the OP and wasn&#39;t asking to get bashed.<br/>\n<br/>\n </span></blockquote>By posting here people are asking for how a parent responds to parenting problems when the goal is to put the relationship and free exploration first. What you provided was what works for the personalities in your family for your goals. Which is how support groups work. But this isn&#39;t a support group.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores/helping clean up","postDate":"1361194580","msgId":49555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5QjIxQjBAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49554,"nextInTopic":49556,"prevInTime":49554,"nextInTime":49556,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... LOL one or two chewed Legos (and multi-colored leavings in the yard!) and DS was quite happy to help us pick up Legos. As was already mentioned, a big","messageBody":"<div id=\"ygrps-yiv-1380038465\"><blockquote><span title=\"ireply\">&gt; their items so as not to be stepped or chewed on by the dogs.<br/>\n<br/>\n </span></blockquote>LOL one or two chewed Legos (and multi-colored &#39;leavings&#39; in the yard!) and DS was quite happy to help us pick up Legos. As was already mentioned, a big sheet to play Legos on and a bin to dump it all into (Pick up the corners of the sheet and pop the whole bundle into a bin - easy in/easy out). When DS was a toddler, we lived in a smallish 2 bedroom apartment - me, hubby, son, Thomas the Tank Engine and his friends and track, Lego/Duplo pieces, cars, trucks, planes, and a whole assortment of other playthings. The ONLY play space was the living room (both bedrooms contained bed, dresser, nightstand, and that was about it for space with room to walk). Sometime in the day (and sometimes more than once, depending on how much we were indoors - in winter, more often than in summer), we&#39;d do a &quot;10 second tidy&quot; (from Big Comfy Couch program) and be really silly about getting all the &quot;blue&quot; toys in their bins or all the &quot;vehicles&quot; or whatever. Typically, we&#39;d do a tidy when the floor was too crowded for an adult to sit and play. &quot;Hey, DS, let&#39;s do a 10 second tidy so I can sit and play Thomas trains with you - I&#39;m too big to fit in this space right now&quot; And off we&#39;d go, being silly (trying to look like speeded up video and talking squeaky and all). BUT it was NOT DS&#39; responsibility to all of it or even MOST of it.<br/>\n<br/>\nOnce we moved to a house with more space, the living room was still the main play space - that&#39;s the center of the house for us (TV, fireplace, comfy spots to cuddle, etc). Again, we had bins tucked against the walls to easily put stuff away - some things &quot;lived&quot; in his bedroom and we&#39;d rotate bins in and out as needed. Big &quot;sorting out&quot; times were done about quarterly (give or take) when stuff that had gotten in the &quot;wrong&quot; bin was moved back to the proper spot (we have bins for vehicles, Legos, weapons, etc). In the process, some stuff would get pitched out (broken beyond use for example), some stuff would get put aside to be taken to Goodwill or wherever, and some stuff would be put aside to hand down to smaller cousins. And, some stuff that had been forgotten about took on a new luster as it was re-discovered and would be played with again.<br/>\n<br/>\nA really big mindset change is going from &quot;I have to do this&quot; to &quot;I choose to do this&quot; - it&#39;s not an easy change, but it is a necessary change to seeing everything you do as a choice. You can choose to tidy or not - but you have said you don&#39;t like the results of &quot;not&quot;. So, find ways to make it a positive choice. For me, I really didn&#39;t like &quot;Having to&quot; wash dishes. But, it&#39;s a choice - I can choose to use paper plates and plastic utensils and heat-and-eat foods (minimal cooking and pots and pans). Or, I can choose to wash dishes and make it pleasant for myself - so I buy a dish soap that I like the scent of (mandarin orange) even if it costs a little more than the generic store brand; we have a nice little &quot;bullet&quot; speaker and an MP3 player near the sink so music is available; and hubby and I choose to do the dishes together - he washes, I dry and put away. We use it as time to connect (since I work fulltime) and it&#39;s not so onerous a task when we choose to see it as &quot;our time together&quot; and not as a &quot;chore that we have to do&quot;.<br/>\n<br/>\nDebR<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores/helping clean up","postDate":"1361191172","msgId":49554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmdDdlNCtjaDA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTzZEOWVuRFJuN0ZtTjBxY1ZNNS1aRDdaVlpaaUx3cW1mNDA5aWVRa0FpZUZfaXlnd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49553,"nextInTopic":49555,"prevInTime":49553,"nextInTime":49555,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"This strikes me as wrong on so many levels -- and not a bit appropriate for an unschooling list. If you have trained your son not to fuss when you take away","messageBody":"<div id=\"ygrps-yiv-1101457988\">This strikes me as wrong on so many levels -- and not a bit appropriate for an unschooling list.<br/>\n<br/>\nIf you have trained your son not to fuss when you take away his toys, that doesn&#39;t mean he doesn&#39;t want or need them.<br/>\n<br/>\nThis is not about what you think is an appropriate number of toys. It is about what makes your son happy, what allows him to enjoy the world around him, without feeling there is a shortage all the time, without believing there is a strictness about the world that is really just something you have created.<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Beth Ann Espinoza &lt;iheartsims84@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Kids don&#39;t need all that many toys. I am constantly going thru my baby&#39;s<br/>\n&gt; toys to purge what he has lost interest in. I sat down with my 6 year old<br/>\n&gt; son and told him to pick out 10 toys to keep and that legos or cars may<br/>\n&gt; count as one item. There were no tears. The rest were boxed up for a time<br/>\n&gt; to be sure that he was satisfied with what he had. Legos get put away as<br/>\n&gt; soon as he is done playing with them. Kids don&#39;t need toys to use their<br/>\n&gt; imaginations. In fact, too many toys overwhelms them and stunts their<br/>\n&gt; imaginations. They will always be asking for the next toy at the market<br/>\n&gt; rather than using what they already have. 10 toys. Per kid. Simple. Also,<br/>\n&gt; those messy toys like legos need to be asked for and out away immediately<br/>\n&gt; when they are done being played with. There is no reason for them to be<br/>\n&gt; easily accessible to kids who hate to pick them up. If they want to play<br/>\n&gt; with something like that they should pick up what they were doing so that<br/>\n&gt; pieces are easy to find at clean up time. Just some things that have worked<br/>\n&gt; for us in this experiment we call parenting.<br/>\n&gt; <br/>\n&gt; Beth<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores/helping clean up","postDate":"1361190706","msgId":49553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmdDZ2aSszamQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg=="},"prevInTopic":49552,"nextInTopic":49554,"prevInTime":49552,"nextInTime":49554,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"You are not your mother. You need to let go of that idea and realize you have a completely different life. When the boys are older, there will be years and","messageBody":"<div id=\"ygrps-yiv-1408782103\">You are not your mother. You need to let go of that idea and realize you have a completely different life. <br/>\n<br/>\nWhen the boys are older, there will be years and years to clean and make the house just as you like it. This is not that time. Your life isn&#39;t the same throughout. This is a messy phase. That&#39;s OK. You will get older, the boys will get older, and everyone&#39;s needs will change. Soon enough you will be missing them and their clutter. :)<br/>\n<br/>\nFor now, stop spending these short years fussing with them over their toys. They live in the whole house. It doesn&#39;t make any sense to expect them to see the arbitrary lines you have drawn in your mind.<br/>\n<br/>\nI, too, have dealt with a hoarder in our family and enjoy a minimalist room. With two teens, I can now have the house pretty much how I want it -- not including their rooms. Today&#39;s trash included two bags of stuff from my dresser. I enjoyed clearing that out! DH is a packrat but his stuff is outside -- he has his own space to fill to his heart&#39;s content and is old enough to understand that I don&#39;t want his clutter in the living room. <br/>\n<br/>\nBut when 6-year-old Dear Nephew is staying with us, that&#39;s a different story. The house is strewn from end to end with his stuff. And that&#39;s OK. He needs that. He needs to have his stuff around him and visible. I think the house he lives at most of the time is too damned neat for him but that&#39;s another story. :) Then he goes home and I put all his stuff away and it&#39;s a little sad. <br/>\n<br/>\nSo enjoy it while you can. Hug the kids and all their clutter. You will have the rest of your life to dust and declutter. And you should.:)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;a3boymommy&quot; &lt;kkissoyan@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all, <br/>\n&gt; <br/>\n&gt; I know it feels like we&#39;ve talked this one to death, but I&#39;m still struggling. I think I&#39;ve read and absorbed enough about the idea that if I feel like the house is a mess, that&#39;s my problem, if I want it clean then it&#39;s my job to keep it clean, it&#39;s not the kids&#39; job to maintain my standards of cleanliness, and they&#39;ll certainly never find the joy in a clean house if housework is all strife and yelling and drudgery. I really do get it, and I believe that. <br/>\n&gt; <br/>\n&gt; But. <br/>\n&gt; <br/>\n&gt; I have 3 sons, ages 6, 4.5 & 4.5. My mom is a hoarder, and I have that same tendency. I am constantly fighting my own battle with clutter and Stuff. One thing that I try really really really hard to do is to keep the living room, one room in the entire house, looking clean and neat and uncluttered and presentable. It gives me sanity and calm, and it&#39;s really important to me. The boys have the entire dining room, which is the largest single room in the house, converted into their playroom. They have bins and storage buckets and shelving and everything they need to keep it neat and organized if they want to, and, what, approx. 200 sq. ft. of floor space to spread out on. I do not get on them to keep it clean. The only time I tidy it up for them is when it&#39;s so messy that they can&#39;t play in there any more and yet they don&#39;t want to clean it up (because it&#39;s overwhelming, I get it). They love when I tidy it up for them. But, frankly, I don&#39;t want to do that all the time. I have an entire house to keep clean, and they do not help. Which is fine, but. I don&#39;t want to clean up their play room for them all the time. This is a minor issue, but here&#39;s where it gets to be a problem, from an un-schooling perspective.<br/>\n&gt; <br/>\n&gt; When their play room gets overwhelming, if I don&#39;t clean it up for them, it starts to spill over. And very quickly I turn around and my living room is filled with games, toys, puzzles, puzzle pieces, parts of costumes, tiny lego pieces that slice the bottoms of my feet (GOD I HATE THAT!!!!!). And they still will not help me clean it up. It makes me want to cry. It makes me start threatening to throw it all away. And then my oldest, rightly, will yell at me that I have no right to throw his stuff away. And then I yell that he has no right to make the community space unusable with his stuff when he already has the largest room in the house and no one policing him in there. And..... it&#39;s ugly and angry and I hate it. But I really can&#39;t get my head around the idea that it&#39;s my job to clean up their mess in our living room. Really?! It just starts to feel..... abusive.... martyrizing..... something really ugly. <br/>\n&gt; <br/>\n&gt; So. What is this? How do I shed a positive light on this? How do we share space when this is such a volatile emotional trigger for me? (Of course I have deep-seated fears that 30 years from now I&#39;ll be living in a house that I can&#39;t walk around in or have people over b/c of the hoarding..... because that&#39;s my mom right now....). I&#39;m trying not to be reactionary, but..... why can&#39;t they just keep their crap in their own space and let me have one room that looks nice?!?! <br/>\n&gt; <br/>\n&gt; FWIW, they also have a bedroom and a reading room, both of which I straighten for them, and both of which I generally leave them alone about, but neither of which is a play room so they don&#39;t have a lot of toys or stuff to strew around, so I&#39;m fine with that. <br/>\n&gt; <br/>\n&gt; Thanks. Sorry if this is a bit ranty. I&#39;m just tired of the fight and I&#39;m tired of feeling taken for granted. <br/>\n&gt; <br/>\n&gt; Best, <br/>\n&gt; Kimberley<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":547166826,"authorName":"Beth Ann Espinoza","from":"Beth Ann Espinoza &lt;iheartsims84@...&gt;","profile":"webegoingreen3105","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361170225","msgId":49552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTzZEOWVrd0JpTC1ZdDJVQTAwZjFvdHc1MEJNTmcyR2Jlc01nY242bWgzS2R4Z1B6d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRENzBDRDEzLUQxMDAtNDA3RC05NzE3LTJEREFCRkMyNUEzN0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPgk8OEZGRTA5NDEtQjJDQi00QTBBLTgxMDktN0M4MjI4QTBDRTI5QGdtYWlsLmNvbT4JPDRENzBDRDEzLUQxMDAtNDA3RC05NzE3LTJEREFCRkMyNUEzN0B2ZXJpem9uLm5ldD4="},"prevInTopic":49550,"nextInTopic":49553,"prevInTime":49551,"nextInTime":49553,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"I thought this was unschoolingbasics not radical unschooling brought to you by Joyce. Everyone has different boundaries and limitations and expectations.","messageBody":"<div id=\"ygrps-yiv-322028024\">I thought this was unschoolingbasics not radical unschooling brought to you<br/>\nby Joyce. Everyone has different boundaries and limitations and<br/>\nexpectations. Unschooling is about letting your kids pursue their interests<br/>\nand learning styles not letting your kids do whatever they want. I go to<br/>\nthe library for books or to the bookstore to read the newer gardening or<br/>\ndecorating books that the library doesn&#39;t buy. Cardboard and a box cutter<br/>\nmakes the deck of star trek and a cardboard box is a transmogrifier from<br/>\nCalvin and Hobbes. The kids make up shops all over the house and<br/>\nclubhouses. And star wars legos/stuffedville is played all together when<br/>\nthe kids wanna play together. But at 6 and 8 the kids are responsible for<br/>\ncleaning up their toys before leaving the room. Lego projects are not<br/>\ndemolished in this process just put up on a shelf for later play. Sorry<br/>\nJoyce but it seems like you are being a little ornery today... I was just<br/>\ngiving advice that was asked for by the OP and wasn&#39;t asking to get bashed.<br/>\n<blockquote><span title=\"qreply\"> On Feb 17, 2013 7:21 PM, &quot;Joyce Fetteroll&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; After living in backpack for almost a month we reevaluated what<br/>\n&gt; &gt; our children really needed and donated much of the items that<br/>\n&gt; &gt; were adding to clutter. They now play with and value the fewer<br/>\n&gt; &gt; toys because they are not able to just move on to another :)<br/>\n&gt;<br/>\n&gt; Try this:<br/>\n&gt;<br/>\n&gt; &quot;After living in backpack for almost a month I reevaluated what my wife<br/>\n&gt; really needed and donated much of what she had that was adding to the<br/>\n&gt; clutter. She now spends time with and values the fewer things she has<br/>\n&gt; because she can&#39;t just move onto another.&quot;<br/>\n&gt;<br/>\n&gt; Does it sound like a loving couple? Or does it sound like a controller and<br/>\n&gt; the object he&#39;s trying to control?<br/>\n&gt;<br/>\n&gt; If an action or a viewpoint sounds like it would damage a relationship<br/>\n&gt; between 2 adults, it&#39;s not a healthy way to grow a relationship with kids.<br/>\n&gt;<br/>\n&gt; &gt; I now have them take their things to their rooms every night before bed.<br/>\n&gt;<br/>\n&gt; &quot;I now have my wife take her things to her room every night before bed.&quot;<br/>\n&gt;<br/>\n&gt; How would it sound if you overheard your husband saying that to his<br/>\n&gt; buddies? Doesn&#39;t it sound like a throwback to the 50&#39;s? Does it have the<br/>\n&gt; feel of a loving partnership?<br/>\n&gt;<br/>\n&gt; &gt; I&#39;m attempting to instill the importance of caring for their<br/>\n&gt; &gt; items so as not to be stepped or chewed on by the dogs.<br/>\n&gt;<br/>\n&gt; Quite often the lessons we think we&#39;re teaching aren&#39;t the lessons being<br/>\n&gt; learned.<br/>\n&gt;<br/>\n&gt; A radical unschooling approach would be to be the one who picked up the<br/>\n&gt; toys to be safe from the dog. And then ask the kids to join you. If they<br/>\n&gt; declined, accept it.<br/>\n&gt;<br/>\n&gt; This works for any value. Be the one who lives the value. Invite the kids<br/>\n&gt; to participate, but don&#39;t expect it. They can&#39;t choose to value something<br/>\n&gt; unless they have the option not to value it.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361157676","msgId":49549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU3RTAzMjI2LTUzNUItNDE4NS1CQkIyLTY0QUU4NjU5M0JDQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTzZEOWVuRFJuN0ZtTjBxY1ZNNS1aRDdaVlpaaUx3cW1mNDA5aWVRa0FpZUZfaXlnd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDEzNjExNDM1OTguMzQ4NjcuQlBNYWlsX2hpZ2hfbm9uY2FycmllckB3ZWIxODYxMDYubWFpbC5pcjIueWFob28uY29tPiA8Q0FPNkQ5ZW5EUm43Rm1OMHFjVk01LVpEN1pWWlppTHdxbWY0MDlpZVFrQWllRl9peWd3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49548,"nextInTopic":49550,"prevInTime":49548,"nextInTime":49550,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... Kids end up with way more toys than they really need often because parents buy them lots of toys the parents want them to have. And then the parents lump","messageBody":"<div id=\"ygrps-yiv-1633520471\"><blockquote><span title=\"ireply\">&gt; Kids don&#39;t need all that many toys.<br/>\n<br/>\n </span></blockquote>Kids end up with way more toys than they really need often because parents buy them lots of toys the parents want them to have. And then the parents lump all the kid requested toys and parent desired toys together as though they were equally the kids&#39; &quot;fault&quot;.<br/>\n<br/>\nIf I could go back, one thing I would do is buy fewer things that I wanted my daughter to have and focus more on what she wanted.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Kids don&#39;t need all that many toys.<br/>\n<br/>\n </span></blockquote>How is that statement different than saying &quot;Wives don&#39;t need all that many books.&quot; It doesn&#39;t even make sense.<br/>\n<br/>\nSome people like loads of books. Some read them and pass them on. Some don&#39;t like to read.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am constantly going thru my baby&#39;s<br/>\n&gt; toys to purge what he has lost interest in.<br/>\n<br/>\n </span></blockquote>This is easy to do with babies. What can damage relationships is continuing with this point of view as the kids get older.<br/>\n<br/>\nWith radical unschooling the relationship and creating a rich environment to explore should be primary. Then everything else fits around that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I sat down with my 6 year old<br/>\n&gt; son and told him to pick out 10 toys to keep and that legos or cars may<br/>\n&gt; count as one item.<br/>\n<br/>\n </span></blockquote>&quot;I sat down with my wife and told her she could pick out 10 books to keep and that series could count as 1 book.&quot;<br/>\n<br/>\nA radical unschooling approach would be to ask the kids if they&#39;re done with some things. Also packing up things the kids aren&#39;t playing with and putting them away. Then later they can be brought out again. They&#39;ll have acquired a newness. Or the kids might decide they&#39;re ready to get rid of them.<br/>\n<br/>\nIt wouldn&#39;t grow a closer relationship between husband and wife if the husband treated his wife&#39;s things as annoying clutter with his goal being ways to get her to get rid of what was annoying him. He would grow a better relationship if he met his own needs AND kept his wife&#39;s happiness primary.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There were no tears.<br/>\n<br/>\n </span></blockquote>For some kids there would be tears. It totally depends on personality. Which is why passing on &quot;what works for us&quot; isn&#39;t as useful for radical unschooling. If a choice isn&#39;t well grounded in what builds relationships between any two humans, what works in one family is liable to be very damaging for another family.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The rest were boxed up for a time<br/>\n&gt; to be sure that he was satisfied with what he had.<br/>\n<br/>\n </span></blockquote>This is a good idea when asking kids if they&#39;re done with something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Kids don&#39;t need toys to use their<br/>\n&gt; imaginations.<br/>\n<br/>\n </span></blockquote>&quot;Wives don&#39;t need books to use their imaginations.&quot;<br/>\n<br/>\nDoesn&#39;t it feel disrespectful to be thought of as some generic thing that has no individuality?<br/>\n<br/>\nSome kids do need props as vehicles for their imagination. Some kids will be pretending more in their heads. (My daughter was like that.) Some kids will need to move and dress up to become their imaginations.<br/>\n<br/>\nIt depends on personality. IT depends on the child.<br/>\n<br/>\nOne of the biggest steps a parent can take towards radical unschooling is to look at their child and not at a generic child. Just as we want our husbands to see us and not some generic wife with generic needs and abilities.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In fact, too many toys overwhelms them and stunts their<br/>\n&gt; imaginations.<br/>\n<br/>\n </span></blockquote>It&#39;s too broad a statement to be meaningful to anyone. Some kids get overwhelmed. Some don&#39;t.<br/>\n<br/>\nIt helps unschooling flourish to be finding out what our own kids need by trying different things out rather than focusing on making them more convenient to have in the house.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They will always be asking for the next toy at the market<br/>\n&gt; rather than using what they already have.<br/>\n<br/>\n </span></blockquote>Seeing kids curiosity as so trivial will be damaging to relationships and learning. Curiosity is primary to learning. This list is for ways to live life with kids will making those the priority.<br/>\n<br/>\nWhile it&#39;s true that a toy may not live up to expectations, what can help is letting them spend lots of time in the store with toys. Also making a list of things they like to let them think it over. (Even better is if you have a smart phone, create a Pinterest account to collect pictures of what they really like.)<br/>\n<br/>\nAlso garage sales and Goodwill.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 10 toys. Per kid. Simple.<br/>\n<br/>\n </span></blockquote>&quot;10 books. Per wife. Simple.&quot;<br/>\n<br/>\nConventionally speaking, there&#39;s nothing wrong with what you&#39;re saying. For conventional parenting the focus is on making life with kids more convenient. But that focus doesn&#39;t work well for unschooling.<br/>\n<br/>\nFor unschooling to work well the two focuses are relationships and opening up the world to explore.<br/>\n<br/>\nIf a child is only playing with 10 toys, it&#39;s fine to pack away the others. If mom is happy to get toys out she&#39;s packed away, that won&#39;t interfere with learning or relationships.<br/>\n<br/>\nBut unschooling is about opening the world to kids. It means creating a rich environment for them to explore. That environment will look different for each child. For some kids it may not be a lot of toys. For others it will. For my daughter it was reams and reams of paper and loads of pens and markers. And Pokemon and cats. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also,<br/>\n&gt; those messy toys like legos need to be asked for and out away immediately<br/>\n&gt; when they are done being played with.<br/>\n<br/>\n </span></blockquote>So the Legos must be limited to Lego play? They can&#39;t be combined with other toys in imaginative ways?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is no reason for them to be<br/>\n&gt; easily accessible to kids who hate to pick them up.<br/>\n<br/>\n </span></blockquote>A good reason would be the kids want them.<br/>\n<br/>\nA better way -- a way that will help unschooling which is what this list is about -- is respecting the children&#39;s needs and finding ways to do that. One way can be putting the Legos up so they can be easier for Mom to clean up.<br/>\n<br/>\nIt will look the same as what you said, but the mindset will be very different. It will be focused on helping the child meet his needs rather than making the child less of a bother.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361154430","msgId":49550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENzBDRDEzLUQxMDAtNDA3RC05NzE3LTJEREFCRkMyNUEzN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDhGRkUwOTQxLUIyQ0ItNEEwQS04MTA5LTdDODIyOEEwQ0UyOUBnbWFpbC5jb20+","referencesHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPiA8OEZGRTA5NDEtQjJDQi00QTBBLTgxMDktN0M4MjI4QTBDRTI5QGdtYWlsLmNvbT4="},"prevInTopic":49549,"nextInTopic":49552,"prevInTime":49549,"nextInTime":49551,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... Try this: After living in backpack for almost a month I reevaluated what my wife really needed and donated much of what she had that was adding to the","messageBody":"<div id=\"ygrps-yiv-64577294\"><blockquote><span title=\"ireply\">&gt; After living in backpack for almost a month we reevaluated what<br/>\n&gt; our children really needed and donated much of the items that<br/>\n&gt; were adding to clutter. They now play with and value the fewer<br/>\n&gt; toys because they are not able to just move on to another :)<br/>\n<br/>\n </span></blockquote>Try this:<br/>\n<br/>\n&quot;After living in backpack for almost a month I reevaluated what my wife really needed and donated much of what she had that was adding to the clutter. She now spends time with and values the fewer things she has because she can&#39;t just move onto another.&quot;<br/>\n<br/>\nDoes it sound like a loving couple? Or does it sound like a controller and the object he&#39;s trying to control?<br/>\n<br/>\nIf an action or a viewpoint sounds like it would damage a relationship between 2 adults, it&#39;s not a healthy way to grow a relationship with kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I now have them take their things to their rooms every night before bed.<br/>\n<br/>\n </span></blockquote>&quot;I now have my wife take her things to her room every night before bed.&quot;<br/>\n<br/>\nHow would it sound if you overheard your husband saying that to his buddies? Doesn&#39;t it sound like a throwback to the 50&#39;s? Does it have the feel of a loving partnership?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m attempting to instill the importance of caring for their <br/>\n&gt; items so as not to be stepped or chewed on by the dogs.<br/>\n<br/>\n </span></blockquote>Quite often the lessons we think we&#39;re teaching aren&#39;t the lessons being learned.<br/>\n<br/>\nA radical unschooling approach would be to be the one who picked up the toys to be safe from the dog. And then ask the kids to join you. If they declined, accept it.<br/>\n<br/>\nThis works for any value. Be the one who lives the value. Invite the kids to participate, but don&#39;t expect it. They can&#39;t choose to value something unless they have the option not to value it.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":547166826,"authorName":"Beth Ann Espinoza","from":"Beth Ann Espinoza &lt;iheartsims84@...&gt;","profile":"webegoingreen3105","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361144397","msgId":49548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTzZEOWVuRFJuN0ZtTjBxY1ZNNS1aRDdaVlpaaUx3cW1mNDA5aWVRa0FpZUZfaXlnd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNjExNDM1OTguMzQ4NjcuQlBNYWlsX2hpZ2hfbm9uY2FycmllckB3ZWIxODYxMDYubWFpbC5pcjIueWFob28uY29tPg==","referencesHeader":"PDEzNjExNDM1OTguMzQ4NjcuQlBNYWlsX2hpZ2hfbm9uY2FycmllckB3ZWIxODYxMDYubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":49547,"nextInTopic":49549,"prevInTime":49547,"nextInTime":49549,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"Kids don t need all that many toys. I am constantly going thru my baby s toys to purge what he has lost interest in. I sat down with my 6 year old son and told","messageBody":"<div id=\"ygrps-yiv-208500004\">Kids don&#39;t need all that many toys. I am constantly going thru my baby&#39;s<br/>\ntoys to purge what he has lost interest in. I sat down with my 6 year old<br/>\nson and told him to pick out 10 toys to keep and that legos or cars may<br/>\ncount as one item. There were no tears. The rest were boxed up for a time<br/>\nto be sure that he was satisfied with what he had. Legos get put away as<br/>\nsoon as he is done playing with them. Kids don&#39;t need toys to use their<br/>\nimaginations. In fact, too many toys overwhelms them and stunts their<br/>\nimaginations. They will always be asking for the next toy at the market<br/>\nrather than using what they already have. 10 toys. Per kid. Simple. Also,<br/>\nthose messy toys like legos need to be asked for and out away immediately<br/>\nwhen they are done being played with. There is no reason for them to be<br/>\neasily accessible to kids who hate to pick them up. If they want to play<br/>\nwith something like that they should pick up what they were doing so that<br/>\npieces are easy to find at clean up time. Just some things that have worked<br/>\nfor us in this experiment we call parenting.<br/>\n<br/>\nBeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":475045201,"authorName":"Mandy Taylor","from":"Mandy Taylor &lt;msmandytaylor@...&gt;","profile":"msmandytaylor","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361143883","msgId":49547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGRkUwOTQxLUIyQ0ItNEEwQS04MTA5LTdDODIyOEEwQ0UyOUBnbWFpbC5jb20+","inReplyToHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg==","referencesHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg=="},"prevInTopic":49546,"nextInTopic":49548,"prevInTime":49546,"nextInTime":49548,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"Hello, I went through something similar a couple years ago when my children were the same age. :) It felt like things were everywhere all the time. I also like","messageBody":"<div id=\"ygrps-yiv-1831550814\">Hello,<br/>\n<br/>\nI went through something similar a couple years ago when my children were the same age. :) It felt like things were everywhere all the time. I also like to keep my house presentable and with little ones around I felt as if I was constantly chasing &quot;stuff&quot;. <br/>\n<br/>\nMy children are now 7 and 9 and still pull their things out into the middle of the house and leave it. We use it as an opportunity to play together during the day. Except, I now have them take their things to their rooms every night before bed. I&#39;m attempting to instill the importance of caring for their items so as not to be stepped or chewed on by the dogs.<br/>\n<br/>\nWe also simplified our lives dramatically this past year after a 3 week long hiking trek with the kids. After living in backpack for almost a month we reevaluated what our children really needed and donated much of the items that were adding to clutter. They now play with and value the fewer toys because they are not able to just move on to another :)<br/>\n<br/>\nGood luck and hang in there! They&#39;re little and exploring things. Your house will resume to some kind of sanity soon...or maybe just a new kind of sanity :)<br/>\n<br/>\nBest <br/>\nMandy<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 17, 2013, at 10:39 AM, &quot;a3boymommy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kkissoyan@...\">kkissoyan@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Hi all, <br/>\n&gt; <br/>\n&gt; I know it feels like we&#39;ve talked this one to death, but I&#39;m still struggling. I think I&#39;ve read and absorbed enough about the idea that if I feel like the house is a mess, that&#39;s my problem, if I want it clean then it&#39;s my job to keep it clean, it&#39;s not the kids&#39; job to maintain my standards of cleanliness, and they&#39;ll certainly never find the joy in a clean house if housework is all strife and yelling and drudgery. I really do get it, and I believe that. <br/>\n&gt; <br/>\n&gt; But. <br/>\n&gt; <br/>\n&gt; I have 3 sons, ages 6, 4.5 & 4.5. My mom is a hoarder, and I have that same tendency. I am constantly fighting my own battle with clutter and Stuff. One thing that I try really really really hard to do is to keep the living room, one room in the entire house, looking clean and neat and uncluttered and presentable. It gives me sanity and calm, and it&#39;s really important to me. The boys have the entire dining room, which is the largest single room in the house, converted into their playroom. They have bins and storage buckets and shelving and everything they need to keep it neat and organized if they want to, and, what, approx. 200 sq. ft. of floor space to spread out on. I do not get on them to keep it clean. The only time I tidy it up for them is when it&#39;s so messy that they can&#39;t play in there any more and yet they don&#39;t want to clean it up (because it&#39;s overwhelming, I get it). They love when I tidy it up for them. But, frankly, I don&#39;t want to do that all the time. I have an entire house to keep clean, and they do not help. Which is fine, but. I don&#39;t want to clean up their play room for them all the time. This is a minor issue, but here&#39;s where it gets to be a problem, from an un-schooling perspective.<br/>\n&gt; <br/>\n&gt; When their play room gets overwhelming, if I don&#39;t clean it up for them, it starts to spill over. And very quickly I turn around and my living room is filled with games, toys, puzzles, puzzle pieces, parts of costumes, tiny lego pieces that slice the bottoms of my feet (GOD I HATE THAT!!!!!). And they still will not help me clean it up. It makes me want to cry. It makes me start threatening to throw it all away. And then my oldest, rightly, will yell at me that I have no right to throw his stuff away. And then I yell that he has no right to make the community space unusable with his stuff when he already has the largest room in the house and no one policing him in there. And..... it&#39;s ugly and angry and I hate it. But I really can&#39;t get my head around the idea that it&#39;s my job to clean up their mess in our living room. Really?! It just starts to feel..... abusive.... martyrizing..... something really ugly. <br/>\n&gt; <br/>\n&gt; So. What is this? How do I shed a positive light on this? How do we share space when this is such a volatile emotional trigger for me? (Of course I have deep-seated fears that 30 years from now I&#39;ll be living in a house that I can&#39;t walk around in or have people over b/c of the hoarding..... because that&#39;s my mom right now....). I&#39;m trying not to be reactionary, but..... why can&#39;t they just keep their crap in their own space and let me have one room that looks nice?!?! <br/>\n&gt; <br/>\n&gt; FWIW, they also have a bedroom and a reading room, both of which I straighten for them, and both of which I generally leave them alone about, but neither of which is a play room so they don&#39;t have a lot of toys or stuff to strew around, so I&#39;m fine with that. <br/>\n&gt; <br/>\n&gt; Thanks. Sorry if this is a bit ranty. I&#39;m just tired of the fight and I&#39;m tired of feeling taken for granted. <br/>\n&gt; <br/>\n&gt; Best, <br/>\n&gt; Kimberley <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361143598","msgId":49545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjExNDM1OTguMzQ4NjcuQlBNYWlsX2hpZ2hfbm9uY2FycmllckB3ZWIxODYxMDYubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":49544,"nextInTopic":49546,"prevInTime":49544,"nextInTime":49546,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"Mone should be mine. So, mine and yours spaces.","messageBody":"<div id=\"ygrps-yiv-412457962\">Mone should be mine. So, mine and yours spaces.<br/>\n<br/>\n<br/>\n------------------------------<br/>\n<blockquote><span title=\"qreply\"> On Sun, Feb 17, 2013 11:24 PM GMT Schuyler wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;It reads as though you have separated the house into mone and yours spaces. I would rethink that. You have three children and you seem to think you are entitled to spaces that remain sacrosanct, like ye olde parlour. I can see keeping a small room as a space all your own, but a main room in your house, well, I&#39;m not sure how easily that expectation will sit with unschooling.<br/>\n&gt;<br/>\n&gt;It reads as though you need to be with your children more. Simply giving them spaces to play and things to play with isn&#39;t unschooling. Be with them. Let go of the idea of a super clean house and instead embrace the idea of engaging with your children. If you are in their playroom you can tidy it as you, and they, go. And, maybe, the more you learn to enjoy being in their space, the less you will feel a need to have separate spaces.<br/>\n&gt;<br/>\n&gt;Schuyler<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361143456","msgId":49544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjExNDM0NTYuMjY4NTguQlBNYWlsX2hpZ2hfbm9uY2FycmllckB3ZWIxODYxMDUubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":49543,"nextInTopic":49545,"prevInTime":49543,"nextInTime":49545,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"It reads as though you have separated the house into mone and yours spaces. I would rethink that. You have three children and you seem to think you are","messageBody":"<div id=\"ygrps-yiv-594633047\">It reads as though you have separated the house into mone and yours spaces. I would rethink that. You have three children and you seem to think you are entitled to spaces that remain sacrosanct, like ye olde parlour. I can see keeping a small room as a space all your own, but a main room in your house, well, I&#39;m not sure how easily that expectation will sit with unschooling.<br/>\n<br/>\nIt reads as though you need to be with your children more. Simply giving them spaces to play and things to play with isn&#39;t unschooling. Be with them. Let go of the idea of a super clean house and instead embrace the idea of engaging with your children. If you are in their playroom you can tidy it as you, and they, go. And, maybe, the more you learn to enjoy being in their space, the less you will feel a need to have separate spaces.<br/>\n<br/>\nSchuyler</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361142716","msgId":49543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjExNDI3MTYuMzk3MzQuQlBNYWlsX2hpZ2hfbm9uY2FycmllckB3ZWIxODYxMDUubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":49542,"nextInTopic":49544,"prevInTime":49542,"nextInTime":49544,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"You wrote it makes me have to about the overflow.  Nothing makes you have to yell. Nothing makes you have to threaten. You are letting it build up so much","messageBody":"<div id=\"ygrps-yiv-376698160\">You wrote &quot;it makes me have to&quot; about the overflow.  Nothing makes you have to yell. Nothing makes you have to threaten. You are letting it build up so much both in this large room and in your mind that it feels like your only response is a full-fledged meltdown. <br/>\n<br/>\nCome up with more than one option. When the mess has spilled over, come up with something other than yelling and threatening as an option. And pick the better choice. So, for example, overflowing mess, I could yell, ineffectually, at my children, or I could ask for help and pick up the things that have spilled out and over. Then the next time, maybe, even before the next time, you could make a tour of the dining room/playroom and quickly tidy up the things most likely to spill out and over. Maybe there will come a point when the to choices that you put forward don&#39;t even give yelling a moments thought.<br/>\n<br/>\n6 and 4 are very young. Too young to enter into contracts. Too young to expect to be able to manage their things. You are much older and are struggling under the weight of your own things. It may help to remember that.<br/>\n<br/>\nSchuyler</div>","specialLinks":[]},{"userId":283914803,"authorName":"jo kirby","from":"jo kirby &lt;jokirby2004@...&gt;","profile":"jokirby2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361137627","msgId":49546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjExMzc2MjcuMzI4MjMuWWFob29NYWlsTmVvQHdlYjE3MTMwMi5tYWlsLmlyMi55YWhvby5jb20+","inReplyToHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg==","referencesHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg=="},"prevInTopic":49545,"nextInTopic":49547,"prevInTime":49545,"nextInTime":49547,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"Hi Kimberly, I think you might be mixing more than one fear here - and creating a BIG mother-fear to panic yourself with! Sorting them out from each other","messageBody":"<div id=\"ygrps-yiv-722795102\">Hi Kimberly,<br/>\n<br/>\nI think you might be mixing more than one fear here - and creating a BIG mother-fear to panic yourself with! Sorting them out from each other might help you to feel less scared, and then hopefully, less angry, and put-upon.<br/>\n<br/>\n&quot;My mom is a hoarder, and I have that same tendency. I am constantly fighting my own battle with clutter and Stuff.&quot;<br/>\n<br/>\nAm I understanding correctly that your mom has collected so much stuff in her lifetime that now she can&#39;t fit friends into her house? I think sometime&#39;s it&#39;s easy for us women to worry about turning into our moms/mums in some way we don&#39;t like! But sit calmly and think... are you really going to let that happen to you long term? It doesn&#39;t sound like it. It sounds like you&#39;ve assessed her situation and it&#39;s the last thing you want!, so be happy and really Know that. You are extremely unlikely to end up living your fear because at some point not-too-far-away you will regain a feeling of control over your house and you will be able to choose: some clutter but not so much clutter that it feels uncomfortable for you like your mom&#39;s place does. Don&#39;t fight. You aren&#39;t going to somehow morph into being your mother if you continue to stay self aware and make conscious choices.<br/>\n<br/>\n&quot;I really can&#39;t get my head around the idea that it&#39;s my job to clean up their mess in our living room. Really?! It just starts to feel..... abusive.... martyrizing..... something really ugly.&quot;<br/>\n<br/>\nIt can also be easy to get into a state of fear about being put-upon, or taken for granted. I think, we do sometimes want to watch out for this when it&#39;s coming from another adult (which is rare by the way, usually it&#39;s our fear again, causing our imagination to see something which isn&#39;t there or isn&#39;t intended...). But with young children, I think we can turn it on it&#39;s head. We can aim to BE taken for granted. We can see that it means our children know we are there for them, and that&#39;s a good thing. I don&#39;t believe our young children are thinking &quot;let&#39;s take advantage of mommy&quot; or &quot;let&#39;s spread our stuff around the house as a way to get mom to sort the playroom for us&quot;. They appreciate it when you do it, but that&#39;s because it feels great and now they can discover their toys again, it doesn&#39;t mean they were trying to get you to do it, or demanding that you do it, or seeing you as some kind of slave. What they may (or may not) have taken for granted is<br/>\n you being nice to them, and that can feel like a jolly good &#39;granted&#39; to be &#39;taken&#39; for!<br/>\n<br/>\n&quot;I don&#39;t want to clean up their play room for them all the time&quot;<br/>\n<br/>\nCan you think of it as all of your&#39;s playroom, not just theirs? If it doesn&#39;t feel like it&#39;s yours too, why not? Do you play in there with them sometimes?, If not, perhaps you will feel more connected to straightening it out if you feel more involved with the space? Are you treating it like you&#39;re expected to tidy someone else&#39;s office when they refuse to clean it themselves - I could see how that could lead you to feel taken for granted. Go and share the office, and you might start to love keeping it straight.<br/>\n<br/>\nCan you see that you have a choice when and how you tidy, or indeed if you tidy at all (but you&#39;ve already made the choice that you don&#39;t want to be like your mother, and you&#39;ve already made the choice that your relationship with your boys is more important than forcing them to tidy - so you just need to find a way to do it yourself without it feeling bad or resentful). You can do a really quick shove-everything-in-bins type of tidy which will probably take ten minutes once or twice a day, or you can let it build up and then do a big sort out. Or a bit of both. With the big sort out, do it willingly if you are in the mood, otherwise wait until you do genuinely feel like doing it, when it can be a giving, fun thing to do. (When I tidy our playroom I sometimes leave little funny scenarios around for my son to find, or set something up ready to play with that we haven&#39;t had out for a while...)<br/>\n<br/>\n&quot;One thing that I try really really really hard to do is to keep the living room, one room in the entire house, looking clean and neat and uncluttered and presentable. It gives me sanity and calm&quot;<br/>\n<br/>\n<br/>\nAs an introvert I can totally understand this need. I would buy myself a really nice storage truck or large lidded basket that I liked, make room for it in the lounge or just outside, and when I&#39;m ready or feel the need to go and be in an uncluttered space, I would quickly put all the stray toys that were preventing that feeling in the storage truck, to be returned to the playroom later when I get the chance. It would take five minutes max, probably two. Close the lid and I&#39;ve got what I wanted. Got my sanity back :-)<br/>\n<br/>\n&quot;why can&#39;t they just keep their crap in their own space&quot;<br/>\n<br/>\nBecause they&#39;re very young. And don&#39;t call their stuff crap, if you want to feel connected to them fully. Use it instead, to play with them, then it will transform into the stuff precious memories are made of, and you will be sad when they tire of it themselves.<br/>\n<br/>\nJo<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] chores/helping clean up","postDate":"1361131021","msgId":49542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxMDk2RTAxLTJEODMtNEVCRi04QjFBLTIxMDFEMURDQkZEOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg==","referencesHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg=="},"prevInTopic":49541,"nextInTopic":49543,"prevInTime":49541,"nextInTime":49543,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"... Clean it up more often. Do a quick pick up a couple times a day. They re *WAY* too young to expect them to be able to keep the room neat. Put stuff with","messageBody":"<div id=\"ygrps-yiv-1390797267\">On Feb 17, 2013, at 12:39 PM, a3boymommy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When their play room gets overwhelming, if I don&#39;t clean it up for them, it starts to spill over.<br/>\n<br/>\n </span></blockquote>Clean it up more often. Do a quick pick up a couple times a day. They&#39;re *WAY* too young to expect them to be able to keep the room neat. <br/>\n<br/>\nPut stuff with lots of pieces up so they need to ask or put it elsewhere. Reorganize so it won&#39;t get as messy so quickly. Cut back on your own stuff so it doesn&#39;t take so much time.<br/>\n<br/>\nUse big bins to shovel it all into.<br/>\n<br/>\nPut down plastic or a blanket to dump Legos and such onto. Then fold up and pour the pieces into a bin.<br/>\n<br/>\nIt sounds like they&#39;re in the room trashing the place while you&#39;re off cleaning the house. You need to be with them more. Help them not dump out 5 different things. (Though mixing can be inspiring!) But if they&#39;re mixing just because they&#39;re not putting away, be the one to put things away. Ask for very specific help &quot;Hector, can you put the train on the shelf.&quot; But own the problem. Make it yours.<br/>\n<br/>\nIf *you* have too much stuff to keep up with, put it away or get rid of it. Their stuff they&#39;ll need your help taking care of. I didn&#39;t see signs that my daughter could look at a mess and not be overwhelmed until she was 11. Even then it was a few more years before she could tackle a mess. (Now she lives on her own and is good at keeping on top of things before they get out of control.)<br/>\n<br/>\nRight now your priority is your kids. And you&#39;re letting taking care of stuff come between you and your relationship with them. Their stuff is important to them. Imagine having stuff but not being certain it would be there tomorrow because your husband might decide to throw it out. Their sense of peace and security and empowerment is all in your power to give to them or not.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":350533034,"authorName":"a3boymommy","from":"&quot;a3boymommy&quot; &lt;kkissoyan@...&gt;","profile":"a3boymommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"chores/helping clean up","postDate":"1361122773","msgId":49541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmcjRrbCtjb240QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49542,"prevInTime":49540,"nextInTime":49542,"topicId":49541,"numMessagesInTopic":0,"msgSnippet":"Hi all, I know it feels like we ve talked this one to death, but I m still struggling. I think I ve read and absorbed enough about the idea that if I feel like","messageBody":"<div id=\"ygrps-yiv-416048279\">Hi all, <br/>\n<br/>\nI know it feels like we&#39;ve talked this one to death, but I&#39;m still struggling. I think I&#39;ve read and absorbed enough about the idea that if I feel like the house is a mess, that&#39;s my problem, if I want it clean then it&#39;s my job to keep it clean, it&#39;s not the kids&#39; job to maintain my standards of cleanliness, and they&#39;ll certainly never find the joy in a clean house if housework is all strife and yelling and drudgery. I really do get it, and I believe that. <br/>\n<br/>\nBut. <br/>\n<br/>\nI have 3 sons, ages 6, 4.5 & 4.5. My mom is a hoarder, and I have that same tendency. I am constantly fighting my own battle with clutter and Stuff. One thing that I try really really really hard to do is to keep the living room, one room in the entire house, looking clean and neat and uncluttered and presentable. It gives me sanity and calm, and it&#39;s really important to me. The boys have the entire dining room, which is the largest single room in the house, converted into their playroom. They have bins and storage buckets and shelving and everything they need to keep it neat and organized if they want to, and, what, approx. 200 sq. ft. of floor space to spread out on. I do not get on them to keep it clean. The only time I tidy it up for them is when it&#39;s so messy that they can&#39;t play in there any more and yet they don&#39;t want to clean it up (because it&#39;s overwhelming, I get it). They love when I tidy it up for them. But, frankly, I don&#39;t want to do that all the time. I have an entire house to keep clean, and they do not help. Which is fine, but. I don&#39;t want to clean up their play room for them all the time. This is a minor issue, but here&#39;s where it gets to be a problem, from an un-schooling perspective.<br/>\n<br/>\nWhen their play room gets overwhelming, if I don&#39;t clean it up for them, it starts to spill over. And very quickly I turn around and my living room is filled with games, toys, puzzles, puzzle pieces, parts of costumes, tiny lego pieces that slice the bottoms of my feet (GOD I HATE THAT!!!!!). And they still will not help me clean it up. It makes me want to cry. It makes me start threatening to throw it all away. And then my oldest, rightly, will yell at me that I have no right to throw his stuff away. And then I yell that he has no right to make the community space unusable with his stuff when he already has the largest room in the house and no one policing him in there. And..... it&#39;s ugly and angry and I hate it. But I really can&#39;t get my head around the idea that it&#39;s my job to clean up their mess in our living room. Really?! It just starts to feel..... abusive.... martyrizing..... something really ugly. <br/>\n<br/>\nSo. What is this? How do I shed a positive light on this? How do we share space when this is such a volatile emotional trigger for me? (Of course I have deep-seated fears that 30 years from now I&#39;ll be living in a house that I can&#39;t walk around in or have people over b/c of the hoarding..... because that&#39;s my mom right now....). I&#39;m trying not to be reactionary, but..... why can&#39;t they just keep their crap in their own space and let me have one room that looks nice?!?! <br/>\n<br/>\nFWIW, they also have a bedroom and a reading room, both of which I straighten for them, and both of which I generally leave them alone about, but neither of which is a play room so they don&#39;t have a lot of toys or stuff to strew around, so I&#39;m fine with that. <br/>\n<br/>\nThanks. Sorry if this is a bit ranty. I&#39;m just tired of the fight and I&#39;m tired of feeling taken for granted. <br/>\n<br/>\nBest, <br/>\nKimberley</div>","specialLinks":[]}],"prevTopicId":49438,"nextTopicId":9169}}