{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":49,"messages":[{"userId":274933479,"authorName":"lyeping2607","from":"&quot;lyeping2607&quot; &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv  - OT Blog Link","postDate":"1194005638","msgId":27479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnZjRhNis1bG1mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZnZXRvbSszMTRmQGVHcm91cHMuY29tPg=="},"prevInTopic":27478,"nextInTopic":27485,"prevInTime":27478,"nextInTime":27480,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi cpaeff and everyone, Here s my link to my blog, charting my son deschooling via the pS2 and how my thoughts is ever changing as time goes by. As always,","messageBody":"<div id=\"ygrps-yiv-1274979584\">Hi cpaeff and everyone,<br/>\n<br/>\nHere&#39;s my link to my blog, charting my son deschooling via the pS2 and <br/>\nhow my thoughts is ever changing as time goes by. <br/>\n<br/>\nAs always, it&#39;s a log for myself, hence some materials might seem <br/>\nunschooling. This link is offered in good faith, hoping it might <br/>\nprovide some comfort to some of us newbies, during our moments of <br/>\nuncertainties, therefore is not open for any critism, but by all means <br/>\ndo leave me a sweet note of encouragement or 2!  *SMILES* <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mamagecko.blogspot.com/\">http://mamagecko.blogspot.com/</a><br/>\n<br/>\nSharon</div>","specialLinks":[]},{"userId":274933479,"authorName":"lyeping2607","from":"&quot;lyeping2607&quot; &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193998934","msgId":27478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnZXRvbSszMTRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZnZWdtdCtvMTEyQGVHcm91cHMuY29tPg=="},"prevInTopic":27476,"nextInTopic":27479,"prevInTime":27477,"nextInTime":27479,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi cpaeff Glad to be of help! I m never one to shake my head at other people s approach towards thier family. To me, the very fact they are even considering","messageBody":"<div id=\"ygrps-yiv-1715685416\">Hi cpaeff<br/>\n<br/>\nGlad to be of help! I&#39;m never one to &quot;shake my head&quot; at other people&#39;s <br/>\napproach towards thier family. To me, the very fact they are even <br/>\nconsidering unschooling, was enough to convince me that they will get <br/>\nthere eventually. Same philosophy applies to my son. My family call me <br/>\na &quot;push over&quot;, to me it&#39;s &quot;whatever!&quot; LOL! <br/>\n<br/>\nIt seems to me you&#39;ve found your &quot;balance&quot;, for now.  <br/>\n<br/>\n<br/>\nSharon</div>","specialLinks":[]},{"userId":300893042,"authorName":"cpaeff","from":"&quot;cpaeff&quot; &lt;cpaeff@...&gt;","profile":"cpaeff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193986625","msgId":27476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnZWhvMStlcG1tQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU0ODc0QjNELTFCMjItNDVENS05MDBDLTRBNzU5NTAxQzk5M0Bjb3gubmV0Pg=="},"prevInTopic":27475,"nextInTopic":27478,"prevInTime":27475,"nextInTime":27477,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Beating those games is pretty important to him, and by distracting him, I m not only not honoring that need, but I m actually prolonging the time it takes to","messageBody":"<div id=\"ygrps-yiv-1619903381\">&quot;Beating those games is pretty important to him, and by distracting him, I&#39;m not only not <br/>\nhonoring that need, but I&#39;m actually prolonging the time it takes to process and get to a <br/>\nstopping point.&quot; -Melissa<br/>\n<br/>\nThank you Melissa. I really appreciate your response. You&#39;re so right about needing to honor <br/>\nwhat&#39;s important to my son. I hate to say it, but this is a relatively new idea for me and it just <br/>\nhasn&#39;t stuck yet. I&#39;m much better about it now than I was even a few months ago, but I still <br/>\nhave a long way to go, I think.</div>","specialLinks":[]},{"userId":300893042,"authorName":"cpaeff","from":"&quot;cpaeff&quot; &lt;cpaeff@...&gt;","profile":"cpaeff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193985564","msgId":27475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnZWdtdCtvMTEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcyNTQ5My45MzYyMi5xbUB3ZWIyNzMwOS5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":27474,"nextInTopic":27476,"prevInTime":27474,"nextInTime":27476,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi Sharon. Thank you for sending such a detailed response! It does help to hear what you have to say. As I wrote in another reply, we re trying out some new","messageBody":"<div id=\"ygrps-yiv-6461790\">Hi Sharon. Thank you for sending such a detailed response! It does help to hear what you <br/>\nhave to say. As I wrote in another reply, we&#39;re trying out some new ways of dealing with <br/>\nthe situation--a compromise. I know you&#39;re probably shaking your head! But since my <br/>\nhusband is against the video games, and I&#39;ve got my own reservations (okay, judgements) <br/>\nabout them I&#39;ve been finding it very difficult to let the situation play out on its own. Our <br/>\ncompromise breaks the day into a half with video games and a half without. It&#39;s more of a <br/>\nguide than a hard and fast rule but my son told me the other day that he likes it--<br/>\nprobably because I&#39;m not nearly as grouchy now. :) We&#39;ll see how it works. I certainly do <br/>\nappreciate your wisdom, though! I&#39;m sure I&#39;ll come back to read through your response <br/>\nand others many times as I make my way through this first year of unschooling. Thanks <br/>\nagain!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, sharon currie &lt;lyeping2607@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Colleen,<br/>\n&gt;    <br/>\n&gt;   I know you meant the questions for Melissa, but I would like to offer my experience as <br/>\nI can remember when we first started de-schooling and unschooling. I was very worried, <br/>\njust like you.  <br/>\n&gt;    <br/>\n&gt;   1. I&#39;m wondering if your son just stopped playing one day or if he started finding <br/>\n&gt; other things interesting in addition to playing video games. <br/>\n&gt;    <br/>\n&gt;   One morning, my son&#39;s decided he wasn&#39;t gonna switch on the PS2 and play Star Wars <br/>\nLego , as he has done 6 months ago!  Instead, he switch the tv on, and watch Looney <br/>\nToons and has done so for about 6 weeks. Then he went back to the PS2, only this time <br/>\nit&#39;s the Simpson game. He stuck with the Simpsons for 3 months. And then went onto <br/>\nGrand Theft Auto for 7 weeks. And then went onto the Disney Town Town  Online <br/>\ncommunity game, and has been stuck with this ever since (it&#39;s been 5 weeks).   <br/>\n&gt;    <br/>\n&gt;   2. Does he still play them now and then? <br/>\n&gt;   In my son&#39;s case, no. Once he had enough of the game, he just move onto the next. <br/>\nThe tv merely only serve as an &quot;in between&quot; entertainment until he finds another exciting <br/>\nPS2 or pc game. The moment he starts flitting between tv and PS2 or pc, I know the <br/>\n&quot;favourite game&quot; is wearing off. <br/>\n&gt;    <br/>\n&gt;   3. Did you offer him other alternatives or did you just let him be? <br/>\n&gt; Yes, I do offer alot of alternative, all the time. I have to, in order to &quot;dilute&quot; down the <br/>\ngaming time. I have no problem with his obsession with the PS2 or pc, but I need him to <br/>\ntake little breaks, and I&#39;ll do anything to get him away from those gaming media.  So I <br/>\nentice him with lots of stuff, like going to his favourite sandpit at the nearby park, walking <br/>\nto the neighbourhood supermart to buy his favourite iced-bun, or sometimes even offer to <br/>\ntake him window shopping at  Toys&#39;r&#39; US. Or go to the local library to check out some new <br/>\ngames for his PS2. But really, if it&#39;s at the beginning of a new game/ &quot;obsession&quot; none of <br/>\nthese alternative offered will work. Of which, my only option is to sit and be with him <br/>\nbecause my son has a need to &quot;initiate me&quot; into his new game. I join in the games <br/>\nsometime, but mostly, will do my emails or catch up with my reading sitting next to him  <br/>\ninorder to keep up with his game status, so that we can always have something to talk <br/>\nabout!   <br/>\n&gt;    <br/>\n&gt;    4. I honestly don&#39;t think I can take nine months of letting him play video games or be <br/>\nat the <br/>\n&gt; computer whenever he wants to. This is week seven and I&#39;m about to crack! I&#39;m <br/>\n&gt; doing my best not to judge, and I know he&#39;s learning something but it&#39;s tough.<br/>\n&gt;    <br/>\n&gt;   I know it&#39;s hard but if you stop resisting it, just go with the flow, you&#39;ll find it easier. <br/>\nLike you said, you know he&#39;s learning, and I agree it&#39;s is tough to accept, not knowing <br/>\nwhat it is exaclty he&#39;s learning, but if you take a step back and think &quot;What&#39;s the worst <br/>\nthing that can happen if you allow him to just do what he wants for 10 months?&quot;  When my <br/>\nson de-school with his PS2, I just accept that whatever that is, that he is needing it and it <br/>\nis obviously non-tangible, and not me mummy but only the PS2 can provide it, so be it. <br/>\nCan you view these 9 months like a long sabbatical from school? Like going on a long <br/>\njourney, perhaps a journey to discover oneself? I did literally had to stop thinking like <br/>\nmummy, but reach out into my inner child again, and think like one. It was the only way <br/>\nhow my brain can make sense out of all these de-schooling thing.  I did tell myself &quot;so <br/>\nwhat if we were to be playing PS2 or pc games or watch tv for a whole year? Wouldn&#39;t it be<br/>\n&gt;  interesting to see what the results will be after a whole year of gaming?&quot;  I told myself I <br/>\nhave 3 years till my son turn 10, and if he&#39;s unable to count, then I have every cause to <br/>\nstart panicking! &quot;  <br/>\n&gt;    <br/>\n&gt;   Judge and make a decision I did. I do believe because of my son&#39;s Asperger, he&#39;s <br/>\nunable to switch off. My son just do not have the capability to slow down even if he&#39;s too <br/>\ntired to go on  (and before anyone jump at me, pls do bear in mind this is my kid, and I do <br/>\nknow my child very well and only wants the best for him). How do I know he&#39;s tired? Well, <br/>\nif my kid get up from his bed and he&#39;s standing wobbly all over with his eyes still shut, <br/>\nthen he must be too tired to play! Many times, at my insistance that he gets back to bed, <br/>\nwhich he did and fall back asleep within seconds!<br/>\n&gt;    <br/>\n&gt;   Hence, as much as I try not to force him to do anything,  I do insist that he stop and <br/>\ntake a break every so often. He&#39;s to decide when to take that break. Because if he&#39;s been <br/>\nspending too long hours on the pc or PS2 ( kinda like morning till night, 3 days in a row) <br/>\nand he&#39;ll start getting frustrated with the machine because he&#39;s losing concentration,  and <br/>\nmaking lots of mistakes during the game, blaming the machine for all his mistakes, and <br/>\nhis eyes&#39; blinking non-stop (tired eyes) and headaches, I do insist on cutting down on his <br/>\ngaming time. <br/>\n&gt;    <br/>\n&gt;   If it&#39;s any consolation, 11 months on, my son is still never far from his tv, PS2 and pc. <br/>\nHe&#39;s learnt his add and fraction thru his PS2 games and he did have many opportunity to <br/>\npractise reading all those games instructions. His current obsession with the Disney <br/>\nToonwTown is further encouraging lots of reading practice (instructions) and learning new <br/>\nwords, and counting (number of jellybeans needed to buy ammunitions).  <br/>\n&gt;    <br/>\n&gt;   I truly believe a child&#39;s strong interest in the gamebox and pc can be utilized for <br/>\neffective learning. My kid buys his own gaming magazines too, once a month. This way, he <br/>\ngets to know what sort of latest games that he likes, and we have lots of chats about <br/>\nwhich game is the bestest, and why. He then decide to &quot;allocate (division?) &quot; his pocket <br/>\nmoney between new game and new toy. His spelling is coming along nicely too, as one will <br/>\nneed to be able to spell, if one wants to &quot;google&quot; it.  <br/>\n&gt; <br/>\n&gt;   Hope my little account can help you see pass your fear. <br/>\n&gt;    <br/>\n&gt;   Sharon<br/>\n&gt; <br/>\n&gt;        <br/>\n&gt; ---------------------------------<br/>\n&gt;  Yahoo! Answers - Get better answers from someone who knows. Tryit now.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":300893042,"authorName":"cpaeff","from":"&quot;cpaeff&quot; &lt;cpaeff@...&gt;","profile":"cpaeff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193984773","msgId":27473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnZWZ1NSsxNWhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzJGQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27360,"nextInTopic":27474,"prevInTime":27472,"nextInTime":27474,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Thanks Deb. Those are helpful suggestions. I m usually nearby doing my own thing. Sometimes we re both at the kitchen table on our separate laptops--it doesn t","messageBody":"<div id=\"ygrps-yiv-1195326906\">Thanks Deb. Those are helpful suggestions. I&#39;m usually nearby doing my own thing. <br/>\nSometimes we&#39;re both at the kitchen table on our separate laptops--it doesn&#39;t really <br/>\nbother me at those moments. What&#39;s funny is that since I&#39;ve started my blog (it&#39;s at http://<br/>\nthenewunschooler.blogspot.com/ ) I&#39;ve spent a lot more time on the computer, but I&#39;m <br/>\nlearning so much! So I know my son&#39;s learning too, which makes it a bit easier for me to <br/>\ntake. :) <br/>\n<br/>\nWe did create a compromise, though. He&#39;s not playing video games until after 4 p.m. I <br/>\nknow this will probably hold back our deschooling process and make it take longer, but <br/>\nmy husband is really against the unlimited video games. Also, I was finding that I was so <br/>\ngrouchy on days when my son had been at the tv or on the computer all day. I&#39;m much <br/>\nmore pleasant to be around now that we&#39;ve divided the day up into two halves--one with <br/>\nvideo games and one (mostly) without. It&#39;s not very unschoolish of me but I wasn&#39;t feeling <br/>\nright about disregarding my husband&#39;s feelings, and my own emotions were all over the <br/>\nplace because I just didn&#39;t feel good about the whole thing.<br/>\n<br/>\nI&#39;m sure things will continue to change as we adjust to our new lives and our new way of <br/>\nthinking. It&#39;s really helpful to have experienced people like you offering advice and <br/>\ncheering me on. :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;This is week seven and I&#39;m about to crack! <br/>\n&gt;  <br/>\n&gt; What are -you- doing while he&#39;s playing/watching (aside from counting<br/>\n&gt; the days on the calendar lol)? Seriously, are you mostly doing the<br/>\n&gt; dishes and hovering and worrying or are you using this time to explore<br/>\n&gt; YOUR interests, try a new knitting pattern you&#39;ve been meaning to get<br/>\n&gt; around to, or digging into that wood burning kit you&#39;ve had laying<br/>\n&gt; around, or whatever. November is just around the corner, so if you&#39;re so<br/>\n&gt; inclined, you might try National Novel Writers Month (NaNoWriMo) - you<br/>\n&gt; try to write an entire novel start to end in one month (google it and<br/>\n&gt; you&#39;ll find the website with more information). <br/>\n&gt;  <br/>\n&gt; Deb <br/>\n&gt; <br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; CNC Software, Inc.<br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":300893042,"authorName":"cpaeff","from":"&quot;cpaeff&quot; &lt;cpaeff@...&gt;","profile":"cpaeff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193983307","msgId":27474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnZWVnYit2bDRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIxOTM0NS45Mjc2OC5xbUB3ZWI2MzcxMS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":27473,"nextInTopic":27475,"prevInTime":27473,"nextInTime":27475,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Thanks Donna. It does help to read these posts. They make me question my reaction to the video games/computer use, rather than go with a gut feeling that I","messageBody":"<div id=\"ygrps-yiv-580411589\">Thanks Donna. It does help to read these posts. They make me question my reaction to <br/>\nthe video games/computer use, rather than go with a gut feeling that I haven&#39;t really <br/>\nthought through. And I think the advice about jumping in and playing the games with him <br/>\nis terrific. My son LOVES it when I get involved. He&#39;s created a Face Book page for me and <br/>\nsigned me up for Dragon Quest--sharing those things makes him really happy. I don&#39;t <br/>\nthink I play them nearly enough to satisfy him, though! <br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Donna Vanderlip &lt;donnavanderlip@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi Colleen<br/>\n&gt;    <br/>\n&gt;   I am in a similar place.  Its about week 10 for us and it is tough.  But, keep in touch <br/>\n </span></blockquote>with these posts.  I am amazed at the perspective parents have here and the support is <br/>\ninvaluable.  Whenever I feel myself slipping into worry and control I get on line and read.  <br/>\nThen I go back to my kids and see their activity with the computer from a new place.  I feel <br/>\nmore supportive and respectful of the choices they are making.  It is hard not to question <br/>\nthe number of hours my son plays games on the computer and I am not sure how much <br/>\nguidance to give him around balance etc.  But, I keep leaning towards freedom, respect <br/>\nand honoring his need to play these games.  I am in the process of letting go of the idea <br/>\nthat after a certain point he will stop.  Perhaps that is what makes us crazy.  <br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   donna  a new to unschooling mom<br/>\n&gt; cpaeff &lt;cpaeff@...&gt; wrote:<br/>\n&gt;           I&#39;m going through the exact same thing with my 12-year-old son, Robbin. I took <br/>\n </span></blockquote>him out <br/>\n<blockquote><span title=\"ireply\"> &gt; of a Waldorf school at the end of fifth grade, so the whole letting him have his way with <br/>\n&gt; video games and computers is really new for us. It&#39;s a struggle because I&#39;m still not <br/>\n&gt; convinced that he doesn&#39;t need some guidance in that area but I&#39;m really trying to let <br/>\n </span></blockquote>him <br/>\n<blockquote><span title=\"ireply\"> &gt; find his own way. My husband is not exactly on board so that doesn&#39;t help.<br/>\n&gt; <br/>\n&gt; Melissa, I&#39;m wondering if your son just stopped playing one day or if he started finding <br/>\n&gt; other things interesting in addition to playing video games. Does he still play them now <br/>\n&gt; and then? Did you offer him other alternatives or did you just let him be? <br/>\n&gt; <br/>\n&gt; I honestly don&#39;t think I can take nine months of letting him play video games or be at <br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"qreply\"> &gt; computer whenever he wants to. This is week seven and I&#39;m about to crack! I&#39;m <br/>\n&gt; doing my best not to judge, and I know he&#39;s learning something but it&#39;s tough.<br/>\n&gt; <br/>\n&gt; Colleen<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://thenewunschooler.blogspot.com/\">http://thenewunschooler.blogspot.com/</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;                          <br/>\n&gt; <br/>\n&gt;        <br/>\n&gt; ---------------------------------<br/>\n&gt; All new Yahoo! Mail  <br/>\n&gt; ---------------------------------<br/>\n&gt; Get news delivered. Enjoy RSS feeds right on your Mail page.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":304632297,"authorName":"Donna Vanderlip","from":"Donna Vanderlip &lt;donnavanderlip@...&gt;","profile":"donnavanderlip","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: newbie needing encouragement re:tv","postDate":"1193433382","msgId":27360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxOTM0NS45Mjc2OC5xbUB3ZWI2MzcxMS5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PGZmajNxYitwNGFvQGVHcm91cHMuY29tPg=="},"prevInTopic":27326,"nextInTopic":27473,"prevInTime":27359,"nextInTime":27361,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi Colleen I am in a similar place.  Its about week 10 for us and it is tough.  But, keep in touch with these posts.  I am amazed at the perspective parents","messageBody":"<div id=\"ygrps-yiv-1151390517\">Hi Colleen<br/>\n   <br/>\n  I am in a similar place.  Its about week 10 for us and it is tough.  But, keep in touch with these posts.  I am amazed at the perspective parents have here and the support is invaluable.  Whenever I feel myself slipping into worry and control I get on line and read.  Then I go back to my kids and see their activity with the computer from a new place.  I feel more supportive and respectful of the choices they are making.  It is hard not to question the number of hours my son plays games on the computer and I am not sure how much guidance to give him around balance etc.  But, I keep leaning towards freedom, respect and honoring his need to play these games.  I am in the process of letting go of the idea that after a certain point he will stop.  Perhaps that is what makes us crazy.  <br/>\n   <br/>\n  donna  a new to unschooling mom<br/>\ncpaeff &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cpaeff@...\">cpaeff@...</a>&gt; wrote:<br/>\n          I&#39;m going through the exact same thing with my 12-year-old son, Robbin. I took him out <br/>\nof a Waldorf school at the end of fifth grade, so the whole letting him have his way with <br/>\nvideo games and computers is really new for us. It&#39;s a struggle because I&#39;m still not <br/>\nconvinced that he doesn&#39;t need some guidance in that area but I&#39;m really trying to let him <br/>\nfind his own way. My husband is not exactly on board so that doesn&#39;t help.<br/>\n<br/>\nMelissa, I&#39;m wondering if your son just stopped playing one day or if he started finding <br/>\nother things interesting in addition to playing video games. Does he still play them now <br/>\nand then? Did you offer him other alternatives or did you just let him be? <br/>\n<br/>\nI honestly don&#39;t think I can take nine months of letting him play video games or be at the <br/>\ncomputer whenever he wants to. This is week seven and I&#39;m about to crack! I&#39;m <br/>\ndoing my best not to judge, and I know he&#39;s learning something but it&#39;s tough.<br/>\n<br/>\nColleen<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thenewunschooler.blogspot.com/\">http://thenewunschooler.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nAll new Yahoo! Mail  <br/>\n---------------------------------<br/>\nGet news delivered. Enjoy RSS feeds right on your Mail page.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193318502","msgId":27326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzQzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27319,"nextInTopic":27360,"prevInTime":27325,"nextInTime":27327,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Does your TV have a place for a headphone to plug in? Also, sometimes we ll turn on the closed captioning on the TV so that it s possible to follow the","messageBody":"<div id=\"ygrps-yiv-163116321\">Does your TV have a place for a headphone to plug in? Also, sometimes<br/>\nwe&#39;ll turn on the closed captioning on the TV so that it&#39;s possible to<br/>\nfollow the storyline while other things are going on around (for<br/>\nexample, if I&#39;m on the treadmill and I want to also watch TV, I use the<br/>\ncaptioning so I don&#39;t have to blast the TV volume).<br/>\n <br/>\nDeb<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paper MArio WAS:: newbie needing encouragement re:tv","postDate":"1193286457","msgId":27319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBERTI1OEI5LTY4MEMtNDJCNy1BMThGLTJFNDBDMTlDMENFNkBjb3gubmV0Pg==","inReplyToHeader":"PDgzMzgyMS4yOTk1OC5xbUB3ZWI4MTUxMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDgzMzgyMS4yOTk1OC5xbUB3ZWI4MTUxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":27313,"nextInTopic":27326,"prevInTime":27318,"nextInTime":27320,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"ROTFL...I asked Josh to do one for me (king flower?) anyway, he just sighed and said Mom, you give yourself way less credit than you deserve! Oh, how","messageBody":"<div id=\"ygrps-yiv-241505865\">ROTFL...I asked Josh to do one for me (king flower?) anyway, he just  <br/>\nsighed and said &quot;Mom, you give yourself way less credit than you  <br/>\ndeserve!&quot; Oh, how sweet....now beat the flower dangit!<br/>\n<br/>\nI did do it though! I am having a blast, and I keep thinking about  <br/>\nall the stuff you told me about your dad and advertising.<br/>\nIt is a great game, it reminds me of when someone on this list  <br/>\nsuggested the Animal Crossing. We were all over that for months! We  <br/>\ndidn&#39;t play for a year, now the kids have torn down their town and  <br/>\nstarted new characters. it&#39;s so amazing!<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (8), Rachel (7), Sam (6), Dan  <br/>\n(4), and Avari Rose (19 months)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 24, 2007, at 9:38 PM, BRIAN POLIKOWSKY wrote:<br/>\n<br/>\n&gt; LOL Melissa,<br/>\n&gt; You are doing way better than me! I had MD do all my boss fights !!! <br/>\n&gt; &lt;g&gt;<br/>\n&gt; Isn&#39;t it a great game! And the love story and all the different  <br/>\n&gt; worlds!<br/>\n&gt; I love the game!<br/>\n&gt; Happy you are all having a blast!<br/>\n&gt; And just for the record I am not a good sport! I get really intense  <br/>\n&gt; playing.<br/>\n&gt; Wonder where ds get his intensity wwwwwwwwwwwwwwwwwwhen he is  <br/>\n&gt; playing from?LOL<br/>\n&gt; Alex<br/>\n&gt;<br/>\n&gt; PS YOu all need to come visit the farm. I got plenty room and bed  <br/>\n&gt; for everyone!)<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paper MArio WAS:: newbie needing encouragement re:tv","postDate":"1193279936","msgId":27313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzMzgyMS4yOTk1OC5xbUB3ZWI4MTUxMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDg4NUZFQTRGLTMxQ0QtNDQwOC1CQjM3LUNGODg0OENEQ0VFRUBjb3gubmV0Pg=="},"prevInTopic":27312,"nextInTopic":27319,"prevInTime":27312,"nextInTime":27314,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"LOL Melissa, You are doing way better than me! I had MD do all my boss fights !!! Isn t it a great game! And the love story and all the different worlds! I","messageBody":"<div id=\"ygrps-yiv-327009050\">LOL Melissa,<br/>\n  You are doing way better than me! I had MD do all my boss fights !!!&lt;g&gt;<br/>\n  Isn&#39;t it a great game! And the love story and all the different worlds!<br/>\n  I love the game!<br/>\n  Happy you are all having a blast!<br/>\n  And just for the record I am not a good sport! I get really intense playing.<br/>\n  Wonder where ds get his intensity wwwwwwwwwwwwwwwwwwhen he is playing from?LOL<br/>\n  Alex<br/>\n<br/>\nPS YOu all need to come visit the farm. I got plenty room and bed for everyone!)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":10665673,"authorName":"pattywithawhy@aol.com","from":"pattywithawhy@...","profile":"pattywithawhy1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193273356","msgId":27312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5My4xN2RlNTU1OS4zNDUxNDIwY0Bhb2wuY29tPg=="},"prevInTopic":27304,"nextInTopic":27313,"prevInTime":27311,"nextInTime":27313,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":" I think","messageBody":"<div id=\"ygrps-yiv-1134727223\">&lt;&lt;Another aspect of cracking is that I see all the wonderful things he is <br/>\nmissing - the fun times he <br/>\ncould have with friends, outdoors, reading, etc&gt;&gt;<br/>\n<br/>\nI think the things you&#39;re imagining he&#39;s missing out on are things that <br/>\nyou&#39;ve enjoyed.  If he was made to do those things instead of playing video games, <br/>\nhe&#39;d be seeing all the wonderful things *he&#39;d* be missing out on, namely, the <br/>\ngames, and the knowledge and experience that would allow him to connect with <br/>\nother kids over it.  Whatever it is, if he knows what it is and he&#39;s really not <br/>\nchoosing it, how wonderful can it be?<br/>\n<br/>\nHas anyone gone back and tried to get your kids to play games you played and <br/>\nenjoyed as a kid, like &quot;Life&quot; or &quot;Monopoly?&quot;  You know what I&#39;ve discovered, <br/>\nfor me anyway, they&#39;re really not that great.  I just associate them with the <br/>\nmemory of being a kid and spending time with my parents, and they *seem* like <br/>\nthey were really fun.  My kids tend to think that such games are so simple <br/>\nthey&#39;re &quot;lame.&quot;<br/>\n<br/>\nI think another thing to keep in mind about video games is the kind of <br/>\nthinking they require.  Lately I&#39;ve been coming across a lot of articles talking <br/>\nabout how schools aren&#39;t preparing kids for the digital age, because they&#39;re <br/>\nstill working off an old model of memorizing information, which has become <br/>\noutdated now that information is readily available and constantly changing.  What&#39;s <br/>\nbecoming and will continue to become more important in the future is the <br/>\nability to think, figure things out, and discern which information is important and <br/>\nreliable and which isn&#39;t.  That&#39;s more of the kind of education kids are <br/>\nactually getting from using the computer and gaming. <br/>\n<br/>\nAnd I&#39;ve also found that a lot of what&#39;s considered culturally relevant and <br/>\nimportant-to-know information seems to easily be picked up over the years <br/>\nthrough authentic conversation about anything any of us finds interesting, along <br/>\nwith a steady diet of television.  :-)<br/>\n <br/>\nBut for what it&#39;s worth, right now my 11yo always-unschooled daughter is <br/>\nsitting in front of the tv reading a book.<br/>\n<br/>\n<br/>\nPatty<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: newbie needing encouragement re:tv","postDate":"1193254960","msgId":27302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4NUZFQTRGLTMxQ0QtNDQwOC1CQjM3LUNGODg0OENEQ0VFRUBjb3gubmV0Pg==","inReplyToHeader":"PDIzNTIyMC41MjUzLnFtQHdlYjgxNTE1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIzNTIyMC41MjUzLnFtQHdlYjgxNTE1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":27300,"nextInTopic":27303,"prevInTime":27301,"nextInTime":27303,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Alex, YOU are the one who told me all about how wonderful Paper Mario was when we were at conference! We sat in the video game room and talk about your cows","messageBody":"<div id=\"ygrps-yiv-835185517\">Alex,<br/>\nYOU are the one who told me all about how wonderful Paper Mario was  <br/>\nwhen we were at conference! We sat in the video game room and talk  <br/>\nabout your cows too ;-)<br/>\nSoon after conference we got back home, and Josh&#39;s friend was selling  <br/>\nit for half of what it cost in the store, so we bought it up! It has  <br/>\nbeen so wonderful, the whole family sitting around talking about  <br/>\nstrategy and storyline. The kids are very supportive of me (and I  <br/>\nmust admit, I&#39;ve been a bad sport at times. Who wants to be the  <br/>\nworst??) It&#39;s so funny though, the kids laughing at my grumpy face as  <br/>\nI struggle to beat the boss stages...and I&#39;ve had to learn to laugh  <br/>\nand let it go too. What a lesson...how many times have I told them,  <br/>\n&quot;It&#39;s only a game, don&#39;t take it so serious?&quot; I&#39;ve gotten better  <br/>\nabout it since unschooling, but boy, I&#39;ve definitely internalized  <br/>\nthat in the past few weeks! I think I&#39;m at level 9...so wish me luck.<br/>\n<br/>\nI did amaze the kids with my ease at beating Brobot the second time lol!<br/>\n<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (8), Rachel (7), Sam (6), Dan  <br/>\n(4), and Avari Rose (19 months)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 24, 2007, at 11:26 AM, BRIAN POLIKOWSKY wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; LOL Melissa ! Looks like our house! I already beat Paper Mario I  <br/>\n&gt; just got to do the two Pit of 100 Trials to be happy now.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":10665673,"authorName":"pattywithawhy1","from":"&quot;pattywithawhy1&quot; &lt;pattywithawhy@...&gt;","profile":"pattywithawhy1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193254705","msgId":27304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmbzZ2aCtxZmh2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmbzJmcitpZmhnQGVHcm91cHMuY29tPg=="},"prevInTopic":27303,"nextInTopic":27312,"prevInTime":27303,"nextInTime":27305,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"...  wrote:  with too much of the gamebox or pc., considering that the","messageBody":"<div id=\"ygrps-yiv-1795916318\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lyeping2607&quot; <br/>\n&lt;lyeping2607@...&gt; wrote:<br/>\n<br/>\n&lt;&lt; I have to say even with this unique experience of growing up <br/>\n<blockquote><span title=\"ireply\"> &gt; with the tv, I can still have mixed feelings about my child growing <br/>\n </span></blockquote>up &gt; with too much of the gamebox or pc., considering that the gamabox <br/>\nand pc is probably more effective in teaching that the tv!!!&gt;&gt;<br/>\n<br/>\nIt *is* hard to accept new technologies, especially fun ones, and trust <br/>\nthat real learning is taking place.  Somebody may have the whole story <br/>\nsomewhere, but I&#39;ve heard the same thing happened when books were <br/>\ninvented.<br/>\n<br/>\nI think one of the best remedies for the belief that gaming is mindless <br/>\nis learning to play the games yourself.  I think it also helps remind <br/>\nus of what it feels like to go through the process of have to learn <br/>\nsomething challenging that we don&#39;t think is relevant to our lives.<br/>\n<br/>\nThat said, I&#39;ve tried it, and found most of my son&#39;s favorite games <br/>\nrequire too much patience and perseverence, and now I just watch and <br/>\ntrust him.  ;-)<br/>\n<br/>\nPatty</div>","specialLinks":[]},{"userId":90144972,"authorName":"rpindc04","from":"&quot;rpindc04&quot; &lt;robbin_mp@...&gt;","profile":"rpindc04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193253285","msgId":27303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmbzVqNSs5Ym9lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyMTQ0Ljg4NTQ0LnFtQHdlYjg2MjExLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":27302,"nextInTopic":27304,"prevInTime":27302,"nextInTime":27304,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Thanks to everyone for responding to this note. All of it is good to read. In response: I am learning more and more about his games, mainly Pokemon now. We ","messageBody":"<div id=\"ygrps-yiv-439128739\">Thanks to everyone for responding to this note. All of it is good to <br/>\nread. In response:<br/>\n<br/>\nI am learning more and more about his games, mainly Pokemon now. We <br/>\ntalk about the relative merits of different Pokemon. <br/>\n<br/>\nAbout being &quot;about to crack&quot;, most days, I am fine with the tv. Some <br/>\ndays, I just want a more aesthetically pleasing aural environment. I <br/>\nwas raised in a house where classical music was played much of the <br/>\ntime. Now, to hear the chatter-clatter of tv for hours and hours <br/>\nmakes me both a little agitated, and sad. I miss the beauty. And, I <br/>\ncan hear some of your voices saying, &quot;Do what interests you.&quot; Just <br/>\ntoday, I got the piano tuned and repaired, so I can start playing <br/>\nagain! It is in the same room as the tv, so we&#39;ll have to work out a <br/>\nschedule, which I think is possible. Another aspect of cracking is <br/>\nthat I see all the wonderful things he is missing - the fun times he <br/>\ncould have with friends, outdoors, reading, etc. And, then I try to <br/>\nremind myself that he is doing what he needs to do right now. And, <br/>\nmost times, I really *get* that.<br/>\n<br/>\nI am able to let go, and stay in that place much of the time. And, I <br/>\nsee results, I think. My son realizes that it is a struggle for me, <br/>\nand I think he appreciates that I am really trying in this regard. He <br/>\nis getting easier to talk to and be with, as he is more relaxed. A <br/>\ntrip to Target yesterday was positively enjoyable - which had never <br/>\nhappened before. And, we do get out and do other things - hang with <br/>\nfriends, play soccer, occassionally ride bikes, take a walk. He <br/>\nrecently found a beat-up penney we are dissolving slowly in a bowl of <br/>\nvinegar. Now he is over at a friend&#39;s house researching Somalia as <br/>\npart of an informal homeschooling class another mom put together, and <br/>\nwhich he chose to participate in. I think he is beginning to be <br/>\npretty confident I will not take the tv and Nintendo away.<br/>\n<br/>\nI hope dh can join soon. I am showing him all your responses. He <br/>\nagrees most of the time, but when he can&#39;t come home from work and <br/>\ngrab the remote control away from ds and do what he (dh) wants with <br/>\nit without ds having some strong objection, things deteriorate <br/>\nrapidly. I&#39;m working with dh to treat ds in that moment as he would a <br/>\nneighbor - with that amount of respect and courtesy.<br/>\n<br/>\nThanks so much for all your help.<br/>\n<br/>\n<br/>\nRobbin</div>","specialLinks":[]},{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: newbie needing encouragement re:tv","postDate":"1193250356","msgId":27299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMTQ0Ljg4NTQ0LnFtQHdlYjg2MjExLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":27298,"nextInTopic":27300,"prevInTime":27298,"nextInTime":27300,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"I m going through the exact same thing with my 12-year-old son, Robbin. I took him out of a Waldorf school at the end of fifth grade, so the whole letting him","messageBody":"<div id=\"ygrps-yiv-562360007\">I&#39;m going through the exact same thing with my 12-year-old son, Robbin. I took him out <br/>\nof a Waldorf school at the end of fifth grade, so the whole letting him have his way with <br/>\nvideo games and computers is really new for us. It&#39;s a struggle because I&#39;m still not <br/>\nconvinced that he doesn&#39;t need some guidance in that area but I&#39;m really trying to let him <br/>\nfind his own way. My husband is not exactly on board so that doesn&#39;t help.<br/>\n<br/>\nMelissa, I&#39;m wondering if your son just stopped playing one day or if he started finding <br/>\nother things interesting in addition to playing video games. Does he still play them now <br/>\nand then? Did you offer him other alternatives or did you just let him be? <br/>\n<br/>\nI honestly don&#39;t think I can take nine months of letting him play video games or be at the <br/>\ncomputer whenever he wants to. This is week seven and I&#39;m about to crack! I&#39;m <br/>\ndoing my best not to judge, and I know he&#39;s learning something but it&#39;s tough.<br/>\n<br/>\n--------------<br/>\nI don&#39;t think waiting for it to change will help. I think changing your perspective is the only thing that can make it better. Sit and watch him play. Hang out and play with him, if he is willing to help you figure your way through the steep learning curve. Talk to him about what kind of games he thinks you might like. There are a lot of amazing games out there. Animal Crossing is nice introduction, gentle play, not competitive, lots of taking care of things, but it&#39;s only on Nintendo, so will only work if you have a Wii or a gamecube. Harvest Moon is a similar game style (I&#39;m playing Rune Factory which is a fantasy version of Harvest Moon, it helps me to fall asleep at night) except you are a farmer instead of a resident of a city. Runescape is a fun rpg style on-line game that is easy to get into. It&#39;s free and if you have more than one computer you and your son can create characters and play together. If you have a PS2 Katamari and Katamari Damacy are<br/>\n amazing games, very funny and relatively easy to get into and walk away from. <br/>\n<br/>\nIf you can show your son you honor his interest in video games, that you figure since he finds them so interesting there must be something of value in them, he will trust you far more than if he catches you working hard not to judge the amount of time he is playing video games. He will also know, in a way I imagine he doesn&#39;t know now, that you aren&#39;t going to take his games away from him. You aren&#39;t going to go back to the days of all wood and cotton toys and natural products that a Waldorf based education values above all else. <br/>\n<br/>\nI haven&#39;t limited my son&#39;s television watching for 5 years, and his video game playing for longer. And I never did limit it very much. The television is on in our house quite a good deal of the time. And often Simon is either watching television or playing on the PS2 or the computer or occasionally on the Wii. Often he&#39;ll invite me to play. Sometimes I&#39;ll invite him to play a new game he got so that I can know the game, I like to be able to share with him. If there is something else he wants to do he&#39;ll do it. Chopping wood or going in the hot tub (which is wood fired, so one act leads to another) or picking apples or drawing or reading something with me. But as often as not it is the games and the television that he really enjoys. Simon loves to tell stories, he&#39;s been creating stories since he was a very young boy, initially about being a superhero who saved animals in trouble and then, for a long time, about Pokemon. He moved into Yugioh, retelling<br/>\n the stories and games he played, changing details, making them work out the way he would rather see them. It isn&#39;t a passive relationship, with him in a vegetative state, he interacts with these stories, these games. <br/>\n<br/>\nIt is important that you see these games as valuable. Your son may always have a life that includes video games. If you set up your world view as one that is in opposition to video games, you are opposing him. It won&#39;t build a trusting, loving, sharing relationship. And maybe you and your son can find things your husband will love, too. David, my husband, loves racing games, but at the moment only has eyes for Guitar Hero. Boy howdy, does that take up his video game time. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274933479,"authorName":"lyeping2607","from":"&quot;lyeping2607&quot; &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193250107","msgId":27300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmbzJmcitpZmhnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM4OS4xN2QyYzlkMS4zNDUwZDAwNkBhb2wuY29tPg=="},"prevInTopic":27299,"nextInTopic":27302,"prevInTime":27299,"nextInTime":27301,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi Patty! Glad to have found someone who s been thru the same experience. Nowadays, my unschooling days with my son is very much guided by my childhood. I have","messageBody":"<div id=\"ygrps-yiv-1496836849\">Hi Patty!<br/>\n<br/>\nGlad to have found someone who&#39;s been thru the same experience. <br/>\nNowadays, my unschooling days with my son is very much guided by my <br/>\nchildhood. I have to say even with this unique experience of growing up <br/>\nwith the tv, I can still have mixed feelings about my child growing up <br/>\nwith too much of the gamebox or pc., considering that the gamabox and <br/>\npc is probably more effective in teaching that the tv!!!<br/>\n<br/>\nSharon</div>","specialLinks":[]},{"userId":274933479,"authorName":"sharon currie","from":"sharon currie &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193248666","msgId":27298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNTQ5My45MzYyMi5xbUB3ZWIyNzMwOS5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":27297,"nextInTopic":27299,"prevInTime":27297,"nextInTime":27299,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi Colleen, I know you meant the questions for Melissa, but I would like to offer my experience as I can remember when we first started de-schooling and","messageBody":"<div id=\"ygrps-yiv-1594288237\">Hi Colleen,<br/>\n   <br/>\n  I know you meant the questions for Melissa, but I would like to offer my experience as I can remember when we first started de-schooling and unschooling. I was very worried, just like you.  <br/>\n   <br/>\n  1. I&#39;m wondering if your son just stopped playing one day or if he started finding <br/>\nother things interesting in addition to playing video games. <br/>\n   <br/>\n  One morning, my son&#39;s decided he wasn&#39;t gonna switch on the PS2 and play Star Wars Lego , as he has done 6 months ago!  Instead, he switch the tv on, and watch Looney Toons and has done so for about 6 weeks. Then he went back to the PS2, only this time it&#39;s the Simpson game. He stuck with the Simpsons for 3 months. And then went onto Grand Theft Auto for 7 weeks. And then went onto the Disney Town Town  Online community game, and has been stuck with this ever since (it&#39;s been 5 weeks).   <br/>\n   <br/>\n  2. Does he still play them now and then? <br/>\n  In my son&#39;s case, no. Once he had enough of the game, he just move onto the next. The tv merely only serve as an &quot;in between&quot; entertainment until he finds another exciting PS2 or pc game. The moment he starts flitting between tv and PS2 or pc, I know the &quot;favourite game&quot; is wearing off. <br/>\n   <br/>\n  3. Did you offer him other alternatives or did you just let him be? <br/>\nYes, I do offer alot of alternative, all the time. I have to, in order to &quot;dilute&quot; down the gaming time. I have no problem with his obsession with the PS2 or pc, but I need him to take little breaks, and I&#39;ll do anything to get him away from those gaming media.  So I entice him with lots of stuff, like going to his favourite sandpit at the nearby park, walking to the neighbourhood supermart to buy his favourite iced-bun, or sometimes even offer to take him window shopping at  Toys&#39;r&#39; US. Or go to the local library to check out some new games for his PS2. But really, if it&#39;s at the beginning of a new game/ &quot;obsession&quot; none of these alternative offered will work. Of which, my only option is to sit and be with him because my son has a need to &quot;initiate me&quot; into his new game. I join in the games sometime, but mostly, will do my emails or catch up with my reading sitting next to him  inorder to keep up with his game status, so that we can always have something to talk about!   <br/>\n   <br/>\n   4. I honestly don&#39;t think I can take nine months of letting him play video games or be at the <br/>\ncomputer whenever he wants to. This is week seven and I&#39;m about to crack! I&#39;m <br/>\ndoing my best not to judge, and I know he&#39;s learning something but it&#39;s tough.<br/>\n   <br/>\n  I know it&#39;s hard but if you stop resisting it, just go with the flow, you&#39;ll find it easier. Like you said, you know he&#39;s learning, and I agree it&#39;s is tough to accept, not knowing what it is exaclty he&#39;s learning, but if you take a step back and think &quot;What&#39;s the worst thing that can happen if you allow him to just do what he wants for 10 months?&quot;  When my son de-school with his PS2, I just accept that whatever that is, that he is needing it and it is obviously non-tangible, and not me mummy but only the PS2 can provide it, so be it. Can you view these 9 months like a long sabbatical from school? Like going on a long journey, perhaps a journey to discover oneself? I did literally had to stop thinking like mummy, but reach out into my inner child again, and think like one. It was the only way how my brain can make sense out of all these de-schooling thing.  I did tell myself &quot;so what if we were to be playing PS2 or pc games or watch tv for a whole year? Wouldn&#39;t it be<br/>\n interesting to see what the results will be after a whole year of gaming?&quot;  I told myself I have 3 years till my son turn 10, and if he&#39;s unable to count, then I have every cause to start panicking! &quot;  <br/>\n   <br/>\n  Judge and make a decision I did. I do believe because of my son&#39;s Asperger, he&#39;s unable to switch off. My son just do not have the capability to slow down even if he&#39;s too tired to go on  (and before anyone jump at me, pls do bear in mind this is my kid, and I do know my child very well and only wants the best for him). How do I know he&#39;s tired? Well, if my kid get up from his bed and he&#39;s standing wobbly all over with his eyes still shut, then he must be too tired to play! Many times, at my insistance that he gets back to bed, which he did and fall back asleep within seconds!<br/>\n   <br/>\n  Hence, as much as I try not to force him to do anything,  I do insist that he stop and take a break every so often. He&#39;s to decide when to take that break. Because if he&#39;s been spending too long hours on the pc or PS2 ( kinda like morning till night, 3 days in a row) and he&#39;ll start getting frustrated with the machine because he&#39;s losing concentration,  and making lots of mistakes during the game, blaming the machine for all his mistakes, and his eyes&#39; blinking non-stop (tired eyes) and headaches, I do insist on cutting down on his gaming time. <br/>\n   <br/>\n  If it&#39;s any consolation, 11 months on, my son is still never far from his tv, PS2 and pc. He&#39;s learnt his add and fraction thru his PS2 games and he did have many opportunity to practise reading all those games instructions. His current obsession with the Disney ToonwTown is further encouraging lots of reading practice (instructions) and learning new words, and counting (number of jellybeans needed to buy ammunitions).  <br/>\n   <br/>\n  I truly believe a child&#39;s strong interest in the gamebox and pc can be utilized for effective learning. My kid buys his own gaming magazines too, once a month. This way, he gets to know what sort of latest games that he likes, and we have lots of chats about which game is the bestest, and why. He then decide to &quot;allocate (division?) &quot; his pocket money between new game and new toy. His spelling is coming along nicely too, as one will need to be able to spell, if one wants to &quot;google&quot; it.  <br/>\n<br/>\n  Hope my little account can help you see pass your fear. <br/>\n   <br/>\n  Sharon<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\n Yahoo! Answers - Get better answers from someone who knows. Tryit now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":10665673,"authorName":"pattywithawhy@aol.com","from":"pattywithawhy@...","profile":"pattywithawhy1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193244166","msgId":27297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4OS4xN2QyYzlkMS4zNDUwZDAwNkBhb2wuY29tPg=="},"prevInTopic":27293,"nextInTopic":27298,"prevInTime":27296,"nextInTime":27298,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"SharonC wrote: ","messageBody":"<div id=\"ygrps-yiv-691613374\">SharonC wrote:<br/>\n <br/>\n&lt;&lt;If it&#39;s any consolation, well, I&#39;m Chinese, grew up in a Chinese speaking <br/>\nhousehold in Asia, and I was &quot;babysit&quot; by my grandmother&#39;If it&#39;s any <br/>\nconsolation, well, I&#39;m Chinese, grew up in a Chinese speaking household in& Jerry, <br/>\nBionic Women, The Saint, The Multimillion Dollar Man and Dallas. Hence I can switch <br/>\n&quot;accent&quot; at a drop of a hat! LOL!&gt;&gt;<br/>\n <br/>\nI love that you shared this.  I&#39;m a native English speaker, but I&#39;ve <br/>\ndeveloped fluency in Spanish mainly by watching tv.  I did take a few classes at the <br/>\nbeginning, but then switched to watching tv once I was able to get the gist of <br/>\nwhat was happening and could deduce what was being said.  I&#39;d often watch with <br/>\nthe captions on so I could see the words too.  My accent is also pretty good; <br/>\nI&#39;m often mistaken for a native speaker (though they just can&#39;t figure out <br/>\nwhich country I&#39;m from.)  Anyway, I tell people this but they rarely seem to <br/>\nbelieve me, so it&#39;s nice to hear from somebody with a similar experience.  <br/>\n <br/>\nPatty<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: newbie needing encouragement re:tv","postDate":"1193243174","msgId":27293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNTIyMC41MjUzLnFtQHdlYjgxNTE1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDU0ODc0QjNELTFCMjItNDVENS05MDBDLTRBNzU5NTAxQzk5M0Bjb3gubmV0Pg=="},"prevInTopic":27291,"nextInTopic":27297,"prevInTime":27292,"nextInTime":27294,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Melissa  wrote: Then we got super paper mario, and the time went back up to six hours a day, until he beat it. Now it s three hours a day","messageBody":"<div id=\"ygrps-yiv-485930271\">Melissa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:autismhelp@...\">autismhelp@...</a>&gt; wrote:<br/>\n   <br/>\n  Then we got super paper mario, and the <br/>\ntime went back up to six hours a day, until he beat it. Now it&#39;s <br/>\nthree hours a day while I&#39;m trying to beat it.<br/>\n   <br/>\n  ------------------------------------------------------------<br/>\n   <br/>\n  LOL Melissa ! Looks like our house! I already beat Paper Mario I just got to do the two Pit of 100 Trials to be happy now.<br/>\n   <br/>\n   <br/>\n   <br/>\n  Alex<br/>\n<br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n          Nope. He didn&#39;t just stop playing. Sorry if that&#39;s hard to hear.<br/>\n<br/>\nWhat we did see, was kind of like a bell curve. Well, the second <br/>\nhalf. When he got his wii, the calendar notes that it was played for <br/>\n13 hours a day for the first few weeks. This was after unschooling <br/>\nfor a year and a half, so obviously there was high interest (and to <br/>\nbe fair, he wasn&#39;t the only one playing, I needed my turn too) About <br/>\nsix months ago, he went three days without turning it on longer than <br/>\nit took to check the weather. Then we got super paper mario, and the <br/>\ntime went back up to six hours a day, until he beat it. Now it&#39;s <br/>\nthree hours a day while I&#39;m trying to beat it.<br/>\n<br/>\nI didn&#39;t offer other alternatives. I say that, but we have a busy <br/>\nhouse full of people doing things. For the most part, if he&#39;s not <br/>\nplaying games on a console, he&#39;s on the computer. This time is <br/>\ndivided pretty evenly between playing games, surfing for more info <br/>\nand working on programming. I don&#39;t just let him be. I sit in there <br/>\nwith him, play with him, and encourage him to keep practicing. <br/>\nBeating those games is pretty important to him, and by distracting <br/>\nhim, I&#39;m not only not honoring that need, but I&#39;m actually prolonging <br/>\nthe time it takes to process and get to a stopping point.<br/>\n<br/>\nYou can take nine months. Promise! Follow the AA creed of one day at <br/>\na time. One minute at a time if you have to, but look at him as a <br/>\nperson, as you would a genius computer coder, or a best friend who&#39;s <br/>\ntrying to beat the game, and it takes on an entirely different look. <br/>\nIt is amazing to see how much he&#39;s learning, I mean, Josh knows every <br/>\ncharacter on SPM, which is a huge help to me when I&#39;m trying to <br/>\ndefeat a boss stage! Okay okay, seriously. Let it happen, Breath in, <br/>\nBreath out. Accept that this is who he is NOW. This isn&#39;t an <br/>\nindictment of who he&#39;ll be in two years, or four years or ten years. <br/>\nBut it&#39;s okay.<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (8), Rachel (7), Sam (6), Dan <br/>\n(4), and Avari Rose (19 months)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 22, 2007, at 4:13 PM, cpaeff wrote:<br/>\n<br/>\n&gt; Melissa, I&#39;m wondering if your son just stopped playing one day or <br/>\n&gt; if he started finding<br/>\n&gt; other things interesting in addition to playing video games. Does <br/>\n&gt; he still play them now<br/>\n&gt; and then? Did you offer him other alternatives or did you just let <br/>\n&gt; him be?<br/>\n&gt;<br/>\n&gt; I honestly don&#39;t think I can take nine months of letting him play <br/>\n&gt; video games or be at the<br/>\n&gt; computer whenever he wants to. This is week seven and I&#39;m about to <br/>\n&gt; crack! I&#39;m<br/>\n&gt; doing my best not to judge, and I know he&#39;s learning something but <br/>\n&gt; it&#39;s tough.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: newbie needing encouragement re:tv","postDate":"1193241044","msgId":27291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0ODc0QjNELTFCMjItNDVENS05MDBDLTRBNzU5NTAxQzk5M0Bjb3gubmV0Pg==","inReplyToHeader":"PGZmajNxYitwNGFvQGVHcm91cHMuY29tPg==","referencesHeader":"PGZmajNxYitwNGFvQGVHcm91cHMuY29tPg=="},"prevInTopic":27286,"nextInTopic":27293,"prevInTime":27290,"nextInTime":27292,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Nope. He didn t just stop playing. Sorry if that s hard to hear. What we did see, was kind of like a bell curve. Well, the second half. When he got his wii,","messageBody":"<div id=\"ygrps-yiv-110592594\">Nope. He didn&#39;t just stop playing. Sorry if that&#39;s hard to hear.<br/>\n<br/>\nWhat we did see, was kind of like a bell curve. Well, the second  <br/>\nhalf. When he got his wii, the calendar notes that it was played for  <br/>\n13 hours a day for the first few weeks. This was after unschooling  <br/>\nfor a year and a half, so obviously there was high interest (and to  <br/>\nbe fair, he wasn&#39;t the only one playing, I needed my turn too) About  <br/>\nsix months ago, he went three days without turning it on longer than  <br/>\nit took to check the weather. Then we got super paper mario, and the  <br/>\ntime went back up to six hours a day, until he beat it. Now it&#39;s  <br/>\nthree hours a day while I&#39;m trying to beat it.<br/>\n<br/>\nI didn&#39;t offer other alternatives. I say that, but we have a busy  <br/>\nhouse full of people doing things. For the most part, if he&#39;s not  <br/>\nplaying games on a console, he&#39;s on the computer. This time is  <br/>\ndivided pretty evenly between playing games, surfing for more info  <br/>\nand working on programming. I don&#39;t just let him be. I sit in there  <br/>\nwith him, play with him, and encourage him to keep practicing.  <br/>\nBeating those games is pretty important to him, and by distracting  <br/>\nhim, I&#39;m not only not honoring that need, but I&#39;m actually prolonging  <br/>\nthe time it takes to process and get to a stopping point.<br/>\n<br/>\nYou can take nine months. Promise! Follow the AA creed of one day at  <br/>\na time. One minute at a time if you have to, but look at him as a  <br/>\nperson, as you would a genius computer coder, or a best friend who&#39;s  <br/>\ntrying to beat the game, and it takes on an entirely different look.  <br/>\nIt is amazing to see how much he&#39;s learning, I mean, Josh knows every  <br/>\ncharacter on SPM, which is a huge help to me when I&#39;m trying to  <br/>\ndefeat a boss stage! Okay okay, seriously. Let it happen, Breath in,  <br/>\nBreath out. Accept that this is who he is NOW. This isn&#39;t an  <br/>\nindictment of who he&#39;ll be in two years, or four years or ten years.  <br/>\nBut it&#39;s okay.<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (8), Rachel (7), Sam (6), Dan  <br/>\n(4), and Avari Rose (19 months)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 22, 2007, at 4:13 PM, cpaeff wrote:<br/>\n<br/>\n&gt; Melissa, I&#39;m wondering if your son just stopped playing one day or  <br/>\n&gt; if he started finding<br/>\n&gt; other things interesting in addition to playing video games. Does  <br/>\n&gt; he still play them now<br/>\n&gt; and then? Did you offer him other alternatives or did you just let  <br/>\n&gt; him be?<br/>\n&gt;<br/>\n&gt; I honestly don&#39;t think I can take nine months of letting him play  <br/>\n&gt; video games or be at the<br/>\n&gt; computer whenever he wants to. This is week seven and I&#39;m about to  <br/>\n&gt; crack! I&#39;m<br/>\n&gt; doing my best not to judge, and I know he&#39;s learning something but  <br/>\n&gt; it&#39;s tough.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193235877","msgId":27286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzJGQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27279,"nextInTopic":27291,"prevInTime":27285,"nextInTime":27287,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"... What are -you- doing while he s playing/watching (aside from counting the days on the calendar lol)? Seriously, are you mostly doing the dishes and","messageBody":"<div id=\"ygrps-yiv-249480474\"><blockquote><span title=\"ireply\">&gt;This is week seven and I&#39;m about to crack! <br/>\n <br/>\n </span></blockquote>What are -you- doing while he&#39;s playing/watching (aside from counting<br/>\nthe days on the calendar lol)? Seriously, are you mostly doing the<br/>\ndishes and hovering and worrying or are you using this time to explore<br/>\nYOUR interests, try a new knitting pattern you&#39;ve been meaning to get<br/>\naround to, or digging into that wood burning kit you&#39;ve had laying<br/>\naround, or whatever. November is just around the corner, so if you&#39;re so<br/>\ninclined, you might try National Novel Writers Month (NaNoWriMo) - you<br/>\ntry to write an entire novel start to end in one month (google it and<br/>\nyou&#39;ll find the website with more information). <br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274933479,"authorName":"lyeping2607","from":"&quot;lyeping2607&quot; &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193226152","msgId":27278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmbmIzOCtqbXY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4MzAxOC4xODQzMy5xbUB3ZWI1NDExMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":27277,"nextInTopic":27279,"prevInTime":27277,"nextInTime":27279,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi Vicki ... son stepped up and stood proud as he stated, I unschool!  My mom lets me study whatever I want!  Lol, all I could do is smile. It s called","messageBody":"<div id=\"ygrps-yiv-1557772600\">Hi Vicki<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So then I got questioned about how I &#39;make&#39; my son do school work. My <br/>\n </span></blockquote>son stepped up and stood proud as he stated, &quot;I unschool!  My mom lets <br/>\nme study whatever I want!&quot;  Lol, all I could do is smile. <br/>\n<br/>\nIt&#39;s called Confidence. And you can only get it when you&#39;re allowed the <br/>\nthe time and space to practice and honed your skills of &quot;exercising  <br/>\nthe freedom of choice&quot;, without any prejudice. <br/>\n<br/>\nAnd yes, it makes me smile too. <br/>\n<br/>\nSharonC</div>","specialLinks":[]},{"userId":274933479,"authorName":"lyeping2607","from":"&quot;lyeping2607&quot; &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193224643","msgId":27277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmbjlrMytqOGpjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxQjM2M0E2LTRDQTMtNDU4MC1CMDU3LTJFMDk2MTIxQjFEQkBjb3gubmV0Pg=="},"prevInTopic":27274,"nextInTopic":27278,"prevInTime":27276,"nextInTime":27278,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"LOL! Sorry Melissa! I was in a hurry and obviously mis-read the post. Well, who ever it was asking for help, I hope I ve go tmy message across. SharonC","messageBody":"<div id=\"ygrps-yiv-673828051\">LOL! Sorry Melissa! I was in a hurry and obviously mis-read the post. <br/>\nWell, who ever it was asking for help, <br/>\n<br/>\nI hope I&#39;ve go tmy message across. <br/>\n<br/>\nSharonC</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] newbie needing encouragement re:tv","postDate":"1193175588","msgId":27274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4MzAxOC4xODQzMy5xbUB3ZWI1NDExMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":27273,"nextInTopic":27277,"prevInTime":27273,"nextInTime":27275,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"This reminds me of this past weekend, when my 9yo nephew was here for my son s 10th birthday party.  My nephew attends a Christian private school even though","messageBody":"<div id=\"ygrps-yiv-325149891\">This reminds me of this past weekend, when my 9yo nephew <br/>\nwas here for my son&#39;s 10th birthday party.  My nephew attends<br/>\na Christian private school even though he&#39;ll tell you he&#39;s Jewish.<br/>\n(Just a funny side note as it&#39;s his ONLY religious training and my<br/>\nbrother&#39;s not Jewish, lol.) My other nephew who&#39;s also 9, was also<br/>\nhere and he attends public school.  Both these boys live under <br/>\nstrict parental control.  They have limited TV, bedtimes, punishments<br/>\nfor bad grades, not allowed video games, etc.<br/>\n <br/>\nMy son has none.  <br/>\n <br/>\nSo the first nephew questioned me about the &#39;strange way&#39; I parent.<br/>\nHe wanted to know why my son is allowed to play M rated video games<br/>\nbecause his parents won&#39;t let him and he really wants to.  I pointed out <br/>\nthat it&#39;s just not a big deal to my son.  He can pick and choose what he<br/>\nwants do and when he wants to do it.  <br/>\n <br/>\nI pointed out that even though my son plays these games that my siblings<br/>\nforbid their sons because of the bad language, my son is the only one out<br/>\nof the three boys who doesn&#39;t use curse words.  My son chooses not to.<br/>\nYet these other boys get punished harshly for it, they still curse! Hmmmm.<br/>\n <br/>\nSo then I got questioned about how I &#39;make&#39; my son do school work. My son <br/>\nstepped up and stood proud as he stated, &quot;I unschool!  My mom lets me study<br/>\nwhatever I want!&quot;  Lol, all I could do is smile. <br/>\n <br/>\nLater, this same child states,<br/>\n&quot;My mom doesn&#39;t believe in homeschool.&quot;  Before I could respond, my spouse<br/>\never so calmly states, &quot;She doesn&#39;t have to believe in it, but whether she <br/>\ndoes or not, it really is out there, and millions of people are doing it.&quot; <br/>\n <br/>\nThis poor child left so confused.  My son has no rules but makes good choices<br/>\nand he has no school yet he knows so much.  Just how does this happen?!? <br/>\n <br/>\nVicki<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] newbie needing encouragement re:tv","postDate":"1193173680","msgId":27273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Nzg0OS41NjYzNi5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":27271,"nextInTopic":27274,"prevInTime":27272,"nextInTime":27274,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Kelly, lol.... TV...It s not the enemy---really! I love this! Thanks for cracking me up! Vicki __________________________________________________ Do You","messageBody":"<div id=\"ygrps-yiv-1662939065\">Kelly, lol.... &quot;TV...It&#39;s not the enemy---really!&quot;<br/>\nI love this!<br/>\nThanks for cracking me up!<br/>\nVicki<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274933479,"authorName":"lyeping2607","from":"&quot;lyeping2607&quot; &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193160944","msgId":27271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmbGJkZytrbXNiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOUUzQTUyNDQzRjQ4MS1DN0MtNDQxQFdFQk1BSUwtTUIyMS5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":27268,"nextInTopic":27273,"prevInTime":27270,"nextInTime":27272,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"Hi there,  I see this from an earlier post from Melissa: I really think that once the TV and videogames get their fill, when the kids honestly and truly","messageBody":"<div id=\"ygrps-yiv-534226274\">Hi there,<br/>\n<br/>\n&quot; I see this from an earlier post from Melissa: &quot;I really<br/>\nthink that once the TV and videogames get their fill, when the kids<br/>\nhonestly and truly believe that they can come and go from them<br/>\nwithout stipulation, then the ability to walk away and choose other<br/>\nthings are much easier.&quot;<br/>\nI really really hope this happens, and have been holding onto these<br/>\nwords for a while. Do others agree with her?&quot;<br/>\n<br/>\nYES! YES! YES IT IS TRUE!!!<br/>\n<br/>\nMy kid de-school via the PS2. We never had tv problem and that&#39;s <br/>\nbecause we always did have the tv on, so he&#39;s kinda grew up with the <br/>\nfreedom to watch any tv he wants. BUt the PS2, well that&#39;s another <br/>\nstory (not very different from your tv dilemma). Anyway, as per <br/>\nevryone&#39;s advice and really I had no choice anyway. Because it was <br/>\neither fight all the way, or go with the flow. Now it&#39;s 10 months down <br/>\nthe road, my son is no longer hook to the PS2 but have found a new <br/>\nobsession. IT&#39;s called the internet!!LOL!<br/>\n<br/>\nMy advice is to let him melt into that sofa, let him binge on it, <br/>\nbetter still if you can melt and binge together. This way (I believe) <br/>\ncan provide you both something in common to talk/ discuss about, now or <br/>\nfuture, as I believe it&#39;s best to keep the communication channel open, <br/>\neven if it&#39;s rarely used. You&#39;ll be surprised what discussion/ new <br/>\ninterest all these &quot;melting/ binging together&quot; session can lead to. <br/>\nAfterall, what harm can this lead to other than some R & R and bonding <br/>\ntime. How long, you&#39;ll ask? I&#39;ll say &quot;start worrying if you&#39;re still <br/>\nmelting and binging away at the same tv shows, 2 years down the road! <br/>\nLOL&quot; <br/>\n<br/>\nJokes aside. No one can tell you how long your child need to deschool.  <br/>\nAs for me, I told myself to only start worrying when my son turns ten <br/>\n(that&#39;s 3 yrs away), and he can&#39;t count! Well, surprise, surprise! He <br/>\nlearnt his Maths thru his PS2. So I&#39;m sure your son is learning too, by <br/>\ntons, just by watching tv. If it&#39;s any consolation, well, I&#39;m Chinese, <br/>\ngrew up in a Chinese speaking household in Asia, and I was &quot;babysit&quot; by <br/>\nmy grandmother&#39;s tv. I grew up learning to speak and write English, by <br/>\nwatching the Flintstones, Tom & Jerry, Bionic Women, The Saint, The <br/>\nMultimillion Dollar Man and Dallas. Hence I can switch &quot;accent&quot; at a <br/>\ndrop of a hat! LOL!<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nSharonC</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] newbie needing encouragement re:tv","postDate":"1193155303","msgId":27268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUUzQTUyNDQzRjQ4MS1DN0MtNDQxQFdFQk1BSUwtTUIyMS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGZmNHYwNis2OWFxQGVHcm91cHMuY29tPg==","referencesHeader":"PGZmNHYwNis2OWFxQGVHcm91cHMuY29tPg=="},"prevInTopic":27154,"nextInTopic":27271,"prevInTime":27267,"nextInTime":27269,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"... From: rpindc04  We are 2 months into deschooling our 10-year old son. -=-=-=- Two months with a ten year old isn t long at all. More","messageBody":"<div id=\"ygrps-yiv-923671636\">-----Original Message-----<br/>\nFrom: rpindc04 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robbin_mp@...\">robbin_mp@...</a>&gt;<br/>\n<br/>\nWe are 2 months into deschooling our 10-year old son.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nTwo months with a ten year old isn&#39;t long at all.<br/>\n<br/>\nMore importantly, two months for his months---well, you have barely <br/>\nstarted! &lt;g&gt;<br/>\n<br/>\nHow many years did you spend in school? It&#39;ll take you longer than it <br/>\nwill him! &lt;g&gt;<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n- The noise drives me crazy sometimes! I can sometimes remain<br/>\nrational enough to tell him this in a nice voice and ask him to do<br/>\nsomething else, or tell him I need to go somewhere to get away from<br/>\nit.<br/>\n<br/>\n-=-=-<br/>\n<br/>\nGood.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n- I&#39;m worried that he will not get past this, that it will not be a<br/>\nphase, but a way of life.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nIs it *your* way of life?<br/>\n<br/>\nAs soon as you really, REALLY quit worrying, THEN he will get past it.<br/>\n<br/>\nIt&#39;s funny how that works! &lt;g&gt;<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n- His attention span and mood are short after hours and hours of tv.<br/>\nHe associates his bad mood with something I have done, rather than<br/>\nwith the tv, of course.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nCould he be right? Could it be something *you* did?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n- He has such potential that is not being tapped - as an artist,<br/>\nsoccer player, friend, actor,  designer, builder, mathematician, and<br/>\nmore - all interests he has expressed in the recent past.<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\nHe&#39;s only ten. What potential have *you* tapped in yourself? Are you <br/>\nmodeling that realization of potential?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI see this from an earlier post from Melissa: &quot;I really<br/>\nthink that once the TV and videogames get their fill, when the kids<br/>\nhonestly and truly believe that they can come and go from them<br/>\nwithout stipulation, then the ability to walk away and choose other<br/>\nthings are much easier.&quot;<br/>\n<br/>\nI really really hope this happens, and have been holding onto these<br/>\nwords for a while. Do others agree with her?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI do.<br/>\n<br/>\nDoesn&#39;t mean that they will no longer ever watch TV. But if your son <br/>\nbelieves that you will take it away from him one day soon, he will <br/>\nnever let it go.<br/>\n<br/>\nRelax. Find the GOOD in TV. Celebrate it with him. It&#39;s not the <br/>\nenemy---really!<br/>\n<br/>\nModel what interests YOU. Let him see YOU do cool, fun, new things!<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":300893042,"authorName":"cpaeff","from":"&quot;cpaeff&quot; &lt;cpaeff@...&gt;","profile":"cpaeff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: newbie needing encouragement re:tv","postDate":"1193087627","msgId":27279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmajNxYitwNGFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxQjM2M0E2LTRDQTMtNDU4MC1CMDU3LTJFMDk2MTIxQjFEQkBjb3gubmV0Pg=="},"prevInTopic":27278,"nextInTopic":27286,"prevInTime":27278,"nextInTime":27280,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"I m going through the exact same thing with my 12-year-old son, Robbin. I took him out of a Waldorf school at the end of fifth grade, so the whole letting him","messageBody":"<div id=\"ygrps-yiv-1148631153\">I&#39;m going through the exact same thing with my 12-year-old son, Robbin. I took him out <br/>\nof a Waldorf school at the end of fifth grade, so the whole letting him have his way with <br/>\nvideo games and computers is really new for us. It&#39;s a struggle because I&#39;m still not <br/>\nconvinced that he doesn&#39;t need some guidance in that area but I&#39;m really trying to let him <br/>\nfind his own way. My husband is not exactly on board so that doesn&#39;t help.<br/>\n<br/>\nMelissa, I&#39;m wondering if your son just stopped playing one day or if he started finding <br/>\nother things interesting in addition to playing video games. Does he still play them now <br/>\nand then? Did you offer him other alternatives or did you just let him be? <br/>\n<br/>\nI honestly don&#39;t think I can take nine months of letting him play video games or be at the <br/>\ncomputer whenever he wants to. This is week seven and I&#39;m about to crack! I&#39;m <br/>\ndoing my best not to judge, and I know he&#39;s learning something but it&#39;s tough.<br/>\n<br/>\nColleen<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thenewunschooler.blogspot.com/\">http://thenewunschooler.blogspot.com/</a></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] newbie needing encouragement re:tv","postDate":"1192634277","msgId":27154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxQjM2M0E2LTRDQTMtNDU4MC1CMDU3LTJFMDk2MTIxQjFEQkBjb3gubmV0Pg==","inReplyToHeader":"PGZmNHYwNis2OWFxQGVHcm91cHMuY29tPg==","referencesHeader":"PGZmNHYwNis2OWFxQGVHcm91cHMuY29tPg=="},"prevInTopic":27153,"nextInTopic":27268,"prevInTime":27153,"nextInTime":27155,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"I dont know if *I m* the Melissa who said that, but it is something I would say. We pulled our son from school at the age of ten, and the TV deschooling took","messageBody":"<div id=\"ygrps-yiv-105347915\">I dont know if *I&#39;m* the Melissa who said that, but it is something I  <br/>\nwould say. We pulled our son from school at the age of ten, and the  <br/>\nTV deschooling took around nine months. Lots of tiredness, lots of  <br/>\nsnapping. I brought his snacks. I brought him drinks. I rubbed his  <br/>\nneck and back. I just thought of it as the same kind of hard work  <br/>\nthat kids put into sports or academics, a child who was tired and  <br/>\nsnapping after that would be thought of completely differently.<br/>\n<br/>\nIt will take longer to deschool if he&#39;s being told to turn it off or  <br/>\ngo elsewhere. Do you think that maybe the TV could be moved to  <br/>\nanother room? Ours is in a backbedroom. This is also nice because  <br/>\nwhen we have my in-laws over, the guys can&#39;t turn on the football in  <br/>\nthe middle of our conversation. Instead they have a little shindig in  <br/>\nthe back, the ladies can chat, the kids can do crafts in the middle.  <br/>\nMaybe some sound blockers for you? We bought shooter&#39;s muffs for my  <br/>\ndaughter that is very sensitive to noise. I borrow them sometimes  <br/>\nwhen I can&#39;t take anymore, or I put on my ipod. The noise does drive  <br/>\nme crazy after a while. We have seven kids, all of whom like  <br/>\ndifferent shows. So by the time everyone watches the programs they  <br/>\nlike, omg...hours. It helps that I really love seeing them involved.  <br/>\nThey all do TV differently, and when I watch too and can talk with  <br/>\nthem, it changes the whole feeling of the room. Sometimes I noticed  <br/>\nthat the attitude wasn&#39;t so much from the TV as it was from being  <br/>\ndisconnected from me and needing me more present. Sometimes it was a  <br/>\nresult of MY feelings, the fear and concern that he wouldn&#39;t get past  <br/>\nit.<br/>\n<br/>\nBut he will. It&#39;s basic economics...any object that is in demand will  <br/>\nincrease in value. Once there&#39;s a glut of it in the market, cost  <br/>\ndecreases and so does demand. It&#39;s the way of the human mind. :-)   <br/>\nHe&#39;ll probably still like TV, he&#39;ll still watch it some, it&#39;s a great  <br/>\nway to learn more about the world. We&#39;ve found life lessons in every  <br/>\nshow we&#39;ve watched.<br/>\n<br/>\nGood luck.<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (8), Rachel (7), Sam (6), Dan  <br/>\n(4), and Avari Rose (19 months)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 17, 2007, at 7:25 AM, rpindc04 wrote:<br/>\n<br/>\n&gt; We are 2 months into deschooling our 10-year old son. I know that<br/>\n&gt; isn&#39;t long. We&#39;ve learned so much, changed so much, and still have so<br/>\n&gt; far to go. What is driving me crazy is the constant tv. We have only<br/>\n&gt; one, and it is in the living room of our small house where I get to<br/>\n&gt; listen to it most of the time. My issues:<br/>\n&gt; - The noise drives me crazy sometimes! I can sometimes remain<br/>\n&gt; rational enough to tell him this in a nice voice and ask him to do<br/>\n&gt; something else, or tell him I need to go somewhere to get away from<br/>\n&gt; it.<br/>\n&gt; - I&#39;m worried that he will not get past this, that it will not be a<br/>\n&gt; phase, but a way of life.<br/>\n&gt; - The physical effects of spending one&#39;s life in a chair are already<br/>\n&gt; apparent - he is not as physically strong as when he was more active,<br/>\n&gt; and gets back and neck aches after sitting cock-eyed in an easy chair<br/>\n&gt; all day.<br/>\n&gt; - His attention span and mood are short after hours and hours of tv.<br/>\n&gt; He associates his bad mood with something I have done, rather than<br/>\n&gt; with the tv, of course.<br/>\n&gt; - He has such potential that is not being tapped - as an artist,<br/>\n&gt; soccer player, friend, actor, designer, builder, mathematician, and<br/>\n&gt; more - all interests he has expressed in the recent past.<br/>\n&gt;<br/>\n&gt; I see this from an earlier post from Melissa: &quot;I really<br/>\n&gt; think that once the TV and videogames get their fill, when the kids<br/>\n&gt; honestly and truly believe that they can come and go from them<br/>\n&gt; without stipulation, then the ability to walk away and choose other<br/>\n&gt; things are much easier.&quot;<br/>\n&gt;<br/>\n&gt; I really really hope this happens, and have been holding onto these<br/>\n&gt; words for a while. Do others agree with her?<br/>\n&gt;<br/>\n&gt; Thanks.<br/>\n&gt; Robbin<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":90144972,"authorName":"rpindc04","from":"&quot;rpindc04&quot; &lt;robbin_mp@...&gt;","profile":"rpindc04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"newbie needing encouragement re:tv","postDate":"1192623942","msgId":27153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmNHYwNis2OWFxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":27154,"prevInTime":27152,"nextInTime":27154,"topicId":27153,"numMessagesInTopic":0,"msgSnippet":"We are 2 months into deschooling our 10-year old son. I know that isn t long. We ve learned so much, changed so much, and still have so far to go. What is","messageBody":"<div id=\"ygrps-yiv-1385231977\">We are 2 months into deschooling our 10-year old son. I know that <br/>\nisn&#39;t long. We&#39;ve learned so much, changed so much, and still have so <br/>\nfar to go. What is driving me crazy is the constant tv. We have only <br/>\none, and it is in the living room of our small house where I get to <br/>\nlisten to it most of the time. My issues:<br/>\n- The noise drives me crazy sometimes! I can sometimes remain <br/>\nrational enough to tell him this in a nice voice and ask him to do <br/>\nsomething else, or tell him I need to go somewhere to get away from <br/>\nit.<br/>\n- I&#39;m worried that he will not get past this, that it will not be a <br/>\nphase, but a way of life.<br/>\n- The physical effects of spending one&#39;s life in a chair are already <br/>\napparent - he is not as physically strong as when he was more active, <br/>\nand gets back and neck aches after sitting cock-eyed in an easy chair <br/>\nall day.<br/>\n- His attention span and mood are short after hours and hours of tv. <br/>\nHe associates his bad mood with something I have done, rather than <br/>\nwith the tv, of course. <br/>\n- He has such potential that is not being tapped - as an artist, <br/>\nsoccer player, friend, actor,  designer, builder, mathematician, and <br/>\nmore - all interests he has expressed in the recent past.<br/>\n<br/>\nI see this from an earlier post from Melissa: &quot;I really<br/>\nthink that once the TV and videogames get their fill, when the kids<br/>\nhonestly and truly believe that they can come and go from them<br/>\nwithout stipulation, then the ability to walk away and choose other<br/>\nthings are much easier.&quot;<br/>\n<br/>\nI really really hope this happens, and have been holding onto these <br/>\nwords for a while. Do others agree with her?<br/>\n<br/>\nThanks.<br/>\nRobbin</div>","specialLinks":[]}],"prevTopicId":27806,"nextTopicId":27801}}