{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":138085708,"authorName":"earthmothergypsy","from":"&quot;earthmothergypsy&quot; &lt;earthmothergypsy@...&gt;","profile":"earthmothergypsy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sib trouble & overtired How would you have handled it?","postDate":"1089573664","msgId":1815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjczN2MCs0bGw5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyYjUwMWM0NjZmNyRlZWRjYTc5MCQ2NTAwYThjMEBMYXB0b3A+"},"prevInTopic":1789,"nextInTopic":0,"prevInTime":1814,"nextInTime":1816,"topicId":1760,"numMessagesInTopic":0,"msgSnippet":"Jeanne, I think I would have tried to redirect your dd into another activity.  Suggesting things she might like to do.  Something that might help her unwind","messageBody":"<div id=\"ygrps-yiv-1306826232\">Jeanne,<br/>\n<br/>\nI think I would have tried to redirect your dd into another <br/>\nactivity.  Suggesting things she might like to do.  Something that <br/>\nmight help her unwind from the day.  :)  I might have even started <br/>\nreading a book she might like allowed, or asked her if she wanted to <br/>\nplay a game with me or something.  They did need to be seperated in <br/>\nsome way.   <br/>\n<br/>\nSounds like your ds did great trying to handle it the way he did and <br/>\nasking for help when needed.  Can&#39;t see how he could have changed <br/>\nmuch.  DD was just a &quot;grumpy bear&quot; at the time-just like we all get <br/>\nwhen we are tired or over stimulated.  lol!<br/>\n<br/>\n~Amanda<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Jeanne Goodman&quot; <br/>\n&lt;goodmanj@j...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Ok, I really hope I&#39;m not overdoing it on the list, but I&#39;d really <br/>\n </span></blockquote>would like to hear how you would have handled this.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; It really started last night. Both dh and I had to work this <br/>\n </span></blockquote>morning. I asked dd if she wanted to come with me to my meeting and <br/>\nshe said she did. I suggested she get to bed early because we would <br/>\nhave to get up early, but she didn&#39;t.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; She did relatively well at the meeting -- she only interrupted me a <br/>\n </span></blockquote>few times while I was presenting to say that she was bored.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; After the meeting we went to lunch (I didn&#39;t control what she got. <br/>\n </span></blockquote>My tongue is sore from biting it.) Then we went to the thrift shop <br/>\nwhere I got her some clothing and a small toy. Then we got some video <br/>\ngames that I&#39;ve put off getting because I thought they should be <br/>\ndoing other things... but I digress. Let it suffice to say she was <br/>\npleased with the day.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Toward the end of the evening, ds reported that dd was *really <br/>\n </span></blockquote>annoying him* and he wanted our help to resolve the conflict. I asked <br/>\nhim what he tried and it sounded as though he had really tried to <br/>\nwork it out with her. He asked her to stop and then asked her why she <br/>\nwas ignoring him. (The really annoying had included hitting, throwing <br/>\nthings, poking and otherwise trying to arouse db who wanted to watch <br/>\nTV and he had invited her to join him.)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I won&#39;t bother to tell you how it was resolved -- but it didn&#39;t <br/>\n </span></blockquote>come out well. (Although no one was harmed in the making of this <br/>\nmessage.)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So now that I&#39;ve shared that LONG story. My question is really two <br/>\n </span></blockquote>fold -- how do you deal with a kid who&#39;s overtired and intentionally <br/>\nannoying her sib. And how might I have advised the sib to handle the <br/>\nsituation on his own (he&#39;s been trying really hard to avoid a <br/>\nconflict with her this summer and as a team we&#39;ve been working hard <br/>\non conflict resolution.)<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Jeanne<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Sib trouble & overtired How would you have handled it?","postDate":"1089556982","msgId":1789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWM0Njc1NSQ1ZTg5NjQ0MCQ2NTAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDAyYjUwMWM0NjZmNyRlZWRjYTc5MCQ2NTAwYThjMEBMYXB0b3A+"},"prevInTopic":1787,"nextInTopic":1815,"prevInTime":1788,"nextInTime":1790,"topicId":1760,"numMessagesInTopic":0,"msgSnippet":"Wow - what a stressful day your daughter had.  In many biochemical ways, it doesn t matter if it is bad stress (not being able to talk to you as much as she","messageBody":"<div id=\"ygrps-yiv-700861149\">Wow - what a stressful day your daughter had.  In many biochemical ways, it doesn&#39;t matter if it is &quot;bad&quot; stress (not being able to talk to you as much as she wanted while you are presenting at the meeting), or &quot;good&quot; stress (going to a restaurant and two different stores), the same stress chemicals are still being manufactured by the body and they have to go somewhere.  <br/>\n<br/>\nFor my daughter (6.5)   doing so many things in one day can often lead to her feeling vaguely out-of-sorts and acting in the same way you described (although toward me or her father, since her brother is only 1.5). <br/>\n<br/>\nWhen my daughter is in that kind of state of disequilibrium (poking, annoying, making loud noises) this is what works for us.  First,  acknowledging that she has had a busy day, and talking about what parts might have been hard or exciting for her, really hearing her and empathasizing with what she says. <br/>\n<br/>\nSecond, depending on whether she is still wound up, then we might do some really active stuff, racing up and down the house or some other physical thing to get out some energy.  Otherwise, we move straight to some winding down time together  -- (a warm bath with me sitting in the bathroom talking with her), a cuddle, watching a familiar DVD, reading a familiar book.  <br/>\n<br/>\nWhat doesn&#39;t work is for me to think to myself  -  &quot;I&#39;ve had a busy stressful day and I bought you what you wanted for lunch and I bought you a toy and  I bought you a video -- why can&#39;t you just not need anything for 15 seconds so that I can rest.&quot;  I&#39;m not saying that you were feeling that way -- but that is the trap that I can often fall into with a day like the one that you were describing.  When I catch myself feeling that way,  I have to remind myself that I wasn&#39;t the one who choose to do too many things today and pull myself together and help her unwind.  <br/>\n<br/>\nIf she had an older brother, I certainly wouldn&#39;t let her bother him while he was peacefully watching TV, and I wouldn&#39;t expect him to be able to difuse the situation without help.  What my daughter would need in that situation is human interaction and I wouldn&#39;t expect her brother to have to be the one to provide it. <br/>\n<br/>\n-Cat <br/>\n<br/>\n<br/>\n--- Original Message ----- <br/>\n  From: Jeanne Goodman <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Saturday, July 10, 2004 11:22 PM<br/>\n  Subject: [unschoolingbasics] Sib trouble & overtired How would you have handled it?<br/>\n   <br/>\n  So now that I&#39;ve shared that LONG story. My question is really two fold -- how do you deal with a kid who&#39;s overtired and intentionally annoying her sib. And how might I have advised the sib to handle the situation on his own (he&#39;s been trying really hard to avoid a conflict with her this summer and as a team we&#39;ve been working hard on conflict resolution.)<br/>\n<br/>\n  Jeanne<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Sib trouble & overtired How would you have handled it?","postDate":"1089555792","msgId":1787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQSUVPQUNOQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDAyYjUwMWM0NjZmNyRlZWRjYTc5MCQ2NTAwYThjMEBMYXB0b3A+"},"prevInTopic":1765,"nextInTopic":1789,"prevInTime":1786,"nextInTime":1788,"topicId":1760,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1278864885\">&lt;&lt;&lt;&lt;&lt;&lt;&lt;Toward the end of the evening, ds reported that dd was *really<br/>\nannoying him* and he wanted our help to resolve the conflict. I asked him<br/>\nwhat he tried and it sounded as though he had really tried to work it out<br/>\nwith her. He asked her to stop and then asked her why she was ignoring him.<br/>\n(The really annoying had included hitting, throwing things, poking and<br/>\notherwise trying to arouse db who wanted to watch TV and he had invited her<br/>\nto join him.)<br/>\n<br/>\nI won&#39;t bother to tell you how it was resolved -- but it didn&#39;t come out<br/>\nwell. (Although no one was harmed in the making of this message.)<br/>\n<br/>\nSo now that I&#39;ve shared that LONG story. My question is really two fold --<br/>\nhow do you deal with a kid who&#39;s overtired and intentionally annoying her<br/>\nsib. And how might I have advised the sib to handle the situation on his own<br/>\n(he&#39;s been trying really hard to avoid a conflict with her this summer and<br/>\nas a team we&#39;ve been working hard on conflict resolution.)<br/>\n<br/>\nJeanne&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nI think this is a hard thing to advise on since a lot depends on your<br/>\nrelationship with dd and how she responds to whatever you decide to try.  I<br/>\nalso don&#39;t know what you tried or how she responded.  If it were my kids, I<br/>\nwould approach the cranky one and say &quot;ds just came in and asked for my<br/>\nhelp.  He said you&#39;ve been hitting him and throwing things at him.  Does<br/>\nthat sound right?&quot;  Then &quot;Are you feeling really tired or is it that you<br/>\nreally want to play with him and he wants to watch TV right now?&quot;  You have<br/>\nassumed overtired and you may be right, but then again, I have often assumed<br/>\nthat myself and found I was wrong.  I think it&#39;s easy to assume tiredness at<br/>\nall difficult behavior but it isn&#39;t always so.  Then I&#39;d respond to whatever<br/>\nthe reason was.  If she&#39;s tired, then maybe a quiet activity with you would<br/>\nbe good, or maybe she&#39;d like to go to bed and have a backrub.  If she wants<br/>\nto play with her brother, I&#39;d help her express that in words such as<br/>\n&quot;Brother, I really want to play such and such a game with you...can you<br/>\nwatch the tv another time so we can play together?&quot;  If he says yes,<br/>\nconflict resolved.  If he says &quot;No&quot;, then I&#39;d continue to work with dd on<br/>\nwhether playing a game with a parent would do the trick or not.  I do find<br/>\nthat even if no one is agreeing, once we have fleshed out the conflict in<br/>\npeaceful conversation, everyone is generally more willing to find some kind<br/>\nof solution even if it is not ideal.  I would certainly make it clear that<br/>\nmy dd should use her words and not her hands to say what she needs to say,<br/>\nand if she was unable to do that, I&#39;d remove her from the situation until<br/>\nshe could as I feel strongly about everyone feeling safe - and I express<br/>\nthat to my kids as &quot;It&#39;s important to me that everyone feel safe.  Since you<br/>\nare still hurting your brother, I&#39;m going to help you to a different room<br/>\nuntil you can use words instead of hands&quot;...<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":109977455,"authorName":"Nancy Hoegen","from":"&quot;Nancy Hoegen&quot; &lt;nancyhoegen@...&gt;","profile":"nancyhoegen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sib trouble & overtired How would you have handled it?","postDate":"1089520920","msgId":1765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjcWdlbytpcWdmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyYjUwMWM0NjZmNyRlZWRjYTc5MCQ2NTAwYThjMEBMYXB0b3A+"},"prevInTopic":1760,"nextInTopic":1787,"prevInTime":1764,"nextInTime":1766,"topicId":1760,"numMessagesInTopic":0,"msgSnippet":"how do you deal with a kid who s overtired and intentionally annoying her sib ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Hi Jeanne, Perhaps some would disagree","messageBody":"<div id=\"ygrps-yiv-1848067179\">&quot;how do you deal with a kid who&#39;s overtired and intentionally <br/>\nannoying her sib&quot; <br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\nHi Jeanne,<br/>\n<br/>\nPerhaps some would disagree with me, but I would have separated your <br/>\ndd from your ds... but would have tried to not use the separation as <br/>\na punishment.<br/>\n<br/>\nWe all get tired sometimes... & testy. Your dd was no different. When <br/>\nI&#39;m cranky, I try not to be with other people to avoid any potential <br/>\nconflicts. I feel we need to share that same advice with our <br/>\nchildren. I would have sent dd to her room explaining to her that she <br/>\nhad a real busy day and deserved some alone time. She can either go <br/>\nto bed early, or she can read/look at a book til she wants to sleep. <br/>\nOr I would have offered her a soothing warm bath to help her unwind <br/>\nbefore bed. I have offered these options many times to my own very <br/>\nactive dd. Explain to your dd that this is simply how one handles <br/>\nbeing tired, so even if she&#39;s upset this time, it&#39;ll be easier - more <br/>\nroutine, next time.<br/>\n<br/>\nI don&#39;t like punishment, but I also don&#39;t believe in tolerating <br/>\nunacceptable behavior - even if it&#39;s due to tiredness. Our title <br/>\nis &quot;PARENT&quot; not bystander. I believe in guidance & understanding, not <br/>\ntotalitarian tolerance.<br/>\nIt sounds like your ds did his part... it was wise of him to alert <br/>\nyou before any conflict escalated.<br/>\n<br/>\nBut that&#39;s just my two cents worth. All kids have their own unique <br/>\npersonalities & behaviors. You know your kids best... all families <br/>\nare works in progress. <br/>\n<br/>\nBest wishes,<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":83822299,"authorName":"Jeanne Goodman","from":"&quot;Jeanne Goodman&quot; &lt;goodmanj@...&gt;","profile":"desksideguru","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sib trouble & overtired How would you have handled it?","postDate":"1089516132","msgId":1760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYjUwMWM0NjZmNyRlZWRjYTc5MCQ2NTAwYThjMEBMYXB0b3A+"},"prevInTopic":0,"nextInTopic":1765,"prevInTime":1759,"nextInTime":1761,"topicId":1760,"numMessagesInTopic":0,"msgSnippet":"Ok, I really hope I m not overdoing it on the list, but I d really would like to hear how you would have handled this. It really started last night. Both dh","messageBody":"<div id=\"ygrps-yiv-168469061\">Ok, I really hope I&#39;m not overdoing it on the list, but I&#39;d really would like to hear how you would have handled this.<br/>\n<br/>\nIt really started last night. Both dh and I had to work this morning. I asked dd if she wanted to come with me to my meeting and she said she did. I suggested she get to bed early because we would have to get up early, but she didn&#39;t.<br/>\n<br/>\nShe did relatively well at the meeting -- she only interrupted me a few times while I was presenting to say that she was bored.<br/>\n<br/>\nAfter the meeting we went to lunch (I didn&#39;t control what she got. My tongue is sore from biting it.) Then we went to the thrift shop where I got her some clothing and a small toy. Then we got some video games that I&#39;ve put off getting because I thought they should be doing other things... but I digress. Let it suffice to say she was pleased with the day.<br/>\n<br/>\nToward the end of the evening, ds reported that dd was *really annoying him* and he wanted our help to resolve the conflict. I asked him what he tried and it sounded as though he had really tried to work it out with her. He asked her to stop and then asked her why she was ignoring him. (The really annoying had included hitting, throwing things, poking and otherwise trying to arouse db who wanted to watch TV and he had invited her to join him.)<br/>\n<br/>\nI won&#39;t bother to tell you how it was resolved -- but it didn&#39;t come out well. (Although no one was harmed in the making of this message.)<br/>\n<br/>\nSo now that I&#39;ve shared that LONG story. My question is really two fold -- how do you deal with a kid who&#39;s overtired and intentionally annoying her sib. And how might I have advised the sib to handle the situation on his own (he&#39;s been trying really hard to avoid a conflict with her this summer and as a team we&#39;ve been working hard on conflict resolution.)<br/>\n<br/>\nJeanne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1800,"nextTopicId":1606}}