{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":236481874,"authorName":"cindybablitz","from":"&quot;cindybablitz&quot; &lt;cindybablitz@...&gt;","profile":"cindybablitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Homeschool penpal group","postDate":"1235633068","msgId":38504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdvNWczYys1dXFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGducHRtMCtkcm45QGVHcm91cHMuY29tPg=="},"prevInTopic":38450,"nextInTopic":0,"prevInTime":38503,"nextInTime":38505,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"... I m writing a book at the moment.  (About unschooling.)  It s a book of essays -- one for every letter of the alphabet.  Advocacy, Beliefs, Cloning ...","messageBody":"<div id=\"ygrps-yiv-526505618\">... Catching up on a few days of reading! ...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do tend to think having me to write it for him would not be<br/>\n&gt; right.<br/>\n<br/>\n </span></blockquote>I&#39;m writing a book at the moment.  (About unschooling.)  It&#39;s a book <br/>\nof essays -- one for every letter of the alphabet.  Advocacy, <br/>\nBeliefs, Cloning ... like that.  <br/>\n<br/>\nMy nine year old and I were talking about my book last weekend, and <br/>\nabout my chapter titles, and his ideas for some chapter titles.  He <br/>\nstarted monologuing about cloning and it struck me to run and grab a <br/>\npiece of paper to transcript what he was saying.  <br/>\n<br/>\nAs he talked, I thought:  wouldn&#39;t it be cool to have one of my <br/>\nchapters about an unschooling life be written by my nine year old <br/>\nalways unschooled son?  And so I proposed the idea to Noah.  This, <br/>\nafter he just monologued a brilliant essay on cloning.  He hesitated <br/>\nand said, &quot;Well, I&#39;m not sure if I&#39;m good enough at writing to write <br/>\na whole chapter of your book.  I get tired after I write a while.&quot;  <br/>\n<br/>\nI realized, *he* was thinking that the creative act of &quot;writing&quot; was <br/>\nin the physical act of keyboarding, or putting pen to paper; while <br/>\n*I* think the creative act of &quot;writing&quot; is in the creative conjuring <br/>\nup of the ideas and words ... at which my babe is a chop off the old <br/>\nblock.  &lt;G&gt;  If I do say so myself.  And I do.  &lt;G&gt;  <br/>\n<br/>\nI said, &quot;Babe!  I can keyboard almost as fast as you can talk.  <br/>\n*Anyone* can record the spoken word!  But you who come up with the <br/>\nideas behind the words -- you are the &quot;Writer&quot;!&quot;<br/>\n<br/>\nAnd by that clarification, he decided, yeah, he could write my <br/>\nchapter on Cloning.  We&#39;re collaborating on that this weekend.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do tend to think having me to write it for him would not be<br/>\n&gt; right.<br/>\n<br/>\n </span></blockquote>Once Gutenberg made the brilliant hand drawings of all those <br/>\ntranscribing monks more or less an obsolete practice, perhaps its <br/>\nfair to say that &quot;writing&quot; isn&#39;t about tangible mechanics, but about <br/>\nthe more esoteric, intangible relationship building.  Even I don&#39;t <br/>\nexpect to know every reader of my book ... but I do create from a <br/>\nconviction that I am building a relationship with every reader <br/>\nnevertheless ... .  The &#39;how&#39; my ideas get conveyed, in the end, (as, <br/>\nafter an initial hard copy run, I plan to ultimately offer my <br/>\nchapters one at a time as a la carte e-books available for purchase <br/>\nonline) matter less than the &#39;why&#39; ... and maybe the same can be seen <br/>\nto be true for penpaling writers?<br/>\n<br/>\nloving,<br/>\n<br/>\nCindy<br/>\n<br/>\nHost of Alphabet Soup: 2009 Calgary Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.alphabetsoupconference.com/\">http://www.alphabetsoupconference.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlphabetSoupConference/\">http://groups.yahoo.com/group/AlphabetSoupConference/</a></div>","specialLinks":[]},{"userId":223756679,"authorName":"Mary Kay","from":"&quot;Mary Kay&quot; &lt;marykaysimoni@...&gt;","profile":"marykaysimoni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Homeschool penpal group","postDate":"1235418171","msgId":38450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdudXU3cittbjVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGducHRtMCtkcm45QGVHcm91cHMuY29tPg=="},"prevInTopic":38445,"nextInTopic":38504,"prevInTime":38449,"nextInTime":38451,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"Thanks for telling us about this.  this sounds great on so many levels. I just joined int he hopes of looking for penpals for my 6 y.o. twins, but I have a","messageBody":"<div id=\"ygrps-yiv-791698352\">Thanks for telling us about this.  this sounds great on so many <br/>\nlevels. I just joined int he hopes of looking for penpals for my 6 <br/>\ny.o. twins, but I have a question:  do they do this via snail mail or <br/>\nemail or both?  <br/>\n<br/>\nWhen I heard that someone was able to have their child dictate to <br/>\nthem, it piqued my curiosity for my own two, who are not yet reading <br/>\nor writing.  <br/>\n<br/>\nIt sounds exciting.  <br/>\n<br/>\nThanks again,<br/>\n<br/>\nMary Kay</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Homeschool penpal group","postDate":"1235389079","msgId":38445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4NzEwMThDLUQ5RTktNDdGNy05N0UzLTA0QkM4QTgwMDU3RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGducHRtMCtkcm45QGVHcm91cHMuY29tPg==","referencesHeader":"PGducHRtMCtkcm45QGVHcm91cHMuY29tPg=="},"prevInTopic":38430,"nextInTopic":38450,"prevInTime":38444,"nextInTime":38446,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"... People respond to words sent to the list, not to intent. This is not directed at you, or what you do in your home, but at the words and ideas put onto the","messageBody":"<div id=\"ygrps-yiv-156218062\">On Feb 21, 2009, at 5:02 PM, Pamela wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was just making a point that BY having pen pals my son started<br/>\n&gt; writing cursive on his own.<br/>\n<br/>\n </span></blockquote>What you said was:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son also has to WRITE which I use his letter writing as his<br/>\n&gt; handwriting practice.<br/>\n<br/>\n </span></blockquote>People respond to words sent to the list, not to intent.<br/>\n<br/>\nThis is not directed at you, or what you do in your home, but at the  <br/>\nwords and ideas put onto the list.<br/>\n<br/>\nHaving to write is not a helpful idea for an unschooling list --  <br/>\nthough it can spark enlightening discussion! Nor is using a child&#39;s  <br/>\nactivity as practice. I do see you emphasized WRITE meaning he&#39;s not  <br/>\nspeaking, but the &quot;have tos&quot; that live in our heads can be hugely  <br/>\nhelpful to examine.<br/>\n<br/>\nSandra Dodd has a good page on them:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Handwriting is something that he dreads as he<br/>\n&gt; has learning issues due to Dygraphia etc...so it is a good thing for<br/>\n&gt; me and easy to get him to reply to a letter he receives.<br/>\n<br/>\n<br/>\n&gt; It can<br/>\n&gt; surely not be a bad thing for him to have legible handwriting<br/>\n<br/>\n </span></blockquote>It can be useful, but it&#39;s helpful to natural learning to focus on  <br/>\nthe child&#39;s reasons rather than on goals that are external to the  <br/>\nchild. It&#39;s useful to be aware in the backs of our minds of side  <br/>\neffects that happen from real life activities, but helpful to let go  <br/>\nof external goals.<br/>\n<br/>\nThat is an unschooling concept that causes confusion. To get away  <br/>\nfrom from the schoolish idea of one path to one skill (reading  <br/>\npractice leads to reading, writing practice leads to writing, history  <br/>\ntexts lead to history knowledge), it&#39;s useful to be aware of the  <br/>\nmyriad of ways that life contributes to those skills. And, also, how  <br/>\nits rare for one activity to draw on only one skill! Parents look at  <br/>\nvideo games and think video game skills ;-) But video games probably  <br/>\ndraw on more skills than practically any other activity!<br/>\n<br/>\nThere are dozens of real reasons -- reasons the kids want to do --  <br/>\nfor kids to handwrite: notes, drawings with captions, comics, labels,  <br/>\nlists, collections, letters, cards, just for the fun of forming  <br/>\nletters :-) ... (There are also activities related to handwriting:  <br/>\nart made from letters (alphabet pasta in pictures, making a name out  <br/>\nof playdough, and so on), calligraphy, different fonts on the  <br/>\ncomputer (and how far a letter can be warped and still be the same  <br/>\nletter.)<br/>\n<br/>\n(For those with Macs, you might have Font Book installed that will  <br/>\nlet you see the different ways each font displays each letter. Under  <br/>\nEdit in the menu is &quot;Special Characters&quot;. When that opens, pull down  <br/>\nView (upper left on the palete) to display Roman. Scroll down the  <br/>\nleft hand list to Latin. Then over on the right you can click on  <br/>\nletters and see the variations on &quot;A&quot; and &quot;f&quot; and so on. It&#39;s lots  <br/>\nmore impressive if you have a lot of different fonts :-) And of  <br/>\ncourse there&#39;s loads of other things to explore in the character  <br/>\npalate. (Dingbats and foreign fonts.) You can also pull the letters  <br/>\noff the lower palete into some documents (like Pages and Mail) and  <br/>\ncreate sort of a ransom note effect.)<br/>\n<br/>\nBut once we have confidence that we can have real opportunities for  <br/>\nkids to handwrite running through their lives, activities they can  <br/>\npick up or ignore as the muse strikes them, it helps unschooling to  <br/>\nflourish to focus on the joy of the activity rather than the side  <br/>\neffect.<br/>\n<br/>\nAlso by focusing on the joy in the activity, it&#39;s *lots* easier to  <br/>\nlet go of unconscious pressure towards the side effect that we see as  <br/>\nuseful.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ...and a<br/>\n&gt; pen pal FRIEND is just one way to re-enforce his handwriting skills<br/>\n&gt; and encourage him to learn about the places his friends live.<br/>\n<br/>\n </span></blockquote>Absolutely. And it&#39;s helpful for people still thinking in school  <br/>\nterms to see how skills acquired through practice in school are  <br/>\nnatural to life. But it&#39;s also helpful once someone begins  <br/>\nunschooling to let those go and focus on the child and running many  <br/>\nopportunities for what the child enjoys through the child&#39;s life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do<br/>\n&gt; tend to think if having me to write it for him would not be<br/>\n&gt; right..especially since the pen pal took the effort to write his own<br/>\n&gt; letters.<br/>\n<br/>\n </span></blockquote>And lots of parents send their kids to school and those kids aren&#39;t  <br/>\ntoo happy that ours get to stay home! But would it be right to send  <br/>\nour children to school so the other children aren&#39;t jealous?<br/>\n<br/>\nAnd some kids are writing under duress because the *other* child has  <br/>\nwritten his own letter. It&#39;s a vicious cycle of kids who are  <br/>\ngathering unpleasant associations with writing and handwriting.<br/>\n<br/>\nThe focus of unschooling should foremost be the relationship, between  <br/>\nchild and parent *and* between child and what they&#39;re doing too.<br/>\n<br/>\nThose little guilt trips are  helpful to let go for both the  mom and  <br/>\nthe child! Joy and guilt aren&#39;t a good mix!<br/>\n<br/>\nMaybe a useful-to-beginning-unschooling way to look at pen pal  <br/>\nletters (and other real life activities kids take on) is a multi-step  <br/>\nprocess:<br/>\n<br/>\n1, See *lots* of the skills an activity touches on. For the pan pal  <br/>\nactivity it&#39;s: geography, handwriting, writing, social connections,  <br/>\nsocial awareness, art, math, postal service and so on. I&#39;m not saying  <br/>\nyou do the following -- and you say later that you don&#39;t -- but it&#39;s  <br/>\na good thing for others to see written out: If mom focuses on one of  <br/>\nthose skills and pressures the child to do the activity because it&#39;s  <br/>\ngood for handwriting or geography, she runs the risk of 1) creating  <br/>\nunpleasant associations with the activity and skill so the child will  <br/>\nwant to avoid other opportunities that remind them of the  <br/>\nunpleasantness, and 2) the child deciding the activity isn&#39;t fun so  <br/>\ndropping it and missing out on the other connections.<br/>\n<br/>\n2. Seeing lots of *other* ways life draws on those skills. That way  <br/>\nit doesn&#39;t feel like one activity is any more important than any  <br/>\nother activity. It helps us let go of the irrational fear that if he  <br/>\ndoesn&#39;t write pen pal letters, how will he ever learn to write!  <br/>\nDuring the time a child is writing pen pal letters, they&#39;re *not*  <br/>\nmaking labels or cartoons or playing with letter stamps. They&#39;re also  <br/>\n*not* doing something that may be more meaningful to them in their  <br/>\nright now life that involves art or math or physical skills or strategy.<br/>\n<br/>\n3. And finally, completely let go of the idea that activities lead to  <br/>\nskills :-) Focus on helping kids find activities that they enjoy.  <br/>\nFocus on letting go of the less fun parts and/or find ways to make  <br/>\nthem enjoyable. Be confident in the knowledge that basic skills are  <br/>\ndrawn on for loads of activities. (It&#39;s why they&#39;re basic!)<br/>\n<br/>\n4. Focus on your child. What does he love to do? Help him find more  <br/>\nof that and expand on it to the level that *he* wants :-)<br/>\n<br/>\n4. Let yourself occasionally look at the skills and school subjects.  <br/>\n(This is most helpful after someone is fully confident that life  <br/>\nactivities draw on lots of skills.) I think it&#39;s easy for our own  <br/>\nbiases of favorite activities to skew what we choose to strew. I know  <br/>\nI strewed more books than out of the house activities. I got lucky  <br/>\nthat Kathryn was very similar to my personality but the more an  <br/>\nunschooling mom reaches beyond her own likes for potential new  <br/>\ninterests the more helpful the strewing will be since our kids are  <br/>\nnot us :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That is why if he is not in the mood to write much, we send a<br/>\n&gt; picture of one of our animals or something he finds his friend will be<br/>\n&gt; interested in.<br/>\n<br/>\n </span></blockquote>And that&#39;s exactly how unschooling can work. :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Homeschool penpal group","postDate":"1235333103","msgId":38430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduc2I1Zit0a3B0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGducHRtMCtkcm45QGVHcm91cHMuY29tPg=="},"prevInTopic":38421,"nextInTopic":38445,"prevInTime":38429,"nextInTime":38431,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"... Kids are often motivated to do things when they see a reason for - its a good example of that, for sure. At the same time, this sort of thing can be used","messageBody":"<div id=\"ygrps-yiv-1723298635\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Pamela&quot; <br/>\n&lt;ohwhatacruise@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I was just making a point that BY having pen pals my son started<br/>\n&gt; writing cursive on his own.<br/>\n<br/>\n </span></blockquote>Kids are often motivated to do things when they see a reason for - <br/>\nits a good example of that, for sure. <br/>\n<br/>\nAt the same time, this sort of thing can be used as a tactic for <br/>\ntrying to motivate a child to do something he or she doesn&#39;t want to <br/>\ndo, or isn&#39;t ready to do - and then its counterproductive. I&#39;m not <br/>\nsaying that&#39;s what you did! Its more a caveat for anyone <br/>\nwondering &quot;how do I get my kid to do xyz...&quot; Opportunities are good, <br/>\nmanipulation, though, can undermine learning big time.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I do<br/>\n&gt; tend to think if having me to write it for him would not be<br/>\n&gt; right..especially since the pen pal took the effort to write his own<br/>\n&gt; letters. That is why if he is not in the mood to write much, we <br/>\n </span></blockquote>send a<br/>\n<blockquote><span title=\"ireply\"> &gt; picture of one of our animals or something he finds his friend will <br/>\n </span></blockquote>be<br/>\n<blockquote><span title=\"ireply\"> &gt; interested in. <br/>\n<br/>\n </span></blockquote>It makes good sense to give him options besides writing, pictures are <br/>\na good idea.<br/>\n<br/>\n I&#39;m happy to write things for Mo, when she asks, although she likes <br/>\nto write much of the time. Sometimes her mind is going so much faster <br/>\nthan she can write - faster than I can write, even! Typing is a <br/>\nlittle easier, when I remember. I can see where, with a letter, you&#39;d <br/>\nbe concerned about it seeming authentic - typing might be a good <br/>\ncompromise, there. You could use a font that&#39;s more like handwriting, <br/>\nor just something quirky and fun if he really had a Lot to say but <br/>\ndidn&#39;t have the energy to write it all out longhand. That&#39;s the <br/>\nbiggest potential issue with not-writing for kids, it shuts down <br/>\ntheir ability to express themselves in print if their hands can&#39;t <br/>\nkeep up with their thoughts.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why I felt the need to explain myself is beyond me.....<br/>\n<br/>\n </span></blockquote>I&#39;m sorry you felt misunderstood or attacked. Sharing information <br/>\nlike this can be pretty nuancy... it can leave you feeling a <br/>\nlittle &quot;raw&quot; when someone makes a comment that you didn&#39;t expect. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":293322409,"authorName":"Pamela","from":"&quot;Pamela&quot; &lt;ohwhatacruise@...&gt;","profile":"ohwhatacruise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Homeschool penpal group","postDate":"1235253760","msgId":38421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGducHRtMCtkcm45QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQjYwQkMwMUI3N0IzMS0xMUUwLTI5OEFAV0VCTUFJTC1NWjI5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":38393,"nextInTopic":38430,"prevInTime":38420,"nextInTime":38422,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"I was just making a point that BY having pen pals my son started writing cursive on his own. The pen pals seemed to motivate him and he started saying LOOK AT","messageBody":"<div id=\"ygrps-yiv-1863422574\">I was just making a point that BY having pen pals my son started<br/>\nwriting cursive on his own. The pen pals seemed to motivate him and he<br/>\nstarted saying &quot;LOOK AT MY CURSIVE&quot; and he took out a USA map puzzle<br/>\nand found where the kids live who wrote to him. If he wants to just<br/>\nprint a picture of his dog and write on the back THIS IS MY DOG<br/>\nMICHAEL JORDAN, then he does that and sends it...<br/>\n<br/>\n Unschooling to some is not the same as it is to others. I am ALL<br/>\nabout giving him options and letting him enjoy his own writing. It can<br/>\nsurely not be a bad thing for him to have legible handwriting...and a<br/>\npen pal FRIEND is just one way to re-enforce his handwriting skills<br/>\nand encourage him to learn about the places his friends live. I do<br/>\ntend to think if having me to write it for him would not be<br/>\nright..especially since the pen pal took the effort to write his own<br/>\nletters. That is why if he is not in the mood to write much, we send a<br/>\npicture of one of our animals or something he finds his friend will be<br/>\ninterested in. <br/>\n<br/>\nWhy I felt the need to explain myself is beyond me..... <br/>\n <br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelly Lovejoy<br/>\n&lt;kbcdlovejo@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: Pamela &lt;ohwhatacruise@...&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/homeschoolpen-pals\">http://groups.yahoo.com/group/homeschoolpen-pals</a><br/>\n&gt; <br/>\n&gt; My 8 yr old has gotten 6 pen pals from all over the USA from this site<br/>\n&gt; and it is interesting for him to learn of geography looking up where<br/>\n&gt; his new pen pal friends live. SO check here for a pen pal for your<br/>\n&gt; kids if you are still looking for pen pals! <br/>\n&gt; <br/>\n&gt; My son also has to WRITE which I use his letter writing as his<br/>\n&gt; handwriting practice. Handwriting is something that he dreads as he<br/>\n&gt; has learning issues due to Dygraphia etc...so it is a good thing for<br/>\n&gt; me and easy to get him to reply to a letter he receives. <br/>\n&gt; <br/>\n&gt; Hope this is helpful, sure helped my son to write cursive on his own!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ***************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I just want to stress that the *goal* of having penpals should NOT<br/>\n </span></blockquote>be the act of writing.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Children don&#39;t *have to* write to have penpals. Mom can do the<br/>\n </span></blockquote>writing. The goal should be making new friends. The writing and<br/>\ngeography are *side effects* of having a penpal: we want to correspond<br/>\nwith a friend and find out about where he lives.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; That&#39;s how unschooling works. We learn what we need to<br/>\n </span></blockquote>learn---because it behooves us. We can learn some really, really<br/>\ndifficult things if we *want* to.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Â ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; &quot;Live as if you were to die tomorrow.  Learn as if you were to live<br/>\n </span></blockquote>forever.&quot; ~Gandhi<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":188090558,"authorName":"pebsflower","from":"&quot;pebsflower&quot; &lt;oceanblue_1000@...&gt;","profile":"pebsflower","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Homeschool penpal group","postDate":"1235063158","msgId":38392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduazNobStwMGk3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGduazEyZys4YTF2QGVHcm91cHMuY29tPg=="},"prevInTopic":38386,"nextInTopic":38393,"prevInTime":38391,"nextInTime":38393,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"... al over the world. Join today and be part of it!  You will be able to participate in echangeing post cards with many unschooolers and homeschoolers i lots","messageBody":"<div id=\"ygrps-yiv-1861493611\">--- Oh, this group is getting ready to launch a post card exchange for<br/>\nal over the world. Join today and be part of it!  You will be able to<br/>\nparticipate in echangeing post cards with many unschooolers and<br/>\nhomeschoolers i lots of dirrerent places. This is a great way t see<br/>\nthe world!<br/>\n<br/>\nEven adults can participate here!<br/>\nPebs<br/>\nIn <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;carenkh&quot; &lt;carenkh@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; My oldest did not like writing, even on the computer. But he had<br/>\n&gt; *amazing* story ideas, so I&#39;d sit at the computer and type, and he&#39;d<br/>\n&gt; dictate. I typed for him on message boards, too. Without me even<br/>\n&gt; realizing it, he started writing for himself at least a couple years<br/>\n&gt; ago. It just gradually stopped! But I always joyfully wrote or typed<br/>\n&gt; for him when he asked, until one day I noticed that HE was typing for<br/>\n&gt; a friend of HIS! It happened with no coercion, no need for me to<br/>\n&gt; &quot;teach&quot; him anything.<br/>\n&gt; <br/>\n&gt; I had doubted that; I have friends who believe if you do for a child<br/>\n&gt; what they &quot;should&quot; be able to do for themselves, you&#39;re sending them<br/>\n&gt; the message that you think they *can&#39;t* do it. That&#39;s not how it<br/>\n&gt; worked out for us! Nor for thousands of other unschoolers.<br/>\n&gt; <br/>\n&gt; What is the purpose of pen pals? Communication, connection, fun,<br/>\n&gt; getting to know someone, getting to hear about different cultures.<br/>\n&gt; Writing will happen organically; maybe not through pen pals<br/>\n&gt; specifically, but watching you write will help that along, certainly.<br/>\n&gt; One thing I love about unschooling is you can DROP the need for your<br/>\n&gt; kids to learn; if you aim for joy, learning will happen.<br/>\n&gt; <br/>\n&gt; Caren<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":188090558,"authorName":"pebsflower","from":"&quot;pebsflower&quot; &lt;oceanblue_1000@...&gt;","profile":"pebsflower","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Homeschool penpal group","postDate":"1235063036","msgId":38393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduazNkcys1aGNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGduazEyZys4YTF2QGVHcm91cHMuY29tPg=="},"prevInTopic":38392,"nextInTopic":38421,"prevInTime":38392,"nextInTime":38394,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"--Hi. What is the purpose of pen pals? Communication, connection, fun, getting to know someone, getting to hear about different cultures. Writing will happen","messageBody":"<div id=\"ygrps-yiv-1401545715\">--Hi. &quot;What is the purpose of pen pals? Communication, connection, fun,<br/>\ngetting to know someone, getting to hear about different cultures.<br/>\nWriting will happen organically; &quot;<br/>\nWriting does happen organiclay...just like anything else children<br/>\nlearn..they learn it when and how it is best for them. This is the<br/>\ngreat part about being unschooled..we can use this to benifit the child. <br/>\nI love how you worded the What is the perpose of pen pals...this is great!<br/>\n<br/>\nPebs<br/>\n- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;carenkh&quot; &lt;carenkh@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; My oldest did not like writing, even on the computer. But he had<br/>\n&gt; *amazing* story ideas, so I&#39;d sit at the computer and type, and he&#39;d<br/>\n&gt; dictate. I typed for him on message boards, too. Without me even<br/>\n&gt; realizing it, he started writing for himself at least a couple years<br/>\n&gt; ago. It just gradually stopped! But I always joyfully wrote or typed<br/>\n&gt; for him when he asked, until one day I noticed that HE was typing for<br/>\n&gt; a friend of HIS! It happened with no coercion, no need for me to<br/>\n&gt; &quot;teach&quot; him anything.<br/>\n&gt; <br/>\n&gt; I had doubted that; I have friends who believe if you do for a child<br/>\n&gt; what they &quot;should&quot; be able to do for themselves, you&#39;re sending them<br/>\n&gt; the message that you think they *can&#39;t* do it. That&#39;s not how it<br/>\n&gt; worked out for us! Nor for thousands of other unschoolers.<br/>\n&gt; <br/>\n&gt; What is the purpose of pen pals? Communication, connection, fun,<br/>\n&gt; getting to know someone, getting to hear about different cultures.<br/>\n&gt; Writing will happen organically; maybe not through pen pals<br/>\n&gt; specifically, but watching you write will help that along, certainly.<br/>\n&gt; One thing I love about unschooling is you can DROP the need for your<br/>\n&gt; kids to learn; if you aim for joy, learning will happen.<br/>\n&gt; <br/>\n&gt; Caren<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Homeschool penpal group","postDate":"1235060624","msgId":38386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduazEyZys4YTF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGduam9vcitvYTBoQGVHcm91cHMuY29tPg=="},"prevInTopic":38385,"nextInTopic":38392,"prevInTime":38385,"nextInTime":38387,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"My oldest did not like writing, even on the computer. But he had *amazing* story ideas, so I d sit at the computer and type, and he d dictate. I typed for him","messageBody":"<div id=\"ygrps-yiv-695799071\">My oldest did not like writing, even on the computer. But he had<br/>\n*amazing* story ideas, so I&#39;d sit at the computer and type, and he&#39;d<br/>\ndictate. I typed for him on message boards, too. Without me even<br/>\nrealizing it, he started writing for himself at least a couple years<br/>\nago. It just gradually stopped! But I always joyfully wrote or typed<br/>\nfor him when he asked, until one day I noticed that HE was typing for<br/>\na friend of HIS! It happened with no coercion, no need for me to<br/>\n&quot;teach&quot; him anything.<br/>\n<br/>\nI had doubted that; I have friends who believe if you do for a child<br/>\nwhat they &quot;should&quot; be able to do for themselves, you&#39;re sending them<br/>\nthe message that you think they *can&#39;t* do it. That&#39;s not how it<br/>\nworked out for us! Nor for thousands of other unschoolers.<br/>\n<br/>\nWhat is the purpose of pen pals? Communication, connection, fun,<br/>\ngetting to know someone, getting to hear about different cultures.<br/>\nWriting will happen organically; maybe not through pen pals<br/>\nspecifically, but watching you write will help that along, certainly.<br/>\nOne thing I love about unschooling is you can DROP the need for your<br/>\nkids to learn; if you aim for joy, learning will happen.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Homeschool penpal group","postDate":"1235056517","msgId":38385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjYwQkMwMUI3N0IzMS0xMUUwLTI5OEFAV0VCTUFJTC1NWjI5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGduam9vcitvYTBoQGVHcm91cHMuY29tPg==","referencesHeader":"PGduam9vcitvYTBoQGVHcm91cHMuY29tPg=="},"prevInTopic":38384,"nextInTopic":38386,"prevInTime":38384,"nextInTime":38386,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"... From: Pamela  http://groups.yahoo.com/group/homeschoolpen-pals My 8 yr old has gotten 6 pen pals from all over the USA from this","messageBody":"<div id=\"ygrps-yiv-1517047806\">-----Original Message-----<br/>\nFrom: Pamela &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ohwhatacruise@...\">ohwhatacruise@...</a>&gt;<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/homeschoolpen-pals\">http://groups.yahoo.com/group/homeschoolpen-pals</a><br/>\n<br/>\nMy 8 yr old has gotten 6 pen pals from all over the USA from this site<br/>\nand it is interesting for him to learn of geography looking up where<br/>\nhis new pen pal friends live. SO check here for a pen pal for your<br/>\nkids if you are still looking for pen pals! <br/>\n<br/>\nMy son also has to WRITE which I use his letter writing as his<br/>\nhandwriting practice. Handwriting is something that he dreads as he<br/>\nhas learning issues due to Dygraphia etc...so it is a good thing for<br/>\nme and easy to get him to reply to a letter he receives. <br/>\n<br/>\nHope this is helpful, sure helped my son to write cursive on his own!<br/>\n<br/>\n<br/>\n***************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI just want to stress that the *goal* of having penpals should NOT be the act of writing.<br/>\n<br/>\n<br/>\n<br/>\nChildren don&#39;t *have to* write to have penpals. Mom can do the writing. The goal should be making new friends. The writing and geography are *side effects* of having a penpal: we want to correspond with a friend and find out about where he lives.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThat&#39;s how unschooling works. We learn what we need to learn---because it behooves us. We can learn some really, really difficult things if we *want* to.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;Live as if you were to die tomorrow.  Learn as if you were to live forever.&quot; ~Gandhi<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":293322409,"authorName":"Pamela","from":"&quot;Pamela&quot; &lt;ohwhatacruise@...&gt;","profile":"ohwhatacruise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Homeschool penpal group","postDate":"1235052123","msgId":38384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduam9vcitvYTBoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":38385,"prevInTime":38383,"nextInTime":38385,"topicId":38384,"numMessagesInTopic":0,"msgSnippet":"http://groups.yahoo.com/group/homeschoolpen-pals My 8 yr old has gotten 6 pen pals from all over the USA from this site and it is interesting for him to learn","messageBody":"<div id=\"ygrps-yiv-1596384240\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/homeschoolpen-pals\">http://groups.yahoo.com/group/homeschoolpen-pals</a><br/>\n<br/>\nMy 8 yr old has gotten 6 pen pals from all over the USA from this site<br/>\nand it is interesting for him to learn of geography looking up where<br/>\nhis new pen pal friends live. SO check here for a pen pal for your<br/>\nkids if you are still looking for pen pals! <br/>\n<br/>\nMy son also has to WRITE which I use his letter writing as his<br/>\nhandwriting practice. Handwriting is something that he dreads as he<br/>\nhas learning issues due to Dygraphia etc...so it is a good thing for<br/>\nme and easy to get him to reply to a letter he receives. <br/>\n<br/>\nHope this is helpful, sure helped my son to write cursive on his own!<br/>\n:) Pam</div>","specialLinks":[]}],"prevTopicId":38500,"nextTopicId":38471}}