{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:toddler Question","postDate":"1151860441","msgId":15251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3MDIyMDA2MTcxNC40NjUyLjQ0QTdGRUQ5MDAwMjAxQ0IwMDAwMTIyQzIyMDI4ODg3NDQwMjBFMDMwNTBDMDcwODAwMDNAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":15250,"nextInTime":15252,"topicId":15251,"numMessagesInTopic":0,"msgSnippet":"Hi, I only skimmed the first round of replys, but your new examples caught my attention. My middle guy, almost 3 when the baby was born, was a runner. Very","messageBody":"<div id=\"ygrps-yiv-407561673\">Hi,<br/>\n<br/>\nI only skimmed the first round of replys, but your new examples caught my attention. My middle guy, almost 3 when the baby was born, was a runner. Very fast. I understand the safety issues you are talking about. We did alot of different things, but from my memory here is how I helped my toddler be safe while allowing them autonomy.<br/>\n<br/>\nI had a double stroller and encourgaed my middle guy to climb aboard the train in unsafe terrain. I also had a baby stroller and he could push his trucks/critters like a daddy. I would chase him around the house before leaving, then talk about where walking is safe and when he could start to run. After 1 time of him running across a busy street to get to the car, I never ever parked across from where we were going. I just found a spot on the same side of the street. This one was major as my guy loved to just go to the car without notice.<br/>\n<br/>\nTalking before hand when you know a behavior is likely can help, like, I know how much you love to run, when we get to the little bit of grass, then running is safe. Also find ways to make walking fun. Can he hop, can he skip, can he bounce like Tigger or do some other crazy walk. Make the walking fun instead of a no running. We played eye spy alot on walks.<br/>\n<br/>\nAnd don&#39;t go if you can&#39;t be safe. Not in a we can&#39;t go to the park because you can&#39;t walk. Just don&#39;t go, or drive to one that you can open the door and let him run. I didn&#39;t take my guy to the library, zoo, or downtown with me as the only adult with 3 kids, 1 an infant. He was not safe because he was so fast and lived to run. When my hubby or sister was with me, then I could hold his hand and run with him safely.<br/>\n<br/>\nOn teeth. I bring my 11 year old her toothbrush and a cup when she is so invovled she can&#39;t get up. A wash cloth helps, so does water. And how they treat their baby teeth is no indication of how they will treat their adult teeth at 7 and 8.It is ok to forget and do a double brush job in the am. My guy had dental caries as a baby and he is a fantastic tooth brusher now and has no cavities. His hygenist told him he has rarely seen such well brushed teeth in a child. We use the sonicare brushes.<br/>\n<br/>\nMy middle guy is 9. He still runs. He still is incredible fast. He likes to travel on a wave board now. I still talk with him about safe and unsafe places. When he wants to travel through a parking lot, I remind him to be away from the cars as they can&#39;t see him when he is right behind them. He has an ear for the sound of cars starting and has not been in any close calls.<br/>\n<br/>\nMy points, to make the relationship with your toddler one of partnership. Not a hierachy, mom&#39;s way goes. Each situation is a chance to connect together to be safe, happy, healthy. Making a child do with deteriorate what you are trying to establish. It is hard with a newborn in the house. Help from others is my suggestion. Even a 9 year old can be of help pushing a baby while you hold hands with your toddler. Finding creative ways to keep everyone safe is your goal.<br/>\n<br/>\nMary<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15242,"nextTopicId":15267}}