{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: introduction","postDate":"1328879791","msgId":47913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUxQzA5QUZAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47911,"nextInTopic":0,"prevInTime":47912,"nextInTime":47914,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"... Just an at-a-glance quick look online re: Oregon homeschooling laws. First, The person administering the examination shall score it and report the results","messageBody":"<div id=\"ygrps-yiv-2078059856\"><blockquote><span title=\"ireply\">&gt; also, what do you do about the state mandated testing??  i am in Oregon and we are required to register as homeschoolers (well send a letter of intent to homeschool) by the age of 7yrs and then test in grades 3, 5, 8 and 10.. i would be worried that he would not do well in the tests..<br/>\n<br/>\n </span></blockquote>Just an at-a-glance quick look online re: Oregon homeschooling laws.<br/>\n<br/>\nFirst, &quot;The person administering the examination shall score it and report the results to the parent or legal guardian. Test results are reported to the ESD only if the superintendent of the ESD requests them. ORS § 339.035(3)(c) and (d); OAR 581-021-0026 (5)(b) and (c).&quot;<br/>\n<br/>\nSo, the test scores only go to you unless someone actually requests them (and there are several tests to choose from, it doesn&#39;t have to be the same as the public schools in the area are doing that year). Also, in further paragraphs, it appears that it is a percentile score - not percentage score. That means that an individual child is scored not on how many right and wrong they get but on how many they get right relative to all the other kids that took the same test in the same timeframe. So, it&#39;s possible for someone to get above the 15th percentile on a test and only get 3 of 100 questions correct - if 14 of 100 others only get 2 correct, then 3 correct is the 15th percentile. Then, beyond that, it&#39;s kind of a &quot;3 strikes&quot; thing - IF they request scores and IF they are lower than the minimum requirement, then they have to retest the following year. IF they again are lower than the requirement, there&#39;s some &quot;remediation&quot; type stuff involved. Only IF they score low a third time, is there any major ramification (like being required to attend public school).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: introduction","postDate":"1328814164","msgId":47911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpoMTU4ays4ZGs3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjg4MDg5ODIuOTk5NTQuWWFob29NYWlsTmVvQHdlYjEyMDUwMy5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":47910,"nextInTopic":47913,"prevInTime":47910,"nextInTime":47912,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"... ***************** Regardless of any disorders, it s really really normal for kids to be very resistant of externally imposed structure. As you step away","messageBody":"<div id=\"ygrps-yiv-576941433\">Korah &lt;buzymom93@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I have been really struggling with finding the right &quot;method&quot; for us.. it seems the more structured i try to be, the more stressed he gets and the  harder it gets... yelling and crying and not wanting to do anything.. you see my son has Anxiety disorder, Regulatory disorder, a slight speech disorder, and ADHD.. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nRegardless of any disorders, it&#39;s really really normal for kids to be very resistant of externally imposed structure. As you step away from trying to &quot;get&quot; him to do and learn and move toward being his ally and partner, you&#39;ll find a lot of resistance goes away for the simple reason that there&#39;s nothing for him to resist. That&#39;s one of the wonderful aspects of unschooling - you get to discover who your child is without all that antagonism. Over time, you may find, like many other unschoolers, that you don&#39;t need to refer to those disorders any more - you&#39;ll have a kid with some quirks who needs your help sometimes. Keep that in mind as you read on this list - it&#39;s hard to tell which of our quirky kids might have diagnoses from what people say about unschooling, because the principles of unschooling don&#39;t change, only the details. <br/>\n<br/>\nThat being said, a lot of kids Do like routines and predictability - but those are things which can grow organically, too. I have a good sense of when my daughter is most likely to be active, when she&#39;s likely to be deep in a project, when she&#39;s hungry... because she tends to follow a regular, predictable rhythm. She has a &quot;schedule&quot; of sorts, but it&#39;s Her schedule, not one which has been created for her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;i don&#39;t want him to hate learning and feel stressed like that.. i want to enjoy learning new things and have the desire to as well..  I have been looking into unschooling as i learn more about it it seems like he could really blossom in it.. I am just now quite sure how...<br/>\n </span></blockquote>****************<br/>\n<br/>\nThe best place to start is by relaxing and taking things easy for awhile. Take a break from anything &quot;educational&quot; and focus on enjoyment and connecting with your son. Learning is something people do naturally - humans are naturally driven to learn... until teaching gets in the way. So while you&#39;re relaxing, take some time to read about how learning doesn&#39;t depend on teaching or even creating &quot;learning opportunities&quot; - learning is a natural part of living. Here&#39;s a good place to start reading about natural learning:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;if i left him to his own devices he would stay in his jammies and lay in bed most of the day watching tv... or go outside and play and ride his scooter.. lol... he just won&#39;t take any initiative to do any school stuff on his own..<br/>\n </span></blockquote>******************<br/>\n<br/>\nNatural learning generally doesn&#39;t look like &quot;school stuff&quot;. Most often, it looks like playing, riding a scooter, watching tv, daydreaming, talking, playing video games, taking a bath, going to the store... living life in general. Looking for &quot;school stuff&quot; can get in the way of unschooling! That&#39;s why it can be important for parents to think and read about learning - real learning, which is frequently experiential. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/deschooling/deschoolingmom.html\">http://joyfullyrejoycing.com/deschooling/deschoolingmom.html</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; also, what do you do about the state mandated testing??<br/>\n<br/>\n </span></blockquote>Check with local groups for details - it will vary a lot from state to state. In a place like yours, where testing isn&#39;t every year, some homeschoolers undoubtedly &quot;skip&quot; those years on paper, so they don&#39;t ever test. If that doesn&#39;t interest you, find out what is done with the results. If they&#39;re just kept on file somewhere, then the easiest thing could be to take the test and never bother with the results. Or, you may have an &quot;umbrella school&quot; or &quot;charter school&quot; option, where you become a kind of private school and thus aren&#39;t subject to the same requirements. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":256730131,"authorName":"Korah","from":"Korah &lt;buzymom93@...&gt;","profile":"buzymom93","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"introduction","postDate":"1328808982","msgId":47910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjg4MDg5ODIuOTk5NTQuWWFob29NYWlsTmVvQHdlYjEyMDUwMy5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":30806,"nextInTopic":47911,"prevInTime":47909,"nextInTime":47911,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"Hello, my name is Korah and i am a single mamma to 2 boys! my oldest is 19yrs old and recently received his ged..(homeschooled since 7th grade) my youngest is","messageBody":"<div id=\"ygrps-yiv-1981712080\">Hello,<br/>\nmy name is Korah and i am a single mamma to 2 boys! my oldest is 19yrs old and recently received his ged..(homeschooled since 7th grade) my youngest is just about to be 7yrs old.  minus his special ed class he took at ages 3 and 4 and a 2 month trial in Kinder ps (big, i mean huge mistake).. we have been homeschoolers.. I have been really struggling with finding the right &quot;method&quot; for us.. it seems the more structured i try to be, the more stressed he gets and the  harder it gets... yelling and crying and not wanting to do anything.. you see my son has Anxiety disorder, Regulatory disorder, a slight speech disorder, and ADHD.. so he tends to stress easily and we have to take it slow.. i don&#39;t want him to hate learning and feel stressed like that.. i want to enjoy learning new things and have the desire to as well..  I have been looking into unschooling as i learn more about it it seems like he could really blossom in it.. I am just now quite sure how<br/>\n to go about it.. right now we have been working on a 1st grade level.. but if i left him to his own devices he would stay in his jammies and lay in bed most of the day watching tv... or go outside and play and ride his scooter.. lol... he just won&#39;t take any initiative to do any school stuff on his own.. I know he is young still so i don&#39;t push too much....<br/>\n<br/>\nalso, what do you do about the state mandated testing??  i am in Oregon and we are required to register as homeschoolers (well send a letter of intent to homeschool) by the age of 7yrs and then test in grades 3, 5, 8 and 10.. i would be worried that he would not do well in the tests.. <br/>\n<br/>\n<br/>\nwell thanks for listening to my ramblings and worries, i look forward to getting to know you guys!<br/>\n<br/>\n Korah<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299778173,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;dnkmeadows@...&gt;","profile":"dnkmeadows","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"introduction","postDate":"1205351312","msgId":30806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZyOWMyZytsNDRvQGVHcm91cHMuY29tPg=="},"prevInTopic":22551,"nextInTopic":47910,"prevInTime":30805,"nextInTime":30807,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"Hi, I m Kristi. I am the mother of a 13 month old baby boy, Cadan, who I am planning on unschooling. I was homeschooled from 3rd grade through graduation. My","messageBody":"<div id=\"ygrps-yiv-2133661446\">Hi, I&#39;m Kristi. I am the mother of a 13 month old baby boy, Cadan, <br/>\nwho I am planning on unschooling. I was homeschooled from 3rd grade <br/>\nthrough graduation. My mother used varying type of schooling (as <br/>\nmost families do) including unschooling; so this isn&#39;t new to me but <br/>\nI&#39;m hoping to make it my own. I don&#39;t want to school Cadan the exact <br/>\nway my mother schooled me because he isn&#39;t me. I&#39;ve joined this <br/>\ngroup to help me put together ideas, get started and I&#39;m sure I&#39;ll <br/>\nneed encouragement alont the way :)<br/>\n<br/>\nI&#39;m a full time working mom which is one reason I&#39;m choosing <br/>\nunschooling because I don&#39;t have time for text books, lesson plans <br/>\nand testing. My husband is home during the day and is willing to <br/>\nwork with Cadan but is pretty nervous about the idea of <br/>\nhomeschooling and being ultimately responsible for our son&#39;s <br/>\neducation which I think is normal for most parents who were not <br/>\nhomeschooled themsevles). Is anyone else is a similar situation?<br/>\n<br/>\nAs I said before, Cadan is only 13 months now so we&#39;re a long way <br/>\noff from details, we&#39;re are currently reading together, playing <br/>\nsorting games, playing outdoors and all those other energetic things <br/>\nthat toddlers enjoy. We try to give him things to do but allow him <br/>\ntime to relax too. <br/>\n<br/>\nAnyway, sorry for the long rample. I hope to get to know you all <br/>\nsoon ~ Kristi</div>","specialLinks":[]},{"userId":198231842,"authorName":"Erica Iwamura","from":"&quot;Erica Iwamura&quot; &lt;hakujin777@...&gt;","profile":"hakujin777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:introduction","postDate":"1174892741","msgId":22551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4NDUzMWZjMDcwMzI2MDAwNWg3MGFiYTU2Mng3YzIwODQwNTEzNDYyMjJiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDhDOTNEODI4QTJEQTcyRS0xMkE4LTRFNEFARldNLU0yOC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDg2NzE3Ljc1MDU4LnFtQHdlYjgxMDAzLm1haWwubXVkLnlhaG9vLmNvbT4JIDw4QzkzRDgyOEEyREE3MkUtMTJBOC00RTRBQEZXTS1NMjguc3lzb3BzLmFvbC5jb20+"},"prevInTopic":22547,"nextInTopic":30806,"prevInTime":22550,"nextInTime":22552,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"Have her get higher level books. She doesn t need to know you re doing the reading. I LOVE this!!!  I m gonna do that with my MIL!!! Erica ... -- Play is the","messageBody":"<div id=\"ygrps-yiv-1064035260\">Have her get higher level books. She doesn&#39;t need to know you&#39;re doing<br/>\nthe reading.<br/>\n<br/>\nI LOVE this!!!  I&#39;m gonna do that with my MIL!!!<br/>\n<br/>\nErica<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 3/25/07, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   -----Original Message-----<br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mindyevans@...\">mindyevans@...</a> &lt;mindyevans%40sbcglobal.net&gt;<br/>\n&gt;<br/>\n&gt; My mom called the other day and asked &quot; What reading<br/>\n&gt; level should I by Seth books at? I don&#39;t want to get the wrong<br/>\n&gt; thing...&quot; Talk<br/>\n&gt; about passive aggressive.<br/>\n&gt;<br/>\n&gt; -=-=-=-=-=-<br/>\n&gt;<br/>\n&gt; Tell her to send whatever she thinks he might like. It has NOTHING to<br/>\n&gt; do with reading level. You can read it to him. If it&#39;s something he&#39;s<br/>\n&gt; interested enough in he will read it when he&#39;s ready.<br/>\n&gt;<br/>\n&gt; I&#39;ve read many things to my boys that are &quot;over their heads&quot;---they<br/>\n&gt; love to be read to. They learn a lot about pronunciation and vocabulary<br/>\n&gt; from more difficult books. Edgar Allen Poe uses complex lanuage and<br/>\n&gt; vocabulary. But I can stop and give a definition or explain bizarre<br/>\n&gt; turns of phrases. So much harder to do when you&#39;re not reading the<br/>\n&gt; book. &lt;g&gt; Much easier in context!<br/>\n&gt;<br/>\n&gt; My boys prefer more advanced non-fiction but can&#39;t necessarily read<br/>\n&gt; them through themselves. It&#39;s fine. I learn what they&#39;re interested in<br/>\n&gt; (fairly in depth too!) and they learn so much more than they would from<br/>\n&gt; a children&#39;s book on the same subject.<br/>\n&gt;<br/>\n&gt; Books on tape/CD are wonderful for long trips! We can all listen (and<br/>\n&gt; not get carsick! &lt;g&gt;) and pause and rewind if we have a question or if<br/>\n&gt; we missed something. We can enjoy the book together. We&#39;ve listened tp<br/>\n&gt; them while doing yardwork or while doing ATCs too.<br/>\n&gt;<br/>\n&gt; Have her get higher level books. She doesn&#39;t need to know you&#39;re doing<br/>\n&gt; the reading. &lt;g&gt;<br/>\n&gt;<br/>\n&gt; ~Kelly<br/>\n&gt;<br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt;<br/>\n&gt; __________________________________________________________<br/>\n&gt; AOL now offers free email to everyone. Find out more about what&#39;s free<br/>\n&gt; from AOL at AOL.com.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n&quot;Play is the highest form of research.&quot; - Albert Einstein<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:introduction","postDate":"1174888549","msgId":22547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTNEODI4QTJEQTcyRS0xMkE4LTRFNEFARldNLU0yOC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDg2NzE3Ljc1MDU4LnFtQHdlYjgxMDAzLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDg2NzE3Ljc1MDU4LnFtQHdlYjgxMDAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":22501,"nextInTopic":22551,"prevInTime":22546,"nextInTime":22548,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"... From: mindyevans@sbcglobal.net My mom called the other day and asked  What reading level should I by Seth books at? I don t want to get the wrong ","messageBody":"<div id=\"ygrps-yiv-1568923743\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mindyevans@...\">mindyevans@...</a><br/>\n<br/>\nMy mom called the other day and asked &quot; What reading<br/>\nlevel should I by Seth books at? I don&#39;t want to get the wrong <br/>\nthing...&quot; Talk<br/>\nabout passive aggressive.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<br/>\nTell her to send whatever she thinks he might like. It has NOTHING to <br/>\ndo with reading level. You can read it to him. If it&#39;s something he&#39;s <br/>\ninterested enough in he will read it when he&#39;s ready.<br/>\n<br/>\nI&#39;ve read many things to my boys that are &quot;over their heads&quot;---they <br/>\nlove to be read to. They learn a lot about pronunciation and vocabulary <br/>\n from more difficult books. Edgar Allen Poe uses complex lanuage and <br/>\nvocabulary. But I can stop and give a definition or explain bizarre <br/>\nturns of phrases. So much harder to do when you&#39;re not reading the <br/>\nbook. &lt;g&gt; Much easier in context!<br/>\n<br/>\nMy boys prefer more advanced non-fiction but can&#39;t necessarily read <br/>\nthem through themselves. It&#39;s fine. I learn what they&#39;re interested in <br/>\n(fairly in depth too!) and they learn so much more than they would from <br/>\na children&#39;s book on the same subject.<br/>\n<br/>\nBooks on tape/CD are wonderful for long trips! We can all listen (and <br/>\nnot get carsick! &lt;g&gt;) and pause and rewind if we have a question or if <br/>\nwe missed something. We can enjoy the book together. We&#39;ve listened tp <br/>\nthem while doing yardwork or while doing ATCs too.<br/>\n<br/>\nHave her get higher level books. She doesn&#39;t need to know you&#39;re doing <br/>\nthe reading. &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":125711294,"authorName":"Amy Mason","from":"Amy Mason &lt;doodlemakers@...&gt;","profile":"doodlemakers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: introduction","postDate":"1174787230","msgId":22501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2MDVENDlFLjgwOTA2MDJAY29tY2FzdC5uZXQ+","inReplyToHeader":"PGV0dmZuZysxMG1tYUBlR3JvdXBzLmNvbT4=","referencesHeader":"PGV0dmZuZysxMG1tYUBlR3JvdXBzLmNvbT4="},"prevInTopic":22473,"nextInTopic":22547,"prevInTime":22500,"nextInTime":22502,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"Yes, welcome!  We re in WV also...Charles Town :-) Amy","messageBody":"<div id=\"ygrps-yiv-1949045880\">Yes, welcome!  We&#39;re in WV also...Charles Town :-)<br/>\nAmy</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:introduction","postDate":"1174737408","msgId":22473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCNDY5NjI4LUZEQUQtNDdCOS04NjM1LTMwRkM1NzJBMjg5MEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDg2NzE3Ljc1MDU4LnFtQHdlYjgxMDAzLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDg2NzE3Ljc1MDU4LnFtQHdlYjgxMDAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":22464,"nextInTopic":22501,"prevInTime":22472,"nextInTime":22474,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"... Your son is right. School has promoted the idea that learning to read comes from practice. It *seems* that way because schools *seem* to have success in ","messageBody":"<div id=\"ygrps-yiv-1059902473\">On Mar 23, 2007, at 2:07 PM, Mindy Evans wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son who is 6, totally has rejected all attempts at learning to  <br/>\n&gt; read.<br/>\n<br/>\n </span></blockquote>Your son is right. School has promoted the idea that learning to read  <br/>\ncomes from practice.<br/>\n<br/>\nIt *seems* that way because schools *seem* to have success in  <br/>\nteaching reading to some kids. But they fail miserably with others  <br/>\nand end up with kids who hate reading or hate themselves for being dumb.<br/>\n<br/>\nSchools don&#39;t have a clue. They *need* kids to read by 4th grade  <br/>\nbecause the curriculum is set up for independent readers. Schools are  <br/>\nburdened in 4th grade by kids who can&#39;t read. *Kids* don&#39;t need to  <br/>\nread by 4th grade. It&#39;s done because it&#39;s best for schools, not for  <br/>\nkids.<br/>\n<br/>\nUnschoolers *know* -- from collective years of experience! -- that in  <br/>\na print rich environment, where kids experiences with the printed  <br/>\nwords are positive, where kids are read to (if they want), hear books  <br/>\non tape (if the want), have video games and manuals (if they want)  <br/>\nand other printed material that they find useful or fun for  <br/>\nthemselves, that when they&#39;re developmentally ready, when they want  <br/>\nto read, they will read.<br/>\n<br/>\nMost unschooled kids begin reading in the 6-8 range. Some kids read  <br/>\nearlier. Some kids read later. (13 isn&#39;t unusual.) The beauty is that  <br/>\na 13 yo who has just begun reading won&#39;t take 7 years to catch up to  <br/>\na child who began at 6. Within weeks (sometimes a bit longer) they&#39;re  <br/>\nreading at age level. My daughter didn&#39;t read for pleasure until she  <br/>\nwas 12 when she read an adult level book. (It&#39;s not unusual for kids  <br/>\nto start reading when they finally find something that doesn&#39;t feel  <br/>\ndumbed down to them! :-)<br/>\n<br/>\nKids need to be developmentally ready to read. All the practice in  <br/>\nthe world won&#39;t give them that development. Only time will. In the  <br/>\nmeantime read to them (if they want), make sure they have gaming  <br/>\nguides for their video games (not only very sophisticated reading but  <br/>\nmath charts and graphs), and books that match their interests.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, I get nervous alot that I am not &quot;doing right&quot; by my  <br/>\n&gt; child, since most of my relatives think I am crazy.<br/>\n<br/>\n </span></blockquote>It helps loads to have unschoolers to hang around with! If there  <br/>\naren&#39;t any groups around you, you can try starting one :-) It seems  <br/>\noften unschoolers come out of the woodwork when someone starts the  <br/>\nball rolling.<br/>\n<br/>\nThere are also unschooling conferences. There&#39;s one in Oregon very  <br/>\nsoon and one in North Carolina in September:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.liveandlearnconference.org/\">http://www.liveandlearnconference.org/</a><br/>\n<br/>\nAnd various others in various places throughout the year.<br/>\n<br/>\nBarring that, the unschoolers here are always available :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My mom called the other day and asked &quot; What reading level should I  <br/>\n&gt; by Seth books at? I don&#39;t want to get the wrong thing...&quot; Talk  <br/>\n&gt; about passive aggressive.<br/>\n<br/>\n </span></blockquote>It would be nice if we could make everyone act towards us in ways we  <br/>\nwanted them to! But she can&#39;t make you feel any particular feeling.  <br/>\nYou *choose* the feelings you have. I know it doesn&#39;t feel that way!  <br/>\nBut we *can* choose to feel differently. We can step back and  <br/>\nrecognize when people are trying to control us and just not let them.  <br/>\nNo one can push us around if we don&#39;t push back! You can say  <br/>\n&quot;Whatever you feel would be interesting to him. If you get to know  <br/>\nhim and his interests, that will help you even more.&quot; If you trust  <br/>\nher not to quiz him on reading, you could let her talk to him. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes he had to learn to just suck it up and do what he doesn&#39;t  <br/>\n&gt; want to do.<br/>\n<br/>\n </span></blockquote>Everyone eventually learns that sometimes there are not fun things  <br/>\nstanding between us and what we want. No one needs to teach anyone  <br/>\nthat. It&#39;s a natural part of life. What we *can* do is help kids with  <br/>\nvarious strategies to tackle the less fun parts when they&#39;re trying  <br/>\nto get to something *they* want. And those strategies they can carry  <br/>\nforward into life when they&#39;re faced with bigger obstacles.<br/>\n<br/>\nBut as far as learning to read goes, sucking it up won&#39;t help. Only  <br/>\ntime and a nurturing environment will help him learn *and enjoy*  <br/>\nreading.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":181212675,"authorName":"Mindy Evans","from":"Mindy Evans &lt;mindyevans@...&gt;","profile":"sethnmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:introduction","postDate":"1174673271","msgId":22464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2NzE3Ljc1MDU4LnFtQHdlYjgxMDAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":22452,"nextInTopic":22473,"prevInTime":22463,"nextInTime":22465,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"I actually would be interested in your story about reading late. My son who is 6, totally has rejected all attempts at learning to read. I have noticed though,","messageBody":"<div id=\"ygrps-yiv-237235863\">I actually would be interested in your story about reading late. My son who is 6, totally has rejected all attempts at learning to read. I have noticed though, over the last 6 months, he is learning sight words on his own. He even asked me yesterday if we could stop practicing writing for 6 mos. trying to be of the &quot;unschooling&quot; mind, I am going to stop and trust him. My husband is skeptical. He is having a hard time getting out of the institutionalized mind set. (&quot;Sometimes he had to learn to just suck it up and do what he doesn&#39;t want to do.=()<br/>\n   <br/>\n  At first when I started considering homeschooling when he was 3, I thought unschoolers were totally radical! I just thought they were a little out there. Funny how things change. Now I see school as out there and unnatural!! However, I get nervous alot that I am not &quot;doing right&quot; by my child, since most of my relatives think I am crazy. My mom called the other day and asked &quot; What reading level should I by Seth books at? I don&#39;t want to get the wrong thing...&quot; Talk about passive aggressive. <br/>\n   <br/>\n  Anywho, I would be interested in your story!<br/>\n   <br/>\n  In His grace<br/>\n  Mindy<br/>\n<br/>\n<br/>\nGod Bless You and yours <br/>\nMindy Evans <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mindyevans@...\">mindyevans@...</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: introduction","postDate":"1174659345","msgId":22452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV1MG5laCtzNGRrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGV0dmNyOCtxdWl1QGVHcm91cHMuY29tPg=="},"prevInTopic":22449,"nextInTopic":22464,"prevInTime":22451,"nextInTime":22453,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"~~.He resisted strongly any attempts at helping him read, if the full story would be helpful or interesting to anyone let me know, can they read yet? can be","messageBody":"<div id=\"ygrps-yiv-1553168753\">~~.He resisted strongly any attempts at helping<br/>\nhim read, if the full story would be helpful or interesting to anyone<br/>\nlet me know, &quot;can they read yet?&quot;can be one of the most common and<br/>\nstressful questions :)~~<br/>\n<br/>\n<br/>\nI have a child that learned to read last year, at 12 years old.:) I<br/>\ntotally understand how annoying that question can get. Funny thing<br/>\nthough, he reads extremely well now and can spell just about anything.<br/>\nHis younger sister (who learned to read before him) used to read<br/>\nthings to him and now she&#39;s going to him for  help.<br/>\n<br/>\nI&#39;m so glad he never had to feel &quot;learning disabled&quot; because he didn&#39;t<br/>\nread when some school said he should.  We worried more about helping<br/>\nhim be comfortable with where his skills were, rather than where<br/>\nsociety would have placed him. He finds the whole notion of &quot;early&quot; or<br/>\n&quot;late&quot; reading rather bizarre.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":198023026,"authorName":"caradove","from":"&quot;caradove&quot; &lt;caradove@...&gt;","profile":"caradove","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: introduction","postDate":"1174618672","msgId":22449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV0dmZuZysxMG1tYUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDQ0NjE2Ny43MDI4Ny5xbUB3ZWI2MDMxNC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":22434,"nextInTopic":22452,"prevInTime":22448,"nextInTime":22450,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"... (Cumberland) about 15 minutes from the WV line. ... hello. I am ... that be from you ? How many children do you have? There really are not many unschoolers","messageBody":"<div id=\"ygrps-yiv-1363772346\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Katharine Wise<br/>\n&lt;katharinewise@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Welcome:-)  Where in West Virginia?  We&#39;re in Western Maryland<br/>\n </span></blockquote>(Cumberland) about 15 minutes from the WV line.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Katharine<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;     <br/>\n&gt;             hello everyone. Just joined this group and wanted to say<br/>\n </span></blockquote>hello. I am<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; not exactly new to unschooling but I am re-evaluating and learning new<br/>\n&gt; <br/>\n&gt; things myself all the time. My husband and I have five children and we<br/>\n&gt; <br/>\n&gt; live in West Virginia. Ebhann 11yo, Isa (eesha)9yo, Krsangi 5.5yo,<br/>\n&gt; <br/>\n&gt; Dharani almost4yo and Nila(neela)9mnths. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; We are in Wheeling on the northern panhandle of WV.How far would<br/>\n </span></blockquote>that be from you ? How many children do you have? There really are not<br/>\nmany unschoolers in this area, mostly school at home with Abeka<br/>\nfamilies. Can be hard for us to have enough people to socialise with,<br/>\nespecially my oldest two boys, they miss having more people to hang<br/>\nout with, there are not even that many school kids their age round<br/>\nhere and we are in a housing area. Pheew! I sound starved for company!<br/>\nWhere did that all come from,lol.<br/>\nCara<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>____________________________________________________________________________________<br/>\n<blockquote><span title=\"qreply\"> &gt; TV dinner still cooling? <br/>\n&gt; Check out &quot;Tonight&#39;s Picks&quot; on Yahoo! TV.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/\">http://tv.yahoo.com/</a><br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] introduction","postDate":"1174617994","msgId":22434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0NjE2Ny43MDI4Ny5xbUB3ZWI2MDMxNC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":22433,"nextInTopic":22449,"prevInTime":22433,"nextInTime":22435,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"Welcome:-)  Where in West Virginia?  We re in Western Maryland (Cumberland) about 15 minutes from the WV line. Katharine hello everyone. Just joined this group","messageBody":"<div id=\"ygrps-yiv-2103242601\">Welcome:-)  Where in West Virginia?  We&#39;re in Western Maryland (Cumberland) about 15 minutes from the WV line.<br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n            hello everyone. Just joined this group and wanted to say hello. I am<br/>\n<br/>\nnot exactly new to unschooling but I am re-evaluating and learning new<br/>\n<br/>\nthings myself all the time. My husband and I have five children and we<br/>\n<br/>\nlive in West Virginia. Ebhann 11yo, Isa (eesha)9yo, Krsangi 5.5yo,<br/>\n<br/>\nDharani almost4yo and Nila(neela)9mnths. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nTV dinner still cooling? <br/>\nCheck out &quot;Tonight&#39;s Picks&quot; on Yahoo! TV.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/\">http://tv.yahoo.com/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198023026,"authorName":"caradove","from":"&quot;caradove&quot; &lt;caradove@...&gt;","profile":"caradove","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"introduction","postDate":"1174615720","msgId":22433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV0dmNyOCtxdWl1QGVHcm91cHMuY29tPg=="},"prevInTopic":19581,"nextInTopic":22434,"prevInTime":22432,"nextInTime":22434,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"hello everyone. Just joined this group and wanted to say hello. I am not exactly new to unschooling but I am re-evaluating and learning new things myself all","messageBody":"<div id=\"ygrps-yiv-1188390475\">hello everyone. Just joined this group and wanted to say hello. I am<br/>\nnot exactly new to unschooling but I am re-evaluating and learning new<br/>\nthings myself all the time. My husband and I have five children and we<br/>\nlive in West Virginia. Ebhann 11yo, Isa (eesha)9yo, Krsangi 5.5yo,<br/>\nDharani almost4yo and Nila(neela)9mnths. <br/>\nOne of the most interesting experiences we have had is having a late<br/>\nreader, Isa at almost 8yo.He resisted strongly any attempts at helping<br/>\nhim read, if the full story would be helpful or interesting to anyone<br/>\nlet me know, &quot;can they read yet?&quot;can be one of the most common and<br/>\nstressful questions :)<br/>\nAlso I noticed some discussion about vaccines. I never got<br/>\nvaccinations for any of my kids and when I moved here from Ireland<br/>\nwith Ebhann and Isa as small children we had to sign a vaccination<br/>\nwaiver stating religious and moral convictions for not having them, I<br/>\ndid both reasons for good measure. Anyway I think that no federal law<br/>\nrequires vaccines as I stated that my future US born kids would not<br/>\nlegally require vaccines so why should the two moving here with me. It<br/>\nworked and we got the waivers. We objected on moral grounds of being<br/>\nvegetarian and that the vaccines contain animal ingredients, some<br/>\npretty gross ones you wouldn&#39;t even eat! <br/>\nLooking forward to reading all the posts!<br/>\nCara</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"introduction","postDate":"1165623987","msgId":19581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4YS4yOWQ0NTliLjMyYWI1Y2IzQGFvbC5jb20+"},"prevInTopic":867,"nextInTopic":22433,"prevInTime":19580,"nextInTime":19582,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"Hi. I am Adriana, mother to unschoolers Josef 11,  Jacob 9 and Mila 7. We live in Southeast Florida. I can t write a very  long intro because I m immersed in","messageBody":"<div id=\"ygrps-yiv-2064127130\">Hi. I am Adriana, mother to unschoolers Josef 11,  Jacob 9 and Mila 7. We <br/>\nlive in Southeast Florida. I can&#39;t write a very  long intro because I&#39;m immersed <br/>\nin taking care of my middle baby  Jake who has been very sick with a BAD <br/>\nabscess that formed  under a filled baby molar. He&#39;s on antibiotics for the first <br/>\ntime in  his life and his little body isn&#39;t feeling so great at all.  (we  are <br/>\n&quot;anti&quot; antibiotics so this is killing me to do but sadly there isn&#39;t  any way <br/>\naround it) But really quickly, our interests are dogs, cats,  music, candy, <br/>\ncookies, science, robots, swimming, ice skating,  gymnastics, lego robotics, <br/>\ncomputer games, PSII, vegetarian cooking,  horses, reading together, ponies, <br/>\nbaking, making a fire in our fire  pit, gardening, science, playing with our <br/>\nfriends, and watching  gazillions of Mythbuster episodes. We do none of the <br/>\naformentioned things  in any kind of an organized way - well, except for me, I have <br/>\nto sing and  play in an organized way because music is how I support my family, <br/>\nbut  other than that, we are all over the place and pretty happy about it  <br/>\n:-) <br/>\nThanks for letting us join.<br/>\nAdriana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184426691,"authorName":"Millie Rosa","from":"Millie Rosa &lt;willsmamamillie@...&gt;","profile":"willsmamamillie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] introduction","postDate":"1087937771","msgId":867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIyMjA1NjExLjc1OTMyLnFtYWlsQHdlYjUwMDA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwODc4OTI1MzguNTgzLjk3NjE0Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":19581,"prevInTime":866,"nextInTime":868,"topicId":867,"numMessagesInTopic":0,"msgSnippet":"Well, I  guess that s enough to start on.  Who else is here?  What are you guys into right now? I am Millie; my son is Will, he is 2.  Will is into books","messageBody":"<div id=\"ygrps-yiv-1692606468\">Well, I  guess that&#39;s enough to start on.  Who else is here?  What are <br/>\nyou  <br/>\nguys<br/>\n&quot;into&quot; right now?  <br/>\n<br/>\n<br/>\n<br/>\nI am Millie; my son is Will, he is 2.  Will is &quot;into&quot; books (he is reading!), and currently bugs (&quot;What beetles can do?&quot;  &quot;What kind of butterfly?&quot;  Always wants to know what &quot;kind of&quot; everything), and space travel.  He has made &quot;spaceships&quot; out of legos, blocks, dominoes, even his dinner for several months now.  He is also really into opening the fridge and &quot;making dinner.&quot;  He is finally using some kind of vessel to pour his creations into!  Usually he eats the nasty combinations he makes up, sometimes not.  Today for lunch he ate a bowl of blueberries and grapes with shredded cheese, plain yogurt, barley baby cereal, and peanut butter.  (Healthy at least and he ate every bite). <br/>\n<br/>\nI am into organic gardening, vegetables and herbs (although FreeSpirit Pharm is nearly closed for the summer....we harvest all through the winter and take July and August off...it is too hot and the bugs and weeds are crazy...the Gulf of Mexico is 2 miles due south of my front door).  I am also into quilting and am always reading something (right now I am rereading Fritjof Capra The Web of Life and Erich Fromm The Art of Loving.  And certainly, more than anything else, I am &quot;into&quot; my son!<br/>\n<br/>\nNice to meet you!<br/>\n<br/>\nLove, Millie<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - 50x more storage than other providers!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47900,"nextTopicId":47907}}