{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":173547862,"authorName":"Patti","from":"&quot;Patti&quot; &lt;diamondlady1025@...&gt;","profile":"diamondlady1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The whole Santa Clause thing...Ok let&#39;s try this again","postDate":"1094152685","msgId":3021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNoN3JsZCtzcmo1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxMzVBMTI3LjAwMDAyOC4wMDQ2MEBNT01NWT4="},"prevInTopic":3013,"nextInTopic":0,"prevInTime":3020,"nextInTime":3022,"topicId":3013,"numMessagesInTopic":0,"msgSnippet":"Somehow the post did not copy totally, so lets try again! Here is the posts below! Love and light, Patti ... Message: 8 Date: Thu, 22 Jul 2004 10:22:10 -0400 ","messageBody":"<div id=\"ygrps-yiv-284407695\">Somehow the post did not copy totally, so lets try again!<br/>\n<br/>\nHere is the posts below!<br/>\nLove and light,<br/>\nPatti<br/>\n----Original Message------<br/>\nMessage: 8<br/>\n   Date: Thu, 22 Jul 2004 10:22:10 -0400<br/>\n   From: &quot;Angela&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&gt;<br/>\nSubject: RE: Santa<br/>\n <br/>\nI&#39;m conflicted about the whole Santa thing.<br/>\n <br/>\nWhen the kids were very small I never considered not playing out the Santa<br/>\nfantasy.  I love Santa!  I still remember when I found out he was fantasy.<br/>\nI was in third grade and the kids went around the table asking if you<br/>\nbelieved in Santa.  No one said yes, and I didn&#39;t either.  But that<br/>\nwas the<br/>\nfirst time I questioned it.  I asked my mother and she said that if I<br/>\ndidn&#39;t<br/>\nbelieve, he wouldn&#39;t come.  I&#39;ve believed ever since.  ;0)  I didn&#39;t feel<br/>\nbetrayed by my mother at all, though.<br/>\n <br/>\nThen one day I was talking with a cousin who also homeschools her children<br/>\nand she said she told her kids from the start that Santa wasn&#39;t real.  At<br/>\nfirst I thought it was awful for her to ruin the fantasy part of Christmas<br/>\nbut after giving it some thought I started to feel bad that I had lied<br/>\nto my<br/>\nchildren about this, but been very honest with them in all other regards.<br/>\nThe reason she told her kids from the start that Santa was fantasy is<br/>\nbecause she felt like she was the last one to learn the truth and she felt<br/>\nher mother had lied to her.  She lived next to the school and one day<br/>\nin 5th<br/>\ngrade all the kids were saying that Santa wasn&#39;t real.  She went home and<br/>\nasked her mother and her mother didn&#39;t tell her the truth and she went<br/>\nback<br/>\nto school and argued it with the kids.  In the end she ended up feeling<br/>\nstupid and lied to.   (If my kids asked, I would either tell them the<br/>\ntruth,<br/>\nthough.)<br/>\n <br/>\nOver the years it has seemed like I&#39;ve had to keep lying and changing the<br/>\nlies to keep it under wraps.  (or sometimes I just say I don&#39;t know...this<br/>\nis what happened when I was little.)  Over the last few years I&#39;ve<br/>\ntried not<br/>\nto lie outright about Santa but put it a little differently......&quot;we&#39;d<br/>\nbetter get to bed, *they say* Santa only comes when you are fast asleep.&quot;<br/>\n(kind of like Sandra mentioned.)<br/>\n <br/>\nFrom the time the kids were small we had gifts from Santa and gifts<br/>\nfrom us.<br/>\nSanta fills the stockings and leaves a few small gifts and the rest is<br/>\nfrom<br/>\nus.  I can&#39;t really change that now but it has always been confusing<br/>\nfor me<br/>\nbecause I can never remember what gifts were from Santa and what were from<br/>\nus, after the fact.  So two months later when a mom asks me where we got<br/>\nsomething, I&#39;m likely to say enthusiastically, oh, I got that on ebay for<br/>\nonly $5, to which my children pipe up...&quot;no you didn&#39;t, we got that from<br/>\nSanta!&quot; Agh!!!   I&#39;ve done that more times than I care to mention.  I am<br/>\ngetting better at saying &quot;we got it for Christmas, (and tell the details<br/>\nlater)  but I still forget in my enthusiasm to share a good idea or good<br/>\ndeal.)  My kids have always asked why we need to give to charities at<br/>\nChristmas time.  Doesn&#39;t Santa give presents to everyone?   Having gifts<br/>\nfrom both Santa and us made it easier to answer that question...Santa only<br/>\nfills stocking and brings a few small gifts, but the kids seem to think<br/>\nthey&#39;d be perfectly happy with just the Santa gifts, so why isn&#39;t everyone<br/>\nelse?<br/>\n <br/>\nBut as my oldest gets older (she&#39;s almost 10) I have begun to worry more<br/>\nabout her learning the truth and feeling betrayed.  Obviously, she doesn&#39;t<br/>\ngo to school so she won&#39;t be questioned there.  She has one very close<br/>\nfriend who also believes.  She also plays with cousins somewhat regularly<br/>\nbut I am not sure if they would talk about that.  Will she ever learn the<br/>\ntruth or will I have to sneak into her house when she is grown up to<br/>\ndeliver<br/>\npresents to her kids?  LOL!  She is very analytical so part of me<br/>\nwonders if<br/>\nshe didn&#39;t figure it out years ago and just wants to believe so badly that<br/>\nshe&#39;s willing to overlook the inconsistencies.  If she asks for the<br/>\ntruth I<br/>\nwill certainly tell her but until both my girls know I think I will feel a<br/>\nlittle unease somewhere in the back of my mind about it.  I wish I&#39;d<br/>\nbeen a<br/>\nlittle more mysterious about it instead of seeming like I had the<br/>\nfacts when<br/>\nthey were smaller.  I did tell them that the santas in stores are not the<br/>\nreal Santa....but that feels like a lie too, for goodness sakes.  (it<br/>\nindicates that there is a *real* Santa.)<br/>\n <br/>\nI love &quot;Yes Virginia, There is a Santa Claus&quot; and I&#39;ve always thought I&#39;d<br/>\nread that to the kids when they question me.  Sometimes thing happen<br/>\noff the<br/>\ncuff here though and I forget what I&#39;ve planned.  We&#39;ll see, I guess.<br/>\n <br/>\n <br/>\nAngela ~ the conflicted<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n <br/>\n-------Original Message-------<br/>\n <br/>\nFrom: Diamondlady1025<br/>\nDate: 07/22/04 18:31:15<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: Santa....a different view<br/>\n <br/>\nWhy be conflicted about the whole Santa thing? Yes, Santa may very<br/>\nwell be a fantasy character, a man much like Superman, Batman or<br/>\nSpiderman in our fantasy world..... but if you can look behind the man<br/>\ninto what he represents in the eyes of children and in my eyes, you<br/>\nwill find  something much more real.<br/>\n <br/>\nTo me, I love Santa. I loved Santa even when I found out he was not<br/>\n&quot;real&quot;. I was not disappointed or hurt by what appeared to be my<br/>\nparents &quot;lies&quot;, because I never interpreted them as &quot;lies&quot;. The only<br/>\nthing I was upset about was the fact that my mother used the same<br/>\nwrapping paper and tags for the presents she and my dad gave, as she<br/>\ndid the ones from Santa. I think my reasoning there was one of that if<br/>\nshe was going to have made such strides to have the gifts be from two<br/>\ndifferent sets of people without us knowing it, why use the same paper<br/>\nthen? :)<br/>\n <br/>\nSo, why was I not hurt or disappointed about discovering that the<br/>\nphysical person of Santa was being portrayed by my parents? Because<br/>\nfor me, Santa is and always has been since as far back as I can<br/>\nremember, been the belief in what is possible. Santa is not so much of<br/>\na HE but rather a what is. It is a knowing that although we cannot<br/>\nalways see something - faith, hope, love, magic, fate, miracles, what<br/>\ncan be, possibility....... we can still believe. We can still believe<br/>\nin what can be, in life, no matter what logic may tell us. <br/>\n <br/>\nDo we believe in love and the power of love to go beyond what we<br/>\nhumans can see and reason? You bet we do, and we believe in it so<br/>\nstrongly that sometimes it can make us blind to what is real. But we<br/>\nbelieve in it nonetheless, and it is not something real in the sense<br/>\nof something we can feel, touch, smell, taste or hear....but we<br/>\nbelieve, we believe in it&#39;s power and in it&#39;s strength and in the<br/>\nessence of knowing it is what brings us all together, no matter what<br/>\nrace, no matter what (fill in the blank).....<br/>\n <br/>\nSanta may not be real in the sense of we cannot feel, touch, smell,<br/>\ntaste or hear him BUT we can believe in what he is in our hearts - a<br/>\nsense of innocence, a sense of awe and wonder at life and of life and<br/>\nin life. We can believe in that all things are possible and that life<br/>\nis the miracle that it is because we choose to see it for the miracle<br/>\nthat it is. Santa is so much more than just someone who brings<br/>\nchildren presents on Christmas while we all go to sleep. It is a<br/>\nbelief of something that is beyond what we can use our five senses to<br/>\nsee, materialize and realize - the magic of what is possible in life<br/>\nbeyond any reason or explanation, it just is..... and the spirit in<br/>\nwhich that can happen, that needs to be felt and seen here. Seeing is<br/>\nnot believing, believing is seeing!<br/>\n <br/>\nThat is who Santa is to me. Do I believe in Santa? You bet I do and I<br/>\nwill always believe in him until I draw my last breath! Do my kids<br/>\nbelieve? They are 13, 7, (almost 8, next month) and 6 and you bet they<br/>\ndo! :) They will not feel betrayed when they learn of the truth that I<br/>\nam the one who gives them the presents under the tree and in their<br/>\nstockings, instead of a physical man who wears a red suit, because<br/>\nthey know of what Santa truly is in all of which I have written here<br/>\nand more, beyond what our minds can reason. And THAT is what will be<br/>\nkeep Santa alive in their hearts and keep them believing in Santa, not<br/>\nfor the figure of the man he is, but for what he is and can be within<br/>\ntheir hearts.<br/>\n <br/>\nPatti and the boys (Chris 13, Matthew 7, Anthony 6)<br/>\nLife Long Learning Academy<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life-long-learning-4-all.com/index.html\">http://www.life-long-learning-4-all.com/index.html</a><br/>\n&quot;For no matter where knowledge and learning come from - no matter<br/>\nwhat shape, size, or dimension it assumes - it still is what it is,<br/>\nknowledge and learning. Therefore knowledge and learning should<br/>\nalways be embraced.&quot; ~ unknown<br/>\n <br/>\n----Original Message------<br/>\nMessage: 4<br/>\n   Date: Fri, 23 Jul 2004 08:03:13 -0400<br/>\n   From: &quot;Angela&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&gt;<br/>\nSubject: RE: Re: Santa....a different view<br/>\n <br/>\nPatti,<br/>\nWhat you wrote was beautiful and also the theme behind &quot;yes Virginia,<br/>\nthere<br/>\nis a Santa Claus&quot;, which I love and plan to share with my children at some<br/>\npoint.<br/>\n <br/>\nI also wanted to mention that the cousin I mentioned who felt so<br/>\nbetrayed by<br/>\nher parents also had a LOT of other issues with regards to her parent&#39;s<br/>\nparenting.  So, it&#39;s not like the Santa issue was the only thing she was<br/>\nlied to about.  There was both physical and mental abuse to go with it.<br/>\n <br/>\nAngela<br/>\n  &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n <br/>\n  Patti wrote:<br/>\n&lt;snip&gt;<br/>\nSanta may not be real in the sense of we cannot feel, touch, smell,<br/>\ntaste or<br/>\nhear him BUT we can believe in what he is in our hearts - a sense of<br/>\ninnocence, a sense of awe and wonder at life and of life and in life.<br/>\n&lt;snip&gt;<br/>\n <br/>\nAnd Rebeca wrote:<br/>\n&lt;snip&gt;<br/>\nI have friends who were terribly bothered by their parent&#39;s<br/>\n&#39;lies&#39; about Santa.  But, then again, lots of things about their<br/>\nupbringing<br/>\nbother them.<br/>\n-----Original Message----- <br/>\nFrom: Diamondlady1025<br/>\nDate: 07/23/04 11:33:50<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Yes, Angela....there is a Santa Claus :)<br/>\n <br/>\nHi Angela!<br/>\n <br/>\nThank you for your kind words. And yes, you are right it does fall<br/>\nunder the &quot;Yes, Virginia, there is a Santa Claus&quot;! :) One of my<br/>\nfavorite books.....When I read it, it makes me cry! :) <br/>\n <br/>\nI understand that of your cousin&#39;s situation, as well. Believe it or<br/>\nnot, my parents were also physical and emotionally and mentally<br/>\nabusive too. My mother used to beat me with anything she could find -<br/>\na shoe, a belt buckle or her favorite was for me to find my &quot;switch&quot;<br/>\nfrom this long tall purple tree in our front yard with long thin<br/>\nbranches. My father, he was and still is emotionally abusive. His<br/>\nwords cut like a knife to me as a young impressionable young girl.<br/>\n <br/>\nIt took counseling when I was 13 (after my mother was attempting to<br/>\nbeat me in the kitchen with a shoe and I grabbed a knife in self<br/>\ndefense), for us to get past the physical abuse, and she then never<br/>\nlaid a hand on me again. And should would never even dream of doing so<br/>\nwith my children, as she is getting her &quot;second chance&quot; as she puts it<br/>\nto make things right.<br/>\n <br/>\nMy father, is my father, and I have accepted that he is who he is. He<br/>\ncontinues to abuse me in this way even today. When I have stronger<br/>\ndays, I stand up to him, other days it is harder when I am sick (I<br/>\nhave just been diagnosed with Lupus and Thrombophilia or sticky blood<br/>\nas it is called) but overall I try not to let his words pierce me and<br/>\nI have learned too that I cannot change him, only change myself and my<br/>\nreaction or non-reaction to it.<br/>\n <br/>\nSo I can relate very much to your cousin. But somehow, for me, despite<br/>\nthe abuses going on, there were good times I remember and my feelings<br/>\nabout Santa never changed, I just love the spirit and meaning behind<br/>\nSanta, as I wrote! :) Has your cousin been able to work through the<br/>\nissues?<br/>\n <br/>\nSo, yes, Angela, there is a Santa Claus! :)<br/>\n <br/>\nThanks for making my day sweeter by your kind words!:) <br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Patti Diamond&quot;<br/>\n&lt;diamondlady1025@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  HiAll!<br/>\n&gt; <br/>\n&gt; I just thought I would weigh in here on Santa Claus. Christy is<br/>\n </span></blockquote>right, there<br/>\n<blockquote><span title=\"ireply\"> &gt; was a discussion about this very topic about a month ago now on<br/>\n </span></blockquote>Unschooling<br/>\n<blockquote><span title=\"ireply\"> &gt; Discussion group. I would like to post here what I wrote in response to<br/>\n&gt; Angela&#39;s post on that list as well as her message. If you go to the<br/>\n </span></blockquote>archives<br/>\n<blockquote><span title=\"ireply\"> &gt;  you can find the other responses as well!:).....<br/>\n&gt; Oh and P.S. I agree with both you Christy with what you wrote &quot;<br/>\n&gt; I also believe in fairies in general....I don&#39;t feel it is lying to him,<br/>\n&gt; because I do believe these things exist.  If at some point in his<br/>\n </span></blockquote>life he<br/>\n<blockquote><span title=\"ireply\"> &gt; decides the evidence isn&#39;t<br/>\n&gt; strong enough to support his believe, that is fine.  It won&#39;t change<br/>\n&gt; what I believe.&quot; as this is too, how I feel and what I believe!:)<br/>\n&gt;  <br/>\n&gt;  and Cat&#39;s suggestions for how to approach not telling others about<br/>\n </span></blockquote>why to<br/>\n<blockquote><span title=\"ireply\"> &gt; believe or not. Cat wrote &quot;that it is unkind to tell those children that<br/>\n&gt; Santa is not real - under the general principle of not bursting<br/>\n </span></blockquote>other people<br/>\n<blockquote><span title=\"ireply\"> &gt; s bubbles.  It goes along with not expressing her unfavorable<br/>\n </span></blockquote>opinion of art<br/>\n<blockquote><span title=\"ireply\"> &gt; that other children are proud of and similar issues of celebrating<br/>\n </span></blockquote>rather<br/>\n<blockquote><span title=\"ireply\"> &gt; than dampening other people&#39;s happiness.&quot; I feel the same as this is<br/>\n </span></blockquote>how I<br/>\n<blockquote><span title=\"ireply\"> &gt; approach it with my children when they ask me why some children<br/>\n </span></blockquote>believe or<br/>\n<blockquote><span title=\"ireply\"> &gt; do not and why.<br/>\n&gt; <br/>\n&gt; Anyhow....here is a copy of my post below from the other group and<br/>\n </span></blockquote>Angela&#39;s<br/>\n<blockquote><span title=\"qreply\"> &gt; as well. You can check out the archives for the rest on the Unschooling<br/>\n&gt; Discussions site!:)<br/>\n&gt; <br/>\n&gt; Blessings and Light,<br/>\n&gt; Patti<br/>\n&gt; -------Original Message------ <br/>\n&gt;  <br/>\n&gt; Message: 6<br/>\n&gt;    Date: Tue, 31 Aug 2004 20:41:43 -0000<br/>\n&gt;    From: &quot;christy_imnotred&quot; &lt;christy_imnotred@y...&gt;<br/>\n&gt; Subject: Re: The Whole Santa Clause Thing<br/>\n&gt;  <br/>\n&gt; They had this discussion not too long ago on Unschooling Discussion<br/>\n&gt; if you want to go look through the archives.  I was one who said that<br/>\n&gt; I told my son about Santa and the tooth fairy because we don&#39;t really<br/>\n&gt; know for sure they don&#39;t exist.  Just because we haven&#39;t seen them<br/>\n&gt; doesn&#39;t mean they aren&#39;t real.  I&#39;ve never seen an electron or a<br/>\n&gt; quark, doesn&#39; mean I don&#39;t believe they are real.  I choose to<br/>\n&gt; believe Santa and the tooth fairy are real in some way.  So that is<br/>\n&gt; what I tell my son I believe.  I know they aren&#39;t leaving presents<br/>\n&gt; under the tree or putting money under my son&#39;s pillow but it doesn&#39;t<br/>\n&gt; mean they don&#39;t exist.<br/>\n&gt;  <br/>\n&gt; I also believe in fairies in general and my son and I put honey out<br/>\n&gt; for them.  One time we had a beautiful flower grow in the exact spot<br/>\n&gt; we put the honey.  We didn&#39;t plant the flower.  During Yule my son<br/>\n&gt; gets presents from Mother Earth.<br/>\n&gt;  <br/>\n&gt; I don&#39;t feel it is lying to him, because I do believe these things<br/>\n&gt; exist.  If at some point in his life he decides the evidence isn&#39;t<br/>\n&gt; strong enough to support his believe, that is fine.  It won&#39;t change<br/>\n&gt; what I believe.<br/>\n&gt;  <br/>\n&gt; Christy </span></blockquote></div>","specialLinks":[]},{"userId":173547862,"authorName":"Patti Diamond","from":"&quot;Patti Diamond&quot; &lt;diamondlady1025@...&gt;","profile":"diamondlady1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The whole Santa Clause thing","postDate":"1094033703","msgId":3013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMzVBMTI3LjAwMDAyOC4wMDQ2MEBNT01NWT4=","referencesHeader":"PDEwOTQwMzE0ODUuMjg2Ljg3NjIxLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":3021,"prevInTime":3012,"nextInTime":3014,"topicId":3013,"numMessagesInTopic":0,"msgSnippet":"HiAll! I just thought I would weigh in here on Santa Claus. Christy is right, there\nwas a discussion about this very topic about a month ago now on Unschooling","messageBody":"<div id=\"ygrps-yiv-1588517796\">HiAll!\r<br/>\n\r<br/>\nI just thought I would weigh in here on Santa Claus. Christy is right, there<br/>\nwas a discussion about this very topic about a month ago now on Unschooling<br/>\nDiscussion group. I would like to post here what I wrote in response to<br/>\nAngela&#39;s post on that list as well as her message. If you go to the archives<br/>\n you can find the other responses as well!:).....\r<br/>\nOh and P.S. I agree with both you Christy with what you wrote &quot;\r<br/>\nI also believe in fairies in general....I don&#39;t feel it is lying to him,<br/>\nbecause I do believe these things exist.  If at some point in his life he<br/>\ndecides the evidence isn&#39;t\r<br/>\nstrong enough to support his believe, that is fine.  It won&#39;t change\r<br/>\nwhat I believe.&quot; as this is too, how I feel and what I believe!:)\r<br/>\n \r<br/>\n and Cat&#39;s suggestions for how to approach not telling others about why to<br/>\nbelieve or not. Cat wrote &quot;that it is unkind to tell those children that<br/>\nSanta is not real - under the general principle of not bursting other people<br/>\ns bubbles.  It goes along with not expressing her unfavorable opinion of art<br/>\nthat other children are proud of and similar issues of celebrating rather<br/>\nthan dampening other people&#39;s happiness.&quot; I feel the same as this is how I<br/>\napproach it with my children when they ask me why some children believe or<br/>\ndo not and why.\r<br/>\n\r<br/>\nAnyhow....here is a copy of my post below from the other group and Angela&#39;s<br/>\nas well. You can check out the archives for the rest on the Unschooling<br/>\nDiscussions site!:)\r<br/>\n\r<br/>\nBlessings and Light,\r<br/>\nPatti\r<br/>\n-------Original Message------ \r<br/>\n \r<br/>\nMessage: 6\r<br/>\n   Date: Tue, 31 Aug 2004 20:41:43 -0000\r<br/>\n   From: &quot;christy_imnotred&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:christy_imnotred@...\">christy_imnotred@...</a>&gt;\r<br/>\nSubject: Re: The Whole Santa Clause Thing\r<br/>\n \r<br/>\nThey had this discussion not too long ago on Unschooling Discussion\r<br/>\nif you want to go look through the archives.  I was one who said that\r<br/>\nI told my son about Santa and the tooth fairy because we don&#39;t really\r<br/>\nknow for sure they don&#39;t exist.  Just because we haven&#39;t seen them\r<br/>\ndoesn&#39;t mean they aren&#39;t real.  I&#39;ve never seen an electron or a\r<br/>\nquark, doesn&#39; mean I don&#39;t believe they are real.  I choose to\r<br/>\nbelieve Santa and the tooth fairy are real in some way.  So that is\r<br/>\nwhat I tell my son I believe.  I know they aren&#39;t leaving presents\r<br/>\nunder the tree or putting money under my son&#39;s pillow but it doesn&#39;t\r<br/>\nmean they don&#39;t exist.\r<br/>\n \r<br/>\nI also believe in fairies in general and my son and I put honey out\r<br/>\nfor them.  One time we had a beautiful flower grow in the exact spot\r<br/>\nwe put the honey.  We didn&#39;t plant the flower.  During Yule my son\r<br/>\ngets presents from Mother Earth.\r<br/>\n \r<br/>\nI don&#39;t feel it is lying to him, because I do believe these things\r<br/>\nexist.  If at some point in his life he decides the evidence isn&#39;t\r<br/>\nstrong enough to support his believe, that is fine.  It won&#39;t change\r<br/>\nwhat I believe.\r<br/>\n \r<br/>\nChristy\r<br/>\n \r<br/>\n \r<br/>\n \r<br/>\n________________________________________________________________________\r<br/>\n________________________________________________________________________\r<br/>\n \r<br/>\n \r<br/>\n \r<br/>\n------------------------------------------------------------------------\r<br/>\nYahoo! Groups Links\r<br/>\n \r<br/>\n \r<br/>\n \r<br/>\n \r<br/>\n------------------------------------------------------------------------\r<br/>\n \r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":3020,"nextTopicId":3016}}