{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Post-Conference thoughts","postDate":"1212150472","msgId":33252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcxb3JzOCs5ZHMzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4MzM5Mi4yNTg4NC5xbUB3ZWI1MzIwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":33224,"nextInTopic":0,"prevInTime":33251,"nextInTime":33253,"topicId":33210,"numMessagesInTopic":0,"msgSnippet":"~~ I have learned so much here and I am very grateful to all of you who give of your precious time to make the world a better, more joyful and loving place.~~ ","messageBody":"<div id=\"ygrps-yiv-1117384600\">~~ I have learned so much here and I am very grateful to all of you<br/>\nwho give of your precious time to make the world a better, more joyful<br/>\nand loving place.~~<br/>\n<br/>\nYour whole post was very sweet and inspirational Mara. Thank you for<br/>\nall the kind words. I really enjoyed this conference too. There were<br/>\nso many connections and amazing people to take in, as always. <br/>\n<br/>\n<br/>\n~~ Scared by the microphone, the story was much<br/>\n<blockquote><span title=\"ireply\"> &gt;  shorter than intended. ~~<br/>\n<br/>\n </span></blockquote>It was so cool that he worked through his fear and still did his<br/>\npuppet show! That must have taken a lot of courage on his part...and<br/>\nthe audience cheered like crazy of course.:)<br/>\n<br/>\n<br/>\n~~ The way you talked about this Ren made me cry and confirm that I am<br/>\ndoing the right thing by always being on my kids side and protecting<br/>\nthem, when he wants to hurt them in any way (not physically, but with<br/>\nwords), but still this does not need to be the end of a<br/>\n<blockquote><span title=\"ireply\"> &gt;  relationship. ~~<br/>\n<br/>\n </span></blockquote>Definitely.<br/>\nYour post about this almost made ME cry.:)<br/>\nI was telling my dh about your post yesterday morning (our time to<br/>\nconnect and talk and drink tea together) and we got into this really<br/>\ngreat discussion. I was explaining how many of the men often live in<br/>\nsuch a logical/linguistic world and from a young age learn to value<br/>\nthose things (our whole society seems to worship those skills).<br/>\n<br/>\nIt was so cool listening to him describe what helps a guy &quot;get it&quot; and<br/>\nwhy unschooling can be such a hard thing to trust. I&#39;m sitting there<br/>\nlistening to him and thinking how great it would be for him to speak<br/>\nat a conference! Dangit. I wish he could handle large crowds better.<br/>\nSome of the Dads would really connect with him I think.<br/>\n<br/>\n<br/>\n <br/>\n~~We decided to spend that night, and after him meeting Ren and Erika<br/>\n(again), looking at ATC&#39;s that night (thanks! that was another<br/>\nhighlight!)~~<br/>\n<br/>\n<br/>\nYeah, Erika&#39;s got me all inspired to get back to ATC&#39;s again! It was<br/>\nso cool looking through her collection and recognizing a few of the<br/>\nartists.<br/>\n<br/>\n~~ Somehow the negative<br/>\n<blockquote><span title=\"ireply\"> &gt;  parenting really seemed to stand out more after this weekend and I<br/>\n </span></blockquote>was just amazed at how far away the general population still is from<br/>\ngentle parenting.~~<br/>\n<br/>\nIt&#39;s really hard to deal with isn&#39;t it?<br/>\nI had a regular customer in at work last night, and she kept calling<br/>\nher (very young) daughter &quot;mean&quot; and telling everyone in ear shot how<br/>\nawful she was. I had to walk away after trying to diffuse it with &quot;Aw,<br/>\nI bet she&#39;s just tired&quot; and such. It was making me feel sick. All that<br/>\nlovely unschooling energy just makes the rest of the world feel very<br/>\nbroken and messed up. That&#39;s good. But it makes the work place a bit<br/>\ndifficult to deal with and understand sometimes.<br/>\n<br/>\nThere&#39;s nothing quite like a gathering of unschoolers! Looking forward<br/>\nto L&L this fall.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":335051187,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lrowx001@...&gt;","profile":"lrowx001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Post-Conference follow-up re:- DH Concern: Unschooling vs. &quot;Well-Rounded&quot;","postDate":"1212085401","msgId":33224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcxbXNhcCtwaTloQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4MzM5Mi4yNTg4NC5xbUB3ZWI1MzIwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":33217,"nextInTopic":33252,"prevInTime":33223,"nextInTime":33225,"topicId":33210,"numMessagesInTopic":0,"msgSnippet":"... And the next night we talked until 3 am about Radical Unschooling and we did NOT argue, just a really good long talk and he was sharing a problem that he","messageBody":"<div id=\"ygrps-yiv-343550686\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Mara &lt;mamadeluz@...&gt; wrote:<br/>\n<br/>\n And the next night we talked until 3 am about Radical Unschooling <br/>\nand we did NOT argue, just a really good long talk and he was sharing <br/>\na problem that he had with ds (age 6) earlier that night, and what he <br/>\ncould have done better. He really is trying and I am very grateful.<br/>\n&gt; Thanks again to everyone who made this possible and who made this <br/>\nspecial,<br/>\n&gt; Love,<br/>\n&gt; Mara<br/>\n<br/>\n<br/>\nI want to echo Mara&#39;s comments: we enjoyed a similar outcome from the <br/>\nconference. <br/>\n<br/>\nBefore the conference, I posted about DH&#39;s concern that our children <br/>\nbecome &quot;well-rounded.&quot; He read all the responses, (many thanks to <br/>\nthose who answered), and then read a few other threads as well! <br/>\nAttending the conference had the most impact for him. He went to the <br/>\nDad&#39;s gathering (SSUD&#39;S) and was able to attend a few presentations. <br/>\nAt the Cocoa House and Talent Show he spent a lot of time observing <br/>\nthe older youths and even chatted with several teens. He says that he <br/>\nfeels better now about the boys&#39; becoming well-rounded, and that we <br/>\ncan strew resources to help.<br/>\n<br/>\nI mentioned in the &quot;well-rounded&quot; post that he was unwilling to read <br/>\nbooks about unschooling. Before the conference ended, DH told me that <br/>\nhe wants to read some books to better understand unschooling - yea! <br/>\nPerhaps most exciting for me is his patience and openness with the <br/>\nboys. I am amazed and gratified with his embrace of a more respectful <br/>\nparenting style. I feel like I have gained a partner with whom to <br/>\nlearn this lifestyle, instead of having an observer. And, I believe <br/>\nthat having a partner on the journey will help us progress faster.<br/>\n<br/>\nWe plan to attend the L&L Conference in September and just asked his <br/>\nDad/Stepmom to join us. DH already introduced unschooling to his Dad <br/>\nusing the learning to walk & talk analogy. I thought I read about a <br/>\nGrandparents unschooing list... can someone help us find this?<br/>\n<br/>\nAgain, a big &quot;THANKS!&quot; from us to the conference organizers/speakers <br/>\nand those who took a moment to chat with us separately (Ren Allen, <br/>\nKelly Lovejoy, and Marji)!<br/>\n<br/>\nLisa, Jim, Danny, & Ryan </span></blockquote></div>","specialLinks":[]},{"userId":171305668,"authorName":"Beth Fleming","from":"Beth Fleming &lt;momofwc@...&gt;","profile":"momofwc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Post-Conference thoughts","postDate":"1212070239","msgId":33217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyODgyOC4zODEzNy5xbUB3ZWIzMDAwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":33210,"nextInTopic":33224,"prevInTime":33216,"nextInTime":33218,"topicId":33210,"numMessagesInTopic":0,"msgSnippet":"  Thanks for sharing that, Mara....for us it was a wonderful experience, too.  Seeing real, live, great kids having so much fun with their families","messageBody":"<div id=\"ygrps-yiv-259912263\"> <br/>\nThanks for sharing that, Mara....for us it was a wonderful experience, too.  Seeing real, live, great kids having so much fun with their families peacefully all in one place is hard to describe.  It really brought home how much more peaceful the world would be if everyone started to genuinely respect their own.....<br/>\nMy kiddos spent most of their time in the pool and playing Pokemon and Yu-Gi-Oh, so I was in and out of some talks, but really just enjoying the atmosphere and the joy that was going on in the hotel. My husband and I were talking on the way home and I asked him if it was life-changing for him....and he said, &quot;No....I felt good about what we were doing before, and now I feel great about it!&quot;  So, I think for both of us, the conference was affirming and a real boost to continue doing what we know is right, even in the face of everyday adversity.<br/>\nBeth<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Mara &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamadeluz@...\">mamadeluz@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, May 28, 2008 9:37:26 PM<br/>\nSubject: [unschoolingbasics] Post-Conference thoughts<br/>\n<br/>\n<br/>\nHi everyone,<br/>\njust felt like sharing a few things about the NE Unschooling Conference in Peabody. It was my second time there. I joined unschoolingbasics about 2 weeks before the last NE Unschooling Conference 2 years ago and have been moving towards Radical Unschooling ever since. This list has been a wonderful place where I come to relax sometimes with a cup of tea, some truffles or cherries etc. before the children wake up in the morning, or a few moments at night. I have learned so much here and I am very grateful to all of you who give of your precious time to make the world a better, more joyful and loving place. Last time I mostly spend time in the playroom with the kids as they were just 1 and 4 at the time. I did not make it to any talks, but had a wonderful eyeopener about unschooled kids as opposed to the ones we meet at playgrounds. My oldest was in heaven and even tried to tell a story at the talent show. Scared by the microphone, the story was much<br/>\nshorter than intended. <br/>\nThis time I asked my husband to come along on the second day so that I could catch a talk or two, starting out with tea with Ren - thank you Ren and Kelly, it was very worth it. It was wonderful to see you again in person after spending so much time reading and enjoying your advice and wisdom online. Some of the highlights were: Tea with Ren, when one woman asked about her husband and Ren told us about hers and the long journey it sometimes takes for men to come through on the parenting part, and also what has helped her the most was to just live the joyful life, rather than trying to change him through articles etc. Also her standing up to him when he wanted to treat the kids with less respect. The way you talked about this Ren made me cry and confirm that I am doing the right thing by always being on my kids side and protecting them, when he wants to hurt them in any way (not physically, but with words), but still this does not need to be the end of a<br/>\nrelationship. While listening something in me softened for my dh, and I feel like he just needs time, that I will just keep living the RU life and eventually he will understand more and more. <br/>\nWe decided to spend that night, and after him meeting Ren and Erika (again), looking at ATC&#39;s that night (thanks! that was another highlight!) he came downstairs with me in the morning and said something like:&quot; I am just starting to realize that you are not just keeping them home, that you have this whole plan, that you are really doing something great.&quot; not sure of the exact words, but those little words alone were worth the whole conference.<br/>\nI had wanted him to meet some of the guys but when that did not happen he told me, o.k. why don&#39;t you just tell me what you think they would tell me. And the next night we talked until 3 am about Radical Unschooling and we did NOT argue, just a really good long talk and he was sharing a problem that he had with ds (age 6) earlier that night, and what he could have done better. He really is trying and I am very grateful.<br/>\nI met some very wonderful people, also a few from 2 years ago whom I actually recognized and was so happy to see again. <br/>\nOn monday we drove the hour again to Salem in the hopes of meeting up with other unschoolers. We circled the crowded Park several times with a heavy Picknick basket looking for a group of unruly kids (as Kathryn had put it) or anyone that looked like they were really having fun, and after I was totally exhausted and disappointed we just settled down at the beach somewhere. The kids played with the seaweed and rocks etc. (which sparked a whole sequence of events and questions when we brought some home... and I now know a LOT more about seaweed -) and still had fun. I on the other hand started feeling really lonely. It seemed like everywhere parents were just yelling at their kids telling them constantly what not to do - this was supposed to be a FUN amusement park but that day I did not find it very amusing. It took me way longer to get over the disappointment and took some time to learn from my kids and just be in the moment. Somehow the negative<br/>\nparenting really seemed to stand out more after this weekend and I was just amazed at how far away the general population still is from gentle parenting.<br/>\n<br/>\nWhen I told my ex husband (who is my oldest father) about the conference today. he said, hey, I would have liked to go to something like this. I had assumed he did not because he and his wife are very conventional parents, with Time Outs, Spanking (on her part) , shaming etc, and their son is only 2. He said he agrees more with me and and also wants to know more about how his oldest is being brought up.<br/>\nLucian (6) said with a happy smile, there were so many boys there that looked just like me, with the long hair in their faces, and no one thought I was a girl! <br/>\nThen I talked about the conference at the homeschooling group next day and the one that is the most traditional asked me to send her more unschooling links. Great! Thanks again for a total success! <br/>\nI still have a some thoughts and questions that came during the conference and did not get off my chest, but that in another email.<br/>\nSorry about the long post, hope this will inspire others to go to conferences !<br/>\nThanks again to everyone who made this possible and who made this special,<br/>\nLove,<br/>\nMara<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133390932,"authorName":"Mara","from":"Mara &lt;mamadeluz@...&gt;","profile":"mamadeluz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Post-Conference thoughts","postDate":"1212025046","msgId":33210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4MzM5Mi4yNTg4NC5xbUB3ZWI1MzIwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":33217,"prevInTime":33209,"nextInTime":33211,"topicId":33210,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, just felt like sharing a few things about the NE Unschooling Conference in Peabody. It was my second time there. I joined unschoolingbasics about","messageBody":"<div id=\"ygrps-yiv-296557917\">Hi everyone,<br/>\njust felt like sharing a few things about the NE Unschooling Conference in Peabody. It was my second time there. I joined unschoolingbasics about 2 weeks before the last NE Unschooling Conference 2 years ago and have been moving towards Radical Unschooling ever since. This list has been a wonderful place where I come to relax sometimes with a cup of tea, some truffles or cherries etc. before the children wake up in the morning, or a few moments at night. I have learned so much here and I am very grateful to all of you who give of your precious time to make the world a better, more joyful and loving place. Last time I mostly spend time in the playroom with the kids as they were just 1 and 4 at the time. I did not make it to any talks, but had a wonderful eyeopener about unschooled kids as opposed to the ones we meet at playgrounds. My oldest was in heaven and even tried to tell a story at the talent show. Scared by the microphone, the story was much<br/>\n shorter than intended. <br/>\nThis time I asked my husband to come along on the second day so that I could catch a talk or two, starting out with tea with Ren - thank you Ren and Kelly, it was very worth it. It was wonderful to see you again in person after spending so much time reading and enjoying your advice and wisdom online. Some of the highlights were: Tea with Ren, when one woman asked about her husband and Ren told us about hers and the long journey it sometimes takes for men to come through on the parenting part, and also what has helped her the most was to just live the joyful life, rather than trying to change him through articles etc. Also her standing up to him when he wanted to treat the kids with less respect. The way you talked about this Ren made me cry and confirm that I am doing the right thing by always being on my kids side and protecting them, when he wants to hurt them in any way (not physically, but with words), but still this does not need to be the end of a<br/>\n relationship.  While listening something in me softened for my dh, and I feel like he just needs time, that I will just keep living the RU life and eventually he will understand more and more. <br/>\nWe decided to spend that night, and after him meeting Ren and Erika (again), looking at ATC&#39;s that night (thanks! that was another highlight!) he came downstairs with me in the morning and said something like:&quot; I am just starting to realize that you are not just keeping them home, that you have this whole plan, that you are really doing something great.&quot; not sure of the exact words, but those little words alone were worth the whole conference.<br/>\nI had wanted him to meet some of the guys but when that did not happen he told me, o.k. why don&#39;t you just tell me what you think they would tell me.  And the next night we talked until 3 am about Radical Unschooling and we did NOT argue, just a really good long talk and he was sharing a problem that he had with ds (age 6) earlier that night, and what he could have done better. He really is trying and I am very grateful.<br/>\nI met some very wonderful people, also a few from 2 years ago whom I actually recognized and was so happy to see again. <br/>\nOn monday we drove the hour again to Salem in the hopes of meeting up with other unschoolers. We circled the crowded Park several times with a heavy Picknick basket looking for a group of unruly kids (as Kathryn had put it)  or anyone that looked like they were really having fun, and after I was totally exhausted and disappointed we just settled down at the beach somewhere. The kids played with the seaweed and rocks etc. (which sparked a whole sequence of events and questions when we brought some home... and I now know a LOT more about seaweed -) and still had fun. I on the other hand started feeling really lonely. It seemed like everywhere parents were just yelling at their kids telling them constantly what not to do - this was supposed to be a FUN amusement park but that day I did not find it very amusing. It took me way longer to get over the disappointment and took some time to learn from my kids and just be in the moment. Somehow the negative<br/>\n parenting really seemed to stand out more after this weekend and I was just amazed at how far away the general population still is from gentle parenting.<br/>\n<br/>\nWhen I told my ex husband (who is my oldest father) about the conference today. he said, hey, I would have liked to go to something like this. I had assumed he did not because he and his wife are very conventional parents, with Time Outs, Spanking (on her part) , shaming etc, and their son is only 2. He said he agrees more with me and and also wants to know more about how his oldest is being brought up.<br/>\nLucian (6) said with a happy smile, there were so many boys there that looked just like me, with the long hair in their faces, and no one thought I was a girl! <br/>\nThen I talked about the conference at the homeschooling group next day and the one that is the most traditional asked me to send her more unschooling links. Great! Thanks again for a total success! <br/>\nI still have a some thoughts and questions that came during the conference and did not get off my chest, but that in another email.<br/>\nSorry about the long post, hope this will inspire others to go to conferences !<br/>\nThanks again to everyone who made this possible and who made this special,<br/>\nLove,<br/>\nMara<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33248,"nextTopicId":33195}}