{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Disicipline?","postDate":"1283869280","msgId":44737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2NWhwMCtybW9iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg=="},"prevInTopic":44735,"nextInTopic":0,"prevInTime":44736,"nextInTime":44738,"topicId":44732,"numMessagesInTopic":0,"msgSnippet":"... ************ Others have said it, but I don t think it can be repeated enough: be right where your kids are, involved in what they re doing - which means","messageBody":"<div id=\"ygrps-yiv-2051179217\">&quot;movingonout2009&quot; &lt;movingonout2009@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So my problem is this.  How do I get them to stop hitting each other, pulling on hair, drawing on furniture etc?<br/>\n </span></blockquote>************<br/>\n<br/>\nOthers have said it, but I don&#39;t think it can be repeated enough: be right where your kids are, involved in what they&#39;re doing - which means giving up a whole lot of expectations in terms of &quot;getting things done&quot;. When you&#39;re right there, you have a chance to &quot;head things off at the pass&quot; - to see what the needs are in the moment, where the expectations and communication is breaking down between your little ones. Kids don&#39;t come into the world with many social skills, and those they have are primitive: when in doubt, hit. So they&#39;ll need someone at their side for a few years, helping them deal with frustration, confusion, and the oh-so-normal disputes that arise between young children in different stages of development. Someone gave an example of one child liking to knock things down and the other prefering everything &quot;left&quot; - that&#39;s a pretty typical dynamic when you have more than one young child. <br/>\n<br/>\nSince you&#39;re in a home not your own, can you &quot;kid safe&quot; one room? A basement or porch or mud-room that can be turned into a place to paint and draw? Short of that, look into buying or building some easels and stock up on paper. Young children often love to draw and paint large, so a big surface is enticing to them. <br/>\n<br/>\nAnother outlet is painting things like windows and shower curtains. Is there a big glass window or door in the house? Washable kid paints wash right off glass, no problem, and Crayola markers also write on and then wash off glass. You&#39;ll need to be right there with the kids while they&#39;re doing these things, and sadly may need to regulate the art supplies for awhile :( but find as many ways to say &quot;Yes&quot; to painting and drawing as you can, if that&#39;s something your kids enjoy. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;how to go about getting the kids to listen to me.<br/>\n<br/>\n </span></blockquote>In the longer run, you do this by being responsive to your kids, being their best source of resources and options, so that they Want to hear what you have to say. No-one wants to hear &quot;no, no, no&quot;. A person who, most of the time, can come up with a creative solution, though, gets a Lot of notice. A fairly typical little note went around my relatives on facebook to the effect that kids never listen to parents until they become parents themselves - that&#39;s the norm. But my kids will ask my opinions and listen to what I have to say - and I have a &quot;tween&quot; and a &quot;teen&quot;. They have every reason to listen to me - I often have good ideas for ways they can get what they want. <br/>\n<br/>\n---Meredith (Mo 9, Ray 16)</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Disicipline?","postDate":"1283849867","msgId":44734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5Mzg2MC40MDk4OS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg=="},"prevInTopic":44733,"nextInTopic":44735,"prevInTime":44733,"nextInTime":44735,"topicId":44732,"numMessagesInTopic":0,"msgSnippet":"Unschooling has struck a lovely chord for many folks. It s very exciting to watch gentleness and kindness and a willingness to help explore work as a mode for","messageBody":"<div id=\"ygrps-yiv-35616997\">Unschooling has struck a lovely chord for many folks. It&#39;s very exciting to <br/>\nwatch gentleness and kindness and a willingness to help explore work as a mode <br/>\nfor being with your children. <br/>\n<br/>\n<br/>\nWith a 2 year old and a 4 year old the only method of redirecting that every <br/>\nworked for me, and I spanked both Simon and Linnaea when they were 2 and stopped <br/>\nwhen Simon was 7, I guess, and Linnaea was 4, was spending time with them. Lots <br/>\nand lots of time with them. It&#39;s very easy for a 2 year old and for a 4 year old <br/>\nto get distracted by something, to move on to something else, and it is easy for <br/>\nthem to move from what looks like joyful play to anger and frustration if you <br/>\naren&#39;t paying that much attention. Linnaea is 10 now and Simon 13 and my <br/>\nattention is still the most effective way of helping them to move from a <br/>\npotentially furious moment to a calmer one. And by attention I don&#39;t mean coming <br/>\nin and fixing it, I mean sitting behind Linnaea and stroking her hair or sitting <br/>\nnext to Simon and touching him gently and saying something nice and maybe <br/>\nsuggesting another way of looking at something. <br/>\n<br/>\n<br/>\nTime is often the most important aspect of helping a child not to move into a <br/>\nmode of behaviour that is destructive or violent. Time and attention. And at <br/>\ntheir grandparents&#39; house it is probably not a house that is terribly child <br/>\nfriendly or child engaging. Getting them out more may help a lot. Finding other <br/>\nthings to do, go to the park, go to any local cool things, the mall, the zoo, <br/>\nthe science museum, the toy store, etcetera, so that they can run and play and <br/>\ndo and explore where there isn&#39;t tension over their behaviour, their <br/>\nappropriately childish play. The other problem we&#39;ve run into staying with <br/>\nfamily is food. Because it isn&#39;t our home, eating outside of the prescribed <br/>\ntimes is a bit frowned on. And being hungry is a sure way to melt down. So find <br/>\nways to feed your children more often. Be more aware of when they may be hungry <br/>\nin this somewhat novel environment. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: movingonout2009 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:movingonout2009@...\">movingonout2009@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Monday, 6 September, 2010 13:15:49<br/>\nSubject: [unschoolingbasics] Disicipline?<br/>\n<br/>\nUnschooling really resonates with me, and I am just starting to delve into it <br/>\nwith my daughter who is four, and my son who is two.  One thing that has really <br/>\nbothered me is how to go about getting the kids to listen to me.<br/>\n<br/>\nI try not to have a ton of arbitrary rules about what they can and cannot do, <br/>\nbut am finding it difficult to shed all of my previous habits in regards to <br/>\nthat.  As I read somewhere, and find that I agree with is about how we should <br/>\ntrust in our children not to do the most dangerous thing that we think about in <br/>\nany given situation.  So I am giving them a lot more slack to explore and do <br/>\nwhatever it is that they want to do without me constantly hovering over them.  <br/>\nI&#39;m finding that my children are surprising me with how sensible they usually <br/>\nare.  However, I will not let my kids hurt each other, and I won&#39;t let them <br/>\ndamage property around them.  We are currently staying with my parents so they <br/>\ndo have a fair bit of furniture around them that they must be careful with not <br/>\nto damage.  <br/>\n<br/>\n<br/>\nSo my problem is this.  How do I get them to stop hitting each other, pulling on <br/>\nhair, drawing on furniture etc?  Right now I threaten punishment of time outs, <br/>\nlosing privlidges, and promises of rewards if the listen to me and behave.  <br/>\nHowever, this leaves a sick feeling in my stomach because the only reason they <br/>\nare doing so because of fear, or desire for rewards.  This is the way I was <br/>\nbrought up, and how everyone else around me parents, but is just does not feel <br/>\nright, and does not jibe with my parenting methods.  I have very few solid <br/>\nrules, but the main one is that they are not allowed to be physically violent <br/>\nwith each other.  I understand that my son is only two and that he will strike <br/>\nout, but how to stop it once its started?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237769293,"authorName":"jess gray","from":"jess gray &lt;liljessgray@...&gt;","profile":"lilbubbelz2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Disicipline?","postDate":"1283809707","msgId":44735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEzNy13NEZDNzEyODNCNjU1N0MwN0UzRkYyQTQ3MDBAcGh4LmdibD4=","inReplyToHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg=="},"prevInTopic":44734,"nextInTopic":44737,"prevInTime":44734,"nextInTime":44736,"topicId":44732,"numMessagesInTopic":0,"msgSnippet":"This is an area, my DP and I clash.  I prefer the gentle side of discipline. where as DP thinks smacking is the cure (it so isnt lol). Anyway, in our house,","messageBody":"<div id=\"ygrps-yiv-178278153\">This is an area, my DP and I clash.  I prefer the gentle side of discipline. where as DP thinks smacking is the cure (it so isnt lol). Anyway, in our house, ds#2 (aged almost 4) will hit or bite others if he is tired or if he needs to eat.  Ds#1 (aged 5.5yrs) will lash out at others if they do not understand him , when he tries to communicate with them. He has an expressive speech delay and we suspect aspergers or PDD-NOS, so to him all games have to be done a specfic way and if he lines stuff up they have to be left that way...ds#2 loves to mess with ds#1&#39;s head and move things out of the line.<br/>\n<br/>\nWhat I do, is I  move them and then ask them if they are angry or sad and get them to verbalise why they are feeling that way. It is helping them so far.jess<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Disicipline?","postDate":"1283806751","msgId":44733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCQTMyMEE4LTAxQUQtNDUyMS1CQUMzLTVEOEYwNEMwNjc3M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg=="},"prevInTopic":44732,"nextInTopic":44734,"prevInTime":44732,"nextInTime":44734,"topicId":44732,"numMessagesInTopic":0,"msgSnippet":"... It helps to see kids actions as communication there are needs that need met. So the goal isn t to stop a behavior but to meet the need so the behavior","messageBody":"<div id=\"ygrps-yiv-253531106\">On Sep 6, 2010, at 8:15 AM, movingonout2009 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So my problem is this. How do I get them to stop hitting each other,  <br/>\n&gt; pulling on hair, drawing on furniture etc?<br/>\n<br/>\n </span></blockquote>It helps to see kids actions as communication there are needs that  <br/>\nneed met. So the goal isn&#39;t to stop a behavior but to meet the need so  <br/>\nthe behavior stops.<br/>\n<br/>\nFirst, be more present. That&#39;s the answer to most problems with kids  <br/>\nwhen people start out with radical unschooling ;-)<br/>\n<br/>\nIt&#39;s likely they&#39;re bored, irritated or hungry and they need more of  <br/>\nyou, especially in an environment that isn&#39;t home. *Assume* they&#39;re  <br/>\ndoing the best they can.<br/>\n<br/>\nFor drawing on furniture, do make it clear that Grandma doesn&#39;t like  <br/>\nher things drawn on, then move onto what they *can* do instead to meet  <br/>\nthe need. Other things they can draw on, other activities. Get some  <br/>\npaper they&#39;ve never drawn on like butcher paper or huge pads of  <br/>\nnewsprint. Chalk for the driveway.<br/>\n<br/>\n(Though the need might not be drawing. The need might be doing  <br/>\nsomething that isn&#39;t boring or connecting with you.)<br/>\n<br/>\nHitting is often a signal that they&#39;ve reached the end of something:  <br/>\nfood reserves, patience with each other, patience with the different  <br/>\nenvironment, patience with being away from you. Be with them and be  <br/>\nmore aware of rising tension. Get to them before they hit. Bring food.  <br/>\nCall one away to do something with you. All go out for a walk.<br/>\n<br/>\n*Don&#39;t* assume they&#39;re doing wrong things because they&#39;re bad or &quot;just  <br/>\nneed attention&quot; (which isn&#39;t a &quot;just&quot;!) or because they don&#39;t  <br/>\nunderstand something&#39;s wrong. Assume they&#39;re doing the best they can  <br/>\nand they&#39;re immersed in a problem they just can&#39;t see a solution to so  <br/>\nthey&#39;re grasping at *something*. They may know what not to do, but  <br/>\nuntil they can comfortably figure out what to do instead, they&#39;ll  <br/>\ngrasp at a solution they understand, even if it&#39;s &quot;wrong&quot;.<br/>\n<br/>\nThat won&#39;t solve it all, but the more you can prevent, the more energy  <br/>\nand patience you&#39;ll all have for the times when you haven&#39;t caught the  <br/>\nsignals or what ever.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":438157381,"authorName":"movingonout2009","from":"&quot;movingonout2009&quot; &lt;movingonout2009@...&gt;","profile":"movingonout2009","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Disicipline?","postDate":"1283775349","msgId":44732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2Mm0xbCtxbDF2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44733,"prevInTime":44731,"nextInTime":44733,"topicId":44732,"numMessagesInTopic":0,"msgSnippet":"Unschooling really resonates with me, and I am just starting to delve into it with my daughter who is four, and my son who is two.  One thing that has really","messageBody":"<div id=\"ygrps-yiv-63575260\">Unschooling really resonates with me, and I am just starting to delve into it with my daughter who is four, and my son who is two.  One thing that has really bothered me is how to go about getting the kids to listen to me.<br/>\n<br/>\nI try not to have a ton of arbitrary rules about what they can and cannot do, but am finding it difficult to shed all of my previous habits in regards to that.  As I read somewhere, and find that I agree with is about how we should trust in our children not to do the most dangerous thing that we think about in any given situation.  So I am giving them a lot more slack to explore and do whatever it is that they want to do without me constantly hovering over them.  I&#39;m finding that my children are surprising me with how sensible they usually are.  However, I will not let my kids hurt each other, and I won&#39;t let them damage property around them.  We are currently staying with my parents so they do have a fair bit of furniture around them that they must be careful with not to damage.  <br/>\n<br/>\nSo my problem is this.  How do I get them to stop hitting each other, pulling on hair, drawing on furniture etc?  Right now I threaten punishment of time outs, losing privlidges, and promises of rewards if the listen to me and behave.  However, this leaves a sick feeling in my stomach because the only reason they are doing so because of fear, or desire for rewards.  This is the way I was brought up, and how everyone else around me parents, but is just does not feel right, and does not jibe with my parenting methods.  I have very few solid rules, but the main one is that they are not allowed to be physically violent with each other.  I understand that my son is only two and that he will strike out, but how to stop it once its started?</div>","specialLinks":[]}],"prevTopicId":44736,"nextTopicId":44731}}