{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:at a loss","postDate":"1164574688","msgId":19316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2Yi42MTkyNTQ1LjMyOWI1OWUwQGFvbC5jb20+"},"prevInTopic":19266,"nextInTopic":19338,"prevInTime":19315,"nextInTime":19317,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"Dawn, somehow these children s parents have managed to get you to provide free childcare for their family, and your reluctance to do that has created ","messageBody":"<div id=\"ygrps-yiv-130764467\">Dawn, somehow these children&#39;s parents have managed to get you to provide  <br/>\nfree childcare for their family, and your reluctance to do that has created  <br/>\nturbulence in your family. <br/>\n <br/>\nThis is a very little girl, and it is weird that her parents are sending  her <br/>\noff for hours a day to play with a much older child. I think your daughter  <br/>\nis probably needing more friends to play with, and that is why she&#39;s reacting  <br/>\nthis way. But, yes, you need to send these children home. I would keep lines <br/>\nof  communication open, because there could be problems there.<br/>\n <br/>\nCan you get out of the house some more, particularly around other  kids?<br/>\nKathryn Baptista<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":266096457,"authorName":"Momma","from":"&quot;Momma&quot; &lt;southernbelle@...&gt;","profile":"centurykissed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] at a loss","postDate":"1164572853","msgId":19338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMTQwMWM3MTAzOCQ3YTE4ZmYyMCQ2NDU4YThjMEBPZmZpY2U+"},"prevInTopic":19316,"nextInTopic":0,"prevInTime":19337,"nextInTime":19339,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"Sorry it s taken me so long to respond. We were out of town for a couple of days. The Grandmother and extended family are raising the children. Yes, a very ","messageBody":"<div id=\"ygrps-yiv-1412142459\">Sorry it&#39;s taken me so long to respond. We were out of town for a couple of<br/>\ndays.<br/>\n<br/>\nThe Grandmother and extended family are raising the children. Yes, a very<br/>\ndysfunctional family, every last one of them-8 adults living in the house. I<br/>\ndon&#39;t know if you all remember but I mentioned these children a few months<br/>\nago-the little boy who was killing the kittens, chased my dd with a hammer,<br/>\nbit her and beat her up and was calling her horrible names. They only play<br/>\nin our house or in our yard with me or my son watching because my dds safety<br/>\nwas a concern. CPS is involved with the family. The grandma just started<br/>\nworking and grandpa works nights. Others are just in and out during the day.<br/>\nTalking to the grandma is not an option. A few months ago I told the kids<br/>\nthat they needed to go home because my dh had had a long day and wanted some<br/>\nquiet. The kids ran home crying and grandma called me. I tried to explain<br/>\nbut she screamed at me for a full five minutes before I hung up on her. She<br/>\ndidn&#39;t speak to me for 2 months, which I have to admit was kind of nice:-).<br/>\nI try to avoid her as much as possible. I am not willing to deal with her.<br/>\nAs for getting out of the house, we only have our car a couple of days a<br/>\nweek. We have a motorcycle, a car and a truck. Since it&#39;s been cold my dh<br/>\ntakes my car (he has an hour drive to work on the highway) and the truck is<br/>\nsuper expensive to gas up, but we will just have to. We live in a pretty<br/>\nrural area. They are our only neighbors. It&#39;s kind of ironic. We moved from<br/>\nthe city to get away from so many neighbors and have some peace. We ended up<br/>\nwith the neighbors from hell. LOL<br/>\n<br/>\nI am going to take your great advice and have a talk with my dd. I think<br/>\nhaving them over in the afternoon after the little boy gets out of school<br/>\nuntil about dinner time will be good. In the mornings we can spend time<br/>\ndoing our own things together. Besides in the afternoon is when they seem to<br/>\nhave the most energy anyway. They will be ready to go run with their friends<br/>\nby then.  I think it might be a good idea to brainstorm some new fun things<br/>\nto do together in the mornings. Thank you all so much. I don&#39;t feel like<br/>\nsuch a meanie now. I know we&#39;ll have to deal with some tears but I&#39;m sure if<br/>\nI really talk with her about it she will understand. <br/>\n<br/>\nThanks again!<br/>\n<br/>\nDawn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n.<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://geo.yahoo.com/serv?s=97359714/grpId=12789513/grpspId=1705081972/msgI\">http://geo.yahoo.com/serv?s=97359714/grpId=12789513/grpspId=1705081972/msgI</a><br/>\nd=19257/stime=1164421821/nc1=3848528/nc2=4025306/nc3=3&gt; <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: at a loss","postDate":"1164427218","msgId":19266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVrOGY0aSs2dWJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYxMTI1MDIyODE1LjI4MDQucW1haWxAd2ViMzE0MTAubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":19261,"nextInTopic":19316,"prevInTime":19265,"nextInTime":19267,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"~ Where is this 3 year olds Mom that she is at your house till 9 pm at night?~ Exactly. I m sorry, but I don t feel compelled to raise someone elses child in ","messageBody":"<div id=\"ygrps-yiv-657528931\">~<br/>\nWhere is this 3 year olds Mom that she is at your house till 9 pm at<br/>\nnight?~<br/>\n<br/>\nExactly.<br/>\nI&#39;m sorry, but I don&#39;t feel compelled to raise someone elses child in<br/>\norder to please someone else in my family. If my child wanted to be<br/>\naround another child, I can certainly accomodate playdates without<br/>\nletting that child disrupt my entire life and eat all my food. I think<br/>\ntaking care of your own children is the priority.<br/>\n<br/>\nIf she really likes this child, maybe you could accompany her to the<br/>\nother house and have a playdate there, with you present. I would voice<br/>\nmy concerns about such small children being absent from the parent!<br/>\nThat is really worrisome.<br/>\n<br/>\nI don&#39;t think anyone should expect their entire house to be disrupted.<br/>\nI would state my needs and concerns very clearly to my child and<br/>\nexplain that it is not my job to care for these other<br/>\nchildren...obviously they have parents that should be doing their job.<br/>\n<br/>\nIf an adult was disrupting my house, causing fighting and eating my<br/>\nfood, I would have no problem sending them home. I think your son has<br/>\nthe right idea. If your daughter is so bonded to them that she&#39;s<br/>\nwilling to put up with the problems, there needs to be some discussion<br/>\nabout how to meet everyone&#39;s needs. I&#39;m not willing to let my<br/>\nhousehold be disrupted for someone elses child that I&#39;m NOT<br/>\nresponsible for. The other concern is that if the parents are so<br/>\nwilling to neglect their children, how will they respond if one of<br/>\nthem gets hurt at your house? Something to consider.<br/>\n<br/>\nUnschooling isn&#39;t about ignoring your own needs.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":63209806,"authorName":"lpodietz","from":"&quot;lpodietz&quot; &lt;lpodietz@...&gt;","profile":"lpodietz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: at a loss","postDate":"1164424183","msgId":19261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVrOGM1bitrcGY5QGVHcm91cHMuY29tPg=="},"prevInTopic":19260,"nextInTopic":19266,"prevInTime":19260,"nextInTime":19262,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"... wrote: The little girl usually comes over first thing in the morning and stays all day, usually until about 9pm.  I am usually a lurker here, but I your","messageBody":"<div id=\"ygrps-yiv-514652200\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Momma&quot; &lt;southernbelle@...&gt; <br/>\nwrote:<br/>\nThe little girl usually comes over first thing in the<br/>\nmorning and stays all day, usually until about 9pm. &gt; <br/>\n<br/>\n<br/>\nI am usually a lurker here, but I your post compelled me to chime in, <br/>\nthough I certainly am no expert and don&#39;t know the details of your <br/>\nsituation.  But I have to admit I&#39;m, well, shocked, that the mother of <br/>\na 3-yr-old would allow her to spend the entire day and evening in <br/>\nsomeone else&#39;s care... Can you yourself imagine doing that? I can&#39;t. I <br/>\nfind this situation to be really troubling... Where is this child&#39;s <br/>\nmother??<br/>\nYou say you want to accommodate your daughter&#39;s needs, but I feel very <br/>\nstrongly that you need to take care of yourself and your family <br/>\nfirst.  This may not be a popular view to put out on this list, but I <br/>\ndon&#39;t think that unschooling needs to include allowing an unhealthy <br/>\nsituation to persist, just because your daughter would like it to.<br/>\nI think your son is very wise here---just SEND HER HOME. Is setting <br/>\nlimits going against unschooling?  I don&#39;t think your life should be a <br/>\nfree-for-all at your expense.  Your needs are just as important as <br/>\nyour daughter&#39;s.  I think a frank conversation with the mother of this <br/>\nlittle girl to let her know the effect this is having on your family <br/>\nmight be really needed here (if that&#39;s possible).<br/>\nSorry if I sound worked up over this... I am struggling with my own <br/>\nquestions about unschooling vs. setting limits. You are the grown-up <br/>\nhere and you have rights, needs and a gut-feeling that this sitation <br/>\nis not working for you.  Go with your gut.  That would be my advice.</div>","specialLinks":[]},{"userId":153118561,"authorName":"airokat@comcast.net","from":"airokat@...","profile":"dawakat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] at a loss","postDate":"1164422254","msgId":19259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMjUyMDA2MDIzNy4zNTk1LjQ1NjdBQzZEMDAwRUU1QzgwMDAwMEUwQjIyMDA3NjE0Mzg5QjBFMDUwMTlEMDcwRUBjb21jYXN0Lm5ldD4="},"prevInTopic":19257,"nextInTopic":19260,"prevInTime":19258,"nextInTime":19260,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"Dawn, I have been through this, and my opinion is that any child of three who is over at your house from early in the morning until 9pm has alot of neglect","messageBody":"<div id=\"ygrps-yiv-1048797091\">Dawn,<br/>\nI have been through this, and my opinion is that any child of three who is over at your house from early in the morning until 9pm has alot of neglect going on. I have been through this twice. When my daughter was 8, another little girl who showed up in the neighborhood would come over ALL DAY.  At first I did not mind, except that there were numerous &quot;red flags&quot; about the child and her &quot;parents&quot; never called to check up on her. My daughter was extremely kind toward her, and offered to &quot;share her mommy&quot; with her. One day my daughter was in tears because I could not afford to buy the girl a Xmas present in the price range my daughter wanted. She implored me, saying &quot;I just want Crystal to be happy!&quot; Maybe you should get more involved in whats going on and observe the girl and try to find out why there is so much conflict. Obviously she prefers your home to her own, and there may or may not be a good reason for that. Its really difficult to &quot;parent&quot; some vagabond neighborhood child so<br/>\nmetimes, but I really regret not taking more of an interest in Crystal, especially since she ended up in foster care somewhere and I cant find her. <br/>\nKathryn<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;Momma&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:southernbelle@...\">southernbelle@...</a>&gt; <br/>\nOkay, so I am not new to unschooling but this is my favorite list so I am<br/>\ngoing to go ahead and ask for advice here. <br/>\n<br/>\nI could really use some advice with an ongoing issue at our house. We have 2<br/>\nsmall neighbor friends who live behind us-boy is 5 and girl is 3. (Mine are<br/>\nalmost 8-dd and 10ds) The little boy is at school most days and comes over<br/>\nto play after school. The little girl usually comes over first thing in the<br/>\nmorning and stays all day, usually until about 9pm. The first few months<br/>\nwere okay. Lately I find myself getting more and more frustrated with the<br/>\nsituation. My dd wants so much to play with this little girl. She is very<br/>\nsocial and loves to have friends over. When the little girl is over the 3<br/>\n(or 4) kids fight a lot. There is a lot of screaming and yelling as I try to<br/>\nget the situation under control and find out what is going on. They run<br/>\nthrough the house, sometimes knocking things over, and when I ask them to<br/>\nplease go run outside or I try to find something else to occupy them my dd<br/>\ngets very nasty with me or throws a fit and starts screaming and crying.<br/>\nThey go to the pantry many times a day even though I try to keep special<br/>\nsnacks just for them. It wouldn&#39;t be an issue except that right now we are<br/>\nstruggling financially. They make a huge mess in my dds room and when I ask<br/>\nthem to help my dd pick up my dd throws a fit and they all just sit there<br/>\nand look at me. My dd tells me that the little boy calls me terrible names<br/>\nwhen I am not around and tells her not to listen to me. They go into my room<br/>\nand play with my things and when I ask them to please find somewhere else to<br/>\nplay my dd argues with me and tells me how mean I am. There is constant<br/>\nchaos in our house. My dd is getting very rude and belligerent towards me<br/>\nand her brother. By the end of the day I feel totally drained. I don&#39;t want<br/>\nto be around anyone. I don&#39;t feel like being loving and caring. I feel like<br/>\nrunning away. My son tells me just to send them home but I feel that it<br/>\nshouldn&#39;t be all about me. I really want to accommodate her needs as best I<br/>\ncan. Right now I feel like the meanest mom in the world. I miss my daughter.<br/>\nI feel that we don&#39;t have time together anymore but when I ask her if they<br/>\ncan maybe come over another day she cries and argues with me. She says she<br/>\nNEEDS her friend. How do I accommodate my dd and her needs and keep from<br/>\nloosing my mind at the same time? <br/>\n<br/>\nThanks in advance, <br/>\n<br/>\nDawn<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171724177,"authorName":"Kelly Weyd","from":"Kelly Weyd &lt;kellmar98@...&gt;","profile":"kellmar98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] at a loss","postDate":"1164421694","msgId":19260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMTI1MDIyODE1LjI4MDQucW1haWxAd2ViMzE0MTAubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":19259,"nextInTopic":19261,"prevInTime":19259,"nextInTime":19261,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"Where is this 3 year olds Mom that she is at your house till 9 pm at night?  I m sure others will have better advice.  I am also new to unschooling.  I try to","messageBody":"<div id=\"ygrps-yiv-2008680060\">Where is this 3 year olds Mom that she is at your house till 9 pm at night?  I&#39;m sure others will have better advice.  I am also new to unschooling.  I try to accomodate my children&#39;s needs to socialize with the neighborhood kids too, and most days it all works out fine.  But there are times I have to tell the neighborhood kids to go home.  And their are times I have to limit the snacks too.  We live in a neighborhood with lots of kids and they could clear my pantry in no time at all.......I can&#39;t afford to feed the neighborhood either.  <br/>\n  Kelly<br/>\n<br/>\nMomma &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:southernbelle@...\">southernbelle@...</a>&gt; wrote:<br/>\n          Okay, so I am not new to unschooling but this is my favorite list so I am<br/>\ngoing to go ahead and ask for advice here. <br/>\n<br/>\nI could really use some advice with an ongoing issue at our house. We have 2<br/>\nsmall neighbor friends who live behind us-boy is 5 and girl is 3. (Mine are<br/>\nalmost 8-dd and 10ds) The little boy is at school most days and comes over<br/>\nto play after school. The little girl usually comes over first thing in the<br/>\nmorning and stays all day, usually until about 9pm. The first few months<br/>\nwere okay. Lately I find myself getting more and more frustrated with the<br/>\nsituation. My dd wants so much to play with this little girl. She is very<br/>\nsocial and loves to have friends over. When the little girl is over the 3<br/>\n(or 4) kids fight a lot. There is a lot of screaming and yelling as I try to<br/>\nget the situation under control and find out what is going on. They run<br/>\nthrough the house, sometimes knocking things over, and when I ask them to<br/>\nplease go run outside or I try to find something else to occupy them my dd<br/>\ngets very nasty with me or throws a fit and starts screaming and crying.<br/>\nThey go to the pantry many times a day even though I try to keep special<br/>\nsnacks just for them. It wouldn&#39;t be an issue except that right now we are<br/>\nstruggling financially. They make a huge mess in my dds room and when I ask<br/>\nthem to help my dd pick up my dd throws a fit and they all just sit there<br/>\nand look at me. My dd tells me that the little boy calls me terrible names<br/>\nwhen I am not around and tells her not to listen to me. They go into my room<br/>\nand play with my things and when I ask them to please find somewhere else to<br/>\nplay my dd argues with me and tells me how mean I am. There is constant<br/>\nchaos in our house. My dd is getting very rude and belligerent towards me<br/>\nand her brother. By the end of the day I feel totally drained. I don&#39;t want<br/>\nto be around anyone. I don&#39;t feel like being loving and caring. I feel like<br/>\nrunning away. My son tells me just to send them home but I feel that it<br/>\nshouldn&#39;t be all about me. I really want to accommodate her needs as best I<br/>\ncan. Right now I feel like the meanest mom in the world. I miss my daughter.<br/>\nI feel that we don&#39;t have time together anymore but when I ask her if they<br/>\ncan maybe come over another day she cries and argues with me. She says she<br/>\nNEEDS her friend. How do I accommodate my dd and her needs and keep from<br/>\nloosing my mind at the same time? <br/>\n<br/>\nThanks in advance, <br/>\n<br/>\nDawn<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nEveryone is raving about the all-new Yahoo! Mail beta.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] at a loss","postDate":"1164421315","msgId":19257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWM3MTAzOCQ3YTE4ZmYyMCQ2NDU4YThjMEBPZmZpY2U+"},"prevInTopic":19255,"nextInTopic":19259,"prevInTime":19256,"nextInTime":19258,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"Dawn, I know there are more qualified mom s in this list that not only can express themselves better but have way more experience. It sounds like this is","messageBody":"<div id=\"ygrps-yiv-62185770\">Dawn,<br/>\n  I know there are more qualified mom&#39;s in this list that not only can express themselves better but have way more<br/>\n  experience.<br/>\n  It sounds like this is happening almost everyday.<br/>\n  If that is the case I would just get out of the house. Find lots of things to do outside that my kids love to do.<br/>\n  Maybe once a week or two the most I would be home for half a day and the neighbors kids would come over. After a few weeks I think that things would change.<br/>\n  I would also talk the other mom that you are overwhelmed with the kids being there a lot.<br/>\n  I find it really strange that a 3 year old would want to spend that much time without their mom.<br/>\n  They must not like to hang out with her and no wonder they tell your kids that you are mean. They don&#39;t know any other type of mom.<br/>\n  IT might be hard to be away all day but it might be worth it.<br/>\n  I am a homebody but if I was in this situation I would call the mom and also be unavailable for a while. I would get my kids to other places and maybe they would make new friends and <br/>\n  that could also help.<br/>\n  Again I don&#39;t know the details to the situation.<br/>\n  I am sure someone more qualified will have great ideas.<br/>\n  Alex  <br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":266096457,"authorName":"Momma","from":"&quot;Momma&quot; &lt;southernbelle@...&gt;","profile":"centurykissed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"at a loss","postDate":"1164418736","msgId":19255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":19257,"prevInTime":19254,"nextInTime":19256,"topicId":19255,"numMessagesInTopic":0,"msgSnippet":"Okay, so I am not new to unschooling but this is my favorite list so I am going to go ahead and ask for advice here. I could really use some advice with an","messageBody":"<div id=\"ygrps-yiv-1441679581\">Okay, so I am not new to unschooling but this is my favorite list so I am<br/>\ngoing to go ahead and ask for advice here. <br/>\n<br/>\nI could really use some advice with an ongoing issue at our house. We have 2<br/>\nsmall neighbor friends who live behind us-boy is 5 and girl is 3. (Mine are<br/>\nalmost 8-dd and 10ds) The little boy is at school most days and comes over<br/>\nto play after school. The little girl usually comes over first thing in the<br/>\nmorning and stays all day, usually until about 9pm. The first few months<br/>\nwere okay. Lately I find myself getting more and more frustrated with the<br/>\nsituation. My dd wants so much to play with this little girl. She is very<br/>\nsocial and loves to have friends over. When the little girl is over the 3<br/>\n(or 4) kids fight a lot. There is a lot of screaming and yelling as I try to<br/>\nget the situation under control and find out what is going on. They run<br/>\nthrough the house, sometimes knocking things over, and when I ask them to<br/>\nplease go run outside or I try to find something else to occupy them my dd<br/>\ngets very nasty with me or throws a fit and starts screaming and crying.<br/>\nThey go to the pantry many times a day even though I try to keep special<br/>\nsnacks just for them. It wouldn&#39;t be an issue except that right now we are<br/>\nstruggling financially. They make a huge mess in my dds room and when I ask<br/>\nthem to help my dd pick up my dd throws a fit and they all just sit there<br/>\nand look at me. My dd tells me that the little boy calls me terrible names<br/>\nwhen I am not around and tells her not to listen to me. They go into my room<br/>\nand play with my things and when I ask them to please find somewhere else to<br/>\nplay my dd argues with me and tells me how mean I am. There is constant<br/>\nchaos in our house. My dd is getting very rude and belligerent towards me<br/>\nand her brother. By the end of the day I feel totally drained. I don&#39;t want<br/>\nto be around anyone. I don&#39;t feel like being loving and caring. I feel like<br/>\nrunning away. My son tells me just to send them home but I feel that it<br/>\nshouldn&#39;t be all about me. I really want to accommodate her needs as best I<br/>\ncan. Right now I feel like the meanest mom in the world. I miss my daughter.<br/>\nI feel that we don&#39;t have time together anymore but when I ask her if they<br/>\ncan maybe come over another day she cries and argues with me. She says she<br/>\nNEEDS her friend. How do I accommodate my dd and her needs and keep from<br/>\nloosing my mind at the same time? <br/>\n<br/>\nThanks in advance, <br/>\n<br/>\nDawn<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":19236,"nextTopicId":19331}}