{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":222835102,"authorName":"lalow","from":"&quot;lalow&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: age appropriate viewing of movies","postDate":"1295647339","msgId":45950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloY3ZwYitmZXRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg1MzU1M0QzLTAyNjgtNDhEQS05RkJFLTk5ODExMkIzM0U2NkB2ZXJpem9uLm5ldD4="},"prevInTopic":45948,"nextInTopic":0,"prevInTime":45949,"nextInTime":45951,"topicId":45924,"numMessagesInTopic":0,"msgSnippet":"My kids are 5,7,8,9.  So not real old but I remember when my oldest was 3 and wanted to watch Jurasic Park. He saw the dinosaurs and immediatly wanted to see","messageBody":"<div id=\"ygrps-yiv-1318980330\">My kids are 5,7,8,9.  So not real old but I remember when my oldest was 3 and wanted to watch Jurasic Park. He saw the dinosaurs and immediatly wanted to see it.  I was sitting with him, nervous that it was too scary and I even turned it off at one point and said,&quot;this is too scary&quot;.  He asked me to turn it back on and said, &quot;if I am scared Ill tell you!&quot;.  Gave me some perspective.  My kids are actually very very good about knowing what they can handle.  My 8 year old wont watch movies with zombies but he loves other movies that I would think would scare him. My 5 year old barely pays any attention to anything that isnt a cartoon anyway. The other day he told me, &quot;can you change the channel, this show doesnt have black lines around the people&quot;.  I figured out he meant it wasnt a cartoon.  <br/>\nOne day we were watching one of the Lethal Weapon movies with my then 8 year old.  A sex scene was on and I was kind of uncomfortable with that, untill about halfway through the scene my son looks over and laughs and made a comment about the dog barking .  Wasnt bothering him at all, he didnt even have a context for the scene.  <br/>\nThat all being said, I dont go out of way to introduce movies or shows to them that I feel are meant for teenagers or adults.  I just dont forbid them.  Same with video games.  I never purposely started my kids playing M video games but my kids live in a the world so they learned about them and not too long ago asked to play Halo Reach.  We bought it and my husband plays it with them.  My 8 year old doesnt like to play it long, makes him uncomfortable.  He know what he can handle and he finds something else to do. He feels better playing it with his Dad.</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] age appropriate viewing of movies","postDate":"1295643367","msgId":45948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrYkxZVC0xZ3Fma0JKUXNzTjZnRzhRTUtrSG1pTl9Oc2pIc1BTVUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGloYjljZitxajUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGloYjljZitxajUyQGVHcm91cHMuY29tPg=="},"prevInTopic":45944,"nextInTopic":45950,"prevInTime":45947,"nextInTime":45949,"topicId":45924,"numMessagesInTopic":0,"msgSnippet":"Just to give you another perspective. Ryan, our 7-year-old, loves to watch the war and military history shows on PBS, the History Channel, the Military ","messageBody":"<div id=\"ygrps-yiv-509969876\">Just to give you another perspective. Ryan, our 7-year-old, loves to watch<br/>\nthe war and military history shows on PBS, the History Channel, the Military<br/>\nChannel, and the Military History Channel. (And yes, there are 3 separate<br/>\ncable channels for those stations here *boggle*) Even though the real or<br/>\nre-enacted violence on those shows don&#39;t bother him, some commercials on the<br/>\ncartoon channel (especially during adult swim) really do bother him. They<br/>\nupset him so much he asked to have the TV blocked so that &quot;I don&#39;t<br/>\naccidentally see those scary commercials if I fall asleep and wake up and<br/>\ndon&#39;t realize what channel is on.&quot; He&#39;ll watch Family Guy (Or Family Guide<br/>\nas he calls it *grin*), but he turns his attention to something else when<br/>\nthe commercials come on. It took us a while to figure out how to block just<br/>\nCartoon Network so at first we just blocked anything above a PG rating and<br/>\nunblocked it when he wanted a show on a blocked channel. This led to him<br/>\ncoming up the stairs one day to tell me, in a very exasperated voice, &quot;Ba. I<br/>\nwas watching a documentary about the Blitz on the History Channel and it<br/>\njust ended and screen went blacked! I don&#39;t mind blocking Cartoon Network<br/>\nbecause it is scary, but please hurry and unblock my channel right away<br/>\nbecause they said another documentary about WWII is about to start!&quot;<br/>\nNeedless to say, we ran downstairs and got it unblocked just in time for the<br/>\nnext show which was really cool, but that&#39;s another story ;)<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: age appropriate viewing of movies","postDate":"1295634333","msgId":45944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloY2oydCtxMDk5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGloYjljZitxajUyQGVHcm91cHMuY29tPg=="},"prevInTopic":45935,"nextInTopic":45948,"prevInTime":45943,"nextInTime":45945,"topicId":45924,"numMessagesInTopic":0,"msgSnippet":"... ****************** Its important to follow kids cues - behavior and body language say a lot! Some kids find adult scenes (either lots of talking or sex","messageBody":"<div id=\"ygrps-yiv-2040268599\">&quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He seemed completely unphased by the content of the movies. I suppose most of it was unfamiliar and lacking context for him. <br/>\n </span></blockquote>******************<br/>\n<br/>\nIts important to follow kids&#39; cues - behavior and body language say a lot! Some kids find &quot;adult&quot; scenes (either lots of talking or sex or some combination) dull and don&#39;t want to watch it... which doesn&#39;t mean its okay to have that on, necessarily, if your child is merely putting up with a (from his perspective) dull grown-up film just to be close to you. Do you see what I mean? The difference between &quot;playing happily and doesn&#39;t really care what&#39;s on&quot; and &quot;jeez, here we go again, but I&#39;ll sit through it to get some time with my parent&quot;. <br/>\n<br/>\nWanting to be with parents can be a motivation for a child Not expressing discontent with a movie or tv, especially a parent who works outside the home. Many people have had the experience, as children, of sitting through news and other content they didn&#39;t want to see, and found distressing, just to spend time with mom or dad. That&#39;s something to think about if your partner works outside the home and also likes to watch things that your child might prefer not to see. <br/>\n<br/>\nIt helps me to step past &quot;age appropriate&quot; to think of my kids as friends. I&#39;ve reviewed movies for adult friends with special attention to personal preferences. It makes good sense to do the same for my kid-friends. When my daughter has wanted to watch movies I&#39;ve recommended against, I&#39;ve helped her come up with strategies for getting through the bits she won&#39;t like. <br/>\n<br/>\nShe&#39;s surprised me from time to time. I didn&#39;t expect her to like Kill Bill, for instance, when it came on tv and Ray wanted to watch it - this was a couple years ago, now, so Mo was 7ish and Ray 15ish. She reads a lot of comics and graphic novels, though, so she saw a lot of the humor and references that I had missed. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] age appropriate viewing of movies","postDate":"1295616113","msgId":45935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1MzU1M0QzLTAyNjgtNDhEQS05RkJFLTk5ODExMkIzM0U2NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGloYjljZitxajUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGloYjljZitxajUyQGVHcm91cHMuY29tPg=="},"prevInTopic":45931,"nextInTopic":45944,"prevInTime":45934,"nextInTime":45936,"topicId":45924,"numMessagesInTopic":0,"msgSnippet":"... It s confusing because you re basing your decision on what *you* want him to see but there s no solid criteria to go by. Rather than his protector, be his","messageBody":"<div id=\"ygrps-yiv-1755057703\">On Jan 21, 2011, at 1:33 AM, keeliereader wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; there&#39;s things in the movies that I don&#39;t really want Jack to see at  <br/>\n&gt; his age.<br/>\n<br/>\n </span></blockquote>It&#39;s confusing because you&#39;re basing your decision on what *you* want  <br/>\nhim to see but there&#39;s no solid criteria to go by.<br/>\n<br/>\nRather than his protector, be his partner.<br/>\n<br/>\nWhat does he want to see?<br/>\n<br/>\nWhat does he want to avoid?<br/>\n<br/>\nAs you said, it didn&#39;t sound like he cared one way or another right now.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If Jack stays up later in the evening do we never watch adult- <br/>\n&gt; content movies again?? Or do I assume he&#39;ll take what he needs and  <br/>\n&gt; leave the rest.<br/>\n<br/>\n<br/>\n </span></blockquote>Don&#39;t assume. Get to know him :-)<br/>\n<br/>\nRight now, as you noticed, he&#39;s not paying a lot of attention to the  <br/>\nstory. But by 3ish he probably will have a decent grasp.<br/>\n<br/>\nThere probably will be some adult content and kid content movies he&#39;s  <br/>\nfine with and some he won&#39;t be. But it will be something in the movie  <br/>\nand not the rating on the box ;-)<br/>\n<br/>\nGet to know what those somethings are. For my daughter it was moving  <br/>\nskeletons. For some kid&#39;s it&#39;s people bickering. For some it&#39;s anxious  <br/>\nmusic.<br/>\n<br/>\nWhen he&#39;s older, Sceen It can help. It gives a break down of what  <br/>\nmight bother kids in movies.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.screenit.com/\">http://www.screenit.com/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: age appropriate viewing of movies","postDate":"1295615346","msgId":45931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1ODA4OTZCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":45924,"nextInTopic":45935,"prevInTime":45930,"nextInTime":45932,"topicId":45924,"numMessagesInTopic":0,"msgSnippet":"DS was watching 007 movies by the time he was about 5 - he was *choosing* to watch them. Made me uncomfortable at first until I realized that the double","messageBody":"<div id=\"ygrps-yiv-211148193\">DS was watching 007 movies by the time he was about 5 - he was<br/>\n*choosing* to watch them. Made me uncomfortable at first until I<br/>\nrealized that the double entendres (all the &quot;Bond girl&quot; names for<br/>\nexample) and all of the &quot;adult&quot; content was flying right by him - if he<br/>\ncould have eliminated all of that to get to the cool gadgets and<br/>\nvillains, he would have. After about 4 years or so of watching 007 and<br/>\nplaying 007-themed videogames, he commented &quot;Gee he kisses a lot of<br/>\ngirls&quot;. When he was toddler age, we had limited cable, some VHS movies,<br/>\nso there wasn&#39;t the vast array of programming that is now available to<br/>\nus (digital cable, DVDs, streaming video on computers, etc). He&#39;s 12 now<br/>\nand those early movies don&#39;t seem to have caused a problem. We were,<br/>\nhowever, careful, to monitor what things bothered DS - a lot of the<br/>\ntypical Disney &quot;kid&#39;s movies&quot; were totally out because they usually<br/>\ninvolve the death of the character&#39;s mom/family/home. And, DH would<br/>\nwatch scary stuff (like Steven King) when both DS and I were not around<br/>\n- it bothers me to watch that stuff too.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"age appropriate viewing of movies","postDate":"1295591631","msgId":45924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloYjljZitxajUyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45931,"prevInTime":45923,"nextInTime":45925,"topicId":45924,"numMessagesInTopic":0,"msgSnippet":"Hello, I have a question related to age appropriate viewing of movies. When  we were on holiday over Christmas my partner (the father of my child - just to","messageBody":"<div id=\"ygrps-yiv-286284976\">Hello, <br/>\n<br/>\nI have a question related to age appropriate viewing of movies. When  we were on holiday over Christmas my partner (the father of my child - just to clarify!) wanted to watch a movie on the movie channel. He loves movies. <br/>\n<br/>\nAt this stage Jack is still up. He&#39;s 2.5 and tends to opt for a 10 o&#39;clock bedtime. Well, his ideal is really the same bedtime as mine. <br/>\n<br/>\nSo he&#39;s playing but occasionally watching the movie. We watched Prince of Persia, and the second night we watched the hangover. I felt uncomfortable having the movies on because there&#39;s things in the movies that I don&#39;t really want Jack to see at his age. I spoke to my partner afterwards and suggested we opt for more family friendly movies in future (the movie channel only had one option). <br/>\n<br/>\nBut then I started to wonder when I would feel more comfortable. Am I doing him any favours when I &#39;protect&#39; him from content that isn&#39;t produced with his age range in mind. But if I am, when will I know he&#39;s ready to watch this kind of movie? When he&#39;s 5? 10? 15? If Jack stays up later in the evening do we never watch adult-content movies again?? Or do I assume he&#39;ll take what he needs and leave the rest. <br/>\n<br/>\nHe seemed completely unphased by the content of the movies. I suppose most of it was unfamiliar and lacking context for him. I&#39;m wondering what this looks like from an unschooling perspective. <br/>\n<br/>\nThanks, <br/>\nKeelie</div>","specialLinks":[]}],"prevTopicId":45869,"nextTopicId":45918}}