{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1344112914","msgId":48879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2azFlaStzcjUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2YjdxbityNjZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":48875,"nextInTopic":0,"prevInTime":48878,"nextInTime":48880,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Wow, what a wonderful article! I ve been saying the same thing myself, about the folly of forcing nearly 100% of the population to pass algebra courses or","messageBody":"<div id=\"ygrps-yiv-844444441\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@...&quot; &lt;marbleface@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... he might want to keep this sort of article in mind for some<br/>\n&gt; perspective -- <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2012/07/29/opinion/sunday/is-algebra-necessary.html?pagewanted=all\">http://www.nytimes.com/2012/07/29/opinion/sunday/is-algebra-necessary.html?pagewanted=all</a>  -- could be less serious<br/>\n&gt; than we hear. <br/>\n<br/>\n </span></blockquote>Wow, what a wonderful article!<br/>\n<br/>\nI&#39;ve been saying the same thing myself, about the folly of forcing nearly 100% of the population to pass algebra courses or be considered failures in life, ever since I was in college myself! (And I didn&#39;t struggle with algebra - I just found it irrelevant.)<br/>\n<br/>\nI rather disagree with him about forcing kids to learn long division. That&#39;s not necessary to function in a society where everyone has calculators, either. It&#39;s a good idea to have been exposed to the process, but it&#39;s not a good idea to stress kids out over it, and force them to pass tests in it or be punished if they don&#39;t.<br/>\n<br/>\nI have suggested to some people I know who teach or work in colleges that higher math should not necessarily be taught as a separate subject at all. If the math involved in sciences, sociology, history, cooking, agriculture, medicine, engineering, etc, were taught as an integrated part of those courses, the students would learn to perform the calculations necessary for the purposes they need it for, and it would make sense, be relevant, and far fewer people would struggle with it. People would come to see/understand the patterns in the types of math that come up repeatedly in various aspects of their lives.<br/>\n<br/>\nAlgorithms and formulas are just patterns that people recognized, long ago, in what they saw in the natural world. When the mathematicians took those patterns out of the context in which they were discovered, it was, to my way of thinking, like advocating that everyone take vitamin pills, instead of teaching them ways to maintain a healthy diet and get the nutrition they need from their food. Neither of these non-holistic approaches seems to be very good for the general population.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1344050703","msgId":48875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2aTRtZitmY3FmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJ0RVVxZWFydHoyTUxBN249RVlhMFlfMlRhSFRrTTlfX3ZvWTRYMlpyN0oyQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48867,"nextInTopic":48879,"prevInTime":48874,"nextInTime":48876,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... There is an article that I love, by Daniel Greenberg, one of the founders of the Sudbury Valley School, about teaching all of the concepts in arithmetic to","messageBody":"<div id=\"ygrps-yiv-1239174956\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jodi Harvatin &lt;jodskiinca@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; ... Well, my 15 yr. old hasn&#39;t had much in the way of formal math<br/>\n&gt; at all, so I&#39;m not sure how he&#39;d pass the math portion of the ACT.<br/>\n&gt;  He hates writing as well.  He would be willing to do the test<br/>\n&gt; prep, though.  I&#39;m just not sure how he&#39;d learn the math he needs<br/>\n&gt; to know for the ACT, in a short period of time.  I feel like I&#39;m<br/>\n&gt; failing my kids.  Clearly, I don&#39;t fully understand unschooling,<br/>\n&gt; although I&#39;m in love with the idea.<br/>\n&gt; <br/>\n&gt; Jodi<br/>\n<br/>\n </span></blockquote>There is an article that I love, by Daniel Greenberg, one of the founders of the Sudbury Valley School, about teaching all of the concepts in arithmetic to a group of willing students, in just 20 hours. (I thought I had remembered it including algebra, but apparently it was just everything up to algebra. BUT, it was just 20 hours of formal instruction!)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scribd.com/doc/14389275/And-Rithmetic-by-Daniel-Greenberg\">http://www.scribd.com/doc/14389275/And-Rithmetic-by-Daniel-Greenberg</a><br/>\n<br/>\nWhen a student decides that s/he wants to learn it, it just doesn&#39;t take all that long.<br/>\n<br/>\nAs to exactly how to learn college-prep math (arithmetic, algebra, and some geometry, enough for college admission purposes), there are various resources, depending on what&#39;s available where you live, and what you can afford. Books, websites, online videos, DVDs, classes for homeschoolers, GED prep classes, online classes, a private tutor, auditing a remedial math class for college students, ... whichever of these resources your son chooses, he will probably learn what he needs to know in the time he allots for it. <br/>\n<br/>\nIf he really hates writing, he probably shouldn&#39;t try college until he no longer hates it. To get a degree, a student has to take at least *some* courses that involve writing, so he&#39;ll need to at least be able to tolerate it. (Just as my daughter will have to tolerate math, to get the science degree she wants.)<br/>\n<br/>\nSomeone who hates writing at the age of 15 might not hate it at the age of 17 or 18 or 20, etc. Or he might decide that he&#39;s willing to do things he hates because they&#39;re necessary for attaining his own goals.<br/>\n<br/>\nMy daughter hates being told what to write about, even though she&#39;s a great writer and loves writing fiction, when the mood strikes. But she chose to take an online lit/comp class (when she was 18 - NOT when she was 15 or even 17) and she did the writing assignments, and she&#39;s willing to write essays and reports in college in order to get a degree, so that she can eventually work in a profession that she will love.  <br/>\n<br/>\nIf you are giving your kids the freedom to choose what to learn, when they decide to learn it, and helping them to find resources to choose from to learn what they&#39;re interested in, then it seems unlikely that you&#39;re &quot;failing them&quot;. <br/>\n<br/>\nWhen my daughter went to take the GED tests, she was one among dozens, for every test. This one testing center near us has young adults coming to take the GED tests every week, all throughout the year! And it&#39;s just one of dozens of GED locations in the metro area I live in. Some of the test-takers were foreigners, who had grown up in a country where high school was not even an option for them, and where free lending libraries with books, audio books, DVDs and internet access do not exist. A very few, besides my daughter, might have been homeschooled or unschooled. (My daughter&#39;s best friend was also unschooled, and she also got her GED  recently.) But the majority of the test-takers there were people who had been &quot;failed&quot; by the public school system. The system had failed them because it tried to force them to learn something they weren&#39;t ready to learn, and didn&#39;t want to learn.<br/>\n<br/>\nYet every one of these individuals managed to learn what they needed to know, to pass the tests they needed to take, to pursue a degree or vocational training, when *they* decided to learn it. And the GED prep classes usually take between 6 months and a year, for people who have never completed 9th grade, were NOT homeschooled or unschooled, AND who learned, from the bad (at least, bad for *them*) schools they were forced to attend, to hate learning.<br/>\n<br/>\nSurely giving your kids freedom, support, encouragement, options to choose from, and access to whatever resources are available, can not have &quot;failed them&quot;. Whatever the result, it&#39;s GOT to be better than the result of forced, unwanted schooling on all those mal-educated American high-school drop-out GED test-takers.<br/>\n<br/>\n(I suppose that&#39;s why a lot of homeschoolers feel that there&#39;s some stigma about having a GED - i.e., because of the background of most of the people who get it. But, at this point, it has become a fairly common choice for homeschoolers, when having an accredited diploma turns out to be the most hassle-free option for getting into college or getting a job. Apparently, GA isn&#39;t the only state limiting who can enroll in community colleges these days.)<br/>\n<br/>\nAnd I&#39;m not saying that any homeschooler or unschooled person needs to choose the GED. Taking the ACT works just fine for lots of unschoolers who want to go to college in states like GA. In states like CA, CT, NM, MD, AZ, and many others, no tests are necessary to enroll in a community college. I&#39;m just saying that the high number of people going for the GED is an indication that you haven&#39;t failed your kids by letting them choose when, what, and how to learn.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343824535","msgId":48867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2YjdxbityNjZ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJzZm9qdWZXa3hRWE5uWE9ZSlZEdFdtcDFFYzYzOFBoWj04VGJkVkc5eUYtd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48855,"nextInTopic":48875,"prevInTime":48866,"nextInTime":48868,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"The baby can stay up late. Dad can stay up late. Routines can be broken. It s not every night. It would be something special. And I couldn t pass the ACT now","messageBody":"<div id=\"ygrps-yiv-221118165\">The baby can stay up late. Dad can stay up late. Routines can be broken. It&#39;s not every night. It would be something special. <br/>\n<br/>\nAnd I couldn&#39;t pass the ACT now either. But if I got a study guide and whatever else I needed to get ready for the study guide, and took the time to do the work, I could. <br/>\n<br/>\nIf I wanted to. :)<br/>\n<br/>\nOf course, remarks about feeling &quot;dumb&quot; because he thinks he&#39;s not doing the same math as school students -- and he might want to keep this sort of article in mind for some perspective -- <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2012/07/29/opinion/sunday/is-algebra-necessary.html?pagewanted=all\">http://www.nytimes.com/2012/07/29/opinion/sunday/is-algebra-necessary.html?pagewanted=all</a>  -- could be less serious than we hear. <br/>\n<br/>\nBut if he really wants to study school math as a step on the way to other things, there are many ways to do it. Like learning about music, it takes time. If he needs to do something he&#39;s not terribly interested in to get to something he is interested in, like college, looking ahead to ACT or other test/course requirements can help him see the path. There&#39;s no need to be overwhelmed by that path or doubt that it can be done. There&#39;s always a way. It may not look anything like his older brother&#39;s path, but that&#39;s OK. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jodi Harvatin &lt;jodskiinca@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; On Mon, Jul 30, 2012 at 6:38 PM, Schuyler &lt;s.waynforth@...&gt;wrote:<br/>\n&gt; <br/>\n&gt; &gt; **<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Given what you&#39;ve written in previous post I&#39;m guessing he&#39;s not the only<br/>\n&gt; &gt; one who is struggling to see what he is learning without a more formal<br/>\n&gt; &gt; education. I assume his feeling dumb is a leftover of whatever got you to<br/>\n&gt; &gt; change educational approaches. It may help for you to read here:<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a> and here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help.\">http://sandradodd.com/help.</a> It<br/>\n&gt; &gt; will help a lot if you don&#39;t think he&#39;s dumb for not knowing certain things<br/>\n&gt; &gt; as well.<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; Thank you, Schuyler.  I definitely do not think he&#39;s dumb.  I think he&#39;s<br/>\n&gt; very bright, actually.  He just doesn&#39;t know much math, which IMO, doesn&#39;t<br/>\n&gt; make him dumb.  Those were his words.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; If he&#39;s feeling as though you&#39;ve dropped him off an edge without a<br/>\n&gt; &gt; parachute, from doing school to floating in the ether, do more with him.<br/>\n&gt; &gt; You say he likes drumming and guitar and piano and video games, does he<br/>\n&gt; &gt; have Rock Band? Maybe he&#39;d enjoy the combination. See if there are any<br/>\n&gt; &gt; concerts local to you that he might enjoy, bands that he hasn&#39;t heard.<br/>\n&gt; &gt; Engage him more with the world of music and video games. Step away from the<br/>\n&gt; &gt; idea that education is limited to paper and pencil explorations of subjects<br/>\n&gt; &gt; and move into the idea that education comes from engaging with the world<br/>\n&gt; &gt; around you in ways that are meaningful to you. Instead of spending your<br/>\n&gt; &gt; time and his worrying about what he doesn&#39;t know, come up with ways to<br/>\n&gt; &gt; better spend the both of your time.<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; He may very well feel that way, but when I&#39;ve given him the choice and<br/>\n&gt; explained to him that we don&#39;t HAVE to do formal math, he chose not to do<br/>\n&gt; it and I was perfectly ok with that.  He never did much in the way of<br/>\n&gt; formal math, though, so I think it&#39;s just that he&#39;s comparing himself to<br/>\n&gt; his friends who attend public school or do formal homeschooling.  The<br/>\n&gt; difficult part is that if he decides to go to college, like his older<br/>\n&gt; brother wants to do, he&#39;ll need to know math in order to pass the ACT.  I<br/>\n&gt; just looked at a practice ACT test last night and there&#39;s no way he would<br/>\n&gt; pass the math section.  Heck, I don&#39;t think *I* would pass the math section!<br/>\n&gt; <br/>\n&gt; One difficult part of unschooling, for me, is that I have 3 small children,<br/>\n&gt; which makes it more difficult for me to go do things that interest my older<br/>\n&gt; 2 boys.  I can&#39;t be the only unschooler in my situation, though, so I need<br/>\n&gt; to figure it out.  I wish it was easy to hop in the car and head to a<br/>\n&gt; concert with my oldest boys.  They&#39;d love that.  My 2 yr. old doesn&#39;t go to<br/>\n&gt; sleep for my husband though, so I need to be here at bedtime.  You&#39;ve got<br/>\n&gt; my wheels turning, now.  Thanks for that.  :)<br/>\n&gt; <br/>\n&gt; Jodi<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Starting formal math lessons as a teen","postDate":"1343748807","msgId":48855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJzZzhVTk5FNlJ5YzhLaW9yMV96LXQrLVZ2WldfWVE4V1BSQz0wRmZ0bXBpZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDI3RDIxNjQyLTRDOUUtNEE0Mi05N0I5LUQ1NjY5QTJGRTM3RkB2ZXJpem9uLm5ldD4=","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4JPGp1c2g2ayt2NGRjQGVHcm91cHMuY29tPgk8Q0FKdEdRcnRkbXpvRWVycUVQTHdWMDFOdENHTHBhQTV1N0ZwX25wPXI4eThUVTI3PUZRQG1haWwuZ21haWwuY29tPgk8MjdEMjE2NDItNEM5RS00QTQyLTk3QjktRDU2NjlBMkZFMzdGQHZlcml6b24ubmV0Pg=="},"prevInTopic":48854,"nextInTopic":48867,"prevInTime":48854,"nextInTime":48856,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... I keep reading all of these stories about unschoolers who go on to do extremely well in college and I really hope I have similar stories with my kids, when","messageBody":"<div id=\"ygrps-yiv-380732500\">On Mon, Jul 30, 2012 at 2:58 PM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Which is how my daughter learned the majority of her math, except for her<br/>\n&gt; it was video games and art programs.<br/>\n&gt;<br/>\n&gt; Video games are phenomenal for math because players are using math to pull<br/>\n&gt; information from the game they need for the game. They make decisions based<br/>\n&gt; on data available, read maps, plan strategy.<br/>\n&gt;<br/>\n&gt; She went from video games to her father&#39;s college statistics class. She<br/>\n&gt; does have a head for math but truly she did no more than a couple of hours<br/>\n&gt; of more formal math the previous 14 years of her life. She always had the<br/>\n&gt; best or near the best scores on homework and tests out 50 students he<br/>\n&gt; taught. *They* had 12+ years of math. The obvious conclusion is that<br/>\n&gt; everyone else was hampered by school math not helped. The few exceptions<br/>\n&gt; where those who managed to overcome the damage school was doing.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I keep reading all of these stories about unschoolers who go on to do<br/>\nextremely well in college and I really hope I have similar stories with my<br/>\nkids, when they are grown!  My 17 yr. old wasn&#39;t unschooled, though, so I<br/>\nknow it&#39;s different for him.  My 15 yr. old has less formal education<br/>\nbecause I spent so much time with my 20 yr. old, when he was young.  He has<br/>\na learning disability and needed a lot more help when we were<br/>\nhomeschooling, years ago.  My 15 yr. old spent more time playing and doing<br/>\nwhat HE wanted to do and I didn&#39;t have the 3 little ones, so we did a lot<br/>\nmore &quot;field trips.&quot;  I know, I&#39;m doing a whole lot of worrying, when I<br/>\nshould be reading more about unschooling.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Then, I think about the fact that if he were in school, he&#39;d be<br/>\n&gt; &gt; entering his senior year this year and do we need to do something more!<br/>\n&gt;<br/>\n&gt; It might help to think of kids in school as getting less. They&#39;re locked<br/>\n&gt; away from life, getting someone else&#39;s predigested ideas about what &#39;s<br/>\n&gt; important to memorize. Your son is absorbing how math works by using math.<br/>\n&gt; That&#39;s way better than school math. Unfortunately school defined &quot;math&quot; as<br/>\n&gt; the ability to memorize formulas. It&#39;s similar to memorizing words and<br/>\n&gt; sentence structure of a language you don&#39;t know. It isn&#39;t how our brains<br/>\n&gt; are wired to learn. They&#39;re wired to pull patterns out of life, find<br/>\n&gt; connections between them, try things, draw conclusions, test those<br/>\n&gt; conclusions, make adjustments. It&#39;s how kids effortlessly learn their<br/>\n&gt; primary language. It&#39;s how unschooling kids learn math and everything else.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>That helps to hear, but it&#39;s harder to comprehend, when the whole &quot;math<br/>\ndrill&quot; is so ingrained in my head.  Thanks for the great links.  I&#39;m off to<br/>\nread and learn.<br/>\n<br/>\nJodi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Starting formal math lessons as a teen","postDate":"1343748182","msgId":48854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJ0RVVxZWFydHoyTUxBN249RVlhMFlfMlRhSFRrTTlfX3ZvWTRYMlpyN0oyQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp2ODhtOStyNmZqQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSnRHUXJ0OFFRRWhpTXc2Tl8rK0Q0U0x0N2JZVGtIRDdMN0Y0T3VyZlZUQzd0d2tXQUBtYWlsLmdtYWlsLmNvbT4JPGp2ODhtOStyNmZqQGVHcm91cHMuY29tPg=="},"prevInTopic":48850,"nextInTopic":48855,"prevInTime":48853,"nextInTime":48855,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Well, my 15 yr. old hasn t had much in the way of formal math at all, so I m not sure how he d pass the math portion of the ACT.  He hates writing as well.","messageBody":"<div id=\"ygrps-yiv-2008978540\">On Tue, Jul 31, 2012 at 4:31 AM, lindaguitar &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindaguitar@...\">lindaguitar@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; That&#39;s not a bad idea, if he&#39;s willing to do that. Studying for the ACT or<br/>\n&gt; studying for the GED is pretty much the same thing. (The two extra subjects<br/>\n&gt; for the ACT - science and history - are really just reading comprehension.<br/>\n&gt; People who take the GED do need to take an essay test, though, and I was<br/>\n&gt; told that the basic ACT does NOT include an essay. So if writing is not one<br/>\n&gt; of your son&#39;s strong points, and he&#39;s OK or good at math, the ACT is<br/>\n&gt; probably what he should study for. It also depends on the requirements of<br/>\n&gt; the college.) If he&#39;s willing to devote a couple of hours a week to<br/>\n&gt; test-prep, for at least 6 months, and he has already done some formal<br/>\n&gt; academic learning in the past, he should have no trouble with whichever<br/>\n&gt; test (or tests) he decides to take.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Well, my 15 yr. old hasn&#39;t had much in the way of formal math at all, so<br/>\nI&#39;m not sure how he&#39;d pass the math portion of the ACT.  He hates writing<br/>\nas well.  He would be willing to do the test prep, though.  I&#39;m just not<br/>\nsure how he&#39;d learn the math he needs to know for the ACT, in a short<br/>\nperiod of time.  I feel like I&#39;m failing my kids.  Clearly, I don&#39;t fully<br/>\nunderstand unschooling, although I&#39;m in love with the idea.<br/>\n<br/>\nJodi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Starting formal math lessons as a teen","postDate":"1343745467","msgId":48850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJzZm9qdWZXa3hRWE5uWE9ZSlZEdFdtcDFFYzYzOFBoWj04VGJkVkc5eUYtd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNDM2OTE1MzAuNTEwMDkuWWFob29NYWlsTmVvQHdlYjg3OTA0Lm1haWwuaXIyLnlhaG9vLmNvbT4=","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4JPGp2MjdhaytoMWVrQGVHcm91cHMuY29tPgk8Q0FKdEdRcnQ4UVFFaGlNdzZOXysrRDRTTHQ3YllUa0hEN0w3RjRPdXJmVlRDN3R3a1dBQG1haWwuZ21haWwuY29tPgk8MTM0MzY5MTUzMC41MTAwOS5ZYWhvb01haWxOZW9Ad2ViODc5MDQubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":48841,"nextInTopic":48854,"prevInTime":48849,"nextInTime":48851,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Thank you, Schuyler.  I definitely do not think he s dumb.  I think he s very bright, actually.  He just doesn t know much math, which IMO, doesn t make","messageBody":"<div id=\"ygrps-yiv-723566004\">On Mon, Jul 30, 2012 at 6:38 PM, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Given what you&#39;ve written in previous post I&#39;m guessing he&#39;s not the only<br/>\n&gt; one who is struggling to see what he is learning without a more formal<br/>\n&gt; education. I assume his feeling dumb is a leftover of whatever got you to<br/>\n&gt; change educational approaches. It may help for you to read here:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a> and here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help.\">http://sandradodd.com/help.</a> It<br/>\n&gt; will help a lot if you don&#39;t think he&#39;s dumb for not knowing certain things<br/>\n&gt; as well.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Thank you, Schuyler.  I definitely do not think he&#39;s dumb.  I think he&#39;s<br/>\nvery bright, actually.  He just doesn&#39;t know much math, which IMO, doesn&#39;t<br/>\nmake him dumb.  Those were his words.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If he&#39;s feeling as though you&#39;ve dropped him off an edge without a<br/>\n&gt; parachute, from doing school to floating in the ether, do more with him.<br/>\n&gt; You say he likes drumming and guitar and piano and video games, does he<br/>\n&gt; have Rock Band? Maybe he&#39;d enjoy the combination. See if there are any<br/>\n&gt; concerts local to you that he might enjoy, bands that he hasn&#39;t heard.<br/>\n&gt; Engage him more with the world of music and video games. Step away from the<br/>\n&gt; idea that education is limited to paper and pencil explorations of subjects<br/>\n&gt; and move into the idea that education comes from engaging with the world<br/>\n&gt; around you in ways that are meaningful to you. Instead of spending your<br/>\n&gt; time and his worrying about what he doesn&#39;t know, come up with ways to<br/>\n&gt; better spend the both of your time.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>He may very well feel that way, but when I&#39;ve given him the choice and<br/>\nexplained to him that we don&#39;t HAVE to do formal math, he chose not to do<br/>\nit and I was perfectly ok with that.  He never did much in the way of<br/>\nformal math, though, so I think it&#39;s just that he&#39;s comparing himself to<br/>\nhis friends who attend public school or do formal homeschooling.  The<br/>\ndifficult part is that if he decides to go to college, like his older<br/>\nbrother wants to do, he&#39;ll need to know math in order to pass the ACT.  I<br/>\njust looked at a practice ACT test last night and there&#39;s no way he would<br/>\npass the math section.  Heck, I don&#39;t think *I* would pass the math section!<br/>\n<br/>\nOne difficult part of unschooling, for me, is that I have 3 small children,<br/>\nwhich makes it more difficult for me to go do things that interest my older<br/>\n2 boys.  I can&#39;t be the only unschooler in my situation, though, so I need<br/>\nto figure it out.  I wish it was easy to hop in the car and head to a<br/>\nconcert with my oldest boys.  They&#39;d love that.  My 2 yr. old doesn&#39;t go to<br/>\nsleep for my husband though, so I need to be here at bedtime.  You&#39;ve got<br/>\nmy wheels turning, now.  Thanks for that.  :)<br/>\n<br/>\nJodi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343727113","msgId":48841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2ODhtOStyNmZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJ0OFFRRWhpTXc2Tl8rK0Q0U0x0N2JZVGtIRDdMN0Y0T3VyZlZUQzd0d2tXQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48840,"nextInTopic":48850,"prevInTime":48840,"nextInTime":48842,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Based on everything I ve heard over the last 10 years, Georgia is the ONLY state that makes it so hard for homeschoolers to get onto community colleges. In","messageBody":"<div id=\"ygrps-yiv-1294185777\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jodi Harvatin &lt;jodskiinca@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ...<br/>\n&gt; Won&#39;t a &quot;homeschool&quot; diploma or transcript be enough for them to<br/>\n&gt; enter college?  I thought it would be, in addition to the ACT,<br/>\n&gt; which is something that I&#39;m talking about with my older son, who is<br/>\n&gt; 17.  He wants to go to college and I was under the impression that<br/>\n&gt; in order to go to community college, all he needs is a transcript<br/>\n&gt; from me, as well as their entrance exams.  Then, I thought that<br/>\n&gt; decent grades on the ACT would get him into a 4 yr. college. ...<br/>\n<br/>\n </span></blockquote>Based on everything I&#39;ve heard over the last 10 years, Georgia is the ONLY state that makes it so hard for homeschoolers to get onto community colleges. In GA, homeschoolers either need to get a GED *or* get above average scores on the ACT or SAT. And they insist on having parents fill in a very specific transcript, with no choice of what courses to list. I don&#39;t think they do that in other states - unless things have changed very recently.<br/>\n<br/>\nWhat exactly are the requirements for homeschoolers (or applicants without an accredited high school diploma) to get into the college your son is considering going to? Most colleges have the admissions requirements for homeschoolers listed on their websites these days, so it should be easy to find out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Clearly, I need to look into this more!  Since my oldest<br/>\n&gt; wants to go to college, I have been talking about taking his senior<br/>\n&gt; year to only study for the ACT, ....<br/>\n<br/>\n </span></blockquote>That&#39;s not a bad idea, if he&#39;s willing to do that. Studying for the ACT or studying for the GED is pretty much the same thing. (The two extra subjects for the ACT - science and history - are really just reading comprehension. People who take the GED do need to take an essay test, though, and I was told that the basic ACT does NOT include an essay. So if writing is not one of your son&#39;s strong points, and he&#39;s OK or good at math, the ACT is probably what he should study for. It also depends on the requirements of the college.) If he&#39;s willing to devote a couple of hours a week to test-prep, for at least 6 months, and he has already done some formal academic learning in the past, he should have no trouble with whichever test (or tests) he decides to take.   <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343725217","msgId":48840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2ODZyMSttc2FtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJ2NlpRLWFfRHBhZ3hUVEpNdDBMTUpPaHZQbjBYcGZKMVZhNzErRko0WXV2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48832,"nextInTopic":48841,"prevInTime":48839,"nextInTime":48841,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Jodi - I can help you with that! :-) I just went through the transcript process myself. My daughter is about to start attending a community college, and","messageBody":"<div id=\"ygrps-yiv-882427495\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jodi Harvatin &lt;jodskiinca@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... Then, I think about the fact that if he were in school, he&#39;d be<br/>\n&gt; entering his senior year this year and do we need to do something<br/>\n&gt; more!  He wants to go to college and he does fairly well in math<br/>\n&gt; (we didn&#39;t unschool when he was younger, so he&#39;s been through a few<br/>\n&gt; math books, but math is easy for him), but my fear is what on earth<br/>\n&gt; do I put on a transcript, so that he CAN go to college??  He&#39;d have<br/>\n&gt; to start at a community college because we don&#39;t have the money to<br/>\n&gt; send him anywhere else.  He could start taking classes this year<br/>\n&gt; ... but I&#39;d have to have a transcript to give them. That just makes<br/>\n&gt; my heart pound and my body sweat all over! <br/>\n<br/>\n </span></blockquote>Jodi - I can help you with that! :-)<br/>\n<br/>\nI just went through the transcript process myself. My daughter is about to start attending a community college, and our state&#39;s state-college system is the MOST hostile to unschoolers and out-of-the-box, unaccredited homeschoolers in the U.S.! But, in the end, it was a matter of jumping through their hoops, and being able to think creatively about the things my daughter has done and learned.<br/>\n<br/>\nGiven that unschoolers in GA can get into state colleges (which our so-called community colleges are a part of), you probably will not have to jump through as many hoops as we did, and the process will be simpler for you and your son.<br/>\n<br/>\nIf you want to email me off-list, I can go into more detail with you about how to decide what to put on the transcript. It depends on what the college requires.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Starting formal math lessons as a teen","postDate":"1343691530","msgId":48832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDM2OTE1MzAuNTEwMDkuWWFob29NYWlsTmVvQHdlYjg3OTA0Lm1haWwuaXIyLnlhaG9vLmNvbT4=","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4gPGp2MjdhaytoMWVrQGVHcm91cHMuY29tPiA8Q0FKdEdRcnQ4UVFFaGlNdzZOXysrRDRTTHQ3YllUa0hEN0w3RjRPdXJmVlRDN3R3a1dBQG1haWwuZ21haWwuY29tPiA="},"prevInTopic":48826,"nextInTopic":48840,"prevInTime":48831,"nextInTime":48833,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Given what you ve written in previous post I m guessing he s not the only one who is struggling to see what he is learning without a more formal education.","messageBody":"<div id=\"ygrps-yiv-1702570193\"><blockquote><span title=\"ireply\">&gt;Mainly, he wants to learn so that he doesn&#39;t feel &quot;dumb,&quot; compared to his<br/>\n&gt;formally schooled friends.  I&#39;m sure they don&#39;t sit around and quiz each<br/>\n&gt;other, but he knows that they do formal schooling all day long and he<br/>\n&gt;doesn&#39;t.  Since we&#39;re new to unschooling, he isn&#39;t familiar with anything<br/>\n&gt;other than formal school and feels like we&#39;re doing nothing, therefore, he<br/>\n&gt;doesn&#39;t feel as if he&#39;s learning anything.<br/>\n<br/>\n </span></blockquote>Given what you&#39;ve written in previous post I&#39;m guessing he&#39;s not the only one who is struggling to see what he is learning without a more formal education. I assume his feeling dumb is a leftover of whatever got you to change educational approaches. It may help for you to read here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning%c2%a0and\">http://sandradodd.com/beginning%c2%a0and</a> here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help.\">http://sandradodd.com/help.</a> It will help a lot if you don&#39;t think he&#39;s dumb for not knowing certain things as well. <br/>\n<br/>\nIf he&#39;s feeling as though you&#39;ve dropped him off an edge without a parachute, from doing school to floating in the ether, do more with him. You say he likes drumming and guitar and piano and video games, does he have Rock Band? Maybe he&#39;d enjoy the combination. See if there are any concerts local to you that he might enjoy, bands that he hasn&#39;t heard. Engage him more with the world of music and video games. Step away from the idea that education is limited to paper and pencil explorations of subjects and move into the idea that education comes from engaging with the world around you in ways that are meaningful to you. Instead of spending your time and his worrying about what he doesn&#39;t know, come up with ways to better spend the both of your time. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Starting formal math lessons as a teen","postDate":"1343678305","msgId":48826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3RDIxNjQyLTRDOUUtNEE0Mi05N0I5LUQ1NjY5QTJGRTM3RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBSnRHUXJ0ZG16b0VlcnFFUEx3VjAxTnRDR0xwYUE1dTdGcF9ucD1yOHk4VFUyNz1GUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4gPGp1c2g2ayt2NGRjQGVHcm91cHMuY29tPiA8Q0FKdEdRcnRkbXpvRWVycUVQTHdWMDFOdENHTHBhQTV1N0ZwX25wPXI4eThUVTI3PUZRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48820,"nextInTopic":48832,"prevInTime":48825,"nextInTime":48827,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Which is how my daughter learned the majority of her math, except for her it was video games and art programs. Video games are phenomenal for math because","messageBody":"<div id=\"ygrps-yiv-1357171102\">On Jul 30, 2012, at 11:19 AM, Jodi Harvatin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;d much rather play a video game or play his guitar, piano or drums. :)<br/>\n<br/>\n </span></blockquote>Which is how my daughter learned the majority of her math, except for her it was video games and art programs.<br/>\n<br/>\nVideo games are phenomenal for math because players are using math to pull information from the game they need for the game. They make decisions based on data available, read maps, plan strategy.<br/>\n<br/>\nShe went from video games to her father&#39;s college statistics class. She does have a head for math but truly she did no more than a couple of hours of more formal math the previous 14 years of her life. She always had the best or near the best scores on homework and tests out 50 students he taught. *They* had 12+ years of math. The obvious conclusion is that everyone else was hampered by school math not helped. The few exceptions where those who managed to overcome the damage school was doing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It makes total sense that if he learns math just so he feels &quot;smarter,&quot; it<br/>\n&gt; may backfire.<br/>\n<br/>\n </span></blockquote>Or doesn&#39;t learn. If he doesn&#39;t learn he&#39;ll assume he&#39;s not smart enough to learn math. He won&#39;t accept that he needs a different approach. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then, I think about the fact that if he were in school, he&#39;d be<br/>\n&gt; entering his senior year this year and do we need to do something more!<br/>\n<br/>\n<br/>\n </span></blockquote>It might help to think of kids in school as getting less. They&#39;re locked away from life, getting someone else&#39;s predigested ideas about what &#39;s important to memorize. Your son is absorbing how math works by using math. That&#39;s way better than school math. Unfortunately school defined &quot;math&quot; as the ability to memorize formulas. It&#39;s similar to memorizing words and sentence structure of a language you don&#39;t know. It isn&#39;t how our brains are wired to learn. They&#39;re wired to pull patterns out of life, find connections between them, try things, draw conclusions, test those conclusions, make adjustments. It&#39;s how kids effortlessly learn their primary language. It&#39;s how unschooling kids learn math and everything else.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not as qualified to do this job because<br/>\n&gt; I don&#39;t have that education that you and many other mothers have.<br/>\n<br/>\n<br/>\n </span></blockquote>But my college education got in the way of unschooling ;-) Or my engineering oriented brain did. The more successful you are at schooling, the harder it is to think outside that box.<br/>\n<br/>\nWhat my education gave me was the confidence to write about how unnecessary school was :-) and a more authoritative voice than someone who hated school.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do stress out about the fact that my 7 1/2 and 5<br/>\n&gt; yr. old boys just want to play video games and watch movies all day long!<br/>\n<br/>\n<br/>\n </span></blockquote>If they&#39;re living lives full of interesting things and are still choosing video games and movies, then that&#39;s how they&#39;re learning right now.<br/>\n<br/>\nAdd to their days so they have choices rather than trying to subtract the games and TV.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but my fear is what on earth do I put on a transcript, so<br/>\n&gt; that he CAN go to college?? He&#39;d have to start at a community college<br/>\n&gt; because we don&#39;t have the money to send him anywhere else. He could start<br/>\n&gt; taking classes this year (his senior year), but I&#39;d have to have a<br/>\n&gt; transcript to give them.<br/>\n<br/>\n<br/>\n </span></blockquote>They might ask for a transcript but it&#39;s unlikely they require one. Most colleges are becoming more and more familiar with homeschooling and even unschooling and are understanding that a written transcript of what the kid has been up to is what they can expect. And adult returning students often don&#39;t have a transcript.<br/>\n<br/>\nThere&#39;s information about homeschooling teens and college here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://nhen.org/teens/teens.html\">http://nhen.org/teens/teens.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homeschooling.gomilpitas.com/olderkids/OlderKids.htm\">http://homeschooling.gomilpitas.com/olderkids/OlderKids.htm</a><br/>\n<br/>\nFrom your post:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; do we **need** to do something more! <br/>\n&gt; He&#39;d **have** to start at a community college<br/>\n&gt; but I&#39;d **have** to have a transcript to give them.<br/>\n&gt; I definitely **need** to do more than that.<br/>\n&gt;  I **have**to fight against telling myself<br/>\n<br/>\n </span></blockquote>Rather than living in the world of &quot;have to&quot; and &quot;need to&quot; see life as full of choices:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Starting formal math lessons as a teen","postDate":"1343662365","msgId":48820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJ0OFFRRWhpTXc2Tl8rK0Q0U0x0N2JZVGtIRDdMN0Y0T3VyZlZUQzd0d2tXQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp2MjdhaytoMWVrQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4JPGp2MjdhaytoMWVrQGVHcm91cHMuY29tPg=="},"prevInTopic":48818,"nextInTopic":48826,"prevInTime":48819,"nextInTime":48821,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... Hi Linda, Mainly, he wants to learn so that he doesn t feel dumb, compared to his formally schooled friends.  I m sure they don t sit around and quiz","messageBody":"<div id=\"ygrps-yiv-50454692\">On Sat, Jul 28, 2012 at 9:31 PM, lindaguitar &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindaguitar@...\">lindaguitar@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Jodi,<br/>\n&gt;<br/>\n&gt; What purpose/use does he want to learn math for?<br/>\n&gt;<br/>\n&gt; I will assume, for now, that he wants to be able to pass the GED tests, or<br/>\n&gt; score well on college entrance exams. He *might* benefit from learning<br/>\n&gt; through practice tests - with you there to help him figure out and make a<br/>\n&gt; list of what he does know and what he doesn&#39;t know/understand. Then he can<br/>\n&gt; review the terminology and formulas, etc, that he doesn&#39;t know (or doesn&#39;t<br/>\n&gt; remember).<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Hi Linda,<br/>\n<br/>\nMainly, he wants to learn so that he doesn&#39;t feel &quot;dumb,&quot; compared to his<br/>\nformally schooled friends.  I&#39;m sure they don&#39;t sit around and quiz each<br/>\nother, but he knows that they do formal schooling all day long and he<br/>\ndoesn&#39;t.  Since we&#39;re new to unschooling, he isn&#39;t familiar with anything<br/>\nother than formal school and feels like we&#39;re doing nothing, therefore, he<br/>\ndoesn&#39;t feel as if he&#39;s learning anything.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There are websites that people can learn math from, such as<br/>\n&gt; khanacademy.org, and <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.purplemath.com/\">http://www.purplemath.com/</a> .<br/>\n&gt;<br/>\n&gt; There are lots of tutorial videos on YouTube for every subject. YouTube is<br/>\n&gt; amazing! I&#39;m sure he could type in &quot;exponents&quot; or &quot;adding fractions with<br/>\n&gt; different denominators&quot; or &quot;factoring equations&quot; or &quot;congruent triangles&quot;,<br/>\n&gt; and find videos for any of those.<br/>\n&gt;<br/>\n&gt; There is a really good DVD (or maybe a set of DVDs, I don&#39;t remember) that<br/>\n&gt; reviews all of the math concepts that kids tend to learn in elementary and<br/>\n&gt; middle school, available from The Teaching Company (now apparently called<br/>\n&gt; &quot;The Great Courses&quot;, see: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thegreatcourses.com/\">http://www.thegreatcourses.com/</a> ). We borrowed<br/>\n&gt; it once, a long time ago. Now I can&#39;t remember which course it was. But<br/>\n&gt; check out their selection of math courses with your son, and see if any of<br/>\n&gt; them look good to him.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Thanks so much for these recommendations!  I&#39;ll look into them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My daughter (age 19 and about to start college, and unschooled since age<br/>\n&gt; 8) hates math. She did NOT choose to start doing any formal math study<br/>\n&gt; until she was 18. At that point, she knew she was going to have to get up<br/>\n&gt; to the basic level of math necessary to pass the GED, because she DOES want<br/>\n&gt; to go to college (she wants to work with animals in a zoo or aquarium, and<br/>\n&gt; you have to have a degree in some kind of biology or animal-related field<br/>\n&gt; to get that kind of job these days), and - due to requirements for<br/>\n&gt; homeschoolers to apply to GA state colleges, and her desire to stay at<br/>\n&gt; home, and our lack of funds for any kind of private college - the GED route<br/>\n&gt; was the most practical and attainable.<br/>\n&gt;<br/>\n&gt; So - after avoiding formal math and most discussions and activities<br/>\n&gt; involving any kinds of calculations all these years - she took one semester<br/>\n&gt; of a &quot;math concepts&quot; class online, and devoted a few weeks to working from<br/>\n&gt; a GED math prep book. She just barely passed the GED math test. (She did<br/>\n&gt; really well in all the other subjects.)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Won&#39;t a &quot;homeschool&quot; diploma or transcript be enough for them to enter<br/>\ncollege?  I thought it would be, in addition to the ACT, which is something<br/>\nthat I&#39;m talking about with my older son, who is 17.  He wants to go to<br/>\ncollege and I was under the impression that in order to go to community<br/>\ncollege, all he needs is a transcript from me, as well as their entrance<br/>\nexams.  Then, I thought that decent grades on the ACT would get him into a<br/>\n4 yr. college. Clearly, I need to look into this more!  Since my oldest<br/>\nwants to go to college, I have been talking about taking his senior year to<br/>\nonly study for the ACT, which we probably should have done last year.<br/>\n Actually, I&#39;ve been thinking that he wouldn&#39;t be able to start college<br/>\nnext year because we didn&#39;t really do anything as far as schooling goes<br/>\nlast year, but I&#39;m learning that I&#39;m wrong about that and that he can start<br/>\ncommunity college next year.  It&#39;s so confusing.  I wasn&#39;t even planning on<br/>\nhomeschooling for high school and don&#39;t feel like we&#39;ve done enough to have<br/>\nhim be ready for college, but what do I know??<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; She then had to take the Compass placement test at the college, and there<br/>\n&gt; again, she got just above the minimum score they require for acceptance, on<br/>\n&gt; the math section (and scored exceptionally high in reading and English).<br/>\n&gt;<br/>\n&gt; This means that she will have to take a remedial math class or two, which<br/>\n&gt; will not give her college credit. But she will have access to tutors, and,<br/>\n&gt; if necessary, I&#39;ll help her find out where to get learning disabilities<br/>\n&gt; testing and figure out some way to pay for it (she shows every sign of<br/>\n&gt; dyscalculia) and then the college will grant her ld accommodations like<br/>\n&gt; extra time on tests, etc.<br/>\n&gt;<br/>\n&gt; Anyway, a teen who wants to learn math - either for its own sake or for<br/>\n&gt; college admissions purposes - really CAN learn all the math s/he needs in<br/>\n&gt; just a few months. Even one with learning disabilities. All the more so if<br/>\n&gt; s/he is not learning disabled.<br/>\n&gt;<br/>\n&gt; If he doesn&#39;t actually want to engage in any formal math study now, he can<br/>\n&gt; do it whenever he feels ready. My son enjoyed math when he was 15. My<br/>\n&gt; daughter didn&#39;t. If he wants to go to college or take the GED, he can start<br/>\n&gt; preparing for the tests 6 to 12 months before taking them and that will be<br/>\n&gt; enough.<br/>\n&gt;<br/>\n&gt; Linda<br/>\n&gt;<br/>\n </span></blockquote>Thanks so much, Linda.  This really is great information and I think *I*<br/>\nneed to get over my fears and let them be!  Here, I thought I&#39;d have my 17<br/>\nyr. old home until he was 19 before he started college, but after reading<br/>\nthis, I&#39;m thinking that he could probably start FT community college after<br/>\nthis year (which is technically his senior year).<br/>\n<br/>\nJodi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Starting formal math lessons as a teen","postDate":"1343661682","msgId":48818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJ0V3lPZE53Z29hM3h2WFZRSDNvVStrZEE1cDlIbkdEWGZZNW9yWm5DeHV0UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp1dHZhbyt1ZnV1QGVHcm91cHMuY29tPg==","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4JPGp1dHZhbyt1ZnV1QGVHcm91cHMuY29tPg=="},"prevInTopic":48817,"nextInTopic":48820,"prevInTime":48817,"nextInTime":48819,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"Thanks for the great ideas, Nance!  I will check into them.  I love the idea of looking for placement tests at the community college website, since they will","messageBody":"<div id=\"ygrps-yiv-1747460952\">Thanks for the great ideas, Nance!  I will check into them.  I love the<br/>\nidea of looking for placement tests at the community college website, since<br/>\nthey will most likely start college there, if they decide to go.<br/>\n<br/>\nJodi<br/>\n<br/>\nOn Fri, Jul 27, 2012 at 6:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; So, get your DS involved in choosing the resources and use the bits and<br/>\n&gt; pieces that he wants to use.<br/>\n&gt;<br/>\n&gt; I see there have already been some excellent suggestions for resources.<br/>\n&gt; There&#39;s also a series of softcover text/workbooks called The Easy Way.<br/>\n&gt; Arithmetic the Easy Way, Geometry the Easy Way, etc. We dipped into these<br/>\n&gt; sometimes and they seemed clear to me. The Algebra one is . . . different.<br/>\n&gt; . . you&#39;ll want to look at it before you buy it.<br/>\n&gt;<br/>\n&gt; There is also a Singapore Math series of books. Very clear, imo. Be aware<br/>\n&gt; that the grade levels are different from what we are used to.<br/>\n&gt;<br/>\n&gt; And did anyone mention Pam Sorooshian&#39;s math site?<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://learninghappens.wordpress.com/category/math/\">http://learninghappens.wordpress.com/category/math/</a><br/>\n&gt;<br/>\n&gt; Also, I don&#39;t know if you have this option but the community colleges here<br/>\n&gt; have entrance/placement tests and they have sample tests online. Your sons<br/>\n&gt; could try the online samples and if they are old enough, go take the<br/>\n&gt; college placement test. The point would be to find out whether the student<br/>\n&gt; is ready for college-level work and what you might be missing.<br/>\n&gt;<br/>\n&gt; The community colleges here also offer free tutoring for anyone in the<br/>\n&gt; college or planning to enter the college.<br/>\n&gt;<br/>\n&gt; Good luck! :)<br/>\n&gt;<br/>\n&gt; Nance<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Starting formal math lessons as a teen","postDate":"1343661569","msgId":48817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJ0ZG16b0VlcnFFUEx3VjAxTnRDR0xwYUE1dTdGcF9ucD1yOHk4VFUyNz1GUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp1c2g2ayt2NGRjQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4JPGp1c2g2ayt2NGRjQGVHcm91cHMuY29tPg=="},"prevInTopic":48816,"nextInTopic":48818,"prevInTime":48816,"nextInTime":48818,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for this.  The difficult part I have is where do I start and what do I use to teach him?  I ve gotten some good answers here, though. It sounds","messageBody":"<div id=\"ygrps-yiv-1341351699\">Thanks so much for this.  The difficult part I have is where do I start and<br/>\nwhat do I use to teach him?  I&#39;ve gotten some good answers here, though.<br/>\n It sounds like a lot of people like Khan Academy.  I think I&#39;ll look into<br/>\nthat and use it, if and when he&#39;d like to do something more formal. Sitting<br/>\ndown to learn math isn&#39;t something my 15 yr. old son would do for fun.<br/>\n He&#39;d much rather play a video game or play his guitar, piano or drums.  :)<br/>\n<br/>\nJodi<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jul 26, 2012 at 5:43 PM, amflowers71 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eurochamp99@...\">eurochamp99@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; If it helps to reassure you I know there was an alternative school here<br/>\n&gt; which did not teach any maths, some kids aged 10 and 11 wanted to learn and<br/>\n&gt; the teacher tried to put them off, they insisted so he helped them by<br/>\n&gt; giving lessons and in a very short time (cant remember, maximum one year)<br/>\n&gt; the kids were working at grade level having never received any formal maths<br/>\n&gt; tuition before that.<br/>\n&gt;<br/>\n&gt; Another example, my son took some maths tuition once a week plus playing<br/>\n&gt; around on the computer few more times a week. In the space of approx 35<br/>\n&gt; teaching hrs plus 10 minutes a week homework and max 1 hr on the computer,<br/>\n&gt; he went up 4 grades to grade level - he was also 11 at the time.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Starting formal math lessons as a teen","postDate":"1343661388","msgId":48816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJzRVZOZXg9eDluUWNteHVpUVNrbkpaWDVqVzl6Y0VkY3dDOTNGc1J3X1I2UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp1c2hraSs0aGhiQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4JPGp1c2hraSs0aGhiQGVHcm91cHMuY29tPg=="},"prevInTopic":48815,"nextInTopic":48817,"prevInTime":48815,"nextInTime":48817,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... He mainly wants to learn, so that he doesn t feel dumb, compared to his peers.  I think I need to let him read all of the responses here.  I think it","messageBody":"<div id=\"ygrps-yiv-253531285\">On Thu, Jul 26, 2012 at 5:50 PM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; By starting with what&#39;s useful - why does your son want to learn &quot;math&quot;?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>He mainly wants to learn, so that he doesn&#39;t feel &quot;dumb,&quot; compared to his<br/>\npeers.  I think I need to let him read all of the responses here.  I think<br/>\nit would help him.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What, specifically does he want to learn? Basic computation? Get a nice<br/>\n&gt; calculator. If he does the same basic computations over and over, he&#39;ll<br/>\n&gt; remember sums and products - but even people who&#39;ve had &quot;formal math&quot; often<br/>\n&gt; use a calculator. A girlfriend of mine is a CPA and counts on her fingers<br/>\n&gt; or uses a calculator she says: &quot;I&#39;d rather be right than proud.&quot;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I will definitely get him a calculator that he can use when he wants.<br/>\n Great idea!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Really, even people who&#39;ve had &quot;formal math&quot; often don&#39;t really learn math<br/>\n&gt; until they need it. I had gobs of math but had to go back to square one to<br/>\n&gt; learn to use a tape measure (with a tape measure, &quot;square one&quot; is counting<br/>\n&gt; the little marks forward and backward to add and subtract). If your guy<br/>\n&gt; wants to learn math for carpentry purposes, get a good tape measure and<br/>\n&gt; practice with it.<br/>\n&gt;<br/>\n&gt; Fractions are where a whole lot of people get lost in math, btw, so if he<br/>\n&gt; can&#39;t make head or tail of fractions (as it were), he&#39;s on a par with most<br/>\n&gt; adults in the US. If he wants to learn to use fractions for some purpose,<br/>\n&gt; he should do that thing - build, or cook, or quilt, or upholster furniture<br/>\n&gt; for instance - and learn to use the tools of the trade. Every trade Has<br/>\n&gt; Tools which help real people do real math.<br/>\n&gt;<br/>\n&gt; If he wants to learn algebra (why? as a prerequisite to a programming<br/>\n&gt; class, maybe) it&#39;s actually better to skip over all the computational stuff<br/>\n&gt; and learn the algebra directly, because he won&#39;t have as much to unlearn.<br/>\n&gt; That&#39;s the biggest problem people have with algebra - any computation can<br/>\n&gt; be done algebraically (and it&#39;s more natural to do so), but that&#39;s not how<br/>\n&gt; it&#39;s taught in schools so when kids get to algebra they have to learn a<br/>\n&gt; whole different way to solve problems.<br/>\n&gt;<br/>\n&gt; He might need some tips about mathematical notation, depending on what he<br/>\n&gt; wants to do - that&#39;s a bigger issue starting algebra than it is using math<br/>\n&gt; in real life, but it&#39;s also something which can be handled as it comes up.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Thanks so much, Meredith!  This post really does make me feel better and I<br/>\nwill definitely talk to him about what you&#39;ve said here.<br/>\n<br/>\nJodi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Starting formal math lessons as a teen","postDate":"1343661153","msgId":48815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJ2NlpRLWFfRHBhZ3hUVEpNdDBMTUpPaHZQbjBYcGZKMVZhNzErRko0WXV2UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PERCNTg3Mzc5LTQxRjgtNEFFOC04RUNDLURFQTQxMzUzQ0M0RUB2ZXJpem9uLm5ldD4=","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4JPERCNTg3Mzc5LTQxRjgtNEFFOC04RUNDLURFQTQxMzUzQ0M0RUB2ZXJpem9uLm5ldD4="},"prevInTopic":48801,"nextInTopic":48816,"prevInTime":48814,"nextInTime":48816,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"Phew!  I m FINALLY able to sit down and respond to all of these wonderful replies to my questions.  I thank you all for taking the time to respond. Joyce,","messageBody":"<div id=\"ygrps-yiv-541333676\">Phew!  I&#39;m FINALLY able to sit down and respond to all of these wonderful<br/>\nreplies to my questions.  I thank you all for taking the time to respond.<br/>\n<br/>\nJoyce, after reading your post I realized that I think I&#39;M the one who is<br/>\nhaving the problem with math!!  I&#39;ve always struggled with math and was in<br/>\nremedial classes in my junior and senior year in high school because of it.<br/>\n Consequently, I felt that math was just too hard and felt &quot;dumb.&quot;  I&#39;M the<br/>\none with the math phobia and I&#39;ve transferred that onto my kids.  UGH.  I<br/>\nhave a 20 yr. old who has a learning disability and struggled with math AND<br/>\nreading.  He wants to be a personal trainer, though, so I guess math<br/>\ndoesn&#39;t matter too much!<br/>\n<br/>\nIt makes total sense that if he learns math just so he feels &quot;smarter,&quot; it<br/>\nmay backfire.<br/>\n<br/>\nI do tend to panic about math and lack of &quot;formal&quot; subjects, the closer<br/>\nthey get to age 18.  I have a 17 yr. old who really hasn&#39;t done anything in<br/>\nthe way of school for almost 2 years.  He has been working a lot and I keep<br/>\nthinking that he&#39;s learning so much, just from doing that.  He works at a<br/>\nfast food restaurant and he&#39;s doing very well there.  He&#39;s gotten 2 raises<br/>\nand will most likely be made a team leader in the near future.  I keep<br/>\ntelling myself that THAT is what really counts.  He&#39;s got a great work<br/>\nethic.  Then, I think about the fact that if he were in school, he&#39;d be<br/>\nentering his senior year this year and do we need to do something more!  He<br/>\nwants to go to college and he does fairly well in math (we didn&#39;t unschool<br/>\nwhen he was younger, so he&#39;s been through a few math books, but math is<br/>\neasy for him), but my fear is what on earth do I put on a transcript, so<br/>\nthat he CAN go to college??  He&#39;d have to start at a community college<br/>\nbecause we don&#39;t have the money to send him anywhere else.  He could start<br/>\ntaking classes this year (his senior year), but I&#39;d have to have a<br/>\ntranscript to give them.  That just makes my heart pound and my body sweat<br/>\nall over!  I feel like I&#39;ve ruined their futures, but the more I read about<br/>\nunschoolers&#39; experiences, the better I feel.  So, I definitely need to do<br/>\nmore than that.<br/>\n<br/>\nPlus, I have 3 small children (7 1/2, 5 and 2) who have been unschooled<br/>\nsince day 1 although, I do stress out about the fact that my 7 1/2 and 5<br/>\nyr. old boys just want to play video games and watch movies all day long!<br/>\n Of course, that&#39;s what prompted him to want to learn to read, which he did<br/>\non his own.  All I did was talk about letter sounds and helped him sound<br/>\nthings out that he wanted to read.  It just clicked one day and he was off.<br/>\n I wish my older 3 had had that experience, but it is what it is.<br/>\n<br/>\nI need to go back to your page, Joyce, or maybe it was Sandra Dodd&#39;s, but I<br/>\nremember reading a conversation about math between you and someone who was<br/>\narguing why formal math was so important.  I loved your response.  Of<br/>\ncourse, you mentioned that you&#39;re highly educated, which I&#39;m not and I have<br/>\nto fight against telling myself I&#39;m not as qualified to do this job because<br/>\nI don&#39;t have that education that you and many other mothers have.  That&#39;s<br/>\nwhat formal schooling did for me.  Ugh.<br/>\n<br/>\nAnyway, thank you so much for your response!<br/>\n<br/>\nJodi<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jul 26, 2012 at 2:08 PM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; School math isn&#39;t real math. It&#39;s formal notation of real life math<br/>\n&gt; concepts. The hard part of learning school math is kids are expected to<br/>\n&gt; memorize the formal notation of concepts they haven&#39;t worked with in ways<br/>\n&gt; that are meaningful to them yet.<br/>\n&gt;<br/>\n&gt; It&#39;s much easier to learn formal notation of math when older because<br/>\n&gt; people have had lots more practical, personally meaningful experience with<br/>\n&gt; real mathematical concepts. (Video games are especially good for this!) By<br/>\n&gt; 15 your son has seen and used maps, graphs, percentages, added, multiplied<br/>\n&gt; and so on for things *he* wanted to know. He&#39;s probably thought<br/>\n&gt; algebraically without realizing it.<br/>\n&gt;<br/>\n&gt; The next step is easy: putting a formal notation &quot;face&quot; on what the person<br/>\n&gt; already knows.<br/>\n&gt;<br/>\n&gt; BUT, the difficulties with an older schooled kid learning school math is<br/>\n&gt; all the damage that school did trying to teach him. Especially the damage<br/>\n&gt; that caused him to to feel he&#39;s not smart.<br/>\n&gt;<br/>\n&gt; He&#39;ll grasp math easiest if *he* wants math. But learning math as a means<br/>\n&gt; to help him feel smart could back fire and convince him he&#39;s not smart :-/<br/>\n&gt; If his brain shut down when he came across math in real life, he may not<br/>\n&gt; grasp the underlying concepts as well as he would without the school<br/>\n&gt; pressure.<br/>\n&gt;<br/>\n&gt; If he really wants math for math&#39;s sake, I would look on Amazon for math<br/>\n&gt; books that adults might pick up to overcome math anxiety or brush up on<br/>\n&gt; their math. Real books! :-) Not curriculum. Start at whatever concepts he<br/>\n&gt; wants to. Read the reviews to see the positives and negatives. Research the<br/>\n&gt; books with him. (If he wants.) Don&#39;t try to pretend authority that you<br/>\n&gt; don&#39;t have. Let him know you&#39;ll both be trying stuff out to see what works<br/>\n&gt; and what doesn&#39;t. Schools use only one -- very poor! -- approach to<br/>\n&gt; learning math. And it&#39;s really surprising anyone learns math that way.<br/>\n&gt; There are many approaches.<br/>\n&gt;<br/>\n&gt; There&#39;s also Khan Academy<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.khanacademy.org/\">http://www.khanacademy.org/</a><br/>\n&gt;<br/>\n&gt; He breaks down math (and other topics) into 10 minutes video chunks.<br/>\n&gt;<br/>\n&gt; There&#39;s also Standard Deviants DVDs. They cover quite a bit of math<br/>\n&gt; visually.<br/>\n&gt;<br/>\n&gt; There was the Cyber Chase TV show on PBS. It was aimed at kids but I liked<br/>\n&gt; it :-)<br/>\n&gt;<br/>\n&gt; Sandra Dodd has some math links at her site.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/\">http://sandradodd.com/math/</a><br/>\n&gt;<br/>\n&gt; If he isn&#39;t having fun exploring on his own, most colleges have remedial<br/>\n&gt; math. My husband has been teaching it for years :-) And they have remedial<br/>\n&gt; math for the very reason that schools are failing miserably at teaching<br/>\n&gt; kids math.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":331638196,"authorName":"Rachel","from":"Rachel &lt;athenagwis@...&gt;","profile":"athenagwis2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343569450","msgId":48801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTHA1eTRnZld6R1BRMm1LODZDTEZiTUg1YjhESC1vV2NaRFllTnNyWU9GVHp6Ullfd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48796,"nextInTopic":48815,"prevInTime":48800,"nextInTime":48802,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"====She then had to take the Compass placement test at the college, and there again, she got just above the minimum score they require for acceptance, on the","messageBody":"<div id=\"ygrps-yiv-912583746\">====She then had to take the Compass placement test at the college, and<br/>\nthere again, she got just above the minimum score they require for<br/>\nacceptance, on the math section (and scored exceptionally high in reading<br/>\nand English).<br/>\n<br/>\nThis means that she will have to take a remedial math class or two, which<br/>\nwill not give her college credit. But she will have access to tutors, and,<br/>\nif necessary, I&#39;ll help her find out where to get learning disabilities<br/>\ntesting and figure out some way to pay for it (she shows every sign of<br/>\ndyscalculia) and then the college will grant her ld accommodations like<br/>\nextra time on tests, etc.====<br/>\n<br/>\nAnd just for the sake of being fair, my husband went to public school in<br/>\nit&#39;s entirety, graduated with decent grades and when he decided to go to<br/>\ncollege for the first time at 30, he took this same type of test for his<br/>\nschool and had the exact same result.  He had to take remedial math and<br/>\ntook one more math that was required by his degree (history) and passed it<br/>\nenough to get credit for it. All this happened even though he had math his<br/>\nentire public school years and had worked 6+ years for a bank.  Learning<br/>\nmath in a traditional way certainly does not guarantee that you know it<br/>\nenough for a college exam.<br/>\n<br/>\nI am a math person, I love math, but there is such a huge emphasis put on<br/>\nkids to learn math when they really don&#39;t need it.  I use math a lot in my<br/>\ncareer, but the type of math I use, I could have easily learned on my own<br/>\nso long as I had a healthy interest in numbers.  My husband is terrible at<br/>\nmath and the world hasn&#39;t imploded on him.  He has a great career making<br/>\ngood money and has done it all without knowing the formula for a slope.<br/>\n<br/>\n<br/>\n===My son thinks he&#39;s not smart because he doesn&#39;t know math, so I told him<br/>\nI&#39;d help him learn, if he&#39;d like. I just don&#39;t know what to do, other than<br/>\nstart with the first book of a math curriculum.===<br/>\n<br/>\nI would talk to your son about why he really wants to learn math now.  Does<br/>\nhe want to go into a career that involves math like engineering?  Or does<br/>\nhe just feel like he is behind his peers?  If he is just not feeling<br/>\n&quot;smart&quot;, rather than putting him through some sort of math curriculum,<br/>\nmaybe sit him down and think about all the adults you can.  What jobs do<br/>\nthey have, what level of math do they use for those jobs, is math really<br/>\nsomething he needs to sit down and struggle through right now?  When he<br/>\nneeds math, he will get it, and if he doesn&#39;t have the baggage of &quot;math is<br/>\nhard&quot; on him, he will learn it very quickly.  But if he struggles through<br/>\nmath concepts he will never need right now, he may end up feeling even less<br/>\nmath adept and when he gets to a point where he needs to learn certain math<br/>\nthings, he will feel like he can&#39;t because of his previous baggage with<br/>\nmath.<br/>\n<br/>\nSince you are new to unschooling, I would take a step back and try to talk<br/>\nto him about this.  I would really encourage you to find a different<br/>\nsolution than taking a class or working through a math curriculum.  This is<br/>\ncoming form someone who LOVES math and uses it every day in her job.  I<br/>\npromise you, doing a curriculum right now that he really doesn&#39;t need, will<br/>\ndo way more harm than good.  If he is just interested in math, have him<br/>\nfind math-ish puzzles or games to expand his mind and critical thinking.<br/>\n<br/>\nIf after reading this you still feel like you must do a curriculum of some<br/>\nkind (I would really suggest not), then perhaps look at Kahn Academy.  The<br/>\nvideos start with basic 2+2 and go up from there.  The videos are free and<br/>\nyour son can work at his own pace and decide when he has had enough.  But I<br/>\nwould personally suggest against this because he is still going to get into<br/>\na lot of math he doesn&#39;t really need and may still become frustrated by it<br/>\nall and may get some baggage from it.  But if your son already has a math<br/>\noriented brain and really wants to learn more (not just because he feels<br/>\nlike he *should* learn more), this might be a great program for him.<br/>\n<br/>\nGood luck.<br/>\nRachel<br/>\n<br/>\nPS --- I use math every single day for my job, and make good money doing<br/>\nit, and I still will use my calculator to figure out what 7x8 is.  You<br/>\nreally and truly do not need higher level math for most jobs unless you<br/>\nplan on being an engineer or something.  And most people that want to be<br/>\nengineers show a love for math outside of any formal education.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343529108","msgId":48796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2MjdhaytoMWVrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48785,"nextInTopic":48801,"prevInTime":48795,"nextInTime":48797,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"Jodi, What purpose/use does he want to learn math for? I will assume, for now, that he wants to be able to pass the GED tests, or score well on college","messageBody":"<div id=\"ygrps-yiv-887091524\">Jodi,<br/>\n<br/>\nWhat purpose/use does he want to learn math for?<br/>\n<br/>\nI will assume, for now, that he wants to be able to pass the GED tests, or score well on college entrance exams. He *might* benefit from learning through practice tests - with you there to help him figure out and make a list of what he does know and what he doesn&#39;t know/understand. Then he can review the terminology and formulas, etc, that he doesn&#39;t know (or doesn&#39;t remember).<br/>\n<br/>\nThere are websites that people can learn math from, such as khanacademy.org, and <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.purplemath.com/\">http://www.purplemath.com/</a> .<br/>\n<br/>\nThere are lots of tutorial videos on YouTube for every subject. YouTube is amazing! I&#39;m sure he could type in &quot;exponents&quot; or &quot;adding fractions with different denominators&quot; or &quot;factoring equations&quot; or &quot;congruent triangles&quot;, and find videos for any of those. <br/>\n<br/>\nThere is a really good DVD (or maybe a set of DVDs, I don&#39;t remember) that reviews all of the math concepts that kids tend to learn in elementary and middle school, available from The Teaching Company (now apparently called &quot;The Great Courses&quot;, see: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thegreatcourses.com/\">http://www.thegreatcourses.com/</a> ). We borrowed it once, a long time ago. Now I can&#39;t remember which course it was. But check out their selection of math courses with your son, and see if any of them look good to him. <br/>\n<br/>\nMy daughter (age 19 and about to start college, and unschooled since age 8) hates math. She did NOT choose to start doing any formal math study until she was 18. At that point, she knew she was going to have to get up to the basic level of math necessary to pass the GED, because she DOES want to go to college (she wants to work with animals in a zoo or aquarium, and you have to have a degree in some kind of biology or animal-related field to get that kind of job these days), and - due to requirements for homeschoolers to apply to GA state colleges, and her desire to stay at home, and our lack of funds for any kind of private college - the GED route was the most practical and attainable. <br/>\n<br/>\nSo - after avoiding formal math and most discussions and activities involving any kinds of calculations all these years - she took one semester of a &quot;math concepts&quot; class online, and devoted a few weeks to working from a GED math prep book. She just barely passed the GED math test. (She did really well in all the other subjects.)<br/>\n<br/>\nShe then had to take the Compass placement test at the college, and there again, she got just above the minimum score they require for acceptance, on the math section (and scored exceptionally high in reading and English).<br/>\n<br/>\nThis means that she will have to take a remedial math class or two, which will not give her college credit. But she will have access to tutors, and, if necessary, I&#39;ll help her find out where to get learning disabilities testing and figure out some way to pay for it (she shows every sign of dyscalculia) and then the college will grant her ld accommodations like extra time on tests, etc.<br/>\n<br/>\nAnyway, a teen who wants to learn math - either for its own sake or for college admissions purposes - really CAN learn all the math s/he needs in just a few months. Even one with learning disabilities. All the more so if s/he is not learning disabled.<br/>\n<br/>\nIf he doesn&#39;t actually want to engage in any formal math study now, he can do it whenever he feels ready. My son enjoyed math when he was 15. My daughter didn&#39;t. If he wants to go to college or take the GED, he can start preparing for the tests 6 to 12 months before taking them and that will be enough.<br/>\n<br/>\nLinda          <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jodi Harvatin &lt;jodskiinca@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I have a question about helping a teen to learn math.  He just turned 15<br/>\n&gt; and hasn&#39;t had much in the way of formal math lessons.  I&#39;ve heard people<br/>\n&gt; say that you can learn all of the elementary math you need to learn in just<br/>\n&gt; a few months.  I&#39;ve been trying to figure out HOW.  Did anyone here start<br/>\n&gt; math much later?  If so, how did you do it?  My son thinks he&#39;s not smart<br/>\n&gt; because he doesn&#39;t know math, so I told him I&#39;d help him learn, if he&#39;d<br/>\n&gt; like.  I just don&#39;t know what to do, other than start with the first book<br/>\n&gt; of a math curriculum.  I don&#39;t want him to feel like he&#39;s doing &quot;baby&quot;<br/>\n&gt; work, either.  Any ideas?<br/>\n&gt; <br/>\n&gt; We&#39;re new to unschooling, but it&#39;s something that we *sort of* did with<br/>\n&gt; this one, all along, just not in the right way, so I am panicking a little<br/>\n&gt; bit about what the future holds for him, as well as his 17 yr. old brother<br/>\n&gt; who says he wants to go to college, but we stopped formal schooling 2 years<br/>\n&gt; ago and because we were going through some stressful personal issues, we<br/>\n&gt; didn&#39;t do much of anything.  So, NOW, I&#39;m starting to panic.<br/>\n&gt; <br/>\n&gt; Thanks for any help.<br/>\n&gt; <br/>\n&gt; Jodi<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Starting formal math lessons as a teen","postDate":"1343391004","msgId":48785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0Mjk1OUI1LTU0NTEtNDg3QS1CRjhBLUI4MzE5OThBMkZGM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp1dHZhbyt1ZnV1QGVHcm91cHMuY29tPg==","referencesHeader":"PGp1dHZhbyt1ZnV1QGVHcm91cHMuY29tPg=="},"prevInTopic":48784,"nextInTopic":48796,"prevInTime":48784,"nextInTime":48786,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... That s a good point. It will totally depend on his personality how he views the materials for younger kids. When I wanted to learn something, I often went","messageBody":"<div id=\"ygrps-yiv-613437137\">On Jul 27, 2012, at 7:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The &quot;baby&quot; work might not be a completely bad thing.<br/>\n<br/>\n </span></blockquote>That&#39;s a good point. It will totally depend on his personality how he views the materials for younger kids.<br/>\n<br/>\nWhen I wanted to learn something, I often went to the children&#39;s section because I knew the approach wouldn&#39;t assume I had some basic knowledge. That way if I did know it I could skip it.<br/>\n<br/>\nSome people are turned immediately off by the &quot;Dummies&quot; books. Maybe some felt like &quot;dummies&quot; as kids. I (fortunately!) never was made to doubt my intelligence. For me &quot;dummy&quot; just means &quot;We&#39;ll start at the very beginning and not make assumptions.&quot;<br/>\n<br/>\nBest to make them an option and let his preferences be the guide.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343389848","msgId":48784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1dHZhbyt1ZnV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48783,"nextInTopic":48785,"prevInTime":48783,"nextInTime":48785,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"The baby work might not be a completely bad thing. Way back when my DD was learning to read, she was convinced she was not reading, even though I thought of","messageBody":"<div id=\"ygrps-yiv-2136343188\">The &quot;baby&quot; work might not be a completely bad thing. Way back when my DD was learning to read, she was convinced she was not reading, even though I thought of her as a beginning reader, and she demanded a more formal approach. We went through various textbooks and she chose the 100 Easy Lessons book. <br/>\n<br/>\nWe looked through and started where she was at, which was about a third of the way through the book. But that step was encouraging to her -- to see that she did know some stuff. <br/>\n<br/>\nThen she proceeded to do the next third of the book. She never did the last third because it was too boring and she was reading independently by then.<br/>\n<br/>\nSo, get your DS involved in choosing the resources and use the bits and pieces that he wants to use. <br/>\n<br/>\nI see there have already been some excellent suggestions for resources. There&#39;s also a series of softcover text/workbooks called The Easy Way. Arithmetic the Easy Way, Geometry the Easy Way, etc. We dipped into these sometimes and they seemed clear to me. The Algebra one is . . . different. . . you&#39;ll want to look at it before you buy it. <br/>\n<br/>\nThere is also a Singapore Math series of books. Very clear, imo. Be aware that the grade levels are different from what we are used to.<br/>\n<br/>\nAnd did anyone mention Pam Sorooshian&#39;s math site? <a rel=\"nofollow\" target=\"_blank\" href=\"http://learninghappens.wordpress.com/category/math/\">http://learninghappens.wordpress.com/category/math/</a><br/>\n<br/>\nAlso, I don&#39;t know if you have this option but the community colleges here have entrance/placement tests and they have sample tests online. Your sons could try the online samples and if they are old enough, go take the college placement test. The point would be to find out whether the student is ready for college-level work and what you might be missing.  <br/>\n<br/>\nThe community colleges here also offer free tutoring for anyone in the college or planning to enter the college. <br/>\n<br/>\nGood luck! :)<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jodi Harvatin &lt;jodskiinca@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I have a question about helping a teen to learn math.  He just turned 15<br/>\n&gt; and hasn&#39;t had much in the way of formal math lessons.  I&#39;ve heard people<br/>\n&gt; say that you can learn all of the elementary math you need to learn in just<br/>\n&gt; a few months.  I&#39;ve been trying to figure out HOW.  Did anyone here start<br/>\n&gt; math much later?  If so, how did you do it?  My son thinks he&#39;s not smart<br/>\n&gt; because he doesn&#39;t know math, so I told him I&#39;d help him learn, if he&#39;d<br/>\n&gt; like.  I just don&#39;t know what to do, other than start with the first book<br/>\n&gt; of a math curriculum.  I don&#39;t want him to feel like he&#39;s doing &quot;baby&quot;<br/>\n&gt; work, either.  Any ideas?<br/>\n&gt; <br/>\n&gt; We&#39;re new to unschooling, but it&#39;s something that we *sort of* did with<br/>\n&gt; this one, all along, just not in the right way, so I am panicking a little<br/>\n&gt; bit about what the future holds for him, as well as his 17 yr. old brother<br/>\n&gt; who says he wants to go to college, but we stopped formal schooling 2 years<br/>\n&gt; ago and because we were going through some stressful personal issues, we<br/>\n&gt; didn&#39;t do much of anything.  So, NOW, I&#39;m starting to panic.<br/>\n&gt; <br/>\n&gt; Thanks for any help.<br/>\n&gt; <br/>\n&gt; Jodi<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343343058","msgId":48782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1c2hraSs0aGhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48781,"nextInTopic":48783,"prevInTime":48781,"nextInTime":48783,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... By starting with what s useful - why does your son want to learn math ? What, specifically does he want to learn? Basic computation? Get a nice","messageBody":"<div id=\"ygrps-yiv-391376762\">Jodi Harvatin &lt;jodskiinca@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve heard people<br/>\n&gt; say that you can learn all of the elementary math you need to learn in just<br/>\n&gt; a few months.  I&#39;ve been trying to figure out HOW.<br/>\n<br/>\n </span></blockquote>By starting with what&#39;s useful - why does your son want to learn &quot;math&quot;? What, specifically does he want to learn? Basic computation? Get a nice calculator. If he does the same basic computations over and over, he&#39;ll remember sums and products - but even people who&#39;ve had &quot;formal math&quot; often use a calculator. A girlfriend of mine is a CPA and counts on her fingers or uses a calculator she says: &quot;I&#39;d rather be right than proud.&quot; <br/>\n<br/>\nReally, even people who&#39;ve had &quot;formal math&quot; often don&#39;t really learn math until they need it. I had gobs of math but had to go back to square one to learn to use a tape measure (with a tape measure, &quot;square one&quot; is counting the little marks forward and backward to add and subtract). If your guy wants to learn math for carpentry purposes, get a good tape measure and practice with it. <br/>\n<br/>\nFractions are where a whole lot of people get lost in math, btw, so if he can&#39;t make head or tail of fractions (as it were), he&#39;s on a par with most adults in the US. If he wants to learn to use fractions for some purpose, he should do that thing - build, or cook, or quilt, or upholster furniture for instance - and learn to use the tools of the trade. Every trade Has Tools which help real people do real math. <br/>\n<br/>\nIf he wants to learn algebra (why? as a prerequisite to a programming class, maybe) it&#39;s actually better to skip over all the computational stuff and learn the algebra directly, because he won&#39;t have as much to unlearn. That&#39;s the biggest problem people have with algebra - any computation can be done algebraically (and it&#39;s more natural to do so), but that&#39;s not how it&#39;s taught in schools so when kids get to algebra they have to learn a whole different way to solve problems. <br/>\n<br/>\nHe might need some tips about mathematical notation, depending on what he wants to do - that&#39;s a bigger issue starting algebra than it is using math in real life, but it&#39;s also something which can be handled as it comes up. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":348735811,"authorName":"amflowers71","from":"&quot;amflowers71&quot; &lt;eurochamp99@...&gt;","profile":"amflowers71","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Starting formal math lessons as a teen","postDate":"1343342612","msgId":48783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1c2g2ayt2NGRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48782,"nextInTopic":48784,"prevInTime":48782,"nextInTime":48784,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"If it helps to reassure you I know there was an alternative school here which did not teach any maths, some kids aged 10 and 11 wanted to learn and the teacher","messageBody":"<div id=\"ygrps-yiv-1237262600\">If it helps to reassure you I know there was an alternative school here which did not teach any maths, some kids aged 10 and 11 wanted to learn and the teacher tried to put them off, they insisted so he helped them by giving lessons and in a very short time (cant remember, maximum one year) the kids were working at grade level having never received any formal maths tuition before that.<br/>\n<br/>\nAnother example, my son took some maths tuition once a week plus playing around on the computer few more times a week.  In the space of approx 35 teaching hrs plus 10 minutes a week homework and max 1 hr on the computer, he went up 4 grades to grade level - he was also 11 at the time.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Starting formal math lessons as a teen","postDate":"1343329733","msgId":48781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNTg3Mzc5LTQxRjgtNEFFOC04RUNDLURFQTQxMzUzQ0M0RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48780,"nextInTopic":48782,"prevInTime":48780,"nextInTime":48782,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"... School math isn t real math. It s formal notation of real life math concepts. The hard part of learning school math is kids are expected to memorize the","messageBody":"<div id=\"ygrps-yiv-1143202084\">On Jul 26, 2012, at 1:00 PM, Jodi Harvatin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; you can learn all of the elementary math you need to learn in just<br/>\n&gt; a few months. I&#39;ve been trying to figure out HOW.<br/>\n<br/>\n </span></blockquote>School math isn&#39;t real math. It&#39;s formal notation of real life math concepts. The hard part of learning school math is kids are expected to memorize the formal notation of concepts they haven&#39;t worked with in ways that are meaningful to them yet.<br/>\n<br/>\nIt&#39;s much easier to learn formal notation of math  when older because people have had lots more practical, personally meaningful experience with real mathematical concepts. (Video games are especially good for this!) By 15 your son has seen and used maps, graphs, percentages, added, multiplied and so on for things *he* wanted to know. He&#39;s probably thought algebraically without realizing it.<br/>\n<br/>\nThe next step is easy: putting a formal notation &quot;face&quot; on what the person already knows.<br/>\n<br/>\nBUT, the difficulties with an older schooled kid learning school math is all the damage that school did trying to teach him. Especially the damage that caused him to to feel he&#39;s not smart.<br/>\n<br/>\nHe&#39;ll grasp math easiest if *he* wants math. But learning math as a means to help him feel smart could back fire and convince him he&#39;s not smart :-/ If his brain shut down when he came across math in real life, he may not grasp the underlying concepts as well as he would without the school pressure.<br/>\n<br/>\nIf he really wants math for math&#39;s sake, I would look on Amazon for math books that adults might pick up to overcome math anxiety or brush up on their math. Real books! :-) Not curriculum. Start at whatever concepts he wants to. Read the reviews to see the positives and negatives. Research the books with him. (If he wants.) Don&#39;t try to pretend authority that you don&#39;t have. Let him know you&#39;ll both be trying stuff out to see what works and what doesn&#39;t. Schools use only one -- very poor! -- approach to learning math. And it&#39;s really surprising anyone learns math that way. There are many approaches. <br/>\n<br/>\nThere&#39;s also Khan Academy<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.khanacademy.org/\">http://www.khanacademy.org/</a><br/>\n<br/>\nHe breaks down math (and other topics) into 10 minutes video chunks.<br/>\n<br/>\nThere&#39;s also Standard Deviants DVDs. They cover quite a bit of math visually.<br/>\n<br/>\nThere was the Cyber Chase TV show on PBS. It was aimed at kids but I liked it :-)<br/>\n<br/>\nSandra Dodd has some math links at her site.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/\">http://sandradodd.com/math/</a><br/>\n<br/>\nIf he isn&#39;t having fun exploring on his own, most colleges have remedial math. My husband has been teaching it for years :-) And they have remedial math for the very reason that schools are failing miserably at teaching kids math.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234142262,"authorName":"Jodi Harvatin","from":"Jodi Harvatin &lt;jodskiinca@...&gt;","profile":"jkharvatin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Starting formal math lessons as a teen","postDate":"1343322028","msgId":48780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSnRHUXJzK3R5a3hqYU5IQ3J5V0IwRVFWMjJTNDRKNkw4Uz0zQ2tQc2JEV0duRXJSd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":48781,"prevInTime":48779,"nextInTime":48781,"topicId":48780,"numMessagesInTopic":0,"msgSnippet":"I have a question about helping a teen to learn math.  He just turned 15 and hasn t had much in the way of formal math lessons.  I ve heard people say that you","messageBody":"<div id=\"ygrps-yiv-1742216181\">I have a question about helping a teen to learn math.  He just turned 15<br/>\nand hasn&#39;t had much in the way of formal math lessons.  I&#39;ve heard people<br/>\nsay that you can learn all of the elementary math you need to learn in just<br/>\na few months.  I&#39;ve been trying to figure out HOW.  Did anyone here start<br/>\nmath much later?  If so, how did you do it?  My son thinks he&#39;s not smart<br/>\nbecause he doesn&#39;t know math, so I told him I&#39;d help him learn, if he&#39;d<br/>\nlike.  I just don&#39;t know what to do, other than start with the first book<br/>\nof a math curriculum.  I don&#39;t want him to feel like he&#39;s doing &quot;baby&quot;<br/>\nwork, either.  Any ideas?<br/>\n<br/>\nWe&#39;re new to unschooling, but it&#39;s something that we *sort of* did with<br/>\nthis one, all along, just not in the right way, so I am panicking a little<br/>\nbit about what the future holds for him, as well as his 17 yr. old brother<br/>\nwho says he wants to go to college, but we stopped formal schooling 2 years<br/>\nago and because we were going through some stressful personal issues, we<br/>\ndidn&#39;t do much of anything.  So, NOW, I&#39;m starting to panic.<br/>\n<br/>\nThanks for any help.<br/>\n<br/>\nJodi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48790,"nextTopicId":48880}}