{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Mindful parenting, was  Reasonable vs unreasonable vs no boundaries","postDate":"1169632644","msgId":20991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGM0FFRTE3LUZCODQtNDgzQS1COUFCLTlGNkIwQUExRTAwNUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwY2EwMWM3M2YzYSQ2ZjNmZTU2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4=","referencesHeader":"PDAwY2EwMWM3M2YzYSQ2ZjNmZTU2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20974,"nextInTopic":0,"prevInTime":20990,"nextInTime":20992,"topicId":20974,"numMessagesInTopic":0,"msgSnippet":"... And even better is the location at the new domain (which is much easier to remember :-) : http://joyfullyrejoycing.com/changing%20parenting/ ","messageBody":"<div id=\"ygrps-yiv-1878146337\"><blockquote><span title=\"ireply\">&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/changing%20parenting/\">http://home.earthlink.net/~fetteroll/rejoycing/changing%20parenting/</a> <br/>\n&gt; mindfulparentingzinn.html<br/>\n<br/>\n </span></blockquote>And even better is the location at the new domain (which is much  <br/>\neasier to remember :-) :<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/\">http://joyfullyrejoycing.com/changing%20parenting/</a> <br/>\nmindfulparentingzinn.html<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Mindful parenting, was  Reasonable vs unreasonable vs no boundaries","postDate":"1169589860","msgId":20974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwY2EwMWM3M2YzYSQ2ZjNmZTU2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":0,"nextInTopic":20991,"prevInTime":20973,"nextInTime":20975,"topicId":20974,"numMessagesInTopic":0,"msgSnippet":"Here are some links: http://sandradodd.com/life http://sandradodd.com/peacefulparenting ","messageBody":"<div id=\"ygrps-yiv-1782577565\">Here are some links:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/life\">http://sandradodd.com/life</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peacefulparenting\">http://sandradodd.com/peacefulparenting</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/changing%20parenting/mindfulparentingzinn.html\">http://home.earthlink.net/~fetteroll/rejoycing/changing%20parenting/mindfulparentingzinn.html</a><br/>\n<br/>\nAnd below I&#39;ve pasted an article by Danielle Conger, which you would have <br/>\nfound by following the links anyway. &lt;g&gt;<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nMindful Mothering: The Art of Being Present<br/>\nDanielle Conger<br/>\nMothers today juggle so many activities, appointments and duties that they <br/>\nmay more closely resemble carnival entertainers than icons of love and calm. <br/>\nOf course, being an icon is over-rated, but we could all probably benefit <br/>\nfrom the ability to slow down some, become more focused and find a greater <br/>\nsense of calm and well-being.<br/>\n<br/>\nMindfulness-borrowed from the Buddhist practice of being present and aware <br/>\nof one&#39;s thoughts, actions and environment-can add a powerful tool to our <br/>\nmothering repertoire, allowing us to take better care of ourselves and those <br/>\naround us.<br/>\n<br/>\nEach moment we spend playing with and caring for our children while thinking <br/>\nof what to make for dinner, the bills we need to pay, how many more minutes <br/>\nuntil we have to run out the door, the groceries we need to buy or anything <br/>\nother than exactly what we are doing with our child is a moment with them <br/>\nlost. Truth is, life with our children goes by all too fast. For many <br/>\nmothers, it seems like the time between birth and the first day of school <br/>\ngoes by in the blink of an eye.<br/>\n<br/>\nMore and more, mothers are choosing to slow down, reject the cultural values <br/>\nof multi-tasking and maximum efficiency, placing value instead in natural <br/>\nliving and attachment parenting and homeschooling. Going back to the Earth <br/>\nand Mothering centers our Selves, revealing meaning and value that nourishes <br/>\ninstead of fractures. Motherhood offers us the chance to rebirth ourselves <br/>\nthrough the birth of our children. Mindful mothering becomes the spiritual <br/>\npractice of our daily lives.<br/>\n<br/>\nMiniature Zen masters, our children offer us valuable insight into living <br/>\nwith present awareness as well as the opportunity to practice on a daily <br/>\nbasis. A smile, a laugh, the sense of wonder at each new experience call us <br/>\nback to the moment, back to ourselves, begging us to see the world through <br/>\nour child&#39;s eyes, to re-experience and re-awaken to the world around us.<br/>\n<br/>\nA squeal of delight as our child experiences the movement of a &quot;kitty&quot; <br/>\ninvites us to look more closely at the cat, to see the texture and color of <br/>\nthe fur, the suppleness of movement, the flexibility and focus the cat <br/>\ncommands. We see with the wonder of our toddler&#39;s eyes and the world is new. <br/>\nOur children generously lend us their perspective from moment to moment, <br/>\nrenewing for us the miracle of living, if we only accept their gift as <br/>\ngraciously as it is given.<br/>\n<br/>\nWhat does it mean to accept this gift? How do we live each moment more <br/>\nfully? We can begin by unlearning many of the lessons our fast-paced society <br/>\ntries to teach. We can begin by slowing down, breathing deeply, focusing on <br/>\nthe task at hand, and we can allow ourselves to experience the moment with <br/>\nall of our senses, bringing our body and mind together as one, united in <br/>\ncommon experience.<br/>\n<br/>\nBecoming More Mindful<br/>\n<br/>\nNursing mothers know the benefits of prolactin, &quot;the mothering hormone&quot; that&#39;s <br/>\nreleased during breastfeeding, physiologically relaxing us into the moment <br/>\nof nursing-a perfect example of mindful mothering. Everything stops when we <br/>\nnurse our newborn in the days before it becomes as routine as brushing our <br/>\nteeth. Think back to those first weeks of nursing, sitting still, quieting <br/>\nmind and body as we cradle that new life against our skin, breathing deeply <br/>\nthe smell of our infant and gazing intently at wondrous, tiny features. This <br/>\nis mindfulness. The key is to carry this sense of present awareness into all <br/>\nour actions and interactions throughout our days, but as mothers, we already <br/>\nrecognize it.<br/>\n<br/>\nWe can continue our mindfulness with something as simple as breathing. <br/>\nBuddhists have long known that focusing on the breath unites mind and body, <br/>\nbringing the Whole Self into present awareness. Thich Nhat Hanh, Buddhist <br/>\nmonk and 1967 Nobel Peace Prize Nominee, has called conscious breathing the <br/>\ncrucial bridge between mind and body, unifying the two and allowing us to <br/>\nbecome whole again. He recommends using the words, &quot;Breathing in I calm my <br/>\nbody; Breathing out, I smile.&quot; Simply taking a moment to breathe, to recall <br/>\nour conscious mind and to relax our mouth into a smile enables us to see and <br/>\nexperience life more clearly, richly and honestly.<br/>\n<br/>\nAs parents of young children, we have countless opportunities throughout the <br/>\nday to practice this bridging, using conscious breathing to recall ourselves <br/>\nto mindfulness in stressful moments. More than the classic adage &quot;count to <br/>\nthree,&quot; the practice of conscious breathing taps into our deepest awareness, <br/>\nrefocusing our energy from reaction to recentering. Moving past reaction by <br/>\nbreathing deeply, embracing our emotion and owning it, we can avoid <br/>\nhorn-locking our energy with our child&#39;s and focus instead on compassion and <br/>\nempathy, parenting our child through intense emotion rather than supplanting <br/>\nit with our own.<br/>\n<br/>\nWe can continue with small moments, like giving a child a bath. Rather than <br/>\nsitting by the tub with countless obligations running through our mind, <br/>\nthere in order to keep our child safe but not really there, we can join the <br/>\nexperience, become really present.<br/>\n<br/>\nClimb into the tub, or roll up sleeves to feel the warmth of the water. <br/>\nNaturally scented bubble bath can augment the sensory experience, pulling us <br/>\nback into the moment with the foamy lightness of the bubbles, the soothing <br/>\nscent of lavender or chamomile, relaxing body and mind into the moment. We <br/>\ncan compress a thick sponge, release, feel it drinking in water, becoming <br/>\nheavy, then squeeze, inviting warm water to rain down our child&#39;s back. <br/>\nBeing present and aware creates a moment of connection between ourselves and <br/>\nour child as together we live that moment fully.<br/>\n<br/>\nWe can continue by truly listening to our children and viewing the world <br/>\nthrough their eyes. By allowing our child&#39;s voice to be our clarion call <br/>\nback to the present, we can focus all our being on her wonder, curiosity and <br/>\nneed to explore her world. We can look into her eyes as she tells us about <br/>\nthe discovery she&#39;s just made, rub her back as she describes the hurt she <br/>\nfeels, get down to her height as she explains her needs and plans, shifting <br/>\nour perspective to meet hers as much as possible.<br/>\n<br/>\nBy making physical, emotional and spiritual connection with our children, we <br/>\nassure them that they matter in our lives, that they are more important than <br/>\nthe book we&#39;re reading or the phone call we need to make or the laundry list <br/>\nof things we need to get done. These connections, as they occur, make up the <br/>\nongoing symbiosis of nurture and wonder between mother and child, weaving us <br/>\ntogether at countless points throughout the day, wrapping us both in the <br/>\nwarmth, love and safety of togetherness in each moment, really breathing, <br/>\nreally loving, really living.<br/>\n<br/>\nThe Benefits of Mindfulness<br/>\n<br/>\nLiving more mindfully brings us closer to our child&#39;s perspective, allowing <br/>\nus to glimpse the world through his eyes, but more importantly, providing us <br/>\ninsight into our child&#39;s Self. Because we are able to view things more <br/>\nreadily from our child&#39;s perspective, we become an important ally, a trusted <br/>\nadvisor and a partner in problem solving.<br/>\n<br/>\nThrough the empathy gained by mothering mindfully, we can aid our children <br/>\nin fulfilling their dreams and desires in safe, productive and healthy ways. <br/>\nBecause they trust that we understand them and can see the world from their <br/>\nperspective, they are more willing to turn to us for help, fostering the <br/>\nopenness and communication essential to a positive parent/ child <br/>\nrelationship.<br/>\n<br/>\nMindfulness also offers us a shift in our own perspective, enabling us to <br/>\nsee life for what it really is-each moment a miracle. By living life moment <br/>\nto moment, we leave the regrets of the past behind us and the worries of the <br/>\nfuture for the day they may come to be. Moreover, we begin to see that each <br/>\nmoment offers us a fresh opportunity to see what we have right now and enjoy <br/>\nit while it graces our life. Mindfulness centers us in the moment we are <br/>\nalive-breathing, living-freeing us to see the joy that surrounds us in our <br/>\nchild&#39;s smile, the light catching the leaves in summer, snow crystals <br/>\nglinting in the crisp winter sun. We learn to see the joy that&#39;s all around <br/>\nus.<br/>\n<br/>\nPracticing mindfulness is an excellent way to counter the fear-based culture <br/>\nin which we live, providing an antidote to each primetime newscast <br/>\nsensationally reporting yet another threat to ourselves and our children. <br/>\nFear demands that we dwell in what-ifs and a false future, sacrificing the <br/>\njoy of the moment for the fear of someday. As we work to live in the moment, <br/>\nwe recognize more deeply the worries and emotions that wrestle us out of the <br/>\nmoment, seeing them for the chimeras they so often are.<br/>\n<br/>\nBeyond the clarity that mindfulness brings to our perception of the world, <br/>\nit simultaneously offers clarity of Self. Fostering introspection and <br/>\ngreater self-awareness, mindfulness can give us a deeper understanding of <br/>\nwho we are and our place in this world. When we hold our mind in focus, we <br/>\nbegin to prioritize our life by placing the people and the principles that <br/>\nare most important to us foremost where they truly belong. Too easily do we <br/>\nlose sight of the value our children bring to our lives, wishing away the <br/>\nmoments of finding shoes and buckling car seats. Mindfulness brings that <br/>\nvalue back into focus, reminding us to treasure each moment we are blessed <br/>\nwith them, however mundane, because it is a gift.<br/>\n<br/>\nWhen we can hold the truth of that gift in our minds, we can find a greater <br/>\nsense of peace within ourselves that allows us to respond with a greater <br/>\nsense of peace and gentleness to our children. How many times have we woken <br/>\nin the middle of the night to gaze upon our sleeping children, assuring <br/>\nourselves that they are still breathing, whether they are next to us or in <br/>\nthe next room, two or ten? How many times has the mother who lost a child <br/>\nwished for every moment back again? If we can hold that sense of mindfulness <br/>\nof life&#39;s precious value, we hold the key to responding to our children with <br/>\nlove and kindness instead of sharpness and exasperation.<br/>\n<br/>\nWe can easily recall ourselves to this sense of mindfulness by practicing <br/>\nconscious breathing, recalling our priorities and clearing our perspective <br/>\nfrom the baggage we bring. When we can stop, focus on our breathing and <br/>\nre-center, we see the spilt milk for what it truly is: our child&#39;s attempt <br/>\nto explore his world, to become more independent, to perform an act of <br/>\nthoughtfulness.<br/>\n<br/>\nOur practice becomes our child&#39;s practice as well, as we model for them <br/>\npeaceful and empathetic response. By modeling conscious breathing before <br/>\nreacting, we show our children how to deal effectively with intense emotions <br/>\nwithout ever giving a lesson. Young children, too, can benefit tremendously <br/>\nfrom learning to breathe through their anger, frustration and <br/>\ndisappointment. In my family, we call it &quot;blowing bubbles&quot;-breathing in good <br/>\nenergy and blowing out negative energy in tiny bubbles that float safely <br/>\nskyward, popping without harm to ourselves or others. Such deep breathing <br/>\nand visualization techniques give children positive and practical tools that <br/>\nstay with them through life.<br/>\n<br/>\nPerhaps the greatest benefit of mindful mothering is the joyful and <br/>\ncompassionate home it creates. The ripples of our own mindfulness emanate, <br/>\ntouching all members of the family. Our own empathetic and compassionate <br/>\nresponses are rejoined by compassion from our spouse and our children. When <br/>\nwe maintain perspective and clarity, we bring others back to mindful living <br/>\nwith us, reminding them of their own priorities and the joy that surrounds <br/>\nthem. When we feel peace, we become peace and embody the grace of that <br/>\nserenity, embracing our children with a heart of compassion and joy.<br/>\n<br/>\n© Danielle E. Conger 2005<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://danielleconger.com/Homeschool/MindfulMothering.html\">http://danielleconger.com/Homeschool/MindfulMothering.html</a></div>","specialLinks":[]}],"prevTopicId":20758,"nextTopicId":20993}}