{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I trust him!","postDate":"1088340810","msgId":1169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZENEI2MTA0LUM4MzgtMTFEOC04OEJFLTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDIwMDQwNjI3MDUxNjQ4Ljk2NjU2LnFtYWlsQHdlYjUwMDA1Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDQwNjI3MDUxNjQ4Ljk2NjU2LnFtYWlsQHdlYjUwMDA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":1151,"nextInTopic":0,"prevInTime":1168,"nextInTime":1170,"topicId":1151,"numMessagesInTopic":0,"msgSnippet":"... Would you have still been joyous about giving your son his freedom to choose if your DS chose to keep watching Cartoon Network while eating sugar straight","messageBody":"<div id=\"ygrps-yiv-1867042937\">On Jun 27, 2004, at 1:16 AM, Millie Rosa wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I knew I could trust him to learn but now I know I can trust him to <br/>\n&gt; make good choices regarding what he eats as well.<br/>\n<br/>\n </span></blockquote>Would you have still been joyous about giving your son his freedom to <br/>\nchoose if your DS chose to keep watching Cartoon Network while eating <br/>\nsugar straight from the container?  Sometimes when I read emails like <br/>\nthis I can&#39;t help but wonder if the poster would still be as OK with <br/>\nthe choices their child made if they weren&#39;t the &quot;right&quot; ones.  KWIM?  <br/>\nI&#39;m not trying to be snarky at all....I&#39;m just curious.  :)<br/>\n-Tracy-</div>","specialLinks":[]},{"userId":184426691,"authorName":"Millie Rosa","from":"Millie Rosa &lt;willsmamamillie@...&gt;","profile":"willsmamamillie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I trust him!","postDate":"1088313408","msgId":1151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjI3MDUxNjQ4Ljk2NjU2LnFtYWlsQHdlYjUwMDA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":1169,"prevInTime":1150,"nextInTime":1152,"topicId":1151,"numMessagesInTopic":0,"msgSnippet":"Okay, so I admit that when I saw posts about freedom of choice regarding tv and especially food choices that at first I thought the idea was ridiculous.  I am","messageBody":"<div id=\"ygrps-yiv-855081198\">Okay, so I admit that when I saw posts about freedom of choice regarding tv and especially food choices that at first I thought the idea was ridiculous.  I am pretty conscientious regarding the food I put in my body, and also what I give to my son.  Now, he has always been allowed to eat whatever he wanted from our stock, but there were only healthy choices.  I made him cookies and he has a sweet tooth, so I buy him chocolate chips (NOT slave- produced or Nestle!) and put sugar (not refined) in his smoothies.  But I am relaxing after being here a short while.  So last weekend we went to our condo where there is cable tv.  Normally I do not even turn it on.  But it rained all weekend, so I gave Will the remote, showed him how it worked, and held my breath.  He started flipping, stopped at SpongeBob for about a minute, moved on.  Settled on some news channel where they were covering the launch of spaceship one, and he was transfixed!  He did watch TV ALL weekend, but besides this<br/>\n launch, he watched a symphony and a documentary on ancient Egypt....and has been building pyramids all week!  He saw an ad for some Keebler cookies and asked me to buy them.  Uh-oh.  Well, I made a special trip just to buy these cookies for him, hydrogenated oil and all.  I brought them back, opened them up, gave him two on a plate in front of the tv.  A few minutes later he came in the kitchen, threw them in the garbage, said &quot;These cookies is yucky.  Make me some peanut butter cookies.&quot;  ALRIGHT!!!  And here&#39;s another.  This morning I was making his smoothie.  He always asks me what everything is as I add it in the blender.  When I got to the Turbinado and he asked what it was I said &quot;it&#39;s sugar.&quot;  He said &quot;I want some sugar.&quot;  I said &quot;I know, I am putting it in here.&quot;  He said &quot;No, I want to eat sugar just.&quot;  Well, I thought oh well, I was going to put it in his smoothie anyway, and gave him about half a teaspoon.  He spit it out, said it was yucky, and he wouldn&#39;t let me put it<br/>\n in his smoothie, either.  And here&#39;s another:  He went over to Grandpa&#39;s house, where he was offered blueberries.  He asked Grandpa &quot;Does it have chemicals in it?&quot;  Grandpa didn&#39;t know what he meant.  No, it&#39;s blueberries...  William said &quot;Is they &#39;ganic?&quot; and when Grandpa said no, Will wouldn&#39;t eat them!  And here&#39;s another:  we went to the market to sell some tomatoes.  I had told him we were going to the market and to the Goodwill box.  I was mad at the stupid produce manager for refusing to pay for organic and was heading home in a huff.  We were jamming Raffi, and as I got into the turn lane heading home, I heard Will saying something.  Turned down the radio said &quot;what, baby?&quot;  And he said &quot;Goodwill box.&quot;  I was so impressed w him for reminding me, because I had totally forgotten.  So I turned around and pulled in the parking lot where the box is and someone had set up one of those little sno cone houses, which I had to pull right in front of.  Will says &quot;What is that?.&quot;  I<br/>\n told him it was sno cones and he said he wanted one.  I thought crap but said okay.  I did order pina colada specifically b/c I figured it wouldn&#39;t have artificial color...but look I was doing really well to let him have a sno cone!  And I admit that I poured at least half of it out before I got it to the car, but it was in a really big cup.  I told him he&#39;d have to wait until we got home....he was cool...he&#39;s had ants in his car seat and so he knows...and when we got home and I gave it to him, he tasted it and said &quot;pour it out it&#39;s yucky I want some juice.&quot;  So, yeah, alright, he knows what is good for him!  Also, he asked for his chocolate chips for breakfast the other day and I obliged.  Actually this is cooler than after dinner when he usually eats them, because they were out of his system before bedtime (no, we don&#39;t have bedtime, but you know what I mean)...he went to sleep a lot earlier than normal that day.<br/>\nI knew I could trust him to learn but now I know I can trust him to make good choices regarding what he eats as well.<br/>\nMillie<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - Send 10MB messages!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1161,"nextTopicId":1172}}