{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":115295995,"authorName":"crissyhall","from":"&quot;crissyhall&quot; &lt;crissyhall@...&gt;","profile":"crissyhall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"bipolar and more","postDate":"1136719696","msgId":8844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwcXQwZytxYnVnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8843,"nextInTime":8845,"topicId":8844,"numMessagesInTopic":0,"msgSnippet":"I know I am jumping in on the conversation a bit late but wanted to add.... I was worried that my dd was bipolar because my mom is, and because she can be very","messageBody":"<div id=\"ygrps-yiv-200943633\">I know I am jumping in on the conversation a bit late but wanted to<br/>\nadd....<br/>\n<br/>\nI was worried that my dd was bipolar because my mom is, and because<br/>\nshe can be very explosive too, but mostly verbally. I&#39;ve also  read<br/>\n&quot;The Explosive Child&quot;  and found it very helpful. .  We have worked<br/>\nout that if she is frustrated to come squeeze it out of me or if I<br/>\nnotice it I&#39;ll ask is she wants a hug and that works alot of the time.<br/>\n But I know for some kids that would be the last thing they would want<br/>\nto do.  I also love &quot;Raising the Spirited Child&quot; , I got the idea of<br/>\nusing sensory activities to help diffuse her frustration from there;<br/>\nthings like water play, playdough, &quot;goop&quot;, shaving cream, snow.   I<br/>\njust really struggle with her teasing her brother.  But her intensity<br/>\nis what led us to unschooling, and I&#39;m so grateful for that.<br/>\n<br/>\nRen, I was curious how long you&#39;ve been a RU and how old were your kid<br/>\n when you started? Ooohh what&#39;s a swing chair?!  I couldn&#39;t find it at<br/>\nIkea&#39;s website.  On googling people, I googled myself to see what came<br/>\nup and there is a woman with my name that teaches belly dancing and I<br/>\njust took my first class today LOL.<br/>\n<br/>\nDaniel, &quot;My problem is that I would MUCH rather lecture than be<br/>\nlectured.  When posting there is this small spot in my head that<br/>\nenvisions the community I post to be enraptured and bedazzled by my<br/>\nbrilliance.......&quot;     LMAO!!!  You need to write for a sit com!!! Can<br/>\nyou imagine, you could push the unschooling &quot;agenda&quot; and nobody would<br/>\nnotice because they would be dazzled with your humor and brilliance :)<br/>\n<br/>\nLeslie, &quot; Do you do any sort of meditative practice that helps you BE<br/>\nin the  MOMENT?&quot;  I could really use help with this!!! But I&#39;m<br/>\nclueless on meditating, any suggestion on where to start?<br/>\n<br/>\nTyra, &quot;One thing I have thought about is the story about the mother<br/>\nwho acquired a horse for her children.  When I heard that the next<br/>\nConference would be in AZ, I thought that chances of me and my family<br/>\nattending would be slim as I live in TN.  However, I am going to use<br/>\ncreative thinking and figure out how I am going to make it there.&quot;   <br/>\n   Please share your ideas!  I&#39;m thinking hard too.  I went to the<br/>\nconference in St. Louis and dh thinks he&#39;s done, but I just have to go<br/>\nagain to NM!!!  I checked the train but it costs as much as flying and<br/>\ntook 48 hours!  Oh and my dd is passionate about wolves too.  I&#39;ve<br/>\nbeen trying to come up with more ideas to support her love but I&#39;m<br/>\nstuck; we&#39;ve done books, movies, stuffed animals, and the zoo. The<br/>\nbest was a wildlife science center that is a wolf research center,<br/>\nthey even had 2 Mexican Gray wolves! Have to go back again soon.  <br/>\n<br/>\nGayle, (((hugs))) from a recovering controlling perfectionist and<br/>\nwannabe RU.  I&#39;m not there yet, but I do have some &quot;being in the<br/>\nmoment&quot; moments and they have been coming more frequently.  I&#39;ve been<br/>\ntrying to remember the saying &quot;Dull women have immaculate houses&quot; :)<br/>\n<br/>\nJoanne, such wonderful news about Shawna.  Thanks for sharing, it gave<br/>\nme so much hope.<br/>\n<br/>\n~Christine</div>","specialLinks":[]}],"prevTopicId":8842,"nextTopicId":8845}}