{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Letting kids choose what they eat.","postDate":"1169498515","msgId":20923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjEwMWM3M2U2NSRjMTY3NzNiMCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PDQwNDMxNi42NDkwNS5xbUB3ZWIzMTQwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":20922,"nextInTime":20924,"topicId":20923,"numMessagesInTopic":0,"msgSnippet":"I think what a lot of new to unschooling parents don t get about letting kids choose what they eat is that you just don t just leave those kids alone to figure","messageBody":"<div id=\"ygrps-yiv-1072452750\">I think what a lot of new to unschooling parents don&#39;t get about letting kids choose what they eat is that you just don&#39;t just leave those kids alone to figure things out.<br/>\nEspecially little ones need to have parents that are present and attuned to them.<br/>\nYou, the parent, is still responsible to having AND OFFERING a variety of healthy choices to your child every so often.<br/>\nThings that a parent can do is:<br/>\n* Have the Monkey Platter available ( we call it &quot;Goodies Plate)What I do is I prepare a big plate with little portions of snacks and foods that can be eaten by hand like raisins, carrots, celery, chocolate chips, deli meat or other, tofu, cheeses, breads( cut up cute and small), baby spinach, potato chips, broccoli, you get the point... ( all those are examples of what my son likes and I buy them all organic and whole grains etc) I will also ad whatever else they want maybe M& Ms, chocolate chip cookies or Gummy Bears, etc<br/>\n* I bring then something every 2 hours the most ( my kids are 4 and a half and almost one- the baby nurses a lot still). I found out that if they go longer without eating they get real hungry and head for the less healthy , more sugary and handy stuff. If I anticipate the hunger they prefer to eat the cut up pear, the organic yogurt ect.<br/>\n*&#39;If my son is playing games and does not want to stop but I know he is hungry ( getting moody and frustrated at the game) I will hand feed him. No problem and he really appreciates plus it is a moment that he feels special since I spend so many times taking care of the baby.<br/>\n*If we are shopping and he wants something I just buy it for him. Whatever it is. &quot;Junk&quot; or not. He can have it. Most times he will try it and not like it. If he does we just always buy for him or ask if he wants it when we are shopping. I like to buy what he likes to have at home at all times if possible.<br/>\nWe talk about healthy foods and I read labels and try to simply explain why some things are good and some are not.<br/>\nLately he heard about trans fats and found out that the cookies Daddy likes have lots of it. So he now asks me to make some healthy cookies for him. Of course if he still wants those because we don&#39;t have ready healthy cookies he will just grab the other so it is up to me to make sure he has healthy ones.<br/>\nHe has eaten maybe one or two of the &quot;trans fat&quot; cookies...since that discovery. I need to make more healthy one ASAP<br/>\nHe also asked for orange juice about a month ago when he had a little head cold and needed his vitamin C.<br/>\nIf he is eating a little  too much sugar I offer some protein  to help his body not have a sugar crash. He does take my advice because I have pointed out when he was having a sugar crash and he does not like to feel that way.<br/>\nKids want to feel good. Give them a chance, Respect their choices, be proactive, be there, do not be judgmental of their choices. <br/>\nIf my ds asks for ice cream for breakfast  he gets ice cream. I don&#39;t tell him ice cream is bad and he should choose something else. I have a healthier ice cream that I buy and he loves. I just give to him.<br/>\nA little later I offer him other things to eat. <br/>\nSo  what I  am trying to say is that when you unschool food you don&#39;t just start offering candy and pop and let your kids figure it out by themselves when they are hungry when they are only 3.<br/>\nOffer them choices, let them eat what they want or  not. let them ask for something else. Let them have the cake once, three times, ten times, but offer in a plate other choices. More likely than not they will also eat other things and not only the cake.<br/>\nSometimes I ask my ds if he wants like say pasta and chicken for lunch and he will tell me he wants ice cream first. He will eat his ice cream and his other food. <br/>\nHope it helps<br/>\nAlex<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":20888,"nextTopicId":20929}}