{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sometimes his passions make me nervous.","postDate":"1147713003","msgId":13190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQyMTU1NEVBLUM3NjQtNDVDOC04NTYzLUFEOTQ1OTUxNDVEN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNTE1LjA3NTY0OC4zMDY4LjAuZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDYwNTE1LjA3NTY0OC4zMDY4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":13169,"nextInTopic":0,"prevInTime":13189,"nextInTime":13191,"topicId":13090,"numMessagesInTopic":0,"msgSnippet":"... And, when the kid is grown, he ll have internalized that urge to resist and it is very hard to get rid of it. His outlook on life will be through the","messageBody":"<div id=\"ygrps-yiv-112038080\">On May 15, 2006, at 6:56 AM, Deb Lewis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If your kid is fighting for control to the point he&#39;s not thinking<br/>\n&gt; clearly, it&#39;s probably an indication that he feels powerless.  People<br/>\n&gt; can&#39;t live that way.  He needs new tools for coping with the things  <br/>\n&gt; that<br/>\n&gt; are out of his control (other people) and he needs help from you in<br/>\n&gt; finding ways to have control of his own life.<br/>\n<br/>\n </span></blockquote>And, when the kid is grown, he&#39;ll have internalized that urge to  <br/>\nresist and it is very hard to get rid of it. His outlook on life will  <br/>\nbe through the lenses of resisting other people trying to control him.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sometimes his passions make me nervous.","postDate":"1147701407","msgId":13169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNTE1LjA3NTY0OC4zMDY4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":13103,"nextInTopic":13190,"prevInTime":13168,"nextInTime":13170,"topicId":13090,"numMessagesInTopic":0,"msgSnippet":"**...we do have to limit TV and such.*** ***...limit certain things just to get my kids to go outside and get fresh air.*** ***I do have limits when we just","messageBody":"<div id=\"ygrps-yiv-55669046\">**...we do have to limit TV and such.***<br/>\n***...limit certain things just to get my kids to go outside and get<br/>\nfresh <br/>\nair.***<br/>\n<br/>\n***I do have limits when we just want to sit <br/>\ndown and eat. ***<br/>\n<br/>\n***... demanding is actually putting it lightly...*** <br/>\n***He has a extremely bad temper&gt;&gt;&gt;***<br/>\n***My oldest has a violent temper and youngest mimics what he sees in big<br/>\nbubba. ***<br/>\n<br/>\n***I am the one who had to deal with him taking scissors to a kids ear in<br/>\nschool ***<br/>\n<br/>\n***It worked for us never aid it would for anyone else.. ***<br/>\n<br/>\n<br/>\nHow have the limits worked, then?   Because if your family has had these<br/>\nmajor issues it sounds like the limits haven&#39;t worked.  <br/>\n<br/>\nThere are certain personality types that submit to control (few) and<br/>\ncertain others (more common) that resist.  The more control, the greater<br/>\nthe resistance.   The trap is in thinking that we can ever control<br/>\nanother person in the first place.  The trick is in working with the<br/>\nother person to help them reach their goals in healthy ways.  <br/>\n<br/>\nSome moms here can tell you about their peaceful family life without<br/>\nlimits.  It doesn&#39;t happen overnight in cases where there have been tight<br/>\ncontrols on kids, but the continuation of control will/can lead to a<br/>\ndamaged relationship and a stressful home life. <br/>\n<br/>\n***So maybe I need to move <br/>\nto the homeschool group because we still have schedules to keep here***<br/>\n<br/>\nLots of us have schedules and commitments.  That&#39;s not an excuse.  You<br/>\nmight find exactly what you want at another list, support for how you&#39;re<br/>\ndoing things now, sympathy for what you&#39;ve been through, agreement about<br/>\nyour son.  But if you&#39;re willing to look at what has or hasn&#39;t really<br/>\nworked to help your son be happier, people here can help you.   By the<br/>\ntime some parents realize their kids need something different there have<br/>\nbeen years and years of unhappy family relations.  That won&#39;t change<br/>\novernight but it won&#39;t change at all if the parents don&#39;t change<br/>\nthemselves. <br/>\n<br/>\nI have an adult scissors story.  My friend had always wanted to be a<br/>\nteacher.  Somewhere along the way that job was glamorized in his head. <br/>\nHe didn&#39;t live with his own two kids and maybe part of it was his desire<br/>\nto be a positive force in lives of children.   When he was in his forties<br/>\nhe became what&#39;s called a non traditional teacher in Arkansas.   He<br/>\ntaught for two years.  He became very disillusion when he couldn&#39;t<br/>\n&quot;control&quot; the kids.   His weeks became power struggles with the kids.  <br/>\nThe school had a policy against hoodies and one kid wouldn&#39;t get rid of<br/>\nhis hoodie.   My friend took scissors to the kid&#39;s sweatshirt and cut the<br/>\nhood off.  Right in the classroom.   A grown man, who *chose* to be at<br/>\nthe school everyday, got so caught up in his struggle for power he took<br/>\nscissors to a kid.  <br/>\n<br/>\nIf your kid is fighting for control to the point he&#39;s not thinking<br/>\nclearly, it&#39;s probably an indication that he feels powerless.  People<br/>\ncan&#39;t live that way.  He needs new tools for coping with the things that<br/>\nare out of his control (other people) and he needs help from you in<br/>\nfinding ways to have control of his own life.    <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":141440271,"authorName":"drusila00","from":"&quot;drusila00&quot; &lt;drusila00@...&gt;","profile":"drusila00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: sometimes his passions make me nervous.","postDate":"1147630774","msgId":13103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0N3NibStkbWhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNTE0LjA5NDg0My4zMTkyLjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":13091,"nextInTopic":13169,"prevInTime":13102,"nextInTime":13104,"topicId":13090,"numMessagesInTopic":0,"msgSnippet":"... son and get a glimpse of the joy he was experiencing.  *You* turned it into something weird.  : ( No I did not. I was not embarassed, I simply sat","messageBody":"<div id=\"ygrps-yiv-1246660797\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Deb Lewis &lt;ddzimlew@...&gt; <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Were you embarrassed?   You missed a moment to really watch your <br/>\n </span></blockquote>son and get a glimpse of the joy he was experiencing.  *You* turned <br/>\nit into something weird.  : (&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n No I did not.<br/>\n I was not embarassed, I simply sat quietly and smiled thinking that <br/>\nhe is one of the most giving people I have ever known. but I noticed <br/>\nthe looks others gave him and the ones they gave me as if to say &quot;is <br/>\nhe normal?&quot; You can&#39;t not notice the looks. I just smiled and <br/>\nshrugged.<br/>\n<br/>\nWould you be writing here if one of the other moms there had brought <br/>\nher knitting and worked on a sweater all night?&gt;&gt;<br/>\n<br/>\n Again I was not complaining just telling it like it is to <br/>\nillistrate the depth of his focus.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Take him some crackers and cheese or sliced apples;  Anything he <br/>\n </span></blockquote>can grabquickly and shove into his head with one hand.  Take him a <br/>\ndrink.   Put it right beside him, tell him it&#39;s there. &gt;&gt;&gt;<br/>\n<br/>\nSerriously, I have been his parent long enough to do that and I did <br/>\nand he shpowed no interest. a bit of a worry for me but I in no way <br/>\nexpect him to starve himself It is just a drastic change for him to <br/>\nignore his favorite foods for many meals in a row.<br/>\n<br/>\n<br/>\nMostly I wrote the post not to beliettle him but to illustrate why I <br/>\nmight be nervious and to see if anyone else ever felt nervious or <br/>\nexperianced somthing similer.<br/>\nbut thanks for your imput.</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sometimes his passions make me nervous.","postDate":"1147623120","msgId":13091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNTE0LjEwMTIwMC4zMTkyLjMuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":13090,"nextInTopic":13103,"prevInTime":13090,"nextInTime":13092,"topicId":13090,"numMessagesInTopic":0,"msgSnippet":"***Maybe limiting the time spent doing the origami will help.*** No it won t.  Limits only make people want the thing more.  Children s lives are already full","messageBody":"<div id=\"ygrps-yiv-1497841958\">***Maybe limiting the time spent doing the origami will help.***<br/>\n<br/>\nNo it won&#39;t.  Limits only make people want the thing more.  Children&#39;s<br/>\nlives are already full of  irritating limits.  Their size prohibits<br/>\nreaching some things they&#39;d like to touch.  Their small hand prohibit<br/>\nholding some tools they&#39;d like to use.  Lets not be giving advice about<br/>\nhow to further limit children.   This list is here to help people open up<br/>\na world of opportunities for their kids. <br/>\n<br/>\n***Like <br/>\nsay after you eat you can go do this.... I tell my son that he has to <br/>\ndo something else for awhile then can go back.***<br/>\n<br/>\nAfter you learn about unschooling you can offer advice here.  You have to<br/>\nread about unschooling and then you can come back. &lt;beg&gt;<br/>\n<br/>\n***I know this does go <br/>\nagainst unschooling but sometimes I really feel we need to do something <br/>\nelse. ***<br/>\n<br/>\nDon&#39;t offer advice that goes against unschooling on this list, please.  <br/>\nLet the &quot;something else&quot; be something that helps kids move out into a big<br/>\nworld not something that confines kids to a small box.<br/>\n<br/>\n***If you go to the restraunt maybe the origami stuff needs to stay <br/>\nhome.***<br/>\n<br/>\nI always take a notebook to a restaurant so I can write down ideas or<br/>\nwords or phrases I might want to use in some awful poem or story. <br/>\nMy friend always takes her phone so she can call other friends and say<br/>\n&quot;I&#39;m having strawberry pie right now what are you doing.&quot; &lt;g&gt;<br/>\n<br/>\n***I would just try limiting because it can make you nervous.***<br/>\n<br/>\nMaking kids feel bad so moms can feel better is terrible.  It&#39;s terrible<br/>\nadvice and it&#39;s a terrible tactic and a mean thing to do.  Moms are<br/>\nsupposed to be finding ways to make the world available to kids.  <br/>\n<br/>\n***He will move onto a new passion one day, until then just <br/>\nencourage(sometimes strongly) something new***<br/>\n<br/>\nThis little person has found something beautiful that he loves.  He&#39;s<br/>\nenjoying himself, he&#39;s happy, he&#39;s making art and doing important work . <br/>\n<br/>\nHis mom should help him do what he wants to do.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sometimes his passions make me nervous.","postDate":"1147621723","msgId":13090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNTE0LjA5NDg0My4zMTkyLjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":13091,"prevInTime":13089,"nextInTime":13091,"topicId":13090,"numMessagesInTopic":0,"msgSnippet":"***he gave several people we knew who work in the restaurant origami things- they didn t quite know how to respond, looked confused but were polite. he went","messageBody":"<div id=\"ygrps-yiv-1511379741\">***he gave several people we <br/>\nknew who work in the restaurant origami things- they didn&#39;t quite know <br/>\nhow to respond, looked confused but were polite.<br/>\nhe went around asking everyone if they did Origami too. no one did. <br/>\nand he got a lot of weird looks.***<br/>\n<br/>\nWere you embarrassed?   You missed a moment to really watch your son and<br/>\nget a glimpse of the joy he was experiencing.  *You* turned it into<br/>\nsomething weird.  : (<br/>\n<br/>\n***We went to a campfire and he asked his dad to bring his origami book <br/>\nand paper and a flashlight. he made Origami all night.***<br/>\n<br/>\nWould you be writing here if one of the other moms there had brought her<br/>\nknitting and worked on a sweater all night?  <br/>\n<br/>\n***he has not eaten despite my <br/>\nsugestions that maybe he needs to do that and its now 5pm. ***<br/>\n<br/>\nTake him some crackers and cheese or sliced apples;  Anything he can grab<br/>\nquickly and shove into his head with one hand.  Take him a drink.   Put<br/>\nit right beside him, tell him it&#39;s there.  <br/>\n<br/>\n***I wonder if this will become an issue if I do not <br/>\nstrongly encourage/remind him to eat, take a shower ect.***<br/>\n<br/>\nMore likely it will become an issue if you work against him.   Sit down<br/>\nwith him and ask him to show you how to make something.  Be with him, be<br/>\nengaged, talk to him about it, learn something about origami yourself and<br/>\nshare it with him,  help him hang his cranes like a mobile, and maybe<br/>\nyou&#39;ll begin to understand why he likes it so much.   Maybe you&#39;d like<br/>\nkirigami, too.   Maybe you could get all your Christmas cards made early,<br/>\nif you sit with him and do kirigami cards while he enjoys his paper<br/>\nfolding.  Don&#39;t turn his joyful work into a disorder. <br/>\n<br/>\nLook here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/e5jos\">http://tinyurl.com/e5jos</a>  <br/>\n<br/>\nGoogle &quot;paper folding math&quot; or &quot;paper folding geometry&quot; or paper folding<br/>\nart&quot; and see how many people out there believe it&#39;s important work.  But<br/>\nplease don&#39;t try to teach him about math if you do look at some of the<br/>\ngoogle hits.   Let his work be about what he wants, not what you&#39;d like<br/>\nto turn it into, not about what&#39;s acceptable to you.  <br/>\n<br/>\nWhen surgeons work twenty four hours and don&#39;t stop to sleep or eat, we<br/>\nsay they&#39;re dedicated.  When kids work twenty four hours and don&#39;t stop<br/>\nto sleep or eat people say &quot;obsessed.&quot;   It&#39;s insulting.  It one more way<br/>\nwe openly discriminate against kids.  <br/>\n <br/>\nDeb Lewis<br/>\n<br/>\n&quot;There&#39;s a hole in every man the size of the truth and I&#39;m going to jam<br/>\nit in there.&quot;<br/>\n~Stephen Colbert<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":990,"nextTopicId":13193}}