{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"getting into college","postDate":"1149962703","msgId":14316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODVBQ0Y4ODZDNkIwQy0xN0IwLTFEQzBAbWJsay1kMTkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":14315,"nextInTime":14317,"topicId":14316,"numMessagesInTopic":0,"msgSnippet":"Another post from Leslie Moyer: It was either Barb or Sandy who first broached the topic of alternatives to college and said it was something not discussed","messageBody":"<div id=\"ygrps-yiv-645241865\">Another post from Leslie Moyer:<br/>\n<br/>\nIt was either Barb or Sandy who first broached the topic of<br/>\n&quot;alternatives to college&quot; and said it was something not discussed as<br/>\noften. I had to laugh because it&#39;s all I hear about in unschooling<br/>\ncircles....i.e. &quot;not going to college&quot; seems almost *more* acceptable<br/>\nthan &quot;going to college.&quot; Guess it&#39;s who you hang with.... :-)<br/>\n<br/>\nI, like Joy, read and pass along to my kids John Anderson&#39;s stuff on <br/>\nthe<br/>\ntopic of college. I struggled for a long time about whether or not I<br/>\n&quot;wanted&quot; college for my kids. I was trying to search the deep recesses<br/>\nof my heart for what I truly felt about college so that I might not <br/>\npass<br/>\nalong my biases. (Personally, I *hated* college when I went....their<br/>\ndad loved it.....my unschooling passion tells me it&#39;s worse than a <br/>\nwaste<br/>\nof time....my fear is that it will corrupt their life-long joy of<br/>\nlearning....etc.) Then I remembered it wasn&#39;t my decision. :-) I did<br/>\nwhat I could to pass along the &quot;pros&quot; and &quot;cons&quot; of college so that my<br/>\nkids could--as always--have the information they needed to make their<br/>\nown decisions about their lives.<br/>\n<br/>\nMy oldest (Matt) just finished his first year at a small private <br/>\ncollege<br/>\n& *loved* it. My second &quot;child&quot; (Sarah) is 17 and happily planning to<br/>\ngo to college, too. They both had/have a very strong desire to go to<br/>\ncollege. I don&#39;t exactly know where that desire is rooted, but I do<br/>\nthink they see it partially as a &quot;rite of passage&quot;. Rightly or<br/>\nwrongly. I think their reasons have more to do with social stuff rather<br/>\nthan educational stuff, though....and, to me, neither one is more or<br/>\nless important than the other. In Matt&#39;s case I think it was a<br/>\n&quot;successful&quot; rite of passage--he has matured in ways I didn&#39;t<br/>\nexpect.....he made lots of friends, but they&#39;re much closer friendships<br/>\nthan what he has had before...his friends now have much more in common<br/>\nwith him than his friends in the small (conservative) town where we<br/>\nlive. Also, the biggest surprise is how his relationship with me has<br/>\nmatured.<br/>\n<br/>\nHe is enjoying the stimulating educational environment....he&#39;s had<br/>\nmostly very good professors & he&#39;s excelling in his field of interest<br/>\n(computer science)--setting the curve in those classes. (He also has a<br/>\nsecond major in math....my son who doesn&#39;t have his multiplication<br/>\ntables memorized and still has problems with long division &lt;g&gt;....and<br/>\ndoing terrific in his advanced math courses--a 4.0 this semester...and<br/>\nhe&#39;s the math club secretary & webmaster.) Matt has always been very<br/>\nprivate about his learning & he&#39;s very intelligent. He hasn&#39;t really<br/>\nhad other people to talk with about his interests who could really<br/>\nunderstand what he was talking about....no one to share his interests<br/>\nwith. He&#39;s finding that--and more--at college. He&#39;s benefiting from<br/>\nthat educationally and socially.<br/>\n<br/>\nPerhaps my kids look to college as a rite of passage because society<br/>\ndoesn&#39;t value many other alternatives (though our family does) and as<br/>\nhomeschoolers we didn&#39;t have the usual -- &quot;graduation&quot;? Perhaps they<br/>\nmight not feel so strongly about college if I was able to show them<br/>\ndifferent rites of passage that felt like &quot;growing up&quot;? Just as a<br/>\npersonal trait, I&#39;m not good with celebrations or traditions or other<br/>\nrites of passage (I find them stifling). I think they were influenced<br/>\nby their friendships, too....their friends either went to college and<br/>\nenjoyed it or they didn&#39;t go and were working at jobs where they aren&#39;t<br/>\nparticularly happy or challenged. I don&#39;t know why they wanted to go to<br/>\ncollege so much--I&#39;ve asked and not gotten a very complex<br/>\nresponse....perhaps they don&#39;t even know why.<br/>\n<br/>\nBoth Matt & Sarah have done a fabulous job of finding colleges that<br/>\n&quot;fit&quot; them. (Proven true for Matt--as yet to be seen for Sarah, but<br/>\nit&#39;s looking great from my perspective.) For one thing, unschooling has<br/>\nallowed both of them to really *know* themselves--to know what they <br/>\nwant<br/>\nto do with their lives. They&#39;ve had a lot of time to explore their<br/>\ninterests & they both have a pretty good idea of how they want to spend<br/>\ntheir young adult lives. They&#39;ve been able to find colleges that can<br/>\ntruly support and encourage those interests, I think. In addition, they<br/>\nboth looked for small colleges--my bias is certainly in favor of &quot;small<br/>\ncollege&quot; over &quot;big university&quot;.<br/>\n<br/>\nAs far as the college-money issue goes, Matt is attending college on a<br/>\nfull scholarship--tuition, room & board--at a smallish private college.<br/>\nHe was offered another scholarship at a different college for full<br/>\ntuition. (In that case, he competed via a project & presentation.) He<br/>\napplied to quite a few colleges (a dozen?) & was offered scholarships <br/>\nat<br/>\nall he was accepted to--in three cases, the best scholarship they had.<br/>\n(He applied to so many because he was &quot;shopping&quot; <br/>\nscholarships--something<br/>\nI&#39;d recommend as it paid off greatly for him--scholarship offers varied<br/>\nwidely.) He had a very good ACT score--he studied for it using the ACT<br/>\ntest prep books & software--and his &quot;extracurricular&quot; (I use the word<br/>\ntongue-in-cheek) activities (Eagle Scout, volunteer, work) rounded out<br/>\nhis application. I&#39;m sure the ACT score weighed heavily....but<br/>\nunschoolers *can* score well on the ACT if they prepare for it. Matt<br/>\nwas 100% radically unschooled....but he was highly motivated to attend<br/>\ncollege and, therefore, highly motivated to score well on the ACT.<br/>\nBasically, the same logic that allows us to accept the fact that<br/>\n&quot;unschoolers can do well in college&quot; applies to taking the ACT, too.<br/>\nMatt wanted to do well on the test so he studied for it. (As an FYI:<br/>\nthe ACT has only 3 questions on trigonometry....they&#39;re always the SAME<br/>\nthree questions....different numbers plug into them to give different<br/>\nanswers, but they&#39;re always the same three questions.....a test-taker<br/>\ndoesn&#39;t have to know trigonometry--they only have to know three <br/>\nspecific<br/>\nequations to do well on that part of the ACT. This is the sort of thing<br/>\ncovered in the ACT test prep book.) He didn&#39;t study for the English<br/>\nparts much--they came naturally from lots of reading.<br/>\n<br/>\nSarah has taken the ACT once and didn&#39;t score terribly high, but good<br/>\nenough to get into the community college for concurrent enrollment for<br/>\nnext year (her &quot;senior year in high school&quot;)....but not high enough to<br/>\ntake math classes there. But she doesn&#39;t enjoy math and it doesn&#39;t come<br/>\neasily for her and she finds it difficult to study (it&#39;s &quot;boring&quot;). But<br/>\nshe&#39;s looking at colleges that value what SHE has to offer--strong<br/>\nleadership skills, a fabulous & contagious attitude, a diverse array of<br/>\nlife experiences, and strong personal references. She&#39;s specifically<br/>\nlooking at colleges that don&#39;t put a strong emphasis (or in some cases,<br/>\nANY emphasis) on standardized test scores. She&#39;s also looking at a<br/>\ncouple of colleges that offer work programs in exchange for some of <br/>\nyour<br/>\ntuition--greatly decreasing the cost of college. (She&#39;s off to take the<br/>\nACT for the second time tomorrow morning.) She&#39;s also hoping to work in<br/>\nEngland from January to May & who knows how that might influence her<br/>\ncollege plans?!<br/>\n<br/>\nOne book I&#39;d add to the two Barb sent is &quot;Cool Colleges: For the<br/>\nHyper-Intelligent, Self-Directed, Late Blooming, and Just Plain<br/>\nDifferent&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/gp/product/1580081509/\">http://www.amazon.com/gp/product/1580081509/</a> by Donald Asher.<br/>\n<br/>\nI had a lot more to write but I started this early this morning and <br/>\nit&#39;s<br/>\nnow almost midnight and I&#39;ve had a long day in the interim!<br/>\n<br/>\n--Leslie<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot;  <br/>\n~Frank Smith<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]}],"prevTopicId":14315,"nextTopicId":14321}}