{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":138896698,"authorName":"amshotwell","from":"&quot;amshotwell&quot; &lt;amshot@...&gt;","profile":"amshotwell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1182006171","msgId":24499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1MHUycitxY2lpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24182,"nextInTopic":0,"prevInTime":24498,"nextInTime":24500,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"Hope you don t mind me posting this article. It was posted on one of my other boards. Although it is not promoting unschooling or even homeschooling, I think","messageBody":"<div id=\"ygrps-yiv-1335368252\">Hope you don&#39;t mind me posting this article. It was posted on one of<br/>\nmy other boards. Although it is not promoting unschooling or even<br/>\nhomeschooling, I think it totally promotes unschooling unconsciously.<br/>\n  I thought it had some nice points that may help some of the people<br/>\non fact finding missions (such as myself)  that are trying to convince<br/>\na partner that school is not the best place for their children. I<br/>\nthink curriculum based homeschoolers face these same issues this<br/>\nteacher is talking about by putting undue pressure to perform at some<br/>\npredetermined expectation of age and development.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homefires.com/click?letchildrenbechild.\">http://www.homefires.com/click?letchildrenbechild.</a><br/>\nAnne Marie<br/>\n<br/>\n<br/>\nLet children be children<br/>\nIs your 5-year-old stressed out because so much is expected?<br/>\n<br/>\nPenelope H. Bevan<br/>\n<br/>\nSunday, June 3, 2007<br/>\n<br/>\nI was watching one of my second-grade girls try unsuccessfully to tie<br/>\nher shoes the other day, and I thought, &quot;This is a person who is<br/>\nsupposed to be learning plural possessives?&quot; I think not.<br/>\n<br/>\nWe&#39;ve just finished test time again in the schools of California. The<br/>\nmad frenzy of testing infects everyone from second grade through high<br/>\nschool. Because of the rigors and threats of No Child Left Behind,<br/>\nschools are desperate to increase their scores. As the requirements<br/>\nbecome more stringent, we have completely lost sight of the children<br/>\ntaking these tests.<br/>\n<br/>\nFor 30 years as a teacher of primary kids, I have operated on the Any<br/>\nFool Can See principle. And any fool can see that the spread between<br/>\nwhat is developmentally appropriate for 7- and 8-year-old children and<br/>\nwhat is demanded of them on these tests is widening. A lot of what<br/>\nused to be in the first-grade curriculum is now taught in<br/>\nkindergarten. Is your 5-year-old stressed out? Perhaps this is why.<br/>\n<br/>\nPrimary-grade children have only the most tenuous grasp on how the<br/>\nworld works. Having been alive only seven or eight years, they have<br/>\nnot figured out that in California there is a definite wet and dry<br/>\nseason. They live in high expectation that it will snow in the Bay<br/>\nArea in the winter. They reasonably conclude, based on their limited<br/>\nexperience with words, that a thesaurus must be a dinosaur. When asked<br/>\nto name some of the planets after he heard the word Earth, one of my<br/>\nboys confidently replied, &quot;Mars, Saturn, Mercury, Jupiter and Canada!&quot;<br/>\nto which a girl replied, &quot;No, no, no, you gotta go way far outer than<br/>\nthat.&quot;<br/>\n<br/>\nResearch has shown that it takes approximately 24 repetitions of a new<br/>\nconcept to imprint on a young brain. The aforementioned plural<br/>\npossessives come up twice in the curriculum, yet they are supposed to<br/>\nknow it when they see it. This is folly.<br/>\n<br/>\nCurrently, 2 1/2 uninterrupted hours are supposed to be devoted to<br/>\nlanguage arts and reading every morning. I ask you, what adult could<br/>\nsustain an interest in one subject for that long? Yet the two reading<br/>\nseries adopted by the state for elementary education require that much<br/>\ntime be devoted to reading in the expectation that the scores will<br/>\nshoot up eventually. Show me a 7-year-old who has that kind of<br/>\nconcentration. Show me a 64-year-old teacher who has it. Not I.<br/>\n<br/>\nThe result of this has been a decline in math scores at our school,<br/>\nbecause the emphasis is on getting them to read and there isn&#39;t enough<br/>\ntime to fit in a proper curriculum. Early math education should rely<br/>\nheavily on messing about with concrete materials of measurements,<br/>\nmass, volume and length, and discovering basic principles through play.<br/>\n<br/>\nThere is no time for this. The teaching of art is all but a subversive<br/>\nactivity. Teachers whisper, &quot;I taught art today!&quot; as if they would be<br/>\nreported to the Reading Police for stealing time from the reading<br/>\ncurriculum, which is what they did.<br/>\n<br/>\nIt is also First Communion time in second grade. Yes, I teach in a<br/>\npublic school, but First Communion happens in second grade, and it is<br/>\na big deal, the subject of much discussion in the classroom. The<br/>\nchildren are excited.<br/>\n<br/>\nA few months back one of my girls exclaimed, &quot;Jeez, I have a lot to do<br/>\nafter school today, Teacher. I gotta do my homework, go to baseball<br/>\npractice and get baptized.&quot; I laughed to myself at the priorities of<br/>\nthis little to-do list, so symbolic of the life of one second-grader.<br/>\nBut there was a much larger issue here. What is happening to their<br/>\nsouls? You may ask, what business it is of the schools what is<br/>\nhappening to the souls of these little children?<br/>\n<br/>\nI will tell you. Any fool can see that those setting the standards for<br/>\ntesting of primary-grade children haven&#39;t been around any actual<br/>\nchildren in a long time. The difference between what one can<br/>\nreasonably expect an 8-year-old to know and what is merely a party<br/>\ntrick grows exponentially on these state tests.<br/>\n<br/>\nMeanwhile, children who know they are bright and can read well are<br/>\nproved wrong time and again because of the structure of these tests.<br/>\nTeachers spend inordinate amounts of time trying to teach the children<br/>\nto be careful of the quirky tricks of the tests when they should be<br/>\nsimply teaching how to get on in the world.<br/>\n<br/>\nTwenty years ago, I had a conference with a parent, a Sikh, whose<br/>\nchild was brilliant. I was prepared to show him all her academic work,<br/>\nbut he brushed it aside and said, &quot;Yes, yes, I know she is quite<br/>\nsmart, but I want to know how her soul is developing.&quot;<br/>\n<br/>\nThe present emphasis on testing and test scores is sucking the soul<br/>\nout of the primary school experience for both teachers and children.<br/>\nSo much time is spent on testing and measuring reading speed that the<br/>\nchildren are losing the joy that comes but once in their lifetime, the<br/>\nhappy messiness of paint, clay, Tinkertoys and jumping rope, the quiet<br/>\ndiscovery of a shiny new book of interest to them, the wonders of a<br/>\nmagnifying glass. The teachers around them, under constant pressure to<br/>\nraise those test scores, radiate urgency and pressure. Their smiles<br/>\nare grim. They are not enjoying their jobs.<br/>\n<br/>\nOur children need parents and teachers who, like Hamlet, know a hawk<br/>\nfrom a hand saw, who know foolishness when they see it and are strong<br/>\nenough to defend these small souls from the onslaught of escalating<br/>\ndevelopmentally inappropriate claptrap. The great unspoken secret of<br/>\nprimary school is that a lot of what is going on is arrant nonsense,<br/>\nand it&#39;s getting worse. Any fool can see.</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] This may seem like an odd request.","postDate":"1181160773","msgId":24182,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcwNjA2MTMxMnM2MWFiZjlhYXMyMzdiYzFlMjBhODcxZDI3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg==","referencesHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24181,"nextInTopic":24499,"prevInTime":24181,"nextInTime":24183,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"Oh, I forgot. ... Go to your local public school and just ask about HOMEschooling.  You ll get an earful there, whether or not it s based in reality.  Just","messageBody":"<div id=\"ygrps-yiv-1387284867\">Oh, I forgot.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Where can I hear about the good, the bad and the ugly sides of<br/>\n&gt; unschooling?<br/>\n<br/>\n<br/>\n </span></blockquote>Go to your local public school and just ask about HOMEschooling.  You&#39;ll get<br/>\nan earful there, whether or not it&#39;s based in reality.  Just remember that<br/>\nthey have monetary reasons to dislike ANY form of homeschooling.<br/>\n<br/>\nAnyone I&#39;ve spoken with about unschooling who was not familiar with it<br/>\nalready labels it as irresponsible, at best.  I&#39;m betting that you&#39;re going<br/>\nto have a difficult time finding someone who is well-informed about<br/>\nunschooling and is also against it.  Most pro-schoolers I know simply lump<br/>\nin &quot;irresponsible&quot; and &quot;dangerous&quot; with all the other criticisms against<br/>\nhomeschooling (lack of social skills, e.g.) when they hear about<br/>\nunschooling.  Good luck.<br/>\n<br/>\n--Rob Saxon<br/>\nHusband to Seana for 10 years<br/>\nDaddy to Genevieve (5) and Elissa (4)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] This may seem like an odd request.","postDate":"1181160344","msgId":24181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcwNjA2MTMwNXAyMjY5NmIwNm82YzZhNWU4OWRmOWZjNTBmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg==","referencesHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24159,"nextInTopic":24182,"prevInTime":24180,"nextInTime":24182,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"Hello, Long-time lurker, don t think I ve posted here before.  I have two daughters, ages 5 and 4, and my SAHM wife unschools them.  And we re both quite happy","messageBody":"<div id=\"ygrps-yiv-1892026140\">Hello,<br/>\n<br/>\nLong-time lurker, don&#39;t think I&#39;ve posted here before.  I have two<br/>\ndaughters, ages 5 and 4, and my SAHM wife unschools them.  And we&#39;re both<br/>\nquite happy so far.<br/>\n<br/>\nSorry to come in so late on this, but I have a bit to throw in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So he doesnt want information from<br/>\n&gt; unschooling advocates nor does he want information from those who are<br/>\n&gt; totally opposed to it. He wants information from a neutral party.<br/>\n&gt;<br/>\n&gt; Is there such a thing?<br/>\n<br/>\n </span></blockquote>Short answer #1:  Finding out that kind of info is a huge undertaking.  By<br/>\ntrying to delegate such a huge task onto you, he may be hoping that you&#39;ll<br/>\njust drop it.  And unschooling altogether.  If he was like me, then he may<br/>\nbe scared of it, and is reacting out of his own fear rather than as a<br/>\ndeliberate plot to sabotage you.  Instead of a true debate tactic, it<br/>\nbecomes a defense mechanism.<br/>\n<br/>\nShort answer #2:  No, not in the way he wants.  Logistical nightmare.  What<br/>\nhe&#39;s asking for is a research study.  For details, see below.  (There might<br/>\nbe an acceptable alternative, which I&#39;ll mention at the end.)<br/>\n<br/>\nLong answer: What he wants he can&#39;t have, and it&#39;s unfair of him to demand<br/>\nthis of you.  The only way he&#39;s going to get that information is for someone<br/>\nto have done a long-term research study.  This study would have to identify<br/>\na large enough sampling of adults who were &quot;unschooled,&quot; and/or to identify<br/>\nchildren of various ages who are currently being unschooled (or some subset<br/>\nthereof) and follow them through to adulthood, whether or not they choose to<br/>\ngo through college.  This study must also be able to identify all the ratios<br/>\nand demographics he&#39;s wanting to know from the above population samples, a<br/>\ntask that is difficult by itself.  And there are myriad other<br/>\nconsiderations.<br/>\n<br/>\nIF you can find someone who has done this research, THEN you must find out<br/>\nWHO FINANCED the study.  As unschooling is gaining steam, there are many who<br/>\nreact violently against it.  The NEA, your local public school who (at least<br/>\nhere in Texas) gets money for each kid in a seat at the school, and many<br/>\nhomeschoolers who practice full-fledged school at home.  When someone has<br/>\nperformed a &quot;study,&quot; it does not mean that it is unbiased.  Research takes<br/>\nmoney.  Follow the money.<br/>\n<br/>\n&quot;Research&quot; merely means that (a) information was gathered according to an<br/>\nagreed-upon set of rules, and (b) the biases are more subtle and in a<br/>\nparticular form that may be difficult to identify.  Studies can be flawed.<br/>\nPerhaps the study&#39;s questions may be biased, or the population sample wasn&#39;t<br/>\nrandom enough, and many other things.  Unfortunately, when the word &quot;study&quot;<br/>\npops up next to an opinion, then that&#39;s good enough for many.  They feel<br/>\nthey can stop thinking and let it go, since someone else has done more<br/>\nthinking on it than they themselves were willing to put into it, AND it puts<br/>\nthe onerous on me to challenge the study (&quot;Well, back in &#39;04, this group did<br/>\nthis study where they found that blahblah-counter to your opinion and<br/>\nthey&#39;re smarter than you blahblahblah,...&quot;).<br/>\n<br/>\nPOSSIBLE ALTERNATIVE:<br/>\nBlogs.  There is one father I met at an unschooling conference who has his<br/>\nown blog.  His blog is about lots of stuff, but unschooling his kids is one<br/>\nof them.  He was initially skeptical, until he LIVED it, and his kids LIVED<br/>\nit.  Since Dads like to pretend to be the analytical ones (I know, I are one<br/>\n-- :-) ), he might be softened a bit if he reads another dad&#39;s account of<br/>\nbeing skeptical, his analyses, and finally becoming OK.  (If it&#39;s OK to post<br/>\nthe blog link here, I&#39;ll see if I can find it.)<br/>\n<br/>\nPOSSIBLE ALTERNATIVE #2 (not as good, IMHO):<br/>\nAND, if you&#39;re feeling ESPECIALLY generous with him, and IF you feel like<br/>\ndoing research, then do this (and I won&#39;t blame you if you say, &quot;Heck-fire,<br/>\nUncle Jed, YOU&#39;RE NUTS!&quot;): Find all the anti-unschooling information you can<br/>\nfind, and all the pro-unschooling info you can find.  Line them up in dialog<br/>\nform.  Maybe even do it up like Galileo&#39;s *Dialogue Concerning the Two Chief<br/>\nWorld Systems.  *Back and forth so he can see all the arguments, pro and<br/>\ncon.  BETTER YET, MAKE HIM GO AND FIND THIS OUT.  I&#39;m all for the &quot;Why<br/>\nshould I spoon feed you?&quot; attitude.*<br/>\n*<br/>\nBottom Line:  I believe no impartiality is to be found.  If he&#39;ll come off<br/>\nof that point, then you can assist HIM with HIS research.<br/>\n<br/>\n--Rob Saxon<br/>\nHusband to Seana for 10 years<br/>\nDaddy to Genevieve (5) and Elissa (4)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] This may seem like an odd request.","postDate":"1180815961","msgId":24159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1MzkwNC40OTYzNi5xbUB3ZWI1OTIwNi5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24112,"nextInTopic":24181,"prevInTime":24158,"nextInTime":24160,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"He wants the good, the bad and the ugly of unschooling. He also wants the information to be unbiased. So he doesnt want information from unschooling advocates","messageBody":"<div id=\"ygrps-yiv-116095068\">He wants the good, the bad and the ugly of unschooling. He also wants<br/>\nthe information to be unbiased. So he doesnt want information from<br/>\nunschooling advocates nor does he want information from those who are<br/>\ntotally opposed to it. He wants information from a neutral party.<br/>\n<br/>\n     OK, being new to unschooling, I could share my decision-making process.  There aren&#39;t many neutral parties because those who have any interest in the topic of education of any sort have strong opinions on how best to do it.  Neutral parties aren&#39;t interested enough to have opinions about it.  Still, a balanced assessment of any important life decision is a worthy goal.  So how to go about it?  When I was comparing  schooling at home with schooling at school, I discovered that I could only find people who felt that I was terrible to homeschool and people who thought I was terrible not to homeschool!<br/>\n  First I think we must look at our own family, and what we want for our family.  Is what we are doing now working?  If not what would we like to see change?  What societal trends feel right or wrong to us?   If there is a spouse, what is important to them?  Are our children happy, secure, and is there a sense of harmony in our lives and our home?<br/>\n   Well, those are only some of the questions I faced.  Since most material written about this is biased, get a cross-section of material.  Explore the early foundations of how children (really all people) learn.  Read the writings of reaserchers; to that end get names of authors.  Read internet web sites. Read books.  Talk to your kids.  Watch them.  <br/>\n    While carrying out this process, think, meditate, pray.  Explore your deep-seated biases, and very importantly, your fears.  Only thus can you prevent these issues from controlling your decision in ways you don&#39;t realize.  And very importantly, remeber that if you are exploring alternatives,you must see a reason for change.   Don&#39;t expect alternatives to be held up against a standard of perfection. The alternative should be better than what you are doing now, but probably cannot be perfect.  No parental choice can spare most of us from late-night soul searching, regrets, etc.<br/>\n     I could suggest readings that helped me decide homeschooling was for us, and later that unschooling was for us. Email me offlist if you want some of this info.  I do actually know of some stats about research on homeschooled kids in general, regardless of the type of homeschooling followed.  But remember that public and private schools are well known to have failed our society and our kids in many ways, and as one reply  said, be aware of those &#39;stats&#39; too!        <br/>\n    As another reply said, the person with concerns has got to be willing to read this stuff for it to have any value.  There is plenty of evidence that unschooling is consistent with reaserch-confirmed patterns of effective human learning. <br/>\n   I hope this makes sense. I know it&#39;s just my journey (and only a tiny part of it).  Maybe it doesn&#39;t fit for anyone else.  Hope it&#39;s not too long or rambling!  Cameron, a newbie still...for sure!   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  This may seem like an odd request.","postDate":"1180449384","msgId":24112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDUwMWM3YTFmZSRiYjk0ZTE1MCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":24079,"nextInTopic":24159,"prevInTime":24111,"nextInTime":24113,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"***how long has unschooling been around?*** ***Since humans have roamed the planet and before. Even Neaderthals learned!*** Yes, learning is so easy, even cave","messageBody":"<div id=\"ygrps-yiv-576432736\">***how long has unschooling been around?***<br/>\n<br/>\n***Since humans have roamed the planet and before. Even Neaderthals<br/>\nlearned!***<br/>\n<br/>\nYes, learning is so easy, even cave men did it. &lt;g&gt;<br/>\n<br/>\nShell beads found in Algeria and Israel have been dated to 100,000 years <br/>\nago, well before there were jewelry makings schools. &lt;g&gt;<br/>\nThe stunning Chauvet drawings were created  between 29,700 and  32,400 years <br/>\nago long before there were art schools. &lt;g&gt;<br/>\nSigns carved in tortoise shell, found in China were written down in the <br/>\nStone age or Neolithic age, predating the previous earliest writings by two <br/>\nthousand years, well before there were writing schools.&lt;g&gt;<br/>\n<br/>\nHEY!  This is fun!<br/>\n<br/>\nArcheologists have found pottery dating back 13,000 years, many, many years <br/>\nbefore there were pottery schools.<br/>\nThe first known sewing needle, found in France, is about 25,000 years old, <br/>\nsome considerable time before there were sewing schools.<br/>\nThere is some evidence that people had discovered a way to weave cloth and <br/>\nbaskets as early as 27,000 years ago, before there were weaving studios or, <br/>\nwell, looms. &lt;g&gt;<br/>\n<br/>\nThere seems to be no shortage of evidence that humans learn.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1180227875","msgId":24079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzYWxmMyt1MGVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOW4xdCtyMDRsQGVHcm91cHMuY29tPg=="},"prevInTopic":24071,"nextInTopic":24112,"prevInTime":24078,"nextInTime":24080,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"~~He sees connections being made everyday and when he comes home at night he hears about all the fun and cool things we did that day when the boys tell him","messageBody":"<div id=\"ygrps-yiv-387310136\">~~He sees connections being made everyday and when he comes home at<br/>\nnight he hears about all the fun and cool things we did that day when<br/>\nthe boys tell him about their day.~~<br/>\n<br/>\nThis is so important.<br/>\nFor anyone with a reluctant spouse, the above should be your assignment!<br/>\n<br/>\nI found that all the debating, discussing and pontificating did very<br/>\nlittle to convince my spouse of anything unschooling related years<br/>\nago. What worked best? LIVING it.<br/>\n<br/>\nAs we joyfully lived our lives and gushed to him about our wonderful<br/>\ndays, he slowly GOT IT. <br/>\n<br/>\nIf you have a reluctant spouse, try not to gripe about the kids or<br/>\nyour day. The more you focus on the happy parts, the better off you&#39;ll<br/>\nall be anyway. It doesn&#39;t mean you won&#39;t get tired, or frustrated or<br/>\nwhatever...but avoid telling about those feelings as though anyone<br/>\nelse is to blame. Talk about how beautiful, how smart, how interesting<br/>\nyour kids are...because they ARE. As YOU see the good stuff, as YOU<br/>\njoyfully learn with your children, the reluctant spouse will begin to<br/>\nwarm up.<br/>\n<br/>\nIt works! Really.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1180196733","msgId":24071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzOW4xdCtyMDRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4NDUzMWZjMDcwNTI1MDgzMnM2NjQ5YjE3aWNlMWUwYTBmNGJjMWUwMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":24058,"nextInTopic":24079,"prevInTime":24070,"nextInTime":24072,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... connections too. ... daily for ... the kids ... being ... the fun and ... This sort of connection can be soooo important to a partner who doesn t have the","messageBody":"<div id=\"ygrps-yiv-710748848\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Erica Iwamura&quot; <br/>\n&lt;hakujin777@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; All he asked was that I just tell him what<br/>\n&gt; we do during the day so that he can see and hear about the <br/>\n </span></blockquote>connections too.<br/>\n<blockquote><span title=\"ireply\"> &gt; I started a blog that he can look at and I update it just about <br/>\n </span></blockquote>daily for<br/>\n<blockquote><span title=\"ireply\"> &gt; him to see.  He sees lots of pictures on it of our day and he sees <br/>\n </span></blockquote>the kids<br/>\n<blockquote><span title=\"ireply\"> &gt; SHINE in the pics and the words that I write.  He sees connections <br/>\n </span></blockquote>being<br/>\n<blockquote><span title=\"ireply\"> &gt; made everyday and when he comes home at night he hears about all <br/>\n </span></blockquote>the fun and<br/>\n<blockquote><span title=\"ireply\"> &gt; cool things we did that day when the boys tell him about their day.<br/>\n<br/>\n </span></blockquote>This sort of connection can be soooo important to a partner who <br/>\ndoesn&#39;t have the chance to be home during the day. George is not <br/>\na &quot;reader&quot;, never really researched unschooling, so seeing <br/>\nunschooling happening has been really important for him in terms of <br/>\nunderstanding how it &quot;works&quot;. He&#39;s often home for lunch, though and <br/>\neven other times of the day if work is slow (he&#39;s self employed), so <br/>\nhe has an advantage a lot of partners don&#39;t in that regard. He <br/>\ndoens&#39;t need to go look at the blog to find out what the kids are up <br/>\nto ;) Its still a great tool for communicating with the <br/>\ngrandparents, though. They can talk to the kids w&#39;o falling back <br/>\non &quot;what are you learning about in homeschool?&quot;.<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1180114869","msgId":24058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzNzczbCtwcDlwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOTZEMDE0QzFFNzlFNC1GMTAtRTNCQFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":24057,"nextInTopic":24071,"prevInTime":24057,"nextInTime":24059,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... Yeah, I know  But I couldn t resist - we love the Sushi for Dummies book ... and the fact that it even exists! --Deb","messageBody":"<div id=\"ygrps-yiv-669725175\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Right---but you DID NOT go to the local French restaurant and ask <br/>\n&gt;the &gt; chef there (who hates sushi) how to make it! &lt;BWG&gt;<br/>\n&gt;<br/>\n </span></blockquote>Yeah, I know &lt;BWG&gt; But I couldn&#39;t resist - we love the Sushi for <br/>\nDummies book ... and the fact that it even exists!<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: This may seem like an odd request.","postDate":"1180110696","msgId":24057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTZEMDE0QzFFNzlFNC1GMTAtRTNCQFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGYzNnV0dStvbXQwQGVHcm91cHMuY29tPg=="},"prevInTopic":24056,"nextInTopic":24058,"prevInTime":24056,"nextInTime":24058,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... From: Deb  Or, you could get the Sushi for Dummies book like we did :-) Of course, that was AFTER we fell in love with sushi","messageBody":"<div id=\"ygrps-yiv-1048971945\">-----Original Message-----<br/>\nFrom: Deb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debra.rossing@...\">debra.rossing@...</a>&gt;<br/>\n<br/>\nOr, you could get the Sushi for Dummies book like we did :-) Of<br/>\ncourse, that was AFTER we fell in love with sushi at a local<br/>\nrestaurant and sat at the sushi bar (instead of the tables) so we<br/>\ncould watch the chefs at work.<br/>\n<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nRight---but you DID NOT go to the local French restaurant and ask the <br/>\nchef there (who hates sushi) how to make it! &lt;BWG&gt;<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":198231842,"authorName":"Erica Iwamura","from":"&quot;Erica Iwamura&quot; &lt;hakujin777@...&gt;","profile":"hakujin777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: This may seem like an odd request.","postDate":"1180107159","msgId":24056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4NDUzMWZjMDcwNTI1MDgzMnM2NjQ5YjE3aWNlMWUwYTBmNGJjMWUwMDFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDhDOTZDRTlGNjlCMTM0RC1GMTAtNjgzQFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PGYzNGMycisyaXJtQGVHcm91cHMuY29tPgkgPDhDOTZDRTlGNjlCMTM0RC1GMTAtNjgzQFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":24053,"nextInTopic":24057,"prevInTime":24055,"nextInTime":24057,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"He should know that you would do nothing to endanger or hinder your own children s learning This is a very important point that Kelly made.  We have been","messageBody":"<div id=\"ygrps-yiv-1885600309\">He should know that you would do nothing to endanger or hinder your own<br/>\nchildren&#39;s learning<br/>\n<br/>\nThis is a very important point that Kelly made.  We have been unschooling<br/>\nfor only a couple months.  I honestly just started reading websites and<br/>\nreading books on unschooling.  Dh saw me reading them and never said<br/>\nanything.  He just observed (he&#39;s also an engineer so he is also the<br/>\ndetailed analytical kind of guy).  I never said &quot;hey, we&#39;re unschooling<br/>\nnow&quot;.  He just saw me reading (LOTS) and absorbing all I could about it.<br/>\nHe asked me one day a couple weeks ago.. &quot;so, are you unschooling the boys<br/>\nnow?&quot; to which I replied &quot;ummm, yeah&quot; and he tells me that he has been<br/>\nreading about it and that &quot;it seems like a pretty good thing as long as you<br/>\nstay on top of it&quot; (meaning strewing and leading a rich life.. not benign<br/>\nneglect that I have read about where people don&#39;t interact with their kids<br/>\nat all and call it unschooling).  All he asked was that I just tell him what<br/>\nwe do during the day so that he can see and hear about the connections too.<br/>\nI started a blog that he can look at and I update it just about daily for<br/>\nhim to see.  He sees lots of pictures on it of our day and he sees the kids<br/>\nSHINE in the pics and the words that I write.  He sees connections being<br/>\nmade everyday and when he comes home at night he hears about all the fun and<br/>\ncool things we did that day when the boys tell him about their day.  He<br/>\ndoesn&#39;t come home to kids who have been sitting at a table doing math and<br/>\nphonics during the day and have lost their love of learning already at this<br/>\nyoung age.  He comes home to children who are excited about learning and<br/>\nlife and that ask lots of questions.<br/>\n<br/>\nI guess my point is that he saw that I was passionate about it and he took<br/>\nit upon himself to learn more about it and to want to learn about what I was<br/>\nso interested in and to CONNECT with me in that way.  He knows how much I<br/>\nlove the boys and that I want the best for them and that if I believe SO<br/>\nMUCH that this is best for them, then there must be something to it.<br/>\n<br/>\nErica<br/>\n<br/>\n<br/>\n-- <br/>\nThey say I&#39;m Crazy but I Have a Good Time - Joe Walsh<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1180106494","msgId":24053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzNnV0dStvbXQwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOTZDRTE0REVFOUQ3OS1GMTAtNDAxQFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":24052,"nextInTopic":24056,"prevInTime":24052,"nextInTime":24054,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... Or, you could get the Sushi for Dummies book like we did :-) Of course, that was AFTER we fell in love with sushi at a local restaurant and sat at the","messageBody":"<div id=\"ygrps-yiv-420252627\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you wanted information on making sushi, would&#39;t the best place <br/>\n&gt;to go <br/>\n&gt; for information BE to people who make sushi?<br/>\n&gt;<br/>\n </span></blockquote>Or, you could get the Sushi for Dummies book like we did :-) Of <br/>\ncourse, that was AFTER we fell in love with sushi at a local <br/>\nrestaurant and sat at the sushi bar (instead of the tables) so we <br/>\ncould watch the chefs at work.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: This may seem like an odd request.","postDate":"1180100674","msgId":24052,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTZDRTlGNjlCMTM0RC1GMTAtNjgzQFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGYzNGMycisyaXJtQGVHcm91cHMuY29tPg=="},"prevInTopic":24049,"nextInTopic":24053,"prevInTime":24051,"nextInTime":24053,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... From: kel9769  My big problem is her dad s attitude toward her education.  He was not a part of her life at all until about a year ago.","messageBody":"<div id=\"ygrps-yiv-270916323\">-----Original Message-----<br/>\nFrom: kel9769 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kel9769@...\">kel9769@...</a>&gt;<br/>\n<br/>\n My big problem is her dad&#39;s attitude toward her<br/>\neducation.  He was not a part of her life at all until about a year<br/>\nago.  He has been living 1,200 miles away and knows I took her out<br/>\nof school but doesnt understand about unschooling at all.  He is<br/>\nmoving to be closer to us next Friday.  We do plan on living<br/>\ntogether by the fall and getting married in a year or so.  Exciting<br/>\nstuff but big changes.  I have been avioding talking about school<br/>\nwith him before he gets here but we did end up talking about a few<br/>\ndays ago and argued.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nSo hes&#39; trusted you up to this point, but is now (when she&#39;s happy and <br/>\ndoing well) arguing with you?<br/>\n<br/>\n=-=-=-=-<br/>\n<br/>\n I know were he is coming from is based on<br/>\nconcern for her and fear for her future.  He wants her to have an<br/>\neducation and &quot;not be like him&quot;.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nShe&#39;s not---she&#39;s learning and making an effort to learn more. Is he?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n He is so worried about her ability<br/>\nto be successful in college, work, and &quot;the real world&quot;.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nShe&#39;s IN the real world NOW.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nHe just can&#39;t see that school is not the real world that she is living <br/>\nin<br/>\nthe real world now.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWould HE like to come here and debate with us too? &lt;BWG&gt;<br/>\n<br/>\nSCHOOL is the real world? Since when? Can he give us an example???<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI don&#39;t know if I am ever going to be able to<br/>\nconvince him.  At this point my daughter and I are both willing to<br/>\ncompromise and do some &quot;school work&quot; to keep him comfortable.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nIt&#39;s nice that you&#39;re willing to go outsid eyour comfort zone for him. <br/>\nIs he not willing to do that for you?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWe are both sad about it though.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI think that&#39;s the clincher. Does he not care?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I am not used to having to compromise<br/>\nwhen it comes to parenting stuff.  I&#39;ve always done what I want and<br/>\nit&#39;s hard for me to have to take someone else&#39;s comfort level into<br/>\nconsideration.  To be honest I don&#39;t really like it.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAn absent father shouldn&#39;t have much say. I realize he&#39;s about to be <br/>\n&quot;present&quot;---but he needs to trust you as he has her whole life up to <br/>\nthis point. I&#39;m not sure how much he can complain---seriously! Is he <br/>\nunhappy how she&#39;s turned out? Have you done  a bad job? He can&#39;t trust <br/>\nyou to make wise decisions concerning your daughter???<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI like him though and he is actually her father so I guess I&#39;ll have to <br/>\nfigure<br/>\nit out.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nIs he willing to learn more? Or has he shut down to learning new <br/>\nthings? If he *has* shut down, maybe that&#39;s something to point out to <br/>\nhim. *I* wouldn&#39;t want my children refusing to learn something that was <br/>\nso important to *their* children&#39;s lives.<br/>\n<br/>\nWhen people refuse to do the research on unschooling, it simply proves <br/>\nmy point: they&#39;ve quit learning---and that is one of the HUGE things <br/>\nI&#39;m trying to avoid through unschooling! I want my kids to always love <br/>\nto learn!<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: This may seem like an odd request.","postDate":"1180098685","msgId":24049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTZDRTU1NTAzRTVDNi1GMTAtNTI4QFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGYzMnVuYis1czIwQGVHcm91cHMuY29tPg=="},"prevInTopic":24048,"nextInTopic":24052,"prevInTime":24048,"nextInTime":24050,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... From: jnaisi  Some of the questions he had were: how long has unschooling been around? -=-=-=-=- Since humans have roamed the","messageBody":"<div id=\"ygrps-yiv-158931605\">-----Original Message-----<br/>\nFrom: jnaisi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robyn.bentley@...\">robyn.bentley@...</a>&gt;<br/>\n<br/>\n<br/>\nSome of the questions he had were:<br/>\n<br/>\nhow long has unschooling been around?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSince humans have roamed the planet and before. Even Neaderthals <br/>\nlearned!<br/>\n<br/>\nCompulsory schooling, on the other hand, has only been around just over <br/>\n100 years. Failed, pathetic &quot;experiment.&quot;<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nwhat is the ratio of unschoolers who attend college and complete it?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n*RATIO*????<br/>\n<br/>\nCan he give me the &quot;ratio&quot; of schooled kids who attend college and <br/>\ncomplete it?<br/>\n<br/>\nNo stats. But we personally know of many.<br/>\n<br/>\nHere are some names *he* could google:<br/>\n<br/>\nRoya Sorooshian<br/>\nLaurie Chauncey<br/>\nAiden Carey<br/>\nCassidy Vare<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nwhat is the socioeconomic something or other LOL?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nMeaning where are we, as a whole, socio-ecomonically? All over the <br/>\nboard.<br/>\n<br/>\nKeeping in mind that most of us are living on one income by choice.  <br/>\nOne of us has chosen to stay home and BE with our kids, so our incomes <br/>\nare probably lower than the national average. I&#39;d say the intelligence <br/>\nlevel is much higher though. &lt;g&gt;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nHe wants statistics I guess.  He is a very detail oriented person and<br/>\nwants more information then what I have been able to provide to him.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nThere are no realiable stats on unschoolers or homeschoolers. That&#39;s <br/>\nsomething we all need to get over.<br/>\n<br/>\n-=-=-=--=<br/>\n<br/>\nI want him to do the research and find the answers he is searching for<br/>\nbecause I am not 100% sure what he wants to know.<br/>\n<br/>\nHe wants me to do the research so I can make an informed choice and<br/>\nexplain it to him and be able to answer all his questions.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI&#39;ll have a GOOD time with *this* one! &lt;G&gt;<br/>\n<br/>\nSo---what he wants is for *you* (the teacher) to do all the work, <br/>\ndevising a curriculum for *him* (the ignorant student who must be <br/>\nspoon-fed all his information)?<br/>\n<br/>\nThat&#39;s exactly what we&#39;re trying to *avoid* with our kids!<br/>\n<br/>\nUnlike schooled kids (and adults!) who want everything handed to them <br/>\non a platter, *our* kids will go *after* what they want to learn. They <br/>\nare curious, intelligent, eager learners. They are fascinated by life <br/>\nand the world. They&#39;re eager to learn new things. They&#39;re interested <br/>\nand interesting. They don&#39;t rely on others to spoon-feed them things <br/>\nthat they could find out for themselves. They don&#39;t believe everything <br/>\nthey hear---they question it; they research it; they look inside it and <br/>\ntinker with it. THEY do that!<br/>\n<br/>\nThey don&#39;t make someone *else* do their &quot;homework.&quot;<br/>\n<br/>\nPlus---he&#39;s already told you that you weren&#39;t informed. At what point <br/>\nwill he consider you informed?<br/>\n<br/>\nUnschooling takes time to absorb. It takes DOing it and THINKing on it <br/>\nand APPLYing it and SEEing it in action---in your own and in others&#39; <br/>\nkids. It&#39;s really not an overnight revelation----well, one day it IS, <br/>\nbut that&#39;s after months and months of working on it internally. One day <br/>\nyou wake up and go: DAMN! That makes sense! It WORKS! Of COURSE!<br/>\n<br/>\nUnshcooling is so foreign to how we were raised that it takes deep <br/>\nthought and searching to understand and internalize.<br/>\n<br/>\nOnce you *do*....well, there&#39;s no going back.<br/>\n<br/>\nHe needs to do his *own* research OR trust that you&#39;re doing what you <br/>\nknow is best. He should know that you would do nothing to endanger or <br/>\nhinder your own children&#39;s learning. Or does he not trust you either?<br/>\n<br/>\nWe can recommend books and websites (Joyce&#39;s should be just what he&#39;s <br/>\nlooking for!), magazines, articles, and essays. But he&#39;ll need to do <br/>\nthe work to convince himself.<br/>\n<br/>\nHe&#39;s certainly welcome to come on here and debate us---but warn him: <br/>\nwe&#39;re pretty good at this! &lt;BWEG&gt;<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] This may seem like an odd request.","postDate":"1180096955","msgId":24048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTZDRTE0REVFOUQ3OS1GMTAtNDAxQFdFQk1BSUwtREYwMi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg==","referencesHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24035,"nextInTopic":24049,"prevInTime":24047,"nextInTime":24049,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... From: jnaisi  He wants the good, the bad and the ugly of unschooling.  He also wants the information to be unbiased.  So he doesnt","messageBody":"<div id=\"ygrps-yiv-1704958647\">-----Original Message-----<br/>\nFrom: jnaisi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robyn.bentley@...\">robyn.bentley@...</a>&gt;<br/>\n<br/>\nHe wants the good, the bad and the ugly of unschooling.  He also wants<br/>\nthe information to be unbiased.  So he doesnt want information from<br/>\nunschooling advocates nor does he want information from those who are<br/>\ntotally opposed to it.  He wants information from a neutral party.<br/>\n<br/>\nIs there such a thing?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNope. It&#39;s really one or the other. Folks either think we&#39;re brilliant <br/>\nor nuts. No in-between.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nWe ended up in a fight over it because I dont know where to get that<br/>\ninformation and felt frustrated with him that he didnt trust me enough<br/>\nto stand by me.  He feels my choice to do this isnt an informed one.<br/>\nSince I got all my information from unschooling families.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd where does he expect to get it?<br/>\n<br/>\nIf you wanted information on building an ant farm, would&#39;t the best <br/>\nplace to go for information BE to people who build ant farms?<br/>\n<br/>\nIf you wanted information on building an airplane, would&#39;t the best <br/>\nplace to go for information BE to people who build airplanes?<br/>\n<br/>\nIf you wanted information on making sushi, would&#39;t the best place to go <br/>\nfor information BE to people who make sushi?<br/>\n<br/>\nIf you wanted information on planting a tree, would&#39;t the best place to <br/>\ngo for information BE to people who plant trees?<br/>\n<br/>\nThat&#39;s really silly thinking.<br/>\n<br/>\nHe can get PLENTY of anti-unschooling stuff from the NEA---folks who <br/>\nlike to take your money (and mine!) to teach your children.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI told him to talk to Kelly or her husband.  Maybe I should plan a<br/>\ntrip down to Columbia one day LOL.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nWe&#39;re here.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: This may seem like an odd request.","postDate":"1180036187","msgId":24035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1OTAwNi43NzE3NC5xbUB3ZWI1OTIwOC5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24031,"nextInTopic":24048,"prevInTime":24034,"nextInTime":24036,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"I would take this all very seriously. You are so kind to accept his concerns about your ds future.  But are you and she getting the same consideration?  Is he","messageBody":"<div id=\"ygrps-yiv-563528805\">I would take this all very seriously. You are so kind to accept his concerns about your ds&#39; future.  But are you and she getting the same consideration?  Is he hearing you and your dd?  Are your thoughts and feelings and experience being trusted and respected? If not at this point I&#39;d wonder if they ever will be.   Sorry, but this is a time to be very careful.  Why be fake with him and do something you do not believe is necessary or right?  Where will that end?  How is this part of the joy?  I would think that he would want to respect what has been working for her and read up on it, and maybe live near you and get to really know her and her strengths.  Will he read books and websites about unschooling that you recommend?  Will he take time to see how your lives work?  If not I would really be careful!  Whew!  Sorry, but I feel concerned for you. Cameron<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":80776775,"authorName":"kel9769","from":"&quot;kel9769&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1180021659","msgId":24031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzNGMycisyaXJtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24025,"nextInTopic":24035,"prevInTime":24030,"nextInTime":24032,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... that ... enough ... Robyn I m so glad you brought up this topic because I can really use the input myself.  I have been unschooling my daughter since","messageBody":"<div id=\"ygrps-yiv-202605619\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; We ended up in a fight over it because I dont know where to get <br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; information and felt frustrated with him that he didnt trust me <br/>\n </span></blockquote>enough<br/>\n<blockquote><span title=\"ireply\"> &gt; to stand by me.  <br/>\n<br/>\n </span></blockquote>Robyn<br/>\nI&#39;m so glad you brought up this topic because I can really use the <br/>\ninput myself.  I have been unschooling my daughter since February <br/>\nand I am really happy overall with the changes I see in her.  She is <br/>\nso much happier, healther and more confident.  We are currently <br/>\nexploring her auditing a college class in the fall (she&#39;s 14).   She <br/>\nwants to go to college and plans to start taking her core level <br/>\nclasses for credit when she is 16 and then maybe go away for school <br/>\nwhen she is 18.  My big problem is her dad&#39;s attitude toward her <br/>\neducation.  He was not a part of her life at all until about a year <br/>\nago.  He has been living 1,200 miles away and knows I took her out <br/>\nof school but doesnt understand about unschooling at all.  He is <br/>\nmoving to be closer to us next Friday.  We do plan on living <br/>\ntogether by the fall and getting married in a year or so.  Exciting <br/>\nstuff but big changes.  I have been avioding talking about school <br/>\nwith him before he gets here but we did end up talking about a few <br/>\ndays ago and argued.  I know were he is coming from is based on <br/>\nconcern for her and fear for her future.  He wants her to have an <br/>\neducation and &quot;not be like him&quot;.  He is so worried about her ability <br/>\nto be successful in college, work, and &quot;the real world&quot;.  He just <br/>\ncan&#39;t see that school is not the real world that she is living in <br/>\nthe real world now.  I don&#39;t know if I am ever going to be able to <br/>\nconvince him.  At this point my daughter and I are both willing to <br/>\ncompromise and do some &quot;school work&quot; to keep him comfortable.  We <br/>\nare both sad about it though.  I am not used to having to compromise <br/>\nwhen it comes to parenting stuff.  I&#39;ve always done what I want and <br/>\nit&#39;s hard for me to have to take someone else&#39;s comfort level into <br/>\nconsideration.  To be honest I don&#39;t really like it.  I like him <br/>\nthough and he is actually her father so I guess I&#39;ll have to figure <br/>\nit out.  <br/>\n<br/>\nI am really appreciating the feedback from everyone.  It is helping <br/>\nme a lot.<br/>\n<br/>\nKelly from MA</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] This may seem like an odd request.","postDate":"1180018596","msgId":24025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NzY0Ny4yODI2LnFtQHdlYjUzODA3Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24022,"nextInTopic":24031,"prevInTime":24024,"nextInTime":24026,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"I d consider it worth the trip to Columbia to talk to Ben Lovejoy about unschooling -- and for the chance to meet Cameron & Duncan, too.  I don t know how","messageBody":"<div id=\"ygrps-yiv-1633985964\">I&#39;d consider it worth the trip to Columbia to talk to Ben Lovejoy about unschooling -- and for the chance to meet Cameron & Duncan, too.  I don&#39;t know how anyone could spend an afternoon with the Lovejoy guys and not be totally sold on radical unschooling.<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n       Fussy? Opinionated? Impossible to please? Perfect.  Join Yahoo!&#39;s user panel and lay it on us.<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.rd.yahoo.com/evt=48516/*http://surveylink.yahoo.com/gmrs/yahoo_panel_invite.asp?a=7\">http://us.rd.yahoo.com/evt=48516/*http://surveylink.yahoo.com/gmrs/yahoo_panel_invite.asp?a=7</a> hot CTA = Join Yahoo!&#39;s user panel<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: This may seem like an odd request.","postDate":"1180010754","msgId":24022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzNzk2QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":24019,"nextInTopic":24025,"prevInTime":24021,"nextInTime":24023,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"How long has unschooling been around? Depends on how you mean - Ben Franklin was basically unschooled (he learned what interested him when it interested him","messageBody":"<div id=\"ygrps-yiv-933745912\">How long has unschooling been around? Depends on how you mean - Ben<br/>\nFranklin was basically unschooled (he learned what interested him when<br/>\nit interested him and how it interested him and moved on when he wanted<br/>\nto move on). The compulsory education system didn&#39;t exist until<br/>\nindustrialization - mid 1800s roughly. Prior to that, some folks had the<br/>\none room schoolhouse, others had Mom or Dad teaching them the 3 Rs, and<br/>\nothers learned as they went. Modern schooling is the newcomer. As a<br/>\n&quot;modern movement&quot; I suppose it was around somewhere in the 60s but<br/>\nprobably not by the name &quot;unschooling&quot; - there were lots of<br/>\n&quot;alternative&quot; schooling movements going on then. Somewhere in the 70s<br/>\nand 80s is when &quot;homeschooling&quot; in general got going as a modern<br/>\ndevelopment. People like John Holt (among others) started observing and<br/>\nwriting about, speaking about, the need for change in the public school<br/>\nsystem. So, it&#39;s been around in the current &quot;form&quot; some 20 or 30 years.<br/>\n <br/>\nDemographically, it&#39;s pretty much spread out across the board - single<br/>\nparent families, two parent families, grandparents with custody of<br/>\ngrandkids, adoptive parents, one income, two incomes, food stamps to<br/>\nsmall farms to city dwellers to upper middle class, families with young<br/>\nkids, with teens, with one child or a dozen, stay home moms, stay home<br/>\ndads, home based business entrepreneurs, physicians, and all sorts of<br/>\nother things. Unschooling looks basically like any community of people.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: This may seem like an odd request.","postDate":"1180002057","msgId":24019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzMTE0NDA3LTQzN0ItNDAzOC1BQTY1LTQ5NjdBNzQ1NEZDQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGYzMnVuYis1czIwQGVHcm91cHMuY29tPg==","referencesHeader":"PGYzMnVuYis1czIwQGVHcm91cHMuY29tPg=="},"prevInTopic":24017,"nextInTopic":24022,"prevInTime":24018,"nextInTime":24020,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"... Since  the beginning of time. People (probably every creature) naturally learn by exploring the world, by ordering the world they encounter in ways that","messageBody":"<div id=\"ygrps-yiv-1417837955\">On May 23, 2007, at 10:53 PM, jnaisi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how long has unschooling been around?<br/>\n<br/>\n </span></blockquote>Since  the beginning of time. People (probably every creature)  <br/>\nnaturally learn by exploring the world, by ordering the world they  <br/>\nencounter in ways that are personally meaningful to them.<br/>\n<br/>\nJohn Holt was the first to really observe it and write about it. He  <br/>\ndid so in order to try to change schools to make them better places  <br/>\nto learn. You can see the progress in his thinking on that matter if  <br/>\nyou read his books in order. He eventually concluded that schools  <br/>\ncouldn&#39;t be fixed. School actually interfered in the process of   <br/>\nlearning. (Which is why we get the idea that learning is hard.  <br/>\nLearning *is* hard when people are in an environment that is counter  <br/>\nto the way we naturally learn.)<br/>\n<br/>\nAs an engineer (in my former life) unschooling rubs me the wrong way.  <br/>\nI like neat orderly learning. I like it all laid out for me in order  <br/>\nwith a clear beginning and end all tied up in a package that feels  <br/>\ncomplete.<br/>\n<br/>\nBut the artist/writer in me (honestly the two natures inside me have  <br/>\nfights ;-) has been allowed to see that true, profound learning  <br/>\ndoesn&#39;t come from absorbing facts. It comes from making connections  <br/>\nbetween seemingly disparate bits that have been experienced in context.<br/>\n<br/>\nI&#39;ve dabbled a bit at Japanese history and it&#39;s given me insights  <br/>\ninto how kids have American and European history presented to them.  <br/>\nEven history that&#39;s well written (which textbooks often aren&#39;t), if  <br/>\nyou don&#39;t have interesting connections already inside your head to  <br/>\nwho the people and places and times were, it reads like &quot;Abc attacked  <br/>\nXyz in 1178 in order to gain access to Pqr.&quot; It&#39;s just strings of  <br/>\nthis happened and that happened because this other thing happened.<br/>\n<br/>\nI&#39;ve also been reading manga and watching anime (Japanese comics and  <br/>\ncartoons) and references to the various times and people pop up.  <br/>\n*Slowly* (since I&#39;m not immersed in the culture as a Japanese person  <br/>\nwould be) I&#39;m building up interesting connections to the important  <br/>\npeople and places. That&#39;s making them interesting. It&#39;s making them  <br/>\nthings I&#39;d like to know more (real) stuff about.<br/>\n<br/>\nThe first is school learning. It needs to be repeated over and over  <br/>\nuntil &quot;Abc attacked Xyz in 1178 in order to gain access to Pqr,&quot; is  <br/>\netched in the brain because it&#39;s meaningless without a meaningful  <br/>\ncontext. It&#39;s hearing &quot;O-hayo&quot; = good morning over and over and over.  <br/>\nAnd when there are several textbooks full of stuff that schools  <br/>\nexpect to pour into kids, it&#39;s not surprising that it takes 12 years  <br/>\nto do.<br/>\n<br/>\nThe second is the way we naturally learn. We absorb interesting  <br/>\nfacts. We make connections to interesting facts. In school Columbus  <br/>\nand Henry VIII and Shakespeare weren&#39;t even in the same classes. But  <br/>\nby learning about them naturally I know that Columbus got money from  <br/>\nthe parents of one of Henry VIII&#39;s wives. And Elizabeth, the underdog  <br/>\nfor the rulership of England, was a sponsor of Shakespeare. And  <br/>\ngunpowder came to Europe about the time of Columbus. There&#39;s also a  <br/>\nclock in St. Mark&#39;s square that has been running since *before*  <br/>\nColumbus discovered America. And there are 1000&#39;s of pigeons in St.  <br/>\nMark&#39;s Square. If you hold a cone of corn (that vendors sell) out  <br/>\nthey&#39;ll swoop down and cluster on your arm. (Which makes movies that  <br/>\nhave a scene in St. Mark&#39;s Square a lot more personally meaningful  <br/>\nfor me.) There are also dead rats that float in the canals and they  <br/>\nsmell really bad in July. There are also hundreds of cats living in  <br/>\nthe Coliseum in Rome that nearby residents feed (at least there were  <br/>\nback in 1968).<br/>\n<br/>\nNone of that is meaningful for a test. But it *is* meaningful for  <br/>\nlearning more in real life. The interesting connections make more  <br/>\ninformation interesting.<br/>\n<br/>\nHow often have kids asked, &quot;Is this going to be on the test? Do I  <br/>\nhave to learn this?&quot; (And how long do they retain it afterwards.) But  <br/>\nwhen there is no test, when there is no force, it&#39;s all potentially  <br/>\ninteresting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what is the ratio of unschoolers who attend college and complete it?<br/>\n<br/>\n </span></blockquote>I don&#39;t know. There aren&#39;t statistics. Which more than one husband  <br/>\nhas asked for!<br/>\n<br/>\nAn unschooling girl who lives near me is currently attending Harvard.  <br/>\nThe Ivy Leagues *love* unschoolers because unschoolers have actually  <br/>\nlived life and explored what fascinates them and are raring to know  <br/>\nmore rather than having spent 12 years absorbing textbooks to get  <br/>\ngreat grades.<br/>\n<br/>\nWhat&#39;s the ratio of schooled kids who attend college and complete it?  <br/>\nThe funny thing is that when kids do well in school, school is given  <br/>\ncredit with some going to the student for working hard. When kids  <br/>\ndon&#39;t do well, it&#39;s seen as the student&#39;s fault. From 12 years of  <br/>\ndoing and reading and writing about unschooling, I know it&#39;s not true  <br/>\nand not that simple.<br/>\n<br/>\nI think the most important idea is that unschooling doesn&#39;t interfere  <br/>\nwith college. A child who desires to go to college can do just fine.  <br/>\nIn fact better because they haven&#39;t had 12 previous years of boring  <br/>\ntextbook work. To them it&#39;s all new and different and interesting.<br/>\n<br/>\nMy daughter decided to take the college statistics class her father  <br/>\nteaches at 13. She is *not* a math whiz. I don&#39;t mean she&#39;s bad but  <br/>\nshe&#39;s never done much math other than video games, calculating the  <br/>\ntip at a restaurant, figuring out if she can afford something. She  <br/>\nnever was drawn to math puzzles. But she thought taking the class  <br/>\nwould be fun. And -- though learning is the point of unschooling, not  <br/>\ngrades -- her test scores were always among the top 5 out of 60  <br/>\nstudents. She&#39;s taken 3 more class since then (college algebra,  <br/>\nprecalculus and one other I can&#39;t remember), one not taught by her  <br/>\nfather, with the same top scoring results. (She&#39;s also gained great  <br/>\ninsights into the difference between learning for a test and learning  <br/>\nfrom living.)<br/>\n<br/>\nIt&#39;s *fun* for her. College statistics at 13 isn&#39;t typical for  <br/>\nunschoolers ;-) But taking community college classes for fun is  <br/>\nsomething a lot of unschoolers do. Despite the feeling that kids need  <br/>\ntrained to do book work, and the feeling that a lifetime of freedom  <br/>\nto drop whatever isn&#39;t interesting anymore won&#39;t allow them to sit  <br/>\nthrough a class that isn&#39;t whiz bang like cartoons ;-), it just  <br/>\ndoesn&#39;t hold true in real life. It&#39;s much better to *not* spend 12  <br/>\nyears absorbing the idea that learning is hard and boring It&#39;s much  <br/>\nbetter to *not* take 12 years of classes that don&#39;t interest someone  <br/>\n&quot;just in case&quot; they might need the information.<br/>\n<br/>\nIt&#39;s much better to acquire the information when people need it. One  <br/>\nunschooling girl spent 3 months learning the math she needed for  <br/>\ncollege after having absorbed math from living life. If she can do it  <br/>\nin 6 months, what&#39;s the purpose of the other 11.75 years?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what is the socioeconomic something or other LOL?<br/>\n<br/>\n </span></blockquote>Of those who home/unschool? All across the board. Probably mostly  <br/>\nmiddle class but there was a discussion recently (probably on Sandra  <br/>\nDodd&#39;s list) started by a guy who wanted to provide programs to help  <br/>\ndisadvantaged people unschool. Several people piped up who said they  <br/>\nwere below poverty level (basically to say they were a lot more  <br/>\ncapable than he was giving them credit for.)<br/>\n<br/>\nObviously the people on line discussing it will be skewed towards  <br/>\nthose who have regular access to the internet.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want him to do the research and find the answers he is searching for<br/>\n&gt; because I am not 100% sure what he wants to know.<br/>\n<br/>\n </span></blockquote>If he will read, or you want to print some stuff for him, my website  <br/>\ntends to appeal to guys since it was written by an engineer: neat and  <br/>\norderly and logical. ;-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1179987722","msgId":24017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzM2F1YStzc2ZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24016,"nextInTopic":24019,"prevInTime":24016,"nextInTime":24018,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"Perhaps you could start by trying it for, say, a year.  Do you think your husband might agree to that?  Your son is only 11, and it sounds like he s had a","messageBody":"<div id=\"ygrps-yiv-2079513723\">Perhaps you could start by trying it for, say, a year.  Do you think <br/>\nyour husband might agree to that?  Your son is only 11, and it <br/>\nsounds like he&#39;s had a really really rough time.  He&#39;s not going to <br/>\ncollege or getting a job soon.  <br/>\n<br/>\nIf you could take a year to focus on what brings your son joy, <br/>\nwouldn&#39;t that be wonderful?  If he likes legos, buy him some new <br/>\nones just for a surprise.  Get him the Klutz book of paper <br/>\nairplanes.  Stay home and watch movies and RELAX.  Give him the <br/>\nchance to be himself again with no teasing, no painful writing, no <br/>\npressure, and definitely no talk about if you don&#39;t do such and <br/>\nsuch, you&#39;re going back to school.  See what happens.  How could <br/>\nthings not improve?<br/>\n<br/>\n-Christy M.<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jnaisi&quot; <br/>\n&lt;robyn.bentley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I tried discussing my decision to unschool the kids tonight.  It <br/>\n </span></blockquote>did<br/>\n<blockquote><span title=\"ireply\"> &gt; not go well at all.  He supported me in my decision to try an<br/>\n&gt; alternate form of education for the kids.  However he wants more<br/>\n&gt; information then one sided information.  I guess that is the right <br/>\n </span></blockquote>way<br/>\n<blockquote><span title=\"ireply\"> &gt; to put it.<br/>\n&gt; <br/>\n&gt; I explained all the wonderful things I have read about the kids on<br/>\n&gt; here and how hopeful I was for our own kids.<br/>\n&gt; <br/>\n&gt; He wants the good, the bad and the ugly of unschooling.  He also <br/>\n </span></blockquote>wants<br/>\n<blockquote><span title=\"ireply\"> &gt; the information to be unbiased.  So he doesnt want information from<br/>\n&gt; unschooling advocates nor does he want information from those who <br/>\n </span></blockquote>are<br/>\n<blockquote><span title=\"ireply\"> &gt; totally opposed to it.  He wants information from a neutral party.<br/>\n&gt; <br/>\n&gt; Is there such a thing?<br/>\n&gt; <br/>\n&gt; Where can I hear about the good, the bad and the ugly sides of<br/>\n&gt; unschooling?<br/>\n&gt; <br/>\n&gt; We ended up in a fight over it because I dont know where to get <br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; information and felt frustrated with him that he didnt trust me <br/>\n </span></blockquote>enough<br/>\n<blockquote><span title=\"ireply\"> &gt; to stand by me.  He feels my choice to do this isnt an informed <br/>\n </span></blockquote>one. <br/>\n<blockquote><span title=\"qreply\"> &gt; Since I got all my information from unschooling families.<br/>\n&gt; <br/>\n&gt; He isnt against the idea as a whole but he wants all sides of it<br/>\n&gt; before agreeing it is best for his children.<br/>\n&gt; <br/>\n&gt; I told him to talk to Kelly or her husband.  Maybe I should plan a<br/>\n&gt; trip down to Columbia one day LOL.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":235453246,"authorName":"jnaisi","from":"&quot;jnaisi&quot; &lt;robyn.bentley@...&gt;","profile":"jnaisi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: This may seem like an odd request.","postDate":"1179975211","msgId":24016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMnVuYis1czIwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":24015,"nextInTopic":24017,"prevInTime":24015,"nextInTime":24017,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"Some of the questions he had were: how long has unschooling been around? what is the ratio of unschoolers who attend college and complete it? what is the","messageBody":"<div id=\"ygrps-yiv-2100283742\">Some of the questions he had were:<br/>\n<br/>\nhow long has unschooling been around?<br/>\n<br/>\nwhat is the ratio of unschoolers who attend college and complete it?<br/>\n<br/>\nwhat is the socioeconomic something or other LOL?<br/>\n<br/>\nHe wants statistics I guess.  He is a very detail oriented person and<br/>\nwants more information then what I have been able to provide to him.<br/>\n<br/>\nI want him to do the research and find the answers he is searching for<br/>\nbecause I am not 100% sure what he wants to know.<br/>\n<br/>\nHe wants me to do the research so I can make an informed choice and<br/>\nexplain it to him and be able to answer all his questions.</div>","specialLinks":[]},{"userId":235453246,"authorName":"jnaisi","from":"&quot;jnaisi&quot; &lt;robyn.bentley@...&gt;","profile":"jnaisi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"This may seem like an odd request.","postDate":"1179974360","msgId":24015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMnRzbys3b3M1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":24016,"prevInTime":24014,"nextInTime":24016,"topicId":24015,"numMessagesInTopic":0,"msgSnippet":"I tried discussing my decision to unschool the kids tonight.  It did not go well at all.  He supported me in my decision to try an alternate form of education","messageBody":"<div id=\"ygrps-yiv-552386722\">I tried discussing my decision to unschool the kids tonight.  It did<br/>\nnot go well at all.  He supported me in my decision to try an<br/>\nalternate form of education for the kids.  However he wants more<br/>\ninformation then one sided information.  I guess that is the right way<br/>\nto put it.<br/>\n<br/>\nI explained all the wonderful things I have read about the kids on<br/>\nhere and how hopeful I was for our own kids.<br/>\n<br/>\nHe wants the good, the bad and the ugly of unschooling.  He also wants<br/>\nthe information to be unbiased.  So he doesnt want information from<br/>\nunschooling advocates nor does he want information from those who are<br/>\ntotally opposed to it.  He wants information from a neutral party.<br/>\n<br/>\nIs there such a thing?<br/>\n<br/>\nWhere can I hear about the good, the bad and the ugly sides of<br/>\nunschooling?<br/>\n<br/>\nWe ended up in a fight over it because I dont know where to get that<br/>\ninformation and felt frustrated with him that he didnt trust me enough<br/>\nto stand by me.  He feels my choice to do this isnt an informed one. <br/>\nSince I got all my information from unschooling families.<br/>\n<br/>\nHe isnt against the idea as a whole but he wants all sides of it<br/>\nbefore agreeing it is best for his children.<br/>\n<br/>\nI told him to talk to Kelly or her husband.  Maybe I should plan a<br/>\ntrip down to Columbia one day LOL.</div>","specialLinks":[]}],"prevTopicId":24493,"nextTopicId":24500}}