{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] relaxing","postDate":"1157551528","msgId":17123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA5MDYwNzA1aTI0ZWFjN2E3aDY0MDY3NjY4YjgxYjljNjRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEE2ODBEMDMyLUY4NEMtNDQ0Ny1BNTBELTI4NUM2RDcyNzQxMkBnbWFpbC5jb20+","referencesHeader":"PEE2ODBEMDMyLUY4NEMtNDQ0Ny1BNTBELTI4NUM2RDcyNzQxMkBnbWFpbC5jb20+"},"prevInTopic":17118,"nextInTopic":0,"prevInTime":17122,"nextInTime":17124,"topicId":17006,"numMessagesInTopic":0,"msgSnippet":"... there is a difference between having no bedtimes and helping a child relax into sleep.  I used to think that my son Keon had a bedtime because he went to","messageBody":"<div id=\"ygrps-yiv-1368148797\">On 9/1/06, Solé &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:solelokuai@...\">solelokuai@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Now we have no bedtimes. The first days she went to bed at 3, 4 in<br/>\n&gt; the morning, we were already in bed :-) I really want her to have<br/>\n&gt; that freedom and I don&#39;t mind at all this part of the fact.<br/>\n<br/>\n<br/>\n </span></blockquote>there is a difference between having no bedtimes and helping a child relax<br/>\ninto sleep.  I used to think that my son Keon had a bedtime because he went<br/>\nto bed at 8:05 everynight.  then I realized that it had nothing to do with a<br/>\nbedtime.  He went to bed then because that was what his body needed.  Here I<br/>\nhave 2 girls who are up until past midnight most night and my son was going<br/>\nto bed regularly at a &quot;normal&quot; bedtime.  It only looks normal because he was<br/>\nbeing helped into sleep by us at a time when his body needed it.<br/>\n<br/>\nIf your children aren&#39;t able to read their own body clues that they are<br/>\nneeding sleep, there is nothing wrong with helping them settle down.<br/>\nPerhaps put on a movie and turn out the lights, spend some time reading a<br/>\nstory.  Express to them that they look tired.  &quot;You look sleepy, honey.  Do<br/>\nyou want me to go lie down with you for a while so you can rest?&quot;  or even<br/>\n&quot;I&#39;m exhausted.  Will you curl up with me for a bit so I can close my eyes<br/>\nfor 40 winks?&quot;  Lack of bedtime does not mean neglecting helping your<br/>\nchildren figure out their sleep patterns.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\nMichelle Leifur Reid<br/>\nYOUR Pampered Chef Consultant<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nCheck out my homeschool cooking classes!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: relaxing","postDate":"1157508221","msgId":17118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2EwMWM2ZDE1OCRhZDFjNTQ0MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":17095,"nextInTopic":17123,"prevInTime":17117,"nextInTime":17119,"topicId":17006,"numMessagesInTopic":0,"msgSnippet":"***I ve noticed that lately dd (almost 3) as not been following her body clues,*** I think three is very young and she really can t be expected to understand ","messageBody":"<div id=\"ygrps-yiv-1709306711\">***I&#39;ve noticed that lately dd (almost 3) as not been following her<br/>\nbody clues,***<br/>\n<br/>\nI think three is very young and she really can&#39;t be expected to understand <br/>\nall those signals nor should she be expected to know exactly how to respond <br/>\nto them.    Signals that we&#39;re tired can be different and can be responded <br/>\nto differently.  Not all adults understand their own body signals so it <br/>\nseems too much to expect of a little child.<br/>\n<br/>\nSometimes when we&#39;re tired a little snack and a sit down can rejuvenate us. <br/>\nSometimes a nap will do.  Sometimes we need hours of sleep.   Sometimes <br/>\nlittle kids need mom to hold them for five or ten or thirty minutes. <br/>\nSometimes nursing and a five minute snooze is all they need and they&#39;re good <br/>\nfor a couple more hours.   She *is* processing all that.  She *is* becoming <br/>\naware of that but understanding might take years and years.  It&#39;s not as <br/>\neasy as one signal for one kind of tired and one response.<br/>\n<br/>\n***and gets frustrated when we tell her she needs to go to<br/>\nbed. ***<br/>\n<br/>\nYou don&#39;t have to tell her.  You can begin to make her environment more <br/>\nsleep friendly.   Turn down lights, turn down TV or music, get into your own <br/>\npj&#39;s.   Offer her pj&#39;s.   Hold her, rock her, lay down with her....   If <br/>\nhearing you say &quot;time for bed&quot; makes her cranky then you can stop *saying* <br/>\nit but take actions to move the household toward sleep.<br/>\n<br/>\n***What clues can I help draw her attention to to help<br/>\nher understand?***<br/>\n<br/>\nI don&#39;t think you need to draw her attention to her own body cues.   You can <br/>\ntalk about yourself though.  You can say when you feel tired and you can say <br/>\nhow good it feels to put on your jammies and snuggle on the sofa.    I <br/>\npersonally find it very irritating when other people tell me how I feel. &lt;g&gt; <br/>\nAs she gets older it might help her if you make an observation like,  &quot;you <br/>\nseem tired&quot; or if you ask if she might be tired,  but she is still very <br/>\nyoung and I think you won&#39;t help her awareness by pointing these things out <br/>\nnow.  I think time will help her awareness and your example of a person who <br/>\ndoesn&#39;t feel like sleep is the end of something, the end of fun or the end <br/>\nof play but just one more part of a day, like getting dressed or having <br/>\nlunch.<br/>\n<br/>\n***but she<br/>\ninsists that she wants to stay up to watch more tv or very<br/>\noccasionally play with us. ***<br/>\n<br/>\nCan your dh just go to bed when he needs to?  You could quiet the house and <br/>\nease your daughter toward sleep.  Can she fall asleep watching TV with you <br/>\nand then be moved to the bed?    Can you and your daughter sleep in another <br/>\nroom where you might take more time talking or reading in bed and not <br/>\ndisturb your dh?<br/>\n<br/>\nTry to be flexible and creative.  Your daughter is changing and growing and <br/>\nwhat will help her today might not help in two months.  If the goal is to <br/>\nhelp her get to sleep and get the amount of sleep she needs you will have to <br/>\nbe the one watching her cues so that early on you can offer things that will <br/>\nease her toward sleep.   A warm bath, a little snack, cuddly jammies just <br/>\nout of the dryer, a favorite blanket or stuffed toy offered to her when you <br/>\nsnuggle down on the sofa in the evening.<br/>\n<br/>\nWe used to make a nest for Dylan, on the sofa or on the floor.  For awhile <br/>\nhe had a little tent we&#39;d put up in the living room and we&#39;d cozy it up and <br/>\nhe&#39;d snuggle in there and watch TV until he fell asleep or he&#39;d take some of <br/>\nhis little trains in there and play and fall asleep that way.   Sometimes <br/>\nhe&#39;d just go to bed with his dad.   Mostly he liked to be where we were and <br/>\nif we were happily getting ready for bed he&#39;d join us.  Sometimes he&#39;d stay <br/>\nawake longer than us but we got used to him there, playing quietly. &lt;g&gt; <br/>\n(as much as one can get used to little feet scrambling and little fingers <br/>\npoking and patting.)<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: relaxing","postDate":"1157381197","msgId":17095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWM2ZDAzMCRlZDM2YjE3MCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PGVkaGRoMCtvMDh1QGVHcm91cHMuY29tPg=="},"prevInTopic":17093,"nextInTopic":17118,"prevInTime":17094,"nextInTime":17096,"topicId":17006,"numMessagesInTopic":0,"msgSnippet":" My girls always wanted to be where I was, so when they showed signs of tiredness, we began our bedtime routine and","messageBody":"<div id=\"ygrps-yiv-2111655889\">&lt;Any ideas about how to make this smoother?&gt;<br/>\n<br/>\n<br/>\nMy girls always wanted to be where I was, so when they showed signs of<br/>\ntiredness, we began our bedtime routine and I went to bed with them.  I<br/>\nalways gave them plenty of warning time so they could prepare themselves<br/>\nmentally.  Even know when my 9 yo starts to fall apart from over tiredness,<br/>\n(she gets frustrated and down on herself)  I talk to her about how<br/>\neverything seems worse when you are tired and how much better she&#39;ll feel in<br/>\nthe morning and I offer to lie down with her.  If we were playing a game or<br/>\ndoing something together, I promise to finish in the morning and then I do. <br/>\n<br/>\n <br/>\n<br/>\nJust keep reminding her of the clues and giving plenty of transition time<br/>\nand then go to bed together.  My youngest is the first one to say when she&#39;s<br/>\ntired now and she&#39;ll ask me to lie down with her if she&#39;s really tired.  My<br/>\nolder dd doesn&#39;t seem to need as much sleep as even I do (more like her dad)<br/>\nalthough she still comes to bed when I go because she likes to be near me.<br/>\n<br/>\n <br/>\n<br/>\nI personally wouldn&#39;t say to a three year old that she can stay up as late<br/>\nas she wants to.  Not having a bedtime by the clock doesn&#39;t mean that you<br/>\ndon&#39;t watch for their tired clues and help them transition smoothly into<br/>\nsleep.  It just means don&#39;t have an arbitrary bedtime.  &quot;It&#39;s 8 o&#39;clock,<br/>\nit&#39;s bedtime.  I don&#39;t care that the other kids in the neighborhood are<br/>\nstaying up for the fireworks.  I don&#39;t care that there are Christmas<br/>\nspecials on tonight.  I don&#39;t care that you slept in this morning and you<br/>\naren&#39;t tired now.  It&#39;s 8 o&#39;clock, it&#39;s time for bed.&quot;  Some people do that.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217204862,"authorName":"Misty","from":"&quot;Misty&quot; &lt;misty@...&gt;","profile":"mistyfelner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: relaxing","postDate":"1157380448","msgId":17093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVkaGRoMCtvMDh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2YwMWM2Y2RiZCQ5NDkxNmYzMCQ2NTAwYThjMEBlYm9ueT4="},"prevInTopic":17009,"nextInTopic":17095,"prevInTime":17092,"nextInTime":17094,"topicId":17006,"numMessagesInTopic":0,"msgSnippet":"... showed signs ... I ve noticed that lately dd (almost 3) as not been following her body clues, and gets frustrated when we tell her she needs to go to bed.","messageBody":"<div id=\"ygrps-yiv-1724789080\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Angela S.&quot; &lt;game-<br/>\nenthusiast@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I didn&#39;t pick an arbitrary bedtime but followed their body<br/>\n&gt; signals and we had a nice routine and we began that when they <br/>\n </span></blockquote>showed signs<br/>\n<blockquote><span title=\"ireply\"> &gt; of tiredness.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I&#39;ve noticed that lately dd (almost 3) as not been following her <br/>\nbody clues, and gets frustrated when we tell her she needs to go to <br/>\nbed.  I know at her age she is still a bit young to fully understand <br/>\nher body clues.  What clues can I help draw her attention to to help <br/>\nher understand?<br/>\n<br/>\nHere&#39;s an example.  It&#39;s getting late, nearing 10:00 or 10:30, dd <br/>\nhas been up since 7:30 - 8 in the morning with an 1.5hr nap around <br/>\n1:30.  I can tell she&#39;s tired through her irritablity, but she <br/>\ninsists that she wants to stay up to watch more tv or very <br/>\noccasionally play with us.  The playing with us part I understand, <br/>\ndh got a new job about 2 months ago that requires him to work more <br/>\nhours than before, the problem with this is that dh gets up at 6:00 <br/>\nand is tired and needs to get to bed himself.  DD still nurses to <br/>\nsleep inbtwn us in our bed.<br/>\n<br/>\nAny ideas about how to make this smoother?<br/>\n<br/>\nMisty</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] relaxing","postDate":"1157111754","msgId":17009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2YwMWM2Y2RiZCQ5NDkxNmYzMCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PEE2ODBEMDMyLUY4NEMtNDQ0Ny1BNTBELTI4NUM2RDcyNzQxMkBnbWFpbC5jb20+"},"prevInTopic":17006,"nextInTopic":17093,"prevInTime":17008,"nextInTime":17010,"topicId":17006,"numMessagesInTopic":0,"msgSnippet":"Not having an arbitrary bedtime doesn t mean that you can t help your children settled in for the night at a fairly regular time.  Are you only kids 7 and 1?","messageBody":"<div id=\"ygrps-yiv-1791090741\">Not having an arbitrary bedtime doesn&#39;t mean that you can&#39;t help your<br/>\nchildren settled in for the night at a fairly regular time.  Are you only<br/>\nkids 7 and 1?  My kids at those ages always happily settled into bed on a<br/>\nfairly routine basis.  (Actually, they still do at  almost 10 and 11)We<br/>\ndidn&#39;t miss/cut short a special movie or the fireworks or stop a fun visit<br/>\nsomewhere JUST because it was 8 o&#39;clock, but they were still tired on a<br/>\nregular basis and still went to bed at a pretty regular time.  <br/>\n<br/>\n <br/>\n<br/>\nThis was not with tears because it&#39;s bedtime and I said so, but loving<br/>\ncuddled beside mommy or daddy after our normal evening routine.  If dh and I<br/>\nwanted time together afterwards I&#39;d get back up out of bed after the kids<br/>\nfell asleep.  (Sometimes I&#39;d tell him to wake me in half an hour cause I<br/>\nknew I&#39;d fall asleep) It didn&#39;t take long for them to fall asleep because<br/>\nthey were tired.  I didn&#39;t pick an arbitrary bedtime but followed their body<br/>\nsignals and we had a nice routine and we began that when they showed signs<br/>\nof tiredness.<br/>\n<br/>\n <br/>\n<br/>\nIt&#39;s possible to find something that works for your family while being<br/>\nrespectful of your kids at the same time. <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280005589,"authorName":"Solé","from":"=?ISO-8859-1?Q?Sol=E9?= &lt;solelokuai@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"relaxing","postDate":"1157107220","msgId":17006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2ODBEMDMyLUY4NEMtNDQ0Ny1BNTBELTI4NUM2RDcyNzQxMkBnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":17009,"prevInTime":17005,"nextInTime":17007,"topicId":17006,"numMessagesInTopic":0,"msgSnippet":"Hello, now I need help again. We ve been unschooling for about a week now :-) I have had many positive experiences since then and I really want to continue","messageBody":"<div id=\"ygrps-yiv-1367221557\">Hello,<br/>\n<br/>\nnow I need help again. We&#39;ve been unschooling for about a week  <br/>\nnow :-) I have had many positive experiences since then and I really  <br/>\nwant to continue doing this, because I believe in this.<br/>\n<br/>\nI&#39;m EXTREMELY exhausted! I don&#39;t think it is that I have been saying  <br/>\n&quot;yes&quot; too much and not taking into account my own needs, because I  <br/>\nhave, when I really needed it, and always kindly and as respectful as  <br/>\nI can and I found that since she has been given freedom, she is so  <br/>\ngrateful that she helps more often than she did before and she  <br/>\naccepts real &quot;nos&quot; without whining.<br/>\n<br/>\nBut there is one need of ours which doesn&#39;t seem to be compatible  <br/>\nwith unschooling. That is relaxing without children (or with, but  <br/>\nthat doesn&#39;t seem to work) and watching/doing things for &quot;adults&quot;.  <br/>\nFormerly,  when the children where in bed, at *8.00 pm* :-) we had  <br/>\nfour hours for *just us*. We would watch movies, relax, talk, email,  <br/>\nbathe together etc. After a long day of work and attention to our  <br/>\nchildren we&#39;d be exhausted and could relax.<br/>\n<br/>\nNow we have no bedtimes. The first days she went to bed at 3, 4 in  <br/>\nthe morning, we were already in bed :-) I really want her to have  <br/>\nthat freedom and I don&#39;t mind at all this part of the fact. BUT *we*  <br/>\nas a couple don&#39;t seem to have any peace at all. We haven&#39;t relaxed  <br/>\nsince monday, I&#39;m extremely exhausted, headache since yesterday, we  <br/>\nhavne&#39;t even been able to talk about unschooling or anything in  <br/>\nrelaxed mode to process all of this. I thought I was only lacking  <br/>\nsleep but the last two days I wanted to go to bed early, and at 22:00  <br/>\nI said I wanted to go to bed, and THEN *suddenly* she wanted to a  <br/>\nmillion things: endless cuddling (I read somewhere we shouldn&#39;t let  <br/>\ngo off first), talking, show me something, show me another thing etc  <br/>\netc... well yesterday I managed to go to bed anyway early (for my  <br/>\nstandarts), but I still feel extremely exhausted. I dunno how to meet  <br/>\nthis need because I really just need NOBODY around me asking  <br/>\nquestions, making me do things etc. etc.<br/>\n<br/>\nWhat can I do? Is it unschooling if we tell her she can play or do  <br/>\nwhatever meanwhile, but we need our time in the evenings to watch  <br/>\nsomethign and relax? or being alone? At least *sometimes* I&#39;m not  <br/>\neven asking for EVERY evening, but just when we feel the urge? I  <br/>\nguess not! So yesterday we tried watching TV anyway (to have our  <br/>\nneeds and passions respected as well) and then DS (1 yr) was crawling  <br/>\nall over us all the time (he kind of understood we are unschooling as  <br/>\nwell ;-) and doesn&#39;t want to sleep at 8 either), and DD (7yr) started  <br/>\njumping around, said a million things in between, asked questions  <br/>\n(which we answered), said it was boring etc etc. So we kind of didn&#39;t  <br/>\nrelax at all :-) And as exhausted as we go to bed now we will  <br/>\nprobably never have sex again ;-)<br/>\n<br/>\n<br/>\nI know it will be hard at the beginning and that the child&#39;s needs  <br/>\nare on top. But... How do you meet your own need to relax?<br/>\n<br/>\n<br/>\nThank you for any advice.<br/>\nJohanna</div>","specialLinks":[]}],"prevTopicId":16822,"nextTopicId":17034}}