{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":64419796,"authorName":"Nichole Fausey-Khosraviani","from":"Nichole Fausey-Khosraviani &lt;ms_fausey@...&gt;","profile":"nichole_fausey_khosraviani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fwd: Rethinking Education Conference Update: 5/28/07","postDate":"1180443139","msgId":24103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3OTUwMy4yODUwNS5xbUB3ZWIzMjEwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":24102,"nextInTime":24104,"topicId":24103,"numMessagesInTopic":0,"msgSnippet":"If you need more help with registration, don t forget that you can volunteer your time and talents.  Just contact Barb barb@rethinkingeducation.com and she ll","messageBody":"<div id=\"ygrps-yiv-1789925475\">If you need more help with registration, don&#39;t forget that you can volunteer your time and talents.  Just contact Barb <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a> and she&#39;ll help figure something out.  Don&#39;t miss this conference.  It&#39;s going to be the best ever!<br/>\n   <br/>\n  I can&#39;t wait to meet you there!<br/>\n   <br/>\n  :o)<br/>\n  Nichole<br/>\n<br/>\nBarb Lundgren &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a>&gt; wrote:<br/>\n  Date: Mon, 28 May 2007 05:59:37 -0400 (EDT)<br/>\nFrom: Barb Lundgren &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ms_fausey@...\">ms_fausey@...</a><br/>\nSubject: Rethinking Education Conference Update: 5/28/07<br/>\n<br/>\n                                  Rethinking Education Conference NEWS <br/>\n    Labor Day Weekend, Aug. 30 - Sept. 3 <br/>\n            In today&#39;s UPDATE: Monday, May 28<br/>\n  :: 2007 Highlights: Sunday Cote&#39; and Body Talk<br/>\n  :: JOIN US!<br/>\n  :: We Can&#39;t Wait for the 2007 Talent Show!<br/>\n  :: What To Do NOW<br/>\n  :: MORE 2007 Highlights: Sheila Murphy<br/>\n<br/>\n               Greetings!<br/>\n    The incredible, life-changing & liberating 11th national conference on Rethinking Education is Labor Day Weekend: Thursday, August 30 - Monday, September 3, 2007 at the Sheraton Grand Hotel in Irving, Texas , just minutes from Dallas and the DFW Airport. A complimentary shuttle runs to and from the hotel - airport 24 hours a day.<br/>\n  Our exciting website contains up to date information on our diverse, thought-provoking program, registration, and all details! Out-of-the-box, fun and &quot;nuts and bolts&quot; unschool sessions for adults, teens, tweens and kids of all ages, all weekend... 5 glorious days! <br/>\n  If you have not already done so, REGISTER by July 14 and receive a $20 discount per person...a whole 5 day weekend of unschooling bliss! <br/>\n  VOLUNTEER to further reduce your cost. Check out the volunteer jobs available on our conference website. We still have many volunteer jobs available... and volunteering is fun! <br/>\n  Complete information and is available on our website, and we will be adding to the program throughout the summer. <br/>\n<br/>\n                      2007 Highlights: Sunday Cote&#39; and Body Talk<br/>\n    Rethinking Education enthusiastically welcomes Sunday and her family for their second year ... and this most valuable technique for achieving wellness<br/>\n<br/>\n   Yes - that&#39;s her real name. No - she wasn&#39;t born on Sunday nor does she have a sibling named Monday. She does have a husband and two beautiful sons with completely normal names. They live together with their 3 cats, Henry, Monty and Lucy, (more normal names) in sunny Arizona. When not with her family or speaking and teaching metaphysics, Sunday used to spend her time just sitting and wondering how to fit it all in. Luckily since discovering BodyTalk she has found more time and energy to keep up with her exuberant and healthy boys! This is her second Rethinking Education Conference.<br/>\n  Sunday will host:<br/>\n  Tapping Into Your Family&#39;s Health<br/>\n  Need more energy to keep up with the kids? Want to help your family tap into their personal power to heal and stay healthy? Then join unschooling Mom and Certified BodyTalk Practitioner, Sunday Cote` as she shares the basics of the healing modality called BodyTalk. Sunday will offer demonstration sessions on participants as well as teach a technique that you can use with your family immediately to improve thinking ability, memory, concentration, stress reduction, and feelings of wellbeing.<br/>\n  As of 2006 BodyTalk has become the fastest growing health care approach in the world and is currently being taught in 27 different countries and in 8 different languages. BodyTalk incorporates the very best of energy medicine, science and medical knowledge, applied in a simple, safe and effective way to address the full spectrum of health. Its power is based on increasing the levels of internal communication within the body and stimulating the body&#39;s own ability to regain and maintain a healthy balance.<br/>\n  Sunday will also be available for private sessions during the conference at a special conference rate of $40 per session. You may make your appointment with her during the conference.<br/>\n<br/>\n                    JOIN US!<br/>\n  <br/>\n   Join hundreds of unschooling families from around the globe as we rethink the meanings of education, learning and parenting. Rethinking Education supports attachment parenting, unconditional love, support for each person&#39;s unique journey of life experience, freedom with responsibility, unschooling and you. YOU are the vital ingredient at this conference, as we come together and revel in the magic and mystery of kindred spirits and each other&#39;s rich diversity, as we challenge ourselves to trust the extraordinary process of living and learning, the wondrous ability to improve the ways we communicate, discovering new ways of listening to one another, giving full support to our dreams, no matter how wild or ordinary, large or small.<br/>\n  Unschooling is vital to the profoundly intelligent development of our children. And yes, as adults we can even unschool ourselves... as you will discover.<br/>\n<br/>\n                    <br/>\n   Let us put our minds together and see what we will make for our children.<br/>\n  Chief Sitting Bull<br/>\n<br/>\n<br/>\n                    We Can&#39;t Wait for the 2007 Talent Show!<br/>\n  <br/>\n   Our AWESOME Talent Show welcomes everyone with a talent and everyone who just thinks they have a talent! Good natured, rousing applause greets everyone... so get your talent, real or imagined, ready to share!<br/>\n<br/>\n                          Our 2007 Program is the Best Ever<br/>\n<br/>\n   Just look at the range of outstanding topics and activities we&#39;ve lined up for the Rethinking Education Conference 2007... and this is only a small part of our program:<br/>\n      <br/>\n   Weapons of Mass Instruction: Why Your Kids Should Not Be In School  <br/>\n   Brave New World: Unschooling Teens  <br/>\n   A College Nightmare: When Unschoolers Shouldn&#39;t Attend College But They Go Anyway  <br/>\n   Anger, Conflict and General ARRGHs: a Dad&#39;s Discussion Group  <br/>\n   Consensual Family Coaching, or &quot;Parenting Without Borders&quot;  <br/>\n   Winging it Around the World: Assorted Nuts and Bolts of World Travel  <br/>\n   The Sexual Education of Free Children  <br/>\n   Dream Interpretation  <br/>\n   Recycled Resource Fair  <br/>\n   Yurt Building - Live at THIS conference!<br/>\n  <br/>\n  And SO much more!<br/>\n<br/>\n                    What To Do NOW<br/>\n    Register... we want you there! You need an UNSCHOOLING boost!<br/>\n<br/>\n   Save $20 per person and register by July 14!<br/>\n  There are many ways to register!<br/>\n  CALL Barb at 817.540.6423<br/>\n  EMAIL <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a><br/>\n  DOWNLOAD a Registration Form & MAIL or FAX it.<br/>\n  Fax to: 817.545.3599<br/>\n  MAIL to: 3013 Hickory Hill, Colleyville, Texas... 76034<br/>\n<br/>\n                    MORE 2007 Highlights: Sheila Murphy<br/>\n    RE welcomes Sheila with her great combination of unschooling and academic experience... and rebel approach to test taking<br/>\n<br/>\n   At the turn of the millennium, while living in Seoul, South Korea, our family - myself, my husband, Ray, our four kids -- fell into unschooling rather the same way that Alice fell into Wonderland. Seven years and a few countries later (Germany, England, and now, the USA), we&#39;re currently looking for the white rabbit in Lawrence, Kansas, which has turned out to be the biggest culture shock of all. In looking at the learning smorgasbord, the two older kids have done an eclectic mix of school classes, community classes, online classes, and didacticism. This led us to the college prep game, which our oldest child has decided to play. So, we&#39;ve spent the last several months studying the rules of the game commonly referred to as college admissions, with special emphasis on &quot;What Do You Really Need to Know to Take the ACT/SAT?&quot; We found we had a bit of a strategic advantage, because prior to all of our overseas adventures, I had earned an M.A. and Ph.D. in rhetoric from the<br/>\n University of South Carolina (where I also taught composition and literature). This has left me fairly fluent in academese.<br/>\n  Sheila will host:<br/>\n  Unschoolers and the ACT/SAT Writing Tests: No Problem!<br/>\n  Do &quot;composition&quot; and &quot;compost&quot; really have the same root? If so, just what is meant by &quot;good writing&quot;?<br/>\n  Explore this and other questions related to showing your stuff on the ACT or SAT writing section with minimal damage to self and sanity. This session is for students (and their parents) interested in taking the ACT/SAT as part of their pre-college preparation. They are, of course, not required, but they&#39;re also not as formidable as they&#39;ve been made to appear.<br/>\n<br/>\n        <br/>\n                    <br/>\nCall or email Barb Lundgren with questions or to register!   Rethinking Education <br/>\n  email: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a> <br/>\n  phone: 817.540.6423 <br/>\n  web: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rethinkingeducation.com\">http://www.rethinkingeducation.com</a> <br/>\n<br/>\n<br/>\n        Register by July 14    REGISTER by July 14 and receive a $20 discount per person . . . for 5 incredible, action-packed, life changing days... and Grandparents are free! <br/>\n  Our WEBSITE has all the program details <br/>\n      <br/>\n<br/>\n<br/>\n                Forward email<br/>\n<br/>\n       This email was sent to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ms_fausey@...\">ms_fausey@...</a>, by <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a><br/>\n  Update Profile/Email Address | Instant removal with SafeUnsubscribe | Privacy Policy.<br/>\n    Email Marketing by<br/>\n     <br/>\nRethinking Education | 3013 Hickory Hill Lane | Colleyville | TX | 76034 <br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nSick sense of humor? Visit Yahoo! TV&#39;s Comedy with an Edge to see what&#39;s on, when. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23906,"nextTopicId":24124}}