{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] different approaches was Family Guy","postDate":"1218204681","msgId":35239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTAwMWM4Zjk2MCRhMzMxNDE3MCQ2NDAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4=","referencesHeader":"PDEyMTgyMDI2ODYuNzM3OTQuODEzNjAubTUyQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":35236,"nextInTopic":0,"prevInTime":35238,"nextInTime":35240,"topicId":35232,"numMessagesInTopic":0,"msgSnippet":"unschoolingbasicsOK -- note to all people who have this problem -- don t do things the way I do. Think about how your family works and find out what is helpful","messageBody":"<div id=\"ygrps-yiv-143187428\">unschoolingbasicsOK -- note to all people who have this problem -- don&#39;t do things the way I do.<br/>\n<br/>\nThink about how your family works and find out what is helpful and what is not.<br/>\n<br/>\nNance<br/>\n<br/>\n**************<br/>\n<br/>\n<br/>\n<br/>\nnot helpful on a list of tons of people who might like nothing better than a<br/>\nreason (though it might be a bad excuse for them) to keep doing what they&#39;re<br/>\nalready doing, which isn&#39;t working despite all the justifications in the<br/>\nworld.<br/>\n<br/>\nNonchalance for some is no cause for concern. For others, its a *big*<br/>\nreason the family stays conflicted and unhappy.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] different approaches was Family Guy","postDate":"1218202611","msgId":35236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODA4MDYzNng1MjE0ZWEyMm4yMGI4MzE2ZGU4ZjI3NTllQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAwMzMwMWM4Zjk0ZSQzYzNmMGVmMCQ2NDAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4=","referencesHeader":"PDEyMTgxNTY0MTAuNTgxMy40ODY0Ni5tNTBAeWFob29ncm91cHMuY29tPgkgPDAwMzMwMWM4Zjk0ZSQzYzNmMGVmMCQ2NDAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4="},"prevInTopic":35235,"nextInTopic":35239,"prevInTime":35235,"nextInTime":35237,"topicId":35232,"numMessagesInTopic":0,"msgSnippet":"That s great if the personalities and interactions are such that it works for your family.  There was no need for you to change what you have already been","messageBody":"<div id=\"ygrps-yiv-1568432583\">That&#39;s great if the personalities and interactions are such that it works<br/>\nfor your family.  There was no need for you to change what you have already<br/>\nbeen doing.<br/>\n<br/>\nHowever when I was growing up what you&#39;re describing is how it was done<br/>\nthere too.  And the personalities and interactions were such that it<br/>\n*didn&#39;t* do well (except for the last 2 children --out of 4).  I would<br/>\ndescribe it as being nonchalant and sometimes careless and even cold about<br/>\nothers.<br/>\n<br/>\nWhile some families can afford nonchalance, many families have dynamics<br/>\nwhere dismissing what others like grates on the nerves of the one who likes<br/>\nwhat someone else doesn&#39;t and vice versa.  Nonchalance is often a point of<br/>\nconflict.  And that&#39;s why the comment about a lack of interest not stopping<br/>\nthe world (who cares about what the world thinks or feels?) from spinning is<br/>\nnot helpful on a list of tons of people who might like nothing better than a<br/>\nreason (though it might be a bad excuse for them) to keep doing what they&#39;re<br/>\nalready doing, which isn&#39;t working despite all the justifications in the<br/>\nworld.<br/>\n<br/>\nNonchalance for some is no cause for concern.  For others, its a *big*<br/>\nreason the family stays conflicted and unhappy.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/8/08, Nance Confer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   unschoolingbasics&quot;I would feel awful if I dismissed something that my<br/>\n&gt; children liked with the comment that my lack of interest hadn&#39;t stopped the<br/>\n&gt; world from spinning.&quot;<br/>\n&gt;<br/>\n&gt; And I don&#39;t.<br/>\n&gt;<br/>\n&gt; Actually, quite the opposite. I think it frees them to decide what they<br/>\n&gt; like for themselves. With or without my enthusiasm.<br/>\n&gt;<br/>\n&gt; Now, there are many TVs and several computers in this house. Nobody HAS to<br/>\n&gt; watch what the other wants to watch.<br/>\n&gt;<br/>\n&gt; And my children are older -- 13 and 15 -- and aren&#39;t hanging on my every<br/>\n&gt; word.<br/>\n&gt;<br/>\n&gt; We went through the things where I pretended to be interested when they<br/>\n&gt; were very young. We watched or read things that really, in truth, did not<br/>\n&gt; interest me -- Dr. Seuss is neat but . . :)<br/>\n&gt;<br/>\n&gt; But then we reached the age of Pokemon cards and there was some other<br/>\n&gt; trading card game. I didn&#39;t care about them, DS was into them. I drove, I<br/>\n&gt; bought, he collected and traded. And talked at me about them but didn&#39;t<br/>\n&gt; expect me to remember all the details he did. He actually enjoyed knowing<br/>\n&gt; things I did not know. It was HIS thing.<br/>\n&gt;<br/>\n&gt; And things grew from there, I think. I think that was the turning point.<br/>\n&gt; Where he started to have independent activities -- independent from me.<br/>\n&gt;<br/>\n&gt; And watching TV around here has always been an interactive activity anyway.<br/>\n&gt; We have always sliced and diced ads, for instance.<br/>\n&gt;<br/>\n&gt; To the point where DD will remind the rest of us &quot;it&#39;s just an ad&quot; or &quot;it&#39;s<br/>\n&gt; just a show&quot; -- it doesn&#39;t actually have to hold together in a perfectly<br/>\n&gt; logical way. We get carried away sometimes. :)<br/>\n&gt;<br/>\n&gt; I don&#39;t know -- we just aren&#39;t required to assign value to things because<br/>\n&gt; the other person likes it. If I don&#39;t like football, I feel free to watch<br/>\n&gt; something else and not hide my disdain from DH. After all, he&#39;s a Jets fan.<br/>\n&gt; He&#39;s used to disdain. :)<br/>\n&gt;<br/>\n&gt; But he knows, as the kids know, that the disdain is for the game -- or<br/>\n&gt; those cars all driving very fast while turning left, what the heck is<br/>\n&gt; entertaining about that! -- and not him.<br/>\n&gt;<br/>\n&gt; I&#39;m not going to suggest others should live the way we do or that our way<br/>\n&gt; is the right way and other ways are not. I&#39;m will suggest that our family<br/>\n&gt; dynamic allows for one way of doing things that may or may not fit with<br/>\n&gt; other families.<br/>\n&gt;<br/>\n&gt; Nance<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] different approaches was Family Guy","postDate":"1218202156","msgId":35235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNzVCOEU5LTE0OTMtNDkyMi1COEUyLUM1MkIwRjZBNEY0QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAwMzMwMWM4Zjk0ZSQzYzNmMGVmMCQ2NDAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4=","referencesHeader":"PDEyMTgxNTY0MTAuNTgxMy40ODY0Ni5tNTBAeWFob29ncm91cHMuY29tPiA8MDAzMzAxYzhmOTRlJDNjM2YwZWYwJDY0MDJhOGMwQHlvdXJ3MDRndHhsZDY3Pg=="},"prevInTopic":35232,"nextInTopic":35236,"prevInTime":35234,"nextInTime":35236,"topicId":35232,"numMessagesInTopic":0,"msgSnippet":"... Maybe you re missing what people are saying. Maybe your family dynamics are altering the feeling of the words. But there s a point being missed that s","messageBody":"<div id=\"ygrps-yiv-1057556008\">On Aug 8, 2008, at 7:59 AM, Nance Confer wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  we just aren&#39;t required to assign value to things because the  <br/>\n&gt; other person likes it. If I don&#39;t like football, I feel free to  <br/>\n&gt; watch something else and not hide my disdain from DH<br/>\n<br/>\n </span></blockquote>Maybe you&#39;re missing what people are saying. Maybe your family  <br/>\ndynamics are altering the feeling of the words. But there&#39;s a point  <br/>\nbeing missed that&#39;s useful to building good relationships.<br/>\n<br/>\nI think it&#39;s useful for building relationships to give what kids (and  <br/>\nspouses!) like a good try. And even if you decide you don&#39;t like it,  <br/>\nto at least be familiar enough with it to have conversations.<br/>\n<br/>\nIf you&#39;ve given something a try, it&#39;s perfectly okay to say &quot;I don&#39;t  <br/>\nreally like that show.&quot; And talk about why not.<br/>\n<br/>\n(For instance, I really tried to like The Office. I think the concept  <br/>\nis brilliant. But I get a creepy feeling knowing the characters are  <br/>\nall acting one way to one another and saying something different  <br/>\nbehind their backs. I *know* that&#39;s the point of the show and why  <br/>\npeople find it funny. It just makes me uncomfortable. But I do know  <br/>\nthe characters and can understand when they tell me something about it.)<br/>\n<br/>\nI&#39;m sure my family can tell you what shows I don&#39;t like! I don&#39;t keep  <br/>\nit a secret. My likes and dislikes don&#39;t dictate theirs. And theirs  <br/>\ndon&#39;t dictate mine. We all know we&#39;re free to like or dislike  <br/>\nwhatever we do.<br/>\n<br/>\nI find it useful to appreciate what they like about things I don&#39;t  <br/>\nlike. It gives use more connections. There are some things that I  <br/>\njust won&#39;t be able to get. That&#39;s okay too. But I think the more we  <br/>\ntry, the better and stronger the relationships we have.<br/>\n<br/>\nBut I don&#39;t think it&#39;s ever useful for building relationships to  <br/>\nlabel what someone else likes as stupid or dumb or boring or anything  <br/>\nnegative. There are gentler, kinder, more relationship building ways  <br/>\nof sharing our likes and dislikes without using judgmental words.  <br/>\nEven if the members of a family don&#39;t find the words hurtful, there  <br/>\nwill be other people outside the family who will be put off and feel  <br/>\nput down. And that&#39;s a good thing for kids to know, even if their  <br/>\nfamily is less sensitive.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] different approaches was Family Guy","postDate":"1218196777","msgId":35232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWM4Zjk0ZSQzYzNmMGVmMCQ2NDAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4=","referencesHeader":"PDEyMTgxNTY0MTAuNTgxMy40ODY0Ni5tNTBAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":35235,"prevInTime":35231,"nextInTime":35233,"topicId":35232,"numMessagesInTopic":0,"msgSnippet":"unschoolingbasics I would feel awful if I dismissed something that my children liked with the comment that my lack of interest hadn t stopped the world from","messageBody":"<div id=\"ygrps-yiv-1119061827\">unschoolingbasics&quot;I would feel awful if I dismissed something that my children liked with the comment that my lack of interest hadn&#39;t stopped the world from spinning.&quot;<br/>\n<br/>\n<br/>\nAnd I don&#39;t.<br/>\n<br/>\nActually, quite the opposite. I think it frees them to decide what they like for themselves. With or without my enthusiasm.<br/>\n<br/>\nNow, there are many TVs and several computers in this house. Nobody HAS to watch what the other wants to watch. <br/>\n<br/>\nAnd my children are older -- 13 and 15 -- and aren&#39;t hanging on my every word. <br/>\n<br/>\nWe went through the things where I pretended to be interested when they were very young. We watched or read things that really, in truth, did not interest me -- Dr. Seuss is neat but . .  :)<br/>\n<br/>\nBut then we reached the age of Pokemon cards and there was some other trading card game. I didn&#39;t care about them, DS was into them. I drove, I bought, he collected and traded. And talked at me about them but didn&#39;t expect me to remember all the details he did. He actually enjoyed knowing things I did not know. It was HIS thing. <br/>\n<br/>\nAnd things grew from there, I think. I think that was the turning point. Where he started to have independent activities -- independent from me. <br/>\n<br/>\nAnd watching TV around here has always been an interactive activity anyway. We have always sliced and diced ads, for instance. <br/>\n<br/>\nTo the point where DD will remind the rest of us &quot;it&#39;s just an ad&quot; or &quot;it&#39;s just a show&quot; -- it doesn&#39;t actually have to hold together in a perfectly logical way. We get carried away sometimes. :)<br/>\n<br/>\nI don&#39;t know -- we just aren&#39;t required to assign value to things because the other person likes it. If I don&#39;t like football, I feel free to watch something else and not hide my disdain from DH. After all, he&#39;s a Jets fan. He&#39;s used to disdain. :)<br/>\n<br/>\nBut he knows, as the kids know, that the disdain is for the game -- or those cars all driving very fast while turning left, what the heck is entertaining about that! -- and not him. <br/>\n<br/>\nI&#39;m not going to suggest others should live the way we do or that our way is the right way and other ways are not. I&#39;m will suggest that our family dynamic allows for one way of doing things that may or may not fit with other families.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":35237,"nextTopicId":35241}}