{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Moving Was Re: Just some thoughts that I could use some assistance with.","postDate":"1223998334","msgId":36598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NEFFMjA1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":36597,"nextInTime":36599,"topicId":36598,"numMessagesInTopic":0,"msgSnippet":"I remember moving when DS was 3 ½ (just one town over, from apt to house) and we made sure to pack a special box with his name on it with his most treasured","messageBody":"<div id=\"ygrps-yiv-2007223309\">I remember moving when DS was 3 ½ (just one town over, from apt to house) and we made sure to pack a special box with his name on it with his most treasured stuff. Even before that, when we moved (we moved once when he was almost 1 and again when he was almost 2), we&#39;d always make his stuff first priority. When he was a wee tot, we were just moving across campus (from my dorm supervisor apartment to married student housing), basically a bunch of back and forth with multiple vehicles. We took all his stuff (bookshelves, crib, rocking chair, toys, etc) and a phone over to the apartment first thing in the morning. Then we had a friend stay there with him (there was a playground right out the back so they spent a bunch of time there) and some snacks, while we did the back and forth and cleaning and organizing and all. He had a safe, familiar-ish space and familiar face. On the cross country move at 2, that was tougher because (a) he had a broken arm (broke it less than a week before we moved, at the going away party!) (b) it was cross country in a U-Haul  (c) we didn&#39;t have a permanent location to settle into set up - we stayed with friends for several days until we found an apartment. (this was the move where we deliberately stacked the boxes as to be unclimbable - so we thought - until we turned our backs for 2 seconds and found him sitting on the top, eye level with 6 ft tall hubby!) But, we did have one whole suitcase readily accessible that was just his stuff - favorite clothing, stuffed critters, books, etc. By the third move, he was a lot more involved and CHOSE which items he wanted to go in our car and which went into the boxes in the truck. Since it was nearby, we&#39;d drive by the new place regularly and get used to it as &quot;our house&quot;. We don&#39;t plan to move again until we&#39;re old and creaky and move into &quot;the home&quot;. DH moved around a lot as a kid (FIl was Air Force, among other things) but my parents moved into &quot;our house&quot; in 1963 and still live there - none of us kids remember anyplace else (I was 3 and had lived 2 other places, bro was about 18 months and had lived one other place, sis was born after moving into that house).<br/>\n<br/>\nJust reminiscing and rambling...<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":36530,"nextTopicId":36419}}