{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Digest Number 878","postDate":"1145364640","msgId":12254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUyMm5iMCtrajZ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA0MTcyMDIzZzNkNTlmMTMycjUzZWM4YmQzMTQwNjYxMjVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":12248,"nextInTopic":0,"prevInTime":12253,"nextInTime":12255,"topicId":12222,"numMessagesInTopic":0,"msgSnippet":"... We just had a fondue dinner - cheese fondue with French bread and chocolate fondue with marshmallows, strawberries, graham crackers, angel cake, and banana","messageBody":"<div id=\"ygrps-yiv-1098873761\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Pampered Chef Michelle&quot; <br/>\n&lt;pamperedmichelle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On 4/17/06, Misty Felner &lt;misty@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;We did a &quot;totally chocolate dinner&quot;  one time because they<br/>\n&gt; &gt; thought it would be wonderful.  <br/>\n&gt; &gt;<br/>\n&gt; &gt; They are also old enough to understand that they felt bad b/c of <br/>\n&gt;what they<br/>\n&gt; &gt; ate.<br/>\n </span></blockquote>We just had a fondue dinner - cheese fondue with French bread and <br/>\nchocolate fondue with marshmallows, strawberries, graham crackers, <br/>\nangel cake, and banana chunks. Both on the table at the same time <br/>\n(actually, the chocolate was there first, the cheese took a bit more <br/>\nwork to get the consistency right). DS (almost 8, not a &#39;grown up&#39; <br/>\nby any stretch) had a few marshmallows covered in chocolate. Then <br/>\nthe cheese fondue hit the table and he alternated randomly between <br/>\nthe two and probably ate as much of the cheese fondue as I did.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Just because a child doesn&#39;t recognize the connection doesn&#39;t mean <br/>\n&gt;we can<br/>\n&gt; help them see the connection.  That&#39;s parenting.  Lack of <br/>\n&gt;limitations does<br/>\n&gt; not mean we don&#39;t inform our children about things. <br/>\n </span></blockquote>When DS was about 5 (maybe a little younger), we noted a connection <br/>\nbetween his protein intake (food in general, especially proteins) <br/>\nand his behavior. He&#39;d get to doing something he -knew- was <br/>\nirritating, potentially hazardous, etc and when requested to stop, <br/>\nhe&#39;d say &quot;my brain won&#39;t let me stop&quot; or something similar. His <br/>\ntolerance for frustration would plummet and meltdowns would occur. <br/>\nWhen the connection clicked in my head I said &quot;Hey how about we go <br/>\nget a PBJ and talk about this. Would you like grape or strawberry <br/>\njam?&quot; (or something to that effect) and when he was munching I told <br/>\nhim I noticed that if he had some protein regularly (not a whole lot <br/>\neven necessarily - a tbl of PB, a slice or two of cheese, whatever), <br/>\nhe didn&#39;t get so frustrated as easily. Now he&#39;s so used to it, he <br/>\nalmost doesn&#39;t think twice about just going and finding food when he <br/>\nstarts feeling that &#39;oddness&#39;. And, we continue to offer or just <br/>\nhave available for him (like making some crackers and cheese to take <br/>\nto him while he&#39;s playing a video game) various foods - just because <br/>\nhe understands it doesn&#39;t mean we don&#39;t continue to help and be <br/>\navailable for him. He is also in on/overhearing our discussions <br/>\nrelated to things like DH&#39;s hypertension - sodium, potassium, <br/>\ncholesterol, etc. He&#39;s probably more conscientious about checking <br/>\nlabels than I am. One time, he was maybe 5ish, we had picked up a <br/>\npizza to take home and we stopped to pick up some soda to go with it <br/>\n(don&#39;t know about you but pizza needs carbonated beverages). DS <br/>\nstood looking at the selection and then picked up the Sprite and <br/>\nread the sodium level. Then he picked up the root beer and checked <br/>\nthe sodium level. And chose the one with less sodium because &quot;this <br/>\nis better for Daddy&#39;s blood pressure&quot;. The cashier at the mini-mart <br/>\n(who was close enough to hear the whole thing) got a kick out of his <br/>\nchoosing. We talk (not teach not lecture but discuss as it arises) <br/>\nabout things like HFCS, what &#39;organic&#39; means, and so on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What age did you start<br/>\n&gt; &gt; &quot;trusting your children to experience food&quot;.  <br/>\n </span></blockquote>The day he was born and began nursing on demand. Really. His only <br/>\nlimits were set by real life things - like when we ran out of <br/>\noranges or Cheerios. Those items would wait until the next grocery <br/>\ntrip. A limit set not by us as far as &quot;we have 6 oranges but you can <br/>\nonly have two today&quot; but rather the reality of sometimes all the <br/>\noranges are gone and pay day is Friday and we&#39;ll get more then. Oh, <br/>\nand he had input from the time he could talk and point as to what we <br/>\nbought. From early on, we&#39;d discuss having to choose between A and B <br/>\nbecause of our food money. By age 4 or 5 we&#39;d go to the market <br/>\ntogether and he&#39;d choose between things as necessary (if we were <br/>\ncoming in low on the budget he could get A and B but if it was <br/>\ngetting tight he could get A or B - his choice). Sometimes his <br/>\nchoices were between pudding and cupcakes. Sometimes his choices <br/>\nwere between cupcakes and cottage cheese. As we shopped, I&#39;d note <br/>\nthings he asked for that weren&#39;t already accounted for on the list - <br/>\nitem, price, aisle. Once we were done with the basic shopping, I&#39;d <br/>\nhave a rough running total of the cost and I&#39;d let him know what the <br/>\nbudget could handle. We&#39;d go over his list and figure out his <br/>\noptions.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>As far as health issues, one thing I want to note is the difference <br/>\nbetween current, existing health issues (nut allergy for example) <br/>\nand &quot;potential&quot; health issues which may or may not arise. Limiting <br/>\non the &quot;odds&quot; and operating from fear of this or that is limiting <br/>\nindeed - for everyone. Information and support rather than <br/>\nexternally imposed limits allows a person to seek their own -safe- <br/>\npath rather than seeking to get around the limits. What looks like a <br/>\nsafe path to you might not be the best path for your offspring - you <br/>\nmight for your own self need to limit how much purple corn you eat <br/>\nbut your offspring can eat more purple corn safely than you can. <br/>\nShould your limits apply to them? <br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Digest Number 878","postDate":"1145353182","msgId":12248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MjQwRTRGLTJEQzUtNEE4OC05RTRBLTVGMEIzNTIxNDI3REBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDE3MTczMC4xZnZCaXk3RjIzTmwzNDkyQG14LW5lYm9saXNoLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDIwMDYwNDE3MTczMC4xZnZCaXk3RjIzTmwzNDkyQG14LW5lYm9saXNoLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":12243,"nextInTopic":12254,"prevInTime":12247,"nextInTime":12249,"topicId":12222,"numMessagesInTopic":0,"msgSnippet":"... Why do you feel your daughter is less competent than mine? Why do you feel you need to control her food when my daughter from the beginning had freedom to","messageBody":"<div id=\"ygrps-yiv-140423252\">On Apr 17, 2006, at 5:23 PM, Misty Felner wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m sure by the time my daughter is that age she will also have had  <br/>\n&gt; that<br/>\n&gt; exposure.  Each day she gets older she&#39;s exposed to more and more  <br/>\n&gt; things.<br/>\n<br/>\n </span></blockquote>Why do you feel your daughter is less competent than mine? Why do you  <br/>\nfeel you need to control her food when my daughter from the beginning  <br/>\nhad freedom to eat what she wanted when she wanted without a running  <br/>\ncommentary from me and has always when averaged over a week chosen a  <br/>\nhealthy diet?<br/>\n<br/>\n(Though from 4-10 it was more limited in terms of variety because  <br/>\nthings just didn&#39;t taste good to her, as many kids go through. As  <br/>\npuberty came on her taste changed again and now there&#39;s little she  <br/>\ndoesn&#39;t like.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again at dd&#39;s age your daughter would appear to be grown up.<br/>\n<br/>\n </span></blockquote>But she got there by eating things you&#39;ve told your daughter that  <br/>\ndon&#39;t &quot;help people grow&quot;.<br/>\n<br/>\nAs questions came up I pointed out that there were foods with more  <br/>\nnutrition and less nutrition. (I can&#39;t remember the contexts, but it  <br/>\nwas information, not meant to make her feel like not eating  <br/>\nsomething.) I didn&#39;t tell her not to eat the less nutritious food.  <br/>\nBecause she had freedom to choose, her body naturally was drawn to  <br/>\ntake in the nutrition it needed. But she neither avoided nor overate  <br/>\nless nutritious food.<br/>\n<br/>\nWhy do you believe your daughter is less capable?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Secondly it would be helpful to know who those of you who are that  <br/>\n&gt; have<br/>\n&gt; teenagers now and were radical unschoolers from the beginning.<br/>\n<br/>\n </span></blockquote>You might want to make that a topic and ask about parents&#39; experiences.<br/>\n<br/>\nThere are also people who have had kids they&#39;ve controlled at the  <br/>\nbeginning and later kids they gave freedom to. You can ask what the  <br/>\ndifferences were they found.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Digest Number 878","postDate":"1145330591","msgId":12243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MTcyMDIzZzNkNTlmMTMycjUzZWM4YmQzMTQwNjYxMjVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDQ0NDQwOWE3LjI1MjZlZjNhLjRhMjUuMGM1Y1NNVFBJTl9BRERFREBteC5nbWFpbC5jb20+","referencesHeader":"PDExNDUyODYxOTIuMzMzNC4zODk2Lm0yNUB5YWhvb2dyb3Vwcy5jb20+CSA8NDQ0NDA5YTcuMjUyNmVmM2EuNGEyNS4wYzVjU01UUElOX0FEREVEQG14LmdtYWlsLmNvbT4="},"prevInTopic":12222,"nextInTopic":12248,"prevInTime":12242,"nextInTime":12244,"topicId":12222,"numMessagesInTopic":0,"msgSnippet":"... Actually they were much younger when we did this.  It was actually before we even started unschooling.  Roly Poly Olie was fairly new on tv at the time and","messageBody":"<div id=\"ygrps-yiv-1561175202\">On 4/17/06, Misty Felner &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:misty@...\">misty@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt;We did a &quot;totally chocolate dinner&quot;  one time because they<br/>\n&gt; thought it would be wonderful.  They felt awful! They hated the way that<br/>\n&gt; they felt and hated how sluggish and slow they were.  Their conclusion was<br/>\n&gt; that eating only chocolate may taste delicious but it does nothing to give<br/>\n&gt; you energy.  My girls are limitless because they are able to make informed<br/>\n&gt; experience-based decisions about what to eat.&lt;<br/>\n&gt;<br/>\n&gt; They are also old enough to understand that they felt bad b/c of what they<br/>\n&gt; ate.<br/>\n<br/>\n<br/>\n </span></blockquote>Actually they were much younger when we did this.  It was actually before we<br/>\neven started unschooling.  Roly Poly Olie was fairly new on tv at the time<br/>\nand that is where they got the idea.  So Mary Elayne may have been around 3<br/>\nwhich means that Emily was around 6 and Keon a newborn.  However, I have<br/>\nclear memories of them noticing the way food effected them long before<br/>\nthat.  Emily (who is now 13.5yo) has a sensitivity to Red Dye #40.  It does<br/>\nreally nasty things to her ability to rationalize and cope with minor<br/>\nannoyances in her life.  When she was very young she would go into rages and<br/>\nnot even be able to tell me why she was going into rages.  When we did an<br/>\nelimination diet and discovered this was a key to her behaviour and<br/>\neliminated this from her diet her life changed so much!  She was a different<br/>\n(and fun to be with again) child.  She wasn&#39;t even 2 when we discovered<br/>\nthis.  She&#39;s known about this sensitivity ever since.  She also was able to<br/>\nat a very young age recognize that her body was impacted by the foods she<br/>\nate, particularly RD40.  We helped her recognize what was happening to her<br/>\nand she has chosen since then  whether to consume RD40 or whether to bypass<br/>\nsomething that might make her feel badly.<br/>\n<br/>\nJust because a child doesn&#39;t recognize the connection doesn&#39;t mean we can<br/>\nhelp them see the connection.  That&#39;s parenting.  Lack of limitations does<br/>\nnot mean we don&#39;t inform our children about things.  Would you warn someone,<br/>\na stranger for instance,  if you saw something dangerous?  Would  you yell<br/>\nout for someone to stop if they stepped out into the street and didn&#39;t see a<br/>\ncar?  No difference with your children.  We are one of the facilitators of<br/>\ntheir learning and that includes food.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Have you read some of the articles on food limitations at Sandra<br/>\n&gt; Dodd&#39;s website.  I never believed them when we first started unschooling<br/>\n&gt; until I trusted my children to experience food and not have labels on food<br/>\n&gt; such as &quot;good&quot; and &quot;bad.&quot;&lt;<br/>\n&gt;<br/>\n&gt; I have not read them, but I&#39;d like to take a look.  What age did you start<br/>\n&gt; &quot;trusting your children to experience food&quot;.  Does her website deal with<br/>\n&gt; the<br/>\n&gt; issues of limitations/restrictions on diet for medical reasons?<br/>\n<br/>\n<br/>\n </span></blockquote>Please do take a look at her articles.  See what other parents have<br/>\nexperienced with their children.  There are quite a few unschoolers who have<br/>\nraised their children RU from birth.  Some of us had RU babies and then for<br/>\nsome reason decided to make them conform to a certain set of rules as they<br/>\ngot older.  Think of the moms that have breastfed babies that aren&#39;t<br/>\nscheduled, fed on demand, co-slept, and self-weaned.  That&#39;s unschooling.<br/>\nThen suddenly they are told that they have a bunch of rules to follow.  How<br/>\nconfusing is that.  I think one of the reasons that I saw my children&#39;s<br/>\npreschool years as so difficult is because I pushed them through that<br/>\ntransition.   From freedom to restrictions.<br/>\n<br/>\n<br/>\nI think we&#39;ve pretty much exhausted this topic.  I&#39;ll be taking a look at<br/>\n<blockquote><span title=\"ireply\"> &gt; her website to see what it has to say.<br/>\n<br/>\n<br/>\n </span></blockquote>Remember that the articles on her website come from a variety of sources.<br/>\nThey all aren&#39;t Sandra&#39;s experiences.  So you are going to get more than one<br/>\nperson&#39;s perspective on how their lives were changed through unschooling!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217204862,"authorName":"Misty Felner","from":"&quot;Misty Felner&quot; &lt;misty@...&gt;","profile":"mistyfelner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Digest Number 878","postDate":"1145309026","msgId":12222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExNDUyODYxOTIuMzMzNC4zODk2Lm0yNUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":12243,"prevInTime":12221,"nextInTime":12223,"topicId":12222,"numMessagesInTopic":0,"msgSnippet":"On Apr 17, 2006, Joyce Fetteroll wrote: ... age. At 2.5 my daughter had a similar food environment because there wasn t a reason to have snacky food around.","messageBody":"<div id=\"ygrps-yiv-1774636666\"><blockquote><span title=\"qreply\">On Apr 17, 2006, Joyce Fetteroll wrote:<br/>\n<br/>\nIn response to:<br/>\n&gt; She&#39;s never<br/>\n&gt; asked for candy <br/>\n<br/>\n&gt;Which means what? I don&#39;t think my daughter liked candy much at that  <br/>\nage. At 2.5 my daughter had a similar food environment because there  <br/>\nwasn&#39;t a reason to have snacky food around. But by 14 she&#39;s been  <br/>\nexposed to lots of snacky foods and *still* without me hovering over  <br/>\nher, without me training her on what&#39;s &quot;right&quot; to eat and what&#39;s  <br/>\n&quot;wrong&quot;, eats well balanced meals. Yes, she has candy, she has an occasional<br/>\n<br/>\nsoda but she prefers milk with a little chocolate. She prefers herbal  <br/>\ntea to black tea.&gt;<br/>\n<br/>\nI&#39;m sure by the time my daughter is that age she will also have had that<br/>\nexposure.  Each day she gets older she&#39;s exposed to more and more things.<br/>\n<br/>\n&gt;How will your daughter reconcile what you say about limiting foods  <br/>\nthat don&#39;t &quot;help people grow&quot; with people like my daughter who are  <br/>\nhealthy and well grown who do eat foods that won&#39;t &quot;help people  <br/>\ngrow&quot;? &lt;<br/>\n<br/>\nAgain at dd&#39;s age your daughter would appear to be grown up.<br/>\n<br/>\n&gt;We do care as much about our kids as you do yours. If we let our kids have<br/>\n<br/>\nchocolate chips instead of carob chips it&#39;s not because we don&#39;t  <br/>\ncare. &lt;<br/>\n<br/>\nI want to make it clear that I don&#39;t feel anyone here doesn&#39;t care about<br/>\ntheir kids, if you didn&#39;t you wouldn&#39;t be here.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt;When you want to watch something, are you allowed?<br/>\n<br/>\nSometimes, but not always :)<br/>\n<br/>\n&gt;It will help you move towards whole life unschooling to not see it as  <br/>\nallowing them but helping them do what they want and enjoy.&lt;<br/>\n<br/>\nThat is a good way to look at things.<br/>\n<br/>\n&gt;It&#39;s okay if you don&#39;t want to move that direction. But any ideas  <br/>\nthat are posted *that hinder someone else* from moving that direction  <br/>\nwill be held up and examined.&lt;<br/>\n<br/>\nI know there are others on this site like me, and maybe some of them are on<br/>\nthe same page as me, maybe not.  I hope that my questions and comments and<br/>\nthe responses given help them to make decisions one way or another, as it<br/>\nhelps me.<br/>\n<br/>\n&gt;And there are plenty of people here who have teens -- who were 2.5 at  <br/>\none time! -- who *know* from experience it isn&#39;t necessary to control  <br/>\nthem until they can make the same decisions mom would.&gt;<br/>\n<br/>\nFirst of all I don&#39;t expect her to make exactly the same decisions I do.<br/>\nSecondly it would be helpful to know who those of you who are that have<br/>\nteenagers now and were radical unschoolers from the beginning.  <br/>\n <br/>\n<br/>\n<br/>\n<br/>\nMon, April 17 Michelle wrote:<br/>\n<br/>\n<br/>\n&gt;We did a &quot;totally chocolate dinner&quot;  one time because they<br/>\nthought it would be wonderful.  They felt awful! They hated the way that<br/>\nthey felt and hated how sluggish and slow they were.  Their conclusion was<br/>\nthat eating only chocolate may taste delicious but it does nothing to give<br/>\nyou energy.  My girls are limitless because they are able to make informed<br/>\nexperience-based decisions about what to eat.&lt;<br/>\n<br/>\nThey are also old enough to understand that they felt bad b/c of what they<br/>\nate.<br/>\n<br/>\n&gt;Have you read some of the articles on food limitations at Sandra<br/>\nDodd&#39;s website.  I never believed them when we first started unschooling<br/>\nuntil I trusted my children to experience food and not have labels on food<br/>\nsuch as &quot;good&quot; and &quot;bad.&quot;&lt;<br/>\n<br/>\nI have not read them, but I&#39;d like to take a look.  What age did you start<br/>\n&quot;trusting your children to experience food&quot;.  Does her website deal with the<br/>\nissues of limitations/restrictions on diet for medical reasons?<br/>\n<br/>\nI think we&#39;ve pretty much exhausted this topic.  I&#39;ll be taking a look at<br/>\nher website to see what it has to say.<br/>\n<br/>\nMisty </span></blockquote></div>","specialLinks":[]}],"prevTopicId":12177,"nextTopicId":12195}}