{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":53,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] How to respond to a Superintendent who doesn&#39;t understand?","postDate":"1186638235","msgId":25627,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUE4NUY2ODc3OUUzNi1BM0MtQThEN0BGV00tRDA0LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDYxMTU1MS44NTU3Ny5xbUB3ZWI1MzIwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":25626,"nextInTopic":25628,"prevInTime":25626,"nextInTime":25628,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"... From: Mara  Hi everyone, my son is turning 6 in August and so I wrote a short letter of intent listing general subjects we will most ","messageBody":"<div id=\"ygrps-yiv-379394818\">-----Original Message-----<br/>\nFrom: Mara &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamadeluz@...\">mamadeluz@...</a>&gt;<br/>\n<br/>\nHi everyone,<br/>\nmy son is turning 6 in August and so I wrote a short<br/>\nletter of intent listing general subjects we will most<br/>\nlikely cover by just living and also saying that we<br/>\nwill most likely meet or surpass the hours required by<br/>\nlaw because we believe that learning happens all day -<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nIn this homeschool-fearful country, I don&#39;t think that&#39;s  how I&#39;d start <br/>\n*any*thing with the Superintendent! Especially with all the press <br/>\nunschooling has been getting lately! Back Off!<br/>\n<br/>\n-=-=-=-==-<br/>\n<br/>\nNow this is part of his response:<br/>\n<br/>\nQuote: Although you have listed the subjects you will<br/>\nbe teaching, I ask that you please provide us with<br/>\nmore information, such as the materials you are<br/>\nplanning to use in the various subject areas, the<br/>\nnumber of hours of intstruction you plan to provide,<br/>\nand how you will monitor L.&#39; progress.<br/>\nAfter reviewing this information, I&#39;ll be happpy to<br/>\ngrant approval.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nTry this. This is Duncan&#39;s &quot;curriculum&quot;---I borrowed it from Carol <br/>\nNarigon, and Pam Sorooshian, mostly.<br/>\n<br/>\n*************************************************************************<br/>\n***<br/>\n<br/>\n~The World is Our Classroom~<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n LifeWorks School for Boys<br/>\n<br/>\nCourse of Study<br/>\nElementary Grades<br/>\n<br/>\nLifeWorks School for Boys is a private full-time  homeschool <br/>\nestablished in compliance with the Education Code of the State of South <br/>\nCarolina. Because we believe that the family is the most fundamental <br/>\nsocial institution and the preferred means of caring for, preparing, <br/>\nand training children to be productive members of society, LifeWorks <br/>\nSchool promotes and supports a family-centered education through our <br/>\nindependent study program.<br/>\n<br/>\nAt LifeWorks School, independent study, in which Duncan learns <br/>\nprimarily under the immediate direction, guidance, and support of his <br/>\nparents and other caring and involved adults, offers an outstanding <br/>\neducational opportunity by providing a natural learning environment, <br/>\nextensive real-world experience, flexibility of schedule, and the <br/>\nability to respond to the specific needs and inclinations of the child. <br/>\nDuncan’s program is developmentally appropriate, integrated and fully <br/>\nindividualized, and continually built upon his strengths and interests <br/>\nthroughout the year.<br/>\n<br/>\nEnglish: Duncan will develop knowledge of, and appreciation for <br/>\nliterature and the language, as well as the skills of speaking, <br/>\nreading, comprehension, listening, spelling, handwriting, and <br/>\ncomposition.<br/>\n<br/>\nDuncan will read from self-chosen or parent-chosen literature on a <br/>\nregular basis and will engage in reflection on those literature pieces <br/>\nin a variety of ways, such as: journal writing, book reviews, <br/>\nconversations, drama based on the books, book clubs. Our educational <br/>\ngoal is for Duncan to read for pleasure, to gain exposure to a wide <br/>\nvariety of genres, and to be able to reflect critically on what he <br/>\nreads.<br/>\n<br/>\nDuncan will read content-related non-fiction materials to support his <br/>\nchosen areas of interest. He will reflect on these pieces in a variety <br/>\nof ways, such as: journal writing, writing articles for submission to <br/>\nmagazines or newspapers, discussions, or development of a scrapbook in <br/>\nan area of interest. Our goal is for Duncan to learn to read critically <br/>\nfor information, to understand and be able to reflect on materials <br/>\nread, to be able to compare them to other sources of information, and <br/>\nto learn how and where to find written resources as needed.<br/>\n<br/>\nWriting, spelling and grammar will be covered as part of Duncan’s <br/>\nnatural writing and speaking processes. He will develop his ability to <br/>\nwrite creatively, to write letters and lists, to create and write drama <br/>\npieces, informational essays, persuasive articles, etc. Our goal is for <br/>\nDuncan to enjoy writing, to gain expertise in both the writing process <br/>\nand in technical writing and editing skills, and to develop a sense of <br/>\npower over the written word<br/>\n<br/>\nScience:  Duncan will develop his knowledge of the biological and <br/>\nphysical sciences, with emphasis on the processes of experimental <br/>\ninquiry and on the place of humans in ecological systems. He will <br/>\nrelate these to areas of specific personal interests by engaging in <br/>\nhands-on activities, watching science videos, reading related written <br/>\nmaterials, conducting scientific experiments, keeping journals, making <br/>\nand recording observations, visiting scientists in their work places, <br/>\nvisiting local science museums, participating in science fairs and <br/>\nworkshops, and through cooperative learning. Our goal is for Duncan to <br/>\nexperience a wide range of scientific exposure, to develop a positive <br/>\ninterest in science, to learn to think scientifically, to develop a <br/>\nrespect for the work scientists do, and to understand the importance <br/>\nscience has in daily life and in the overall environment.<br/>\n<br/>\nSocial Sciences: Duncan will develop his understanding of the social <br/>\nsciences and humanities by reading and discussing fiction and <br/>\nnon-fiction materials, participating in field trips to historic and <br/>\npolitically or culturally significant sites, or through discussion and <br/>\ndebate. Anthropology, economics, psychology, geography, history, <br/>\npolitical science, and sociology are fully integrated into his studies <br/>\nin a wide variety of ways, such as: the use of time lines and maps, <br/>\ndiscussion, journal writing, cooking, plays, road trips, invention <br/>\nbuilding, field trips, and art. Our goal is for Duncan to develop a <br/>\nfoundation for understanding the history, resources, development, and <br/>\ngovernment of South Carolina and the United States of America; the <br/>\ndevelopment of the American economic system including the role of the <br/>\nentrepreneur and labor; the relations of persons to their human and <br/>\nnatural environment; eastern and western cultures and civilizations; <br/>\nand contemporary issues including the wise use of natural resources. <br/>\nPublic service and selfless giving play an important role in our <br/>\nfamily&#39;s social studies.<br/>\n<br/>\n<br/>\nHealth and Physical Education: Health and physical education will be <br/>\nfully integrated as a part of daily living skills and participation in <br/>\nthe wider community with an emphasis upon the physical activities that <br/>\nmy be conducive to health and vigor of body and mind. Duncan will learn <br/>\nto care for his health and physical environment in a variety of ways, <br/>\nsuch as: shopping for and preparing food, discussing the necessity of a <br/>\nhealthy diet, participation in fire drills and other emergency <br/>\npreparedness activities, exercise both as play and as part of a <br/>\nstructured group experience and through camping, hiking, and other <br/>\noutdoor activity. Our goal is for Duncan to appreciate the necessity of <br/>\na healthy body and to develop lifelong habits of regular exercise and <br/>\ngood nutrition.<br/>\n<br/>\nVisual and Performing Arts: Duncan will develop his knowledge of art, <br/>\nmusic, and drama through informal and structured methods in a variety <br/>\nof ways, such as: art classes, instrumental lessons, choral singing, <br/>\nlistening to various styles of music, learning about the people who <br/>\nhave influenced music through history, or working on individualized or <br/>\ngroup projects that relate to music, art, and drama, including acting <br/>\nand performing in a variety of venues and genres.  Our goal is for <br/>\nDuncan to enjoy a wide variety of art, music, and drama experiences, <br/>\nincluding performance, while developing an understanding and <br/>\nappreciation of the importance of art, music, and drama as creative <br/>\nexpressions of human life experiences.<br/>\n<br/>\nMathematics: Duncan will develop mathematical concepts, operational <br/>\nskills, and problem solving through participation in daily real-world <br/>\nactivities such as cooking, building, shopping, budgeting, computing, <br/>\netc. Mathematics materials will be chosen to support his individual <br/>\nlearning style in order to achieve competency in operational skills and <br/>\ninsight into problem-solving procedures.  Our goal is for Duncan to <br/>\ngain a strong conceptual knowledge of mathematics as well as an <br/>\nappreciation for the daily applications of mathematics in his life.<br/>\n<br/>\n<br/>\n<br/>\n****************************************************************<br/>\n<br/>\n -<br/>\nHow do I monitor his progress? I do not like to look<br/>\nat my child in that way - of course he makes<br/>\n&#39;progress&#39; - maybe I could just say that I plan to<br/>\nkeep a diary of what we do during the day, and that<br/>\nwould be enough to realize his progress. I so hate<br/>\nthat word.<br/>\nHow do I deal with him and this letter as this is only<br/>\nmy first year of having to report? Any ideas? And what<br/>\nexactly is an umbrella school?<br/>\n<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI would say that I will keep a portfolio of samples of his work and a <br/>\ndaytimer in which I&#39;d write what we do each day (you only need 180 <br/>\ndays/year.<br/>\n<br/>\n~Kelly<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.<br/>\n=0</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186636842","msgId":25626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUE4NUMyQUFFQ0FCQy1BM0MtQTg4QkBGV00tRDA0LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDQ2NDk3MS4yNjYyMC5xbUB3ZWI1OTIwNy5tYWlsLnJlMS55YWhvby5jb20+","referencesHeader":"PDQ2NDk3MS4yNjYyMC5xbUB3ZWI1OTIwNy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":25625,"nextInTopic":25627,"prevInTime":25625,"nextInTime":25627,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"... From: Cameron Parham  OK, this seems likely to be true based  on  our experiences since we started trying to radically unschool in","messageBody":"<div id=\"ygrps-yiv-1568944520\">-----Original Message-----<br/>\n<br/>\n<br/>\n<br/>\nFrom: Cameron Parham &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:acsp2205@...\">acsp2205@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOK, this seems likely to be true based  on  our experiences since we <br/>\nstarted<br/>\n<br/>\ntrying to radically unschool in March 2007.   I have many more <br/>\nquestions, and<br/>\n<br/>\nhope that I get to fire off a longer field report but this exchange <br/>\ntouches on<br/>\n<br/>\none area of concern for me. While I am getting deschooled, and so <br/>\ninherently<br/>\n<br/>\ncannot really unschool actively, how do I best help the kids?  In this <br/>\nexchange<br/>\n<br/>\nsometing like this was said, &quot;You were not unschooling but were doing <br/>\nyour own<br/>\n<br/>\nthing and letting him do his.&quot;  I can&#39;t quote it as I accidently erased <br/>\nit.<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nI *think* I wrote: &quot;You weren&#39;t unschooling; you were letting him be <br/>\nwhile you were busy with other things.&quot;<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nDarn.  But we are in the midst of deschooling and er...yep, I am still <br/>\ntring to<br/>\n<br/>\n<br/>\n<br/>\ndo my best at even that!  I hope that this quetion is decipherable.<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\n I think I understand what you&#39;re asking! &lt;G&gt;<br/>\n<br/>\n<br/>\n<br/>\nTo me, for adults, the DEschooling process is about four things: 1) <br/>\nseeing that learning happens naturally to everyone around you, 2) <br/>\nimmersing your own self in something important (and including the <br/>\nchildren if they want),  3) documenting your children&#39;s learning <br/>\n*without* disturbing it, and 4) NOT nagging or teaching or worrying.<br/>\n<br/>\n<br/>\n<br/>\nThe original poster was busy moving and starting her own business---so <br/>\nshe was actively doing #2. But she wasn&#39;t doing #s 1, 3, or 4.<br/>\n<br/>\n<br/>\n<br/>\n#1 needs to be done often---and not just with your children. Ask <br/>\naround---lots of people you know: how did you learn what you know? <br/>\nEspecially folks with interesting jobs. Where did they gain their <br/>\nknowledge of what they&#39;re doing. In school? The only professions that <br/>\nlatch on to that &quot;book larnin&#39;&quot; with a passion are doctors and lawyers <br/>\n(you&#39;re one, right Cameron?---that&#39;s got to be an impediment for you! <br/>\n&lt;g&gt; &#39;Cause you and your colleagues really do believe in that &quot;skule <br/>\nlarnin&#39;.&quot;  But it can be done! &lt;G&gt;) That&#39;s take a little more effort on <br/>\nyour part<br/>\n<br/>\n<br/>\n<br/>\nRen has a test (ironic, huh?) that she gives at conferences. It&#39;s <br/>\n*very* telling when you see how many hands go up and down. Ren, you <br/>\nwant to bring that here again?<br/>\n<br/>\n<br/>\n<br/>\n#2 is about finding a passion. Get involved in something that will take <br/>\nyour mind of nagging your children. SHOW your children what real <br/>\nlearning looks like. Doing something difficult is even better: that way <br/>\nthey get to see you fail a bit too! Duncan and I picked up fencing two <br/>\nyears ago. It was a lot of fun, but a LOT of work. Duncan enjoyed <br/>\nseeing me get beaten by a child half my size! &lt;G&gt; (But she was GOOD!) <br/>\nI&#39;d fence at home---just learning the steps and positions so he saw me <br/>\nworking towards my goal (Dunc wasn&#39;t as interested in doing the <br/>\nhomework).<br/>\n<br/>\n<br/>\n<br/>\nI also keep bees: we&#39;ve had three swarms, but we&#39;ve also harvested lots <br/>\nof honey. I garden, but it&#39;s a good thing we don&#39;t rely on my crops to <br/>\nfeed us---I&#39;m not all that good at producing bumper crops! &lt;g&gt; We cry <br/>\n(and sometimes laugh) at my failures and revel in my successes. It&#39;s <br/>\ngood for children to see that the learning isn&#39;t spontaneous but is a <br/>\nprocess. Too often children only see us be perfect: we don&#39;t burn <br/>\nsupper any more because we&#39;ve had a lot of practice making the meals we <br/>\nserve. Make more &quot;strange&quot; suppers---experiment in the kitchen---and <br/>\nmaybe call Domino&#39;s when you fail.<br/>\n<br/>\n<br/>\n<br/>\nChildren desperately need to see their parents struggle to learn <br/>\nsomething new. Otherwise they believe that we *came* this way! They <br/>\ndon&#39;t realize that were kids just they they are! That we&#39;ve *learned* <br/>\neverything we know!<br/>\n<br/>\n<br/>\n<br/>\n#3: Write it down! Learn educationese. And learn how to translate what <br/>\nyour child is doing into educationese. Today, with their earned $$$ <br/>\n(helping my parents move yesterday), Duncan and his friend Bo bought <br/>\nnew Bionicles. They put them together, posed them, took photos of them, <br/>\nand thought up elaborate stories and adventures for them. They swam for <br/>\na few hours and played with the hose. They made banana-strawberries <br/>\nsmoothies. They played on the computer a bit---DeviantArt and WOW. We <br/>\nall went out to eat at San Jose&#39;s---and Duncan spoke to our waiter in <br/>\nSpanish (just por favor and gracias, but he spoke Spanish!). We all <br/>\nwatched South Park and then baked cookies. They&#39;re upstairs now <br/>\ntalking, playing with their Bionicles, and watching a movie.<br/>\n<br/>\n<br/>\n<br/>\nBased on that day, would anyone like to attempt a daily log of <br/>\neducationese?<br/>\n<br/>\n<br/>\n<br/>\nMy (required by law) daily log (just a week-at-a-glance daytimer) looks <br/>\nlike this:<br/>\n<br/>\n&quot;Bo here / smoothies / New Bionicles / swim party / WOW / San Jose&#39;s / <br/>\nSouth Park / cookies&quot;<br/>\n<br/>\nIt lets me know what we did so that I can apply educationese if I need <br/>\nto.<br/>\n<br/>\n<br/>\n<br/>\nThere&#39;s absolutely no need for Duncan to know what I write down, but it <br/>\ncan help me see what he&#39;s doing daily---that he&#39;s not just &quot;doing <br/>\nnothing&quot; all day.<br/>\n<br/>\n<br/>\n<br/>\n#4 The rule of thumb is one month for each year you were in school. How <br/>\nmany years were *you* schooled? Including kindergarten and college?<br/>\n<br/>\n<br/>\n<br/>\nAs for your children: IF you nag or push or try to &quot;teach&quot; something, <br/>\nstart counting over. So if you&#39;ve been good for four months but <br/>\nsuddenly have a panic attack and pull out the workbooks and ask for <br/>\nthree pages of math, you get to start deschooling all over. The reason <br/>\nis that you&#39;ve lost the trust your child was just beginning to build in <br/>\nyou. Start over. You;re back at Day One.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIf your child has been schooled or schooled-at-home, he needs to heal <br/>\nfirst before he can even begin to trust you again (Is Mom going to <br/>\nstart with that damned Saxon Math again?) . He may need months of video <br/>\ngames or TV or walking the hills and star-gazing or just veging out to <br/>\nsimply heal himself from the damage of others&#39; lack of trust in him. As <br/>\nhe comes out of this funk, you&#39;ll see him searching for a passion. It <br/>\nmay not be the one *you* would like him to develop! &lt;G&gt; And I seriously <br/>\ndoubt it will look much like quadratic equations or Baroque <br/>\narchitecture or memorizing the periodic table or the laws of physics!<br/>\n<br/>\n<br/>\n<br/>\nIt *may* look like skateboarding or getting his first checkbook or <br/>\nfilm-making or doll design or Bionicles. FEED that passion---it&#39;s your <br/>\nfirst step in that new respect/trust bond you&#39;re seeking! No matter how <br/>\nweird and &quot;non-schoolish&quot; it may seem. Roll with it. Put $$$ towards <br/>\nit---at least what you would put into a new curriculum! As his trust in <br/>\nyou developed, so will his passions grow. EVERY passion will cover all <br/>\nschool subjects.<br/>\n<br/>\n<br/>\n<br/>\nToss one at me. I bet I could build a curriculum around it!<br/>\n<br/>\n<br/>\n<br/>\nWhen the deschooling process is over, there will be a paradigm shift: <br/>\nyou will SEE all learning as natural and everywhere. You will naturally <br/>\nrelax about the reading and math---and even physics, history and <br/>\nchemistry. And you won&#39;t worry any more.<br/>\n<br/>\n<br/>\n<br/>\nOne more thing: If you DO make that paradigm shift, then there&#39;s no <br/>\nturning back. You KNOW! It&#39;s deep in your soul that this is RIGHT. That <br/>\nunschooling is the ONLY way to learn. That nothing else makes sense.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nKelly Lovejoy<br/>\n<br/>\n<br/>\n<br/>\nConference Coordinator<br/>\n<br/>\n<br/>\n<br/>\nLive and Learn Unschooling Conference<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to respond to a Superintendent who doesn&#39;t understand?","postDate":"1186636385","msgId":25624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZTdwMStlcW9rQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxMTU1MS44NTU3Ny5xbUB3ZWI1MzIwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":25623,"nextInTopic":25625,"prevInTime":25623,"nextInTime":25625,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Hi Mara, I can tell you I used a basic generic course of study outline I took from the Worldbook website. I also listed books we might use......I included a","messageBody":"<div id=\"ygrps-yiv-1015161805\">Hi Mara,<br/>\nI can tell you I used a basic generic course of study outline I took<br/>\nfrom the Worldbook website.<br/>\nI also listed books we &quot;might&quot; use......I included a line that said we<br/>\nhave the option to change &quot;curriculum&quot; and subject matter and<br/>\nresources used.<br/>\nI also said in my letter of intent something like, learning will be<br/>\nplanned based on interests.<br/>\nDiane</div>","specialLinks":[]},{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Seeking your advice and your wisdom","postDate":"1186636383","msgId":25625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjOC4xNzBmNGM1MS4zM2ViZmM1ZkBhb2wuY29tPg=="},"prevInTopic":25624,"nextInTopic":25626,"prevInTime":25624,"nextInTime":25626,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Schools destroy the spirits and damage the intellects of countless young boys by insisting that they sit still and think at the same time, which very many are","messageBody":"<div id=\"ygrps-yiv-753205444\">Schools destroy the spirits and damage the intellects of countless young boys <br/>\nby insisting that they sit still and think at the same time, which very many <br/>\nare simply not capable of doing. Parents at home can destroy spirits too. An <br/>\nhour a day is WAY too much to ask of many many MANY young children.<br/>\n<br/>\nBeing not even seven and not yet reading is NOTNOTNOT being a late reader. <br/>\nNot even close. NOT! This is really important! You can&#39;t force reading on a kid <br/>\nwho isn&#39;t ready, but you CAN convince them that they&#39;re broken and/or stupid <br/>\nif you try. <br/>\n<br/>\nUnschooling saved the spirits and intellects of my two youngest children. Had <br/>\nthey gone to school they would not have been succesful in school terms in <br/>\nthose all important early years. my son because at 5 and 6 and 7 and 8 he could <br/>\nthink well OR he could sit still, but not both at the same time. My daughter <br/>\nbecause she is a visual thinker who learned to read late and slow. One would <br/>\nhave been labeled trouble and the other special grouped. Both would likely have <br/>\nended up feeling stupid and deficient. Instead they are confident and happy in <br/>\nlearning and life at 15. Lucky lucky them to be born into an already <br/>\nunschooling home.<br/>\n<br/>\nAt the very least, read Raymond Moore&#39;s Better Late than Early, for support <br/>\nin not pushing any academics on young children.<br/>\n<br/>\nDeborah in IL<br/>\n<br/>\n<br/>\n**************************************<br/>\n Get a sneak peek of the <br/>\nall-new AOL at <a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133390932,"authorName":"Mara","from":"Mara &lt;mamadeluz@...&gt;","profile":"mamadeluz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[unschoolingbasics] How to respond to a Superintendent who doesn&#39;t understand?","postDate":"1186635848","msgId":25623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMTU1MS44NTU3Ny5xbUB3ZWI1MzIwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PEJGMDEyQTdCLTg5NTgtNDU4OS1CREJGLUFCQkRBODU3RDAxNkBjb3gubmV0Pg=="},"prevInTopic":25622,"nextInTopic":25624,"prevInTime":25622,"nextInTime":25624,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, my son is turning 6 in August and so I wrote a short letter of intent listing general subjects we will most likely cover by just living and also","messageBody":"<div id=\"ygrps-yiv-1546137507\">Hi everyone,<br/>\nmy son is turning 6 in August and so I wrote a short<br/>\nletter of intent listing general subjects we will most<br/>\nlikely cover by just living and also saying that we<br/>\nwill most likely meet or surpass the hours required by<br/>\nlaw because we believe that learning happens all day -<br/>\nNow this is part of his response:<br/>\n<br/>\nQuote: Although you have listed the subjects you will<br/>\nbe teaching, I ask that you please provide us with<br/>\nmore information, such as the materials you are<br/>\nplanning to use in the various subject areas, the<br/>\nnumber of hours of intstruction you plan to provide,<br/>\nand how you will monitor L.&#39; progress. <br/>\nAfter reviewing this information, I&#39;ll be happpy to<br/>\ngrant approval.<br/>\n<br/>\nIn reality of course there wont be &#39;any&#39; hours of<br/>\ninstruction. He is learning all the time and I deaply<br/>\nbelieve that teaching and learning have nothing to do<br/>\nwith each other, unless someone seeks out a &#39;teacher&#39;.<br/>\n The materials of course will vary and I can not know<br/>\nall the things he might like to know about the coming<br/>\nyear. I could take a wild guess, or I could copy some<br/>\noverview of a random curriculum and say that we might<br/>\nbe doing some of those things -<br/>\nHow do I monitor his progress? I do not like to look<br/>\nat my child in that way - of course he makes<br/>\n&#39;progress&#39; - maybe I could just say that I plan to<br/>\nkeep a diary of what we do during the day, and that<br/>\nwould be enough to realize his progress. I so hate<br/>\nthat word. <br/>\nHow do I deal with him and this letter as this is only<br/>\nmy first year of having to report? Any ideas? And what<br/>\nexactly is an umbrella school?<br/>\n<br/>\nLots of love to you all -<br/>\nMara<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n </span></blockquote>____________________________________________________________________________________<br/>\nTake the Internet to Go: Yahoo!Go puts the Internet in your pocket: mail, news, photos & more. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/go?refer=1GNXIC\">http://mobile.yahoo.com/go?refer=1GNXIC</a></div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Seeking your advice and your wisdom....Question for Ren","postDate":"1186635254","msgId":25622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZTZsbStvYjY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5ZTJibStka2x1QGVHcm91cHMuY29tPg=="},"prevInTopic":25621,"nextInTopic":25623,"prevInTime":25621,"nextInTime":25623,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"I wonder how I will continue to show progress reports which may not fit the school s timeline for what should happen at each grade .~~ YOu don t need to in","messageBody":"<div id=\"ygrps-yiv-169234560\">&quot;I wonder how I will continue<br/>\nto show progress reports which may not fit the school&#39;s timeline for<br/>\nwhat should happen at each &quot;grade&quot;.~~&quot;<br/>\n<br/>\n&quot;YOu don&#39;t need to in MA. There are several here that can answer more<br/>\nclearly.&quot;<br/>\n<br/>\nThe reason I asked is because in the Charles case law here....it<br/>\nstates the school may require periodic evaluation to ensure<br/>\neducational progress and minimum standards. I guess I assumed the<br/>\nminimum standards meant progressing thru minimum standards for each<br/>\ngrade level.<br/>\nSo thats why I was wondering how an unschooler reports.<br/>\nLast school year was the first I had to submit anything and this is<br/>\nthe first progress report I have had to do. I am sure I will get<br/>\nbetter at the educationalese lingo to make the school &quot;happy&quot;.<br/>\nDiane</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186631651","msgId":25621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGMDEyQTdCLTg5NTgtNDU4OS1CREJGLUFCQkRBODU3RDAxNkBjb3gubmV0Pg==","inReplyToHeader":"PGY5ZTJvZStxc3UzQGVHcm91cHMuY29tPg==","referencesHeader":"PGY5ZTJvZStxc3UzQGVHcm91cHMuY29tPg=="},"prevInTopic":25620,"nextInTopic":25622,"prevInTime":25620,"nextInTime":25622,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Ren, lovely! Our word for the day on Braingle was PERSPICUITY....and this is a great example. May I quote you on our local list and/or my blog? Our deschooling","messageBody":"<div id=\"ygrps-yiv-1451773353\">Ren, lovely! Our word for the day on Braingle was PERSPICUITY....and  <br/>\nthis is a great example. May I quote you on our local list and/or my  <br/>\nblog?<br/>\n<br/>\nOur deschooling period was less about the kids and more about me. Dh  <br/>\ncalls it the &quot;period of benign neglect&quot; because what it consisted of  <br/>\nwas ME biting my tongue and relearning all the parenting and  <br/>\nexpectations I had been brainwashed into believing. I had to step  <br/>\nback, be an observer, safety monitor, etc. As my trust grew, then we  <br/>\nwere able to get more active together...but before that it would have  <br/>\nbuilt a big wall of distrust between us because I could not let go of  <br/>\nall the other stuff. Oddly enough academics has never been an issue  <br/>\nfor me, but all the other stuff started that way.<br/>\n<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (8), Rachel (7), Sam (6), Dan  <br/>\n(4), and Avari Rose (19 months)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Aug 8, 2007, at 10:47 PM, Ren Allen wrote:<br/>\n<br/>\n&gt; ~~While I am getting deschooled, and so inherently<br/>\n&gt; cannot really unschool actively, how do I best help the kids? ~~<br/>\n&gt;<br/>\n&gt; I really believe the two are intertwined. If every parent waited until<br/>\n&gt; all their trust was renewed and they had no fears, then very few would<br/>\n&gt; ever unschool! I think a lot of us choose to walk forward because our<br/>\n&gt; children are worth it, because our hearts are urging us to trust and<br/>\n&gt; because it really makes SENSE. But these issues swell up (like the<br/>\n&gt; spiral that Tyra describes) and we learn through them.<br/>\n&gt;<br/>\n&gt; We learn that it&#39;s really about our baggage, not our children&#39;s lack<br/>\n&gt; (because there is no lack in them...it&#39;s only our watered down<br/>\n&gt; perception that gets in the way) or inability to learn.<br/>\n&gt;<br/>\n&gt; We learn that trust WORKS. We learn that we can let go and still be<br/>\n&gt; connected. As we extend trust to our children and choose joy over<br/>\n&gt; fear, we heal. Through that healing we deschool and unschooling can<br/>\n&gt; blossom more fully. It&#39;s a process. Nobody needs to deschool before<br/>\n&gt; they unschool...but unschooling will flow freely and beautifully once<br/>\n&gt; you have gotten most of the school out of your head!:)<br/>\n&gt;<br/>\n&gt; I think less focus on what children are learning, and more focus on<br/>\n&gt; what brings a family joy, will propel the family into unschooling<br/>\n&gt; faster than anything.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186631246","msgId":25620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZTJvZStxc3UzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2NDk3MS4yNjYyMC5xbUB3ZWI1OTIwNy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":25619,"nextInTopic":25621,"prevInTime":25619,"nextInTime":25621,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"~~While I am getting deschooled, and so inherently cannot really unschool actively, how do I best help the kids? ~~ I really believe the two are intertwined.","messageBody":"<div id=\"ygrps-yiv-1807516663\">~~While I am getting deschooled, and so inherently<br/>\ncannot really unschool actively, how do I best help the kids? ~~<br/>\n<br/>\nI really believe the two are intertwined. If every parent waited until<br/>\nall their trust was renewed and they had no fears, then very few would<br/>\never unschool! I think a lot of us choose to walk forward because our<br/>\nchildren are worth it, because our hearts are urging us to trust and<br/>\nbecause it really makes SENSE. But these issues swell up (like the<br/>\nspiral that Tyra describes) and we learn through them. <br/>\n<br/>\nWe learn that it&#39;s really about our baggage, not our children&#39;s lack<br/>\n(because there is no lack in them...it&#39;s only our watered down<br/>\nperception that gets in the way) or inability to learn.<br/>\n<br/>\nWe learn that trust WORKS. We learn that we can let go and still be<br/>\nconnected. As we extend trust to our children and choose joy over<br/>\nfear, we heal. Through that healing we deschool and unschooling can<br/>\nblossom more fully. It&#39;s a process. Nobody needs to deschool before<br/>\nthey unschool...but unschooling will flow freely and beautifully once<br/>\nyou have gotten most of the school out of your head!:)<br/>\n<br/>\nI think less focus on what children are learning, and more focus on<br/>\nwhat brings a family joy, will propel the family into unschooling<br/>\nfaster than anything.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Seeking your advice and your wisdom....Question for Ren","postDate":"1186631087","msgId":25619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZTJqZit2b2pAZUdyb3Vwcy5jb20+","inReplyToHeader":"PDQyMzBBODQzLTZDMTgtNEQ3MC1BQ0U2LUJERUM2MERDRkFEN0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":25618,"nextInTopic":25620,"prevInTime":25618,"nextInTime":25620,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Thank you Joyce, I am on the MHLA yahoo list, I was just wondering from an unschoolers perspective how reporting is done. how experienced unschoolers deal with","messageBody":"<div id=\"ygrps-yiv-1829462914\">Thank you Joyce,<br/>\nI am on the MHLA yahoo list, I was just wondering from an unschoolers<br/>\nperspective how reporting is done. how experienced unschoolers deal<br/>\nwith reporting.<br/>\nI think I just said something similar to you........some wording such<br/>\nas &quot;progress has been made&quot;.......yadayada!LOL<br/>\nDiane</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Seeking your advice and your wisdom....Question for Ren","postDate":"1186630838","msgId":25618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZTJibStka2x1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5ZHRoZytxbTk0QGVHcm91cHMuY29tPg=="},"prevInTopic":25617,"nextInTopic":25619,"prevInTime":25617,"nextInTime":25619,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"~~I wonder how I will continue to show progress reports which may not fit the school s timeline for what should happen at each grade .~~ YOu don t need to in","messageBody":"<div id=\"ygrps-yiv-1440537332\">~~I wonder how I will continue<br/>\nto show progress reports which may not fit the school&#39;s timeline for<br/>\nwhat should happen at each &quot;grade&quot;.~~<br/>\n<br/>\nYOu don&#39;t need to in MA. There are several here that can answer more<br/>\nclearly.<br/>\n<br/>\nIn FL, you only had to prove that your child had &quot;progressed&quot;. Well,<br/>\nthey&#39;re learning more all the time, so there is not way they wouldn&#39;t<br/>\nprogress! There is NO need to think that you need to follow any school<br/>\ntimeline.<br/>\n<br/>\nThere are usually other options for meeting the law that don&#39;t include<br/>\nreporting to the school district at all. We can meet the law in TN by<br/>\nregistering with an umbrella school.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Seeking your advice and your wisdom....Question for Ren","postDate":"1186627705","msgId":25616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMzBBODQzLTZDMTgtNEQ3MC1BQ0U2LUJERUM2MERDRkFEN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY5ZHRoZytxbTk0QGVHcm91cHMuY29tPg==","referencesHeader":"PGY5ZHRoZytxbTk0QGVHcm91cHMuY29tPg=="},"prevInTopic":25615,"nextInTopic":25617,"prevInTime":25615,"nextInTime":25617,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"... It isn t necessary to keep up with grade level.  All the case law states is that you need to show progress. I deliberately chose not to write anything to","messageBody":"<div id=\"ygrps-yiv-1416067594\">On Aug 8, 2007, at 10:18 PM, rn9302000 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder how I will continue<br/>\n&gt; to show progress reports which may not fit the school&#39;s timeline for<br/>\n&gt; what should happen at each &quot;grade&quot;.<br/>\n<br/>\n </span></blockquote>It isn&#39;t necessary to keep up with grade level.  All the case law  <br/>\nstates is that you need to show progress. I deliberately chose not to  <br/>\nwrite anything to impress the superintendent incase there wasn&#39;t any  <br/>\nprogress the next year ;-) There always was, but I didn&#39;t want to  <br/>\ngive the impression she was reading better than she was. (It wasn&#39;t  <br/>\nclear Kat was reading fluently until she was 10.) I just said,  <br/>\n&quot;continues to improve&quot; and mentioned some of the things she was still  <br/>\n&quot;working on&quot;.<br/>\n<br/>\nThere are two homeschooling lists in MA where you can get more  <br/>\nthorough answers. I&#39;m forgetting their names but they&#39;re easy  enough  <br/>\nto search for.<br/>\n<br/>\nThere&#39;s also:<br/>\n<br/>\nNewEnglandUnschooling<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/NewEnglandUnschooling/\">http://groups.yahoo.com/group/NewEnglandUnschooling/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186626313","msgId":25617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NDk3MS4yNjYyMC5xbUB3ZWI1OTIwNy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":25616,"nextInTopic":25618,"prevInTime":25616,"nextInTime":25618,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"If you choose to unschool, you will need to spend the next couple of years DEschooling yourself before you can begin to unschool your son. OK, this seems","messageBody":"<div id=\"ygrps-yiv-123944150\">If you choose to unschool, you will need to spend the next couple of <br/>\nyears DEschooling yourself before you can begin to unschool your son.<br/>\n<br/>\n<br/>\nOK, this seems likely to be true based  on  our experiences since we started trying to radically unschool in March 2007.   I have many more questions, and hope that I get to fire off a longer field report but this exchange touches on one area of concern for me. While I am getting deschooled, and so inherently cannot really unschool actively, how do I best help the kids?  In this exchange someting like this was said, &quot;You were not unschooling but were doing your own thing and letting him do his.&quot;  I can&#39;t quote it as I accidently erased it.  Darn.  But we are in the midst of deschooling and er...yep, I am still tring to do my best at even that!  I hope that this quetion is decipherable. Thanks..Cameron<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186626178","msgId":25615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA5MDIyMjU4Lk5EV0wyMzE3Ni5pYm01OWFlYy5iZWxsc291dGgubmV0QG1haWwuYmVsbHNvdXRoLm5ldD4="},"prevInTopic":25614,"nextInTopic":25616,"prevInTime":25614,"nextInTime":25616,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Yep.  It boils down to that.  I really don t know how I got away from my trust in learning through enjoyment.  Just a year or so ago I wrote an article about","messageBody":"<div id=\"ygrps-yiv-1547415687\">Yep.  It boils down to that.  I really don&#39;t know how I got away from my trust in learning through enjoyment.  Just a year or so ago I wrote an article about how unschooling best fits in with my spiritual approach to life which is zen.<br/>\n<br/>\nBut this has been a good experience.  I have regressed a wee bit but I am still growing despite.  My eyes have been re-opened and I seek to find my center again as I ride this unschooling spiral.<br/>\n<br/>\nTrust...yet another point that totally resonates with me.<br/>\n<br/>\nmuch love<br/>\nTyra<br/>\n<br/>\nFrom: &quot;Ren Allen&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\n<br/>\n<br/>\nI really believe John Holt hit the nail on the head when he said &quot;In<br/>\norder to trust the children, we must first learn to trust ourselves.&quot;<br/>\nThat&#39;s what it&#39;s all about, isn&#39;t it?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Seeking your advice and your wisdom....Question for Ren","postDate":"1186625904","msgId":25614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZHRoZytxbTk0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5ZHBvbyt2c2kwQGVHcm91cHMuY29tPg=="},"prevInTopic":25613,"nextInTopic":25615,"prevInTime":25613,"nextInTime":25615,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Why should a 6 or 7 year old NEED reading or math skills? Truly. Those are picked up by doing what you love anyway. You realize he s very young but you still","messageBody":"<div id=\"ygrps-yiv-1601263411\">&quot;Why should a 6 or 7 year old NEED reading or math<br/>\nskills? Truly. Those are picked up by doing what you love anyway. You<br/>\nrealize he&#39;s very young but you still have school baggage attached to<br/>\nsome mythological timeline.<br/>\n<br/>\nMy 14 y.o. learned to read at age 12. You wouldn&#39;t know him apart from<br/>\na child that learned at 6. Your child needs to be celebrated for<br/>\nexactly what he is interested in TODAY. He needs to have his very real<br/>\ninterests nourished.&quot;<br/>\n<br/>\n<br/>\nRen,<br/>\nRight now I am working on my progress report for last school year for<br/>\nmy now 7 yo dd.......I also am preparing my letter of intent and my<br/>\neducational plan......all of these things have been requested by my<br/>\ndistrict, and falls withing massachusetts law for them to require<br/>\nit......sooo my question to you is.......do you live in a state like I<br/>\ndo where you have to report to the school on your child&#39;s progress?<br/>\nand how do you do this as an unschooler.  I wonder how I will continue<br/>\nto show progress reports which may not fit the school&#39;s timeline for<br/>\nwhat should happen at each &quot;grade&quot;.<br/>\n<br/>\nDiane</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Seeking your advice and your wisdom","postDate":"1186625520","msgId":25613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA5MDIxMjAwLk1aTEIyMzE3Ni5pYm01OWFlYy5iZWxsc291dGgubmV0QG1haWwuYmVsbHNvdXRoLm5ldD4="},"prevInTopic":25611,"nextInTopic":25614,"prevInTime":25612,"nextInTime":25614,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Thanks Ren.  And I have thought that I would like the teacher to be the villan and not me so your point is well taken. Peace Tyra From: Ren Allen","messageBody":"<div id=\"ygrps-yiv-104658047\">Thanks Ren.  And I have thought that I would like the teacher to be the villan and not me so your point is well taken.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\nFrom: &quot;Ren Allen&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nDate: 2007/08/08 Wed PM 08:14:00 CDT<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Re: Seeking your advice and your wisdom<br/>\n<br/>\n~~I am a mother who is obviously frustrated but also saddened because<br/>\nI have gone out of my way to accomodate him. I am still willing to<br/>\ndo so but I am beginning to feel like a villan. He told me this<br/>\nmorning that he wants to go to school. I think to myself, &quot;you HATE<br/>\nschool work so why would you want to go to school?&quot;~~<br/>\n<br/>\nSo his Mom isn&#39;t the one nagging him at least? So there are other kids<br/>\nthat suffer with him? I think home should be a haven from all that<br/>\ncrap. If you&#39;re bringing it home, then no wonder he wants away from<br/>\nit. At least if you go to school, you can come home to get away from<br/>\nschool, right?<br/>\n<br/>\nYou&#39;re panicking based on a false system that has nothing to do with<br/>\nreal learning. Why should a 6 or 7 year old NEED reading or math<br/>\nskills? Truly. Those are picked up by doing what you love anyway. You<br/>\nrealize he&#39;s very young but you still have school baggage attached to<br/>\nsome mythological timeline.<br/>\n<br/>\nMy 14 y.o. learned to read at age 12. You wouldn&#39;t know him apart from<br/>\na child that learned at 6. Your child needs to be celebrated for<br/>\nexactly what he is interested in TODAY. He needs to have his very real<br/>\ninterests nourished. <br/>\n<br/>\nLet go of the idea that learning happens on some time table or that<br/>\ncertain skills are more important than others. They aren&#39;t. Trust that<br/>\nliving a full, rich life is more than enough. Trust your child more<br/>\nthan the school system. That&#39;s really all it takes.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186622753","msgId":25611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZHFmMStqOXNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDcwODA5MDAxNjMxLkVPV0g0OTgyLmlibTY3YWVjLmJlbGxzb3V0aC5uZXRAbWFpbC5iZWxsc291dGgubmV0Pg=="},"prevInTopic":25610,"nextInTopic":25613,"prevInTime":25610,"nextInTime":25612,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"~~Right now I am evaluating my lifestyle. I am seeing where I am maybe out of balance because of busy-ness. This busy-ness, I believe, is preventing me from","messageBody":"<div id=\"ygrps-yiv-794139004\">~~Right now I am evaluating my lifestyle. I am seeing where I am maybe<br/>\nout of balance because of busy-ness. This busy-ness, I believe, is<br/>\npreventing me from stopping and smelling the flowers with my kids.~~<br/>\n<br/>\n<br/>\nI got that feeling from some other comments you made. It could be<br/>\npartly that you&#39;re a &quot;results&quot; oriented person. But there is also that<br/>\nsocietal pressure to have a product, a result a SOMETHING to show for<br/>\nour effort.<br/>\n<br/>\nUnschooling is very Zen-like. We aren&#39;t focused on any end result.<br/>\nWe&#39;re not looking for a product. It&#39;s about joy in the moment. Not<br/>\nvery Western is it?:)<br/>\n<br/>\nBeing IN the moment with your child, seeing their joy, doing an<br/>\nactivity just because it&#39;s ENJOYABLE and knowing that it has<br/>\nvalue....that&#39;s the trust of unschooling. If you really think about<br/>\nthe way we learn best (the &quot;we&quot; being adults), that same freedom<br/>\napplies to kids. We have the freedom to stop or start something at<br/>\nwill. We have the freedom to learn whatever we choose, whenever we<br/>\nchoose with whatever tools we want to use. Kids should have that same<br/>\nfreedom, without anyone adding stress to the process by looking for<br/>\nany result.<br/>\n<br/>\nI would get pretty frustrated with my dh if he was judging or grading<br/>\nmy art or my knitting or my writing.  I do those things for the joy of<br/>\nit. When I want input, I ask for it. OTherwish I&#39;m free to do as much<br/>\nor little as I choose.<br/>\n<br/>\nI really believe John Holt hit the nail on the head when he said &quot;In<br/>\norder to trust the children, we must first learn to trust ourselves.&quot;<br/>\nThat&#39;s what it&#39;s all about, isn&#39;t it?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Seeking your advice and your wisdom","postDate":"1186622040","msgId":25610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZHBvbyt2c2kwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPg=="},"prevInTopic":25607,"nextInTopic":25611,"prevInTime":25609,"nextInTime":25611,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"~~I am a mother who is obviously frustrated but also saddened because I have gone out of my way to accomodate him. I am still willing to do so but I am","messageBody":"<div id=\"ygrps-yiv-1809556127\">~~I am a mother who is obviously frustrated but also saddened because<br/>\nI have gone out of my way to accomodate him. I am still willing to<br/>\ndo so but I am beginning to feel like a villan. He told me this<br/>\nmorning that he wants to go to school. I think to myself, &quot;you HATE<br/>\nschool work so why would you want to go to school?&quot;~~<br/>\n<br/>\nSo his Mom isn&#39;t the one nagging him at least? So there are other kids<br/>\nthat suffer with him? I think home should be a haven from all that<br/>\ncrap. If you&#39;re bringing it home, then no wonder he wants away from<br/>\nit. At least if you go to school, you can come home to get away from<br/>\nschool, right?<br/>\n<br/>\nYou&#39;re panicking based on a false system that has nothing to do with<br/>\nreal learning. Why should a 6 or 7 year old NEED reading or math<br/>\nskills? Truly. Those are picked up by doing what you love anyway. You<br/>\nrealize he&#39;s very young but you still have school baggage attached to<br/>\nsome mythological timeline.<br/>\n<br/>\nMy 14 y.o. learned to read at age 12. You wouldn&#39;t know him apart from<br/>\na child that learned at 6. Your child needs to be celebrated for<br/>\nexactly what he is interested in TODAY. He needs to have his very real<br/>\ninterests nourished. <br/>\n<br/>\nLet go of the idea that learning happens on some time table or that<br/>\ncertain skills are more important than others. They aren&#39;t. Trust that<br/>\nliving a full, rich life is more than enough. Trust your child more<br/>\nthan the school system. That&#39;s really all it takes.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: RE: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186618589","msgId":25607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA5MDAxNjMxLkVPV0g0OTgyLmlibTY3YWVjLmJlbGxzb3V0aC5uZXRAbWFpbC5iZWxsc291dGgubmV0Pg=="},"prevInTopic":25606,"nextInTopic":25610,"prevInTime":25606,"nextInTime":25608,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Your suggestions are really good, Cathy.  I have done that in the past in terms of deciphering what he had done all day in order to translate it to my hubby.","messageBody":"<div id=\"ygrps-yiv-867787250\">Your suggestions are really good, Cathy.  I have done that in the past in terms of deciphering what he had done all day in order to translate it to my hubby.  My hubby really is not micromanaging or anything.  Again, Kelly&#39;s response helped me to view this thing from a more authentic perspective.  I don&#39;t want to fail.  I don&#39;t want to be seen as a failure so that is why I abandoned my previous unschooling approach and started to do the school thing.<br/>\n<br/>\nRight now I am evaluating my lifestyle.  I am seeing where I am maybe out of balance because of busy-ness.  This busy-ness, I believe, is preventing me from stopping and smelling the flowers with my kids.  <br/>\n<br/>\nI truly appreciate your wisdom and suggestions.<br/>\n<br/>\nMuch Peace and Love<br/>\nTyra<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:chis31@...\">chis31@...</a><br/>\nDate: 2007/08/08 Wed PM 05:34:42 CDT<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: RE: [unschoolingbasics] Seeking your advice and your wisdom<br/>\n<br/>\n<br/>\n<br/>\nGetting around to my questions: Are we normal? For those who are <br/>\nmore laidback in their approach to learning, what suggestions do you <br/>\nhave for helping me to go back to relaxing with a child who is not <br/>\nschoolish? I remember a mother telling me that when her kids were <br/>\nages 5-7 they were hardest to homeschool because they are <br/>\ntransitioning from being self-centered (not in a bad way but based <br/>\non getting their needs met as an infant) to expanding their world <br/>\nview a bit more. She said it was not her favorite time to <br/>\nhomeschool any of them. So for anyone, did you have a similar <br/>\nexperience during these ages? I guess I want to know if we are <br/>\nnormal and will just have to work through this?<br/>\n<br/>\nThanks to any for your wisdom and suggestions in advance!<br/>\n<br/>\nPeacefully,<br/>\nTyra in Murfreesboro<br/>\n<br/>\n<br/>\nHey Tyra,<br/>\n<br/>\nI also have a darling hubbie who is quite traditional in his ideas about<br/>\nschoolwork, etc. Fortunately, like you, I have still got pretty much a free<br/>\nrein in how I home ed and my hubbie is mostly happy with it all. We do work<br/>\nout of or use reference texts every now and then.<br/>\n<br/>\nI wondered if this suggestion might help - if you got practiced at deciphering<br/>\nand recording the learning that was going on in whatever area it was happening,<br/>\nyou can still present your hubbie with the subjects done, they would just<br/>\nbe getting done in an experiential/hands-on way. You could take photos of<br/>\nthe activities and perhaps write in a quick description. If your son doesn&#39;t<br/>\nwant to write, maybe he might like to type a diary of weekly reflection.<br/>\nOr you could ask if it&#39;s okay to type up something you discussed together,<br/>\netc. I find the only record keeping worth doing is for myself these days,<br/>\nto reassure myself we ARE doing lots of great things. But it also comes in<br/>\nhandy for others to peruse and creates great familiy memories in the form<br/>\nof photos and artwork.  Most stuff can be done in &#39;real-life&#39;, even maths.<br/>\nThere are some good websites out there for ideas.<br/>\n<br/>\nThis is coming from having a son who has always hated doing &#39;schoolwork&#39;.<br/>\nI have become quite flexible in how he learns and have found that I try to<br/>\ncreate that environment as much as possible. I have also accepted that like<br/>\nmost of us, he learns in peaks and troughs and that when it looks lke nothing<br/>\nis happening, he is probably reflecting and synthesising.<br/>\n<br/>\nHang in there,<br/>\n<br/>\nCathy.</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186613739","msgId":25604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA4MjI1NTM5LkVGSU80OTgyLmlibTY3YWVjLmJlbGxzb3V0aC5uZXRAbWFpbC5iZWxsc291dGgubmV0Pg=="},"prevInTopic":25603,"nextInTopic":25605,"prevInTime":25603,"nextInTime":25605,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"THanks Joyce.  I appreciate that puzzling piece.  That makes sense to me.  I have witnessed my son s inclination toward understanding math. YOur points are","messageBody":"<div id=\"ygrps-yiv-96412471\">THanks Joyce.  I appreciate that puzzling piece.  That makes sense to me.  I have witnessed my son&#39;s inclination toward understanding math.  <br/>\n<br/>\nYOur points are well taken.  I will read the info at the link you provided.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\nFrom: Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;<br/>\nDate: 2007/08/08 Wed PM 05:41:52 CDT<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Seeking your advice and your wisdom<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Aug 8, 2007, at 12:58 PM, Tyra Olufemi wrote:<br/>\n<br/>\n&gt; IF he was a little more motivated to do SOMETHING, ANYTHING to learn<br/>\n&gt; to read and better understand math<br/>\n<br/>\nYour assumption is that math and reading can be learned by teaching.  <br/>\nSo when he&#39;s failing to do so, you&#39;re further assuming that he is at  <br/>\nfault.<br/>\n<br/>\nIf math and reading could be learned through teaching then schools  <br/>\nwould work like a charm.<br/>\n<br/>\nReading can&#39;t happen until a child is developmentally ready. No  <br/>\namount of practice will speed up the maturity of the brain areas that  <br/>\nneed to coordinate with each other in order to decode. Practice when  <br/>\na child isn&#39;t yet capable of reading will only make them feel like  <br/>\nthere&#39;s something wrong with them. What schools take credit for is  <br/>\ndevelopment that<br/>\n<br/>\nMath in school is presented ass backwards which is why so many people  <br/>\nleave school with math phobia. It&#39;s hoped that by presenting the  <br/>\nabstract that kids will figure out the concrete. Sadly even the kids  <br/>\nwho are good at math often don&#39;t! The abstract becomes like puzzles  <br/>\nto them and they can apply formulas without understanding how those  <br/>\nlook in the real world.<br/>\n<br/>\nEverything can be learned better by puzzling sense out of real world  <br/>\nchaos. It&#39;s how our brains were designed to function. We&#39;re designed  <br/>\nto pull order out of chaos. Haven&#39;t you ever stared at some object  <br/>\nyou couldn&#39;t quite figure out what it was until you did figure it  <br/>\nout? That&#39;s what the brain wants to do. It wants to put puzzles  <br/>\ntogether. It doesn&#39;t want already done puzzles handed to it. There&#39;s  <br/>\nno challenge, no joy in discovery. School hands kids the answer and  <br/>\nexpects them to memorize them. It&#39;s a very poor method of learning.  <br/>\nAnd it&#39;s why schools make learning seem hard. If you&#39;re going about  <br/>\nit in an unnatural way, of course it&#39;s difficult!<br/>\n<br/>\nTry reading at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nand that should help with the reading.<br/>\n<br/>\nMath is much harder to gain confidence in because schools do it so  <br/>\nwrong that it&#39;s hard to grasp how playing video games and board  <br/>\ngames, having an allowance, having their questions answered, could  <br/>\npossibly give them the same as school does. Of course it doesn&#39;t!  <br/>\nThey gain a far better conceptual understanding of how math works.  <br/>\nTheir ability to manipulate the abstract isn&#39;t what schooled kids is,  <br/>\nbut that&#39;s *way* easier to learn after gaining a fundamental  <br/>\nunderstanding than the other way around that schooled kids have to  <br/>\ndo. Schooled kids *look* like they understand math because they can  <br/>\ndo problems by rote, but it&#39;s just jumping through hoops for most of  <br/>\nthem.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":278087315,"authorName":"chis31@primusonline.com.au","from":"chis31@...","profile":"elendil722003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186613428","msgId":25603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OEZGNTdFMDAwMjA1NzhAY3BtczAxLmludC5pcHJpbXVzLm5ldC5hdT4=","inReplyToHeader":"IDwwMkJENTQxMC01Q0RELTQ5QzMtQjEyRi00MTU4QTc4MzY3NDFAZWFydGhsaW5rLm5ldD4="},"prevInTopic":25602,"nextInTopic":25604,"prevInTime":25602,"nextInTime":25604,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Your assumption is that math and reading can be learned by teaching. So when he s failing to do so, you re further assuming that he is at fault. WOOHOO","messageBody":"<div id=\"ygrps-yiv-1915566797\">Your assumption is that math and reading can be learned by teaching. <br/>\nSo when he&#39;s failing to do so, you&#39;re further assuming that he is at <br/>\nfault.<br/>\n<br/>\nWOOHOO JOYCE!!!!<br/>\n<br/>\nMan, I am loving this group. I am hearing stuff straight forward and honest<br/>\nand even though I have been reassuring folk around me for years about unschooling,<br/>\nit isn&#39;t until recently that I realised that I was sitting on the fence,<br/>\nsomewhere in the quiet recesses of my mind (hang on, those recesses aren&#39;t<br/>\nreally quiet at the moment, lol). I know all of this stuff and most of me<br/>\nwas there INTELLECTUALLY, but I am only just starting to OWN the idea of<br/>\nunschooling. Brilliant. <br/>\n<br/>\nThanks guys!<br/>\n<br/>\nCathy.</div>","specialLinks":[]},{"userId":278087315,"authorName":"chis31@primusonline.com.au","from":"chis31@...","profile":"elendil722003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186613001","msgId":25606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OEZGNTdFMDAwMjA1NTlAY3BtczAxLmludC5pcHJpbXVzLm5ldC5hdT4=","inReplyToHeader":"IDw4QzlBODAyM0MyOEJGNDYtRDE0LTc1RDZAd2VibWFpbC1tZjE1LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":25605,"nextInTopic":25607,"prevInTime":25605,"nextInTime":25607,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"... Wow, Kelly. I was on the edge of my seat reading your reply to this one. It really spoke to my experience where I am now - moving towards unschooling, but","messageBody":"<div id=\"ygrps-yiv-64620167\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;You weren&#39;t unschooling. You were just letting him be while you did <br/>\n&gt;other things. Unschooling is about trusting that he will learn when he <br/>\n&gt;is ready. That INCLUDES reading and math.<br/>\n<br/>\n </span></blockquote>Wow, Kelly.<br/>\n<br/>\nI was on the edge of my seat reading your reply to this one. It really spoke<br/>\nto my experience where I am now - moving towards unschooling, but having<br/>\nto be brutally honest with myself about WHY I need to be controlling. There<br/>\nare many parenting areas I feel secure and instinctively know I am doing<br/>\nthe right thing for my kids, but others, like in using anger and coercion,<br/>\nwhere I am needing to grow so much. I love metaphor and storytelling as ways<br/>\nto communicate knowledge, but there was something so great about your matter<br/>\nof fact answers to each of Tyra&#39;s thoughts that really helped me.<br/>\n<br/>\nCheers!<br/>\n<br/>\nCathy.</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186612912","msgId":25602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyQkQ1NDEwLTVDREQtNDlDMy1CMTJGLTQxNThBNzgzNjc0MUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPg==","referencesHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPg=="},"prevInTopic":25601,"nextInTopic":25603,"prevInTime":25601,"nextInTime":25603,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"... Your assumption is that math and reading can be learned by teaching. So when he s failing to do so, you re further assuming that he is at fault. If math","messageBody":"<div id=\"ygrps-yiv-1015798996\">On Aug 8, 2007, at 12:58 PM, Tyra Olufemi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; IF he was a little more motivated to do SOMETHING, ANYTHING to learn<br/>\n&gt; to read and better understand math<br/>\n<br/>\n </span></blockquote>Your assumption is that math and reading can be learned by teaching.  <br/>\nSo when he&#39;s failing to do so, you&#39;re further assuming that he is at  <br/>\nfault.<br/>\n<br/>\nIf math and reading could be learned through teaching then schools  <br/>\nwould work like a charm.<br/>\n<br/>\nReading can&#39;t happen until a child is developmentally ready. No  <br/>\namount of practice will speed up the maturity of the brain areas that  <br/>\nneed to coordinate with each other in order to decode. Practice when  <br/>\na child isn&#39;t yet capable of reading will only make them feel like  <br/>\nthere&#39;s something wrong with them. What schools take credit for is  <br/>\ndevelopment that<br/>\n<br/>\nMath in school is presented ass backwards which is why so many people  <br/>\nleave school with math phobia. It&#39;s hoped that by presenting the  <br/>\nabstract that kids will figure out the concrete. Sadly even the kids  <br/>\nwho are good at math often don&#39;t! The abstract becomes like puzzles  <br/>\nto them and they can apply formulas without understanding how those  <br/>\nlook in the real world.<br/>\n<br/>\nEverything can be learned better by puzzling sense out of real world  <br/>\nchaos. It&#39;s how our brains were designed to function. We&#39;re designed  <br/>\nto pull order out of chaos. Haven&#39;t you ever stared at some object  <br/>\nyou couldn&#39;t quite figure out what it was until you did figure it  <br/>\nout? That&#39;s what the brain wants to do. It wants to put puzzles  <br/>\ntogether. It doesn&#39;t want already done puzzles handed to it. There&#39;s  <br/>\nno challenge, no joy in discovery. School hands kids the answer and  <br/>\nexpects them to memorize them. It&#39;s a very poor method of learning.  <br/>\nAnd it&#39;s why schools make learning seem hard. If you&#39;re going about  <br/>\nit in an unnatural way, of course it&#39;s difficult!<br/>\n<br/>\nTry reading at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nand that should help with the reading.<br/>\n<br/>\nMath is much harder to gain confidence in because schools do it so  <br/>\nwrong that it&#39;s hard to grasp how playing video games and board  <br/>\ngames, having an allowance, having their questions answered, could  <br/>\npossibly give them the same as school does. Of course it doesn&#39;t!  <br/>\nThey gain a far better conceptual understanding of how math works.  <br/>\nTheir ability to manipulate the abstract isn&#39;t what schooled kids is,  <br/>\nbut that&#39;s *way* easier to learn after gaining a fundamental  <br/>\nunderstanding than the other way around that schooled kids have to  <br/>\ndo. Schooled kids *look* like they understand math because they can  <br/>\ndo problems by rote, but it&#39;s just jumping through hoops for most of  <br/>\nthem.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":278087315,"authorName":"chis31@primusonline.com.au","from":"chis31@...","profile":"elendil722003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186612482","msgId":25605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OEZGNTdFMDAwMjA1M0VAY3BtczAxLmludC5pcHJpbXVzLm5ldC5hdT4=","inReplyToHeader":"IDxmOWNzbzkrNGthckBlR3JvdXBzLmNvbT4="},"prevInTopic":25604,"nextInTopic":25606,"prevInTime":25604,"nextInTime":25606,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Getting around to my questions: Are we normal? For those who are more laidback in their approach to learning, what suggestions do you have for helping me to go","messageBody":"<div id=\"ygrps-yiv-401946538\">Getting around to my questions: Are we normal? For those who are <br/>\nmore laidback in their approach to learning, what suggestions do you <br/>\nhave for helping me to go back to relaxing with a child who is not <br/>\nschoolish? I remember a mother telling me that when her kids were <br/>\nages 5-7 they were hardest to homeschool because they are <br/>\ntransitioning from being self-centered (not in a bad way but based <br/>\non getting their needs met as an infant) to expanding their world <br/>\nview a bit more. She said it was not her favorite time to <br/>\nhomeschool any of them. So for anyone, did you have a similar <br/>\nexperience during these ages? I guess I want to know if we are <br/>\nnormal and will just have to work through this?<br/>\n<br/>\nThanks to any for your wisdom and suggestions in advance!<br/>\n<br/>\nPeacefully,<br/>\nTyra in Murfreesboro<br/>\n<br/>\n<br/>\nHey Tyra,<br/>\n<br/>\nI also have a darling hubbie who is quite traditional in his ideas about<br/>\nschoolwork, etc. Fortunately, like you, I have still got pretty much a free<br/>\nrein in how I home ed and my hubbie is mostly happy with it all. We do work<br/>\nout of or use reference texts every now and then.<br/>\n<br/>\nI wondered if this suggestion might help - if you got practiced at deciphering<br/>\nand recording the learning that was going on in whatever area it was happening,<br/>\nyou can still present your hubbie with the subjects done, they would just<br/>\nbe getting done in an experiential/hands-on way. You could take photos of<br/>\nthe activities and perhaps write in a quick description. If your son doesn&#39;t<br/>\nwant to write, maybe he might like to type a diary of weekly reflection.<br/>\nOr you could ask if it&#39;s okay to type up something you discussed together,<br/>\netc. I find the only record keeping worth doing is for myself these days,<br/>\nto reassure myself we ARE doing lots of great things. But it also comes in<br/>\nhandy for others to peruse and creates great familiy memories in the form<br/>\nof photos and artwork.  Most stuff can be done in &#39;real-life&#39;, even maths.<br/>\nThere are some good websites out there for ideas.<br/>\n<br/>\nThis is coming from having a son who has always hated doing &#39;schoolwork&#39;.<br/>\nI have become quite flexible in how he learns and have found that I try to<br/>\ncreate that environment as much as possible. I have also accepted that like<br/>\nmost of us, he learns in peaks and troughs and that when it looks lke nothing<br/>\nis happening, he is probably reflecting and synthesising.<br/>\n<br/>\nHang in there,<br/>\n<br/>\nCathy.</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186609981","msgId":25601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA4MjE1MzAxLkRaRkw0OTgyLmlibTY3YWVjLmJlbGxzb3V0aC5uZXRAbWFpbC5iZWxsc291dGgubmV0Pg=="},"prevInTopic":25600,"nextInTopic":25602,"prevInTime":25600,"nextInTime":25602,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"You know, sometimes we know and believe but we forget.  I think that is what has happened to me.  As I have pondered responses that I have received from my","messageBody":"<div id=\"ygrps-yiv-2067577338\">You know, sometimes we know and believe but we forget.  I think that is what has happened to me.  As I have pondered responses that I have received from my different groups, I think to myself that I need to get a bit more simplicity in my life.  I decided to homeschool him the first year that we started this learning at home thing.  It was after the utter failure of my schoolish approach.  But my life was way more simple and so I could see that he was learning.<br/>\n<br/>\nI still stand true that I do reside in insecurity.  What I gained for your words, Kelly, is to not scapegoat an take responsibility for what is really going on.  The truth is that I fear that I will fail at unschooling.  I am also clear that I fear having fingers point at me saying that I failed in some way.  All of this coupled with my busy-ness makes me want to do more structured things so that I can have a peace of mind that we are at least doing something.<br/>\n<br/>\nSo now I am off to ponder and determine how to integrate more simplicity so that I CAN see that my children are learning.<br/>\n<br/>\nPeace and thanks again<br/>\nTyra<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a><br/>\nDate: 2007/08/08 Wed PM 01:36:57 CDT<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Seeking your advice and your wisdom<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Tyra Olufemi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motherspirit@...\">motherspirit@...</a>&gt;<br/>\n<br/>\nIt was amazing because I pretty much went rad and did all I could to<br/>\nlift arbitrary controls on them, especially with respect to watching<br/>\nTV because I am pretty laidback regarding bedtime and eating anyway.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYou weren&#39;t unschooling. You were just letting him be while you did <br/>\nother things. Unschooling is about trusting that he will learn when he <br/>\nis ready. That INCLUDES reading and math.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI have loved unschooling but the problem for me is making sure that<br/>\nmy husband&#39;s desires are met with respect to his children learning.<br/>\nHe would prefer school at home but has pretty much left it all up to<br/>\nme.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDon&#39;t make this about your husband. It&#39;s not. It&#39;s about whether you <br/>\nthink your son will read on your schedule.<br/>\n<br/>\n-==-=-=-=-<br/>\n<br/>\nSo for my sons age 6 year/1st grade year, we have been laidback.  We<br/>\nhave had a great time.  I have also learned some things about me.  I<br/>\ncan be very structured and I can get things done.  Whatever I am<br/>\nmost interested in is what will draw me in.  There are many times<br/>\nwhen I find myself completly absorbed in working on my projects<br/>\n(such as launching my online business).  I don&#39;t particularly like<br/>\ndoing a lot of schoolish things anyway because he does not enjoy<br/>\nthem so we have not done a lot of structured learning in a<br/>\nconsistent way.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSo---it&#39;s OK for you to get drawn in my whatever you&#39;re most interested <br/>\nin, but he doesn&#39;t get the same freedom?<br/>\n<br/>\nHe doesn&#39;t enjoy schoolish things---what *does* he enjoy? Maybe we can <br/>\nshow you the math and reading in what he DOES love to do. Then you can <br/>\nrelax.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I have decided that I don&#39;t feel comfortable<br/>\nwaiting for my son to learn to read in his own time.  I don&#39;t want<br/>\nto push him but reading and math have been subjects that I seek to<br/>\nwork with him on eventhough we usually did so in a nontraditional<br/>\nway.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYOU don&#39;t feel comfortable.<br/>\n<br/>\nIf you don&#39;t believe he will, you&#39;re right. Buy a curriculum.<br/>\n<br/>\nWe used to talk about the paradigm shift here a lot. Until you can make <br/>\nthat shift, you will not be able to unschool.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nAs a result, I thought it would be best to introduce a little<br/>\nstructure into what we do.  I know my son is young, almost 7 yrs<br/>\nold.  I know he is a boy and boys learn best through movement.  I<br/>\nhave gone out of my way to accomodate his kinesthetic style of<br/>\nlearning.  We do an online reading program that is completely<br/>\ninteractive and the math program that I use is montessori based.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWhy are you looking to unschool? What do you think is so great about <br/>\nit? You don&#39;t believe it---that learning happens naturally. Why are you <br/>\nclinging to unschooling?<br/>\n<br/>\nIf you truly believe he needs to be reading at seven, buy the <br/>\ncurriculum, work with him every day, and believe you&#39;re teaching him to <br/>\nread.<br/>\n<br/>\nSeriously.<br/>\n<br/>\nUnschooling isn&#39;t for everyone. Way too many parents believe that <br/>\nreading and math programs will work. If you do, DO it. You really don&#39;t <br/>\nhave to unchool. There are zillions of curricula out there---there are <br/>\neven public and private and parochial and Montessoori and <br/>\nWaldorf/Steiner---all KINDS of schools as options. Unschooling may not <br/>\nbe the option for you.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIF he was a little more motivated to do SOMETHING, ANYTHING to learn<br/>\nto read and better understand math, I would not feel pressured to<br/>\ncarve out time (which is MAYBE an hour a day) to do these subjects.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd I guess if you were a little more motivated to learn about <br/>\nunschooling it would be working for you already. You&#39;re not ready.<br/>\n<br/>\nI could push you and push you. I could make you read articles and <br/>\nwebsites and books and elists and message boards and books and blogs. <br/>\nBut if you aren&#39;t motivated, it just doesn&#39;t matter how hard I push, <br/>\ndoes it? I could make it fun: I could make it interactive! I could <br/>\nprint articles on brightly colored paper. We could talk about it while <br/>\nwe jogged or swam or gardened. Would that make it more palatable? We <br/>\ncould make it a computer game: I give multiple choice or true/false <br/>\nquestions---and gold stars for the right answers. Would that make you <br/>\nlearn about unschooling faster? I could compare you to other moms who <br/>\nfigured it out faster---accelerated unschoolers! Or put you in the <br/>\nclass for---&quot;slow&quot; learners so that we could work harder (every day for <br/>\nan hour---one-on-one!) to get you to understand. I could find your <br/>\nlearning style and make sure we &quot;taught&quot; in the way you learned best.<br/>\n<br/>\nLearning doesn&#39;t happen like that. *YOU* must be the motivated party. <br/>\nHe&#39;s not motivated yet---which means he&#39;s not ready.<br/>\n<br/>\nHe&#39;s only seven. When he&#39;s ten and still struggling, what will you do? <br/>\nSend him to experts?<br/>\n<br/>\nWhen he&#39;s ten and reading, will you congratulate yourself for having <br/>\ntaught him to read?<br/>\n<br/>\nDid you do that when he learned to walk? You *did* teach him to walk, <br/>\nright? Right at 12 months?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nReally, I feel pressure to make sure that he learns certain things.<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\nFrom whom?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd just to be clear, there is no doubt in me that he will<br/>\neventually be able to do all of this on his own.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nThere *IS* doubt. BIG doubt. Don&#39;t kid yourself here. Go back and read <br/>\nwhat you wrote. Lots and lots of doubt.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n  Howvever, given this culture and my hubby&#39;s expectations, I truly feel <br/>\nlike we need<br/>\nto something more in a consistent manner than we have.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThen do that.<br/>\n<br/>\nBut you know what? We ALL live in this culture. The culture has nothing <br/>\nto do with whether you understand the philosophy and how to implement <br/>\nit.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWe have been doing math and reading everyday for MAYBE 2 weeks.  I<br/>\nthink it is only a week and a half.  I decided that we would SLOWLY<br/>\nintegrate doing these since we have not done much in the last month<br/>\nor so.  AGain, we are always learnng but maybe not actively engaged<br/>\nin math and reading.<br/>\n<br/>\n--=-=-=-=-<br/>\n<br/>\nYou&#39;re kidding yourself again.---Unless you have him locked in a room <br/>\nwith no written words and nothing to count with---you plug his ears, <br/>\nblindfold him, and bind his fingers and toes? &lt;g&gt; he IS actively <br/>\nlearning. You just need to start actually SEEING the learning.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI am a mother who is obviously frustrated but also saddened because<br/>\nI have gone out of my way to accomodate him.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYikes! He&#39;s your CHILD, and he&#39;s LEARNING. You&#39;re saddened because <br/>\nyou&#39;re going out of your way to &quot;accomodate&quot; him? He&#39;s seven, for <br/>\ncrying out loud!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I am still willing to do so but I am beginning to feel like a villan.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI don&#39;t understand. What do you think you are doing that&#39;s villanous? <br/>\nWhat does your son think you&#39;re doing that&#39;s villanous?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nHe told me this morning that he wants to go to school.  I think to <br/>\nmyself, &quot;you HATE<br/>\nschool work so why would you want to go to school?&quot;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo, he hates being having his mother as his teacher. A very common <br/>\nproblem in school-at-home families. Standards are high, pressure is <br/>\nhigh, and child feels like crap because he can&#39;t please his own <br/>\nmom---OR even complain to his mom and dad that his teacher sucks.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nGetting around to my questions:  Are we normal?  For those who are<br/>\nmore laidback in their approach to learning, what suggestions do you<br/>\nhave for helping me to go back to relaxing with a child who is not<br/>\nschoolish?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI&#39;m not sure I understand what you&#39;re asking. You want him to be <br/>\n&quot;schoolish?&quot;<br/>\n<br/>\nHow many of you unschoolers here have a &quot;schoolish&quot; child?<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I remember a mother telling me that when her kids were<br/>\nages 5-7 they were hardest to homeschool because they are<br/>\ntransitioning from being self-centered (not in a bad way but based<br/>\non getting their needs met as an infant) to expanding their world<br/>\nview a bit more.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo, they were having a hard time going from loved, cared-for *child* to <br/>\nattacked, pressured *student*!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n  She said it was not her favorite time to homeschool any of them.<br/>\n<br/>\n-=-===-<br/>\n<br/>\nAnd as she believes, so shall it be.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n So for anyone, did you have a similar experience during these ages?<br/>\n<br/>\n-=-=-<br/>\n<br/>\nNo, because we weren&#39;t trying to school-at-home. We just kept living <br/>\nrich, unschooled lives. Nothing changed.<br/>\n<br/>\nHad I been pushing reading and math, we probably would have.<br/>\n<br/>\nNot our reality though.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI guess I want to know if we are normal and will just have to work <br/>\nthrough this?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nDepends. Do you want to unschool or school-at-home?<br/>\n<br/>\nIf you choose to unschool, you will need to spend the next couple of <br/>\nyears DEschooling yourself before you can begin to unschool your son.<br/>\n<br/>\nIf you school-at-home, I&#39;m guessing you&#39;re just hitting the absolute, <br/>\ntiniest *tip* of the iceberg.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186607932","msgId":25599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA4MjExODUyLkRWUlk0OTgyLmlibTY3YWVjLmJlbGxzb3V0aC5uZXRAbWFpbC5iZWxsc291dGgubmV0Pg=="},"prevInTopic":25598,"nextInTopic":25600,"prevInTime":25598,"nextInTime":25600,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"I may have asked the wrong question.  I think I meant something else but don t know what.  Thanks for you input, though. Peace Tyra From: Janet","messageBody":"<div id=\"ygrps-yiv-1201780881\">I may have asked the wrong question.  I think I meant something else but don&#39;t know what.  Thanks for you input, though.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\nFrom: Janet &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:janeteg@...\">janeteg@...</a>&gt;<br/>\nDate: 2007/08/08 Wed PM 02:04:36 CDT<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Seeking your advice and your wisdom<br/>\n<br/>\nAt 01:36 PM 8/8/2007, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;How many of you unschoolers here have a &quot;schoolish&quot; child?<br/>\n<br/>\n </span></blockquote>Pfffft. LOL. 6 kids - all UNschooled, and not a one is &quot;schoolish&quot; or <br/>\ndoes lessons or anything like that.  They would rebel big time if I <br/>\npulled out workbooks LOL, and that&#39;s just fine with me! ;-) They <br/>\nlearn - when they are ready. I&#39;ve seen that work too many times to <br/>\nworry about it. I did try those &quot;lessons&quot; at home - 20 years ago. <br/>\nLasted ... maybe a week?!<br/>\n<br/>\nJanet in MN</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186607751","msgId":25600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA4MjExNTUxLkRWSVc0OTgyLmlibTY3YWVjLmJlbGxzb3V0aC5uZXRAbWFpbC5iZWxsc291dGgubmV0Pg=="},"prevInTopic":25599,"nextInTopic":25601,"prevInTime":25599,"nextInTime":25601,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Ouch, Kelly.  But thanks.  You have given me a lot to think about. Peace and Love Tyra From: kbcdlovejo@aol.com Date: 2007/08/08 Wed PM 01:36:57 CDT To:","messageBody":"<div id=\"ygrps-yiv-138798011\">Ouch, Kelly.  But thanks.  You have given me a lot to think about.<br/>\n<br/>\nPeace and Love<br/>\nTyra<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a><br/>\nDate: 2007/08/08 Wed PM 01:36:57 CDT<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Seeking your advice and your wisdom<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Tyra Olufemi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motherspirit@...\">motherspirit@...</a>&gt;<br/>\n<br/>\nIt was amazing because I pretty much went rad and did all I could to<br/>\nlift arbitrary controls on them, especially with respect to watching<br/>\nTV because I am pretty laidback regarding bedtime and eating anyway.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYou weren&#39;t unschooling. You were just letting him be while you did <br/>\nother things. Unschooling is about trusting that he will learn when he <br/>\nis ready. That INCLUDES reading and math.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI have loved unschooling but the problem for me is making sure that<br/>\nmy husband&#39;s desires are met with respect to his children learning.<br/>\nHe would prefer school at home but has pretty much left it all up to<br/>\nme.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDon&#39;t make this about your husband. It&#39;s not. It&#39;s about whether you <br/>\nthink your son will read on your schedule.<br/>\n<br/>\n-==-=-=-=-<br/>\n<br/>\nSo for my sons age 6 year/1st grade year, we have been laidback.  We<br/>\nhave had a great time.  I have also learned some things about me.  I<br/>\ncan be very structured and I can get things done.  Whatever I am<br/>\nmost interested in is what will draw me in.  There are many times<br/>\nwhen I find myself completly absorbed in working on my projects<br/>\n(such as launching my online business).  I don&#39;t particularly like<br/>\ndoing a lot of schoolish things anyway because he does not enjoy<br/>\nthem so we have not done a lot of structured learning in a<br/>\nconsistent way.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSo---it&#39;s OK for you to get drawn in my whatever you&#39;re most interested <br/>\nin, but he doesn&#39;t get the same freedom?<br/>\n<br/>\nHe doesn&#39;t enjoy schoolish things---what *does* he enjoy? Maybe we can <br/>\nshow you the math and reading in what he DOES love to do. Then you can <br/>\nrelax.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I have decided that I don&#39;t feel comfortable<br/>\nwaiting for my son to learn to read in his own time.  I don&#39;t want<br/>\nto push him but reading and math have been subjects that I seek to<br/>\nwork with him on eventhough we usually did so in a nontraditional<br/>\nway.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYOU don&#39;t feel comfortable.<br/>\n<br/>\nIf you don&#39;t believe he will, you&#39;re right. Buy a curriculum.<br/>\n<br/>\nWe used to talk about the paradigm shift here a lot. Until you can make <br/>\nthat shift, you will not be able to unschool.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nAs a result, I thought it would be best to introduce a little<br/>\nstructure into what we do.  I know my son is young, almost 7 yrs<br/>\nold.  I know he is a boy and boys learn best through movement.  I<br/>\nhave gone out of my way to accomodate his kinesthetic style of<br/>\nlearning.  We do an online reading program that is completely<br/>\ninteractive and the math program that I use is montessori based.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWhy are you looking to unschool? What do you think is so great about <br/>\nit? You don&#39;t believe it---that learning happens naturally. Why are you <br/>\nclinging to unschooling?<br/>\n<br/>\nIf you truly believe he needs to be reading at seven, buy the <br/>\ncurriculum, work with him every day, and believe you&#39;re teaching him to <br/>\nread.<br/>\n<br/>\nSeriously.<br/>\n<br/>\nUnschooling isn&#39;t for everyone. Way too many parents believe that <br/>\nreading and math programs will work. If you do, DO it. You really don&#39;t <br/>\nhave to unchool. There are zillions of curricula out there---there are <br/>\neven public and private and parochial and Montessoori and <br/>\nWaldorf/Steiner---all KINDS of schools as options. Unschooling may not <br/>\nbe the option for you.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIF he was a little more motivated to do SOMETHING, ANYTHING to learn<br/>\nto read and better understand math, I would not feel pressured to<br/>\ncarve out time (which is MAYBE an hour a day) to do these subjects.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd I guess if you were a little more motivated to learn about <br/>\nunschooling it would be working for you already. You&#39;re not ready.<br/>\n<br/>\nI could push you and push you. I could make you read articles and <br/>\nwebsites and books and elists and message boards and books and blogs. <br/>\nBut if you aren&#39;t motivated, it just doesn&#39;t matter how hard I push, <br/>\ndoes it? I could make it fun: I could make it interactive! I could <br/>\nprint articles on brightly colored paper. We could talk about it while <br/>\nwe jogged or swam or gardened. Would that make it more palatable? We <br/>\ncould make it a computer game: I give multiple choice or true/false <br/>\nquestions---and gold stars for the right answers. Would that make you <br/>\nlearn about unschooling faster? I could compare you to other moms who <br/>\nfigured it out faster---accelerated unschoolers! Or put you in the <br/>\nclass for---&quot;slow&quot; learners so that we could work harder (every day for <br/>\nan hour---one-on-one!) to get you to understand. I could find your <br/>\nlearning style and make sure we &quot;taught&quot; in the way you learned best.<br/>\n<br/>\nLearning doesn&#39;t happen like that. *YOU* must be the motivated party. <br/>\nHe&#39;s not motivated yet---which means he&#39;s not ready.<br/>\n<br/>\nHe&#39;s only seven. When he&#39;s ten and still struggling, what will you do? <br/>\nSend him to experts?<br/>\n<br/>\nWhen he&#39;s ten and reading, will you congratulate yourself for having <br/>\ntaught him to read?<br/>\n<br/>\nDid you do that when he learned to walk? You *did* teach him to walk, <br/>\nright? Right at 12 months?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nReally, I feel pressure to make sure that he learns certain things.<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\nFrom whom?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd just to be clear, there is no doubt in me that he will<br/>\neventually be able to do all of this on his own.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nThere *IS* doubt. BIG doubt. Don&#39;t kid yourself here. Go back and read <br/>\nwhat you wrote. Lots and lots of doubt.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n  Howvever, given this culture and my hubby&#39;s expectations, I truly feel <br/>\nlike we need<br/>\nto something more in a consistent manner than we have.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThen do that.<br/>\n<br/>\nBut you know what? We ALL live in this culture. The culture has nothing <br/>\nto do with whether you understand the philosophy and how to implement <br/>\nit.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWe have been doing math and reading everyday for MAYBE 2 weeks.  I<br/>\nthink it is only a week and a half.  I decided that we would SLOWLY<br/>\nintegrate doing these since we have not done much in the last month<br/>\nor so.  AGain, we are always learnng but maybe not actively engaged<br/>\nin math and reading.<br/>\n<br/>\n--=-=-=-=-<br/>\n<br/>\nYou&#39;re kidding yourself again.---Unless you have him locked in a room <br/>\nwith no written words and nothing to count with---you plug his ears, <br/>\nblindfold him, and bind his fingers and toes? &lt;g&gt; he IS actively <br/>\nlearning. You just need to start actually SEEING the learning.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI am a mother who is obviously frustrated but also saddened because<br/>\nI have gone out of my way to accomodate him.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYikes! He&#39;s your CHILD, and he&#39;s LEARNING. You&#39;re saddened because <br/>\nyou&#39;re going out of your way to &quot;accomodate&quot; him? He&#39;s seven, for <br/>\ncrying out loud!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I am still willing to do so but I am beginning to feel like a villan.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI don&#39;t understand. What do you think you are doing that&#39;s villanous? <br/>\nWhat does your son think you&#39;re doing that&#39;s villanous?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nHe told me this morning that he wants to go to school.  I think to <br/>\nmyself, &quot;you HATE<br/>\nschool work so why would you want to go to school?&quot;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo, he hates being having his mother as his teacher. A very common <br/>\nproblem in school-at-home families. Standards are high, pressure is <br/>\nhigh, and child feels like crap because he can&#39;t please his own <br/>\nmom---OR even complain to his mom and dad that his teacher sucks.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nGetting around to my questions:  Are we normal?  For those who are<br/>\nmore laidback in their approach to learning, what suggestions do you<br/>\nhave for helping me to go back to relaxing with a child who is not<br/>\nschoolish?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI&#39;m not sure I understand what you&#39;re asking. You want him to be <br/>\n&quot;schoolish?&quot;<br/>\n<br/>\nHow many of you unschoolers here have a &quot;schoolish&quot; child?<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I remember a mother telling me that when her kids were<br/>\nages 5-7 they were hardest to homeschool because they are<br/>\ntransitioning from being self-centered (not in a bad way but based<br/>\non getting their needs met as an infant) to expanding their world<br/>\nview a bit more.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo, they were having a hard time going from loved, cared-for *child* to <br/>\nattacked, pressured *student*!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n  She said it was not her favorite time to homeschool any of them.<br/>\n<br/>\n-=-===-<br/>\n<br/>\nAnd as she believes, so shall it be.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n So for anyone, did you have a similar experience during these ages?<br/>\n<br/>\n-=-=-<br/>\n<br/>\nNo, because we weren&#39;t trying to school-at-home. We just kept living <br/>\nrich, unschooled lives. Nothing changed.<br/>\n<br/>\nHad I been pushing reading and math, we probably would have.<br/>\n<br/>\nNot our reality though.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI guess I want to know if we are normal and will just have to work <br/>\nthrough this?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nDepends. Do you want to unschool or school-at-home?<br/>\n<br/>\nIf you choose to unschool, you will need to spend the next couple of <br/>\nyears DEschooling yourself before you can begin to unschool your son.<br/>\n<br/>\nIf you school-at-home, I&#39;m guessing you&#39;re just hitting the absolute, <br/>\ntiniest *tip* of the iceberg.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186606995","msgId":25598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzIwMWM3ZDlmZiQ4OWNhYjZjMCRmYjhhZGNjY0BPZmZpY2U+","referencesHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPiA8OEM5QTgwMjNDMjhCRjQ2LUQxNC03NUQ2QHdlYm1haWwtbWYxNS5zeXNvcHMuYW9sLmNvbT4gPEIwMjUzMDA3Mzk4QHJydi5uZXQ+"},"prevInTopic":25597,"nextInTopic":25599,"prevInTime":25597,"nextInTime":25599,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Janet where in MN do you live?? Alex in MN ... From: Janet To: unschoolingbasics@yahoogroups.com Sent: Wednesday, August 08, 2007 2:04 PM Subject: Re:","messageBody":"<div id=\"ygrps-yiv-866475609\">Janet where in MN do you live??<br/>\nAlex in MN<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Janet <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, August 08, 2007 2:04 PM<br/>\n  Subject: Re: [unschoolingbasics] Seeking your advice and your wisdom<br/>\n<br/>\n<br/>\n  At 01:36 PM 8/8/2007, you wrote:<br/>\n  &gt;How many of you unschoolers here have a &quot;schoolish&quot; child?<br/>\n<br/>\n  Pfffft. LOL. 6 kids - all UNschooled, and not a one is &quot;schoolish&quot; or <br/>\n  does lessons or anything like that. They would rebel big time if I <br/>\n  pulled out workbooks LOL, and that&#39;s just fine with me! ;-) They <br/>\n  learn - when they are ready. I&#39;ve seen that work too many times to <br/>\n  worry about it. I did try those &quot;lessons&quot; at home - 20 years ago. <br/>\n  Lasted ... maybe a week?!<br/>\n<br/>\n  Janet in MN<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":187841659,"authorName":"Janet","from":"Janet &lt;janeteg@...&gt;","profile":"janeteg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186599876","msgId":25597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMjUzMDA3Mzk4QHJydi5uZXQ+","inReplyToHeader":"PDhDOUE4MDIzQzI4QkY0Ni1EMTQtNzVENkB3ZWJtYWlsLW1mMTUuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPiA8OEM5QTgwMjNDMjhCRjQ2LUQxNC03NUQ2QHdlYm1haWwtbWYxNS5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":25595,"nextInTopic":25598,"prevInTime":25596,"nextInTime":25598,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"... Pfffft. LOL. 6 kids - all UNschooled, and not a one is schoolish or does lessons or anything like that.  They would rebel big time if I pulled out","messageBody":"<div id=\"ygrps-yiv-1359781996\">At 01:36 PM 8/8/2007, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;How many of you unschoolers here have a &quot;schoolish&quot; child?<br/>\n<br/>\n </span></blockquote>Pfffft. LOL. 6 kids - all UNschooled, and not a one is &quot;schoolish&quot; or <br/>\ndoes lessons or anything like that.  They would rebel big time if I <br/>\npulled out workbooks LOL, and that&#39;s just fine with me! ;-) They <br/>\nlearn - when they are ready. I&#39;ve seen that work too many times to <br/>\nworry about it. I did try those &quot;lessons&quot; at home - 20 years ago. <br/>\nLasted ... maybe a week?!<br/>\n<br/>\nJanet in MN</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Seeking your advice and your wisdom","postDate":"1186598217","msgId":25595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUE4MDIzQzI4QkY0Ni1EMTQtNzVENkB3ZWJtYWlsLW1mMTUuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPg==","referencesHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPg=="},"prevInTopic":25593,"nextInTopic":25597,"prevInTime":25594,"nextInTime":25596,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"... From: Tyra Olufemi  It was amazing because I pretty much went rad and did all I could to lift arbitrary controls on them,","messageBody":"<div id=\"ygrps-yiv-784813207\">-----Original Message-----<br/>\nFrom: Tyra Olufemi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motherspirit@...\">motherspirit@...</a>&gt;<br/>\n<br/>\nIt was amazing because I pretty much went rad and did all I could to<br/>\nlift arbitrary controls on them, especially with respect to watching<br/>\nTV because I am pretty laidback regarding bedtime and eating anyway.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYou weren&#39;t unschooling. You were just letting him be while you did <br/>\nother things. Unschooling is about trusting that he will learn when he <br/>\nis ready. That INCLUDES reading and math.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI have loved unschooling but the problem for me is making sure that<br/>\nmy husband&#39;s desires are met with respect to his children learning.<br/>\nHe would prefer school at home but has pretty much left it all up to<br/>\nme.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDon&#39;t make this about your husband. It&#39;s not. It&#39;s about whether you <br/>\nthink your son will read on your schedule.<br/>\n<br/>\n-==-=-=-=-<br/>\n<br/>\nSo for my sons age 6 year/1st grade year, we have been laidback.  We<br/>\nhave had a great time.  I have also learned some things about me.  I<br/>\ncan be very structured and I can get things done.  Whatever I am<br/>\nmost interested in is what will draw me in.  There are many times<br/>\nwhen I find myself completly absorbed in working on my projects<br/>\n(such as launching my online business).  I don&#39;t particularly like<br/>\ndoing a lot of schoolish things anyway because he does not enjoy<br/>\nthem so we have not done a lot of structured learning in a<br/>\nconsistent way.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSo---it&#39;s OK for you to get drawn in my whatever you&#39;re most interested <br/>\nin, but he doesn&#39;t get the same freedom?<br/>\n<br/>\nHe doesn&#39;t enjoy schoolish things---what *does* he enjoy? Maybe we can <br/>\nshow you the math and reading in what he DOES love to do. Then you can <br/>\nrelax.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I have decided that I don&#39;t feel comfortable<br/>\nwaiting for my son to learn to read in his own time.  I don&#39;t want<br/>\nto push him but reading and math have been subjects that I seek to<br/>\nwork with him on eventhough we usually did so in a nontraditional<br/>\nway.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYOU don&#39;t feel comfortable.<br/>\n<br/>\nIf you don&#39;t believe he will, you&#39;re right. Buy a curriculum.<br/>\n<br/>\nWe used to talk about the paradigm shift here a lot. Until you can make <br/>\nthat shift, you will not be able to unschool.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nAs a result, I thought it would be best to introduce a little<br/>\nstructure into what we do.  I know my son is young, almost 7 yrs<br/>\nold.  I know he is a boy and boys learn best through movement.  I<br/>\nhave gone out of my way to accomodate his kinesthetic style of<br/>\nlearning.  We do an online reading program that is completely<br/>\ninteractive and the math program that I use is montessori based.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWhy are you looking to unschool? What do you think is so great about <br/>\nit? You don&#39;t believe it---that learning happens naturally. Why are you <br/>\nclinging to unschooling?<br/>\n<br/>\nIf you truly believe he needs to be reading at seven, buy the <br/>\ncurriculum, work with him every day, and believe you&#39;re teaching him to <br/>\nread.<br/>\n<br/>\nSeriously.<br/>\n<br/>\nUnschooling isn&#39;t for everyone. Way too many parents believe that <br/>\nreading and math programs will work. If you do, DO it. You really don&#39;t <br/>\nhave to unchool. There are zillions of curricula out there---there are <br/>\neven public and private and parochial and Montessoori and <br/>\nWaldorf/Steiner---all KINDS of schools as options. Unschooling may not <br/>\nbe the option for you.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIF he was a little more motivated to do SOMETHING, ANYTHING to learn<br/>\nto read and better understand math, I would not feel pressured to<br/>\ncarve out time (which is MAYBE an hour a day) to do these subjects.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd I guess if you were a little more motivated to learn about <br/>\nunschooling it would be working for you already. You&#39;re not ready.<br/>\n<br/>\nI could push you and push you. I could make you read articles and <br/>\nwebsites and books and elists and message boards and books and blogs. <br/>\nBut if you aren&#39;t motivated, it just doesn&#39;t matter how hard I push, <br/>\ndoes it? I could make it fun: I could make it interactive! I could <br/>\nprint articles on brightly colored paper. We could talk about it while <br/>\nwe jogged or swam or gardened. Would that make it more palatable? We <br/>\ncould make it a computer game: I give multiple choice or true/false <br/>\nquestions---and gold stars for the right answers. Would that make you <br/>\nlearn about unschooling faster? I could compare you to other moms who <br/>\nfigured it out faster---accelerated unschoolers! Or put you in the <br/>\nclass for---&quot;slow&quot; learners so that we could work harder (every day for <br/>\nan hour---one-on-one!) to get you to understand. I could find your <br/>\nlearning style and make sure we &quot;taught&quot; in the way you learned best.<br/>\n<br/>\nLearning doesn&#39;t happen like that. *YOU* must be the motivated party. <br/>\nHe&#39;s not motivated yet---which means he&#39;s not ready.<br/>\n<br/>\nHe&#39;s only seven. When he&#39;s ten and still struggling, what will you do? <br/>\nSend him to experts?<br/>\n<br/>\nWhen he&#39;s ten and reading, will you congratulate yourself for having <br/>\ntaught him to read?<br/>\n<br/>\nDid you do that when he learned to walk? You *did* teach him to walk, <br/>\nright? Right at 12 months?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nReally, I feel pressure to make sure that he learns certain things.<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\nFrom whom?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd just to be clear, there is no doubt in me that he will<br/>\neventually be able to do all of this on his own.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nThere *IS* doubt. BIG doubt. Don&#39;t kid yourself here. Go back and read <br/>\nwhat you wrote. Lots and lots of doubt.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n  Howvever, given this culture and my hubby&#39;s expectations, I truly feel <br/>\nlike we need<br/>\nto something more in a consistent manner than we have.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThen do that.<br/>\n<br/>\nBut you know what? We ALL live in this culture. The culture has nothing <br/>\nto do with whether you understand the philosophy and how to implement <br/>\nit.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWe have been doing math and reading everyday for MAYBE 2 weeks.  I<br/>\nthink it is only a week and a half.  I decided that we would SLOWLY<br/>\nintegrate doing these since we have not done much in the last month<br/>\nor so.  AGain, we are always learnng but maybe not actively engaged<br/>\nin math and reading.<br/>\n<br/>\n--=-=-=-=-<br/>\n<br/>\nYou&#39;re kidding yourself again.---Unless you have him locked in a room <br/>\nwith no written words and nothing to count with---you plug his ears, <br/>\nblindfold him, and bind his fingers and toes? &lt;g&gt; he IS actively <br/>\nlearning. You just need to start actually SEEING the learning.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI am a mother who is obviously frustrated but also saddened because<br/>\nI have gone out of my way to accomodate him.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYikes! He&#39;s your CHILD, and he&#39;s LEARNING. You&#39;re saddened because <br/>\nyou&#39;re going out of your way to &quot;accomodate&quot; him? He&#39;s seven, for <br/>\ncrying out loud!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I am still willing to do so but I am beginning to feel like a villan.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI don&#39;t understand. What do you think you are doing that&#39;s villanous? <br/>\nWhat does your son think you&#39;re doing that&#39;s villanous?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nHe told me this morning that he wants to go to school.  I think to <br/>\nmyself, &quot;you HATE<br/>\nschool work so why would you want to go to school?&quot;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo, he hates being having his mother as his teacher. A very common <br/>\nproblem in school-at-home families. Standards are high, pressure is <br/>\nhigh, and child feels like crap because he can&#39;t please his own <br/>\nmom---OR even complain to his mom and dad that his teacher sucks.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nGetting around to my questions:  Are we normal?  For those who are<br/>\nmore laidback in their approach to learning, what suggestions do you<br/>\nhave for helping me to go back to relaxing with a child who is not<br/>\nschoolish?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI&#39;m not sure I understand what you&#39;re asking. You want him to be <br/>\n&quot;schoolish?&quot;<br/>\n<br/>\nHow many of you unschoolers here have a &quot;schoolish&quot; child?<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I remember a mother telling me that when her kids were<br/>\nages 5-7 they were hardest to homeschool because they are<br/>\ntransitioning from being self-centered (not in a bad way but based<br/>\non getting their needs met as an infant) to expanding their world<br/>\nview a bit more.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo, they were having a hard time going from loved, cared-for *child* to <br/>\nattacked, pressured *student*!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n  She said it was not her favorite time to homeschool any of them.<br/>\n<br/>\n-=-===-<br/>\n<br/>\nAnd as she believes, so shall it be.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n So for anyone, did you have a similar experience during these ages?<br/>\n<br/>\n-=-=-<br/>\n<br/>\nNo, because we weren&#39;t trying to school-at-home. We just kept living <br/>\nrich, unschooled lives. Nothing changed.<br/>\n<br/>\nHad I been pushing reading and math, we probably would have.<br/>\n<br/>\nNot our reality though.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI guess I want to know if we are normal and will just have to work <br/>\nthrough this?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nDepends. Do you want to unschool or school-at-home?<br/>\n<br/>\nIf you choose to unschool, you will need to spend the next couple of <br/>\nyears DEschooling yourself before you can begin to unschool your son.<br/>\n<br/>\nIf you school-at-home, I&#39;m guessing you&#39;re just hitting the absolute, <br/>\ntiniest *tip* of the iceberg.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":183015595,"authorName":"Tyra Olufemi","from":"&quot;Tyra Olufemi&quot; &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Seeking your advice and your wisdom","postDate":"1186592329","msgId":25593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5Y3NvOSs0a2FyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25595,"prevInTime":25590,"nextInTime":25594,"topicId":25593,"numMessagesInTopic":0,"msgSnippet":"Below I will list a message that I have posted to the groups with mix of hs/unschool styles.  I am posting it hear completely willing and open to unschool but","messageBody":"<div id=\"ygrps-yiv-511968303\">Below I will list a message that I have posted to the groups with <br/>\nmix of hs/unschool styles.  I am posting it hear completely willing <br/>\nand open to unschool but I guess needing to find my security in it <br/>\nagain.  I have pretty much unschooled...my children continue to <br/>\nlearn, but I still feel fearful that my older son is a late reader <br/>\nand somehow I will be looked as having failed him if he does not get <br/>\nthe &quot;basics.&quot;  JUst keeping it real but truly wanting to find the <br/>\nbest way for us to do this.  Thanks in advance for your responses.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\n<br/>\nPeace to you all!<br/>\n<br/>\nI seek balance in helping my son to learn.  He started as a young <br/>\nhomeschooler.  He turned 5 in September 05 and we semi-began in May <br/>\nof that year (I began with my umbrella schools calendar and because <br/>\nI knew we were moving sometime in September/Ocotober.)<br/>\n<br/>\nI started out as a scared neophyte who merely did not want to fail <br/>\nher child in his home education experience.  QUICKLY we got burned <br/>\nout.  It was right around the time that I had been learning more <br/>\nabout unschooling.  We moved at the end of Septemeber and that began <br/>\nour unschooling experience for the next couple of months.<br/>\n<br/>\nIt was amazing because I pretty much went rad and did all I could to <br/>\nlift arbitrary controls on them, especially with respect to watching <br/>\nTV because I am pretty laidback regarding bedtime and eating anyway.<br/>\n<br/>\nI have loved unschooling but the problem for me is making sure that <br/>\nmy husband&#39;s desires are met with respect to his children learning.  <br/>\nHe would prefer school at home but has pretty much left it all up to <br/>\nme.<br/>\n<br/>\nSo for my sons age 6 year/1st grade year, we have been laidback.  We <br/>\nhave had a great time.  I have also learned some things about me.  I <br/>\ncan be very structured and I can get things done.  Whatever I am <br/>\nmost interested in is what will draw me in.  There are many times <br/>\nwhen I find myself completly absorbed in working on my projects <br/>\n(such as launching my online business).  I don&#39;t particularly like <br/>\ndoing a lot of schoolish things anyway because he does not enjoy <br/>\nthem so we have not done a lot of structured learning in a <br/>\nconsistent way.  I have decided that I don&#39;t feel comfortable <br/>\nwaiting for my son to learn to read in his own time.  I don&#39;t want <br/>\nto push him but reading and math have been subjects that I seek to <br/>\nwork with him on eventhough we usually did so in a nontraditional <br/>\nway.<br/>\n<br/>\nBut our lives are getting a wee bit busier.  Though I seek to scale <br/>\noutside activities back, really we are happier when we do things on <br/>\nthe go.  We do fieldtrips, hs pe, hs chess club and sometimes my son <br/>\nwill participate in a sport.  I continue to work on my business and <br/>\nam even going to work a few hours outside my home.<br/>\n<br/>\nAs a result, I thought it would be best to introduce a little <br/>\nstructure into what we do.  I know my son is young, almost 7 yrs <br/>\nold.  I know he is a boy and boys learn best through movement.  I <br/>\nhave gone out of my way to accomodate his kinesthetic style of <br/>\nlearning.  We do an online reading program that is completely <br/>\ninteractive and the math program that I use is montessori based. <br/>\n<br/>\nIF he was a little more motivated to do SOMETHING, ANYTHING to learn <br/>\nto read and better understand math, I would not feel pressured to <br/>\ncarve out time (which is MAYBE an hour a day) to do these subjects.  <br/>\nReally, I feel pressure to make sure that he learns certain things.  <br/>\nAnd just to be clear, there is no doubt in me that he will <br/>\neventually be able to do all of this on his own.  Howvever, given <br/>\nthis culture and my hubby&#39;s expectations, I truly feel like we need <br/>\nto something more in a consistent manner than we have.<br/>\n<br/>\nWe have been doing math and reading everyday for MAYBE 2 weeks.  I <br/>\nthink it is only a week and a half.  I decided that we would SLOWLY <br/>\nintegrate doing these since we have not done much in the last month <br/>\nor so.  AGain, we are always learnng but maybe not actively engaged <br/>\nin math and reading.<br/>\n<br/>\nI am a mother who is obviously frustrated but also saddened because <br/>\nI have gone out of my way to accomodate him.  I am still willing to <br/>\ndo so but I am beginning to feel like a villan.  He told me this <br/>\nmorning that he wants to go to school.  I think to myself, &quot;you HATE <br/>\nschool work so why would you want to go to school?&quot;<br/>\n<br/>\nGetting around to my questions:  Are we normal?  For those who are <br/>\nmore laidback in their approach to learning, what suggestions do you <br/>\nhave for helping me to go back to relaxing with a child who is not <br/>\nschoolish?  I remember a mother telling me that when her kids were <br/>\nages 5-7 they were hardest to homeschool because they are <br/>\ntransitioning from being self-centered (not in a bad way but based <br/>\non getting their needs met as an infant) to expanding their world <br/>\nview a bit more.  She said it was not her favorite time to <br/>\nhomeschool any of them.  So for anyone, did you have a similar <br/>\nexperience during these ages?  I guess I want to know if we are <br/>\nnormal and will just have to work through this?<br/>\n<br/>\nThanks to any for your wisdom and suggestions in advance!<br/>\n<br/>\nPeacefully,<br/>\nTyra in Murfreesboro</div>","specialLinks":[]}],"prevTopicId":25751,"nextTopicId":25873}}