{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling and college/intro","postDate":"1089977898","msgId":2137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMUQzNjY5LjI5MjBDJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDgwMWM0NmFlNiQxNTAyNDg3MCQ2NDAyYThjMEAyMDAyZGVza3RvcD4="},"prevInTopic":2134,"nextInTopic":0,"prevInTime":2136,"nextInTime":2138,"topicId":2122,"numMessagesInTopic":0,"msgSnippet":"... Yes, that was me :-) It was on the Unschooling.com message baords and then at UnschoolingDiscussion. In fact the whole post was about unschoolers getting","messageBody":"<div id=\"ygrps-yiv-803107470\">on 7/15/04 11:36 PM, catherine aceto at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aceto3@...\">aceto3@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If that wasn&#39;t Joyce - then my apologies to Joyce and whoever actually said<br/>\n&gt; it! <br/>\n<br/>\n </span></blockquote>Yes, that was me :-) It was on the Unschooling.com message baords and then<br/>\nat UnschoolingDiscussion. In fact the whole post was about unschoolers<br/>\ngetting into college:<br/>\n<br/>\n=====<br/>\n<br/>\nBy Jfetteroll (Jfetteroll) on Tuesday, April 27, 2004 - 06:29 am:<br/>\n<br/>\n**Maybe it&#39;s just simple fear holding me back from unschooling.**<br/>\n<br/>\nLet&#39;s say you&#39;re certain that the only way to keep from drowning is to strap<br/>\non as many swimmies as you can and hold onto the side of the pool. If<br/>\nsomeone says they&#39;ve taken off their swimmies and has let go of the side,<br/>\nthe only apparent outcome for them it seems is drowning.<br/>\n<br/>\nIf we take away school, it seems like we&#39;re left with nothing between birth<br/>\nand college or job.<br/>\n<br/>\nThis site is about what fills that hole left by school.<br/>\n<br/>\nThe amazing thing is that once you get school out of life, you realize that<br/>\nschool wasn&#39;t a natural part of life and didn&#39;t leave a hole.<br/>\n<br/>\nSchool is like a stack of dry books on ³all the stuff it¹s important to<br/>\nknow² in a windowless room. When people first hear of unschooling, it sounds<br/>\nlike we&#39;re removing the dry books and leaving kids in a windowless room. But<br/>\nwe&#39;re removing the windowless room to let kids see they&#39;re in the middle of<br/>\na vast library full of wonderful media to explore. They could look at the<br/>\ndry books, but they probably won&#39;t because they have much more interesting<br/>\nways of exploring the same things.<br/>\n<br/>\n**I just fear they won&#39;t learn enough to get by.**<br/>\n<br/>\nSchool is like a grocery store. It&#39;s everything you might need to cook with.<br/>\nAnd what schools do is spend 12 years cramming the entire grocery store into<br/>\nkids so they can be prepared to cook anything they want.<br/>\n<br/>\nBut how much of the grocery store do you ever use?<br/>\n<br/>\nUnschooling is about browsing the grocery store, learning about what&#39;s<br/>\navailable, having access to recipes and cookbooks and cooking shows, but<br/>\ntaking home just the stuff that you&#39;ll actually use and eat.<br/>\n<br/>\nAn unschooling life is about browsing the world, seeking out things that<br/>\nlook intriguing. Looking closer at what interests them. And delving into<br/>\nwhat they find themselves passionate about.<br/>\n<br/>\nNo one needs the whole grocery store. They just need to be able to find what<br/>\nthey need when they need it.<br/>\n<br/>\n**Colleges are very picky now, and employers only want to hire the best.**<br/>\n<br/>\nStandard American dream is success leads to happiness. Success is usually<br/>\ndefined as a high paying job that allows someone to purchase the &quot;good life&quot;<br/>\nfor their families. And to get that high paying job you need to go to a<br/>\nreally good college. And to get into that really good college you need to<br/>\nget good grades in high school.<br/>\n<br/>\nUnschooling is about replacing that with something *better*.<br/>\n<br/>\n**My oldest son who is in high school would think I was nuts if I said let&#39;s<br/>\njust learn through life and not worry about college or the future.**<br/>\n<br/>\nYes, he would. As would most people who¹ve been through school or are in<br/>\nschool.<br/>\n<br/>\nEveryone can see every single day that the sun obviously goes around the<br/>\nearth. Anyone who says otherwise is nuts. So if someone thinks they already<br/>\nknow what is true, anything outside that truth is going to sound false.<br/>\n<br/>\nWhen someone knows there are only two options: stay in school or be a drop<br/>\nout, then anything other than school sounds nuts.<br/>\n<br/>\n**I was always taught to train them for a higher goal including reaching for<br/>\nthe best financially or otherwise.**<br/>\n<br/>\nAgain, standard American dream. But how does it turn out in truth?<br/>\n<br/>\nStandard thought is that school prepares kids for life. But how many kids is<br/>\nthat true for? We *want* to believe it¹s true. We focus on the kids who<br/>\nappear to be models of success. We find ways of explaining the failures of<br/>\nschool -- with reasons that point to causes other than school like<br/>\nunmotivated kids and uncaring parents and bad environment that school can¹t<br/>\ncompensate for.<br/>\n<br/>\nBut in general -- not in every case, but in general -- people find success<br/>\nto be an elusive goal and the happiness that was promised with it never<br/>\nquite there.<br/>\n<br/>\nIf pursuing the American Dream led to happiness, then everyone who set out<br/>\non the path to pursue it would be happy. But they aren¹t. And some people<br/>\nwho reject the American Dream are happy.<br/>\n<br/>\nSince pursuing the American Dream isn¹t a guarantee and some people find<br/>\nhappiness without pursuing the American Dream, there¹s some other factor<br/>\ninvolved.<br/>\n<br/>\nThat other factor is what unschooling is about. It dispenses with the false<br/>\nhopes dangled by the American Dream and focuses on joy being the goal.<br/>\n<br/>\n**My oldest son has always been free to explore life but he has always had<br/>\nrules to live by. Not too strict, but still rules.**<br/>\n<br/>\nIf your son is in school, his freedom to explore life is severely limited.<br/>\nIf he can¹t do whatever he wants whenever he wants for as long as he wants<br/>\n-- free from messages that what he¹s choosing isn¹t as good as what¹s done<br/>\nin school -- then he isn¹t truly free.<br/>\n<br/>\nIf he¹s convinced that school is the best path to be on and that doing<br/>\nhomework is better than reading the ³fluff² he enjoys, then he doesn¹t have<br/>\ntrue freedom. He is confined by false beliefs that are as secure as iron<br/>\nbars. But they¹re invisible so he doesn¹t even realize he¹s confined.<br/>\n<br/>\nMy daughter has had true freedom and no rules and she¹s a great kid. So<br/>\nthere¹s some factor other than rules that creates great kids.<br/>\n<br/>\n**I just can&#39;t wrap my mind around how they will be prepared for college and<br/>\nemployment.**<br/>\n<br/>\nYou can¹t imagine it because it isn¹t in your experience. Reading here will<br/>\nhelp you fill the vacuum that¹s left behind by school.<br/>\n<br/>\nJust as finding out about the structure of the solar system will help<br/>\nsomeone reconcile what they they see with what is really true.<br/>\n<br/>\n**I guess part of me is still trained to feel that doing well in school is<br/>\nthe only way to get ahead in life.**<br/>\n<br/>\nWell, yeah. If someone could get to a similar place that school takes them<br/>\njust by living life, why would anyone stay in school?<br/>\n<br/>\n**I want my boys to have the best of both worlds, free to explore life but<br/>\nstill having all the education they need to get ahead in life. Did you ever<br/>\nfeel so torn about your decision or did you just know it was right?**<br/>\n<br/>\nIt wasn¹t until I realized that unschooling offered something *better* than<br/>\nthe standard path to (supposed) success that I finally understood what<br/>\nunschooling was all about.<br/>\n<br/>\nI could tell you that unschooling is about happiness and joy and pursuing<br/>\npassions, but at this point I suspect you¹d dismiss it as pie in the sky. I<br/>\nwould have.<br/>\n<br/>\nWhat made me stick with investigating unschooling was the belief that there<br/>\nhad to be more interesting ways to learn than how school went about it. Life<br/>\nwas interesting to me and I wanted to know more. But school only offered<br/>\ndull ways of learning about interesting things. I did well in school, but it<br/>\nfelt unsatisfying.<br/>\n<br/>\nWhen I first started out investigating homeschooling, I read posts from<br/>\npeople all along the spectrum of homeschooling. All the homeschoolers<br/>\npursuing more schoolish methods were rarely having fun. Most of their posts<br/>\nwere about how to get their kids to do their work, or how to handle more<br/>\ngrades than one, or what are the best resources. But the unschoolers were<br/>\nliving joyful lives while they learned. And since my daughter was only 4,<br/>\nany concerns I had about algebra could wait for several years.<br/>\n<br/>\nBefore I got unschooling, I thought the best I could offer my daughter was<br/>\nto prepare her so she could go to MIT if she wanted. But sticking with<br/>\nunschooling for the early years allowed me time to realize that it&#39;s better<br/>\nto help her be who she is so that if she were someone who wanted what MIT<br/>\noffered, she¹d naturally be heading in that direction pursuing interesting<br/>\nthings that would make MIT a viable option for her. (As it is, she¹s<br/>\npursuing writing and drawing with a passion.)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling and college/intro","postDate":"1089976008","msgId":2134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OS4zOWY4YjBhMS4yZTI5MTBjOEBhb2wuY29tPg=="},"prevInTopic":2131,"nextInTopic":2137,"prevInTime":2133,"nextInTime":2135,"topicId":2122,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/15/2004 11:21:58 PM Eastern Daylight Time, wkhansen91@yahoo.com writes: I have  read that colleges are actively seeking unschoolers for","messageBody":"<div id=\"ygrps-yiv-434649887\">In a message dated 7/15/2004 11:21:58 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wkhansen91@...\">wkhansen91@...</a> writes:<br/>\n<br/>\nI have  read that colleges are actively seeking unschoolers for their <br/>\nenthusiasm  and seriousness about learning,but I was wondering if you <br/>\ncould name some  and if you can answer how a kid that was unschooled <br/>\nwould handle all the  pre-requisite classes for say med school or law <br/>\nschool? If they weren&#39;t  interested in these just actual medicine or <br/>\nlaw how do you think it would  affect them to have to take them? <br/>\nI struggle with this type of stuff  everyday. I understand what John <br/>\nHolt and the others say about why  unschooling is more natural, but   <br/>\nlife has so many things that  we have to do even if we don&#39;t want to <br/>\nlike to or are interested to that I  worry how this will affect my <br/>\nkids in the future.  &lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nHere&#39;s a website that lists colleges that have accepted homeschoolers. I  <br/>\nwould have cut and pasted, but the list is VERY long, and with concern for those  <br/>\non digest, I&#39;ll let you go there yourself. If you google &quot;homeschool-friendly <br/>\n colleges&quot;, you get 700 hits.<br/>\n <br/>\n<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://learninfreedom.org/colleges_4_hmsc.html_\">http://learninfreedom.org/colleges_4_hmsc.html_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://learninfreedom.org/colleges_4_hmsc.html)\">http://learninfreedom.org/colleges_4_hmsc.html)</a> <br/>\n <br/>\nA child who wants to be a doctor or a lawyer or an Indian  chief will be <br/>\n*drawn* to the things that will make him attractive to med  schools, law schols <br/>\nand chief schools----that&#39;s the way of natural learning. <br/>\n <br/>\nUnfortunately, our society equates doctors and lawyers with the pinnacle of  <br/>\nsuccess. Way too many children are cajoled and pushed into these careers with <br/>\nno  true desire to actually BE a doctor or lawyer. The ones that *want* to be  <br/>\nbecome great ones. Those that don&#39;t fail out of school, change majors, <br/>\ngraduate  and change careers later, or &quot;just do it&quot; even though they&#39;re miserable, <br/>\njust  because it was the path they chose.<br/>\n <br/>\nAs far as &quot;prerequisites&quot; for unschoolers----that&#39;s college talk. Your high  <br/>\nschool classes really don&#39;t matter to a graduate school. You could take all <br/>\nthe  math and science your high school offered, and it STILL wouldn&#39;t matter to <br/>\na  medical school. You could take all the english and history your high school <br/>\n offered, and it still wouldn&#39;t matter to a law school. They care about your  <br/>\ncollege classes. THOSE prerequisites.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;but life has so many things that we have to do even if  we don&#39;t want to <br/>\n </span></blockquote>like to or are interested &lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nYa really think so? I think life has so many things that I can choose to  do. <br/>\nOr not. With real consequences for my actions/choices.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] unschooling and college/intro","postDate":"1089962219","msgId":2131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNkN2c4dStsM2pwQGVHcm91cHMuY29tPg=="},"prevInTopic":2123,"nextInTopic":2134,"prevInTime":2130,"nextInTime":2132,"topicId":2122,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1066044113\">&lt;&lt;&lt;&lt;I have read that colleges are actively seeking unschoolers for their <br/>\nenthusiasm and seriousness about learning,but I was wondering if you <br/>\ncould name some and if you can answer how a kid that was unschooled <br/>\nwould handle all the pre-requisite classes for say med school or law <br/>\nschool?...... They are 12,11,7, and 5. &gt;&gt;&gt;&gt;<br/>\n<br/>\nYour kids are so young. If you are focusing on the future like this, you are<br/>\nmaking it harder on yourself to unschool with joy in the present. It is<br/>\nharder to unschool fully, if you have an agenda about college success that<br/>\nyour children will not fail to see.<br/>\n<br/>\nBesides that, by the time your children may be ready, *if* they choose<br/>\ncollege, the list of congenial colleges may have dramatically expanded.<br/>\n<br/>\nNeeding a huge number of years to &quot;prepare for college&quot; is a school promoted<br/>\nidea, that doesn&#39;t apply.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.717 / Virus Database: 473 - Release Date: 7/8/2004</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling and college/intro","postDate":"1089948989","msgId":2123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWM0NmFlNiQxNTAyNDg3MCQ2NDAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PGNkN2c4dStsM2pwQGVHcm91cHMuY29tPg=="},"prevInTopic":2122,"nextInTopic":2131,"prevInTime":2122,"nextInTime":2124,"topicId":2122,"numMessagesInTopic":0,"msgSnippet":"Laura writes: how a kid that was unschooled would handle all the pre-requisite classes for say med school or law school? If they weren t interested in these","messageBody":"<div id=\"ygrps-yiv-1910768523\">Laura writes: <br/>\nhow a kid that was unschooled <br/>\nwould handle all the pre-requisite classes for say med school or law <br/>\nschool? If they weren&#39;t interested in these just actual medicine or <br/>\nlaw how do you think it would affect them to have to take them? <br/>\n<br/>\n************************<br/>\n<br/>\nThere aren&#39;t prereq. classes for law school.  My opinion, based on my experience, is that people do best in law school when they have studied geometry and/or poetry.  I have read at some point an article by a local law school dean on why poetry is the best preparation for law school.   I&#39;m sure that no law school requires either class, though.  I was in law school at a  top-tier law school with former actors, writers, historians, a former employee of the CIA, students of all kinds of different areas. <br/>\n<br/>\nI&#39;m not sure what you mean by being &quot;interested in law&quot; instead of prereq, though.   People are interested in law for different reasons. Again in my experience, people who go to law school for reasons of &quot;justice&quot; have a very miserable time in law school -- people who go out of an arguably perverse pleasure in arguing all sides of all questions have a blast.  I was in the latter group, FWIW. <br/>\n<br/>\nI do have the vague sense that there are prereqs for med school -- but surely someone who wanted to be a doctor would be interested in the biology/anatomy kinds of classes that were prereqs?  Why would someone who loathed anatomy want to be a doctor?  Of course, I don&#39;t actually have any information or experience with med school or its prereqs.   However, the personality that leads me to essay an answer anyway is the aforementioned personality that made me do well in law school.  LOL. <br/>\n<br/>\nI still think Joyce Fetterol had the best answer (thought I don&#39;t remember where she said it).  That if her daughter turned out to be the kind of  person who was interested in MIT, then by that time she will have (by dint of interest and ability) have done the kinds of things that would make MIT interested in her.  Or, I suppose, be willing and able to do any such things that she hadn&#39;t already done.   If that wasn&#39;t Joyce - then my apologies to Joyce and whoever actually said it! <br/>\n<br/>\n -Cat  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: laura <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Thursday, July 15, 2004 10:58 PM<br/>\n  Subject: [unschoolingbasics] unschooling and college/intro<br/>\n<br/>\n<br/>\n  Hi, my name is Laura and I have been reading on this list since it <br/>\n  started along with its predesessor. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":164456348,"authorName":"laura","from":"&quot;laura&quot; &lt;wkhansen91@...&gt;","profile":"wkhansen91","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling and college/intro","postDate":"1089946718","msgId":2122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkN2c4dStsM2pwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":2123,"prevInTime":2121,"nextInTime":2123,"topicId":2122,"numMessagesInTopic":0,"msgSnippet":"Hi, my name is Laura and I have been reading on this list since it started along with its predesessor. I feel like I pretty much get the whole idea ww just","messageBody":"<div id=\"ygrps-yiv-317572048\">Hi, my name is Laura and I have been reading on this list since it <br/>\nstarted along with its predesessor. I feel like I pretty much get <br/>\nthe whole idea ww just haven&#39;t reached the goal yet. <br/>\nThis is our first year homeschooling and we started with a computer <br/>\nschool,then curriculum that I created lesson plans for and then sort <br/>\nof fell into unschooling. It is much easier on me to do unschooling <br/>\nbecause I don&#39;t have to create lesson plans and &quot;teach&quot; lessons. I <br/>\ndo feel guilty though. That I am not doing enough.<br/>\nI have read that colleges are actively seeking unschoolers for their <br/>\nenthusiasm and seriousness about learning,but I was wondering if you <br/>\ncould name some and if you can answer how a kid that was unschooled <br/>\nwould handle all the pre-requisite classes for say med school or law <br/>\nschool? If they weren&#39;t interested in these just actual medicine or <br/>\nlaw how do you think it would affect them to have to take them? <br/>\nI struggle with this type of stuff everyday. I understand what John <br/>\nHolt and the others say about why unschooling is more natural, but   <br/>\nlife has so many things that we have to do even if we don&#39;t want to <br/>\nlike to or are interested to that I worry how this will affect my <br/>\nkids in the future. They are 12,11,7, and 5. <br/>\nAny help would be appreciated.<br/>\nThanks for all the great info posted daily.<br/>\n Laura</div>","specialLinks":[]}],"prevTopicId":2121,"nextTopicId":2074}}