{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling institutionalized children?","postDate":"1265368861","msgId":43131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrZ3V1dCthdXFwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDEwMS1EUzIzMzIzODgxRkI2N0FDRkIyQTZEQzBCRjU2MEBwaHguZ2JsPg=="},"prevInTopic":43130,"nextInTopic":0,"prevInTime":43130,"nextInTime":43132,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"Deschooling is a long process -- sometimes mostly long for the parents. Letting go of ideas like needing a schedule as opposed to scheduling things you and","messageBody":"<div id=\"ygrps-yiv-1620897184\">Deschooling is a long process -- sometimes mostly long for the parents. Letting go of ideas like needing a schedule as opposed to scheduling things you and your child want to or need to do, is one of 100 small and large adjustments to being able to run your own lives.<br/>\n<br/>\nDon&#39;t agonize over getting things set up just right now as you are letting go of so many ideas that weren&#39;t working for you<br/>\n<br/>\nEnjoy a complete break and see what grows.<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jordan ..... &quot; &lt;deliadelyon@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; i am gonna get in trouble here, but i say do not try at all to get onto a schedule... my son thrives on not having one, which is great because the whole family is a go-with-the-flow kind of adventure...lol the only thing i think you should be mindful of is eating times... try to eat when she is used to eating... nothing complicates a day like a hungry child...lol i am very excited for your family! good luck! peace, love, and joy! jordan ---------- Sent from AT&T&#39;s Wireless network using Mobile Email<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling institutionalized children?","postDate":"1265327010","msgId":43130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrZm0zMis4OXRhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhrNW82MStrMDc4QGVHcm91cHMuY29tPg=="},"prevInTopic":43129,"nextInTopic":43131,"prevInTime":43129,"nextInTime":43131,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"... ******************* I found with Ray that it wasn t all that hard to create a routine/schedule around his needs, once I had an idea of what they were - and","messageBody":"<div id=\"ygrps-yiv-1602121565\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Maya&quot; &lt;mayajourney@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe I feel &quot;my&quot; truest challenge is creating a predictable routine.  I have tried this so many times, but our lives don&#39;t work that way.  We never know what will happen next! We never know what opportunity will inspire!  <br/>\n </span></blockquote>*******************<br/>\n<br/>\nI found with Ray that it wasn&#39;t all that hard to create a routine/schedule around his needs, once I had an idea of what they were - and that gives me a little &quot;aha&quot; actually. Y&#39;all are going to have an adjustment time - heck, when you first get home All y&#39;all are going to be jet-lagged and off your usual routines. So plan ahead to take it easy for awhile and to be &quot;on vacation&quot; for awhile. That&#39;s another good deschooling tool. Do some &quot;vactiony&quot; things, do some sight-seeing, maybe if your new dd is interested. Use that time to start to get a sense of her ups and downs, when she tends to need food and rest, when she tends to want to interact and when she wants something to do. As you get to know those things, you can work on helping her life be a bit predictable and see, from there, if that&#39;s enough or if she really needs a bit more organization for awhile. Its really impossible to know until you&#39;re all together, after all.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":3972142,"authorName":"jordan .....","from":"&quot;jordan ..... &quot; &lt;deliadelyon@...&gt;","profile":"jordan.sweetie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: De-schooling institutionalized children?","postDate":"1265198588","msgId":43129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwMS1EUzIzMzIzODgxRkI2N0FDRkIyQTZEQzBCRjU2MEBwaHguZ2JsPg=="},"prevInTopic":43128,"nextInTopic":43130,"prevInTime":43128,"nextInTime":43130,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"i am gonna get in trouble here, but i say do not try at all to get onto a schedule... my son thrives on not having one, which is great because the whole family","messageBody":"<div id=\"ygrps-yiv-868190777\">i am gonna get in trouble here, but i say do not try at all to get onto a schedule... my son thrives on not having one, which is great because the whole family is a go-with-the-flow kind of adventure...lol the only thing i think you should be mindful of is eating times... try to eat when she is used to eating... nothing complicates a day like a hungry child...lol i am very excited for your family! good luck! peace, love, and joy! jordan ---------- Sent from AT&T&#39;s Wireless network using Mobile Email</div>","specialLinks":[]},{"userId":3972142,"authorName":"jordan .....","from":"&quot;jordan ..... &quot; &lt;deliadelyon@...&gt;","profile":"jordan.sweetie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-schooling institutionalized children?","postDate":"1265057331","msgId":43128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwMS1EUzQwMzMxRUI5NkRDNjZGRkI3MDQzMEJGNTgwQHBoeC5nYmw+"},"prevInTopic":43127,"nextInTopic":43129,"prevInTime":43127,"nextInTime":43129,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"maya! i am so excited for you! having taught many children who have relocated to the US from many countries, i can tell you that they are very reslient... such","messageBody":"<div id=\"ygrps-yiv-56924926\">maya! i am so excited for you! having taught many children who have relocated to the US from many countries, i can tell you that they are very reslient... such kids have many things to adapt to, but are eager and flexible... there may well be adjustment issues that are emotional, but these generally disappear quickly... important that she find friends fast... i think that hs will be the perfect environment for her to adjust at her own pace... i think it would be far less stressful than learning new rules, and picking up english will be easier without pressure of school... good luck! peace, love, and joy! jordan ---------- Sent from AT&T&#39;s Wireless network using Mobile Email<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Maya<br/>\nSent: 1/31/2010 1:49:43 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] De-schooling institutionalized children?<br/>\n<br/>\n<br/>\nI have respected the thoughtful responses from other on this list.<br/>\nI am posing a question that maybe you can help me with.<br/>\n<br/>\nWe are getting ready to travel to India to pick up our newly adopted 7 yo daughter who has lived in an orphanage most of her life. She is so programmed to schedules and rote learning. Her life has been anything but free and fun. She is very shy, a bit immature due to institutional delays, but appears very sweet. She speaks very little English.<br/>\n<br/>\nWe are planning to stay in India for about a month to bond with her before bringing her home. I have read about de-schooling, but I have never read about this for institutionalized kids. Do any of you have any suggestions about de-schooling ?<br/>\n<br/>\nJust some background info: I have been &quot;unschooling&quot; my 8.5 yo son at home for 3 years. We still have an online curriculum, to make my public school teacher husband happy:) Besides that, my 8 yo son builds and listens to book cd&#39;s all day. He wants to be an inventor and scientist, so I give him the creative outlets to create his own &quot;curriculum.&quot;<br/>\n<br/>\nApparently in India children are not taught to be creative. There is a lot of pressure to learn in a school way. How do I not overwhelm our daughter into the unschooling life when she is so used to programming?<br/>\n<br/>\nThanks,<br/>\nMaya<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235012193,"authorName":"Maya","from":"&quot;Maya&quot; &lt;mayajourney@...&gt;","profile":"mayajourney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling institutionalized children?","postDate":"1265001473","msgId":43127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrNW82MStrMDc4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhrNWdwYisyMjZrQGVHcm91cHMuY29tPg=="},"prevInTopic":43122,"nextInTopic":43128,"prevInTime":43126,"nextInTime":43128,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"Thanks for the feedback thus far. People are reflecting things that run through my mind. Maybe I feel my truest challenge is creating a predictable routine.","messageBody":"<div id=\"ygrps-yiv-931001972\">Thanks for the feedback thus far. People are reflecting things that run through my mind.<br/>\n<br/>\nMaybe I feel &quot;my&quot; truest challenge is creating a predictable routine.  I have tried this so many times, but our lives don&#39;t work that way.  We never know what will happen next! We never know what opportunity will inspire!  <br/>\n<br/>\nI understand creativity in many ways.  We are a creative family, yet I did not say completely artistic.  My husband is an incredible artist and teacher.  My son loves robots and legos.  He could care less about painting and drawing.  He is always working with his hands.  It&#39;s all 3 dimensional work.  We call what he does his creative inspirations or &quot;art.&quot;  I am highly intuitive and have my own creative realm.  <br/>\n<br/>\nI can&#39;t wait to see who are daughter really is and how she will evolve!  I think she will thrive once she can transition into our family.  My gut instinct tells me her first &quot;education&quot; is learning to live in a family, with a new language and culture.  Eventually she will understand that we DO NOT dictate who she is or will become. We will teach her learning comes in so many different ways, besides books.   <br/>\n<br/>\nLuckily, we are spending 10 days getting to bond with her before we travel. Most parents are back in 7-10 days total, but we are open for at least 4-6 weeks.  We have a one way ticket to India and will come home when the time is ready. (Do you know how cheap it is to live in India?)<br/>\n<br/>\n We love the fact that we will know more about her routine and living by visiting each day until she comes with us. We decided not to force bonding and to just let the process evolve.  We brought lots of balloons and art materials for the kids to play with.  <br/>\n<br/>\nIt&#39;s the de-schooling part I get &quot;stuck&quot; on.  De-schooling my son was EASY!  De-schooling me was HARD!  The suggestion of easing her into our life by trying to fit within her schedule will work.  Then we can slowly alter it to become more flexible.  I realize &quot;I&quot; have some pre-work to do.  My son usually goes with the flow!  Wow!  Thanks for helping me realize changes that can be made to help:)  Also, thanks for the reminder that she will lead me!!!! <br/>\n<br/>\nI think I am just nervous and want to transition her into our family that is so different from hers with ease! Honestly, everyone here is so thoughtful, mature and intelligent with responses, I couldn&#39;t think of anyone better to ask! My brain is on overload right now!<br/>\n<br/>\nAny suggestions on how to stick to a schedule? :)<br/>\n<br/>\nMany Blessings,<br/>\nMaya (Katina)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia","from":"&quot;Sylvia&quot; &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling institutionalized children?","postDate":"1264993899","msgId":43122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrNWdwYisyMjZrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhrNGwyOCtsc3F0QGVHcm91cHMuY29tPg=="},"prevInTopic":43120,"nextInTopic":43127,"prevInTime":43121,"nextInTime":43123,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"This is something that would be really good for you to think about in the context of your son who enjoys creating and inventing - that aspect of his","messageBody":"<div id=\"ygrps-yiv-1382885390\">This is something that would be really good for you to think about in the context of your son who enjoys creating and inventing - that aspect of his personality could very well color your expectations of what &quot;creative&quot; is or looks like. Its not uncommon for creative people to start out being very imitative, for instance. So if you&#39;re expecting &quot;creative&quot; to look like your son, you may miss what&#39;s &quot;creative&quot; about your new daughter. If she seems comfortable doing things that are &quot;imitative&quot; rather than &quot;creative&quot; that&#39;s Okay! She may be creative but have a different process. Or she may not be particularly creative as an aspect of who she is, and that&#39;s Okay too.<br/>\n<br/>\n*****<br/>\n<br/>\nIt can also be helpful to remember that creative doesn&#39;t always mean arts & crafts. My boys don&#39;t like any of the typically &#39;art&#39; kinds of activities -- no painting or coloring or making crafts.  Not really a big deal, since I never considered myself an artist. We have a couple of unschooling friends who are very gifted artists in the traditional sense, drawing, painting, etc.  <br/>\n<br/>\nAfter hearing so many stories from unschoolers whose kids do all kinds of arty stuff, I had begun to lament that we&#39;re just not creative people. Then I looked around at our home and saw lots of examples of creativity. Andy&#39;s (13) built some amazing lego and bionicle creations -- one so big it can no longer be taken from home to show to others.  Dan (9) is very handy with fixing things around the house.  He regularly digs around in Gary&#39;s toolbox for ways to fix or improve on things we use.  Both boys are very creative problem solvers. In recent years, I&#39;ve also become brave about fixing broken things. After all, it&#39;s already broken, so what more damage could I do by taking it apart and trying to come up with a solution? I&#39;ve recognized that as a sign that I&#39;m creative, too.  I learned to knit just a couple of years ago, at 45yo! <br/>\n<br/>\nCreativity takes many forms, not just arts and crafts. Some creative folks are good builders, or painters or problem-solvers.  I&#39;m starting to see that everyone is creative, just not always in the traditionally recognized ways.  Any time someone is able to think outside the box, come up with their own way to do something, that&#39;s creativity. Don&#39;t dismiss what looks imitative, because often that&#39;s the first step in figuring out a whole new way to do something -- a way that works better for that person.  <br/>\n<br/>\nIt has been such a joy these past couple of years to see myself as a creative person, to cherish my own talents and abilities and thought process.  <br/>\n<br/>\nSylvia</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling institutionalized children?","postDate":"1264965512","msgId":43120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrNGwyOCtsc3F0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhrNDFwbit2MDV1QGVHcm91cHMuY29tPg=="},"prevInTopic":43118,"nextInTopic":43122,"prevInTime":43119,"nextInTime":43121,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"... ****************** Its often the case that kids transition better from school to unschooling in smaller stages, rather than in one fell swoop, and I","messageBody":"<div id=\"ygrps-yiv-1337767941\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Maya&quot; &lt;mayajourney@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have read about de-schooling, but I have never read about this for institutionalized kids.  Do any of you have any  suggestions about de-schooling ?<br/>\n </span></blockquote>******************<br/>\n<br/>\nIts often the case that kids transition better from school to unschooling in smaller stages, rather than in one fell swoop, and I suspect that&#39;s going to be especially true with someone from an orphanage. So you may find you need to start out with more rules and limits than you&#39;re used to! Find out as much as you can about the way things are done in the orphanage in advance, and talk with your son about this. You may find, for instance, that you need to control food for awhile - that&#39;s a common experience of families who&#39;ve adopted children from orphanages where children have learned that food is a very limited commodity.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Apparently in India children are not taught to be creative.  There is a lot of pressure to learn in a school way.  How do I not overwhelm our daughter into the unschooling life when she is so used to programming?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nBaby steps. But at the same time, be observant of her as a person - see what she chafes at and be willing to open up quickly in those areas. See where she falls apart and be willing to provide more support. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Apparently in India children are not taught to be creative.<br/>\n<br/>\n </span></blockquote>This is something that would be really good for you to think about in the context of your son who enjoys creating and inventing - that aspect of his personality could very well color your expectations of what &quot;creative&quot; is or looks like. Its not uncommon for creative people to start out being very imitative, for instance. So if you&#39;re expecting &quot;creative&quot; to look like your son, you may miss what&#39;s &quot;creative&quot; about your new daughter. If she seems comfortable doing things that are &quot;imitative&quot; rather than &quot;creative&quot; that&#39;s Okay! She may be creative but have a different process. Or she may not be particularly creative as an aspect of who she is, and that&#39;s Okay too. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":235012193,"authorName":"Maya","from":"&quot;Maya&quot; &lt;mayajourney@...&gt;","profile":"mayajourney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"De-schooling institutionalized children?","postDate":"1264945783","msgId":43118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrNDFwbit2MDV1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43120,"prevInTime":43117,"nextInTime":43119,"topicId":43118,"numMessagesInTopic":0,"msgSnippet":"I have respected the thoughtful responses from other on this list. I am posing a question that maybe you can help me with. We are getting ready to travel to","messageBody":"<div id=\"ygrps-yiv-1241646526\">I have respected the thoughtful responses from other on this list.    <br/>\nI am posing a question that maybe you can help me with.<br/>\n<br/>\nWe are getting ready to travel to India to pick up our newly adopted 7 yo daughter who has lived in an orphanage most of her life.  She is so programmed to schedules and rote learning.  Her life has been anything but free and fun.  She is very shy, a bit immature due to institutional delays, but appears very sweet.  She speaks very little English.<br/>\n<br/>\nWe are planning to stay in India for about a month to bond with her before bringing her home.  I have read about de-schooling, but I have never read about this for institutionalized kids.  Do any of you have any  suggestions about de-schooling ?<br/>\n<br/>\nJust some background info:  I have been &quot;unschooling&quot; my 8.5 yo son at home for 3 years.  We still have an online curriculum, to make my public school teacher husband happy:)  Besides that, my 8 yo son builds and listens to book cd&#39;s all day.  He wants to be an inventor and scientist, so I give him the creative outlets to create his own &quot;curriculum.&quot;<br/>\n<br/>\nApparently in India children are not taught to be creative.  There is a lot of pressure to learn in a school way.  How do I not overwhelm our daughter into the unschooling life when she is so used to programming?<br/>\n<br/>\nThanks,<br/>\nMaya</div>","specialLinks":[]}],"prevTopicId":43126,"nextTopicId":43132}}