{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] anonymous request for help","postDate":"1171837110","msgId":21522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjQwMWM3NTNhYSRiOGM5YjEwMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDAwOWQwMWM3NTJlNyQ1YzJiNjdlMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":21519,"nextInTopic":0,"prevInTime":21521,"nextInTime":21523,"topicId":21506,"numMessagesInTopic":0,"msgSnippet":"Someone commented on this page of Sandra s, one which I hadn t stumbled across before. There is an understanding about how unschooling can change your","messageBody":"<div id=\"ygrps-yiv-2102273674\">Someone commented on this page of Sandra&#39;s, one which I hadn&#39;t stumbled <br/>\nacross before. There is an understanding about how unschooling can change <br/>\nyour perspective on all school, including university, that might help you to <br/>\nunderstand why it is no longer a part of my vision for Simon&#39;s or Linnaea&#39;s <br/>\nlife. Not that I would discourage them from going to university, but I don&#39;t <br/>\nsee it as a necessary part of their lives.<br/>\n<br/>\nAnyhow, the page is here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/newview\">http://sandradodd.com/peace/newview</a><br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Also, how does a child that was raised in with the &quot;unschooling&quot; theory or <br/>\n&gt; lifestyle go to college in the future? </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] anonymous request for help","postDate":"1171795264","msgId":21519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0MjM1OUI2LTM1NTktNEY4QS1CNDFCLTg1OUM1MzQ1NUQ2Q0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwOWQwMWM3NTJlNyQ1YzJiNjdlMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDAwOWQwMWM3NTJlNyQ1YzJiNjdlMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":21518,"nextInTopic":21522,"prevInTime":21518,"nextInTime":21520,"topicId":21506,"numMessagesInTopic":0,"msgSnippet":"... Only if they feel they need to compete for a limited quantity. If they feel that your goal is to help them get what they want, then being the one who gets","messageBody":"<div id=\"ygrps-yiv-1431219525\"><blockquote><span title=\"ireply\">&gt; well, if I pick one of the requests, does the tell the other  <br/>\n&gt; members in my family that they are less important?<br/>\n<br/>\n </span></blockquote>Only if they feel they need to compete for a limited quantity.<br/>\n<br/>\nIf they feel that your goal is to help them get what they want, then  <br/>\nbeing the one who gets it first isn&#39;t as important.<br/>\n<br/>\nThat shift in how they view you isn&#39;t something that happens  <br/>\ninstantly. It comes over time as they gain confidence from your  <br/>\nactions of working to meet their needs. When they know fully -- from  <br/>\npast  actions -- that their needs are important to you, then they&#39;ll  <br/>\nbe more willing to wait for you to have the opportunity to help them.<br/>\n<br/>\nBut if they feel that mom&#39;s help is limited, then they will compete  <br/>\nto get it just as people compete to get anything that&#39;s rationed.<br/>\n<br/>\nOne thing that many mothers suffer is the need to be the fixer of  <br/>\nproblems. And kids&#39; requests can feel like: Drop what you&#39;re doing  <br/>\nand fix this right now. But part of the mental shift is seeing  <br/>\nyourself as a facilitator, helping kids get what they need rather  <br/>\nthan taking on the burden of their problem and solving it for them,  <br/>\nif you can see the subtle difference.<br/>\n<br/>\nThe actions may end up looking the same, but the change is a shift in  <br/>\nattitude.<br/>\n<br/>\nFor instance, if a child has saved up enough money for a new video  <br/>\ngame and says &quot;Mom, I need to go get this game. It came out today.&quot;  <br/>\nThe fixer of problems will think &quot;Oh, geez, another thing added to my  <br/>\nlist of things to do.&quot; The facilitator will say, &quot;Okay, let&#39;s look at  <br/>\nthe schedule. Here&#39;s what we have to do today. Let&#39;s see where we can  <br/>\nwork that in.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, I do not want my sons thinking the world revolves around  <br/>\n&gt; their needs.<br/>\n<br/>\n </span></blockquote>They can&#39;t. Life has a way of teaching them that. Other people will  <br/>\nsay no to them. Life won&#39;t always work out the way they want it to.<br/>\n<br/>\nWhat you can, though, do is let them know that you&#39;re on their team.  <br/>\nThat you&#39;re there to help them get what they want from the world.<br/>\n<br/>\n(Note, though, that part of what they want is to be a part of society  <br/>\nso part of helping them is finding solutions that respect others  <br/>\nneeds as well.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but how do you handle these issues in the furture?<br/>\n<br/>\n </span></blockquote>They don&#39;t arise. People who are treated with respect, treat others  <br/>\nwith respect. It&#39;s almost as simple as that :-)<br/>\n<br/>\n(Which isn&#39;t to say that kids raised this way are perfect angels ;-)  <br/>\nSometimes kids forget. Sometimes they get caught up in their own  <br/>\nneeds. Sometimes they don&#39;t see the big picture. But it helps  <br/>\nenormously to see those times as honest mistakes. They&#39;re just  <br/>\nlearning. They *will* get it wrong sometimes. And it helps enormously  <br/>\nto not treat them as though the mistake is a deliberate one done out  <br/>\nof meanness. Treat them as though they are doing the best they can  <br/>\nwith the skills and knowledge and understanding of themselves and the  <br/>\nworld that they have in the moment.)<br/>\n<br/>\nThe only caveat I&#39;d throw in there is treating ourselves with respect  <br/>\nalso. Working our own needs into our help without demanding that  <br/>\nothers respect our needs. It&#39;s up to us to respect our own needs.  <br/>\n(Which is where the &quot;doormat moms&quot; go wrong.)<br/>\n<br/>\nIt&#39;s a tricky balance trying to figure out our own needs. Most of us  <br/>\ngrew up with the implied promise that when we were grownups it would  <br/>\nbe our turn to &quot;get our way&quot;. Adulthood would be when we could do  <br/>\nwhatever we wanted. That was a big lie of course and we can find it  <br/>\nfeels like we&#39;re in a war trying to fight for our right to do what we  <br/>\nwant, to the point that we increase others unhappiness to try to make  <br/>\nourselves happy. :-/<br/>\n<br/>\nAs an example, if a child comes up and says at 10PM &quot;I want some ice  <br/>\ncream and Sasha just ate the last of it.&quot; The fixer of problems might  <br/>\nfeel the right thing to do is go out to the store at 10PM, and then  <br/>\nfeel guilty that they don&#39;t want to, and then angry that a child  <br/>\nwould even put them in the position of being the bad guy who wants to  <br/>\nsay &#39;No, I&#39;m not taking you to the store right now.&#39;&quot; We don&#39;t need  <br/>\nto set our need to go to bed aside. We can, though, say &quot;I wish we  <br/>\nhad some more. Let&#39;s put it on the list and get some tomorrow. [Or  <br/>\nwhatever is reasonable in a particular family&#39;s circumstances.] If we  <br/>\ncan get moving in time, we might be able to have ice cream for  <br/>\nbreakfast! But in the meantime, let&#39;s see what else is available.&quot;  <br/>\nAnd try to find something that&#39;s even better.<br/>\n<br/>\nThat might only have partial success at the beginning with kids who  <br/>\nare used to competing with each other for whatever is limited. But  <br/>\nover time, as kids gain confidence that their needs are important to  <br/>\nyou and that you are working at meeting them even if you can&#39;t right  <br/>\nnow, they will be more willing to accept substitutes for now and delays.<br/>\n<br/>\nThere are a lot of typical questions answered at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] anonymous request for help","postDate":"1171789434","msgId":21518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTgwMWM3NTMzYiRiODU2YTM1MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDAyMTcyMDA3MjMwOS42MTQ3LjQ1RDc4QjBGMDAwRDJBQUMwMDAwMTgwMzIyMTY1NTE0MDY5Qzk5MEE5RDBBMDQwQTA4OUJAY29tY2FzdC5uZXQ+"},"prevInTopic":21513,"nextInTopic":21519,"prevInTime":21517,"nextInTime":21519,"topicId":21506,"numMessagesInTopic":0,"msgSnippet":"It isn t me, I swear.  We are the happiest of unschoolers on the block. I m not just sideways asking, really . Actually, here is what I wrote in response to","messageBody":"<div id=\"ygrps-yiv-457045592\">It isn&#39;t me, I swear.  We are the happiest of unschoolers on the block. I&#39;m <br/>\nnot just sideways asking, really &lt;g&gt;.<br/>\n<br/>\nActually, here is what I wrote in response to the person who e-mailed me. <br/>\nMaybe someone else will find it helpful:<br/>\n<br/>\nYou&#39;ve got a lot of things going on there.<br/>\n<br/>\nFirst is your concern about balancing everyone needs, and that can be an <br/>\nissue however you approach parenting. What are the things that your children <br/>\nwant to do? Is there a way you can do two things at once, breastfeeding and <br/>\nreading a story, building with lego while watching a movie, fixing dinner <br/>\nand chatting or dancing to the radio, or spending that time chatting with <br/>\nyour husband. David and I cook in tandem a lot of the time. I do the <br/>\ntortillas he makes the spanish rice. Lots of talking and touching and the <br/>\nyummy aromas fill the room. Are there ways that you and your husband can <br/>\nfind spousal time that isn&#39;t completely about in the evening, after the kids <br/>\nhave gone to bed, sitting in the living room sort of thing? Can you get up <br/>\nwith him in the morning to hang out before he goes to work (if he is the <br/>\nwage earner in the family)?<br/>\n<br/>\nIf you want to unschool, really, really want to get the unschooling mindset <br/>\nand incorporate it into your life and your family&#39;s lives than you have to <br/>\nfind other ways to achieving certain goals. That means letting go of the <br/>\nidea that adult time can only occur at certain times of day or that children <br/>\nhave to toughen up eventually otherwise how would they fit in the working <br/>\nworld. Unschooling takes a creative approach to life. It also takes you not <br/>\nbeing the only person picking the requests. On the drive home from bike <br/>\nriding today, when we&#39;d all gotten cold, I suggested making hot chocolate. <br/>\nWe only had one packet of premix left, but we had all the fixings for <br/>\nhomemade. Simon volunteered letting Linnaea have the premix, which is her <br/>\npreference, without being asked. I didn&#39;t have to choose who &quot;won&quot; that <br/>\ntime, they figured it out themselves. Unschooling takes being proactive, <br/>\nlike bringing food to someone who might be hungry or offering to help <br/>\nsomeone when they are working through a frustrating level on a game, or <br/>\nbeing sympathetic, or helping someone to be left alone when they are angry <br/>\nor frustrated and the distraction will help them to erupt.<br/>\n<br/>\nAnd to address your second question, if I&#39;m too nice to my children how will <br/>\nthey learn that the world can be a harsh place to live so that they won&#39;t be <br/>\ndisappointed when they get there? What if because you were so nice to your <br/>\nchildren they learned that they liked living in a nice world so they figured <br/>\nout ways to enjoy their lives and relish the nice moments. What if they saw <br/>\nyou deal with adversity, hard things, which happen in my life and in yours, <br/>\nI imagine, with an eye to finding the nice things, the good things, with you <br/>\ntrying to make the best out of the worst possible aspects of your life. We <br/>\nare currently trying to live within a budget. That means that the grocery <br/>\nshopping could be filled with stress and angst as we tend to overspend most <br/>\nthere. Last time we went there was a point when we&#39;d clearly gone past our <br/>\nbudget, so Linnaea and I looked through the cart and picked out a couple of <br/>\nhigh priced things and put them back. There was no stress, none. And when we <br/>\nwere done we were quite a way under the anticipated overspend. Diana Jenner, <br/>\nwho is on many of the unschooling lists, had her daughter die to leukemia a <br/>\nyear ago. She lost her husband to cancer 8 years ago, I think. There is no <br/>\nway that her son, Hayden, will ever believe that because Diana is nice to <br/>\nher the world isn&#39;t full of adversity. But what he will know is that <br/>\nadversity can be survived and that you don&#39;t have to feel miserable every <br/>\nmoment to grieve. And that this moment, right now, it is the best possible <br/>\nmoment to live and to be who and how you want to be.<br/>\n<br/>\nFor the third question, can unschoolers go to college?  Yes, I know that <br/>\nSandra Dodd&#39;s son Kirby has taken a few classes at community college. At <br/>\nleast one of Pam Sooroshian&#39;s daughters is at university now. Joyce <br/>\nFetteroll&#39;s daughter, who isn&#39;t 18 yet, is taking college classes. Peter <br/>\nKowalke, who was unschooled, has been and gone to college, his webpage is <br/>\nhere: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.peterkowalke.com/\">http://www.peterkowalke.com/</a> . I am a high school dropout and I have a <br/>\nmaster&#39;s degree. People from many different backgrounds get into university. <br/>\nI don&#39;t know if Simon or Linnaea will ever attend university. That is a long <br/>\nway away. But I have no doubt that if what they want to do includes spending <br/>\nsome time at university, and they want to follow that dream enough, they <br/>\nwill go to university. I think that is the difference with an unschooled <br/>\nchild, university isn&#39;t an end in and of itself. I went to university to <br/>\nfind out what I wanted to be. I don&#39;t think that will be Simon&#39;s or <br/>\nLinnaea&#39;s experience.<br/>\n<br/>\nOne of the things that helps me when I feel like I&#39;m not living unschooling <br/>\nwell, or that unschooling isn&#39;t the way forward, is to stop and think about <br/>\nwhat I want my life to be like. I want my children to be happy, to feel safe <br/>\nand good and to be happy. I want them to enjoy being with me. I don&#39;t need <br/>\nthem to enjoy each other, I can&#39;t dictate their relationships with other <br/>\npeople, but I can do a lot to try and make them feel good about how they get <br/>\nalong with me. I think joy is an amazing gift that I can help them to <br/>\naccess. And when I think about that, say after I&#39;ve yelled at them and I&#39;m <br/>\nsitting deciding if I want to feel justified in my rage, I breathe better <br/>\nand I let go of that anger and I see them as people who I enjoy being with <br/>\nand who I want to help get through whatever it was that they are struggling <br/>\nwith.<br/>\n<br/>\nI would strongly recommend that you post your questions to <br/>\nunschooling_basics or unschooling discussion. I only have two children so <br/>\nmay not be particularly good at helping you to work through any of your <br/>\nissues with juggling more. My husband is home a lot of the time, and while <br/>\nwe both miss time together sometimes, we are pretty good at getting time <br/>\ntogether. If you want me to post your questions anonymously, I&#39;ll happily do <br/>\nthat. No one on the lists wants to do anything but help you get to a place <br/>\nwhere you can unschool. I know the lists can be intense, but it helps if you <br/>\nimagine that the people are speaking to you as nicely as they can speak and <br/>\nthat they are trying to help.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TheLerews@...\">TheLerews@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, February 17, 2007 11:09 PM<br/>\nSubject: Re: [unschoolingbasics] anonymous request for help<br/>\n<br/>\n<br/>\n&gt; Hi Schuyler - I highly recommend you go the Yahoo website for this group <br/>\n&gt; and check under Files  for the reading list. I recently purchased a book <br/>\n&gt; from the list called  &quot;The Unprocessed Child: Living Without School&quot;  . I <br/>\n&gt; had many of the same questions you bring up and I found this book to be <br/>\n&gt; immensely helpful and reassuring.  Here is a link to the publisher&#39;s <br/>\n&gt; website as well. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ubpub.com/unprocessedchild.html\">http://www.ubpub.com/unprocessedchild.html</a>   If you check <br/>\n&gt; the Yahoo group files though, there are a number of great selections on <br/>\n&gt; parenting and unschooling.  Good luck! Paula<br/>\n&gt;<br/>\n&gt; -------------- Original message -------------- <br/>\n&gt; From: &quot;Schuyler&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\n&gt; I got sent this off list with permission to pass it on here.<br/>\n&gt;<br/>\n&gt; If you do not mind me asking, I am very curious about some of the thoughts <br/>\n&gt; behind unschooling and this type of &quot;parenting.&quot; What I have is a number <br/>\n&gt; of children who want to do different things and a husband who wants to <br/>\n&gt; have husband and wife time...well, if I pick one of the requests, does the <br/>\n&gt; tell the other members in my family that they are less important? I admit <br/>\n&gt; I do not know much about this approach, but I do want my children to feel <br/>\n&gt; loved and important. However, I do not want my sons thinking the world <br/>\n&gt; revolves around their needs. I may be able to give them what they want as <br/>\n&gt; a mother, but I do not want them to have culture shock in the future when <br/>\n&gt; their employer is not tending to their needs and wants or that his wife <br/>\n&gt; may not be so giving because she has other responsibilities. I know I need <br/>\n&gt; to read more info, but how do you handle these issues in the furture? <br/>\n&gt; Also, how does a child that was raised in with the &quot;unschooling&quot; theory or <br/>\n&gt; lifestyle go to college in the future? I wo<br/>\n&gt; uld appreciate your input.<br/>\n&gt;<br/>\n&gt; Thanks for any help you can offer.<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n&gt; www.waynforth.blogspot.com<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: anonymous request for help","postDate":"1171754786","msgId":21511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVyODJ2MitpNzZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwOWQwMWM3NTJlNyQ1YzJiNjdlMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":21506,"nextInTopic":21513,"prevInTime":21510,"nextInTime":21512,"topicId":21506,"numMessagesInTopic":0,"msgSnippet":"... Probably the most significant difference between what you have written here and what we do at our house, is that *I* am not the one who makes this","messageBody":"<div id=\"ygrps-yiv-59664387\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Schuyler&quot; <br/>\n&lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I got sent this off list with permission to pass it on here. <br/>\n&gt; <br/>\n&gt; If you do not mind me asking, I am very curious about some of the <br/>\n&gt;thoughts behind unschooling and this type of &quot;parenting.&quot;  What I <br/>\n&gt;have is a number of children who want to do different things and a <br/>\n&gt;husband who wants to have husband and wife time...well, if I pick <br/>\n&gt;one of the requests, does the tell the other members in my family <br/>\n&gt;that they are less important?<br/>\n<br/>\n </span></blockquote>Probably the most significant difference between what you have <br/>\nwritten here and what we do at our house, is that *I* am not the one <br/>\nwho makes this decision. I may make offers and suggestions and help <br/>\nbrainstorm different solutions, but we all try to work together to <br/>\nfind ways to do the things we want to do. <br/>\n<br/>\nSome days that&#39;s easier than others! But over time we have developed <br/>\na mutually supportive family relationship, rather than an <br/>\nadversarial one. There isn&#39;t a sense of picking one person&#39;s needs <br/>\n*over* another&#39;s. Everyone&#39;s needs are important, but sometimes we <br/>\nall need to do some juggling and prioritizing and problem solving. <br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":180989559,"authorName":"TheLerews@comcast.net","from":"TheLerews@...","profile":"bjlerew66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] anonymous request for help","postDate":"1171753744","msgId":21513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMTcyMDA3MjMwOS42MTQ3LjQ1RDc4QjBGMDAwRDJBQUMwMDAwMTgwMzIyMTY1NTE0MDY5Qzk5MEE5RDBBMDQwQTA4OUJAY29tY2FzdC5uZXQ+"},"prevInTopic":21511,"nextInTopic":21518,"prevInTime":21512,"nextInTime":21514,"topicId":21506,"numMessagesInTopic":0,"msgSnippet":"Hi Schuyler - I highly recommend you go the Yahoo website for this group and check under Files  for the reading list. I recently purchased a book  from the","messageBody":"<div id=\"ygrps-yiv-829166621\">Hi Schuyler - I highly recommend you go the Yahoo website for this group and check under Files  for the reading list. I recently purchased a book  from the list called  &quot;The Unprocessed Child: Living Without School&quot;  . I had many of the same questions you bring up and I found this book to be immensely helpful and reassuring.  Here is a link to the publisher&#39;s website as well. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ubpub.com/unprocessedchild.html\">http://www.ubpub.com/unprocessedchild.html</a>   If you check the Yahoo group files though, there are a number of great selections on parenting and unschooling.  Good luck! Paula<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;Schuyler&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt; <br/>\nI got sent this off list with permission to pass it on here. <br/>\n<br/>\nIf you do not mind me asking, I am very curious about some of the thoughts behind unschooling and this type of &quot;parenting.&quot; What I have is a number of children who want to do different things and a husband who wants to have husband and wife time...well, if I pick one of the requests, does the tell the other members in my family that they are less important? I admit I do not know much about this approach, but I do want my children to feel loved and important. However, I do not want my sons thinking the world revolves around their needs. I may be able to give them what they want as a mother, but I do not want them to have culture shock in the future when their employer is not tending to their needs and wants or that his wife may not be so giving because she has other responsibilities. I know I need to read more info, but how do you handle these issues in the furture? Also, how does a child that was raised in with the &quot;unschooling&quot; theory or lifestyle go to college in the future? I wo<br/>\nuld appreciate your input.<br/>\n<br/>\nThanks for any help you can offer.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"anonymous request for help","postDate":"1171753203","msgId":21506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWQwMWM3NTJlNyQ1YzJiNjdlMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":0,"nextInTopic":21511,"prevInTime":21505,"nextInTime":21507,"topicId":21506,"numMessagesInTopic":0,"msgSnippet":"I got sent this off list with permission to pass it on here. If you do not mind me asking, I am very curious about some of the thoughts behind unschooling and","messageBody":"<div id=\"ygrps-yiv-482554409\">I got sent this off list with permission to pass it on here. <br/>\n<br/>\nIf you do not mind me asking, I am very curious about some of the thoughts behind unschooling and this type of &quot;parenting.&quot;  What I have is a number of children who want to do different things and a husband who wants to have husband and wife time...well, if I pick one of the requests, does the tell the other members in my family that they are less important? I admit I do not know much about this approach, but I do want my children to feel loved and important. However, I do not want my sons thinking the world revolves around their needs.  I may be able to give them what they want as a mother, but I do not want them to have culture shock in the future when their employer is not tending to their needs and wants or that his wife may not be so giving because she has other responsibilities.  I know I need to read more info, but how do you handle these issues in the furture?  Also, how does a child that was raised in with the &quot;unschooling&quot; theory or lifestyle go to college in the future?  I would appreciate your input.<br/>\n<br/>\nThanks for any help you can offer.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21470,"nextTopicId":21523}}