{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":328358712,"authorName":"Amy","from":"&quot;Amy&quot; &lt;naturalmamaof2@...&gt;","profile":"naturalmamaof2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"camp update and misc","postDate":"1248779454","msgId":40829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg0bW1idSt2c2JkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":40828,"nextInTime":40830,"topicId":40829,"numMessagesInTopic":0,"msgSnippet":"Good morning! Thanks for all of your input a few weeks ago regarding my son s camp.  He went for the week and chose not to go back!  I was not thrilled with","messageBody":"<div id=\"ygrps-yiv-2066602682\">Good morning!<br/>\nThanks for all of your input a few weeks ago regarding my son&#39;s camp.  He went for the week and chose not to go back!  I was not thrilled with the situation, but kept quiet and left it up to him, and would have gone with whatever his choice was.  We talked throughout the week about what was going on, about camp rules and how the counselors handled things, what he liked and didn&#39;t like.  In the end he did not enjoy how he was treated and really just missed his counselors from last year.  We have stayed in touch with one of the counselors from last year and are looking forward to a bbq with his and our families at the end of the summer!  DS is really looking forward to this and can&#39;t wait to see him.  <br/>\n<br/>\nIt feels good to truly honor who my children are, get a different perspective and feel grateful for all of our blessings each day in all situations.  We have been on the unschooling path for a little over a year and things are starting to make sense for all of us.  My role as facilitator and the kids being who they are and trusting their decisions.  I find things go the smoothest when I hold that trust in the forefront and examine my own thoughts and feelings about things, i.e. why am I saying &quot;no&quot; or what are my fears!  The joy that results from living this way is unbelievable!  I am not great at it all of the time, but I am finding more and more that I am able to be true to who I am and who my children are.  <br/>\n<br/>\nMy two year old dd just decided to get her ears pierced!  How empowering for her!!!  She had been talking about it for a while and last week just decided she wanted to go, now!  We went and the folks were wonderful with her!  They explained everything to dd, addressing her and letting her make choices.  I was impressed!  DD has been showing everyone and she even cut her own hair yesterday so you can &quot;see my earrings&quot;  Today she wants to go to the salon to get her hair evened out!  We&#39;ll see if she is still into it this morning.  Big brother had gone to the barber for the first time a couple of months ago, so she has that experience in her mind as well.<br/>\n<br/>\nI am slowly beginning to understand and experience the joy this kind of life brings.  I also found the parenting cards from naturalchild.org to be helpful when I feel myself spiraling into a negative zone, I just pull out a few to read to remind myself where I want to be, ds will even say, &quot;Mommy, the cards, the cards, go get the cards!&quot;<br/>\n<br/>\nThe unschooling lists are much appreciated!  It&#39;s great to read and feel that there are others out there striving for and achieving similar goals for our families!  I also finally understand why there is no formula for this type of living...every family and person are different with differing needs.  I am grateful for my son&#39;s great spirit that has led us down this path, and notice wonderful things happening in all of us!  Thank you for all of your support!  Hope some of this is encouraging to newer folks.<br/>\n<br/>\nLooking forward to the NE conference at the end of August!  Hope to see many of you there!<br/>\n<br/>\nLove and light!<br/>\nAmy</div>","specialLinks":[]}],"prevTopicId":40811,"nextTopicId":40831}}