{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: making home more fun was How to prepare for school?","postDate":"1259090360","msgId":42159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyOEY2QjE4QzIzQTQyNTI5NEIxRjU1NUQ0NzVDMDg3QGJpZ3N1cnByaXNlPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":42158,"nextInTime":42160,"topicId":42159,"numMessagesInTopic":0,"msgSnippet":"***but it always seems like I have to push him (gently) to do something.*** It sounds like you re not fully seeing the value in his choice to play video games","messageBody":"<div id=\"ygrps-yiv-1267966266\">***but it always seems<br/>\nlike I have to push him (gently) to do something.***<br/>\n<br/>\nIt sounds like you&#39;re not fully seeing the value in his choice to play video games and so are working to get him to do something else.   It&#39;s ok for him to like and to very often choose video games.  It would not be great if video games were his only good option.    People recommend parents offer things they know a child likes, not because there&#39;s something wrong with video games(or other big interests) but because without a parent&#39;s help a child might not be able to see or get to all the other things there are to choose from.  <br/>\n<br/>\n***He doesn&#39;t like to go to<br/>\nunschooling events even though he seems to enjoy parts of them (like making<br/>\ngoop). ***<br/>\n<br/>\nMy son wouldn&#39;t have liked events with a bunch of other people.(even if there had been unschooling events for us)  He much preferred to be home or out exploring with me.  If he wanted to be with friends one or two was the preference.  Some people are not event or group people.&lt;g&gt;  And you can make goop together at home if he likes that. <br/>\n<br/>\n*** I think the main problem is trying to find something we both would love to do.***<br/>\n<br/>\nThere might not be many things you enjoy the way an eight year old boy would.  You can stretch more and do things you know he loves even if you&#39;re not wild about them.  Schuyler Waynforth recently wrote about how she has come to enjoy the things her kids love by seeing their enjoyment.   Even if you don&#39;t love the activity, if you participate, watch your kids and see what they love about it, your appreciation for the thing will grow.  Don&#39;t wait to be interested in the same things.  Your kids aren&#39;t waiting.  You don&#39;t get another chance to be the fun mom of this eight year old. He doesn&#39;t get another chance to have a fun mom if you&#39;re not it. <br/>\n<br/>\nIt is great to have your own interests.  That&#39;s part of what makes you an interesting person but if you&#39;re doing what you&#39;re interested in, waiting to get interesting in something he&#39;s doing, that&#39;s not enough.  You need to be involved with what he&#39;s doing, develop an appreciation for it by watching him and seeing what he loves.   And even if you never love bionicles or legos or video games you can love your son&#39;s enjoyment.<br/>\n<br/>\n<br/>\n***Besides my worry over his development, our life has been pretty peaceful and<br/>\nenjoyable lately but I wouldn&#39;t call it fun.***<br/>\n<br/>\nAre you referring to your fun or his?  Is he happy playing video games?   If he&#39;s content then that&#39;s good.   Continue to offer other things - without pushing.  Don&#39;t offer what you think would be good for him to do, offer what you know he&#39;ll like.   Don&#39;t offer because *you* want him to want to do something different.     If video games aren&#39;t his only good option then he&#39;s choosing them because he&#39;s getting something out of them.   If you&#39;re still struggling with your feelings about video games, hang out with him when he&#39;s playing.   Play them too.  <br/>\n<br/>\n*** fun things to do for quiet video loving boys...***<br/>\n<br/>\nDylan liked to talk to me about his games (and he&#39;d make up stories about the game characters and tell me those stories) so maybe you can make it really convenient for him to talk with you if you&#39;re making dinner or whatever.  I got a stool for Dylan to sit on beside me in the kitchen.  <br/>\n<br/>\nWhen your son plays with his guys, sit and play with him or just sit and let him act out the play for you.  Be his audience.<br/>\n<br/>\nDoes he like movies and are their movies based on the games he likes or movies with similar themes?   We used to make a big deal about movies, have special food, either platters or popcorn or his favorite cookies or something.  We&#39;d sometimes fold out the hide-a-bed sofa and flop there with all our goodies and watch a movie, or put up Dylan&#39;s little tent and snuggle in there with pillows and blankets.   Dylan is seventeen and a movie at home is still an event.  We make a plan, we settle in with just the right food or snack.  It&#39;s a lovely time together. <br/>\n<br/>\nDoes he like to browse book stores?  Some play loud music but if you go during hours when most people are at work or school the stores are less busy and you can sit around and read or run around and check everything out.   Comic book stores?   When Dylan was into writing stories we found a comic book store that would publish kids comics and put them for sale in their store.   <br/>\n<br/>\nYou said he doesn&#39;t enjoy events much but would he enjoy going out with you?  Dylan liked to go for walks, liked to find places to explore (culverts under roadways, dark places under bridges -he was Troll Boy&lt;g&gt;)<br/>\nWe&#39;d go out for French fries, go roam museums, the parks,  junk stores, art galleries, vacant lots, the cemetery...<br/>\n<br/>\nWe liked hiking and snowshoeing, quiet and wonderful. <br/>\n<br/>\nWe sometimes rent Forest Service cabins for a weekend.  Cheap fun!&lt;g&gt; <br/>\n<br/>\nWe went swimming when there was no one else at the pool.  There are a lot of things you can do together in the off hours when there&#39;re aren&#39;t crowds of people around. <br/>\n<br/>\nAnd if he really doesn&#39;t like to leave home stay home and play video games with him or watch him play.  If you watch or participate you&#39;ll have a lot to talk about.  It will help you  find other games he might enjoy and help you find movies or books or toys he&#39;ll like.   <br/>\n<br/>\nDo you have a yard and can you build a fire outside?  Fires are fun to poke with a stick, roast marshmallows or hot dogs - a nice quite activity.  <br/>\n<br/>\nPut up a tent in your yard.  Put some chairs and cots in there.   <br/>\n<br/>\nGet a trampoline.<br/>\n<br/>\nWhat you do will depend on what your kid enjoys.   How you do the everyday little things is important. How interested you are in what your kids are doing, how interesting you are, those are the things that make the atmosphere of a home joyful and happy.<br/>\n<br/>\n***Besides my worry over his development...***<br/>\n<br/>\nAre you worried because of the video games?  Read here again if it&#39;s been awhile: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/\">http://sandradodd.com/videogames/</a><br/>\n<br/>\n***... with mothers who have almost no patience for technology (hence the<br/>\nreason for my rare postings) ***<br/>\n<br/>\nTechnology is a big part of the world your children will live in their whole lives.   You might still live without a lot of technology but you&#39;d have to go far to find a place and you&#39;d have to take a car or train or plane to get there.&lt;g&gt;   You&#39;ll still need a shovel if you&#39;re going to grow your own food and an axe if you&#39;re going to keep yourself warm and build a shelter.  Maybe you&#39;ll never be a person who has to have all the latest gadgets but don&#39;t overlook a big part of the world your kid obviously enjoys.   Get at least comfortable enough with it that you can really appreciate your son&#39;s interests.   <br/>\n<br/>\nUnschooling doesn&#39;t happen automatically when you decide not to send a kid to school and not to have school at home.  It takes work and commitment on the part of at least one parent.  It requires deep involvement with kids and what they&#39;re doing and it often means putting off for awhile or scaling back our own pursuits in order to be available to our kids.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42129,"nextTopicId":42175}}