{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How am I doing?","postDate":"1264701952","msgId":43083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqc2ptMCt1M2Q3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqbTk4Yithcmo4QGVHcm91cHMuY29tPg=="},"prevInTopic":43072,"nextInTopic":0,"prevInTime":43082,"nextInTime":43084,"topicId":43055,"numMessagesInTopic":0,"msgSnippet":"... ******************** Deciding on lessons is a little more agressive than pure strewing - not that its inherently bad but it does point out that you have","messageBody":"<div id=\"ygrps-yiv-1564418363\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;whatismyusername@...&quot; &lt;whatismyusername@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I always have a desire to learn to play piano and I think it would be nice for my DS4 to give it a try too. I watched him and see if I could detect some interest in piano. To be honest, I was not very sure. But I went ahead to arrange piano lessons for both of us.<br/>\n </span></blockquote>********************<br/>\n<br/>\nDeciding on lessons is a little more agressive than pure &quot;strewing&quot; - not that its inherently bad but it does point out that you have a sort of &quot;default option&quot; in your mind, which is that classes are a preffered way to learn something. Why not just make a keyboard available to him and let him see you practice? Why not offer to play with him with the keyboard? Do you see what I mean? It&#39;s not that its bad to offer things, even classes - and with younger kids the difference between &quot;offer&quot; and &quot;try&quot; is pretty hazy anyway, its that you jumped right from &quot;learn&quot; to &quot;lessons&quot; without exploring other alternatives (that you mentioned here, anyway) first. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Same thing is true with swimming class. He had bad experience with swimming class when he was about 3. After that, he taught himself swimming in the last couple of months by spending time in the pool. But his forms are not very efficient. So I thought it might be a good idea to get some instruction from professionals. He learned fast and really liked it.<br/>\n </span></blockquote>************************<br/>\n<br/>\nEssentially the same - why not let him continue to play around with swimming if he&#39;s enjoying it and learning from it? Does his &quot;form&quot; need to improve on any timetable but his own? Again, its not that lessons are bad! This is more a matter of your own personal deschooling than anything else. The school-in-your-head is still wrapped around the idea that learning somehow &quot;comes from&quot; professionals. Its something to keep thinking about, but not to beat yourself up over! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He indicates he would like to make more friends.<br/>\n<br/>\n </span></blockquote>Now, given everything I just said *this* might be a good reason to try out some classes - so he has chances to meet other people with similar interests. It would also be good to look for more playdates and homeschool groups, but when those are scarce, classes can be a good option, too. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He learned letters when he was 2.5 years old by watching letter factory.  But he didn&#39;t really get into phonics (words and sentences). So I didn&#39;t push. Lately he started writing sentences that he made up with letters (not real English words). Also he started asking me to read some labels, instructions and spell some words for him. So I am getting word factory and see if he can learn reading from there.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nChallenge yourself to go beyond that littel voice in your mind saying learning needs teaching to happen - don&#39;t bother with the &quot;letter factory&quot;. Keep watching and helping him learn to read. You don&#39;t Need extra stuff - if you&#39;re home is full of things with letters and symbols, words and numbers, and you&#39;re willing to answer his questions, then he has what he needs to learn to read. He doesn&#39;t need phonics if those don&#39;t interest him - for some people phonics are great, others find them utterly useless! So don&#39;t fuss about the details of How he&#39;s learning. He&#39;s learning! <br/>\n<br/>\nMany kids write before they read - its one of the really commom pathways to literacy. So help him write as much as he wants. Don&#39;t prompt him to sound things out, give him exactly what he asks for - if he says &quot;how do I spell...&quot; then spell it for him. If he writes something in invented spelling and asks you to read it, do the best you can - I mean don&#39;t deliberately mispronounce things to teach him a lesson. You&#39;ll likely mis-read enough of his invented spellings just trying to figure it out without having to fake anything, and That&#39;s valuable information to him about writing and spelling. If he&#39;s interested in that information he&#39;ll ask, if not, he&#39;ll correct you and move on. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He likes me to participate in his play. TV watching is one of the few activities he doesn&#39;t mind doing alone. What can I do to encourage him to play alone more or are there other options?<br/>\n </span></blockquote>***********************<br/>\n<br/>\nThere&#39;s not much you can do to encourage him to play alone - essentially you&#39;re asking him to go against his basic temperament! Instead, find ways to do more of the things you do in the same room with him while he&#39;s watching tv - get more tvs if necessary so he can be in the room where you&#39;re cleaning up or whatever. At the same time, invite him to be a part of what you&#39;re doing. That gives him a whole new set of options - he doesn&#39;t have to choose between mom and tv or tv and play. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How am I doing?","postDate":"1264604372","msgId":43072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3RDUxNTU2LUQ0NDctNEQzMy1BNkU3LTYxOEE1MEIxNzg3Q0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhqbTk4Yithcmo4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhqbTk4Yithcmo4QGVHcm91cHMuY29tPg=="},"prevInTopic":43055,"nextInTopic":43083,"prevInTime":43071,"nextInTime":43073,"topicId":43055,"numMessagesInTopic":0,"msgSnippet":"... If his passion will one day be steam engine trains how can he explore them if he s never seen them? ... That one s iffier, especially since it turned out","messageBody":"<div id=\"ygrps-yiv-459932103\">On Jan 26, 2010, at 3:31 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:whatismyusername@...\">whatismyusername@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So my question: is it imposing since he didn&#39;t show interest before  <br/>\n&gt; I arranged the lessons? Or I am strewing? Put things out there and  <br/>\n&gt; see if there is interest?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If his passion will one day be steam engine trains how can he explore  <br/>\nthem if he&#39;s never seen them?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But his forms are not very efficient. So I thought it might be a  <br/>\n&gt; good idea to get some instruction from professionals. He learned  <br/>\n&gt; fast and really liked it.<br/>\n<br/>\n<br/>\n </span></blockquote>That one&#39;s iffier, especially since it turned out well!<br/>\n<br/>\nIf you&#39;re beginning with the feeling &quot;Hey, this is something he might  <br/>\nlike,&quot; even if he&#39;s shown no interest, *and* he can drop it any time,  <br/>\nthat&#39;s helpful for fostering exploration.<br/>\n<br/>\nIf you&#39;re beginning with the feeling he&#39;s broken or lacking and you&#39;d  <br/>\nlike to give him the opportunity to be not lacking, that sets off  <br/>\nsome alarm bells of vestiges of schoolish thinking. The lessons  <br/>\nobviously didn&#39;t hurt him and he enjoyed them, but if you notice your  <br/>\nthoughts turning to his faults and deficiencies and how to fix them,  <br/>\nit will help a lot to turn away from those and look more at him and  <br/>\nwhat he enjoys so you can help him better and impose your agenda on  <br/>\nhim less.<br/>\n<br/>\nIt&#39;s the intent behind the actions that&#39;s more indicative of  <br/>\nunschoolish or schoolish approaches, not the actions themselves.<br/>\n<br/>\n  It will be a process! It&#39;s hard to weed out old thought patterns  <br/>\nyou&#39;re not aware of.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I am getting word factory and see if he can learn reading from  <br/>\n&gt; there.<br/>\n&gt;<br/>\n&gt; So am I strewing or am I imposing or teaching?<br/>\n<br/>\n<br/>\n </span></blockquote>Maybe a bit of both but even more: you&#39;ll be doing something totally  <br/>\nunnecessary.<br/>\n<br/>\nWhen he started making sounds that  sounded like talking, did you do  <br/>\na program with him to help him make more sounds?<br/>\n<br/>\nLearning to read is such a fearful topic for most parents. If kids  <br/>\ndon&#39;t read by 6, they&#39;re supposedly on a doomed for life pathway.<br/>\n<br/>\nHow would reading make him better at being 4 than he is right now?<br/>\n<br/>\nWhat if the program frustrates him and he withdraws from the happy  <br/>\npath of discovery he&#39;s on right now?<br/>\n<br/>\nWhat if he&#39;s reading by the end of the program and he&#39;s robbed of the  <br/>\nopportunity to feel he figured out reading all on his own?<br/>\n<br/>\nFirst, and foremost, reading can&#39;t be taught. If a child&#39;s brain  <br/>\nisn&#39;t developmentally ready, they can&#39;t be taught to figure out  <br/>\nwhat&#39;s impossible for them any more than a 3 mo can be taught to  <br/>\nwalk. Second, *if* he&#39;s ready, a program might give him a few tips  <br/>\nthat can make things click. *But* if he&#39;s ready, he&#39;s going to figure  <br/>\nthem out on his own fairly quickly. The treacherous thing about  <br/>\nprograms is that if the program is happening while the child is  <br/>\nfiguring things out, it can appear like the program taught them to  <br/>\nread, when in truth the reading would have happened anyway.  <br/>\n(Unschooled kids without programs have the same range of ages when  <br/>\nthey learn to read as schooled kids. What they lack, though, is  <br/>\nfeeling they&#39;re broken when other kids are picking up reading sooner.)<br/>\n<br/>\nThink of reading like a crossword puzzle. You *could* look up the  <br/>\nsolution and fill the words in. But how much fun is that? Filled in  <br/>\nsquares is secondary to the process of getting there. A reading  <br/>\nprogram is like reading the solution and telling the child what word  <br/>\nto put in which line of squares. It&#39;s much more fun to take a  <br/>\nmeandering path, making discoveries, asking a few questions,  <br/>\nfollowing ones bliss and figuring out the puzzle of reading yourself.<br/>\n<br/>\nIf he&#39;s having fun, my advice is: Don&#39;t muck with it to move him to  <br/>\nwhere you think he should go. Joy is way more important than progress  <br/>\nalong a path that Mom thinks is worthwhile.<br/>\n<br/>\nPlease do read:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I feel bad about my unavailability.<br/>\n<br/>\n<br/>\n </span></blockquote>You&#39;ll be a calmer, happier mom if you recognize what are real world  <br/>\nlimitations and what are in your control. You&#39;ll be more calm with  <br/>\nyour children when they&#39;re pulling you in two different directions  <br/>\nwhen you accept real world limitations. If extraordinary effort and  <br/>\nsacrifice needs made to make a first choice available when he&#39;s happy  <br/>\nwith a second choice, you&#39;re going to run yourself ragged. While it&#39;s  <br/>\ngood for moms to recognize they do need to put in the extra effort  <br/>\nand make life more inconvenient for themselves because their kids  <br/>\nhave so little power in this world and what they have all comes from  <br/>\nus. But treating ourselves kindly is important for them to see also.  <br/>\nIt&#39;s hard to respect someone who isn&#39;t respecting herself and finding  <br/>\nways (that take as little as possible from the kids) to meet her own  <br/>\nneeds.<br/>\n<br/>\nIs your guilt triggered by him not having his favorite choice  <br/>\navailable all the time or because his second choice is usually TV?<br/>\n<br/>\nNot every option is available all the time.<br/>\n<br/>\nTV is not the devil. It&#39;s an option.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What can I do to encourage him to play alone more or are there  <br/>\n&gt; other options?<br/>\n<br/>\n<br/>\n </span></blockquote>Why do you want him to change who he is so you can feel less guilty?<br/>\n<br/>\nThe only people we can change are ourselves. So better to work on  <br/>\nletting go of unreasonable guilt than changing him so you don&#39;t have  <br/>\nto feel guilty!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 3. Socialization<br/>\n&gt; He indicates he would like to make more friends. This is new. He  <br/>\n&gt; was &quot;shy&quot; before. But since he turned four, he likes to play with  <br/>\n&gt; other children. I feel I should arrange some play dates or parties.  <br/>\n&gt; But I am kind of alone person. It seems I am looking for excuses  <br/>\n&gt; not to get together with people. I feel it is lots of work and  <br/>\n&gt; pretty stressful.<br/>\n<br/>\n<br/>\n </span></blockquote>It *is* stressful for introverts. But it&#39;s stressful for the anti- <br/>\nsugar people to let go of their discomfort to help their kids too ;-)<br/>\n<br/>\nI don&#39;t have any great tips except to say that just because another  <br/>\nmother isn&#39;t coming up to you to set up a playdate with her child,  <br/>\ndoesn&#39;t mean she wouldn&#39;t ask if she wasn&#39;t shy too ;-) She might  <br/>\nthink it&#39;s great and wished she were bolder. Or she might be stressed  <br/>\nand overscheduled and say no and that&#39;s a good thing to find out  <br/>\nright away too :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":430148316,"authorName":"whatismyusername@ymail.com","from":"&quot;whatismyusername@...&quot; &lt;whatismyusername@...&gt;","profile":"whatismyusername@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How am I doing?","postDate":"1264494667","msgId":43055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqbTk4Yithcmo4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43072,"prevInTime":43054,"nextInTime":43056,"topicId":43055,"numMessagesInTopic":0,"msgSnippet":"In the last couple of months, I have been reading, thinking and practicing unschooling and mindful parenting. I still have lots of questions. here are a few I","messageBody":"<div id=\"ygrps-yiv-970272556\">In the last couple of months, I have been reading, thinking and practicing unschooling and mindful parenting. I still have lots of questions. here are a few I would like to have some input and let me know how I am doing.<br/>\n<br/>\n1. Is it strewing, initiating or imposing?<br/>\n<br/>\nI always have a desire to learn to play piano and I think it would be nice for my DS4 to give it a try too. I watched him and see if I could detect some interest in piano. To be honest, I was not very sure. But I went ahead to arrange piano lessons for both of us. I didn&#39;t really have much expectation. If he is into it, that will be great. If not, we will stop. I didn&#39;t want to force on him. <br/>\n<br/>\nThe piano teacher is fantastic. I enjoyed her teaching tremendously. DS4 likes it too (right now still lots of play, art work, ear training and music reading).<br/>\n<br/>\nSo my question: is it imposing since he didn&#39;t show interest before I arranged the lessons? Or I am strewing? Put things out there and see if there is interest?<br/>\n<br/>\nSame thing is true with swimming class. He had bad experience with swimming class when he was about 3. After that, he taught himself swimming in the last couple of months by spending time in the pool. But his forms are not very efficient. So I thought it might be a good idea to get some instruction from professionals. He learned fast and really liked it.<br/>\n<br/>\nWhat I am doing now is to watch his interest and readiness. The past experience taught me that when he was ready, he learned fast.<br/>\n<br/>\nHe learned letters when he was 2.5 years old by watching letter factory.  But he didn&#39;t really get into phonics (words and sentences). So I didn&#39;t push. Lately he started writing sentences that he made up with letters (not real English words). Also he started asking me to read some labels, instructions and spell some words for him. So I am getting word factory and see if he can learn reading from there.<br/>\n<br/>\nSo am I strewing or am I imposing or teaching?<br/>\n<br/>\n2. Is TV watching becoming a default option?<br/>\nHe likes to watch TV (actually videos from netflix). He indicates he would like to do something else. But since I need to nurse DD1 or I am busy with other things, he would choose to watch TV than other options. I don&#39;t mind him watching TV. But I know if I am available he would rather do something else, such as driving his car, pretend play, swimming or other things. I feel bad about my unavailability. <br/>\n<br/>\nHe likes me to participate in his play. TV watching is one of the few activities he doesn&#39;t mind doing alone. What can I do to encourage him to play alone more or are there other options?<br/>\n<br/>\n3. Socialization<br/>\nHe indicates he would like to make more friends. This is new. He was &quot;shy&quot; before. But since he turned four, he likes to play with other children. I feel I should arrange some play dates or parties. But I am kind of alone person. It seems I am looking for excuses not to get together with people. I feel it is lots of work and pretty stressful.<br/>\n<br/>\nAny suggestions?<br/>\n<br/>\nJoy (mother of DS4 and DD 1)</div>","specialLinks":[]}],"prevTopicId":43070,"nextTopicId":43024}}