{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184947447","msgId":25067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcwNzIwMDkwNHY1ZDQ2ZWQ0Znk4NDM1MTg4YzY4MTFjYzhkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGY3bGhsZis2M2ZsQGVHcm91cHMuY29tPg==","referencesHeader":"PDc1MzUwYTJjMDcwNzE3MTM1N2kzMmUyYmI2NW0yNzJlMzM5MjFkYTM0MTEyQG1haWwuZ21haWwuY29tPgkgPGY3bGhsZis2M2ZsQGVHcm91cHMuY29tPg=="},"prevInTopic":25023,"nextInTopic":0,"prevInTime":25065,"nextInTime":25068,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"I spoke to a couple of high school *jocks* when my kids were beginning their interest in group sports, to get a feel on the *commitment factor* and how it","messageBody":"<div id=\"ygrps-yiv-1653989416\">I spoke to a couple of high school *jocks* when my kids were beginning their<br/>\ninterest in group sports, to get a feel on the *commitment factor* and how<br/>\nit plays into their experiences. These girls were seniors in a very small<br/>\ntown where the coercion was HUGE to play multiple sports.<br/>\nOne girl was adamant there was nothing worse than teammates who don&#39;t want<br/>\nto be there. She&#39;d prefer to play with others who were as happy to be there<br/>\nas she was. I think she&#39;d&#39;ve played lots of sports regardless of the<br/>\ncoercion.<br/>\nThe other girl agreed and then gave me her parents&#39; party line of &quot;one must<br/>\nfollow through with their commitments&quot; -- it was obvious those were not her<br/>\nown words and all three of us realized it immediately. She then went on to<br/>\nsay she really only liked ONE of the things she was involved in and excels<br/>\nthere; the other FOUR activities were the wishes of others and yeah, she<br/>\ndidn&#39;t give 100% and sometimes it really would be better if the group was<br/>\nsolely of those who had passion.<br/>\n-=-=-=-=-<br/>\nHayden (soon 9) has not been interested in group/team stuff lately. When he<br/>\nwanted to play basketball (he was 6.5), he was on a team with a couple of<br/>\nfriends and decided pretty quickly that this was not for him. He stopped<br/>\ngoing and his friends played with him at other times, it was no big deal<br/>\nthat the b-ball team wasn&#39;t a match. He still plays basketball and loves it.<br/>\nWhen he wants more or different, he&#39;ll ask and we&#39;ll figure out what to do.<br/>\nI started a full moon circle last summer. I don&#39;t go anymore; the women I<br/>\ngathered still meet. Cool! It just wasn&#39;t what I needed, I&#39;m glad it&#39;s what<br/>\nthey need. When/if I need it, the full moon will still be there for me to<br/>\ncelebrate every month and I&#39;ll still be able to round up some friends to do<br/>\nthat with.<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184778735","msgId":25023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3bGhsZis2M2ZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzUwYTJjMDcwNzE3MTM1N2kzMmUyYmI2NW0yNzJlMzM5MjFkYTM0MTEyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":25018,"nextInTopic":25067,"prevInTime":25022,"nextInTime":25025,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"Rob, My husband struggles with the same things that you mentioned.   When we first got married (many MANY years ago! ha!)  his grandparents and/or father would","messageBody":"<div id=\"ygrps-yiv-1831872566\">Rob, <br/>\nMy husband struggles with the same things that you mentioned.   When<br/>\nwe first got married (many MANY years ago! ha!)  his grandparents<br/>\nand/or father would ask if we would be attending church that weekend<br/>\n(their tradition was to attend church together and then go out for<br/>\nlunch)  if he said we were planning on it then he absolutely just<br/>\ncould not get up in the morning and NOT go!   There were times when we<br/>\ndecided we were tired or just didn&#39;t feel like going to church that<br/>\nmorning but he really had a big problem with it!   I think the biggest<br/>\nissue for him was that if we didn&#39;t go we would be reminded that we<br/>\ndidn&#39;t go (don&#39;t you know you go straight to special hell if you don&#39;t<br/>\ngo to church with your overbearing, guilt inducing grandparents and<br/>\nfather every Sunday? or at least in the south you do)  his grandmother<br/>\nand his father can induce guilt for things you never even thought to<br/>\ndo.   They possessed an ability to see inner motivation in their<br/>\nerrant, evil family member (I wonder if they can foresee lottery<br/>\nnumbers? ).  It became quite an issue for me because it really wasn&#39;t<br/>\nabout church or us going or not going or even our word.,..it was about<br/>\ncontrol... they wanted it and I at least was not wiling to give it to<br/>\nthem!    <br/>\n<br/>\nWhile I was raised very differently from the way I am raising my<br/>\nchildren my parents were always willing to discuss something that I<br/>\nwanted or didn&#39;t want to do and my viewpoint was always valued and<br/>\nconsidered in the decision.    It took my husband a really long time<br/>\nto be able to wrest that control from their hands... ok actually his<br/>\ngrandmother died so that helped but his father is still around and we<br/>\nstill have issues on occasion where we have to remind him we are<br/>\nadults and his opinion wasn&#39;t asked for.  <br/>\n<br/>\nI struggle with the whole making a commitment to a team thing as well<br/>\nbut only as it relates to whether the team can continue or not if the<br/>\nchild decides not to go.   I also ask that the child let someone know<br/>\nthey aren&#39;t coming if they are expected (common courtesy in my opinion<br/>\nwhich I think is sorely lacking in our society!)   I have also found<br/>\nthat when my kids sign up for a team or class etc and suddenly don&#39;t<br/>\nwant to go there&#39;s usually a reason ...rarely is it just they don&#39;t<br/>\nwant to that day.   Usually it&#39;s a situation that can be worked out by<br/>\nme helping them role play a good solution or giving them something<br/>\nthat might help them see the viewpoint of another person and there<br/>\nhave been times I have spoken to the teacher or coach.   <br/>\n<br/>\nOne time in particular my oldest suddenly wanted to quit an activity<br/>\nshe had LOVED ... it was time to leave for the activity and she burst<br/>\ninto tears and said she really just wanted to quit!   Once we talked<br/>\nabout it I found out that a leader she really respected had been<br/>\nreally sarcastic and grumpy to the kids the last few meetings and her<br/>\nfeelings were really hurt.    I spoke to the leader and he was very<br/>\nupset that some stress he was feeling in his life had surfaced in his<br/>\ndealings with the kids.. he apologized to Sarah and we now count him<br/>\nas a very dear friend.   Now when he says something sarcastic Sarah<br/>\nfeels comfortable calling him on it because he gave her that<br/>\npermission.  It also taught her that adults are not infallible and<br/>\nthat she is not powerless in such situations.    There are so many<br/>\nthings in life that make us feel powerless ... it&#39;s great for our kids<br/>\nto have situations where they can work out these skills.    <br/>\nHeck the darn swim team can probably go right on without the first<br/>\nposter&#39;s niece but that little baby cousin she wanted to see will only<br/>\nbe little for a very short time!<br/>\nLisa Blocker</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184771786","msgId":25018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3bGFzYSs1cG0yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY3anZuMitqcjF1QGVHcm91cHMuY29tPg=="},"prevInTopic":25007,"nextInTopic":25023,"prevInTime":25017,"nextInTime":25019,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"... And some life-long dabblers are pretty famous... DaVinci and Aristotle come to mind. And wasn t Ben Franklin kind of a dabbler? For that matter, part of","messageBody":"<div id=\"ygrps-yiv-377843878\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Heck, some of us are life-long<br/>\n&gt; dabblers.<br/>\n<br/>\n </span></blockquote>And some life-long dabblers are pretty famous... DaVinci and Aristotle <br/>\ncome to mind. And wasn&#39;t Ben Franklin kind of a dabbler? <br/>\n<br/>\nFor that matter, part of the idea of a &quot;well rounded education&quot; is <br/>\nthat kids need to dabble in a bunch of different subjects to find out <br/>\nwhat they like and are good at. Trouble is they aren&#39;t trusted to <br/>\ndecide what to dabble in and when.<br/>\n<br/>\nOne of the fears that parents have wrt pulling kids out of school is <br/>\nthat they don&#39;t seem to have *enough* interests - well, all their <br/>\ndabbling is being sucked up by school. It was almost six months after <br/>\nleaving school before Ray started dabbling. It was kind of exciting.<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184733188","msgId":25007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcwNzE3MjEzM3k4MDY0MmI4dTY3ZWFlZWMxZWNjODliNzVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGY3azBhcStodWxwQGVHcm91cHMuY29tPg==","referencesHeader":"PDc1MzUwYTJjMDcwNzE3MTM1N2kzMmUyYmI2NW0yNzJlMzM5MjFkYTM0MTEyQG1haWwuZ21haWwuY29tPgkgPGY3azBhcStodWxwQGVHcm91cHMuY29tPg=="},"prevInTopic":25005,"nextInTopic":25018,"prevInTime":25006,"nextInTime":25008,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"Ren, Yes, I ve got two, ages 5.5 and a bit over 4.  And yes if you haven t guessed, I m still in the very-much theoretical stage.  I m practicing as much as","messageBody":"<div id=\"ygrps-yiv-199377886\">Ren,<br/>\n<br/>\nYes, I&#39;ve got two, ages 5.5 and a bit over 4.  And yes if you haven&#39;t<br/>\nguessed, I&#39;m still in the very-much theoretical stage.  I&#39;m practicing as<br/>\nmuch as possible, but just as soon as I feel like I&#39;ve got something down in<br/>\npractice, another &quot;parenting fear&quot; (gotta make sure our kids are raised up<br/>\nRIGHT!) comes back up.  Like &quot;commitment.&quot;  and the whole &quot;what do I do<br/>\nabout THAT?&quot;  These discussions point out the need for more child<br/>\ndevelopment info.<br/>\n<br/>\nThis whole RU thing is one big re-modeling of my concepts of parenting.<br/>\nWhat really frustrates me is that whenever we&#39;re around other families, I<br/>\nfeel sucked into yet another game of &quot;Whose Kids Are The Best?&quot;  and &quot;The<br/>\nComparison Game!&quot;  You lose points whenever little Janie hits someone else,<br/>\nbut the parent can score by how they react.  And the judges are the other<br/>\nparents.  It&#39;s liberating to let that horse manure go (when it can be<br/>\nmanageed).  Knowing where my kids are, and what they need gives more<br/>\nconfidence in how we interact together.  It helps me toss out the need for<br/>\nother parents&#39; approval.  Well, OK, a bit, but I think it&#39;s slowly coming.<br/>\n<br/>\n--Rob<br/>\nDH to Seana for 10 years!<br/>\n&quot;Daddy!&quot; to Genevieve (5.8) and Elissa (4.25)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184728218","msgId":25005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3azBhcStodWxwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzUwYTJjMDcwNzE3MTM1N2kzMmUyYmI2NW0yNzJlMzM5MjFkYTM0MTEyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":25004,"nextInTopic":25007,"prevInTime":25004,"nextInTime":25006,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"~~As someone recently told me (and it makes sense to me), the goal of RU is to allow children to become more fully who they are. Education happens as a","messageBody":"<div id=\"ygrps-yiv-2072454104\">~~As someone recently told me (and it makes sense to me), the goal of<br/>\nRU is to allow children to become more fully who they are. Education<br/>\nhappens as a side-effect. ~~<br/>\n<br/>\nI whole-heartedly agree.:)<br/>\nI think you have young children Robert? Correct me if I&#39;m wrong.<br/>\n<br/>\nI know it&#39;s a lot harder to trust this flow when you&#39;re oldest is<br/>\nstill a wee one. But when you have teens/almost adults, it&#39;s really<br/>\nEASY to say &quot;don&#39;t worry, they&#39;ll figure it out&quot; because you know they<br/>\nreally WILL.<br/>\n<br/>\nTrevor got interested in guitar a few years ago. He got one for<br/>\nChristmas and dabbled with it for several months then decided that<br/>\nguitar lessons would be nice. We searched for a teacher that would let<br/>\nhim learn whatever he wanted to learn. We found one and he took<br/>\nlessons for a year before deciding that he was finished.<br/>\n<br/>\nJust like that, he was done. Was our money &quot;wasted&quot; because he quit<br/>\nplaying guitar? Heck no! There was great enjoyment of music and guitar<br/>\nplaying for that entire year. He really loved his teacher (who had<br/>\nplayed for some big names and basically just showed him how to play<br/>\nsongs he liked...from ACDC to Metallica and beyond) and looked forward<br/>\nto lessons.<br/>\n<br/>\nSo.....the guitar has sat for several years untouched. The amp had<br/>\ndied so there was no reason to dabble with it. Guess what? He started<br/>\nmentioning he might like a new amp a few months ago.<br/>\n<br/>\nDh brought home a new amp and new guitar strings for him last night.<br/>\nTrevor was thrilled. It&#39;s a small used one, but that matters little.<br/>\nHe played guitar all  day today and beamed about what a great day it<br/>\nwas. He&#39;s back at it again. Who knows how long it will last. Maybe a<br/>\nweek, maybe a lifetime.<br/>\n<br/>\nWhat matters to us is that he owned this experience all along. Having<br/>\nwatched him all these years let&#39;s me know that learning IS a journey<br/>\nunique to each individual. Development happens and we really don&#39;t<br/>\nneed to sweat whether our kids will understand long-term commitment or<br/>\nhow to tie shoes or ride a bike or how to read or ANYTHING. Really. <br/>\n<br/>\nIt will come in it&#39;s own good time. They will try new things and let a<br/>\nlot go....interests swirl up and in and out and back around again. If<br/>\nthey don&#39;t know anything about the solar system today, they might<br/>\ntomorrow or next week or when they&#39;re 20.<br/>\n<br/>\n&quot;When&quot; is so much less important than &quot;why&quot;.</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184727586","msgId":25004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3anZuMitqcjF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY3aXI5Mys3MW4yQGVHcm91cHMuY29tPg=="},"prevInTopic":25003,"nextInTopic":25005,"prevInTime":25003,"nextInTime":25005,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"~~Asking her to honor an agreement she isn t really capable of understanding would teach her about coercion, not decision-making.~~ Exactly! I think parents","messageBody":"<div id=\"ygrps-yiv-1670592499\">~~Asking her to &quot;honor&quot; an agreement she isn&#39;t really capable of<br/>\nunderstanding would teach her about coercion, not decision-making.~~<br/>\n<br/>\nExactly!<br/>\nI think parents really ought to look at the ways an interest can be<br/>\npursued LONG before they ever consider a class or formal arrangement<br/>\nof any kind. Kids NEED to dabble in and out of interests for a long<br/>\ntime before true passion can take hold. Heck, some of us are life-long<br/>\ndabblers.<br/>\n<br/>\nWe really don&#39;t ever look at classes or lessons when our kids start<br/>\nbeing interested in something. That comes later, when the interest has<br/>\ncemented a bit. For many children, formal clubs/classes/teams are a<br/>\nsure-fire way to kill joy because they really don&#39;t understand long<br/>\nterm commitment.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184727382","msgId":25003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3anZnbSs1cDNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzUwYTJjMDcwNzE3MDg1NW03OWI0MTI2Nmo0NmE4OGVmYWUwMTVjY2ZkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":25001,"nextInTopic":25004,"prevInTime":25002,"nextInTime":25004,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"~~She made an agreement. Should she not honor that agreement (by attending the swim meeting)? ~~ No. A young child does not have the developmental ability to","messageBody":"<div id=\"ygrps-yiv-1917421767\">~~She made an agreement. Should she not honor that agreement (by<br/>\nattending the swim meeting)? ~~<br/>\n<br/>\nNo.<br/>\nA young child does not have the developmental ability to understand<br/>\nlong-term commitments. Period. Any adult that expects them to be able<br/>\nto, is at fault for any default on agreement and really needs to learn<br/>\nmore about child development!<br/>\n<br/>\nBesides, as an adult I can re-negotiate ANY agreements I make. Why<br/>\nshouldn&#39;t a child do the same?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184705856","msgId":25001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcwNzE3MTM1N2kzMmUyYmI2NW0yNzJlMzM5MjFkYTM0MTEyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGY3ajRrcCszNzlhQGVHcm91cHMuY29tPg==","referencesHeader":"PDc1MzUwYTJjMDcwNzE3MDg1NW03OWI0MTI2Nmo0NmE4OGVmYWUwMTVjY2ZkQG1haWwuZ21haWwuY29tPgkgPGY3ajRrcCszNzlhQGVHcm91cHMuY29tPg=="},"prevInTopic":25000,"nextInTopic":25003,"prevInTime":25000,"nextInTime":25002,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"My DW and I have been round this type of issue before.  I m almost always the one pushing the we must do what we said we would do and she s always bringing","messageBody":"<div id=\"ygrps-yiv-9633213\">My DW and I have been &#39;round this type of issue before.  I&#39;m almost always<br/>\nthe one pushing the &quot;we must do what we said we would do&quot; and she&#39;s always<br/>\nbringing reality into it, darn her eyes.  For example, family is more<br/>\nimportant that swimming (even if we have paid for it, but money just adds<br/>\nmore fuel to the fire), or that it&#39;s just one practice and that there isn&#39;t<br/>\na competition coming up anytime soon so there&#39;s no real rush, or that it&#39;s<br/>\nfine to be late meeting DW&#39;s aunt for supper because she is always late (and<br/>\nshe always is), or some such thing.<br/>\n<br/>\nI&#39;ve mellowed out a lot on this, but emotionally it&#39;s still an issue and I<br/>\nhaven&#39;t figured out completely what to do with it yet.  Continually<br/>\nreminding myself of these things does help.  Thank you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I personally get fed up with people who think they HAVE to do<br/>\n </span></blockquote>something or be somewhere when it is a choice. &lt;&lt;<br/>\n<br/>\nThat&#39;s where I get tripped up.  Half the time I see it as an obligation, not<br/>\na choice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Its beyond her comprehension. Asking her to &quot;honor&quot;<br/>\n </span></blockquote>an agreement she isn&#39;t really capable of understanding would teach<br/>\nher about coercion, not decision-making. &lt;&lt;<br/>\n<br/>\nYou mean I shouldn&#39;t teach her to turn her brain off and just blindly follow<br/>\na set of precepts/whatever I say?  Is that a bad thing???  ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Beyond that, it depends on the person in question having the skills<br/>\n </span></blockquote>to make decisions based on a multitude of complex factors, some<br/>\npretty far reaching. &lt;&lt;<br/>\n<br/>\nIf many adults can&#39;t or won&#39;t do it, why am I trying to teach (force) them<br/>\nto do it?  It&#39;s a complex skill or set of skills.  And the way for them to<br/>\n&quot;learn&quot; it is through their own experience, not by some ham-handed force-fed<br/>\napproach.<br/>\n<br/>\nAs someone recently told me (and it makes sense to me), the goal of RU is to<br/>\nallow children to become more fully who they are.  Education happens as a<br/>\nside-effect.  Sometimes (sometimes?) it&#39;s difficult to trust that these<br/>\nthings will come about in their own time, at the right time.  It&#39;s tough to<br/>\nreduce my use of the word &quot;teach&quot; when talking about what my children know.<br/>\nMy &quot;teaching&quot; is best done when I&#39;m engaged with them and when I show how I<br/>\nlive my life.<br/>\n<br/>\n<br/>\n--Rob Saxon<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":295439124,"authorName":"wisdomalways5","from":"&quot;wisdomalways5&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184699865","msgId":25000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3ajRrcCszNzlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzUwYTJjMDcwNzE3MDg1NW03OWI0MTI2Nmo0NmE4OGVmYWUwMTVjY2ZkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":24999,"nextInTopic":25001,"prevInTime":24999,"nextInTime":25001,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"... the ... agreement (by ... where ... I think it may help to look at this from a adult perspective and not a childs. If an adult had swim team and family","messageBody":"<div id=\"ygrps-yiv-637294234\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robert Saxon&quot; <br/>\n&lt;TheSaxons@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m struggling with:  If she<br/>\n&gt; made a commitment to the swim team, then shouldn&#39;t she go to the swim<br/>\n&gt; meeting?  Let&#39;s assume the best here, namely that she wanted to join <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; swim team on her own (no pushing from her mom or anyone else, her own<br/>\n&gt; desire).  She made an agreement.  Should she not honor that <br/>\n </span></blockquote>agreement (by<br/>\n<blockquote><span title=\"ireply\"> &gt; attending the swim meeting)?  Maybe I&#39;m stuck in some previous era <br/>\n </span></blockquote>where<br/>\n<blockquote><span title=\"ireply\"> &gt; supposedly someone&#39;s word was their bond.  How do they learn this?<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>I think it may help to look at this from a adult perspective and not a <br/>\nchilds. If an adult had swim team and family came to visit is it all <br/>\nright to skip the practice? Sometimes I think we get too focused on <br/>\nkids have to complete or finish something or for that matter adults. <br/>\nIs there a reason we should continue to do something it we are DONE <br/>\nwith it or skip it? <br/>\n<br/>\nI think it is situational- at least for me it is- I think that it is <br/>\nokay to break a &quot;bond&quot; or &quot;your word&quot; if you can do it with honor and <br/>\nhonor is different for different people. <br/>\n<br/>\nI personally get fed up with people who think they HAVE to do <br/>\nsomething or be somewhere when it is a choice. She choose to have her <br/>\ndaughter go to swim instead of visiting with relatives- to me that <br/>\nsounds like swim was more important than a family visit.</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Commitments WAS Visit with my sister brings up questions","postDate":"1184690275","msgId":24999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3aXI5Mys3MW4yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzUwYTJjMDcwNzE3MDg1NW03OWI0MTI2Nmo0NmE4OGVmYWUwMTVjY2ZkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":24998,"nextInTopic":25000,"prevInTime":24998,"nextInTime":25000,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"... And yet even in that previous era people went back on their words, renegged on contracts and cheated on spouses. When do people actually keep their words?","messageBody":"<div id=\"ygrps-yiv-1283366814\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robert Saxon&quot; <br/>\n&lt;TheSaxons@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Maybe I&#39;m stuck in some previous era where<br/>\n&gt; supposedly someone&#39;s word was their bond.  How do they learn this?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>And yet even in that previous era people went back on their words, <br/>\nrenegged on contracts and cheated on spouses. When do people <br/>\nactually keep their words? When there is something about keeping the <br/>\npromise that is more personally valuble than breaking it. For *some* <br/>\npeople (now as in the past) a reputation of trustworthiness or an <br/>\ninternal standard of honor is what&#39;s valuble. But you can&#39;t teach <br/>\nthat, or there wouldn&#39;t be the expression &quot;black sheep of the <br/>\nfamily&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Follow-up:  At what age can we expect children to start abiding by <br/>\n </span></blockquote>their<br/>\n<blockquote><span title=\"ireply\"> &gt; agreements?  (Loaded question, I know, I&#39;m sure it depends a lot <br/>\n </span></blockquote>on how<br/>\n<blockquote><span title=\"ireply\"> &gt; doing that was modeled to them by parents and others.)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It depends, first of all, on development. A kid who is free to <br/>\nchoose may nonetheless not be ready to make decisions about tomorrow <br/>\nor six weeks from now. Morgan will be 6 in a month and its only in <br/>\nthe last six months that she&#39;s been able to make plans for tomorrow. <br/>\nJust in the last few weeks she&#39;s started to talk about doing <br/>\nsomething in several days&#39; time. So there&#39;s no way at this time that <br/>\nshe could make a real commitment to do something every week for <br/>\nseveral weeks. Its beyond her comprehension. Asking her to &quot;honor&quot; <br/>\nan agreement she isn&#39;t really capable of understanding would teach <br/>\nher about coercion, not decision-making. <br/>\n<br/>\nBeyond that, it depends on the person in question having the skills <br/>\nto make decisions based on a multitude of complex factors, some <br/>\npretty far reaching. How do people learn to make those kinds of <br/>\ndecisions? Personally, I&#39;d say being made to go through with short-<br/>\nterm committments regardless of other factors isn&#39;t terribly helpful <br/>\nto this process. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[unschoolingbasics] Commitments WAS Visit with my sister brings up questions","postDate":"1184687701","msgId":24998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcwNzE3MDg1NW03OWI0MTI2Nmo0NmE4OGVmYWUwMTVjY2ZkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":24999,"prevInTime":24997,"nextInTime":24999,"topicId":24998,"numMessagesInTopic":0,"msgSnippet":"Right, there are some good things here helping me out, BUT-- I have a related question, and it s something I m struggling with:  If she made a commitment to","messageBody":"<div id=\"ygrps-yiv-902237204\">Right, there are some good things here helping me out, BUT--<br/>\n<br/>\nI have a related question, and it&#39;s something I&#39;m struggling with:  If she<br/>\nmade a commitment to the swim team, then shouldn&#39;t she go to the swim<br/>\nmeeting?  Let&#39;s assume the best here, namely that she wanted to join the<br/>\nswim team on her own (no pushing from her mom or anyone else, her own<br/>\ndesire).  She made an agreement.  Should she not honor that agreement (by<br/>\nattending the swim meeting)?  Maybe I&#39;m stuck in some previous era where<br/>\nsupposedly someone&#39;s word was their bond.  How do they learn this?<br/>\n<br/>\nFollow-up:  At what age can we expect children to start abiding by their<br/>\nagreements?  (Loaded question, I know, I&#39;m sure it depends a lot on how<br/>\ndoing that was modeled to them by parents and others.)<br/>\n<br/>\nOK, stepping back...<br/>\n<br/>\nIf this were me, I think I&#39;d still let her play with company instead of<br/>\ngoing.  I would point out her agreement, but would let her make the<br/>\ndecision.<br/>\n<br/>\nWhen I say &quot;I would point out her agreement,&quot; I mean I would remind her of<br/>\nher agreement much like you might remind a visiting friend who was about to<br/>\nleave that she was forgetting her umbrella.  If I mentioned that it was<br/>\nimportant to me, I would make sure she understood that I would be fine with<br/>\nwhatever decision she made.  Voice supportive, neutral, and no hidden &quot;I&#39;m<br/>\nfine as long as you choose what I want you to choose.&quot;<br/>\n<br/>\n--Rob<br/>\nDH to Seana for 10 years<br/>\n&quot;Daddy!&quot; to Genevieve (5.5) and Elissa (4)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25006,"nextTopicId":25024}}