{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: When a parent is at their &#39;end&#39;","postDate":"1260564886","msgId":42405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTcwMWNhN2FhNCQyY2UxN2EwMCQ2NDBhYTlhOUBHb256bz4=","inReplyToHeader":"PDRCMjBGOUY4LjYwNDAxMDVAeWFob28uY2E+","referencesHeader":"PDRCMjBGOUY4LjYwNDAxMDVAeWFob28uY2E+"},"prevInTopic":42403,"nextInTopic":0,"prevInTime":42404,"nextInTime":42406,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1934945273\">&lt;&lt; Its also hard to look around at the attachment parenting connections <br/>\nI&#39;ve made the past three years, and then seeing them head in the other <br/>\ndirection. I need to find some radical unschoolers to have playdates <br/>\nwith, huh? &gt;&gt; <br/>\n <br/>\nThat&#39;s how I felt too! I had found a group I meshed with and made some good<br/>\nfriends, then when our kids were 3, most of the other moms sent their kids<br/>\nto preschool! I started getting the clue earlier, when there were<br/>\nconversations of which preschools were the best, most respectful, etc. Most<br/>\nAP moms liked the co-ops where they could continue to be involved. But it is<br/>\nstill school. I didn&#39;t want any part of that. <br/>\n <br/>\nFinally I found out about the unschooling conference near me and went to one<br/>\nwhen my son was 3 (and 11 mos). From there I met other unschoolers who live<br/>\nnear me and we get together sometimes. Not as much as I&#39;d like to, but I<br/>\nknow they are around. I&#39;m also much more confident on my own, which can only<br/>\nhappen with time. I&#39;m not as upset as I used to be if my son wants to stay<br/>\nhome instead of going out. I still get upset on occasion, when I really want<br/>\nto see MY friends, but I know I can call them.<br/>\n <br/>\n <br/>\n&lt;&lt;Oh, I like that &quot;less confrontational, more conversational,&quot; that kind of<br/>\nsums up a lot of how it feels completely! &gt;&gt;<br/>\n<br/>\nI like that too!<br/>\n <br/>\n <br/>\n&lt;&lt;Yesterday I realized something about myself. We can have good and bad<br/>\ndays. I can fall back into old habits, but return to unschooly the next day.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n <br/>\n </span></blockquote>Try not to think of a whole day as bad though! Allow yourself to have good<br/>\nand bad &quot;moments&quot; and you&#39;ll be surprised at how the &quot;day&quot; will turn out! I<br/>\nhad one last week, I really thought the day was shot, my son was fighting<br/>\ngetting out of the house, screaming in the car, then once we got where we<br/>\nwere going, we had a talk, skipped going inside and played at the park<br/>\ninstead, then he appologized for being mean to me and thanked me for taking<br/>\nhim out! After that the day was great!<br/>\n <br/>\nHere is some more about seeing Moments instead of Days.  http://sandradodd.<br/>\n&lt;http://sandradodd.com/moment&gt; com/moment<br/>\n <br/>\n <br/>\nKim Z<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260510987","msgId":42403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmc211YitjYm44QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmb2thMytidWl0QGVHcm91cHMuY29tPg=="},"prevInTopic":42402,"nextInTopic":42405,"prevInTime":42402,"nextInTime":42404,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... We make lots of quesadillas as they are filling and can be nuked easily.  Leftovers are so important in a busy house (or in a house with little ones that","messageBody":"<div id=\"ygrps-yiv-634174538\"><blockquote><span title=\"ireply\">&gt; &gt; I need to eat solid food.  I don&#39;t do well just snacking like she <br/>\n&gt;&gt; does.  But I don&#39;t have time to make heavier food.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>We make lots of quesadillas as they are filling and can be nuked easily.  Leftovers are so important in a busy house (or in a house with little ones that need lots of attention!)  Another fav dish for leftovers is cheesy rice (Rice, veggies, curry and cheddar on top.)  Make one big batch and eat for a few days!  Laurie :)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260466108","msgId":42402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmcmIzcytxbzA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMjBGOUY4LjYwNDAxMDVAeWFob28uY2E+"},"prevInTopic":42399,"nextInTopic":42403,"prevInTime":42401,"nextInTime":42403,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... You might also check with area churches to see if any have a free bread day - that s a big deal where I live, there s at least one church in every little","messageBody":"<div id=\"ygrps-yiv-1562030564\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m nursing.  I need to be realistic.  So, <br/>\n&gt; extra sugar in my cocoa, lots of bread and crackers, etc... for now.  I <br/>\n&gt; hope that will work better.  I guess we&#39;ll redirect some of our grocery <br/>\n&gt; money away from wholesome foods and into the snack department.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>You might also check with area churches to see if any have a &quot;free bread&quot; day - that&#39;s a big deal where I live, there&#39;s at least one church in every little town that does it. They get a mix of breads and other packaged goods that they distribute, no questions, no sermons. By asking other people who go regularly you also get to find out which places tend to have more whole grain products or odd-ball things like yogurt and cheese (odd in the sense that its not bread, I mean!). Each church gets theirs from different stores, so they&#39;ll have different brands and products in general. If you&#39;re lucky enough to have a real bakery in your area, you can also ask for &quot;day old bread&quot; - many clean out old stock with each new baking by giving it to whoever knows what day to come. It freezes well, too. <br/>\n<br/>\nAnd realisitically, if its what your body needs right now, then it Is wholesome, even if its more &quot;fast energy&quot; than the slower digesting whole grains. Even adult bodies can need that sometimes!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260452344","msgId":42399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMjBGOUY4LjYwNDAxMDVAeWFob28uY2E+"},"prevInTopic":42392,"nextInTopic":42402,"prevInTime":42398,"nextInTime":42400,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"**Parenting younger children Is more difficult, more time consuming. Have you seen this chart? Its a little tongue in cheek, and the article explains in more","messageBody":"<div id=\"ygrps-yiv-1852436481\">**Parenting younger children Is more difficult, more time consuming. <br/>\nHave you seen this chart? Its a little tongue in cheek, and the article <br/>\nexplains in more detail, but I think you&#39;ll get the idea:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto/**\">http://sandradodd.com/howto/**</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto/\">http://sandradodd.com/howto/</a>&gt;<br/>\n<br/>\nThank you for this link!  It does help put things in perspective.  I <br/>\nguess I&#39;ve been missing a few things here.  Just like I&#39;m trying to <br/>\nremember that anything my kids do today, I don&#39;t have to worry that they <br/>\nwill be stuck doing that the rest of their lives (like refusing a dental <br/>\ncleaning, eating tons of sugar, etc).  And I&#39;ve forgotton how that <br/>\napplies to me.  Just because I can&#39;t sew today, or this week, doesn&#39;t <br/>\nmean that I won&#39;t be able to in the future, or that it won&#39;t be my <br/>\nbiggest thing to do in a few years when I have more time to myself. <br/>\n<br/>\n**Any kind of transition, including one from one set of parenting skills <br/>\nto another, is going to be more draining and time consuming than once <br/>\nyou&#39;ve &quot;gotten it all down&quot;. You&#39;re on a learning curve, yourself, and <br/>\nthat&#39;s part of the difficulty at the moment.<br/>\n<br/>\nUnschooling requires more time and energy in terms of thinking and <br/>\nplanning ahead, that&#39;s for sure! But once you&#39;re used to that, there&#39;s <br/>\nsome &quot;pay off&quot; on the other end, as it were, because you stop more <br/>\nissues before they become issues. When I&#39;m with conventional parents I&#39;m <br/>\namazed at how exhausting their lives seem, with continual rounds of <br/>\n&quot;nos&quot; and &quot;consequences&quot;. **<br/>\n<br/>\nIts also hard to look around at the attachment parenting connections <br/>\nI&#39;ve made the past three years, and then seeing them head in the other <br/>\ndirection.  I need to find some radical unschoolers to have playdates <br/>\nwith, huh?<br/>\n<br/>\nI hate that it is so hard to explain what I am doing to other parents.  <br/>\nIt sometimes might look like I&#39;m letting everything go and kids can do <br/>\nanything without consequences, etc, but when I&#39;m in it I really don&#39;t <br/>\nfeel like I&#39;m just letting them act like animals or get out of control.  <br/>\nWe bypass most of the issues completely.  Its easier, less <br/>\nconfrontational, more conversational!  Oh, I like that &quot;less <br/>\nconfrontational, more conversational,&quot; that kind of sums up a lot of how <br/>\nit feels completely! <br/>\n<br/>\n**Oops! Note to self: make yourself a snack at the Same time! Keep a <br/>\nplate or bowl of easy to grab snacks handy for yourself as well. <br/>\nUnschooling principles apply to You too, mama. Right now, its an effort <br/>\nto remember to be proactive so you&#39;re tending to forget either yourself <br/>\nor your kid&#39;s needs - that&#39;s normal while you&#39;re still figuring it all <br/>\nout. Notes can help, if you&#39;re the note type. I used to have little <br/>\nmantras I&#39;d repeat to myself, like &quot;don&#39;t forget to pee First&quot; - just <br/>\nlittle things to keep myself sane ;)**<br/>\n<br/>\nYesterday I realized something about myself.  We can have good and bad <br/>\ndays.  I can fall back into old habits, but return to unschooly the next <br/>\nday.  We can all loose sight.  It happens.  As I told another mother on <br/>\nanother list a while ago, its about the general trend more than its <br/>\nabout individual issues. <br/>\n<br/>\nAnd also, I&#39;m becoming a bit depressed.  I realized after three days of <br/>\nfeeling really disinterested in the kids doings.  I thought I was just a <br/>\nbad mother, bad unschooler who should maybe just go get a job and give <br/>\nher kids to someone else to watch, but then suddenly I realized the <br/>\nfamiliarity of the feeling I was having... the doomsday kind of thinking <br/>\nand I remember when I was once depressed, and now I know.  So I&#39;m making <br/>\nthat number 1 priority.  I&#39;ve put all my supports in motion, and I <br/>\nalready feel a bit better at times, and hopefully I&#39;ve caught this so <br/>\nsoon that it won&#39;t have a big effect on the family.  And I also hope its <br/>\njust seasonal depression that vit D will help.<br/>\n<br/>\nYesterday, I broke out the crackers and just ate and ate.  I decided not <br/>\nto care about rationing them out, because once they are gone we won&#39;t <br/>\nhave any more easy food until shopping day.  I&#39;ll deal with that when it <br/>\nhappens.  And I think I need to eat more carbs, and its not about how <br/>\nlight the snacks are, its that nuts and cheese and yogurt etc, don&#39;t <br/>\nhave enough carbs for me.  I&#39;m nursing.  I need to be realistic.  So, <br/>\nextra sugar in my cocoa, lots of bread and crackers, etc... for now.  I <br/>\nhope that will work better.  I guess we&#39;ll redirect some of our grocery <br/>\nmoney away from wholesome foods and into the snack department.</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: When a parent is at their &#39;end&#39;","postDate":"1260378064","msgId":42392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNzQyNi44NTc0MS5xbUB3ZWI2NTcwOC5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PDRCMUZBNzkwLjUwNTAwMDFAeWFob28uY2E+"},"prevInTopic":42391,"nextInTopic":42399,"prevInTime":42391,"nextInTime":42393,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"Do you have a crockpot/slow cooker?   That can be a great way to make a large amount of something to keep in the fridge so you can have real food.  I make a","messageBody":"<div id=\"ygrps-yiv-924380430\">Do you have a crockpot/slow cooker?<br/>\n <br/>\nThat can be a great way to make a large amount of something to keep in the fridge so you can have real food.  I make a crockpot worth of refried beans and a large pot of rice.  With those in the fridge the members of our family who need a real meal instead of snacks can quickly make a variety of meals (nachos, quesadillas, just beans and rice...)  Of course, you&#39;ll need to figure out what it is you don&#39;t mind eating over and over and over again :).<br/>\n <br/>\n:)<br/>\nJenna<br/>\n <br/>\n<br/>\n<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260377341","msgId":42391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmb2tkdCtxNDJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmb2thMytidWl0QGVHcm91cHMuY29tPg=="},"prevInTopic":42390,"nextInTopic":42392,"prevInTime":42390,"nextInTime":42392,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"Here s the link for the Always Unschooled list if anyone s interested: http://groups.yahoo.com/group/AlwaysUnschooled/","messageBody":"<div id=\"ygrps-yiv-1393715036\">Here&#39;s the link for the Always Unschooled list if anyone&#39;s interested:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysUnschooled/\">http://groups.yahoo.com/group/AlwaysUnschooled/</a></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260377219","msgId":42390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmb2thMytidWl0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMUZBNzkwLjUwNTAwMDFAeWFob28uY2E+"},"prevInTopic":42387,"nextInTopic":42391,"prevInTime":42389,"nextInTime":42391,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... In a general sense, though, even if they don t know, you can. While connection is often enough with babies, toddlers have big big needs to feel capable","messageBody":"<div id=\"ygrps-yiv-328447803\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But toddlers are so unpredictable.  <br/>\n&gt; They don&#39;t know themselves even what they want. <br/>\n<br/>\n </span></blockquote>In a general sense, though, even if they don&#39;t know, you can. While connection is often &quot;enough&quot; with babies, toddlers have big big needs to feel capable and to make choices. With that in mind you can predict, to some extent, what she&#39;s going to want. She&#39;s going to want to call the shots, do things and have them work out the way she thinks they will. That can be frustrating on a whooooole lot of different levels for you as well as her, but its a place for you to start thinking. Assume she might want to do everything, assume she might want to make all her own choices, and create space for that in your thinking and planning (one more thing to remember!). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I noticed that she&#39;s also on a kick of saying she wants things that are <br/>\n&gt; two opposites, like can&#39;t exist at the same time.<br/>\n<br/>\n </span></blockquote>This is part of learning to make decisions. She&#39;s discovered its possible to want two contradictory things at once - hooray! she&#39;s human! Its perfectly natural to want contradictory things (like wanting to be an attentive mom and wanting time to yourself!). The difference is, adults have years of getting used to that, to the way it feels and have had a chance to develop some strategies. Your dd doesn&#39;t have any of that, so she needs help slogging through her own process. <br/>\n<br/>\nIt just seems <br/>\n<blockquote><span title=\"ireply\"> &gt; like 2 and 3 year olds think is such a completely different way from <br/>\n&gt; anyone older.  They can, but often don&#39;t, think linearly, logically, <br/>\n&gt; etc. <br/>\n<br/>\n </span></blockquote>They&#39;re really very logical, in their own way, but they&#39;re responding to a different set of needs than older kids and adults - they have more immediate needs and their emotions Feel stronger, less manageable bc young children don&#39;t have any skills or experience yet. Its not really that they think differently, its that they&#39;re still figuring out soooooo many things that they don&#39;t have any of the same preconceptions or strategies. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We&#39;re at this in-between age now, where attachment parenting isn&#39;t <br/>\n&gt; enough.  Its not just a matter of following a child&#39;s cues anymore, <br/>\n&gt; because she gives mixed messages all the time.  But she&#39;s not quite at <br/>\n&gt; the stage where she can communicate in a way thath I can understand, or <br/>\n&gt; even sometimes understand (i understand her speaking.  she just doesn&#39;t <br/>\n&gt; say things that always make sense or can be done).<br/>\n<br/>\n </span></blockquote>Yup, that&#39;s the stage where most attachment parents become traditional parents - its really a stretch to see the world through the eyes of someone who is just starting to figure out how to make decsisions and carry them through. <br/>\n<br/>\nAre you on the &quot;Always Unschooled&quot; list at all? There&#39;s more of a focus there on younger children, which you might find helpful, or at least reassuring when someone Else writes in with your same question ;) <br/>\n<br/>\nMo was never great at verbal communication when she was little, and even now tends to shut down under stress, so I learned to do a lot of watching and listening and make some educated guesses based on what I observed. Sometimes I&#39;d be wrong, which wasn&#39;t much fun, but I&#39;d learn a Whole lot by being wrong. Its okay to experiment a little, knowing you&#39;re experimenting and are never &quot;married&quot; to a solution. Solutions are going to change as your kid gets older, anyway, so its good not to be too invested in any solution, even one that works. With kids, there&#39;s not much that&#39;s permanent.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I need to eat solid food.  I don&#39;t do well just snacking like she does.  <br/>\n&gt; But I don&#39;t have time to make heavier food.<br/>\n<br/>\n </span></blockquote>Eating is important! If having a bowl of nuts out on the table isn&#39;t enough to keep you going, think about other ways to make eating convenient for you. Make a quick sandwich and some soup while putting together a snack for your dd. Look for moments in the day where you can do some &quot;prep&quot; and be sure to make things for yourself as well as your kid - make serving size plates that you can toss in the microwave, maybe. Next time you shop, or make a grocery list, think about things that are quick-fix foods for you. If you have time to cook - evenings, weekends, whatever! make enough for leftovers so you can eat the next day, or week, even - cook like you would for a job. You have a job! Its one that can suck up your time if you&#39;re not careful, so plan for that. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260374776","msgId":42387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmb2h0bytrbnByQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMUVFNUMxLjEwMDA5QHlhaG9vLmNhPg=="},"prevInTopic":42383,"nextInTopic":42390,"prevInTime":42386,"nextInTime":42388,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... Parenting younger children Is more difficult, more time consuming. Have you seen this chart? Its a little tongue in cheek, and the article explains in more","messageBody":"<div id=\"ygrps-yiv-1690964224\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Does all the advice we get here, or that I&#39;ve gotten here, sort of apply <br/>\n&gt; differently to the under 4yo set?  Because while it does help... there <br/>\n&gt; is still a lot of difficulties here,<br/>\n<br/>\n </span></blockquote>Parenting younger children Is more difficult, more time consuming. Have you seen this chart? Its a little tongue in cheek, and the article explains in more detail, but I think you&#39;ll get the idea:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto/\">http://sandradodd.com/howto/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and I&#39;m finding that its much more <br/>\n&gt; time consuming to parent this way, and although its not as draining in <br/>\n&gt; some ways as authoritarianism is, its draining in other ways.<br/>\n<br/>\n </span></blockquote>Any kind of transition, including one from one set of parenting skills to another, is going to be more draining and time consuming than once you&#39;ve &quot;gotten it all down&quot;. You&#39;re on a learning curve, yourself, and that&#39;s part of the difficulty at the moment. <br/>\n<br/>\nUnschooling requires more time and energy in terms of thinking and planning ahead, that&#39;s for sure! But once you&#39;re used to that, there&#39;s some &quot;pay off&quot; on the other end, as it were, because you stop more issues before they become issues. When I&#39;m with conventional parents I&#39;m amazed at how exhausting their lives seem, with continual rounds of &quot;nos&quot; and &quot;consequences&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  For <br/>\n&gt; example: the past few days I haven&#39;t been having much opportunity to <br/>\n&gt; actually eat myself, since I&#39;m so involved with offering choices, <br/>\n&gt; plates, snacks, etc to Temima so that she might have more independence <br/>\n&gt; in feeding herself and hopefully feel better and be easier to be around.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Oops! Note to self: make yourself a snack at the Same time! Keep a plate or bowl of easy to grab snacks handy for yourself as well. Unschooling principles apply to You too, mama. Right now, its an effort to remember to be proactive so you&#39;re tending to forget either yourself or your kid&#39;s needs - that&#39;s normal while you&#39;re still figuring it all out. Notes can help, if you&#39;re the note type. I used to have little mantras I&#39;d repeat to myself, like &quot;don&#39;t forget to pee First&quot; - just little things to keep myself sane ;)<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260365712","msgId":42383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMUZBNzkwLjUwNTAwMDFAeWFob28uY2E+"},"prevInTopic":42382,"nextInTopic":42387,"prevInTime":42382,"nextInTime":42384,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"Well, attachment parenting is what we ve always practiced, and everything from the Unconditional Parenting book.  We re trying to bring all that with us as","messageBody":"<div id=\"ygrps-yiv-311478194\">Well, attachment parenting is what we&#39;ve always practiced, and <br/>\neverything from the Unconditional Parenting book.  We&#39;re trying to bring <br/>\nall that with us as they get older, and it looks to me like unschooling <br/>\nis the natural extension of that.  But toddlers are so unpredictable.  <br/>\nThey don&#39;t know themselves even what they want. <br/>\n<br/>\nI need to eat solid food.  I don&#39;t do well just snacking like she does.  <br/>\nBut I don&#39;t have time to make heavier food.  I&#39;m nursing as well.<br/>\n<br/>\nI noticed that she&#39;s also on a kick of saying she wants things that are <br/>\ntwo opposites, like can&#39;t exist at the same time.  For example, she&#39;d <br/>\nsay something like she wants the door open, and closed, or the light on <br/>\nand off, or &quot;my body is tired by I won&#39;t go to sleep&quot;.   It just seems <br/>\nlike 2 and 3 year olds think is such a completely different way from <br/>\nanyone older.  They can, but often don&#39;t, think linearly, logically, <br/>\netc.  We&#39;re at this in-between age now, where attachment parenting isn&#39;t <br/>\nenough.  Its not just a matter of following a child&#39;s cues anymore, <br/>\nbecause she gives mixed messages all the time.  But she&#39;s not quite at <br/>\nthe stage where she can communicate in a way thath I can understand, or <br/>\neven sometimes understand (i understand her speaking.  she just doesn&#39;t <br/>\nsay things that always make sense or can be done).</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260364740","msgId":42382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFODU1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42381,"nextInTopic":42383,"prevInTime":42381,"nextInTime":42383,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"And don t forget to feed yourself before you get too hungry...just like the airplane instructions say about putting the oxygen mask on yourself first then","messageBody":"<div id=\"ygrps-yiv-32679885\">And don&#39;t forget to feed yourself before you get too hungry...just like the airplane instructions say about putting the oxygen mask on yourself first then assisting others, if you are hungry and ragged, you won&#39;t be at your best in dealing with the kids&#39; needs. I found that out when DS was about 3 ½ - I was trying to get him ready to head out BEFORE I had eaten and gotten myself ready. Big mistake, constantly butting heads, getting frustrated (both of us). Not Good. So, I started planning things so I could get up, shower, eat, get dressed, pack everything we needed for the situation - be totally ready to go BEFORE turning my attention to DS. At that point, I could be 100% there with him because everything else was ready. Things are way smoother. <br/>\n<br/>\n <br/>\n<br/>\nAs someone already said, while you&#39;re making up a plate of crackers and cheese or whatever, make one for her plate, one for your plate, and so on. When you get her a glass of water, have some for yourself (hydration is really important in our house). Even a 4 yr old can assist with putting a plate of cheese and crackers together or getting a small container to put cut fruit in (we save the big margarine, cream cheese, cottage cheese type containers to put snack mix, cut fruit, etc into - just right for a portion, come with lids to save for another time as needed, and totally disposable if they get dropped/cracked/mangled).<br/>\n<br/>\n <br/>\n<br/>\n--Deb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: When a parent is at their &#39;end&#39;","postDate":"1260322290","msgId":42381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVCSEREQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDRCMUVFNUMxLjEwMDA5QHlhaG9vLmNhPg=="},"prevInTopic":42378,"nextInTopic":42382,"prevInTime":42380,"nextInTime":42382,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... apply differently to the under 4yo set? Because while it does help... there is still a lot of difficulties here, and I m finding that its much more time","messageBody":"<div id=\"ygrps-yiv-618637945\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; Does all the advice we get here, or that I&#39;ve gotten here, sort of<br/>\n </span></blockquote>apply<br/>\ndifferently to the under 4yo set? Because while it does help... there<br/>\nis still a lot of difficulties here, and I&#39;m finding that its much more<br/>\ntime consuming to parent this way, and although its not as draining in<br/>\nsome ways as authoritarianism is, its draining in other ways. For<br/>\nexample: the past few days I haven&#39;t been having much opportunity to<br/>\nactually eat myself, since I&#39;m so involved with offering choices,<br/>\nplates, snacks, etc to Temima so that she might have more independence<br/>\nin feeding herself and hopefully feel better and be easier to be around.<br/>\n&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n Yes, it works for kids of all ages. It might be helpful to look into<br/>\ninformation about Attachment Parenting. You can probably find a lot of<br/>\nhelpful suggestions for the younger kids. The biggest difference between the<br/>\nyounger kids and the older kids is that the younger kids don&#39;t always have<br/>\nthe language to express themselves. Either way, you need to be proactive<br/>\nrather than reactive.<br/>\n<br/>\nWhy can&#39;t you grab a snack while you are offering your daughter choices?<br/>\nSometimes, I make a plate for myself and share with the kids. There are days<br/>\nthat I have given them all sorts of choices and had them say no but the<br/>\nminute I make a plate of food for myself and sit down to eat it, they are<br/>\nall over it. Also, try to feed your child before she gets too hungry. If<br/>\nthey have reached the upset fit throwing stage, then it is often too late to<br/>\noffer choices because they are so hungry and upset that they can no longer<br/>\ncommunicate. When my kids get to the point where they can no longer<br/>\ncommunicate, I go for something that I know they will eat no matter what.<br/>\nFor one of my kids, that is a candy bar. For another, it is ice cream. For<br/>\nanother, it is soup.<br/>\n<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260316097","msgId":42378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMUVFNUMxLjEwMDA5QHlhaG9vLmNhPg=="},"prevInTopic":42360,"nextInTopic":42381,"prevInTime":42377,"nextInTime":42379,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"Does all the advice we get here, or that I ve gotten here, sort of apply differently to the under 4yo set?  Because while it does help... there is still a lot","messageBody":"<div id=\"ygrps-yiv-1008066274\">Does all the advice we get here, or that I&#39;ve gotten here, sort of apply <br/>\ndifferently to the under 4yo set?  Because while it does help... there <br/>\nis still a lot of difficulties here, and I&#39;m finding that its much more <br/>\ntime consuming to parent this way, and although its not as draining in <br/>\nsome ways as authoritarianism is, its draining in other ways.  For <br/>\nexample: the past few days I haven&#39;t been having much opportunity to <br/>\nactually eat myself, since I&#39;m so involved with offering choices, <br/>\nplates, snacks, etc to Temima so that she might have more independence <br/>\nin feeding herself and hopefully feel better and be easier to be around.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: When a parent is at their &#39;end&#39;","postDate":"1260187439","msgId":42360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENEEzNjgyLTE5NUMtNDA5NC1BODNGLUQxQkJERjU0MDg5NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRCMUM0Q0I1LjgwNDA3MDZAeWFob28uY2E+","referencesHeader":"PDRCMUM0Q0I1LjgwNDA3MDZAeWFob28uY2E+"},"prevInTopic":42359,"nextInTopic":42378,"prevInTime":42359,"nextInTime":42361,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... Explore the options. If it s a medical situation, you and the child talk with the doctor and get as much information as you can about alternatives, what","messageBody":"<div id=\"ygrps-yiv-437922302\">On Dec 6, 2009, at 7:30 PM, Shira Rocklin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But there are less immediate<br/>\n&gt; types of things, like food sensitivities, dental stuff, medicine for<br/>\n&gt; illnesses, etc... what do you do about those? What if your child is<br/>\n&gt; refusing in a situation which you think is for their health, although<br/>\n&gt; not immediately harmful? (We have dental insurance now... so sure we<br/>\n&gt; can get cavities filled now, but who knows in the future).<br/>\n<br/>\n </span></blockquote>Explore the options.<br/>\n<br/>\nIf it&#39;s a medical situation, you and the child talk with the doctor  <br/>\nand get as much information as you can about alternatives, what are  <br/>\nthe side effects, what if you don&#39;t do anything, what if you wait ...<br/>\n<br/>\nIf it&#39;s an emergency like a broken arm, be calm, reassuring and offer  <br/>\nlots of sympathy.<br/>\n<br/>\nI think what confuses people is that they run up against the one  <br/>\noption given and the child refuses so their only two options seem to  <br/>\nbe make the child or go along with what the child wants. Assume your  <br/>\nchild wants to be healthy. And explore the options with them. But  <br/>\nsometimes the answer is &quot;Let&#39;s get through this together and go get  <br/>\nice cream.&quot;<br/>\n<br/>\nWhat might help is reading through the myriad ways unschoolers have  <br/>\napproached brushing teeth. There are way more options than brushing  <br/>\nor not brushing!<br/>\n<br/>\nUnschooling in Action -- Brushing Teeth<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling%20in%20action/\">http://joyfullyrejoycing.com/unschooling%20in%20action/</a> <br/>\nbrushingteeth.html<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260150116","msgId":42359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmaG1oNCs0bHRoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMUM0Q0I1LjgwNDA3MDZAeWFob28uY2E+"},"prevInTopic":42357,"nextInTopic":42360,"prevInTime":42358,"nextInTime":42360,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... Er... it sounds like me actually (sheepish grin). Transitions are often hard - and all the harder for young kids who really don t have Any skills where","messageBody":"<div id=\"ygrps-yiv-1350600696\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She seems to understand a stronger &#39;no&#39; statement, and just <br/>\n&gt; play through her emotions and get back to the &#39;everyday&#39; stuff a bit <br/>\n&gt; faster.  She seems also more willing to take my offer of something else <br/>\n&gt; to do after she&#39;s cried or yelled a bit, like she&#39;s gotten it out, but <br/>\n&gt; maybe needs some help transitioning to something new.  Does that sound <br/>\n&gt; right/normal/appropriate? <br/>\n<br/>\n </span></blockquote>Er... it sounds like me actually (sheepish grin). Transitions are often hard - and all the harder for young kids who really don&#39;t have Any skills where transitions are concerned. It makes sense that transitioning could be the biggest part of the problem - didn&#39;t you say she fights sleep? That&#39;s often a transitioning issue. It feels icky to some people to make that transition into sleep. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Repeating back to her seems to work well with her, in that it lets her <br/>\n&gt; move on to her next scentence, because she seems to know that I&#39;ve heard <br/>\n&gt; her once I say it back to her.  If I don&#39;t repeat back, she&#39;ll say the <br/>\n&gt; same sentence over and over until I do clearly say that I&#39;ve heard her <br/>\n&gt; and explain what I&#39;ve heard.  But perhaps I need to take it farther, and <br/>\n&gt; use your example... because skipping from understanding what she is <br/>\n&gt; saying to then explaining why it can&#39;t happen might be too much of a <br/>\n&gt; jump for her.<br/>\n<br/>\n </span></blockquote>That also makes sense. Ray was like that - he had to go through the whhhhhooooooollllllle process in his own mind, step by tiny step, to get to a decision that I could just Tell him... I had to learn to let him talk the whole thing out. I still do, sometimes, although, at 16, the &quot;steps&quot; are Much bigger ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Yesterday she ate so <br/>\n&gt; many snacks, but no meals, but she was much happier.  I&#39;m thinking she <br/>\n&gt; just burns through the fuel so much faster that even meal, snack, meal, <br/>\n&gt; snack, meal is not enough for her.  She needs to just snack snack <br/>\n&gt; snack...<br/>\n<br/>\n </span></blockquote>That&#39;s not uncommon. If she&#39;s happy doing that with the sorts of foods you typically offer, I wouldn&#39;t look to change unless she&#39;s actively asking. Just keep lots of snacks on hand! If fruit is something she&#39;ll eat, its a good source of &quot;fast energy&quot; too - fresh, dried or juice. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My only question about what you&#39;re saying is to wonder if children <br/>\n&gt; really need simple carbohydrates like that?  I mean, I can see the logic <br/>\n&gt; of what you are saying... but at the same time, aside from fruit, I <br/>\n&gt; don&#39;t think ancient children had access to candy, white flour products, <br/>\n&gt; sugar, ice cream, crackers, etc... <br/>\n<br/>\n </span></blockquote>&quot;Ancient&quot; children often didn&#39;t have fruit, either, certainly not out of season. Its not really helpful to compare todays food options to those of people who ate primarily for survival. Plenty of &quot;ancient&quot; children didn&#39;t make it to adulthood!<br/>\n<br/>\nIf your dd will eat fruits, that&#39;s great! If she seems happy with whole grains, also great - and it seems like the issue may be more about frequency and control than What, specifically, she&#39;s eating, so that&#39;s good. I was throwing out some options for you to try if she was specifically focusing on the foods, themselves, from my background with my own family and other conservative eaters. People, kids especially, who are very very conservative in their food choices often prefer foods with very fine textures - often highly refined foods - and will thrive on those foods, despite conventional wisdom as to what kids &quot;should&quot; eat. That&#39;s where my thoughts about offering more white flours, etc come from, but it seems not to be the issue for you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What if your child is <br/>\n&gt; refusing in a situation which you think is for their health, although <br/>\n&gt; not immediately harmful?<br/>\n<br/>\n </span></blockquote>Stress has been consistently shown to have a strong negative effect on health. That&#39;s something to keep in mind when you&#39;re trying to balance a &quot;maybe&quot; where health issues are concerned. If there&#39;s a situation that&#39;s not immediately harmful, too, there&#39;s time to research your options. Check with other doctors. Look for alternative therapies. Talk to other friends - kid friends, where possible, so your child can have a kids-eye view of the matter. With teeth, in particular, there are often many more options than you&#39;ll be told in the dentist office. They want your business!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1260145845","msgId":42357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMUM0Q0I1LjgwNDA3MDZAeWFob28uY2E+"},"prevInTopic":42347,"nextInTopic":42359,"prevInTime":42356,"nextInTime":42358,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"Connie, Repeating back to her seems to work well with her, in that it lets her move on to her next scentence, because she seems to know that I ve heard her","messageBody":"<div id=\"ygrps-yiv-1796356355\">Connie,<br/>\nRepeating back to her seems to work well with her, in that it lets her <br/>\nmove on to her next scentence, because she seems to know that I&#39;ve heard <br/>\nher once I say it back to her.  If I don&#39;t repeat back, she&#39;ll say the <br/>\nsame sentence over and over until I do clearly say that I&#39;ve heard her <br/>\nand explain what I&#39;ve heard.  But perhaps I need to take it farther, and <br/>\nuse your example... because skipping from understanding what she is <br/>\nsaying to then explaining why it can&#39;t happen might be too much of a <br/>\njump for her.  I&#39;m working on this with the dentist as well.  She had <br/>\nher first cleaning, and then 5 cavities filled (no pain, no anesthetic <br/>\nor anything, but I&#39;m sure still quite an uncomfortable memory for her) <br/>\nseveral months ago, and now its time for another cleaning and to check <br/>\nif her teeth are getting more cavities (and whether we are brushing <br/>\nbetter).  We went for our appointment but she wouldn&#39;t open her mouth, <br/>\nso we rescheduled for Tuesday.  Instead of telling her what to expect <br/>\n(and about picking a prize from their toy bin at the end), last night we <br/>\ntalked more about what she&#39;d like to do at the dentist.  More of just a <br/>\nconversation following her lead and it didn&#39;t even all make sense, but <br/>\nit was a conversation and I&#39;m hoping with more like it she&#39;ll become <br/>\nmore comfortable with the idea of having her teeth cleaned again.<br/>\n<br/>\nAnd on that topic... are there areas where things &#39;must&#39; be?  I know we <br/>\nwouldn&#39;t let immediate harm come to our children, we&#39;d stop them from <br/>\nrunning into the street with cars, etc... But there are less immediate <br/>\ntypes of things, like food sensitivities, dental stuff, medicine for <br/>\nillnesses, etc... what do you do about those?  What if your child is <br/>\nrefusing in a situation which you think is for their health, although <br/>\nnot immediately harmful?   (We have dental insurance now... so sure we <br/>\ncan get cavities filled now, but who knows in the future).<br/>\n<br/>\n** It is difficult to anticipate things but sometimes it works best if <br/>\nyou lower your expectations when you have little ones. Cleaning the <br/>\nhouse isn&#39;t as important to me as it once was. I am not willing to fight <br/>\nwith my kids over a clean house. **<br/>\n<br/>\nThe thing is, when I say that I want to make some phone calls, or clean <br/>\nthe house, its not like I mean I want to make phone calls for my <br/>\npleasure, or clean the house so that the house is actually clean.  It <br/>\nmeans that I have certain calls I want to make because they can only be <br/>\nmade during business hours, and they are extremely important (having to <br/>\ndo with student loan repayment, my mother&#39;s care as she is terminally <br/>\nill, etc).  By cleaning... I mean washing enough dishes to make some <br/>\nclean to eat off of, or make room in the sink.  Its really hard to let <br/>\nthe kids be underfoot, to let the baby crawl around on the floor while I <br/>\nwash those few dishes if I haven&#39;t been able to sweep up yesterdays  (or <br/>\nlast weeks) food because I&#39;m playing with the kids.  I&#39;m talking really <br/>\nminimal cleaning here.  Like, our bathroom hasn&#39;t been washed in months <br/>\nI&#39;m sure.  Its pretty gross. <br/>\n<br/>\nBut, if I want to be honest with myself... yesterday I spent all day <br/>\nplaying, and the house didn&#39;t come out any worse than the horrible state <br/>\nit was already in.  So playing all day does not really result in more <br/>\ndirt, necesserily.  And also, when the kids go to sleep, I feel I &#39;need&#39; <br/>\nto have some time to myself... but to be honest, its really that I <br/>\n&#39;want&#39; time to myself more than I &#39;want&#39; a clean bathroom, right?  I <br/>\ncould take 15 minutes and do a minimal cleaning if I cared so much.<br/>\n<br/>\n** I try to get my husband to take care of business calls and I try to <br/>\nlimit my<br/>\nother calls to people that understand children interupting. It is hard to<br/>\nhave a baby and a 3 year old. My life became a lot easier when I lowered my<br/>\nexpectations and shifted some of my responsibilities to my husband. It gave<br/>\nme more time to focus on the little ones.**<br/>\n<br/>\nThrough learning about unschooling, I&#39;m finally coming the understanding <br/>\nthat my husband has certain limits (that I won&#39;t go into, not arbitrary <br/>\nlimits, physical medical limits) and that he is doing all that he can.  <br/>\nAnd my sister, who would love to help, has taken over most of my mom&#39;s <br/>\ncare and I don&#39;t want her to get burned out, and we don&#39;t have lots of <br/>\nmoney to even hire a cleaning lady, but I&#39;m thinking about doing it on <br/>\ncredit just a few times to get things to a better starting point... <br/>\netc.   I can&#39;t ask more of my husband.  And he already does a ton (most <br/>\nof the laundry, some dishes, taking the kids when I can&#39;t take another <br/>\nmoment, gets up with the 3yo&#39;s night wakings, etc). <br/>\n<br/>\nAlong with the &#39;food bin&#39; in the fridge, that sort of led us yesterday <br/>\nto the same thing you say, I told her she could pick anything she wants <br/>\nand we&#39;d bring it with us in case she was hungry.  She really enjoyed <br/>\nthat!  Although she didn&#39;t eat it, lol.  I&#39;m beginning to think that <br/>\neven the &#39;little&#39; bit of control we&#39;ve try to have over her food has <br/>\nbeen enough for her to want to take control back, which she did, in the <br/>\nway she could, by refusing to eat well enough.  Yesterday she ate so <br/>\nmany snacks, but no meals, but she was much happier.  I&#39;m thinking she <br/>\njust burns through the fuel so much faster that even meal, snack, meal, <br/>\nsnack, meal is not enough for her.  She needs to just snack snack <br/>\nsnack... We took a trip to the grocery store to stock up on stuff for <br/>\nher bin.  She picked fruit, bagged it herself, chose some veggies that <br/>\nshe thought looked interesting, I only advised her on foods that contain <br/>\nartificial ingredients or colors, which I think she is sensitive to (oh, <br/>\nand kosher, we are kosher).  I think I need to find a source for those <br/>\nkosher fishies snacks, because she really wants them.<br/>\n<br/>\nI think I have been worried that if she gets used to eating all kinds of <br/>\n&#39;junk&#39; or processed foods, she&#39;ll eat like that her whole life.  But RU <br/>\nwould say that 1. If i don&#39;t let her now, she&#39;ll binge later when she <br/>\nfinally has her own &#39;power&#39; and 2. If we allow her choice now then it <br/>\nwon&#39;t be an emotional struggle, there won&#39;t be such an emotional link to <br/>\ncertain foods, and she&#39;ll be able to just eat what makes her feel good, <br/>\nand learn what &#39;good&#39; means to her.  Going on sugar binges (in my <br/>\nexperience) doesn&#39;t feel so good, when I reflect back on the experience, <br/>\nbut when I&#39;m in it it is filling some need in me.   If there wasn&#39;t the <br/>\nemotional side of it for me, I would probably conclude that it doesn&#39;t <br/>\nmake me feel so good after the fact, so maybe I don&#39;t want to do that, <br/>\nright?<br/>\n<br/>\n**Are you saying &quot;no&quot; at all? As in &quot;I&#39;m really sorry, but that&#39;s just <br/>\nnot possible?&quot; Its not a terrible thing to say &quot;no&quot;, to be really clear <br/>\nabout something like that. If you&#39;ve been avoiding saying &quot;no&quot;, then <br/>\nthat might be part of the problem - she&#39;s confused. From her <br/>\nperspective, you could be giving muddy information - can we go to the <br/>\npool or not, dangit?<br/>\n**<br/>\nOk, I&#39;ve been thinking about this a lot more the last few days, and <br/>\ntrying, in the situations where it really has to be &#39;no&#39; to just listen <br/>\nto her upsetness and be there with her in that moment, offerring my <br/>\nempathy, holding her if she wants, etc... and it doesn&#39;t seem to help <br/>\nher not be upset, but that isn&#39;t my goal anymore, rather to just be with <br/>\nher as she goes through these very relevant and real feelings, and <br/>\nshe&#39;ll learn from them, which is the better goal.   I think I was a bit <br/>\nstuck on trying not to say no... I&#39;ve been reading a lot and I did read <br/>\nall that stuff somewhere about trying to rephrase things with a &#39;yes... <br/>\nwe can do that later, after such and such&quot;, and I can see how that might <br/>\nconfuse.  She seems to understand a stronger &#39;no&#39; statement, and just <br/>\nplay through her emotions and get back to the &#39;everyday&#39; stuff a bit <br/>\nfaster.  She seems also more willing to take my offer of something else <br/>\nto do after she&#39;s cried or yelled a bit, like she&#39;s gotten it out, but <br/>\nmaybe needs some help transitioning to something new.  Does that sound <br/>\nright/normal/appropriate?  When I see she&#39;s been upset for quite a while <br/>\nand we&#39;ve been together and I sort of get a &#39;feeling&#39; and I just offer <br/>\nsomething else, whatever it is I had planned to do later anyways, and <br/>\nshe suddenly pops out of her misery and gets all into the new thing?<br/>\n<br/>\n**I really second the idea that what she&#39;s needing may just be lots of <br/>\ncalories, lots of quick energy. She may be burning through &quot;fuel&quot; so <br/>\nfast that complex foods don&#39;t help much, she needs the simple stuff. <br/>\nFruit and easy starches and sweet stuff - and lots of it! Will she drink <br/>\njuice? That&#39;s easy to carry along with you, if you&#39;re out, or dried <br/>\nfruits.**<br/>\n<br/>\nI&#39;m going to attempt some nut bars and larabar knock-offs soon I hope.  <br/>\nMy only question about what you&#39;re saying is to wonder if children <br/>\nreally need simple carbohydrates like that?  I mean, I can see the logic <br/>\nof what you are saying... but at the same time, aside from fruit, I <br/>\ndon&#39;t think ancient children had access to candy, white flour products, <br/>\nsugar, ice cream, crackers, etc... But in reality, the last few days, <br/>\nshe&#39;s had more options to eat of simple no-cook foods, and she has been <br/>\neating probably the same amount as we could cajol into her in the past, <br/>\njust spread out over many many little snacks. <br/>\n<br/>\nI hear her crying in her bedroom with my husband &quot;I want another <br/>\ncookie&quot;... and we don&#39;t have any more.  Oy vey.  We ate them all today.  <br/>\nShe doesn&#39;t really want to hear that we can make some more tomorrow. <br/>\n<br/>\nAgain, I&#39;ve been focusing on the kids all day, and yesterday... so it <br/>\ntook my two days to write it, so I&#39;m not sure if I&#39;ve managed to get all <br/>\nmy thoughts down.  But I like this discussion.<br/>\n<br/>\nWhat about when the older one is doing something that could hurt the <br/>\nbaby?  Like whipping a piece of fabric around (it whipped me good and <br/>\nhard, that wasn&#39;t very pleasant).  Throwing things. Trying to push him <br/>\naway if he is interested in what she is doing.  Etc.  I usually try to <br/>\nremove him, since he doesn&#39;t know the difference.  And much of the time <br/>\nI can see its directly related to me going and getting distracted by <br/>\nsomething and not being there to play with her.  But there are those <br/>\nother times, and I just can&#39;t figure out what to do, in the moment, when <br/>\nI have to do something, when it just happens.  What do I say to her?  <br/>\nHow do I get her to stop?  If I take him away, and then she is crying <br/>\nand upset, I can&#39;t come and be with her because he has to be with me and <br/>\nthen she&#39;ll be upset that I&#39;m holding him.</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1259973055","msgId":42347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmYzlqditicmE5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMTk2NzY0LjEwNDA1MDdAeWFob28uY2E+"},"prevInTopic":42345,"nextInTopic":42357,"prevInTime":42346,"nextInTime":42348,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... Are you saying no at all? As in I m really sorry, but that s just not possible? Its not a terrible thing to say no , to be really clear about","messageBody":"<div id=\"ygrps-yiv-1980880355\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Its not a matter of <br/>\n&gt; crying, being sad.  I think she&#39;s angry. She&#39;s yelling that she wants to <br/>\n&gt; go.  Should I just say &#39;no&#39; at some point and then see if she&#39;ll cry it <br/>\n&gt; out?  Because the other options, repeating back to her, empathizing, <br/>\n&gt; offering a bath to swim in, (she&#39;s almost always naked so thats not the <br/>\n&gt; issue),  don&#39;t seem to change anything.<br/>\n<br/>\n </span></blockquote>Are you saying &quot;no&quot; at all? As in &quot;I&#39;m really sorry, but that&#39;s just not possible?&quot; Its not a terrible thing to say &quot;no&quot;, to be really clear about something like that. If you&#39;ve been avoiding saying &quot;no&quot;, then that might be part of the problem - she&#39;s confused. From her perspective, you could be giving muddy information - can we go to the pool or not, dangit?<br/>\n<br/>\nIts pretty common for folks new to unschooling to go through a phase of avoiding saying &quot;no&quot; like the plague, and to some extent that can be beneficial if &quot;no&quot; has become the default response. But there&#39;s nothing inherently &quot;bad&quot; about saying &quot;no&quot; or even &quot;that&#39;s not possible&quot; when that&#39;s really the case! Soft-pedalling a &quot;no&quot; can be terribly confusing to a young child, when the Exact thing they want really isn&#39;t possible - and young kids can be Veeeeeerrrry particular. Not all and not all the time, as you&#39;ve seen yourself, but sometimes you want what you want! When I want fudge, a chocolate chip cookie isn&#39;t going to fill the bill, its just going to make me want fudge all the harder ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Its more that when she&#39;s eating fruit, or the occasionally something <br/>\n&gt; like crackers that are not wholegrain, its very easy to see how she <br/>\n&gt; feels full, and yet her energy drops too fast, her emotions are <br/>\n&gt; roller-coaster, etc... Say we go out and she has ice cream, so she&#39;ll <br/>\n&gt; feel great for a bit, but then after 45 minutes or so she&#39;ll start to <br/>\n&gt; get very upset, and be hungry, but only want more ice cream.  We might <br/>\n&gt; be long gone from the ice cream place.  She won&#39;t accept any other foods <br/>\n&gt; at all when in this mood. <br/>\n<br/>\n </span></blockquote>I really second the idea that what she&#39;s needing may just be lots of calories, lots of quick energy. She may be burning through &quot;fuel&quot; so fast that complex foods don&#39;t help much, she needs the simple stuff. Fruit and easy starches and sweet stuff - and lots of it! Will she drink juice? That&#39;s easy to carry along with you, if you&#39;re out, or dried fruits. <br/>\n<br/>\nWhen I&#39;m out of &quot;fuel&quot; I&#39;m on the verge of nausea, personally, so being offered anything complex to eat isn&#39;t helpful. It helps me to go for something quick and then pack something solid on top of it once my nausea is gone and I can feel hunger - and I notice Mo&#39;s prone to the same sort of thing. Try offering something sweet and Then something complex right after and see if she goes for it. <br/>\n<br/>\nYou could also try making some &quot;nut brittles&quot; with various kinds of nuts and seeds. Its easily portable, and it combines sweet with dense nutrition, if that combination is what she needs. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Along with that she eats breads, crackers, pasta, <br/>\n&gt; rice, etc all wholegrain.<br/>\n<br/>\n </span></blockquote>If they&#39;re whole grain she&#39;s getting a ton of protein. Have you tried white flours? It the trouble really is that she needs more simple foods for fast energy, then whole grains could get in the way of that. I know, it sounds nuts that nutritious food could be a problem! But kids nutritional needs are veeeeerrrry different from adult, and they can change overnight. Its good to have a variety of options - whole grains *and* lighter fare. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: When a parent is at their &#39;end&#39;","postDate":"1259962061","msgId":42345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPSUVNRERDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDRCMTk2NzY0LjEwNDA1MDdAeWFob28uY2E+"},"prevInTopic":42343,"nextInTopic":42347,"prevInTime":42344,"nextInTime":42346,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... she is feeling, how much she wants something. I often repeat back to her (with variations so I m not just repeating verbatim) what she s saying, and that","messageBody":"<div id=\"ygrps-yiv-711543426\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt; I almost always try to empathize with her first, and recognize how<br/>\n </span></blockquote>she<br/>\nis feeling, how much she wants something. I often repeat back to her<br/>\n(with variations so I&#39;m not just repeating verbatim) what she&#39;s saying,<br/>\nand that helps a lot. I guess it is difficult to really understand how<br/>\nmuch something might mean to her, from my adult&#39;s perspective, but I<br/>\nthink I definitely do empathize with her.  &lt;snip&gt;  Because the other<br/>\noptions, repeating back to her, empathizing,<br/>\noffering a bath to swim in, (she&#39;s almost always naked so thats not the<br/>\nissue), don&#39;t seem to change anything. And I&#39;m not so concerned with<br/>\nher being &#39;okay&#39; I guess, its that I don&#39;t really know what to with her<br/>\nwhen she is so angry. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nWhen my kids are angry, I talk to them about what I do when I am angry and<br/>\ngive them tools to use when being angry. I have found that my kids get<br/>\ncompletely annoyed with me when I try to repeat things back to them. For<br/>\nsome reason, that escalates things. One of the things that I have tried that<br/>\nhas worked is to say something like this, &quot;You know, it would be really fun<br/>\nto go swimming. Why do you want to go swimming?&quot; We have a long drawn out<br/>\nconversation about what it is that they want to do. Then, we talk about what<br/>\nwe would need to go swimming (warm weather, a bathing suit, a swimming pool,<br/>\netc.). I have learned that immediately saying &quot;No, we can&#39;t do that&quot; really<br/>\nsets off my 5 year old. It helps her to talk out what she wants to do.<br/>\nThrough our discussion, she will sometimes come to her own conclusion that<br/>\nwe can&#39;t go swimming (or whatever). Sometimes through our discussion, we<br/>\ncome up with other things that she might like to do instead of swimming.<br/>\nBecause I never told her no or that she couldn&#39;t do something, we avoid the<br/>\nmelt down all together.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt; She hates baths, too, if that makes any<br/>\n </span></blockquote>difference. I think I am going to stash a plastic knife, as suggested.<br/>\nBut the issue here isn&#39;t the sandwich, because its not always the<br/>\nsandwich, or the swimming pool. Its pretty random, so I dont&#39; know how<br/>\nto be prepared for things I can&#39;t anticipate. But I can see how<br/>\nperhaps I&#39;m not spending enough time with her when things are going<br/>\nwell, as I want to get phonecalls, emails, cleaning, etc., done. I&#39;m<br/>\ngoing to try focusing on that. It also seems like she just has happier<br/>\nand less-than-happy days, just like we all do. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI keep a bunch of stuff in my car because my 2 year old has a weird<br/>\nrelationship with clothes. I never know when or where she is going to try to<br/>\nstrip and take her clothes off or want to change clothes. It is difficult to<br/>\nanticipate things but sometimes it works best if you lower your expectations<br/>\nwhen you have little ones. Cleaning the house isn&#39;t as important to me as it<br/>\nonce was. I am not willing to fight with my kids over a clean house. We have<br/>\nfound a compromise that we both can live with that allows me to spend more<br/>\ntime with them. We have also arranged our house so that I can do my work (I<br/>\nwork from home) and they can play while I watch or am in the middle of them.<br/>\nI try to get my husband to take care of business calls and I try to limit my<br/>\nother calls to people that understand children interupting. It is hard to<br/>\nhave a baby and a 3 year old. My life became a lot easier when I lowered my<br/>\nexpectations and shifted some of my responsibilities to my husband. It gave<br/>\nme more time to focus on the little ones.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt; Say we go out and she has ice cream, so she&#39;ll<br/>\n </span></blockquote>feel great for a bit, but then after 45 minutes or so she&#39;ll start to<br/>\nget very upset, and be hungry, but only want more ice cream. We might<br/>\nbe long gone from the ice cream place. She won&#39;t accept any other foods<br/>\nat all when in this mood. Maybe if we talked about what other food we<br/>\nhave available for after the ice cream before we even get to the ice<br/>\ncream place, so she has it in her head. She does a lot better with<br/>\nplanning ahead. The foods we offer are always high calorie, full-fat,<br/>\netc. So I don&#39;t think that is the problem. We&#39;re not focusing on<br/>\nprotein at the expense of anything else, its just that we&#39;re noticing<br/>\nthat she seems to be avoiding it actively, strangely. &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nOne of the things that has worked for us is having our kids pack a bag/lunch<br/>\nevery time we go out. My 5 year old has a lunch kit that she will put candy,<br/>\ncookies, crackers, juice, fruit, or whatever in when we go places. She<br/>\neither packs it herself or has me help her. I don&#39;t say no to anything she<br/>\nwants to put in it unless it is really perishable. If it is a long trip, I<br/>\nhave been known to get out the little bitty ice chest and freezer pack for<br/>\nher stuff. Instead of going to the ice cream place, go to the store and get<br/>\na big thing of ice cream so that she can have it as often as she wants.<br/>\nThere are a lot of places that we have stopped going for the very reason you<br/>\ndescribe. It is so much easier to go to the grocery store and get those<br/>\nthings and have them in bulk so that our girls can eat whatever it is every<br/>\n45 minutes. Can you take her to the grocery store and let her pick stuff<br/>\nout? From what you have described about her diet, it doesn&#39;t sound that bad.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; Yesterday we put a bin in the fridge and together talked about and put<br/>\n </span></blockquote>in a variety of foods in kid sized containers for her to take whenever<br/>\nshe is hungry, and she really loved that, although still just nibbled at<br/>\nmost things. I&#39;m also going to set out foods around her as she&#39;s going<br/>\nthrough her day and maybe she&#39;ll pick and nibble at that too, but in the<br/>\npast she says anything that has been out for a bit has gone &#39;bad&#39;.<br/>\nMaybe she&#39;s just too busy to eat, I don&#39;t know. Maybe she got egg&#39;d<br/>\nout, I know I can&#39;t stand eggs some days, since we eat so many. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI think kids go through periods where they exist on fresh air and sunshibe.<br/>\n:-)<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt; Sleep isn&#39;t so bad these days, as she does go to bed earlier now<br/>\n </span></blockquote>usually, although when she wakes in the night and I have to get my very<br/>\ngroggy husband to wake up, which wakes the baby, etc... I do feel<br/>\nexhausted. I was asking that one because I remember how things were 2<br/>\nyears ago until a few months ago, and I&#39;m reflecting back. Now our<br/>\nissue is more about the baby who is waking 20 times a night (or some<br/>\nhigh number that I&#39;m too tired to count). I can&#39;t take a nap, put my<br/>\nbody in the doorway, etc... because it really wouldn&#39;t work with a<br/>\ntoddler and a baby. They can&#39;t be left alone together, and even if I<br/>\nlie on the sofa while they play, I have to step in and play right away<br/>\nto keep the 3yo from getting fustrated with the baby. Or trying to pick<br/>\nhim up, force him to do something, hit him on the head, other impulsive<br/>\nthings that I want to be supervising. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nDo you let your kids watch TV? When I had a toddler and a baby, I would put<br/>\non videos that would get my 3 year old&#39;s attention so I could doze a little<br/>\nhere and there. She wouldn&#39;t watch the entire movie but would watch enough<br/>\nfor me to veg/doze a bit. I have been known to get a sleeping bag and pillow<br/>\nand lay on the floor between the two while a movie is on. Get creative! I<br/>\nfound that when I quit following traditional ideas, I found ways to get<br/>\nsleep and keep the kids safe.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1259956068","msgId":42343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMTk2NzY0LjEwNDA1MDdAeWFob28uY2E+"},"prevInTopic":42333,"nextInTopic":42345,"prevInTime":42342,"nextInTime":42344,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"I almost always try to empathize with her first, and recognize how she is feeling, how much she wants something.  I often repeat back to her (with variations","messageBody":"<div id=\"ygrps-yiv-820478022\">I almost always try to empathize with her first, and recognize how she <br/>\nis feeling, how much she wants something.  I often repeat back to her <br/>\n(with variations so I&#39;m not just repeating verbatim) what she&#39;s saying, <br/>\nand that helps a lot.  I guess it is difficult to really understand how <br/>\nmuch something might mean to her, from my adult&#39;s perspective, but I <br/>\nthink I definitely do empathize with her.  Being okay with her being not <br/>\nokay, thats so hard for a parent, to see your child upset, and yet you <br/>\nare right, it is so important for them to experience the ups and downs <br/>\nof life and be able to come through them.  But despite doing all the <br/>\nthings that have been suggested already, she stays fixated on the <br/>\nswimming, and nothing else is acceptable to her.  Its not a matter of <br/>\ncrying, being sad.  I think she&#39;s angry. She&#39;s yelling that she wants to <br/>\ngo.  Should I just say &#39;no&#39; at some point and then see if she&#39;ll cry it <br/>\nout?  Because the other options, repeating back to her, empathizing, <br/>\noffering a bath to swim in, (she&#39;s almost always naked so thats not the <br/>\nissue),  don&#39;t seem to change anything.  And I&#39;m not so concerned with <br/>\nher being &#39;okay&#39; I guess, its that I don&#39;t really know what to with her <br/>\nwhen she is so angry.  She hates baths, too, if that makes any <br/>\ndifference.  I think I am going to stash a plastic knife, as suggested.  <br/>\nBut the issue here isn&#39;t the sandwich, because its not always the <br/>\nsandwich, or the swimming pool.  Its pretty random, so I dont&#39; know how <br/>\nto be prepared for things I can&#39;t anticipate.    But I can see how <br/>\nperhaps I&#39;m not spending enough time with her when things are going <br/>\nwell, as I want to get phonecalls, emails, cleaning, etc., done.  I&#39;m <br/>\ngoing to try focusing on that.  It also seems like she just has happier <br/>\nand less-than-happy days, just like we all do.<br/>\n<br/>\nShe drinks water and milk, we really only buy that.  She drinks when she <br/>\nis thirsty, she asks me sometimes, sometimes I offer.  I haven&#39;t tried <br/>\nsmoothies, but the baby is absolutely terrified every time I put on the <br/>\nvita-mix.  Protein, we are mostly vegetarian (meat being too expensive) <br/>\nand she has always loved cheese.  She also liked eggs for a long time, <br/>\nfish, beans, sometimes yogurt, even tofu, spoonfuls of peanut butter, <br/>\nnuts, seeds, etc.  Along with that she eats breads, crackers, pasta, <br/>\nrice, etc all wholegrain.  I don&#39;t expect her to eat &#39;solid protein&#39; in <br/>\nthe way my MIL thinks of it (a side of meat or eggs with every meal!).  <br/>\nIts more that when she&#39;s eating fruit, or the occasionally something <br/>\nlike crackers that are not wholegrain, its very easy to see how she <br/>\nfeels full, and yet her energy drops too fast, her emotions are <br/>\nroller-coaster, etc... Say we go out and she has ice cream, so she&#39;ll <br/>\nfeel great for a bit, but then after 45 minutes or so she&#39;ll start to <br/>\nget very upset, and be hungry, but only want more ice cream.  We might <br/>\nbe long gone from the ice cream place.  She won&#39;t accept any other foods <br/>\nat all when in this mood.  Maybe if we talked about what other food we <br/>\nhave available for after the ice cream before we even get to the ice <br/>\ncream place, so she has it in her head.  She does a lot better with <br/>\nplanning ahead.   The foods we offer are always high calorie, full-fat, <br/>\netc.  So I don&#39;t think that is the problem.  We&#39;re not focusing on <br/>\nprotein at the expense of anything else, its just that we&#39;re noticing <br/>\nthat she seems to be avoiding it actively, strangely.<br/>\n<br/>\nYesterday we put a bin in the fridge and together talked about and put <br/>\nin a variety of foods in kid sized containers for her to take whenever <br/>\nshe is hungry, and she really loved that, although still just nibbled at <br/>\nmost things.  I&#39;m also going to set out foods around her as she&#39;s going <br/>\nthrough her day and maybe she&#39;ll pick and nibble at that too, but in the <br/>\npast she says anything that has been out for a bit has gone &#39;bad&#39;.  <br/>\nMaybe she&#39;s just too busy to eat, I don&#39;t know.  Maybe she got egg&#39;d <br/>\nout, I know I can&#39;t stand eggs some days, since we eat so many.<br/>\n<br/>\nSleep isn&#39;t so bad these days, as she does go to bed earlier now <br/>\nusually, although when she wakes in the night and I have to get my very <br/>\ngroggy husband to wake up, which wakes the baby, etc... I do feel <br/>\nexhausted.  I was asking that one because I remember how things were 2 <br/>\nyears ago until a few months ago, and I&#39;m reflecting back.  Now our <br/>\nissue is more about the baby who is waking 20 times a night (or some <br/>\nhigh number that I&#39;m too tired to count).   I can&#39;t take a nap, put my <br/>\nbody in the doorway, etc... because it really wouldn&#39;t work with a <br/>\ntoddler and a baby.  They can&#39;t be left alone together, and even if I <br/>\nlie on the sofa while they play, I have to step in and play right away <br/>\nto keep the 3yo from getting fustrated with the baby.  Or trying to pick <br/>\nhim up, force him to do something, hit him on the head, other impulsive <br/>\nthings that I want to be supervising.<br/>\n<br/>\nIts been all day taking small moments to write this (in an attempt to <br/>\nspend MORE time playing :)  )  Its been a pretty good day though.  I <br/>\nprobably missed a few things.  Thanks for everyone&#39;s advice.  I&#39;d <br/>\nappreciate continuing the conversation a bit longer.</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1259896105","msgId":42333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyQzg3RUJFQzI1NTREREE5NThERERGQzhDQkZENEVDQGJpZ3N1cnByaXNlPg=="},"prevInTopic":42329,"nextInTopic":42343,"prevInTime":42332,"nextInTime":42334,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"***For example: When a child is the sort who resists sleeping (I don t mean resisting parents putting them to sleep. I mean a child who has just been a certain","messageBody":"<div id=\"ygrps-yiv-1938202989\">***For example: When a child is the sort who resists sleeping (I don&#39;t mean<br/>\nresisting parents putting them to sleep. I mean a child who has just been a<br/>\ncertain way since birth... they are constantly trying to stay awake, even when<br/>\ntired, even when utterly exhausted). When parents are living with a child like<br/>\nthis, they can become utterly exhausted, and its very difficult to parent when<br/>\nyou are so tired. Older children can just stay up by themselves. Young<br/>\nchildren need adults to be up, to keep them safe, or keep them from being<br/>\nlonely.***<br/>\n<br/>\nDylan did not like to sleep either.  I sometimes dozed on the sofa while he played in the living room.  I was right there if he needed me.  Or I&#39;d make a bed on the floor near where he was playing.  Sometimes he&#39;d come snuggle in with me and fall asleep. <br/>\n<br/>\nWe put a little tent up in the living room and made it cozy inside.   Sometimes he&#39;d fall asleep in there. <br/>\n<br/>\nIs there a favorite video she likes that you might put on in the evening, something she&#39;s seen lots of times and might be calming?  Dim the lights, make a little nest on the floor and snuggle down to see if she joins you. <br/>\n<br/>\n*** Recently, my 3 year old has started not wanting<br/>\nto eat, only wanting to eat things that are very lacking in protein when she<br/>\ndoes, and just generally refusing even foods that she adamantly declared she<br/>\n&#39;loved&#39; several days earlier.***<br/>\n<br/>\nAre the &quot;lacking in protein&quot; foods higher in calories?  She might be needing more calories.  I know lots of people talk about protein and I&#39;m not suggesting protein isn&#39;t important but not  everyone needs a bunch of protein.  Calories are important for busy kids.  Athletes load up on carbohydrates before a big event.  Kids are burning up a lot of calories and need fuel.  Supply her with some high calorie foods. Don&#39;t wait until she&#39;s getting cranky, just take some different foods to her wherever she is before she gets grumpy.<br/>\n<br/>\n***The result of this, and of me not forcing any<br/>\nfoods, has been what I perceived to be a problem with blood-sugar levels causing<br/>\na truly unhappy child after lunch until going to sleep. An older child might be<br/>\nleft to learn for themselves how certain foods make them feel, and decide what<br/>\nthey&#39;d like to eat. How does this work with a toddler? ***<br/>\n<br/>\nIt might not be blood sugar it might just be that she&#39;s hungry or out of fuel.  Don&#39;t ask her what she wants just take her several different food choices, things you know she likes. <br/>\n<br/>\n***Explanations of how protein helps a body to feel &#39;healthy&#39; haven&#39;t worked. I am going to try having<br/>\nplates of food with a variety of options (with several protein options)<br/>\navailable from midday on as my next possible solution. ***<br/>\n<br/>\nThe last thing anybody wants to hear if they&#39;re hungry or cranky is why they shouldn&#39;t be or how they wouldn&#39;t be if only they...&lt;g&gt;<br/>\nHave little snacks available to her all day.  A plate with some peanut butter cookies, some cheese, some nuts and popcorn, some raisins and sliced apples, just whatever she likes. Growing active bodies need lots of calories. <br/>\n<br/>\n***what can a parent<br/>\ndo when it seems like every turn of the day is a big tantrum?***<br/>\n<br/>\nRemember that she&#39;s still a baby?  Remember that the way you talk to her and respond to her is the way she&#39;ll talk and respond to your grand kids someday or to you when you&#39;re old and goofy.   Imagine someone you respect and whose opinion matters to you standing right beside you while you help our frustrated and angry baby.   <br/>\n<br/>\n***She wants to go<br/>\nswimming NOW, and will repeat the demand over and over all day long, getting<br/>\nvery angry, etc... The pool is closed. ***<br/>\n<br/>\nCan you plop her in the bathtub or the kitchen sink full of water?  Get in with her?  Dylan loved water play and a nice warm tub of water and some of his toys very often cheered him if he was crabby.   Would just getting out of her clothes help her?  Let her run around naked for awhile.  What&#39;s special about the pool?  Is there a game she always likes to play there or a certain friend you meet there?  Can you make that happen at your house when you can&#39;t get to the pool? <br/>\n<br/>\n*** Another example:<br/>\nShe&#39;s hungry and wants the peanut butter sandwich we have packed, but wants me<br/>\nto cut it in half, but with a knife - which we don&#39;t have. She won&#39;t accept<br/>\nthat I tear it in half, and she won&#39;t stop crying for it cut in half with a<br/>\nknife, despite my explanations about not having a knife, or that I&#39;ll be able to<br/>\ncut it when we get home (5 minutes bus ride away) to where the knives are, etc. <br/>\nAt this point, I have run out of ideas, she is so fixated, I can&#39;t seem to help<br/>\nher to be okay.***<br/>\n<br/>\nTake a plastic knife with you, or cut the sandwich before you go.    Have a couple other options if the sandwich gets rejected.  Plan for the bus ride with a potentially cranky kid, maybe bring a comforting blanket along too, or some music she likes.  Plan better or change your plans for awhile until things level out again. <br/>\n<br/>\n Don&#39;t think of it as a fixation.   We all get cranky and the pool or the sandwich might have been her last straw.  Watch and think about what&#39;s happening with her in the hours leading up to the angry demands for the pool or the sandwich cut just so or whatever it might be.   See if you can intervene with a milkshake and some cookies or a warm bath or a snuggle or a romp before she gets too crabby.   Maybe she needs more of your time while she&#39;s happily playing.  If you take that time while she&#39;s happily playing to do other things she might be feeling disconnected.  Stay closer to her, touch her more.   See if that along with frequent snacks will help.    Maybe she&#39;d enjoy and benefit from expending some big energy.  Can you chase her around the yard and let her chase you, play racing games or kick a ball around? <br/>\n<br/>\nAnd is there someone who can come to your house sometimes to play with the kids while you get a nap?   Things might look better if you could get some rest.  <br/>\n<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a parent is at their &#39;end&#39;","postDate":"1259884454","msgId":42329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmOWozNitvZjBkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNzgzaytpNmdjQGVHcm91cHMuY29tPg=="},"prevInTopic":42324,"nextInTopic":42333,"prevInTime":42328,"nextInTime":42330,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"... ****************** What is she drinking? Will she drink milk? What about smoothies (with peanut butter or nut meal, for example)? Milkshakes? Alternately,","messageBody":"<div id=\"ygrps-yiv-1975691858\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;shirarocklin&quot; &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Recently, my 3 year old has started not wanting to eat, only wanting to eat things that are very lacking in protein when she does<br/>\n </span></blockquote>******************<br/>\n<br/>\nWhat is she drinking? Will she drink milk? What about smoothies (with peanut butter or nut meal, for example)? Milkshakes? <br/>\n<br/>\nAlternately, what sorts of &quot;protein&quot; are you offering? she may be responding from a sensitivity of some kind and would be helped by changing sources. Keep in mind that grains also contain proteins - its not necessary to get a &quot;complete protein&quot; at a sitting to be getting that nutritional need met.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;When a child is the sort who resists sleeping (I don&#39;t mean resisting parents putting them to sleep.  I mean a child who has just been a certain way since birth... they are constantly trying to stay awake, even when tired, even when utterly exhausted).  When parents are living with a child like this, they can become utterly exhausted, and its very difficult to parent when you are so tired.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIts true, it Is harder to parent when tired and to parent a tired child - much less do both at once. Oof! Do what you can to find ways to nap. I used to catch a few winks while Mo played by sleeping on the floor in front of a baby-gate. If she climbed over me, I&#39;d wake up, so it was &quot;safe&quot; in that sense. <br/>\n<br/>\nBeyond that, I used to try to set myself up for later while I had the energy and awareness. I&#39;d do things like get a bunch of snacks ready, find some toys or games to pull out later - things that required a little thought, so that when I was a zombie all I had to do was act, not think too hard.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A final example: Following from the idea of tantrums.  The example is how my daughter gets fixated on something, and wants it &quot;NOW.&quot; <br/>\n </span></blockquote>********************<br/>\n<br/>\nWhat do you say and do - what&#39;s your strategy now? Do you go right to &quot;well, that&#39;s not possible because?&quot; It can be better to start simply by reflecting the request back to the child &quot;I want to go swimming&quot; &quot;You want to go swimming.&quot; Also, if your focus has been problem solving, you might want to step back and focus on her feelings (alternately, if your focus has been on feelings it might be better to switch to problem solving). How you do that will depend on her, the main thing is not to expect her to be okay with not-getting what she wants. Under the circumstances, if she can have a good cry and move on, that&#39;s better than spending the day &quot;stuck&quot; only to, eventually melt down. You might try different responses like &quot;I&#39;m sorry, you seem really unhappy about that&quot;. Many kids get very upset if you seem to be telling them what they are feeling, like &quot;I see that you are angry&quot; so it can help to stick to more neutral statements - tricky when talking about feelings! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I can&#39;t seem to help her to be okay.<br/>\n<br/>\n </span></blockquote>If you can let go of the desire for her to be &quot;okay&quot; about whatever, that will help your own stress and emotional state! At her age, feelings are a Big Deal. It might be better to think of yourself as the person who can help her weather the storm, rather than trying to avert the storm itself. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] When a parent is at their &#39;end&#39;","postDate":"1259860524","msgId":42324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFDMDJBNDg1MTMyNDQyMEZCMzJBRkUxQTAwMTkwQTBGQExZTEFMQVAyPg==","inReplyToHeader":"PGhmNzgzaytpNmdjQGVHcm91cHMuY29tPg==","referencesHeader":"PGhmNzgzaytpNmdjQGVHcm91cHMuY29tPg=="},"prevInTopic":42315,"nextInTopic":42329,"prevInTime":42323,"nextInTime":42325,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"At this point, I have run out of ideas, she is so fixated, I can t seem to help her to be okay. ... it sounds to me like your goals are a bit misplaced - the","messageBody":"<div id=\"ygrps-yiv-404378530\">At this point, I have run out of ideas, she is so fixated, I can&#39;t seem to help her to be okay. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>it sounds to me like your goals are a bit misplaced - the goal of &quot;helping her be ok&quot; seems to mean &#39;help her not be upset&quot; - but what if you accepted that she NEEDS to feel these upset feelings, and express them.  and even more than that, she needs your empathy, and support, *through* them, rather than your arguments about how and why it&#39;s not possible to meet her needs and therefore it&#39;s unreasonable for her to be upset?<br/>\n<br/>\nthe power of empathy is quite amazing!  :)<br/>\n<br/>\nwarmly, lyla<br/>\n  MARKETPLACE<br/>\n  Going Green: Your Yahoo! Groups resource for green living<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n  Parenting Zone: Find useful resources for a happy, healthy family and home<br/>\n   Switch to: Text-Only, Daily Digest . Unsubscribe . Terms of Use.<br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"When a parent is at their &#39;end&#39;","postDate":"1259807668","msgId":42315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNzgzaytpNmdjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42324,"prevInTime":42314,"nextInTime":42316,"topicId":42315,"numMessagesInTopic":0,"msgSnippet":"Sorry, the subject line sounds pretty dire.  But its not really.  I m looking for a discussion, thats all, as I sometimes have days where I feel like that. ","messageBody":"<div id=\"ygrps-yiv-506364215\">Sorry, the subject line sounds pretty dire.  But its not really.  I&#39;m looking for a discussion, thats all, as I sometimes have days where I feel like that.  <br/>\n<br/>\nThere are some situations that come up in our day-to-day living which can be difficult... and I would like to find the RU way through those moments.  <br/>\n<br/>\nAll of these examples refer to young children (my oldest is 3 and youngest is 9 months)<br/>\n<br/>\nFor example:  When a child is the sort who resists sleeping (I don&#39;t mean resisting parents putting them to sleep.  I mean a child who has just been a certain way since birth... they are constantly trying to stay awake, even when tired, even when utterly exhausted).  When parents are living with a child like this, they can become utterly exhausted, and its very difficult to parent when you are so tired.  Older children can just stay up by themselves.  Young children need adults to be up, to keep them safe, or keep them from being lonely.  <br/>\n<br/>\nAnother example:  I&#39;m sure every child has many different stages they go through regarding their eating habits.  Recently, my 3 year old has started not wanting to eat, only wanting to eat things that are very lacking in protein when she does, and just generally refusing even foods that she adamantly declared she &#39;loved&#39; several days earlier.  The result of this, and of me not forcing any foods, has been what I perceived to be a problem with blood-sugar levels causing a truly unhappy child after lunch until going to sleep.  An older child might be left to learn for themselves how certain foods make them feel, and decide what they&#39;d like to eat.  How does this work with a toddler?  Explanations of how protein helps a body to feel &#39;healthy&#39; haven&#39;t worked.  I am going to try having plates of food with a variety of options (with several protein options) available from midday on as my next possible solution.  Even if she is choosing and knows what the way she is eating is doing to her body... what can a parent do when it seems like every turn of the day is a big tantrum? <br/>\n<br/>\nA final example: Following from the idea of tantrums.  The example is how my daughter gets fixated on something, and wants it &quot;NOW.&quot;  She wants to go swimming NOW, and will repeat the demand over and over all day long, getting very angry, etc... The pool is closed.  Together with her, I called to find out when its open, and we can plan to go, but she wants to go NOW.  Another example:  She&#39;s hungry and wants the peanut butter sandwich we have packed, but wants me to cut it in half, but with a knife - which we don&#39;t have.  She won&#39;t accept that I tear it in half, and she won&#39;t stop crying for it cut in half with a knife, despite my explanations about not having a knife, or that I&#39;ll be able to cut it when we get home (5 minutes bus ride away) to where the knives are, etc.  At this point, I have run out of ideas, she is so fixated, I can&#39;t seem to help her to be okay. <br/>\n<br/>\nI&#39;d love to hear the broader RU philosophy applied to these situations, as well as specific advice.  My words may not have accurately described the situations, so please question my words/intentions as needed.</div>","specialLinks":[]}],"prevTopicId":42335,"nextTopicId":41099}}