{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":3879588,"authorName":"HSlater351@aol.com","from":"HSlater351@...","profile":"hslater351","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] 4-year old son addicted to iPad.  Questions about my ...","postDate":"1347895932","msgId":49040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMTIxLjM4NzBkOWYyLjNkODg5YzdjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":49039,"nextInTime":49041,"topicId":49040,"numMessagesInTopic":0,"msgSnippet":"The iPad is my favorite toy so I immediately am siding with the four year old. I do know what you mean though. My seven year old is also a huge ipad fan.  He","messageBody":"<div id=\"ygrps-yiv-458147278\">The iPad is my favorite &quot;toy&quot; so I immediately am siding with the four year <br/>\n old. I do know what you mean though. My seven year old is also a huge ipad <br/>\nfan.  He takes the ipad with him every day during his rest time and often <br/>\nplays it for  two hours straight.  Like everything my family is interested in <br/>\nit goes  through phases. How long as your son been playing with the ipad? <br/>\n <br/>\nWe have a storage area for the ipad where I ask that it be returned after  <br/>\neach use so I can keep it fully charged and also know where it is if someone <br/>\n wants to use it (we have four kids). Also those things are EXPENSIVE so I <br/>\nalways  request that they keep it inside and we don&#39;t take it in the car. <br/>\n <br/>\nIGN has a daily post where they share ipad apps that are free or lower in  <br/>\nprice than usual so every day I load the new free games. <br/>\n <br/>\nHere is the most recent update, at the bottom of the update is a link to  <br/>\nsubscribe. <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ign.com/articles/2012/09/14/app-store-update-september-14-2_\">http://www.ign.com/articles/2012/09/14/app-store-update-september-14-2_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ign.com/articles/2012/09/14/app-store-update-september-14-2)\">http://www.ign.com/articles/2012/09/14/app-store-update-september-14-2)</a> <br/>\n <br/>\nAs for hitting,  I try to redirect them and keep them physically  separated <br/>\nwhen I can tell they are getting tired or upset. Telling someone that  it <br/>\nis not okay to hurt another person or animal is not breaking any unschooling  <br/>\nrules. It is the &quot;punishment&quot; that in my opinion is not part of an  <br/>\nunschooling lifestyle so there are no time outs. Hitting someone tends to have a  <br/>\nnatural punishment. The other person is hurt/sad/angry and doesn&#39;t want to  <br/>\nplay any more.  <br/>\n <br/>\n <br/>\n <br/>\n <br/>\nIn a message dated 9/17/2012 7:30:42 A.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenyoust@...\">jenyoust@...</a> writes:<br/>\n<br/>\nWe are  new to unschooling (son is 4 and daughter is 2). We are also new to <br/>\nthe  unconditional parenting style that comes along with the unschooling <br/>\nlifestyle.  I am thrilled to have found this unschooling and this particular <br/>\nunschooling  community, but I am having such trouble practicing what I feel <br/>\nin my heart is  right.<br/>\n<br/>\nFor example, I KNOW that my son playing the iPad for hours a day  (even <br/>\nthough I am ever-strewing) is something he feels the need to do right  now. I <br/>\nhave loaded games upon games for him (educational and just-for-fun  silly <br/>\ngames), in order to strew on the iPad as well. But, the &quot;schoolie&quot; in me  keeps <br/>\nhaving the fear that he will NEVER want to do other things (and that the  <br/>\niPad is inherently bad). Now, if we go outside and play and the neighbors are <br/>\n there, he will play, have fun, be active...do other things, but the minute <br/>\nwe  are inside or in the car, it is &quot;where&#39;s the iPad?&quot; Winter is coming, <br/>\nso I  know this will be more of an issue as it gets colder outside. <br/>\n<br/>\nI find  myself resorting back to authoritarian/manipulative behavior by <br/>\nsaying &quot;it&#39;s  charging&quot; when it&#39;s not, and then helping him engage in some <br/>\nother activity.  He always ends up finding something else to do --which makes me <br/>\nthink, then,  that taking away the iPad is sometimes a good move (but the <br/>\nnew unschooling  voice in the back of my head is telling me that I should not <br/>\nhave made that  decision for him). Do I just keep the iPad available to him <br/>\nat ALL times and  let him play to his heart&#39;s content? I do sit with him <br/>\nand play from time to  time, when he wants me to...most of this is going on in <br/>\nmy own  head.<br/>\n<br/>\nNow onto more of a parenting question...my son is starting to  hit. I could <br/>\nbe RIGHT THERE with them, and he&#39;s so fast that I can&#39;t stop him  from <br/>\nhitting his sister in the face/head, etc. I always comfort her first, and  <br/>\nlately it has been so frustrating to me that I end up raising my voice and  <br/>\ntelling him please do not do that, it&#39;s not nice (I know, I know...) I get so  <br/>\nimpatient with this behavior, and it&#39;s hard for me to imagine how not  <br/>\ndisciplining in a traditional sense (time out, go to your room, etc.) will  &quot;teach&quot; <br/>\nsomeone that it&#39;s not right to clock someone in the head, especially  if he <br/>\nkeeps doing it over and over again. (I have suggested that he go to his  <br/>\nroom and relax for a bit...?) Should I not let them play together for awhile  <br/>\nright now? I&#39;m not sure what I should do here to limit the blows to my 2 <br/>\nyear  old...other times they are great together. Usually, it&#39;s the iPads that <br/>\nresult  in this behavior....she is using his or vice versa -- they each hav e <br/>\none,  what more can I do? HE is also always suggesting the she play with <br/>\nhers when  he&#39;s playing with his (even though she may be happily playing <br/>\nPlay-Doh,  coloring, etc.)<br/>\n<br/>\nNot on to strewing...I&#39;ve been trying SO HARD to strew  interesting and new <br/>\nthings for both of my kids. The iPad wins out every.  single. time. Even my <br/>\n2 year old is exhibiting the &quot;addiction&quot;. Do I keep  trying with him at <br/>\nthis point, or should I wait until he comes to me with an  interest? Recently, <br/>\nwe got some maps of prehistoric times at Costco, he loved  them for about 5 <br/>\nminutes. We got new games to play...for the whole family to  play with <br/>\nhim...nope. Books, paper, painting, crayons, pencils, music,  toys...it all lasts <br/>\nminutes to an hour or so, and then he&#39;s on to the iPad  again.<br/>\n<br/>\nI&#39;m thinking you might all tell me to just go with the iPad, I  think I <br/>\nneed to hear that that&#39;s ok or something. I am still de-schooling, and  it&#39;s <br/>\nhard to wrap my mind around the fact that this is ok for a little person  who <br/>\nhas shown no real interest in reading, writing, numbers, etc. Just gaming.  <br/>\n:) Any help is appreciated, lay it on  me!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49030,"nextTopicId":49038}}