{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":240002389,"authorName":"Andrea Catalano","from":"Andrea Catalano &lt;fennel1001@...&gt;","profile":"fennel1001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335323320","msgId":48394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2QjlFMzQxLUIwRDEtNEI2Qi05QzdELUY5MjIwNTI4RkY5NkB5YWhvby5jb20+"},"prevInTopic":48392,"nextInTopic":0,"prevInTime":48393,"nextInTime":48395,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"In addition to sound proofing your apartment, I wonder if you can come up with specific parameters with your parents around noise. I agree with you that it is","messageBody":"<div id=\"ygrps-yiv-539982749\">In addition to sound proofing your apartment, I wonder if you can come up with specific parameters with your parents around noise. I agree with you that it is unkind (and incredibly stressful) to not allow children to play, yet I can understand others wanting/needing some reliable quiet. Can you talk to them about their schedules -- times they might really need or especially want quiet (meal times, maybe, or naps or special TV shows).  During those specified hours, respect their desire for quiet and try to bring the kids out of the house or engage them in quieter activities. Outside of those particular hours, perhaps you can relax a bit and let them play normally. And if your parents have their own regular outings, you will know that is definitely a time to play!</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: First post with question","postDate":"1335293491","msgId":48392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNnNuaitvZmZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNTE0aCtycHAwQGVHcm91cHMuY29tPg=="},"prevInTopic":48390,"nextInTopic":48394,"prevInTime":48391,"nextInTime":48393,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"Who owns the house? Nance","messageBody":"<div id=\"ygrps-yiv-597242605\">Who owns the house?<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vv_2b&quot; &lt;vib6750@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Nance. Thank you for your reply. <br/>\n&gt; <br/>\n&gt; I will definitely look into sound proofing.  I hope that this is something that will benefit all of us. Oh and PH is private house.  They are out of the house for a few hours at a time, a few days a week...maybe I should start taking my kids out more often...<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335289168","msgId":48390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNm9nZytlcTgzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNTM4NCs1OTE2QGVHcm91cHMuY29tPg=="},"prevInTopic":48389,"nextInTopic":48392,"prevInTime":48389,"nextInTime":48391,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"... *************** Step back from the idea of not allowed and consider the natural restrictions of your life as an opportunity to do softer, quieter things.","messageBody":"<div id=\"ygrps-yiv-280606550\">&quot;vv_2b&quot; &lt;vib6750@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My kids are not &quot;allowed&quot; (I hate that) to run, scream, or play with hard toys before 10 am.<br/>\n </span></blockquote>***************<br/>\n<br/>\nStep back from the idea of &quot;not allowed&quot; and consider the natural restrictions of your life as an opportunity to do softer, quieter things. For that matter, step away from hating! Life has real limits and hating those limits shuts down your ability to adapt to them in ways which are supportive of your needs and those of your children. <br/>\n<br/>\nIt&#39;s not such a terrible thing that your kids can&#39;t run or scream indoors - it&#39;s a normal limit. Most people expect to live next door to others without hearing screaming the same way they expect not to hear loud music... or loud sex! Being unschoolers doesn&#39;t give your kids special rights to be loud at the expense of others&#39; comfort and happiness. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why should I apologies for them telling me to hit my kids? <br/>\n<br/>\n </span></blockquote>I&#39;m sorry, I wasn&#39;t clear - apologize for the Noise, not for the fact that you parent differently. Don&#39;t talk about how you parent with your neighbors, even if they are your parents - it&#39;s none of their business as long as you&#39;re not disturbing the peace. But since you are disturbing their peace, it&#39;s reasonable to expect they&#39;ll complain and even say mean things to you. Conciliate but don&#39;t explain - I&#39;m so sorry! We&#39;re working on it. And then change the subject. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And if adopting their perspective means hitting them, or punishing them for playing like normal kids, or punishing them, for dancing on the floor, then no, I can not.<br/>\n </span></blockquote>***************<br/>\n<br/>\nAgain, I&#39;m sorry I wasn&#39;t more clear - I didn&#39;t mean you should Adopt their perspective at all! You can understand someone&#39;s viewpoint without agreeing with it. From their viewpoint, you can&#39;t control your children... and they&#39;re right, but from Your perspective, you don&#39;t Choose to exercise control. With that in mind, if they bring up parenting, you can simply agree with them: you might be right about that. And change the subject. Don&#39;t explain or discuss the matter, it will only set you up to have your feelings hurt and/or to hurt theirs. <br/>\n<br/>\nBut all that being said, the fact that your kids only want to play &quot;like normal kids&quot; isn&#39;t a good reason to set up your neighbors to feel constantly under assault. It Is harder that the neighbors are your parents and have emotional ties to yank, but avoid making the issue about their parenting versus yours. That&#39;s not the issue. The issue is that your family is harming your neighbors peace and happiness. Don&#39;t hate that, look for ways to do joyful, peaceful And quiet things with your kids indoors and so have more joy and peace in your life. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First post with question","postDate":"1335283630","msgId":48388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMzIzRDc5LUNENjItNEJGMC1CMUIxLUE2QjZBNDI0OUZENUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpuNTFqMCtra2pAZUdyb3Vwcy5jb20+","referencesHeader":"PGpuNTFqMCtra2pAZUdyb3Vwcy5jb20+"},"prevInTopic":48386,"nextInTopic":48389,"prevInTime":48387,"nextInTime":48389,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"... Did you come up with this schedule with your parents? Or is it something you came up with that you think will appease them? Or it s just what you do? Maybe","messageBody":"<div id=\"ygrps-yiv-1703738271\">On Apr 23, 2012, at 10:02 PM, vv_2b wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  between (the babies and the girls get on their computer) and during the other hours<br/>\n&gt; it&#39;s wind down time, where we sit and watch a family show, or read. Depending on the mood....<br/>\n<br/>\n </span></blockquote>Did you come up with this schedule with your parents? Or is it something you came up with that you think will appease them? Or it&#39;s just what you do?<br/>\n<br/>\nMaybe a big part of their reaction is they have no control over the noise. The down times feel like &quot;finally they&#39;re quiet&quot; to them. Then that peace shatters. So they feel like they&#39;re always waiting for the other shoe to drop. It&#39;s bound to be irritating.<br/>\n<br/>\nWhat it sounds like is they complain. You react. They complain more. You change your reaction. What you need is communication :-)<br/>\n<br/>\nDig beneath the complaints and the fixes they&#39;re coming up with to find out what their specific needs are, what hours do they need quiet. Keep probing. Go through the day. Make sure they know their problems are being heard and taken seriously. Maybe they nap or have a TV show they watch at particular time. Write down their needs. Take off your daughter hat and try to listen objective.<br/>\n<br/>\nDon&#39;t let them bait you with &quot;You need to control them.&quot; That&#39;s a &quot;solution&quot; they&#39;re throwing at you, not the problem that&#39;s causing them to say that. Let them know the times when the kids naturally wake up and nap and see if you can work their needs into that.<br/>\n<br/>\nIf you have problems problem solving, I know Ross Greene&#39;s The Explosive Child has some good scenarios written out that maybe you can adapt for adults. The process is the same. It&#39;s all about helping people feel they&#39;re being heard.<br/>\n<br/>\n(Maybe someone has a book specifically about adult relationships.)<br/>\n<br/>\nOn the Amazon message board someone asked about soundproofing in the exact same situation. There was an extensive discussion of it:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/JCilMW\">http://amzn.to/JCilMW</a><br/>\n<br/>\nIf that doesn&#39;t help, Googling soundproofing floors should turn up some ideas.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74011951,"authorName":"vv_2b","from":"&quot;vv_2b&quot; &lt;vib6750@...&gt;","profile":"vv_2b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335279957","msgId":48389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNmZnbCt0Z2ozQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNTc1MytmMGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":48388,"nextInTopic":48390,"prevInTime":48388,"nextInTime":48390,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"Uh.  I offer you cyber ((hugs)) as well....for it really is an uncomfortable situation. I m glad to know that you have the option of moving, I don t. We are","messageBody":"<div id=\"ygrps-yiv-481755216\">Uh.  I offer you cyber ((hugs)) as well....for it really is an uncomfortable situation. I&#39;m glad to know that you have the option of moving, I don&#39;t. We are paying a 30 month mortgage and waiting for them to move back to their country...it&#39;s been 2 years.  I know that I will miss them terribly when they leave but this noise thing is making us nuts.   I agree is is unreasonable to expect so much more, but I think that my recourse will come i finding my kids more or different activities in the meantime...we&#39;ll see. I hope that this works.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;cyberbreadbowl&quot; &lt;jredwine@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I am in a similar situation, except we are in an apartment with an 11 month lease and the downstairs neighbor complains to the landlord constantly about our children jumping and running. </span></blockquote></div>","specialLinks":[]},{"userId":4185092,"authorName":"cyberbreadbowl","from":"&quot;cyberbreadbowl&quot; &lt;jredwine@...&gt;","profile":"cyberbreadbowl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335238627","msgId":48386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNTc1MytmMGF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNDNjZitla3RrQGVHcm91cHMuY29tPg=="},"prevInTopic":48385,"nextInTopic":48388,"prevInTime":48385,"nextInTime":48387,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"I am in a similar situation, except we are in an apartment with an 11 month lease and the downstairs neighbor complains to the landlord constantly about our","messageBody":"<div id=\"ygrps-yiv-506289007\">I am in a similar situation, except we are in an apartment with an 11 month lease and the downstairs neighbor complains to the landlord constantly about our children jumping and running. I would say the best thing in your case is to move out if possible, we are considering breaking our lease due to the stress of having to be gone or having to have the kids jump on the bed or ride piggy back instead of playing. Kids need to run and play, and I think it&#39;s unreasonable to expect otherwise. That it&#39;s your parents instead of strangers is quite sad, but I&#39;d say try to move or have your parents move. (((hugs)))<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vv_2b&quot; &lt;vib6750@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all. I am new to this group and have been trolling for a few weeks now: getting a feel for the group and such.  I am a 32 yo mom of 4 kids, 5,6 and 2yo twins.  I have not felt the need to ask anything until now, and I am not sure if this is where I should be posting this, but I feel kind of lost, so here goes...<br/>\n&gt; <br/>\n&gt; I live in a PH in which my parents live in the basement apt. I live on the first floor with my family dh, kids and I.  My parents have made it very clear that my kids are extremely noisy and that their running and playing is unbearable. When they were younger I did not like for them to watch tv so much because of various reasons, but now as a result of their complaints the tv is on all of the time, in the hopes for me to minimize the noise - you know while they&#39;re watching it, they&#39;re not running...sometimes they go out side and play in our backyard and such but when they are inside and playing like normal children (of course it&#39;s loud there are a lot of them) they are bothersome to them. <br/>\n&gt; <br/>\n&gt; I try as hard as I can to not yell at my children, because I don&#39;t think that it&#39;s right to yell at them for playing normally, but the stress of their complaints are taking a lot out of me, and causing me to yell more than I&#39;d like.  When I tell my parents that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them and that I should hit them...I&#39;m so hurt. </span></blockquote></div>","specialLinks":[]},{"userId":74011951,"authorName":"vv_2b","from":"&quot;vv_2b&quot; &lt;vib6750@...&gt;","profile":"vv_2b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335234628","msgId":48385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNTM4NCs1OTE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNHBicCtlMmhnQGVHcm91cHMuY29tPg=="},"prevInTopic":48384,"nextInTopic":48386,"prevInTime":48384,"nextInTime":48386,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"I really do understand where they are coming from. I know that it is hard for them.  I have made changes in order to reduce the noise factor.  My kids are not","messageBody":"<div id=\"ygrps-yiv-826595319\">I really do understand where they are coming from. I know that it is hard for them.  I have made changes in order to reduce the noise factor.  My kids are not &quot;allowed&quot; (I hate that) to run, scream, or play with hard toys before 10 am.  They hang with me in the kitchen, watch tv, listen to music, stay in bed with me, or draw until 10 (btw most days they are up at 7:30). After that, I give then time to play, until about 12 or 1.  The little ones sleep until 3 or so, and the bigger ones play on their computer until the little ones wake.  After that, they play again or watch tv, until about 5 or 6 and then until they go to sleep for the night it&#39;s quite time. Family movies or reading. Inbetween the quite times, they do play in our backyard, watch tv, or hang with me in the kitchen - it&#39;s not as if there is constant running for all of those hours. <br/>\n<br/>\nWhy should I apologies for them telling me to hit my kids? I am unsure about how you mean this...the reason that I have had this conversation with them, is because this is what they told me to do (having them sit or lay down etc.)...<br/>\n<br/>\nWe can&#39;t switch apt.s because they only have 1 bedroom, we have 3. But if I could I would do it in a heart beat. <br/>\n<br/>\nThey go outside when the weather is nice for hours at a time. I had this issue today because they were inside due to rain...I am going to start introducing more things to help busy their brains more often.  I think this might be a way to help everyone...<br/>\n<br/>\nAnd I do understand their perspective, that&#39;s why I do the things that I mentioned above.   I do set boundaries,  it just never seems to be enough. And if adopting their perspective means hitting them, or punishing them for playing like normal kids, or punishing them, for dancing on the floor, then no, I can not.  I will be civil, and understanding, and kind to them, and loving, and respectful, but I will not jeopardize my the emotional or mental health of my children. However, as I said, I really do greatly appreciate your ideas regarding the rainy day and winter weather activities - I think that this is a really good start in helping us all. Thank you Meredith, for all of those great suggestions. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  &quot;vv_2b&quot; &lt;vib6750@&gt; wrote:<br/>\n&gt; &gt;&gt; I live in a PH in which my parents live in the basement apt. I live on the first floor with my family dh, kids and I.  My parents have made it very clear that my kids are extremely noisy and that their running and playing is unbearable.<br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; Step back from the family aspects a bit and see it from another perspective: your downstairs neighbors are bothered by the noise. In most shared housing situations, neighbors are expected to try and keep noise to a reasonable level, so as not to disturb one another. If your kids are doing a lot of running and tend to be boisterous, that may be normal kid behavior, but it&#39;s not courteous neighborly behavior for your living situation. <br/>\n&gt; <br/>\n&gt; &gt;&gt;When I tell [the neighbors] that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them and that I should hit them...<br/>\n&gt; **************<br/>\n&gt; <br/>\n&gt; Okay, so I changed &quot;my parents&quot; to &quot;the neighbors to highlight something: this is not a conversation to have with the neighbors! Your parenting isn&#39;t their business - but the noise level in their own home very much Is their business. Don&#39;t bring parenting issues into it. Apologize and look for solutions. <br/>\n&gt; <br/>\n&gt; Are there times they&#39;re regularly out? Times they prefer to sleep? Rooms they spend more time than others? Maybe you can curtail your kids activities to times which better accommodate the neighbors. At the same time, it doesn&#39;t sound like a great living situation - elderly people often find children disturbing, so a family living over an elderly couple isn&#39;t a great situation for Either family. Can you switch apartments? That alone could help a lot! If you need to share expenses, can you find a place that lets you live side-by-side rather than an over-under? <br/>\n&gt; <br/>\n&gt; &gt;&gt;the tv is on all of the time, in the hopes for me to minimize the noise - you know while they&#39;re watching it, they&#39;re not running.<br/>\n&gt; *************<br/>\n&gt; <br/>\n&gt; Is that helping? If so, look for more things you can do with the kids that don&#39;t involve running around being loud. Lets see, with kids 5 and under... what about things like pans of rice or sand, painting, gluing - lots of arts-n-crafts stuff? And things like legos and puzzles, computer and video games, books, building with cardboard boxes, cooking, hand sewing, puppets... hunt for &quot;rainy day activities&quot; or &quot;winter activities&quot; and see what you can come up with. There are plenty of options besides tv on the one hand and racing around shaking the neighbors&#39; ceiling on the other. <br/>\n&gt; <br/>\n&gt; &gt;&gt; When I tell my parents that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them <br/>\n&gt; ****************<br/>\n&gt; <br/>\n&gt; From their perspective, you don&#39;t! You&#39;re not Interested in controlling your kids the way your parents are thinking. They aren&#39;t interested in adopting your perspective any more than you are in adopting theirs, though. Changing their minds isn&#39;t one of the options.  <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":74011951,"authorName":"vv_2b","from":"&quot;vv_2b&quot; &lt;vib6750@...&gt;","profile":"vv_2b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335233205","msgId":48384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNTFybCtsM2lxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzUyMDc0MTUuMzg1NzYuWWFob29NYWlsTmVvQHdlYjEyMDUwMi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":48383,"nextInTopic":48385,"prevInTime":48383,"nextInTime":48385,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"Vicki, thank you so kindly for your warm hearted response, it is greatly appreciated. They have been saying that they are going to move back to their country","messageBody":"<div id=\"ygrps-yiv-411030990\">Vicki, thank you so kindly for your warm hearted response, it is greatly appreciated. <br/>\n<br/>\nThey have been saying that they are going to move back to their country for years, and it just never happens, although I am sad, I know that this is probably for the best.  We have had many conversations about this noise situation, and I&#39;ve made many amends to help them, but as you said, it&#39;s just really an uncomfortable thing...I really do understand that they are uncomfortable, I get it, I just don&#39;t know what else to do. I guess that I&#39;ll just have to wait this out, and see what happens, as moving is not an option for any of us. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Vickisue Gray &lt;vickisue_gray@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hey there,<br/>\n&gt; <br/>\n&gt; First off, I&#39;m sorry you have to go through this.  It&#39;s a very difficult position for you to be in.<br/>\n&gt; <br/>\n&gt; Second off, take this with a grain of salt, but I&#39;ve been in similar situations with parents and in-laws and tried for many years to try and please everyone while protecting, raising my kids the best I could do and so I believe I can sympathize with how hurt and sad this situation can make you.  Been there, and tomorrow I turn 49, the two oldest children are grown and off on their own, leaving us (my spouse and I) with just the youngest (14yo) still unschooling at home.<br/>\n&gt; <br/>\n&gt; Our house took a serious toll during the years we tried to accommodate the parents and in-laws.  Looking back, I wish we would have found another way sooner.<br/>\n&gt; <br/>\n&gt; Is there anyway that the living conditions can be changed and you can move away?  Sometimes, distance is a blessing and with the ages of your children, you need to be able to be happy at home.  Sure, you can gain the &quot;quite&quot; your parents demand by many field trips to the parks and zoos and what-not, but that&#39;s asking a lot of a mom to do every day just so your parents can have the silence they wish for.  In my personal experience with elders, they aren&#39;t going to change nor get more understanding and accepting.  All being that close will end up doing, is cause your children to come to resent them.<br/>\n&gt; <br/>\n&gt; &quot;We can&#39;t play tag, or hide and seek because the grand-parents get mad when we move&quot;  &quot;We can&#39;t sing because they can hear us&quot;<br/>\n&gt; <br/>\n&gt; It&#39;s really not worth it.  You will try hard to raise your kids while trying to keep the kids quiet enough to keep the grand parents from complaining and you will always come up short leaving yourself more tired and depressed.  Why put yourself through it?<br/>\n&gt; <br/>\n&gt; I don&#39;t mean to be pessimistic, but after years of trying to make it work with my own parents, sometimes distance is the only answer.  <br/>\n&gt; <br/>\n&gt; You could try talking to your parents, but it sounds like they are already of the mind to tell you what you are doing wrong so you most likely won&#39;t get any where with it.<br/>\n&gt; <br/>\n&gt; The only families that I&#39;ve seen be successful with the extended family, has been families where the grandparents are supportive, helpful, kind worded, and loving.  My spouse has said many times that our kids didn&#39;t get lucky with the grandparent lotto.  My spouse really wanted to have the extended family because he grew up with very loving grandparents so he didn&#39;t know they could ever not be,  But even the four years his mom lived with us, proved it can be a very bad thing and not all grandparents know how nor care to, be kind and generous with their love.<br/>\n&gt; <br/>\n&gt; The only other thing I can think of for a faster solution if you can&#39;t find other accommodations, would be to ask if it&#39;s feasibly to switch living positions?  Put the elders above you all?  It wouldn&#39;t stop all the noise from traveling, but at least they wouldn&#39;t hear the pitter patter of little feet.  Asking small children or any children for that matter, to not run and bounce around is really ridiculous IMHO.<br/>\n&gt; <br/>\n&gt; Good luck and (((HUGS)))  <br/>\n&gt; <br/>\n&gt; Praying you can find a solution <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Vicki<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":74011951,"authorName":"vv_2b","from":"&quot;vv_2b&quot; &lt;vib6750@...&gt;","profile":"vv_2b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335232928","msgId":48383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNTFqMCtra2pAZUdyb3Vwcy5jb20+","inReplyToHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUyMjQ3RTdAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":48382,"nextInTopic":48384,"prevInTime":48382,"nextInTime":48384,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"Thank you for responding, Debra. What I normally do is that I make it a point that there is no horsing around before 10 am...I bring them into the kitchen with","messageBody":"<div id=\"ygrps-yiv-1205148582\">Thank you for responding, Debra. What I normally do is that I make it a point that there is no horsing around before 10 am...I bring them into the kitchen with me and play there, draw, listen to music with me, or help me prepare breakfast, stay in bed with me watching movies, or I have them help me do laundry. If there is someone that is not feeling well, I let them pick one of their favorite movies or activities to do in order to minimize the noise.  Their free play time is between the hours of 10 am to 1 and then 3 to about 6.  They nap in between (the babies and the girls get on their computer) and during the other hours it&#39;s wind down time, where we sit and watch a family show, or read.  Depending on the mood....<br/>\n<br/>\nThey&#39;ve lived here for a few years, and are planing on moving back. They just don&#39;t know when...in the meantime, it&#39;s all just weird. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Debra Rossing &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; If they were not your parents, but were &#39;regular&#39; tenants in an apartment that you owned, what would you do here? There definitely need to be &#39;reasonable&#39; guidelines for noise - whether you have your parents there or it&#39;s just you and your family, there are times when some need to be quiet for others (as in, if your hubby needs to be asleep early to get up for work, or if one of the kids is sick, for example). Running, jumping, yelling kids at 6 am or 2 am would aggravate ME! So, how can you allow your kids to be kids, running and jumping and all, in a manner that would be considered reasonable by the average apartment dweller? For example, fabric wall hangings (pretty quilts and such) can help deaden sound.<br/>\n&gt; <br/>\n&gt; Also, you mention they are from another country. How long have they been where you are? Do they have a community of friends, folks from &quot;back home&quot; wherever that is, that they get together with socially? Are they comfortable going out and about or are they anxious in a new place, not understanding well the language and customs? If their lives are feeling out of control, they are going to want to control as much as they can - which would be you and the kids. They may be struggle to make sense of this new, very different, place they&#39;re in. While you want to be very clear on the boundaries - you are parent to your kids, they aren&#39;t - also recognize that they need the same gentleness you would show to your husband and children. Maybe help them get to know the area and your kids away from &#39;home&#39; - take them to a park with you so they can see the kids run and play in an &quot;appropriate&quot; (in their mind - pretty much every culture has some &#39;kid&#39; space of some sort for play) location for running and playing.<br/>\n&gt; <br/>\n&gt; Deb R<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":74011951,"authorName":"vv_2b","from":"&quot;vv_2b&quot; &lt;vib6750@...&gt;","profile":"vv_2b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335232465","msgId":48382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNTE0aCtycHAwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNDZzYSt1MGtxQGVHcm91cHMuY29tPg=="},"prevInTopic":48381,"nextInTopic":48383,"prevInTime":48381,"nextInTime":48383,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"Hi Nance. Thank you for your reply. I will definitely look into sound proofing.  I hope that this is something that will benefit all of us. Oh and PH is","messageBody":"<div id=\"ygrps-yiv-837744505\">Hi Nance. Thank you for your reply. <br/>\n<br/>\nI will definitely look into sound proofing.  I hope that this is something that will benefit all of us. Oh and PH is private house.  They are out of the house for a few hours at a time, a few days a week...maybe I should start taking my kids out more often...<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@...&quot; &lt;marbleface@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; It is unrealistic, if not cruel, to suggest that small children should sit quietly so as not to make noise for the old people downstairs. <br/>\n&gt; <br/>\n&gt; What&#39;s a PH and can one set of you move? How about some soundproofing? How about the grands getting out of the house more? <br/>\n&gt; <br/>\n&gt; As if it&#39;s not stressful enough having four small children to take care of. . .<br/>\n&gt; <br/>\n&gt; Nance<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vv_2b&quot; &lt;vib6750@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi all. I am new to this group and have been trolling for a few weeks now: getting a feel for the group and such.  I am a 32 yo mom of 4 kids, 5,6 and 2yo twins.  I have not felt the need to ask anything until now, and I am not sure if this is where I should be posting this, but I feel kind of lost, so here goes...<br/>\n&gt; &gt; <br/>\n&gt; &gt; I live in a PH in which my parents live in the basement apt. I live on the first floor with my family dh, kids and I.  My parents have made it very clear that my kids are extremely noisy and that their running and playing is unbearable. When they were younger I did not like for them to watch tv so much because of various reasons, but now as a result of their complaints the tv is on all of the time, in the hopes for me to minimize the noise - you know while they&#39;re watching it, they&#39;re not running...sometimes they go out side and play in our backyard and such but when they are inside and playing like normal children (of course it&#39;s loud there are a lot of them) they are bothersome to them. <br/>\n&gt; &gt; <br/>\n&gt; &gt; I try as hard as I can to not yell at my children, because I don&#39;t think that it&#39;s right to yell at them for playing normally, but the stress of their complaints are taking a lot out of me, and causing me to yell more than I&#39;d like.  When I tell my parents that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them and that I should hit them...I&#39;m so hurt.  Today, I took them to visit, and my mom was telling me to teach them to sit for 2 min at a time, while my dad told me that I don&#39;t know how to control my children.  I must clarify here and say that their school of thought with children is not mine, they are from another country where its normal to control and smack your kid&#39;s hands or butt, for doing something that they are not &quot;supposed&quot; to do like talk back, or run a lot - or things like that. Because I don&#39;t agree with this they think that I have no control over my children.  When I told my dad that I have a different approach to raising them, he says that they are going to be unruly people who run over me when they grow....and when I looked at my moms face, I saw her, mouthing something to him. I came back crying. Can anyone please offer me anything. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Thank you.<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335224505","msgId":48381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNHBicCtlMmhnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNDNjZitla3RrQGVHcm91cHMuY29tPg=="},"prevInTopic":48379,"nextInTopic":48382,"prevInTime":48380,"nextInTime":48382,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"... *************** Step back from the family aspects a bit and see it from another perspective: your downstairs neighbors are bothered by the noise. In most","messageBody":"<div id=\"ygrps-yiv-1285230897\">&quot;vv_2b&quot; &lt;vib6750@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I live in a PH in which my parents live in the basement apt. I live on the first floor with my family dh, kids and I.  My parents have made it very clear that my kids are extremely noisy and that their running and playing is unbearable.<br/>\n </span></blockquote>***************<br/>\n<br/>\nStep back from the family aspects a bit and see it from another perspective: your downstairs neighbors are bothered by the noise. In most shared housing situations, neighbors are expected to try and keep noise to a reasonable level, so as not to disturb one another. If your kids are doing a lot of running and tend to be boisterous, that may be normal kid behavior, but it&#39;s not courteous neighborly behavior for your living situation. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;When I tell [the neighbors] that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them and that I should hit them...<br/>\n </span></blockquote>**************<br/>\n<br/>\nOkay, so I changed &quot;my parents&quot; to &quot;the neighbors to highlight something: this is not a conversation to have with the neighbors! Your parenting isn&#39;t their business - but the noise level in their own home very much Is their business. Don&#39;t bring parenting issues into it. Apologize and look for solutions. <br/>\n<br/>\nAre there times they&#39;re regularly out? Times they prefer to sleep? Rooms they spend more time than others? Maybe you can curtail your kids activities to times which better accommodate the neighbors. At the same time, it doesn&#39;t sound like a great living situation - elderly people often find children disturbing, so a family living over an elderly couple isn&#39;t a great situation for Either family. Can you switch apartments? That alone could help a lot! If you need to share expenses, can you find a place that lets you live side-by-side rather than an over-under? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;the tv is on all of the time, in the hopes for me to minimize the noise - you know while they&#39;re watching it, they&#39;re not running.<br/>\n </span></blockquote>*************<br/>\n<br/>\nIs that helping? If so, look for more things you can do with the kids that don&#39;t involve running around being loud. Lets see, with kids 5 and under... what about things like pans of rice or sand, painting, gluing - lots of arts-n-crafts stuff? And things like legos and puzzles, computer and video games, books, building with cardboard boxes, cooking, hand sewing, puppets... hunt for &quot;rainy day activities&quot; or &quot;winter activities&quot; and see what you can come up with. There are plenty of options besides tv on the one hand and racing around shaking the neighbors&#39; ceiling on the other. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When I tell my parents that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them <br/>\n </span></blockquote>****************<br/>\n<br/>\nFrom their perspective, you don&#39;t! You&#39;re not Interested in controlling your kids the way your parents are thinking. They aren&#39;t interested in adopting your perspective any more than you are in adopting theirs, though. Changing their minds isn&#39;t one of the options.  <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First post with question","postDate":"1335207415","msgId":48379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzUyMDc0MTUuMzg1NzYuWWFob29NYWlsTmVvQHdlYjEyMDUwMi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":48378,"nextInTopic":48381,"prevInTime":48378,"nextInTime":48380,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"Hey there, First off, I m sorry you have to go through this.  It s a very difficult position for you to be in. Second off, take this with a grain of salt, but","messageBody":"<div id=\"ygrps-yiv-384523374\">Hey there,<br/>\n<br/>\nFirst off, I&#39;m sorry you have to go through this.  It&#39;s a very difficult position for you to be in.<br/>\n<br/>\nSecond off, take this with a grain of salt, but I&#39;ve been in similar situations with parents and in-laws and tried for many years to try and please everyone while protecting, raising my kids the best I could do and so I believe I can sympathize with how hurt and sad this situation can make you.  Been there, and tomorrow I turn 49, the two oldest children are grown and off on their own, leaving us (my spouse and I) with just the youngest (14yo) still unschooling at home.<br/>\n<br/>\nOur house took a serious toll during the years we tried to accommodate the parents and in-laws.  Looking back, I wish we would have found another way sooner.<br/>\n<br/>\nIs there anyway that the living conditions can be changed and you can move away?  Sometimes, distance is a blessing and with the ages of your children, you need to be able to be happy at home.  Sure, you can gain the &quot;quite&quot; your parents demand by many field trips to the parks and zoos and what-not, but that&#39;s asking a lot of a mom to do every day just so your parents can have the silence they wish for.  In my personal experience with elders, they aren&#39;t going to change nor get more understanding and accepting.  All being that close will end up doing, is cause your children to come to resent them.<br/>\n<br/>\n&quot;We can&#39;t play tag, or hide and seek because the grand-parents get mad when we move&quot;  &quot;We can&#39;t sing because they can hear us&quot;<br/>\n<br/>\nIt&#39;s really not worth it.  You will try hard to raise your kids while trying to keep the kids quiet enough to keep the grand parents from complaining and you will always come up short leaving yourself more tired and depressed.  Why put yourself through it?<br/>\n<br/>\nI don&#39;t mean to be pessimistic, but after years of trying to make it work with my own parents, sometimes distance is the only answer.  <br/>\n<br/>\nYou could try talking to your parents, but it sounds like they are already of the mind to tell you what you are doing wrong so you most likely won&#39;t get any where with it.<br/>\n<br/>\nThe only families that I&#39;ve seen be successful with the extended family, has been families where the grandparents are supportive, helpful, kind worded, and loving.  My spouse has said many times that our kids didn&#39;t get lucky with the grandparent lotto.  My spouse really wanted to have the extended family because he grew up with very loving grandparents so he didn&#39;t know they could ever not be,  But even the four years his mom lived with us, proved it can be a very bad thing and not all grandparents know how nor care to, be kind and generous with their love.<br/>\n<br/>\nThe only other thing I can think of for a faster solution if you can&#39;t find other accommodations, would be to ask if it&#39;s feasibly to switch living positions?  Put the elders above you all?  It wouldn&#39;t stop all the noise from traveling, but at least they wouldn&#39;t hear the pitter patter of little feet.  Asking small children or any children for that matter, to not run and bounce around is really ridiculous IMHO.<br/>\n<br/>\nGood luck and (((HUGS)))  <br/>\n<br/>\nPraying you can find a solution <br/>\n<br/>\n<br/>\nVicki<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: First post with question","postDate":"1335206026","msgId":48378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUyMjQ3RTdAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":48377,"nextInTopic":48379,"prevInTime":48377,"nextInTime":48379,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"If they were not your parents, but were regular tenants in an apartment that you owned, what would you do here? There definitely need to be reasonable","messageBody":"<div id=\"ygrps-yiv-262926536\">If they were not your parents, but were &#39;regular&#39; tenants in an apartment that you owned, what would you do here? There definitely need to be &#39;reasonable&#39; guidelines for noise - whether you have your parents there or it&#39;s just you and your family, there are times when some need to be quiet for others (as in, if your hubby needs to be asleep early to get up for work, or if one of the kids is sick, for example). Running, jumping, yelling kids at 6 am or 2 am would aggravate ME! So, how can you allow your kids to be kids, running and jumping and all, in a manner that would be considered reasonable by the average apartment dweller? For example, fabric wall hangings (pretty quilts and such) can help deaden sound.<br/>\n<br/>\nAlso, you mention they are from another country. How long have they been where you are? Do they have a community of friends, folks from &quot;back home&quot; wherever that is, that they get together with socially? Are they comfortable going out and about or are they anxious in a new place, not understanding well the language and customs? If their lives are feeling out of control, they are going to want to control as much as they can - which would be you and the kids. They may be struggle to make sense of this new, very different, place they&#39;re in. While you want to be very clear on the boundaries - you are parent to your kids, they aren&#39;t - also recognize that they need the same gentleness you would show to your husband and children. Maybe help them get to know the area and your kids away from &#39;home&#39; - take them to a park with you so they can see the kids run and play in an &quot;appropriate&quot; (in their mind - pretty much every culture has some &#39;kid&#39; space of some sort for play) location for running and playing.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: First post with question","postDate":"1335205578","msgId":48377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNDZzYSt1MGtxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpuNDNjZitla3RrQGVHcm91cHMuY29tPg=="},"prevInTopic":48376,"nextInTopic":48378,"prevInTime":48376,"nextInTime":48378,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"It is unrealistic, if not cruel, to suggest that small children should sit quietly so as not to make noise for the old people downstairs. What s a PH and can","messageBody":"<div id=\"ygrps-yiv-1918819093\">It is unrealistic, if not cruel, to suggest that small children should sit quietly so as not to make noise for the old people downstairs. <br/>\n<br/>\nWhat&#39;s a PH and can one set of you move? How about some soundproofing? How about the grands getting out of the house more? <br/>\n<br/>\nAs if it&#39;s not stressful enough having four small children to take care of. . .<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vv_2b&quot; &lt;vib6750@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all. I am new to this group and have been trolling for a few weeks now: getting a feel for the group and such.  I am a 32 yo mom of 4 kids, 5,6 and 2yo twins.  I have not felt the need to ask anything until now, and I am not sure if this is where I should be posting this, but I feel kind of lost, so here goes...<br/>\n&gt; <br/>\n&gt; I live in a PH in which my parents live in the basement apt. I live on the first floor with my family dh, kids and I.  My parents have made it very clear that my kids are extremely noisy and that their running and playing is unbearable. When they were younger I did not like for them to watch tv so much because of various reasons, but now as a result of their complaints the tv is on all of the time, in the hopes for me to minimize the noise - you know while they&#39;re watching it, they&#39;re not running...sometimes they go out side and play in our backyard and such but when they are inside and playing like normal children (of course it&#39;s loud there are a lot of them) they are bothersome to them. <br/>\n&gt; <br/>\n&gt; I try as hard as I can to not yell at my children, because I don&#39;t think that it&#39;s right to yell at them for playing normally, but the stress of their complaints are taking a lot out of me, and causing me to yell more than I&#39;d like.  When I tell my parents that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them and that I should hit them...I&#39;m so hurt.  Today, I took them to visit, and my mom was telling me to teach them to sit for 2 min at a time, while my dad told me that I don&#39;t know how to control my children.  I must clarify here and say that their school of thought with children is not mine, they are from another country where its normal to control and smack your kid&#39;s hands or butt, for doing something that they are not &quot;supposed&quot; to do like talk back, or run a lot - or things like that. Because I don&#39;t agree with this they think that I have no control over my children.  When I told my dad that I have a different approach to raising them, he says that they are going to be unruly people who run over me when they grow....and when I looked at my moms face, I saw her, mouthing something to him. I came back crying. Can anyone please offer me anything. <br/>\n&gt; <br/>\n&gt; Thank you.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":74011951,"authorName":"vv_2b","from":"&quot;vv_2b&quot; &lt;vib6750@...&gt;","profile":"vv_2b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"First post with question","postDate":"1335201999","msgId":48376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNDNjZitla3RrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48377,"prevInTime":48375,"nextInTime":48377,"topicId":48376,"numMessagesInTopic":0,"msgSnippet":"Hi all. I am new to this group and have been trolling for a few weeks now: getting a feel for the group and such.  I am a 32 yo mom of 4 kids, 5,6 and 2yo","messageBody":"<div id=\"ygrps-yiv-1086750425\">Hi all. I am new to this group and have been trolling for a few weeks now: getting a feel for the group and such.  I am a 32 yo mom of 4 kids, 5,6 and 2yo twins.  I have not felt the need to ask anything until now, and I am not sure if this is where I should be posting this, but I feel kind of lost, so here goes...<br/>\n<br/>\nI live in a PH in which my parents live in the basement apt. I live on the first floor with my family dh, kids and I.  My parents have made it very clear that my kids are extremely noisy and that their running and playing is unbearable. When they were younger I did not like for them to watch tv so much because of various reasons, but now as a result of their complaints the tv is on all of the time, in the hopes for me to minimize the noise - you know while they&#39;re watching it, they&#39;re not running...sometimes they go out side and play in our backyard and such but when they are inside and playing like normal children (of course it&#39;s loud there are a lot of them) they are bothersome to them. <br/>\n<br/>\nI try as hard as I can to not yell at my children, because I don&#39;t think that it&#39;s right to yell at them for playing normally, but the stress of their complaints are taking a lot out of me, and causing me to yell more than I&#39;d like.  When I tell my parents that I think it unfair to keep them sitting or laying down all day, they say that I don&#39;t know how to control them and that I should hit them...I&#39;m so hurt.  Today, I took them to visit, and my mom was telling me to teach them to sit for 2 min at a time, while my dad told me that I don&#39;t know how to control my children.  I must clarify here and say that their school of thought with children is not mine, they are from another country where its normal to control and smack your kid&#39;s hands or butt, for doing something that they are not &quot;supposed&quot; to do like talk back, or run a lot - or things like that. Because I don&#39;t agree with this they think that I have no control over my children.  When I told my dad that I have a different approach to raising them, he says that they are going to be unruly people who run over me when they grow....and when I looked at my moms face, I saw her, mouthing something to him. I came back crying. Can anyone please offer me anything. <br/>\n<br/>\nThank you.</div>","specialLinks":[]}],"prevTopicId":48393,"nextTopicId":48395}}