{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day, adjustments, and questions","postDate":"1136934332","msgId":8947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYxODREMzA5Njc5MUQwOThDN0Y0REVGRDMyNTBAcGh4LmdibD4=","referencesHeader":"PDIwMDYwMTEwMTgyMjU2LjkyMTMzLnFtYWlsQHdlYjU0NDAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":8944,"nextInTopic":8949,"prevInTime":8946,"nextInTime":8948,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"My daughter and I were playing Go to the Head of the Class the other night\n.. she loves games and it was what she picked out to play.  We got to a\nquestion","messageBody":"<div id=\"ygrps-yiv-276118928\">My daughter and I were playing &quot;Go to the Head of the Class&quot; the other night<br/>\n.. she loves games and it was what she picked out to play.  We got to a<br/>\nquestion for her and it had to do with draft dodgers and 10,000 of them<br/>\nbeing pardoned.  She didn&#39;t know what the draft was... so I explained. <br/>\nWhich made her interested... and when I asked her if she would like to learn<br/>\nmore she said yes.  So here is the spark that&#39;s leading us into American<br/>\nHistory at age 9.  I&#39;m quite excited to learn about it myself... I hated<br/>\nhistory in school because it was so boring... but now I&#39;m excited to see<br/>\nwhere this can lead us and what fun we can have with it.  (I have an<br/>\nAmerican history text/workbooks that I bought before I started unschooling,<br/>\nso I&#39;m thinking I may use them as a guide and find other ways to bring the<br/>\nhistory to life... any suggestions are welcome!!!)\r<br/>\n\r<br/>\nSo just play and have fun and interests will develop.  Pursue your own<br/>\ninterests!  Show our children that learning is fun!  Not something that we <br/>\nhave to&quot; do but something that we want to do. \r<br/>\n \r<br/>\nLesa\r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: Manisha Kher\r<br/>\nDate: 01/10/06 13:14:12\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: Re: [unschoolingbasics] First day, adjustments, and questions\r<br/>\n \r<br/>\nTina,\r<br/>\n\r<br/>\nHere are a few thoughts that I had while reading your\r<br/>\nmessage.\r<br/>\nI think you need to stop separating educational\r<br/>\nactivities from other activities. There&#39;s learning in\r<br/>\neverything, though it may not be the kind of learning\r<br/>\nthat can be easily measured. Instead of saying that\r<br/>\nthis is school, you could try thinking of it as a long\r<br/>\nvacation.\r<br/>\n\r<br/>\n--- Tina &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:poey@...\">poey@...</a>&gt; wrote:\r<br/>\n\r<br/>\n<blockquote><span title=\"ireply\"> &gt; \r<br/>\n&gt; So now for my questions.  The first one I hope\r<br/>\n&gt; doesn&#39;t cause too much controversy, and I realize\r<br/>\n&gt; there are several different opinions on this, but I\r<br/>\n&gt; would be interested in what works and why for\r<br/>\n&gt; different families.  What about TV and Video Games? \r<br/>\n&gt; Previously, during school days they weren&#39;t allowed\r<br/>\n&gt; to watch any tv or play video games (unless it was\r<br/>\n&gt; educational) until 3 pm or their school work was\r<br/>\n&gt; finished.  I don&#39;t like them watching a LOT of tv,\r<br/>\n&gt; or spending all day on video games, so even before\r<br/>\n&gt; school/on weekends and breaks they were not allowed\r<br/>\n&gt; to watch/play more than a certain amount of time a\r<br/>\n&gt; day.  I&#39;ve been reading about this, and it seems\r<br/>\n&gt; some people think you shouldn&#39;t interfere with\r<br/>\n&gt; tv/games at all, if they want to do that all day,\r<br/>\n&gt; let them, and some say get rid of the tv and games\r<br/>\n&gt; all together, or only allow educational stuff (we\r<br/>\n&gt; have both, it&#39;s just I always encouraged educational\r<br/>\n&gt; during &quot;school&quot; hours and the rest they could do\r<br/>\n&gt; during their own &quot;free&quot; time.  Now that these time\r<br/>\n&gt; periods no longer exist, ie school time is all the\r<br/>\n&gt; time and free time is all the time because school is\r<br/>\n&gt; free time, I&#39;m making adjustments).  Then there are\r<br/>\n&gt; some who still set limits on tv/game time.  I can\r<br/>\n&gt; see the merits of all three options, but would like\r<br/>\n&gt; more experiences to think over.  \r<br/>\n </span></blockquote>My rule of thumb about TV is that unless I&#39;m willing\r<br/>\nto spend time doing something with the kids, I don&#39;t\r<br/>\ninterfere. And even then they are free to choose TV.\r<br/>\nSo I may suggest baking and they may say, &quot;after this\r<br/>\nshow&quot;, and that&#39;s what we do. There are no time limits\r<br/>\nor rules about when they can watch. Some days they\r<br/>\nwatch a couple hours, other days it may be 5-6 hours.\r<br/>\nThey&#39;ve learnt a lot from watching various shows. We\r<br/>\nalso borrow a number of videos from the library and\r<br/>\nI&#39;ve learnt some interesting stuff from them.\r<br/>\n\r<br/>\n<blockquote><span title=\"ireply\"> &gt;Also, I&#39;m still a\r<br/>\n&gt; little bit shaky on the whole child-led/parent-led\r<br/>\n&gt; thing.  Like today, I asked if my son would like me\r<br/>\n&gt; to read him a MTH book, and he was allowed to choose\r<br/>\n&gt; yes or no, and then which book.  Is this child-led\r<br/>\n&gt; but parent guided?  Or is this just thinly vieled\r<br/>\n&gt; parent-led?  Is it okay to offer activities to\r<br/>\n&gt; introduce subjects that if they have interest in\r<br/>\n&gt; they can then move forward with them, or if not then\r<br/>\n&gt; go on their own way, as long as it&#39;s optional and\r<br/>\n&gt; not &quot;we are going to read about dinosaurs now&quot;?  \r<br/>\n </span></blockquote>This is a tricky issue. In general, I think it&#39;s fine\r<br/>\nto introduce stuff with the kids having the option to\r<br/>\nrefuse. However, it truly needs to be an option. If\r<br/>\nthe kids sense that you&#39;re going to feel bad when they\r<br/>\nsay no and hence they say yes, then it&#39;s not really a\r<br/>\nyes. If you&#39;re just coming out of a school-at-home\r<br/>\nsituation then you need to watch out for that. Could\r<br/>\nyour son have chosen a non MTH book? Would you have\r<br/>\nbeen happy with reading &quot;Captain Underpants&quot;? If not,\r<br/>\nthen your offering is very value-loaded offering and\r<br/>\nthe kids are going to sense that.\r<br/>\n\r<br/>\n  \r<br/>\n<blockquote><span title=\"ireply\"> &gt; I also read that some people make up a list of\r<br/>\n&gt; interests the children mention, either to keep track\r<br/>\n&gt; of them for researching, or to go to when they get\r<br/>\n&gt; in a slump of &quot;I&#39;m bored&quot;, they can refer to the\r<br/>\n&gt; list to find something to explore.  Is this a good\r<br/>\n&gt; idea, or does this get into parent-led?  And what if\r<br/>\n&gt; you are in the middle of one exploration of interest\r<br/>\n&gt; and another interest pops up?  For example, I was\r<br/>\n&gt; getting the supplies for the MTH crafts, and my son\r<br/>\n&gt; found a feather on my desk and was dragging it on\r<br/>\n&gt; the wall (and making a lovely blue mess) and when I\r<br/>\n&gt; asked him what he was doing, he said he was trying\r<br/>\n&gt; to make the feather into a pen like Harry Potter, so\r<br/>\n&gt; since I was already in the middle of preparing the\r<br/>\n&gt; pirate/ocean thing, I pulled out a notepad and wrote\r<br/>\n&gt; &quot;learn how to make quill pens&quot; on it so we would\r<br/>\n&gt; remember to come back to it.  Should I have dropped\r<br/>\n&gt; the pirate/ocean thing and done the quill thing then\r<br/>\n&gt; instead?  \r<br/>\n </span></blockquote>He may not necessarily be interested in learning to\r<br/>\nmake quill pens. Just trying to write with one. You\r<br/>\ncould&#39;ve offered some paper for him to write on. You\r<br/>\ncould&#39;ve yourself tried writing with the feather. I\r<br/>\nthink you&#39;re trying to make big learning projects from\r<br/>\nwhat could be fleeting interests.\r<br/>\n\r<br/>\nManisha\r<br/>\n\r<br/>\n__________________________________________________\r<br/>\nDo You Yahoo!?\r<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around \r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> \r<br/>\n\r<br/>\n\r<br/>\nSPONSORED LINKS Secondary school education Graduate school education Home<br/>\nschool education \r<br/>\nGraduate school education online High school education Chicago school<br/>\neducation \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nYAHOO! GROUPS LINKS \r<br/>\n\r<br/>\n Visit your group &quot;unschoolingbasics&quot; on the web.\r<br/>\n  \r<br/>\n To unsubscribe from this group, send an email to:\r<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>\r<br/>\n  \r<br/>\n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First day, adjustments, and questions","postDate":"1136923063","msgId":8944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxMTNqbitnZXM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMWMwMWM2MTRmYiRiZjAyOGNjMCQ1ZTA5NzcxOEBjb21wdXRlcj4="},"prevInTopic":8942,"nextInTopic":8947,"prevInTime":8943,"nextInTime":8945,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"I think you might end up getting a variety of answers based on where people are coming from (well duh no kidding) What I mean is that for us, TV/video games","messageBody":"<div id=\"ygrps-yiv-1013872354\">I think you might end up getting a variety of answers based on where <br/>\npeople are coming from (well duh no kidding) What I mean is that for <br/>\nus, TV/video games are a non-issue because DS has always had free <br/>\naccess - he&#39;s never been in school, had &#39;school time&#39; at home, none <br/>\nof that. So what things look like for us and what they look like at <br/>\nyour house, at least for a while, will be different. Odds are <br/>\nthey&#39;ll either stick to their usual &#39;regulations&#39; because they know <br/>\nthem, it&#39;s familiar territory OR they&#39;ll go hog-wild and watch/play <br/>\nas much as possible before &quot;mom regains her sanity&quot;. Instead of <br/>\ntelling them &#39;you can watch as much TV as you want&#39;, just say Yes <br/>\nwhen they want to watch TV. Say Yes when they want to watch a <br/>\nRoadrunner marathon all day (instead of something &#39;educational&#39;). <br/>\nSay Yes.<br/>\n<br/>\nIf you find something (book, movie, TV show, video game, restaurant, <br/>\ntoy, craft item, anything) that you think your child would like, <br/>\noffer it. For instance, I know that my DS likes to play in the <br/>\nbathtub. We have no rules that say he has to bath on a set schedule <br/>\nor anything. If I notice it&#39;s been a few days I might ask if he <br/>\nwants me to get a bath ready for him after dinner (or in the middle <br/>\nof an afternoon or whenever I think of it). He might say Sure! and <br/>\nhead to the tub, he might say No thanks, he might say Okay, after <br/>\nDaddy and I play Age of Empires. It&#39;s way more than a yes/no. It&#39;s <br/>\noffering something I think he might like. Same as if I see a movie <br/>\nthat DH might like is going to be on at 9 pm tonight, I&#39;ll set a <br/>\nreminder timer and ask if he&#39;d like to watch it. Rule of thumb for <br/>\nstarters (until it gets to be habit) is &#39;would I say this/do this <br/>\nwith my DH, best friend, other adult?&#39; If you are offering freely as <br/>\nyou would with another adult, great. If you stop and realize that <br/>\nno, you wouldn&#39;t do this with another adult because you&#39;ve got an <br/>\nagenda with it, then don&#39;t do it or rephrase it or whatever is <br/>\nappropriate.<br/>\n<br/>\nIf the list items are all the children&#39;s interests and they are <br/>\nchoosing them when they want, then you are simply facilitating. If <br/>\nyou say &quot;Okay you can&#39;t be bored Pick something&quot; then you&#39;re <br/>\nstarting to slide back over again. Boredom is not -always- bad. And <br/>\nsometimes it&#39;s not lack of stuff to do but a need for time to <br/>\nconnect with you, Dad, siblings. My DS will say he&#39;s bored when what <br/>\nhe wants is not stuff to do (he has tons of ideas for that) but <br/>\nrather he wants ME (or DH) to be with him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And what if you are in the middle of one exploration of interest <br/>\n&gt;and another interest pops up?  <br/>\n </span></blockquote>This is where lists are good - you can write it down as you did and <br/>\nget back to it - writing things down is a positive thing for my DS. <br/>\nHe knows if it&#39;s written down, it won&#39;t get lost in everything else <br/>\nthat may come up.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m just afraid if I have to instantly respond to every interest we <br/>\n&gt;will never get anywhere because it does take me some time to find <br/>\n&gt;the books, materials, research, etc.  How do you deal with this <br/>\n&gt;issue?  <br/>\n </span></blockquote>Make resources easier to get at for one. If jars seem to be a <br/>\nrecurring need/want, soak the labels off a bunch in one big swoop <br/>\nand stack them in an easily accessible box. Wash and soak the labels <br/>\noff of more as you get them. We&#39;ve got a whole box of clean and <br/>\nlabelless peanut butter and pasta sauce jars should we need them for <br/>\nanything. Likewise, make craft stuff like glue, scissors, feathers, <br/>\nbeads, craft sticks, etc all easily accessible so it takes 2 or 3 <br/>\nminutes rather than 20 or 30 minutes to get an activity together. If <br/>\nthere are recurring themes - for instance, if pirates come up often, <br/>\nkeep a big ziplock bag full of feathers, glue sticks, beads, <br/>\nbaubles, etc that you typically end up using for piratey crafts. <br/>\nThen just pull out the bag and you&#39;re off and running even faster. <br/>\nMake a section of bookcase that is just for pirates or just for <br/>\ndinosaur stuff or whatever - that way the kids can go pull out stuff <br/>\nreadily on their own - basically, include them in all the prep stuff <br/>\ninstead of doing it all yourself. Oh, and you don&#39;t have to respond <br/>\ninstantly to things by dropping what you&#39;re doing - respond <br/>\npositively &quot;hey that sounds like fun&quot; or &quot;we can do that after this&quot; <br/>\nis just as Yes as jumping from place to place like a flea at a dog <br/>\nshow.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Especially when I&#39;m in the middle of something myself and drop <br/>\n&gt;that to take care of his interest.  How do you deal with this?  <br/>\n </span></blockquote>Balancing needs is a whole other topic. When you&#39;re doing something <br/>\n(like elbows deep in dishes), there&#39;s no reason you can&#39;t say &quot;I&#39;ll <br/>\nbe done with the dishes in 5 minutes (or whenever, make it real, set <br/>\na timer if you tend to lose track of time) and I can do that then. <br/>\nMeanwhile, while I&#39;m finishing up, you can get out the (whatever) <br/>\nfrom the craft cabinet/jar supplies/etc so we&#39;ll be ready to go&quot;. <br/>\nAgain, bring them into the process of everyday living.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day, adjustments, and questions","postDate":"1136917376","msgId":8942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTEwMTgyMjU2LjkyMTMzLnFtYWlsQHdlYjU0NDAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMWMwMWM2MTRmYiRiZjAyOGNjMCQ1ZTA5NzcxOEBjb21wdXRlcj4="},"prevInTopic":8939,"nextInTopic":8944,"prevInTime":8941,"nextInTime":8943,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"Tina, Here are a few thoughts that I had while reading your message. I think you need to stop separating educational activities from other activities. There s","messageBody":"<div id=\"ygrps-yiv-826824675\">Tina,<br/>\n<br/>\nHere are a few thoughts that I had while reading your<br/>\nmessage.<br/>\nI think you need to stop separating educational<br/>\nactivities from other activities. There&#39;s learning in<br/>\neverything, though it may not be the kind of learning<br/>\nthat can be easily measured. Instead of saying that<br/>\nthis is school, you could try thinking of it as a long<br/>\nvacation.<br/>\n<br/>\n--- Tina &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:poey@...\">poey@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So now for my questions.  The first one I hope<br/>\n&gt; doesn&#39;t cause too much controversy, and I realize<br/>\n&gt; there are several different opinions on this, but I<br/>\n&gt; would be interested in what works and why for<br/>\n&gt; different families.  What about TV and Video Games? <br/>\n&gt; Previously, during school days they weren&#39;t allowed<br/>\n&gt; to watch any tv or play video games (unless it was<br/>\n&gt; educational) until 3 pm or their school work was<br/>\n&gt; finished.  I don&#39;t like them watching a LOT of tv,<br/>\n&gt; or spending all day on video games, so even before<br/>\n&gt; school/on weekends and breaks they were not allowed<br/>\n&gt; to watch/play more than a certain amount of time a<br/>\n&gt; day.  I&#39;ve been reading about this, and it seems<br/>\n&gt; some people think you shouldn&#39;t interfere with<br/>\n&gt; tv/games at all, if they want to do that all day,<br/>\n&gt; let them, and some say get rid of the tv and games<br/>\n&gt; all together, or only allow educational stuff (we<br/>\n&gt; have both, it&#39;s just I always encouraged educational<br/>\n&gt; during &quot;school&quot; hours and the rest they could do<br/>\n&gt; during their own &quot;free&quot; time.  Now that these time<br/>\n&gt; periods no longer exist, ie school time is all the<br/>\n&gt; time and free time is all the time because school is<br/>\n&gt; free time, I&#39;m making adjustments).  Then there are<br/>\n&gt; some who still set limits on tv/game time.  I can<br/>\n&gt; see the merits of all three options, but would like<br/>\n&gt; more experiences to think over.  <br/>\n </span></blockquote>My rule of thumb about TV is that unless I&#39;m willing<br/>\nto spend time doing something with the kids, I don&#39;t<br/>\ninterfere. And even then they are free to choose TV.<br/>\nSo I may suggest baking and they may say, &quot;after this<br/>\nshow&quot;, and that&#39;s what we do. There are no time limits<br/>\nor rules about when they can watch. Some days they<br/>\nwatch a couple hours, other days it may be 5-6 hours.<br/>\nThey&#39;ve learnt a lot from watching various shows. We<br/>\nalso borrow a number of videos from the library and<br/>\nI&#39;ve learnt some interesting stuff from them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Also, I&#39;m still a<br/>\n&gt; little bit shaky on the whole child-led/parent-led<br/>\n&gt; thing.  Like today, I asked if my son would like me<br/>\n&gt; to read him a MTH book, and he was allowed to choose<br/>\n&gt; yes or no, and then which book.  Is this child-led<br/>\n&gt; but parent guided?  Or is this just thinly vieled<br/>\n&gt; parent-led?  Is it okay to offer activities to<br/>\n&gt; introduce subjects that if they have interest in<br/>\n&gt; they can then move forward with them, or if not then<br/>\n&gt; go on their own way, as long as it&#39;s optional and<br/>\n&gt; not &quot;we are going to read about dinosaurs now&quot;?  <br/>\n </span></blockquote>This is a tricky issue. In general, I think it&#39;s fine<br/>\nto introduce stuff with the kids having the option to<br/>\nrefuse. However, it truly needs to be an option. If<br/>\nthe kids sense that you&#39;re going to feel bad when they<br/>\nsay no and hence they say yes, then it&#39;s not really a<br/>\nyes. If you&#39;re just coming out of a school-at-home<br/>\nsituation then you need to watch out for that. Could<br/>\nyour son have chosen a non MTH book? Would you have<br/>\nbeen happy with reading &quot;Captain Underpants&quot;? If not,<br/>\nthen your offering is very value-loaded offering and<br/>\nthe kids are going to sense that.<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; I also read that some people make up a list of<br/>\n&gt; interests the children mention, either to keep track<br/>\n&gt; of them for researching, or to go to when they get<br/>\n&gt; in a slump of &quot;I&#39;m bored&quot;, they can refer to the<br/>\n&gt; list to find something to explore.  Is this a good<br/>\n&gt; idea, or does this get into parent-led?  And what if<br/>\n&gt; you are in the middle of one exploration of interest<br/>\n&gt; and another interest pops up?  For example, I was<br/>\n&gt; getting the supplies for the MTH crafts, and my son<br/>\n&gt; found a feather on my desk and was dragging it on<br/>\n&gt; the wall (and making a lovely blue mess) and when I<br/>\n&gt; asked him what he was doing, he said he was trying<br/>\n&gt; to make the feather into a pen like Harry Potter, so<br/>\n&gt; since I was already in the middle of preparing the<br/>\n&gt; pirate/ocean thing, I pulled out a notepad and wrote<br/>\n&gt; &quot;learn how to make quill pens&quot; on it so we would<br/>\n&gt; remember to come back to it.  Should I have dropped<br/>\n&gt; the pirate/ocean thing and done the quill thing then<br/>\n&gt; instead?  <br/>\n </span></blockquote>He may not necessarily be interested in learning to<br/>\nmake quill pens. Just trying to write with one. You<br/>\ncould&#39;ve offered some paper for him to write on. You<br/>\ncould&#39;ve yourself tried writing with the feather. I<br/>\nthink you&#39;re trying to make big learning projects from<br/>\nwhat could be fleeting interests.<br/>\n<br/>\nManisha<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":248175779,"authorName":"nrskay","from":"&quot;nrskay&quot; &lt;k_bird@...&gt;","profile":"nrskay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First day, adjustments, and questions","postDate":"1136908621","msgId":8939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxMGxnZCsya2hlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjAwMWM2MTVhMiQ3MTc5NTRhMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":8934,"nextInTopic":8942,"prevInTime":8938,"nextInTime":8940,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"... TV he watches.  I actually feel better that way!  LOL! ... Tyra: Excellent, if we stop focusing on what we want them to do and just enjoy what they want to","messageBody":"<div id=\"ygrps-yiv-776345908\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I have also gotten to the point that I try not to focus on how much <br/>\n </span></blockquote>TV he watches.  I actually feel better that way!  LOL!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Much Love<br/>\n&gt; Tyra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Tyra:<br/>\nExcellent, if we stop focusing on what we want them to do and just <br/>\nenjoy what they want to do it becomes a lot easier to enjoy them.<br/>\n<br/>\nKay</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: First day, adjustments, and questions","postDate":"1136898457","msgId":8934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0UzRkRGNkM1MzlGMi0yOTQtRTAzMUBNQkxLLU0xMi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGRwdmJ1bytlY2pkQGVHcm91cHMuY29tPg=="},"prevInTopic":8933,"nextInTopic":8939,"prevInTime":8933,"nextInTime":8935,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"... From: queenpamedalah swombo@midsouth.rr.com I m with you on the video game thing.  I keep reading that the kids will walk away from it on their own","messageBody":"<div id=\"ygrps-yiv-900348320\">-----Original Message-----<br/>\nFrom: queenpamedalah <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:swombo@...\">swombo@...</a><br/>\n <br/>\nI&#39;m with you on the video game thing.  I keep reading that the kids <br/>\nwill walk away from it on their own eventually.  I&#39;ve seen a lot of <br/>\nGamecube time since we started homeschooling and I just keep my <br/>\nfingers crossed that the attraction will wear off over time. <br/>\n <br/>\n <br/>\n-=-=-=-<br/>\n <br/>\nWRONG attitude! Would you say that about reading? About doing science experiments? Logic puzzles?<br/>\n <br/>\n-=-=-=-=-=-<br/>\n <br/>\n I do sit down with them and play some each day, though. <br/>\n <br/>\n-=-=-<br/>\n <br/>\nGood. Better! &lt;g&gt;<br/>\n <br/>\nBut don&#39;t keep wondering when they will leave this activity. Embrace it! They&#39;re learnng. They&#39;re happy!<br/>\n <br/>\n <br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184851440,"authorName":"Tina","from":"&quot;Tina&quot; &lt;poey@...&gt;","profile":"raggedymommyof2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day, adjustments, and questions","postDate":"1136895668","msgId":8949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWEwMWM2MTVlMCQ1NjUwNTI4MCQ1ZTA5NzcxOEBjb21wdXRlcj4=","referencesHeader":"PDIwMDYwMTEwMTgyMjU2LjkyMTMzLnFtYWlsQHdlYjU0NDAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":8947,"nextInTopic":0,"prevInTime":8948,"nextInTime":8951,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"Manisha, Thanks for the suggestions.  My son does want to make and write with a quill pen though, he s mentioned it several times, including three times","messageBody":"<div id=\"ygrps-yiv-204879650\">Manisha, Thanks for the suggestions.  My son does want to make and write with a quill pen though, he&#39;s mentioned it several times, including three times yesterday.  I have the feathers, and I now have the instructions on how to cut them, I just need the ink.  He&#39;s big into Harry Potter, and has a journal where he writes to Harry regularly, and I think he wants the quill to feel more connected to him.  What bothered me was when he was trying to make a quill pen by scratching on my walls with a dyed feather, leaving blue scratches all over the place.  Hence the reason I wanted to make sure we got the proper instructions, so that he could achieve his goal without marring my walls (he wasn&#39;t intending to write on the walls, just using them to &quot;scratch&quot; the end of the feather into a pen point).  And actually I wrote &quot;learn how to make quill pens&quot; more for me to find out how to make one for him than &quot;lets make a project out of making quill pens&quot;.  I figured once we had the information he would decide if he wanted to make it, or have me make it for him.  I just wanted to make sure that I remembered I want to learn how to make them, rather than buy quill pens, as I tend to have lots of lists lying around.  I&#39;m sorry if I made it sound like I was planning a project for him just because he mentioned something he was interested in.  <br/>\n<br/>\nAs for the MTH book, if he would have wanted another book, yes, that would have been fine.  I was just suggesting it because it&#39;s something that has been &quot;put up&quot; for awhile so he needed to know it was available now.  In my previous &quot;school&quot; attitude, everytime I got a new resource it was put away until I planned a lesson or unit around it.  So we have a lot of books and materials that were put away and they didn&#39;t know they could get them out and use them now.  In retrospect it was stupid to put them away instead of using them as soon as the kids asked for them, but I was trained as a day care teacher so I had the &quot;must pre plan and link&quot; monster in my head.  They have been testing the limits I guess, my son asks to play video games as soon as he wakes up, today they drug out all the musical instruments and played as loud as they could until they ticked each other off, they dug through the science drawer and checked out the rock collection, the ant model, the mystery goo.  Sometimes it&#39;s difficult for me, but I let them go forward with it.  They had more interest in the Ocean encyclopedia book today (it&#39;s an Usborne book, not a big thick text), and we referred to the characters in Finding Nemo as we looked through the pictures.  We also read some Dora the Explorer and my daughter found a book about lying that she wanted to read and go over and talk about for a good 30 minutes.  I was somewhat surprised it held her interest that long.  We are also planning on building a museum table with our projects from the MTH club so people visiting can see them.  I just have to figure out something that will fit in the room, is solid enough to hold the exhibits (as one is glass), but won&#39;t attract the cats (as I don&#39;t want the cats knocking over the glass!!).  I also need to find a book that identifies rocks, as I can&#39;t remember what all the different ones are called.  <br/>\n<br/>\n°Ü°  Tina Rod.  °Ü°<br/>\n<br/>\nDysfunctional Domestic Diva<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183015595,"authorName":"Mother Earth (Tyra)","from":"&quot;Mother Earth &#92;(Tyra&#92;)&quot; &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: First day, adjustments, and questions","postDate":"1136869084","msgId":8933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjAwMWM2MTVhMiQ3MTc5NTRhMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGRwdmJ1bytlY2pkQGVHcm91cHMuY29tPg=="},"prevInTopic":8932,"nextInTopic":8934,"prevInTime":8932,"nextInTime":8934,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"With respect to TV and video games, I started off like you all.  I then let go of the limits and have found that after my son watched TV obsessively for a","messageBody":"<div id=\"ygrps-yiv-1279696366\">With respect to TV and video games, I started off like you all.  I then let go of the limits and have found that after my son watched TV obsessively for a number of weeks, his TV watching is down.  However, I have found that some of his TV watching is related to me not being connected.  Being connected means simply saying yes to participating in his activities rather coming up with something for him to do.  Something that we like to do together along with my ds2 who is 2.5 yrs is play Carmen Sandiego computer games.  We play for hours and have lots of fun.  Cooking is the other thing that we all mutually enjoy doing together.  When I am focused on other things too much, the TV watching goes up.<br/>\n<br/>\nI have also gotten to the point that I try not to focus on how much TV he watches.  I actually feel better that way!  LOL!<br/>\n<br/>\nMuch Love<br/>\nTyra<br/>\n<br/>\n  I&#39;m with you on the video game thing.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132501282,"authorName":"queenpamedalah","from":"&quot;queenpamedalah&quot; &lt;swombo@...&gt;","profile":"queenpamedalah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: First day, adjustments, and questions","postDate":"1136866072","msgId":8932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwdmJ1bytlY2pkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMWMwMWM2MTRmYiRiZjAyOGNjMCQ1ZTA5NzcxOEBjb21wdXRlcj4="},"prevInTopic":8915,"nextInTopic":8933,"prevInTime":8931,"nextInTime":8933,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"Man, oh, man...I hear you on the linear thing.  I m not overall that linear, but when my son opened up a math worksheet book (that I bought when I though we","messageBody":"<div id=\"ygrps-yiv-2063980261\">Man, oh, man...I hear you on the &quot;linear&quot; thing.  I&#39;m not overall <br/>\nthat linear, but when my son opened up a math worksheet book (that I <br/>\nbought when I though we were doing &quot;school at home&quot;) and started <br/>\nworking in the middle, I had to stop myself from telling him &quot;no.&quot;  <br/>\nAfter all, who cares?  He flipped around doing problems here and <br/>\nthere as they caught his interest and spent far longer working in <br/>\nthe book than I would have thought possible!  Had I made him start <br/>\nat the front, he would have been tortured after 1 minute, I&#39;m sure!  <br/>\nThe best part (he&#39;s 5) is that he figured out that many combinations <br/>\ncan equal the same thing.  (ie 4+1=5 and 3+2=5) So he started to <br/>\nsearch for all the combinations he could for various numbers.  It <br/>\nwas awesome to watch and more than I could have hoped to achiene in <br/>\na math &quot;lesson.&quot;<br/>\n<br/>\nI&#39;m too new to this unschooling life to offer too much advice. But <br/>\nafter reading your post, the one thing I will offer is - what feels <br/>\nright for you?  There really is no right and wrong... what WORKS for <br/>\nyou and doesn&#39;t stress you or your kids out?  If you&#39;re heading one <br/>\nway and you feel like you&#39;re imposing on your kids, don&#39;t go that <br/>\nway.  If you feel relaxed, happy and are enjoying your kids... I&#39;m <br/>\nbetting you&#39;re doing something that works - for YOU.<br/>\n<br/>\nI&#39;m with you on the video game thing.  I keep reading that the kids <br/>\nwill walk away from it on their own eventually.  I&#39;ve seen a lot of <br/>\nGamecube time since we started homeschooling and I just keep my <br/>\nfingers crossed that the attraction will wear off over time.  I do <br/>\nsit down with them and play some each day, though.  It&#39;s together <br/>\ntime and I try to lead the conversation to &quot;what do you think that <br/>\ncharacter should do&quot; or &quot;why do you think that one is blue&quot; etc.  I <br/>\nalso try to set the example of how to lose gracefully (yeah, I lose <br/>\na bit!) and how to applaud areas where they are good and help them <br/>\nunderstand how to improve skills in others (we play a lot of Mario <br/>\nParty 7 with various &quot;mini&quot; games.)  I had the best treat the other <br/>\nday.  I won a mini-game that I had failed times before and my 3 year <br/>\nold says to me &quot;I&#39;m so proud of you Mommy&quot; and pats me on the <br/>\nshoulder.  I said thank you but just wanted to crack up!<br/>\n<br/>\nSo good luck.  I&#39;ve called this a journey and that it is!  Best <br/>\nwishes on yours!<br/>\nPamela :)</div>","specialLinks":[]},{"userId":184851440,"authorName":"Tina","from":"&quot;Tina&quot; &lt;poey@...&gt;","profile":"raggedymommyof2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"First day, adjustments, and questions","postDate":"1136797476","msgId":8915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWMwMWM2MTRmYiRiZjAyOGNjMCQ1ZTA5NzcxOEBjb21wdXRlcj4=","referencesHeader":"PGRwdHM5dStnNzFsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":8932,"prevInTime":8914,"nextInTime":8916,"topicId":8915,"numMessagesInTopic":0,"msgSnippet":"Okay, today was our first official day of unschooling, and my kids are reacting like I took them to Toys R Us and told them to get whatever they wanted.","messageBody":"<div id=\"ygrps-yiv-1173181221\">Okay, today was our first &quot;official&quot; day of unschooling, and my kids are reacting like I took them to Toys R Us and told them to get whatever they wanted.  They keep saying &quot;This is school??  Really???  Wow, this is the best school day ever!!!&quot;  My son played video games this morning, and after lunch I started picking up and putting away the pile of school books I had gotten out last week to prep, and he saw me and said &quot;Are we going to do school now?&quot; I said &quot;You&#39;ve been doing school all morning.&quot;  He was surprised.  I told him that I was putting the books in the school room but that if he ever wanted to get one out to look at or do a page in, he could do that any time.  Then I asked him if he would like for me to read one of our Magic Tree House books, and he asked if we could do the craft project to go with it and I said sure.  We joined the Scholastic MTH club where each month they send you two books and two craft/activities to go with the books, but I&#39;ve been putting them away waiting until I had time to plan a whole unit around the subjects.  He wanted to do the pirate book, which is number 3 or 4 in the series, and my linear nature riled a bit.  I&#39;m a VERY linear person by nature, you start with 1 and go to 2 and so forth, but I realized that he was interested in pirates (not the dinosaurs that the first book is about), and although the underlying story line of the tree house is continuing story line, the basic story line of the books aren&#39;t, so it wouldn&#39;t really hurt to do the book he wanted first.  So I let go of that, and we started looking for the pirate kit (it&#39;s a treasure hunt game) and found the ocean kit (you make a little ocean life water globe thing, it goes with the dolphin book).  Nicole loves mermaids, so when she heard about there being an ocean kit, she wanted to do that one.  Kyle suggested we do her&#39;s first and his second, so we dig out the kits and the books.  I read the instructions on the Ocean kit and found out we needed a small jar (why don&#39;t I have any baby food jars???  I need to find some), so we raided the kitchen until we found a jar that would work.  I suggested that we read a little of the book while the jar soaked so we could remove the label, and they agreed that would work.  So we read two chapters (they are short), then checked the jar and the label was ready so we did the activity.  Now here is where my linear nature reared again, the idea of putting the dolphin book aside to do the pirate one kind of bothered me (when would we get back to the dolphin book??), but then it occurred to me we didn&#39;t have to read the pirate book, we could just do the activity and then read the book later.  Although so far it hasn&#39;t been an issue, as after we finished the ocean craft, the kids wanted to build a museum to keep their new ocean globe (aka the ocean life exhibit) in, so they needed blocks, and then they raided the garage for Little People for museum patrons and vehicles to become submarines to explore other sea life (something from the book).  I also set out our Usborn Encyclopedia of sea life (I pulled it out as a reference for the sea weed we had to draw and cut out of foam for the globe, and so if they had further interest it would be handy).  So far they haven&#39;t had more interest in it, other than asking me what some of the animals in the pictures of the coral reef were, but I figure it&#39;s out if they want to come back to it.  The pirate kit is also out in case they want to come back to it after they finish with their musuem.  So other than the old natures coming up a bit (but I kept them in check!!) I think I&#39;m doing pretty good so far.<br/>\n<br/>\nSo now for my questions.  The first one I hope doesn&#39;t cause too much controversy, and I realize there are several different opinions on this, but I would be interested in what works and why for different families.  What about TV and Video Games?  Previously, during school days they weren&#39;t allowed to watch any tv or play video games (unless it was educational) until 3 pm or their school work was finished.  I don&#39;t like them watching a LOT of tv, or spending all day on video games, so even before school/on weekends and breaks they were not allowed to watch/play more than a certain amount of time a day.  I&#39;ve been reading about this, and it seems some people think you shouldn&#39;t interfere with tv/games at all, if they want to do that all day, let them, and some say get rid of the tv and games all together, or only allow educational stuff (we have both, it&#39;s just I always encouraged educational during &quot;school&quot; hours and the rest they could do during their own &quot;free&quot; time.  Now that these time periods no longer exist, ie school time is all the time and free time is all the time because school is free time, I&#39;m making adjustments).  Then there are some who still set limits on tv/game time.  I can see the merits of all three options, but would like more experiences to think over.  Also, I&#39;m still a little bit shaky on the whole child-led/parent-led thing.  Like today, I asked if my son would like me to read him a MTH book, and he was allowed to choose yes or no, and then which book.  Is this child-led but parent guided?  Or is this just thinly vieled parent-led?  Is it okay to offer activities to introduce subjects that if they have interest in they can then move forward with them, or if not then go on their own way, as long as it&#39;s optional and not &quot;we are going to read about dinosaurs now&quot;?  Or should I totally wait until he asks &quot;can we read about pirates now?&quot;  Also, is it okay to read books they don&#39;t ask for, as long as I&#39;m not forcing them to sit there and listen to it?  Like the dolphin book we started today, is it okay if I ask him later if he wants to hear more of it, or maybe if I read him a chapter or two as a bedtime story, or do I need to wait until he asks to hear more of it?  (I have to say that will drive me crazy, I hate leaving books unfinished unless they are just awful and hard to get through.  Usually even then I&#39;ll finish it just to be done with it.)  I&#39;m trying to let them be to decide what they want to do (the MTH suggestion was the only thing I had done where I made a suggestion instead of just either letting them do their own thing, or working with them on something they asked for), I&#39;m just not sure how much should be completely on their shoulders, and how much I can suggest or put out there without interfering.  I also read that some people make up a list of interests the children mention, either to keep track of them for researching, or to go to when they get in a slump of &quot;I&#39;m bored&quot;, they can refer to the list to find something to explore.  Is this a good idea, or does this get into parent-led?  And what if you are in the middle of one exploration of interest and another interest pops up?  For example, I was getting the supplies for the MTH crafts, and my son found a feather on my desk and was dragging it on the wall (and making a lovely blue mess) and when I asked him what he was doing, he said he was trying to make the feather into a pen like Harry Potter, so since I was already in the middle of preparing the pirate/ocean thing, I pulled out a notepad and wrote &quot;learn how to make quill pens&quot; on it so we would remember to come back to it.  Should I have dropped the pirate/ocean thing and done the quill thing then instead?  I&#39;m just afraid if I have to instantly respond to every interest we will never get anywhere because it does take me some time to find the books, materials, research, etc.  How do you deal with this issue?  When my son heard that I would have to soak the jar to remove the label, he wanted to go play video games (we are talking a couple of minutes here, he would hardly have time to load up the game), and there have been times like this that he has asked to do one thing, and while I&#39;m preparing for that he asks to do something else &quot;real quick&quot; and then he never comes back to do the original activity.  I have to say this will get very frustrating quickly if I&#39;m going to be preparing for interests that won&#39;t even last long enough for me to get the supplies out, or rather that will constantly be pre-empted by other interests immediately after I&#39;m made aware of the first.  Especially when I&#39;m in the middle of something myself and drop that to take care of his interest.  How do you deal with this?  <br/>\n<br/>\nAnyway, it&#39;s been interesting, enjoyable in many ways, frustrating in a few others.  It&#39;s definately a difference, and a challenge to some of my normal ways of thinking. I haven&#39;t been able to read any of the books on this yet, so I&#39;m still learning, but it looks promising.  <br/>\n<br/>\n°Ü°  Tina Rod.  °Ü°<br/>\n<br/>\nDysfunctional Domestic Diva<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":8943,"nextTopicId":8925}}