{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Night Owls/Other Stuff","postDate":"1147730435","msgId":13215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0YXRtMysxMDd1akBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDQxMC0yMjAwNjUwMTQyMTQ5NTI4NzhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":13138,"nextInTopic":0,"prevInTime":13214,"nextInTime":13216,"topicId":13138,"numMessagesInTopic":0,"msgSnippet":"... I used to think like this, but putting myself in my children s shoes made me realize that I had unreasonable expectations.  For example, my son is 9 years","messageBody":"<div id=\"ygrps-yiv-935099552\"><blockquote><span title=\"ireply\">&gt; It is hard to interest him in much of anything else.<br/>\n&gt; Cindy<br/>\n&gt; South Carolina<br/>\n<br/>\n </span></blockquote>I used to think like this, but putting myself in my children&#39;s shoes <br/>\nmade me realize that I had unreasonable expectations.  For example, <br/>\nmy son is 9 years old.  He loves video games and playing with his <br/>\ntoys.  He also likes to read informational type books like Usborne <br/>\nand encyclopedias because he loves tidbits of information.  At <br/>\nfirst, I was concerned that he would grow up never moving beyond <br/>\nthose interests, but when I think back to what I was interested in <br/>\nat that age, I realize he&#39;s just a kid.  I wasn&#39;t thinking about <br/>\nlove, marriage and careers when I was a kid.  Those interests didn&#39;t <br/>\nsparkle within me until late teens.  Then I was so eager to get a <br/>\njob and get a car, and my own apartment.  Basically, I was ready for <br/>\nadult responsibilities and had no interest in staying a dependent <br/>\nchild in my mom&#39;s house.  I did what I had to do to satisfy my wants.<br/>\n<br/>\nMy oldest will soon be 14 and I&#39;m amazed at her growth in the last <br/>\nfew years.  She&#39;s literally a young lady!  She sometimes gets <br/>\nannoyed at her little sister, my dd8, but I just laugh because the <br/>\nlittle one isn&#39;t acting any different from how the older one acted <br/>\nat the same age.  So I know that everything is going to be just <br/>\nfine.  In fact, my dd14 is already thinking about what kind of car <br/>\nshe&#39;s going to get when she turns 16 and gets her license.  Ack!  <br/>\n*lol*<br/>\n<br/>\nOne thing I&#39;ve discovered is if I begin to show an interest in <br/>\nsomething, I just dive in and my children follow along most of the <br/>\ntime.  But if I were to just hand them something and suggest they do <br/>\nit, they&#39;d likely think it was boring and stupid.  They have to see <br/>\nme having fun to realize that I don&#39;t always choose to do boring <br/>\nthings.  (They think my love of baths and reading is pretty lame.  <br/>\n*laugh*)<br/>\n<br/>\nMy ds9 is calling me into his room to see his newest creation.  He <br/>\nset up a car dealership and named it Wheel Deals.  *rofl*  We <br/>\npurchased a new used car this weekend and he had a blast running <br/>\naround the car lot.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":246344104,"authorName":"Cindy Snyder","from":"&quot;Cindy Snyder&quot; &lt;cindy.snyder@...&gt;","profile":"hdwolfwoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: Night Owls/Other Stuff","postDate":"1147643392","msgId":13138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMC0yMjAwNjUwMTQyMTQ5NTI4NzhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":13215,"prevInTime":13137,"nextInTime":13139,"topicId":13138,"numMessagesInTopic":0,"msgSnippet":"Hey Everyone I am new here and have been just lurking for a few days.  My son is 11 and we started unschooling just this year right before Christmas.  So far","messageBody":"<div id=\"ygrps-yiv-1380426331\">Hey Everyone<br/>\nI am new here and have been just lurking for a few days.  My son is 11 and we started unschooling just this year right before Christmas.  So far so good.  Our house is soooo much more relaxed now.   I had to comment on the night owl thing.  My son is a night owl.  Always has been.  When he went to PS, from Kindergarden on,  it was a fight to get him to bed at night and a fight to get him up each morning.  He has always been this way.  Now, he goes to bed around 10:30-11:00 ....and later and gets up around 9:30-10:00 or so. <br/>\n<br/>\nI had a hard time at first with just &quot;letting him&quot; do his own thing.  But I am getting better at it. He plays a lot of video games and computer games, online and off, surfs the net, etc.  (He says he wants to be a video game tester.)  It is hard to interest him in much of anything else.  He doesn&#39;t care to read for pleasure (like chapter books ) very much, but will read game cheats, dueling cards and that sort of thing.  Some comic books too. At least he reads!  He is very easily bored and frustrated though and jumps from one thing to another and that worries me some.  I would love it if he could be as focused as the boy with the origami....I think I will see if I can&#39;t entice him into trying out origami.  I think it might be fun for both of us.<br/>\n<br/>\nThanks to all of you who run this list and others like it.  I notice a lot of the same names on other lists I am on. I appreciate your help.<br/>\n<br/>\nCindy<br/>\nSouth Carolina<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: trektheory <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: 5/14/2006 5:21:41 PM <br/>\nSubject: [unschoolingbasics] Re: Gushing and a question<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; I&#39;ve got teens that stay up all night lotsa times, so we definitely<br/>\n&gt; don&#39;t follow &quot;normal&quot; sleep patterns.<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt;<br/>\n<br/>\n<br/>\nSomething I&#39;ve wondered about for ages -- this idea that teens all <br/>\nturn into night owls and need to sleep all morning.  I&#39;ve heard (not <br/>\nhere, but haven&#39;t heard teen sleep discussion here, either) some <br/>\npeople more or less say that it is a teen thing.  But I have my <br/>\nsuspicions otherwise -- I think it is an individual thing, that with <br/>\nour modern society (electric lights, computers, etc.) to aid it, <br/>\nmakes it more obvious. <br/>\n<br/>\nMy son and I are both morning people.  I can&#39;t remember not being <br/>\non -- even as a teen, and my son, at 14, still is, and has been <br/>\nsince more or less birth.  (He used to cluster feed and then conk <br/>\nout for his &quot;long&quot; (2.5 hours, vs 2...) sleep of the night at 8pm <br/>\nfrom when he was a newborn.  He used to deny that he was a morning <br/>\nperson, but a few months ago, finally realized that if he wants to <br/>\nsuccessfully figure out a problem in a game, he is far better off if <br/>\nhe does it in the morning than at 9 at night!<br/>\n<br/>\nBut I also realize that when they hit puberty (and my son hasn&#39;t <br/>\nyet), bodies go through big changes, and the sleep need generally <br/>\nincreases.  For those with teens, have you seen changes in sleep <br/>\npatterns?  Particularly if you have/had a morning person kid?<br/>\n<br/>\nThanks.<br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSPONSORED LINKS Secondary school education Graduate school education Home school education <br/>\nGraduate school education online High school education Chicago school education <br/>\n<br/>\n<br/>\n<br/>\nYAHOO! GROUPS LINKS <br/>\n<br/>\n Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n  <br/>\n To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13029,"nextTopicId":13217}}