{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Further discussion . . . please","postDate":"1272426064","msgId":43796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZERDI5QzNDNTVFRDRCQzg4NTg0MENFQkI0MUI3QzMzQENvbm5pZVBDPg==","inReplyToHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg=="},"prevInTopic":43792,"nextInTopic":0,"prevInTime":43795,"nextInTime":43797,"topicId":43786,"numMessagesInTopic":0,"msgSnippet":"... How do you remove him? Do you announce, You have two choices. You can let your brother go or you can let me come and physically remove you. ? That gives","messageBody":"<div id=\"ygrps-yiv-1063059114\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;My method of intervention is not improving, however, and this is where I really Need further discussion. At the minute, I&#39;ll remove him from his brother and often he will simply do it again. I repeat this, letting him know it&#39;s not on, his brother is not enjoying it. This might repeat a few times, until he loses it with me for physically handling him. &quot;I&#39;ll do what I want -- it&#39;s my body.&quot; He has always Hated people touching/handling him without permission; fair enough. I Know he feels he has been treated unjust.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>How do you remove him? Do you announce, &quot;You have two choices. You can let your brother go or you can let me come and physically remove you.&quot;? That gives him fair warning that you are going to physically remove him. <br/>\n<br/>\nWhat do you do after he has been removed from his brother? Do you try to talk to him? Do you put him down and walk away and go about whatever it is you were doing? Once you remove him from his brother, you need to follow through and actively engage him until his unmet need has been met. I am guessing that his unmet need could be your attention, more physical activity, or attention from his sibling. I have told my older girls that if they want/need to rough house, they can do it with me or my husband so that they don&#39;t hurt/annoy their siblings. Some of the time, they genuinely do want their sibling&#39;s attention. If that is the case, you have to get creative to find ways for them to be together in ways that will respect all of their physical/emotional needs. <br/>\n<br/>\nI wonder what would happen if you changed the dynamic when you saw this happening. How would your son react if you said, &quot;That&#39;s it, I am going to come tickle you (or something equally absurd)?&quot; rather than focusing on the fact that he is hurting/annoying his brother. We have diffused a lot of situations by using the completely absurd to our advantage. Use your imagination and come up with something that will completely take him off guard and potentially make him laugh. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I don&#39;t Want to have to physically remove him, but it has to happen, right?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Ideally, you can get him to quit without resorting to the physical. If you can&#39;t, then yes, it has to happen. Both children need to be protected and kept safe even if that means you have to physically remove a child. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&quot;Why do it? You Know it frustrates your brother.&quot; I need some help changing my perspective *In The Moment*. Maybe something fresh and new will help break the cycle.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Turn this around and ask yourself, &quot;Why do you continue to do the same thing? You know it isn&#39;t working.&quot; Yes, it frustrates his brother but more importantly, it frustrates you and gets your attention. That could be precisely why he does it. He is a middle child and gets lost in the shuffle all too often. <br/>\n<br/>\nPerhaps you or somebody else needs to rough house with him more. Some kids just need more physical attention. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Further discussion . . . please","postDate":"1272404495","msgId":43792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyN2xtZis4a2pqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg=="},"prevInTopic":43789,"nextInTopic":43796,"prevInTime":43791,"nextInTime":43793,"topicId":43786,"numMessagesInTopic":0,"msgSnippet":"... Still on the issue of torment, he has taken to grabbing/smothering his 2 y/o brother.  I think he Loves hearing him shriek loudly for him to STOP , but he","messageBody":"<div id=\"ygrps-yiv-193358404\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kathryn&quot; &lt;kathryndubay@...&gt; wrote:<br/>\nStill on the issue of torment, he has taken to grabbing/smothering his 2 y/o brother.  I think he Loves hearing him shriek loudly for him to &quot;STOP&quot;, but he continues with a giggle until his brother is enraged <br/>\n******************<br/>\n<br/>\nOne thing for you to work on is taking the word &quot;torment&quot; out of your vocabulary. See him as having big needs for stimulation. A screaming, struggling person provides a Lot of stimulation - that doesn&#39;t make it appropriate! but it means your 5yo&#39;s Need is bigger in that moment than his empathy or reason. So don&#39;t try to reason with him or elicit empathy in those moments - that&#39;s for later (or earlier) outside of the moment. <br/>\n<br/>\nTalk about knowing he&#39;s a loving person who wants to play with his brother *and* that his brother wants to not be hurt or scared. Come up with a plan together for how you can handle it next time and try it out. Revist the plan later. Even if he&#39;s not 100% happy with the solution in the moment - when he&#39;s all worked up and doesn&#39;t want to stop what he&#39;s doing - having a discussion and a plan lets him be a part of the process. Its not Just something you do To him, its something he&#39;s helping figure out. <br/>\n<br/>\nGiven that he has a big need for stimulation, part of the &quot;how can we handle this&quot; plan should probably involve coming up with alternatives to suggest for him to do in the moment - and those may well be things to do With You or his dad if he&#39;s available. <br/>\n<br/>\nWhen things *aren&#39;t* working and you&#39;re both getting frustrated, one thing to keep in mind is: Appologise! Let him know as best you can that you&#39;re not happy with the solution, either, you just can&#39;t find a better on in the moment.<br/>\n<br/>\nConnie&#39;s reply to your previous post is also worth considering - make sure, at the same time, you&#39;re looking for ways for him and his younger brother to play that they are both okay with. If the little onw likes any rough-housing at all, find ways for that to happen safely, also see if the little one likes any kind of &quot;keep away&quot; game, since those tend to involve lots of shrieking (shudder... get ear plugs if you need to!). <br/>\n<br/>\nMost of all, keep in mind that there likely won&#39;t be One solution - what you&#39;re looking for is a set of better tools, a way to create more options. Bringing him into that search for tools is really important because, ultimately, these are tools for Him - he needs to know what sorts of things are going to work for him when he&#39;s bouncing off the walls.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16) </span></blockquote></div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike haupt","from":"&quot;Ulrike haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Further discussion . . . please","postDate":"1272388873","msgId":43789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg=="},"prevInTopic":43788,"nextInTopic":43792,"prevInTime":43788,"nextInTime":43790,"topicId":43786,"numMessagesInTopic":0,"msgSnippet":"Hi Kathryn ve been listening to some amazing information recently. It s called Empowered Parenting and is a teleclass given by Karen Curry. he talks about","messageBody":"<div id=\"ygrps-yiv-123580628\">Hi Kathryn<br/>\n <br/>\n&#39;ve been listening to some amazing information recently. It&#39;s called<br/>\n&quot;Empowered Parenting&quot; and is a teleclass given by Karen Curry. he talks<br/>\nabout the five needs of childrena and how, whehn these needs are not met<br/>\nappropriately the children will resort to expriencing the inappropriate<br/>\ngoals which are expressed in misbehaviour. Also in the class she teaches how<br/>\nto diagnose as parents which need is not met and gives strategies to address<br/>\nthe needs. This information has been life changing for me and my youngest<br/>\ndaughter already.<br/>\n <br/>\nThe behaviour of your little one &#39;looks&#39; like the mistaken goal of revenge,<br/>\nthough I may be wrong  This &#39;goal&#39; indicates that the child may feel unloved<br/>\nor not valuable/belonging. The strategy is to switch as parent to looking<br/>\nfor all the lovable aspects in the child. It is not necessarily a short term<br/>\nsolution.<br/>\n <br/>\npem me if you want the url for the empowered parenting classes.<br/>\n <br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa <br/>\n <br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature<br/>\ndatabase 5065 (20100427) __________<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a></div>","specialLinks":[]},{"userId":304719992,"authorName":"Vickie","from":"Vickie &lt;vickbaron@...&gt;","profile":"vickbaron","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Further discussion . . . please","postDate":"1272384797","msgId":43788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NDkyNC4zMTExNC5xbUB3ZWI4MTAwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg=="},"prevInTopic":43787,"nextInTopic":43789,"prevInTime":43787,"nextInTime":43789,"topicId":43786,"numMessagesInTopic":0,"msgSnippet":"... simply do it again.  I repeat this, letting him know it s not on, his brother is not enjoying it.  This might repeat a few times, until he loses it with me","messageBody":"<div id=\"ygrps-yiv-1805053820\"><blockquote><span title=\"ireply\">&gt;&gt;At the minute, I&#39;ll remove him from his brother and often he will <br/>\n </span></blockquote>simply do it again.  I repeat this, letting him know it&#39;s not on, his <br/>\nbrother is not enjoying it.  This might repeat a few times, until he <br/>\nloses it with me for physically handling him.  &quot;I&#39;ll do what I want -- <br/>\nit&#39;s my body.&quot;  He has always Hated people touching/handling him without permission; fair enough.  I Know he feels he has been treated unjust.  I don&#39;t Want to have to physically remove him, but it has to happen, <br/>\nright?&lt;&lt;<br/>\n<br/>\nHave you tried removing the little brother, instead of physically handling big brother? I know it helps with my two (3yrs and 15mos), if I focus more on &quot;saving&quot; the little one, without saying anything. I just swoop in and grab my ds before his big sister can give in to her desire to push him over, crash into him, kick him, etc. Of course, I can&#39;t always get there before an injury occurs, but even if I&#39;m a bit late, I still just pick up ds and find something for us to do so we can give dd some space. It seems like she appreciates the space and is better equipped to deal with ds after she gets her space for a bit. And I figure, whether I say anything to her about what she&#39;s done or not, it isn&#39;t going to prevent her from doing it in the future. Someday she will understand, but she won&#39;t have lots of memories of me telling her not to. Sometimes, just minutes after she has tried to kick him over, she will give him a very sweet and heartfelt hug. I wonder if<br/>\n I handled things differently by trying to explain why kicking is wrong, if she might not be as affectionate toward him.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Further discussion . . . please","postDate":"1272382903","msgId":43787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5Q0NGNzI3NkU4OTRDNkY5NTY5MTlFQjlDODUwRjQ1QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg=="},"prevInTopic":43786,"nextInTopic":43788,"prevInTime":43786,"nextInTime":43788,"topicId":43786,"numMessagesInTopic":0,"msgSnippet":"Some kids have a bigger need for direct attention.  He gets your direct attention if he annoys his siblings.  He s telling you really plainly what he needs.","messageBody":"<div id=\"ygrps-yiv-392401932\">Some kids have a bigger need for direct attention.  He gets your direct attention if he annoys his siblings.  He&#39;s telling you really plainly what he needs.     He probably lost a lot of direct attention from you when the baby came.   It&#39;s hard to have a baby around taking up all of mom&#39;s energy and time.  <br/>\n<br/>\nAnd some kids have higher energy levels.   Some parents have the luxury of kids with similar physical energy levels and the kids can play together well.  It sounds like your daughter&#39;s need for long physical play is not as great as your son&#39;s need.   <br/>\n<br/>\nMy suggestion is for you to do all you can to engage him in physical play as often as you can.  Be directly with him and be doing something really physical.  Jump on a trampoline with him.  Chase him in the yard or let him chase you.  Kick a ball. Run around the block.  Do that as much as you can.  Not as much as you think he ought to need but as much as he really needs.  <br/>\n<br/>\nIt probably won&#39;t be convenient for you to work out how you can be with him in sustained physical play and take care of your other kids but if you put the energy you are using now to keep the peace into finding ways to help him it will be a better use of your energy.  <br/>\n<br/>\nPam Sorooshian has written about the very high energy level of one of her kids and I&#39;ll look for that and bring it here.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Further discussion . . . please","postDate":"1272369652","msgId":43786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyNmpsaytqOHRkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43787,"prevInTime":43785,"nextInTime":43787,"topicId":43786,"numMessagesInTopic":0,"msgSnippet":"Hello All, I recently posted about my 5 y/o DS and his continual torment of his sister during quiet times of the day.  I got some Great advice in return, and","messageBody":"<div id=\"ygrps-yiv-165263725\">Hello All,<br/>\n<br/>\nI recently posted about my 5 y/o DS and his continual torment of his sister during quiet times of the day.  I got some Great advice in return, and have applied some of the Sensory Diet suggestions  -- hand clapping/body rolling/full body involvement activities certainly redirect his energies in a positive way, whilst still able to (say) watch TV together.  Tonight, we were doing hand stands against the wall and seeing how long we could balance unaided while watching his Dad play Gears of War.  All good!    <br/>\n<br/>\nI&#39;d like some further discussion please, on the moments where redirection isn&#39;t possible.  Still on the issue of torment, he has taken to grabbing/smothering his 2 y/o brother.  I think he Loves hearing him shriek loudly for him to &quot;STOP&quot;, but he continues with a giggle until his brother is enraged to the point of (in recent days) biting.  My method of intervention is not improving, however, and this is where I really Need further discussion.  At the minute, I&#39;ll remove him from his brother and often he will simply do it again.  I repeat this, letting him know it&#39;s not on, his brother is not enjoying it.  This might repeat a few times, until he loses it with me for physically handling him.  &quot;I&#39;ll do what I want -- it&#39;s my body.&quot;  He has always Hated people touching/handling him without permission; fair enough.  I Know he feels he has been treated unjust.  I don&#39;t Want to have to physically remove him, but it has to happen, right?  So I suppose my question is this:  how do I best respond to such situations?  How would you deal with it?  In these moments where intervention is unavoidable, how do I Best deal with it?  I&#39;m not at all happy with my ill-feelings towards him during these moments.  I&#39;ll even verbalise it, in a frustrated way, &quot;Why do it?  You Know it frustrates your brother.&quot;  I need some help changing my perspective *In The Moment*.  Maybe something fresh and new will help break the cycle.<br/>\n<br/>\nThanks in advance,<br/>\n<br/>\nKathrynD<br/>\nx</div>","specialLinks":[]}],"prevTopicId":43783,"nextTopicId":43798}}