{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":304745245,"authorName":"Judy R","from":"&quot;Judy R&quot; &lt;jroberts@...&gt;","profile":"jlouiser","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] dealing with my anger and my 4yr old daughter","postDate":"1212601849","msgId":33499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDQkNENTVGNzlCMTRFQjdBNzhCODNDRDA3RjYxNzQ0QGp1ZHlQQz4=","inReplyToHeader":"PGcyNmFuNyt1NTJ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGcyNmFuNyt1NTJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":33494,"nextInTopic":0,"prevInTime":33498,"nextInTime":33500,"topicId":33487,"numMessagesInTopic":0,"msgSnippet":"I didn t unschool when my kids were this young - it developed later for us, so hopefully some people with kids the same age will have more helpful advice than","messageBody":"<div id=\"ygrps-yiv-1489756547\">I didn&#39;t unschool when my kids were this young - it developed later for us, so hopefully some people with kids the same age will have more helpful advice than mine - however, here&#39;s my shot at it.<br/>\n<br/>\nI&#39;m guessing this means you have set bedtimes - is that necessary do you think?  Perhaps there could be free-choice bed-times, or falling asleep wherever they are, and read at other times - disconnect the two things, maybe no bedtime routine?  As I say, someone with kids the same age will need to respond to what they do around bedtimes.<br/>\n<br/>\nThe other thing I thought of is the PET thing; The book &quot;How to Talk so Kids will Listen and How to Listen so Kids will Talk&quot; has some good ideas about this kind of thing.<br/>\n - some time other than while it is going on, talk to your daughter - it&#39;s a kind of unraveling of her thoughts until you get to what is really bothering her about the whole thing - so you say something like - &quot;It seems like you don&#39;t like it when I read to your brother at night..&quot; and then whatever she says, you reflect it back &quot;So  you don&#39;t like it when you have to wait for me to finish reading before taking care of you&quot;... or whatever - <br/>\n<br/>\nand whatever they say is *totally* acceptable, so don&#39;t do it when your son is around because they may want to say things like &quot;I hate Jimmie and wish he was dead&quot; and you have to be ready to hear that and not react with &quot;You don&#39;t really mean that&quot; - you don&#39;t argue or use it as a point of lecturing them or anything, you just keep reflecting it back. In fact, you might want to prepare ahead of time and think about what you *will* say if she says something like that - you&#39;re not really supposed to &quot;interpret&quot; for them, but you might say something like &quot;You wish mommy spent more time with you instead of Jimmie&quot; - which doesn&#39;t mean you&#39;re going to do that, just that you are trying to get at her feelings.  The idea is that it allows them to express whatever it is that bothering them and that often that is enough for them, that you have heard them and acknowledged their feelings (that&#39;s how it works in the book anyway!) <br/>\n<br/>\n - and also go through the same thing with your son - <br/>\n<br/>\nYou could also try getting them to brainstorm a solution together: &quot;OK, we have this problem - what do you guys think we could do about it&quot; and you write down their suggestions - you can limit it to non-viloent or something - maybe say it&#39;s not OK to say &quot;drown Jimmie in the bathtub&quot; but allow silly tings like &quot;Maybe our fairygodmother will come and put us all to sleep&quot;, whatever - and once you have  a list, you go back through it and cross out anything that one or the other doesn&#39;t agree to - *hopefully* at the end you have at least one thing they both agree with - if not, you have to go again. And it might not work at all, so you just say, OK this isn&#39;t working we&#39;ll have to try something else.<br/>\n<br/>\nAnyway, BEST OF LUCK!!!!!  Judy R<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n  From: Julie <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, June 04, 2008 11:00 AM<br/>\n  Subject: [unschoolingbasics] dealing with my anger and my 4yr old daughter<br/>\n<br/>\n<br/>\n  I asked this q and was advised to post it here. I am desperate and<br/>\n  need some feedback from experienced unschoolers...I am very new to<br/>\n  this and moving slowly....I think it is me who needs the most<br/>\n  unschooling...<br/>\n  My daughter is 4, I have 2 other children...a 7yr old son and a 1yr<br/>\n  old daughter. My problems are mostly with my 4yr old daughter. She is<br/>\n  a child that needs lots of attention, and goes through periods where<br/>\n  nothing I do is right. She demands service &quot;get me a drink&quot;. I<br/>\n  explain that asking politely makes me feel much more like doing it. <br/>\n  Story time at night is my biggest issue....I end up losing it<br/>\n  completely and being really horrible to her. Generally it goes like<br/>\n  this. Bubba is tired, and happy to bf while I read to the<br/>\n  others(although this is starting to change and she is wanting her<br/>\n  books too). My 7yr old is happy to wait for his story/chapter. My<br/>\n  4yr old has 2-4stories and tonight a back scratch too, fairly<br/>\n  uninterrupted by bubba (but not always the case). Then it is my sons<br/>\n  turn for his chapter or 2....my 4yr old starts...chatting, jumping on<br/>\n  the bed, asking 7yr old if he wants to play, fight....etc I explain<br/>\n  calmly that she has had her stories, and her brother now wants to hear<br/>\n  his story...he has been quiet and patient, and now it is her turn to<br/>\n  be quiet and let him have his turn. We all share the same room and<br/>\n  beds...by their choice. I attempt to read again.....almost instantly<br/>\n  the chatter, jumping, noise starts again....this goes on and on...me<br/>\n  talking about respecting her brothers turn as he did hers, that it is<br/>\n  hard to read with all the noise and jumping......A 10min read often<br/>\n  takes an hour or more! I get to a point where I let her know I am<br/>\n  getting really cross and her brother also tells her to be quiet. It<br/>\n  continues....I eventually loose it and start yelling and screaming. <br/>\n  Tonight my son asked if it would be easier if he had his turn<br/>\n  tomorrow....he has more patience than me often! I ended up putting my<br/>\n  daughter out of the room to finish the chapter, she screamed and<br/>\n  screamed and I got more wild! I told her it was her last chance to<br/>\n  stay quiet ( we had only got through a couple of paragraphs by now). <br/>\n  My son ended up in tears, as did my 4 yr old because I got so angry I<br/>\n  must have looked like a crazy woman...he said it always ended up with<br/>\n  a short read for him in between me and my daughter having a fight! <br/>\n  How do I get it clear to my 4yr old that she is being unfair??<br/>\n  When I am calm I can see the following:<br/>\n  My 4yr old is tired and wants her bf and doesn&#39;t want to wait.<br/>\n  She is not interested in his stories.<br/>\n  She doesn&#39;t know what to do while waiting....and is naturally an<br/>\n  active child.<br/>\n  I need help at bed time with story reading so all are getting their<br/>\n  fair share (on the odd occasion my partner will read to the 4yr old<br/>\n  and it works a treat).<br/>\n  I need to calm down and find ways to express my anger other than<br/>\n  threats, yelling and generally being mean.<br/>\n  Any advice.<br/>\n  I am new to unschooling but I so want to do this and it sits so right<br/>\n  with me....just not sure how to deal with what comes up when my 4yr<br/>\n  old is in constant demand of service or satisfaction of her needs NOW<br/>\n  despite the fact that there are 2 other children and a father also<br/>\n  wanting their needs met. And ways to calm myself to address her and<br/>\n  not shame her.<br/>\n  HELP <br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":286759788,"authorName":"Ryan","from":"&quot;Ryan&quot; &lt;misterbodine@...&gt;","profile":"misterbodine","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: dealing with my anger and my 4yr old daughter","postDate":"1212597536","msgId":33494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcyNmdmMCtra2FhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcyNmFuNyt1NTJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":33487,"nextInTopic":33499,"prevInTime":33493,"nextInTime":33495,"topicId":33487,"numMessagesInTopic":0,"msgSnippet":"... Hi.  I have a 7yr old boy, a 4yr old daughter, and a brand new 3 week old son, so on that level we re in similar territory.  My daughter is also beginning","messageBody":"<div id=\"ygrps-yiv-1637505687\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie&quot; &lt;barnesosborne@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I asked this q and was advised to post it here.  I am desperate and<br/>\n&gt; need some feedback from experienced unschoolers...I am very new to<br/>\n&gt; this and moving slowly....I think it is me who needs the most<br/>\n&gt; unschooling...<br/>\n<br/>\n<br/>\n </span></blockquote>Hi.  I have a 7yr old boy, a 4yr old daughter, and a brand new 3 week <br/>\nold son, so on that level we&#39;re in similar territory.  My daughter is <br/>\nalso beginning to get demanding, pushy, and insistent on getting what <br/>\nshe wants when she wants it.  Part of it, I&#39;m convinced, is her age.  <br/>\nThat 4th year is a tough one, since they&#39;re getting old enough to <br/>\nwant a lot and be aggressive about doing it, but not yet developed <br/>\nenough to have a lot of impulse control.  I have to remind myself <br/>\nfairly regularly that, when she&#39;s getting demanding and wanting it <br/>\nNOW that she really can&#39;t help it.  Impulse control is in fact an <br/>\nissue of brain development, and by 5 that starts getting better.  I&#39;m <br/>\nalso assuming that there&#39;s a bit of frustration on her part over the <br/>\nbaby, since my wife and I are suddenly a lot less present for her, <br/>\nand she&#39;s a little unsettled about no longer being the youngest.<br/>\n<br/>\nThat said, I think I&#39;d try all sorts of different arrangements and <br/>\noptions, since I don&#39;t think, in the short term, there&#39;s an easy way <br/>\nto change her behavior.  Maybe stop trying to read to them all at <br/>\nonce?  Obviously the family bed makes that more difficult, but what <br/>\nabout reading to them individually?  Baby first, then once the baby <br/>\nis happy, your daughter.  Your son can probably hold on until <br/>\neveryone else is settled before he gets his turn.  I suspect that, <br/>\nfor the time being, your daughter may need a lot of extra attention, <br/>\nwhich obviously isn&#39;t easy to provide in your current situation, but <br/>\nmay be the best option for both of you.  My wife has started making <br/>\nextra time just for her and my daughter, special time for the two of <br/>\nthem, and that already seems to be helping.  <br/>\n<br/>\nI would also try to enlist your partner in this more.  Why is it your <br/>\njob to get everyone to sleep all at once?  Why is it a treat when <br/>\nyour partner reads to your children?  Shouldn&#39;t that be more of a <br/>\nregular thing?  My sense is trying to work this alone, or with <br/>\nminimal help from your partner, is only going to make it more <br/>\ncomplicated to fix and more frustrating for everyone along the way.<br/>\n<br/>\nAnd if the act of reading is getting you that frustrated, which I can <br/>\ntotally understand, then I&#39;d stop doing it.  That time together <br/>\nshould be good, happy time for everyone, and if it isn&#39;t, then I <br/>\nwouldn&#39;t try to do it.  When you reach the spot where you&#39;re getting <br/>\nfrustrated, just tell them that mommy is getting frustrated and needs <br/>\nto stop story time for now.  And stop.  And remind yourself <br/>\n(regularly) that your daughter simply cannot help the way she&#39;s <br/>\nacting, so there&#39;s no reason to be angry with her.  I try to see all <br/>\nbehavior from my children as purposeful and necessary (for them) and <br/>\nthen try to understand why they&#39;re acting that way and what they need <br/>\nfrom me to help them through it.  <br/>\n<br/>\nThose are just some initial thoughts.</div>","specialLinks":[]},{"userId":226289029,"authorName":"Julie","from":"&quot;Julie&quot; &lt;barnesosborne@...&gt;","profile":"julieosborne69","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"dealing with my anger and my 4yr old daughter","postDate":"1212591655","msgId":33487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcyNmFuNyt1NTJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":33494,"prevInTime":33486,"nextInTime":33488,"topicId":33487,"numMessagesInTopic":0,"msgSnippet":"I asked this q and was advised to post it here.  I am desperate and need some feedback from experienced unschoolers...I am very new to this and moving","messageBody":"<div id=\"ygrps-yiv-362886486\">I asked this q and was advised to post it here.  I am desperate and<br/>\nneed some feedback from experienced unschoolers...I am very new to<br/>\nthis and moving slowly....I think it is me who needs the most<br/>\nunschooling...<br/>\nMy daughter is 4, I have 2 other children...a 7yr old son and a 1yr<br/>\nold daughter.  My problems are mostly with my 4yr old daughter. She is<br/>\na child that needs lots of attention, and goes through periods where<br/>\nnothing I do is right.  She demands service &quot;get me a drink&quot;.  I<br/>\nexplain that asking politely makes me feel much more like doing it. <br/>\nStory time at night is my biggest issue....I end up losing it<br/>\ncompletely and being really horrible to her.  Generally it goes like<br/>\nthis.  Bubba is tired, and happy to bf while I read to the<br/>\nothers(although this is starting to change and she is wanting her<br/>\nbooks too).  My 7yr old is happy to wait for his story/chapter.  My<br/>\n4yr old has 2-4stories and tonight a back scratch too, fairly<br/>\nuninterrupted by bubba (but not always the case).  Then it is my sons<br/>\nturn for his chapter or 2....my 4yr old starts...chatting, jumping on<br/>\nthe bed, asking 7yr old if he wants to play, fight....etc I explain<br/>\ncalmly that she has had her stories, and her brother now wants to hear<br/>\nhis story...he has been quiet and patient, and now it is her turn to<br/>\nbe quiet and let him have his turn.  We all share the same room and<br/>\nbeds...by their choice. I attempt to read again.....almost instantly<br/>\nthe chatter, jumping, noise starts again....this goes on and on...me<br/>\ntalking  about respecting her brothers turn as he did hers, that it is<br/>\nhard to read with all the noise and jumping......A 10min read often<br/>\ntakes an hour or more!  I get to a point where I let her know I am<br/>\ngetting really cross and her brother also tells her to be quiet.  It<br/>\ncontinues....I eventually loose it and start yelling and screaming. <br/>\nTonight my son asked if it would be easier if he had his turn<br/>\ntomorrow....he has more patience than me often!  I ended up putting my<br/>\ndaughter out of the room to finish the chapter, she screamed and<br/>\nscreamed and I got more wild!  I told her it was her last chance to<br/>\nstay quiet ( we had only got through a couple of paragraphs by now). <br/>\nMy son ended up in tears, as did my 4 yr old because I got so angry I<br/>\nmust have looked like a crazy woman...he said it always ended up with<br/>\na short read for him in between me and my daughter having a fight! <br/>\nHow do I get it clear to my 4yr old that she is being unfair??<br/>\nWhen I am calm I can see the following:<br/>\nMy 4yr old is tired and wants her bf and doesn&#39;t want to wait.<br/>\nShe is not interested in his stories.<br/>\nShe doesn&#39;t know what to do while waiting....and is naturally an<br/>\nactive child.<br/>\nI need help at bed time with story reading so all are getting their<br/>\nfair share (on the odd occasion my partner will read to the 4yr old<br/>\nand it works a treat).<br/>\nI need to calm down and find ways to express my anger other than<br/>\nthreats, yelling and generally being mean.<br/>\nAny advice.<br/>\nI am new to unschooling but I so want to do this and it sits so right<br/>\nwith me....just not sure how to deal with what comes up when my 4yr<br/>\nold is in constant demand of service or satisfaction of her needs NOW<br/>\ndespite the fact that there are 2 other children and a father also<br/>\nwanting their needs met. And ways to calm myself to address her and<br/>\nnot shame her.<br/>\nHELP</div>","specialLinks":[]}],"prevTopicId":33470,"nextTopicId":33500}}