{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Peabody conference/radical unschooling","postDate":"1148997529","msgId":13795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1aGoycCs4bm1iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4Ni4xNTdmYWQyLjMxYWNlMjU2QGFvbC5jb20+"},"prevInTopic":13791,"nextInTopic":0,"prevInTime":13794,"nextInTime":13796,"topicId":13775,"numMessagesInTopic":0,"msgSnippet":"... Yup - we were there. Spent lots of time waterlogged - my cool henna tattoos (thanks Sonali!) are already mostly faded off because of all the time in the","messageBody":"<div id=\"ygrps-yiv-28752718\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, HMSL2@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I never  found Robin (ohpurple) from the Cape, Sarah (ME) who <br/>\n&gt;planned <br/>\n&gt; to camp at  Harold Parker State forest, or Deb Rossing <br/>\n&gt; (soggyboysmom) - did you guys  make it?   Maybe another time!<br/>\n&gt;<br/>\n </span></blockquote>Yup - we were there. Spent lots of time waterlogged - my cool henna <br/>\ntattoos (thanks Sonali!) are already mostly faded off because of all <br/>\nthe time in the pool. I was at the Whole life unschooling with kids <br/>\nunder 10 discussion group until about noon, then I slipped out as the <br/>\ndiscussion was still rolling and my stomach was about to grumble (and <br/>\nmy guys were waiting for me so we could do lunch). DH and I were at <br/>\nthe keynote while DS and a friend hung out in our room with their <br/>\nGameboys. We also popped in to the playdough time and DS spent time in <br/>\nthe toy room with and without us. DH was at the SSUDS gathering and <br/>\nstopped in on the duct tape funshop while I was at the Zen of <br/>\nUnschooling talk.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Peabody conference/radical unschooling","postDate":"1148963995","msgId":13791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1Z2lhcis2NW5mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ1Yi4yMTNhNDlhLjMxYWNmMThjQGFvbC5jb20+"},"prevInTopic":13790,"nextInTopic":13795,"prevInTime":13790,"nextInTime":13792,"topicId":13775,"numMessagesInTopic":0,"msgSnippet":"... Hubby coasted through the day and I kept asking him if anything clicked yet and he kept responding-- kind of.  Then he went to Ben s session and came out","messageBody":"<div id=\"ygrps-yiv-1470102282\"><blockquote><span title=\"ireply\">&gt; Sorry we didn&#39;t connect.  We were there and had a fabulous time.  <br/>\n </span></blockquote>Hubby coasted through the day and I kept asking him if anything <br/>\nclicked yet and he kept responding--&quot;kind of.&quot;  Then he went to Ben&#39;s <br/>\nsession and came out transformed. He gets it!&gt;&gt;&gt;<br/>\n<br/>\nGlad you made it Robin and I&#39;m sorry we didn&#39;t hook up, but there&#39;s <br/>\nalways another time!  We get down to the Cape once in a while so <br/>\nthat&#39;s always a possibility!   We&#39;ve got a ways to go here, but dh <br/>\nmeeting Ben and the other dads DEFINITELY helped!<br/>\nJann</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Peabody conference/radical unschooling","postDate":"1148963807","msgId":13790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1Z2k0ditmcTh0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4Ni4xNTdmYWQyLjMxYWNlMjU2QGFvbC5jb20+"},"prevInTopic":13776,"nextInTopic":13791,"prevInTime":13789,"nextInTime":13791,"topicId":13775,"numMessagesInTopic":0,"msgSnippet":"... weekend and longed for radical unschooling discussions. Thank you for being so open in your thoughts while also open to my own. It was nice finally","messageBody":"<div id=\"ygrps-yiv-395252997\"><blockquote><span title=\"ireply\">&gt; Jann,<br/>\n&gt; It was very nice meeting you! I had a few conversations this <br/>\n </span></blockquote>weekend and longed for radical unschooling discussions. Thank you <br/>\nfor being so open in your thoughts while also open to my own.&gt;&gt;<br/>\n<br/>\nIt was nice finally meeting you too Laura! This is all very new to <br/>\nus, and although my mind is fully there, putting it all in practice <br/>\nhas a way to go!   Rest assured, this is not the last time we will <br/>\nbe together, and we always have here, or email, to communicate!  We <br/>\nshould definitely try to get our kids together sometime (I&#39;ll keep <br/>\nyou posted if we come up your way camping - we WILL be at Danforth <br/>\nBay near Ossipee in a couple of weeks!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My head almost spun off once when someone discussed bringing <br/>\n </span></blockquote>curriculum into their home for their introverted kids.  I seriously <br/>\ndid a double take looking for a familiar unschooling face.  I wanted <br/>\nto discuss that further as a radical unschooler with a couple <br/>\nintroverted children but I couldn&#39;t come up with a starting <br/>\nstatement quick enough before the session ended.&gt;&gt;<br/>\n<br/>\nMissed this one!  I, too, have an introverted child so I can <br/>\nrelate!   I&#39;m better at writing out my thoughts, when I have time to <br/>\nreflect, than I am in person, and I know that&#39;s mostly because we&#39;re <br/>\nstill so new to all of this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I got photos too yay!&gt;<br/>\n<br/>\n </span></blockquote>Ya know, I brought my camera, but do ya think I took any pictures? <br/>\n(no!).  It sure would help recogizing new faces if we posted them <br/>\nhere (or sent them ahead of time!)!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m not sure where being anymore radical can lead us but I will say <br/>\n </span></blockquote>this feels so right for my family.&gt;&gt;&gt;<br/>\n<br/>\nI can&#39;t say we&#39;re radical yet, but definitely in a better place than <br/>\nwe were a year ago!   You hit the nail on the head, it&#39;s what feel <br/>\nright for your family, and that&#39;s the most important thing of all.<br/>\nJann</div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:Peabody conference/radical unschooling","postDate":"1148950412","msgId":13776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1Yi4yMTNhNDlhLjMxYWNmMThjQGFvbC5jb20+"},"prevInTopic":13775,"nextInTopic":13790,"prevInTime":13775,"nextInTime":13777,"topicId":13775,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/29/2006 7:49:32 PM Eastern Standard Time, HMSL2@aol.com writes: I never  found Robin (ohpurple) from the Cape Hi Jann, Sorry we didn t","messageBody":"<div id=\"ygrps-yiv-867088049\">In a message dated 5/29/2006 7:49:32 PM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> <br/>\nwrites:<br/>\nI never  found Robin (ohpurple) from the Cape<br/>\nHi Jann,<br/>\n<br/>\nSorry we didn&#39;t connect.  We were there and had a fabulous time.  Hubby <br/>\ncoasted through the day and I kept asking him if anything clicked yet and he kept <br/>\nresponding--&quot;kind of.&quot;  Then he went to Ben&#39;s session and came out transformed. <br/>\n He gets it!  <br/>\n<br/>\nI really enjoyed all the sessions and enjoyed putting faces with your names.  <br/>\nThanks to everyone on this list for all your guidance and sometimes brutally <br/>\nhonest help. Ren, Kelly, Mrs. Petri :), Kathryn, Beth and everyone who my <br/>\ntired brain is forgetting to include--Thank you for sharing your wisdom at the <br/>\nconference.  Its been just what we needed and it all makes so much sense.  We are <br/>\nbetter parents because of you.  I mean it.  <br/>\n<br/>\nI haven&#39;t opened Rue&#39;s book yet but I caught hubby reading it this morning.  <br/>\n<br/>\nThe MOST remarkable memories I took home from this conference were the times <br/>\nspent among all your amazing unschooled offspring.  What a relief that they <br/>\nare all so confident and friendly, talented, loving, pleasant and wonderful!  <br/>\nFrom the wee ones to the teens, I loved them all and it was very reassuring <br/>\nbeing around them.  I want my kids to turn out just like them--Happy!  All day, my <br/>\nkids kept saying -- he&#39;s so nice, she&#39;s so nice, etc.  The kids were all so <br/>\nnice they amazed us and filled our hearts with joy.  They also covered my body <br/>\nin hug buttons and henna.  Real art!<br/>\n<br/>\nWhat a better world we will all have because of freedom.  Thank you, thank <br/>\nyou, thank you!<br/>\n<br/>\nI am inspired and changed forever.  Can you feel it?<br/>\n<br/>\nPeace, joy and big hugs, <br/>\nRobin <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Peabody conference/radical unschooling","postDate":"1148946518","msgId":13775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4Ni4xNTdmYWQyLjMxYWNlMjU2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":13776,"prevInTime":13774,"nextInTime":13776,"topicId":13775,"numMessagesInTopic":0,"msgSnippet":"Jann, It was very nice meeting you! I had a few conversations this weekend and longed for radical unschooling discussions. Thank you for being so open in your","messageBody":"<div id=\"ygrps-yiv-1742715497\">Jann,<br/>\n <br/>\nIt was very nice meeting you!<br/>\nI had a few conversations this weekend and longed for radical unschooling  <br/>\ndiscussions.<br/>\nThank you for being so open in your thoughts while also open to my own. <br/>\n <br/>\nIt was nice to be mentioned (Kelly thank you for mentioning the interview  <br/>\nand dogs),known <br/>\nand remembered even if I am a shit disturber I know I sparked conversation  <br/>\neven if some of it was about me without me : )* I only regret not being  able <br/>\nto discuss my position... <br/>\n <br/>\nMy head almost spun off once when someone discussed bringing curriculum  into <br/>\ntheir home for their introverted kids.  I seriously did a double  take <br/>\nlooking for a familiar unschooling face.  I wanted to discuss  that further as a <br/>\nradical unschooler with a couple introverted children but I  couldn&#39;t come up <br/>\nwith a starting statement quick enough before the session  ended.<br/>\n <br/>\nDiversity and strewing came up this weekend. By the way Kelly... Every time  <br/>\nyou said strewing I was back there laughing bc it sounded like screwing as it  <br/>\ndid when I was on the radio. I think that&#39;s why he asked me to spell it bc it <br/>\n does sound soo close to screwing..  <br/>\nI&#39;d love to discuss the two further on some list..<br/>\n <br/>\nWe had a great time and met many people. Dustin had a great time and  finally <br/>\nhooked up with the teens he had wanted to meet in 2004. I got photos too  yay!<br/>\nI realized how radical I am and how much we have progressed since the  <br/>\nbeginning in 99 and more since 2004. I&#39;m not sure where being anymore radical  can <br/>\nlead us but I will say this feels so right for my family. <br/>\n <br/>\nLaura<br/>\nUnschoolingMaine.com<br/>\n<br/>\n<br/>\n&lt;&lt;We (well, mostly me!) were at the conference this weekend  (we live <br/>\n15mins away, so didn&#39;t stay over).  It was great to meet so  many <br/>\npeople I had met here first (Ren, Kelly, Ben, Rue, Tonya (MA), Laura  <br/>\n(ME), Carol (ME), Marji (NY))!  My dh attended Ben&#39;s dad&#39;s group  <br/>\n(SSUDs - Secret Society of Unschooling Dads) and it was worth the  <br/>\nprice of admission just to have him be there for that!<br/>\n<br/>\nI never  found Robin (ohpurple) from the Cape, Sarah (ME) who planned <br/>\nto camp at  Harold Parker State forest, or Deb Rossing <br/>\n(soggyboysmom) - did you guys  make it?   Maybe another time!<br/>\n<br/>\nMy dd discovered that one of  the older teens she met there was <br/>\nsomeone she knew from when she used to  take karate and is a life-<br/>\nlong unschooler!  We had no idea!   Small world!<br/>\n<br/>\nThank you Kathryn and Beth for organizing this  event!<br/>\nJann<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":13794,"nextTopicId":13784}}