{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old--my \treply","postDate":"1238121216","msgId":39148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzMTc1M2M5MDkwMzI2MTkzM3Q2NmY4MDI1OGdiNzgxOTFjOTAzNTc5Y2Q1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDE2NTg3Ni42MjM5My5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDE2NTg3Ni42MjM5My5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39127,"nextInTopic":0,"prevInTime":39147,"nextInTime":39149,"topicId":39127,"numMessagesInTopic":0,"msgSnippet":"... Thank you.  I know I am feeling vulnerable.  I appreciate your comment. ... Allowing him to do something or limiting him to something are both involved ...","messageBody":"<div id=\"ygrps-yiv-1196898116\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I didn&#39;t intend it as cynical or condescending. I do know that it is hard<br/>\n&gt; when people are focusing on what you&#39;ve written to not feel like they are<br/>\n&gt; attacking and I&#39;m sorry if you are feeling attacked.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thank you.  I know I am feeling vulnerable.  I appreciate your comment.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;but, to answer your<br/>\n&gt; &gt;question, I don&#39;t think so. It was our life. We all seemed to enjoy it.<br/>\n&gt; &gt;He was &quot;allowed to do&quot; all that we were allowed to do.<br/>\n&gt;<br/>\n&gt; You keep putting words in quotes as though they weren&#39;t actually the words<br/>\n&gt; you would use.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Allowing him to do something or limiting him to something are both involved<br/>\n<blockquote><span title=\"ireply\"> &gt; in having a &quot;VG day&quot;. Even if the rule was applied to everyone in the<br/>\n&gt; household it was still a rule and a limitation and an allowance. And all of<br/>\n&gt; those things were contrived by others than him for his own good as you and<br/>\n&gt; your husband felt was appropriate. 4 to 6 months ago you changed your mind<br/>\n&gt; and decided to try a different approach. Because of that new approach your<br/>\n&gt; son is feeding his passion that had been limited before. Part of what is<br/>\n&gt; fuelling this gorging on his passion, his desire to do video games all the<br/>\n&gt; time, is that previous limitation. It changed the value of the video games,<br/>\n&gt; it became something rare and controlled in his environment. Just like<br/>\n&gt; halloween candy was for me or like Mountain Dew is for Simon (we live in the<br/>\n&gt; UK where there is no Mountain Dew except from a couple of<br/>\n&gt; really expensive importers who I buy the occasional case from) or fresh<br/>\n&gt; picked strawberries are for us all until the end of the season. It will take<br/>\n&gt; time and a real sense that you aren&#39;t going to limit him to a VG day again<br/>\n&gt; for the gorging to slow to a more honest enjoyment of video games and a less<br/>\n&gt; fuelled-by-being-a-rare-good enjoyment.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Again, I am feeling very vulnerable.   One of the difficulties of discussion<br/>\ngroups and emails, at least for me, is to fully understand what is being<br/>\nsaid.  In person, I have the visuals.  I have the body language, the facial<br/>\nexpressions and the intonation.  Here, I have only the words as they are<br/>\nread aloud in my head.  If I am feeling afraid, those words sound different<br/>\nfrom if I am feeling secure.  I think that is in large part where my fear<br/>\nlies with Ethan.  When I see him so engrosed in this visual and auditory<br/>\nworld, I worry that he misses the complexities that come with physical<br/>\ninteractions--not the physical interaction of he and I sitting together, but<br/>\nthe tactile experience of that which he is interacting with.  When I see him<br/>\nbecoming moody and disengaged with the world around him, I fear that it is<br/>\nthis 2d world that is encouraging that.  I have a lot of fear because I have<br/>\nnot had a lot of meaningful guidance.  All that I know comes mostly from<br/>\nwhat I have read and that tends to pull me in different directions.   My<br/>\napologies for reacting negitively to your comments.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Linnaea&#39;s change in colour choice did coincide with a mood change. She got<br/>\n&gt; a new friend who was a tomboy. And the friendship was intense and often<br/>\n&gt; Linnaea was exhausted from being with her friend. Her mood was snappier,<br/>\n&gt; shorter, less playful. She wanted to do what her friend wanted to do, wanted<br/>\n&gt; to have the games her friend wanted to have. The colour change came during<br/>\n&gt; that time. I could have decided that it was the clothes that were the factor<br/>\n&gt; in her changes. I listen to a podcast the other day where an angry daughter<br/>\n&gt; begins wearing clothes that reflect that anger and her mom bans her from<br/>\n&gt; wearing those clothes seeing them as a factor in her anger. It isn&#39;t unheard<br/>\n&gt; of that clothes be blamed for behaviour. I would absolutely not blame the<br/>\n&gt; video games for the change in your son&#39;s mood. I would instead look for ways<br/>\n&gt; to really help him to play video games as much as he wants without feeling<br/>\n&gt; any censure from you or your husband. If he&#39;s rude tell him he&#39;s<br/>\n&gt; rude, but don&#39;t blame the video games. I&#39;m not suggesting that the timing<br/>\n&gt; in his mood-change and his freedom to enjoy video games without limits are<br/>\n&gt; unrelated. I would argue, however, that it is easier to see the video game<br/>\n&gt; as the bad thing than it is to find other causes.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I used to have a real problem with television. I had been told that I was<br/>\n&gt; addicted to television as a child. My brother had used me as a humorous<br/>\n&gt; story in a story for his school paper about the week our television was in<br/>\n&gt; the shop, he stuck me in a corner saying &quot;The plane, the plane&quot; over and<br/>\n&gt; over again. I believed that television was capable of controlling me and I<br/>\n&gt; needed to protect Simon and Linnaea from that control. I believed that<br/>\n&gt; television was going to steal my children&#39;s souls and creativity and<br/>\n&gt; imagination and freedom to choose and all of that crap. One day little<br/>\n&gt; toddler Linnaea turned the television off while Simon was watching it and<br/>\n&gt; Simon hit her. I decided that he hit her because television was too much for<br/>\n&gt; him to deal with and I grounded him for that week. It took me a while to see<br/>\n&gt; that it wasn&#39;t the television that made Simon hit her, it was Linnaea<br/>\n&gt; turning off the television when he was in the middle of watching a show he<br/>\n&gt; wanted to<br/>\n&gt; watch. It was Simon being 4, not the television. It was lots of other<br/>\n&gt; things that brought him to hitting her. And that he was much less likely to<br/>\n&gt; hit her if I hung out with her and kept her from being irritating. Grounding<br/>\n&gt; him didn&#39;t resolve anything. If anything the next week when I let him watch<br/>\n&gt; television again he was more protective of his right to watch it. I probably<br/>\n&gt; made the whole thing worse.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks again, Schuyler.  Your children are lucky to have you in their life.<br/>\n<br/>\n<br/>\nKaren.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; .<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old--my  reply","postDate":"1238091737","msgId":39127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NTg3Ni42MjM5My5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":39148,"prevInTime":39126,"nextInTime":39128,"topicId":39127,"numMessagesInTopic":0,"msgSnippet":"________________________________ From: Karen James  ... Lots of critters see from one side of their face at a time, no depth perception,","messageBody":"<div id=\"ygrps-yiv-1198943318\">________________________________<br/>\nFrom: Karen James &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a>&gt;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I believe that, evolutionarily speaking, our senses have developed in a 3<br/>\n&gt;dimensional tactile world, not a 2d one, so I believed I was giving room for<br/>\n&gt;full, uncluttered interaction in that world, so that he may know it<br/>\n&gt;intimately within those first few short years of his life. <br/>\n<br/>\n </span></blockquote>Lots of critters see from one side of their face at a time, no depth perception, the dimension of depth must be inferred by relative size as opposed to by stereoscopic vision. They seem to be okay. I had a friend in high school who was blind in one eye and while she couldn&#39;t get a driving license because of her lack of depth perception she seemed to be okay. And actually video games have a lot of really cool playing with perspective going on. Mario Galaxy is amazing for some of that. Paper Mario totally uses the movement between being a 2d platform game and a 3d perspective, it is really cool. <br/>\n<br/>\nBoth Simon and Linnaea have never had limitations put on computer games. Not even when they were tiny. Used to sit on my lap and play Blues Clues and Tonka Construction and lots of other games. They were tactile and experiential and cool and didn&#39;t stop them from playing in the mud or from swinging on swings or from painting with glitter and getting it all in their hair. Nor did it clutter their interaction with the world. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We &quot;limited&quot; games because that seemed to work for us.  We all saw it as a fun day to<br/>\n&gt;look forward to.  <br/>\n<br/>\n </span></blockquote>In your first post you wrote this: &quot;Of course, he asked many times during the course of the week to play, but we would say he could play on our VG day.&quot; It clearly wasn&#39;t working for all of you. He wanted to play video games on days other than the fun day that you looked forward to. I think it is a really good thing that you are saying yes to his desire to play video games all days of the week. I think it is really easy to believe that they are scary and bad things even though they are not monsters coming to take your child away. They are hugely engaging games. Letting him play when he wants to lets him know that you value his choices, his desires. That is such a good thing to be doing. <br/>\n<br/>\n<br/>\n<br/>\nWe opened it up because of  what we had read and learned<br/>\nthrough the discussions within the unschooling community.  While everything<br/>\nelse in our house is unlimited, we considered this would naturally follow.<br/>\nSince that time we have noticed certain changes in his moods and motivations<br/>\nthat have concerned us.  We wondered if it was too much, too soon.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Was he doing socks games and baking and watching waterfalls with you<br/>\n&gt;&gt; because it was better than anything else that he was allowed to do and now<br/>\n&gt;&gt; there is something that he finds more engaging?<br/>\n&gt;&gt;<br/>\n&gt;I find this a little cynical and condescending, <br/>\n<br/>\n </span></blockquote>I didn&#39;t intend it as cynical or condescending. I do know that it is hard when people are focusing on what you&#39;ve written to not feel like they are attacking and I&#39;m sorry if you are feeling attacked. From what you&#39;ve written your son clearly is finding video games more engaging than what went before. I don&#39;t think that will be the end of the story, I imagine that those things will become appealing again. Yesterday I read Sylvester and the Magic Pebble and I cried as I always do at the end. Reading a picture book isn&#39;t something that she always wants to do. More often she wants to read to herself. It just happened that she had turned to stone and I knew a book that illustrated that occurrence.<br/>\n<br/>\nI do believe that if you go back to once a week of game play it will do more damage than good. I think you need to enjoy this time for what it is and look for ways to help him stay with what he is so enjoying. I understand wanting to have things as they were, but you are here now. Let him play through dinner, bring him a to go bag, look into getting a DS or a PSP or an Itouch so that he can play games while you are out and will feel less like he needs to stay home to game. Don&#39;t limit him to a smaller world, enhance it to a larger one. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;but, to answer your<br/>\n&gt;question, I don&#39;t think so.  It was our life.  We all seemed to enjoy it.<br/>\n&gt;He was &quot;allowed to do&quot; all that we were allowed to do.  <br/>\n<br/>\n </span></blockquote>You keep putting words in quotes as though they weren&#39;t actually the words you would use. Allowing him to do something or limiting him to something are both involved in having a &quot;VG day&quot;. Even if the rule was applied to everyone in the household it was still a rule and a limitation and an allowance. And all of those things were contrived by others than him for his own good as you and your husband felt was appropriate. 4 to 6 months ago you changed your mind and decided to try a different approach. Because of that new approach your son is feeding his passion that had been limited before. Part of what is fuelling this gorging on his passion, his desire to do video games all the time, is that previous limitation. It changed the value of the video games, it became something rare and controlled in his environment. Just like halloween candy was for me or like Mountain Dew is for Simon (we live in the UK where there is no Mountain Dew except from a couple of<br/>\n really expensive importers who I buy the occasional case from) or fresh picked strawberries are for us all until the end of the season. It will take time and a real sense that you aren&#39;t going to limit him to a VG day again for the gorging to slow to a more honest enjoyment of video games and a less fuelled-by-being-a-rare-good enjoyment. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My daughter loved pink when she was little. Absolutely adored the color. She<br/>\n&gt;&gt; didn&#39;t much like to wear anything but pink, she wanted toys that were pink,<br/>\n&gt;&gt; she liked pink things. Because of her love of pink I began to really like<br/>\n&gt;&gt; pink. Really like pink. I&#39;d never liked pink that much before. It was too<br/>\n&gt;&gt; girly. But Linnaea&#39;s love of pink really brought me round to pink. And one<br/>\n&gt;&gt; day she was done. Pink just didn&#39;t do it for her. She&#39;d occasionally wear it<br/>\n&gt;&gt; for me, or do a twirl in one of the many beautiful pink dresses she had, but<br/>\n&gt;&gt; she just didn&#39;t like pink. Or, at least, she didn&#39;t like it enough to want<br/>\n&gt;&gt; to wear it all the time anymore. She&#39;d moved out of that part of her life.<br/>\n&gt;&gt; And I was sad to see that go. But that sorrow was all about me and my little<br/>\n&gt;&gt; girl who loved pink. It wasn&#39;t about Linnaea, it was about the story of the<br/>\n&gt;&gt; all pink wearing little girl I had, not the right now little girl that she<br/>\n&gt;&gt; was. Being sad about that change didn&#39;t help me to enjoy<br/>\n&gt;&gt; being with her or hanging out with her or playing with her or enjoying the<br/>\n&gt;&gt; new clothes she was choicing. I still have some of those pink clothes tucked<br/>\n&gt;&gt; in a box somewhere and I have pictures and right now there is a 9 year old<br/>\n&gt;&gt; girl lying on the floor in a black shirt with a mortocycle riding woman<br/>\n&gt;&gt; named Betty Bitch! on the back and that&#39;s really cool too.<br/>\n<br/>\n<br/>\n<br/>\n&gt; Ethan loved blue.  I did the same thing as you.  I used to answer that I<br/>\n&gt; didn&#39;t have a favourite colour early on when he and his friends would ask,<br/>\n&gt; but then I began to love blue because he did.  Now he loves red.  I still<br/>\n&gt; love blue, and hold close the relationship that I remember that revolved<br/>\n&gt; around that colour.  But the colour change didn&#39;t change his moods.  That is<br/>\n&gt; what I am concerned about--the effect, not the change.<br/>\n<br/>\n </span></blockquote>Linnaea&#39;s change in colour choice did coincide with a mood change. She got a new friend who was a tomboy. And the friendship was intense and often Linnaea was exhausted from being with her friend. Her mood was snappier, shorter, less playful. She wanted to do what her friend wanted to do, wanted to have the games her friend wanted to have. The colour change came during that time. I could have decided that it was the clothes that were the factor in her changes. I listen to a podcast the other day where an angry daughter begins wearing clothes that reflect that anger and her mom bans her from wearing those clothes seeing them as a factor in her anger. It isn&#39;t unheard of that clothes be blamed for behaviour. I would absolutely not blame the video games for the change in your son&#39;s mood. I would instead look for ways to really help him to play video games as much as he wants without feeling any censure from you or your husband. If he&#39;s rude tell him he&#39;s<br/>\n rude, but don&#39;t blame the video games. I&#39;m not suggesting that the timing in his mood-change and his freedom to enjoy video games without limits are unrelated. I would argue, however, that it is easier to see the video game as the bad thing than it is to find other causes. <br/>\n<br/>\nI used to have a real problem with television. I had been told that I was addicted to television as a child. My brother had used me as a humorous story in a story for his school paper about the week our television was in the shop, he stuck me in a corner saying &quot;The plane, the plane&quot; over and over again. I believed that television was capable of controlling me and I needed to protect Simon and Linnaea from that control. I believed that television was going to steal my children&#39;s souls and creativity and imagination and freedom to choose and all of that crap. One day little toddler Linnaea turned the television off while Simon was watching it and Simon hit her. I decided that he hit her because television was too much for him to deal with and I grounded him for that week. It took me a while to see that it wasn&#39;t the television that made Simon hit her, it was Linnaea turning off the television when he was in the middle of watching a show he wanted to<br/>\n watch. It was Simon being 4, not the television. It was lots of other things that brought him to hitting her. And that he was much less likely to hit her if I hung out with her and kept her from being irritating. Grounding him didn&#39;t resolve anything. If anything the next week when I let him watch television again he was more protective of his right to watch it. I probably made the whole thing worse. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39147,"nextTopicId":39150}}