{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":342355855,"authorName":"CPC2 CPC2","from":"&quot;CPC2 CPC2&quot; &lt;cpc2@...&gt;","profile":"pressmanm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: balance and marriage (long)","postDate":"1213817963","msgId":33864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwOTFkOGQ0MDgwNjE4MTIzOWc0MjdjNDllZzVlNTI3OWMwZDA3NTQyNGJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGczYjRlcytyaTFhQGVHcm91cHMuY29tPg==","referencesHeader":"PDIwOTFkOGQ0MDgwNjE4MDQzMHQ3MTM1ZDkzZGk3ODc2MGU2YzllZGY0M2Q3QG1haWwuZ21haWwuY29tPgkgPGczYjRlcytyaTFhQGVHcm91cHMuY29tPg=="},"prevInTopic":33851,"nextInTopic":0,"prevInTime":33863,"nextInTime":33865,"topicId":33843,"numMessagesInTopic":0,"msgSnippet":"Thank you Sylvia!  I think you are right on.  I would be lying if I didn t admit that I choose kids every time because I they bring me more pleasure than being","messageBody":"<div id=\"ygrps-yiv-1019934936\">Thank you Sylvia!  I think you are right on.  I would be lying if I didn&#39;t<br/>\nadmit that I choose kids every time because I they bring me more pleasure<br/>\nthan being with my husband.  I am angry with him over a lot of things.  I<br/>\nwill find my way to the site you recommended.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Jun 18, 2008 at 10:01 AM, Sylvia Toyama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   One point that I may be missing is where does my responsibility end<br/>\n&gt; with the kids at the end of the day so that my husband can get some<br/>\n&gt; time?<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; Do you want to spend time with your dh, or would it be something you<br/>\n&gt; do because you&#39;re expected to? Do you enjoy the time with your kids<br/>\n&gt; or is that just responsibility? Not to badger you, just to say be<br/>\n&gt; honest with yourself - is the time you give to your kids and/or dh<br/>\n&gt; about joy or responsibility? Whichever it is, that&#39;s what your kids<br/>\n&gt; learn watching you -- that relationships are about joy, or about<br/>\n&gt; responsibility. Which do you want them to learn to value?<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; Maybe it is my control that I don&#39;t really want to leave them to<br/>\n&gt; their own devices in the evening. I like to be a presence. It<br/>\n&gt; doesn&#39;t feel right to say, &quot;you&#39;re on your own now. see you<br/>\n&gt; tomorrow.&quot;<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; They&#39;re not tiny kids who need you to bathe them - they&#39;re old enough<br/>\n&gt; to manage for a while without you right there. You don&#39;t have to<br/>\n&gt; say &#39;you&#39;re on your own&#39; to have time with your dh.<br/>\n&gt;<br/>\n&gt; One thing I learned from my own childhood, and over the past 20 yrs<br/>\n&gt; watching my inlaws, is that we model not only parenting to our kids --<br/>\n&gt; we model marriage. Kids learn all they know of marriage watching<br/>\n&gt; their own parents. What is your choice of kids over partner every<br/>\n&gt; time teaching your kids? Will either of them desire marriage if what<br/>\n&gt; they see you and their Dad live is all they know?<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; Often times I feel a tremendous tug between my kids and my husband.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; How often do you choose him when you feel this tug? What does that<br/>\n&gt; say to him and to your kids?<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; I guess I just thought that parenting them was the priority.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; I think this is an easy thought-mode to fall into for stay at home<br/>\n&gt; Moms. What happens whem &#39;making kids the priority&#39; or choosing<br/>\n&gt; between dh and kids leads to an unhappy marriage or even divorce? Is<br/>\n&gt; this lifestyle still even possible? How does neglecting one&#39;s<br/>\n&gt; marriage make kids the priority? My siblings and I are living proof<br/>\n&gt; that bad marriages do NOT make happy kids.<br/>\n&gt;<br/>\n&gt; ****<br/>\n&gt;<br/>\n&gt; My husband is 50! Perhaps I am resentful about as well. Just one<br/>\n&gt; more piece of me to dole out. He&#39;s not coming to the plate as a<br/>\n&gt; parent.<br/>\n&gt;<br/>\n&gt; ****<br/>\n&gt;<br/>\n&gt; I am hearing a big sense of responsibility, even burden, from you --<br/>\n&gt; where&#39;s the joy in being with people you love? When I find myself<br/>\n&gt; feeling irritable and overworked, I know it&#39;s because I&#39;m just not<br/>\n&gt; seeing the joy and love already present in my life. Where is the joy<br/>\n&gt; in your life? What joys do you feel like you now don&#39;t have, but<br/>\n&gt; used to enjoy?<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; It gets old when I&#39;m the one having to manage them all day and he&#39;s<br/>\n&gt; home ten minutes on a rage about the condition of the house but I get<br/>\n&gt; that it&#39;s not the house. It&#39;s something bigger than that and maybe<br/>\n&gt; bigger than me and our relationship put together.<br/>\n&gt;<br/>\n&gt; ****<br/>\n&gt; So make your relationship with him bigger than the anger. Bigger than<br/>\n&gt; the burdens of every day life. Bigger than the disappointments of<br/>\n&gt; your combined past.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; I feel for my husband but he&#39;s a child himself. For example, my DD<br/>\n&gt; 9, will come up to our room to watch tv with him he wants more<br/>\n&gt; attention than she&#39;s interested in giving (ie scratching his back,<br/>\n&gt; snuggling, etc) so he&#39;ll resort to baiting her by pulling on her<br/>\n&gt; blanket starting a tug of war.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; He&#39;s trying to play -- okay it&#39;s not the kind of play she wanted. My<br/>\n&gt; 23yo is kinda like that, and it makes things hard between him and the<br/>\n&gt; 12yo. The older boy is a chain-yanker, he always has been. I&#39;ve had<br/>\n&gt; to find other ways to connect and bring him in.<br/>\n&gt;<br/>\n&gt; Really, come over to Peaceful Partnerships at yahoo. You&#39;ll be<br/>\n&gt; amazed by what and who you find there.<br/>\n&gt;<br/>\n&gt; Sylvia<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMarie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"&quot;Sylvia Toyama&quot; &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: balance and marriage (long)","postDate":"1213797660","msgId":33851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczYjRlcytyaTFhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwOTFkOGQ0MDgwNjE4MDQzMHQ3MTM1ZDkzZGk3ODc2MGU2YzllZGY0M2Q3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":33849,"nextInTopic":33864,"prevInTime":33850,"nextInTime":33852,"topicId":33843,"numMessagesInTopic":0,"msgSnippet":"One point that I may be missing is where does my responsibility end with the kids at the end of the day so that my husband can get some time? ***** Do you want","messageBody":"<div id=\"ygrps-yiv-678055036\">One point that I may be missing is where does my responsibility end<br/>\nwith the kids at the end of the day so that my husband can get some <br/>\ntime?<br/>\n<br/>\n*****<br/>\n<br/>\nDo you want to spend time with your dh, or would it be something you <br/>\ndo because you&#39;re expected to?  Do you enjoy the time with your kids <br/>\nor is that just responsibility?  Not to badger you, just to say be <br/>\nhonest with yourself - is the time you give to your kids and/or dh <br/>\nabout joy or responsibility?  Whichever it is, that&#39;s what your kids <br/>\nlearn watching you -- that relationships are about joy, or about <br/>\nresponsibility.  Which do you want them to learn to value?<br/>\n<br/>\n*****<br/>\nMaybe it is my control that I don&#39;t really want to leave them to <br/>\ntheir own devices in the evening.  I like to be a presence.  It <br/>\ndoesn&#39;t feel right to say, &quot;you&#39;re on your own now.  see you <br/>\ntomorrow.&quot; <br/>\n<br/>\n*****<br/>\nThey&#39;re not tiny kids who need you to bathe them - they&#39;re old enough <br/>\nto manage for a while without you right there.  You don&#39;t have to <br/>\nsay &#39;you&#39;re on your own&#39; to have time with your dh.  <br/>\n<br/>\nOne thing I learned from my own childhood, and over the past 20 yrs <br/>\nwatching my inlaws, is that we model not only parenting to our kids --<br/>\n we model marriage.  Kids learn all they know of marriage watching <br/>\ntheir own parents.  What is your choice of kids over partner every <br/>\ntime teaching your kids?  Will either of them desire marriage if what <br/>\nthey see you and their Dad live is all they know?<br/>\n<br/>\n*****<br/>\n<br/>\nOften times I feel a tremendous tug between my kids and my husband. <br/>\n<br/>\n*****<br/>\nHow often do you choose him when you feel this tug?  What does that <br/>\nsay to him and to your kids?<br/>\n<br/>\n*****<br/>\n<br/>\nI guess I just thought that parenting them was the priority.<br/>\n<br/>\n*****<br/>\nI think this is an easy thought-mode to fall into for stay at home <br/>\nMoms.  What happens whem &#39;making kids the priority&#39; or choosing <br/>\nbetween dh and kids leads to an unhappy marriage or even divorce?  Is <br/>\nthis lifestyle still even possible?  How does neglecting one&#39;s <br/>\nmarriage make kids the priority?  My siblings and I are living proof <br/>\nthat bad marriages do NOT make happy kids.  <br/>\n<br/>\n****<br/>\n<br/>\nMy husband is 50!  Perhaps I am resentful about as well. Just one <br/>\nmore piece of me to dole out.  He&#39;s not coming to the plate as a <br/>\nparent. <br/>\n<br/>\n****<br/>\n<br/>\nI am hearing a big sense of responsibility, even burden, from you -- <br/>\nwhere&#39;s the joy in being with people you love?  When I find myself <br/>\nfeeling irritable and overworked, I know it&#39;s because I&#39;m just not <br/>\nseeing the joy and love already present in my life.  Where is the joy <br/>\nin your life?  What joys do you feel like you now don&#39;t have, but <br/>\nused to enjoy?  <br/>\n<br/>\n*****<br/>\n<br/>\nIt gets old when I&#39;m the one having to manage them all day and he&#39;s <br/>\nhome ten minutes on a rage about the condition of the house but I get <br/>\nthat it&#39;s not the house.  It&#39;s something bigger than that and maybe <br/>\nbigger than me and our relationship put together.<br/>\n<br/>\n****<br/>\nSo make your relationship with him bigger than the anger. Bigger than <br/>\nthe burdens of every day life.  Bigger than the disappointments of <br/>\nyour combined past.  <br/>\n<br/>\n*****<br/>\nI feel for my husband but he&#39;s a child himself.  For example, my DD <br/>\n9, will come up to our room to watch tv with him  he wants more <br/>\nattention than she&#39;s interested in giving (ie scratching his back, <br/>\nsnuggling, etc) so he&#39;ll resort to baiting her by pulling on her <br/>\nblanket starting a tug of war.<br/>\n<br/>\n*****<br/>\n<br/>\nHe&#39;s trying to play -- okay it&#39;s not the kind of play she wanted.  My <br/>\n23yo is kinda like that, and it makes things hard between him and the <br/>\n12yo.  The older boy is a chain-yanker, he always has been.  I&#39;ve had <br/>\nto find other ways to connect and bring him in.  <br/>\n<br/>\nReally, come over to Peaceful Partnerships at yahoo.  You&#39;ll be <br/>\namazed by what and who you find there.<br/>\n<br/>\nSylvia</div>","specialLinks":[]},{"userId":342355855,"authorName":"CPC2 CPC2","from":"&quot;CPC2 CPC2&quot; &lt;cpc2@...&gt;","profile":"pressmanm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] balance and marriage (long)","postDate":"1213788609","msgId":33849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwOTFkOGQ0MDgwNjE4MDQzMHQ3MTM1ZDkzZGk3ODc2MGU2YzllZGY0M2Q3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDE5ODkyMC4zNzQ5OS5xbUB3ZWI1MzgwOS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDE5ODkyMC4zNzQ5OS5xbUB3ZWI1MzgwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":33843,"nextInTopic":33851,"prevInTime":33848,"nextInTime":33850,"topicId":33843,"numMessagesInTopic":0,"msgSnippet":"Sylvia, Thank you.  You gave me some things to think about.  I know my husband is hurting.  He has issues and our married life has had a roller coaster ride. ","messageBody":"<div id=\"ygrps-yiv-1672656974\">Sylvia,<br/>\nThank you.  You gave me some things to think about.  I know my husband is<br/>\nhurting.  He has issues and our married life has had a roller coaster ride.<br/>\nIt is often the trials and tribulations that trigger underlying pain that<br/>\ncomes out in plain anger.  Nonetheless, I have tried but I won&#39;t enable it.<br/>\nHe&#39;s got to get in the game to be part of the team.  I have tried to offer<br/>\nsuggestions.<br/>\n<br/>\nOne point that I may be missing is where does my responsibility end<br/>\nwith the kids at the end of the day so that my husband can get some time?<br/>\nMaybe it is my control that I don&#39;t really want to leave them to their own<br/>\ndevices in the evening.  I like to be a presence.  It doesn&#39;t feel right to<br/>\nsay, &quot;you&#39;re on your own now.  see you tomorrow.&quot;  Often times I feel a<br/>\ntremendous tug between my kids and my husband.  I guess I just thought that<br/>\nparenting them was the priority.  My husband is 50!  Perhaps I am resentful<br/>\nabout as well.  Just one more piece of me to dole out.  He&#39;s not coming to<br/>\nthe plate as a parent.  It gets old when I&#39;m the one having to manage them<br/>\nall day and he&#39;s home ten minutes on a rage about the condition of the house<br/>\nbut I get that it&#39;s not the house.  It&#39;s something bigger than that and<br/>\nmaybe bigger than me and our relationship put together.<br/>\n<br/>\nI feel for my husband but he&#39;s a child himself.  For example, my DD 9, will<br/>\ncome up to our room to watch tv with him  he wants more attention than she&#39;s<br/>\ninterested in giving (ie scratching his back, snuggling, etc) so he&#39;ll<br/>\nresort to baiting her by pulling on her blanket starting a tug of war.<br/>\nShe&#39;ll ask him to stop which he won&#39;t.  I&#39;ve tried to ask that he model &quot;No<br/>\nmeans, no.  She&#39;s asked you to stop.&quot;  He keeps at the game and she storm<br/>\nout crying.<br/>\n<br/>\nAnyway, the storm has blown over for now but it will only stir up again.  I<br/>\nam worried about the emotional well being of our kids.  This just seem like<br/>\na set up for serious dysfunction that I didn&#39;t count on or was denying all<br/>\nalong.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Jun 17, 2008 at 7:42 PM, Sylvia Toyama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi Marie,<br/>\n&gt;<br/>\n&gt; I&#39;ve been away from the group for a while -- came back to see what Ren and<br/>\n&gt; Kelly are up to. &lt;g&gt;<br/>\n&gt;<br/>\n&gt; Reading your post, I had a few thought I&#39;d like to share. Okay, more than a<br/>\n&gt; few -- this got kinda long.<br/>\n&gt;<br/>\n&gt; ****<br/>\n&gt;<br/>\n&gt; For example, after a long and labor intensive day, my husband&#39;s day ends<br/>\n&gt; after dinner and in bed unwinding with TV. He misses the days when his<br/>\n&gt; children would cuddle around him but they are now 11 and 8 off doing other<br/>\n&gt; things. At 8:00 p.m. they are not thinking about<br/>\n&gt; bed. They want to read, watch their own TV. programs, play a game, etc.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; It sounds like he misses the connection he had with them whe they were<br/>\n&gt; younger. Over my years as a Mom (my kids are 23, 12 & 7, all boys)  I&#39;ve<br/>\n&gt; found that many of us &#39;connect&#39; most naturally at different ages. Some<br/>\n&gt; parents are baby-parents, others connect best with their kids at 6 or 12 or<br/>\n&gt; 16.  My experience was that when my kids were little enough for snuggling,<br/>\n&gt; reading to them, playing with them was easier.  As they got older,<br/>\n&gt; especially with my oldest (the child of my single-Mom years) it was hard to<br/>\n&gt; allow myself to sit down and play.  I felt like there was so much to do, and<br/>\n&gt; looking back at my own childhood I never really learned how to just play.  I<br/>\n&gt; got the message that play was only for very young kids, and I missed HUGE<br/>\n&gt; chunks of childhood.<br/>\n&gt;<br/>\n&gt; It&#39;s sometimes hard for my husband to connect with all the things our boys<br/>\n&gt; like to do -- they don&#39;t share similar taste in TV shows, and dh never<br/>\n&gt; learned to play board games as  a child (unimaginable to me, but true --<br/>\n&gt; he&#39;s 52yo and had never played Scrabble or Monopoly until the past few<br/>\n&gt; months!).  He has found his own way to connect.  Both boys love Garfield<br/>\n&gt; comics, so we have quite the collection of Garfield comic books and they<br/>\n&gt; love to have Dad read those to them.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; They want me to join them and I do. I like to put my daughter to bed and<br/>\n&gt; read to her then spend some time unraveling the day with my son. By the time<br/>\n&gt; all this is said and done it is 10:30 and DH has fallen asleep often ticked<br/>\n&gt; off.<br/>\n&gt;<br/>\n&gt; ****<br/>\n&gt; I can understand why your dh would be ticked off.  You&#39;ve been with the<br/>\n&gt; kids all day -- he&#39;s been away from all of you all day long.  He comes home<br/>\n&gt; and you leave him to spend the evening by himself.  He likely feels like a<br/>\n&gt; outsider -- an outsider who is giving up his free time to make a life for<br/>\n&gt; the folks who shut him out.  That&#39;s gotta hurt!<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; Sadly, he can&#39;t sit still. Always working or working on the house. The kids<br/>\n&gt; just want to enjoy time with him. He can&#39;t. He won&#39;t.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; I&#39;m confused here -- you said in the first paragraph that he ends his day<br/>\n&gt; watching tv by 8pm.  Sounds like he can sit still and relax, but no one is<br/>\n&gt; willing to reach out to ask him what he&#39;d like to do or do it with him.  Is<br/>\n&gt; it possible for someone else (you or hired help?) to do those things around<br/>\n&gt; the house that take so much of your dh&#39;s time?  Maybe if he could the work<br/>\n&gt; was less imperitive he&#39;d feel like he had more time to be with the kids and<br/>\n&gt; you.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; I think he would like to but he can&#39;t sit still long enough to engage with<br/>\n&gt; the kids. Doesn&#39;t want to play, doesn&#39;t enjoy playing. I could just cry<br/>\n&gt; rivers for my son who just wants his bad to play catch with him. He won&#39;t<br/>\n&gt; even let me catch with him now because it just<br/>\n&gt; emphasize more the point that his Dad doesn&#39;t want to. I&#39;ve tried to<br/>\n&gt; explain that there are days when I don&#39;t want to play either but it brings<br/>\n&gt; me closer to them when I can let go.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; Do you have any sympathy for the little boy in your husband who doesn&#39;t<br/>\n&gt; enjoy playing?  I&#39;ve been that person who felt disconnected from being able<br/>\n&gt; to have fun, wondering why everyone else can relax and play but I can&#39;t.  I<br/>\n&gt; figured out it was damage from my childhood trauma.  I found ways to heal<br/>\n&gt; it, but still it can be hard for me to just play.  I just spent the last 3<br/>\n&gt; hrs building a new lego set with my 7yo, and the time flew by -- what amazed<br/>\n&gt; me most is that I enjoyed the building and playing, I didn&#39;t feel the old<br/>\n&gt; familiar tug to be up &#39;doing something worthwhile.&#39;<br/>\n&gt;<br/>\n&gt; You said your dh misses snuggling with the kids -- maybe he&#39;s a<br/>\n&gt; baby-parent.  I used to be one of those.  When my oldest son turned 4, I<br/>\n&gt; found myself suddenly not enjoying playing with him -- and very impatient<br/>\n&gt; with him for being so &#39;helpless and immature.&#39;  What had happened?  I found<br/>\n&gt; that I felt a very visceral anger at having to make time to play with him --<br/>\n&gt; hadn&#39;t I done enough? Shouldn&#39;t he be bored with me by now and ready to play<br/>\n&gt; alone?  Nope, not my sweet boy -- and thank goodness!  After a lot of time<br/>\n&gt; spent faking til I felt it and examining my own childhood, I figured it<br/>\n&gt; out.  My younger sister came along when I was 4 (my brother was only 14mos<br/>\n&gt; younger than me, so he&#39;d been a playmate) -- as the oldest daughter of a<br/>\n&gt; very busy, very unhappy Mom, I was expected to &#39;help out with my sister.&#39;<br/>\n&gt; My childhood ended there.  I no longer had the luxury of just playing, never<br/>\n&gt; had a moment (except at<br/>\n&gt;  school) when I wasn&#39;t responsible for my siblings, when I wasn&#39;t expected<br/>\n&gt; to be the &#39;big girl.&#39; My parents even refered to us kids as &#39;Sylvia & the<br/>\n&gt; kids&#39; -- I wasn&#39;t even a kid anymore!<br/>\n&gt;<br/>\n&gt; Do you kow your dh&#39;s childhood well enough to know if there was some magic<br/>\n&gt; age when he got the message he was supposed to stop playing? to be an<br/>\n&gt; adult?  Have you ever asked him why he doesn&#39;t &#39;want&#39; to play?  I think most<br/>\n&gt; of us want to play -- everyone wants to be happy -- but in the mix is all<br/>\n&gt; the crap someone else dumped us in our lives.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; I can already see that DH has missed that window of opportunity to connect<br/>\n&gt; with the children.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; He&#39;s the ogre to all of us some days and they just don&#39;t want any part of<br/>\n&gt; it. I can&#39;t blame them.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; Ogres are really just people who hurt.  It sounds like this is a change in<br/>\n&gt; the dynamics of things -- he used to enjoy the kids and his life but now he<br/>\n&gt; doesn&#39;t.  Like my past where when my kids have hit different ages, I&#39;ve had<br/>\n&gt; to muck thru my own baggage from the little girl I was at those ages.  It<br/>\n&gt; never ceases to amaze me how finding myself the mother of a 4 or 12 or 16 yo<br/>\n&gt; child took me right back to being that sad, angry, hurt child myself.  It<br/>\n&gt; hurt, it scared me because I didn&#39;t see how I&#39;d be any better at than my<br/>\n&gt; parents had been, my own deep anger scared the daylights out of me.  Is it<br/>\n&gt; possible your dh is feeling some of the same things?<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; They are gun shy so to speak. It&#39;s not all doom and gloom but I know that<br/>\n&gt; it&#39;s those scary moments we hold onto in our memory often diminish the good<br/>\n&gt; times.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; So don&#39;t hold onto those scary moments -- hold on to the good ones instead<br/>\n&gt; and use them to invite your husband back into the fold.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; At the same time, he loves his children so much. Our 11 DS still sleeps<br/>\n&gt; with us and he loves that he&#39;s right there beside him recalling that he<br/>\n&gt; never had that growing up. His parents were very controlling and raised kids<br/>\n&gt; to be seen and not heard. For<br/>\n&gt; him, it has been a huge leap of faith to allow his children more freedom<br/>\n&gt; than he ever had.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; Not only a huge leap of faith, but I found resentment and anger welling up<br/>\n&gt; in me.  How could it be that no one who was supposed to love me ever saw how<br/>\n&gt; much I hurt?  If I can see and know a better way, why did no one do that for<br/>\n&gt; me?  Yeah I want to give my kids the very best I have to offer, but first I<br/>\n&gt; needed to make some amends with the little girl who felt so cheated, so<br/>\n&gt; deeply unloved.<br/>\n&gt;<br/>\n&gt; I read somewhere years ago that it&#39;s virtually impossible to give what we<br/>\n&gt; don&#39;t know.  That doesn&#39;t mean we can&#39;t find a way to give it to our kids --<br/>\n&gt; it means that sometimes we first need to give it to ourselves since no one<br/>\n&gt; else did.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; He&#39;s doing his best, but sometimes it&#39;s hard to feel that his best is good<br/>\n&gt; enough. Soothing the hurt and saying, &quot;�.but your Dad loves you so much&quot;<br/>\n&gt; isn&#39;t much to go on<br/>\n&gt; anymore.<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt; So help your kids and dh find ways to reach each other.  A way to have good<br/>\n&gt; enough and more.  Help him break the cycle.<br/>\n&gt;<br/>\n&gt; I&#39;d like to recommend an egroup here -- for unschooling parents who want to<br/>\n&gt; use unschooling methods to make a happier, more peaceful partnership. It&#39;s<br/>\n&gt; called Peaceful Partnerships<br/>\n&gt;<br/>\n&gt; Sign up there and read the archives -- you&#39;ll find some great stories and<br/>\n&gt; perspective.<br/>\n&gt;<br/>\n&gt; Sylvia<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n-- <br/>\nMarie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"balance and marriage (long)","postDate":"1213746146","msgId":33843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ODkyMC4zNzQ5OS5xbUB3ZWI1MzgwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":33849,"prevInTime":33842,"nextInTime":33844,"topicId":33843,"numMessagesInTopic":0,"msgSnippet":"&nbsp; Hi Marie, &nbsp; I ve been away from the group for a while -- came back to see what Ren and Kelly are&nbsp;up to.  &nbsp; Reading your post, I had a","messageBody":"<div id=\"ygrps-yiv-2021480909\">&nbsp;<br/>\nHi Marie,<br/>\n&nbsp;<br/>\nI&#39;ve been away from the group for a while -- came back to see what Ren and Kelly are&nbsp;up to. &lt;g&gt; <br/>\n&nbsp;<br/>\nReading your post, I had a few thought I&#39;d like to share. Okay, more than a few -- this got kinda long.&nbsp; <br/>\n&nbsp;<br/>\n****<br/>\n&nbsp;<br/>\nFor example, after a long and labor intensive day, my husband&#39;s day ends after dinner and in bed unwinding with TV. He misses the days when his children would cuddle around him but they are now 11 and 8 off doing other things. At 8:00 p.m. they are not thinking about <br/>\nbed. They want to read, watch their own TV. programs, play a game, etc. <br/>\n&nbsp;<br/>\n*****<br/>\nIt sounds like he misses the connection he had with them whe they were younger. Over my years as a Mom (my kids are 23, 12 &amp; 7, all boys)&nbsp; I&#39;ve found that many of us &#39;connect&#39; most naturally at different ages. Some parents are baby-parents, others connect best with their kids at 6 or 12 or 16.&nbsp; My experience was that when my kids were little enough for snuggling, reading to them, playing with them was easier.&nbsp; As they got older, especially with my oldest (the child of my single-Mom years) it was hard to allow myself to sit down and play.&nbsp; I felt like there was so much to do, and looking back at my own childhood I never really learned how to just play.&nbsp; I got the message that play was only for very young kids, and I missed HUGE chunks of childhood. <br/>\n&nbsp;<br/>\nIt&#39;s sometimes hard for my husband to connect with all the things our boys like to do -- they don&#39;t share similar taste in TV shows, and dh never learned to play board games as&nbsp; a child (unimaginable to me, but true -- he&#39;s 52yo and had never played Scrabble or Monopoly until the past&nbsp;few months!).&nbsp;&nbsp;He&nbsp;has found&nbsp;his own way to connect.&nbsp;&nbsp;Both boys love Garfield comics,&nbsp;so we have quite the collection&nbsp;of Garfield comic books and they love to have Dad read those to them.&nbsp; &nbsp;<br/>\n&nbsp;<br/>\n*****<br/>\n&nbsp;<br/>\nThey want me to join them and I do. I like to put my daughter to bed and read to her then spend some time unraveling the day with my son. By the time all this is said and done it is 10:30 and DH has fallen asleep often ticked off. <br/>\n<br/>\n****<br/>\nI can understand why your dh would be ticked off.&nbsp; You&#39;ve been with the kids all day -- he&#39;s been away from all of you all day long.&nbsp; He comes home and you leave him to spend the evening by himself.&nbsp; He likely feels like a outsider -- an outsider who is giving up his free time to make a life for the folks who shut him out.&nbsp; That&#39;s gotta hurt!<br/>\n&nbsp;<br/>\n*****<br/>\n<br/>\nSadly, he can&#39;t sit still. Always working or working on the house. The kids just want to enjoy time with him. He can&#39;t. He won&#39;t. <br/>\n&nbsp;<br/>\n*****<br/>\nI&#39;m confused here -- you said in the first paragraph that he ends his day watching tv by 8pm.&nbsp; Sounds like he can sit still and relax, but no one is willing to reach out to ask him what he&#39;d like to do or do it with him.&nbsp; Is it possible for someone else (you or hired help?) to do those things around the house that take so much of your dh&#39;s time?&nbsp; Maybe if he could the work was less imperitive he&#39;d feel like he had more time to be with the kids and you.&nbsp; <br/>\n&nbsp;<br/>\n*****<br/>\nI think he would like to but he can&#39;t sit still long enough to engage with the kids. Doesn&#39;t want to play, doesn&#39;t enjoy playing. I could just cry rivers for my son who just wants his bad to play catch with him. He won&#39;t even let me catch with him now because it just <br/>\nemphasize more the point that his Dad doesn&#39;t want to. I&#39;ve tried to explain that there are days when I don&#39;t want to play either but it brings me closer to them when I can let go. <br/>\n<br/>\n*****<br/>\nDo you have any sympathy for the little boy in your husband who doesn&#39;t enjoy playing?&nbsp; I&#39;ve been that person who felt disconnected from being able to have fun, wondering why everyone else can relax and play but I can&#39;t.&nbsp; I figured out it was damage from my childhood trauma.&nbsp; I found ways to heal it, but still it can be hard for me to just play.&nbsp; I just spent the last 3 hrs building a new lego set with my 7yo, and the time flew by -- what amazed me most is that I enjoyed the building and playing, I didn&#39;t feel the old familiar tug to be up &#39;doing something worthwhile.&#39;&nbsp; <br/>\n&nbsp;<br/>\nYou said your dh misses snuggling with the kids -- maybe he&#39;s a baby-parent.&nbsp; I used to be one of those.&nbsp; When my oldest son turned 4, I found myself suddenly not enjoying playing with him -- and very impatient with him for being so &#39;helpless and immature.&#39;&nbsp; What had happened?&nbsp; I found that I felt a very visceral anger at having to make time to play with him -- hadn&#39;t I done enough? Shouldn&#39;t he be bored with me by now and ready to play alone?&nbsp; Nope, not my sweet boy -- and thank goodness!&nbsp; After a lot of time spent faking til I felt it and examining my own childhood, I figured it out.&nbsp; My younger sister came along when I was 4 (my brother was only 14mos younger than me, so he&#39;d been a playmate) -- as the oldest daughter of a very busy, very unhappy Mom, I was expected to &#39;help out with my sister.&#39;&nbsp;&nbsp; My childhood ended there.&nbsp; I no longer had the luxury of just playing, never had a moment (except at<br/>\n school) when I wasn&#39;t responsible for my siblings, when I wasn&#39;t expected to be the &#39;big girl.&#39; My parents even refered to us kids as &#39;Sylvia &amp; the kids&#39; -- I wasn&#39;t even a kid anymore!&nbsp; <br/>\n&nbsp;<br/>\nDo you kow your dh&#39;s childhood well enough to know if there was some magic age when he got the message he was supposed to stop playing? to be an adult?&nbsp; Have you ever asked him why he doesn&#39;t &#39;want&#39; to play?&nbsp; I think most of us want to play -- everyone wants to be happy -- but in the mix is all the crap someone else dumped us in our lives.&nbsp; <br/>\n&nbsp;<br/>\n*****<br/>\nI can already see that DH has missed that window of opportunity to connect with the children.<br/>\n&nbsp;<br/>\n*****<br/>\n&nbsp;<br/>\nHe&#39;s the ogre to all of us some days and they just don&#39;t want any part of it. I can&#39;t blame them.<br/>\n&nbsp;<br/>\n*****<br/>\nOgres are really just people who hurt.&nbsp; It sounds like this is a change in the dynamics of things -- he used to enjoy the kids and his life but now he doesn&#39;t.&nbsp; Like my past where when my kids have hit different ages, I&#39;ve had to muck thru my own baggage from the little girl I was at those ages.&nbsp; It never ceases to amaze me how finding myself the mother of a 4 or 12 or 16 yo child took me right back to being that sad, angry, hurt child myself.&nbsp; It hurt, it scared me because I didn&#39;t see how I&#39;d be any better at than my parents had been, my own deep anger scared the daylights out of me.&nbsp; Is it possible your dh is feeling some of the same things?<br/>\n&nbsp;<br/>\n*****<br/>\nThey are gun shy so to speak. It&#39;s not all doom and gloom but I know that it&#39;s those scary moments we hold onto in our memory often diminish the good times.<br/>\n&nbsp;<br/>\n*****<br/>\nSo don&#39;t hold onto those scary moments -- hold on to the good ones instead and use them to invite your husband back into the fold.&nbsp; <br/>\n&nbsp;<br/>\n*****<br/>\n&nbsp;<br/>\nAt the same time, he loves his children so much. Our 11 DS still sleeps with us and he loves that he&#39;s right there beside him recalling that he never had that growing up. His parents were very controlling and raised kids to be seen and not heard. For <br/>\nhim, it has been a huge leap of faith to allow his children more freedom than he ever had.<br/>\n&nbsp;<br/>\n*****<br/>\nNot only a huge leap of faith, but I found resentment and anger welling up in me.&nbsp; How could it be that no one who was supposed to love me ever saw how much I hurt?&nbsp; If I can see and know a better way, why did no one do that for me?&nbsp; Yeah I want to give my kids the very best I have to offer, but first I needed to make some amends with the little girl who felt so cheated, so deeply unloved.&nbsp; <br/>\n&nbsp;<br/>\nI read somewhere years ago that it&#39;s virtually impossible to give what we don&#39;t know.&nbsp; That doesn&#39;t mean we can&#39;t find a way to give it to our kids -- it means that sometimes we first need to give it to ourselves since no one else did. <br/>\n&nbsp;<br/>\n*****<br/>\nHe&#39;s doing his best, but sometimes it&#39;s hard to feel that his best is good enough. Soothing the hurt and saying, &quot;�.but your Dad loves you so much&quot; isn&#39;t much to go on <br/>\nanymore.<br/>\n<br/>\n*****<br/>\nSo help your kids and dh find ways to reach each other.&nbsp; A way to have good enough and more.&nbsp; Help him break the cycle.&nbsp; <br/>\n&nbsp;<br/>\nI&#39;d like to recommend an egroup here -- for unschooling parents who want to use unschooling methods to make a happier, more peaceful partnership.&nbsp;It&#39;s called Peaceful Partnerships&nbsp; <br/>\n&nbsp;<br/>\nSign up there and read the archives -- you&#39;ll find some great stories and perspective.&nbsp; <br/>\n&nbsp;<br/>\nSylvia<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33838,"nextTopicId":33842}}