{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"At a loss","postDate":"1164559879","msgId":19314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOERGOTIzQUQyRTNCQi1GNjgtREE1N0BNQkxLLU0wMi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19313,"nextInTime":19315,"topicId":19314,"numMessagesInTopic":0,"msgSnippet":"Robyn Coburn, who no longer posts here at UB had a similar situation. I asked for her suggestions. Here s her response: Robyn: 4 first-step solutions  - imho","messageBody":"<div id=\"ygrps-yiv-1765326130\">Robyn Coburn, who no longer posts here at UB had a similar situation. I <br/>\nasked for her suggestions. Here&#39;s her response:<br/>\n<br/>\n<br/>\n<br/>\nRobyn:<br/>\n<br/>\n4 first-step solutions  - imho :)<br/>\n<br/>\n1. The time has come to speak to the other children&#39;s parents about some<br/>\nlimits on the time being spent. They are using this mom as free child <br/>\ncare<br/>\nfor the little one.<br/>\n<br/>\nPlus they are using her house as therapy for the little boys post <br/>\nschool day<br/>\nangst.<br/>\n<br/>\nOne phrase that conventional parents tend to get is &quot;we need some family<br/>\ntime.&quot;<br/>\n<br/>\nA long time ago the first thing I did was say &quot;one kid at a time&quot;. That <br/>\nhas<br/>\nits own problems - they got very hung up on taking turns, but Jayn only<br/>\nwanted one all the time, not the other. If the dd in this case likes <br/>\nboth<br/>\nkids, it is worth putting the onus on the other family to work out how <br/>\nthey<br/>\ndivide the (much reduced) time.<br/>\n<br/>\n2. Talk to dd honestly about mom&#39;s feelings. It is ok and right to<br/>\nacknowledge that you have negative feelings about the impact of this <br/>\nlittle<br/>\nboy in your life. Just because it is &quot;not all about me&quot; (and it sounds <br/>\nlike<br/>\nher son is being negatively effected too and trying to give a hint in <br/>\nthat<br/>\ndirection) does not mean that it must be &quot;I don&#39;t matter at all&quot;.<br/>\n<br/>\n3. Just because you don&#39;t have rules in your house, doesn&#39;t mean every <br/>\nother<br/>\nchild knows how to respond in a principled manner. These kids evidently <br/>\nneed<br/>\nconsideration and courtesy expressed as rules, in a firm manner.<br/>\n<br/>\n4. The dd needs more and other friends. More out of the house at <br/>\noutings,<br/>\nplaydates, museums (go on the free days), h/s park days.<br/>\n<br/>\nThis ties back with #1 - telling the other mom that you will not be<br/>\navailable on thus and such a day.<br/>\n<br/>\nHere is the post I made when I came to the decision that I needed to <br/>\nprotect<br/>\nmy dd from a neighbor child recently. I had given it a fair trial of 2.5<br/>\nyears, and it was because of Jayn&#39;s clearly manifested huge stress in <br/>\nthe<br/>\nform of extraordinary behavioral changes. As it turned out Jayn&#39;s <br/>\nproblem<br/>\nbehaviors vanished within days. I now am convinced that she was asking <br/>\nto be<br/>\nrescued.<br/>\n<br/>\nFor us it had to be a complete cut off. It has worked out well, since I <br/>\nsent<br/>\na letter to the parents. At first there was a lot of resentment being<br/>\nexpressed in the form of mean songs being sung and dark looks - the mom<br/>\nactually encouraged her son to sing mean rhyming songs at Jayn and <br/>\nsmirked<br/>\nabout it. After the letter I sent, which was not blaming or accusatory, <br/>\nthey<br/>\nnow just pretty much ignore us, and we them. Jayn has new friends, who<br/>\nironically are 5 and 3 - and are the dearest little children. But their <br/>\nMom<br/>\nis inspirationally mindful too.<br/>\n<br/>\nQuote begins:<br/>\n<br/>\n&lt;&lt;&lt;  After some two and a half years of painful observation, occasional<br/>\nposts, and a lot of heart searching and self questioning (which <br/>\ncontinues)<br/>\nJames and I have decided to take a tough stand and stop all contact <br/>\nbetween<br/>\nJayn (6.5) and our neighbor from along the balcony, a girl two years <br/>\nolder.<br/>\n<br/>\nI have posted in the past about how I had tried to limit contact by <br/>\nkeeping<br/>\nJayn very busy and out–and-about, with the probably inevitable result <br/>\nthat<br/>\nJayn simply became more and more obsessed with playing with “R” at every<br/>\nopportunity, including abandoning a visitor. Following the painful<br/>\nrealization that limiting didn’t “work”, I hoped that just letting Jayn <br/>\nplay<br/>\nwith her would allow Jayn to get it out of her system. Some time later, <br/>\nit<br/>\nwasn’t happening and Jayn was starting to change and be harmed by the<br/>\nfriendship.<br/>\n<br/>\nJayn’s intense preoccupation with swimming with R, playing with R, <br/>\ntalking<br/>\nabout R, wanting to go home in order to see if R was home, suddenly <br/>\nrefusing<br/>\nto go to planned events if R said she “might” be available later, was<br/>\nstarting to have a deleterious effect on Jayn’s desire and ability to <br/>\nengage<br/>\nwith many of her other friends. It was very disturbing. However that <br/>\nwasn’t<br/>\nthe most serious problem.<br/>\n<br/>\n  Over time I became increasingly uncomfortable with what I observe is <br/>\nR’s<br/>\nnegative influence on Jayn – she was bringing schoolish peer-centered <br/>\nvalues<br/>\nand the detritus of authoritarian parenting into our home. She was <br/>\nteaching<br/>\nJayn to be distrustful of adults, including or especially James and I. <br/>\nShe<br/>\nwas modeling manipulative speech, bribery and sneakiness. Irritatingly, <br/>\nshe<br/>\nkept offering to “teach” Jayn things like how to do math or read – with <br/>\nthe<br/>\nclear insinuation that Jayn was lacking (Jayn said always said no in <br/>\nfavor<br/>\nof playing other games). She would tell me that I should be “making <br/>\nJayn” do<br/>\ncertain things like tidy her own toys. She continued to try and engage <br/>\nJayn<br/>\nin whispered conversations to keep secrets, including not telling that <br/>\nR had<br/>\na cold. (We don’t allow sick kids to visit, and she *and her parents* <br/>\nknow<br/>\nit.) She still kept trying to get Jayn to go to the bathroom with her. <br/>\nShe<br/>\nstill, after 2 years, kept trying (without success because I would <br/>\ninstantly<br/>\ntell her to stop) to invent games that would let her put her hands down<br/>\nJayn’s swimsuit if she thought I wasn’t looking.<br/>\n<br/>\n  She continued to wage an ongoing, relentless campaign belittling her <br/>\nown<br/>\nlittle brother whenever possible, especially if Jayn showed any sign of<br/>\nbeing interested in playing with him. (These siblings are constantly at <br/>\nwar,<br/>\ncompeting for a thing just because the other has it, and both very <br/>\nadept in<br/>\nmanipulating situations so that the other one gets into trouble.) I feel<br/>\nlike *such* an *idiot* for not seeing that this was the cause of Jayn’s<br/>\ninexplicable sudden antipathy to him last fall, despite them playing <br/>\nwell<br/>\ntogether often in the past. This was starting to spill over into Jayn’s<br/>\nbehavior and treatment of other boys, and men, as well.<br/>\n<br/>\n Jayn often appeared to be under stress after a play date, or a swim<br/>\nsession. Swimming with the whole group was always particularly <br/>\nstressful and<br/>\npunctuated with near continual exhausting conflicts, and R encouraging <br/>\nJayn<br/>\nto be mean to her brother and join her in taunting him. After any swim <br/>\nor<br/>\nplay date Jayn would be wild, antsy, angry seeming. It took me a while <br/>\nto<br/>\nsee the correlation with a longish time with R of an afternoon (and <br/>\nrecall<br/>\nthat this “long time” is relative, since R is schooled) and Jayn’s <br/>\nreally<br/>\nunpleasant manifestations of what I thought was merely 6.5 year old <br/>\nangst. I<br/>\nmean she would be violent, angry and particularly nasty verbally and<br/>\nphysically to her father, just beyond anything remotely expected.<br/>\n<br/>\n  The final straw was during what turned out to be the final play date <br/>\njust<br/>\nover two weeks ago, when I came out from the other room to find Jayn <br/>\nopening<br/>\na package of fabric paints, and behaving very furtively about it. <br/>\nFurtive.<br/>\nSneaky. Startling when I came in and acting guilty. My point here is <br/>\nthat<br/>\nthis is an undesirable learned behavior. They were Jayn’s paints and <br/>\nshe was<br/>\ncompletely free to open them and use them whenever she wanted. She has<br/>\nabsolutely zero reason to be fearful of James or I, or behave sneakily, <br/>\nyet<br/>\nthis other rotten apple was tainting Jayn with her sadly negative<br/>\nexperiences of adults in her life.<br/>\n<br/>\n I have never liked R, although we all liked her little brother when we<br/>\nfirst met him. (I’ve gone off him a bit since he started advising me to<br/>\nspank Jayn to “make her” be nicer. They find it hard to fathom that <br/>\nJayn is<br/>\nnever punished.) I feared that I was just being prejudiced against her<br/>\nbecause she is schooled, in the sense that I really want the majority of<br/>\nJayn’s friendships to be with home schooled and mindfully parented <br/>\nchildren<br/>\nwhile she is so young especially. These are also the parents that I <br/>\nfeel I<br/>\ncan have pleasant relationships with, which is not the case with R’s<br/>\nparents. I felt so sorry for R because I know she is sometimes spanked,<br/>\noften shamed, treated with distrust and all the commonplace <br/>\nmistreatments of<br/>\nconventional parenting. I have noticed her somewhat mean spirited<br/>\ndestructiveness in the past – like deliberately pouring out all the <br/>\npaint<br/>\ndown the sink in the guise of tidying up. She and her brother have been<br/>\nproven careless of borrowed toys too (so “no more loans” was instituted <br/>\nas<br/>\npolicy a while back.).<br/>\n<br/>\nYet in all of this I was so ambivalent. I knew that my essentially <br/>\ndishonest<br/>\nlimiting strategy (not that the dishonesty was intentional) had failed. <br/>\nI<br/>\nfelt desperate to do something differently. It seemed somehow wrong, <br/>\nsomehow<br/>\nagainst every mindful philosophy to not trust Jayn to see the negatives <br/>\nof<br/>\nthis other horrible child. I was being eaten up with anxiety. I was <br/>\nbeing<br/>\nexcessively watchful, anticipating problems which R must surely have <br/>\nfelt<br/>\n(probably felt normal to her). I was utterly dreading the school summer<br/>\nvacation. Stress and resentment were emanating from me, tainting every<br/>\nwaking moment that I was at home. I was haranguing James about moving <br/>\nhouse.<br/>\n(He is a saint!) But this wasn’t a negative portrayal on a tv show, <br/>\nthis was<br/>\na real person that Jayn had often expressed affection for.<br/>\n<br/>\n Suddenly it came to me in a huge flash that I had never shared my<br/>\nmisgivings about R’s character or behavior with Jayn. I was living a <br/>\ngiant<br/>\nlie between myself and my precious dd that this other girl was OK.<br/>\n<br/>\nSure James and I had put a stop to individual behaviors as they <br/>\noccurred,<br/>\nlike telling R not to take Jayn to the bathroom, or to ask for a drink, <br/>\nand<br/>\nnot just root around nosily in our fridge. He was especially good at <br/>\ndealing<br/>\nwith swimming session crapola.<br/>\n<br/>\nBut if it *was* a negative portrayal on a tv show I *would* talk about <br/>\nwhy.<br/>\nI have done that very thing. I have expressed my concerns and advice <br/>\nabout<br/>\nother things we have seen or read or heard or that Jayn wanted to do <br/>\nthat<br/>\nwere dangerous or scary or counter to our values and principles. Yet I <br/>\nfelt<br/>\nlike it was unfair or different to express these increasingly strong<br/>\nfeelings about a person.<br/>\n<br/>\nFinally, I have told Jayn that I don’t like R, and described some of the<br/>\nissues I felt she was bringing in to our lives that were negative. I <br/>\ntold<br/>\nher the relationship would have to end. I was ready to<br/>\naccept/support/validate her anger and resentment for as long as needed. <br/>\nJayn<br/>\nwas thunderstruck and seemed initially deeply hurt, but then she got <br/>\nover it<br/>\nastonishingly quickly after only the briefest cry. I apologized for not<br/>\nbeing fully honest with her (my other *huge* concern – fortunately her <br/>\ntrust<br/>\nin me seems to be restored). I also told her that we (Daddy and I) felt<br/>\nextremely strongly about this decision to take such an extraordinary <br/>\nstep,<br/>\nwhich should be clear since we do give her so much freedom of choice in <br/>\nher<br/>\ndaily life. And she apparently understood that too.<br/>\n<br/>\n  I realized that if Jayn were about to drink poison, I wouldn’t just <br/>\nsay,<br/>\n“That’s a bad idea.” I would take it from her as forcibly as necessary, <br/>\nand<br/>\nthen explain. In fact I used this analogy – which Jayn got instantly – <br/>\nin<br/>\none of the subsequent conversations we have had over the last two and a <br/>\nbit<br/>\nweeks about why Daddy and I were instituting this extreme restriction <br/>\ninto<br/>\nher life.<br/>\n<br/>\nThe results of saying “no more” have been amazingly, startlingly<br/>\n(thankfully) good.<br/>\n<br/>\nThere were a couple of crying moments, especially when Jayn saw the <br/>\nothers<br/>\nswimming and wanted to swim with them. However it was quite literally <br/>\nonly a<br/>\ncouple of times that she argued half-heartedly with our dictate – and <br/>\nthen<br/>\nbecame extraordinarily cheerful after she accepted the “no”. More <br/>\nsurprise<br/>\nfor me at this additional relatively calm reaction.  I can’t prove it, <br/>\nbut<br/>\nI’m starting to sense that Jayn was glad to be rescued.<br/>\n<br/>\nJayn’s behavior and treatment of us has been markedly improved – kinder,<br/>\nmore willing to play with us, more affectionate especially towards <br/>\nJames. I<br/>\nhave had to do a lot more swimming but that’s a good thing, and we have <br/>\nmade<br/>\nmany efforts to be out of the house at interesting places in the crucial<br/>\nmid-afternoon period of big group swims. Jayn has apparently embraced<br/>\nplaying with her other friends (of a range of ages) with gusto, and I am<br/>\nseeing much less of the “mean to boys” stuff. She is still loud and<br/>\nsometimes has a hard time settling in the evening, needing big <br/>\nmovements and<br/>\nto push on us physically – but it is less often and less intense.<br/>\n<br/>\nSome of Jayn’s games have been regressions to things she liked to do a <br/>\nyear<br/>\nor more ago (like she feels freer to do these babyish things without <br/>\nbeing<br/>\njudged maybe?) and I have been playing a lot more Barbie and similar <br/>\ngames<br/>\nthan I had been recently. I have redoubled my efforts to be available <br/>\nto her<br/>\n(which is one part of why you have seen so little of me on line), and <br/>\nso has<br/>\nJames.<br/>\n<br/>\n  I should also say that one of the reasons that this came to head just <br/>\nnow<br/>\nhas been a development in our sleeping schedule. Hold on to your hats, <br/>\nthose<br/>\nwho have been cognizant of our round the clock creep of the last few <br/>\nyears.<br/>\nWe have been “holding” at going to sleep around 3-3.30am and getting up<br/>\nbetween 11 and 1.30 every day for NINE weeks – two whole months of<br/>\nregularity. However the flip side of this has been that without our <br/>\nnights<br/>\nor super early to bed weeks we had been regularly available to R in the<br/>\nafternoons after she had done her homework. The whole problem might have<br/>\nbeen clearer and more readily apparent if we had not had those times of<br/>\nrespite.<br/>\n<br/>\n  There is plenty here to beat myself up over. But at the heart of it is <br/>\nmy<br/>\nregret that I wasn’t clearer and more honest about my feelings with <br/>\nJayn. I<br/>\nwasn’t listening to my heart – or rather was being too high minded to <br/>\nlisten<br/>\nto my heart fully. Or something. I would hate this to be taken as an<br/>\nendorsement of limiting our child’s choices, yet that is what I am <br/>\ndoing –<br/>\nconsciously and mindfully. I’m still conflicted in some ways. I doubt <br/>\nthis<br/>\nwill be the last person Jayn likes that I may not. But she’s so young<br/>\nstill….but…but….hard stuff.<br/>\n<br/>\nMaybe in the fullness of time Jayn would have become sated. Maybe R <br/>\nwould<br/>\nhave done some horrible, hurtful thing and Jayn would have rejected <br/>\nher. But<br/>\nthis was more like a frog in a pot – slowly getting boiled without <br/>\nrealizing<br/>\nit. I keep coming back to the poison analogy, and recalling the fact <br/>\nthat I<br/>\nthink 2.5 years is a pretty fair trial.<br/>\n<br/>\n Also Jayn is clearly happier, and seems to be returning to the pure<br/>\nsweetness she used to have, although she is still very wary whenever she<br/>\nsees R’s brother particularly.<br/>\n<br/>\n OTOH, R is walking around these days with a thunderous scowl. Jayn<br/>\nunfortunately told her that I “didn’t want them to be best friends <br/>\nanymore”<br/>\nwhen she came to the door one day. True as that is, I had been <br/>\npracticing<br/>\navoidance (procrastination), while I determined a strategy for speaking <br/>\nto<br/>\nher mother – I was thinking something along the lines of them “not <br/>\nbeing a<br/>\ngood fit anymore as R was getting more mature” and our needing to focus <br/>\nmore<br/>\non our home schooled associates. She has been defensive and combative <br/>\nwhen I<br/>\nhave tried to express concerns about R’s behavior in the past, and I <br/>\ndaresay<br/>\nshe will be sorry to lose the absolute convenience of sending R down the<br/>\nhall instead of having to take her to a friend’s place. R is missing <br/>\nJayn’s<br/>\ntoys too I’m sure. But she will be in summer day camp soon and will <br/>\nsurely<br/>\ncheer up then.<br/>\n<br/>\nIt was not my intention to hurt R’s feelings – I had just said a couple <br/>\nof<br/>\ntimes that Jayn wasn’t available when R came to the door. Now mother is<br/>\naverting her face when she passes us in the pool. At least they aren’t<br/>\nhitting me up for my precious quarters every washday anymore. I wonder <br/>\nif I<br/>\nwill ever again see my copy of “Punished by Rewards”.  Small price to <br/>\npay.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Here is something else that I wrote in response to ongoing discussion <br/>\non my<br/>\nlocal U/S list.<br/>\n<br/>\n&lt;&lt;&lt;It is the concept of restricting their contact today, rather than<br/>\ncontinuing to watch and wait and spend every day suppressing my anguish,<br/>\nthat I have a certain amount of inner conflict about - but increasingly <br/>\nless<br/>\nstress every day as we continue. (Is &quot;increasingly less&quot; a real phrase?<br/>\nYKWIM hopefully.)<br/>\n<br/>\nI realize too that much of the ambivalence was more to do with *my<br/>\nassumptions* about what expectations of me other people in the RU <br/>\ncommunity<br/>\nmight have - applying the theory in a very difficult practical <br/>\nsituation -<br/>\nas I continue to work through this here and on other lists.<br/>\n<br/>\nI am kinda wondering whether I was failing Unschooling, or Unschooling <br/>\nwas<br/>\nfailing me on this issue. In passing I will mention that James has none <br/>\nof<br/>\nthese doubts - he is absolutely convinced 100% that we are doing the <br/>\nright<br/>\nthing, and wishes we did it sooner.<br/>\n<br/>\nIn the end it is something that is a &quot;whole family&quot; problem - and as<br/>\nimportant and focal to our (James and my) lives as Jayn is, our family<br/>\nhappiness as a whole is the crucial deciding issue. Having a peaceful, <br/>\nhappy<br/>\nhome is priority one. It is when in situations of conflicting needs I <br/>\nfail<br/>\nto mentally ask the question, &quot;What action will bring the most peace and<br/>\ncreate the most happiness?&quot; that I make poorer choices.<br/>\n<br/>\nOther internal scripts include &quot;What loving action can I make right <br/>\nnow?&quot;<br/>\nwhen Jayn is distressed, and &quot;What is the behavior I would wish to <br/>\nsee?&quot; to<br/>\nremind myself to model it. The moment I forget my scripts the more <br/>\nbogus my<br/>\nchoices tend to be, the less Ease and Serenity in all our lives!<br/>\n<br/>\nI have received a lot of very welcome feedback and support here, on <br/>\nother<br/>\nlists and privately. The most warmly expressed approbation has come from<br/>\npeople who have been through something similar with a child that was a <br/>\ntoxic<br/>\ninvading presence in their family.<br/>\n<br/>\nOTOH, some responses have come from people who clearly have never had <br/>\nthe<br/>\nsame experience, and while they are kindly sympathetic, they tend to be <br/>\nfull<br/>\nof suggestions for strategies that I have already been aaaaall the way<br/>\nthrough over the past 2 years.<br/>\n<br/>\nThe only thing I wish someone had said to me was, &quot;Tell your dd how<br/>\nnegatively you feel about her friend honestly and openly.&quot; That was the<br/>\nadvice I could have used a long time ago and in the interim. &gt;&gt;&gt;<br/>\n<br/>\nFinally, here is a copy of the letter I sent to the other parents. It <br/>\nmay be<br/>\nless relevant to the situation, but maybe a letter will be needed to the<br/>\nother mom in this case too.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;Dear T. and K.,<br/>\n<br/>\nBeing increasingly uncomfortable since I have not spoken to you about <br/>\nthe<br/>\ndecision that James and I made some weeks ago to restrict Jayn from <br/>\ncontact<br/>\nwith R, I have decided to write this brief note to explain. I hope you <br/>\nwill<br/>\nread it.<br/>\n<br/>\nFor some time we had been concerned that as R matured, she and Jayn were<br/>\njust not a good fit as playmates anymore. It was not that R’s behavior <br/>\nwas<br/>\n“bad” in any way, but that Jayn was becoming increasingly stressed by <br/>\nthe<br/>\nrelationship, despite her affection for R. Jayn’s stress in the form of<br/>\nextreme tensional outlets became very noticeable when the two girls were<br/>\nsuddenly spending time together almost every day in the weeks before <br/>\nschool<br/>\nlet out.<br/>\n<br/>\nAfter explaining the situation to Jayn, for a couple of days I had been<br/>\ntelling R that Jayn was unavailable. I was looking for the words to <br/>\nexpress<br/>\nto you our belief that Jayn had a problem and that restricting contact <br/>\nwas<br/>\nthe needed solution for the serenity of our family. Unfortunately before<br/>\neither James or I could speak to you about the fairly drastic step, Jayn<br/>\ntold R, in simplistic words, of our intention that she not be Jayn’s <br/>\nbest<br/>\nfriend any more.<br/>\n<br/>\nI am sorry for R’s hurt feelings, as that was certainly not my desire.<br/>\nHowever we must, as parents, put the welfare of our own children first, <br/>\nand<br/>\nwhile the way she found out was not ideal, the substance of the message <br/>\nwas<br/>\ncorrect, and was and is not negotiable.<br/>\n<br/>\nI’m sure you would agree that it would be too hard on R for Jayn to <br/>\nhave a<br/>\nrelationship with J [brother] and not her. That is one reason why I have<br/>\nbeen bringing Jayn in when J comes to the pool or to visit the new<br/>\nneighbors.<br/>\n<br/>\nR has mentioned on different occasions that you will soon be moving to <br/>\nyour<br/>\nown house. It would certainly be lovely for she and J to have their own<br/>\npersonal spaces, and I wish you every success with that endeavor.<br/>\n<br/>\nI prefer that we can maintain the silent distance that we have developed<br/>\nuntil either of our families move, and that there continue to be as <br/>\nlittle<br/>\ncommunication between our children as possible. &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nRobyn L. Coburn<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]}],"prevTopicId":19313,"nextTopicId":19320}}