{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":48,"messages":[{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First post - Hi.","postDate":"1169480626","msgId":20892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwMm0zaSs1aGs5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVwMGMwdStiZW40QGVHcm91cHMuY29tPg=="},"prevInTopic":20890,"nextInTopic":20893,"prevInTime":20891,"nextInTime":20893,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... They have certain standards regarding weight and fitness, and these standards fail to take body type into consideration.  He is a cyclist and rides most","messageBody":"<div id=\"ygrps-yiv-774939540\">&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My husband has a really hard time because he is in the Air Force.  <br/>\n </span></blockquote>They have certain standards regarding weight and fitness, and these <br/>\nstandards fail to take body type into consideration.  He is a <br/>\ncyclist and rides most days (at least 5 days per week).  He has been <br/>\nvery careful about his diet lately, and although he has lost some <br/>\nweight, he still has quite a bit of fat around his middle.  It is <br/>\nextremely frustrating for him that he failed the Air Force&#39;s fitness <br/>\ntest, while his coworkers who don&#39;t exercise nearly as much and eat <br/>\nburgers & fries do fine.  &gt;<br/>\n<br/>\nI retired from the Air National Guard 8 years ago and have gained about <br/>\n50 pounds since then.  I also store fat around the middle (apple) and <br/>\nbeing in the military helped me keep it under control.  Unfortunately <br/>\nit was out of fear (of losing my job) and I am still very self <br/>\nconscious eating in front of people (I used to think everyone was <br/>\nthinking &quot;well, no wonder she&#39;s always on the edge (max weight), LOOK <br/>\nat what she&#39;s eating&quot;, which of course wasn&#39;t the case).  Plus I now <br/>\nhave foot problems, had surgery, can&#39;t walk distances for exercise <br/>\netc.  I agree some of it is genetics, and age.<br/>\n<br/>\nWhen my dd was born, I decided I was NOT going to have food battles <br/>\nwith her (and this was long before I had ever heard of unschooling, <br/>\nwhich is why it resonated with me when I DID because I was, to a <br/>\ncertain extent, already living life in an &quot;unschoolish&quot; way (except <br/>\nthat she was in school!).   She never had to clean her plate, she could <br/>\nhave &quot;dessert&quot; if she wanted, etc.  But I also think she&#39;s just not a <br/>\nbig &quot;sweets&quot; person.  She&#39;s always only liked certain types of candy or <br/>\ncookies/desserts, so if the only sweet thing available was something <br/>\nshe didn&#39;t like (especially with raisins! EWWWWW!) she just didn&#39;t have <br/>\nany (like at a party or someone else&#39;s house).   <br/>\n<br/>\nAt 14 she&#39;s really good at listening to her body.   When she&#39;s had <br/>\nenough to eat, she&#39;s done.  If dinner&#39;s ready (on the days I actually <br/>\nprepare something specific) and she&#39;s not hungry, she knows she doesn&#39;t <br/>\nhave to eat and can heat some up later.   Her latest discovery is that <br/>\nshe feels she has to stop eating coffee ice cream because it&#39;s been <br/>\nunsetting her stomach (she LOVES coffee ice cream).  She&#39;s a worrier, <br/>\nbut over time as we discuss things that she&#39;s concerned about, she&#39;s <br/>\nevolved into someone who can analyze and not automatically think she&#39;s <br/>\nsick or there&#39;s something horribly wrong with her body.   She thinks <br/>\nthe ice cream is possibly too rich and thinks she&#39;ll take a break, <br/>\nmaybe try one with less milk fat (she likes milk, but drinks 2%) <br/>\nsomeday.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; So, no, I don&#39;t think that the main cause of obesity is parents who <br/>\n </span></blockquote>don&#39;t set limits.&gt; <br/>\n<br/>\nI agree, I think there are many factors involved that others have <br/>\ntouched on (heredity, activity level, foods actually consumed and the <br/>\nvariety or lack there of etc).   I see it in my dd who is not heavy <br/>\n(lucky girl!) and has knowledge of what works for her body, and what <br/>\ndoesn&#39;t.    She DOES love Pepsi right now but chose the caffeine free <br/>\nas she has trouble falling asleep if she has too much caffeine. <br/>\nJann</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:First  post - Hi.","postDate":"1169479893","msgId":20893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzMDdCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":20892,"nextInTopic":20894,"prevInTime":20892,"nextInTime":20894,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"As far as foods - don t just turn him loose in the kitchen and say Whatever . Be there with him. Better yet, beat him to the punch by anticipating when he","messageBody":"<div id=\"ygrps-yiv-2115208369\">As far as foods - don&#39;t just turn him loose in the kitchen and say<br/>\n&quot;Whatever&quot;. Be there with him. Better yet, beat him to the punch by<br/>\nanticipating when he might be getting hungry and putting out something<br/>\nto eat - the more portable and bite sized the better. The thing with<br/>\nmost sweets (cookies, candies, etc) is that they require little or no<br/>\npreparation whereas fruit, veggies, cheese, etc might need peeling,<br/>\nslicing (particularly for a little guy) and other &quot;time consuming&quot;<br/>\nthings - plus they require a grown up, they aren&#39;t &quot;I can do it MYSELF&quot;<br/>\nitems. Having pre-prepared, grab and go &quot;I do it&quot; stuff really helped us<br/>\nwhen DS was that little - things like pre-cubed, pre-&#39;portioned&#39; melon<br/>\nor other perishable fruits in ziplock or easy to open storage<br/>\ncontainers; string cheese - single serving, easy to manage with minimal<br/>\nhelp; pre-sliced cheeses of other sorts; and so on. Also, I&#39;d say<br/>\nsomething like &quot;gee I&#39;m feeling a little hungry. Think I&#39;ll make me a<br/>\nPBJ - want some?&quot; As he got older, we added in information like &quot;I think<br/>\nI need some (protein, vitamin C, whatever) so I think I&#39;m going to get<br/>\n(whatever). Want some?&quot; And, when we noticed a connection between his<br/>\nbehavior (his comment one time when he was pushing every possible<br/>\nbutton, was &quot;I want to stop but my brain won&#39;t let me&quot;) and his protein<br/>\nintake, (he was maybe 4 or 5 at the time), I mentioned it &quot;Hey you<br/>\nhaven&#39;t had any protein foods in a while, how about I fix a PBJ - peanut<br/>\nbutter has protein&quot; Over time, he learned to associate how his body/mind<br/>\nfelt and what things would help - whether it was getting some protein or<br/>\ncomplex carbs or more movement (like jumping on his mini-trampoline) or<br/>\nsome downtime/rest or whatever.<br/>\n <br/>\nSimilarly, we didn&#39;t just say &quot;whatever&quot; about his sleeping. We modeled<br/>\n&quot;Hey I need to get up early tomorrow so I&#39;m going to bed now&quot; or &quot;Gee,<br/>\nI&#39;m really tired, I&#39;m going to take a nap&quot; or whatever. Generally<br/>\nspeaking, he wanted to be with us so we&#39;d head to bed and 9 times out of<br/>\n10 even now, he comes along. We have lots of snuggling and unwinding -<br/>\nheading up to bed usually means putting in a DVD or watching a favorite<br/>\nTV program (stuff like Star Trek or Mythbusters or whatever) and<br/>\ncuddling and relaxing and gradually falling asleep - often I&#39;m the first<br/>\none asleep, I&#39;m up and out and at my desk at work by 8, DH and DS have<br/>\nlots more flexibility since they&#39;re home. <br/>\n <br/>\nMostly, we just said &quot;Sure&quot; &quot;Yes&quot; &quot;Okay&quot; a lot more and provided lots of<br/>\ninformation about what *we* were doing, thinking, planning, and seeing.<br/>\nNow DS is 8 1/2 and we have lists of proteins, potassium and calcium<br/>\nrich foods on our kitchen chalkboard by -his- request...when he gets<br/>\nhungry, thinking is hard, so having the lists helps him find what it is<br/>\nhe is wanting/needing to have. Note that it is not something -we-<br/>\nsuggested nor is this a &#39;sudden&#39; thing, it&#39;s just one step on a lifelong<br/>\njourney of learning his own self.<br/>\n <br/>\nAs far as playing, we -don&#39;t- make ourselves play for hours on end with<br/>\nstuff we find totally uninteresting. It&#39;s not really necessary. Often,<br/>\njust sitting nearby and commenting, chatting, keeping DS company is all<br/>\nhe really wants. Sometimes, we&#39;ll say &quot;Sure, I&#39;ll play (trucks,<br/>\nBionicles, whatever) until (this program is over, the mail truck gets<br/>\nhere, Mommy gets home, the bread is finished baking, etc).&quot; Think about<br/>\nit (to get started) as if it was your significant other. Your SO *loves*<br/>\nfootball (since it&#39;s almost the Super Bowl, this pops to mind,<br/>\nsubstitute whatever applies). You can take about 15 minutes before going<br/>\nstark raving mad. What do you do? You likely work out some kind of<br/>\ncompromise. For example, you might sit in the same room (so you can<br/>\nwatch the *important* replays and exciting moments) but read a book or<br/>\nknit or paint or whatever. You become *conversant* with your SO&#39;s<br/>\nfavorite team(s) and maybe a star player or two. You notice when that<br/>\nteam is scheduled to play and maybe get some nachos ready for game time.<br/>\nDoesn&#39;t mean you have to sit and watch the whole game. You are<br/>\npartnering and assisting and supporting. An example at our house is that<br/>\nDS *loves* Bionicles. Every 3 to 6 months, Lego comes out with a new<br/>\n&#39;set&#39; of them - I think there are now about half a dozen or so sets of<br/>\nBionicles. There are Inikas, Baraki, Toas, and so on. I don&#39;t play with<br/>\nthem much. BUT I know the general name groups (though not each<br/>\nindividual character), which types of weapons there are (ratuka<br/>\nspinners, zampherspheres, and squids). I spotted a book in the bookstore<br/>\nthat gave the backstory of the original Toas and picked it up for DS. We<br/>\nspotted a Bionicle boardgame at a tag sale and picked it up. I suggested<br/>\nto a relative that the Bionicle game for the PS2 might make a nice<br/>\nholiday gift. And so on. Sometimes, DS will ask me to play a Bionicle<br/>\nbattle. In that case, I ask him to explain to me all the rules for this<br/>\nparticular battle game. Then, I don&#39;t really need to do anything but<br/>\nindicate to him which of my characters is going to use which attack on<br/>\nwhich of his characters - he does all the physical manipulating and<br/>\ndetermines the outcomes. It takes about 1/2 my brain to manage it and I<br/>\ncan be watching TV or browsing Reader&#39;s Digest (nothing that requires<br/>\nlots of thought, though, I do need to pay attention to what is<br/>\nhappening). And, sometimes, I put all my focus into it - it just depends<br/>\non how I&#39;m feeling, just as one might actually grab some nachos and<br/>\nwatch a playoff game on occasion with a football loving SO. <br/>\n <br/>\nMaybe think about why you feel you have to enjoy things you don&#39;t enjoy.<br/>\nAnd, instead of focusing on &quot;I hate playing with trucks&quot; change the<br/>\ninternal voices to &quot;I love spending time with my DS - it&#39;s amazing to<br/>\nsee how his brain is working&quot; because truly our kids&#39; play is a window<br/>\ninto their Self and they allow us to see in when they invite us to play.<br/>\n <br/>\nOh and don&#39;t forget to include him in -your- stuff as well - &quot;how about<br/>\nyou pretend to be a crane and help me unload the dryer?&quot; Or whatever.<br/>\nIt&#39;s a balance - it need not be 100% focused on your child.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169447086","msgId":20890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2NC42YmNkMTEuMzJlNWIyYWVAYW9sLmNvbT4="},"prevInTopic":20878,"nextInTopic":20892,"prevInTime":20889,"nextInTime":20891,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/22/2007 1:23:24 A.M. Eastern Standard Time, cyandell@gmail.com writes: I read this idea somewhere about how to get little kids kids to","messageBody":"<div id=\"ygrps-yiv-1586530399\">In a message dated 1/22/2007 1:23:24 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cyandell@...\">cyandell@...</a> writes:<br/>\n<br/>\nI read this idea somewhere about how to get little kids kids to  eat<br/>\nmore of a variety of foods, as opposed to the same meals every  day.<br/>\nThe idea is to take pictures (or cut them out) and have sort of  a<br/>\npicture menu of choices.<br/>\n<br/>\n<br/>\n<br/>\nmy best success with getting kids to eat healthy and a  wide variety of stuff <br/>\nis to let them grow a garden and to let them cook  and bake (or help when <br/>\nthey are too little to do a lot of it on their  own.) <br/>\n <br/>\nAdriana <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210732740,"authorName":"Carrie Yandell","from":"&quot;Carrie Yandell&quot; &lt;cyandell@...&gt;","profile":"carrieyandell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169446911","msgId":20878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2Mzk0ODU1MDcwMTIxMjIyMXk3ZDkyNTY5Y2hiNDYyZDA4YjAyMWVhYjZjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDU2Mzk0ODU1MDcwMTIxMjExMHM3ZjA4NDNmZndmMjZhODM3OTBhNTJjYTQ2QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGVwMGMwdStiZW40QGVHcm91cHMuY29tPiA8NTY4ODg1LjgwNTIwLnFtQHdlYjUzMDEyLm1haWwueWFob28uY29tPgkgPDU2Mzk0ODU1MDcwMTIxMjExMHM3ZjA4NDNmZndmMjZhODM3OTBhNTJjYTQ2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":20877,"nextInTopic":20890,"prevInTime":20877,"nextInTime":20879,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"I totally forgot to mention the other thing I thought of from reading the original post! I read this idea somewhere about how to get little kids kids to eat ","messageBody":"<div id=\"ygrps-yiv-730613143\">I totally forgot to mention the other thing I thought of from reading<br/>\nthe original post!<br/>\n<br/>\nI read this idea somewhere about how to get little kids kids to eat<br/>\nmore of a variety of foods, as opposed to the same meals every day.<br/>\nThe idea is to take pictures (or cut them out) and have sort of a<br/>\npicture menu of choices.<br/>\n<br/>\nI love this idea and want to try it with my 2 year old mostly because<br/>\nit just sounds fun but also because sometimes we have trouble<br/>\ncommunicating in that area. We have some stock meals we rotate through<br/>\nthat I thought it would be fun to do this with, and also various side<br/>\ndishes, etc.<br/>\n<br/>\nThe original idea was to actually take away one of the &quot;menus&quot; so that<br/>\nthe child can&#39;t choose that one again until they&#39;ve gone through the<br/>\nstack. I don&#39;t think we&#39;ll do that though.<br/>\n<br/>\nCarrie</div>","specialLinks":[]},{"userId":210732740,"authorName":"Carrie Yandell","from":"&quot;Carrie Yandell&quot; &lt;cyandell@...&gt;","profile":"carrieyandell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169442608","msgId":20877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2Mzk0ODU1MDcwMTIxMjExMHM3ZjA4NDNmZndmMjZhODM3OTBhNTJjYTQ2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDU2ODg4NS44MDUyMC5xbUB3ZWI1MzAxMi5tYWlsLnlhaG9vLmNvbT4=","referencesHeader":"PGVwMGMwdStiZW40QGVHcm91cHMuY29tPiA8NTY4ODg1LjgwNTIwLnFtQHdlYjUzMDEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":20875,"nextInTopic":20878,"prevInTime":20876,"nextInTime":20878,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... Blanket statements like these are the sort that, as an overweight individual, really annoy me. I rarely drink soft drinks. My 2yo currently hates them.","messageBody":"<div id=\"ygrps-yiv-2061005216\">On 1/21/07, Marieke Willis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luuknam@...\">luuknam@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You&#39;re correct, and I said it a bit too confidently. But I regularly<br/>\n&gt; see fat kids in strollers drinking cola or eating ice-cream and that<br/>\n&gt; just makes me think that lots of parents need to set better<br/>\n&gt; boundaries/standards for their kids. 2yos in strollers don&#39;t consumer<br/>\n&gt; those foods unless their parents give it to them.<br/>\n<br/>\n </span></blockquote>Blanket statements like these are the sort that, as an overweight<br/>\nindividual, really annoy me. I rarely drink soft drinks. My 2yo<br/>\ncurrently hates them. However I&#39;ve had people suggest that maybe I<br/>\nshould have a diet drink instead of whatever I ordered, as if they<br/>\nknow anything about my life or my choices. They are judging based<br/>\nsolely on my appearance. Sure there are people that could make better<br/>\nchoices, but seeing children in strollers with ice-cream and deducing<br/>\nthat their parents need to set boundaries seems like an uninformed<br/>\nleap, in my opinion.<br/>\n<br/>\nSince I am overweight and very concerned about not passing on my<br/>\nproblems to my child, I&#39;ve read several things about kids and eating<br/>\nhabits. Nearly everything that has made sense to me involves not<br/>\nsetting limits or boundaries. Additionally, my husband is a very thin<br/>\nperson who believes that sugar is brain food and is not as evil as<br/>\nsome people say. He&#39;s a very creative computer guy who multitasks<br/>\nbrilliantly and seems to not only cope but thrive on what many people<br/>\nwould say is too much sugar. Certainly an eye-opener for me, and when<br/>\ncombined with the advice to not set limits for children, is definitely<br/>\nhow we are approaching food and sugar for our children.<br/>\n<br/>\nCarrie</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Reasonable vs unreasonable vs no boundaries (was: Re: First post - Hi.)","postDate":"1169432205","msgId":20875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmQwMWM3M2RjYiQ1ZGY0ZmFlMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20873,"nextInTopic":20877,"prevInTime":20874,"nextInTime":20876,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"***Children do not NEED cookies or candy.*** True!   Cookies and candy are not needed to sustain human life.   But in order for humans to be happy some things","messageBody":"<div id=\"ygrps-yiv-234634667\">***Children do not NEED cookies or candy.***<br/>\n<br/>\nTrue!   Cookies and candy are not needed to sustain human life.   But in<br/>\norder for humans to be happy some things beyond bare necessities are useful.<br/>\nI don&#39;t need chocolate but it helps make my life more enjoyable. &lt;g&gt;<br/>\n<br/>\nBut we&#39;re getting all side tracked with sweets when the real issue isn&#39;t<br/>\nwhether a kid needs cookies,  the issue is whether what a child wants is<br/>\nimportant.<br/>\n<br/>\nSometimes it helps to think about how we would feel in the same situation.<br/>\nIf there&#39;s something you want - maybe it&#39;s a bird feeder (my latest want&lt;g&gt;)<br/>\nand even though there&#39;s enough money for<br/>\nthe feeder and it&#39;s not expensive, your partner says to you, &quot;No, you can&#39;t<br/>\nhave that.  You don&#39;t need it.&quot;    What kinds of feelings might that stir<br/>\nin you?<br/>\n<br/>\nI don&#39;t *need* another bird feeder.  My tiny, little yard is host to<br/>\nsixteen feeders right now, though some of those are filled with cat food for<br/>\nthe Jays and Magpies and Crows.   But I would be hurt if David (dh) said, <br/>\n&quot;You<br/>\ndon&#39;t need that.&quot;    It would feel like he didn&#39;t care about my feelings,<br/>\nlike he felt the pleasure I get from feeding birds isn&#39;t important, like he <br/>\nthought I wasn&#39;t smart enough to know I have lots of feeders already,<br/>\nlike he was denying me something without a good reason.<br/>\n<br/>\nThat&#39;s what it can feel like to a kid whose mom say&#39;s, &quot;You don&#39;t need <br/>\nthat.&quot;<br/>\nThere are very few things we really need.  But our houses are full<br/>\nof things we like and enjoy and have because the possession of those things<br/>\ncontributes to an easier or happier or more comfortable life.<br/>\n<br/>\nWe eat for nourishment, that&#39;s true.  But as social animals<br/>\nwe eat for other reasons as well.  We eat for comfort, we eat to socialize,<br/>\nwe eat to celebrate, we eat for pleasure.  If we took away everything from<br/>\nour diets that we don&#39;t &quot;need&quot; we&#39;d be left with an easily tired of little <br/>\nbit to<br/>\nchoose from.<br/>\n<br/>\nSo, I believe we do have a *need* for other foods.  Not to sustain our life<br/>\nbut to nourish our life in other ways, with pleasure and comfort.  I believe<br/>\nthat&#39;s why ancient people discovered how to make sweets and wine and beer -<br/>\nBecause humans have more *need* than simply to survive.<br/>\n<br/>\nI think it&#39;s crucial to the success of unschooling to take our children&#39;s <br/>\nwants seriously.  What seems like a silly little want to us might be a <br/>\n*need* for that child.  Without our help and support in getting what they <br/>\nwant, even a simple thing could turn into a barrier between parent and <br/>\nchild.<br/>\n<br/>\n***Either way, I didn&#39;t think unschooling necessarily meant an utter lack<br/>\nof boundaries whatsoever.***<br/>\n<br/>\nNo one is saying unschoolers should turn their kids loose with no help or <br/>\nguidance.<br/>\nKid&#39;s need lots of help.  Unschooling will mean spending even more time with<br/>\nkids to find out all the kinds of help they need, placing a high value on<br/>\nthe things kids want to do and then helping them do those things.   It means<br/>\nputting as much value on what your child wants, as what you<br/>\nwant.<br/>\n<br/>\nTraditional parenting says kids don&#39;t know what they want so parents have to<br/>\ntell them.  Unschooling dares to say kids do know what they want and parents <br/>\nshould<br/>\ntry to find ways to help their kids achieve their goals in safe ways.<br/>\n<br/>\n***If my neighbors let their (say, 4yo) kids<br/>\nclimb so high up a tree that if the kid falls it might break its neck,<br/>\ndoes that mean I have to allow my (say, 4yo) kid the same &#39;privilege&#39;<br/>\nin order to maintain the parent/child relationship?***<br/>\n<br/>\nThere are a lot of choices between no climbing and a broken neck.    My own<br/>\nkid was a climber so we found lots of ways for him to climb safely.  When he<br/>\nwas little that meant jungle gym type things and tall slides at parks and <br/>\nplaygrounds.  As<br/>\nhe got older it meant rocks and trees and ladders and the climbing wall at <br/>\nthe<br/>\nMountaineering shop.  He climbed so much and so well that he could soon<br/>\nclimb things very safely and confidently that *looked* really dangerous and<br/>\nscary.  But he wasn&#39;t in excessive danger because he knew what<br/>\nhe was doing.<br/>\n<br/>\nClimbing doesn&#39;t always equal a broken neck.   Cookies don&#39;t always equal a <br/>\nfat kid or a sick kid or death.<br/>\nIt really helps to think about what we&#39;re afraid of and then whether those <br/>\nfears are reasonable, and how much ground there is between the absolute <br/>\nworst case scenario, and total avoidance.<br/>\n<br/>\n***Reasonable boundaries don&#39;t destroy the parent/child relationship,<br/>\nunreasonable ones do. Now, the question is what&#39;s a reasonable boundary or <br/>\nnot,<br/>\nright?***<br/>\n<br/>\nIf we think it terms of principles we can live really well with our kids. <br/>\nIf the principle is safety then it&#39;s good to remember cookies aren&#39;t fatal <br/>\nand climbing can be accomplished without it resulting in a fall and a broken <br/>\nneck.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sweets (was Re: First post)","postDate":"1169420701","msgId":20873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwMHJpdCt1ZDhoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGIyMjFlNDI0MDcwMTIxMDgwMGkxN2U5ZGE5M3Y4ZmU1YzQwM2QxYWJjMTlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":20872,"nextInTopic":20875,"prevInTime":20872,"nextInTime":20874,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"Brandie, I wanted to second your story and follow up on it. Our food was carefully restricted, so the example that my brother and I grew up with is that only","messageBody":"<div id=\"ygrps-yiv-802658844\">Brandie, <br/>\nI wanted to second your story and follow up on it. Our food was carefully restricted, so the <br/>\nexample that my brother and I grew up with is that only grownups could choose to eat <br/>\nthat way. We both eagerly awaited the day in which we turned 18 (or moved out, which <br/>\nwas 16 for me!), so we could buy crap and eat as much of it as we wanted. The result? I <br/>\ngained so much weight, and still have trouble letting go of the junk food. If it&#39;s in the <br/>\nhome, I will eat it until it&#39;s gone. if someone else expresses interest in my prefered food, i <br/>\nget very defensive because I&#39;m worried that I won&#39;t get more. I&#39;m THIRTYTWO, and I have <br/>\nto mentally walk myself through saying &quot;It&#39;s okay, I am old enough to drive, I can always <br/>\nbuy more&quot;<br/>\n<br/>\nOn the other hand, after nearly two years of deschooling, our kids have two HUGE bowls of <br/>\ncandy (each holding about twelve pounds)...one from Christmas, and one from Halloween. <br/>\nThey go through phases, eating a few handfuls one day, but then a week without anymore. <br/>\nWe also go through pounds and pounds of fruits and veggies. And of course, there&#39;s my <br/>\ninfamous story last year (while we were all still deschooling) when I snapped and told my <br/>\nson he couldn&#39;t have any more veggies until he ate his cake. For snack today, my eleven <br/>\nyear old made pudding in a cloud for everyone. My newly eight year old chopped up <br/>\nenough apples, oranged, grapes, bananas, strawberries and pineapple for everyone. No <br/>\none wanted the pudding. It&#39;s still in the fridge, and the fruit is all gone. It balances from <br/>\nyesterday when they ate through two mega boxes of dingdongs and twinkies. There are <br/>\nhundreds stories just like that.<br/>\n<br/>\nStudies are fine, in their place. They do a mediocre job of scaring mainstream parents into <br/>\nbeing more conscientious about what their children eat or how much they move. However, <br/>\nwhen you&#39;ve seen it in real life, balance out after a while, you wonder where it came from. <br/>\nAnd suddenly the news doesn&#39;t hold as much water, when reported that way. <br/>\nI have seven kids, all of whom are totally in track for height/weight ratio. They have free <br/>\nchoice on eating, watching TV, playing...whatever. Because they are free to choose, not <br/>\nrestrained by concerns for &#39;if I eat this, where will my next candy come from?&#39;, or one from <br/>\nour not so distant past &quot;Mom, I need my soda now, because we&#39;re only allowed one soda a <br/>\nday, and i haven&#39;t had mine&quot; He forced himself to drink an entire soda at 9pm at night, <br/>\nthat he didn&#39;t want, that didn&#39;t taste good, because he was allowed to have one a day. I&#39;ll <br/>\nnot go back to that willingly.<br/>\n<br/>\nJust two pennies<br/>\nmelissa<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Brandie Valenzuela&quot; &lt;brandiev@...&gt; wrote:<br/>\n&gt; I grew up in a food-strict home.  We were forbidden to help ourselves to any<br/>\n&gt; type of food.  And much of the food in our home was typically &quot;good&quot; for<br/>\n&gt; you.  If my parents bought something like cookies, or other individual items<br/>\n&gt; (hot chocolate packets, etc.)htm </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169416930","msgId":20872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCOUFDQTI0LTMyOEMtNDZCNS04QzY1LTRGMjgxRDk1RjMwNEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGVwMGRwZCtzcTc0QGVHcm91cHMuY29tPg==","referencesHeader":"PGVwMGRwZCtzcTc0QGVHcm91cHMuY29tPg=="},"prevInTopic":20871,"nextInTopic":20873,"prevInTime":20871,"nextInTime":20873,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... And another problem is that lots of children naturally put on quite a bit of weight during the prepubescent years. (Which often also coincides with more TV","messageBody":"<div id=\"ygrps-yiv-2014206234\">On Jan 21, 2007, at 2:09 PM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I actually believe the opposite, that the ones setting lots of limits<br/>\n&gt; probably contribute to weight problems the MOST.<br/>\n<br/>\n </span></blockquote>And another problem is that lots of children naturally put on quite a  <br/>\nbit of weight during the prepubescent years. (Which often also  <br/>\ncoincides with more TV watching as they&#39;re shifting from kid  <br/>\ninterests.) And the parents panic, impose diets and exercise and the  <br/>\nchild feels there&#39;s something wrong with them when it&#39;s just normal  <br/>\nweight gain gearing up for a growth spurt.<br/>\n<br/>\nMy daughter was very round from 10-12 and then shot up and is really  <br/>\nthin now.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169407400","msgId":20871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2ODg4NS44MDUyMC5xbUB3ZWI1MzAxMi5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGVwMGMwdStiZW40QGVHcm91cHMuY29tPg=="},"prevInTopic":20870,"nextInTopic":20872,"prevInTime":20870,"nextInTime":20872,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... You re correct, and I said it a bit too confidently. But I regularly see fat kids in strollers drinking cola or eating ice-cream and that just makes me","messageBody":"<div id=\"ygrps-yiv-1724272373\">--- Christy Mahoney &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling1@...\">unschooling1@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Brandie Valenzuela&quot; <br/>\n&gt; &lt;brandiev@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; ***Really, the number of obese kids in the USA is astonishing,<br/>\n&gt; &gt; and the main cause of that obesity is parents who are<br/>\n&gt; &gt; unwilling/incapable of setting boundaries to kids who need them.***<br/>\n&gt; <br/>\n&gt; I don&#39;t see how this can be said with any confidence.  There are <br/>\n&gt; many many factors.  <br/>\n<br/>\n </span></blockquote>You&#39;re correct, and I said it a bit too confidently. But I regularly<br/>\nsee fat kids in strollers drinking cola or eating ice-cream and that<br/>\njust makes me think that lots of parents need to set better<br/>\nboundaries/standards for their kids. 2yos in strollers don&#39;t consumer<br/>\nthose foods unless their parents give it to them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just heard something about a study that was done regarding obesity <br/>\n&gt; and fear.  The researchers found it very interesting that when other <br/>\n&gt; factors were accounted for, the people who lived in fear (dangerous <br/>\n&gt; neighborhoods) had a much higher rate of obesity.  Probably not <br/>\n&gt; conclusive, but it suggests that mental state has an effect.<br/>\n<br/>\n </span></blockquote>I&#39;d have to take a look at that study, because I can definitely think<br/>\nof a lot of factors that tend to correlate with dangerous neighborhoods<br/>\nthat they&#39;d need to factor out. As I wrote in my previous post though,<br/>\nmental state has an effect with me to, and that effect is that I tend<br/>\nto regress to eating what I&#39;ve been used to and that&#39;s easy. Putting a<br/>\npiece of candy in your mouth is a lot easier than chewing on an apple.<br/>\nEarly childhood habits are I think important in what people tend to eat<br/>\nlater, especially under stressful circumstances. Sugar gives a nice<br/>\n&#39;instant&#39; high...<br/>\n <br/>\nAnyway, when I made the statement about boundaries, I was also thinking<br/>\nof exercise and junkfood other than sugar, not just sugar.<br/>\n<br/>\nMarieke<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nFinding fabulous fares is fun.  <br/>\nLet Yahoo! FareChase search your favorite travel sites to find flight and hotel bargains.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://farechase.yahoo.com/promo-generic-14795097\">http://farechase.yahoo.com/promo-generic-14795097</a></div>","specialLinks":[]},{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Reasonable vs unreasonable vs no boundaries (was: Re: First post - Hi.)","postDate":"1169406622","msgId":20870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MzQ0Ny4zNTIwOS5xbUB3ZWI1MzAwNi5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGIyMjFlNDI0MDcwMTIxMDgwMGkxN2U5ZGE5M3Y4ZmU1YzQwM2QxYWJjMTlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":20868,"nextInTopic":20871,"prevInTime":20869,"nextInTime":20871,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... Children do not NEED cookies or candy. If they did, the human race would never have made it to today. To Ren s post, I d like to say that genetics does","messageBody":"<div id=\"ygrps-yiv-220265749\">--- Brandie Valenzuela &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brandiev@...\">brandiev@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Setting limits and boundaries has nothing to do with kids being obese<br/>\n&gt; or<br/>\n&gt; not.  If a child wants or NEEDS something, they will find a way to<br/>\n&gt; get it.<br/>\n<br/>\n </span></blockquote>Children do not NEED cookies or candy. If they did, the human race<br/>\nwould never have made it to today. <br/>\n<br/>\nTo Ren&#39;s post, I&#39;d like to say that genetics does indeed matter in<br/>\nwhether someone will get fat or not, but that it&#39;s not the only factor.<br/>\nBefore I was 6yo, I was so skinny my mom had to sew me clothes because<br/>\nI wouldn&#39;t fit in the ones from the store. Then at some point during<br/>\nprimary school I got into a chocolate milk addiction, even though I was<br/>\nallowed to drink anything I wanted and we&#39;d always have water,<br/>\ncoolaid-like stuff, fruit juice, normal milk, etc, but I chose to drink<br/>\nchocolate milk only. Yes, over a liter of chocolate milk a day, 7 days<br/>\na week, for years on end. I didn&#39;t gain weight quickly, but by the time<br/>\nI was 15 I was definitely overweight. I quit the chocolate milk<br/>\n(replaced it with water (although at first I&#39;d get nauseous due to the<br/>\nlow osmolarity)), and I lost it all to the point that I was almost<br/>\nunderweight. Then, I moved out, and I&#39;ve pretty much been boulimic<br/>\n(which is worse than being obese), although I&#39;ve finally managed to<br/>\nmore or less stabilize my weight at a BMI of 29. When I&#39;m<br/>\nstressed/tired it&#39;s hard to grab something healthy to eat, because of<br/>\nthe engrainment of crap as an easy snack. <br/>\n<br/>\nEither way, I didn&#39;t think unschooling necessarily meant an utter lack<br/>\nof boundaries whatsoever. If my neighbors let their (say, 4yo) kids<br/>\nclimb so high up a tree that if the kid falls it might break its neck,<br/>\ndoes that mean I have to allow my (say, 4yo) kid the same &#39;privilege&#39;<br/>\nin order to maintain the parent/child relationship? Reasonable<br/>\nboundaries don&#39;t destroy the parent/child relationship, unreasonable<br/>\nones do. Now, the question is what&#39;s a reasonable boundary or not,<br/>\nright?<br/>\n<br/>\nMarieke<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nExpecting? Get great news right away with email Auto-Check. <br/>\nTry the Yahoo! Mail Beta.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://advision.webevents.yahoo.com/mailbeta/newmail_tools.html\">http://advision.webevents.yahoo.com/mailbeta/newmail_tools.html</a></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First post - Hi.","postDate":"1169406573","msgId":20868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwMGRwZCtzcTc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVwMGMwdStiZW40QGVHcm91cHMuY29tPg=="},"prevInTopic":20867,"nextInTopic":20870,"prevInTime":20867,"nextInTime":20869,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"~~So, no, I don t think that the main cause of obesity is parents who don t set limits.~~ I actually believe the opposite, that the ones setting lots of limits","messageBody":"<div id=\"ygrps-yiv-541621828\">~~So, no, I don&#39;t think that the main cause of obesity is parents who<br/>\ndon&#39;t set limits.~~<br/>\n<br/>\nI actually believe the opposite, that the ones setting lots of limits<br/>\nprobably contribute to weight problems the MOST. Children having their<br/>\ndiet controlled and portioned leads to problems for many of them. Not<br/>\njust weight issues, but the overall relationship with food becoming<br/>\nunhealthy.<br/>\n<br/>\nI think parents that are unattentive and unaware can contribute to<br/>\nhealth problems. But that&#39;s not what we&#39;re advocating here. Giving<br/>\nchildren choices does not equal a lack of involvement and assistance<br/>\nfrom parents. Controlling someone&#39;s diet does more harm than any<br/>\nshort-term percieved &quot;good&quot;.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First post - Hi.","postDate":"1169404766","msgId":20867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwMGMwdStiZW40QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGIyMjFlNDI0MDcwMTIxMDgwMGkxN2U5ZGE5M3Y4ZmU1YzQwM2QxYWJjMTlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":20866,"nextInTopic":20868,"prevInTime":20866,"nextInTime":20868,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... I don t see how this can be said with any confidence.  There are many many factors.  Genetics is certainly a big one, but how about parents that are rarely","messageBody":"<div id=\"ygrps-yiv-665661887\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Brandie Valenzuela&quot; <br/>\n&lt;brandiev@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ***Really, the number of obese kids in the USA is astonishing,<br/>\n&gt; and the main cause of that obesity is parents who are<br/>\n&gt; unwilling/incapable of setting boundaries to kids who need them.***<br/>\n<br/>\n </span></blockquote>I don&#39;t see how this can be said with any confidence.  There are <br/>\nmany many factors.  Genetics is certainly a big one, but how about <br/>\nparents that are rarely home and don&#39;t cook, so that a child&#39;s diet <br/>\nis made up of cafeteria food at school and convenience foods at <br/>\nhome?  There&#39;s also a sedentary lifestyle, which is greatly <br/>\nreinforced by school.  Even with all the talk about getting kids <br/>\nmore active, the fact remains that most kids are stuck in school all <br/>\nday and then come home to homework.  By the time that&#39;s done, it&#39;s <br/>\ndark and maybe all they want to do is watch some TV because they <br/>\ndon&#39;t have any energy left.  <br/>\n<br/>\nI just heard something about a study that was done regarding obesity <br/>\nand fear.  The researchers found it very interesting that when other <br/>\nfactors were accounted for, the people who lived in fear (dangerous <br/>\nneighborhoods) had a much higher rate of obesity.  Probably not <br/>\nconclusive, but it suggests that mental state has an effect.<br/>\n<br/>\nI am from a big family, and I am the only one who is noticably <br/>\noverweight.  We are all pretty big people genetically, but I am the <br/>\nonly one who is fat.  Why is that?  I have certainly wondered over <br/>\nthe years, and there are probably many reasons.  I was raised by the <br/>\nsame parents and with the same food.  I think my personality is part <br/>\nof it, my interest in food,my worrying tendencies, my stress level, <br/>\nand my underactive thyroid doesn&#39;t help :)<br/>\n<br/>\nMy daughter just turned 12, and she is unhappy about being chubby.  <br/>\nShe really doesn&#39;t eat a lot of sugar.  Some, sure, but she has been <br/>\na vegetarian for nearly a year and eats a lot more healthily than a <br/>\nlot of other kids who are skinny.  Her body is a lot like her dad&#39;s, <br/>\nand they both retain weight around the middle.  She can&#39;t help that, <br/>\nbut she hates it anyway.  <br/>\n<br/>\nMy husband has a really hard time because he is in the Air Force.  <br/>\nThey have certain standards regarding weight and fitness, and these <br/>\nstandards fail to take body type into consideration.  He is a <br/>\ncyclist and rides most days (at least 5 days per week).  He has been <br/>\nvery careful about his diet lately, and although he has lost some <br/>\nweight, he still has quite a bit of fat around his middle.  It is <br/>\nextremely frustrating for him that he failed the Air Force&#39;s fitness <br/>\ntest, while his coworkers who don&#39;t exercise nearly as much and eat <br/>\nburgers & fries do fine.  <br/>\n<br/>\nSo, no, I don&#39;t think that the main cause of obesity is parents who <br/>\ndon&#39;t set limits.<br/>\n<br/>\n-Christy</div>","specialLinks":[]},{"userId":295386832,"authorName":"Brandie Valenzuela","from":"&quot;Brandie Valenzuela&quot; &lt;brandiev@...&gt;","profile":"scrapdiva73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169395231","msgId":20866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIyMjFlNDI0MDcwMTIxMDgwMGkxN2U5ZGE5M3Y4ZmU1YzQwM2QxYWJjMTlAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDAwMzIwMWM3M2Q2ZSQ5ZTcyNWI2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4=","referencesHeader":"PDAwMzIwMWM3M2Q2ZSQ5ZTcyNWI2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20865,"nextInTopic":20867,"prevInTime":20865,"nextInTime":20867,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"***Really, the number of obese kids in the USA is astonishing, and the main cause of that obesity is parents who are unwilling/incapable of setting boundaries","messageBody":"<div id=\"ygrps-yiv-1202405959\">***Really, the number of obese kids in the USA is astonishing,<br/>\nand the main cause of that obesity is parents who are<br/>\nunwilling/incapable of setting boundaries to kids who need them.***<br/>\n<br/>\nI grew up in a food-strict home.  We were forbidden to help ourselves to any<br/>\ntype of food.  And much of the food in our home was typically &quot;good&quot; for<br/>\nyou.  If my parents bought something like cookies, or other individual items<br/>\n(hot chocolate packets, etc.), they counted each and every one (writing the<br/>\nnumber left on the label or box) to make sure we didn&#39;t get into them<br/>\nwithout asking.  And there was really no point in asking because you would<br/>\nbe told no almost everytime.  Halloween candy was handed out maybe 2 pieces<br/>\na week or so.  It last well beyond a year.  My parents wanted to control the<br/>\nfood.  They wanted 100% control over when we could get &quot;treats&quot;, or even the<br/>\nso-called &quot;good&quot; stuff.<br/>\n<br/>\nThe result?  I learned that if I just consumed the whole box of cookies and<br/>\ndestroyed the box, there would be nothing left to count.  Most of the time,<br/>\nthey forgot about the whole box (out of sight, out of mind).  If they did<br/>\nask, you just deny, deny, deny.  Or blame it on the dog.  LOL<br/>\n<br/>\nSetting limits and boundaries has nothing to do with kids being obese or<br/>\nnot.  If a child wants or NEEDS something, they will find a way to get it.<br/>\n<br/>\n-- <br/>\nBrandie<br/>\n<br/>\n<br/>\nLearn about Batten&#39;s Disease:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bdsra.org/batten.htm\">http://www.bdsra.org/batten.htm</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: First post - Hi.","postDate":"1169393465","msgId":20865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjQwMWM3M2Q3MSQyYTZiNDNhMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20864,"nextInTopic":20866,"prevInTime":20864,"nextInTime":20866,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"On the topic of sugar (and food and food choice) http://sandradodd.com/eating/healthfood http://sandradodd.com/food Deb Lewis","messageBody":"<div id=\"ygrps-yiv-1318202927\">On the topic of sugar (and food and food choice) <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/healthfood\">http://sandradodd.com/eating/healthfood</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: First post - Hi.","postDate":"1169392371","msgId":20864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzIwMWM3M2Q2ZSQ5ZTcyNWI2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20863,"nextInTopic":20865,"prevInTime":20863,"nextInTime":20865,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"***Perhaps not useful to everybody, but probably useful to some people; it depends.*** *Useful*& is when we write about ideas that will help people understand ","messageBody":"<div id=\"ygrps-yiv-874764551\">***Perhaps not useful to everybody, but probably useful to some people; it<br/>\ndepends.***<br/>\n<br/>\n*Useful*& is when we write about ideas that will help people understand<br/>\nunschooling.   Comparing food to controlled substances and possibly<br/>\ninspiring fear by such a comparison isn&#39;t useful on an unschooling list.<br/>\n<br/>\n***I&#39;m talking about not<br/>\ngiving your kids harmful foods when they&#39;re too small to make decisions<br/>\nconcerning their health themselves.***<br/>\n<br/>\nThe poster was talking about chocolate covered raisins, organic homemade<br/>\ncookies and yogurt.   Hardly harmful.  Definitely not anything like a<br/>\ncontrolled substance.<br/>\n<br/>\nLet&#39;s keep perspective.  Little kids who have access to a wide variety of<br/>\nfoods will eat well.  And even if a child ate only chocolate covered raisins<br/>\nfor days on end, he would suffer no lasting ill effects.<br/>\n<br/>\nIf a mom only gives a kid chocolate covered raisins to eat, that&#39;s what <br/>\nhe&#39;ll eat.<br/>\n&quot;Offering&quot; food is not the same as giving food.   Offering other<br/>\nfoods when the most recent sensory food input was chocolate covered raisins<br/>\nmeans almost nothing.   Being able to see, touch and smell foods that are<br/>\nright in front of a little child gives him a real choice.   And he might<br/>\nstill choose the raisins.  But given a variety of foods to choose from he<br/>\nwill eventually choose to eat something else.<br/>\n<br/>\n***I&#39;m also not saying you should make the kid feel guilty about wanting<br/>\nsome food, I&#39;m just saying that you shouldn&#39;t give it to them.***<br/>\n<br/>\nAnd that method of parenting is available to every parent here, but<br/>\npresumably the people who are here want to move toward unschooling.  Parents<br/>\nabsolutely can limit or forbid certain foods.  But what happens when a child<br/>\ntastes foods elsewhere and asks for them at home?    A mom who fears sugar<br/>\nmight feel like she needs to explain her position.   This is what we talk<br/>\nabout frequently on unschooling lists.  There will be a time when what a<br/>\nchild wants will be different from what the mom wants for that child.  If<br/>\none of the goals of unschooling is to help our kids get what they want, then<br/>\nmoms who have forbidden or limited the thing their children want are going<br/>\nto be in conflict with their kids.  Mainstream parenting takes for granted <br/>\nthat parents and kids will be in<br/>\nconflict.  We&#39;re working for something else.<br/>\n<br/>\nWhat has happened in many unschooling homes where sweet foods are treated<br/>\nthe same as other foods is that sweets hold no special powers over kids.<br/>\n<br/>\nWhat has happened in many homes where sweets are limited or forbidden is<br/>\nsweets become a coveted thing, something to get and gobble down as fast as<br/>\npossible.<br/>\n<br/>\n***If you&#39;re going to lie to your kid and say sugar is deadly, obviously<br/>\nyou&#39;re going to damage the relationship. ***<br/>\n<br/>\nWhich is why I cautioned against the extreme comparison of sugar to an<br/>\nhallucinogenic, controlled substance.<br/>\n<br/>\nWhen we exaggerate the effects of foods (or drugs, or alcohol) we risk <br/>\nlosing our credibility.  There will be a time when a child knows someone who <br/>\nhas tried that thing, or tries it himself,  and discovers for himself that <br/>\nthe claims and cautions were overstated.<br/>\n<br/>\n***Really, the number of obese kids in the USA is astonishing,<br/>\nand the main cause of that obesity is parents who are<br/>\nunwilling/incapable of setting boundaries to kids who need them.***<br/>\n<br/>\nA rule against sugar will not prevent a child who wants sweets from eating<br/>\nthem.  A healthy relationship with food, where sugar is not treated like a<br/>\ndrug will do more for a child&#39;s ability to make good food choices than any<br/>\namount of parental limiting or boundary setting.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":215786366,"authorName":"Lalita","from":"&quot;Lalita&quot; &lt;coteddy4567@...&gt;","profile":"flaggfreedomintl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169387150","msgId":20863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWUwMWM3M2Q2MiQ3NzFhNGM1MCQ2NTAwYThjMEBmbGFnZ2NvbXBvdW5kPg==","referencesHeader":"PGVvdW84cytkZDIwQGVHcm91cHMuY29tPg=="},"prevInTopic":20858,"nextInTopic":20864,"prevInTime":20862,"nextInTime":20864,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... breastmilk. It s nastily sweet. And the human body converts any and all sugars to glucose. We seem to be designed to like sweets....","messageBody":"<div id=\"ygrps-yiv-262550995\"><blockquote><span title=\"ireply\">&gt;Anyone that thinks sugar is so horrible should really taste<br/>\n </span></blockquote>breastmilk. It&#39;s nastily sweet. And the human body converts any and<br/>\nall sugars to glucose. We seem to be designed to like sweets....&lt;<br/>\n<br/>\nAlso too, human breastmilk has the highest levels of lactose (sugar) of any milk out there because the human brain can only survive on glucose (sugar).  :)<br/>\n<br/>\nLalita<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First post - Hi.","postDate":"1169351772","msgId":20858,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvdW84cytkZDIwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDcwMTIwMTc0MDE1LjE2MTA1LnFtYWlsQHdlYjUzMDA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":20848,"nextInTopic":20863,"prevInTime":20857,"nextInTime":20859,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"~~But your obese 10yo is probably not really going to have such a great relationship with you either, if it got obese because you allowed it to eat sugar-only","messageBody":"<div id=\"ygrps-yiv-535532532\">~~But your obese 10yo is<br/>\nprobably not really going to have such a great relationship with you<br/>\neither, if it got obese because you allowed it to eat sugar-only all<br/>\nday long. ~~<br/>\n<br/>\nA child that eats sugar is not going to magically turn obese. I have<br/>\nfour children that choose exactly what they eat (except tonight,<br/>\nbecause we&#39;re low on groceries and I really, really need to make a<br/>\ngrocery run) and ares skinny as rails. Genetics has a LOT more to do<br/>\nwith it than sugar. I eat whatever I want, including rich cream, sugar<br/>\nand other &quot;no-no&#39;s&quot;, plus a lot of healthy foods and have never had<br/>\nany problem with weight.<br/>\n<br/>\nShow me a child that will eat sugar all day long for more than a day!<br/>\nIt&#39;s just not realistic. It feels really crappy to eat nothing but<br/>\nsugar and kids figure that out pretty quickly. <br/>\n<br/>\nWe&#39;re not talking about parents leaving their children to figure all<br/>\nthis out on their own. We&#39;re talking about aware/mindful parents<br/>\nhelping their children navigate this world while giving them freedom<br/>\nof choice. There&#39;s a big difference. I can&#39;t imagine my kids eating<br/>\nnothing but sugar on ANY given day, though they love candy and other<br/>\n&quot;treats&quot;. After they&#39;ve had some sugary foods, they&#39;ll say things like<br/>\n&quot;I really need some protein&quot; or &quot;I need some REAL (meaning hot and/or<br/>\nprotein rich) food Mom&quot;.<br/>\n<br/>\nAnyone that thinks sugar is so horrible should really taste<br/>\nbreastmilk. It&#39;s nastily sweet. And the human body converts any and<br/>\nall sugars to glucose. We seem to be designed to like sweets....<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169315139","msgId":20848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3Nzg0Ny41NTY4Ni5xbUB3ZWI1MzAwNC5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDAwOWYwMWM3M2NiMyRmZThlZWE2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20847,"nextInTopic":20858,"prevInTime":20847,"nextInTime":20849,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... Than *chocolate* raisins. I think the stress was on the chocolate, not on the raisins. Chocolate raisins have about as much chocolate in m as raisins,","messageBody":"<div id=\"ygrps-yiv-1890368325\">--- Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; ***It&#39;s just that when I say &quot;Would you like a banana or an apple or<br/>\n&gt; some yogurt?&quot; he&#39;ll say &quot;Chocolate raisins!&quot; and that will go on<br/>\n&gt; allll day. He just wants the chocolate and the sweets. ***<br/>\n&gt; <br/>\n&gt; Bananas are sweet.  Apples are sweet.  Why are those better choices<br/>\n&gt; than raisins?<br/>\n<br/>\n </span></blockquote>Than *chocolate* raisins. I think the stress was on the chocolate, not<br/>\non the raisins. Chocolate raisins have about as much chocolate in &#39;m as<br/>\nraisins, iirc. <br/>\n<br/>\nMarieke<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nNever Miss an Email<br/>\nStay connected with Yahoo! Mail on your mobile.  Get started!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/services?promote=mail\">http://mobile.yahoo.com/services?promote=mail</a></div>","specialLinks":[]},{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First post - Hi.","postDate":"1169314815","msgId":20847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwMTIwMTc0MDE1LjE2MTA1LnFtYWlsQHdlYjUzMDA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwOTMwMWM3M2NiMiRhYjhjMWM4MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20846,"nextInTopic":20848,"prevInTime":20846,"nextInTime":20848,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... Perhaps not useful to everybody, but probably useful to some people; it depends. ... Okay... alcohol is not illegal to buy and possess but still not a good","messageBody":"<div id=\"ygrps-yiv-2092100978\">--- Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; *** Just like you don&#39;t give you kid the option of eating magic<br/>\n&gt; brownies or psychedelic mushrooms (I assume), you could refuse to<br/>\n&gt; give<br/>\n&gt; your kid the option of eating other things which are harmful to him,<br/>\n&gt; such as sugar.***<br/>\n&gt; <br/>\n&gt; This is an example of extreme thinking that isn&#39;t useful. <br/>\n<br/>\n </span></blockquote>Perhaps not useful to everybody, but probably useful to some people; it<br/>\ndepends.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s not a good <br/>\n&gt; analogy.    The psilocybe mushrooms to which you are referring are <br/>\n&gt; hallucinogenic and probably illegal to buy or sell or possess in most<br/>\n<br/>\n&gt; states.  (I think New Mexico is one exception)  Sugar is none of<br/>\n&gt; those things.<br/>\n<br/>\n </span></blockquote>Okay... alcohol is not illegal to buy and possess but still not a good<br/>\nidea to feed your kid a lot of. And don&#39;t tell me that it&#39;s illegal to<br/>\nbuy it when you&#39;re under age X, because it used to be perfectly legal<br/>\nto buy it at age 2 if you wanted to/were able to, and it still is not<br/>\nillegal to feed it to your kids. Just because something isn&#39;t illegal<br/>\nat some point in time doesn&#39;t mean it&#39;s good.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While some people feel sugar is not suitable for human consumption<br/>\n&gt; humans <br/>\n&gt; have nevertheless been consuming sugar for thousands of years, in<br/>\n&gt; it&#39;s <br/>\n&gt; natural form and later in it&#39;s processed form.    And while many<br/>\n&gt; people <br/>\n&gt; claim sugar is deadly the life expectancy of humans, including those<br/>\n&gt; who eat <br/>\n&gt; sugar, is greater than it has ever been since we&#39;ve been keeping<br/>\n&gt; records.<br/>\n<br/>\n </span></blockquote>Which doesn&#39;t mean that sugar helped increased that life expectancy.<br/>\nAlso, I didn&#39;t say sugar is deadly (trust me, I&#39;ve had sugar and I&#39;m<br/>\nstill alive); I said sugar is harmful, which it *is*. Obesity and<br/>\ndiabetes are many times more common nowadays than ever, especially in<br/>\nthe USA. There&#39;s pretty much two things that contribute to that: lack<br/>\nof exercise and consumption of unhealthy foods, such as sugar-this and<br/>\nsugar-that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The danger of vilifying sugar is that when our kids want sweets they<br/>\n&gt; will <br/>\n&gt; either have to overcome their feelings of guilt about eating<br/>\n&gt; something mom <br/>\n&gt; objects to or they will deny themselves a food they want.   The risk<br/>\n&gt; of <br/>\n&gt; developing food issues or eating disorders is so much greater when<br/>\n&gt; the <br/>\n&gt; consumption of food is turned into a psychological game by parents.<br/>\n<br/>\n </span></blockquote>I&#39;m not talking about turning it into a game; I&#39;m talking about not<br/>\ngiving your kids harmful foods when they&#39;re too small to make decisions<br/>\nconcerning their health themselves. A game implies that what the kid<br/>\ndoes has some sort of influence on whether it gets the food or not: &quot;if<br/>\nyou&#39;re a good girl I&#39;ll give you a cookie&quot;, or: &quot;if you don&#39;t finish<br/>\nyour food you won&#39;t get dessert&quot;. That&#39;s playing games. I&#39;m also not<br/>\nsaying you should make the kid feel guilty about wanting some food, I&#39;m<br/>\njust saying that you shouldn&#39;t give it to them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The other danger in vilifying sugar is that when kids make their own<br/>\n&gt; sugar <br/>\n&gt; discoveries,  mom&#39;s who say &quot;sugar will kill you&quot; turn out to be<br/>\n&gt; liars. <br/>\n&gt; When a child spends the night with a friend and they eat cookies and<br/>\n&gt; drink <br/>\n&gt; soda and wake up the next morning not corpses, mom told a lie.<br/>\n<br/>\n </span></blockquote>Then don&#39;t say it will kill you. Duh. Just like cigarettes won&#39;t kill<br/>\nyou. I&#39;ve never had a cigarette, but I bet that if I&#39;d had one I&#39;d<br/>\nstill be alive. Even if I&#39;d spent an entire night smoking cigarettes at<br/>\na friend&#39;s house I&#39;d probably still be alive. Does that mean that<br/>\ncigarettes are hence okay?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mom&#39;s who say &quot;sugar is bad for you&quot; will look like they don&#39;t know<br/>\n&gt; what <br/>\n&gt; they&#39;re talking about when healthy friends or extended family members<br/>\n&gt; eat sugary foods.<br/>\n<br/>\n </span></blockquote>And this is different from the cigarettes scenario how, exactly?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The risk to the parent/child relationship is greater than the<br/>\n&gt; supposed risks of sugar.<br/>\n&gt; Deb Lewis <br/>\n<br/>\n </span></blockquote>I think that that depends on how you present the issue to your kids. If<br/>\nyou&#39;re going to lie to your kid and say sugar is deadly, obviously<br/>\nyou&#39;re going to damage the relationship. But your obese 10yo is<br/>\nprobably not really going to have such a great relationship with you<br/>\neither, if it got obese because you allowed it to eat sugar-only all<br/>\nday long. Really, the number of obese kids in the USA is astonishing,<br/>\nand the main cause of that obesity is parents who are<br/>\nunwilling/incapable of setting boundaries to kids who need them. Yes,<br/>\nyour 2yo might currently be burning all those calories, but in the<br/>\nmeanwhile it&#39;s getting into the habit of eating crap, and some day it<br/>\nwill probably not be growing as fast and probably not burn all those<br/>\nempty calories.<br/>\n<br/>\nMarieke<br/>\n--<br/>\nMy parents thought it was &#39;cute&#39; to teach me how to eat cake and<br/>\nice-cream. I can assure you, it&#39;s not cute anymore. :(<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\n8:00? 8:25? 8:40? Find a flick in no time <br/>\nwith the Yahoo! Search movie showtime shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#news\">http://tools.search.yahoo.com/shortcuts/#news</a></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: First post - Hi.","postDate":"1169312216","msgId":20846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWYwMWM3M2NiMyRmZThlZWE2MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20845,"nextInTopic":20847,"prevInTime":20845,"nextInTime":20847,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"***It s just that when I say Would you like a banana or an apple or some yogurt? he ll say Chocolate raisins! and that will go on allll day. He just wants","messageBody":"<div id=\"ygrps-yiv-1027878885\">***It&#39;s just that when I say &quot;Would you like a banana or an apple or<br/>\nsome yogurt?&quot; he&#39;ll say &quot;Chocolate raisins!&quot; and that will go on<br/>\nallll day. He just wants the chocolate and the sweets. ***<br/>\n<br/>\nBananas are sweet.  Apples are sweet.  Why are those better choices than <br/>\nraisins?<br/>\nPut food right in front of him.  Put a plate of apples and cheese cubes  and <br/>\ncrackers and bananas and raisins and whatever else he likes right in front <br/>\nof him, right beside him, wherever he is and let him eat what he wants.<br/>\n<br/>\nDylan liked apples dipped in peanut butter.  He liked little bite sized <br/>\nhummus sandwiches.  He liked noodles with sesame ginger sauce that he could <br/>\nthread through his toes and then eat. &lt;g&gt;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: First post - Hi.","postDate":"1169311647","msgId":20845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOTMwMWM3M2NiMiRhYjhjMWM4MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20844,"nextInTopic":20846,"prevInTime":20844,"nextInTime":20846,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"*** Just like you don t give you kid the option of eating magic brownies or psychedelic mushrooms (I assume), you could refuse to give your kid the option of","messageBody":"<div id=\"ygrps-yiv-1127576712\">*** Just like you don&#39;t give you kid the option of eating magic<br/>\nbrownies or psychedelic mushrooms (I assume), you could refuse to give<br/>\nyour kid the option of eating other things which are harmful to him,<br/>\nsuch as sugar.***<br/>\n<br/>\nThis is an example of extreme thinking that isn&#39;t useful.  It&#39;s not a good <br/>\nanalogy.    The psilocybe mushrooms to which you are referring are <br/>\nhallucinogenic and probably illegal to buy or sell or possess in most <br/>\nstates.  (I think New Mexico is one exception)  Sugar is none of those <br/>\nthings.<br/>\n<br/>\nWhile some people feel sugar is not suitable for human consumption humans <br/>\nhave nevertheless been consuming sugar for thousands of years, in it&#39;s <br/>\nnatural form and later in it&#39;s processed form.    And while many people <br/>\nclaim sugar is deadly the life expectancy of humans, including those who eat <br/>\nsugar, is greater than it has ever been since we&#39;ve been keeping records.<br/>\n<br/>\nThe danger of vilifying sugar is that when our kids want sweets they will <br/>\neither have to overcome their feelings of guilt about eating something mom <br/>\nobjects to or they will deny themselves a food they want.   The risk of <br/>\ndeveloping food issues or eating disorders is so much greater when the <br/>\nconsumption of food is turned into a psychological game by parents.<br/>\n<br/>\nThe other danger in vilifying sugar is that when kids make their own sugar <br/>\ndiscoveries,  mom&#39;s who say &quot;sugar will kill you&quot; turn out to be liars. <br/>\nWhen a child spends the night with a friend and they eat cookies and drink <br/>\nsoda and wake up the next morning not corpses, mom told a lie.<br/>\n<br/>\nMom&#39;s who say &quot;sugar is bad for you&quot; will look like they don&#39;t know what <br/>\nthey&#39;re talking about when healthy friends or extended family members eat <br/>\nsugary foods.<br/>\n<br/>\nThe risk to the parent/child relationship is greater than the supposed risks <br/>\nof sugar.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: First post - Hi.","postDate":"1169309753","msgId":20844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOTIwMWM3M2NhZSQ0MjczMGEwMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20843,"nextInTopic":20845,"prevInTime":20843,"nextInTime":20845,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"***The poor thing was just sugared up out of his mind constantly and couldn t sleep and then would sleep 3 hours in the middle of the day(this was good! lol)","messageBody":"<div id=\"ygrps-yiv-1874568318\">***The poor thing was just sugared up out of his mind constantly and <br/>\ncouldn&#39;t<br/>\nsleep and then would sleep 3 hours in the middle of the day(this was<br/>\ngood! lol) and then not at night and he seemed really unhappy and<br/>\nirritable and actually kind of freaked out. ***<br/>\n<br/>\nThere are a lot of  myths about sugar that are unproven, scientifically. <br/>\nI&#39;m talking about real science and not hocus pocus science.<br/>\nBut food choice and bedtime choice does not mean leaving a little kid alone <br/>\nto figure the world out on his own.<br/>\nLittle kids need moms to be preparing and frequently offering (taking food <br/>\nright to the kid, wherever he is)  nutritious foods in little kid portions, <br/>\nnutritious snacks, all day long, so that they can maintain their energy <br/>\nlevels.   And they need us to make the house a  quiet restful place in the <br/>\nevening so sleep can come naturally.<br/>\n<br/>\n***If he had not seemed so<br/>\nmisreable I think could have just gone with it, but I finally had to<br/>\nstep back and call it a day FOR NOW because he was really struggling.***<br/>\n<br/>\nHe needed your help!<br/>\n<br/>\n***Can you guys help me with this? How can I balance this now? Right<br/>\nnow I&#39;m finding that I&#39;m just all over the place...one day letting<br/>\nhim eat tons of sugar and then feeling remorseful and making deals<br/>\nthe next day (ugh) and I *know* this can&#39;t be good. HELP.***<br/>\n<br/>\nWhat do you eat?  How do you eat?<br/>\nMake sure you have lots of foods he enjoys.  Make sure you give him food <br/>\nfrequently throughout the day.  Be with him.  Notice if he&#39;s getting tired, <br/>\nnotice when he last ate, pay attention to his protein intake and make sure <br/>\nyou are offering foods often, foods high in protein so that he can maintain <br/>\nhis energy levels.<br/>\n<br/>\nWhat did you do before?<br/>\n<br/>\nIf you have healthy food easily available in your house and if you are <br/>\neating in a healthy way, then help your son get as much food as he needs. <br/>\nHe&#39;s too little to tell you.  He&#39;s too little to understand all the <br/>\ndifferent ways out bodies signal us that we&#39;re running out of energy.    In <br/>\na home where mom and dad eat well, and nutritious food is always available - <br/>\noffered frequently (taken right to the kid)  - to a child, a child will eat <br/>\nwell even if he has access to sweets.<br/>\n<br/>\nIf his easiest access is sweets that&#39;s what he&#39;ll eat.  He&#39;s two.  He can&#39;t <br/>\ngo to the store and get sweets on his own so if he&#39;s only eating sweets <br/>\nthat&#39;s your responsibility.  It&#39;s your responsibility to make sure he&#39;s <br/>\ngetting nutritious foods so that when he chooses sweets it&#39;s not &quot;instead <br/>\nof&quot; other things but &quot;in addition to&quot; his healthy diet.  For most people <br/>\nthere are times when we want sweet things more than other times, or when <br/>\nsomething is tasting especially wonderful and we eat it frequently until <br/>\nwe&#39;re satisfied.  That&#39;s normal.  But you should be taking food to him while <br/>\nhe plays, and taking food to him while he&#39;s watching his favorite movie, <br/>\netc.<br/>\n<br/>\nChoice with a two year old isn&#39;t going to look like choice with a ten year <br/>\nold.   A two year old doesn&#39;t know what choices he has.  Making a choice <br/>\nlooks like eating what he likes or refusing what he doesn&#39;t want.  If you&#39;re <br/>\noffering food, as in telling him he can have noodles,  that doesn&#39;t mean <br/>\nmuch to a two year old.   Pay attention to what he likes.  Take that food <br/>\nright to him.  If he likes cheese, take little cubes of cheese to him when <br/>\nhe&#39;s playing.   If he likes crackers, take him crackers.  If he likes peanut <br/>\nbutter and jelly, take teeny little sandwiches he can eat in one bite. <br/>\nDon&#39;t wait until he&#39;s obviously hungry or cranky.  Be proactive.   Don&#39;t <br/>\ntake food *you* think he should have if you *know* he doesn&#39;t like it.  Take <br/>\nhim foods he likes.<br/>\n<br/>\nAbout betimes:  Pay attention to his signals.  When he is getting tired, <br/>\nquiet your house.  Turn down the lights and TV.  Turn up the heat.  Get him <br/>\ninto some comfy clothes or pajama&#39;s, if he wants to.  Nurse him or rock him <br/>\nif he wants that.  Hold him while he watches a familiar and sweet movie. <br/>\nMake his evening *sleep friendly*.  Play with him quietly if he wants to <br/>\nplay.   Make your time with him about his comfort.  Take him to bed with <br/>\nyou, or let him fall asleep on the sofa next to you.   You&#39;ll have to try <br/>\ndifferent things to see what comforts him and helps him want to sleep.<br/>\n<br/>\nWhat was his bedtime routine like before?   Can you continue with the parts <br/>\nof that routine that he enjoyed?  If there were parts he resisted,  pay <br/>\nattention to that.  If he resisted, he resisted for a good reason, whether <br/>\nmom thinks it&#39;s a good reason or not. &lt;g&gt;<br/>\n<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":233742879,"authorName":"mammaholt","from":"&quot;mammaholt&quot; &lt;micheleholt@...&gt;","profile":"mammaholt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First  post - Hi.","postDate":"1169264176","msgId":20842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvczJuZys3ZDkxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMwMzM1OS4zMTg3NS5xbUB3ZWI1MzAwMy5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":20841,"nextInTopic":20843,"prevInTime":20841,"nextInTime":20843,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"HAHAH pot brownies! Might be a good idea around bedtime! LOL just joking. Oh yea, I think sugar is relatively wretched food product. I m not totally opposed to","messageBody":"<div id=\"ygrps-yiv-87221778\">HAHAH pot brownies! Might be a good idea around bedtime! LOL just <br/>\njoking.<br/>\n<br/>\nOh yea, I think sugar is relatively wretched food product. I&#39;m not <br/>\ntotally opposed to it cuz he&#39;s a kid and they love it and it&#39;s fun. <br/>\nIt&#39;s just quantity and the relentless begging for it even though we <br/>\ndo let him have some. We eat popscicles for breakfast almost every <br/>\nday...homemade ones, but still. We&#39;ll have one and then he&#39;ll ask for <br/>\nanother and another and another and another. AGGGGG.<br/>\n<br/>\nThanks for your thoughts.<br/>\n<br/>\nMichele<br/>\nMama to Finnigan (almost 3) --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, <br/>\nMarieke Willis &lt;luuknam@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi, I&#39;m also new to this list...<br/>\n&gt; <br/>\n&gt; --- mammaholt &lt;micheleholt@...&gt; wrote:<br/>\n&gt; &gt; I started letting him choose his own <br/>\n&gt; &gt; bedtime and food (these were the only 2 areas where we were <br/>\n </span></blockquote>having <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; issues with each other). It was....hmmmm, not so pretty. The poor <br/>\n&gt; &gt; thing was just sugared up out of his mind constantly... <br/>\n&gt; <br/>\n&gt; Lettimg him choose his own food does not equate to giving him 100%<br/>\n&gt; freedom as to what he wants to eat, now does it? Especially not for <br/>\n </span></blockquote>a<br/>\n<blockquote><span title=\"ireply\"> &gt; 2yo. Just like you don&#39;t give you kid the option of eating magic<br/>\n&gt; brownies or psychedelic mushrooms (I assume), you could refuse to <br/>\n </span></blockquote>give<br/>\n<blockquote><span title=\"ireply\"> &gt; your kid the option of eating other things which are harmful to him,<br/>\n&gt; such as sugar. Sugar is bad for people, especially little kids, <br/>\n </span></blockquote>while<br/>\n<blockquote><span title=\"ireply\"> &gt; being addictive to some degree, and doesn&#39;t have any nutritional <br/>\n </span></blockquote>value<br/>\n<blockquote><span title=\"ireply\"> &gt; other than calories, which are easy enough to get in other ways. <br/>\n&gt; <br/>\n&gt; How about letting your son choose what he wants to eat like <br/>\n </span></blockquote>this: &quot;Do<br/>\n<blockquote><span title=\"ireply\"> &gt; you want a banana, or an apple, or strawberries or a muesli bar?&quot;.<br/>\n&gt; Don&#39;t even give the kid too many options at 2yo, or you&#39;ll overload<br/>\n&gt; him. <br/>\n&gt; <br/>\n&gt; This is of course not going to go over very well if you yourself <br/>\n </span></blockquote>only<br/>\n<blockquote><span title=\"ireply\"> &gt; eat sugary things, but if you give the right example it should <br/>\n </span></blockquote>work. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Marieke<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n </span></blockquote>______________________________________________________________________<br/>\n______________<br/>\n<blockquote><span title=\"qreply\"> &gt; Cheap talk?<br/>\n&gt; Check out Yahoo! Messenger&#39;s low PC-to-Phone call rates.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://voice.yahoo.com\">http://voice.yahoo.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":233742879,"authorName":"mammaholt","from":"&quot;mammaholt&quot; &lt;micheleholt@...&gt;","profile":"mammaholt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: First post - Hi.","postDate":"1169263935","msgId":20843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvczJmdit0dTc5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3Y2Q5MGUyMDcwMTE5MTc0N3Y2Y2EzZWU5N2gyZTE4NWNmY2UyY2NjN2VlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":20842,"nextInTopic":20844,"prevInTime":20842,"nextInTime":20844,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"Thanks for your input. Well, we actually eat very healthfully...the sweets that we have in our house are things like organic or homemade cookies, vanilla ","messageBody":"<div id=\"ygrps-yiv-1739478200\">Thanks for your input.<br/>\n<br/>\nWell, we actually eat very healthfully...the sweets that we have in <br/>\nour house are things like organic or homemade cookies, vanilla <br/>\nyogurt, chocolate covered raisins, popscicles...that kind of stuff. <br/>\nIt&#39;s just that when I say &quot;Would you like a  banana or an apple or <br/>\nsome yogurt?&quot; he&#39;ll say &quot;Chocolate raisins!&quot; and that will go on <br/>\nallll day. He just wants the chocolate and the sweets. Nothing <br/>\n*truly* unhealthy, it&#39;s just a matter of quantity. I&#39;m very concerned <br/>\nabout his health and food choices...I think I just need to lighten up <br/>\na little and know that he has a lot of healthy food in his <br/>\nrepetoire.  We did get a &quot;Little Bear&quot; book that tells about when LB <br/>\nate too much sugar how ikky he felt. Finny thought it was hilarious <br/>\nand then asked for all the food that was in the book! LOL.<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Susan &lt;SusanYvonne@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; I&#39;m finding that I&#39;m just all over the place...one day letting<br/>\n&gt; &gt; him eat tons of sugar and then feeling remorseful and making deals<br/>\n&gt; &gt; the next day (ugh) and I *know* this can&#39;t be good. HELP.<br/>\n&gt; <br/>\n&gt; Hi, I&#39;m new here, too, so I hope I&#39;m not overstepping by offering a<br/>\n&gt; suggestion. Like someone else said, at his age you could probably <br/>\n </span></blockquote>give<br/>\n<blockquote><span title=\"ireply\"> &gt; choices rather than watching him eat through a jar of candy. You <br/>\n </span></blockquote>could<br/>\n<blockquote><span title=\"ireply\"> &gt; say, &quot;I&#39;m going fix chicken or spaghetti for dinner. Which one would<br/>\n&gt; you like tonight?&quot;<br/>\n&gt; <br/>\n&gt; You could also put out a variety of healthy snacks that are <br/>\n </span></blockquote>available<br/>\n<blockquote><span title=\"ireply\"> &gt; anytime and in any amount. He&#39;ll know anything you put in that bowl <br/>\n </span></blockquote>is<br/>\n<blockquote><span title=\"ireply\"> &gt; okay to eat whenever he wants. Then steadily widen his choices and<br/>\n&gt; expand the options being offered until everything is available as an<br/>\n&gt; option and he&#39;s able to make decisions without feeling overwhelmed.<br/>\n&gt; <br/>\n&gt; I can imagine that at 2 years old the world seems really, really big<br/>\n&gt; and I wouldn&#39;t have a clue what all my choices would be. You have to<br/>\n&gt; help him make the transition and perhaps he needs to ease into it. <br/>\n </span></blockquote>You<br/>\n<blockquote><span title=\"qreply\"> &gt; have to help him make connections (for example, between what he eats<br/>\n&gt; and how he feels). He needs you to help him understand his body and<br/>\n&gt; these new experiences.<br/>\n&gt; <br/>\n&gt; -- Susan<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":233742879,"authorName":"mammaholt","from":"&quot;mammaholt&quot; &lt;micheleholt@...&gt;","profile":"mammaholt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First  post - Hi.","postDate":"1169263432","msgId":20841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvczIwOCsyMmdxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVvcjM0ZitlanQwQGVHcm91cHMuY29tPg=="},"prevInTopic":20837,"nextInTopic":20842,"prevInTime":20840,"nextInTime":20842,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"Thank you both for your thougtful responses. To answer some of your questions... I decided to let him choose his own bedtime and food because those are the","messageBody":"<div id=\"ygrps-yiv-540017235\">Thank you both for your thougtful responses. To answer some of your <br/>\nquestions...<br/>\n<br/>\nI decided to let him choose his own bedtime and food because those <br/>\nare the only areas where we have &quot;issues.&quot;  I thought that by letting <br/>\nhim take some control we might avoid the conflicts that often arise <br/>\naround both those issues.  I just went back to our usual...saying yes <br/>\nmost of the time unless it is really obvious that he is exhausted or <br/>\nhad too much sugar. We&#39;re doing OK...he seems to be liking choosing <br/>\nwhether to nap or not and usually chooses TO.<br/>\n<br/>\nI should clarify my earlier post...playing with construction toys is <br/>\nnot *all* we do...oh, lordy, no. I had to lol when I realized that my <br/>\npost might have come off that way. We are a magical, creative, active <br/>\nfamily.  We do SO many fantastic and wonderful things...I just meant <br/>\nthat his favorite *toys* are construction toys and I have a hard time <br/>\nstaying with the games too long.  I do enjoy them more when we&#39;re <br/>\noutside in the sand or mud or water.  Today we took the city bus, <br/>\njust for fun, and went to the library and then downtown with the <br/>\nintent of going to the Texas History Museum (we live in Austin) to <br/>\nsee bugs and dinosaurs. On the way we found a big construction site <br/>\nand stopped there for some time. We watched a building being built <br/>\nand it was cool. One guy came over and talked to Finn and let him <br/>\nwear his hard hat. Super fun and interesting. Then we went and got <br/>\npizza and some lemonade and watched some skateboarders and talked <br/>\nabout homeless kids. Came home, took a nap, then turned the dining <br/>\nroom table into a ping-pong table and played till Dad came home from <br/>\nwork. A typical, fun day for us.<br/>\n<br/>\nThat&#39;s a really good idea to ask him to play *my* games for awhile. I <br/>\nnever thought of taking turns with games. I think it I put it like <br/>\nthat he&#39;d be game (pun intended)!<br/>\n<br/>\nI got &quot;Unconditional Parenting&quot; today...just mind blowing.<br/>\n<br/>\nThanks to all for all your wisdom.<br/>\n<br/>\nBlessings,<br/>\nMichele<br/>\nMama to Finnigan (almost 3)<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie Peters&quot; <br/>\n&lt;julieannpeters@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; OK, and one more thing, HOW do you guys *make* yourselves play <br/>\n </span></blockquote>for <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; hours on end with toys that YOU find totally uninteresting? We&#39;re <br/>\n&gt; &gt; plagued with construction vehicles...I can last about 1/4 of the <br/>\n </span></blockquote>day <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; and then I feel like my head is going to explode. I just don&#39;t <br/>\n </span></blockquote>enjoy <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; it. I WANT to and I pretend to and I&#39;m a great player...I would <br/>\n </span></blockquote>just <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; like to find a way to really get into it. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; We too were plagued with constuction vehicles, cars, legos, etc. <br/>\n </span></blockquote>when <br/>\n<blockquote><span title=\"ireply\"> &gt; my son was that age...still are and he&#39;s now 10.  I have never been <br/>\n&gt; very creative/playful though I wish I was.  So I can really <br/>\n </span></blockquote>understand <br/>\n<blockquote><span title=\"ireply\"> &gt; where you&#39;re at right now.  <br/>\n&gt; <br/>\n&gt; Have you tried to play his game for a while then ask him to play <br/>\n&gt; *your* game for a while?  You know, taking turns.  You could <br/>\n </span></blockquote>say, &quot;I&#39;m <br/>\n<blockquote><span title=\"ireply\"> &gt; going to play cars with you for an hour, then I&#39;m going to cook <br/>\n&gt; something in the kitchen.  You are more than welcome to join me, <br/>\n </span></blockquote>I&#39;ll <br/>\n<blockquote><span title=\"ireply\"> &gt; show you how to &#39;play&#39; my game.&quot;  Offer to watch a video he likes, <br/>\n&gt; then you invite him to watch a show you like...etc.<br/>\n&gt; <br/>\n&gt; I don&#39;t think you should feel like *your* only option is to play <br/>\n&gt; construction all day.  In my opinion, it&#39;s your only option because <br/>\n&gt; you&#39;ve made it that way.  Go to the park, movies, store, library, a <br/>\n&gt; friend&#39;s, take a walk, make a cake, sing songs, paint, etc.  Break <br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"ireply\"> &gt; day up into segments...ones that vary the construction vehicle <br/>\n </span></blockquote>theme.  <br/>\n<blockquote><span title=\"ireply\"> &gt; This may help...the both of you...you&#39;ll get variety and your son <br/>\n </span></blockquote>may <br/>\n<blockquote><span title=\"ireply\"> &gt; find additional interests.  <br/>\n&gt; <br/>\n&gt; Even varying the places/ways you play construction, might give you <br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"ireply\"> &gt; variety you are looking for.  Take the toys outside and dig in the <br/>\n&gt; dirt...use them to help plant flowers, use laundry to make piles <br/>\n </span></blockquote>that <br/>\n<blockquote><span title=\"ireply\"> &gt; need to be moved...use the toys to load the baskets, etc.  Drive by <br/>\n&gt; construction yards and talk about the real life vehicles, find <br/>\n </span></blockquote>someone <br/>\n<blockquote><span title=\"ireply\"> &gt; who would be willing to give your son a site tour/ride on a <br/>\n </span></blockquote>bulldozer, <br/>\n<blockquote><span title=\"ireply\"> &gt; get some construction videos for him to watch while you do <br/>\n </span></blockquote>something <br/>\n<blockquote><span title=\"ireply\"> &gt; else, etc.<br/>\n&gt; <br/>\n&gt; There are many options...you just have to &quot;find/create&quot; them.  I <br/>\n </span></blockquote>don&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; feel you &quot;have&quot; to do what he does 24/7...you have the right to <br/>\n </span></blockquote>enjoy <br/>\n<blockquote><span title=\"ireply\"> &gt; playtime, too.  The key is finding something you both find <br/>\n </span></blockquote>interesting <br/>\n<blockquote><span title=\"ireply\"> &gt; and enjoy...together.  Right now, I think all you guys need is <br/>\n </span></blockquote>broader <br/>\n<blockquote><span title=\"ireply\"> &gt; horizons.  A three year old only knows what you&#39;ve exposed him <br/>\n&gt; to...expose him to more, a variety of things.  He&#39;ll pick up other <br/>\n&gt; interests along the way...though his favorite may remain <br/>\n </span></blockquote>construction.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; HTH, <br/>\n&gt; Julie Peters<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] First post - Hi.","postDate":"1169257662","msgId":20837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwMTE5MTc0N3Y2Y2EzZWU5N2gyZTE4NWNmY2UyY2NjN2VlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGVvcG50NSt0YmNoQGVHcm91cHMuY29tPg==","referencesHeader":"PGVvcG50NSt0YmNoQGVHcm91cHMuY29tPg=="},"prevInTopic":20836,"nextInTopic":20841,"prevInTime":20836,"nextInTime":20838,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... Hi, I m new here, too, so I hope I m not overstepping by offering a suggestion. Like someone else said, at his age you could probably give choices rather","messageBody":"<div id=\"ygrps-yiv-1833240969\"><blockquote><span title=\"ireply\">&gt; I&#39;m finding that I&#39;m just all over the place...one day letting<br/>\n&gt; him eat tons of sugar and then feeling remorseful and making deals<br/>\n&gt; the next day (ugh) and I *know* this can&#39;t be good. HELP.<br/>\n<br/>\n </span></blockquote>Hi, I&#39;m new here, too, so I hope I&#39;m not overstepping by offering a<br/>\nsuggestion. Like someone else said, at his age you could probably give<br/>\nchoices rather than watching him eat through a jar of candy. You could<br/>\nsay, &quot;I&#39;m going fix chicken or spaghetti for dinner. Which one would<br/>\nyou like tonight?&quot;<br/>\n<br/>\nYou could also put out a variety of healthy snacks that are available<br/>\nanytime and in any amount. He&#39;ll know anything you put in that bowl is<br/>\nokay to eat whenever he wants. Then steadily widen his choices and<br/>\nexpand the options being offered until everything is available as an<br/>\noption and he&#39;s able to make decisions without feeling overwhelmed.<br/>\n<br/>\nI can imagine that at 2 years old the world seems really, really big<br/>\nand I wouldn&#39;t have a clue what all my choices would be. You have to<br/>\nhelp him make the transition and perhaps he needs to ease into it. You<br/>\nhave to help him make connections (for example, between what he eats<br/>\nand how he feels). He needs you to help him understand his body and<br/>\nthese new experiences.<br/>\n<br/>\n-- Susan</div>","specialLinks":[]},{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] First  post - Hi.","postDate":"1169235147","msgId":20836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwMzM1OS4zMTg3NS5xbUB3ZWI1MzAwMy5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGVvcG50NSt0YmNoQGVHcm91cHMuY29tPg=="},"prevInTopic":20835,"nextInTopic":20837,"prevInTime":20835,"nextInTime":20837,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"Hi, I m also new to this list... ... Lettimg him choose his own food does not equate to giving him 100% freedom as to what he wants to eat, now does it?","messageBody":"<div id=\"ygrps-yiv-1018094006\">Hi, I&#39;m also new to this list...<br/>\n<br/>\n--- mammaholt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:micheleholt@...\">micheleholt@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I started letting him choose his own <br/>\n&gt; bedtime and food (these were the only 2 areas where we were having <br/>\n&gt; issues with each other). It was....hmmmm, not so pretty. The poor <br/>\n&gt; thing was just sugared up out of his mind constantly... <br/>\n<br/>\n </span></blockquote>Lettimg him choose his own food does not equate to giving him 100%<br/>\nfreedom as to what he wants to eat, now does it? Especially not for a<br/>\n2yo. Just like you don&#39;t give you kid the option of eating magic<br/>\nbrownies or psychedelic mushrooms (I assume), you could refuse to give<br/>\nyour kid the option of eating other things which are harmful to him,<br/>\nsuch as sugar. Sugar is bad for people, especially little kids, while<br/>\nbeing addictive to some degree, and doesn&#39;t have any nutritional value<br/>\nother than calories, which are easy enough to get in other ways. <br/>\n<br/>\nHow about letting your son choose what he wants to eat like this: &quot;Do<br/>\nyou want a banana, or an apple, or strawberries or a muesli bar?&quot;.<br/>\nDon&#39;t even give the kid too many options at 2yo, or you&#39;ll overload<br/>\nhim. <br/>\n<br/>\nThis is of course not going to go over very well if you yourself only<br/>\neat sugary things, but if you give the right example it should work. <br/>\n<br/>\nMarieke<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nCheap talk?<br/>\nCheck out Yahoo! Messenger&#39;s low PC-to-Phone call rates.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://voice.yahoo.com\">http://voice.yahoo.com</a></div>","specialLinks":[]},{"userId":227739966,"authorName":"Julie Peters","from":"&quot;Julie Peters&quot; &lt;julieannpeters@...&gt;","profile":"julie_a_peters","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First  post - Hi.","postDate":"1169231823","msgId":20835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvcjM0ZitlanQwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVvcG50NSt0YmNoQGVHcm91cHMuY29tPg=="},"prevInTopic":20833,"nextInTopic":20836,"prevInTime":20834,"nextInTime":20836,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... We too were plagued with constuction vehicles, cars, legos, etc. when my son was that age...still are and he s now 10.  I have never been very","messageBody":"<div id=\"ygrps-yiv-2091886904\"><blockquote><span title=\"ireply\">&gt; OK, and one more thing, HOW do you guys *make* yourselves play for <br/>\n&gt; hours on end with toys that YOU find totally uninteresting? We&#39;re <br/>\n&gt; plagued with construction vehicles...I can last about 1/4 of the day <br/>\n&gt; and then I feel like my head is going to explode. I just don&#39;t enjoy <br/>\n&gt; it. I WANT to and I pretend to and I&#39;m a great player...I would just <br/>\n&gt; like to find a way to really get into it. <br/>\n<br/>\n<br/>\n </span></blockquote>We too were plagued with constuction vehicles, cars, legos, etc. when <br/>\nmy son was that age...still are and he&#39;s now 10.  I have never been <br/>\nvery creative/playful though I wish I was.  So I can really understand <br/>\nwhere you&#39;re at right now.  <br/>\n<br/>\nHave you tried to play his game for a while then ask him to play <br/>\n*your* game for a while?  You know, taking turns.  You could say, &quot;I&#39;m <br/>\ngoing to play cars with you for an hour, then I&#39;m going to cook <br/>\nsomething in the kitchen.  You are more than welcome to join me, I&#39;ll <br/>\nshow you how to &#39;play&#39; my game.&quot;  Offer to watch a video he likes, <br/>\nthen you invite him to watch a show you like...etc.<br/>\n<br/>\nI don&#39;t think you should feel like *your* only option is to play <br/>\nconstruction all day.  In my opinion, it&#39;s your only option because <br/>\nyou&#39;ve made it that way.  Go to the park, movies, store, library, a <br/>\nfriend&#39;s, take a walk, make a cake, sing songs, paint, etc.  Break the <br/>\nday up into segments...ones that vary the construction vehicle theme.  <br/>\nThis may help...the both of you...you&#39;ll get variety and your son may <br/>\nfind additional interests.  <br/>\n<br/>\nEven varying the places/ways you play construction, might give you the <br/>\nvariety you are looking for.  Take the toys outside and dig in the <br/>\ndirt...use them to help plant flowers, use laundry to make piles that <br/>\nneed to be moved...use the toys to load the baskets, etc.  Drive by <br/>\nconstruction yards and talk about the real life vehicles, find someone <br/>\nwho would be willing to give your son a site tour/ride on a bulldozer, <br/>\nget some construction videos for him to watch while you do something <br/>\nelse, etc.<br/>\n<br/>\nThere are many options...you just have to &quot;find/create&quot; them.  I don&#39;t <br/>\nfeel you &quot;have&quot; to do what he does 24/7...you have the right to enjoy <br/>\nplaytime, too.  The key is finding something you both find interesting <br/>\nand enjoy...together.  Right now, I think all you guys need is broader <br/>\nhorizons.  A three year old only knows what you&#39;ve exposed him <br/>\nto...expose him to more, a variety of things.  He&#39;ll pick up other <br/>\ninterests along the way...though his favorite may remain construction.<br/>\n<br/>\nHTH, <br/>\nJulie Peters</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First  post - Hi.","postDate":"1169228748","msgId":20833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvcjA0YytoODVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVvcG50NSt0YmNoQGVHcm91cHMuY29tPg=="},"prevInTopic":20829,"nextInTopic":20835,"prevInTime":20832,"nextInTime":20834,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"... Oops! Sounds like maybe you dumped too much on him all at once. Promoting autonomy isn t quite the same as handing a child total independance. ... One","messageBody":"<div id=\"ygrps-yiv-714338278\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;mammaholt&quot; <br/>\n&lt;micheleholt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My precocious son is almost 3-years old... I got really <br/>\n&gt; excited about this stuff and started letting him choose his own <br/>\n&gt; bedtime and food (these were the only 2 areas where we were having <br/>\n&gt; issues with each other). It was....hmmmm, not so pretty.<br/>\n<br/>\n </span></blockquote>Oops! Sounds like maybe you dumped too much on him all at once. <br/>\nPromoting autonomy isn&#39;t quite the same as handing a child total <br/>\nindependance. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The poor <br/>\n&gt; thing was just sugared up out of his mind constantly and couldn&#39;t <br/>\n&gt; sleep and then would sleep 3 hours in the middle of the day<br/>\n<br/>\n </span></blockquote>One thing I&#39;d like to point out is that by dropping limitations on <br/>\nfood and sleep at the same time you don&#39;t really know if he <br/>\nwas &quot;sugared out of his mind&quot; or exhausted past the point of calming <br/>\ndown, or just freaked out that mom wasn&#39;t helping him figure things <br/>\nout anymore. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you guys help me with this?  How can I balance this now? Right <br/>\n&gt; now I&#39;m finding that I&#39;m just all over the place...one day letting <br/>\n&gt; him eat tons of sugar and then feeling remorseful and making deals <br/>\n&gt; the next day (ugh) and I *know* this can&#39;t be good. HELP.<br/>\n<br/>\n </span></blockquote>Rather than being &quot;all over the place&quot;, go back to whatever you were <br/>\ndoing already for a week or so. Consistency *is* important, even wrt <br/>\nautonomy - maybe especially wrt autonomy. Once you have some <br/>\nequilibrium, look at what &quot;works&quot; and what doesn&#39;t seem to work and <br/>\nsee if you can form some theories about why. Think about why you are <br/>\nwanting to drop limits in the first place - what do you think your <br/>\nson will gain from the experience? Read more about Principles. Then <br/>\npick one thing to start saying &quot;yes&quot; about more, rather than <br/>\ndropping all the limits all at once. <br/>\n<br/>\nThere&#39;s a learning curve in here for *you* in terms of figuring out <br/>\nhow to help your kid explore more of the world gently and safely in <br/>\nways that aren&#39;t utterly overwhelming to him. That&#39;s my *why* wrt to <br/>\nunschooling things like food, sleep, media... (just to name the <br/>\nscary ones!) I want to help my kids explore and learn as much as <br/>\nthey desire in ways that are safe and supportive, with me as a <br/>\nresource and backup, rather than an adversary. <br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":233742879,"authorName":"mammaholt","from":"&quot;mammaholt&quot; &lt;micheleholt@...&gt;","profile":"mammaholt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"First  post - Hi.","postDate":"1169187557","msgId":20829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvcG50NSt0YmNoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20833,"prevInTime":20828,"nextInTime":20830,"topicId":20829,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, I ve been lurking...absorbing...celebrating...wondering...questioning. I feel I m experiencing a paradigm shift as maybe never before. Whew. I","messageBody":"<div id=\"ygrps-yiv-1759658780\">Hello everyone,<br/>\n<br/>\nI&#39;ve been <br/>\nlurking...absorbing...celebrating...wondering...questioning. I feel <br/>\nI&#39;m experiencing a paradigm shift as maybe never before. Whew.<br/>\n<br/>\nI have a lot to say and a lot of questions to ask, but I&#39;d like to <br/>\nstart slowly with just a couple of pressing ones.<br/>\n<br/>\nI&#39;m finding myself resisting some issues, but it has dawned on me  <br/>\nthat perhaps I might need to consider my child&#39;s age when approaching <br/>\nsome things.  My precocious son is almost 3-years old... I got really <br/>\nexcited about this stuff and started letting him choose his own <br/>\nbedtime and food (these were the only 2 areas where we were having <br/>\nissues with each other). It was....hmmmm, not so pretty. The poor <br/>\nthing was just sugared up out of his mind constantly and couldn&#39;t <br/>\nsleep and then would sleep 3 hours in the middle of the day(this was <br/>\ngood! lol) and then not at night and he seemed really unhappy and <br/>\nirritable and actually kind of freaked out. If he had not seemed so <br/>\nmisreable I think could have just gone with it, but I finally had to <br/>\nstep back and call it a day FOR NOW because he was really struggling.<br/>\n<br/>\nCan you guys help me with this?  How can I balance this now? Right <br/>\nnow I&#39;m finding that I&#39;m just all over the place...one day letting <br/>\nhim eat tons of sugar and then feeling remorseful and making deals <br/>\nthe next day (ugh) and I *know* this can&#39;t be good. HELP.<br/>\n<br/>\nOK, and one more thing, HOW do you guys *make* yourselves play for <br/>\nhours on end with toys that YOU find totally uninteresting? We&#39;re <br/>\nplagued with construction vehicles...I can last about 1/4 of the day <br/>\nand then I feel like my head is going to explode. I just don&#39;t enjoy <br/>\nit. I WANT to and I pretend to and I&#39;m a great player...I would just <br/>\nlike to find a way to really get into it. <br/>\n<br/>\nThank you!<br/>\n<br/>\n<br/>\nBlessings,<br/>\n<br/>\nMichele<br/>\nMom to Finnigan 2.10</div>","specialLinks":[]}],"prevTopicId":20876,"nextTopicId":20879}}