{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":251728791,"authorName":"CHRIS CHANDLER","from":"CHRIS CHANDLER &lt;chris1962@...&gt;","profile":"chriscb2262","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: new to unschooling--questions","postDate":"1179839183","msgId":23894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MzIxLjE2MTUxLnFtQHdlYjg0MTA5Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23880,"nextInTopic":0,"prevInTime":23893,"nextInTime":23895,"topicId":23867,"numMessagesInTopic":0,"msgSnippet":"Thank you, Joyce and Meredith, for your replies. Very helpful. Taking a new look at expectations is a great recommendation and one I ve been spending lots of","messageBody":"<div id=\"ygrps-yiv-1575435934\">Thank you, Joyce and Meredith, for your replies. Very helpful. Taking a new look at expectations is a great recommendation and one I&#39;ve been spending lots of time thinking about. Also, thanks for the reminder of your website Joyce. Helpful to roam there again.<br/>\n   <br/>\n  I&#39;m so grateful to all the discussions on this list. It&#39;s invaluable to have such guides on this journey!<br/>\n   <br/>\n  Chris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: new to unschooling--questions","postDate":"1179758898","msgId":23880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYyc2JmaSs4Mmw4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYycXBxNSsxZzdmQGVHcm91cHMuY29tPg=="},"prevInTopic":23876,"nextInTopic":23894,"prevInTime":23879,"nextInTime":23881,"topicId":23867,"numMessagesInTopic":0,"msgSnippet":"... them ... Can you roll the windows down? I ve found that helpful. Can you encourage them to roar like lions rather than screech like banshees? Those are","messageBody":"<div id=\"ygrps-yiv-476819869\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Chris&quot; &lt;chris1962@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Today it was play. But I find it startling and distracting for <br/>\n </span></blockquote>them <br/>\n<blockquote><span title=\"ireply\"> &gt; to actually scream.<br/>\n<br/>\n </span></blockquote>Can you roll the windows down? I&#39;ve found that helpful. Can you <br/>\nencourage them to roar like lions rather than screech like banshees? <br/>\nThose are much easier sounds to hear, even at volume.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; #2--sometimes we have to go somewhere and I have no options about <br/>\n&gt; taking the kids. Sometimes my older child (age 7) will get super <br/>\n </span></blockquote>mad <br/>\n<blockquote><span title=\"ireply\"> &gt; about going, will &quot;refuse&quot; to go, and will yell at me.<br/>\n<br/>\n </span></blockquote>What is the lead-up to this like? Are you making sure he has plenty <br/>\nof warning and that he&#39;s not in the middle of something when you&#39;re <br/>\ntrying to leave? That includes the middle of a tv show!! I try to  <br/>\nplan to leave after a show ends, even if that means leaving half an <br/>\nhour earlier. That&#39;s something Mo and I talk about, too - oh, look, <br/>\nthere are three episodes of Spongebob coming up, and I want to go <br/>\nafter the first one. That may make it tough to leave, how do we want <br/>\nto handle that? Sometimes she&#39;s okay watching just one episode, <br/>\nother times she&#39;ll actually suggest turning the tv off sooner so she <br/>\ndoesn&#39;t get sucked in and not want to leave. <br/>\n<br/>\nSomething else I find helpful with Mo is to include her in the <br/>\ngetting-ready-to-go process by means of a list. Being involved in <br/>\nthe process helps her not *get* in the middle of something. She <br/>\nloves lists, loves to be able to see how many things are left to do <br/>\n(I put everything on the list, too, like &quot;go pee&quot; and &quot;find keys&quot;) <br/>\nand she loves being the one to cross things off. Otherwise the <br/>\nprocess of getting out the door can seem overwhelming to her. <br/>\n<br/>\nRecently Mo hasn&#39;t been wanting to go to the big park in Nashville <br/>\nat all, which is challenging bc that&#39;s where the skatepark is - and <br/>\nRay likes to skate. So I&#39;ve been looking into alternatives so that <br/>\nshe doesn&#39;t have to come along - either someone else taking Ray or <br/>\nsomeone else hanging out with Mo. Interestingly, since I&#39;ve been <br/>\ndoing that, on the occasions where I can&#39;t come up with another <br/>\noption (or the option falls through) she&#39;s been much more <br/>\naccomodating about *having* to go along and has good suggestions for <br/>\nways she can be okay with the situation. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and to give them a choice of <br/>\n&gt; something fun to do afterwards. <br/>\n<br/>\n </span></blockquote>This takes a little advance planning in terms of time, but what <br/>\nabout doing something fun *before* - maybe not big fun like going to <br/>\nthe park, but little fun like a stop at a store or a drive-thru to <br/>\npick up a toy? That&#39;s often one of Mo&#39;s suggestions. A brand-new toy <br/>\nto explore - even a cheap one that&#39;s only going to last the <br/>\nafternoon - can take the blahs out of a dull trip to town. That <br/>\nstill leaves *after* as an option, too.<br/>\n<br/>\nOh! (I keep thinking of things) its also good to look at what the <br/>\nday after is like for these outings that he&#39;s refusing. One of the <br/>\nreasons Mo doesn&#39;t like going to the Nashville park is that we end <br/>\nup being gone most of the day, and she&#39;s an introvert, so the next <br/>\nday she spends a whole lot of time de-compressing. So from her <br/>\nperspective, going to the park is a two-day trip. If she has a lot <br/>\nof projects going on at home, that&#39;s a real bummer. This wasn&#39;t an <br/>\nissue when she was younger bc she had less of a conception of time - <br/>\nits only since she has started to understand the whole today-<br/>\ntommorrow-yesterday thing that she hasn&#39;t wanted to go to the big <br/>\npark. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] new to unschooling--questions","postDate":"1179746831","msgId":23876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjVCQTc2LTJCRjAtNEVFMi1CRUU0LTY0MkVENkQzMzk1Q0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGYycXBxNSsxZzdmQGVHcm91cHMuY29tPg==","referencesHeader":"PGYycXBxNSsxZzdmQGVHcm91cHMuY29tPg=="},"prevInTopic":23867,"nextInTopic":23880,"prevInTime":23875,"nextInTime":23877,"topicId":23867,"numMessagesInTopic":0,"msgSnippet":"... Others will come along with suggestions on what to do in the moment, but three things over all  will help you think about problems in a new way. 1)","messageBody":"<div id=\"ygrps-yiv-1868984218\">On May 20, 2007, at 8:40 PM, Chris wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I find it startling and distracting for them<br/>\n&gt; to actually scream. I asked them to stop b/c it was hard for me to<br/>\n&gt; drive safely when they were screaming.<br/>\n<br/>\n </span></blockquote>Others will come along with suggestions on what to do in the moment,  <br/>\nbut three things over all  will help you think about problems in a  <br/>\nnew way.<br/>\n<br/>\n1) Expectations. This is probably the biggest source of frustration  <br/>\nwith kids. We expect a certain behavior from them and become  <br/>\nfrustrated when they behave differently. It will help a lot to  <br/>\n*expect* them to scream while they play. I suspect you&#39;re clinging to  <br/>\nthe expectation of quiet and when they start screaming it feels like  <br/>\nyour expectation is beyond your ability to control because you can&#39;t  <br/>\nmake them do what you want them to.<br/>\n<br/>\n2) Be proactive rather than reactive. What ways can you help them not  <br/>\nneed to scream? Run around the backyard before they get in the car?  <br/>\nMaking sure they&#39;re well fed?<br/>\n<br/>\n3) There are always other options.<br/>\n<br/>\nThat sounds simplistic, but once you get away from the conventional  <br/>\nparenting methods of making kids do things the way we&#39;ve decided they  <br/>\nneed done, those are foundational building blocks to thinking and  <br/>\nlooking at the decisions we make differently.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes we have to go somewhere and I have no options about<br/>\n&gt; taking the kids. Sometimes my older child (age 7) will get super mad<br/>\n&gt; about going, will &quot;refuse&quot; to go, and will yell at me.<br/>\n<br/>\n </span></blockquote>Even in an emergency there are options though it might be a challenge  <br/>\nfor most of us, even those of us who have been doing it a long time,  <br/>\nto think of them. But when kids are filled with the confidence that  <br/>\nwe have always put in effort not to impose on them, they are more  <br/>\nwilling to go along. When people are filled to the brim with loving  <br/>\nconsideration, they are willing to be generous with their time with  <br/>\nothers.<br/>\n<br/>\nThe reason people fight what feels like a reasonable request is  <br/>\nbecause they feel that they need to fight to get what they need.  <br/>\n*You* may not feel your son is right in those feelings but he isn&#39;t  <br/>\ngoing to react to your feelings ;-) He&#39;s going to react to *his*  <br/>\nperception of the world. Trust him. If he feels he&#39;s being dragged  <br/>\nabout too much, then he *is* being dragged about too much. From his  <br/>\npoint of view he needs to fight to get what he wants. Change that  <br/>\nperception and you&#39;ll change his reaction.<br/>\n<br/>\n(Though some kids *do* have difficulties with transitions. If your  <br/>\nson is one, plenty of people on the list will have ideas on making  <br/>\ntransitions smoother.)<br/>\n<br/>\nThere are always options. Often we can&#39;t think of them. (Though it  <br/>\ngets easier.) Too often it&#39;s inconvenient to think of other options  <br/>\nso we close our mind to anything other than what&#39;s easiest for us.  <br/>\nIt&#39;s *much* easier to pack kids into the car to go to the grocery  <br/>\nstore than it is to make arrangements to go alone. It feels like  <br/>\nwe&#39;re giving up our time to do things we &quot;have to&quot; do, so the kids  <br/>\nshould do. Which is another roadblock in thinking creatively. There  <br/>\nisn&#39;t anything we have to do. *Everything* is a choice. We don&#39;t even  <br/>\nhave to stay with our kids. We *could* choose to leave. Not liking  <br/>\nthe consequences of the other options is not the same as not having  <br/>\noptions. It&#39;s hugely freeing when we realize that everything we do is  <br/>\nwhat we&#39;ve chosen to do.<br/>\n<br/>\nThere is a lot of discussion about &quot;have to&quot; as well as discussion of  <br/>\ntypical parenting questions at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joyfullyrejoycing.com/\">http://www.joyfullyrejoycing.com/</a><br/>\n<br/>\nThe parenting stuff is on the right and learning is on the left.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251728791,"authorName":"Chris","from":"&quot;Chris&quot; &lt;chris1962@...&gt;","profile":"chriscb2262","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"new to unschooling--questions","postDate":"1179708037","msgId":23867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYycXBxNSsxZzdmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":23876,"prevInTime":23865,"nextInTime":23868,"topicId":23867,"numMessagesInTopic":0,"msgSnippet":"We re new to homeschooling and even newer to uschooling so sometimes I come up against situations where I really can t think on my feet and figure out what the","messageBody":"<div id=\"ygrps-yiv-1969531465\">We&#39;re new to homeschooling and even newer to uschooling so sometimes <br/>\nI come up against situations where I really can&#39;t think on my feet <br/>\nand figure out what the unschooling approach would be. Here are 2 <br/>\nspecific examples. I&#39;d appreciate responses--I&#39;m hoping that some <br/>\ninsight into different ways to approach a few of my own real-life <br/>\nsituations will move me along in my day-to-day understanding.<br/>\n<br/>\n#1--driving in the car on a short trip to do go to an appointment <br/>\nfor 1 child. Both kids in the car. They&#39;re being silly in the back <br/>\nwhich is fine but at some point it they usually start screaming--<br/>\nsometimes it&#39;s just play and sometimes it&#39;s conflict between the 2. <br/>\nToday it was play. But I find it startling and distracting for them <br/>\nto actually scream. I asked them to stop b/c it was hard for me to <br/>\ndrive safely when they were screaming. But it kept on and on. I <br/>\ntried stopping and letting them &quot;get their screams out&quot; but it <br/>\ndidn&#39;t help and finally I just got mad and yelled. Not proud.<br/>\n<br/>\n#2--sometimes we have to go somewhere and I have no options about <br/>\ntaking the kids. Sometimes my older child (age 7) will get super mad <br/>\nabout going, will &quot;refuse&quot; to go, and will yell at me. I try to make <br/>\nsure he/they have things to do in the car and while we&#39;re gone, give <br/>\nthem choices about what to take along, and to give them a choice of <br/>\nsomething fun to do afterwards. But sometimes he just has to come <br/>\nalong. Any ideas for making this situation less painful for us all? <br/>\n<br/>\nThanks,<br/>\n<br/>\nChris</div>","specialLinks":[]}],"prevTopicId":23849,"nextTopicId":23819}}