{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":60,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What is it with video games and unschooling?","postDate":"1259443901","msgId":42245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4NDI1MjJCLUUyMTktNDA0Qy1BRkUwLTQxODE1RUEyRDQ1N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGZlZjM1N2VmMDkxMTI4MDgxMnBjZjY2MGQ4cTMxYjBlNDcxZThkNDk2Y2ZAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGZlZjM1N2VmMDkxMTI4MDgxMnBjZjY2MGQ4cTMxYjBlNDcxZThkNDk2Y2ZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42244,"nextInTopic":42246,"prevInTime":42244,"nextInTime":42246,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... Would you make him, though? Would you drag him to dinner if he said no? Would you refuse to discuss work if he kept pulling the conversation back? ... Yes,","messageBody":"<div id=\"ygrps-yiv-1409537419\">On Nov 28, 2009, at 11:12 AM, Hillary Heidelberg wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would think that he would benefit<br/>\n&gt; from a break--perhaps I&#39;d suggest taking him out to dinner, or to a  <br/>\n&gt; movie,<br/>\n&gt; or try and steer the conversation to another topic.<br/>\n<br/>\n </span></blockquote>Would you make him, though? Would you drag him to dinner if he said  <br/>\nno? Would you refuse to discuss work if he kept pulling the  <br/>\nconversation back?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I do think in our role as loving partners, or loving<br/>\n&gt; parents, we can sometimes see that our partner, or our child, is  <br/>\n&gt; engaging in<br/>\n&gt; behaviors that are not healthy, and it is indeed our place to help.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yes, help! But not decide on a solution and impose it on the child.  <br/>\nThat turns away from the original problem (a building stress level  <br/>\nfor instance) and turns the child into the problem (making the child  <br/>\nstop what they&#39;re doing and comply with mom&#39;s solution.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do think that video games have an addictive quality (just one  <br/>\n&gt; more level, mom!)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Passion and engagement can look the same as addiction.<br/>\n<br/>\nDo you play video games? It really helps to understand better what  <br/>\nthe draw is when you&#39;ve played them enough to really get them.<br/>\n<br/>\nHumans by nature are puzzle solvers. Video games are fascinating  <br/>\npuzzles to solve. They&#39;re like chess without the boring parts ;-)<br/>\n<br/>\nPlease do read what Schuyler just posted about the Rat Park study,  <br/>\nand read at the links:<br/>\n<br/>\nSchuyler:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My favorite addiction examination that I trot out as often as I  <br/>\n&gt;&gt; can is Rat Park (<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Rat_Park\">http://en.wikipedia.org/wiki/Rat_Park</a> and http:// <br/>\n&gt;&gt; www.walrusmagazine.com/articles/2007.12-health-rat-trap/). Given  <br/>\n&gt;&gt; what Bruce Alexander found with rats and opiates, it would seem to  <br/>\n&gt;&gt; me that if carbs are addictive they should work much the same way.<br/>\n&gt;&gt;<br/>\n&gt;&gt; To sum up, what Dr. Alexander found was that rats in a lovely  <br/>\n&gt;&gt; habitat with engaging things to do would choose not to use  <br/>\n&gt;&gt; narcotic laced water, they&#39;d try it, maybe share it with their den  <br/>\n&gt;&gt; mates, and then go back to the straight water. When they were  <br/>\n&gt;&gt; forced into a physical addiction by the researchers replacing all  <br/>\n&gt;&gt; the water in the lovely and spacious habitat with only laced  <br/>\n&gt;&gt; water, as soon as they were given a choice they would go back to  <br/>\n&gt;&gt; the straight water, suffering the physical withdrawal as they did  <br/>\n&gt;&gt; so. So even a known physically addictive substance could be  <br/>\n&gt;&gt; overcome by a rats in a good environment.<br/>\n<br/>\n<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/04/19/\">http://www.washingtonpost.com/wp-dyn/content/article/2009/04/19/</a> <br/>\n&gt; AR2009041902350.html<br/>\n&gt;<br/>\n&gt;&gt; Symptoms included spending increasing amounts of time and money on  <br/>\n&gt;&gt; video games to feel the same level of excitement; irritability or  <br/>\n&gt;&gt; restlessness when play is scaled back; escaping problems through  <br/>\n&gt;&gt; play; skipping chores or homework to spend more time at the  <br/>\n&gt;&gt; controller; lying about the length of playing time; and stealing  <br/>\n&gt;&gt; games or money to play more.<br/>\n&gt;&gt;<br/>\n&gt;&gt; What he found, he said, was that children considered pathological  <br/>\n&gt;&gt; gamers did worse in school, had trouble paying attention in class  <br/>\n&gt;&gt; and reported feeling &quot;addicted.&quot; They were twice as likely to  <br/>\n&gt;&gt; report attention-deficit disorder or attention-deficit  <br/>\n&gt;&gt; hyperactivity disorder.<br/>\n&gt;&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s important to realize that this -- and all studies -- are done on  <br/>\nschooled children. It&#39;s not that unschooled kids are paragons but  <br/>\nwhat unschooled kids have -- or should have! -- is little that they  <br/>\nneed to escape from.<br/>\n<br/>\nSchool, chores and homework are huge imposers on kids time and huge  <br/>\nstressors. Schooled kids have 1) a need to destress and 2) little  <br/>\nfree time.<br/>\n<br/>\nFirst, some people find video games a good way to unwind and I&#39;d bet  <br/>\nthat while they&#39;re obviously seeking more exciting games, they&#39;re  <br/>\nalso looking for more stress relief. (For me it was TV during my  <br/>\nschool years. Lots of &quot;trashy&quot; shows like Lost in Space and Man From  <br/>\nU.N.C.L.E. and Brady Bunch. The summer after my freshman year in  <br/>\ncollege I pretty much parked myself before HBO which was brand new  <br/>\nback then and played the same few movies over and over and over. I  <br/>\nestimated I watched Monty Python and the Holy Grail 37 times over  <br/>\nthat summer.)<br/>\n<br/>\nSecond, the best designed video games take a lot of time to get  <br/>\nthrough. When time is constrained by school, chores and homework (and  <br/>\nparents telling you to shut the damn game off) it&#39;s natural to want  <br/>\nto grab every moment to play.<br/>\n<br/>\n*If* video games were addictive, radically unschooled kids, who have  <br/>\nthe freedom to play as much as they want, would show the highest rate  <br/>\nof addiction. But that doesn&#39;t happen. Unschooled kids have the time  <br/>\nto play a game out. Unschooled kids aren&#39;t using games to escape. And  <br/>\nbecause of those two factors, unschooled kids who haven&#39;t been  <br/>\nlimited, while they may spend a fair amount of time with video games  <br/>\nthey enjoy, *do* have varied lives.<br/>\n<br/>\nIf you read further:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;It&#39;s not that the games are addictive. It&#39;s that some kids use  <br/>\n&gt; them in a way that is out of balance and harms various other areas  <br/>\n&gt; of their lives.&quot;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;d say even further that some (schooled) kids have lives that are  <br/>\nalready out of balance and they&#39;re *seeking* a balance (less stress,  <br/>\nmore time for things they enjoy). The problem is that the video games  <br/>\ndon&#39;t make *what&#39;s causing* the stress go away. School, homework and  <br/>\nchores are still there. The problem is that those things also take up  <br/>\nthe time they need to explore their interests (especially if those  <br/>\ninterests are time consuming like video games).<br/>\n<br/>\nAnd further:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;I think kids use this just the way kids watch television, the way  <br/>\n&gt; kids now use their cellphones,&quot; said Michael Brody, chairman of the  <br/>\n&gt; media committee of the American Academy of Child and Adolescent  <br/>\n&gt; Psychiatry. &quot;They do it to relieve their anxiety and depression.  <br/>\n&gt; It&#39;s all a matter of balance.&quot;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s hardly confirmation.<br/>\n<br/>\nPlease do read here:<br/>\n<br/>\nTV and Other Addictions:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/yhuwxcx\">http://tinyurl.com/yhuwxcx</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What is it with video games and unschooling?","postDate":"1259443736","msgId":42244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1MTYyMC42Mzk5NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhlcnZjNytzdG9uQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlcnZjNytzdG9uQGVHcm91cHMuY29tPg=="},"prevInTopic":42243,"nextInTopic":42245,"prevInTime":42243,"nextInTime":42245,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... What if you added books to that list?? I am known to be so obsessed by the book I am reading that I will stay up all night, eat only if I can read at","messageBody":"<div id=\"ygrps-yiv-1049685319\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; I do think that video games have an addictive quality (just one more level,<br/>\n&gt; mom!) much like porn, cigarettes and gambling.&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>What if you added books to that list?? I am known to be so &quot;obsessed&quot; by the book I am reading that I will stay up all night, eat only if I can read at the same time and not bathe either ( can&#39;t read and bathe at the same time!).<br/>\nIf a child is &quot;obsessed&quot; with reading books would you call it addictive??<br/>\nThen I am adicted to books!!!!! Heck I read last night until 3AM ..until I could not make sense of what I was reading anymore.<br/>\nMy 7 year old is a big time gamer. He plays everyday and loves video games. He was NEVER limited and always supported in playing. I play with him when I can, I help him find cheats , create games, find videos about playing or beating games and much, much more.<br/>\nI bring him food and drinks. <br/>\nHe is very passionate about video games and some online games.<br/>\nHe has learned so much playing. He learned to read because of wanting to communicate on Roblox!<br/>\nJust  30 minutes ago he wanted to go run with his dad so he went outside to get his dad to run with him and he is know playing basketball.<br/>\nHe is really into basketball this year with his dad and has no problem putting his games down to go play.<br/>\nHe also takes breaks to play pretend with his 3 year old sister, do stuff with me and more.<br/>\nI thinks people are not used to kids that have had this kind of freedom and support as my son has.<br/>\nIts so different than kids who have been limited like some of his friends that come to play and all they want to do is play video games. My son gets pretty frustrated with that. But those kids have to get as much play time while they can. <br/>\nI love this, it is about TV but the same about video games :<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259439978","msgId":42243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlczExYStycDhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGIyN2MwZTIwOTExMjgxMTIycDRkM2UwODc2cmM4MWY3OGE5YTRiNjE4NDVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42242,"nextInTopic":42244,"prevInTime":42242,"nextInTime":42244,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... One of the wonderful things about unschooling is its not simply a matter of deregulating tv, movies, games, etc. Its about empowering kids to choose - and","messageBody":"<div id=\"ygrps-yiv-1381638283\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jacque Valdez &lt;jacque.valdez@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; to hear me say to my 8 year old who asks to watch certain movies go ahead<br/>\n&gt; honey i trust to you turn it off it gets too scary <br/>\n<br/>\n </span></blockquote>One of the wonderful things about unschooling is its not simply a matter of deregulating tv, movies, games, etc. Its about empowering kids to choose - and that means empowering them to know when to turn something off. That&#39;s something that can really get lost when we move away from discussing real life stories. <br/>\n<br/>\nMo (8) went through a phase of really struggling with certain kinds of movies - the Harry Potter series in particular - because she sooooo wanted to watch them, but was worried about the &quot;scary parts&quot;. Some of the scary parts from Mo&#39;s perspective are parts with angry adult faces in them, btw. Fight scenes don&#39;t trouble her the way an image of an adult intimidating a child does - that&#39;s &quot;violence&quot; to Morgan. So we helped her develop some strategies so that she could watch these movies. We Didn&#39;t take her to see them in theaters, for one thing, right up until the most recent. On dvd, she could skip a scene, or turn off the sound, or change the language of the movie (I don&#39;t know why that helps, but it does!). She could watch the extras and see how the special effects were made and see interviews with actors and connect with the fact that its all pretend. <br/>\n<br/>\nNow, finally, with the most recent Potter movie, she wanted to see it in the theater. So we talked about that - what could she do if she got scared. She already had some strategies worked out! She knew she could choose to look away, leave the room temporarily, even say &quot;mom, this is too much, lets go play in the arcade&quot;. She covered her eyes a few times, but enjoyed the film. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;or has things you dont<br/>\n&gt; understand.....<br/>\n<br/>\n </span></blockquote>I love it when my kids don&#39;t understand something. I love it when they want to know what&#39;s going on! Recently we watched Pom Poko, a Japanese animated film about racoons, which is rather &quot;earthier&quot; than similar such American movies. I had lots of explaining to do!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259438279","msgId":42242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlcnZjNytzdG9uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlZjM1N2VmMDkxMTI4MDgxMnBjZjY2MGQ4cTMxYjBlNDcxZThkNDk2Y2ZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42241,"nextInTopic":42243,"prevInTime":42241,"nextInTime":42243,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... Is that precicely what your child is doing? Its easy to paint a picture of a theoretical child obsessed. The biggest problem with this particular type of","messageBody":"<div id=\"ygrps-yiv-1537309591\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Hillary Heidelberg &lt;hillaryheidelberg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If I spent all my spare time playing<br/>\n&gt; video games, didn&#39;t eat healthfully, didn&#39;t go outside, didn&#39;t see friends,<br/>\n&gt; didn&#39;t pay my bills, didn&#39;t keep myself reasonably clean, and never answered<br/>\n&gt; the phone, I would consider myself obsessed.<br/>\n<br/>\n </span></blockquote>Is that precicely what your child is doing? Its easy to paint a picture of a theoretical child obsessed. The biggest problem with this particular type of discussion is that its not based in real life situations. Its easy to make things up. <br/>\n<br/>\nEven in real situations, its easy for parents to paint hours of playing and a reluctance to do other things as &quot;all day&quot; and &quot;nothing else&quot; as if that were solid fact and not hyperbole expressing parental frustration. This is exactly why its valuable to challenge the word &quot;obsession&quot; whenever its used in the context of children! My 8yo can spend days on end making things out of paper, can forget to eat, not be interested in playing outside or with friends, but its a state of cheerful engagement. She&#39;s not &quot;obsessed&quot; she&#39;s &quot;in the groove&quot;. In Montessori terminology its called &quot;normalization&quot;. <br/>\n<br/>\nMost of the time, as I mentioned in another post, when a child really does start looking obsessed, as in stressed about this activity that&#39;s taking hours and hours of time, its because mom and dad are saying &quot;stop&quot; frequently. Either directly or indirectly, refusing to help, making snide comments, or disparaging comments, or sighing in disappointment. Those are all ways parents impose limits on children&#39;s behavior without actually setting out rules. Kids who are limited may very well behave as if obsessed, because they are fighting against those limits and making the best possible use of every moment of - you said it yourself - free time. <br/>\n<br/>\nWhen we divide our kids lives into &quot;free time&quot; and other kinds of time, we set them up in a bad way. Adults Choose how much free time we will have. Its easy to overlook that if you&#39;re feeling stuck in a job or stuck at home with the kids. Getting over feeling stuck is an important aspect of unschooling! When we feel stuck, we don&#39;t relate as well to our kids, and are more likely to try to put bounds on them. Not with intentional cruelty, but because we forget where freedom comes from; from choices.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If my<br/>\n&gt; child were so involved in a behavior that he wouldn&#39;t stop to bathe, or eat,<br/>\n&gt; I would intervene. Kindly and gently, to be sure, but I would intervene.<br/>\n<br/>\n </span></blockquote>I would too - I&#39;d bring my kid food and washcloths. I&#39;d sit with him or her and chitchat during appropriate moments and connect. No one is suggesting leaving kids alone when they are heavily engaged in any activity! Because I&#39;d be making every effort to connect with my child I&#39;d notice if he or she was frustrated, joyful, stressed, focused, bored, or pained and I would Look To Address the Emotional Needs of my child. I wouldn&#39;t jump to the conclusion that the activity itself was the &quot;problem&quot; without a loooooot of careful observation and consideration of every other factor in my child&#39;s life. The activity could be a coping tool! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I do think that video games have an addictive quality (just one more level,<br/>\n&gt; mom!) much like porn, cigarettes and gambling.<br/>\n<br/>\n </span></blockquote>In most kids&#39; lives, video games are shamed and/or regulated in the same way as porn, drugs and gambling are in adult lives. In most kids&#39; lives, video games can also become the kind of coping tool that porn, drugs or gambling become in adult lives. There&#39;s a link there. Something about emotional neediness can lead people to do the very things labled &quot;bad for you&quot;. That doesn&#39;t say anything at all about video games as they are used in an unschooling home. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":209687569,"authorName":"Jacque Valdez","from":"Jacque Valdez &lt;jacque.valdez@...&gt;","profile":"rikisgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What is it with video games and \tunschooling?","postDate":"1259436138","msgId":42241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIyN2MwZTIwOTExMjgxMTIycDRkM2UwODc2cmM4MWY3OGE5YTRiNjE4NDVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPQUVHQ0RDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","referencesHeader":"PGZlZjM1N2VmMDkxMTI4MDgxMnBjZjY2MGQ4cTMxYjBlNDcxZThkNDk2Y2ZAbWFpbC5nbWFpbC5jb20+CSA8TkZFREtERkFHSU9DREJDTUdQSE9BRUdDRENBQS5vdGhlcnN0YXJAZWFydGhsaW5rLm5ldD4="},"prevInTopic":42239,"nextInTopic":42242,"prevInTime":42240,"nextInTime":42242,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"I just wanted to say a little thing here....I think unschooling definitely means something different to each family and we obviously do not do everything the","messageBody":"<div id=\"ygrps-yiv-1369000081\">I just wanted to say a little thing here....I think unschooling definitely<br/>\nmeans something different to each family and we obviously do not do<br/>\neverything the same and I for one work at it every day as do my children.  I<br/>\nhave found that over the last few months that people around me and my family<br/>\nhave seemed to change.  We do not have any other unschooling families that<br/>\nwe hang out with although we do hang out with other families but with 6 kids<br/>\nand 2 grandchildren there are plenty here lol, i have friends who do not<br/>\nagree with our unschooling in any way but boy do their kids love hanging out<br/>\nat our house and we are always their first choice for babysitters because<br/>\ntheir kids love to be here.... we have video games that my 8 year old and 13<br/>\nyear old rarely put down and you know what it does not bother me my 8 year<br/>\nold has learned so much from them and loves are you smarter than a fifth<br/>\ngrader but loves his shooting games and southpark too....its so about<br/>\nletting go and learning to trust them.  My inlaws literally shit their pants<br/>\nto hear me say to my 8 year old who asks to watch certain movies go ahead<br/>\nhoney i trust to you turn it off it gets too scary or has things you dont<br/>\nunderstand.....i feel so good about my kids and i love hanging out with them<br/>\nits so different from where we were even just homeschooling....just my<br/>\nopinion....take a breath and use what works for you dont be put off by<br/>\nothers or their decisions we are not working off printed out blueprints we<br/>\nare working off of our childrens desires.<br/>\nJacque<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Nov 28, 2009 at 11:06 AM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;&gt;&gt; I respectfully disagree with this. If I spent all my spare time<br/>\n&gt; playing<br/>\n&gt; video games, didn&#39;t eat healthfully, didn&#39;t go outside, didn&#39;t see friends,<br/>\n&gt; didn&#39;t pay my bills, didn&#39;t keep myself reasonably clean, and never<br/>\n&gt; answered<br/>\n&gt; the phone, I would consider myself obsessed. Perhaps not clinically<br/>\n&gt; obsessed<br/>\n&gt; (I am not a psychiatrist so couldn&#39;t make that diagnosis) but if I were<br/>\n&gt; engaging in one single activity to such a degree that it affected these<br/>\n&gt; other parts of my life so dramatically I would call myself &#39;obsessed&#39;.<br/>\n&gt; &lt;&lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; In my original statement, I said that an adult is spending all of their<br/>\n&gt; SPARE time. Spare means that they have fulfilled all of their other<br/>\n&gt; obligations and duties. What do you consider eating healthfully? What if it<br/>\n&gt; was too cold or too hot to go outside? What if your friends were<br/>\n&gt; uninteresting or unappealing? What do you consider reasonably clean? What<br/>\n&gt; if<br/>\n&gt; the only people that called were bill collectors or people that you didn&#39;t<br/>\n&gt; want to talk to? If you don&#39;t pay your bills, then you lose<br/>\n&gt; services/housing<br/>\n&gt; etc. There are some natural consequences built in. I am not trying to be<br/>\n&gt; obstinate. I am trying to ask questions that show how arbitrary some of<br/>\n&gt; these standards can be.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; When my husband works very late hours, on weekends, can&#39;t talk<br/>\n&gt; about<br/>\n&gt; anything but his work, his job, etc., I would think that he would benefit<br/>\n&gt; from a break--perhaps I&#39;d suggest taking him out to dinner, or to a movie,<br/>\n&gt; or try and steer the conversation to another topic. Why would I do this?<br/>\n&gt; Because I, as a loving caring partner, am perhaps seeing something in him<br/>\n&gt; that he does not see in himself. And perhaps he would eventually agree to<br/>\n&gt; that dinner, or that break, and he would say &quot;ah! wow, I was really getting<br/>\n&gt; wound up there, wasn&#39;t I!?&quot; and he would feel an opening, a bit of a break.<br/>\n&gt; Of course he might also say &quot;great meal, but I gotta get back to work&quot; and<br/>\n&gt; that&#39;s okay too. But I do think in our role as loving partners, or loving<br/>\n&gt; parents, we can sometimes see that our partner, or our child, is engaging<br/>\n&gt; in<br/>\n&gt; behaviors that are not healthy, and it is indeed our place to help. If my<br/>\n&gt; child were so involved in a behavior that he wouldn&#39;t stop to bathe, or<br/>\n&gt; eat,<br/>\n&gt; I would intervene. Kindly and gently, to be sure, but I would intervene.<br/>\n&gt; &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; Would you forbid your husband from working because of YOUR standards? Would<br/>\n&gt; you put limits on your husband without consulting him first? There is a big<br/>\n&gt; difference between trying to help and trying to control. I think everyone<br/>\n&gt; is<br/>\n&gt; advocating that we need to give kids the same kind of respect and<br/>\n&gt; consideration that we extend to other adults. Children are not usually<br/>\n&gt; given<br/>\n&gt; the same level of respect that adults are.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: What is it with video games and unschooling?","postDate":"1259431579","msgId":42239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPQUVHQ0RDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGZlZjM1N2VmMDkxMTI4MDgxMnBjZjY2MGQ4cTMxYjBlNDcxZThkNDk2Y2ZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42238,"nextInTopic":42241,"prevInTime":42238,"nextInTime":42240,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... playing video games, didn t eat healthfully, didn t go outside, didn t see friends, didn t pay my bills, didn t keep myself reasonably clean, and never","messageBody":"<div id=\"ygrps-yiv-1260807172\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; I respectfully disagree with this. If I spent all my spare time<br/>\n </span></blockquote>playing<br/>\nvideo games, didn&#39;t eat healthfully, didn&#39;t go outside, didn&#39;t see friends,<br/>\ndidn&#39;t pay my bills, didn&#39;t keep myself reasonably clean, and never answered<br/>\nthe phone, I would consider myself obsessed. Perhaps not clinically obsessed<br/>\n(I am not a psychiatrist so couldn&#39;t make that diagnosis) but if I were<br/>\nengaging in one single activity to such a degree that it affected these<br/>\nother parts of my life so dramatically I would call myself &#39;obsessed&#39;. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nIn my original statement, I said that an adult is spending all of their<br/>\nSPARE time. Spare means that they have fulfilled all of their other<br/>\nobligations and duties.  What do you consider eating healthfully? What if it<br/>\nwas too cold or too hot to go outside? What if your friends were<br/>\nuninteresting or unappealing? What do you consider reasonably clean? What if<br/>\nthe only people that called were bill collectors or people that you didn&#39;t<br/>\nwant to talk to? If you don&#39;t pay your bills, then you lose services/housing<br/>\netc. There are some natural consequences built in. I am not trying to be<br/>\nobstinate. I am trying to ask questions that show how arbitrary some of<br/>\nthese standards can be.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; When my husband works very late hours, on weekends, can&#39;t talk<br/>\n </span></blockquote>about<br/>\nanything but his work, his job, etc., I would think that he would benefit<br/>\nfrom a break--perhaps I&#39;d suggest taking him out to dinner, or to a movie,<br/>\nor try and steer the conversation to another topic. Why would I do this?<br/>\nBecause I, as a loving caring partner, am perhaps seeing something in him<br/>\nthat he does not see in himself. And perhaps he would eventually agree to<br/>\nthat dinner, or that break, and he would say &quot;ah! wow, I was really getting<br/>\nwound up there, wasn&#39;t I!?&quot; and he would feel an opening, a bit of a break.<br/>\nOf course he might also say &quot;great meal, but I gotta get back to work&quot; and<br/>\nthat&#39;s okay too. But I do think in our role as loving partners, or loving<br/>\nparents, we can sometimes see that our partner, or our child, is engaging in<br/>\nbehaviors that are not healthy, and it is indeed our place to help. If my<br/>\nchild were so involved in a behavior that he wouldn&#39;t stop to bathe, or eat,<br/>\nI would intervene. Kindly and gently, to be sure, but I would intervene.<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nWould you forbid your husband from working because of YOUR standards? Would<br/>\nyou put limits on your husband without consulting him first? There is a big<br/>\ndifference between trying to help and trying to control. I think everyone is<br/>\nadvocating that we need to give kids the same kind of respect and<br/>\nconsideration that we extend to other adults. Children are not usually given<br/>\nthe same level of respect that adults are.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259425369","msgId":42237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlcmlvcCtjdGMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlcGNwaSsycWZzQGVHcm91cHMuY29tPg=="},"prevInTopic":42234,"nextInTopic":42238,"prevInTime":42236,"nextInTime":42238,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... ***************** I just want to pull those two comments out and put them side by side - in a sense they re saying the same thing. Broken and hurting can","messageBody":"<div id=\"ygrps-yiv-587876385\">Joyce wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Why, though?...  obsessed adults have broken, hurting places inside that they&#39;re  trying to soothe.<br/>\n&gt; <br/>\n </span></blockquote>&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;it is an innate &quot;glitch&quot; in their cognitive processes that doesn&#39;t allow them to get out of the &quot;broken record&quot; mode in their heads,<br/>\n </span></blockquote>*****************<br/>\n<br/>\nI just want to pull those two comments out and put them side by side - in a sense they&#39;re saying the same thing. &quot;Broken and hurting&quot; can be a result of a &quot;glitch&quot; not merely environmental factors, although the two are generally tied together. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Whenever I see people say it&#39;s IMPOSSIBLE for children to become obsessed <br/>\n </span></blockquote>***************<br/>\n<br/>\nI think your concern is misplaced, frankly. No one has said that on this list, and I can&#39;t imagine anyone saying it without a seasoned responder questioning the statement. <br/>\n<br/>\nFrom a radical unschooling standpoint, the question always comes back to what a parent can do to help a child. *If* a child is pathologically obsessed, does having the focus of the obsession forcebly removed help the child (assuming such a thing is possible)? If you have some specific anecdotes as to how radical unschooling looks with a child who is pathologically obsessed, please feel free to share them! It may help other parents dealing with kids who have other serious issues think outside the box of conventional wisdom - which is that the more atypical the child, the more forcefully he or she needs to be constrained to mimic the attributes of typical people. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":296205049,"authorName":"Hillary Heidelberg","from":"Hillary Heidelberg &lt;hillaryheidelberg@...&gt;","profile":"nycscraps","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259424723","msgId":42238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlZjM1N2VmMDkxMTI4MDgxMnBjZjY2MGQ4cTMxYjBlNDcxZThkNDk2Y2ZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42237,"nextInTopic":42239,"prevInTime":42237,"nextInTime":42239,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"otherstar@earthlink.net  otherstar@earthlink.net ","messageBody":"<div id=\"ygrps-yiv-864301969\">&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a>&gt;&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a>?Subject=+Re%3A%20What%20is%20it%20with%20video%20games%20and%20unschooling%3F&gt;<br/>\ncasouthworth &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://profiles.yahoo.com/casouthworth\">http://profiles.yahoo.com/casouthworth</a>&gt;wrote<br/>\n<br/>\n&quot;If an adult spends all of their spare time playing games, it is<br/>\nconsidered blowing off steam&quot;<br/>\n<br/>\nI respectfully disagree with this. If I spent all my spare time playing<br/>\nvideo games, didn&#39;t eat healthfully, didn&#39;t go outside, didn&#39;t see friends,<br/>\ndidn&#39;t pay my bills, didn&#39;t keep myself reasonably clean, and never answered<br/>\nthe phone, I would consider myself obsessed. Perhaps not clinically obsessed<br/>\n(I am not a psychiatrist so couldn&#39;t make that diagnosis) but if I were<br/>\nengaging in one single activity to such a degree that it affected these<br/>\nother parts of my life so dramatically I would call myself &#39;obsessed&#39;.<br/>\n<br/>\nWhen my husband works very late hours, on weekends, can&#39;t talk about<br/>\nanything but his work, his job, etc., I would think that he would benefit<br/>\nfrom a break--perhaps I&#39;d suggest taking him out to dinner, or to a movie,<br/>\nor try and steer the conversation to another topic. Why would I do this?<br/>\nBecause I, as a loving caring partner, am perhaps seeing something in him<br/>\nthat he does not see in himself. And perhaps he would eventually agree to<br/>\nthat dinner, or that break, and he would say &quot;ah! wow, I was really getting<br/>\nwound up there, wasn&#39;t I!?&quot; and he would feel an opening, a bit of a break.<br/>\nOf course he might also say &quot;great meal, but I gotta get back to work&quot; and<br/>\nthat&#39;s okay too. But I do think in our role as loving partners, or loving<br/>\nparents, we can sometimes see that our partner, or our child, is engaging in<br/>\nbehaviors that are not healthy, and it is indeed our place to help. If my<br/>\nchild were so involved in a behavior that he wouldn&#39;t stop to bathe, or eat,<br/>\nI would intervene. Kindly and gently, to be sure, but I would intervene.<br/>\n<br/>\nI do think that video games have an addictive quality (just one more level,<br/>\nmom!) much like porn, cigarettes and gambling.  There is a recent study<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/04/19/AR2009041902350.html\">http://www.washingtonpost.com/wp-dyn/content/article/2009/04/19/AR2009041902350.html</a>&gt;that<br/>\nconfirms this.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: What is it with video games and unschooling?","postDate":"1259372703","msgId":42234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPRUVGTkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhlcGNwaSsycWZzQGVHcm91cHMuY29tPg=="},"prevInTopic":42233,"nextInTopic":42237,"prevInTime":42233,"nextInTime":42235,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... some people become obsessive and they experience anxiety stemming from that. That s why SSRIs help with individuals with OCD or autism-related anxiety - it","messageBody":"<div id=\"ygrps-yiv-709779819\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt; This isn&#39;t *always* true. There are biological/inborn reasons why<br/>\n </span></blockquote>some people become obsessive and they experience anxiety stemming from that.<br/>\nThat&#39;s why SSRIs help with individuals with OCD or autism-related anxiety -<br/>\nit is an innate &quot;glitch&quot; in their cognitive processes that doesn&#39;t allow<br/>\nthem to get out of the &quot;broken record&quot; mode in their heads, even if they<br/>\ndesperately want to. It&#39;s related to the inherent cognitive dysfunction of<br/>\nextreme clinical depression as well. You can&#39;t unschool that out of someone<br/>\nand it isn&#39;t cultural baggage. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nMy concern is always with the fact that people want to say that there is a<br/>\nglitch and that things are innate or inborn. It is very true that some<br/>\npeople have innate or inborn glitches. The problem is when the biological<br/>\nreasons are put out there FIRST. If a child doesn&#39;t conform, it seems as<br/>\nthough people first assume that there is a glitch. My family is full of<br/>\npeople with psychological disorders. When they are in certain environments<br/>\nand around certain people, those disorders become worse and they are unable<br/>\nto deal with them and must resort to medication. When removed from those<br/>\ntriggering environments, my family members are able to function much better.<br/>\nYou may not be able to unschool those conditions out of people but you can<br/>\nuse unschooling as a means to support them. Glitch implies something<br/>\nnegative. Is the glitch there because there is something wrong or is the<br/>\nglitch there because society sees it as a glitch rather than just accepting<br/>\npeople as being different or quirky.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; What is &quot;healthy&quot; in this context? Who determines that?<br/>\n </span></blockquote>&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nGood question! If the person is &quot;obsessing&quot; over homework or something that<br/>\nthe rest of society sees as good, then pretty much everyone will call it a<br/>\nhealthy obsession. The average person does not see video games as something<br/>\ngood or noble, which is why I think so many people like to call it an<br/>\nobsession and view it negatively.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt; Hmm, this presumes that the parent has a great breadth of<br/>\n </span></blockquote>experience with child development where they can recognize subtle clues that<br/>\na child&#39;s development may be lagging or lacking, and it just isn&#39;t the case<br/>\nthat all parents have enough information or experience to intuit that<br/>\nsomething is &quot;off&quot; before it gets to an extreme. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI really have a problem with this statement. What do you mean by lagging or<br/>\nlacking? Even the experts disagree about what is considered normal at<br/>\ncertain ages. If a child isn&#39;t on the growth chart, some doctors want to<br/>\nstart running tests and pathologizing the lack of growth/weight gain. Other<br/>\ndoctors simply claim that the lacking or lagging is normal and the child<br/>\njust needs time to catch up. So, if the experts can&#39;t agree, how can a<br/>\nparent ever know what is considered &quot;off&quot;. I think a child being &quot;off&quot; is<br/>\nvery subjective. According to some people, my eccentricities are considered<br/>\n&quot;off&quot; whereas other people find those same qualities as endearing.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; Also, there are specific mental illnesses, such as OCD and<br/>\n </span></blockquote>schizophrenia, which feature sudden obsessive behavior as a main tell-tale<br/>\nsymptom, that have sudden onset in children and adolescents. So that there<br/>\nreally may have been no clues at all. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nMaybe there aren&#39;t any clues but I don&#39;t think it is healthy or productive<br/>\nto go around watching kids for signs and symptoms of mental illness. Bipolar<br/>\nis very common in my family. I have read quite a few books on it and I have<br/>\nseen a lot of the signs in some of my kids. Does that mean that I should<br/>\nlabel prolonged computer use as obsessive. It is a really slippery sloap and<br/>\nyou have to be careful not to over-pathologize normal childhood.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; I just think these broad, sweeping generalities when it comes to<br/>\n </span></blockquote>things like this need to be applied very, very carefully. Whenever I see<br/>\npeople say it&#39;s IMPOSSIBLE for children to become obsessed or develop<br/>\nunhealthy fixations, and if they are, then it&#39;s probably due to horrible<br/>\nparenting, I cringe and fervently hope that the person writing isn&#39;t a sad,<br/>\nfrustrated parent with an OCD or autistic or bipolar child. (This has never<br/>\nhappened to me, btw, but I know people to whom it has happened.) It may be<br/>\n100% true and accurate on a case-by-case basis, but it&#39;s just bad advice to<br/>\na general population dealing at least indirectly with child development.<br/>\n&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nHaving grown up in a house with bipolar siblings, I can easily see where<br/>\nunschooling could have helped tremendously. It wouldn&#39;t have erased the<br/>\nunderlying pathology but it would have made their lives much better because<br/>\nour parents would have loved them for who they were and helped them work<br/>\nthrough the problems rather than demonizing them or trying to control them<br/>\nthrough coercive methods. I think certain educational/parenting approaches<br/>\naggravate children that underlying problems that are pathological.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: What is it with video games and unschooling?","postDate":"1259370951","msgId":42233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPR0VGTURDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhlb3E3NSsyMTB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42232,"nextInTopic":42234,"prevInTime":42232,"nextInTime":42234,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... pathologically obsessed with things. To their personal ruination, sometimes. They can get obsessed with other people (stalking), obsessed with specific ","messageBody":"<div id=\"ygrps-yiv-1153292540\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; The thing that no one ever says is: adults can and do get<br/>\n </span></blockquote>pathologically obsessed with things. To their personal ruination, sometimes.<br/>\nThey can get obsessed with other people (stalking), obsessed with specific<br/>\nactivities, ideas, fears, objects, addicted to drugs and alcohol or porn/sex<br/>\nor the high they get from dangerous/self-destructive activities, ad nauseum.<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nYes, adults do get pathologically obsessed with things. The biggest<br/>\ndifference is that people don&#39;t go around trying to label an adult as<br/>\nobsessed. Adults are usually given the benefit of the doubt. As long as what<br/>\nan adult is doing is not illegal or immoral, most people will look the other<br/>\nway. Adults are given way more opportunities to be obsessed that the average<br/>\nchild is. If an adult spends all of their spare time playing games, it is<br/>\nconsidered blowing off steam. When a kid does it, we look for some kind of<br/>\npathology. It seems to me that everyone tends to look for what is wrong with<br/>\nkids rather than what is right with kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; I very much get the idea of not couching descriptions of children&#39;s<br/>\n </span></blockquote>passions in terms of obsessions, but I don&#39;t get the idea that children<br/>\ncannot become obsessed. I personally don&#39;t think that&#39;s true. Otherwise<br/>\nthere is no such thing as obsession at all, which is definitely not true.<br/>\n&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI don&#39;t think anybody is saying the children cannot get obsessed. Being<br/>\nobsessed is a word that should be used carefully because obsession implies<br/>\npathology whereas passion implies a deep interest. We should not look for<br/>\nways to pathologize children.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; HOWEVER, due to his autism, he also obsesses about many things both<br/>\n </span></blockquote>major and minor, to the point where it causes him huge amounts of anxiety<br/>\nand rage and inner hurt, and renders him totally dysfunctional sometimes.<br/>\nLiterally unable to do anything else besides pace and obsess.  &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nThat description is very much different than a child that gets mad when<br/>\nhe/she can&#39;t do certain things. It renders them pissed off, not<br/>\ndysfunctional. I would hope that the difference could be easily seen.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I think sometimes unschooling discussions forget that not all<br/>\n </span></blockquote>people are neurotypical, and that despite our best efforts, pathology does<br/>\nexist. It&#39;s not helpful to immediately jump to the conclusion that a child&#39;s<br/>\nstrong interests are obsessive because, it&#39;s true, that is just a way to<br/>\nseek an excuse to control the child. But I think children CAN get obsessed,<br/>\nand not in a good, joyous way.  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI have to wonder how somebody would describe a child that wanted to do<br/>\nhomework all the time. If a child were to &quot;obsess&quot; over traditional school<br/>\nwork, I don&#39;t think anybody would ever try to pathologize that. Instead,<br/>\nthey would be patting the parents on the back and raving about how great the<br/>\nkid is. Would anybody ever say that an obsession with academics is not good<br/>\nor joyous?<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What is it with video games and \tunschooling?","postDate":"1259366225","msgId":42231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDkxMTI3MTU1N3MyYjMxMjE1Y2c4OTMwYmVjYmM0ZDY1OWZjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhlcG80ZitwcGFwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlcDVzYytncmhhQGVHcm91cHMuY29tPiA8aGVwbzRmK3BwYXBAZUdyb3Vwcy5jb20+"},"prevInTopic":42230,"nextInTopic":42232,"prevInTime":42230,"nextInTime":42232,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"FWIW...I m parenting a child who is absolutely NOT neurotypical and I certainly wouldn t take anything away from her that she seemed to need.  I would be","messageBody":"<div id=\"ygrps-yiv-1320330229\">FWIW...I&#39;m parenting a child who is absolutely NOT neurotypical and I<br/>\ncertainly wouldn&#39;t take anything away from her that she seemed to need.  I<br/>\nwould be *more* inclined to do so from a typical child (were I inclined to<br/>\ndo so) than an atypical child because a neurotypical child would be able to<br/>\ndo other things or move on, or &quot;deal with it&quot; or whatever much more so than<br/>\nmy atypical child.  When Morgan needs to stim or is fixated on something the<br/>\nlast time it was CDs, I bought her 500 and gave them to her!  She&#39;s 5.  She<br/>\ncan&#39;t even carry that many.  But having that many &quot;broke&quot; the fixation on<br/>\nthem.  Now she&#39;s on to something else.  Which is fine.  Whatever she needs<br/>\nto be able to feel centered and peaceful.  Who am I to tell her what she<br/>\nneeds to repair her damage?  Or what her atypically wired brain wants?<br/>\n<br/>\n<br/>\nKaren<br/>\n&quot;I argue that the Talmud is about the constant struggle to understand.&quot;<br/>\n~Arthur Hertzberg<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Nov 27, 2009 at 5:42 PM, gruvystarchild &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~&gt; I think sometimes unschooling discussions forget that not all people<br/>\n&gt; are neurotypical, and that despite our best efforts, pathology does exist.~~<br/>\n&gt;<br/>\n&gt; I don&#39;t think most of us ever forget that. Many of us are raising<br/>\n&gt; &quot;neurotypical&quot; children ourselves.<br/>\n&gt;<br/>\n&gt; The caution is sensible, given that I&#39;ve yet to read a post from someone<br/>\n&gt; claiming &quot;obsession&quot; who wasn&#39;t simply an uptight parent needing some<br/>\n&gt; soothing about what interest and passion look like.<br/>\n&gt;<br/>\n&gt; Even if your child is &quot;neurotypical&quot;, the solution is not limiting or<br/>\n&gt; removing the thing they love. There are ways to support a person and respect<br/>\n&gt; their passion with videogames (or whatever they&#39;re focused on). There seems<br/>\n&gt; to be a link between many atypical children and intense video gaming<br/>\n&gt; fascination though...and it seems to be a very healthy, helpful<br/>\n&gt; decompression tool for many.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; radicalunschooling.blogspot.com<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What is it with video games and unschooling?","postDate":"1259366207","msgId":42232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxMjREQ0YzNEVGMTQ5Q0ZCMENDRkEyRjM0OUJCQTREQExZTEFMQVAyPg==","inReplyToHeader":"PGhlcG80ZitwcGFwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlcG80ZitwcGFwQGVHcm91cHMuY29tPg=="},"prevInTopic":42231,"nextInTopic":42233,"prevInTime":42231,"nextInTime":42233,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... From: gruvystarchild To: unschoolingbasics@yahoogroups.com Sent: Friday, November 27, 2009 3:42 PM Subject: [unschoolingbasics] Re: What is it with video","messageBody":"<div id=\"ygrps-yiv-1053877128\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\n  From: gruvystarchild <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, November 27, 2009 3:42 PM<br/>\n  Subject: [unschoolingbasics] Re: What is it with video games and unschooling?<br/>\n<br/>\n<br/>\n    <br/>\n  ~~&gt; I think sometimes unschooling discussions forget that not all people are neurotypical, and that despite our best efforts, pathology does exist.~~<br/>\n<br/>\n  I don&#39;t think most of us ever forget that. Many of us are raising &quot;neurotypical&quot; children ourselves. <br/>\n<br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  ren, don&#39;t you mean some of us are raising neuralAtypical children ourselves? at least i think that&#39;s what you mean...<br/>\n<br/>\n  lyla<br/>\n<br/>\n  MARKETPLACE<br/>\n  Going Green: Your Yahoo! Groups resource for green living<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n  Parenting Zone: Find useful resources for a happy, healthy family and home<br/>\n   Switch to: Text-Only, Daily Digest . Unsubscribe . Terms of Use.<br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259365915","msgId":42230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlcG9tcitkYnM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlcG80ZitwcGFwQGVHcm91cHMuY29tPg=="},"prevInTopic":42229,"nextInTopic":42231,"prevInTime":42229,"nextInTime":42231,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... That should have said atypical but I am going on two hours of sleep at the moment. Oops!:) Ren radicalunschooling.blogspot.com","messageBody":"<div id=\"ygrps-yiv-180909616\"><blockquote><span title=\"ireply\">&gt; I don&#39;t think most of us ever forget that. Many of us are raising &quot;neurotypical&quot; children ourselves. <br/>\n<br/>\n<br/>\n </span></blockquote>That should have said &quot;atypical&quot; but I am going on two hours of sleep at the moment. Oops!:)<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259365327","msgId":42229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlcG80ZitwcGFwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlcDVzYytncmhhQGVHcm91cHMuY29tPg=="},"prevInTopic":42228,"nextInTopic":42230,"prevInTime":42228,"nextInTime":42230,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"~~ I think sometimes unschooling discussions forget that not all people are neurotypical, and that despite our best efforts, pathology does exist.~~ I don t","messageBody":"<div id=\"ygrps-yiv-1154546443\">~~&gt; I think sometimes unschooling discussions forget that not all people are neurotypical, and that despite our best efforts, pathology does exist.~~<br/>\n<br/>\nI don&#39;t think most of us ever forget that. Many of us are raising &quot;neurotypical&quot; children ourselves. <br/>\n<br/>\nThe caution is sensible, given that I&#39;ve yet to read a post from someone claiming &quot;obsession&quot; who wasn&#39;t simply an uptight parent needing some soothing about what interest and passion look like. <br/>\n<br/>\nEven if your child is &quot;neurotypical&quot;, the solution is not limiting or removing the thing they love. There are ways to support a person and respect their passion with videogames (or whatever they&#39;re focused on). There seems to be a link between many atypical children and intense video gaming fascination though...and it seems to be a very healthy, helpful decompression tool for many.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":414609447,"authorName":"flhomeschooling","from":"&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt;","profile":"flhomeschooling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259353714","msgId":42228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlcGNwaSsycWZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZCQjMyNkE1LTIwOEMtNEI0Ri1BNDdFLUY2OUIzRkM4Qzg4MkB2ZXJpem9uLm5ldD4="},"prevInTopic":42227,"nextInTopic":42229,"prevInTime":42227,"nextInTime":42229,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... This isn t *always* true. There are biological/inborn reasons why some people become obsessive and they experience anxiety stemming from that. That s why","messageBody":"<div id=\"ygrps-yiv-114871717\"><blockquote><span title=\"ireply\">&gt; &gt; adults can and do get pathologically obsessed with things<br/>\n&gt; <br/>\n&gt; Why, though?...  obsessed adults have broken, hurting places inside that they&#39;re  trying to soothe.<br/>\n<br/>\n </span></blockquote>This isn&#39;t *always* true. There are biological/inborn reasons why some people become obsessive and they experience anxiety stemming from that. That&#39;s why SSRIs help with individuals with OCD or autism-related anxiety - it is an innate &quot;glitch&quot; in their cognitive processes that doesn&#39;t allow them to get out of the &quot;broken record&quot; mode in their heads, even if they desperately want to. It&#39;s related to the inherent cognitive dysfunction of extreme clinical depression as well. You can&#39;t unschool that out of someone and it isn&#39;t cultural baggage.<br/>\n<br/>\nJust to be clear: this is a tangent about obsession in general, from the original discussion about video games. ***I agree that most kids&#39; interests in video games, even very strong, fixated interests, aren&#39;t obsessions.*** <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Passionate people are working towards healthy goals, and beating a  <br/>\n&gt; game is a healthy goal!<br/>\n<br/>\n </span></blockquote>What is &quot;healthy&quot; in this context? Who determines that? <br/>\n<br/>\nSome people, even people who place a very high priority on peaceful parenting, might call being so fixated on a game that you develop a hypoglycemic episode (&quot;grouchiness&quot; due to low blood sugar) &quot;unhealthy&quot; and become concerned. I am not one of those people, but I can understand that. <br/>\n<br/>\nMy son isn&#39;t obsessed with video games, btw. We both enjoy video games very much. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Weren&#39;t there quite a few clues from the time he  <br/>\n&gt; was young that there was something atypical about him?<br/>\n<br/>\n </span></blockquote>Hmm, this presumes that the parent has a great breadth of experience with child development where they can recognize subtle clues that a child&#39;s development may be lagging or lacking, and it just isn&#39;t the case that all parents have enough information or experience to intuit that something is &quot;off&quot; before it gets to an extreme.<br/>\n<br/>\nAlso, there are specific mental illnesses, such as OCD and schizophrenia, which feature sudden obsessive behavior as a main tell-tale symptom, that have sudden onset in children and adolescents. So that there really may have been no clues at all.<br/>\n<br/>\nI just think these broad, sweeping generalities when it comes to things like this need to be applied very, very carefully. Whenever I see people say it&#39;s IMPOSSIBLE for children to become obsessed or develop unhealthy fixations, and if they are, then it&#39;s probably due to horrible parenting, I cringe and fervently hope that the person writing isn&#39;t a sad, frustrated parent with an OCD or autistic or bipolar child. (This has never happened to me, btw, but I know people to whom it has happened.) It may be 100% true and accurate on a case-by-case basis, but it&#39;s just bad advice to a general population dealing at least indirectly with child development.<br/>\n<br/>\nAndrea in Miami</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What is it with video games and unschooling?","postDate":"1259347634","msgId":42225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCQjMyNkE1LTIwOEMtNEI0Ri1BNDdFLUY2OUIzRkM4Qzg4MkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhlb3E3NSsyMTB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhlb3E3NSsyMTB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42223,"nextInTopic":42227,"prevInTime":42224,"nextInTime":42226,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... Why, though? Passions and obsessions can look the same on the surface but that s as deep as the connection goes. Obsessed adults have broken, hurting","messageBody":"<div id=\"ygrps-yiv-1230044232\">On Nov 27, 2009, at 10:11 AM, flhomeschooling wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; adults can and do get pathologically obsessed with things<br/>\n<br/>\n </span></blockquote>Why, though?<br/>\n<br/>\nPassions and obsessions can look the same on the surface but that&#39;s  <br/>\nas deep as the connection goes.<br/>\n<br/>\nObsessed adults have broken, hurting places inside that they&#39;re  <br/>\ntrying to soothe. The action may soothe it but it doesn&#39;t fix the  <br/>\nbroken parts so the behavior continues and often gets worse.<br/>\n<br/>\nPassionate people are working towards healthy goals, and beating a  <br/>\ngame is a healthy goal!<br/>\n<br/>\nIf a child is stressed and self soothing, the focus should be on  <br/>\nsoothing and relieving what&#39;s stressing them, not taking away what  <br/>\nthey&#39;ve found soothing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; HOWEVER, due to his autism, he also obsesses about many things<br/>\n<br/>\n </span></blockquote>I assume you&#39;ve been aware of this for sometime, though, right? You  <br/>\nweren&#39;t thinking he was typical until he started playing video games  <br/>\nwith a passion at 8? Weren&#39;t there quite a few clues from the time he  <br/>\nwas young that there was something atypical about him?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; think sometimes unschooling discussions forget that not all people  <br/>\n&gt; are neurotypical,<br/>\n<br/>\n </span></blockquote>And I think parents of kids who aren&#39;t neurotypical can recognize  <br/>\nbehavior in the typical descriptions of other kids and they worry  <br/>\nthat what could be something more serious is being dismissed as  <br/>\nperfectly normal.<br/>\n<br/>\nIf there&#39;s something more, people will say so. Not because they  <br/>\nshould but because they can&#39;t help it! It&#39;s human nature to want to  <br/>\nrelease the worries. People say *way* more than they think they&#39;re  <br/>\nsaying by what they choose to tell and the words they use to tell it  <br/>\nwith.<br/>\n<br/>\nIf someone does have a child with autism and is struggling with the  <br/>\nchild&#39;s obsessions, I can guarantee someone or several someones here  <br/>\ndo have advice that&#39;s beyond &quot;Don&#39;t worry&quot; and to help them move  <br/>\nbeyond conventional parenting tactics.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259346636","msgId":42227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlcDVzYytncmhhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlb3E3NSsyMTB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42225,"nextInTopic":42228,"prevInTime":42226,"nextInTime":42228,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... ********************** Thank you for posting that description. Its good to have an image of what obession actually looks like for parents who may be","messageBody":"<div id=\"ygrps-yiv-977323607\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;HOWEVER, due to his autism, he also obsesses about many things both major and minor, to the point where it causes him huge amounts of anxiety and rage and inner hurt, and renders him totally dysfunctional sometimes. Literally unable to do anything else besides pace and obsess.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nThank you for posting that description. Its good to have an image of what obession actually looks like for parents who may be looking at a child happily playing for hours and hours at the same game and wondering &quot;is this obsession?&quot; <br/>\n<br/>\nIts also good to keep in mind that a child who has been pushed into a corner, as it were, trying to carve out every moment of allowed free time to persue a passion can look a bit obsessed. Kids with a lot of limits on their &quot;free time&quot; can look obsessed *because* of the limits. In a sense, limits create a kind of pathology in that way. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t get the idea that children cannot become obsessed.<br/>\n<br/>\n </span></blockquote>No-ones saying that. But the vaaaaaaaast majority of parents saying &quot;my kid is obsessed&quot; have no real idea of what obsession looks like. At best (worst?) they know the kind of &quot;obsession&quot; that limits produce, the kind that heals with radical unschooling. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I think sometimes unschooling discussions forget that not all people are neurotypical, and that despite our best efforts, pathology does exist.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nI don&#39;t find that seasoned responders on the discussion lists forget that. Parents whose kids have serious issues (and are asking a question that relates to that fact) come right out and say so, for one thing! Its far, far more often the case that parents new to unschooling post using hyperbole and statements dismissive of children - including parents whose children are atyipcal, or considered atypical by those parents. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":414609447,"authorName":"flhomeschooling","from":"&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt;","profile":"flhomeschooling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259334693","msgId":42223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlb3E3NSsyMTB2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlbW81ZysyMjBkQGVHcm91cHMuY29tPg=="},"prevInTopic":42219,"nextInTopic":42225,"prevInTime":42222,"nextInTime":42224,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"I d like to offer a different perspective. It s often said on this list and in unschooling circles, When an adult is really into something, it s called a","messageBody":"<div id=\"ygrps-yiv-1395106504\">I&#39;d like to offer a different perspective.<br/>\n<br/>\nIt&#39;s often said on this list and in unschooling circles, &quot;When an adult is really into something, it&#39;s called a passion, so why are kids&#39; passions called obsessions?&quot;<br/>\n<br/>\nThe thing that no one ever says is: adults can and do get pathologically obsessed with things. To their personal ruination, sometimes. They can get obsessed with other people (stalking), obsessed with specific activities, ideas, fears, objects, addicted to drugs and alcohol or porn/sex or the high they get from dangerous/self-destructive activities, ad nauseum. <br/>\n<br/>\nI very much get the idea of not couching descriptions of children&#39;s passions in terms of obsessions, but I don&#39;t get the idea that children cannot become obsessed. I personally don&#39;t think that&#39;s true. Otherwise there is no such thing as obsession at all, which is definitely not true.<br/>\n<br/>\nMy 11yo son is autistic and he has passions. They aren&#39;t my interest at all, but I respect them and he shows me all about them and he gets a great deal of joy from them. I can see how my family showing zero interest or support for own passions as a child caused me lifelong struggles and sadness, and I can see how much my son learns from his loves and passions and how happy it makes him when I show enthusiasm and interest in them. HOWEVER, due to his autism, he also obsesses about many things both major and minor, to the point where it causes him huge amounts of anxiety and rage and inner hurt, and renders him totally dysfunctional sometimes. Literally unable to do anything else besides pace and obsess. <br/>\n<br/>\nI think sometimes unschooling discussions forget that not all people are neurotypical, and that despite our best efforts, pathology does exist. It&#39;s not helpful to immediately jump to the conclusion that a child&#39;s strong interests are obsessive because, it&#39;s true, that is just a way to seek an excuse to control the child. But I think children CAN get obsessed, and not in a good, joyous way. <br/>\n<br/>\nAndrea in Miami</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] ReWAS : What is it with video games and unschooling? Now: speaking of Rue","postDate":"1259302040","msgId":42219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNzIuNjc5ODYucW1Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PGhlbmRjZStjbW1pQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlbmRjZStjbW1pQGVHcm91cHMuY29tPg=="},"prevInTopic":42218,"nextInTopic":42223,"prevInTime":42218,"nextInTime":42220,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"No she has not. the new books on unschooling  since Rue s came out are:  Sandra Dodd s Big Book of Unschooling , Unschooling Unmanual by Jan Hund, Rue","messageBody":"<div id=\"ygrps-yiv-92407328\">No she has not. the new books on unschooling  since Rue&#39;s came out are:<br/>\n Sandra Dodd&#39;s Big Book of Unschooling ,<br/>\nUnschooling Unmanual by Jan Hund, Rue Kream and others<br/>\nDana Martin&#39;s Radical Unschooling a Revolution has Began<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":328087230,"authorName":"ckent9511","from":"&quot;ckent9511&quot; &lt;ckent001@...&gt;","profile":"ckent9511","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"ReWAS : What is it with video games and unschooling? Now: speaking of Rue","postDate":"1259288782","msgId":42218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlbmRjZStjbW1pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlbDdxbis5MGtrQGVHcm91cHMuY29tPg=="},"prevInTopic":42215,"nextInTopic":42219,"prevInTime":42217,"nextInTime":42219,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"Has Rue written any new books?","messageBody":"<div id=\"ygrps-yiv-983951782\">Has Rue written any new books?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;gruvystarchild&quot; &lt;starsuncloud@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ~~ Meredith - you are just incredible.~~<br/>\n&gt; <br/>\n&gt; ~~The thought and time and kindness and insights that you put into your responses is breathtaking. ~~<br/>\n&gt; <br/>\n&gt; I agree!! I thought that worth repeating as Meredith is a much appreciated moderator here...especially now with both owners absentee a lot of the time. Everything you do is appreciated beyond words Meredith!<br/>\n&gt; <br/>\n&gt; Our other two Mods don&#39;t get much thanks either....we love you Rue and Deb (they&#39;re the quieter ones usually, but are just as brilliant!)<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; radicalunschooling.blogspot.com<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259267056","msgId":42215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlbW81ZysyMjBkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNDcwMWNhNmViNCQ2NmRlNjUyMCQ4MzAwYThjMEByZWR3aW5lPg=="},"prevInTopic":42212,"nextInTopic":42218,"prevInTime":42214,"nextInTime":42216,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... ********************* That s true in theory, but I know with Mo, if its a new game or a favorite, then she may not think to stop even at a save point (and","messageBody":"<div id=\"ygrps-yiv-1379114281\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Professional Parenting&quot; &lt;jarnall@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; In every video/computer game there are saving places and the kids know where they are.  Taking a break to eat, is not a big deal. They will find them if not forced to break when the parents say &quot;now&quot;!<br/>\n </span></blockquote>*********************<br/>\n<br/>\nThat&#39;s true in theory, but I know with Mo, if its a new game or a favorite, then she may not think to stop even at a save point (and this is a kid who does take breaks in general). Actually she&#39;s more likely to stop at a &quot;loading&quot; screen than a save point, since save points are often in areas of high action! So if she&#39;s really focused I&#39;ll wait for a loading screen to ask if she wants something, even remind her to take a quick bite while she has the chance. <br/>\n<br/>\nKids also like to know that parents are willing to do things For them, even things they can do for themselves, and that includes getting a snack. Adults don&#39;t hesitate to say to each other &quot;hey, while you&#39;re up, could you get me...?&quot; It feels good to be taken care of a little - and kids often need that kind of reassurance that they&#39;re an important part of parents lives. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":96745299,"authorName":"Professional Parenting","from":"&quot;Professional Parenting&quot; &lt;jarnall@...&gt;","profile":"oooffca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What is it with video games and unschooling?","postDate":"1259252442","msgId":42212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDcwMWNhNmViNCQ2NmRlNjUyMCQ4MzAwYThjMEByZWR3aW5lPg==","referencesHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPRUVFSkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+"},"prevInTopic":42211,"nextInTopic":42215,"prevInTime":42211,"nextInTime":42213,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"In every video/computer game there are saving places and the kids know where they are.  Taking a break to eat, is not a big deal. They will find them if not","messageBody":"<div id=\"ygrps-yiv-968809158\">In every video/computer game there are saving places and the kids know where they are.  Taking a break to eat, is not a big deal. They will find them if not forced to break when the parents say &quot;now&quot;!<br/>\n<br/>\n-------------------------------------------------------------------------------------------------<br/>\nJudy Arnall<br/>\nParenting Speaker, Trainer and Author of Canadian bestseller:  Discipline Without Distress: 135 <br/>\ntools for raising caring, Responsible children without time-out, spanking, punishment or bribery <br/>\nCell: (403) 714-6766              Email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jarnall@...\">jarnall@...</a>  <br/>\nInternet:  www.professionalparenting.ca <br/>\nSpeaker bio: <a rel=\"nofollow\" target=\"_blank\" href=\"http://bureau.espeakers.com/caps/speaker.php?sid=10763&showreturntoresults=true\">http://bureau.espeakers.com/caps/speaker.php?sid=10763&showreturntoresults=true</a><br/>\nLinked-in:  www.linkedin.com/in/judyarnall   <br/>\nTwitter:  www.twitter.com/JudyArnall<br/>\nAmazon blog:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/gp/blog/A1R7S822XSIVBA/ref=cm_blog_dp_artist_blog\">http://www.amazon.com/gp/blog/A1R7S822XSIVBA/ref=cm_blog_dp_artist_blog</a><br/>\nYoutube channel: www.youtube.com/parentproblemsolver  <br/>\nFacebook: <a rel=\"nofollow\" target=\"_blank\" href=\"http://profile.to/judyarnall\">http://profile.to/judyarnall</a> <br/>\n-------------------------------------------------------------------------------------------------<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, November 25, 2009 3:45 PM<br/>\n  Subject: RE: [unschoolingbasics] What is it with video games and unschooling?<br/>\n<br/>\n<br/>\n    <br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; I have been lurking on this list for a while, enjoying learning<br/>\n  from<br/>\n  all of you. But one thing that seems to continually pop up is the avid<br/>\n  interest, obsession it could be called, that some unschooling kids<br/>\n  have with video games. And it seems that parents are somehow required<br/>\n  to cater to this interest by providing food to the game-playing child,<br/>\n  even holding a straw up to said child&#39;s mouth so he or she doesn&#39;t<br/>\n  need to take her eyes off the game. There is talk about how to avoid<br/>\n  crumbs where the child is playing and eating, and (what sound like)<br/>\n  scoldings for a mom who doesn&#39;t want to cater to the myriad food needs<br/>\n  and demands of her family. It was even suggested that said mommight<br/>\n  not be cut out for unschooling. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  I don&#39;t think anybody has been scolded. Somebody asked a question and we are<br/>\n  all providing our own answers based on our own perspectives and our own<br/>\n  experiences. The way you phrase it makes it sound so negative. :-) I like to<br/>\n  think of it as helping them to learn. I don&#39;t think anybody is required to<br/>\n  cater to anybody else. There is a big difference to catering to somebody and<br/>\n  doing things because you love them. When I am busy with something, my<br/>\n  husband will bring me food or drink. Likewise, if he or the kids are wrapped<br/>\n  up in something, I will take them food or drink. We have modeled this<br/>\n  dynamic between us so much that our kids will bring us stuff if we are busy<br/>\n  and need food or drink. We end up with a lot of crumbs but that is why we<br/>\n  have a vacuum. :-)<br/>\n<br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; It all just boggles. My mind a bit. Unschooling to me isn&#39;t<br/>\n  JUST about<br/>\n  the child, is it? Isn&#39;t it about creating a nurturing and loving<br/>\n  FAMILY dynamic? Shouldn&#39;t all family members be happy? Why doesn&#39;t the<br/>\n  child who loves video games so much that he can&#39;t (god forbid) stop<br/>\n  for a few minutes and enjoy the meal that his mother prepared for him<br/>\n  smply make his own meal, portable and neat? Why doesn&#39;t he simply<br/>\n  clean up any mess he makes? Is the mother there simply to cater to<br/>\n  every whim of her child? My understanding of unschooling is that its<br/>\n  about allowing children to make choices, but also to let the child<br/>\n  know when those choices impinge upon other&#39;s needs and rights. Why is<br/>\n  the child&#39;s wish to eat crumbly food whilst playing video games. More<br/>\n  important than the mother&#39;s wish to simplify her family eating habits?<br/>\n  Isn&#39;t unschooling fundamentally built on respect, not just for the<br/>\n  child, but for the parent? &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  Kids are not born knowing how to simply clean up their own messes. They<br/>\n  learn it gradually over time by seeing other people do it. Where does normal<br/>\n  caretaking end and catering begin? Would you call changing a babies diaper<br/>\n  catering to the child? If a 2 year old is hungry, are you going to feed them<br/>\n  or make them get stuff themselves because feeding them would be considered<br/>\n  catering to them? The way you phrase it makes it sound as if the mother is<br/>\n  the one that gets to control everything to the exclusion of all other family<br/>\n  members. In our house, we all have value and all of our opinions and needs<br/>\n  are taken into consideration. A lot of kids have not developed a need for<br/>\n  cleanliness so that is not of value to them and it is difficult to make them<br/>\n  value that. Because that is something I value, then I take care of it. I do<br/>\n  require them to keep a certain portion of the living room clean because of<br/>\n  trip hazards. The more joyful and giving I am towards my children, the more<br/>\n  joyful and giving they are towards me.<br/>\n<br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; We have no video games in our house, and my sons haven&#39;t really<br/>\n  asked<br/>\n  for them. We let our children make many choices but couched within a<br/>\n  love and respect for others, their family, and the people around them.<br/>\n  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  How old are your sons? What will you say or do if they do ask? My oldest is<br/>\n  8. We survived without video games for quite a while but my daughter played<br/>\n  with her cousins and really wanted a Nintendo DS. We had always been sort of<br/>\n  against them because we saw so many kids that buried their noses in the<br/>\n  games to the exclusion of the rest of the world. So, when my daughter<br/>\n  expressed her desires, I expressed my concerns. She had a valid answer for<br/>\n  all of my concerns including the cost. She did her homework so I let her get<br/>\n  a video game.<br/>\n<br/>\n  Connie<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259217559","msgId":42211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlbDdxbis5MGtrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0RUVDREJBMDgyRDQ4NThBMTIyNDY5MThENURDNzcyQFNMQVZFPg=="},"prevInTopic":42210,"nextInTopic":42212,"prevInTime":42210,"nextInTime":42212,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"~~ Meredith - you are just incredible.~~ ~~The thought and time and kindness and insights that you put into your responses is breathtaking. ~~ I agree!! I","messageBody":"<div id=\"ygrps-yiv-464514337\">~~ Meredith - you are just incredible.~~<br/>\n<br/>\n~~The thought and time and kindness and insights that you put into your responses is breathtaking. ~~<br/>\n<br/>\nI agree!! I thought that worth repeating as Meredith is a much appreciated moderator here...especially now with both owners absentee a lot of the time. Everything you do is appreciated beyond words Meredith!<br/>\n<br/>\nOur other two Mods don&#39;t get much thanks either....we love you Rue and Deb (they&#39;re the quieter ones usually, but are just as brilliant!)<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":82356830,"authorName":"Craig Thornton","from":"Craig Thornton &lt;thorn@...&gt;","profile":"mclauchlanjane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259215942","msgId":42210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0RUVDREJBMDgyRDQ4NThBMTIyNDY5MThENURDNzcyQFNMQVZFPg=="},"prevInTopic":42209,"nextInTopic":42211,"prevInTime":42209,"nextInTime":42211,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"Meredith - you are just incredible. The thought and time and kindness and insights that you put into your responses is breathtaking. You are inspiring,","messageBody":"<div id=\"ygrps-yiv-1542649859\">Meredith - you are just incredible.<br/>\n<br/>\n <br/>\n<br/>\nThe thought and time and kindness and insights that you put into your<br/>\nresponses is breathtaking.  <br/>\n<br/>\n <br/>\n<br/>\nYou are inspiring, illuminating and such a darned good read that I always<br/>\nsave your messages for last, so that I can really relish and enjoy them. <br/>\n<br/>\n <br/>\n<br/>\nThe number of lightbulb moments you have given me is now beyond count.  You<br/>\nhave made the most wonderful difference to the speed of my mind-shift, and<br/>\nto the <br/>\n<br/>\n <br/>\n<br/>\nhappiness and well-being of our family - all the way down here in little old<br/>\nNew Zealand.<br/>\n<br/>\n <br/>\n<br/>\nThank you so much!!! = )<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What is it with video games and unschooling?","postDate":"1259204052","msgId":42209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhla3Frays1cjJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlZjM1N2VmMDkxMTI1MTE1NXYzN2NkN2I2NG5kNmYwZDUzYWYxYjk1ZTYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42202,"nextInTopic":42210,"prevInTime":42208,"nextInTime":42210,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... When an adult is all wrapped up in something, its called a passion. Why is it an obsession when a child does the same? That s a bit of cultural baggage,","messageBody":"<div id=\"ygrps-yiv-1799358496\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Hillary Heidelberg &lt;hillaryheidelberg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have been lurking on this list for a while, enjoying learning from<br/>\n&gt; all of you. But one thing that seems to continually pop up is the avid<br/>\n&gt; interest, obsession it could be called, that some unschooling kids<br/>\n&gt; have with video games.<br/>\n<br/>\n </span></blockquote>When an adult is all wrapped up in something, its called a passion. Why is it an obsession when a child does the same? That&#39;s a bit of cultural baggage, the idea that children aren&#39;t capable of passions, that their interests should be moderate, or they are pathological. Children are naturally passionate! Radical unschooling seeks to support that passionate nature, rather than quench it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And it seems that parents are somehow required<br/>\n<br/>\n </span></blockquote>No one&#39;s required to do anything. I solemnly swear there is no unschooling police force who will come to your home and poo poo at you for what you are doing or not doing! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; to cater to this interest by providing food to the game-playing child<br/>\n&gt; even holding a straw up to said child&#39;s mouth so he or she doesn&#39;t<br/>\n&gt; need to take her eyes off the game.<br/>\n<br/>\n </span></blockquote>Rather than railing about how abnormal this seems, it might help to think about Why that might be recommended. It goes back to this idea that children have passions. When someone is passionate about something, it can occupy the attention pretty completely. Its easy to forget to do things like eat and rest when something else is soooooooo wonderful and fascinating! <br/>\n<br/>\nSince forgetting to eat can lead to people being groucy, it makes sense to bring snacks. I bring snacks to my adult partner when he&#39;s so wrapped up in a woodworking project that he forgets a meal - why wouldn&#39;t I do the same for my kids? Its an act of kindness to my family member, and to me, too. I don&#39;t want to be grouched at!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Shouldn&#39;t all family members be happy?<br/>\n<br/>\n </span></blockquote>If all the family members arent happy, how do you pick who suffers? Would you pick the kids? Maybe set the kids up to suffer but tell them its not so bad, or that they need a better attitude? I&#39;m not saying its better to be a martyr, though. Adults have an option that kids don&#39;t - we can look at a bigger picture, delay gratification, step outside our current perspective and find another. And we can model those things for our kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; smply make his own meal, portable and neat? Why doesn&#39;t he simply<br/>\n&gt; clean up any mess he makes?<br/>\n<br/>\n </span></blockquote>For some kids, its not &quot;just&quot; and &quot;simply&quot;. Maybe your kids are easy going. I find that parents with easy going kids, kids who do what parents want without much complaint, have a hard time imagining life with a child who is spirited, has higher needs and bigger emotions. Its a whole different ball game, one in which &quot;just&quot; and &quot;simply&quot; don&#39;t happen very often!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Why doesn&#39;t the<br/>\n&gt; child who loves video games so much that he can&#39;t (god forbid) stop<br/>\n&gt; for a few minutes and enjoy the meal that his mother prepared for him...<br/>\n<br/>\n </span></blockquote>If George were to interrupt me in the middle of doing something I love to eat something I didn&#39;t feel like eating, I&#39;d say &quot;no thank you, sweetie.&quot; Kids aren&#39;t usually given that same option. They can be forced by someone bigger and stronger than they to stop doing the thing they love at the whim of that bigger person. Offering kids the courtesy to say &quot;no thanks&quot; is an enormous gift. Its the gift of treating them as real people, with real passions, rather than as pre-people whose &quot;interests&quot; are of less import than those of adults. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have no video games in our house, and my sons haven&#39;t really asked<br/>\n&gt; for them.<br/>\n<br/>\n </span></blockquote>If your kids aren&#39;t interested in video games than maybe you have no grounds for comparison. If they don&#39;t have very big passions then you certainly have no grounds for comparison. <br/>\n<br/>\nBut what do you mean &quot;haven&#39;t really asked&quot;? Do you mean they haven&#39;t asked or that they&#39;ve said &quot;I&#39;d like that&quot; and you&#39;ve shut them down by saying &quot;you don&#39;t really want/need that&quot; or &quot;we can&#39;t afford that&quot;? Its very easy to shut down some kids. They learn to keep their real desires private, or to second-guess themselves, to distrust themselves. <br/>\n<br/>\nWhy is<br/>\n<blockquote><span title=\"ireply\"> &gt; the child&#39;s wish to eat crumbly food whilst playing video games. More<br/>\n&gt; important than the mother&#39;s wish to simplify her family eating habits?<br/>\n<br/>\n </span></blockquote>Everyone&#39;s needs, wants and wishes are important, but adults have more skills, more knowledge, more experience than children. We have the option of modelling that - of modelling thoughtfulness and courtesy and grace. When we model them regularly, our kids learn to value those on a deep, intrinsic level. Eventually, they&#39;ll have the skills, knowledge and experience themselves to offer those gifts back to us. That&#39;s not a theory, that&#39;s what happens in radical unschooling homes. It starts with parents being actively kinder to children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Isn&#39;t unschooling fundamentally built on respect, not just for the<br/>\n&gt; child, but for the parent?<br/>\n<br/>\n </span></blockquote>I don&#39;t think of &quot;respect&quot; as one of my own principles because there&#39;s too much baggage tied to the word, for me. Instead, I think of what you might call the building blocks of respect - what kinds of traits do I hold in esteem? For me, kindness and a willingness to look outside one&#39;s own perspective are biggies. But unschooling is not about teaching or imparting our personal values to our kids! Its about discovering how to live those values directly in our day to day lives. So, valuing kindness I strive to be kinder - to my kids, my partner, and myself, too! My life isn&#39;t kinder when I&#39;m rude or short tempered. My life isn&#39;t kinder when I insist on my fair share. In the same vein, valuing a broader perspective I seek one. I try to see my kids&#39; viewpoint and I let that viewpoint enrich my life, rather than feeling weighted down by it, by their needs. How wonderful that I can give the gift of my time and attention to my kids! <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What is it with video games and unschooling?","postDate":"1259189846","msgId":42202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NTY0Mi42NzQ0My5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDUwRjZDOTM3LThGNjAtNEM0My04QzVFLUE5OENEMjkxRkU5QkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGZlZjM1N2VmMDkxMTI1MTE1NXYzN2NkN2I2NG5kNmYwZDUzYWYxYjk1ZTYxQG1haWwuZ21haWwuY29tPiA8NTBGNkM5MzctOEY2MC00QzQzLThDNUUtQTk4Q0QyOTFGRTlCQHZlcml6b24ubmV0Pg=="},"prevInTopic":42201,"nextInTopic":42209,"prevInTime":42201,"nextInTime":42203,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"What you don t see, what people who read here for a while do see, what people who ve lived this life through to a child s young adulthood, is the results of","messageBody":"<div id=\"ygrps-yiv-399466947\">What you don&#39;t see, what people who read here for a while do see, <br/>\nwhat people who&#39;ve lived this life through to a child&#39;s young <br/>\nadulthood, is the results of building relationships. Its not teens <br/>\ndemanding food from an overworked mom while they park their fat butts <br/>\non the couch playing video games. The result is delightful teens who <br/>\nrespond with the kindness and generosity and respect they&#39;ve been given.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nTHis is an example of unschooled kids when they grow up:<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://gail-hummingbirdhaven.blogspot.com/2009/07/just-clean-kitchenor-is-it.html\">http://gail-hummingbirdhaven.blogspot.com/2009/07/just-clean-kitchenor-is-it.html</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wed, November 25, 2009 4:45:38 PM<br/>\nSubject: Re: [unschoolingbasics] What is it with video games and unschooling?<br/>\n<br/>\n  <br/>\nYour post has a lot of fear in it based on what you&#39;re certain is the <br/>\ntruth.<br/>\n<br/>\nWhat unschoolers have is a longer term view of what really and <br/>\nultimately happens with kids whose interests are supported.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; obsession it could be called<br/>\n<br/>\n </span></blockquote>If you put a huge gigantic consuming interest in a box and label it <br/>\nobsession, you&#39;re going to paint all the aspects with a negative <br/>\nbrush. You won&#39;t see the joy and excitement and what&#39;s being gained. <br/>\nYou will see pointless pleasure and selfishness.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seems that parents are somehow required<br/>\n<br/>\n </span></blockquote>Conventional parenting is heavily weighted with (what seem like) <br/>\nsensible responses to children&#39;s poor choices in order to correct <br/>\ntheir behavior.<br/>\n<br/>\nWith radical unschooling, there are no requirements, but there are <br/>\nways of interacting with children that grow a trusting relationship <br/>\nbetween you and ways of interacting that tear down a trusting <br/>\nrelationship.<br/>\n<br/>\nYou can choose to use conventional approaches, with mom deciding <br/>\nwhat&#39;s best for the child and working to get the child to follow. But <br/>\nif you look at that approach objectively, put it in a different <br/>\ncontext, it&#39;s much easier to see that what feels so sensible to the <br/>\nadult, feels like distrust and dislike to the child.<br/>\n<br/>\nThat doesn&#39;t mean we throw our hands up and say &quot;Whatever!&quot; Radical <br/>\nunschooling parents are *more* involved, *more* attuned to their kids.<br/>\n<br/>\nSometimes when control is lifted, things get off kilter. That&#39;s why <br/>\nit&#39;s suggested over and over, that&#39;s why on the front page of my <br/>\nwebsite I have it bolded in red!, that parents shouldn&#39;t drop all <br/>\ntheir rules at once. They should just find ways to say yes more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; to cater to this interest.<br/>\n<br/>\n </span></blockquote>This is also a box that won&#39;t help build a relationship.<br/>\n<br/>\nIf your husband wasn&#39;t fond of something you enjoyed, say gardening, <br/>\nand you asked him to pick up some fertilizer for you, would it feel <br/>\nwarm and squishy if you overheard him saying everything he did for <br/>\nyou was merely catering to your interests.<br/>\n<br/>\nDon&#39;t cater. Support. Be with them. Find what they enjoy and enjoy it <br/>\nwith them.<br/>\n<br/>\nAre we drawn to people who cater to us? Who look down on our <br/>\ninterests? Who try to pull us away to something more worthy?<br/>\n<br/>\nOr are we drawn to people who enjoy our enjoyment?<br/>\n<br/>\nWhich of the two would you prefer to spend time with? Which person <br/>\nwould you listen to when they had a suggestion or something they <br/>\nwanted to share with you?<br/>\n<br/>\nControl is an illusion. All we have is our influence. If we control, <br/>\nwe&#39;ll lose influence. If we build relationships with our kids, the <br/>\nsame way we build relationships with other people by finding delight <br/>\nin who they are, then we hold onto our only valuable asset: our <br/>\ninfluence.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; even holding a straw up to said child&#39;s mouth so he or she doesn&#39;t<br/>\n&gt; need to take her eyes off the game<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Why would you listen to parents who were advocating that?<br/>\n<br/>\nAnd if you don&#39;t believe it, then why would you say that?<br/>\n<br/>\nIf you don&#39;t understand how it works, please do ask! But if you&#39;re <br/>\ngoing to hold up a dirty image to show us what you think we look <br/>\nlike, then people are far less likely to help.<br/>\n<br/>\nAnd if that&#39;s the image you have of us, why in the world would you <br/>\nwant our help??<br/>\n<blockquote><span title=\"ireply\"> &gt; scoldings for a mom who doesn&#39;t want to cater to the myriad food needs<br/>\n&gt; and demands of her family<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This list is for ideas and help in building relationships. When <br/>\nsomeone essentially is saying -- on a radical unschooling list -- <br/>\nthat they&#39;ve tried everything to get the child to comply doesn&#39;t it <br/>\nmake sense that they want a radical unschooling perspective?<br/>\n<br/>\nIf they wanted a conventional parenting approach, they could call <br/>\ntheir friends. Their friends would tell them how to make that kid <br/>\ncomply. And more than likely those same friends would be complaining <br/>\nabout how horrid their teens are and how the teens don&#39;t listen.<br/>\n<br/>\nWhat you don&#39;t see, what people who read here for a while do see, <br/>\nwhat people who&#39;ve lived this life through to a child&#39;s young <br/>\nadulthood, is the results of building relationships. Its not teens <br/>\ndemanding food from an overworked mom while they park their fat butts <br/>\non the couch playing video games. The result is delightful teens who <br/>\nrespond with the kindness and generosity and respect they&#39;ve been given.<br/>\n<blockquote><span title=\"ireply\"> &gt; Why doesn&#39;t the<br/>\n&gt; child who loves video games so much that he can&#39;t (god forbid) stop<br/>\n&gt; for a few minutes and enjoy the meal that his mother prepared for him<br/>\n&gt; smply make his own meal, portable and neat? Why doesn&#39;t he simply<br/>\n&gt; clean up any mess he makes?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Simply?<br/>\n<br/>\nWhat is simple about making another person do something they find <br/>\ndifficult and pointless to do?<br/>\n<br/>\nWhat&#39;s a simple process to an adult, to truly understand what we&#39;re <br/>\nasking of kids, needs magnified 10 fold.<br/>\n<br/>\nKids mature. Their understanding, their abilities, their values, <br/>\ntheir view of the world changes as they get older. We can&#39;t force <br/>\nthat change on them by making them see an adult point of view or <br/>\ngoing through the motions of our values.<br/>\n<br/>\nWe can, though, enter their world, see the world through their eyes, <br/>\nand engage them in the process if we&#39;re approaching it with a <br/>\npositive attitude, ask -- really ask as in they can say no! -- for <br/>\ntheir help.<br/>\n<br/>\nIf we want them to respect our needs that they don&#39;t understand, we <br/>\nneed to fill them up with respect for their needs that we may find it <br/>\nhard to understand. You won&#39;t get a return of respect by demanding <br/>\nrespect. You&#39;ll get snotty teens who don&#39;t give a damn what you want.<br/>\n<blockquote><span title=\"ireply\"> &gt; but also to let the child<br/>\n&gt; know when those choices impinge upon other&#39;s needs and rights.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It would be cruel to let a child believe his actions have no impact.<br/>\n<br/>\nBut it&#39;s confusing to a child to make them go through the motions of <br/>\nrespect when they aren&#39;t yet capable of understanding. It won&#39;t make <br/>\nsense to a child that a mom is spending time on something if she <br/>\ndoesn&#39;t really want to do it. All he knows is he wants to eat. An <br/>\nadult on his own would grab some food and eat in front of the video <br/>\ngame because it makes sense.<br/>\n<br/>\nWhen he&#39;s older, he&#39;ll understand what the work involved in preparing <br/>\na hot meal. (One way to help that understanding along is by inviting <br/>\nkids along to help cook. Involve them in the process of picking out <br/>\nthings they want to cook and doing it with them.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Isn&#39;t unschooling fundamentally built on respect, not just for the<br/>\n&gt; child, but for the parent?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>How do you make someone respect someone else? Really think about that.<br/>\n<br/>\nIf someone at church told you how to behave so they felt respected <br/>\nwhen what they were asking you to do didn&#39;t make much sense would you <br/>\nfeel warmly toward them and more inclined to want to do more for them?<br/>\n<br/>\nWe treat kids in ways that would drive other adults away. We know <br/>\nthat being around people who are watching us for mistakes and always <br/>\ncorrecting us are people we&#39;d prefer to avoid and ones we tend to <br/>\ntune out. And yet we do the same to kids and expect different results.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have no video games in our house, and my sons haven&#39;t really asked<br/>\n&gt; for them.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We have no books in our house and my daughter hasn&#39;t really asked for <br/>\nthem.<br/>\n<br/>\nDoes that statement feel right at all?<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What is it with video games and unschooling?","postDate":"1259189138","msgId":42201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwRjZDOTM3LThGNjAtNEM0My04QzVFLUE5OENEMjkxRkU5QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGZlZjM1N2VmMDkxMTI1MTE1NXYzN2NkN2I2NG5kNmYwZDUzYWYxYjk1ZTYxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZlZjM1N2VmMDkxMTI1MTE1NXYzN2NkN2I2NG5kNmYwZDUzYWYxYjk1ZTYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42200,"nextInTopic":42202,"prevInTime":42200,"nextInTime":42202,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"Your post has a lot of fear in it based on what you re certain is the truth. What unschoolers have is a longer term view of what really and ultimately happens","messageBody":"<div id=\"ygrps-yiv-98728350\">Your post has a lot of fear in it based on what you&#39;re certain is the  <br/>\ntruth.<br/>\n<br/>\nWhat unschoolers have is a longer term view of what really and  <br/>\nultimately happens with kids whose interests are supported.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; obsession it could be called<br/>\n<br/>\n </span></blockquote>If you put a huge gigantic consuming interest in a box and label it  <br/>\nobsession, you&#39;re going to paint all the aspects with a negative  <br/>\nbrush. You won&#39;t see the joy and excitement and what&#39;s being gained.  <br/>\nYou will see pointless pleasure and selfishness.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seems that parents are somehow required<br/>\n<br/>\n<br/>\n </span></blockquote>Conventional parenting is heavily weighted with (what seem like)  <br/>\nsensible responses to children&#39;s poor choices in order to correct  <br/>\ntheir behavior.<br/>\n<br/>\nWith radical unschooling, there are no requirements, but there are  <br/>\nways of interacting with children that grow a trusting relationship  <br/>\nbetween you and ways of interacting that tear down a trusting  <br/>\nrelationship.<br/>\n<br/>\nYou can choose to use conventional approaches, with mom deciding  <br/>\nwhat&#39;s best for the child and working to get the child to follow. But  <br/>\nif you look at that approach objectively, put it in a different  <br/>\ncontext, it&#39;s much easier to see that what feels so sensible to the  <br/>\nadult, feels like distrust and dislike to the child.<br/>\n<br/>\nThat doesn&#39;t mean we throw our hands up and say &quot;Whatever!&quot; Radical  <br/>\nunschooling parents are *more* involved, *more* attuned to their kids.<br/>\n<br/>\nSometimes when control is lifted, things get off kilter. That&#39;s why  <br/>\nit&#39;s suggested over and over, that&#39;s why on the front page of my  <br/>\nwebsite I have it bolded in red!, that parents shouldn&#39;t drop all  <br/>\ntheir rules at once. They should just find ways to say yes more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; to cater to this interest.<br/>\n<br/>\n </span></blockquote>This is also a box that won&#39;t help build a relationship.<br/>\n<br/>\nIf your husband wasn&#39;t fond of something you enjoyed, say gardening,  <br/>\nand you asked him to pick up some fertilizer for you, would it feel  <br/>\nwarm and squishy if you overheard him saying everything he did for  <br/>\nyou was merely catering to your interests.<br/>\n<br/>\nDon&#39;t cater. Support. Be with them. Find what they enjoy and enjoy it  <br/>\nwith them.<br/>\n<br/>\nAre we drawn to people who cater to us? Who look down on our  <br/>\ninterests? Who try to pull us away to something more worthy?<br/>\n<br/>\nOr are we drawn to people who enjoy our enjoyment?<br/>\n<br/>\nWhich of the two would you prefer to spend time with? Which person  <br/>\nwould you listen to when they had a suggestion or something they  <br/>\nwanted to share with you?<br/>\n<br/>\nControl is an illusion. All we have is our influence. If we control,  <br/>\nwe&#39;ll lose influence. If we build relationships with our kids, the  <br/>\nsame way we build relationships with other people by finding delight  <br/>\nin who they are, then we hold onto our only valuable asset: our  <br/>\ninfluence.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; even holding a straw up to said child&#39;s mouth so he or she doesn&#39;t<br/>\n&gt; need to take her eyes off the game<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Why would you listen to parents who were advocating that?<br/>\n<br/>\nAnd if you don&#39;t believe it, then why would you say that?<br/>\n<br/>\nIf you don&#39;t understand how it works, please do ask! But if you&#39;re  <br/>\ngoing to hold up a dirty image to show us what you think we look  <br/>\nlike, then people are far less likely to help.<br/>\n<br/>\nAnd if that&#39;s the image you have of us, why in the world would you  <br/>\nwant our help??<br/>\n<blockquote><span title=\"ireply\"> &gt; scoldings for a mom who doesn&#39;t want to cater to the myriad food needs<br/>\n&gt; and demands of her family<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This list is for ideas and help in building relationships. When  <br/>\nsomeone essentially is saying -- on a radical unschooling list --  <br/>\nthat they&#39;ve tried everything to get the child to comply doesn&#39;t it  <br/>\nmake sense that they want a radical unschooling perspective?<br/>\n<br/>\nIf they wanted a conventional parenting approach, they could call  <br/>\ntheir friends. Their friends would tell them how to make that kid  <br/>\ncomply. And more than likely those same friends would be complaining  <br/>\nabout how horrid their teens are and how the teens don&#39;t listen.<br/>\n<br/>\nWhat you don&#39;t see, what people who read here for a while do see,  <br/>\nwhat people who&#39;ve lived this life through to a child&#39;s young  <br/>\nadulthood, is the results of building relationships. Its not teens  <br/>\ndemanding food from an overworked mom while they park their fat butts  <br/>\non the couch playing video games. The result is delightful teens who  <br/>\nrespond with the kindness and generosity and respect they&#39;ve been given.<br/>\n<blockquote><span title=\"ireply\"> &gt; Why doesn&#39;t the<br/>\n&gt; child who loves video games so much that he can&#39;t (god forbid) stop<br/>\n&gt; for a few minutes and enjoy the meal that his mother prepared for him<br/>\n&gt; smply make his own meal, portable and neat? Why doesn&#39;t he simply<br/>\n&gt; clean up any mess he makes?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Simply?<br/>\n<br/>\nWhat is simple about making another person do something they find  <br/>\ndifficult and pointless to do?<br/>\n<br/>\nWhat&#39;s a simple process to an adult, to truly understand what we&#39;re  <br/>\nasking of kids, needs magnified 10 fold.<br/>\n<br/>\nKids mature. Their understanding, their abilities, their values,  <br/>\ntheir view of the world changes as they get older. We can&#39;t force  <br/>\nthat change on them by making them see an adult point of view or  <br/>\ngoing through the motions of our values.<br/>\n<br/>\nWe can, though, enter their world, see the world through their eyes,  <br/>\nand engage them in the process if we&#39;re approaching it with a  <br/>\npositive attitude, ask -- really ask as in they can say no! -- for  <br/>\ntheir help.<br/>\n<br/>\nIf we want them to respect our needs that they don&#39;t understand, we  <br/>\nneed to fill them up with respect for their needs that we may find it  <br/>\nhard to understand. You won&#39;t get a return of respect by demanding  <br/>\nrespect. You&#39;ll get snotty teens who don&#39;t give a damn what you want.<br/>\n<blockquote><span title=\"ireply\"> &gt; but also to let the child<br/>\n&gt; know when those choices impinge upon other&#39;s needs and rights.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It would be cruel to let a child believe his actions have no impact.<br/>\n<br/>\nBut it&#39;s confusing to a child to make them go through the motions of  <br/>\nrespect when they aren&#39;t yet capable of understanding. It won&#39;t make  <br/>\nsense to a child that a mom is spending time on something if she  <br/>\ndoesn&#39;t really want to do it. All he knows is he wants to eat. An  <br/>\nadult on his own would grab some food and eat in front of the video  <br/>\ngame because it makes sense.<br/>\n<br/>\nWhen he&#39;s older, he&#39;ll understand what the work involved in preparing  <br/>\na hot meal. (One way to help that understanding along is by inviting  <br/>\nkids along to help cook. Involve them in the process of picking out  <br/>\nthings they want to cook and doing it with them.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Isn&#39;t unschooling fundamentally built on respect, not just for the<br/>\n&gt; child, but for the parent?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>How do you make someone respect someone else? Really think about that.<br/>\n<br/>\nIf someone at church told you how to behave so they felt respected  <br/>\nwhen what they were asking you to do didn&#39;t make much sense would you  <br/>\nfeel warmly toward them and more inclined to want to do more for them?<br/>\n<br/>\nWe treat kids in ways that would drive other adults away. We know  <br/>\nthat being around people who are watching us for mistakes and always  <br/>\ncorrecting us are people we&#39;d prefer to avoid and ones we tend to  <br/>\ntune out. And yet we do the same to kids and expect different results.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have no video games in our house, and my sons haven&#39;t really asked<br/>\n&gt; for them.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We have no books in our house and my daughter hasn&#39;t really asked for  <br/>\nthem.<br/>\n<br/>\nDoes that statement feel right at all?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] What is it with video games and unschooling?","postDate":"1259189104","msgId":42200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPRUVFSkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGZlZjM1N2VmMDkxMTI1MTE1NXYzN2NkN2I2NG5kNmYwZDUzYWYxYjk1ZTYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42195,"nextInTopic":42201,"prevInTime":42199,"nextInTime":42201,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"... from all of you. But one thing that seems to continually pop up is the avid interest, obsession it could be called, that some unschooling kids have with","messageBody":"<div id=\"ygrps-yiv-788226538\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; I have been lurking on this list for a while, enjoying learning<br/>\n </span></blockquote>from<br/>\nall of you. But one thing that seems to continually pop up is the avid<br/>\ninterest, obsession it could be called, that some unschooling kids<br/>\nhave with video games. And it seems that parents are somehow required<br/>\nto cater to this interest by providing food to the game-playing child,<br/>\neven holding a straw up to said child&#39;s mouth so he or she doesn&#39;t<br/>\nneed to take her eyes off the game. There is talk about how to avoid<br/>\ncrumbs where the child is playing and eating, and (what sound like)<br/>\nscoldings for a mom who doesn&#39;t want to cater to the myriad food needs<br/>\nand demands of her family. It was even suggested that said mommight<br/>\nnot be cut out for unschooling. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI don&#39;t think anybody has been scolded. Somebody asked a question and we are<br/>\nall providing our own answers based on our own perspectives and our own<br/>\nexperiences. The way you phrase it makes it sound so negative. :-) I like to<br/>\nthink of it as helping them to learn. I don&#39;t think anybody is required to<br/>\ncater to anybody else. There is a big difference to catering to somebody and<br/>\ndoing things because you love them. When I am busy with something, my<br/>\nhusband will bring me food or drink. Likewise, if he or the kids are wrapped<br/>\nup in something, I will take them food or drink. We have modeled this<br/>\ndynamic between us so much that our kids will bring us stuff if we are busy<br/>\nand need food or drink. We end up with a lot of crumbs but that is why we<br/>\nhave a vacuum. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; It all just boggles. My mind a bit. Unschooling to me isn&#39;t<br/>\n </span></blockquote>JUST about<br/>\nthe child, is it? Isn&#39;t it about creating a nurturing and loving<br/>\nFAMILY dynamic? Shouldn&#39;t all family members be happy? Why doesn&#39;t the<br/>\nchild who loves video games so much that he can&#39;t (god forbid) stop<br/>\nfor a few minutes and enjoy the meal that his mother prepared for him<br/>\nsmply make his own meal, portable and neat? Why doesn&#39;t he simply<br/>\nclean up any mess he makes? Is the mother there simply to cater to<br/>\nevery whim of her child? My understanding of unschooling is that its<br/>\nabout allowing children to make choices, but also to let the child<br/>\nknow when those choices impinge upon other&#39;s needs and rights. Why is<br/>\nthe child&#39;s wish to eat crumbly food whilst playing video games. More<br/>\nimportant than the mother&#39;s wish to simplify her family eating habits?<br/>\nIsn&#39;t unschooling fundamentally built on respect, not just for the<br/>\nchild, but for the parent? &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nKids are not born knowing how to simply clean up their own messes. They<br/>\nlearn it gradually over time by seeing other people do it. Where does normal<br/>\ncaretaking end and catering begin? Would you call changing a babies diaper<br/>\ncatering to the child? If a 2 year old is hungry, are you going to feed them<br/>\nor make them get stuff themselves because feeding them would be considered<br/>\ncatering to them? The way you phrase it makes it sound as if the mother is<br/>\nthe one that gets to control everything to the exclusion of all other family<br/>\nmembers. In our house, we all have value and all of our opinions and needs<br/>\nare taken into consideration. A lot of kids have not developed a need for<br/>\ncleanliness so that is not of value to them and it is difficult to make them<br/>\nvalue that. Because that is something I value, then I take care of it. I do<br/>\nrequire them to keep a certain portion of the living room clean because of<br/>\ntrip hazards. The more joyful and giving I am towards my children, the more<br/>\njoyful and giving they are towards me.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; We have no video games in our house, and my sons haven&#39;t really<br/>\n </span></blockquote>asked<br/>\nfor them. We let our children make many choices but couched within a<br/>\nlove and respect for others, their family, and the people around them.<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nHow old are your sons? What will you say or do if they do ask? My oldest is<br/>\n8. We survived without video games for quite a while but my daughter played<br/>\nwith her cousins and really wanted a Nintendo DS. We had always been sort of<br/>\nagainst them because we saw so many kids that buried their noses in the<br/>\ngames to the exclusion of the rest of the world. So, when my daughter<br/>\nexpressed her desires, I expressed my concerns. She had a valid answer for<br/>\nall of my concerns including the cost. She did her homework so I let her get<br/>\na video game.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"deborahkmlewis","from":"&quot;deborahkmlewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Note from moderator","postDate":"1259181321","msgId":42195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlazRlOSt0MmNjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlZjM1N2VmMDkxMTI1MTE1NXYzN2NkN2I2NG5kNmYwZDUzYWYxYjk1ZTYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42193,"nextInTopic":42200,"prevInTime":42194,"nextInTime":42196,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"I apologize for sending through a post with a digest attached. I was having wonky website issues and in my confusion approved what I intended to return for","messageBody":"<div id=\"ygrps-yiv-616969583\">I apologize for sending through a post with a digest attached. <br/>\n<br/>\nI was having wonky website issues and in my confusion approved what I intended to return for editing. <br/>\n<br/>\nPlease trim posts before sending them to the list. <br/>\n<br/>\nLot&#39;s of people are on digest and when an post comes through with a whole digest attached it&#39;s tiresome to scroll through repeat posts. <br/>\n<br/>\nSorry, everyone.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":296205049,"authorName":"Hillary Heidelberg","from":"Hillary Heidelberg &lt;hillaryheidelberg@...&gt;","profile":"nycscraps","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What is it with video games and unschooling?","postDate":"1259178945","msgId":42193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlZjM1N2VmMDkxMTI1MTE1NXYzN2NkN2I2NG5kNmYwZDUzYWYxYjk1ZTYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":42195,"prevInTime":42192,"nextInTime":42194,"topicId":42193,"numMessagesInTopic":0,"msgSnippet":"I have been lurking on this list for a while, enjoying learning from all of you. But one thing that seems to continually pop up is the avid interest, obsession","messageBody":"<div id=\"ygrps-yiv-492325915\">I have been lurking on this list for a while, enjoying learning from<br/>\nall of you. But one thing that seems to continually pop up is the avid<br/>\ninterest, obsession it could be called, that some unschooling kids<br/>\nhave with video games. And it seems that parents are somehow required<br/>\nto cater to this interest by providing food to the game-playing child,<br/>\neven holding a straw up to said child&#39;s mouth so he or she doesn&#39;t<br/>\nneed to take her eyes off the game. There is talk about how to avoid<br/>\ncrumbs where the child is playing and eating, and (what sound like)<br/>\nscoldings for a mom who doesn&#39;t want to cater to the myriad food needs<br/>\nand demands of her family. It was even suggested that said mommight<br/>\nnot be cut out for unschooling.<br/>\n<br/>\nIt all just boggles. My mind a bit. Unschooling to me isn&#39;t JUST about<br/>\nthe child, is it? Isn&#39;t it about creating a nurturing and loving<br/>\nFAMILY dynamic? Shouldn&#39;t all family members be happy? Why doesn&#39;t the<br/>\nchild who loves video games so much that he can&#39;t (god forbid) stop<br/>\nfor a few minutes and enjoy the meal that his mother prepared for him<br/>\nsmply make his own meal, portable and neat? Why doesn&#39;t he simply<br/>\nclean up any mess he makes? Is the mother there simply to cater to<br/>\nevery whim of her child? My understanding of unschooling is that its<br/>\nabout allowing children to make choices, but also to let the child<br/>\nknow when those choices impinge upon other&#39;s needs and rights. Why is<br/>\nthe child&#39;s wish to eat crumbly food whilst playing video games. More<br/>\nimportant than the mother&#39;s wish to simplify her family eating habits?<br/>\nIsn&#39;t unschooling fundamentally built on respect, not just for the<br/>\nchild, but for the parent?<br/>\n<br/>\nWe have no video games in our house, and my sons haven&#39;t really asked<br/>\nfor them. We let our children make many choices but couched within a<br/>\nlove and respect for others, their family, and the people around them.<br/>\n<br/>\n<br/>\n<br/>\nOn 11/25/09, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; unschoolingbasics<br/>\n&gt; Messages In This Digest (24 Messages)<br/>\n&gt; 1a.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress From:<br/>\n&gt; Joyce Fetteroll<br/>\n&gt; 1b.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress From:<br/>\n&gt; Toby Rosenberg<br/>\n&gt; 1c.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress From:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a><br/>\n&gt; 1d.<br/>\n&gt; Krabby Patties, Software Platform and Video games causing stress From: Kelly<br/>\n&gt; 1e.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress From:<br/>\n&gt; plaidpanties666<br/>\n&gt; 1f.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress From:<br/>\n&gt; Schuyler<br/>\n&gt; 2.<br/>\n&gt; What your unschooled teen might choose to do... From: usoah1841<br/>\n&gt; 3a.<br/>\n&gt; Re: making home more fun From: AllisonR<br/>\n&gt; 3b.<br/>\n&gt; Re: making home more fun From: Rebecca Sanjabi<br/>\n&gt; 3c.<br/>\n&gt; Re: making home more fun From: Deb Lewis<br/>\n&gt; 4.<br/>\n&gt; Re: making home more fun was How to prepare for school? From: Deb Lewis<br/>\n&gt; 5a.<br/>\n&gt; Re: making home more fun/ kids in school From: Toby Rosenberg<br/>\n&gt; 5b.<br/>\n&gt; Re: making home more fun/ kids in school From: plaidpanties666<br/>\n&gt; 5c.<br/>\n&gt; Re: making home more fun/ kids in school From: theburkemommy<br/>\n&gt; 6a.<br/>\n&gt; weight gain From: meadowgirl11<br/>\n&gt; 6b.<br/>\n&gt; Re: weight gain From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a><br/>\n&gt; 6c.<br/>\n&gt; Re: weight gain From: plaidpanties666<br/>\n&gt; 6d.<br/>\n&gt; Re: weight gain From: Lyla Wolfenstein<br/>\n&gt; 6e.<br/>\n&gt; Re: weight gain From: plaidpanties666<br/>\n&gt; 6f.<br/>\n&gt; Re: weight gain From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a><br/>\n&gt; 6g.<br/>\n&gt; Re: weight gain From: Beth Williams<br/>\n&gt; 6h.<br/>\n&gt; Re: weight gain From: Alan<br/>\n&gt; 6i.<br/>\n&gt; studies on addiction was Re: [unschoolingbasics] Re: weight gain From:<br/>\n&gt; Schuyler<br/>\n&gt; 7.<br/>\n&gt; Re: making home more fun / kids in school From: Deb Lewis<br/>\n&gt; View All Topics | Create New Topic<br/>\n&gt; Messages<br/>\n&gt; 1a.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress<br/>\n&gt; Posted by: &quot;Joyce Fetteroll&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>   jfetteroll<br/>\n&gt; Tue Nov 24, 2009 4:04 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Nov 23, 2009, at 3:25 PM, plaidpanties666 wrote:<br/>\n&gt;<br/>\n&gt;&gt; With no restrictions at all, Mo takes breaks periodically.<br/>\n&gt;<br/>\n&gt; But not all kids will! :-) If someone&#39;s child isn&#39;t, it isn&#39;t because<br/>\n&gt; you&#39;re doing it wrong. It&#39;s because they&#39;re having so much fun that<br/>\n&gt; they don&#39;t notice they&#39;re getting hungry or antsy. I&#39;ve been known to<br/>\n&gt; do the same and I&#39;ve had a lot more practice! ;-)<br/>\n&gt;<br/>\n&gt; Bring them food. Suggest a fun big movement activity when they reach<br/>\n&gt; a pausing point. Or if the game&#39;s intense or brand new, be with them<br/>\n&gt; and be aware of the flow of the game and offer some change up -- or a<br/>\n&gt; trip to the bathroom ;-) -- when they reach a pausing point.<br/>\n&gt;<br/>\n&gt; It&#39;s an opportunity to help them find ways to destress that will be<br/>\n&gt; useful even as an adult. *And* it&#39;s an opportunity to figure out ways<br/>\n&gt; not to impose your destress solutions on them and be their partner<br/>\n&gt; instead ;-)<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (10)<br/>\n&gt; 1b.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress<br/>\n&gt; Posted by: &quot;Toby Rosenberg&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:philipntoby@...\">philipntoby@...</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:philipntoby@...\">philipntoby@...</a><br/>\n&gt; Tue Nov 24, 2009 11:26 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My son definitely gets overly hungry playing/watching videos and then he<br/>\n&gt; comes to me screaming and yelling how I&#39;m a terrible Mom because I don&#39;t<br/>\n&gt; feed him. Yes, bringing him food does help. However, it&#39;s only helpful to me<br/>\n&gt; if I bring veggies that are not going to make a huge mess. Otherwise, I end<br/>\n&gt; up with crumbs ground into our carpet. Today, I&#39;ve been sick. It&#39;s<br/>\n&gt; lunchtime.. I warmed up Mac n&#39; Cheese for my 2 year old. I politely asked my<br/>\n&gt; son (who had a friend over) to finish the round on the video game and come<br/>\n&gt; to eat the food. He completely ignored me. So I came to him a second time<br/>\n&gt; and told him to pause it so he could eat. After ignoring me again, I turned<br/>\n&gt; off the TV. He didn&#39;t complain. He came upstairs and ate his lunch. Then he<br/>\n&gt; noticed a board game out on the table and got involved in it. He&#39;s ate and<br/>\n&gt; played for about 45 minutes before returning to the basement for more video<br/>\n&gt; games.<br/>\n&gt;<br/>\n&gt; I&#39;m not saying it&#39;s right that I turned the TV off for him. I just have not<br/>\n&gt; found another way that works better for both of us. If I had left the matter<br/>\n&gt; alone, he might have gotten hungry in an hour or so. At that point, he would<br/>\n&gt; have come looking to me for food and I would have felt resentful.  I don&#39;t<br/>\n&gt; want to prepare numerous meals around everyone&#39;s different schedules. In<br/>\n&gt; addition, as I mentioned, I am not feeling well and I&#39;m trying to minimize<br/>\n&gt; what I need to do.<br/>\n&gt;<br/>\n&gt; I&#39;m happy to teach him how to warm up some of his own food but for the most<br/>\n&gt; part he is uninterested as he likes me to serve him.<br/>\n&gt;<br/>\n&gt;  I love feeding my family. I am happy to feed them breakfast, lunch<br/>\n&gt; and dinner. I gave up making everyone eat at the same time and I am<br/>\n&gt; unwilling to keep warming food up. I understand that I am trying to<br/>\n&gt; accomodate the various needs in my family. How do I do that without<br/>\n&gt; abandoning my own needs? I feel resentful because I think I spend too much<br/>\n&gt; of my day catering to their  food whims. I have started saying that I&#39;m<br/>\n&gt; happy to make something they want with them. Usually, they decline and<br/>\n&gt; either give up on that food or say that I should make it for them. Is it<br/>\n&gt; fair that I should do something for them that I don&#39;t necesarily want to do<br/>\n&gt; and they have no interest in helping?<br/>\n&gt;<br/>\n&gt; Toby<br/>\n&gt;<br/>\n&gt; --- On Tue, 11/24/09, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; From: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\n&gt; Subject: Re: [unschoolingbasics] Re: Krabby Patties, Software Platform and<br/>\n&gt; Video games causing stress<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Date: Tuesday, November 24, 2009, 7:04 AM<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Nov 23, 2009, at 3:25 PM, plaidpanties666 wrote:<br/>\n&gt;<br/>\n&gt;&gt; With no restrictions at all, Mo takes breaks periodically.<br/>\n&gt;<br/>\n&gt; But not all kids will! :-) If someone&#39;s child isn&#39;t, it isn&#39;t because<br/>\n&gt; you&#39;re doing it wrong. It&#39;s because they&#39;re having so much fun that<br/>\n&gt; they don&#39;t notice they&#39;re getting hungry or antsy. I&#39;ve been known to<br/>\n&gt; do the same and I&#39;ve had a lot more practice! ;-)<br/>\n&gt;<br/>\n&gt; Bring them food. Suggest a fun big movement activity when they reach<br/>\n&gt; a pausing point. Or if the game&#39;s intense or brand new, be with them<br/>\n&gt; and be aware of the flow of the game and offer some change up -- or a<br/>\n&gt; trip to the bathroom ;-) -- when they reach a pausing point.<br/>\n&gt;<br/>\n&gt; It&#39;s an opportunity to help them find ways to destress that will be<br/>\n&gt; useful even as an adult. *And* it&#39;s an opportunity to figure out ways<br/>\n&gt; not to impose your destress solutions on them and be their partner<br/>\n&gt; instead ;-)<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (10)<br/>\n&gt; 1c.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress<br/>\n&gt; Posted by: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a>&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a>   casouthworth<br/>\n&gt; Tue Nov 24, 2009 12:37 pm (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt; I&#39;m happy to teach him how to warm up some of his own food but for the<br/>\n&gt;&gt;&gt;&gt;&gt; most part he is uninterested as he likes me to serve him .&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; Everybody likes to be served every once in a while. :-) In our house, we<br/>\n&gt; have a dynamic where I will ask the kids to serve me. If my oldest is in the<br/>\n&gt; kitchen and I am busy, I will ask her to bring me stuff or prepare something<br/>\n&gt; for me. It isn&#39;t all of the time but it happens. Sometimes they tell me no<br/>\n&gt; because it would be too hard. That is okay but I do use it as an opportunity<br/>\n&gt; to discuss how important it is to help each other. I also draw a comparison<br/>\n&gt; between when they ask me to do stuff for them and I tell them no. Sometimes,<br/>\n&gt; I will jokingly tell them, &quot;I&#39;ll remember that the next time you want<br/>\n&gt; something.&quot; You have to be careful with that because it can come across as<br/>\n&gt; very mean and punitive. We are a very silly family and we joke a lot. Role<br/>\n&gt; playing games often times help kids see a different perspective.<br/>\n&gt;<br/>\n&gt; I love feeding my family. I am happy to feed them breakfast, lunch and<br/>\n&gt; dinner. I gave up making everyone eat at the same time and I am unwilling to<br/>\n&gt; keep warming food up. I understand that I am trying to accomodate the<br/>\n&gt; various needs in my family. How do I do that without abandoning my own<br/>\n&gt; needs? I feel resentful because I think I spend too much of my day catering<br/>\n&gt; to their food whims. I have started saying that I&#39;m happy to make something<br/>\n&gt; they want with them. Usually, they decline and either give up on that food<br/>\n&gt; or say that I should make it for them. Is it fair that I should do something<br/>\n&gt; for them that I don&#39;t necesarily want to do and they have no interest in<br/>\n&gt; helping?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; How old are your kids? If you have a microwave, teach them how to warm it up<br/>\n&gt; themselves. My 5 year old always wants me to do stuff for her but I am not<br/>\n&gt; always able to because she has 3 siblings and I work from home. So, I will<br/>\n&gt; talk her through doing things for herself. If she wants something heated up,<br/>\n&gt; I will talk her through getting a bowl and putting her food in the bowl and<br/>\n&gt; then putting it in the microwave and then pushing the correct buttons. If I<br/>\n&gt; am not in a position where I can do it for her or talk her through it, I<br/>\n&gt; will give her options of what to eat that she can prepare herself. If she is<br/>\n&gt; unwilling to do it herself, then she will have to wait until I am finished<br/>\n&gt; with what I am doing. I always try to make sure that there is food in the<br/>\n&gt; kitchen that she can get for herself. Sit down with the kids and have a<br/>\n&gt; brainstorming session of what they would like to eat and what they can<br/>\n&gt; prepare for themselves. My kids can do microwave popcorn by themselves so I<br/>\n&gt; make sure that we have it around all of the time. It might mean that you<br/>\n&gt; keep snack cakes around or even some cut up fruits and veggies that don&#39;t<br/>\n&gt; require any sort of preparation. Can they all reach the plates and eating<br/>\n&gt; utensils? Some of the lack of willingness can stem from being unable to<br/>\n&gt; physically access what they want. I do tell my kids no but I try to reserve<br/>\n&gt; those times for when I am truly busy and unable to do it. I will tell my<br/>\n&gt; kids to please come in the kitchen and help. I don&#39;t see anything wrong with<br/>\n&gt; that. However, if they are truly busy, I will do it for them because that is<br/>\n&gt; the way things work around here. We try to help each other out whenever we<br/>\n&gt; can. When do you feel the most resentful?<br/>\n&gt;<br/>\n&gt; There is nothing wrong with telling the kids how you feel. Whenever we have<br/>\n&gt; a situation that I don&#39;t know how to handle or that makes me feel resentful,<br/>\n&gt; I take it to the kids and ask them for ideas. If you see it as a chore and<br/>\n&gt; hate doing it, then why would your kids want to do it?<br/>\n&gt;<br/>\n&gt; Connie<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (10)<br/>\n&gt; 1d.<br/>\n&gt; Krabby Patties, Software Platform and Video games causing stress<br/>\n&gt; Posted by: &quot;Kelly&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kelly@...\">kelly@...</a>   dogsheeptiger<br/>\n&gt; Tue Nov 24, 2009 12:43 pm (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;&gt;Usually after he finishes a game he has a lot of pent up energy that he<br/>\n&gt; uses to fight with his brother, or act in a very excitable and annoying way.<br/>\n&gt; We have discussed with him some strategies to release this pent up energy<br/>\n&gt; after a game including going to the basement to jump, or play a sport. He<br/>\n&gt; hasn&#39;t followed through on that.&lt;&lt;<br/>\n&gt;<br/>\n&gt; I agree with the other responses posted so far. I also wondered how old your<br/>\n&gt; son is, as your approach might be different for a 5 year old than, say, a 10<br/>\n&gt; year old. I was also wondering, when you say &quot;he hasn&#39;t followed through on<br/>\n&gt; that,&quot; if you have helped him make the transition from game-time to physical<br/>\n&gt; play time. My now 6 year old daughter has been a pretty intense game player<br/>\n&gt; since she was 4 years old. We noticed right away how drained, stressed,<br/>\n&gt; upset she could be after playing non-stop all day. My husband or I would<br/>\n&gt; check in with her frequently, ask her questions about the game, hold her<br/>\n&gt; glass of water/juice with a straw in it up to her mouth so she could drink<br/>\n&gt; without stopping her game, and feed her bites of food so we were sure she<br/>\n&gt; was being nourished as she played. Honestly, I felt a little nutty doing<br/>\n&gt; this, but after reading so many posts on this subject (on this site) from<br/>\n&gt; people who had been there, I went with it. I&#39;m glad I did. Her gaming has<br/>\n&gt; been a very positive thing in her life, and by now, she is, for the most<br/>\n&gt; part, able to sense herself when she needs to eat/drink/take a break. Had I<br/>\n&gt; left it entirely up to her to follow suggestions we had talked about, I&#39;m<br/>\n&gt; not sure it would have gone this way. She was too young to take full<br/>\n&gt; responsibility for the follow-through. She felt supported in her interest,<br/>\n&gt; we helped her keep her humor so the draining effect was minimized, and when<br/>\n&gt; she was done, she had a mom and/or dad ready to play or snuggle, depending<br/>\n&gt; on her mood/needs.<br/>\n&gt;<br/>\n&gt; Kelly<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (10)<br/>\n&gt; 1e.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress<br/>\n&gt; Posted by: &quot;plaidpanties666&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>   plaidpanties666<br/>\n&gt; Tue Nov 24, 2009 4:13 pm (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt;<br/>\n&gt; wrote:<br/>\n&gt;&gt;Yes, bringing him food does help. However, it&#39;s only helpful to me if I<br/>\n&gt;&gt; bring veggies that are not going to make a huge mess. Otherwise, I end up<br/>\n&gt;&gt; with crumbs ground into our carpet.<br/>\n&gt; *********************<br/>\n&gt;<br/>\n&gt; Can you put a vinyl table cloth on the floor around where he&#39;s playing? We<br/>\n&gt; have a small plastic table that stays by the game-play chair that I<br/>\n&gt; periodically scrub down, but not every day. Its broad enough to catch most<br/>\n&gt; crumbs.<br/>\n&gt;<br/>\n&gt;&gt;&gt;Is it fair that I should do something for them that I don&#39;t necesarily<br/>\n&gt;&gt;&gt; want to do and they have no interest in helping?<br/>\n&gt; ********************<br/>\n&gt;<br/>\n&gt; Everything you do is a choice. You can choose to make food grudgingly, or<br/>\n&gt; refuse to make food equally grudgingly, and choose to have that sentiment be<br/>\n&gt; a part of your daily life. You can also choose to see what you do for your<br/>\n&gt; loved ones as gifts, acts of graciousness on your part. That&#39;s not something<br/>\n&gt; you choose just once and its done! It can be an ongoing effort to shift your<br/>\n&gt; thinking and awareness to being more gracious and giving.<br/>\n&gt;<br/>\n&gt; When you divide your life up into &quot;fair&quot; and &quot;not fair&quot; then life stinks.<br/>\n&gt; Life isn&#39;t fair! There&#39;s no balance, no equality in day to day life. That<br/>\n&gt; can be something to weigh you down, or it can be an opportunity to see life<br/>\n&gt; from a different perspective. When someone is needy, its a marvelous<br/>\n&gt; opportunity to be giving! to spread a little more love and kindness and<br/>\n&gt; goodness in the world. That&#39;s an Amazing gift! Its why some people devote<br/>\n&gt; their lives to charitable work, you know, so that they can have the gift of<br/>\n&gt; anothers neediness to uplift them. You can choose to be uplifted by the<br/>\n&gt; simplicity of bringing a snack to a hungry child.<br/>\n&gt;<br/>\n&gt; Toby, you sound like you feel really &quot;stuck&quot; right now - that you feel like<br/>\n&gt; you don&#39;t have a lot of control in your life. Its easy, when you&#39;re feeling<br/>\n&gt; stuck, to find ways to be resentful, but that also only intensifies that<br/>\n&gt; feeling of powerlessness. It builds and builds. Finding ways for you to feel<br/>\n&gt; more powerful in your life may be beyond the scope of this list. But you Do<br/>\n&gt; have the power to decide how you will be to your kids. You have the power to<br/>\n&gt; change the only thing anyone really has power over, your own self.<br/>\n&gt;<br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (10)<br/>\n&gt; 1f.<br/>\n&gt; Re: Krabby Patties, Software Platform and Video games causing stress<br/>\n&gt; Posted by: &quot;Schuyler&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>   schuyliz2<br/>\n&gt; Wed Nov 25, 2009 12:59 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;I love feeding my family. I am happy to feed them breakfast, lunch<br/>\n&gt; and dinner. I gave up making everyone eat at the same time and I am<br/>\n&gt; unwilling to keep warming food up. I understand that I am trying to<br/>\n&gt; accomodate the various needs in my family. How do I do that without<br/>\n&gt; abandoning my own needs? I feel resentful because I think I spend too<br/>\n&gt; much of my day catering to their food whims. I have started saying<br/>\n&gt; that I&#39;m happy to make something they want with them. Usually, they<br/>\n&gt; decline and either give up on that food or say that I should make it<br/>\n&gt; for them. Is it fair that I should do something for them that I don&#39;t<br/>\n&gt; necesarily want to do and they have no interest in helping?&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; It helps a lot if you retell the story. The story you&#39;ve told is of you the<br/>\n&gt; suffering cook who has to spend too much of your day catering to their food<br/>\n&gt; whims. It&#39;s easy to get overwhelmed by a story that has you chained to the<br/>\n&gt; kitchen fixing foods for whimsical folks. They get all the fun of whimsy and<br/>\n&gt; you get stuck with the labor of accomodating their whimsy. If you retell<br/>\n&gt; your story, if you see yourself as the one who is fueling their whimsy,<br/>\n&gt; making their flights of fancy possible, as the one who makes all the rest<br/>\n&gt; possible and happy and joyful and about the thing, then you get to be an<br/>\n&gt; active player in the story. And you can have your own fanciful flights. I<br/>\n&gt; had a blast making bento lunches for Linnaea and Simon for a bit. Making<br/>\n&gt; candy was also a momentary whimsy for me. Homemade bagels with wonderful<br/>\n&gt; toppings, platters that keep them and friends going for a while during<br/>\n&gt; intense and focused gaming, soy chai lattes with fantastic foam, challah, a<br/>\n&gt; deathly red velvet cake that oozed red pudding for halloween, lots of things<br/>\n&gt; that make us all smile. All my flights of fancy. And all of which helps to<br/>\n&gt; keep them from melting down post game when the focus wanes and they realize<br/>\n&gt; just how hungry they are. There was a study done on activity and eating<br/>\n&gt; patterns. Apparently mental activity takes more calories to maintain then<br/>\n&gt; physical activity. Your brain is your most expensive organ, even when you<br/>\n&gt; are exercising. So, gaming makes you hungry, really hungry. If your children<br/>\n&gt; are hungry they are much more likely to fight and be grouchy with everyone<br/>\n&gt; around them.<br/>\n&gt;<br/>\n&gt; You may also want to look for ways around your perspective that feeding him<br/>\n&gt; where he is can destroy the house and your day. I&#39;ve got crumbs ground in<br/>\n&gt; the carpet. Or I did, but we bought a steam cleaner the other day and I have<br/>\n&gt; been having a blast atomising dirt around the house with steam billowing up<br/>\n&gt; around me like the best haunted house dry ice machine can produce. But there<br/>\n&gt; are ways I could have avoided the crumbs if I were so inclined. I could have<br/>\n&gt; gotten a sheet to put down around where they were eating. I used to put down<br/>\n&gt; a plastic mat that we got from a Mister Donuts in Japan by using our<br/>\n&gt; customer loyalty card enough times. It was the same thing I&#39;d use if they<br/>\n&gt; were playing with playdoh. Thinking through the problem can help you to come<br/>\n&gt; up with more options than the no you&#39;ve given Joyce&#39;s suggestion.<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (10)<br/>\n&gt; 2.<br/>\n&gt; What your unschooled teen might choose to do...<br/>\n&gt; Posted by: &quot;usoah1841&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erw@...\">erw@...</a>   usoah1841<br/>\n&gt; Tue Nov 24, 2009 4:59 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We love, love, love Kelly&#39;s 3 stages of unschooling.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages\">http://sandradodd.com/kellylovejoy/stages</a><br/>\n&gt; Whether it is listening to language tapes from the library, or taking a<br/>\n&gt; college course, it is always about choice. Check out the contest at this<br/>\n&gt; site.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ed.gov/iamwhatilearn/index.html\">http://www.ed.gov/iamwhatilearn/index.html</a><br/>\n&gt; Andrew has been out of school since 4th grade.<br/>\n&gt; Andrew&#39;s video starts in the mist and has all things that he loves,<br/>\n&gt; Filmmaking, piano, French and of course his buds (both public school friends<br/>\n&gt; and homeschool friends). RabidSquirrelMovies<br/>\n&gt;<br/>\n&gt; There is at least one other homeschooler in the top ten.<br/>\n&gt; Those so inclined can vote up to once a day. Those who like to network can<br/>\n&gt; share the link. What a beautiful irony if an unschooler won a Department of<br/>\n&gt; Education contest : )<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Beth in MD<br/>\n&gt; (AKA Proud mama of 21yos, 17yos and 14yod)<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (1)<br/>\n&gt; 3a.<br/>\n&gt; Re: making home more fun<br/>\n&gt; Posted by: &quot;AllisonR&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:earlyhiker@...\">earlyhiker@...</a>   earlyhiker<br/>\n&gt; Tue Nov 24, 2009 7:23 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Joyce, you are like a big on-line shoulder...or hug! What a lovely<br/>\n&gt; perspective. I always enjoy your comments.<br/>\n&gt; Danke,<br/>\n&gt; Allison<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (20)<br/>\n&gt; 3b.<br/>\n&gt; Re: making home more fun<br/>\n&gt; Posted by: &quot;Rebecca Sanjabi&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thystle@...\">thystle@...</a>   rtsanjabi<br/>\n&gt; Tue Nov 24, 2009 11:25 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Nov 24, 2009, at 2:00 AM, Joyce Fetteroll wrote:<br/>\n&gt;&gt; So as National Novel Writing Month draws to a close and people are<br/>\n&gt;&gt; feverishly trying to get out 50,000 words before midnight November<br/>\n&gt;&gt; 30th it&#39;s an appropriate time to send out kudos to all the people who<br/>\n&gt;&gt; do take a huge chunk of time from their lives to share their<br/>\n&gt;&gt; unschooling thoughts and help people all year long :-)<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt; Yes! Yes! Yes! Thank you, thank you, thank you! (You being Joyce and<br/>\n&gt; everyone else who so patiently keep posting) Also something I am<br/>\n&gt; considering as Thanksgiving nears.<br/>\n&gt;<br/>\n&gt; With much gratitude,<br/>\n&gt;<br/>\n&gt; Rebecca<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (20)<br/>\n&gt; 3c.<br/>\n&gt; Re: making home more fun<br/>\n&gt; Posted by: &quot;Deb Lewis&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>   deborahkmlewis<br/>\n&gt; Tue Nov 24, 2009 4:14 pm (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ***Yes, bringing him food does help. However, it&#39;s only helpful to me if I<br/>\n&gt; bring<br/>\n&gt; veggies that are not going to make a huge mess. Otherwise, I end up with<br/>\n&gt; crumbs<br/>\n&gt; ground into our carpet. ***<br/>\n&gt;<br/>\n&gt; Go get one of those cheap thirty-nine dollar 5x8 rugs from K-mart and put it<br/>\n&gt; under his chair.<br/>\n&gt; Or put down an old sheet and shake the crumbs out outside.<br/>\n&gt; Or make a canvas floorcloth to put over the carpet, crumbs sweep right up.<br/>\n&gt; Or put down a paint drop cloth and throw the thing away when he&#39;s done.<br/>\n&gt; Or tear the carpet out and put some vinyl down so you can sweep.<br/>\n&gt; Or move the game station to a room without carpet.<br/>\n&gt;<br/>\n&gt; Carpet should not be more important than your kid. I know it&#39;s not and you<br/>\n&gt; know it&#39;s not so that shouldn&#39;t be an excuse anymore for not taking him food<br/>\n&gt; you know he&#39;ll eat.<br/>\n&gt;<br/>\n&gt; ***He completely ignored me. ***<br/>\n&gt;<br/>\n&gt; He&#39;s not making a judgment about the value of what you have to say, he&#39;s<br/>\n&gt; busy. He&#39;s engrossed. Any person deeply engrossed in work or play can miss<br/>\n&gt; information coming from the outside. Lot&#39;s of times a very busy person<br/>\n&gt; thinks he&#39;ll respond in a second when he&#39;s finished a particular task but<br/>\n&gt; then some other task comes up and the seconds turn into minutes.<br/>\n&gt; If you could change the way you see him - see him as a person who&#39;s really<br/>\n&gt; involved in something interesting and not as a person who&#39;s ignoring you, it<br/>\n&gt; will help. Don&#39;t take it personally.<br/>\n&gt;<br/>\n&gt; ***After ignoring me again, I turned off the TV.***<br/>\n&gt;<br/>\n&gt; None of us are at our best when we&#39;re sick. But if it&#39;s something you&#39;ve<br/>\n&gt; done before consider whether you would have done that to an adult? If you<br/>\n&gt; put your relationship with your son above video games, carpet and food<br/>\n&gt; you&#39;ll find more ways to approach some problems and you&#39;ll find that some<br/>\n&gt; things aren&#39;t problems at all.<br/>\n&gt;<br/>\n&gt; ***If I had left the matter<br/>\n&gt; alone, he might have gotten hungry in an hour or so. At that point, he would<br/>\n&gt; have come looking to me for food and I would have felt resentful.***<br/>\n&gt;<br/>\n&gt; There were more choices than turning off the TV or feeling resentful.<br/>\n&gt; You might have taken the food to the kids. You might have left it in the<br/>\n&gt; microwave with a note to reheat if they found their way to the kitchen. You<br/>\n&gt; might have left other easy food available for them or you might have decided<br/>\n&gt; to feed him if he turned up looking for food. Food is about nourishment.<br/>\n&gt; It&#39;s not about the lunch hour. You might have called a friend over to hang<br/>\n&gt; out with the kids while you got some rest. You might have chosen not to be<br/>\n&gt; resentful (not always easy when we&#39;re sick, I know, but always worth the<br/>\n&gt; effort) At the risk of stating what is very obvious - we control our<br/>\n&gt; emotions, they don&#39;t control us. We have a choice about how we feel and how<br/>\n&gt; we act on our feelings.<br/>\n&gt;<br/>\n&gt; ***I don&#39;t want to prepare numerous meals around everyone&#39;s different<br/>\n&gt; schedules. ***<br/>\n&gt;<br/>\n&gt; Something I started doing at about the time Dylan was staying up later at<br/>\n&gt; night than I wanted to stay up was getting a few different foods ready so<br/>\n&gt; that he could grab something easily if he was hungry.<br/>\n&gt; I might have made salad and put it in single serving containers that he<br/>\n&gt; could just grab and go back to whatever he was doing. Or put some food in a<br/>\n&gt; microwavable container so he could heat it up. Or leave the microwave<br/>\n&gt; popcorn on the counter. Or make a few sandwiches and leave them in the<br/>\n&gt; fridge with notes on them. I&#39;d wash and cut up fruit and vegetables and put<br/>\n&gt; them in bowls so he could just snag a bowl and eat. I still do that. David<br/>\n&gt; (dh) is getting home about six hours after Dylan and I eat and sometimes<br/>\n&gt; after I&#39;ve gone to bed. I leave a plate of food in the fridge with a note on<br/>\n&gt; it about microwave or oven temps, or set the oven to preheat just before dh<br/>\n&gt; gets home so he can just slide the food right in. And Dylan stays up very<br/>\n&gt; late and gets hungry in the early morning hours so I make sure there&#39;s food<br/>\n&gt; ready for him to grab or reheat without much effort.<br/>\n&gt;<br/>\n&gt; ***I think I spend too much of my day catering to their food whims.***<br/>\n&gt;<br/>\n&gt; Did you write that you started your own catering business? Are you willing<br/>\n&gt; to cater to the food whims of strangers but feel your children are asking<br/>\n&gt; too much of you?<br/>\n&gt; It really seems like you have some issues with unmet needs of your own. You<br/>\n&gt; can blow your kids childhood trying to help yourself feel better - and you<br/>\n&gt; never will if your self soothing comes at the expense of your kids- or you<br/>\n&gt; can address it now and decide to be the kind and generous parent you should<br/>\n&gt; have had and that your kids deserve.<br/>\n&gt;<br/>\n&gt; *** Is it fair that I should do something for them that I don&#39;t necessarily<br/>\n&gt; want to do and they have no interest in helping?***<br/>\n&gt;<br/>\n&gt; You&#39;re their mom. They&#39;re your children. You should want to do for them and<br/>\n&gt; if you don&#39;t and can&#39;t find a way to want to, then unschooling really won&#39;t<br/>\n&gt; work for you. Are you chronically ill? If so, would it be possible to get<br/>\n&gt; some help, maybe through your church if you have one and can&#39;t afford a<br/>\n&gt; mother&#39;s helper.<br/>\n&gt;<br/>\n&gt; Being a mom is not about what&#39;s fair. You can choose to be resentful or you<br/>\n&gt; can choose anything else. You can choose to leave your family tomorrow. You<br/>\n&gt; made a choice to have kids and to keep them and now you can make a choice<br/>\n&gt; about the kind of mom you&#39;re going to be. A resentful mom who is more<br/>\n&gt; interested in herself than in her kids isn&#39;t the best choice. If you&#39;re sick<br/>\n&gt; it&#39;s really easy to focus on yourself and feel needy and if that&#39;s the case<br/>\n&gt; get some help around the house and find someone who&#39;s willing to come play<br/>\n&gt; with the kids. If your feelings are rooted in the way you were parented and<br/>\n&gt; how your needs as a child were neglected (if they were) then you can address<br/>\n&gt; that so that you don&#39;t put those same feelings of neediness and resentment<br/>\n&gt; into your own children.<br/>\n&gt;<br/>\n&gt; Unfair is a child who had no choice about being born, no choice about what<br/>\n&gt; kind of parents he got, no right to pick different parents if the parents he<br/>\n&gt; has are not emotionally ready to be really good parents. Adults have all the<br/>\n&gt; choices in the parent child relationship.<br/>\n&gt;<br/>\n&gt; Doing things for your kids can fill you up emotionally and can help heal<br/>\n&gt; your own emotional hurts in some ways, but if your emotional maturity is<br/>\n&gt; stuck somewhere in childhood your needs are going to get in the way of<br/>\n&gt; meeting your kids needs. That might be more than this list can help with but<br/>\n&gt; there might be something useful here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/attitude\">http://sandradodd.com/attitude</a> ,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a> , <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/change/\">http://sandradodd.com/change/</a> ,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a> , <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/mama\">http://sandradodd.com/peace/mama</a><br/>\n&gt;<br/>\n&gt; Sandra Dodd once wrote about a concept called re-parenting that she had<br/>\n&gt; heard about through Adult Children of Alcoholics. In one version adults<br/>\n&gt; address unmet childhood needs by parenting a teddy bear in the loving, sweet<br/>\n&gt; way wish their parents would have treated them . Sandra and others have<br/>\n&gt; written often about parents with unmet needs helping to heal themselves<br/>\n&gt; through gentle, respectful parenting - same concept, be the parent you wish<br/>\n&gt; you would have had.<br/>\n&gt;<br/>\n&gt; Deb Lewis<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (20)<br/>\n&gt; 4.<br/>\n&gt; Re: making home more fun was How to prepare for school?<br/>\n&gt; Posted by: &quot;Deb Lewis&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>   deborahkmlewis<br/>\n&gt; Tue Nov 24, 2009 11:22 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ***but it always seems<br/>\n&gt; like I have to push him (gently) to do something.***<br/>\n&gt;<br/>\n&gt; It sounds like you&#39;re not fully seeing the value in his choice to play video<br/>\n&gt; games and so are working to get him to do something else. It&#39;s ok for him to<br/>\n&gt; like and to very often choose video games. It would not be great if video<br/>\n&gt; games were his only good option. People recommend parents offer things they<br/>\n&gt; know a child likes, not because there&#39;s something wrong with video games(or<br/>\n&gt; other big interests) but because without a parent&#39;s help a child might not<br/>\n&gt; be able to see or get to all the other things there are to choose from.<br/>\n&gt;<br/>\n&gt; ***He doesn&#39;t like to go to<br/>\n&gt; unschooling events even though he seems to enjoy parts of them (like making<br/>\n&gt; goop). ***<br/>\n&gt;<br/>\n&gt; My son wouldn&#39;t have liked events with a bunch of other people.(even if<br/>\n&gt; there had been unschooling events for us) He much preferred to be home or<br/>\n&gt; out exploring with me. If he wanted to be with friends one or two was the<br/>\n&gt; preference. Some people are not event or group people.&lt;g&gt; And you can make<br/>\n&gt; goop together at home if he likes that.<br/>\n&gt;<br/>\n&gt; *** I think the main problem is trying to find something we both would love<br/>\n&gt; to do.***<br/>\n&gt;<br/>\n&gt; There might not be many things you enjoy the way an eight year old boy<br/>\n&gt; would. You can stretch more and do things you know he loves even if you&#39;re<br/>\n&gt; not wild about them. Schuyler Waynforth recently wrote about how she has<br/>\n&gt; come to enjoy the things her kids love by seeing their enjoyment. Even if<br/>\n&gt; you don&#39;t love the activity, if you participate, watch your kids and see<br/>\n&gt; what they love about it, your appreciation for the thing will grow. Don&#39;t<br/>\n&gt; wait to be interested in the same things. Your kids aren&#39;t waiting. You<br/>\n&gt; don&#39;t get another chance to be the fun mom of this eight year old. He<br/>\n&gt; doesn&#39;t get another chance to have a fun mom if you&#39;re not it.<br/>\n&gt;<br/>\n&gt; It is great to have your own interests. That&#39;s part of what makes you an<br/>\n&gt; interesting person but if you&#39;re doing what you&#39;re interested in, waiting to<br/>\n&gt; get interesting in something he&#39;s doing, that&#39;s not enough. You need to be<br/>\n&gt; involved with what he&#39;s doing, develop an appreciation for it by watching<br/>\n&gt; him and seeing what he loves. And even if you never love bionicles or legos<br/>\n&gt; or video games you can love your son&#39;s enjoyment.<br/>\n&gt;<br/>\n&gt; ***Besides my worry over his development, our life has been pretty peaceful<br/>\n&gt; and<br/>\n&gt; enjoyable lately but I wouldn&#39;t call it fun.***<br/>\n&gt;<br/>\n&gt; Are you referring to your fun or his? Is he happy playing video games? If<br/>\n&gt; he&#39;s content then that&#39;s good. Continue to offer other things - without<br/>\n&gt; pushing. Don&#39;t offer what you think would be good for him to do, offer what<br/>\n&gt; you know he&#39;ll like. Don&#39;t offer because *you* want him to want to do<br/>\n&gt; something different. If video games aren&#39;t his only good option then he&#39;s<br/>\n&gt; choosing them because he&#39;s getting something out of them. If you&#39;re still<br/>\n&gt; struggling with your feelings about video games, hang out with him when he&#39;s<br/>\n&gt; playing. Play them too.<br/>\n&gt;<br/>\n&gt; *** fun things to do for quiet video loving boys...***<br/>\n&gt;<br/>\n&gt; Dylan liked to talk to me about his games (and he&#39;d make up stories about<br/>\n&gt; the game characters and tell me those stories) so maybe you can make it<br/>\n&gt; really convenient for him to talk with you if you&#39;re making dinner or<br/>\n&gt; whatever. I got a stool for Dylan to sit on beside me in the kitchen.<br/>\n&gt;<br/>\n&gt; When your son plays with his guys, sit and play with him or just sit and let<br/>\n&gt; him act out the play for you. Be his audience.<br/>\n&gt;<br/>\n&gt; Does he like movies and are their movies based on the games he likes or<br/>\n&gt; movies with similar themes? We used to make a big deal about movies, have<br/>\n&gt; special food, either platters or popcorn or his favorite cookies or<br/>\n&gt; something. We&#39;d sometimes fold out the hide-a-bed sofa and flop there with<br/>\n&gt; all our goodies and watch a movie, or put up Dylan&#39;s little tent and snuggle<br/>\n&gt; in there with pillows and blankets. Dylan is seventeen and a movie at home<br/>\n&gt; is still an event. We make a plan, we settle in with just the right food or<br/>\n&gt; snack. It&#39;s a lovely time together.<br/>\n&gt;<br/>\n&gt; Does he like to browse book stores? Some play loud music but if you go<br/>\n&gt; during hours when most people are at work or school the stores are less busy<br/>\n&gt; and you can sit around and read or run around and check everything out.<br/>\n&gt; Comic book stores? When Dylan was into writing stories we found a comic book<br/>\n&gt; store that would publish kids comics and put them for sale in their store.<br/>\n&gt;<br/>\n&gt; You said he doesn&#39;t enjoy events much but would he enjoy going out with you?<br/>\n&gt; Dylan liked to go for walks, liked to find places to explore (culverts under<br/>\n&gt; roadways, dark places under bridges -he was Troll Boy&lt;g&gt;)<br/>\n&gt; We&#39;d go out for French fries, go roam museums, the parks, junk stores, art<br/>\n&gt; galleries, vacant lots, the cemetery...<br/>\n&gt;<br/>\n&gt; We liked hiking and snowshoeing, quiet and wonderful.<br/>\n&gt;<br/>\n&gt; We sometimes rent Forest Service cabins for a weekend. Cheap fun!&lt;g&gt;<br/>\n&gt;<br/>\n&gt; We went swimming when there was no one else at the pool. There are a lot of<br/>\n&gt; things you can do together in the off hours when there&#39;re aren&#39;t crowds of<br/>\n&gt; people around.<br/>\n&gt;<br/>\n&gt; And if he really doesn&#39;t like to leave home stay home and play video games<br/>\n&gt; with him or watch him play. If you watch or participate you&#39;ll have a lot to<br/>\n&gt; talk about. It will help you find other games he might enjoy and help you<br/>\n&gt; find movies or books or toys he&#39;ll like.<br/>\n&gt;<br/>\n&gt; Do you have a yard and can you build a fire outside? Fires are fun to poke<br/>\n&gt; with a stick, roast marshmallows or hot dogs - a nice quite activity.<br/>\n&gt;<br/>\n&gt; Put up a tent in your yard. Put some chairs and cots in there.<br/>\n&gt;<br/>\n&gt; Get a trampoline.<br/>\n&gt;<br/>\n&gt; What you do will depend on what your kid enjoys. How you do the everyday<br/>\n&gt; little things is important. How interested you are in what your kids are<br/>\n&gt; doing, how interesting you are, those are the things that make the<br/>\n&gt; atmosphere of a home joyful and happy.<br/>\n&gt;<br/>\n&gt; ***Besides my worry over his development...***<br/>\n&gt;<br/>\n&gt; Are you worried because of the video games? Read here again if it&#39;s been<br/>\n&gt; awhile: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/\">http://sandradodd.com/videogames/</a><br/>\n&gt;<br/>\n&gt; ***... with mothers who have almost no patience for technology (hence the<br/>\n&gt; reason for my rare postings) ***<br/>\n&gt;<br/>\n&gt; Technology is a big part of the world your children will live in their whole<br/>\n&gt; lives. You might still live without a lot of technology but you&#39;d have to go<br/>\n&gt; far to find a place and you&#39;d have to take a car or train or plane to get<br/>\n&gt; there.&lt;g&gt; You&#39;ll still need a shovel if you&#39;re going to grow your own food<br/>\n&gt; and an axe if you&#39;re going to keep yourself warm and build a shelter. Maybe<br/>\n&gt; you&#39;ll never be a person who has to have all the latest gadgets but don&#39;t<br/>\n&gt; overlook a big part of the world your kid obviously enjoys. Get at least<br/>\n&gt; comfortable enough with it that you can really appreciate your son&#39;s<br/>\n&gt; interests.<br/>\n&gt;<br/>\n&gt; Unschooling doesn&#39;t happen automatically when you decide not to send a kid<br/>\n&gt; to school and not to have school at home. It takes work and commitment on<br/>\n&gt; the part of at least one parent. It requires deep involvement with kids and<br/>\n&gt; what they&#39;re doing and it often means putting off for awhile or scaling back<br/>\n&gt; our own pursuits in order to be available to our kids.<br/>\n&gt;<br/>\n&gt; Deb Lewis<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (1)<br/>\n&gt; 5a.<br/>\n&gt; Re: making home more fun/ kids in school<br/>\n&gt; Posted by: &quot;Toby Rosenberg&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:philipntoby@...\">philipntoby@...</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:philipntoby@...\">philipntoby@...</a><br/>\n&gt; Tue Nov 24, 2009 11:27 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thank you You are right about my dh Now he is planning to put my other son<br/>\n&gt; in school too. I am very sad. I am trying to figure out how to support my<br/>\n&gt; children.<br/>\n&gt; I&#39;m having a hard time dealing with it because they say they want to go, but<br/>\n&gt; they don&#39;t want to do the things they need to do to get there (go to bed<br/>\n&gt; early and get themselves ready in the morning) I have a lot of resentment<br/>\n&gt; towards my dh because he wants them in school but he doesnt&#39; want to be<br/>\n&gt; consistent about their bedtimes and then I&#39;m the one dealing with cranky<br/>\n&gt; children in the morning.<br/>\n&gt;<br/>\n&gt; I guess I&#39;ve started a new thread with this last paragraph. I guess my<br/>\n&gt; question here is how to be a good unschooling parent to your children when<br/>\n&gt; their father has chosen school for them? How do I balance being supportive<br/>\n&gt; without doing everything for them? For example, if I was a parent that<br/>\n&gt; wanted my children in school, I would dress them in the morning when they<br/>\n&gt; are too tired to get ready. I feel too resentful doing that under these<br/>\n&gt; circumstances.<br/>\n&gt;<br/>\n&gt; Thanks<br/>\n&gt;<br/>\n&gt; Toby<br/>\n&gt;<br/>\n&gt; --- On Mon, 11/23/09, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; From: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt;<br/>\n&gt; Subject: [unschoolingbasics] Re: making home more fun<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Date: Monday, November 23, 2009, 1:30 PM<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In unschoolingbasics@ yahoogroups. com, Toby Rosenberg &lt;philipntoby@<br/>\n&gt; ....&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; Thank you for your comments. The &quot;issues&quot; I have are definitely more mine<br/>\n&gt;&gt; than my kids. One thought I have is that I I feel like I I&#39;ve failed<br/>\n&gt;&gt; because 2 of my children have chosen to go to school.<br/>\n&gt; ************ *****<br/>\n&gt;<br/>\n&gt; But your dh is part of that issue, right? He&#39;s putting pressure on the kids<br/>\n&gt; to &quot;want&quot; school - the pressure of his approval. Not saying that to get you<br/>\n&gt; mad at your dh, but its not a cut and dried situation.<br/>\n&gt;<br/>\n&gt;&gt;&gt;I think, oh, other people are having way more fun so that&#39;s what I must be<br/>\n&gt;&gt;&gt; doing wrong.<br/>\n&gt; ************ ******<br/>\n&gt;<br/>\n&gt; Making home more &quot;fun&quot; than school is like saying to make it more fun than a<br/>\n&gt; trip to the dentist! Its more a matter of being engaged with kids, in ways<br/>\n&gt; and to the extent that they want, of providing opportunities rather than<br/>\n&gt; pushing them.<br/>\n&gt;<br/>\n&gt; Winter holidays are coming up, so look for ways to make home cozy and<br/>\n&gt; attractive to all your kids. Maybe not with the intent of &quot;winning them<br/>\n&gt; over&quot; since there are other forces at work than their own desires but in<br/>\n&gt; terms of making home a place where everyone can relax and enjoy themselves.<br/>\n&gt;<br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (20)<br/>\n&gt; 5b.<br/>\n&gt; Re: making home more fun/ kids in school<br/>\n&gt; Posted by: &quot;plaidpanties666&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>   plaidpanties666<br/>\n&gt; Tue Nov 24, 2009 4:04 pm (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt;<br/>\n&gt; wrote:<br/>\n&gt;&gt;I guess my question here is how to be a good unschooling parent to your<br/>\n&gt;&gt; children when their father has chosen school for them?<br/>\n&gt; *******************<br/>\n&gt;<br/>\n&gt; Step away from the word unschooling. Work on being a supportive, caring<br/>\n&gt; parent, period.<br/>\n&gt;<br/>\n&gt;&gt;&gt;How do I balance being supportive without doing everything for them?<br/>\n&gt;<br/>\n&gt; Why does there need to be balance? Do everything they want as much as you<br/>\n&gt; possibly can! But do everything they want joyfully, as a gift to them, not<br/>\n&gt; grudgingly or they&#39;ll want more and more - because the action is merely a<br/>\n&gt; vehicle for the underlying love and attention! When you bring a sandwich<br/>\n&gt; grudgingly you make that need bigger, and create a situation where they<br/>\n&gt; never seem to get &quot;enough&quot;.<br/>\n&gt;<br/>\n&gt;&gt;&gt;For example, if I was a parent that wanted my children in school, I would<br/>\n&gt;&gt;&gt; dress them in the morning when they are too tired to get ready. I feel<br/>\n&gt;&gt;&gt; too resentful doing that under these circumstances.<br/>\n&gt; ***********************<br/>\n&gt;<br/>\n&gt; Why can&#39;t you dress them lovingly anyway? Because you resent their father?<br/>\n&gt; That&#39;s cruel. Don&#39;t drag your kids into that.<br/>\n&gt;<br/>\n&gt; This is going back to what I said in another post about being stuck.<br/>\n&gt; Regardless of how much control you have over your kids&#39; lives, you at the<br/>\n&gt; very least can control how you interact with them. You don&#39;t Have to let<br/>\n&gt; your disappointment over not having the life you imagined get in the way of<br/>\n&gt; that.<br/>\n&gt;<br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (20)<br/>\n&gt; 5c.<br/>\n&gt; Re: making home more fun/ kids in school<br/>\n&gt; Posted by: &quot;theburkemommy&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:theburkemommy@...\">theburkemommy@...</a>   theburkemommy<br/>\n&gt; Tue Nov 24, 2009 4:57 pm (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; It&#39;s not the kids&#39; fault that their dad has chosen school for them. If you&#39;d<br/>\n&gt; do something to help them get ready for school if school was your idea, then<br/>\n&gt; I would suggest doing those same things for them now. I can totally<br/>\n&gt; understand being resentful, but it&#39;s not loving and supportive to not help<br/>\n&gt; them.<br/>\n&gt;<br/>\n&gt; Can you help them come up with a bedtime routine, so they can get to bed at<br/>\n&gt; a decent time each night? You could make each evening into a really sweet<br/>\n&gt; time with them. If they&#39;re not wanting to go to bed early enough to be well<br/>\n&gt; rested, just try to make the house a calm place to be each evening. Turn the<br/>\n&gt; lights lower, turn volume lower, light some lavender candles around the<br/>\n&gt; house, etc.<br/>\n&gt;<br/>\n&gt; If they still stay up so late that they have a hard time getting ready in<br/>\n&gt; the morning...then help them get dressed, etc. You can pack their backpacks<br/>\n&gt; and lunches the night before. You can help them pick out their clothes<br/>\n&gt; before they go to bed. You could have quick and easy breakfast options<br/>\n&gt; available. You could take them to school in the morning, so they don&#39;t have<br/>\n&gt; to be ready early enough to catch the bus.<br/>\n&gt;<br/>\n&gt; You can still make home a great place to be! Hopefully your dh will change<br/>\n&gt; his mind over time.<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt;<br/>\n&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; Thank you You are right about my dh Now he is planning to put my other son<br/>\n&gt;&gt; in school too. I am very sad. I am trying to figure out how to support my<br/>\n&gt;&gt; children.<br/>\n&gt;&gt; I&#39;m having a hard time dealing with it because they say they want to go,<br/>\n&gt;&gt; but they don&#39;t want to do the things they need to do to get there (go to<br/>\n&gt;&gt; bed early and get themselves ready in the morning) I have a lot of<br/>\n&gt;&gt; resentment towards my dh because he wants them in school but he doesnt&#39;<br/>\n&gt;&gt; want to be consistent about their bedtimes and then I&#39;m the one dealing<br/>\n&gt;&gt; with cranky children in the morning.<br/>\n&gt;&gt; Â<br/>\n&gt;&gt; I guess I&#39;ve started a new thread with this last paragraph. I guess my<br/>\n&gt;&gt; question here is how to be a good unschooling parent to your children when<br/>\n&gt;&gt; their father has chosen school for them? How do I balance being supportive<br/>\n&gt;&gt; without doing everything for them? For example, if I was a parent that<br/>\n&gt;&gt; wanted my children in school, I would dress them in the morning when they<br/>\n&gt;&gt; are too tired to get ready. I feel too resentful doing that under these<br/>\n&gt;&gt; circumstances.<br/>\n&gt;&gt; Â<br/>\n&gt;&gt; Thanks<br/>\n&gt;&gt; Â<br/>\n&gt;&gt; Toby<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (20)<br/>\n&gt; 6a.<br/>\n&gt; weight gain<br/>\n&gt; Posted by: &quot;meadowgirl11&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tamithameadow@...\">tamithameadow@...</a>   meadowgirl11<br/>\n&gt; Tue Nov 24, 2009 11:27 am (PST)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Okay, I have been stewing on this awhile and wanting to see if things would<br/>\n&gt; resolve on their own, but they don&#39;t seem to be so here I am. I haven&#39;t<br/>\n&gt; really posted I don&#39;t think, but I have 2 kids, Terran, 9, who was in school<br/>\n&gt; until last year around this time, and Asha, 1. Terran has been much happier<br/>\n&gt; since we started unschooling, but has had a pretty intense response to<br/>\n&gt; lifting food and media restrictions. He has gone up almost 30lbs in the last<br/>\n&gt; 10 months, at age 9 this is a lot of weight for him. I think it definitely<br/>\n&gt; has to do with the sudden freedom, but there really wasn&#39;t any option of<br/>\n&gt; easing into things, or didn&#39;t seem to be at the time, with him throwing<br/>\n&gt; tantrums about any kind of controls. Anyway, whether or not I jumped too<br/>\n&gt; quickly, he now chooses to do very little physical activity. He quit karate,<br/>\n&gt; soccer and swimming lessons, doesn&#39;t like to walk or ride his bike, doesn&#39;t<br/>\n&gt; want to go play outdoors, etc. He characterizes himself as &quot;lazy&quot; and calls<br/>\n&gt; himself fat. He didn&#39;t get this from me, and when he says it I simply<br/>\n&gt; acknowledge the weight gain, assure him that I don&#39;t think he is fat, just a<br/>\n&gt; bit chubby and ask how he feels about it, to which he says he doesn&#39;t care.<br/>\n&gt; He ate all his halloween candy, a huge bag, in 6 days, and will often eat<br/>\n&gt; ice cream, candy or other sweets first thing in the morning and continue<br/>\n&gt; throughout the day, even when I am really conscientious about providing him<br/>\n&gt; with other foods when he seems hungry. His favored activities are all<br/>\n&gt; sedentary, reading, watching anime, playing video games and building lego.<br/>\n&gt; He used to be active and energetic and now he complains about walking up<br/>\n&gt; stairs or having to walk pretty much anywhere.<br/>\n&gt;<br/>\n&gt; He also used to be a diverse, healthy eater,even better than I was. He would<br/>\n&gt; eat lots of veggies, homemade soups and sauces, salad, whole grains, ethnic<br/>\n&gt; foods. Now he wants kraft dinner and processed foods, or fast food and will<br/>\n&gt; pretty much demand that he get it. He used to sneak sweets and treats<br/>\n&gt; before, which were limited at home, which is why I pretty much felt I had to<br/>\n&gt; just jump into no restrictions, I didn&#39;t want him to keep sneaking, which<br/>\n&gt; always felt terrible for me.<br/>\n&gt;<br/>\n&gt; I have always been a bit overweight and an emotional eater, sweet tooth<br/>\n&gt; person and I know I am neither a great model nor very rational when it comes<br/>\n&gt; to food, although I actually eat pretty well now for the most part and enjoy<br/>\n&gt; a lot of healthy whole foods and try to eat organic, mostly vegetarian<br/>\n&gt; homemade food as much as possible. His dad (my ex) is also heavier, and<br/>\n&gt; still controls Terran&#39;s food when he is there, which is thankfully not that<br/>\n&gt; often. I don&#39;t want Terran to suffer either the health or social<br/>\n&gt; consequences of being overweight like I and his dad both did.<br/>\n&gt;<br/>\n&gt; My approach to all of this has probably not been very good. I try to give<br/>\n&gt; him factual information about the nutritional value, etc of his food<br/>\n&gt; choices, but it ends up sounding like a lecture (he says I lecture a lot, I<br/>\n&gt; think because it feels like I have no influence at all now that there aren&#39;t<br/>\n&gt; rules and restrictions). I try to encourage him to be active and to provide<br/>\n&gt; opportunities for that, but even the things he has chosen like gymnastics he<br/>\n&gt; often balks at when it is actually time to go. I feel like I have basically<br/>\n&gt; created a couch potato. Now if I even suggest he not eat something, he<br/>\n&gt; practically snarls at me to protect his food. He&#39;s never been deprived of<br/>\n&gt; food and we still had treats and sweets often enough, more often than a lot<br/>\n&gt; of people really, so I don&#39;t understand his intensity about food at all. He<br/>\n&gt; never wants to share and gets upset if I even suggest he let his sister have<br/>\n&gt; a bit of what he&#39;s eating. I thought unschooling would make his world bigger<br/>\n&gt; and more interesting, but instead it seems to get smaller and smaller all<br/>\n&gt; the time, his food choices, his activity choices, everything.<br/>\n&gt;<br/>\n&gt; I feel sad and confused and actually pretty guilty about where things are at<br/>\n&gt; with him right now. Is there anyone who has been through this kind of thing<br/>\n&gt; with some insight? Keep in mind that Terran is what you might call intense,<br/>\n&gt; everything is a big deal, big emotions, big focus when he is interested in<br/>\n&gt; something, big will when he doesn&#39;t want to do something.<br/>\n&gt; So what can I do to support him to make choices without leaving him to go<br/>\n&gt; crazy and possibly cause real harm to himself?<br/>\n&gt;<br/>\n&gt; Thanks for reading, sorry its so long.<br/>\n&gt;<br/>\n&gt; Tammy<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Back to top<br/>\n&gt; Reply to sender | Reply to group | Reply via web post<br/>\n&gt; Messages in this topic (9)<br/>\n&gt; 6b.<br/>\n<br/>\n </span></blockquote>-- <br/>\nSent from my mobile device<br/>\n<br/>\n<br/>\nCome visit digital template store:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://shop.scrapbookgraphics.com/manufacturers.php?manufacturerid=54\">http://shop.scrapbookgraphics.com/manufacturers.php?manufacturerid=54</a></div>","specialLinks":[]}],"prevTopicId":42317,"nextTopicId":42336}}