{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":86288922,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;s-lp@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction LONG!","postDate":"1087108304","msgId":680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjEwMWM0NTExMCQxOGNjMTExMCQ2NTAxYThjMEBmbG9zc2llPg==","referencesHeader":"PDBIWjYwMDgyVFg2UVI4MDBAbC1kYWVtb24+"},"prevInTopic":668,"nextInTopic":0,"prevInTime":679,"nextInTime":681,"topicId":586,"numMessagesInTopic":0,"msgSnippet":"Hi Robyn, ... veg ... with ... a ... To be honest it had as much to do with my need for time alone and peace and quiet as much as hers, all I did was follow","messageBody":"<div id=\"ygrps-yiv-1357819784\">Hi Robyn,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;Today she went to watch it in her dad&#39;s office after her grandma left<br/>\n&gt; from a two week visit and I saw that this might have been a need to just<br/>\n </span></blockquote>veg<br/>\n<blockquote><span title=\"ireply\"> &gt; out and get over her sadness at the goodbye and was much more at peace<br/>\n </span></blockquote>with<br/>\n<blockquote><span title=\"ireply\"> &gt; it than before.&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; This is such a great insight for you to have. I have noticed that Jayn 4.5<br/>\n&gt; sometimes wants to watch for longer and with more apparent attention after<br/>\n </span></blockquote>a<br/>\n<blockquote><span title=\"ireply\"> &gt; period when she has had a lot of interaction with other people or outings<br/>\n&gt; over several days prior.<br/>\n<br/>\n </span></blockquote>To be honest it had as much to do with my need for time alone and peace and<br/>\nquiet as much as hers, all I did was follow her lead and not try to get her<br/>\nto not watch TV. If I had, then I know I would of had to have been more<br/>\ninvolved with her than I felt like I could be at that moment. She didn&#39;t<br/>\nwatch for that long, but it was long enough for us both and then things were<br/>\nbetter later on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;&lt;I can see that now, a bit of a realization I have had since starting to<br/>\n&gt; write this email. Interesting.&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; This kind of enlightenment happens all the time. It&#39;s wonderful.<br/>\n<br/>\n </span></blockquote>I hope I hold onto it for the birth of this child, hope for no ppd this time<br/>\nand remaining insight, can you remind me:)?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;&lt;I still encourage the move towards it within a certain time frame,<br/>\n&gt; because I see the tired grumpy girl *I* have to deal with the next day and<br/>\n&gt; that is too hard for me.&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; Are you waking her up before she wakes naturally?<br/>\n<br/>\n </span></blockquote>Oh no... I strongly believe in &quot;don&#39;t wake a sleeping baby/kid&quot;. We have<br/>\nonly waken her about 5 times in her life and those times were necessary, in<br/>\nfact I think we were heading for the airport each time to make a flight and<br/>\nhad no choice. What seems to happen, is there is a point where if she goes<br/>\nto bed then or an hour later, she will still wake up at the same time. The<br/>\nwake up time doesn&#39;t seem to change because of the to bed time. The only<br/>\ntime I remember that happening was over the May long weekend at a family<br/>\nwedding and she was in bed after midnight dancing at the reception and slept<br/>\nuntil 1030 the next day. First time I have seen her do that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;&lt;I just let it go until she said on her own that she was ready for<br/>\n </span></blockquote>sleep,<br/>\n<blockquote><span title=\"ireply\"> &gt; but then she was so overtired, that she was squirmy and grumpy and we had<br/>\n </span></blockquote>a<br/>\n<blockquote><span title=\"ireply\"> &gt; horrible time getting her to sleep. What took 5 minutes a hour or two<br/>\n </span></blockquote>early,<br/>\n<blockquote><span title=\"ireply\"> &gt; took 30 minutes and left us both grumpy. So on evaluation I have decided<br/>\n&gt; this compromise works best for us.&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; It&#39;s tougher because you&#39;re pregnant and possibly more tired than usual.<br/>\n&gt; Changes like her really understanding that she is tired, when it has been<br/>\n&gt; cued before with nursing in the past, take time. It may get harder after<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; baby is born to make this kind of change. Our daughter (4.5) also sleeps<br/>\n&gt; with us and nurses to sleep most of the time. I go to bed with her, and<br/>\n </span></blockquote>she<br/>\n<blockquote><span title=\"ireply\"> &gt; usually gets whiney before she then asks to nurse, and drops off.<br/>\n<br/>\n </span></blockquote>That is why I decided to meet things in the middle. Not as rigid about<br/>\nbedtime, but not completely without limits either. It works better for us,<br/>\nshe is not forced into bed, she has a say in it now, but it is still early<br/>\nenough that it is before the overtireness starts. It is not met with<br/>\nresistance anymore (like the last 5 months) and she is sleeping a little<br/>\nlater (good for me) and so I think it is working. I won&#39;t worry about her<br/>\nmaking more adjustments now until after the baby comes and she moves into<br/>\nher own room (when ever that might be)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;I have heard it say that &quot;making&quot; your child pick up their toys is not<br/>\n&gt; respectful and that it is the parents issue about it. I think it is<br/>\n&gt; disrespectful for everyone in the family to live in a mess of a room<br/>\n </span></blockquote>(family<br/>\n<blockquote><span title=\"ireply\"> &gt; room) because one person won&#39;t pick up their toys and that as a community,<br/>\n </span></blockquote>a<br/>\n<blockquote><span title=\"ireply\"> &gt; tribe we have an obligation to each other to be respectful. I guess that<br/>\n </span></blockquote>is<br/>\n<blockquote><span title=\"ireply\"> &gt; a fine line, respecting me is disrespecting her? Even if we all pitch in?<br/>\n&gt; What do you think?&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; I think it is a question of &quot;making&quot; versus &quot;inviting&quot; and &quot;modeling&quot;. I<br/>\n&gt; can&#39;t help suspecting that the &quot;one person&quot; who &quot;won&#39;t&quot; pick up their toys<br/>\n&gt; is the one person who may not see the big tribal picture. I mean<br/>\n&gt; realistically the child is being singled out, since she probably does the<br/>\n&gt; vast majority of the leaving out. She probably also has the most stuff<br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; is essential for any particular activity, and the largest number of games<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; play. At our house on any one day Jayn might play any number (or nearly<br/>\n </span></blockquote>all<br/>\n<blockquote><span title=\"ireply\"> &gt; on really big day) of the following games: Barbies, Polly Pocket (3<br/>\n&gt; different sizes), magnets, drawing, princess castle dolls, magnadoodle,<br/>\n&gt; trains, tea party (assorted sized dolls), doctor&#39;s office,<br/>\n&gt; blocks/construction, paper dolls or Mary Kate and Ashley dolls. Sometimes<br/>\n&gt; these games get combined but since the scale of the figures varies<br/>\n&gt; tremendously they don&#39;t always go together. This is in addition to<br/>\n </span></blockquote>computer<br/>\n<blockquote><span title=\"ireply\"> &gt; or x-box games, reading, and her physical stuff like swimming, dancing and<br/>\n&gt; the park. The amount of just stuff she uses for her activities is huge.<br/>\n&gt; Phew. No wonder it can become overwhelming for her and for me. All I need<br/>\n&gt; for my leisure activities is a laptop, a pen and a journal.<br/>\n<br/>\n </span></blockquote>Good points. Right now her play room is a disaster (in my mind) but she<br/>\nlikes it this way and I won&#39;t be pushing to put anything away until the<br/>\ncleaners come next week.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There is a lot about chores at www.sandradodd.com . Any time the word<br/>\n&gt; &quot;obligation&quot; is used it may mean this is an area that needs more<br/>\n&gt; investigation. Respect and a *desire* to help, cheerfully, are not things<br/>\n&gt; that can be forced or obliged from a person. With Jayn, I generally ask<br/>\n </span></blockquote>her<br/>\n<blockquote><span title=\"ireply\"> &gt; if she is finished with something. If the answer is no, it stays.<br/>\n </span></blockquote>Sometimes<br/>\n<blockquote><span title=\"ireply\"> &gt; she wants to play another game and there just isn&#39;t enough space. So I<br/>\n </span></blockquote>make<br/>\n<blockquote><span title=\"ireply\"> &gt; her a clean slate by putting away the array of Barbie&#39;s etc that have<br/>\n </span></blockquote>spread<br/>\n<blockquote><span title=\"ireply\"> &gt; across her two play areas, while she waits. I&#39;m hoping that she will make<br/>\n </span></blockquote>a<br/>\n<blockquote><span title=\"ireply\"> &gt; connection between how much easier it is to do the next thing when there<br/>\n </span></blockquote>is<br/>\n<blockquote><span title=\"ireply\"> &gt; a clear field of work.<br/>\n<br/>\n </span></blockquote>I like the word obligation. It is new for me, but I feel that when I married<br/>\nmy dh I agreed to an obligation to him as in an agreement what my role would<br/>\nbe. I have an obligation to him and to my daughter to provide certain things<br/>\nto them. My dh has an obligation to us as well. My daughter does too...she<br/>\ngets to decide some of the things, but the reality in life is, you don&#39;t get<br/>\nto do only that which you want to do. There are things that have to be done<br/>\nthat might not be fun, but that we have to do in order to be a contributing<br/>\npart of our community. HOW I teach her this is the difference I think.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; What I have noticed is that she doesn&#39;t spontaneously clean up her stuff,<br/>\n&gt; BUT she offers to help me with my housework - sweeping, vacuuming, folding<br/>\n&gt; and putting away laundry, cleaning in the kitchen or bathroom, putting<br/>\n </span></blockquote>away<br/>\n<blockquote><span title=\"ireply\"> &gt; the groceries - and has recently started taking our plates to the kitchen<br/>\n&gt; unasked. In fact she gets upset if we take them after she has expressed<br/>\n </span></blockquote>her<br/>\n<blockquote><span title=\"ireply\"> &gt; desire to do that for us. She is also usually really happy to run and get<br/>\n&gt; something we forgot in the other room or something.<br/>\n<br/>\n </span></blockquote>Tonight my dd had moved a bunch of her little toys onto the couch. When it<br/>\nwas time to head upstairs and start getting ready for bedtime, I asked her<br/>\nto help me move them back to her play room. She said ok without hesitation<br/>\n(this is new to be honest and probably a by-product of my more &quot;yes&quot; mode).<br/>\nSo I grabbed a handful and headed over to her play room and put them in the<br/>\ntub for those toys. She did the same but couldn&#39;t carry them all. She then<br/>\nstarted picking up the other parts of the these toys in the play room to put<br/>\naway (I did not ask this, or mean it or intend it but went with the flow)<br/>\nand then asked me to get the rest from the living room so she could clean up<br/>\nthe rest. I happily said yes and instead of just moving them from the living<br/>\nroom to her play room, we put all those toys away in their bin and tidied a<br/>\nbit. To me this is a great side effect of the changes I have made in the<br/>\nlast few weeks and I am thrilled.<br/>\n<br/>\n<br/>\nThanks for your thoughts,<br/>\n<br/>\nSherri-Lee</div>","specialLinks":[]},{"userId":86288922,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;s-lp@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction LONG!","postDate":"1087071423","msgId":668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOTgwMWM0NTBiYSQzYTJmOGIzMCQ2NTAxYThjMEBmbG9zc2llPg==","referencesHeader":"PDAxODMwMWM0NGYwZSRlMjM4YjQ4MCQwMTAwMDA3ZkBsaXZpbmdyb29tMT4gPDAxOTIwMWM0NGY2MiRiZTVjYWIzMCQ2NTAxYThjMEBmbG9zc2llPiA8RThENUU4NjEtQkJERC0xMUQ4LUI3NTYtMDAwQTk1RTI5MkM2QG1hYy5jb20+"},"prevInTopic":656,"nextInTopic":680,"prevInTime":667,"nextInTime":669,"topicId":586,"numMessagesInTopic":0,"msgSnippet":"HI Pam, Thanks for the reply. It was good to hear your perspective. I was thinking that those things (bedtimes and foods etc) must not be unschooling alone. So","messageBody":"<div id=\"ygrps-yiv-1152967892\">HI Pam,<br/>\n<br/>\nThanks for the reply. It was good to hear your perspective. I was thinking that those things (bedtimes and foods etc) must not be unschooling alone. So am glad to hear you reaffirm that for me. Right now at 4 I don&#39;t feel a need to offer any serious education from my dd. We live in a province that has very good rules about homeshooling and so all I have to do is register her as an homeschooler and I won&#39;t have to answer to anyone. She can set her path and we will follow, as far as lifes education I can see that being an easy thing for me, or at least easier than the other things. Those might come or loosen up more or not, so far we are pleased with the changes we have made.<br/>\n<br/>\nMost of this morning, my dd has been working on stickers (barbies) and singing songs and dancing and eating. It is so cool to see, she is so free and easy with everything. She is matching up the stickers as she likes them. This is totally her creation and of her doing. No one is controling her time today and it is going wonderfully. <br/>\n<br/>\nI think the biggest challenge for me will be having the energy and ability to help her find out the things she wants to.<br/>\n<br/>\nThanks again,<br/>\n<br/>\nSherri-Lee<br/>\nLooking for safe and natural health products?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aloeessence.com\">http://www.aloeessence.com</a><br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: pam sorooshian <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, June 11, 2004 12:31 PM<br/>\n  Subject: Re: [unschoolingbasics] Introduction LONG!<br/>\n<br/>\n<br/>\n<br/>\n  On Jun 10, 2004, at 8:18 PM, Sherri-Lee Pressman wrote:<br/>\n<br/>\n  &gt; I have heard it say that &quot;making&quot; your child pick up their toys is not <br/>\n  &gt; respectful and that it is the parents issue about it. I think it is <br/>\n  &gt; disrespectful for everyone in the family to live in a mess of a room <br/>\n  &gt; (family room) because one person won&#39;t pick up their toys and that as <br/>\n  &gt; a community, a tribe we have an obligation to each other to be <br/>\n  &gt; respectful. I guess that is a fine line, respecting me is <br/>\n  &gt; disrespecting her? Even if we all pitch in? What do you think?<br/>\n<br/>\n  I think you&#39;re doing JUST fine - keep thinking and pondering and being <br/>\n  as aware as you can be - as thoughtful as you obviously are - and as <br/>\n  open to changing as you clearly have been.<br/>\n<br/>\n  Unschooling means you don&#39;t preplan lessons, give assignments, follow a <br/>\n  curriculum, give tests or quizzes, or grade your child. What you do <br/>\n  INSTEAD is going to be different in every family - and change over time <br/>\n  - but it will involve providing some unique version of a stimulating <br/>\n  environment and highly supportive parents who show tremendous respect <br/>\n  for a child&#39;s ability to know what he/she is ready to learn.  I think <br/>\n  the most important &quot;to do&#39;s&quot; of unschooling are spending time in <br/>\n  discussion, playing, solitary reflection, social interaction, <br/>\n  out-of-doors, and exposure to a wide enough variety of experiences that <br/>\n  kids are aware of many possible directions they could go.<br/>\n<br/>\n<br/>\n  Most of what you talked about in your post are the &quot;side effects&quot; or <br/>\n  &quot;extra repercussions&quot; of living an unschooling lifestyle - once people <br/>\n  let go of rigid control over their child&#39;s learning, and they come to <br/>\n  have confidence and trust in their children and themselves in that <br/>\n  area, it seems they naturally begin to experiment with &quot;letting go&quot; in <br/>\n  other areas as well.<br/>\n<br/>\n  Focus on unschooling - let the other things happen naturally. I&#39;m sure <br/>\n  at least some of them will happen, because I can tell from your post <br/>\n  that you&#39;re willing to go with stuff, as it comes to make sense to you.<br/>\n<br/>\n  -pam<br/>\n  National Home Education Network<br/>\n  &lt;www.NHEN.org&gt;<br/>\n  Serving the entire homeschooling community since 1999<br/>\n  through information, networking and public relations.<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Introduction LONG!","postDate":"1087034492","msgId":656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAxOTIwMWM0NGY2MiRiZTVjYWIzMCQ2NTAxYThjMEBmbG9zc2llPg=="},"prevInTopic":610,"nextInTopic":668,"prevInTime":655,"nextInTime":657,"topicId":586,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-83579476\">&lt;&lt;&lt;Today she went to watch it in her dad&#39;s office after her grandma left<br/>\nfrom a two week visit and I saw that this might have been a need to just veg<br/>\nout and get over her sadness at the goodbye and was much more at peace with<br/>\nit than before.&gt;&gt;&gt;<br/>\n<br/>\nThis is such a great insight for you to have. I have noticed that Jayn 4.5<br/>\nsometimes wants to watch for longer and with more apparent attention after a<br/>\nperiod when she has had a lot of interaction with other people or outings<br/>\nover several days prior.  <br/>\n<br/>\n&lt;&lt;&lt;I can see that now, a bit of a realization I have had since starting to<br/>\nwrite this email. Interesting.&gt;&gt;&gt;<br/>\n<br/>\nThis kind of enlightenment happens all the time. It&#39;s wonderful.<br/>\n<br/>\n&lt;&lt;&lt;I still encourage the move towards it within a certain time frame,<br/>\nbecause I see the tired grumpy girl *I* have to deal with the next day and<br/>\nthat is too hard for me.&gt;&gt;&gt;<br/>\n<br/>\nAre you waking her up before she wakes naturally? <br/>\n<br/>\n&lt;&lt;&lt;I just let it go until she said on her own that she was ready for sleep,<br/>\nbut then she was so overtired, that she was squirmy and grumpy and we had a<br/>\nhorrible time getting her to sleep. What took 5 minutes a hour or two early,<br/>\ntook 30 minutes and left us both grumpy. So on evaluation I have decided<br/>\nthis compromise works best for us.&gt;&gt;&gt;<br/>\n<br/>\nIt&#39;s tougher because you&#39;re pregnant and possibly more tired than usual.<br/>\nChanges like her really understanding that she is tired, when it has been<br/>\ncued before with nursing in the past, take time. It may get harder after the<br/>\nbaby is born to make this kind of change. Our daughter (4.5) also sleeps<br/>\nwith us and nurses to sleep most of the time. I go to bed with her, and she<br/>\nusually gets whiney before she then asks to nurse, and drops off.<br/>\n<br/>\n&lt;&lt;&lt;Or shouldn&#39;t I worry about what she is learning? I am curious though. She<br/>\nloves to cook and bake and of course that has a lot of math to it.&gt;&gt;&gt;<br/>\n<br/>\nWell I don&#39;t worry about what Jayn is learning in the sense of learning<br/>\nschool subjects. I never think about them, and especially since I am free<br/>\nfrom having to do any official assessment thingy in California. In terms of<br/>\ncooking - I don&#39;t look at it as an opportunity for her to learn math (or<br/>\nscience) as may be traditional homeschooling. I look at any math she may<br/>\npick up as a skill that will help her cooking abilities. I only care that<br/>\nshe continues to learn every day that we love her and support her growth. <br/>\n<br/>\n&lt;&lt;&lt;I have heard it say that &quot;making&quot; your child pick up their toys is not<br/>\nrespectful and that it is the parents issue about it. I think it is<br/>\ndisrespectful for everyone in the family to live in a mess of a room (family<br/>\nroom) because one person won&#39;t pick up their toys and that as a community, a<br/>\ntribe we have an obligation to each other to be respectful. I guess that is<br/>\na fine line, respecting me is disrespecting her? Even if we all pitch in?<br/>\nWhat do you think?&gt;&gt;&gt;<br/>\n<br/>\nI think it is a question of &quot;making&quot; versus &quot;inviting&quot; and &quot;modeling&quot;. I<br/>\ncan&#39;t help suspecting that the &quot;one person&quot; who &quot;won&#39;t&quot; pick up their toys<br/>\nis the one person who may not see the big tribal picture. I mean<br/>\nrealistically the child is being singled out, since she probably does the<br/>\nvast majority of the leaving out. She probably also has the most stuff that<br/>\nis essential for any particular activity, and the largest number of games to<br/>\nplay. At our house on any one day Jayn might play any number (or nearly all<br/>\non really big day) of the following games: Barbies, Polly Pocket (3<br/>\ndifferent sizes), magnets, drawing, princess castle dolls, magnadoodle,<br/>\ntrains, tea party (assorted sized dolls), doctor&#39;s office,<br/>\nblocks/construction, paper dolls or Mary Kate and Ashley dolls. Sometimes<br/>\nthese games get combined but since the scale of the figures varies<br/>\ntremendously they don&#39;t always go together. This is in addition to computer<br/>\nor x-box games, reading, and her physical stuff like swimming, dancing and<br/>\nthe park. The amount of just stuff she uses for her activities is huge.<br/>\nPhew. No wonder it can become overwhelming for her and for me. All I need<br/>\nfor my leisure activities is a laptop, a pen and a journal. <br/>\n<br/>\nThere is a lot about chores at www.sandradodd.com . Any time the word<br/>\n&quot;obligation&quot; is used it may mean this is an area that needs more<br/>\ninvestigation. Respect and a *desire* to help, cheerfully, are not things<br/>\nthat can be forced or obliged from a person. With Jayn, I generally ask her<br/>\nif she is finished with something. If the answer is no, it stays. Sometimes<br/>\nshe wants to play another game and there just isn&#39;t enough space. So I make<br/>\nher a clean slate by putting away the array of Barbie&#39;s etc that have spread<br/>\nacross her two play areas, while she waits. I&#39;m hoping that she will make a<br/>\nconnection between how much easier it is to do the next thing when there is<br/>\na clear field of work. <br/>\n<br/>\nWhat I have noticed is that she doesn&#39;t spontaneously clean up her stuff,<br/>\nBUT she offers to help me with my housework - sweeping, vacuuming, folding<br/>\nand putting away laundry, cleaning in the kitchen or bathroom, putting away<br/>\nthe groceries - and has recently started taking our plates to the kitchen<br/>\nunasked. In fact she gets upset if we take them after she has expressed her<br/>\ndesire to do that for us. She is also usually really happy to run and get<br/>\nsomething we forgot in the other room or something.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.692 / Virus Database: 453 - Release Date: 5/28/2004</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction LONG!","postDate":"1086982277","msgId":610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU4RDVFODYxLUJCREQtMTFEOC1CNzU2LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAxOTIwMWM0NGY2MiRiZTVjYWIzMCQ2NTAxYThjMEBmbG9zc2llPg==","referencesHeader":"PDAxODMwMWM0NGYwZSRlMjM4YjQ4MCQwMTAwMDA3ZkBsaXZpbmdyb29tMT4gPDAxOTIwMWM0NGY2MiRiZTVjYWIzMCQ2NTAxYThjMEBmbG9zc2llPg=="},"prevInTopic":602,"nextInTopic":656,"prevInTime":609,"nextInTime":611,"topicId":586,"numMessagesInTopic":0,"msgSnippet":"... I think you re doing JUST fine - keep thinking and pondering and being as aware as you can be - as thoughtful as you obviously are - and as open to","messageBody":"<div id=\"ygrps-yiv-779285930\">On Jun 10, 2004, at 8:18 PM, Sherri-Lee Pressman wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have heard it say that &quot;making&quot; your child pick up their toys is not <br/>\n&gt; respectful and that it is the parents issue about it. I think it is <br/>\n&gt; disrespectful for everyone in the family to live in a mess of a room <br/>\n&gt; (family room) because one person won&#39;t pick up their toys and that as <br/>\n&gt; a community, a tribe we have an obligation to each other to be <br/>\n&gt; respectful. I guess that is a fine line, respecting me is <br/>\n&gt; disrespecting her? Even if we all pitch in? What do you think?<br/>\n<br/>\n </span></blockquote>I think you&#39;re doing JUST fine - keep thinking and pondering and being <br/>\nas aware as you can be - as thoughtful as you obviously are - and as <br/>\nopen to changing as you clearly have been.<br/>\n<br/>\nUnschooling means you don&#39;t preplan lessons, give assignments, follow a <br/>\ncurriculum, give tests or quizzes, or grade your child. What you do <br/>\nINSTEAD is going to be different in every family - and change over time <br/>\n- but it will involve providing some unique version of a stimulating <br/>\nenvironment and highly supportive parents who show tremendous respect <br/>\nfor a child&#39;s ability to know what he/she is ready to learn.  I think <br/>\nthe most important &quot;to do&#39;s&quot; of unschooling are spending time in <br/>\ndiscussion, playing, solitary reflection, social interaction, <br/>\nout-of-doors, and exposure to a wide enough variety of experiences that <br/>\nkids are aware of many possible directions they could go.<br/>\n<br/>\n<br/>\nMost of what you talked about in your post are the &quot;side effects&quot; or <br/>\n&quot;extra repercussions&quot; of living an unschooling lifestyle - once people <br/>\nlet go of rigid control over their child&#39;s learning, and they come to <br/>\nhave confidence and trust in their children and themselves in that <br/>\narea, it seems they naturally begin to experiment with &quot;letting go&quot; in <br/>\nother areas as well.<br/>\n<br/>\nFocus on unschooling - let the other things happen naturally. I&#39;m sure <br/>\nat least some of them will happen, because I can tell from your post <br/>\nthat you&#39;re willing to go with stuff, as it comes to make sense to you.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":86288922,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;s-lp@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Introduction LONG!","postDate":"1086974139","msgId":602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWYwMWM0NGZkNyRiN2Q5NDkxMCQ2NTAxYThjMEBmbG9zc2llPg==","referencesHeader":"PGNhY2wydSs4MjRxQGVHcm91cHMuY29tPg=="},"prevInTopic":598,"nextInTopic":610,"prevInTime":601,"nextInTime":603,"topicId":586,"numMessagesInTopic":0,"msgSnippet":"HI Valerie, I didn t take what you said as confrontational at all. You are right, it has to be what everyone wants.. or the majority? My dh and I both like a","messageBody":"<div id=\"ygrps-yiv-2004307620\">HI Valerie,<br/>\n<br/>\nI didn&#39;t take what you said as confrontational at all.<br/>\n<br/>\nYou are right, it has to be what everyone wants.. or the majority?<br/>\n<br/>\nMy dh and I both like a neat place. I am NOT anal about it LOL... and don&#39;t even care too much about my dd&#39;s mess. She has a play room that sort of is joined to the kitchen and eating area and flows into the family room. Her play room is hers and the only time I tidy it is if we are having company (like a birthday party) or if the cleaners are coming so they can do the floor. Mostly I ask her to help and if she does, great, if she doesn&#39;t fine. I do a lot of it at night when she is asleep, it goes MUCH faster that way:) The only place where I care a bit more is the family room, where everyone uses it. IF she leaves 50 barbies on the couch then no one else can sit on it. So last time I told her it was fine to have them on the couch, but asked her to put them away after so others could sit on the couch when she was done. She said ok... moved about half of them and I did the rest. When she complained that I had moved her barbies, I just said, well we wanted to sit on the couch and they were in the way so we put them away. Simple. No hassle. I was on a list a long time ago (not unschooling) where someone was talking about how frustrated they were getting with having to pick up after their kids and someone said &quot;the most important thing is connection with my child, even if the shoes stay in the middle of the floor&quot; It had impact on me and I printed it off and have it on my fridge and other places to remind me.<br/>\n<br/>\nI care about her toys being left in my office. She has a shelf of toys she can play with in the office while I am working if she wants. The rule is they have to be put away before we leave. I always help put them away though. I don&#39;t stand and demand that she tidy while I watch.<br/>\n<br/>\nSo I guess it all comes down to how do we define &quot;make&quot; as in make them clean up. I ask that they help with their messes, I do some and model doing it cheerfully (most of the time) and don&#39;t punish or get mad when they don&#39;t, but there is an unspoken expectation in our home that people clean up after themselves with or without help.<br/>\n<br/>\nNow having said that I still can&#39;t get my dh to remember to take his socks off the living room floor every night either, but that is another work in progress:) Oh and usually I just pick them up now and toss them in the laundry myself, it just isn&#39;t worth any bad feelings because of socks!<br/>\n<br/>\nThanks for the thoughts,<br/>\n<br/>\nSherri-Lee<br/>\nLooking for safe and natural health products?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aloeessence.com\">http://www.aloeessence.com</a><br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Valerie <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, June 11, 2004 9:02 AM<br/>\n  Subject: [unschoolingbasics] Re: Introduction LONG!<br/>\n<br/>\n<br/>\n  &gt; I have heard it say that &quot;making&quot; your child pick up their toys is <br/>\n  not respectful and that it is the parents issue about it. I think it <br/>\n  is disrespectful for everyone in the family to live in a mess of a <br/>\n  room (family room) because one person won&#39;t pick up their toys and <br/>\n  that as a community, a tribe we have an obligation to each other to <br/>\n  be respectful. I guess that is a fine line, respecting me is <br/>\n  disrespecting her? Even if we all pitch in? What do you think?<br/>\n  Sherri-Lee<br/>\n<br/>\n  ***** Hi Sherri-Lee and welcome. I have about two minutes and wanted <br/>\n  to comment on this paragraph. *You* think it is disrespectful for <br/>\n  everyone to live in a mess, but is that how the others feel about <br/>\n  it? (I don&#39;t mean to sound confrontational) Being a community-tribe <br/>\n  means that no one person sets the rules for what is disrespectful. I <br/>\n  see &#39;respecting me is disrespecting her&#39; as a line, but not <br/>\n  necessarily a fine one. Since you are the parent do you get the <br/>\n  final say-so on whether or not your child has to pick the toys up? <br/>\n  That destroys the community diatribe and makes it a hierarchy where <br/>\n  you&#39;re the boss. Laurie never cared if the room was messy. More than <br/>\n  that, I think she preferred the mess over &quot;the room is clean so <br/>\n  don&#39;t make any messes&quot; mentality at her friends house. (so did her <br/>\n  friend)<br/>\n<br/>\n  I didn&#39;t like the messes so I cleaned them up. If the mess-maker was <br/>\n  nearby, she/he usually helped me pick up, but not always. If you all <br/>\n  pitch in to help clean up, that&#39;s great. As long as one big person <br/>\n  isn&#39;t forcing the others to help. Sometimes the mess-maker was <br/>\n  involved in another project and that was more important to him/her <br/>\n  than cleaning up the old mess. Sometimes I made/make a mess and I <br/>\n  have more important things to do before I get around to cleaning it <br/>\n  up. <br/>\n<br/>\n  There&#39;s nothing wrong with wanting a clean home (I have one) but I <br/>\n  try to watch that I don&#39;t become anal about keeping it clean. Takes <br/>\n  all the fun out of living in a home vs a house. <br/>\n<br/>\n  love, Valerie<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction LONG!","postDate":"1086969758","msgId":598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhY2wydSs4MjRxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxOTIwMWM0NGY2MiRiZTVjYWIzMCQ2NTAxYThjMEBmbG9zc2llPg=="},"prevInTopic":586,"nextInTopic":602,"prevInTime":597,"nextInTime":599,"topicId":586,"numMessagesInTopic":0,"msgSnippet":"... not respectful and that it is the parents issue about it. I think it is disrespectful for everyone in the family to live in a mess of a room (family room)","messageBody":"<div id=\"ygrps-yiv-767061207\"><blockquote><span title=\"ireply\">&gt; I have heard it say that &quot;making&quot; your child pick up their toys is <br/>\n </span></blockquote>not respectful and that it is the parents issue about it. I think it <br/>\nis disrespectful for everyone in the family to live in a mess of a <br/>\nroom (family room) because one person won&#39;t pick up their toys and <br/>\nthat as a community, a tribe we have an obligation to each other to <br/>\nbe respectful. I guess that is a fine line, respecting me is <br/>\ndisrespecting her? Even if we all pitch in? What do you think?<br/>\n Sherri-Lee<br/>\n<br/>\n***** Hi Sherri-Lee and welcome. I have about two minutes and wanted <br/>\nto comment on this paragraph. *You* think it is disrespectful for <br/>\neveryone to live in a mess, but is that how the others feel about <br/>\nit? (I don&#39;t mean to sound confrontational) Being a community-tribe <br/>\nmeans that no one person sets the rules for what is disrespectful. I <br/>\nsee &#39;respecting me is disrespecting her&#39; as a line, but not <br/>\nnecessarily a fine one. Since you are the parent do you get the <br/>\nfinal say-so on whether or not your child has to pick the toys up? <br/>\nThat destroys the community diatribe and makes it a hierarchy where <br/>\nyou&#39;re the boss. Laurie never cared if the room was messy. More than <br/>\nthat, I think she preferred the mess over &quot;the room is clean so <br/>\ndon&#39;t make any messes&quot; mentality at her friends house. (so did her <br/>\nfriend)<br/>\n<br/>\nI didn&#39;t like the messes so I cleaned them up. If the mess-maker was <br/>\nnearby, she/he usually helped me pick up, but not always. If you all <br/>\npitch in to help clean up, that&#39;s great. As long as one big person <br/>\nisn&#39;t forcing the others to help. Sometimes the mess-maker was <br/>\ninvolved in another project and that was more important to him/her <br/>\nthan cleaning up the old mess. Sometimes I made/make a mess and I <br/>\nhave more important things to do before I get around to cleaning it <br/>\nup. <br/>\n<br/>\nThere&#39;s nothing wrong with wanting a clean home (I have one) but I <br/>\ntry to watch that I don&#39;t become anal about keeping it clean. Takes <br/>\nall the fun out of living in a home vs a house. <br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":86288922,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;s-lp@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction LONG!","postDate":"1086923898","msgId":586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOTIwMWM0NGY2MiRiZTVjYWIzMCQ2NTAxYThjMEBmbG9zc2llPg==","referencesHeader":"PDAxODMwMWM0NGYwZSRlMjM4YjQ4MCQwMTAwMDA3ZkBsaXZpbmdyb29tMT4="},"prevInTopic":0,"nextInTopic":598,"prevInTime":585,"nextInTime":587,"topicId":586,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, I have been reading for a week or so now and thought I should jump in a intro myself. My name is Sherri-Lee I live in BC Canada, just outside","messageBody":"<div id=\"ygrps-yiv-222294069\">Hello everyone,<br/>\n<br/>\nI have been reading for a week or so now and thought I should jump in a intro myself.<br/>\n<br/>\nMy name is Sherri-Lee I live in BC Canada, just outside of Vancouver. I am married to one dh:) and have one dd who is 4 and am pregnant with #2 due in October.<br/>\n<br/>\nI follow a very natural pregnancy and birth path, and extended that into attachment parenting for dd. Although I had doubts at some earlier stages, I see the results of our efforts and am committed to following that path again with this next one. We have always been respectful in our parenting (although some would say otherwise) and imposed some limits in our daughters life. We have always been committed to homeschooling and as I looked into it more I discovered that creating school at home did not appeal to me. Now, my dd may have other ideas in the future and we will deal with that in the future if needed. For a long time just after she turned 3, she was asking to go to &quot;pwe school&quot; simply because EVERYONE was asking her when she was going or if she was looking forward to going and one little friend of hers even told her she HAD to. Well.. I heard about that for weeks. Each time I just told her that some kids go to school and some stay at home and learn what they want when they want etc. Now when people ask her about this (and I can not believe how many people do the nosey parkers even to the point of asking like &quot;Well WHY aren&#39;t you in school!&quot;) she looks at them and says &quot;no we homeschool&quot; And I beam proudly:) I won&#39;t worry about her saying &quot;unschool&quot; I think.<br/>\n<br/>\nSo as I looked into the whole homeschooling thing I realised that I like the &quot;idea&quot; of unschooling as I percieved it and thought I would look into it. Imagine my surprise when I discovered it was more than &quot;schooling&quot; but a way of life or lifestyle. I have been on other lists now for a bit too and have been reading about this philosophy, I see some of what we do and don&#39;t. It has dawned on me that perhaps my husband has been more unschooly in his parenting than I have all along and I remember being frustrated at him for not imposing limits we agreed on. But then I remember he wants those limits imposed, he just doesn&#39;t want to do it and feel better:)<br/>\n<br/>\nSo I have examined our TV viewing... DH doesn&#39;t watch much, the only &quot;commercial&quot; show he watchs is Enterprise and NYPD Blue, although he watches other things with me occassionally for time together. I watch more than him but much less than I used to. I want to watch less.. there seems to be times when I am wasting time vegging out in front of the tv watching crap when I could be &quot;doing&quot; so much more like scrap booking or knitting or.. or.. or..or... I have relaxed the limits on TV for my daughter and let her decide how much and what she watches more.. and I have struggled with getting over my belief that she is wasting time and tried to let that go. I hear how people say for the parent to be there watching with the child, but I have to be honest, at 4 she only wants children&#39;s shows, mostly cartoons and I have a low tolerance for that. I can stand about half an hour and then am bored out of my head. So I do not spend hours watching with her on the days she does. I am around, near by doing other things though so we are not removed from each other. I see it as an opportunity for me to do some &quot;me&quot; things. One question I have about TV is, do you wait for them to suggest watching or to do it or do you suggest it sometimes? I find that we have used TV for specific things, like when she is hungry and melting down or needs to calm down after getting WAY riled up with certain friends or wrestling.. or to let us watch the hockey playoffs and find that I suggest it then. Today she went to watch it in her dad&#39;s office after her grandma left from a two week visit and I saw that this might have been a need to just veg out and get over her sadness at the goodbye and was much more at peace with it than before. <br/>\n<br/>\nNow the other thing I have heard is that parents watch their shows in front of their children, who might watch or not depending on if they want to or not. This we haven&#39;t done. When we try to watch TV (our programs) in front of her, it becomes a competition for our attention and no one enjoys it, so I just suggest she watches her own show in the bedroom instead, which she is happy with. I am not sure I will ever get to as relaxed about it or view as many others do, but I am also not sure that is my goal either. I also don&#39;t think that if I don&#39;t it doesn&#39;t make me an unschooler so that helps. I think in retrospect, this control of TV, might of contributed to my resentment about parenting early on. I would NOT sit down in front of her and watch TV, I only turned it on after she was in bed asleep. So I missed shows I wanted to see, or would be watching and she would cry and need me and I would miss parts and there was my dh turning on the tv at anytime simply because there was something he wanted to see and not missing what he wanted and not worrying about her watching it or not. I can see that now, a bit of a realization I have had since starting to write this email. Interesting.<br/>\n<br/>\nOn to food:) We limit our own intake of some foods for health reasons. My dh had celiac until recently so any gluten products were out of luck. Because of the increased chance of her having celiac, I limited all gluten for myself during pregnancy and for the first year when she was exclusively breast fed. At that time we had her vega tested and she showed a sensitivity for wheat so I got real serious and eliminated a lot of gluten then too. Boy did I loose weight!:) Now we all eat gluten no problems. We limit sugar. We are both in the alternative health field and believe that white sugar has no redeeming value or nutritional value at all. So we limit it, but in all honesty we do indulge once in awhile, but we will limit this for ourselves and her. We also take the time to explain why to her. We have explained that some foods have nutritional value that help us build muscles and bone and give us energy and other foods taste very good but don&#39;t necessarily help us in growing or our mood. I guess some would say I missing the step of letting her make the connection of how she feels after she eats those foods so she can chose for herself. Perhaps, and I might get there, but for now, I see how she doesn&#39;t make that connection. If she has over indulged in something and then had an emotional reaction to it, IF I try to make the suggestion that her mood might be because of the food, she flatly refuses that. Now, that might be my presentation or timing that are contributing to that, we will see. I don&#39;t generally do good versus evil on food, although we will touch on the evil of some of the companies that make some of the food, McD and Nestle come to mind for me right now. As a passionate breastfeeding advocate, I have to try to eliminate Nestle from our diet for that one reason alone.<br/>\n<br/>\nOK.. bedtimes...well... hmmm... I have always believed in the value of bedtimes. I was also raised by parents who were rigid in their bedtime beliefs for me and I remember lying in bed alone in the dark, BORED out of my tree for a couple of hours a night before being able to go to sleep and then being overly tired the next day. To this day I have a problem with going to bed when I am tired because I resist going to bed. So of course I want to avoid that for my dd. Now since I started reading on this subject, I have relaxed a LOT on the bedtime issue. I still encourage the move towards it within a certain time frame, because I see the tired grumpy girl *I* have to deal with the next day and that is too hard for me. What has happened though is I present it more as a choice for her (how many more shows do you think you need before you are ready for sleep?) as opposed to the old &quot;this is the last show and then the TV goes off for bed time&quot; which was received with &quot;I don&#39;t want to go to sleep&quot; in the last few months. One thing that came up for me in the last week that solidified my decision to not become totally relaxed on this issue was the fact that she still sleeps with me, I nurse her to sleep each night still and we have a routine that we do each night with us talking about the day. So it isn&#39;t like she goes to her room and can go to bed and go to sleep whenever she wants. We are working on her room now, which she will move into whenever she wants, but when that time comes and she no longer needs me to put her to sleep, then I can see taking this more relaxed approach. Last week for example, I just let it go until she said on her own that she was ready for sleep, but then she was so overtired, that she was squirmy and grumpy and we had a horrible time getting her to sleep. What took 5 minutes a hour or two early, took 30 minutes and left us both grumpy. So on evaluation I have decided this compromise works best for us.<br/>\n<br/>\nDid I warn you this was long? I have thought SO much about this without posting I guess it has all built up... sorry and if you got this far, thank you!<br/>\n<br/>\nSo other than those things.... what is unschooling? How do we do it? I know it is child led and when your kid expresses an interest you encourage them to go at it as long as they want.. and support them. At the age of my daughter I am finding she is asking me questions and if my answer is &quot;I don&#39;t know&quot; it stops there and mostly because I don&#39;t know how to find out the answer it seems. I am lacking in resources maybe? Tools to use? I don&#39;t push her to do anything.. she has expressed no interest in knowing letters.. fine.. but she LOVES to count things and to learn the look of the numbers. She loves stickers and can do that for hours on end, what is she learning there? I know she often clumps all the ones that are the same all together? Or shouldn&#39;t I worry about what she is learning? I am curious though. She loves to cook and bake and of course that has a lot of math to it. She loves to garden with me and always wants to dig, so we are thinking maybe she needs a sand box for unlimited digging.<br/>\n<br/>\nI have heard it say that &quot;making&quot; your child pick up their toys is not respectful and that it is the parents issue about it. I think it is disrespectful for everyone in the family to live in a mess of a room (family room) because one person won&#39;t pick up their toys and that as a community, a tribe we have an obligation to each other to be respectful. I guess that is a fine line, respecting me is disrespecting her? Even if we all pitch in? What do you think?<br/>\n<br/>\nSo those are my thoughts, again, sorry this is so long, I will end this now and see what kinds of replies I get. I look forward to learning with you and from you all. Hopefully I will re-learn how to get more involved with my own interests too, which have wained over the years.<br/>\n<br/>\nThanks for your time!<br/>\n<br/>\nSherri-Lee<br/>\nLooking for safe and natural health products?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aloeessence.com\">http://www.aloeessence.com</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":530,"nextTopicId":683}}