{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Some friendly advice from an &quot;old&quot; newbie","postDate":"1086031637","msgId":113,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2RkE4ODAzLUIzMzgtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDExYi4zMmE3NDgyYi4yZGVjOGU5ZEBhb2wuY29tPg==","referencesHeader":"PDExYi4zMmE3NDgyYi4yZGVjOGU5ZEBhb2wuY29tPg=="},"prevInTopic":105,"nextInTopic":0,"prevInTime":112,"nextInTime":114,"topicId":105,"numMessagesInTopic":0,"msgSnippet":"Learning about and discussing unschooling in online forums has transformed the lives of countless families, so I would not lightly dismiss the incredible value","messageBody":"<div id=\"ygrps-yiv-314095681\">Learning about and discussing unschooling in online forums has <br/>\ntransformed the lives of countless families, so I would not lightly <br/>\ndismiss the incredible value of email and message board formats. <br/>\nFinding face-to-face friends with whom to share our unschooling lives <br/>\nis a gigantic blessing, though, I couldn&#39;t agree more with that <br/>\nsentiment.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 31, 2004, at 6:35 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TeresaBnNC@...\">TeresaBnNC@...</a> wrote:<br/>\n<br/>\n&gt; Your quest becomes cluttered and takes on inconsequential tangets that <br/>\n&gt; have little significance in your actual day to day life.<br/>\n<br/>\nI think we each must speak for ourselves and maybe take care in telling <br/>\nothers what their experience will be. The above has not been my <br/>\nexperience, but I have seen that there are people who are &quot;distracted&quot; <br/>\nby the discussions - wrapped up in the discussions to the extent that <br/>\nthey lose focus on their own families. For many of us, though, the <br/>\nonline discussions are extremely thought-provoking and we immediately <br/>\nand constantly examine our own ideas and actions in the light of what <br/>\nwe are reading. So, although online discussions have had tremendous <br/>\nsignificance in my actual day-to-day life with my family, I can <br/>\nunderstand that, for some people, they are not helpful because that <br/>\nperson has a tendency to get caught up in contention and tangents that <br/>\nare not useful for them.<br/>\n<br/>\n&gt; Things like defining unschooling and trying to place how <br/>\n&gt; one unschools in varying degrees of &quot;right&quot; and &quot;wrong&quot; hinder from <br/>\n&gt; actually learning anything about the lifestyle.  <br/>\n<br/>\nDefining unschooling is part of the process of understanding what <br/>\npeople are talking about when they say, &quot;We unschool&quot; and is the answer <br/>\nto the question, &quot;What is unschooling?&quot; I see absolutely no problem at <br/>\nall with an unschooling discussion list spending considerable time <br/>\ndiscussing what defines unschooling as unschooling - what it entails, <br/>\nwhat unschoolers do that is different than other homeschoolers, what is <br/>\nnot unschooling and what is. The perception that these discussions are <br/>\nplacing people into varying degrees of &quot;right&quot; or &quot;wrong&quot; is only true <br/>\nif people are overly concerned about what label they are placing on <br/>\nthemselves. To be a useful term that conveys enough meaning to be <br/>\nvaluable in communication, &quot;unschooling&quot; has to be understood as <br/>\nsomething. Sometimes people simply mean that they don&#39;t send their <br/>\nchildren off to a brick-and-mortar school - they &quot;unschool.&quot; Early on, <br/>\nthat was the general meaning of the term as used by John Holt and <br/>\nothers. But, as pointed out in later issues of Growing Without <br/>\nSchooling, the term &quot;homeschooling&quot; gradually took over as the more <br/>\ngeneral term and &quot;unschooling&quot; became increasingly specifically <br/>\nassociated with the kind of natural learning promoted by John Holt - <br/>\nlearning without curriculum, lesson plans, assignments, testing, and <br/>\ngrades. It became a subset of homeschoolers whose focus is on living a <br/>\nlifestyle of learning together without any of the trappings of school.<br/>\n<br/>\nIs there a continuum of homeschooling with unschooling at one end and a <br/>\ncomplete formal required curriculum with teachers grading students&#39; <br/>\nexaminations and assignments at the other end?  I don&#39;t honestly think <br/>\nthere is an unbroken continuum. There is more difference between how <br/>\nunschoolers live versus what some homeschoolers do to their children <br/>\nthan between some schools and unschooling. I&#39;m not sitting on the same <br/>\ncontinuum with those homeschoolers who keep a switch hung on the wall <br/>\nnext to the big chart for the black marks for children who don&#39;t pay <br/>\nenough attention to their lessons. I&#39;m a lot closer to my local public <br/>\nschool&#39;s &quot;open classroom&quot; with experiential learning stations than I am <br/>\nto homeschoolers whose kids learn from boring workbooks and repetitive <br/>\nregurgitation of facts. Learning and education is far too complicated <br/>\nto be thought of as a simple continuum.<br/>\n<br/>\nI really like the vegetarian analogy to unschooling.  Vegetarians eat a <br/>\nwide variety of foods -  no two vegetarians (or unschoolers) are alike. <br/>\nBut, you just can&#39;t eat a steak while claiming to be a vegetarian. It <br/>\nisn&#39;t &quot;vegetarian&quot; to eat a mostly vegetarian diet with a steak thrown <br/>\nin on occasion. People who eat an occasional steak should not take <br/>\noffense when it is pointed out that that isn&#39;t real vegetarianism. The <br/>\nlabel is important for communication, that&#39;s all. Somebody who feels <br/>\nmore comfortable eating mostly vegetarian diet with an occasional <br/>\nsteak, but covets being called a vegetarian, is caring more about the <br/>\nlabel than what really works for their family. Someone who feels <br/>\ncomfortable mostly following their kids&#39; lead with just requiring that <br/>\nthey write something once a week or do a math program, but covets being <br/>\ncalled an unschooler, is caring more about the label than what really <br/>\nworks for their family. They see discussions about &quot;what unschooling <br/>\nis&quot; as &quot;trying to place how one unschools in varying degrees of &quot;right&quot; <br/>\nand &quot;wrong,&quot;&quot;<br/>\n<br/>\nI think some people aspire to be &quot;unschoolers&quot; just like some aspire to <br/>\nbe &quot;vegetarians&quot; - for some reason they want to be able to &quot;say&quot; that <br/>\nthat is what they are, even though they don&#39;t want to entirely embrace <br/>\nit. I&#39;m a lot more reticent than that to label myself. I ate a totally <br/>\nvegetarian diet for 12 years and never called myself a vegetarian, <br/>\nbecause I never wanted to feel boxed in - didn&#39;t want to feel I had to <br/>\nlive up to people&#39;s expectations of a vegetarian if one day I suddenly <br/>\ndecided to pick up a barbequed rib. I own an unschooling discussion <br/>\nlist and write and talk about unschooling, but the honest truth is I <br/>\ndon&#39;t go around announcing to people that we are &quot;unschoolers&quot; as if <br/>\nthat is some sort of badge I wear. Just like I&#39;d order a vegetarian <br/>\nmeal on an airplane, because there was a reason to point out that I ate <br/>\nvegetarian food, I might say to another homeschooler that we unschool, <br/>\nbecause it means something to them and helps them understand that I&#39;m <br/>\nnot interested in comparing our choices of curriculum. But primarily <br/>\nthe term &quot;unschooling&quot; is used to introduce people to the kind of <br/>\nnatural learning and living lifestyle that John Holt promoted.<br/>\n<br/>\n-pam<br/>\n&quot;To parents I say, above all else, don&#39;t let your home become some <br/>\nterrible miniature copy of the school.  No  lesson plans!  No quizzes!  <br/>\nNo tests!  No report cards! Even leaving your kids alone would be <br/>\nbetter; at least they could figure out some things on their own.  Live <br/>\ntogether, as well as you can; enjoy life together, as much as you can.&quot;<br/>\nJohn Holt in &quot;Teach Your Own&quot; </span></blockquote></div>","specialLinks":[]},{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Some friendly advice from an &quot;old&quot; newbie","postDate":"1086010525","msgId":105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExYi4zMmE3NDgyYi4yZGVjOGU5ZEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":113,"prevInTime":104,"nextInTime":106,"topicId":105,"numMessagesInTopic":0,"msgSnippet":"Hello to everyone.  Some of you may know me. .some of you, I m sure, do not. A brief intro.  My name is Teresa, I am the mother of 4 wonderful children. I took","messageBody":"<div id=\"ygrps-yiv-1967644097\"><html><head></head>\n \n<div>\n<div>&nbsp;<font face=\"Arial\" size=\"2\">Hello to everyone.&nbsp; Some of you may know me. .some of you, I&#39;m sure, do not.&nbsp; A brief intro.&nbsp; My name is Teresa, I am the mother of 4 wonderful children.&nbsp; I took my 3 younger ones out of a charter school about 18 months ago.&nbsp; They are dd, 14, ds, 12 and ds 9.&nbsp; My oldest son, 17, just graduated from public high school ( HOORAYY)&nbsp; When I started out on my homeschooling journey, a few months before I actually took them out of school, I started by doing my own homework.&nbsp; I began searching for every type of resource and support group I could find.&nbsp; I assumed I would do school at home, although in a very relaxed fashion.&nbsp; I had never heard of unschooling.&nbsp; My research brought me again and again&nbsp;to unschooling and the concept planted itself in my brain it felt right. I decided that school at&nbsp; home was for the birds.. lol.. and I knew that we would be unschooling. &nbsp;I began to realize that homeschooling support in general is usually pretty easily found.. Most areas have several&nbsp; real time hs support groups, but unschooling is a much more rare bird, especially &quot;total unschooling&quot;&nbsp; ( which I perfer to &quot;radical&#39; unschooling).&nbsp; I, as most others, turned to the Internet to find the interaction,&nbsp; support and guidance in my unschooling&nbsp;journey.&nbsp;</font></div>\n<div><font face=\"Arial\" size=\"2\">&nbsp;I realize, when one is trying something on for the first time, perhaps going headlong into adversity from family, friends and even thier own &quot;self talk&quot;, you feel an overwhelming need to seek out support and validation.&nbsp;Many new unschoolers end up on&nbsp;one of the many email lists that have been formed.&nbsp;Being a member of an online group&nbsp;is not a bad thing, it can be very rewarding, informative, and supportive.. But, in my own experience, online groups are NOT the best source for REAL LIFE support, resources, and guidance.&nbsp;&nbsp;&nbsp; Your quest becomes cluttered and takes on inconsequential tangets that have little significance in your actual day to day life.. Things like defining unschooling and trying to place how one&nbsp;unschools&nbsp;in varying degrees of &quot;right&quot; and &quot;wrong&quot;&nbsp;hinder from actually learning anything about the lifestyle. &nbsp;&nbsp; Personal conflicts only deter your path to unschooling,&nbsp; they do NOT enable it.&nbsp;&nbsp; </font></div>\n<div>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Finally, my &quot;friendly advice&quot;.&nbsp; New unschoolers should put all of thier efforts into finding like minded familes in thier area.&nbsp;&nbsp; Meet them, visit with them, play with them, learn from them.&nbsp; There may be only one family within driving distance that unschools, maybe a few if you are lucky.&nbsp;&nbsp; Make it a specific point to find them.. search local hs groups.. make it known that you are an unschooler and looking for other familes to get together.&nbsp;&nbsp; Even within our VERY &quot; Bible belt, southern baptist, school at home&quot; area.. we have a handful of unschoolers that live within&nbsp;an hour of us.. And even more as close as 2 hours away.&nbsp;&nbsp; Living an hour apart, meeting halfway IS doable. and well worth the effort.&nbsp; Establish real life friendships, make those folks your email buddies. &nbsp;Exchange stories and toss ideas off of each other.&nbsp;&nbsp;Offer support, commiseration, shared joy and enthusiasm.&nbsp;&nbsp;Watch unschooling happen in a real, day to day situation.</font></div>\n<div>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">It may seem like I am making this sound &quot;too easy&quot;. and you may think, &quot;&nbsp;Yeah right, thats not going to happen to me&quot;.&nbsp; Believe me, IT WILL happen if you want it to. It&nbsp; has nothing to do with luck, it has to do with effort.&nbsp;&nbsp;&nbsp;I do feel very lucky that I met Pam&nbsp;Genant via a &quot;regular&quot;&nbsp;hs support group for NC.&nbsp; Her boys, 7 and 9, have never been to school, they are &quot;lifers&quot;... have been unschooling since birth..&nbsp; It is luck that Pam&#39;s boys and my son are in the same age range.. It&#39;s luck that they really like each other.. and probably luck that Pam and I like each other too.. LOL..&nbsp;&nbsp; But, as wonderful as it has been to be friends with a veteran unschooler.. I can not discount the other interaction I have had with other unschoolers in our area.&nbsp; Pam and I set out on a quest to bring unschoolers together in NC.&nbsp; We created a yahoo group ( and here I am saying to NOT look towards groups.. lol)...&nbsp; But, the intent of our group is not only to have &quot;list discussions&quot;.. which we do, and they are very inspiring and helpful, but foremost to provide opportunities for unschoolers to actually meet and get to know each other.&nbsp; This network of likeminded folks&nbsp;has helped me more than any amount of bickering and arguing on an unschooling list full of folks that I will probably never meet.&nbsp;&nbsp;</font></div>\n<div>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">&nbsp;Please, if you take any bit of this email to heart.. let it be my urgence to seek&nbsp;out and connect with other unschoolers who can offer real time support and guidance.&nbsp; Someone you can pick up the phone and call in a moment of crisis... someone you can send an email to just to share an exciting moment in your day.&nbsp;&nbsp; Find&nbsp;unschoolers to go the park, museum, pool, zoo, movies, out to lunch with your family.&nbsp;&nbsp;This type of&nbsp;mentoring and involvment is what will make your&nbsp;unschooling journey fall into place more naturally.&nbsp;&nbsp; The only thing I can advise above this endeavor is just to enjoy&nbsp;your children.&nbsp; Enjoy them.. trust them, nurture them. and do the&nbsp;same for yourself.&nbsp; Don&#39;t sweat the small stuff, and do not allow yourself to be sucked into a vacuum of negativity that feels like you are back in school yourself.&nbsp; Get out and get living!</font></div>\n<div>&nbsp;</div>\n<div>Teresa</div>\n<div>&nbsp;</div></div>\n<div><font face=\"Arial\" size=\"2\" FAMILY=\"SANSSERIF\"><img SRC=\"cid:X.MA1.1086010524@...\" title=\"\" height=\"33\" alt=\"\" width=\"40\" border=\"0\" ID=\"ygrps-yiv-1967644097MA1.1086010524\"></font><font face=\"Arial\" color=\"#0000ff\" size=\"2\" FAMILY=\"SANSSERIF\"><b>Usborne Books! </b><br><b><i>Contact me for all of your Usborne Book needs:</i></b></font><font face=\"Arial\" color=\"#0000ff\" size=\"3\" FAMILY=\"SANSSERIF\"><br></font><font face=\"Arial\" color=\"#0000ff\" size=\"2\" FAMILY=\"SANSSERIF\">Buy or sell Usborne Books * Book Fairs * Home Parties * Fund Raisers<br><b>Teresa Blalock<br>Teresabnnc@... 828-465-2032<br><a rel=\"nofollow\" title=\"http://usbornewebstore.com/\" target=\"_blank\" href=\"http://usbornewebstore.com/\">http://usbornewebstore.com/</a></b></font></div></html></div>","specialLinks":[]}],"prevTopicId":106,"nextTopicId":123}}