{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"wideaware","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Everyone on board","postDate":"1277739891","msgId":44449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsbU00UUZleFNrNEdsWncwdEJ3X1h5Mm5mZUxHbkZXRDQ3UWhBQkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkwYTVqcytpMTEyQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwYTVqcytpMTEyQGVHcm91cHMuY29tPg=="},"prevInTopic":44441,"nextInTopic":0,"prevInTime":44448,"nextInTime":44450,"topicId":44438,"numMessagesInTopic":0,"msgSnippet":"Hi, I am in a similar position. My husband agrees freely about the damage done by schools, but sees them as a necessary evil, non-negotiable. I see respect and","messageBody":"<div id=\"ygrps-yiv-774657478\">Hi,<br/>\n<br/>\nI am in a similar position. My husband agrees freely about the damage done<br/>\nby schools, but sees them as a necessary evil, non-negotiable. I see respect<br/>\nand freedom for my child as something non-negotiable.<br/>\n<br/>\nWe are lucky, as our son is a baby, so we have plenty of time to arrive at a<br/>\nmutually thought out choice and while he isn&#39;t interested in hearing me talk<br/>\nabout unschooling, he does act in a way that is caring in the little time he<br/>\nspends with our son.<br/>\n<br/>\nIt is easier with him away for me too, but I have started seeing that it<br/>\nisn&#39;t so much about our son or unschooling as it is about the state of the<br/>\nrelationship between the two of us. Both of us have made very hurtful<br/>\nchoices in the way we are with each other and we have not managed to move<br/>\nmuch toward being in harmony in some aspects which tend to flare when we<br/>\nspend time together.<br/>\n<br/>\nOne thing that I think helped was being part of an unschooling camp. While<br/>\nmy husband held himself aloof, he also was seeing a lot of things. On our<br/>\nreturn, he brought up a lot of things like &quot;how can those parents let their<br/>\nkids eat anything they like?&quot;. While it all seemed critical on the surface,<br/>\nI noticed that he didn&#39;t criticize the respect or freedom given to children<br/>\nin many ways traditionally associated with learning. Also, he was<br/>\nquestioning what he was seeing, which is an indication of interest and<br/>\ncuriosity about how things happened. We have a lot of time. So I guess it<br/>\nwas &#39;good enough&#39; for me at that stage that he registered what it all seemed<br/>\nto be about and seemed okay as a whole except for some aspects. He formed<br/>\nrelationships with people there, that he initiated interaction with later on<br/>\nsubjects unrelated with unschooling. I see this as a tentative exploration<br/>\naround the edges, which will allow him to find out as much or as little as<br/>\nhe desires (it is shaking a lot of his beliefs). We have all the time it<br/>\ntakes.<br/>\n<br/>\nI don&#39;t know if this helps your situation if the decision is more immediate.<br/>\n<br/>\nAnother thing that I struggle with is seeing this as a joint decision. I am<br/>\nso convinced about unschooling, that it is difficult for me to consider<br/>\nschooling as a possibility for my child. Yet, isn&#39;t this exactly how he<br/>\nfeels about schooling? I am learning to trust that both of us want the best<br/>\nof life for Nisarga. So I am learning about what he values about schooling<br/>\nand sharing what I value about unschooling and also what we dislike. I am<br/>\nhoping that we will evolve into being able to agree on things we both like<br/>\nor dislike which will help us find a mutual choice. I am the biggest<br/>\nobstacle to this, unfortunately. i tend to slip into thinking I know school<br/>\nand I don&#39;t like it, forgetting that the point is what he likes about it,<br/>\nwhich makes him defensive.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Everyone on board","postDate":"1277739267","msgId":44441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwYWZlMys0OHY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwYTVqcytpMTEyQGVHcm91cHMuY29tPg=="},"prevInTopic":44438,"nextInTopic":44449,"prevInTime":44440,"nextInTime":44442,"topicId":44438,"numMessagesInTopic":0,"msgSnippet":"... ************** What has to give first is expectations. From your perspective this has been a gradual change, but your dh hasn t been around enough to","messageBody":"<div id=\"ygrps-yiv-1764663658\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;elguthaus&quot; &lt;eguthaus@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  The last thing I want to do is make him feel guilty about things, but something has to give.<br/>\n </span></blockquote>**************<br/>\n<br/>\nWhat &quot;has to give&quot; first is expectations. From your perspective this has been a gradual change, but your dh hasn&#39;t been around enough to have that experience. From his perspective, you pulled a rug out from under his feet! Even if he likes the *idea* of unschooling its going to take him time to adjust *and* time to learn new skills. That&#39;s going to take him longer, too, because he doesn&#39;t have as much time to practice, and he&#39;s under pressure. Its rough learning something new with someone standing over you correcting your every move - you wouldn&#39;t do that with your kids, right? Its not any easier on your spouse. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He just can&#39;t seem to let go of &#39;the old way&#39; of doing things <br/>\n<br/>\n </span></blockquote>Does he want to? What does he see as his role as a parent? How does he feel about that role, about being a dad? Those are useful things to talk about! Chances are he loves his kids and wants &quot;the best&quot; for them, whatever that is - its important to acknowledge that and express some appreciation for him as a parent and a person. He&#39;s not trying to make you crazy or wreck his kids&#39; lives, after all ;)<br/>\n<br/>\nOne of the biggest barriers to dads (generic for &quot;working partners&quot;) getting comfortable with unschooling is a sense that their feelings and values don&#39;t count. That can leave dads feeling like all this so-called &quot;peace and freedom&quot; is at the expense of them as wage-slaves - not a good recipe for getting anyone on board! So it can help a whoooole lot to extend the same kinds of principles you bring to your relationship with your kids to that with your partner. Be kind and gentle and trust that they Will learn what they need to know, but maybe not in ways you expect, and they Will make decisions and do things differently than you do.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m not sure how else to communicate with him so that I don&#39;t feel like I&#39;m constantly correcting him or undermining what his expectations are.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nDon&#39;t correct - it doesn&#39;t help adults any more than kids. If he&#39;s going to spank someone, intervene, but other than that he&#39;ll need to develop his own way of relating to the kids. If he seems to be struggling, it can help to talk about that outside the moment - ask him what he&#39;d like you do to. Butt out? Offer ideas? Jump to his rescue? I love it when George jumps to my rescue, but we&#39;ve also talked about that, about saving each other from being the parents we Don&#39;t want to be. So George jumping in doesn&#39;t feel like &quot;correction&quot; it feels like my knight in shining armor is saving the day!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s recently started working part time and the days/evenings when he&#39;s gone have been so much more peaceful.<br/>\n </span></blockquote>**************<br/>\n<br/>\nAnother issue that&#39;s complicating everything is that this is a transitional time. He&#39;s in school, which means periodic transitions right there, plus he&#39;s in school for a reason (I assume) and intends to be getting a full-time job once he&#39;s done. Its a screwy situation because nothing he&#39;s doing right now feels permanent and stable. That&#39;s going to feed in to any resistance to change - his life is changing every three months and you want to change the stable center of his universe: the home. That&#39;s hard on anyone. <br/>\n<br/>\nOver the winter I had a temporary lay-off and it was challenging for me to find ways to fit myself back into family life. I had the advantage of having been the at-home parent for years, and the advantage of a really solid partnership with George, but it was still challenging - and awkward transition. Be as gentle as you possibly can be with your partner. Talk about your feelings and needs for sure, but be as attentive and responsive to his as you can, too. It will help him understand unschooling on a gut level if you do, and dads who understand unschooling deep down can become fantastic advocates and champions of your lifestyle. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":441747317,"authorName":"elguthaus","from":"&quot;elguthaus&quot; &lt;eguthaus@...&gt;","profile":"elguthaus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Everyone on board","postDate":"1277729212","msgId":44438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwYTVqcytpMTEyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44441,"prevInTime":44437,"nextInTime":44439,"topicId":44438,"numMessagesInTopic":0,"msgSnippet":"Has anyone faced major roadblocks with their spouse when it comes to unschooling?  I ve been in process of transitioning our family to an unschooling frame of","messageBody":"<div id=\"ygrps-yiv-2114524516\">Has anyone faced major roadblocks with their spouse when it comes to unschooling?  I&#39;ve been in process of transitioning our family to an unschooling frame of mind as well as a much more relaxed parenting style (just not quite in  line with what I would consider radical unschooling) over the past 3 or so months.  During the initial stages, DH wasn&#39;t around much as we was finishing up the end of his school year (he&#39;s a full time Master&#39;s student) and was really busy with papers etc.  Things were going fairly well...and then he reentered the home scene full time.  Let&#39;s just say that the past month to 6 weeks has felt chaotic, disasterous and unrestful!  <br/>\n<br/>\nWe have talked about how for me as the primary care giver, unschooling is a natural fit with how I roll with our kids.  He just can&#39;t seem to let go of &#39;the old way&#39; of doing things and I&#39;m not sure how else to communicate with him so that I don&#39;t feel like I&#39;m constantly correcting him or undermining what his expectations are.  In turn, there&#39;s much more of the &#39;old&#39; infiltrating our life right now and it feels yuck.<br/>\n<br/>\nHe&#39;s recently started working part time and the days/evenings when he&#39;s gone have been so much more peaceful.  The last thing I want to do is make him feel guilty about things, but something has to give.</div>","specialLinks":[]}],"prevTopicId":44442,"nextTopicId":44436}}