{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Safety / personal boundaries","postDate":"1168130966","msgId":20342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucGcybStrODFuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE4QjQ3Nzk3LUFDNkItNEFBMy04RjVGLUIwNDcyNjcxREYwMUB1bmVyem9nZW4uZGU+"},"prevInTopic":20335,"nextInTopic":0,"prevInTime":20341,"nextInTime":20343,"topicId":20292,"numMessagesInTopic":0,"msgSnippet":"... trust ... what ... I used to think tv was dangerous , some of my friends still do and are aghast at my recent sell out . The rest want to know if they ","messageBody":"<div id=\"ygrps-yiv-504091073\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Johanna &lt;dialog@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It is true, that we *trust* our children more ? but isn&#39;t this <br/>\n </span></blockquote>trust  <br/>\n<blockquote><span title=\"ireply\"> &gt; also based on they way we define what is &quot;dangerous&quot; for us and <br/>\n </span></blockquote>what  <br/>\n<blockquote><span title=\"ireply\"> &gt; not?<br/>\n<br/>\n </span></blockquote>I used to think tv was &quot;dangerous&quot;, some of my friends still do and <br/>\nare aghast at my recent &quot;sell out&quot;. The rest want to know if they <br/>\ncan come watch the playoffs....<br/>\n<br/>\nI think the difference is not so much a different definition as a <br/>\nwillingness to challenge our own boundaries and question our own <br/>\ndefinitions. Watching my own kid in real life has led me to <br/>\nchallenge all sorts of previously held ideas about food, media, <br/>\nviolence, and learning. I&#39;ve seen friends go through a similar <br/>\nprocess. But only friends who are willing to challenge their own <br/>\nTruths. That&#39;s hard. It can feel like giving up a little bit of Who <br/>\nWe Are. And to some extent, that&#39;s what it is. <br/>\n<br/>\nI&#39;m certainly not the same person I was five years ago. But I didn&#39;t <br/>\nexpect to be, either. <br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":285320662,"authorName":"Johanna","from":"Johanna &lt;dialog@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Safety / personal boundaries","postDate":"1168127864","msgId":20335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4QjQ3Nzk3LUFDNkItNEFBMy04RjVGLUIwNDcyNjcxREYwMUB1bmVyem9nZW4uZGU+"},"prevInTopic":20293,"nextInTopic":20342,"prevInTime":20334,"nextInTime":20336,"topicId":20292,"numMessagesInTopic":0,"msgSnippet":"Hello Sylvia ... No, they just think, it is dangerous if watched all day and therefore should be limited to some hours daily only. Or should be introduced ","messageBody":"<div id=\"ygrps-yiv-1305881217\">Hello Sylvia<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do these parents really think their child is never going to see a  <br/>\n&gt; TV in his life, never going to use fire in his life?<br/>\n<br/>\n </span></blockquote>No, they just think, it is dangerous if watched all day and therefore  <br/>\nshould be limited to some hours daily only. Or should be introduced  <br/>\nlater, when the kids are more able to &quot;know the difference between  <br/>\nreality and fiction&quot; or whatever. Or they think if they&#39;d have to  <br/>\nwatch tv with them all day to guide and explain, they&#39;d rather limit  <br/>\nit because they just don&#39;t habe time.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  At some point in life, everyone needs to know how to use fire --  <br/>\n&gt; camping, lighting the pilot on the furnace or stovetop, candles,  <br/>\n&gt; etc. Fire is captivating and kids who don&#39;t know have any real-life  <br/>\n&gt; experience in how it works -- in a controlled setting with a parent  <br/>\n&gt; involved -- often feel compelled to experiment with it. That&#39;s the  <br/>\n&gt; real danger.<br/>\n<br/>\n </span></blockquote>I agree with you and I feel a lot more comfortable knowing that my 7- <br/>\nyear-old daughter knows how to handle and extinguish fire, for  <br/>\ninstance, when I go outside of the house. But these parents think  <br/>\nthat whatever... young children don&#39;t have the motoric ability or...  <br/>\njust responsability to handle fire responsibly, and therefore should  <br/>\nlearn to handle fire with they are *older* (not never, of course).  <br/>\nAlso, these parents usually have been raised the same way and were  <br/>\nnever allowed to play with fire either, and they &quot;turned out well&quot;  <br/>\nanyway, and at some point, just later, older, they learned to handle  <br/>\nfire anyway (well some didn&#39;t ;-))...<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Sure, TV can bring some dangerous thoughts in (I guess, not really  <br/>\n&gt; my belief, but to some it seems dangerous) and fire can hurt. It&#39;s  <br/>\n&gt; the (perceived) danger in these actions that makes it more  <br/>\n&gt; important to find a way to facilitate your child&#39;s exploration.  <br/>\n&gt; Give them a safe enviroment, with you there to show them the  <br/>\n&gt; dangers, and how to protect themselves and others. Guide them,  <br/>\n&gt; don&#39;t limit them.<br/>\n<br/>\n </span></blockquote>I think they don&#39;t think about &quot;just some thoughts&quot; TV might bring in  <br/>\nor that fire hurts. They are thinking about neurons in the brain that  <br/>\ndon&#39;t connect well, addiction to TV, the whole house burning, the kid  <br/>\nfeeling very competent with fire while he isn&#39;t yet and then letting  <br/>\ncandles lit somewhere unattended... It doesn&#39;t matter how you explain  <br/>\nthat TV is not bad, they will believe that TV is bad because books,  <br/>\nmagazines, e-zines and everybody is saying it, based on &quot;studies&quot; and  <br/>\nso on. TV itself broadcastes shows saying how bad high TV consum is  <br/>\nfor kids, and when they let their kids do it (after limiting, of  <br/>\ncourse), they seem them watching TV all day and think &quot;aha, addicted&quot;.<br/>\n<br/>\nAnyway, no matter if it is the case or not – who can say that  <br/>\nobjectively anyway? – the thing is, that they have another definition  <br/>\nof what is already dangerous and what not.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There&#39;s also the loss of trust and credibility issue for those  <br/>\n&gt; parents. If a Mom tells her child, &#39;fire is bad - it will hurt you  <br/>\n&gt; -- stay away from it&#39; but he see her light a candle or start a  <br/>\n&gt; fire, and it looks safe for her (after all she doesn&#39;t get hurt)  <br/>\n&gt; she&#39;s been contradictory. Why would Mom do something she&#39;s told me  <br/>\n&gt; is always dangerous? Then someday he or some other child he knows  <br/>\n&gt; lights a match or lighter and isn&#39;t hurt. He thinks, &quot;okay so now  <br/>\n&gt; Mom lied to me -- it isn&#39;t always dangerous.&quot;<br/>\n<br/>\n </span></blockquote>That might be true for some parents, but not for all. The one&#39;s I&#39;m  <br/>\ntalking about are honest with their children and tell them: &quot;I think  <br/>\nit is dangerous for kids, because you don&#39;t have the ability to  <br/>\nhandle it yet. Sometimes it might be OK and nothing happens, but  <br/>\nsometimes not. Therefore I limit it&quot; - they don&#39;t say it&#39;s 100%  <br/>\ndangerous you see? So when the kids do it on their own secretly they  <br/>\nmight find out it doesn&#39;t hurt, but mom said it didn&#39;t hurt all the  <br/>\ntime, so it wasn&#39;t a lie. And they would tell their children, that  <br/>\nthey can do it &quot;when they are older&quot;, and they are really allowed to  <br/>\ndo it, when they are older.<br/>\n<br/>\nAnyway, it&#39;s still &quot;dangerous&quot; to do it this way, because the  <br/>\nchildren will feel how their parents don&#39;t trust them – but, this was  <br/>\nnot my question.<br/>\n<br/>\nIt is true, that we *trust* our children more – but isn&#39;t this trust  <br/>\nalso based on they way we define what is &quot;dangerous&quot; for us and what  <br/>\nnot?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But he can&#39;t tell her he&#39;s made this observation because she&#39;s  <br/>\n&gt; already told him &#39;no, you can&#39;t do that.&#39; He&#39;ll be in trouble with  <br/>\n&gt; her -- he&#39;d rather take his chances with fire. How is he going to  <br/>\n&gt; figure out when/where/how fire is safe? Does this very concerned  <br/>\n&gt; parent really want her child figuring this out entirely on his own?<br/>\n&gt;<br/>\n </span></blockquote>Well just later!<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n&gt;&gt; While others see a safety issue in letting their kids go naked on the<br/>\n&gt;&gt; street in winter, I don&#39;t. People don&#39;t just force their kids socks<br/>\n&gt;&gt; on without reason, they do it, because they think it&#39;s not safe (they<br/>\n&gt;&gt; fear they get ill).<br/>\n&gt;<br/>\n&gt; This is one is just silly -- people don&#39;t get sick from having wet,  <br/>\n&gt; cold feet. If one continued to be cold and wet, until one was tired  <br/>\n&gt; -- and did so for days on end, the immune system might be weakened  <br/>\n&gt; and that person might become ill in the presence of a virus, but  <br/>\n&gt; illness doesn&#39;t spring forth from allowing a child to be barefoot  <br/>\n&gt; on a cold or wet street.<br/>\n<br/>\n </span></blockquote>I agree – but this friend thinks this is already dangerous. I know  <br/>\nit&#39;s even more dangerous to trying to protect your immune system from  <br/>\nillnesses, but she just fears them. And this is because she defines  <br/>\n&quot;safety&quot; differently.<br/>\n<br/>\nGreetings<br/>\nJohanna<br/>\n<br/>\n<br/>\n--<br/>\nUnerzogen! | <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dialog@...\">dialog@...</a> | <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unerzogen.de\">http://www.unerzogen.de</a> |  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unerzogen-subscribe@...\">unerzogen-subscribe@...</a></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Safety / personal boundaries","postDate":"1168086341","msgId":20293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwMTA2MTIyNTQxLjE5MzkucW1haWxAd2ViNTM4MDIubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDg2QkY5QjQ4LUUyMDMtNDYwOC1BQzQyLTA0MUIzNkY3ODkzQkB1bmVyem9nZW4uZGU+"},"prevInTopic":20292,"nextInTopic":20335,"prevInTime":20292,"nextInTime":20294,"topicId":20292,"numMessagesInTopic":0,"msgSnippet":"While others see a safety issue in watching TV, I don t. You see what I mean? People don t just limit watching TV or playing video games just because , but","messageBody":"<div id=\"ygrps-yiv-206231421\">While others see a safety issue in watching TV, I don&#39;t. You see what  <br/>\nI mean? People don&#39;t just limit watching TV or playing video games  <br/>\njust &quot;because&quot;, but because it they think it&#39;s not safe.<br/>\n<br/>\nWhile others are afraid of letting their kids play with fire, I am  <br/>\nnot. They don&#39;t just limit and not help them with learning about  <br/>\nfire, because they &quot;want to&quot; use their &quot;power&quot;, they do it, because  <br/>\nthey truely believe that this is a safety issue<br/>\n   <br/>\n  *****<br/>\n<br/>\n  I think in these situations, saying NO because it&#39;s a safety issue is very short-sighted.<br/>\n   <br/>\n  Do these parents really think their child is never going to see a TV in his life, never going to use fire in his life?  If so, they&#39;re mistaken.  TV is everywhere and kids who can&#39;t watch it at home will watch it elsewhere -- in childhood and adulthood.  At some point in life, everyone needs to know how to use fire -- camping, lighting the pilot on the furnace or stovetop, candles, etc.  Fire is captivating and kids who don&#39;t know have any real-life experience in how it works -- in a controlled setting with a parent involved -- often feel compelled to experiment with it. That&#39;s the real danger.  <br/>\n   <br/>\n  Sure, TV can bring some dangerous thoughts in (I guess, not really my belief, but to some it seems dangerous) and fire can hurt.  It&#39;s the (perceived) danger in these actions that makes it more important to find a way to facilitate your child&#39;s exploration. Give them a safe enviroment, with you there to show them the dangers, and how to protect themselves and others.  Guide them, don&#39;t limit them.<br/>\n   <br/>\n  There&#39;s also the loss of trust and credibility issue for those parents. If a Mom tells her child, &#39;fire is bad - it will hurt you -- stay away from it&#39; but he see her light a candle or start a fire, and it looks safe for her (after all she doesn&#39;t get hurt) she&#39;s been contradictory.  Why would Mom do something she&#39;s told me is always dangerous?  Then someday he or some other child he knows lights a match or lighter and isn&#39;t hurt. He thinks, &quot;okay so now Mom lied to me -- it isn&#39;t always dangerous.&quot;  But he can&#39;t tell her he&#39;s made this observation because she&#39;s already told him &#39;no, you can&#39;t do that.&#39; He&#39;ll be in trouble with her -- he&#39;d rather take his chances with fire.  How is he going to figure out when/where/how fire is safe?  Does this very concerned parent really want her child figuring this out entirely on his own?  <br/>\n   <br/>\n  Now substitute the word drugs or sex for fire above -- that&#39;s how it extends when parents just say no and shut down all reasonable discussion, which is what arbitrary no does. Kids learn that Mom is lying to them, because she doesn&#39;t think they have the ability to learn this new skill, try this new thing.   So they don&#39;t consult her  -- after all, she&#39;d only say no.<br/>\n   <br/>\n  *****<br/>\nWhile others see a safety issue in letting their kids go naked on the  <br/>\nstreet in winter, I don&#39;t. People don&#39;t just force their kids socks  <br/>\non without reason, they do it, because they think it&#39;s not safe (they  <br/>\nfear they get ill).<br/>\n<br/>\n  This is one is just silly -- people don&#39;t get sick from having wet, cold feet.  If one continued to be cold and wet, until one was tired -- and did so for days on end, the immune system might  be weakened and that person might become ill in the presence of a virus, but illness doesn&#39;t spring forth from allowing a child to be barefoot on a cold or wet street.  <br/>\n   <br/>\n  Sylvia <br/>\n<br/>\n<br/>\n          Gary (dh)<br/>\n  Will (almost 22!) Andy (10-1/2) and Dan (almost 6) <br/>\n   <br/>\n      Peace is the vibrant space which stimulates the dance of kindness, merriment and freedom. ~ unknown<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourhapahome.blogspot.com\">http://ourhapahome.blogspot.com</a><br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":285320662,"authorName":"Johanna","from":"Johanna &lt;dialog@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Safety / personal boundaries","postDate":"1168081759","msgId":20292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2QkY5QjQ4LUUyMDMtNDYwOC1BQzQyLTA0MUIzNkY3ODkzQkB1bmVyem9nZW4uZGU+"},"prevInTopic":0,"nextInTopic":20293,"prevInTime":20291,"nextInTime":20293,"topicId":20292,"numMessagesInTopic":0,"msgSnippet":"Hello Ren, ... I agree. But talking with others who think they parent rather peacefully, I often come across the argument, that my personal boundaries seem to","messageBody":"<div id=\"ygrps-yiv-1502127680\">Hello Ren,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I see most &quot;no&#39;s&quot; as a closed door. My goal is to be more creative<br/>\n&gt; than that. If I say &quot;no&quot;, it has something to do with safety or<br/>\n&gt; personal boundaries. (Ren Allen)<br/>\n<br/>\n </span></blockquote>I agree. But talking with others who think they parent rather  <br/>\npeacefully, I often come across the argument, that my personal  <br/>\nboundaries seem to just be a lot lower than other people&#39;s and my  <br/>\ndefintion of safety is just a lot &quot;freeer&quot; than that of most people.<br/>\n<br/>\nWhile others see a safety issue in watching TV, I don&#39;t. You see what  <br/>\nI mean? People don&#39;t just limit watching TV or playing video games  <br/>\njust &quot;because&quot;, but because it they think it&#39;s not safe.<br/>\n<br/>\nWhile others see a safety issue in letting their kids go naked on the  <br/>\nstreet in winter, I don&#39;t. People don&#39;t just force their kids socks  <br/>\non without reason, they do it, because they think it&#39;s not safe (they  <br/>\nfear they get ill).<br/>\n<br/>\nWhile others are afraid of letting their kids play with fire, I am  <br/>\nnot. They don&#39;t just limit and not help them with learning about  <br/>\nfire, because they &quot;want to&quot; use their &quot;power&quot;, they do it, because  <br/>\nthey truely believe that this is a safety issue.<br/>\n<br/>\n<br/>\nSo I&#39;m kind of stuck  here – do I –do we– just have lower limits,  <br/>\nlower boundaries, a looser view of safety?<br/>\n<br/>\nI agree though, there are parents who just &quot;use their power&quot; over  <br/>\ntheir kids and really randomly apply limits and so on, tell them lies  <br/>\nand just try to form their kids into a mold they believe it&#39;s best.  <br/>\nBut I have met some who are very close to what I&#39;d call radical  <br/>\nunschoolers, but just have other views on what is safe and what is  <br/>\nnot. They just want to protect their kids from bad things to happen  <br/>\nto them.<br/>\n<br/>\nWho is to say what is objectively &quot;safe&quot; or not?<br/>\n<br/>\nWho can help me thinking this further?<br/>\n<br/>\nGreetings from Germany :-)<br/>\n<br/>\nJohanna<br/>\n(P.S.: German mailinglist growing every week :-) We are 66 now and  <br/>\nvery talkative :-) Yay!)<br/>\n<br/>\n<br/>\n--<br/>\nUnerzogen! | <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dialog@...\">dialog@...</a> | <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unerzogen.de\">http://www.unerzogen.de</a> |  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unerzogen-subscribe@...\">unerzogen-subscribe@...</a></div>","specialLinks":[]}],"prevTopicId":20341,"nextTopicId":20345}}