{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Introduction/Media overload?/Needs/Coping","postDate":"1294155860","msgId":45768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExM0Y4RDk1LUVFQjQtNEM1Mi1BMDRFLTRDQ0Q4MThGNzY1NUBnbWFpbC5jb20+","inReplyToHeader":"PGlmdTdwMCtkcXByQGVHcm91cHMuY29tPg==","referencesHeader":"PGlmdTdwMCtkcXByQGVHcm91cHMuY29tPg=="},"prevInTopic":45767,"nextInTopic":0,"prevInTime":45767,"nextInTime":45769,"topicId":45766,"numMessagesInTopic":0,"msgSnippet":"I plan to answer in more detail but my inital thoughts are you ve just had a new baby, a big move, an enlongated seperation from you partner, removal from","messageBody":"<div id=\"ygrps-yiv-1637018660\">I plan to answer in more detail but my inital thoughts are you&#39;ve just  <br/>\nhad a new baby, a big move, an enlongated seperation from you partner,  <br/>\nremoval from school and wishy-washy parenting. That&#39;s all a lot of  <br/>\nstress for everyone. Don&#39;t waste your energy on feeling bad. Use it to  <br/>\nfind healthier parenting skills. Fill your tool box.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 3, 2011, at 8:30 PM, &quot;mbyerly77&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mbyerly77@...\">mbyerly77@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Hello. I recently joined your discussion group and was hoping to  <br/>\n&gt; receive some suggestions and/or perspective for some problems that I  <br/>\n&gt; am experiencing. Here is a description.<br/>\n&gt;<br/>\n&gt; I have 3 daughters ages 5, 3, and 3 months. We started deschooling  <br/>\n&gt; in September after removing my 5 y.o. from public school.<br/>\n&gt;<br/>\n&gt; She attended school for 6 weeks (it was a year-round school starting  <br/>\n&gt; in summer). My husband and I decided to let her try because she had  <br/>\n&gt; expressed a strong interest.<br/>\n&gt;<br/>\n&gt; In hindsight I think that she desperately wanted to go because she  <br/>\n&gt; feared I had screwed up somehow; in telling her she did not have to  <br/>\n&gt; go and I could homeschool, it was like saying &quot;you don&#39;t have to pay  <br/>\n&gt; taxes&quot; or some other requirement of life. I think she &quot;got&quot; that it  <br/>\n&gt; was an accepted thing –everyone from strangers to family would ask a <br/>\n&gt; bout it—and that it would come back to haunt her if she did not go.<br/>\n&gt;<br/>\n&gt; In 6 weeks she lost weight, had trouble sleeping, and became so mean  <br/>\n&gt; to my 3 y.o. that she would cry when it was time to pick my 5 y.o.  <br/>\n&gt; up from school. I had a strong desire to unschool and so I convinced  <br/>\n&gt; my husband to at least let me try it.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Introduction/Media overload?/Needs/Coping","postDate":"1294145764","msgId":45767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzMUIwOTBELTBDOEMtNDQyMC1BRkMxLTNEMkUxQ0U1NjQxRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlmdTdwMCtkcXByQGVHcm91cHMuY29tPg==","referencesHeader":"PGlmdTdwMCtkcXByQGVHcm91cHMuY29tPg=="},"prevInTopic":45766,"nextInTopic":45768,"prevInTime":45766,"nextInTime":45768,"topicId":45766,"numMessagesInTopic":0,"msgSnippet":"I think the things that jumped out at me are the stress of life changes and the flip-flopping of rules. Transitioning to choice is hard! The in between period","messageBody":"<div id=\"ygrps-yiv-1178232575\">I think the things that jumped out at me are the stress of life  <br/>\nchanges and the flip-flopping of rules.<br/>\n<br/>\nTransitioning to choice is hard! The in between period *will* be  <br/>\nrough. And you&#39;ve ramped up the roughness with a baby, a move, a new  <br/>\nunpredictable work schedule and inconsistency of rules. I&#39;m thinking  <br/>\nyour 5 yo is feeling like life is unpredictable and out of her  <br/>\ncontrol. Which is why she seems relieved when you take control. There  <br/>\nare short term benefits to you being in control now when life feels  <br/>\nout of control. *But* in the long run there will be big benefits to  <br/>\nher feeling she has control over her life that she has the power of  <br/>\nchoice. She *will* test her limits. She will finding pushing her  <br/>\nlimits in one are is worth a benefit in another area. That&#39;s part of  <br/>\nthe process.<br/>\n<br/>\nThough right now maybe she&#39;s using the computer as a coping mechanism.  <br/>\nThe computer is a good retreat so she keeps using it. But it&#39;s not a  <br/>\ngreat stress relief because it can be stressful in itself and it  <br/>\ndoesn&#39;t make the cause of the stress that she&#39;s trying to escape go  <br/>\naway. Finding good stress relievers is a good life skill. But the  <br/>\nprimary focus for you should be on eliminating as much stress as you  <br/>\ncan. Don&#39;t see it as one big lump that needs swept away. Break it  <br/>\ndown. The big lump is probably made up of dozens of things. Tackle  <br/>\nthem one at a time.<br/>\n<br/>\nMaybe what will help is to turn your thinking around from fixing  <br/>\nwhat&#39;s broken (eg, fixing their happiness) and instead add little &quot;I  <br/>\nlove yous&quot; to your days. They can be verbal. They can be actions like  <br/>\nspontaneous hugs. They can be gifts like a cup of hot chocolate  <br/>\nbrought to the computer while your daughter&#39;s playing. They can be  <br/>\ntime spent with them. They can be time spent individually, especially  <br/>\nwith the 5 yo, like taking her out for mom and daughter time, letting  <br/>\nher set the pace and the things to do. (*If* that&#39;s her personality.  <br/>\nSome kids would rather have others choose things they&#39;d like rather  <br/>\nthan having to choose.)<br/>\n<br/>\nBe aware that everyone perceives love differently. Have you heard of  <br/>\nGary Chapman&#39;s five languages of love?  He lists them as: words of  <br/>\naffirmation, quality time, receiving gifts, acts of service, and  <br/>\nphysical touch.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My husband and I have never seen eye to eye on bedtime. I have had a  <br/>\n&gt; more relaxed attitude toward the kids (wait till they seem tired, do  <br/>\n&gt; what they need) and he wants them to go to sleep at a certain time  <br/>\n&gt; particularly when he wants to spend time alone with me or if he is  <br/>\n&gt; ready to go to sleep.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>He needs to feel his needs are as important to you as the kids&#39; needs.<br/>\n<br/>\nMaybe help him see that if you sent him to bed because you wanted  <br/>\nquality time with the kids he&#39;d be upset and unlikely to go to sleep  <br/>\nand the kids will react exactly the same way. *Not* said in a way that  <br/>\nimplies he shouldn&#39;t want them in bed. *If* that&#39;s the conclusion, he  <br/>\nneeds to come to that himself. Enlist his help in trying different  <br/>\nthings.<br/>\n<br/>\nBut, of course, you&#39;ve got the big stress thing going on that&#39;s making  <br/>\nthe bedtime problem worse so tackling the stress should at least help  <br/>\nwith the bedtime problem.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":365496082,"authorName":"mbyerly77","from":"&quot;mbyerly77&quot; &lt;mbyerly77@...&gt;","profile":"mbyerly77","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction/Media overload?/Needs/Coping","postDate":"1294115424","msgId":45766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlmdTdwMCtkcXByQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45767,"prevInTime":45765,"nextInTime":45767,"topicId":45766,"numMessagesInTopic":0,"msgSnippet":"Hello.  I recently joined your discussion group and was hoping to receive some suggestions and/or perspective for some problems that I am experiencing.  Here","messageBody":"<div id=\"ygrps-yiv-1728464763\">Hello.  I recently joined your discussion group and was hoping to receive some suggestions and/or perspective for some problems that I am experiencing.  Here is a description.<br/>\n<br/>\nI have 3 daughters ages 5, 3, and 3 months.  We started deschooling in September after removing my 5 y.o. from public school. <br/>\n<br/>\nShe attended school for 6 weeks (it was a year-round school starting in summer).  My husband and I decided to let her try because she had expressed a strong interest.  <br/>\n<br/>\nIn hindsight I think that she desperately wanted to go because she feared I had screwed up somehow; in telling her she did not have to go and I could homeschool, it was like saying &quot;you don&#39;t have to pay taxes&quot; or some other requirement of life.  I think she &quot;got&quot; that it was an accepted thing everyone from strangers to family would ask about itand that it would come back to haunt her if she did not go.<br/>\n <br/>\nIn 6 weeks she lost weight, had trouble sleeping, and became so mean to my 3 y.o. that she would cry when it was time to pick my 5 y.o. up from school.  I had a strong desire to unschool and so I convinced my husband to at least let me try it.<br/>\n  <br/>\nSaying yes and having fun was great at first.  We were having more fun and experiencing more joy as a family than we ever had.  Then things started getting difficult<br/>\n<br/>\nWe had been very controlling from time to time with movies and computer games (we own a laptop that is our source of media).  What I mean by that is we were inconsistent.  Not because we were subscribing to some method it was just us as parents.  We would let them watch what they wanted, when they wanted for a while and then it would seem to be a problem, so we would take it away (their right to use and watch when they wanted to) and say you can after dinner or we would have a designated family movie night.  Rereading what I just wrote, I suppose &quot;controlling from time to time&quot; is an inaccurate statement because we were always controlling in that we reserved the right to change our minds and I think our kids felt that.<br/>\n<br/>\nWe tried removing limitations on movies/computer use a few months ago. Part of the problem seemed to be we were using it as a babysitter.  Like oh good, they are occupied now and I/we can talk or get the dishes done, etc.  Watching with them seemed to help the pc not seem like the only option available and also let my oldest in particular know that I was still there for her.  I had a pretty good time of offering other options and while I when I was feeling good (physically) we had plenty of other fun things to do outside, friends, etc.  After the birth of our last child it became a babysitter again (we weren&#39;t limiting their time just ignoring them).  I had an unplanned caeserian, baby blues, etc.  It was a poor choice but at the time it seemed better than yelling or crying (me).  My oldest became angry when I would tell her I needed to go to bed and that she would have to turn off the computer.  She would hit me or my husband or her sister and generally call us names.   Prior to the birth we had been making fires in the backyard at night, playing on a makeshift swing and sometimes sleeping out there.  I am writing this thinkingno wonder she was mad!  I was not offering many other attractive options or when I did we always got interrupted, so my oldest in particular developed what appeared to be an unhealthy attachment to the computer.   She seemed to be escaping or felt that no one cared.  We weren&#39;t giving her what she needed.  She stopped choosing any other activities and would get angry (hit, yell, insult) if anyone bothered her, especially during a video game.  For example, if her sister wanted to watch a movie or be involved somehow, my husband or I wanted to use the computer for a short time, or sometimes someone could touch her or ask her what she wanted to eat then she would get really mad.<br/>\n<br/>\nMy husband and I took it away and returned to movie night.  It was better for all of us at first.  My oldest seemed a lot happier.  She returned to playing pretend with her sister and it re-strengthened their relationship.  Also, she was more willing to talk to me (one of our main means of connecting) and so she was at least getting some of her needs met.<br/>\n<br/>\nMy husband took FMLA when the baby was born and when he returned to work he was given two very unattractive options:  move to a different state or work in different states (frequent travel).  We decided to move so that we could at least be together more of the time.  My husband moved first and we joined him a month later.  Our youngest was barely two months old.<br/>\n<br/>\nAfter moving, my oldest started asking for more moviesa lot.  My husband and I discussed it and decided that this would be it and that we couldn&#39;t go back.  We did not tell them (no limits) but starting saying yes when they asked for a movie, etc.  My oldest started get angry at night when we would say we were going to bed and would hit, etc.  For information&#39;s sake we tried what we knew or what we could think of to entice her away from the computer to wind downbath, books, etc., no go.   She would jump around (she had been sitting on couch or floor or chair most or all of the day) and take at least an hour to fall asleep.  It seemed that she needed to wind down or at least do something else for a while before going to bed.  We have been going to bed later and later!  The other night I tried watching a black and white musical with her and snuggling on the couch with her and the baby and I still had to turn it off at 1 a.m.  The other issue is on days when I am really tired, she picks up on that (I think) and will stay on the computer all day.  Really the issue is not as much about her being on it all day, but that she seems to be staying on the computer beyond what her body is telling her.  After about 5 or 6 hours she will get angry at someone and yell or hit or insult someone.  I started turning it off immediately when she does this.  She will usually get angry at first, mostly her heart is not in it anymore, but then seems almost relieved.  She usually goes to the bathroom, eats something, and then happily plays for hours without even mentioning the computer.  It seems like she is asking for help turning it off.  Am I wrong to turn it off?  Is there a better gradual way to do this?  Any thoughts?<br/>\n<br/>\nSince subscribing to this list and a couple of others, it has helped me delve deeper in our journey.  I have noticed that I stopped listening and responding to my older kidsa lot.  Just yesterday I stepped on my daughter&#39;s foot and did not even notice until she said ow, Mom!  The more I pay attention the more they need.  For me it is spiraling out of control.  Our house looks like a tornado went off, I live in my pajamas most days and I am totally mentally and physically exhausted (plus the unpacked boxes!).  I don&#39;t want to give up!  I want to keep on the deschooling, unschooling journey.  My middle child has told me I am the &quot;best mommy ever!&quot;  three times in the past three days and my oldest confided to me that she wants me to think she is coolpartly made me glad she could tell me, partly made me feel sad that she felt that way.  I feel like I am on the right path, but can&#39;t catch my stride.  Any thoughts on coping?  <br/>\n<br/>\nI took the time to describe my situation so that you could understand the complexity and severity of change and stress that we have experienced in the last few months.  How do you maintain your integrity as a parent and not lose it?  I have always felt like I had to let something go by the wayside in the past in order to cope.  Like, well this is the best I could do or it is out of my control but I really don&#39;t want to do that.  Any suggestions?<br/>\n<br/>\nMy husband and I have never seen eye to eye on bedtime.  I have had a more relaxed attitude toward the kids (wait till they seem tired, do what they need) and he wants them to go to sleep at a certain time particularly when he wants to spend time alone with me or if he is ready to go to sleep.  Figuring it out has been further complicated by his work schedule being so inconsistent.  Any suggestions on bedtimes? Finding time as a couple?<br/>\n<br/>\nThank you in advance for taking the time to read this.<br/>\n<br/>\nBest,<br/>\nMichelle</div>","specialLinks":[]}],"prevTopicId":45752,"nextTopicId":45742}}