{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":99,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:cant always get whatcha want","postDate":"1173289181","msgId":21968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbXRjdCs0c2J1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNGQwMWM3NjBkYyQxODU4MjU1MCQ2NDU4YThjMEBPZmZpY2U+"},"prevInTopic":21965,"nextInTopic":21969,"prevInTime":21967,"nextInTime":21969,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"~~I am teaching my kids that they cannot always have what they want. ~~ I m trying to help my kids see that they can have anything and everything they want in","messageBody":"<div id=\"ygrps-yiv-953858448\">~~I am teaching my kids that they cannot always have what they want. ~~<br/>\n<br/>\nI&#39;m trying to help my kids see that they can have anything and<br/>\neverything they want in this life and to trust their innermost desires<br/>\nand thoughts.<br/>\n<br/>\nI am trying to unlearn the &quot;lesson&quot; you just wrote about in my own<br/>\nlife (after being raised by parents that taught it all too well) and<br/>\nnow realize I can have everything I want, just not all at once!:) I am<br/>\nrelearning to trust my instincts, my desires and my fantasies. I am<br/>\nlearning that &quot;you can&#39;t always have what you want&quot; is a big, fat lie<br/>\nand the people that believe it are the ones that don&#39;t achieve their<br/>\ngoals and dreams.<br/>\n<br/>\nWe work within natural boundaries of budgets, weather, moods and other<br/>\ncircumstances....but I want my kids to know they CAN have what they<br/>\nwant and what they want is not only important, but HUGE clues about<br/>\nwho-they-are and the journey they are creating in this life.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:cant always get whatcha want","postDate":"1173288279","msgId":21965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbXNnbis3b2pvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzbWdhMCtxbjBpQGVHcm91cHMuY29tPg=="},"prevInTopic":21964,"nextInTopic":21968,"prevInTime":21964,"nextInTime":21966,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... that ... Which values? That s a serious question, not a snarky one. I found being really really specific about my values helpful in understanding","messageBody":"<div id=\"ygrps-yiv-292893574\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;shellinispencer&quot; <br/>\n&lt;shellini@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am teaching<br/>\n&gt; my kids that they cannot always have what they want. I dont feel <br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; it is unreasonable to teach them these values.<br/>\n<br/>\n </span></blockquote>Which values? That&#39;s a serious question, not a snarky one. I found <br/>\nbeing really really specific about my values helpful in <br/>\nunderstanding unschooling, even to the point of breaking down big <br/>\nvalues, like &quot;respect&quot; into smaller, component values. <br/>\n<br/>\nIts true that not everything in life is equally possible at the <br/>\nmoment, the question is: how do we deal with that? From my <br/>\nperspective, I want my kids to have the skills to problem solve and <br/>\nthink critically *and* understand how to work through difficult <br/>\nemotions. Saying &quot;you can&#39;t always get what you want&quot; doesn&#39;t do any <br/>\nof that.<br/>\n<br/>\nWhat if you switched to &quot;I&#39;m sorry, that&#39;s just not possible&quot;? That <br/>\nat least has the benefit of acknowledging the feelings involved. Of <br/>\ncourse, it *does* set you up to answer the question &quot;why isn&#39;t it <br/>\npossible?&quot; That&#39;s the sticker. If you don&#39;t have the quick-and-dirty <br/>\nbrush-offs like &quot;I&#39;m the mom, that&#39;s why&quot; and &quot;you can&#39;t always get <br/>\nwhat you want&quot; you have to really think about and answer your kids <br/>\nquestions, and entertain some alternative solutions. Maybe even <br/>\nchange your position - not a bad thing at all! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He will learn to be spoiled if he gets everytihng<br/>\n&gt; he wants.<br/>\n<br/>\n </span></blockquote>I haven&#39;t noticed my 5yo being any more rude or demanding than other <br/>\nkids her age. She does try to find solutions and consider <br/>\nalternatives, which is sometimes inconvenient to *me*! But its <br/>\ncertainly better than what I see her non-unschooled kid friends <br/>\ndoing, which is to sneak around behind their parents&#39; backs to <br/>\nexplore the same kinds of alternatives. <br/>\n<br/>\nMy stepson, before he moved in with us, was a fairly &quot;typical&quot; surly <br/>\nteen - that&#39;s the other dividend you get for &quot;can&#39;t always get what <br/>\nyou want&quot;, a teen who reflects that attitude back atcha. Last night <br/>\nRay was telling me some of the things he&#39;s done to &quot;teach his mom <br/>\nshe can&#39;t always get her way anymore&quot; - Yikes!<br/>\n<br/>\nAt our house, he&#39;s a sweetheart. Yesterday was his first day up from <br/>\nbeing sick and he was falling over himself to be helpful. We&#39;ve <br/>\nnever told him &quot;you can&#39;t always get what you want&quot; - we&#39;ve <br/>\nsaid &quot;lets see if that&#39;s possible&quot; and tried to make it happen. Not <br/>\nalways successfully, but he&#39;s seen us bend over backwards to help <br/>\nhim get what he wants, and he&#39;s grateful. He doesn&#39;t *say* that, but <br/>\nit shows in the ways he&#39;s helpful and friendly and courteous. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If I left him to do what<br/>\n&gt; he wanted, he would eat junk food and play video games all day <br/>\n&gt;long...<br/>\n<br/>\n </span></blockquote>That *is* the way people react when limitations are lifted. My <br/>\nstepson has spent the last...oh, six weeks, I guess, staying up all <br/>\nnight to play Runescape. He&#39;s decided to switch back to being awake <br/>\nin the daytime, though, even though he knows it means less computer <br/>\ntime - one computer/phone line, four users. Natural limits. He <br/>\nmisses doing other things, though. Different limits. He&#39;s learning <br/>\nto negotiate his *own* wants and needs.<br/>\n<br/>\nHe&#39;s gone a similar route with food - he started out eating all the <br/>\nchips, cookies and soda he could get his hands on, and we <br/>\nfacilitated that as much as we could afford. He&#39;s been eating less <br/>\nand less, and yesterday announced he didn&#39;t want any soda for <br/>\nawhile, would we please not buy any? No pressure from us. He doesn&#39;t <br/>\nlike the way it makes him feel. <br/>\n<br/>\nIn the midst of my trying to get this posted, my neighbor&#39;s dh <br/>\nstopped by to say she&#39;s sick and can&#39;t hang with Mo today while Ray <br/>\nand I go to the skatepark. I explained to her that this is really <br/>\nreally important to Ray, and how could we make it possible for her? <br/>\nShe came up with some ideas and loaded up the car. She can&#39;t get <br/>\nwhat she wants today, but she&#39;s thoughtful and creative and willing <br/>\nto work to make the situation possible for All of us. Not bad for 5!<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa Heyman","from":"&quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re:cant always get whatcha want","postDate":"1173287712","msgId":21964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1GOUQ1NzAzRjIwNUI3Njc1QzdDNUMxRDE3QTBAcGh4LmdibD4=","inReplyToHeader":"PGVzbWdhMCtxbjBpQGVHcm91cHMuY29tPg=="},"prevInTopic":21963,"nextInTopic":21965,"prevInTime":21963,"nextInTime":21965,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... Is this a value? Perhaps the value you are really referring to is gratitude for what you do have.  My kids place tremendous value in generosity rather than","messageBody":"<div id=\"ygrps-yiv-1876461485\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;See, I dont see myself as a controlling parent because I am teaching<br/>\n&gt;my kids that they cannot always have what they want. I dont feel that<br/>\n&gt;it is unreasonable to teach them these values. &gt;&gt;<br/>\n<br/>\n </span></blockquote>Is this a value?<br/>\n<br/>\nPerhaps the value you are really referring to is gratitude for what you do <br/>\nhave.  My kids place tremendous value in generosity rather than deprivation. <br/>\n  I don&#39;t have to control what they can or cannot have or do - life dictates <br/>\nthat better than i can.  It doesn&#39;t have to be taught through money <br/>\ncontrols.  On a simple level, not having what they want has been learned <br/>\nthrough loosing a ball game.  To be very drastic in an example - not having <br/>\nwhat they want has been learned through death of loved ones - friends and <br/>\nfamily.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If we are out at a store and my son wants a toy and he just had a birthday <br/>\n&gt;or christmas<br/>\n&gt;or whatever the reason is, I am not going to buy him that toy just<br/>\n&gt;because he wants it.<br/>\n<br/>\n </span></blockquote>Have you ever seen something that really peaked your desire even though your <br/>\nbirthday had just passed?  A wise woman once said to me - if you can afford <br/>\nit why would you withhold it from your child?  Do you withhold purchasing <br/>\nsomething you want (even if it&#39;s not necessary) just because it&#39;s something <br/>\nyou like - a new pair of shoes, a handbag, piece of jewelry, a cd, another <br/>\nsketch pad or journal, a cookie?  There have been times in my family&#39;s life <br/>\nwhen we didn&#39;t have much money to spend on these things - and each purchase <br/>\nhad to be thought out very carefully against our budget.  I feel very <br/>\nblessed that today i don&#39;t have to be as concerned - and want to pass that <br/>\nblessing along to my kids.  It doesn&#39;t mean we don&#39;t discuss the cost and <br/>\nthe possibility of putting money towards something other than what they&#39;ve <br/>\nexpressed interest in (like going to an unschooling conference&lt;g&gt;).<br/>\n<br/>\nWhen my kids were very small and didn&#39;t yet understand limits to spending - <br/>\ni avoided stores with them.  And if that was not possible - i would budget a <br/>\nfew dollars into the shopping list so that they could pick out whatever they <br/>\nwanted beyond the necessities - they knew they had this going into the store <br/>\nand pretty much always worked within the budget.  They were also involved in <br/>\npicking out what the necessities were.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He will learn to be spoiled if he gets everytihng<br/>\n&gt;he wants. &gt;<br/>\n<br/>\n </span></blockquote>This time it was a very wise man who said to me, &quot;something spoils only when <br/>\nit is left on the shelf by itself to rot.&quot;  I think we can only &#39;spoil&#39; a <br/>\nperson by withholding from them not by giving them what they ask for - want <br/>\nor need.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My son is a sensitive child too.. If I left him to do what<br/>\n&gt;he wanted, he would eat junk food and play video games all day long...&gt;<br/>\n<br/>\n </span></blockquote>don&#39;t know your background with this...but have you tried this?  My dd&#39;s <br/>\nhave complete control over anything they want to eat and they always end up <br/>\nasking for &#39;good&#39; food when they need it.<br/>\n<br/>\nOnce my younger dd missed having ice cream after an evening out becaue she <br/>\nfell asleep on the ride home.  she was anxious about getting into the car <br/>\nbecause she knew this might happen.  I promised her that if she fell asleep <br/>\nshe could have ice cream for breakfast, in fact, i said to her, she could <br/>\nhave icecream for breakfast, lunch and dinner and snack in between if she <br/>\nwished.  She could eat icecream all day long.  The next day - she did have <br/>\nice cream for breakfast and lunch.  But by mid day she came to me saying she <br/>\nneeded some &#39;real&#39; food in her body.  She was about 6 at the time.  She <br/>\nloves telling this story (so do i infact) - and since that day (3.5 years <br/>\nago) she asked if she could do that again only once.  I said of course.  But <br/>\nshe has yet to take me up on the offer.<br/>\n<br/>\nI can&#39;t speak personally about video games with my own kids - but i do have <br/>\na friend with a teen son who realized his lightheadedness and naseau came <br/>\nfrom not taking enough breaks from his machines to eat and rest.  He learned <br/>\nthrough personal experience the importance of breaks.  And someone else on <br/>\nthis list recently related their child asking for assistance to be reminded <br/>\nto take breaks so he can accomplish other things that he&#39;s interested in <br/>\nthroughout the day.<br/>\n<br/>\nI can personally attest to being sucked into a machine...but i can also <br/>\nattest to the resentment towards those that try to control me rather than <br/>\ngiving me the time to work out my own solutions to self control when it <br/>\ncomes to machines - or food - or any other obsession i may have.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I mean granted there are parents that say no to everything and are<br/>\n&gt;just NO kind of parents, but we dont say NO to our kids all the time,<br/>\n&gt;and when we do, they are taught to respect that answer.  Is that a<br/>\n&gt;wrong way of thinking when it comes to unschooling?&gt;<br/>\n<br/>\n </span></blockquote>When i say no - my child will ask me why.  The truth is unless there is a <br/>\nvery real reason that is beyond my control for the &#39;no&#39; - i hear the <br/>\narbitrary nature of my &#39;no&#39; and then ask myself what&#39;s really important <br/>\nhere?  What is important is that i can be flexible.  How can i expect or <br/>\nwant them to exhibit the value of flexibility if i can not be flexible?  <br/>\nThat i can discuss with my kids ways to get to yes.  That they feel <br/>\nempowered and a sense of control over their own life.  I have no problem <br/>\nletting my kids know i can change my mind.<br/>\n<br/>\n&#39;No&#39; is an important word.  My very wise husband said (i surround myself by <br/>\nwise people &lt;g&gt;), unless you can say &#39;no&#39; there is no real &#39;yes.&#39;  BUT - <br/>\nsaying no simply for the sake of being able to say no is punitive and <br/>\ndisempowering.  Sometimes if i feel the urge to say no i wait a few seconds <br/>\nbefore responding.<br/>\n<br/>\nAs important as it is for you to be able to say no - it is important for my <br/>\nkids to be able to say no to me as well.  &quot;No - mom that is not ok with me <br/>\nthat i can not do that - or have that - or whatever.  This is important to <br/>\nme&quot; they will tell me.  It doesn&#39;t always mean that i will be able to change <br/>\nthe situation, sometimes reality dictates all i can say is - &quot;yes, i <br/>\n&#39;know&#39;its hard when things don&#39;t go the way you want.&quot;<br/>\n<br/>\nLisa Heyman<br/>\n<br/>\n_________________________________________________________________<br/>\nRates near 39yr lows!  $430K Loan for $1,399/mo - Paying Too Much? Calculate <br/>\nnew payment <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lowermybills.com/lre/index.jsp?sourceid=lmb-9632-18226&moid=7581\">http://www.lowermybills.com/lre/index.jsp?sourceid=lmb-9632-18226&moid=7581</a></div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:cant always get whatcha want","postDate":"1173287679","msgId":21963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGQwMWM3NjBkYyQxODU4MjU1MCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PGVzbWdhMCtxbjBpQGVHcm91cHMuY29tPg=="},"prevInTopic":21960,"nextInTopic":21964,"prevInTime":21962,"nextInTime":21964,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... my kids that they cannot always have what they want. I dont feel that it is unreasonable to teach them these values. If we are out at a store and my son","messageBody":"<div id=\"ygrps-yiv-1358223279\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;See, I dont see myself as a controlling parent because I am teaching<br/>\n </span></blockquote>my kids that they cannot always have what they want. I dont feel that<br/>\nit is unreasonable to teach them these values. If we are out at a<br/>\nstore and my son wants a toy and he just had a birthday or christmas<br/>\nor whatever the reason is, I am not going to buy him that toy just<br/>\nbecause he wants it. He will learn to be spoiled if he gets everytihng<br/>\nhe wants. My son is a sensitive child too.. If I left him to do what<br/>\nhe wanted, he would eat junk food and play video games all day long...<br/>\nI mean granted there are parents that say no to everything and are<br/>\njust NO kind of parents, but we dont say NO to our kids all the time,<br/>\nand when we do, they are taught to respect that answer. Is that a<br/>\nwrong way of thinking when it comes to unschooling&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWE are one of THOSE parents that give everything our kids ask for. Of course if we financially can at that moment. I have a very intense ds that will be 5 end of June and you know what??? We have given him so many presents, big presents, just because....and ALL the time.<br/>\nIt has not made him &quot;spoiled&quot;. If we cannot give him something at that moment we talk about it and discuss what we can do. He will either choose to wait till we can or to get something that we can afford that minute. And that can be a small trinket that costs 50 Cents when we are broke.<br/>\nThis past Christmas I kept asking what he wanted. Last Christmas he got so many presents. He said he wanted to get ME a Nintendo DS so we could play together. He did not want anything for himself but for his mom. <br/>\nHe will not learn to be spoiled if he gets everything he wants- no one gets every little thing they want. But he will learn that his parents will try to give him everything he wants - if possible.<br/>\nHe will learn about family budget and money and economics and most of all he will learn the joy of giving something that makes a loved one smile.<br/>\n<br/>\nAlex ( The one with spoiled kids)<br/>\n  _,_._,___ <br/>\n<br/>\n<br/>\n  I am one of those parents<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:cant always get whatcha want","postDate":"1173281704","msgId":21960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyNzkzOC43MjQwMS5xbUB3ZWI1NDQwNy5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGVzbWdhMCtxbjBpQGVHcm91cHMuY29tPg=="},"prevInTopic":21952,"nextInTopic":21963,"prevInTime":21959,"nextInTime":21961,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... The thing is that nobody _needs_ to teach that you can t always get what you want. Life teaches that lesson in many different ways. There are real limits ","messageBody":"<div id=\"ygrps-yiv-2132340165\">--- shellinispencer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shellini@...\">shellini@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; See, I dont see myself as a controlling parent<br/>\n&gt; because I am teaching<br/>\n&gt; my kids that they cannot always have what they want.<br/>\n&gt; I dont feel that<br/>\n&gt; it is unreasonable to teach them these values. <br/>\n </span></blockquote>The thing is that nobody _needs_ to teach that you<br/>\ncan&#39;t always get what you want. Life teaches that<br/>\nlesson in many different ways. There are real limits<br/>\nto our finances and our energies. Plus unexpected<br/>\nsickness and weather (especially here in New England<br/>\n:) can throw our plans off kilter. <br/>\n<br/>\nI want my kids to learn that they can indeed have what<br/>\nthey want. Perhaps not instantly at that moment, but<br/>\nby working towards it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If we<br/>\n&gt; are out at a<br/>\n&gt; store and my son wants a toy and he just had a<br/>\n&gt; birthday or christmas<br/>\n&gt; or whatever the reason is, I am not going to buy him<br/>\n&gt; that toy just<br/>\n&gt; because he wants it. <br/>\n </span></blockquote>I have often said no to toys because we&#39;re out of our<br/>\ntoy budget. Now my kids get an allowance and when they<br/>\nwant a toy, they can buy it if they have the money. <br/>\n<br/>\nHe will learn to be spoiled if<br/>\n<blockquote><span title=\"ireply\"> &gt; he gets everytihng<br/>\n&gt; he wants. My son is a sensitive child too.. If I<br/>\n&gt; left him to do what<br/>\n&gt; he wanted, he would eat junk food and play video<br/>\n&gt; games all day long...<br/>\n </span></blockquote>I recommend reading some stuff on Sandra Dodd&#39;s site<br/>\nand Joyce&#39;s site for a different point of view. Sandra<br/>\nhas a page call &quot;If I let&quot; or something like that.<br/>\nAlso other pages about food and video games.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com\">http://sandradodd.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoicing.com\">http://joyfullyrejoicing.com</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is that a<br/>\n&gt; wrong way of thinking when it comes to unschooling?<br/>\n </span></blockquote>I think an unschooling parent has to support a child&#39;s<br/>\ninterests. That means saying yes as much as possible.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nNever miss an email again!<br/>\nYahoo! Toolbar alerts you the instant new Mail arrives.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/toolbar/features/mail/\">http://tools.search.yahoo.com/toolbar/features/mail/</a></div>","specialLinks":[]},{"userId":292658207,"authorName":"Shellini Spencer","from":"Shellini Spencer &lt;shellini@...&gt;","profile":"shellinispencer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173275833","msgId":21951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMjkyMjA3LTlEQzMtNEE1QS04MDAyLUM4NTM5RTc5ODJERkBvcHRvbmxpbmUubmV0Pg=="},"prevInTopic":21937,"nextInTopic":21952,"prevInTime":21950,"nextInTime":21952,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"LOL!!! Ok then! On the group it is! Shellini Mothers hold their children s hands for a short while, but their hearts forever. [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-2070192339\">LOL!!! Ok then! On the group it is!<br/>\nShellini<br/>\n<br/>\nMothers hold their children&#39;s hands for a short while, but their  <br/>\nhearts forever.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":292658207,"authorName":"shellinispencer","from":"&quot;shellinispencer&quot; &lt;shellini@...&gt;","profile":"shellinispencer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:cant always get whatcha want","postDate":"1173275776","msgId":21952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbWdhMCtxbjBpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ0NTMzNy41Nzg1Ny5xbUB3ZWI1OTIxNS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":21951,"nextInTopic":21960,"prevInTime":21951,"nextInTime":21953,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"See, I dont see myself as a controlling parent because I am teaching my kids that they cannot always have what they want. I dont feel that it is unreasonable","messageBody":"<div id=\"ygrps-yiv-178061931\">See, I dont see myself as a controlling parent because I am teaching<br/>\nmy kids that they cannot always have what they want. I dont feel that<br/>\nit is unreasonable to teach them these values. If we are out at a<br/>\nstore and my son wants a toy and he just had a birthday or christmas<br/>\nor whatever the reason is, I am not going to buy him that toy just<br/>\nbecause he wants it. He will learn to be spoiled if he gets everytihng<br/>\nhe wants. My son is a sensitive child too.. If I left him to do what<br/>\nhe wanted, he would eat junk food and play video games all day long...<br/>\nI mean granted there are parents that say no to everything and are<br/>\njust NO kind of parents, but we dont say NO to our kids all the time,<br/>\nand when we do, they are taught to respect that answer. Is that a<br/>\nwrong way of thinking when it comes to unschooling?<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Cameron Parham<br/>\n&lt;acsp2205@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Yes!  I wanted to break the cycle of controlling parents who train<br/>\n </span></blockquote>kids to feel just that way!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; ----- Original Message ----<br/>\n&gt; From: Melissa &lt;autismhelp@...&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Sent: Monday, March 5, 2007 3:26:33 PM<br/>\n&gt; Subject: [unschoolingbasics] Re:cant always get whatcha want<br/>\n&gt; <br/>\n&gt; Not only unreasonable, but I&#39;d say unhealthy too. Once kids learn to<br/>\n </span></blockquote>bury their anger and <br/>\n<blockquote><span title=\"ireply\"> &gt; disappointment, you are breeding a martyr complex that will follow<br/>\n </span></blockquote>them for a long long <br/>\n<blockquote><span title=\"ireply\"> &gt; time. You are creating kids who perform as expected, but not for the<br/>\n </span></blockquote>joy of doing so, but <br/>\n<blockquote><span title=\"qreply\"> &gt; because they are out of touch with real feelings.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Snappy Comebacks For Comments About Controlling Children","postDate":"1173240025","msgId":21937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbGRjcCtib2FtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzaWYydSt1ajdhQGVHcm91cHMuY29tPg=="},"prevInTopic":21928,"nextInTopic":21951,"prevInTime":21936,"nextInTime":21938,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Shellini, My husband and I, since totally embracing radical unschooling, have just had a shift in how we were starting to handle conflicts in our home, and how","messageBody":"<div id=\"ygrps-yiv-1066680182\">Shellini,<br/>\n<br/>\nMy husband and I, since totally embracing radical unschooling, have just had a shift in <br/>\nhow we were starting to handle conflicts in our home, and how we were starting to view <br/>\nthis next leg of parenting coming from a very attached style to begin with.  My son (who <br/>\njust turned 5), was so easy going and laid back until about 3 years of age, and after a new <br/>\nsibling, that we started reading all the positive parenting books, which are really still very <br/>\ncontrolling and &quot;discipline&quot; oriented.  Soon after we discovered radical unschooling by way <br/>\nof the Always Unschooled group and then this one, and WOW!!  It was like a bunch of light <br/>\nbulbs went off.  You mean  you treat your children the way you want to be treated?  You <br/>\nput your trust in them to make decisions regarding themselves and these amazing beings <br/>\ncan actually know what it is they need and what they have a passion for?  In a way it is so <br/>\nmuch more complex then traditional parenting and using bribes/rewards/punishments, <br/>\nbut in the same sense it is so simple.  I&#39;m not saying we have zero conflicts in our home, <br/>\nbut for the most part they are easy to handle by just talking with our children and coming <br/>\nup with solution that meet everyones needs.  We basically don&#39;t have limits on anything in <br/>\nour home, and everything (minus somebody getting hurt or property being damaged) is <br/>\nnegotiable.  <br/>\n<br/>\nMy son self-regulates himself on just about everything (t.v., video games, food, hygiene, <br/>\nect..) and does an amazing job IMO.  As an unschooling parent we are here to help our <br/>\nchildren attain whatever it is they desire, and act as facilitators to their learning and life in <br/>\ngeneral.  <br/>\n<br/>\nI&#39;m definiately not an expert or veteran in radical unschooling, I just know what this type <br/>\nof lifestyle has done for our family and can&#39;t be gracious enough that we discovered it <br/>\nwhen we did.<br/>\n<br/>\nJust keep reading all you can and ask any question you haveo on this list and it will get <br/>\nanswered, probably much more eloquent than my answer.<br/>\n<br/>\nPeace,<br/>\n<br/>\nJulie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;shellinispencer&quot; &lt;shellini@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Julie, <br/>\n&gt; <br/>\n&gt; I guess I am learning then.. lol.. Yes, I have never heard of radical<br/>\n&gt; homeschooling till now. I am reading a little bit about John Holt on<br/>\n&gt; the wikipedia site to get more of a feel. can you tell me more about<br/>\n&gt; how this has helped your family, if you can. I would like to know more<br/>\n&gt; and you can do it off list, if you prefer. <br/>\n&gt; <br/>\n&gt; Thanks !!!!<br/>\n&gt; <br/>\n&gt; Shellini<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie v.&quot; &lt;jlvw@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;  Shellini,<br/>\n&gt; &gt; <br/>\n&gt; &gt; Your not the bad person here:)  Being new to the list and concerning<br/>\n&gt; your comments, I <br/>\n&gt; &gt; think you might not be aware of what radical unschooling is. Just<br/>\n&gt; keep reading the list and <br/>\n&gt; &gt; if your interested look in the archives to get a good picture of how<br/>\n&gt; radical unschoolers live  <br/>\n&gt; &gt; with children.  I can speak for myself and say that this list and<br/>\n&gt; helped our family immensly <br/>\n&gt; &gt; on our radical unschooling journey.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Peace,<br/>\n&gt; &gt; <br/>\n&gt; &gt; Julie <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173212061","msgId":21926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVza2kydCtscmgwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExNS1GMTcyMEM1Njc1NDQwOEYxMUI0QkQ5Q0QxN0IwQHBoeC5nYmw+"},"prevInTopic":21921,"nextInTopic":21928,"prevInTime":21925,"nextInTime":21927,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Lisa, Thanks for the suggestions!  I like the idea of just modeling our behavior for other people to see.  I think a lot has to do with the age of my son right","messageBody":"<div id=\"ygrps-yiv-631713236\">Lisa,<br/>\n<br/>\nThanks for the suggestions!  I like the idea of just modeling our behavior for other people <br/>\nto see.  I think a lot has to do with the age of my son right now (5), the age where <br/>\neveryone thinks they need to curtail certain behaviors with children and set them on the <br/>\nright path, their behavior is so out there and open & free at this age and it makes people <br/>\nuncomfortable I think.  I will keep in mind to keep my focus on my child in these types of <br/>\nsituations and talk to him about the differences in families and how even if we don&#39;t agree <br/>\nwith how their family is run, that as long as the children aren&#39;t being abused, then we need <br/>\nto respect the way their family is run.<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;From: &quot;Julie v.&quot; &lt;jlvw@...&gt;<br/>\n&gt; <br/>\n&gt; &gt;Wondering what other&#39;s say or don&#39;t in situations where people make <br/>\n&gt; &gt;comments<br/>\n&gt; &gt;concerning controlling children?<br/>\n&gt; &gt;<br/>\n&gt; &gt;-Two neighbor kids were over playing w/our 4 year old and my dh & I were <br/>\n&gt; &gt;conversing<br/>\n&gt; &gt;with their parents in our backyard.  Damek (our 4 year old), came up a <br/>\n&gt; &gt;couple of times<br/>\n&gt; &gt;asking for things (can&#39;t remember what now), and the neighbor made the <br/>\n&gt; &gt;comment &quot;yea,<br/>\n&gt; &gt;our kids were very demanding at that age also, we put a stop to that <br/>\n&gt; &gt;quick&quot;.<br/>\n&gt; ============<br/>\n&gt; I might say something like &quot;oh - it doesn&#39;t bother me at all.  I&#39;m glad he <br/>\n&gt; can ask for what he wants.&quot;<br/>\n&gt; And leave it at that.<br/>\n&gt; ============<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;-My son just had his 5th birthday party yesterday and had a couple of <br/>\n&gt; &gt;neighbor friends<br/>\n&gt; &gt;over, one of the mom&#39;s came to get her son and saw that the boys were all <br/>\n&gt; &gt;enamoured<br/>\n&gt; &gt;with a couple of new gameboy games my son got.  The sister (age 9) of the <br/>\n&gt; &gt;boy was there<br/>\n&gt; &gt;saying how much she wanted a gameboy and the mom said &quot;if we bought you a <br/>\n&gt; &gt;gameboy<br/>\n&gt; &gt;you would never read books&quot;, and then went on to say &quot;it&#39;s hard enough to <br/>\n&gt; &gt;get you to read<br/>\n&gt; &gt;without having a gameboy&quot;.  The girl then said &quot;my mom said that if I read <br/>\n&gt; &gt;a lot I can have<br/>\n&gt; &gt;a gameboy&quot;, and then the mom said &quot;maybe&quot;.<br/>\n&gt; <br/>\n&gt; ===============<br/>\n&gt; &quot;Gee, you might be surprised how much reading goes on with gameboys.&quot;<br/>\n&gt; <br/>\n&gt; ===============<br/>\n&gt; &gt;-My sister & her husband were watching our 4 year old along with their 3 <br/>\n&gt; &gt;kids.  We came<br/>\n&gt; &gt;to pick him up and the boys were still having fun playing, so we stayed <br/>\n&gt; &gt;awhile and talked.<br/>\n&gt; &gt;Then my nephew wanted to watch a video, but my sister said it was too late <br/>\n&gt; &gt;and it was<br/>\n&gt; &gt;getting to be bedtime.  My son said &quot;well he wants to watch it&quot;, and my <br/>\n&gt; &gt;sister said &quot;just<br/>\n&gt; &gt;because he wants to do something doesn&#39;t mean he gets to do it&quot;.  My son <br/>\n&gt; &gt;just kind of<br/>\n&gt; &gt;looked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n&gt; <br/>\n&gt; ===============<br/>\n&gt; I think i might leave this one alone until perhaps another time.  a. Your <br/>\n&gt; sister may have been tired after watching 4 kids and your empathy in the <br/>\n&gt; moment could go a lot further in the long run with possibiities of her <br/>\n&gt; learning from you than any comment at that time. Sounds like you will have <br/>\n&gt; plenty of time to model your behaviour and perhaps she will come to you with <br/>\n&gt; questions how you might handle something.  And B.  your son will encounter <br/>\n&gt; different attitudes from many people (including famiy) throughout his life - <br/>\n&gt; this may be more of an opportunity to talk to him about differences and <br/>\n&gt; choices.<br/>\n&gt; ===============<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;I so want to promote unschooling, but I just don&#39;t think in these<br/>\n&gt; &gt;situations with these types of people they would even attempt to &quot;get&quot; what <br/>\n&gt; &gt;unschooling is<br/>\n&gt; &gt;all about.<br/>\n&gt; &gt;<br/>\n&gt; &gt;What do others do in these types of situations?<br/>\n&gt; <br/>\n&gt; ===============<br/>\n&gt; In the situations you mentioned above the word &#39;unschooling&#39; doesn&#39;t seem <br/>\n&gt; relevant to &quot;get&quot; some one to undertand a different way to act towards a <br/>\n&gt; child.  I rarely use the word &quot;unschooling&quot; unless someone has inquired <br/>\n&gt; about homeschooling beyond the initial &quot;how do you do it?&quot; question.  I talk <br/>\n&gt; about &#39;how we do it&#39; (our approach to learning and living) without labeling. <br/>\n&gt;   I think i get a better response from the listener...the light bulbs start <br/>\n&gt; going off when they are not threatened initially with a label or category <br/>\n&gt; representing what they are not doing.  If the conversation gets long and <br/>\n&gt; indepth than the opportunity will occur naturally to use the word <br/>\n&gt; unschooling.<br/>\n&gt; <br/>\n&gt; Lisa Heyman<br/>\n&gt; <br/>\n&gt; _________________________________________________________________<br/>\n&gt; Rates near 39yr lows!  $430K Loan for $1,399/mo - Paying Too Much? Calculate <br/>\n&gt; new payment <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lowermybills.com/lre/index.jsp?sourceid=lmb-9632-18226&moid=7581\">http://www.lowermybills.com/lre/index.jsp?sourceid=lmb-9632-18226&moid=7581</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa Heyman","from":"&quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Snappy Comebacks For Comments About Controlling Children","postDate":"1173194671","msgId":21921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1GMTcyMEM1Njc1NDQwOEYxMUI0QkQ5Q0QxN0IwQHBoeC5nYmw+"},"prevInTopic":21914,"nextInTopic":21926,"prevInTime":21920,"nextInTime":21922,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... ============ I might say something like oh - it doesn t bother me at all.  I m glad he can ask for what he wants. And leave it at that. ... ","messageBody":"<div id=\"ygrps-yiv-310506520\"><blockquote><span title=\"ireply\">&gt;From: &quot;Julie v.&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlvw@...\">jlvw@...</a>&gt;<br/>\n<br/>\n&gt;Wondering what other&#39;s say or don&#39;t in situations where people make <br/>\n&gt;comments<br/>\n&gt;concerning controlling children?<br/>\n&gt;<br/>\n&gt;-Two neighbor kids were over playing w/our 4 year old and my dh & I were <br/>\n&gt;conversing<br/>\n&gt;with their parents in our backyard.  Damek (our 4 year old), came up a <br/>\n&gt;couple of times<br/>\n&gt;asking for things (can&#39;t remember what now), and the neighbor made the <br/>\n&gt;comment &quot;yea,<br/>\n&gt;our kids were very demanding at that age also, we put a stop to that <br/>\n&gt;quick&quot;.<br/>\n </span></blockquote>============<br/>\nI might say something like &quot;oh - it doesn&#39;t bother me at all.  I&#39;m glad he <br/>\ncan ask for what he wants.&quot;<br/>\nAnd leave it at that.<br/>\n============<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;-My son just had his 5th birthday party yesterday and had a couple of <br/>\n&gt;neighbor friends<br/>\n&gt;over, one of the mom&#39;s came to get her son and saw that the boys were all <br/>\n&gt;enamoured<br/>\n&gt;with a couple of new gameboy games my son got.  The sister (age 9) of the <br/>\n&gt;boy was there<br/>\n&gt;saying how much she wanted a gameboy and the mom said &quot;if we bought you a <br/>\n&gt;gameboy<br/>\n&gt;you would never read books&quot;, and then went on to say &quot;it&#39;s hard enough to <br/>\n&gt;get you to read<br/>\n&gt;without having a gameboy&quot;.  The girl then said &quot;my mom said that if I read <br/>\n&gt;a lot I can have<br/>\n&gt;a gameboy&quot;, and then the mom said &quot;maybe&quot;.<br/>\n<br/>\n </span></blockquote>===============<br/>\n&quot;Gee, you might be surprised how much reading goes on with gameboys.&quot;<br/>\n<br/>\n===============<br/>\n<blockquote><span title=\"ireply\"> &gt;-My sister & her husband were watching our 4 year old along with their 3 <br/>\n&gt;kids.  We came<br/>\n&gt;to pick him up and the boys were still having fun playing, so we stayed <br/>\n&gt;awhile and talked.<br/>\n&gt;Then my nephew wanted to watch a video, but my sister said it was too late <br/>\n&gt;and it was<br/>\n&gt;getting to be bedtime.  My son said &quot;well he wants to watch it&quot;, and my <br/>\n&gt;sister said &quot;just<br/>\n&gt;because he wants to do something doesn&#39;t mean he gets to do it&quot;.  My son <br/>\n&gt;just kind of<br/>\n&gt;looked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n<br/>\n </span></blockquote>===============<br/>\nI think i might leave this one alone until perhaps another time.  a. Your <br/>\nsister may have been tired after watching 4 kids and your empathy in the <br/>\nmoment could go a lot further in the long run with possibiities of her <br/>\nlearning from you than any comment at that time. Sounds like you will have <br/>\nplenty of time to model your behaviour and perhaps she will come to you with <br/>\nquestions how you might handle something.  And B.  your son will encounter <br/>\ndifferent attitudes from many people (including famiy) throughout his life - <br/>\nthis may be more of an opportunity to talk to him about differences and <br/>\nchoices.<br/>\n===============<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;I so want to promote unschooling, but I just don&#39;t think in these<br/>\n&gt;situations with these types of people they would even attempt to &quot;get&quot; what <br/>\n&gt;unschooling is<br/>\n&gt;all about.<br/>\n&gt;<br/>\n&gt;What do others do in these types of situations?<br/>\n<br/>\n </span></blockquote>===============<br/>\nIn the situations you mentioned above the word &#39;unschooling&#39; doesn&#39;t seem <br/>\nrelevant to &quot;get&quot; some one to undertand a different way to act towards a <br/>\nchild.  I rarely use the word &quot;unschooling&quot; unless someone has inquired <br/>\nabout homeschooling beyond the initial &quot;how do you do it?&quot; question.  I talk <br/>\nabout &#39;how we do it&#39; (our approach to learning and living) without labeling. <br/>\n  I think i get a better response from the listener...the light bulbs start <br/>\ngoing off when they are not threatened initially with a label or category <br/>\nrepresenting what they are not doing.  If the conversation gets long and <br/>\nindepth than the opportunity will occur naturally to use the word <br/>\nunschooling.<br/>\n<br/>\nLisa Heyman<br/>\n<br/>\n_________________________________________________________________<br/>\nRates near 39yr lows!  $430K Loan for $1,399/mo - Paying Too Much? Calculate <br/>\nnew payment <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lowermybills.com/lre/index.jsp?sourceid=lmb-9632-18226&moid=7581\">http://www.lowermybills.com/lre/index.jsp?sourceid=lmb-9632-18226&moid=7581</a></div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:cant always get whatcha want","postDate":"1173191315","msgId":21928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0NTMzNy41Nzg1Ny5xbUB3ZWI1OTIxNS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":21926,"nextInTopic":21937,"prevInTime":21927,"nextInTime":21929,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Yes!  I wanted to break the cycle of controlling parents who train kids to feel just that way! ... From: Melissa  To:","messageBody":"<div id=\"ygrps-yiv-1233414157\">Yes!  I wanted to break the cycle of controlling parents who train kids to feel just that way!<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Melissa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:autismhelp@...\">autismhelp@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Monday, March 5, 2007 3:26:33 PM<br/>\nSubject: [unschoolingbasics] Re:cant always get whatcha want<br/>\n<br/>\nNot only unreasonable, but I&#39;d say unhealthy too. Once kids learn to bury their anger and <br/>\ndisappointment, you are breeding a martyr complex that will follow them for a long long <br/>\ntime. You are creating kids who perform as expected, but not for the joy of doing so, but <br/>\nbecause they are out of touch with real feelings.<br/>\n<br/>\nIt sounds bizarre, but I totally grew up with that. Even if it appears that a kid is coping with <br/>\nit, and doing just fine in spite of it, they are not. It wasn&#39;t until maybe six months ago, <br/>\nbefore I could express to my family how SAD I was to miss a TV show that I had wanted to <br/>\nsee. My childhood training told me to bury the sadness and disappointment, and when you <br/>\ndo that long enough, it explodes as anger and resentment and negative behaviors. It turns <br/>\nfrom disappointment to self-pity, and from self-pity to revenge. Maybe not all at once, but <br/>\nit builds.<br/>\n<br/>\nI have unschooling to thank for most of the progress made in my own therapy. SO we say <br/>\nthat unschooling not only saved our family, but it saved me too. ;-)<br/>\nMelissa<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, &quot;plaidpanties666&quot; &lt;plaidpanties666@ ...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Its unreasonable to expect children to be sanguine about <br/>\n&gt; disappointment - heck, many adults have trouble dealing with <br/>\n&gt; disappointment! Personally, I think a great deal of parents&#39; wanting <br/>\n&gt; kids to accept &quot;you can&#39;t always get what you want&quot; is bc of our own <br/>\n&gt; difficulties. When we can&#39;t give our kids what they want, *we* feel <br/>\n&gt; badly but dont&#39; know how to acknowledge and move past that feeling. <br/>\n&gt; Part of unschooling is learning to parent *ourselves*.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:Snappy Comebacks For Comments About Controlling Children","postDate":"1173187984","msgId":21914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNjIyNC41Nzg5NS5xbUB3ZWI2MDMxNi5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":21912,"nextInTopic":21921,"prevInTime":21913,"nextInTime":21915,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"can you tell me more about how this has helped your family, if you can. I would like to know more and you can do it off list, if you prefer.  No, no!  Please","messageBody":"<div id=\"ygrps-yiv-335840536\">&quot;can you tell me more about how this has helped your family, if you can. I would like to know more and you can do it off list, if you prefer. &quot;<br/>\n<br/>\n<br/>\nNo, no!  Please do it on list!<br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\n8:00? 8:25? 8:40? Find a flick in no time <br/>\nwith the Yahoo! Search movie showtime shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#news\">http://tools.search.yahoo.com/shortcuts/#news</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":292658207,"authorName":"shellinispencer","from":"&quot;shellinispencer&quot; &lt;shellini@...&gt;","profile":"shellinispencer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:principles and passions","postDate":"1173143535","msgId":21912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaWY1ZithYmI1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzaGwxMitrcTZtQGVHcm91cHMuY29tPg=="},"prevInTopic":21911,"nextInTopic":21914,"prevInTime":21911,"nextInTime":21913,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Hi Meredith, No, I have not seen it, I am reading it right now. THank you for the link....","messageBody":"<div id=\"ygrps-yiv-2088346834\">Hi Meredith, <br/>\n<br/>\nNo, I have not seen it, I am reading it right now. THank you for the<br/>\nlink....<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot;<br/>\n&lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shellini Spencer <br/>\n&gt; &lt;shellini@&gt; wrote:<br/>\n&gt; &gt;&gt; our kids do have video games, but they  <br/>\n&gt; &gt; are limited in how long they are allowed to play, and they dont <br/>\n&gt; play  <br/>\n&gt; &gt; everyday... There are so many things to do, I would not want them  <br/>\n&gt; &gt; hooked on ONE thing all day long..... these are the rules in our  <br/>\n&gt; &gt; house....<br/>\n&gt; <br/>\n&gt; Have you read this, yet?<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n&gt; <br/>\n&gt; That&#39;s a good place to start thinking about &quot;principles&quot; instead of <br/>\n&gt; rules. <br/>\n&gt; <br/>\n&gt; I always find that when I&#39;m getting &quot;stuck&quot; going back to my <br/>\n&gt; priciples makes a big difference. Early on in my unschooling <br/>\n&gt; journey, I found that some of what I considered priciples were in <br/>\n&gt; conflict with one another and I had to do some deeper &quot;work&quot; to find <br/>\n&gt; the core values or priciples that I wanted to embody in my life. <br/>\n&gt; <br/>\n&gt; In the example above, I&#39;d guess that there&#39;s a principle of <br/>\n&gt; moderation, but I&#39;d suggest digging deeper. Why is moderation <br/>\n&gt; important? What&#39;s underneath that? Why is getting all wrapped up in <br/>\n&gt; something fun, especially, such a problem? Would it be as much of a <br/>\n&gt; problem if it were something &quot;educational&quot;, like reading? I suspect <br/>\n&gt; there are some fears here that need to be examined. <br/>\n&gt; <br/>\n&gt; One of the problems with moderation, from an unschooling <br/>\n&gt; perspective, is that people learn most easily from their passions, <br/>\n&gt; and certainly most joyfully. People of all ages will take on amazing <br/>\n&gt; challenges when they are inspired. My stepson will do the very <br/>\n&gt; things playing video games or skateboarding that he flat-out refused <br/>\n&gt; to do in school: he will do dull, repetitive exercises for the <br/>\n&gt; purpose of &quot;getting better&quot; at a particular skill. He actually <br/>\n&gt; *chooses* to do something he doesn&#39;t really like bc it forwards his <br/>\n&gt; passions. <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 5, Ray 13)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":292658207,"authorName":"shellinispencer","from":"&quot;shellinispencer&quot; &lt;shellini@...&gt;","profile":"shellinispencer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Snappy Comebacks For Comments About Controlling Children","postDate":"1173143454","msgId":21911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaWYydSt1ajdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzaG5kZSsxNTRnQGVHcm91cHMuY29tPg=="},"prevInTopic":21906,"nextInTopic":21912,"prevInTime":21910,"nextInTime":21912,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Hi Julie, I guess I am learning then.. lol.. Yes, I have never heard of radical homeschooling till now. I am reading a little bit about John Holt on the","messageBody":"<div id=\"ygrps-yiv-1616983077\">Hi Julie, <br/>\n<br/>\nI guess I am learning then.. lol.. Yes, I have never heard of radical<br/>\nhomeschooling till now. I am reading a little bit about John Holt on<br/>\nthe wikipedia site to get more of a feel. can you tell me more about<br/>\nhow this has helped your family, if you can. I would like to know more<br/>\nand you can do it off list, if you prefer. <br/>\n<br/>\nThanks !!!!<br/>\n<br/>\nShellini<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie v.&quot; &lt;jlvw@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  Shellini,<br/>\n&gt; <br/>\n&gt; Your not the bad person here:)  Being new to the list and concerning<br/>\nyour comments, I <br/>\n&gt; think you might not be aware of what radical unschooling is. Just<br/>\nkeep reading the list and <br/>\n&gt; if your interested look in the archives to get a good picture of how<br/>\nradical unschoolers live  <br/>\n&gt; with children.  I can speak for myself and say that this list and<br/>\nhelped our family immensly <br/>\n&gt; on our radical unschooling journey.<br/>\n&gt; <br/>\n&gt; Peace,<br/>\n&gt; <br/>\n&gt; Julie <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:cant always get whatcha want","postDate":"1173133593","msgId":21906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaTVlcCtjdW90QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzaGpqYytwaGFyQGVHcm91cHMuY29tPg=="},"prevInTopic":21898,"nextInTopic":21911,"prevInTime":21905,"nextInTime":21907,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Not only unreasonable, but I d say unhealthy too. Once kids learn to bury their anger and disappointment, you are breeding a martyr complex that will follow","messageBody":"<div id=\"ygrps-yiv-572837585\">Not only unreasonable, but I&#39;d say unhealthy too. Once kids learn to bury their anger and <br/>\ndisappointment, you are breeding a martyr complex that will follow them for a long long <br/>\ntime. You are creating kids who perform as expected, but not for the joy of doing so, but <br/>\nbecause they are out of touch with real feelings.<br/>\n<br/>\nIt sounds bizarre, but I totally grew up with that. Even if it appears that a kid is coping with <br/>\nit, and doing just fine in spite of it, they are not.  It wasn&#39;t until maybe six months ago, <br/>\nbefore I could express to my family how SAD I was to miss a TV show that I had wanted to <br/>\nsee. My childhood training told me to bury the sadness and disappointment, and when you <br/>\ndo that long enough, it explodes as anger and resentment and negative behaviors. It turns <br/>\nfrom disappointment to self-pity, and from self-pity to revenge. Maybe not all at once, but <br/>\nit builds.<br/>\n<br/>\nI have unschooling to thank for most of the progress made in my own therapy. SO we say <br/>\nthat unschooling not only saved our family, but it saved me too. ;-)<br/>\nMelissa<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; Its unreasonable to expect children to be sanguine about <br/>\n&gt; disappointment - heck, many adults have trouble dealing with <br/>\n&gt; disappointment! Personally, I think a great deal of parents&#39; wanting <br/>\n&gt; kids to accept &quot;you can&#39;t always get what you want&quot; is bc of our own <br/>\n&gt; difficulties. When we can&#39;t give our kids what they want, *we* feel <br/>\n&gt; badly but dont&#39; know how to acknowledge and move past that feeling. <br/>\n&gt; Part of unschooling is learning to parent *ourselves*. </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Snappy Comebacks For Comments About Controlling Children","postDate":"1173119214","msgId":21897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaG5kZSsxNTRnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE1MEI3RTU0LTlGREYtNEI5Qi1CNDVFLUZENjY4QzNEMEU2OEBvcHRvbmxpbmUubmV0Pg=="},"prevInTopic":21896,"nextInTopic":21898,"prevInTime":21896,"nextInTime":21898,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Shellini, Your not the bad person here:)  Being new to the list and concerning your comments, I think you might not be aware of what radical unschooling is.","messageBody":"<div id=\"ygrps-yiv-279083228\">Shellini,<br/>\n<br/>\nYour not the bad person here:)  Being new to the list and concerning your comments, I <br/>\nthink you might not be aware of what radical unschooling is. Just keep reading the list and <br/>\nif your interested look in the archives to get a good picture of how radical unschoolers live  <br/>\nwith children.  I can speak for myself and say that this list and helped our family immensly <br/>\non our radical unschooling journey.<br/>\n<br/>\nPeace,<br/>\n<br/>\nJulie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shellini Spencer &lt;shellini@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi there,<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I am new to this group and reading this post. Please forgive me, but  <br/>\n&gt; I am afraid I do not understand.<br/>\n&gt; <br/>\n&gt; Aside from the 1st situation, I dont understand WHY it would be an  <br/>\n&gt; issue. In the 1st instance, it seems that they offered parenting  <br/>\n&gt; advice which was not asked for. Now unless you turned to them and  <br/>\n&gt; said, &quot; I wonder if your little ones do that to you, how did you  <br/>\n&gt; handle it...&quot;<br/>\n&gt; <br/>\n&gt; In the other 2 , it just seems like those are their parents rules. I  <br/>\n&gt; know lots  of parents who do not let their kids have video games. I  <br/>\n&gt; even know some that do not even have a TV in the house. They have  <br/>\n&gt; their reasons and their rules, and values...  Whether or not you  <br/>\n&gt; disagree, aren&#39;t those still their rules and their kids?<br/>\n&gt; <br/>\n&gt; I am not trying to be the bad person here, if I am missing something,  <br/>\n&gt; please explain it to me. I mean, I say things like that to our kids  <br/>\n&gt; too.. Just because they want it, does not mean they are going to get  <br/>\n&gt; everything they want. Does not have to even do with spoiling them,  <br/>\n&gt; that is just how life is.  And our kids do have video games, but they  <br/>\n&gt; are limited in how long they are allowed to play, and they dont play  <br/>\n&gt; everyday... There are so many things to do, I would not want them  <br/>\n&gt; hooked on ONE thing all day long..... these are the rules in our  <br/>\n&gt; house....<br/>\n&gt; <br/>\n&gt; Thank you!<br/>\n&gt; Shellini<br/>\n&gt; <br/>\n&gt; Mothers hold their children&#39;s hands for a short while, but their  <br/>\n&gt; hearts forever.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173118865","msgId":21896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaG4yaCs0NTA2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2NTA2MC42NTM4Ny5xbUB3ZWI1ODUxMC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":21895,"nextInTopic":21897,"prevInTime":21895,"nextInTime":21897,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Alice, I like your suggestions for comments, it kind of takes the focus off the parent and puts it in the best interest of the child, which is what ru is all","messageBody":"<div id=\"ygrps-yiv-1522381707\">Alice,<br/>\n<br/>\nI like your suggestions for comments, it kind of takes the focus off the parent and puts it <br/>\nin the best interest of the child, which is what ru is all about.<br/>\n<br/>\nThanks,<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Alice Roddy &lt;amar0514412000@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; These are fun to read and to write as well.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -Two neighbor kids were over playing w/our 4 year old and my dh & I were<br/>\n&gt; conversing <br/>\n&gt; <br/>\n&gt; with their parents in our backyard. Damek (our 4 year old), came up a couple of<br/>\n&gt; times <br/>\n&gt; <br/>\n&gt; asking for things (can&#39;t remember what now), and the neighbor made the comment<br/>\n&gt; &quot;yea, <br/>\n&gt; <br/>\n&gt; our kids were very demanding at that age also, we put a stop to that<br/>\n&gt; quick&quot;. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Response: I&#39;m glad he comes to me now and I hope he never<br/>\n&gt; stops. I&#39;m just praying he&#39;ll still turn to me for help when he&#39;s a teenager.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -My son just had his 5th birthday party yesterday and had a couple of neighbor<br/>\n&gt; friends <br/>\n&gt; <br/>\n&gt; over, one of the mom&#39;s came to get her son and saw that the boys were all<br/>\n&gt; enamoured <br/>\n&gt; <br/>\n&gt; with a couple of new gameboy games my son got. The sister (age 9) of the boy<br/>\n&gt; was there <br/>\n&gt; <br/>\n&gt; saying how much she wanted a gameboy and the mom said &quot;if we bought you a<br/>\n&gt; gameboy <br/>\n&gt; <br/>\n&gt; you would never read books&quot;, and then went on to say &quot;it&#39;s hard<br/>\n&gt; enough to get you to read <br/>\n&gt; <br/>\n&gt; without having a gameboy&quot;. The girl then said &quot;my mom said that if I<br/>\n&gt; read a lot I can have a gameboy&quot;, and then the mom said &quot;maybe&quot;.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Response: &quot;Oh, I used to think that giving rewards for doing<br/>\n&gt; things I wanted done was a good idea. Then I read all the research about how<br/>\n&gt; rewards devalue the thing you have to do to get them. Like, if she HAS to read<br/>\n&gt; to get a GameBoy then reading must be some dumb thing no one wants to do for it&#39;s<br/>\n&gt; own sake.&quot;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -My sister & her husband were watching our 4 year old along with their 3<br/>\n&gt; kids. We came <br/>\n&gt; <br/>\n&gt; to pick him up and the boys were still having fun playing, so we stayed awhile<br/>\n&gt; and talked. <br/>\n&gt; <br/>\n&gt; Then my nephew wanted to watch a video, but my sister said it was too late and<br/>\n&gt; it was <br/>\n&gt; <br/>\n&gt; getting to be bedtime. My son said &quot;well he wants to watch it&quot;, and<br/>\n&gt; my sister said &quot;just <br/>\n&gt; <br/>\n&gt; because he wants to do something doesn&#39;t mean he gets to do it&quot;. My son<br/>\n&gt; just kind of <br/>\n&gt; <br/>\n&gt; looked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Response: I don&#39;t know how to touch this one. I&#39;d let it go.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Gramma Alice<br/>\n&gt; Breastfeeding is the biological norm for infants. It is a relationship that provides food, <br/>\nconnection, protection from illness to the baby and stress reducing hormones to the <br/>\nmother.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; ____________________________________________________________________________________<br/>\n&gt; TV dinner still cooling? <br/>\n&gt; Check out &quot;Tonight&#39;s Picks&quot; on Yahoo! TV.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/\">http://tv.yahoo.com/</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173118735","msgId":21895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaG11Zit1NjJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzaGlhZCtoZmlhQGVHcm91cHMuY29tPg=="},"prevInTopic":21894,"nextInTopic":21896,"prevInTime":21894,"nextInTime":21896,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Melissa, Thanks for your suggestions concerning this instances.  You gave me a few different ways of viewing & responding to these types of situations that","messageBody":"<div id=\"ygrps-yiv-920694392\">Melissa,<br/>\n<br/>\nThanks for your suggestions concerning this instances.  You gave me a few different ways <br/>\nof viewing & responding to these types of situations that hadn&#39;t entered my mind <br/>\npreviously.<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Melissa&quot; &lt;autismhelp@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie v.&quot; &lt;jlvw@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Wondering what other&#39;s say or don&#39;t in situations where people make comments <br/>\n&gt; &gt; concerning controlling children?<br/>\n&gt; Depends on the situation. These seemed fairly friendly, so I might say something light <br/>\nand <br/>\n&gt; supportive of our choices. In less comfortable situations, I probably wouldn&#39;t say <br/>\nanything, <br/>\n&gt; because some parents will choose to take their embarrassment out on their kids, or <br/>\n&gt; become more harsh to prove a point. My job isn&#39;t to promote unschooling per se, but <br/>\n&gt; perhaps model and promote mutual respect and breaking out of mainstream thought.<br/>\n&gt; <br/>\n&gt; &gt; -Two neighbor kids were over playing w/our 4 year old and my dh & I were <br/>\nconversing <br/>\n&gt; &gt; with their parents in our backyard.  Damek (our 4 year old), came up a couple of times <br/>\n&gt; &gt; asking for things (can&#39;t remember what now), and the neighbor made the comment <br/>\n&quot;yea, <br/>\n&gt; &gt; our kids were very demanding at that age also, we put a stop to that quick&quot;. <br/>\n&gt; I&#39;d say something like &quot;Oh, we&#39;re very thankful that he&#39;s comfortable enough to ask for <br/>\n&gt; help. This relationship with us will serve him well when he&#39;s facing peer pressure like <br/>\n&gt; drugs or sex.&quot; <br/>\n&gt; <br/>\n&gt; &gt; -The girl then said &quot;my mom said that if I read a lot I can have <br/>\n&gt; &gt; a gameboy&quot;, and then the mom said &quot;maybe&quot;. <br/>\n&gt; WIth the girl there, I would say something like &quot;Reading is fun, but I know video games <br/>\nare <br/>\n&gt; excitign too&quot; just something bland and not very meaningful. After the child had left the <br/>\n&gt; area, I would mention how much video games have done to teach our children to read, <br/>\n&gt; cooperate and actually help with social skills. and then let it go, get out my mental floss, <br/>\n&gt; and try to clear my brain from the ickies.<br/>\n&gt;  <br/>\n&gt; &gt; Then my nephew wanted to watch a video, but my sister said it was too late and it was <br/>\n&gt; &gt; getting to be bedtime.  My son said &quot;well he wants to watch it&quot;, and my sister said <br/>\n&quot;just <br/>\n&gt; &gt; because he wants to do something doesn&#39;t mean he gets to do it&quot;.  My son just kind <br/>\nof <br/>\n&gt; &gt; looked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n&gt; On this one, I would have made sure to make time to talk to my son about how different <br/>\n&gt; families have different expectations. At that very moment, I would have said to my child, <br/>\n&gt; &quot;I&#39;m so sorry sweetie, that&#39;s not an option for them. Can we get ready to go, and we&#39;ll <br/>\ntalk <br/>\n&gt; more later?&quot; In fact, I have asked my own kids to wait on the videos because little ones <br/>\nin <br/>\n&gt; our house do need to get ready for bed. They are usually okay with it, because they in <br/>\n&gt; general respect the needs and desires of others.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173118490","msgId":21894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaG1tcStkbWw1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzZzQwZCttMGJmQGVHcm91cHMuY29tPg=="},"prevInTopic":21893,"nextInTopic":21895,"prevInTime":21893,"nextInTime":21895,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Thanks for the John Holt quote, that is quite profound and certainly explains a lot about why people are resistant to change. I think what turned me onto","messageBody":"<div id=\"ygrps-yiv-479541031\">Thanks for the John Holt quote, that is quite profound and certainly explains a lot about <br/>\nwhy people are resistant to change.<br/>\n<br/>\nI think what turned me onto radical unschooling was exactly what you said &quot;it&#39;s wonderful <br/>\nto live peacefully & generously with children&quot;.  I also agree that it needs to be who I am <br/>\nwith everyone not just my children, and that is something that I work on constantly.<br/>\n<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Rachel Salavon&quot; &lt;rachelsalavon@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie v.&quot; &lt;jlvw@&gt; <br/>\n&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Wondering what other&#39;s say or don&#39;t in situations where people <br/>\n&gt; make comments <br/>\n&gt; &gt; concerning controlling children?<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I have to admit I have stopped trying to convince other people or <br/>\n&gt; win them over to unschooling.  John Holt wrote something about it in <br/>\n&gt; one of his books (I can&#39;t remember which).  Every person has their <br/>\n&gt; understanding of how life is.  It is their story  of the way things <br/>\n&gt; are -- some would call it their world view.  Anytime a new idea is <br/>\n&gt; introduced, that person has to fit it in to their story.  If the new <br/>\n&gt; idea doesn&#39;t make sense to their story, two things can happen.  <br/>\n&gt; Their story must change.  Or the idea must be rejected or <br/>\n&gt; discounted.  When you introduce a concept as novel as peaceful <br/>\n&gt; parenting, many people will find a way to reject it.  Otherwise it <br/>\n&gt; will rock the foundation of their whole understanding of how the <br/>\n&gt; world works.  I know that&#39;s what happened to me.  My story was <br/>\n&gt; profoundly changed by this concept -- although change was slow.<br/>\n&gt; <br/>\n&gt; I am willing to talk about unschooling with someone who shows an <br/>\n&gt; interest.  But I don&#39;t bring it up.  Some people get angry or don&#39;t <br/>\n&gt; want to hear about it.  And no wonder, you are threatening <br/>\n&gt; everything they hold to be true.  My mil HAS to believe that the way <br/>\n&gt; she raised her children was the right and best way.  It is <br/>\n&gt; fundamental to who she is.  She doesn&#39;t like to talk much about how <br/>\n&gt; things have changed around our house.  Life changing ideas make her <br/>\n&gt; nervous.  I can&#39;t change her.  But she just might be moved by my <br/>\n&gt; children as they grow up.<br/>\n&gt; <br/>\n&gt; It is wonderful to live peacefully and generously with children.  My <br/>\n&gt; biggest challenge lately has been to extend that generosity and <br/>\n&gt; acceptance to other people.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:principles and passions","postDate":"1173116770","msgId":21893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaGwxMitrcTZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE1MEI3RTU0LTlGREYtNEI5Qi1CNDVFLUZENjY4QzNEMEU2OEBvcHRvbmxpbmUubmV0Pg=="},"prevInTopic":21892,"nextInTopic":21894,"prevInTime":21892,"nextInTime":21894,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... play ... Have you read this, yet? http://sandradodd.com/rules That s a good place to start thinking about principles instead of rules. I always find that","messageBody":"<div id=\"ygrps-yiv-1876539612\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shellini Spencer <br/>\n&lt;shellini@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; our kids do have video games, but they  <br/>\n&gt; are limited in how long they are allowed to play, and they dont <br/>\n </span></blockquote>play  <br/>\n<blockquote><span title=\"ireply\"> &gt; everyday... There are so many things to do, I would not want them  <br/>\n&gt; hooked on ONE thing all day long..... these are the rules in our  <br/>\n&gt; house....<br/>\n<br/>\n </span></blockquote>Have you read this, yet?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nThat&#39;s a good place to start thinking about &quot;principles&quot; instead of <br/>\nrules. <br/>\n<br/>\nI always find that when I&#39;m getting &quot;stuck&quot; going back to my <br/>\npriciples makes a big difference. Early on in my unschooling <br/>\njourney, I found that some of what I considered priciples were in <br/>\nconflict with one another and I had to do some deeper &quot;work&quot; to find <br/>\nthe core values or priciples that I wanted to embody in my life. <br/>\n<br/>\nIn the example above, I&#39;d guess that there&#39;s a principle of <br/>\nmoderation, but I&#39;d suggest digging deeper. Why is moderation <br/>\nimportant? What&#39;s underneath that? Why is getting all wrapped up in <br/>\nsomething fun, especially, such a problem? Would it be as much of a <br/>\nproblem if it were something &quot;educational&quot;, like reading? I suspect <br/>\nthere are some fears here that need to be examined. <br/>\n<br/>\nOne of the problems with moderation, from an unschooling <br/>\nperspective, is that people learn most easily from their passions, <br/>\nand certainly most joyfully. People of all ages will take on amazing <br/>\nchallenges when they are inspired. My stepson will do the very <br/>\nthings playing video games or skateboarding that he flat-out refused <br/>\nto do in school: he will do dull, repetitive exercises for the <br/>\npurpose of &quot;getting better&quot; at a particular skill. He actually <br/>\n*chooses* to do something he doesn&#39;t really like bc it forwards his <br/>\npassions. <br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:cant always get whatcha want","postDate":"1173115308","msgId":21892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaGpqYytwaGFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE1MEI3RTU0LTlGREYtNEI5Qi1CNDVFLUZENjY4QzNEMEU2OEBvcHRvbmxpbmUubmV0Pg=="},"prevInTopic":21891,"nextInTopic":21893,"prevInTime":21891,"nextInTime":21893,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... get ... them, ... Looking for solutions and alternatives is a great way to help kids touch base with the underlying needs driving their desires. That s not","messageBody":"<div id=\"ygrps-yiv-1760172994\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shellini Spencer <br/>\n&lt;shellini@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I say things like that to our kids  <br/>\n&gt; too.. Just because they want it, does not mean they are going to <br/>\n </span></blockquote>get  <br/>\n<blockquote><span title=\"ireply\"> &gt; everything they want. Does not have to even do with spoiling <br/>\n </span></blockquote>them,  <br/>\n<blockquote><span title=\"ireply\"> &gt; that is just how life is.<br/>\n<br/>\n </span></blockquote>Looking for solutions and alternatives is a great way to help kids <br/>\ntouch base with the underlying needs driving their desires. That&#39;s <br/>\nnot something most of *us* learned as kids, so it can take some time <br/>\nand practice. Finding ways to say &quot;yes&quot; more often is pretty <br/>\nempowering, though. It doesn&#39;t give kids and unrealistic view of the <br/>\nworld - if anything, it helps them be more thoughtful and creative <br/>\nwhen it comes to problem-solving. <br/>\n<br/>\nIts true that, even with the most creative problem solving in the <br/>\nworld, we can&#39;t always get what we want. As parents, though, we have <br/>\nthe opportunity to help our kids learn how to cope with that, rather <br/>\nthan shrugging off their wants as inconvenient to us. <br/>\nDisappointment, sadness and frustration are difficult emotions. Our <br/>\nkids need help figuring out how to deal with difficult emotions and <br/>\nthey need to know that their feelings are valuble to us.<br/>\n<br/>\nIts unreasonable to expect children to be sanguine about <br/>\ndisappointment - heck, many adults have trouble dealing with <br/>\ndisappointment! Personally, I think a great deal of parents&#39; wanting <br/>\nkids to accept &quot;you can&#39;t always get what you want&quot; is bc of our own <br/>\ndifficulties. When we can&#39;t give our kids what they want, *we* feel <br/>\nbadly but dont&#39; know how to acknowledge and move past that feeling. <br/>\nPart of unschooling is learning to parent *ourselves*.<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":284798598,"authorName":"Alice Roddy","from":"Alice Roddy &lt;amar0514412000@...&gt;","profile":"amar0514412000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173114416","msgId":21891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2NTA2MC42NTM4Ny5xbUB3ZWI1ODUxMC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":21890,"nextInTopic":21892,"prevInTime":21890,"nextInTime":21892,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"These are fun to read and to write as well. -Two neighbor kids were over playing w/our 4 year old and my dh & I were conversing with their parents in our","messageBody":"<div id=\"ygrps-yiv-1161162413\">These are fun to read and to write as well.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-Two neighbor kids were over playing w/our 4 year old and my dh & I were<br/>\nconversing <br/>\n<br/>\nwith their parents in our backyard. Damek (our 4 year old), came up a couple of<br/>\ntimes <br/>\n<br/>\nasking for things (can&#39;t remember what now), and the neighbor made the comment<br/>\n&quot;yea, <br/>\n<br/>\nour kids were very demanding at that age also, we put a stop to that<br/>\nquick&quot;. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nResponse: Im glad he comes to me now and I hope he never<br/>\nstops. Im just praying hell still turn to me for help when hes a teenager.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-My son just had his 5th birthday party yesterday and had a couple of neighbor<br/>\nfriends <br/>\n<br/>\nover, one of the mom&#39;s came to get her son and saw that the boys were all<br/>\nenamoured <br/>\n<br/>\nwith a couple of new gameboy games my son got. The sister (age 9) of the boy<br/>\nwas there <br/>\n<br/>\nsaying how much she wanted a gameboy and the mom said &quot;if we bought you a<br/>\ngameboy <br/>\n<br/>\nyou would never read books&quot;, and then went on to say &quot;it&#39;s hard<br/>\nenough to get you to read <br/>\n<br/>\nwithout having a gameboy&quot;. The girl then said &quot;my mom said that if I<br/>\nread a lot I can have a gameboy&quot;, and then the mom said &quot;maybe&quot;.<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\nResponse: Oh, I used to think that giving rewards for doing<br/>\nthings I wanted done was a good idea. Then I read all the research about how<br/>\nrewards devalue the thing you have to do to get them. Like, if she HAS to read<br/>\nto get a GameBoy then reading must be some dumb thing no one wants to do for its<br/>\nown sake.<br/>\n<br/>\n<br/>\n<br/>\n-My sister & her husband were watching our 4 year old along with their 3<br/>\nkids. We came <br/>\n<br/>\nto pick him up and the boys were still having fun playing, so we stayed awhile<br/>\nand talked. <br/>\n<br/>\nThen my nephew wanted to watch a video, but my sister said it was too late and<br/>\nit was <br/>\n<br/>\ngetting to be bedtime. My son said &quot;well he wants to watch it&quot;, and<br/>\nmy sister said &quot;just <br/>\n<br/>\nbecause he wants to do something doesn&#39;t mean he gets to do it&quot;. My son<br/>\njust kind of <br/>\n<br/>\nlooked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nResponse: I dont know how to touch this one. Id let it go.<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nGramma Alice<br/>\nBreastfeeding is the biological norm for infants. It is a relationship that provides food, connection, protection from illness to the baby and stress reducing hormones to the mother.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nTV dinner still cooling? <br/>\nCheck out &quot;Tonight&#39;s Picks&quot; on Yahoo! TV.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/\">http://tv.yahoo.com/</a></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173113997","msgId":21890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzaGlhZCtoZmlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzZXJrYithajhtQGVHcm91cHMuY29tPg=="},"prevInTopic":21887,"nextInTopic":21891,"prevInTime":21889,"nextInTime":21891,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... Depends on the situation. These seemed fairly friendly, so I might say something light and supportive of our choices. In less comfortable situations, I","messageBody":"<div id=\"ygrps-yiv-1270800161\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie v.&quot; &lt;jlvw@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wondering what other&#39;s say or don&#39;t in situations where people make comments <br/>\n&gt; concerning controlling children?<br/>\n </span></blockquote>Depends on the situation. These seemed fairly friendly, so I might say something light and <br/>\nsupportive of our choices. In less comfortable situations, I probably wouldn&#39;t say anything, <br/>\nbecause some parents will choose to take their embarrassment out on their kids, or <br/>\nbecome more harsh to prove a point. My job isn&#39;t to promote unschooling per se, but <br/>\nperhaps model and promote mutual respect and breaking out of mainstream thought.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -Two neighbor kids were over playing w/our 4 year old and my dh & I were conversing <br/>\n&gt; with their parents in our backyard.  Damek (our 4 year old), came up a couple of times <br/>\n&gt; asking for things (can&#39;t remember what now), and the neighbor made the comment &quot;yea, <br/>\n&gt; our kids were very demanding at that age also, we put a stop to that quick&quot;. <br/>\n </span></blockquote>I&#39;d say something like &quot;Oh, we&#39;re very thankful that he&#39;s comfortable enough to ask for <br/>\nhelp. This relationship with us will serve him well when he&#39;s facing peer pressure like <br/>\ndrugs or sex.&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -The girl then said &quot;my mom said that if I read a lot I can have <br/>\n&gt; a gameboy&quot;, and then the mom said &quot;maybe&quot;. <br/>\n </span></blockquote>WIth the girl there, I would say something like &quot;Reading is fun, but I know video games are <br/>\nexcitign too&quot; just something bland and not very meaningful. After the child had left the <br/>\narea, I would mention how much video games have done to teach our children to read, <br/>\ncooperate and actually help with social skills. and then let it go, get out my mental floss, <br/>\nand try to clear my brain from the ickies.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Then my nephew wanted to watch a video, but my sister said it was too late and it was <br/>\n&gt; getting to be bedtime.  My son said &quot;well he wants to watch it&quot;, and my sister said &quot;just <br/>\n&gt; because he wants to do something doesn&#39;t mean he gets to do it&quot;.  My son just kind of <br/>\n&gt; looked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n </span></blockquote>On this one, I would have made sure to make time to talk to my son about how different <br/>\nfamilies have different expectations. At that very moment, I would have said to my child, <br/>\n&quot;I&#39;m so sorry sweetie, that&#39;s not an option for them. Can we get ready to go, and we&#39;ll talk <br/>\nmore later?&quot; In fact, I have asked my own kids to wait on the videos because little ones in <br/>\nour house do need to get ready for bed. They are usually okay with it, because they in <br/>\ngeneral respect the needs and desires of others.</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173108383","msgId":21898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNDE1LjMxMDcyLnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":21897,"nextInTopic":21906,"prevInTime":21897,"nextInTime":21899,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"This lovely note resonates with me. We are all on our own journey, and really, we must hear where another person actually is to be able to communicate with","messageBody":"<div id=\"ygrps-yiv-1664470949\">This lovely note resonates with me. We are all on our own journey, and really, we must hear where another person actually is to be able to communicate with them at all.<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Rachel Salavon &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rachelsalavon@...\">rachelsalavon@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Sunday, March 4, 2007 8:49:33 PM<br/>\nSubject: [unschoolingbasics] Re: Snappy Comebacks For Comments About Controlling Children<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, &quot;Julie v.&quot; &lt;jlvw@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wondering what other&#39;s say or don&#39;t in situations where people <br/>\n </span></blockquote>make comments <br/>\n<blockquote><span title=\"ireply\"> &gt; concerning controlling children?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I have to admit I have stopped trying to convince other people or <br/>\nwin them over to unschooling. John Holt wrote something about it in <br/>\none of his books (I can&#39;t remember which). Every person has their <br/>\nunderstanding of how life is. It is their story of the way things <br/>\nare -- some would call it their world view. Anytime a new idea is <br/>\nintroduced, that person has to fit it in to their story. If the new <br/>\nidea doesn&#39;t make sense to their story, two things can happen. <br/>\nTheir story must change. Or the idea must be rejected or <br/>\ndiscounted. When you introduce a concept as novel as peaceful <br/>\nparenting, many people will find a way to reject it. Otherwise it <br/>\nwill rock the foundation of their whole understanding of how the <br/>\nworld works. I know that&#39;s what happened to me. My story was <br/>\nprofoundly changed by this concept -- although change was slow.<br/>\n<br/>\nI am willing to talk about unschooling with someone who shows an <br/>\ninterest. But I don&#39;t bring it up. Some people get angry or don&#39;t <br/>\nwant to hear about it. And no wonder, you are threatening <br/>\neverything they hold to be true. My mil HAS to believe that the way <br/>\nshe raised her children was the right and best way. It is <br/>\nfundamental to who she is. She doesn&#39;t like to talk much about how <br/>\nthings have changed around our house. Life changing ideas make her <br/>\nnervous. I can&#39;t change her. But she just might be moved by my <br/>\nchildren as they grow up.<br/>\n<br/>\nIt is wonderful to live peacefully and generously with children. My <br/>\nbiggest challenge lately has been to extend that generosity and <br/>\nacceptance to other people.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":292658207,"authorName":"Shellini Spencer","from":"Shellini Spencer &lt;shellini@...&gt;","profile":"shellinispencer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Snappy Comebacks For Comments About Controlling Children","postDate":"1173096065","msgId":21886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1MEI3RTU0LTlGREYtNEI5Qi1CNDVFLUZENjY4QzNEMEU2OEBvcHRvbmxpbmUubmV0Pg=="},"prevInTopic":21873,"nextInTopic":21887,"prevInTime":21885,"nextInTime":21887,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Hi there, I am new to this group and reading this post. Please forgive me, but I am afraid I do not understand. Aside from the 1st situation, I dont understand","messageBody":"<div id=\"ygrps-yiv-301009992\">Hi there,<br/>\n<br/>\n<br/>\nI am new to this group and reading this post. Please forgive me, but  <br/>\nI am afraid I do not understand.<br/>\n<br/>\nAside from the 1st situation, I dont understand WHY it would be an  <br/>\nissue. In the 1st instance, it seems that they offered parenting  <br/>\nadvice which was not asked for. Now unless you turned to them and  <br/>\nsaid, &quot; I wonder if your little ones do that to you, how did you  <br/>\nhandle it...&quot;<br/>\n<br/>\nIn the other 2 , it just seems like those are their parents rules. I  <br/>\nknow lots  of parents who do not let their kids have video games. I  <br/>\neven know some that do not even have a TV in the house. They have  <br/>\ntheir reasons and their rules, and values...  Whether or not you  <br/>\ndisagree, aren&#39;t those still their rules and their kids?<br/>\n<br/>\nI am not trying to be the bad person here, if I am missing something,  <br/>\nplease explain it to me. I mean, I say things like that to our kids  <br/>\ntoo.. Just because they want it, does not mean they are going to get  <br/>\neverything they want. Does not have to even do with spoiling them,  <br/>\nthat is just how life is.  And our kids do have video games, but they  <br/>\nare limited in how long they are allowed to play, and they dont play  <br/>\neveryday... There are so many things to do, I would not want them  <br/>\nhooked on ONE thing all day long..... these are the rules in our  <br/>\nhouse....<br/>\n<br/>\nThank you!<br/>\nShellini<br/>\n<br/>\nMothers hold their children&#39;s hands for a short while, but their  <br/>\nhearts forever.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224484022,"authorName":"Rachel Salavon","from":"&quot;Rachel Salavon&quot; &lt;rachelsalavon@...&gt;","profile":"mom2twon2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173066573","msgId":21887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzZzQwZCttMGJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVzZXJrYithajhtQGVHcm91cHMuY29tPg=="},"prevInTopic":21886,"nextInTopic":21890,"prevInTime":21886,"nextInTime":21888,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"... make comments ... I have to admit I have stopped trying to convince other people or win them over to unschooling.  John Holt wrote something about it in ","messageBody":"<div id=\"ygrps-yiv-1099839797\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie v.&quot; &lt;jlvw@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wondering what other&#39;s say or don&#39;t in situations where people <br/>\n </span></blockquote>make comments <br/>\n<blockquote><span title=\"ireply\"> &gt; concerning controlling children?<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>I have to admit I have stopped trying to convince other people or <br/>\nwin them over to unschooling.  John Holt wrote something about it in <br/>\none of his books (I can&#39;t remember which).  Every person has their <br/>\nunderstanding of how life is.  It is their story  of the way things <br/>\nare -- some would call it their world view.  Anytime a new idea is <br/>\nintroduced, that person has to fit it in to their story.  If the new <br/>\nidea doesn&#39;t make sense to their story, two things can happen.  <br/>\nTheir story must change.  Or the idea must be rejected or <br/>\ndiscounted.  When you introduce a concept as novel as peaceful <br/>\nparenting, many people will find a way to reject it.  Otherwise it <br/>\nwill rock the foundation of their whole understanding of how the <br/>\nworld works.  I know that&#39;s what happened to me.  My story was <br/>\nprofoundly changed by this concept -- although change was slow.<br/>\n<br/>\nI am willing to talk about unschooling with someone who shows an <br/>\ninterest.  But I don&#39;t bring it up.  Some people get angry or don&#39;t <br/>\nwant to hear about it.  And no wonder, you are threatening <br/>\neverything they hold to be true.  My mil HAS to believe that the way <br/>\nshe raised her children was the right and best way.  It is <br/>\nfundamental to who she is.  She doesn&#39;t like to talk much about how <br/>\nthings have changed around our house.  Life changing ideas make her <br/>\nnervous.  I can&#39;t change her.  But she just might be moved by my <br/>\nchildren as they grow up.<br/>\n<br/>\nIt is wonderful to live peacefully and generously with children.  My <br/>\nbiggest challenge lately has been to extend that generosity and <br/>\nacceptance to other people.</div>","specialLinks":[]},{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Snappy Comebacks For Comments About Controlling Children","postDate":"1173035648","msgId":21873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjk3LjM0OTM0LnFtQHdlYjYwMzE3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":21872,"nextInTopic":21886,"prevInTime":21872,"nextInTime":21874,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"It s hard to hear that kind of thing, isn t it? I think what is most productive, is doing some of the same kinds of things we do for our own kids.  Express","messageBody":"<div id=\"ygrps-yiv-103983242\">It&#39;s hard to hear that kind of thing, isn&#39;t it?<br/>\n<br/>\nI think what is most productive, is doing some of the same kinds of things we do for our own kids.  Express empathy, &quot;Yeah, children do need a lot of help -- it can be overwhelming sometimes.&quot;  To the daughter, &quot;You really want a gameboy, huh?&quot; or to the mother, &quot;You sound pretty worried about her reading&quot; (or maybe not, unless you&#39;re willing to get into a longer discussion of her woes:-)   You can do that without sharing their feelings or sounding overwhelmed or worried yourself.  You could also share your own experiences, although that might be better at some later point especially in the latter 2 instances which were more about other people&#39;s kids.  <br/>\n<br/>\nI think the biggest thing we can do is live our own lives joyfully and with confidence.   Then, if people don&#39;t see us as judging them, they may in time express interest in our choices -- especially people you see regularly or know well like neighbors and family.  But if we appear judgmental or zealous, they probably won&#39;t be interested now or later.<br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\n8:00? 8:25? 8:40? Find a flick in no time <br/>\nwith the Yahoo! Search movie showtime shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#news\">http://tools.search.yahoo.com/shortcuts/#news</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Snappy Comebacks For Comments About Controlling Children","postDate":"1173034789","msgId":21872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzZjR2NStvc3JwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTQwMWM3NWU3ZSQwODY1YWQ4MCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":21871,"nextInTopic":21873,"prevInTime":21871,"nextInTime":21873,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Schuyler, Exactly!  I probably should have rephrased the question, as I don t want to make a snide comment, because I don t want them to get defensive, so","messageBody":"<div id=\"ygrps-yiv-1149107914\">Schuyler,<br/>\n<br/>\nExactly!  I probably should have rephrased the question, as I don&#39;t want to make a snide <br/>\ncomment, because I don&#39;t want them to get defensive, so usually I just say nothing.  I like <br/>\nthe idea of mentioning something as a side note concerning the subject of the comment <br/>\nthat was made.  Even though my dh & I are totally committed to radical unschooling, we <br/>\nstill have our share of learning to go, and I think that as it gets more & more comfortable <br/>\nand like second nature it will be easier for us to just converse ru with other people.  Not so <br/>\nmuch to convert them, but just to help them understand it. <br/>\n<br/>\nThanks,<br/>\n<br/>\nJulie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a> <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Schuyler&quot; &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; David (dh) is really good at talking about it later. So, later he&#39;d talk <br/>\n&gt; with the girl&#39;s mom about how amazing the Pokemon gameboy games are for <br/>\n&gt; reading, how much reading goes on in role playing games, how narrative those <br/>\n&gt; kinds of games are. He might mention some of the studies talking about the <br/>\n&gt; narrative value of video games. But it wouldn&#39;t be direct, it wouldn&#39;t be <br/>\n&gt; about the girl asking for a gameboy. It would be some side story, something <br/>\n&gt; to maybe get her thinking about video games in a different light.<br/>\n&gt; <br/>\n&gt; To the first situation I&#39;d probably have said something along the lines of <br/>\n&gt; thinking I&#39;d miss it if he did stop while smiling and looking fondly at my <br/>\n&gt; son. Something sort of distracted. Maybe even something like &quot;oh, well, they <br/>\n&gt; grow up so fast, I am appreciated so much who he is now.&quot;<br/>\n&gt; <br/>\n&gt; The last situation would depend on your relationship with your sister. If <br/>\n&gt; you are comfortable teasing her, than maybe you could have said something <br/>\n&gt; like &quot;Wow, you sound just like mom (or dad or some one in your shared past&quot; <br/>\n&gt; and hope that she could see the link. And maybe helped her let her son watch <br/>\n&gt; the video.<br/>\n&gt; <br/>\n&gt; I think it is hard to get people to see how being generous with your child <br/>\n&gt; isn&#39;t going to produce a spoiled brat. I don&#39;t think it is situation where a <br/>\n&gt; snappy comeback will help. It is very easy to make a parent feel defensive <br/>\n&gt; about their decisions. And a defensive parent may make it more difficult for <br/>\n&gt; your son to play with their kids. What is the line, &quot;be the change you want <br/>\n&gt; to see in the world.&quot; Help other parents to see how good your life is with <br/>\n&gt; your child by being gentle and loving and watching that child be gentle and <br/>\n&gt; loving in return.<br/>\n&gt; <br/>\n&gt; Schuyler<br/>\n&gt; www.waynforth.blogspot.com<br/>\n&gt; ----- Original Message ----- <br/>\n&gt; From: &quot;Julie v.&quot; &lt;jlvw@...&gt;<br/>\n&gt; To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\n&gt; Sent: Sunday, March 04, 2007 4:20 PM<br/>\n&gt; Subject: [unschoolingbasics] Snappy Comebacks For Comments About Controlling <br/>\n&gt; Children<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; Wondering what other&#39;s say or don&#39;t in situations where people make <br/>\n&gt; &gt; comments<br/>\n&gt; &gt; concerning controlling children?<br/>\n&gt; &gt;<br/>\n&gt; &gt; In the situations that I&#39;ve had arise, the people either don&#39;t know we <br/>\n&gt; &gt; unschool or if they do<br/>\n&gt; &gt; don&#39;t know much about it.  Some recent comments have been the following:<br/>\n&gt; &gt;<br/>\n&gt; &gt; -Two neighbor kids were over playing w/our 4 year old and my dh & I were <br/>\n&gt; &gt; conversing<br/>\n&gt; &gt; with their parents in our backyard.  Damek (our 4 year old), came up a <br/>\n&gt; &gt; couple of times<br/>\n&gt; &gt; asking for things (can&#39;t remember what now), and the neighbor made the <br/>\n&gt; &gt; comment &quot;yea,<br/>\n&gt; &gt; our kids were very demanding at that age also, we put a stop to that <br/>\n&gt; &gt; quick&quot;.<br/>\n&gt; &gt;<br/>\n&gt; &gt; -My son just had his 5th birthday party yesterday and had a couple of <br/>\n&gt; &gt; neighbor friends<br/>\n&gt; &gt; over, one of the mom&#39;s came to get her son and saw that the boys were all <br/>\n&gt; &gt; enamoured<br/>\n&gt; &gt; with a couple of new gameboy games my son got.  The sister (age 9) of the <br/>\n&gt; &gt; boy was there<br/>\n&gt; &gt; saying how much she wanted a gameboy and the mom said &quot;if we bought you a <br/>\n&gt; &gt; gameboy<br/>\n&gt; &gt; you would never read books&quot;, and then went on to say &quot;it&#39;s hard enough to <br/>\n&gt; &gt; get you to read<br/>\n&gt; &gt; without having a gameboy&quot;.  The girl then said &quot;my mom said that if I read <br/>\n&gt; &gt; a lot I can have<br/>\n&gt; &gt; a gameboy&quot;, and then the mom said &quot;maybe&quot;.<br/>\n&gt; &gt;<br/>\n&gt; &gt; -My sister & her husband were watching our 4 year old along with their 3 <br/>\n&gt; &gt; kids.  We came<br/>\n&gt; &gt; to pick him up and the boys were still having fun playing, so we stayed <br/>\n&gt; &gt; awhile and talked.<br/>\n&gt; &gt; Then my nephew wanted to watch a video, but my sister said it was too late <br/>\n&gt; &gt; and it was<br/>\n&gt; &gt; getting to be bedtime.  My son said &quot;well he wants to watch it&quot;, and my <br/>\n&gt; &gt; sister said &quot;just<br/>\n&gt; &gt; because he wants to do something doesn&#39;t mean he gets to do it&quot;.  My son <br/>\n&gt; &gt; just kind of<br/>\n&gt; &gt; looked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n&gt; &gt;<br/>\n&gt; &gt; In the first situation I feel like I could have said something as she was <br/>\n&gt; &gt; addressing us in<br/>\n&gt; &gt; particular.  The second situation was sort of between the girl & the mom, <br/>\n&gt; &gt; but I was<br/>\n&gt; &gt; included in the conversation as the girl was talking to me.  Would you say <br/>\n&gt; &gt; anything or just<br/>\n&gt; &gt; keep your mouth shut?  I so want to promote unschooling, but I just don&#39;t <br/>\n&gt; &gt; think in these<br/>\n&gt; &gt; situations with these types of people they would even attempt to &quot;get&quot; <br/>\n&gt; &gt; what unschooling is<br/>\n&gt; &gt; all about.<br/>\n&gt; &gt;<br/>\n&gt; &gt; What do others do in these types of situations?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thanks,<br/>\n&gt; &gt;<br/>\n&gt; &gt; Julie<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Snappy Comebacks For Comments About Controlling Children","postDate":"1173027376","msgId":21871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWM3NWU3ZSQwODY1YWQ4MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGVzZXJrYithajhtQGVHcm91cHMuY29tPg=="},"prevInTopic":21868,"nextInTopic":21872,"prevInTime":21870,"nextInTime":21872,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"David (dh) is really good at talking about it later. So, later he d talk with the girl s mom about how amazing the Pokemon gameboy games are for reading, how","messageBody":"<div id=\"ygrps-yiv-632237375\">David (dh) is really good at talking about it later. So, later he&#39;d talk <br/>\nwith the girl&#39;s mom about how amazing the Pokemon gameboy games are for <br/>\nreading, how much reading goes on in role playing games, how narrative those <br/>\nkinds of games are. He might mention some of the studies talking about the <br/>\nnarrative value of video games. But it wouldn&#39;t be direct, it wouldn&#39;t be <br/>\nabout the girl asking for a gameboy. It would be some side story, something <br/>\nto maybe get her thinking about video games in a different light.<br/>\n<br/>\nTo the first situation I&#39;d probably have said something along the lines of <br/>\nthinking I&#39;d miss it if he did stop while smiling and looking fondly at my <br/>\nson. Something sort of distracted. Maybe even something like &quot;oh, well, they <br/>\ngrow up so fast, I am appreciated so much who he is now.&quot;<br/>\n<br/>\nThe last situation would depend on your relationship with your sister. If <br/>\nyou are comfortable teasing her, than maybe you could have said something <br/>\nlike &quot;Wow, you sound just like mom (or dad or some one in your shared past&quot; <br/>\nand hope that she could see the link. And maybe helped her let her son watch <br/>\nthe video.<br/>\n<br/>\nI think it is hard to get people to see how being generous with your child <br/>\nisn&#39;t going to produce a spoiled brat. I don&#39;t think it is situation where a <br/>\nsnappy comeback will help. It is very easy to make a parent feel defensive <br/>\nabout their decisions. And a defensive parent may make it more difficult for <br/>\nyour son to play with their kids. What is the line, &quot;be the change you want <br/>\nto see in the world.&quot; Help other parents to see how good your life is with <br/>\nyour child by being gentle and loving and watching that child be gentle and <br/>\nloving in return.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Julie v.&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlvw@...\">jlvw@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Sunday, March 04, 2007 4:20 PM<br/>\nSubject: [unschoolingbasics] Snappy Comebacks For Comments About Controlling <br/>\nChildren<br/>\n<br/>\n<br/>\n&gt; Wondering what other&#39;s say or don&#39;t in situations where people make <br/>\n&gt; comments<br/>\n&gt; concerning controlling children?<br/>\n&gt;<br/>\n&gt; In the situations that I&#39;ve had arise, the people either don&#39;t know we <br/>\n&gt; unschool or if they do<br/>\n&gt; don&#39;t know much about it.  Some recent comments have been the following:<br/>\n&gt;<br/>\n&gt; -Two neighbor kids were over playing w/our 4 year old and my dh & I were <br/>\n&gt; conversing<br/>\n&gt; with their parents in our backyard.  Damek (our 4 year old), came up a <br/>\n&gt; couple of times<br/>\n&gt; asking for things (can&#39;t remember what now), and the neighbor made the <br/>\n&gt; comment &quot;yea,<br/>\n&gt; our kids were very demanding at that age also, we put a stop to that <br/>\n&gt; quick&quot;.<br/>\n&gt;<br/>\n&gt; -My son just had his 5th birthday party yesterday and had a couple of <br/>\n&gt; neighbor friends<br/>\n&gt; over, one of the mom&#39;s came to get her son and saw that the boys were all <br/>\n&gt; enamoured<br/>\n&gt; with a couple of new gameboy games my son got.  The sister (age 9) of the <br/>\n&gt; boy was there<br/>\n&gt; saying how much she wanted a gameboy and the mom said &quot;if we bought you a <br/>\n&gt; gameboy<br/>\n&gt; you would never read books&quot;, and then went on to say &quot;it&#39;s hard enough to <br/>\n&gt; get you to read<br/>\n&gt; without having a gameboy&quot;.  The girl then said &quot;my mom said that if I read <br/>\n&gt; a lot I can have<br/>\n&gt; a gameboy&quot;, and then the mom said &quot;maybe&quot;.<br/>\n&gt;<br/>\n&gt; -My sister & her husband were watching our 4 year old along with their 3 <br/>\n&gt; kids.  We came<br/>\n&gt; to pick him up and the boys were still having fun playing, so we stayed <br/>\n&gt; awhile and talked.<br/>\n&gt; Then my nephew wanted to watch a video, but my sister said it was too late <br/>\n&gt; and it was<br/>\n&gt; getting to be bedtime.  My son said &quot;well he wants to watch it&quot;, and my <br/>\n&gt; sister said &quot;just<br/>\n&gt; because he wants to do something doesn&#39;t mean he gets to do it&quot;.  My son <br/>\n&gt; just kind of<br/>\n&gt; looked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n&gt;<br/>\n&gt; In the first situation I feel like I could have said something as she was <br/>\n&gt; addressing us in<br/>\n&gt; particular.  The second situation was sort of between the girl & the mom, <br/>\n&gt; but I was<br/>\n&gt; included in the conversation as the girl was talking to me.  Would you say <br/>\n&gt; anything or just<br/>\n&gt; keep your mouth shut?  I so want to promote unschooling, but I just don&#39;t <br/>\n&gt; think in these<br/>\n&gt; situations with these types of people they would even attempt to &quot;get&quot; <br/>\n&gt; what unschooling is<br/>\n&gt; all about.<br/>\n&gt;<br/>\n&gt; What do others do in these types of situations?<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt;<br/>\n&gt; Julie<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Snappy Comebacks For Comments About Controlling Children","postDate":"1173025227","msgId":21868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzZXJrYithajhtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":21871,"prevInTime":21867,"nextInTime":21869,"topicId":21868,"numMessagesInTopic":0,"msgSnippet":"Wondering what other s say or don t in situations where people make comments concerning controlling children? In the situations that I ve had arise, the people","messageBody":"<div id=\"ygrps-yiv-47219386\">Wondering what other&#39;s say or don&#39;t in situations where people make comments <br/>\nconcerning controlling children?<br/>\n<br/>\nIn the situations that I&#39;ve had arise, the people either don&#39;t know we unschool or if they do <br/>\ndon&#39;t know much about it.  Some recent comments have been the following:<br/>\n<br/>\n-Two neighbor kids were over playing w/our 4 year old and my dh & I were conversing <br/>\nwith their parents in our backyard.  Damek (our 4 year old), came up a couple of times <br/>\nasking for things (can&#39;t remember what now), and the neighbor made the comment &quot;yea, <br/>\nour kids were very demanding at that age also, we put a stop to that quick&quot;.  <br/>\n<br/>\n-My son just had his 5th birthday party yesterday and had a couple of neighbor friends <br/>\nover, one of the mom&#39;s came to get her son and saw that the boys were all enamoured <br/>\nwith a couple of new gameboy games my son got.  The sister (age 9) of the boy was there <br/>\nsaying how much she wanted a gameboy and the mom said &quot;if we bought you a gameboy <br/>\nyou would never read books&quot;, and then went on to say &quot;it&#39;s hard enough to get you to read <br/>\nwithout having a gameboy&quot;.  The girl then said &quot;my mom said that if I read a lot I can have <br/>\na gameboy&quot;, and then the mom said &quot;maybe&quot;. <br/>\n<br/>\n-My sister & her husband were watching our 4 year old along with their 3 kids.  We came <br/>\nto pick him up and the boys were still having fun playing, so we stayed awhile and talked.  <br/>\nThen my nephew wanted to watch a video, but my sister said it was too late and it was <br/>\ngetting to be bedtime.  My son said &quot;well he wants to watch it&quot;, and my sister said &quot;just <br/>\nbecause he wants to do something doesn&#39;t mean he gets to do it&quot;.  My son just kind of <br/>\nlooked dumbfounded, as he doesn&#39;t encounter this attitude from us.<br/>\n<br/>\nIn the first situation I feel like I could have said something as she was addressing us in <br/>\nparticular.  The second situation was sort of between the girl & the mom, but I was <br/>\nincluded in the conversation as the girl was talking to me.  Would you say anything or just <br/>\nkeep your mouth shut?  I so want to promote unschooling, but I just don&#39;t think in these <br/>\nsituations with these types of people they would even attempt to &quot;get&quot; what unschooling is <br/>\nall about.<br/>\n<br/>\nWhat do others do in these types of situations?<br/>\n<br/>\nThanks,<br/>\n<br/>\nJulie</div>","specialLinks":[]}],"prevTopicId":22185,"nextTopicId":9428}}