{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":100,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219159717","msgId":35440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NEFEREQwQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":35439,"nextInTopic":35442,"prevInTime":35439,"nextInTime":35441,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Yeah, we fudged DS age on Neopets also - and I recently had a discussion with him about being careful about giving out information since not everyone is who","messageBody":"<div id=\"ygrps-yiv-1193305486\">Yeah, we fudged DS&#39; age on Neopets also - and I recently had a<br/>\ndiscussion with him about being careful about giving out information<br/>\nsince not everyone is who they say they are (in regards to a 19 yr old<br/>\nfrom somewhere or other who sent a friend request). Basically, I just<br/>\nasked that he let us know about such requests before he adds them as<br/>\nfriends.<br/>\n<br/>\nAnd, I thought of a time when I&#39;m basically always &quot;fudging&quot; things<br/>\neither overtly or covertly (that is verbally or non verbally). When I go<br/>\nto a bookstore (say B&N) and use my Educator Discount card on a stack of<br/>\nPokemon books and MASH season DVDs and such. I -do- divide out things<br/>\nthat are gifts for others and stuff that is strictly my own reading<br/>\nmaterial. But, most of the stuff in the pile is stuff that will be used<br/>\nfor our life as a family (books on herb gardening for instance). Most of<br/>\nthe time, no one asks about it, they just take the discount but on<br/>\noccasion I&#39;ve been asked &quot;Is this for classroom use?&quot; W-e-e-l-l-l by<br/>\ntheir definition of &#39;classroom&#39; Not exactly; by our definition (all the<br/>\nworld&#39;s a stage and we are but learners on&#39;t) yes, definitely. So, I say<br/>\nYes. Definite fudge factor there - but then again the answer to the<br/>\nquestion is not black & white.<br/>\n<br/>\nDeb <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219158998","msgId":35439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4ZW80bStnYjBoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgwODE4MTIwOWc1N2YxNWE2N2phNjQ3NzZlZDM2Yzg2MjA2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":35431,"nextInTopic":35440,"prevInTime":35438,"nextInTime":35440,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"THANK YOU!  This is just what I was looking for! :)","messageBody":"<div id=\"ygrps-yiv-932325693\">THANK YOU!  This is just what I was looking for! :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, k &lt;katherand@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Here&#39;s someplace else to read answers for questions to unschoolers about<br/>\n&gt; rules:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ~Katherine<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network--Do&#39;s and Don&#39;ts etc","postDate":"1219158946","msgId":35442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4ZW8zMitpaHVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyODg1MjBDLTM4MzgtNDYzRS04OTlCLUFDNjZDNkQ1NTg4MEB2ZXJpem9uLm5ldD4="},"prevInTopic":35440,"nextInTopic":35444,"prevInTime":35441,"nextInTime":35443,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"I always thought it was funny that rules always say Don t first so the only thing a child hears is bite, poke, tease, hit.  Why don t parents do the","messageBody":"<div id=\"ygrps-yiv-824035129\">I always thought it was funny that &quot;rules&quot; always say &quot;Don&#39;t&quot; first so the only thing a child <br/>\nhears is bite, poke, tease, hit.  Why don&#39;t parents do the positive thing?  Why is it usually <br/>\nnegative?  Parental history?  I don&#39;t know, but if a child only hears the final word why not <br/>\nhave it be peace?  or love? or play? try this? (redirection) or (insert your word here).  It is no <br/>\nwonder to me that most children by the time they are 2 are saying NO!  They hear it <br/>\nconstantly.  <br/>\n<br/>\nWhen we had children we chose not to do it that way and it was miraculous --the children <br/>\nwere happy, loving, and didn&#39;t start yelling NO at age 2...or 3.....or 4....or even now. LOL  If <br/>\nwe want to be respectful and help our children, guide our children, shouldn&#39;t they be able <br/>\nto learn to make good decisions and take the natural consequences of the poor ones?  I <br/>\ndon&#39;t mean stand there and watch as your baby pulls a boiling pot of water down on <br/>\nherself or a toddler put his hand on a flaming stove.  Those consequences are too severe, <br/>\nbut I mean letting them learn while redirecting their behavior in a positive way till they are <br/>\nable to understand the differences.<br/>\n<br/>\nI am not sure if I am making sense right now, so tired.  So I apologize if my critical brain <br/>\ncells are currently down.  LOL<br/>\n<br/>\nI just knew from my background that I didn&#39;t want to behave the way my parents did and I <br/>\ndidn&#39;t want my children to hate me the way I hated them.  Abuse is not an option.  So I <br/>\ndiscussed it with my husband, we read a lot and we found a way to be that was ok for <br/>\nboth of us.  He had been spanked on occasion but knew why, I had been beaten.  I felt <br/>\nspanking was evil and wanted it not in my home.  Where is the peace in that???  So he went <br/>\nalong, and although he did spank a couple times, that was all it took for him to see it <br/>\nwouldn&#39;t work and would not be a good way if we wanted a happy home.  sounds cheesy, I <br/>\nknow.  But I am the only one to break the mold of my family.  I have to work at it all the <br/>\ntime.  I have to remember that rules aren&#39;t laws.  There is a difference.  I hope my children <br/>\nwill do the same, but they have their own agency to choose.  They will make their choices <br/>\nbased on the information they have. My job is to help them find all the information they <br/>\nneed or want.<br/>\n<br/>\nWe are the models they will take with them when they are grown and have families of their <br/>\nown. If we practice what we preach they will know, if we don&#39;t it will show.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: laws and rules WAS: Children on Radical Unschooler&#39;s Network","postDate":"1219147816","msgId":35431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQUQwMEJBQ0MyNUNCMS1DMTAtMjI1OEB3ZWJtYWlsLWRkMTcuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGc4ZWJ1MCtmdW0zQGVHcm91cHMuY29tPg=="},"prevInTopic":35430,"nextInTopic":35439,"prevInTime":35430,"nextInTime":35432,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"... -=-=-=-=-=- And isn t it refreshing to look at today s governments throughout the world? It s nice to know that, in the rule/law-bound societies that we","messageBody":"<div id=\"ygrps-yiv-494579016\">-----Original Message-----<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do however disagree and respectfully so that while rules are<br/>\n&gt; useless within a small community such as a home or family they are<br/>\n&gt; without a doubt(look at any example in world history) a necessary<br/>\n&gt; tool for a society. look at any area that has seen a time without<br/>\n&gt; any government. chaos results and death and disaster follow.<br/>\n<br/>\n </span></blockquote>-=-=-=-=-=-<br/>\n<br/>\nAnd isn&#39;t it refreshing to look at today&#39;s governments throughout the <br/>\nworld?<br/>\n<br/>\nIt&#39;s nice to know that, in the rule/law-bound societies that we have <br/>\nNOW, there is absolutely NO chaos, NO death, and NO disaster.<br/>\n<br/>\nThank goodness for laws and rules! They are soooo comforting!<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a></div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219146496","msgId":35430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4ZWJ1MCtmdW0zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4Y2N2Nitybmp2QGVHcm91cHMuY29tPg=="},"prevInTopic":35429,"nextInTopic":35431,"prevInTime":35429,"nextInTime":35431,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"... I haven t seen anyone suggest rules are useless.  Instead, I believe what is being said is that everyone makes their own choices about whether or not to","messageBody":"<div id=\"ygrps-yiv-75030036\"><blockquote><span title=\"ireply\">&gt; I do however disagree and respectfully so that while rules are<br/>\n&gt; useless within a small community such as a home or family they are<br/>\n&gt; without a doubt(look at any example in world history) a necessary<br/>\n&gt; tool for a society. look at any area that has seen a time without<br/>\n&gt; any government. chaos results and death and disaster follow.<br/>\n<br/>\n </span></blockquote>I haven&#39;t seen anyone suggest rules are useless.  Instead, I believe <br/>\nwhat is being said is that everyone makes their own choices about <br/>\nwhether or not to follow a certain rule/law.  I do not break every <br/>\nlaw, but I&#39;ll confess I have sometimes broken a rule.  I sometimes <br/>\nspeed in my vehicle.  I have lied about being sick to get a day off <br/>\nat work (if caught doing so in one particular job, it was grounds for <br/>\nterminaion).  I think people make choices every day that have <br/>\nconsequences.  Laws are supposedly written for the good of the <br/>\npublic.  But what about some of the crazy laws that have made it onto <br/>\nthe books?  Have you ever researched those?  Am I really criminal if <br/>\nI utter the phrase &#39;Oh boy&#39; in Jonesboro Georgia, which reportedly <br/>\ndoes have a law on the books making that illegal?<br/>\n<br/>\nI don&#39;t think our country is on the verge of destruction because some <br/>\npeople don&#39;t follow all the rules all the time.  History also shows <br/>\nmany people breaking laws and dealing with consequences.<br/>\n<br/>\nGotta get to work.<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219134073","msgId":35429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MDQ5LjU5OTAzLnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":35428,"nextInTopic":35430,"prevInTime":35428,"nextInTime":35430,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"I often use my birthdate to get Simon and Linnaea full-entry on to an on-line site. Partially because I can remember it better than I can some hedging of their","messageBody":"<div id=\"ygrps-yiv-67523547\">I often use my birthdate to get Simon and Linnaea full-entry on to an on-line site. Partially because I can remember it better than I can some hedging of their own birthday, but also because it seems legitimate, in my head, to see myself as the person who is signing up for the access. <br/>\n<br/>\nWhen Simon first got on to Neopets I signed him up at the age he was at the time. I then wrote the letter that was required to get him access to the rest of the website. It took almost a month. It wasn&#39;t very convenient. He got frustrated. I decided that it was easier for me to give my approval for him to access the adult sections of an on-line membership without jumping the hurdle that the service required. <br/>\n<br/>\nThere is this really cool climbing and zip swing sliding and treetop walking park near us. You have to be a certain height and 10 years old to participate. Linnaea is almost the height, but she&#39;s 8 and a bit. I talked about why they would have an age limit. There are lots of age limited access to things in the UK, far more than I remember there being in the U.S. So it isn&#39;t a new discussion. She was completely not comfortable with the idea of lying about her age to get into the harness and up the trees. Changing her age to access Neopets hasn&#39;t been a slippery slope for her into the realm of lying about her age. She doesn&#39;t want to be older than she is. And if she really wanted to go and do something that had an age limit I would work really hard to find ways around lying about her age. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Monday, 18 August, 2008 6:28:10 PM<br/>\nSubject: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network<br/>\n<br/>\n<br/>\n<br/>\n~~if i choose to use it and my expose and encourage my childs<br/>\nuse of a site how respectful am i being and are we being when we<br/>\nviolate the stipulations of the person or persons who the site<br/>\nbelongs to. does that model respect.~~<br/>\n<br/>\nAre you more concerned about respecting an arbitrary age rule, set up<br/>\nto protect a network from liability issues or respecting your child&#39;s<br/>\ndesire to connect with friends? That&#39;s where you and I differ (amongst<br/>\nmany other things). I choose to respect my child more than some<br/>\narbitrary rule. Doesn&#39;t mean we ignore all rules. We can logically<br/>\nanalyze whether there is a good reason for something and whether it is<br/>\na useful rule. <br/>\n<br/>\nThe age of thirteen isn&#39;t some magical age that indicates a child&#39;s<br/>\nability to properly utilize an online community.<br/>\n<br/>\n~~lets face it in a society we do need some rules not just <br/>\n<blockquote><span title=\"ireply\"> &gt; people following their own critical thought as that would lead to <br/>\n&gt; complete oligarchy which by the way would eb the natural end result <br/>\n&gt; of anarchy.~~<br/>\n<br/>\n </span></blockquote>I guess that&#39;s another point we differ on. I don&#39;t think rules and<br/>\nlaws prevent anything. Maybe to a small degree. But mostly it just<br/>\ngives the law makers the ability to punish people. Laws exist to allow<br/>\npunishment for not following the law. They don&#39;t exist to prevent<br/>\nanything (thought the makers seem to think they do).<br/>\n<br/>\nMore laws don&#39;t equal less problems.<br/>\n<br/>\n~~if the birth date on the website is so irrelivant what about a fake <br/>\n<blockquote><span title=\"ireply\"> &gt; id to get into bars or why not just buy coke since i am a smart and <br/>\n&gt; critical thinking person arent they all the same thing?~~<br/>\n<br/>\n </span></blockquote>If you think that any and all lying about age is the same thing, that<br/>\nshows a lack of critical thinking. It&#39;s faulty logic.<br/>\n<br/>\nAs for fake ID, my parents didn&#39;t drink or allow any alcohol in our<br/>\nhome. They certainly never lied about our ages. I borrowed a fake ID<br/>\nat age 18 and went bar hopping. Actually, I&#39;d been bar hopping before<br/>\nand never got carded! The night I borrowed the fake ID I met my<br/>\nhusband of 19 years.:) Funny how things can work out eh?<br/>\n<br/>\nI&#39;m not advocating &quot;ignore all rules&quot; but I&#39;m also baffled when people<br/>\nsay that by ignoring an age rule it somehow equates to any and all age<br/>\nfudging as being equal. It&#39;s not. <br/>\n<br/>\n~~ i thought we were trying to accomplish modeling a behavior <br/>\n<blockquote><span title=\"ireply\"> &gt; that wasnt about following rules to avoid punishment or to be <br/>\n&gt; rewarded but to respect those around us and ourselves in a way that <br/>\n&gt; allows us to just live and have our very life shine through with a <br/>\n&gt; manner that by its very essence does not impeach anothers right at <br/>\n&gt; self regulation.~ ~<br/>\n<br/>\n </span></blockquote>And by choosing to fudge a birth date to join a lively group of<br/>\nunschoolers who have enriched our lives immensely, we in NO way are<br/>\nimpeaching upon any one else&#39;s right at self regulation. Not at all.<br/>\n<br/>\nMaybe you should go read at the site itself and see how the children<br/>\nare sharing their art,their dreams, their birthdays, their joys and<br/>\nconcerns, their lives with each other. It&#39;s a beautiful thing and I&#39;m<br/>\nglad for parents that are giving their child access to such rich<br/>\nconnections! Without ever causing infringement upon any other human<br/>\nbeing or their rights. Cool huh?<br/>\n<br/>\nRen<br/>\nlearninginfreedom. com<br/>\n<br/>\n    <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219116712","msgId":35428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyNTMxNC44NDE0MC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":35427,"nextInTopic":35429,"prevInTime":35427,"nextInTime":35429,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"And that was after all that talk over at AlwaysLearning about Grammar!:)   Alex Polikowsky http://polykow.blogspot.com/   ","messageBody":"<div id=\"ygrps-yiv-934801074\">And that was after all that talk over at AlwaysLearning about Grammar!:)<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\nhttp://polykow.blogspot.com/<br/>\n <br/>\nhttp://groups.yahoo.com/group/unschoolingmn/<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: k &lt;katherand@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Monday, August 18, 2008 7:14:30 PM<br/>\nSubject: Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network<br/>\n<br/>\n<br/>\nYou write pots here. ;) Heehee. (pots= lots of posts)<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/18/08, BRIAN POLIKOWSKY &lt;polykowholsteins@ yahoo.com&gt; wrote:<br/>\n&gt;<br/>\n&gt; p.s. where have all the dad&#39;s gone on this list?<br/>\n&gt; other thatn an occasional post by Bryan i almost never read a man&#39;s<br/>\n&gt; opinion unless his wife is giving it.....hahaha.<br/>\n&gt;<br/>\n&gt; -=-=-=-=-=-= -=-=-=-=- =-=-=-=-= -=-=-=-=- =-=-<br/>\n&gt; If you are refering to me its actually Alex, Brian&quot;s wife, that writes<br/>\n&gt; pots here&lt;bwg&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n&gt; http://polykow. blogspot. com/<br/>\n&gt;<br/>\n&gt; http://groups. yahoo.com/ group/unschoolin gmn/<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ----- Original Message ----<br/>\n&gt; From: Paul H. Beaulieu II &lt;ballou12400@ yahoo.com &lt;ballou12400% 40yahoo.com&gt;<br/>\n&gt; &gt;<br/>\n&gt; To: unschoolingbasics@ yahoogroups. com&lt;unschoolingbasics% 40yahoogroups. com&gt;<br/>\n&gt; Sent: Monday, August 18, 2008 12:53:42 PM<br/>\n&gt; Subject: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network<br/>\n&gt;<br/>\n&gt; Thanks katherine and yes i did get that and i dont actually have a real<br/>\n&gt; problem with some of the work arounds in this case however i wanted to<br/>\n&gt; use this as an opportunity to discuss some of the more borderline<br/>\n&gt; functions of judgement and modeling respect and responsibility.<br/>\n&gt;<br/>\n&gt; i dont want you to think that i believe the RUN age thing is the issue<br/>\n&gt; i was trying to discuss.<br/>\n&gt;<br/>\n&gt; I do however disagree and respectfully so that while rules are useless<br/>\n&gt; within a small community such as a home or family they are without a<br/>\n&gt; doubt(look at any example in world history) a necessary tool for a<br/>\n&gt; society. look at any area that has seen a time without any government.<br/>\n&gt; chaos results and death and disaster follow.<br/>\n&gt;<br/>\n&gt; PB<br/>\n&gt;<br/>\n&gt; p.s. where have all the dad&#39;s gone on this list?<br/>\n&gt; other thatn an occasional post by Bryan i almost never read a man&#39;s<br/>\n&gt; opinion unless his wife is giving it.....hahaha.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219104870","msgId":35427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODE4MTcxNHM3NTQwZjk5eTJkYmM3NTdlNmIyMmYyZGZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDU0Mjg0Mi42OTQ0NS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU0Mjg0Mi42OTQ0NS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":35426,"nextInTopic":35428,"prevInTime":35426,"nextInTime":35428,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"You write pots here.  ;)  Heehee.  (pots= lots of posts) ~Katherine ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1583716437\">You write pots here.  ;)  Heehee.  (pots= lots of posts)<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/18/08, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   p.s. where have all the dad&#39;s gone on this list?<br/>\n&gt; other thatn an occasional post by Bryan i almost never read a man&#39;s<br/>\n&gt; opinion unless his wife is giving it.....hahaha.<br/>\n&gt;<br/>\n&gt; -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n&gt; If you are refering to me its actually Alex, Brian&quot;s wife, that writes<br/>\n&gt; pots here&lt;bwg&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ----- Original Message ----<br/>\n&gt; From: Paul H. Beaulieu II &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ballou12400@...\">ballou12400@...</a> &lt;ballou12400%40yahoo.com&gt;<br/>\n&gt; &gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;<br/>\n&gt; Sent: Monday, August 18, 2008 12:53:42 PM<br/>\n&gt; Subject: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network<br/>\n&gt;<br/>\n&gt; Thanks katherine and yes i did get that and i dont actually have a real<br/>\n&gt; problem with some of the work arounds in this case however i wanted to<br/>\n&gt; use this as an opportunity to discuss some of the more borderline<br/>\n&gt; functions of judgement and modeling respect and responsibility.<br/>\n&gt;<br/>\n&gt; i dont want you to think that i believe the RUN age thing is the issue<br/>\n&gt; i was trying to discuss.<br/>\n&gt;<br/>\n&gt; I do however disagree and respectfully so that while rules are useless<br/>\n&gt; within a small community such as a home or family they are without a<br/>\n&gt; doubt(look at any example in world history) a necessary tool for a<br/>\n&gt; society. look at any area that has seen a time without any government.<br/>\n&gt; chaos results and death and disaster follow.<br/>\n&gt;<br/>\n&gt; PB<br/>\n&gt;<br/>\n&gt; p.s. where have all the dad&#39;s gone on this list?<br/>\n&gt; other thatn an occasional post by Bryan i almost never read a man&#39;s<br/>\n&gt; opinion unless his wife is giving it.....hahaha.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219103298","msgId":35426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0Mjg0Mi42OTQ0NS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":35425,"nextInTopic":35427,"prevInTime":35425,"nextInTime":35427,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"p.s. where have all the dad s gone on this list? other thatn an occasional post by Bryan i almost never read a man s opinion unless his wife is giving","messageBody":"<div id=\"ygrps-yiv-357778859\">p.s. where have all the dad&#39;s gone on this list?<br/>\nother thatn an occasional post by Bryan i almost never read a man&#39;s <br/>\nopinion unless his wife is giving it.....hahaha.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\nIf you are refering to me its actually Alex, Brian&quot;s wife, that writes pots here&lt;bwg&gt;<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Paul H. Beaulieu II &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ballou12400@...\">ballou12400@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Monday, August 18, 2008 12:53:42 PM<br/>\nSubject: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network<br/>\n<br/>\n<br/>\nThanks katherine and yes i did get that and i dont actually have a real <br/>\nproblem with some of the work arounds in this case however i wanted to <br/>\nuse this as an opportunity to discuss some of the more borderline <br/>\nfunctions of judgement and modeling respect and responsibility.<br/>\n<br/>\ni dont want you to think that i believe the RUN age thing is the issue <br/>\ni was trying to discuss. <br/>\n<br/>\nI do however disagree and respectfully so that while rules are useless <br/>\nwithin a small community such as a home or family they are without a <br/>\ndoubt(look at any example in world history) a necessary tool for a <br/>\nsociety. look at any area that has seen a time without any government. <br/>\nchaos results and death and disaster follow.<br/>\n<br/>\nPB<br/>\n<br/>\np.s. where have all the dad&#39;s gone on this list?<br/>\nother thatn an occasional post by Bryan i almost never read a man&#39;s <br/>\nopinion unless his wife is giving it.....hahaha.<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219093551","msgId":35425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4Y283ZiszMW11QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4Y2N2Nitybmp2QGVHcm91cHMuY29tPg=="},"prevInTopic":35424,"nextInTopic":35426,"prevInTime":35424,"nextInTime":35426,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Yet we have a history of many times when someone (or some group) *chose* to break a law/rule because that law/rule was flawed. Should they have not broken the","messageBody":"<div id=\"ygrps-yiv-1506240493\">Yet we have a history of many times when someone (or some group) <br/>\n*chose* to break a law/rule because that law/rule was flawed. Should <br/>\nthey have not broken the law because it was the law? Laws/Rules are <br/>\nmade for a reason. Sometimes the reasoning is flawed. That&#39;s why <br/>\nthere are mechanisms in place to change them (most of the time). As <br/>\nwas already mentioned a couple of times, what I seek to impart to my <br/>\noffspring is not &quot;follow all rules/laws&quot; but rather &quot;Examine the <br/>\nrules/laws. Why was it made? Who is it intended to help or protect? <br/>\nWhat are the consequences of not following that rule/law? Is it a <br/>\nflawed rule/law that needs to be changed? Are you willing to face the <br/>\nconsequences in order to be an agent of change?&quot; and so on. No rules <br/>\nor laws of our society are so sacred that they cannot and should not <br/>\nbe critically examined. Sure, I can agree that murder is right out <br/>\nand there needs to be an appropriately severe consequence to it. <br/>\nDriving under the influence of mental function altering substances is <br/>\ndangerous to many, invoking consequences to perhaps, for some, cause <br/>\nthem to think twice before engaging in such behavior, makes sense. <br/>\nCreating a law that says that my 18 yr old son (when he gets to 18 <br/>\nthat is, he&#39;s only 10 now) MUST register for a potential military <br/>\ndraft and possibly go into battle - that one requires thought - what <br/>\nare the options for NOT fighting? is it worth the consequences to NOT <br/>\nregister? should it be changed in some way to allow more options?<br/>\n<br/>\nHeck, go back 25 years and HOMESCHOOLING was illegal and <br/>\npeople &#39;fudged&#39; things, went underground, faced jail time, and now we <br/>\nhave an abundance of homeschooling options anywhere you go in this <br/>\ncountry. Should those parents NOT have &#39;fudged&#39; things to retain <br/>\ncustody of their children while they worked to change the laws?<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219086541","msgId":35424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODE4MTIwOWc1N2YxNWE2N2phNjQ3NzZlZDM2Yzg2MjA2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAyODg1MjBDLTM4MzgtNDYzRS04OTlCLUFDNjZDNkQ1NTg4MEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGc4YzdyMys3ZjgwQGVHcm91cHMuY29tPgkgPDAyODg1MjBDLTM4MzgtNDYzRS04OTlCLUFDNjZDNkQ1NTg4MEB2ZXJpem9uLm5ldD4="},"prevInTopic":35423,"nextInTopic":35425,"prevInTime":35423,"nextInTime":35425,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Here s someplace else to read answers for questions to unschoolers about rules: http://sandradodd.com/rules ~Katherine [Non-text portions of this message have","messageBody":"<div id=\"ygrps-yiv-1595717611\">Here&#39;s someplace else to read answers for questions to unschoolers about<br/>\nrules:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219084697","msgId":35423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyODg1MjBDLTM4MzgtNDYzRS04OTlCLUFDNjZDNkQ1NTg4MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGc4YzdyMys3ZjgwQGVHcm91cHMuY29tPg==","referencesHeader":"PGc4YzdyMys3ZjgwQGVHcm91cHMuY29tPg=="},"prevInTopic":35422,"nextInTopic":35424,"prevInTime":35422,"nextInTime":35424,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"... It seems you want to discuss whether it s right for people to feel entitled to break rules but no one has suggested doing that. The questions people should","messageBody":"<div id=\"ygrps-yiv-1578436407\">On Aug 18, 2008, at 12:26 PM, Paul H. Beaulieu II wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; lets use an arbitrary<br/>\n&gt; site for example, it is in fact their site(who ever created and runs<br/>\n&gt; it) and if i choose to use it and my expose and encourage my childs<br/>\n&gt; use of a site how respectful am i being and are we being when we<br/>\n&gt; violate the stipulations of the person or persons who the site<br/>\n&gt; belongs to.<br/>\n<br/>\n </span></blockquote>It seems you want to discuss whether it&#39;s right for people to feel  <br/>\nentitled to break rules but no one has suggested doing that. The  <br/>\nquestions people should ask are: Why does the rule exist? Who will it  <br/>\nhurt if I break it? What will happen to me if I&#39;m caught?<br/>\n<br/>\nThose aren&#39;t casually asked questions. It&#39;s how a thinking person  <br/>\nshould approach rules.<br/>\n<br/>\nWhy does an age limit exist on the site? (The RUN site. Any site.) Is  <br/>\nit because of the law against collecting information from minors? Is  <br/>\nit a way of suggesting the content is might be too mature for those  <br/>\nunder 13? How is it harming the person who set up the site?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; read my post that wasnt my point.<br/>\n<br/>\n </span></blockquote>Please don&#39;t ask people to reread to get your point. If you&#39;ve said  <br/>\nsomething that has confused people, it&#39;s an opportunity to rethink  <br/>\nhow you communicate.<br/>\n<br/>\nCarriage returns would help. Periods and capitalization would help.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  i know that to make<br/>\n&gt; a similar point about how rules are bad or how labels are wrong the<br/>\n&gt; same logic has been applied.<br/>\n<br/>\n </span></blockquote>In a home where we&#39;re raising kids to think, rules for behavior don&#39;t  <br/>\nhelp. Rules just say, for instance, &quot;Don&#39;t hit.&quot; They don&#39;t say  <br/>\n&quot;Don&#39;t bite.&quot; &quot;Don&#39;t poke.&quot; &quot;Don&#39;t tease.&quot; ...<br/>\n<br/>\nBut if the philosophy is to be kind and respectful, we don&#39;t need to  <br/>\nspell out everything that&#39;s not kind and not respectful. Putting the  <br/>\nphilosophy of being kind and respectful into action in a variety of  <br/>\ncontexts helps kids think about what it means to kind and respectful  <br/>\nand why.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; lets face it in a society we do need some rules not just<br/>\n&gt; people following their own critical thought as that would lead to<br/>\n&gt; complete oligarchy which by the way would eb the natural end result<br/>\n&gt; of anarchy.<br/>\n<br/>\n </span></blockquote>I think we do need rules in society since we&#39;re not all raised to be  <br/>\ngenerous. Some people are raised to grasp what they can. Different  <br/>\nfamilies have different ideas about what is &quot;fair&quot;. There are parents  <br/>\nwho would take their little kids to NC-17 movies because it&#39;s too  <br/>\ninconvenient to get a baby sitter. There are parents who would leave  <br/>\ntheir kids locked up in the car while they went into a bar.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i just think that an address with regard to<br/>\n&gt; societal respect not just personal respect is important too.<br/>\n<br/>\n </span></blockquote>But you&#39;re being vague about who is being disrespected.<br/>\n<br/>\nIt could be the person who set it up. It could be the people who  <br/>\nparticipate. It could be the people who don&#39;t get to participate.<br/>\n<br/>\nAll that matters to someone who lives life by philosophy rather than  <br/>\nrules.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; if the birth date on the website is so irrelivant what about a fake<br/>\n&gt; id to get into bars or why not just buy coke since i am a smart and<br/>\n&gt; critical thinking person arent they all the same thing?<br/>\n<br/>\n </span></blockquote>This shows a lack of critical thinking by treating all age  <br/>\nrestrictions as though they&#39;re the same. Why do the age restrictions  <br/>\nexist? What&#39;s their purpose? What are the consequences of breaking them?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i thought we were trying to accomplish modeling a behavior<br/>\n&gt; that wasnt about following rules to avoid punishment or to be<br/>\n&gt; rewarded but to respect those around us and ourselves in a way that<br/>\n&gt; allows us to just live and have our very life shine through with a<br/>\n&gt; manner that by its very essence does not impeach anothers right at<br/>\n&gt; self regulation.<br/>\n<br/>\n </span></blockquote>*Whose* rights are being impeached on? You&#39;re just stating it as  <br/>\nthough it&#39;s a fact.<br/>\n<br/>\nThat&#39;s not a question meant to point out that the RUN site is an  <br/>\nexception. That and the above questions are at the heart of acting  <br/>\nand thinking critically.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219082600","msgId":35422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4Y2RoOCttazRhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4Y2N2Nitybmp2QGVHcm91cHMuY29tPg=="},"prevInTopic":35421,"nextInTopic":35423,"prevInTime":35421,"nextInTime":35423,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"~~where have all the dad s gone on this list? other thatn an occasional post by Bryan i almost never read a man s opinion unless his wife is giving","messageBody":"<div id=\"ygrps-yiv-1107218359\">~~where have all the dad&#39;s gone on this list?<br/>\nother thatn an occasional post by Bryan i almost never read a man&#39;s<br/>\nopinion unless his wife is giving it.....hahaha.~~<br/>\n<br/>\n<br/>\nSurvival of the fittest (or in this case, the most intelligent).;)<br/>\n<br/>\nBwahhahahahahahahaaa!!<br/>\n<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":277072861,"authorName":"Paul H. Beaulieu II","from":"&quot;Paul H. Beaulieu II&quot; &lt;ballou12400@...&gt;","profile":"ballou12400","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219082022","msgId":35421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4Y2N2Nitybmp2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgwODE4MDk0MG82M2Y1ZWM4ZnRiMzUyNjcyMWJhNDRmNjhAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":35420,"nextInTopic":35422,"prevInTime":35420,"nextInTime":35422,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Thanks katherine and yes i did get that and i dont actually have a real problem with some of the work arounds in this case however i wanted to use this as an","messageBody":"<div id=\"ygrps-yiv-320019086\">Thanks katherine and yes i did get that and i dont actually have a real <br/>\nproblem with some of the work arounds in this case however i wanted to <br/>\nuse this as an opportunity to discuss some of the more borderline <br/>\nfunctions of judgement and modeling respect and responsibility.<br/>\n<br/>\ni dont want you to think that i believe the RUN age thing is the issue <br/>\ni was trying to discuss. <br/>\n<br/>\nI do however disagree and respectfully so that while rules are useless <br/>\nwithin a small community such as a home or family they are without a <br/>\ndoubt(look at any example in world history) a necessary tool for a <br/>\nsociety. look at any area that has seen a time without any government. <br/>\nchaos results and death and disaster follow.<br/>\n<br/>\nPB<br/>\n<br/>\np.s. where have all the dad&#39;s gone on this list?<br/>\nother thatn an occasional post by Bryan i almost never read a man&#39;s <br/>\nopinion unless his wife is giving it.....hahaha.</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219080589","msgId":35420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODE4MTAyOXY2ZjlhOTU1NG9mMGZhNTI4NmRmZjZhYjE2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGc4YzdyMys3ZjgwQGVHcm91cHMuY29tPg==","referencesHeader":"PGc4YzZlNytzYXR2QGVHcm91cHMuY29tPiA8ZzhjN3IzKzdmODBAZUdyb3Vwcy5jb20+"},"prevInTopic":35419,"nextInTopic":35421,"prevInTime":35419,"nextInTime":35421,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"People actually *do* break laws.  Many people are in prison for that reason.  Do you think having rules prevents people from breaking them? ~Katherine On Mon,","messageBody":"<div id=\"ygrps-yiv-872158047\">People actually *do* break laws.  Many people are in prison for that<br/>\nreason.  Do you think having rules prevents people from breaking them?<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Mon, Aug 18, 2008 at 12:26 PM, Paul H. Beaulieu II &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ballou12400@...\">ballou12400@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt;   well, with regard to the R. U. N. as i pointed out in my post i know<br/>\n&gt; that the surface issue was a little of a stretch but i want to get to<br/>\n&gt; the deeper issue. you may personally know the people who started this<br/>\n&gt; site but that will not always be the case. lets use an arbitrary<br/>\n&gt; site for example, it is in fact their site(who ever created and runs<br/>\n&gt; it) and if i choose to use it and my expose and encourage my childs<br/>\n&gt; use of a site how respectful am i being and are we being when we<br/>\n&gt; violate the stipulations of the person or persons who the site<br/>\n&gt; belongs to. does that model respect. this is my point. i dont say all<br/>\n&gt; lying is evil. read my post that wasnt my point. i know that to make<br/>\n&gt; a similar point about how rules are bad or how labels are wrong the<br/>\n&gt; same logic has been applied. the logic that as parents we model<br/>\n&gt; behaviors of respect or not and that is what our children get a firm<br/>\n&gt; grasp on. lets face it in a society we do need some rules not just<br/>\n&gt; people following their own critical thought as that would lead to<br/>\n&gt; complete oligarchy which by the way would eb the natural end result<br/>\n&gt; of anarchy. so be careful what you wish for as once we achieve<br/>\n&gt; anarchy, it will be the strong and the forceful that rule, not the<br/>\n&gt; wise or the intelligent. as china and russia were quick to teach us<br/>\n&gt; the educated are easily eradicated by the strong. i didnt mean for<br/>\n&gt; this to get so big i just think that an address with regard to<br/>\n&gt; societal respect not just personal respect is important too.<br/>\n&gt; if the birth date on the website is so irrelivant what about a fake<br/>\n&gt; id to get into bars or why not just buy coke since i am a smart and<br/>\n&gt; critical thinking person arent they all the same thing? a series of<br/>\n&gt; rules put in place arbitrarily to in some way control the populace,<br/>\n&gt; and as i may or may not choose to risk the ramifications of said<br/>\n&gt; choices. i thought we were trying to accomplish modeling a behavior<br/>\n&gt; that wasnt about following rules to avoid punishment or to be<br/>\n&gt; rewarded but to respect those around us and ourselves in a way that<br/>\n&gt; allows us to just live and have our very life shine through with a<br/>\n&gt; manner that by its very essence does not impeach anothers right at<br/>\n&gt; self regulation.<br/>\n&gt;<br/>\n&gt; just some thoughts<br/>\n&gt;<br/>\n&gt; paul<br/>\n&gt;<br/>\n&gt; thanks again ren for your insight<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219080490","msgId":35419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4Y2JmYStsM3BxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4YzdyMys3ZjgwQGVHcm91cHMuY29tPg=="},"prevInTopic":35418,"nextInTopic":35420,"prevInTime":35418,"nextInTime":35420,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"~~if i choose to use it and my expose and encourage my childs use of a site how respectful am i being and are we being when we violate the stipulations of the","messageBody":"<div id=\"ygrps-yiv-1461761095\">~~if i choose to use it and my expose and encourage my childs<br/>\nuse of a site how respectful am i being and are we being when we<br/>\nviolate the stipulations of the person or persons who the site<br/>\nbelongs to. does that model respect.~~<br/>\n<br/>\nAre you more concerned about respecting an arbitrary age rule, set up<br/>\nto protect a network from liability issues or respecting your child&#39;s<br/>\ndesire to connect with friends? That&#39;s where you and I differ (amongst<br/>\nmany other things). I choose to respect my child more than some<br/>\narbitrary rule. Doesn&#39;t mean we ignore all rules. We can logically<br/>\nanalyze whether there is a good reason for something and whether it is<br/>\na useful rule. <br/>\n<br/>\nThe age of thirteen isn&#39;t some magical age that indicates a child&#39;s<br/>\nability to properly utilize an online community.<br/>\n<br/>\n<br/>\n  ~~lets face it in a society we do need some rules not just <br/>\n<blockquote><span title=\"ireply\"> &gt; people following their own critical thought as that would lead to <br/>\n&gt; complete oligarchy which by the way would eb the natural end result <br/>\n&gt; of anarchy.~~<br/>\n<br/>\n </span></blockquote>I guess that&#39;s another point we differ on. I don&#39;t think rules and<br/>\nlaws prevent anything. Maybe to a small degree. But mostly it just<br/>\ngives the law makers the ability to punish people. Laws exist to allow<br/>\npunishment for not following the law. They don&#39;t exist to prevent<br/>\nanything (thought the makers seem to think they do).<br/>\n<br/>\nMore laws don&#39;t equal less problems.<br/>\n<br/>\n<br/>\n~~if the birth date on the website is so irrelivant what about a fake <br/>\n<blockquote><span title=\"ireply\"> &gt; id to get into bars or why not just buy coke since i am a smart and <br/>\n&gt; critical thinking person arent they all the same thing?~~<br/>\n<br/>\n </span></blockquote>If you think that any and all lying about age is the same thing, that<br/>\nshows a lack of critical thinking. It&#39;s faulty logic.<br/>\n<br/>\nAs for fake ID, my parents didn&#39;t drink or allow any alcohol in our<br/>\nhome. They certainly never lied about our ages. I borrowed a fake ID<br/>\nat age 18 and went bar hopping. Actually, I&#39;d been bar hopping before<br/>\nand never got carded! The night I borrowed the fake ID I met my<br/>\nhusband of 19 years.:) Funny how things can work out eh?<br/>\n<br/>\nI&#39;m not advocating &quot;ignore all rules&quot; but I&#39;m also baffled when people<br/>\nsay that by ignoring an age rule it somehow equates to any and all age<br/>\nfudging as being equal. It&#39;s not. <br/>\n<br/>\n<br/>\n~~ i thought we were trying to accomplish modeling a behavior <br/>\n<blockquote><span title=\"ireply\"> &gt; that wasnt about following rules to avoid punishment or to be <br/>\n&gt; rewarded but to respect those around us and ourselves in a way that <br/>\n&gt; allows us to just live and have our very life shine through with a <br/>\n&gt; manner that by its very essence does not impeach anothers right at <br/>\n&gt; self regulation.~~<br/>\n<br/>\n </span></blockquote>And by choosing to fudge a birth date to join a lively group of<br/>\nunschoolers who have enriched our lives immensely, we in NO way are<br/>\nimpeaching upon any one else&#39;s right at self regulation. Not at all.<br/>\n<br/>\nMaybe you should go read at the site itself and see how the children<br/>\nare sharing their art,their dreams, their birthdays, their joys and<br/>\nconcerns, their lives with each other. It&#39;s a beautiful thing and I&#39;m<br/>\nglad for parents that are giving their child access to such rich<br/>\nconnections! Without ever causing infringement upon any other human<br/>\nbeing or their rights. Cool huh?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1219077629","msgId":35417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODE4MDk0MG82M2Y1ZWM4ZnRiMzUyNjcyMWJhNDRmNjhAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDM1NjMyMS42OTg5My5xbUB3ZWIzMDAwNy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDM1NjMyMS42OTg5My5xbUB3ZWIzMDAwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":35416,"nextInTopic":35418,"prevInTime":35416,"nextInTime":35418,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"It isn t the Radical Unschoolers Network that has set an age limit on the site but the network service Ning.com. Making sure that s understood before going","messageBody":"<div id=\"ygrps-yiv-1689574220\">It isn&#39;t the Radical Unschoolers&#39; Network that has set an age limit on the<br/>\nsite but the network service Ning.com.<br/>\n<br/>\nMaking sure that&#39;s understood before going any further.<br/>\n<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Aug 18, 2008 at 11:35 AM, Paul Beaulieu &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ballou12400@...\">ballou12400@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   Ren,<br/>\n&gt;<br/>\n&gt; On this topic, since it is an obviously innocuous(sp?) issue (the use of<br/>\n&gt; the rad. Unsch. network.prior to age thirteen that is). i bring a question<br/>\n&gt; that is really (to me) the root of this discussion. how about the state you<br/>\n&gt; live in&#39;s registry of motor vehicles, or the bureau of alcohol, tobacco and<br/>\n&gt; firearms, how about the state legislature or even the congress of the united<br/>\n&gt; states of america. at what point does the principal of law actually matter?<br/>\n&gt; i understand that rules in and of themselves particualarly within the home<br/>\n&gt; and family are not tools to be aspired to but in a grander scope i.e.<br/>\n&gt; society it is the very existance of some sense of rules that make the<br/>\n&gt; choices we make possible. when we allow and even encourage the breaking of<br/>\n&gt; someone else&#39;s rules to govern themselves what are we modeling? the radical<br/>\n&gt; unschoolers network for example has an age limit for some reason(i cant see<br/>\n&gt; why but...) and it is their right to do as it our right to self determine. i<br/>\n&gt; just wanted<br/>\n&gt; to toss out a question as to when does a respect for the law become an<br/>\n&gt; issue that we should model a lifestyle that shows that laws need to be<br/>\n&gt; followed and that when we disrespect the boundaries set by others for<br/>\n&gt; themselves we ask that ours be violated. it is the very truth of our own<br/>\n&gt; self determination that points out the act of violating someone elses right<br/>\n&gt; to determination as unacceptable. would in a situation such as this be more<br/>\n&gt; prudent to show our kids how to reach out to an organization to possibly get<br/>\n&gt; them to re-evaluate their rules while maybe allowing them to use our log in<br/>\n&gt; or using the site together.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; just a thought.<br/>\n&gt; Paul<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":277072861,"authorName":"Paul H. Beaulieu II","from":"&quot;Paul H. Beaulieu II&quot; &lt;ballou12400@...&gt;","profile":"ballou12400","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219076771","msgId":35418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4YzdyMys3ZjgwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4YzZlNytzYXR2QGVHcm91cHMuY29tPg=="},"prevInTopic":35417,"nextInTopic":35419,"prevInTime":35417,"nextInTime":35419,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"well, with regard to the R. U. N. as i pointed out in my post i know that the surface issue was a little of a stretch but i want to get to the deeper issue.","messageBody":"<div id=\"ygrps-yiv-1535278992\">well, with regard to the R. U. N. as i pointed out in my post i know <br/>\nthat the surface issue was a little of a stretch but i want to get to <br/>\nthe deeper issue. you may personally know the people who started this <br/>\nsite but that will not always be the case.  lets use an arbitrary <br/>\nsite for example, it is in fact their site(who ever created and runs <br/>\nit) and if i choose to use it and my expose and encourage my childs <br/>\nuse of a site how respectful am i being and are we being when we <br/>\nviolate the stipulations of the person or persons who the site <br/>\nbelongs to. does that model respect. this is my point. i dont say all <br/>\nlying is evil. read my post that wasnt my point.  i know that to make <br/>\na similar point about how rules are bad or how labels are wrong the <br/>\nsame logic has been applied. the logic that as parents we model <br/>\nbehaviors of respect or not and that is what our children get a firm <br/>\ngrasp on.  lets face it in a society we do need some rules not just <br/>\npeople following their own critical thought as that would lead to <br/>\ncomplete oligarchy which by the way would eb the natural end result <br/>\nof anarchy. so be careful what you wish for as once we achieve <br/>\nanarchy, it will be the strong and the forceful that rule, not the <br/>\nwise or the intelligent.  as china and russia were quick to teach us <br/>\nthe educated are easily eradicated by the strong. i didnt mean for <br/>\nthis to get so big i just think that an address with regard to <br/>\nsocietal respect not just personal respect is important too. <br/>\nif the birth date on the website is so irrelivant what about a fake <br/>\nid to get into bars or why not just buy coke since i am a smart and <br/>\ncritical thinking person arent they all the same thing?  a series of <br/>\nrules put in place arbitrarily to in some way control the populace, <br/>\nand as i may or may not choose to risk the ramifications of said <br/>\nchoices. i thought we were trying to accomplish modeling a behavior <br/>\nthat wasnt about following rules to avoid punishment or to be <br/>\nrewarded but to respect those around us and ourselves in a way that <br/>\nallows us to just live and have our very life shine through with a <br/>\nmanner that by its very essence does not impeach anothers right at <br/>\nself regulation.<br/>\n<br/>\njust some thoughts<br/>\n<br/>\npaul<br/>\n<br/>\nthanks again ren for your insight</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219075335","msgId":35416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4YzZlNytzYXR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM1NjMyMS42OTg5My5xbUB3ZWIzMDAwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":35415,"nextInTopic":35417,"prevInTime":35415,"nextInTime":35417,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"~~how about the state you live in s registry of motor vehicles, or the bureau of alcohol, tobacco and firearms, how about the state legislature or even the","messageBody":"<div id=\"ygrps-yiv-2060376878\">~~how about the state you live in&#39;s registry of motor vehicles, or the<br/>\nbureau of alcohol, tobacco and firearms, how about the state<br/>\nlegislature or even the congress of the united states of america. at<br/>\nwhat point does the principal of law actually matter?~~<br/>\n<br/>\nIgnoring an arbitrary age limit is very different from ignoring the<br/>\nLAW. There are no laws about joining an internet community, just<br/>\nbiased rules about it. Mostly because of liability concerns for the<br/>\npeople running the servers, not because it truly keeps anyone safe.<br/>\n<br/>\n<br/>\n<br/>\n ~~when we allow and even encourage the breaking of someone else&#39;s<br/>\nrules to govern themselves what are we modeling? ~~<br/>\n<br/>\nThe ability to think. What it means to be truly American even!;) If<br/>\nfollowing the rules was more important to the founding fathers and<br/>\nmothers of my country, then this country wouldn&#39;t even exist. They<br/>\ncommitted treason for crying out loud. How&#39;s that for ignoring the rules?<br/>\n<br/>\n ~~the radical unschoolers network for example has an age limit for<br/>\nsome reason(i cant see why but...) and it is their right to do as it<br/>\nour right to self determine. ~~<br/>\n<br/>\nIt has nothing to do with anyone self-determining anything. One of my<br/>\nbest friend&#39;s started the network and she is working within the<br/>\nlimitations of existing server space. The Ning network has their<br/>\nparameters set up to only allow over 13 so if you want to start a<br/>\nnetwork that is not age discriminatory, you have to ask people to<br/>\nfudge their birthdates. No big deal.<br/>\n<br/>\nWe&#39;re talking about an internet community for people to communicate<br/>\nwith. NOT asking anyone to break the law and face penalties or fines<br/>\nor worse. Nor is it affecting anyone else, their life, their choices<br/>\nor creating harm in any manner. THAT is part of how we assess whether<br/>\na rule or law is worth ignoring.<br/>\n<br/>\n~~to toss out a question as to when does a respect for the law become<br/>\nan issue that we should model a lifestyle that shows that laws need to<br/>\nbe followed and that when we disrespect the boundaries set by others<br/>\nfor themselves we ask that ours be violated.~~<br/>\n<br/>\nRespect for the law should only exist if it actually makes sense or is<br/>\nthe choice that has consequences you are willing to live with. Many<br/>\nlaws violate my personal liberties, such as tax laws because the taxes<br/>\nin this country were meant to be VOLUNTARY only and were never meant<br/>\nto become what they are today.<br/>\n<br/>\n Though the constituation originally states that taxes are to be<br/>\nvoluntary (until the 16th amendment was passed) and what has happened<br/>\ntoday violates that principle, I still choose to pay my taxes though I<br/>\nam ethically opposed. I choose to pay them because the fight isn&#39;t<br/>\nworth it. The consequences aren&#39;t worth it to me right now. So I<br/>\nchoose to comply. I&#39;m not against any form of taxes, but I am opposed<br/>\nto the current form they take and the power the government has.<br/>\n<br/>\nMy children are intelligent enough to figure out which laws they will<br/>\nor won&#39;t comply with and be responsible enough to face consequences of<br/>\ntheir actions.<br/>\n<br/>\n ~~it is the very truth of our own self determination that points out<br/>\nthe act of violating someone elses right to determination as<br/>\nunacceptable.~~<br/>\n<br/>\nI would love to hear how fudging a birth date in order to join a<br/>\nsocial network violates any else&#39;s right to self-determination.<br/>\nYou seem to be using the &quot;slippery slope&quot; theory here. If you<br/>\nencourage kids to lie about one thing, they&#39;ll learn poor ethical<br/>\njudgmentand immorality. <br/>\n<br/>\nI couldn&#39;t disagree more. <br/>\nWhen a person exercises their free will, they can actually make<br/>\nchoices that help them look at a situation from many angles. I helped<br/>\nmy children lie about their age to join a network. Is that encouraging<br/>\nlying? I think not. It&#39;s encouraging thinking. It&#39;s encouraging them<br/>\nto have the ability to determine a useful lie from a hurtful one.<br/>\n<br/>\nPeople like to pretend that lying is bad. Everyone lies. Show me<br/>\nsomeone that says they don&#39;t and I&#39;ll find a situation they were happy<br/>\nto lie about. People lie about liking a hairstyle they don&#39;t care for<br/>\nin order to avoid hurt feelings. They lie to assist each other in<br/>\nplanning surprise parties or gifts for each other. Lying isn&#39;t all<br/>\nbad. Intent is more important to me.<br/>\n<br/>\nBut you&#39;re talking to someone that is somewhere between libertarian<br/>\nand anarchist. I think in this society, people are so rule/law driven<br/>\nthat they can&#39;t think clearly anymore. Give me clear-thinking people<br/>\nover law abiding people any day. They&#39;ll figure out the right thing to<br/>\ndo much faster and more effectively.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":277072861,"authorName":"Paul Beaulieu","from":"Paul Beaulieu &lt;ballou12400@...&gt;","profile":"ballou12400","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219073729","msgId":35415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1NjMyMS42OTg5My5xbUB3ZWIzMDAwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":35409,"nextInTopic":35416,"prevInTime":35414,"nextInTime":35416,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Ren, On this topic,  since it is an obviously innocuous(sp?) issue (the use of the rad. Unsch. network.prior to age thirteen that is). i bring a question that","messageBody":"<div id=\"ygrps-yiv-2074213478\">Ren, <br/>\n   <br/>\n  On this topic,  since it is an obviously innocuous(sp?) issue (the use of the rad. Unsch. network.prior to age thirteen that is). i bring a question that is really (to me) the root of this discussion. how about the state you live in&#39;s registry of motor vehicles, or the bureau of alcohol, tobacco and firearms, how about the state legislature or even the congress of the united states of america. at what point does the principal of law actually matter? i understand that rules in and of themselves particualarly within the home and family are not tools to be aspired to but in a grander scope i.e. society it is the very existance of some sense of rules that make the choices we make possible. when we allow and even encourage the breaking of someone else&#39;s rules to govern themselves what are we modeling?  the radical unschoolers network for example has an age limit for some reason(i cant see why but...) and it is their right to do as it our right to self determine. i just wanted<br/>\n to toss out a question as to when does a respect for the law become an issue that we should model a lifestyle that shows that laws need to be followed and that when we disrespect the boundaries set by others for themselves we ask that ours be violated. it is the very truth of our own self determination that points out the act of violating someone elses right to determination as unacceptable. would in a situation such as this be more prudent to show our kids how to reach out to an organization to possibly get them to re-evaluate their rules while maybe allowing them to use our log in or using the site together.<br/>\n   <br/>\n   <br/>\n  just a thought.<br/>\n  Paul<br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1219029912","msgId":35409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4YXEybytmZHJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFERTFCQURELTU4M0EtNDFFRi1CNDYxLTk4QjRFNjY3RkQzNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":35406,"nextInTopic":35415,"prevInTime":35408,"nextInTime":35410,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"... Yeah, change his birthdate.:) It s a built in safety feature that we choose to ignore. I don t feel the internet police get to decide what my children get","messageBody":"<div id=\"ygrps-yiv-96034355\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Alison Broadbent &lt;abzb@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Asher and I tried to sign him up but there&#39;s a minimum age of 13.  <br/>\n&gt; Does anyone know if there a way around that?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yeah, change his birthdate.:) It&#39;s a built in safety feature that we<br/>\nchoose to ignore. I don&#39;t feel the internet police get to decide what<br/>\nmy children get to utilize.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1218916423","msgId":35406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDgwODE2MTI1M2syZDQ1YzNiYXM2MWY3NmMzNDc0MmNmMmEwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDFERTFCQURELTU4M0EtNDFFRi1CNDYxLTk4QjRFNjY3RkQzNUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDFERTFCQURELTU4M0EtNDFFRi1CNDYxLTk4QjRFNjY3RkQzNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":35405,"nextInTopic":35409,"prevInTime":35405,"nextInTime":35407,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"you can just put in another birth year. that swhat we did for my 11dd Faith ... -- www.bearthmama.com [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-285363976\">you can just put in another birth year. that&#39; swhat we did for my 11dd<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Aug 16, 2008 at 2:51 PM, Alison Broadbent &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abzb@...\">abzb@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   Asher and I tried to sign him up but there&#39;s a minimum age of 13.<br/>\n&gt; Does anyone know if there a way around that?<br/>\n&gt;<br/>\n&gt; Thanks.<br/>\n&gt;<br/>\n&gt; Alison<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1218912682","msgId":35405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFERTFCQURELTU4M0EtNDFFRi1CNDYxLTk4QjRFNjY3RkQzNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":35402,"nextInTopic":35406,"prevInTime":35404,"nextInTime":35406,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Asher and I tried to sign him up but there s a minimum age of 13. Does anyone know if there a way around that? Thanks. Alison","messageBody":"<div id=\"ygrps-yiv-56439298\">Asher and I tried to sign him up but there&#39;s a minimum age of 13.  <br/>\nDoes anyone know if there a way around that?<br/>\n<br/>\nThanks.<br/>\n<br/>\nAlison</div>","specialLinks":[]},{"userId":155541138,"authorName":"gilliangoddard","from":"&quot;gilliangoddard&quot; &lt;gilliangoddard@...&gt;","profile":"gilliangoddard","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1218858458","msgId":35402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4NWlrcis2aGN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4MXF2MytjcTNrQGVHcm91cHMuY29tPg=="},"prevInTopic":35401,"nextInTopic":35405,"prevInTime":35401,"nextInTime":35403,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Hey Ren, Efua is now friends with almost every child on the Youth Network - including Sierra - but I should have been more specific.  She is looking for","messageBody":"<div id=\"ygrps-yiv-691797333\">Hey Ren,<br/>\nEfua is now friends with almost every child on the Youth Network - including Sierra - but I <br/>\nshould have been more specific.  She is looking for children in general but she specifically <br/>\nwants more children around her age.  Kwamena is a lot less interested in the whole thing.<br/>\n<br/>\nI did notice that Sierra seems to send these long and detailed responses to the forums - <br/>\nuntil I read them and they clearly were from you!  Pretty funny.<br/>\n<br/>\nAnd Efua is enjoying communicating with you on the network.  Hopefully one day we can <br/>\nmeet in person.<br/>\n<br/>\nGillian<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; &lt;starsuncloud@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ~~Anyone has a child on the Radical Unschooler&#39;s Network - familyrun?<br/>\n&gt; My 31/2 year old daughter wants some children as friends and we can&#39;t<br/>\n&gt; figure out easily which are children.~~<br/>\n&gt; <br/>\n&gt; Well...that depends on her definition of &quot;children&quot;.;)<br/>\n&gt; There&#39;s a group titled &quot;RU Youth&quot; on there that she could join, or add<br/>\n&gt; people to her friends list:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/group/ruyouth\">http://familyrun.ning.com/group/ruyouth</a><br/>\n&gt; <br/>\n&gt; Sierra is the only one of my kids that enjoys this kind of thing so<br/>\n&gt; far. In fact, I keep posting stuff under her name accidentally because<br/>\n&gt; I forget to check which one of us is logged in!<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":155541138,"authorName":"gilliangoddard","from":"&quot;gilliangoddard&quot; &lt;gilliangoddard@...&gt;","profile":"gilliangoddard","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1218858129","msgId":35401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4NWlhaCt2Y2RkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY5NDA5Mi4zODkxLnFtQHdlYjU0MTA0Lm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":35390,"nextInTopic":35402,"prevInTime":35400,"nextInTime":35402,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Hi Jodi, Yes, they can be members on their own.  I did have to use a different email address for each child and for myself.  My children don t have email","messageBody":"<div id=\"ygrps-yiv-1648227899\">Hi Jodi,<br/>\nYes, they can be members on their own.  I did have to use a different email address for <br/>\neach child and for myself.  My children don&#39;t have email addresses yet.<br/>\nGG<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jodi Bezzola &lt;jodibezzola@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Gillian, I am a member, but my girls aren&#39;t yet.  They are 3 1/2 as well.  Can they be <br/>\nmembers on their own?  Is that what you mean?<br/>\n&gt;  <br/>\n&gt; Jodi<br/>\n&gt; <br/>\n&gt; --- On Thu, 8/14/08, gilliangoddard &lt;gilliangoddard@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; From: gilliangoddard &lt;gilliangoddard@...&gt;<br/>\n&gt; Subject: [unschoolingbasics] Children on Radical Unschooler&#39;s Network<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Date: Thursday, August 14, 2008, 6:44 AM<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Anyone has a child on the Radical Unschooler&#39;s Network - familyrun? My 3 1/2 year old <br/>\n&gt; daughter wants some children as friends and we can&#39;t figure out easily which are <br/>\nchildren. <br/>\n&gt; Please let me know and we will add you as friends.<br/>\n&gt; Thanks<br/>\n&gt; Gillian<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Children on Radical Unschooler&#39;s Network","postDate":"1218757038","msgId":35390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4RUE5RDdBLTM4NTYtNEJCRi04NEFGLTdEQUE4NTkzRERFREBmcmlpLmNvbT4=","inReplyToHeader":"PGc4MXF2MytjcTNrQGVHcm91cHMuY29tPg==","referencesHeader":"PGc4MXF2MytjcTNrQGVHcm91cHMuY29tPg=="},"prevInTopic":35389,"nextInTopic":35401,"prevInTime":35389,"nextInTime":35391,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"... Heh, I was confused for a moment why Sierra was talking about her children ! ~Jill [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1806530570\">On Aug 14, 2008, at 11:45 AM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sierra is the only one of my kids that enjoys this kind of thing so<br/>\n&gt; far. In fact, I keep posting stuff under her name accidentally because<br/>\n&gt; I forget to check which one of us is logged in!<br/>\n<br/>\n </span></blockquote>Heh, I was confused for a moment why Sierra was talking about her  <br/>\n&quot;children&quot;!<br/>\n<br/>\n~Jill<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Children on Radical Unschooler&#39;s Network","postDate":"1218735907","msgId":35389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4MXF2MytjcTNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgwODE0MDcxN2g1ZDg5NWFiNmtmZTMxYjYxZDYwYzRkYTZkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":35387,"nextInTopic":35390,"prevInTime":35388,"nextInTime":35390,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"~~Anyone has a child on the Radical Unschooler s Network - familyrun? My 31/2 year old daughter wants some children as friends and we can t figure out easily","messageBody":"<div id=\"ygrps-yiv-250250547\">~~Anyone has a child on the Radical Unschooler&#39;s Network - familyrun?<br/>\nMy 31/2 year old daughter wants some children as friends and we can&#39;t<br/>\nfigure out easily which are children.~~<br/>\n<br/>\nWell...that depends on her definition of &quot;children&quot;.;)<br/>\nThere&#39;s a group titled &quot;RU Youth&quot; on there that she could join, or add<br/>\npeople to her friends list:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/group/ruyouth\">http://familyrun.ning.com/group/ruyouth</a><br/>\n<br/>\nSierra is the only one of my kids that enjoys this kind of thing so<br/>\nfar. In fact, I keep posting stuff under her name accidentally because<br/>\nI forget to check which one of us is logged in!<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Children on Radical Unschooler&#39;s Network","postDate":"1218732859","msgId":35387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5NDA5Mi4zODkxLnFtQHdlYjU0MTA0Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGc4MWNzbyttZ2IzQGVHcm91cHMuY29tPg=="},"prevInTopic":35383,"nextInTopic":35389,"prevInTime":35386,"nextInTime":35388,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Hi Gillian, I am a member, but my girls aren t yet.  They are 3 1/2 as well.  Can they be members on their own?  Is that what you mean?   Jodi ... From:","messageBody":"<div id=\"ygrps-yiv-431173070\">Hi Gillian, I am a member, but my girls aren&#39;t yet.  They are 3 1/2 as well.  Can they be members on their own?  Is that what you mean?<br/>\n <br/>\nJodi<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 8/14/08, gilliangoddard &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gilliangoddard@...\">gilliangoddard@...</a>&gt; wrote:<br/>\n<br/>\nFrom: gilliangoddard &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gilliangoddard@...\">gilliangoddard@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Children on Radical Unschooler&#39;s Network<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Thursday, August 14, 2008, 6:44 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAnyone has a child on the Radical Unschooler&#39;s Network - familyrun? My 3 1/2 year old <br/>\ndaughter wants some children as friends and we can&#39;t figure out easily which are children. <br/>\nPlease let me know and we will add you as friends.<br/>\nThanks<br/>\nGillian<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Children on Radical Unschooler&#39;s Network","postDate":"1218723449","msgId":35383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODE0MDcxN2g1ZDg5NWFiNmtmZTMxYjYxZDYwYzRkYTZkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGc4MWNzbyttZ2IzQGVHcm91cHMuY29tPg==","referencesHeader":"PGc4MWNzbyttZ2IzQGVHcm91cHMuY29tPg=="},"prevInTopic":35380,"nextInTopic":35387,"prevInTime":35382,"nextInTime":35384,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"I think most of the kids are a little older.  Karl is not on there but then again I haven t mentioned it.  He might enjoy it.  I think there s a kids subgroup","messageBody":"<div id=\"ygrps-yiv-968584194\">I think most of the kids are a little older.  Karl is not on there but then<br/>\nagain I haven&#39;t mentioned it.  He might enjoy it.  I think there&#39;s a kids<br/>\nsubgroup within RUN.  There&#39;s also plenty of kids all over RUN.  It&#39;s pretty<br/>\nkid friendly if you&#39;ve been on there, you&#39;ll see.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/14/08, gilliangoddard &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gilliangoddard@...\">gilliangoddard@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Anyone has a child on the Radical Unschooler&#39;s Network - familyrun? My 3<br/>\n&gt; 1/2 year old<br/>\n&gt; daughter wants some children as friends and we can&#39;t figure out easily<br/>\n&gt; which are children.<br/>\n&gt; Please let me know and we will add you as friends.<br/>\n&gt; Thanks<br/>\n&gt; Gillian<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":155541138,"authorName":"gilliangoddard","from":"&quot;gilliangoddard&quot; &lt;gilliangoddard@...&gt;","profile":"gilliangoddard","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Children on Radical Unschooler&#39;s Network","postDate":"1218721496","msgId":35380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4MWNzbyttZ2IzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":35383,"prevInTime":35379,"nextInTime":35381,"topicId":35380,"numMessagesInTopic":0,"msgSnippet":"Anyone has a child on the Radical Unschooler s Network - familyrun?  My 3 1/2 year old daughter wants some children as friends and we can t figure out easily","messageBody":"<div id=\"ygrps-yiv-1921635977\">Anyone has a child on the Radical Unschooler&#39;s Network - familyrun?  My 3 1/2 year old <br/>\ndaughter wants some children as friends and we can&#39;t figure out easily which are children.  <br/>\nPlease let me know and we will add you as friends.<br/>\nThanks<br/>\nGillian</div>","specialLinks":[]}],"prevTopicId":35617,"nextTopicId":35624}}