{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: a sibling question","postDate":"1158806421","msgId":17511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlc3UybCsxYTRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA5MTkyMDA2MTY0Ni4zMDE1LjQ1MTAxRURCMDAwQzMwRDkwMDAwMEJDNzIyMDcwMjEwNTMwMjBFMDMwNTBDMDcwODAwMDNAY29tY2FzdC5uZXQ+"},"prevInTopic":17444,"nextInTopic":0,"prevInTime":17510,"nextInTime":17512,"topicId":17415,"numMessagesInTopic":0,"msgSnippet":"Mary, I wanted to invite you to post your question involving your schooled daughter and unschooled daughter to the Consensual Living list for help seeking a","messageBody":"<div id=\"ygrps-yiv-1133449309\">Mary, <br/>\n<br/>\nI wanted to invite you to post your question involving your schooled<br/>\ndaughter and unschooled daughter to the Consensual Living list for<br/>\nhelp seeking a mutually agreeable solution that honors each&#39;s needs:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Consensual-living/\">http://groups.yahoo.com/group/Consensual-living/</a><br/>\n<br/>\n<br/>\nPat</div>","specialLinks":[]},{"userId":222220143,"authorName":"kaikade","from":"&quot;kaikade&quot; &lt;kaikade@...&gt;","profile":"kaikade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: a sibling question","postDate":"1158716171","msgId":17444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlcTV1Yit0ZnJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA5MTkyMDA2MTY0Ni4zMDE1LjQ1MTAxRURCMDAwQzMwRDkwMDAwMEJDNzIyMDcwMjEwNTMwMjBFMDMwNTBDMDcwODAwMDNAY29tY2FzdC5uZXQ+"},"prevInTopic":17415,"nextInTopic":17511,"prevInTime":17443,"nextInTime":17445,"topicId":17415,"numMessagesInTopic":0,"msgSnippet":"Mary, I wish I could help you find peace.  I know there are others on this list who might have ideas.... I m sure they will respond in time. Ginger ... almost","messageBody":"<div id=\"ygrps-yiv-70029684\">Mary,<br/>\n<br/>\nI wish I could help you find peace.  I know there are others on this <br/>\nlist who might have ideas.... I&#39;m sure they will respond in time.<br/>\n<br/>\nGinger<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, mfhickman@... wrote:<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt; I have an issue I want to explore before I react to my dd. Ashley, <br/>\nalmost 12 and schooling by choice, is having a challenging time <br/>\nintegrating us, her family, in her plans. And for the most part I <br/>\nhelp her create the life she wants, but...some of the choices she is <br/>\nmaking directly hurt the other children , her siblings, and on these <br/>\nissues I have a hard time supporting her desires.<br/>\n&gt; <br/>\n&gt; My 2 examples which I am currently dealing with:<br/>\n&gt; <br/>\n&gt; 1. a good friend of Tessa&#39;a, who is turning 8 and schools is <br/>\nhaving a birthday party and chose not to invite Tessa. Fine, she is <br/>\nhaving a class type party. I have not mentioned this to Tessa as <br/>\nTessa calls this friend her best friend. Ashley, my older dd, is <br/>\ngood friends with the birthday child&#39;s sister and spent the wekend <br/>\nover at their house. Ashley has been asked to come to the party. And <br/>\nshe feels she has every right to go and too bad for Tessa. She went <br/>\nso far as to say the birthday girl doesn&#39;t really like Tessa that <br/>\nmuch and went off about how annoying her own sister is. I validate, <br/>\nI listen, but inside my own heart is breaking and it&#39;s at this point <br/>\nI need a bit of help seeing how to support Ashley and at the same <br/>\ntime support Tessa . I have spent a fair amount of energy <br/>\ncultivating the friendship with the almost 8 year old, but it is <br/>\nmore a 1 sided frinedship as the family is a double income family <br/>\nand has yet to invite Tessa over for anything. We&#39;ve had their child <br/>\nover d<br/>\n&gt; ozens of time for all day, sleepovers, movies, lots of things.The <br/>\ngirls play fantastic together and have a lot in common. So far I <br/>\nhave kept it to myself and shared with Tim my feelings, but not the <br/>\ngirls. I have placed a call to the mom to see if we can have a <br/>\nplaytime this week after school with birthday girl to celebrate. I <br/>\nam not so worried about not being invited. I am more worried about <br/>\nAshley being invited and feeling so ok about going without any <br/>\naparent empathy for her little sister&#39;s feelings.<br/>\n&gt; <br/>\n&gt; 2. Same families involved, Ashley and her friend have a close <br/>\nbirthday. I suggested they have a party together. I suggested we <br/>\nhave a big BBQ at the pool. All was good. The girls have now decided <br/>\nthe pool will be to cold. They want to have the party at the <br/>\nfriend&#39;s house. Big house with trampoline, but... now it no longer <br/>\nis a big BBQ family party, it is a 7th grade friends party without <br/>\nsiblings. Yuck... So I&#39;m stuck how to move here. I just cringe <br/>\nthinking about joyfully preparing for a party at the same time <br/>\ntelling her sibs, who want to be included, sorry, Ashley wants this <br/>\nto be just friends...this is when it hurts to much to move.<br/>\n&gt; <br/>\n&gt; What I am looking for is a way to open up the conversation so I <br/>\nfeel heard. I&#39;m having a hard time not jumping all over her for <br/>\nbeing so inconsiderate. I have pushed the pause button...I am <br/>\nwaiting and thought I would explore with you ways to approach this <br/>\nwith respect and honesty. I want to honor her.<br/>\n&gt; <br/>\n&gt; Mary<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"a sibling question","postDate":"1158684380","msgId":17415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5MTkyMDA2MTY0Ni4zMDE1LjQ1MTAxRURCMDAwQzMwRDkwMDAwMEJDNzIyMDcwMjEwNTMwMjBFMDMwNTBDMDcwODAwMDNAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":17444,"prevInTime":17414,"nextInTime":17416,"topicId":17415,"numMessagesInTopic":0,"msgSnippet":"Hi, I have an issue I want to explore before I react to my dd. Ashley, almost 12 and schooling by choice, is having a challenging time integrating us, her","messageBody":"<div id=\"ygrps-yiv-1617190871\">Hi,<br/>\n<br/>\nI have an issue I want to explore before I react to my dd. Ashley, almost 12 and schooling by choice, is having a challenging time integrating us, her family, in her plans. And for the most part I help her create the life she wants, but...some of the choices she is making directly hurt the other children , her siblings, and on these issues I have a hard time supporting her desires.<br/>\n<br/>\nMy 2 examples which I am currently dealing with:<br/>\n<br/>\n1. a good friend of Tessa&#39;a, who is turning 8 and schools is having a birthday party and chose not to invite Tessa. Fine, she is having a class type party. I have not mentioned this to Tessa as Tessa calls this friend her best friend. Ashley, my older dd, is good friends with the birthday child&#39;s sister and spent the wekend over at their house. Ashley has been asked to come to the party. And she feels she has every right to go and too bad for Tessa. She went so far as to say the birthday girl doesn&#39;t really like Tessa that much and went off about how annoying her own sister is. I validate, I listen, but inside my own heart is breaking and it&#39;s at this point I need a bit of help seeing how to support Ashley and at the same time support Tessa . I have spent a fair amount of energy cultivating the friendship with the almost 8 year old, but it is more a 1 sided frinedship as the family is a double income family and has yet to invite Tessa over for anything. We&#39;ve had their child over d<br/>\nozens of time for all day, sleepovers, movies, lots of things.The girls play fantastic together and have a lot in common. So far I have kept it to myself and shared with Tim my feelings, but not the girls. I have placed a call to the mom to see if we can have a playtime this week after school with birthday girl to celebrate. I am not so worried about not being invited. I am more worried about Ashley being invited and feeling so ok about going without any aparent empathy for her little sister&#39;s feelings.<br/>\n<br/>\n2. Same families involved, Ashley and her friend have a close birthday. I suggested they have a party together. I suggested we have a big BBQ at the pool. All was good. The girls have now decided the pool will be to cold. They want to have the party at the friend&#39;s house. Big house with trampoline, but... now it no longer is a big BBQ family party, it is a 7th grade friends party without siblings. Yuck... So I&#39;m stuck how to move here. I just cringe thinking about joyfully preparing for a party at the same time telling her sibs, who want to be included, sorry, Ashley wants this to be just friends...this is when it hurts to much to move.<br/>\n<br/>\nWhat I am looking for is a way to open up the conversation so I feel heard. I&#39;m having a hard time not jumping all over her for being so inconsiderate. I have pushed the pause button...I am waiting and thought I would explore with you ways to approach this with respect and honesty. I want to honor her.<br/>\n<br/>\nMary<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":17492,"nextTopicId":17502}}