{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":38,"messages":[{"userId":269152394,"authorName":"Lorrie","from":"Lorrie &lt;iamhisservant4ever@...&gt;","profile":"iamhisservant4ever","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181318989","msgId":24275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5MDI2OS43ODU5NS5xbUB3ZWIzODUxMC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24261,"nextInTopic":24277,"prevInTime":24274,"nextInTime":24276,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"Actually plotting to kill someone else, be it your parent, or a stranger, in my opinion would make you insane. If at that age I didn t want to be around my","messageBody":"<div id=\"ygrps-yiv-178930200\">Actually plotting to kill someone else, be it your parent, or a stranger, in my opinion would make you insane. If at that age I didn&#39;t want to be around my parents I would have found a way out, I certainly wouldn&#39;t have killed them, or had someone else do it. And.....I would love to know how you know that she :plotted&quot; to kill her parents. When did she tell you that? Where was that ever said. That is all heresay and speculation. Yes, it was definitely speculated but never a fact in the case. If it had been a proven fact she wouldn&#39;t be on the loose right now, enjoying her freedom, while her parents are dead, and the boy that she supposedly &quot;loved,&quot; is in prison for the rest of his life. hmmmmmmmm....................<br/>\n <br/>\n~~Clearly a factor for that child? Again, did you know this family so<br/>\nwell that<br/>\nyou can make this statement. ~~<br/>\n<br/>\nUm.....she plotted with her boyfriend to kill them!! Does that not<br/>\nmake it pretty damn obvious that she wanted to be AWAY from them?<br/>\nNobody needs to be a crime expert or know that family to understand<br/>\nthat she did NOT want to be around her parents. I would think plotting<br/>\nto kill someone sort of puts you in that category. Hmmmm.....<br/>\n<br/>\nRen<br/>\nlearninginfreedom. com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n____________________________________________________________________________________<br/>\nSick sense of humor? Visit Yahoo! TV&#39;s <br/>\nComedy with an Edge to see what&#39;s on, when. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/collections/222\">http://tv.yahoo.com/collections/222</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ren","postDate":"1181315341","msgId":24252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0YnJlZCtvNzc2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxOTA1Ni43NzUxMi5xbUB3ZWIzODUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24249,"nextInTopic":24261,"prevInTime":24251,"nextInTime":24253,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"~~Clearly a factor for that child? Again, did you know this family so well that you can make this statement. ~~ Um.....she plotted with her boyfriend to kill","messageBody":"<div id=\"ygrps-yiv-1386408016\">~~Clearly a factor for that child? Again, did you know this family so<br/>\nwell that<br/>\nyou can make this statement. ~~<br/>\n<br/>\n<br/>\nUm.....she plotted with her boyfriend to kill them!! Does that not<br/>\nmake it pretty damn obvious that she wanted to be AWAY from them?<br/>\nNobody needs to be a crime expert or know that family to understand<br/>\nthat she did NOT want to be around her parents. I would think plotting<br/>\nto kill someone sort of puts you in that category. Hmmmm.....<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics]arbitrary rules was  Re: Ren","postDate":"1181314850","msgId":24261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ5MEEzMzYzLUE1RjEtNDA0Ny04NTY0LUJGMDM3Q0U4M0MzMkBkaWVyYXVlci5uZXQ+","inReplyToHeader":"PGY0Ym5hcisxMTZybkBlR3JvdXBzLmNvbT4=","referencesHeader":"PGY0Ym5hcisxMTZybkBlR3JvdXBzLmNvbT4="},"prevInTopic":24252,"nextInTopic":24275,"prevInTime":24260,"nextInTime":24262,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... Yeah, my mom had rules like no boyfriends in my bedroom or alone with me in the TV room. So when we wanted to make out, we went out into the fields and","messageBody":"<div id=\"ygrps-yiv-1109229811\">On Jun 8, 2007, at 9:58 AM, Meredith wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Lorrie<br/>\n&gt; &lt;iamhisservant4ever@...&gt; wrote:<br/>\n&gt;&gt;&gt; If your child isn&#39;t allowed to date at say 13 or 14 then you<br/>\n&gt;&gt; distrust them and disrespect them?? Are you kidding? Isn&#39;t it more<br/>\n&gt;&gt; like you are protecting them?<br/>\n&gt;<br/>\n&gt; I wasn&#39;t allowed to date at 14, but I still found ways to have sex<br/>\n&gt; with boys. &quot;Nice&quot; boys, too. I didn&#39;t use a condom until college,<br/>\n&gt; though. That&#39;s a scary thought, in retrospect.<br/>\n<br/>\n </span></blockquote>Yeah, my mom had rules like &quot;no boyfriends in my bedroom or alone  <br/>\nwith me in the TV room.&quot; So when we wanted to make out, we went out  <br/>\ninto the fields and stomped down a little circle of wheat to make a  <br/>\nsecret room, or snuck into the barns on the farms nearby. The parents  <br/>\nall had a rule about not taking walks alone with a boy, but my  <br/>\ngirlfriends and I were perfectly happy to act as a pretend chaperone  <br/>\nfor each other--to walk off, visibly the third person, and then sit  <br/>\nin a tree or in a different part of the barn and read a book for two  <br/>\nhours while the heavy petting was going on. I was as young as 12 when  <br/>\nthis was going on.<br/>\n<br/>\nI had a strict curfew, so once I was 16 and was allowed to date one  <br/>\nof my boyfriends used to just pick up fast food on the way to pick me  <br/>\nup, and we would just go park for the whole evening, about half a  <br/>\nmile from my house.<br/>\n<br/>\nI was paranoid about pregnancy and never had unprotected sex--I was  <br/>\ntechnically a virgin until I was 19, but I was pretty much an  <br/>\n&quot;everything but&quot; girl from about 13. I&#39;m not sure it did me any harm  <br/>\nat all, even though, when I look at my 13-year-old niece, she seems  <br/>\nvery young and it is a bit disturbing to imagine her doing the things  <br/>\nI did at 13. I guess I just didn&#39;t feel as young at the time as she  <br/>\nlooks to me now! I was mostly messing around with really sweet boys-- <br/>\nit wasn&#39;t until I got into college and discovered fraternity boys  <br/>\nthat I experienced pressuring assholes.<br/>\n<br/>\nI&#39;m not sure it did me harm, but if I&#39;d had stronger self-esteem, I  <br/>\nmight have done less of it. Some of my motivation was that I really  <br/>\nliked it, and some of my motivation was that it made me feel the boys  <br/>\nliked me. Nobody at home liked me. Maybe if they had, I wouldn&#39;t have  <br/>\nlooked for sexual reassurance. Hard to say.<br/>\n<br/>\nSu</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ren","postDate":"1181313116","msgId":24249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0YnA4cyszc2pxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3OTc0Mi4yMTg4Ny5xbUB3ZWI1MzgwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":24247,"nextInTopic":24252,"prevInTime":24248,"nextInTime":24250,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... I was so relieved when Ray figured this out. He was the bad boy in school - still looks the part with his dyed-black hair and skull tshirts. His","messageBody":"<div id=\"ygrps-yiv-1852022271\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Sylvia Toyama &lt;sylgt04@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   Oh, yeah, nothing makes a bad boy look better to a girl than <br/>\n&gt;having her parents tell her that he&#39;s wrong for her.<br/>\n<br/>\n </span></blockquote>I was so relieved when Ray figured this out. He was the &quot;bad boy&quot; in <br/>\nschool - still looks the part with his dyed-black hair and skull <br/>\ntshirts. His girlfriend&#39;s mom, as I mentioned, didn&#39;t like or trust <br/>\nhim, and his girlfriend used that as a power-ploy with her mom. When <br/>\nRay finally figured out that his girlfriend had been playing up <br/>\nhis &quot;badness&quot; - to the point of repeating things he&#39;d said in <br/>\nconfidence - and was pretty unhappy about it. That&#39;s when he decided <br/>\nto break up with her. He wanted to be liked for his whole self, not <br/>\njust his &quot;badness&quot;.<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ren","postDate":"1181311131","msgId":24247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0Ym5hcisxMTZybkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24243,"nextInTopic":24249,"prevInTime":24246,"nextInTime":24248,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... I wasn t allowed to date at 14, but I still found ways to have sex with boys. Nice boys, too. I didn t use a condom until college, though. That s a scary","messageBody":"<div id=\"ygrps-yiv-321910626\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Lorrie <br/>\n&lt;iamhisservant4ever@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If your child isn&#39;t allowed to date at say 13 or 14 then you <br/>\n&gt;distrust them and disrespect them?? Are you kidding? Isn&#39;t it more <br/>\n&gt;like you are protecting them? <br/>\n<br/>\n </span></blockquote>I wasn&#39;t allowed to date at 14, but I still found ways to have sex <br/>\nwith boys. &quot;Nice&quot; boys, too. I didn&#39;t use a condom until college, <br/>\nthough. That&#39;s a scary thought, in retrospect.<br/>\n<br/>\nMy stepson met a girl at 4H camp and they dated for several months. <br/>\nHer mom didn&#39;t let them be alone together and restricted the amount <br/>\nof time they spent on the phone, so the girl started waiting until <br/>\nher parents were asleep to call. I&#39;m glad they broke up before <br/>\nsummer - I fully expected her to start sneaking over here. Yikes. My <br/>\nstepson had condoms and practiced with them - its a good idea, they <br/>\ncan be a bit tricky &quot;in the moment&quot; if you aren&#39;t used to them. That <br/>\nwas reassuring to me, that he was thinking ahead like that. <br/>\n<br/>\nI&#39;d rather trust my kids to use protection than hope they aren&#39;t <br/>\nhaving unsafe sex behind my back. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13 - yes, 13)</div>","specialLinks":[]},{"userId":269152394,"authorName":"Lorrie","from":"Lorrie &lt;iamhisservant4ever@...&gt;","profile":"iamhisservant4ever","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Ren","postDate":"1181286694","msgId":24243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxOTA1Ni43NzUxMi5xbUB3ZWIzODUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24237,"nextInTopic":24247,"prevInTime":24242,"nextInTime":24244,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"~~~So then you are saying if your parents don t allow you to date, then it is perfectly all right to plan with your boyfriend to kill them??~~~~ Did you read","messageBody":"<div id=\"ygrps-yiv-1298741246\">~~~So then you are saying if your parents don&#39;t allow you to date,<br/>\nthen it is perfectly all right to plan with your boyfriend to kill<br/>\nthem??~~~~<br/>\n<br/>\nDid you read my post? I said: &quot;It certainly doesn&#39;t explain murder,<br/>\nI&#39;m not trying to say that. But it&#39;s pretty obvious that she felt<br/>\ncontrolled to the degree that she wanted to get away from her parents.&quot;<br/>\nyes, i read you post and that is why i asked you this question. Obvious? how was all this obvious to you? Did you know this family, did the paper say at some point that she was being controlled by her family? How do you know that she wanted to get away from her parents? Was this something you read also, or are you a crime expert?<br/>\n<br/>\nHow does one extrapolate that I&#39;m justifying murder from the above<br/>\nstatement? I very clearly stated that the murder was not able to be<br/>\nexplained by control issues alone, but it was clearly a factor for<br/>\nthat particular child.<br/>\nClearly a factor for that child?  Again, did you know this family so well that you can make this statement.  Funny how you referred to her as a child yet you still seem to stand by the fact that she should have been allowed to have sex. Sorry, but at her age agreeing to her having sex with an 18 year old should be considered child abuse. Any parent that would think that is fine, in my opinion, is sick!<br/>\n<br/>\nI was controlled in many areas but never wanted to kill my parents. I<br/>\nDO remember having some pretty angry/violent thoughts towards them at<br/>\ntimes though. Being controlled by another human being doesn&#39;t foster<br/>\nhappy feelings or trusting relationships.<br/>\nIt seems that you have some baggage from when you were  a child and that is what this is all about. And once again being controlling and looking out for your  child are two completely different things. Why in the world would you have a child and then just let them try to make it on their own without any intervention to help them is beyond me. <br/>\n<br/>\n~~Do you really think that a girl just turning 14 should be having sex<br/>\nwith a boy? You don&#39;t think that her parents were looking out for her,<br/>\nand cared about her, so they were restricting her from seeing a boy<br/>\ntoo old for her?~~<br/>\n<br/>\nApparently what her parents thought wasn&#39;t as important as what she<br/>\nneeded/wanted. Do you really think that a parent can truly keep a<br/>\nchild from having sex if they choose to? I think that most parents<br/>\nbelieve they can control their children but it&#39;s only an illusion.<br/>\nThey just never hear about the stuff they react to, because the child<br/>\nlearns not to talk about it very early in life.<br/>\nWhat she needed/wanted?? So you are saying that a 13 year old girl is mentally capable of carrying on a sexual relationship with a boy that is 18?? Are you crazy? Do you really believe that a child should be allowed to make a decision to have sex at such a young age. Do you also believe that if a child decides they need/want to take drugs then that is fine as well??<br/>\n<br/>\n~~If your child isn&#39;t allowed to date at say 13 or 14 then you<br/>\ndistrust them and disrespect them?? Are you kidding? Isn&#39;t it more<br/>\nlike you are protecting them?~~<br/>\n<br/>\nMost parents would think they are protecting their children. How well<br/>\nwould these same tactics work with other adults? How trusting is it to<br/>\nforbid? Obviously the control tactics don&#39;t work, judging by the<br/>\namount of children that hide stuff from their parents. I don&#39;t<br/>\n&quot;allow&quot; or &quot;disallow&quot;, I try to help them get what they want in life<br/>\nwhile respecting each of our needs.<br/>\nWe are not talking about adults here, we are talking about children. How trusting is it to forbid? It isn&#39;t a matter of trusting in this case. She was told she couldn&#39;t see him and they trusted that she wasn&#39;t. I help my children get what they want in life as well, but if when my daughter was 13 and came to me and said that she was going to have sex with an 18 year old boy, you can bet your ass I wouldn&#39;t have let that happen. Not because I am a control freak, because I am a caring, loving mother who has looked out for my kids.<br/>\n<br/>\nParents have a much greater chance of imparting their wisdom if they<br/>\nare trusted by a child. And by trusted, I mean that the child can<br/>\ntrust them with information that may be difficult for the parent and<br/>\nthe parent still treats them as whole and capable human beings.<br/>\nBoth of my kids trust me completely and I trust them as well. They were brought up with good morals and lots of love. Both know that they can come to me with anything and will never be judged, ridiculed, or make me think any less of them. They have never been treated as anything but capable human beings.  <br/>\n<br/>\n~~&quot;Not allowed&quot; stuff is controlling and manipulative? ? ~~<br/>\n<br/>\nIf your spouse/partner didn&#39;t allow you to do something, how would<br/>\nthat affect your relationship? If he/she doesn&#39;t forbid you, then why<br/>\ndon&#39;t you do lots of harmful things? If people need control in order<br/>\nto make healthy positive choices, then how are you (or me, or anyone)<br/>\nable to make perfectly good decisions for our lives? Being an adult<br/>\ndoesn&#39;t make you magically capable. Humans that have a support system<br/>\nthat involves other humans willing to support and love and share<br/>\ninformation have a pretty high chance of making good choices for their<br/>\nown lives.<br/>\nWe are no talking about spouse/partners, or any other adults. These are children that trust us with their lives.  <br/>\n<br/>\n~~That isn&#39;t being manipulative or controlling, that is being a caring<br/>\nparent. If a kids parents are &quot;allowing&quot; them to do these things then<br/>\nthey should be reported to child welfare.~~<br/>\n<br/>\nInteresting.<br/>\nI have a 17 year old son that is in a pretty intense relationship<br/>\nright now. I had his girlfriend up here the last three weekends in a<br/>\nrow. If they wanted to have sex, they could. I don&#39;t kid myself that I<br/>\nhave any control over that.<br/>\n<br/>\nHe also knows that I support and trust him. I&#39;ve shared information<br/>\nwith him and interestingly enough, he continues to be very open with<br/>\nme. He shares things with me that I would NEVER have talked with my<br/>\nparents about....why? Because we DO have trust between us.<br/>\nMy 16 year old daughter is also in an intense relationship. Her boyfriend comes here to stay for a week or longer every month. I trust them both and they trust me. They are not afraid to tell me anything or ask my opinion on anything as well. What goes on between them is no one elses business. But, if she were only 13 I would not have allowed, OMG I said allowed!!, a relationship this intense. Not because I ever &quot;controlled&quot; her, but because I love her.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\n8:00? 8:25? 8:40? Find a flick in no time <br/>\nwith the Yahoo! Search movie showtime shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#news\">http://tools.search.yahoo.com/shortcuts/#news</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ren","postDate":"1181271472","msgId":24237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0YWdqZytwZ3NmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24233,"nextInTopic":24243,"prevInTime":24236,"nextInTime":24238,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"~~~So then you are saying if your parents don t allow you to date, then it is perfectly all right to plan with your boyfriend to kill them??~~~~ Did you read","messageBody":"<div id=\"ygrps-yiv-1985873793\">~~~So then you are saying if your parents don&#39;t allow you to date,<br/>\nthen it is perfectly all right to plan with your boyfriend to kill<br/>\nthem??~~~~<br/>\n<br/>\n<br/>\nDid you read my post? I said: &quot;It certainly doesn&#39;t explain murder,<br/>\nI&#39;m not trying to say that. But it&#39;s pretty obvious that she felt<br/>\ncontrolled to the degree that she wanted to get away from her parents.&quot;<br/>\n<br/>\nHow does one extrapolate that I&#39;m justifying murder from the above<br/>\nstatement? I very clearly stated that the murder was not able to be<br/>\nexplained by control issues alone, but it was clearly a factor for<br/>\nthat particular child.<br/>\n<br/>\nI was controlled in many areas but never wanted to kill my parents. I<br/>\nDO remember having some pretty angry/violent thoughts towards them at<br/>\ntimes though.  Being controlled by another human being doesn&#39;t foster<br/>\nhappy feelings or trusting relationships.<br/>\n<br/>\n<br/>\n~~Do you really think that a girl just turning 14 should be having sex<br/>\nwith a boy? You don&#39;t think that her parents were looking out for her,<br/>\nand cared about her, so they were restricitng her from seeing a boy<br/>\ntoo old for her?~~<br/>\n<br/>\nApparently what her parents thought wasn&#39;t as important as what she<br/>\nneeded/wanted. Do you really think that a parent can truly keep a<br/>\nchild from having sex if they choose to? I think that most parents<br/>\nbelieve they can control their children but it&#39;s only an illusion.<br/>\nThey just never hear about the stuff they react to, because the child<br/>\nlearns not to talk about it very early in life.<br/>\n<br/>\n~~If your child isn&#39;t allowed to date at say 13 or 14 then you<br/>\ndistrust them and disrespect them?? Are you kidding? Isn&#39;t it more<br/>\nlike you are protecting them?~~<br/>\n<br/>\nMost parents would think they are protecting their children. How well<br/>\nwould these same tactics work with other adults? How trusting is it to<br/>\nforbid?  Obviously the control tactics don&#39;t work, judging by the<br/>\namount of children that hide stuff from their parents.  I don&#39;t<br/>\n&quot;allow&quot; or &quot;disallow&quot;, I try to help them get what they want in life<br/>\nwhile respecting each of our needs.<br/>\n<br/>\nParents have a much greater chance of imparting their wisdom if they<br/>\nare trusted by a child. And by trusted, I mean that the child can<br/>\ntrust them with information that may be difficult for the parent and<br/>\nthe parent still treats them as  whole and capable human beings.<br/>\n<br/>\n<br/>\n~~&quot;Not allowed&quot; stuff is controlling and manipulative??  ~~<br/>\n<br/>\nIf your spouse/partner didn&#39;t allow you to do something, how would<br/>\nthat affect your relationship? If he/she doesn&#39;t forbid you, then why<br/>\ndon&#39;t you do lots of harmful things? If people need control in order<br/>\nto make healthy positive choices, then how are you (or me, or anyone)<br/>\nable to make perfectly good decisions for our lives? Being an adult<br/>\ndoesn&#39;t make you magically capable. Humans that have a support system<br/>\nthat involves other humans willing to support and love and share<br/>\ninformation have a pretty high chance of making good choices for their<br/>\nown lives.<br/>\n<br/>\n~~That isn&#39;t being manipulative or controlling, that is being a caring<br/>\nparent. If a kids parents are &quot;allowing&quot; them to do these things then<br/>\nthey should be reported to child welfare.~~<br/>\n<br/>\nInteresting.<br/>\nI have a 17 year old son that is in a pretty intense relationship<br/>\nright now. I had his girlfriend up here the last three weekends in a<br/>\nrow. If they wanted to have sex, they could. I don&#39;t kid myself that I<br/>\nhave any control over that.<br/>\n<br/>\nHe also knows that I support and trust him. I&#39;ve shared information<br/>\nwith him and interestingly enough, he continues to be very open with<br/>\nme. He shares things with me that I would NEVER have talked with my<br/>\nparents about....why? Because we DO have trust between us.<br/>\n<br/>\nThe most interesting thing though? He chooses (at this point) to not<br/>\nhave sex. His point of view is that he isn&#39;t ready for the possibility<br/>\nof a baby. He knows how to prevent that, but he also realizes it&#39;s<br/>\nalways a risk and he&#39;s just not ready for that yet. Will I know when<br/>\nhe makes a different choice? Not necessarily. But he does know that if<br/>\nhe shares information with me, he will get a calm and supportive<br/>\nparent listening and answering any questions he might have without the<br/>\nweight of judgement. Trust is powerful.<br/>\n<br/>\n<br/>\n~~Talking to your kids is great and I fully believe in that, but there<br/>\nare those kids that don&#39;t care and do what they want no matter what<br/>\nyou try to teach them or talk with them about.~~<br/>\n<br/>\nI don&#39;t try to teach my kids. I trust that they will learn what they<br/>\nneed, when they need it. They make different choices than I would.<br/>\nThat&#39;s their right and supporting their journey in life is more<br/>\nimportant to me than trying to get them to choose the way I think is best.<br/>\n<br/>\n ~~So I am guessing in your opinion if your child does not want to<br/>\nlisten to you then it is fine to do what they want no matter what it is.~~<br/>\n<br/>\n<br/>\nI pretty much try to help them get whatever they want/need/desire, so<br/>\nthere really aren&#39;t any lines to cross in that regard.<br/>\nPeople mostly want to live a happy, healthy life. When a person tries<br/>\nto do truly harmful things, there are usually good reasons for that.<br/>\nSo far, my kids have proven me right by not desiring anything truly<br/>\nharmful.....<br/>\nTrusting them is the best way to live.  Examining the reasons behind<br/>\nwhat a person chooses, leads to far more understanding than any<br/>\nforbidding. I think punishment and forbidding are taking the easy way<br/>\nout really. Examining issues, discussing and using some creative<br/>\nthinking take a lot more time, but the results are much healthier<br/>\nrelationships and happier families.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ren","postDate":"1181265137","msgId":24233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0YWFkaCtyZTVjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJmNi4xNWUyZmMxYS4zMzk5ZjQ2Y0Bhb2wuY29tPg=="},"prevInTopic":24230,"nextInTopic":24237,"prevInTime":24232,"nextInTime":24234,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"I just wanted to throw in my two cents on the topic. I wasn t unschooled, nor was I never told NO .. but I think my parents trusted me to make up my own mind","messageBody":"<div id=\"ygrps-yiv-1322098482\">I just wanted to throw in my two cents on the topic.<br/>\n<br/>\nI wasn&#39;t unschooled, nor was I never told &quot;NO&quot;.. but I think my <br/>\nparents trusted me to make up my own mind on most things. I can&#39;t <br/>\nremember even being grounded, or &quot;in trouble&quot;... but I know they <br/>\nalways told me that drinking/smoking.drugs/sex probably werent the <br/>\nbest things for a teenager, but I know there was never a &quot;NO&quot; <br/>\ninvolved.<br/>\n<br/>\nThat said... I think I PROBABLY would have been the typical teenager <br/>\nand rebelled against them had they told me &quot;NO you CANT&quot;... but they <br/>\ndidn&#39;t. The only NO I got from them was a &quot;NO&quot; to dye my hair pink <br/>\n(the week before senior pictures)... then the next day after pics I <br/>\ndyed it and got my eyebrow pierced the same day. And my mom thought <br/>\nit was cool!! It was more of a &quot;I scratch your back, you scratch <br/>\nmine&quot; kind of deal if you know what I mean.<br/>\n<br/>\nNow, I am only 22 so I&#39;m not looking back and preaching about how I <br/>\nwas raised... just telling the honest truth about something that <br/>\nhappened to me not very long ago at all.<br/>\n<br/>\nI was 15 and was at a party and got wasted. A friend dropped me off <br/>\nat home and my mom helped me up the steps into bed and never had a <br/>\nnegative word to say. I woke up in the morning very sick and after my <br/>\ndad helped me strip my bed (and laughing the whole time by the way <br/>\nlol) my mom was waiting downstairs with a huge plate of bacon and <br/>\neggs. I ran straight back to the bathroom and was there for the next <br/>\nhour. She knew exactly what she was doing. She wasnt going to lecture <br/>\nme or preach to me... but she knew how to get to me (with the <br/>\ndisgusting aroma of BACON on an upset stomach) without saying a word. <br/>\nI told her I never wanted to see a drink again in my life, and she <br/>\nsaid... &quot;well next time maybe I wont make bacon&quot;... the smartass LOL<br/>\n<br/>\nI can honestly say I havent had a drink since.<br/>\n<br/>\n<br/>\nI have NEVER smoked a cigarette or done any drugs... only because I <br/>\nhated the idea of even taking tylenol for a headache. I just didn&#39;t <br/>\nlike putting things into my body that would alter my <br/>\nthinking/feelings. And that was just my choice. And I wasn&#39;t the <br/>\nchurch going &quot;goody two-shoes&quot;. I hung out with the party crowd and I <br/>\ndid things I shouldnt have, and when everyone else was smoking and <br/>\ndrinking... I laughed right along... but I never touched any of it.<br/>\n<br/>\n<br/>\n<br/>\nI don&#39;t think anything a parent &quot;threatens&quot; a kid with will change <br/>\nwhat they think. My parents could have preached to the moon and back <br/>\nabout sex, and it wouldnt have made a difference. I met who I wanted <br/>\nto be with when I was 17 and had my first child when I was 18. Why on <br/>\nearth would I believe that someone else was more qualified to make <br/>\nthat choice than I was? It was my body and my life. I wouldn&#39;t sit <br/>\nand preach to my mom about how to cut her hair. It&#39;s not my place. <br/>\nBut I WILL tell her that I think that the haircut she wants might not <br/>\nlook so hot on her. But in the end, she&#39;s going to do what she thinks <br/>\nis best. Just like she wouldn&#39;t tell me when, where, and who to have <br/>\nrelationships with. That will only make a teen want to rebel against <br/>\nyou (and even if the kid doesnt even know if he/she wants to have sex <br/>\nyet, it may make him OVERLY eager to try it because its &quot;forbidden&quot;) <br/>\nso why ruin the bond if you don&#39;t need to?<br/>\n<br/>\n<br/>\n<br/>\nA kid who sees a bright red bench runs over to it and puts his hand <br/>\nout to touch it... and his mom says &quot;NO!! IT&#39;S WET!!&quot;... and he still <br/>\ntouches it. Why? Because he was going to anyway... The same kid could <br/>\nhave learned that on his own by touching it without being told no. <br/>\nYou have the same outcome in both scenarios...<br/>\n<br/>\n<br/>\nSince I think that my kids learn the most from things they discover <br/>\non their own... I think maybe some people could benefit from trying <br/>\nit for a day. Don&#39;t lecture your teen about sex. Don&#39;t tell her no. <br/>\nDon&#39;t forbid her to see someone who is too old for her and might lead <br/>\nher to engage in sexual activities. Let her learn on her own. Send <br/>\nher to my house for a day. I have three children under three years <br/>\nold. If she doesn&#39;t want her tubes tied before the day is done... <br/>\nthen maybe she IS ready for sex :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kidgie@... wrote:<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt; In a message dated 6/7/2007 4:08:34 P.M. Pacific Daylight Time,  <br/>\n&gt; kbcdlovejo@... writes:<br/>\n&gt; <br/>\n&gt; Children  who aren&#39;t told, &quot;no&quot; Stop&quot; &quot;don&#39;t&quot; &quot;never&quot; will trust <br/>\nyou to <br/>\n&gt; be honest  and open with them. They will be honest and open back.<br/>\n&gt; <br/>\n&gt; Isn&#39;t THAT what  we want?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I am seeing that with Grace, my soon-to-be 15 year old. She is <br/>\nreturning  <br/>\n&gt; home to me after a year at her Dad&#39;s, hoping for structure, <br/>\ncontainment...ugh  <br/>\n&gt; ugh ugh...Yet she confided in me, trusts me...and I thin we will be <br/>\ngetting her  <br/>\n&gt; into unschooling too - my heart says it&#39;s happening, just a matter <br/>\nof time. <br/>\n&gt;  <br/>\n&gt; Karen <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ************************************** See what&#39;s free at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181260396","msgId":24230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJmNi4xNWUyZmMxYS4zMzk5ZjQ2Y0Bhb2wuY29tPg=="},"prevInTopic":24228,"nextInTopic":24233,"prevInTime":24229,"nextInTime":24231,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/7/2007 4:08:34 P.M. Pacific Daylight Time, kbcdlovejo@aol.com writes: Children  who aren t told, no Stop don t never will trust you","messageBody":"<div id=\"ygrps-yiv-1517668496\">In a message dated 6/7/2007 4:08:34 P.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\nChildren  who aren&#39;t told, &quot;no&quot; Stop&quot; &quot;don&#39;t&quot; &quot;never&quot; will trust you to <br/>\nbe honest  and open with them. They will be honest and open back.<br/>\n<br/>\nIsn&#39;t THAT what  we want?<br/>\n<br/>\n<br/>\nI am seeing that with Grace, my soon-to-be 15 year old. She is returning  <br/>\nhome to me after a year at her Dad&#39;s, hoping for structure, containment...ugh  <br/>\nugh ugh...Yet she confided in me, trusts me...and I thin we will be getting her  <br/>\ninto unschooling too - my heart says it&#39;s happening, just a matter of time. <br/>\n <br/>\nKaren <br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181257227","msgId":24228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTc3NkVDNjJENDJBRS05NUMtQzI3MkB3ZWJtYWlsLWRiMTIuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY1MThhOTM2MDcwNjA3MTIyMHMzZTYxOWY2Mm00NDBlNTNkODgwMmQ4ZmJmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+IDw2NTE4YTkzNjA3MDYwNzEyMjBzM2U2MTlmNjJtNDQwZTUzZDg4MDJkOGZiZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":24225,"nextInTopic":24230,"prevInTime":24227,"nextInTime":24229,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... From: diana jenner  Of the unschooling kids I ve talked Sex with (again, a big number), most have had the regular mechanical","messageBody":"<div id=\"ygrps-yiv-1870895005\">-----Original Message-----<br/>\nFrom: diana jenner &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hahamommy@...\">hahamommy@...</a>&gt;<br/>\n<br/>\nOf the unschooling kids I&#39;ve talked Sex with (again, a big number), most<br/>\nhave had the regular mechanical questions, some safety concerns, and the<br/>\nvery best conversation I ever had was with an 18 year old who was/is<br/>\ncommitted to being a sweet, considerate, pleasuring lover of his <br/>\ngirlfriend,<br/>\nwhom he is madly in love with. I&#39;ve yet to meet a one who is <br/>\nparticipating<br/>\nin sexual behaviours out of a lack of self-worth or lack of available<br/>\nlove/connections at home.<br/>\n<br/>\n-=-=-<br/>\n<br/>\nI&#39;m guessing that this is *my* 18---now 19---year old, Cameron. &lt;g&gt; I <br/>\nguess I could be wrong. &lt;g&gt;<br/>\n<br/>\nCameron has had several deep conversations with Diana. He knows he can <br/>\ntalk with me---and we have had many, many conversations about sex and <br/>\nrelationships. But he really enjoys his (limited) time with Diana.<br/>\n<br/>\nChildren who aren&#39;t told, &quot;no&quot; Stop&quot; &quot;don&#39;t&quot; &quot;never&quot; will trust you to <br/>\nbe honest and open with them. They will be honest and open back.<br/>\n<br/>\nIsn&#39;t THAT what we want?<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: control and consequences WAS  Ren","postDate":"1181255932","msgId":24225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTc3NkJDMjEwQTExQy05NUMtQzFBREB3ZWJtYWlsLWRiMTIuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24216,"nextInTopic":24228,"prevInTime":24224,"nextInTime":24226,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... From: Lorrie  Not Ren, but... -=-=-=-= So then you are saying if your parents don t allow you to date, then it is perfectly","messageBody":"<div id=\"ygrps-yiv-44285010\">-----Original Message-----<br/>\nFrom: Lorrie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:iamhisservant4ever@...\">iamhisservant4ever@...</a>&gt;<br/>\n<br/>\nNot Ren, but...<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nSo then you are saying if your parents don&#39;t allow you to date, then it <br/>\nis<br/>\nperfectly all right to plan with your boyfriend to kill them??<br/>\n<br/>\n-=-=-=<br/>\n<br/>\nNo, what we&#39;re saying is that, if you don&#39;t allow your child to date, <br/>\nshe will feel controlled and needy and unheard, so she will be dating <br/>\nwhether you want her to---or even KNOW about it---and she won&#39;t come to <br/>\nyou when she&#39;s in trouble. And that, yes, the probablility that she <br/>\nwill do *something* (although generally not that drastic) is high.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDo you really think that a girl just turning 14 should be having sex <br/>\nwith a boy?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDepends on the girl and why.<br/>\n<br/>\nAt what age do *you* think it&#39;s OK?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYou don&#39;t think that her parents were looking out for her, and cared <br/>\nabout her,<br/>\nso they were restricitng her from seeing a boy too old for her?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI think that that&#39;s what they *thought* they were doing.<br/>\n<br/>\nI also think that she felt they were suffocating her.<br/>\n<br/>\nIt really only matters what *she* thought, doesn&#39;t it?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nIf your child isn&#39;t allowed to date at say 13 or 14 then you distrust <br/>\nthem and<br/>\ndisrespect them??<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nIf your child isn&#39;t allowed to make decisions, are you distrusting and <br/>\ndisrepecting her?<br/>\n<br/>\n-=-=-=-==-<br/>\n<br/>\nAre you kidding? Isn&#39;t it more like you are protecting them?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nDepends. What are you protecting her from?<br/>\n<br/>\nWhen a child doesn&#39;t feel heard or respected, where is she to go? Whom <br/>\nis she supposed to trust? If her parents don&#39;t believe her or trust <br/>\nher, what do you expect her to do? Sit there and trust *them*???<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n&quot;Not allowed&quot; stuff is controlling and manipulative??<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nUh huh. What else is &quot;not allowed?&quot;<br/>\n<br/>\nHow can youdisallow something and NOT be controlling and manipulative? <br/>\nHow???<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAre you saying that parents that have younger kids that are interested <br/>\nin say, trying drugs, having<br/>\nsex, and anything else that is harmful to them should be &quot;allowed&quot; to <br/>\ndo these<br/>\nthings no matter how old they are??<br/>\n<br/>\n<br/>\n--=-=-=-<br/>\n<br/>\nI didn&#39;t think age has anything to do with it.<br/>\n<br/>\nI think it has everything to do with the child&#39;s maturity level (how <br/>\nmany 8 year olds do you know that even want to see others KISSING?) and <br/>\ncommunication and respect and trust.<br/>\n<br/>\nMy now 19 year old son and his girlfriend started having sex when he <br/>\nwas 15 and she was 14. Was I thrilled? No. But they aren&#39;t me. They <br/>\nhave been together now more than four years. I don&#39;t consider sex to be <br/>\n&quot;harnful&quot;---I consider it to be a natural part of life and living. I <br/>\nhope that is the attitude he keeps. He&#39;s a very giving, considerate, <br/>\nkind boyfriend.<br/>\n<br/>\nHe also did a few drugs. Again---I was not thrilled, but I kept the <br/>\nlines of communication waaaay open, and we discussed when and why and <br/>\nall about DUI and being smart about what he was doing. He knew not to <br/>\ndrive while high---that I would come get him or that he could stay over <br/>\nrather than drive---both of which happened. He just called to let us <br/>\nknow whether he would stay or have us pick him up. We did pick him up <br/>\non several occasions without ANY shame or ridicule. I&#39;d MUCH rather <br/>\nhave him honest and safe than sneaking and in danger.<br/>\n<br/>\nThat&#39;s not a hard call. Really!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThat isn&#39;t being manipulative or controlling, that is being a caring <br/>\nparent. If<br/>\na kids parents are &quot;allowing&quot; them to do these things then they should <br/>\nbe<br/>\nreported to child welfare.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nGood luck!<br/>\n<br/>\nMost kids do it anyway---just behind their parents&#39; backs. ALL of <br/>\nCameron&#39;s friends, as a matter of fact!<br/>\n<br/>\nI&#39;m &quot;allowing&quot; it because it will happen anyway. I would rather know <br/>\nwhat he&#39;s doing and where than have him sneak and lie.<br/>\n<br/>\nI&#39;m not *condoning* it. But I&#39;m not *forbidding* it either.<br/>\n<br/>\nI&#39;m smarter than that.<br/>\n<br/>\nHis safety is more important than what other controlling parents tihnk <br/>\nof me. He know I trust him. He trusts me too.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nTalking to your kids is great and I fully believe in that, but there <br/>\nare those<br/>\nkids that don&#39;t care and do what they want no matter what you try to <br/>\nteach them<br/>\nor talk with them about.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThat&#39;s not my experience. Children who are respected and trusted from a <br/>\nyoung age DO care what you talk with them about.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSo I am guessing in your opinion if your child does not<br/>\nwant to listen to you then it is fine to do what they want no matter <br/>\nwhat it is.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWell, due to respect and trust---long-term---my children WILL listen to <br/>\nme.<br/>\n<br/>\nThey may not make the same choices I would, but that&#39;s not my goal. <br/>\nTrust is. And the only way to get it is to give it.<br/>\n<br/>\n-=-=-==-<br/>\n<br/>\nMy kids were given alot of freedom, including freedom to make mistakes. <br/>\nLuckily,<br/>\nmine never desired to try drugs, or do anything that would end up <br/>\nharming them.<br/>\nThat is not always the case in every home. If they did, I certainly <br/>\nwould have<br/>\nstepped in and not stood there and watched them hurt themselves. That <br/>\nis NOT<br/>\nbeing controlling, it is being a parent that loves their children!<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nSo I don&#39;t love my children?<br/>\n<br/>\nI don&#39;t consider them mistakes, but *learning*-takes. My older son DID <br/>\nchoose to do drugs for a while and still has sex with his girlfriend. <br/>\nHe&#39;s way less harmed due to trust and respect than he would have been <br/>\nhad I forbidden or shamed him.<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181247364","msgId":24216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3OTc0Mi4yMTg4Ny5xbUB3ZWI1MzgwOS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGY0OWhhait0cXNyQGVHcm91cHMuY29tPg=="},"prevInTopic":24214,"nextInTopic":24225,"prevInTime":24215,"nextInTime":24217,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"My SIL was told that the boy was unhealthy for her, she was too young for a relationship (at fifteen) and what happened was they started sneaking around.","messageBody":"<div id=\"ygrps-yiv-1833532529\">My SIL was told that the boy was &#39;unhealthy&#39; for her, she was too young for a relationship (at fifteen) and what happened was they started sneaking around. Even when things got bad for HER, there was no way she was going to tell her parents it was out of control, because they had alienated her so much. Two years down the line, she was dead and he was gone. All of that could have been prevented with being able to talk to her parents, knowing that she had a safe retreat.<br/>\n   <br/>\n  ****<br/>\n  Oh, yeah, nothing makes a bad boy look better to a girl than having her parents tell her that he&#39;s wrong for her.  I heard that from my parents about my first dh -- and really about several other boyfriends before him.  It only made me determined to prove them wrong, because then they&#39;d have to admit I was right.  That was all I really wanted.  For someone to admit that maybe, just once, I was right in my choices.  A little validation for what mattered to me.  They felt they had to tell me he was wrong for me -- what, did they think I was stupid, too? In addition to being wrong, and confused, I was just plain too stupid to make my own choices?  <br/>\n   <br/>\n  Yep, telling your child their choice of partner is wrong is fighting words, guaranteed to push them so far away that when they need help (and they will) they won&#39;t ask you.  Sometimes, like I did, they ask for your help when it&#39;s already too big a mess, but I was the minority. Most of the girls I knew who screwed up their lives never asked their parents for help -- or worse, they did and the parents didn&#39;t step up to the plate.<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nNow that&#39;s room service! Choose from over 150,000 hotels <br/>\nin 45,000 destinations on Yahoo! Travel to find your fit.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198231842,"authorName":"Erica Iwamura","from":"&quot;Erica Iwamura&quot; &lt;hakujin777@...&gt;","profile":"hakujin777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181244391","msgId":24212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4NDUzMWZjMDcwNjA3MTIyNng2NjcyMWI0NG82NzkwMTI2ZmIxMWNiMmY1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24211,"nextInTopic":24214,"prevInTime":24211,"nextInTime":24213,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"So then you are saying if your parents don t allow you to date, then it is perfectly all right to plan with your boyfriend to kill them?? I don t think thats","messageBody":"<div id=\"ygrps-yiv-2140943765\">So then you are saying if your parents don&#39;t allow you to date, then it is<br/>\nperfectly all right to plan with your boyfriend to kill them??<br/>\n<br/>\nI don&#39;t think thats what Ren is saying at all.  I think its more of the<br/>\nissue of opening communication with our children at an early age and<br/>\nbuilding trust (in each other) so that they don&#39;t feel that they have to<br/>\nsneak around when they get older.  If the communication had been open at a<br/>\nyoung age she and her parents would have been able to have a reasonable and<br/>\nrespectful discussion about dating and she probably would have come to the<br/>\nconclusion on her own about whether she was ready to date ot not.  I know<br/>\nthat when I was 13 or 14 they had school dances and groups going to movies<br/>\nand such.  Its hard to be part of that when you&#39;re &quot;not allowed&quot; to be.  I<br/>\nhope that makes sense...<br/>\n<br/>\nErica<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/7/07, Lorrie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:iamhisservant4ever@...\">iamhisservant4ever@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   So then you are saying if your parents don&#39;t allow you to date, then it<br/>\n&gt; is perfectly all right to plan with your boyfriend to kill them??<br/>\n&gt; Do you really think that a girl just turning 14 should be having sex with<br/>\n&gt; a boy? You don&#39;t think that her parents were looking out for her, and cared<br/>\n&gt; about her, so they were restricitng her from seeing a boy too old for her?<br/>\n&gt; If your child isn&#39;t allowed to date at say 13 or 14 then you distrust them<br/>\n&gt; and disrespect them?? Are you kidding? Isn&#39;t it more like you are protecting<br/>\n&gt; them? &quot;Not allowed&quot; stuff is controlling and manipulative?? Are you saying<br/>\n&gt; that parents that have younger kids that are interested in say, trying<br/>\n&gt; drugs, having sex, and anything else that is harmful to them should be<br/>\n&gt; &quot;allowed&quot; to do these things no matter how old they are??<br/>\n&gt; That isn&#39;t being manipulative or controlling, that is being a caring<br/>\n&gt; parent. If a kids parents are &quot;allowing&quot; them to do these things then they<br/>\n&gt; should be reported to child welfare.<br/>\n&gt;<br/>\n&gt; Talking to your kids is great and I fully believe in that, but there are<br/>\n&gt; those kids that don&#39;t care and do what they want no matter what you try to<br/>\n&gt; teach them or talk with them about. So I am guessing in your opinion if your<br/>\n&gt; child does not want to listen to you then it is fine to do what they want no<br/>\n&gt; matter what it is.<br/>\n&gt;<br/>\n&gt; My kids were given alot of freedom, including freedom to make mistakes.<br/>\n&gt; Luckily, mine never desired to try drugs, or do anything that would end up<br/>\n&gt; harming them. That is not always the case in every home. If they did, I<br/>\n&gt; certainly would have stepped in and not stood there and watched them hurt<br/>\n&gt; themselves. That is NOT being controlling, it is being a parent that loves<br/>\n&gt; their children!<br/>\n&gt;<br/>\n&gt; ----- Original Message ----<br/>\n&gt; From: Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> &lt;starsuncloud%40comcast.net&gt;&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;<br/>\n&gt; Sent: Thursday, June 7, 2007 8:03:17 AM<br/>\n&gt; Subject: [unschoolingbasics] Re: Ren<br/>\n&gt;<br/>\n&gt; ~~I am also pretty sure that both parents did treat all of their kids<br/>\n&gt; with respect and as far as trust goes, she was told she could not date<br/>\n&gt; a boy that was that much older with her, and she was only 14 to begin<br/>\n&gt; with, and was not even allowed to be dating. ~~<br/>\n&gt;<br/>\n&gt; Hmmmm...what you described isn&#39;t trusting OR respectful.<br/>\n&gt; All that &quot;not allowed&quot; stuff is controlling and manipulative. No<br/>\n&gt; wonder she learned that behavior.<br/>\n&gt;<br/>\n&gt; It certainly doesn&#39;t explain murder, I&#39;m not trying to say that. But<br/>\n&gt; it&#39;s pretty obvious that she felt controlled to the degree that she<br/>\n&gt; wanted to get away from her parents.<br/>\n&gt;<br/>\n&gt; This list exists to talk about better ways to relate to our kids,<br/>\n&gt; rather than limiting and controlling.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; learninginfreedom. com<br/>\n&gt;<br/>\n&gt; __________________________________________________________<br/>\n&gt; Take the Internet to Go: Yahoo!Go puts the Internet in your pocket: mail,<br/>\n&gt; news, photos & more.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/go?refer=1GNXIC\">http://mobile.yahoo.com/go?refer=1GNXIC</a><br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nThey say I&#39;m Crazy but I Have a Good Time - Joe Walsh<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181244028","msgId":24211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcwNjA3MTIyMHMzZTYxOWY2Mm00NDBlNTNkODgwMmQ4ZmJmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24210,"nextInTopic":24212,"prevInTime":24210,"nextInTime":24212,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... I cannot imagine a 14 year old, told no for the first time with great understanding, would do such a thing. Oh, but wait, we re NOT talking about a child","messageBody":"<div id=\"ygrps-yiv-1146756345\">On 6/7/07, Lorrie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:iamhisservant4ever@...\">iamhisservant4ever@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;   So then you are saying if your parents don&#39;t allow you to date, then it<br/>\n&gt; is perfectly all right to plan with your boyfriend to kill them??<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I cannot imagine a 14 year old, told no for the first time with great<br/>\nunderstanding, would do such a thing. Oh, but wait, we&#39;re NOT talking about<br/>\na child who has been honored and respected for her first 14 years. NOT a<br/>\nchild who has an open, loving, non-judgmental relationship with her parents.<br/>\nThis seems to me to be the actions of a girl who is just plain fed up with<br/>\narbitrary limits imposed upon her by her parents, from whom she&#39;s separated<br/>\nherself long ago. 14 year olds who are honored, loved and respected, who are<br/>\nattached to their parents (and vice-versa) don&#39;t do this. I swear! I&#39;ve met<br/>\nmany, many unschooled teens and not a single homicidal maniac/conspirator in<br/>\nthe bunch. I&#39;ve heard a few grumble, though, against occasional<br/>\narbitrariness of parents. Not to the homicidal level, as this kind of<br/>\n*spirit squelching* doesn&#39;t regularly occur with unschoolers.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you really think that a girl just turning 14 should be having sex with<br/>\n&gt; a boy? You don&#39;t think that her parents were looking out for her, and cared<br/>\n&gt; about her, so they were restricitng her from seeing a boy too old for her?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Sex as a forbidden fruit. Ick! Is she having sex only to piss off her<br/>\nparents or because she really wants to express her love in a physical way?<br/>\nShe might answer B when the answer is really A. Of the teens I knew growing<br/>\nup, the ones who got pregnant didn&#39;t do so out of desire to procreate, it<br/>\nwas a desire to get back or get away from their arbitrarily controlling<br/>\nparents. The girl who was never allowed to talk to boys was the first and<br/>\nyoungest of our group to become active and pregnant.<br/>\nAgain, though, remember we&#39;re NOT talking about a child who was mindfully<br/>\nparented, let alone unschooled. Unschooling creates a totally different<br/>\nrelationship.<br/>\nOf the unschooling kids I&#39;ve talked Sex with (again, a big number), most<br/>\nhave had the regular mechanical questions, some safety concerns, and the<br/>\nvery best conversation I ever had was with an 18 year old who was/is<br/>\ncommitted to being a sweet, considerate, pleasuring lover of his girlfriend,<br/>\nwhom he is madly in love with. I&#39;ve yet to meet a one who is participating<br/>\nin sexual behaviours out of a lack of self-worth or lack of available<br/>\nlove/connections at home.<br/>\n-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If your child isn&#39;t allowed to date at say 13 or 14 then you distrust them<br/>\n&gt; and disrespect them?? Are you kidding? Isn&#39;t it more like you are protecting<br/>\n&gt; them? &quot;Not allowed&quot; stuff is controlling and manipulative?? Are you saying<br/>\n&gt; that parents that have younger kids that are interested in say, trying<br/>\n&gt; drugs, having sex, and anything else that is harmful to them should be<br/>\n&gt; &quot;allowed&quot; to do these things no matter how old they are??<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>These topics should certainly be addressed LONG before the kids are<br/>\ninterested in participating.  We talk about sex on a regular basis, it&#39;s<br/>\njust one of those topics that comes up organically and is spoken about in a<br/>\nvery matter-of-fact way. I really feel it&#39;s a natural part of life as a<br/>\nhuman being.<br/>\nDrugs? I love the book *From Chocolate to Morphine: Everything You Need to<br/>\nKnow About Mind-Altering Drugs* and I address the topic of Drugs with this<br/>\nperspective, even pointing out the hypocrisies of drug use in our society<br/>\n(Drug Free schools sponsored by Pepsi, AA meetings where *sober* folk ingest<br/>\nnicotine, caffeine and sugar wantonly). I also like the perspective of Ain&#39;t<br/>\nNobody&#39;s Business if You Do, as it relates to the insanity of consensual<br/>\ncrimes in America. Talked about with/around my kids a lot.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That isn&#39;t being manipulative or controlling, that is being a caring<br/>\n&gt; parent. If a kids parents are &quot;allowing&quot; them to do these things then they<br/>\n&gt; should be reported to child welfare.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Restricting your child&#39;s actions based on your own fears is Manipulative and<br/>\nControlling.  It&#39;s not respectful nor honoring of the human being before<br/>\nyou. Smash a marshmallow with your thumb. How much of it actually stays<br/>\nthere?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Talking to your kids is great and I fully believe in that, but there are<br/>\n&gt; those kids that don&#39;t care and do what they want no matter what you try to<br/>\n&gt; teach them or talk with them about. So I am guessing in your opinion if your<br/>\n&gt; child does not want to listen to you then it is fine to do what they want no<br/>\n&gt; matter what it is.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I have yet to meet even one unschooled kid who behaves/feels this way, and<br/>\nI&#39;ve met many. Have you?<br/>\nIt&#39;s really cool when an unschooled teen comes to me for advice (on Sex,<br/>\nDrugs, Parents, you name it) I know they&#39;re not asking me because they can&#39;t<br/>\nask their moms, they&#39;re asking because they want *my* opinion to add to<br/>\ntheir repertoire, as another trusted adult. Not THE trusted adult.<br/>\n<br/>\nSometimes my own son doesn&#39;t want to hear what I have to say. Usually<br/>\nbecause he&#39;s plumb tired of hearing me say it the same way too many times.<br/>\nThat issue lies within ME, not him. Taking a deep breath, empathizing with<br/>\nhim, asking questions to figger out exactly what he&#39;s looking for - those<br/>\nare what help foster our communications. Thinking *Fine!* and working myself<br/>\ninto a frothing huff is not serving either of us, nor is it helping our<br/>\nrelationship.<br/>\n<br/>\nAnd yeah, if your kid is gonna *do it anyway* it&#39;s certainly better to have<br/>\na parent (or two) on their side, to address safety (emotional and physical)<br/>\nand comfort and ensure communication.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My kids were given alot of freedom, including freedom to make mistakes.<br/>\n&gt; Luckily, mine never desired to try drugs, or do anything that would end up<br/>\n&gt; harming them. That is not always the case in every home. If they did, I<br/>\n&gt; certainly would have stepped in and not stood there and watched them hurt<br/>\n&gt; themselves. That is NOT being controlling, it is being a parent that loves<br/>\n&gt; their children!<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>So, you&#39;re saying that if I see Hayden jump precariously close to the edge<br/>\nof the trampoline, I should remove him and order him to stay off of it? It<br/>\nworked out just fine for us that he bumped his shin (his great story of how<br/>\nhe *broke his leg* at age 4), he was welcomed and comforted by his watching<br/>\nmama, he then took another &quot;deep breath of courage&quot; and got back on the<br/>\ntramp. And has been happily jumping ever since.<br/>\n<br/>\nWhen folks are paranoid about drugs and sex with their kids, I always worry<br/>\nthey&#39;re gonna lie to the kids and erode an imperative Trust between parents<br/>\nand spawn.<br/>\nCocaine kills! Til the first time the kid tries it and doesn&#39;t die. Then<br/>\nwhat? They (the parents) must have lied about everything else! Sex kills!<br/>\nTil the first time the kid does it and doesn&#39;t die. Honest, judgment free<br/>\nconversations are the best birth control I&#39;ve ever known.<br/>\n<br/>\nThere are lots of things I don&#39;t want to be in this world - Liar tops that<br/>\nlist. Hypocrite being a close second.<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181243861","msgId":24210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzOTg2NC4yNDIwOC5xbUB3ZWI1MzgxMC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24206,"nextInTopic":24211,"prevInTime":24209,"nextInTime":24211,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"Talking to your kids is great and I fully believe in that, but there are those kids that don t care and do what they want no matter what you try to teach them","messageBody":"<div id=\"ygrps-yiv-1789788339\">Talking to your kids is great and I fully believe in that, but there are those kids that don&#39;t care and do what they want no matter what you try to teach them or talk with them about. So I am guessing in your opinion if your child does not want to listen to you then it is fine to do what they want no matter what it is.<br/>\n  My kids were given alot of freedom, including freedom to make mistakes. Luckily, mine never desired to try drugs, or do anything that would end up harming them. That is not always the case in every home. If they did, I certainly would have stepped in and not stood there and watched them hurt themselves. That is NOT being controlling, it is being a parent that loves their children!<br/>\n<br/>\n<br/>\n  ****<br/>\n  Those kids who &#39;do what they want&#39; no matter what you try to teach them -- first, why would they want to do things that are harmful to them?  What unmet need do they have?  When a kid doesn&#39;t care about their own safety, and doesn&#39;t listen to his parents&#39; concerns, that&#39;s a kid who doesn&#39;t feel his parents understand him, where he is right in that moment.  <br/>\n   <br/>\n  My oldest did any number of things that I tried to forbid.  He did them anyway, because he was trying on new things, or because he felt frustrated and thwarted, like he needed more control over his own life.  Looking back, he was right.  I didn&#39;t understand what he was all about, and I was too intent on protecting him from his genetic risks, from turning out like my brother, or my ex (ds&#39; bio-dad), or every other jerk guy I ever knew.  Not that he was really a bad kid, but I let my own past and fears get the best of me.  I panicked, and let others tell me what I &#39;had to&#39; do about him.  <br/>\n   <br/>\n  Then, (when Will was 16, and I had my hands full with a 4yo and a newborn) the school called me to ask when he&#39;d be coming back -- he&#39;d skipped the last two weeks.  While I was driving him to school, he was literally walking out the back door. I tracked him down at a friends house, found him high as a kite and brought him home.  That got my attention -- I&#39;d let him down.  I didn&#39;t know what to do next, but something had to be done to help my son.  I talked to my Mom, the schools, my dh, and a few &#39;experts&#39; -- then I had an epiphany!  I talked to my son.  That sweet boy I knew was in there somewhere -- what did he want?  He hated school, he was sad and discouraged, and frustrated and thought he was stupid.  Stupid?!  <br/>\n   <br/>\n  Control wasn&#39;t the answer -- giving him autonomy was.  We pulled him out of school, which led to not sending the younger two boys to school at all.  Helping Will -- and ourselves -- wasn&#39;t quick or easy, it wasn&#39;t all progress all the time.  He left home twice, once for 3 wks until Dan had a health crisis and Will came home to be with his baby brother; again when he was 18, for just over 2 yrs.  Now, he&#39;s out on his own.  Still, he makes choices that worry me, but it&#39;s his life, not mine.  This is his path -- I spent enough time when he was younger getting in his way, as I worked thru my own past.  He&#39;ll do whatever he feels he &#39;needs&#39; to do, and he may or may not consult me.  He&#39;ll make some poor choices, and have some painful moments, then he&#39;ll pick himself up and figure out what to do next.  <br/>\n   <br/>\n  I&#39;m pretty sure that if we&#39;d tried to control him, it would have only been uglier, and more expensive, and more painful for everyone.  How do I know this?  Because that&#39;s how he was born -- others tried to control me, to tell me what I couldn&#39;t do, who I couldn&#39;t be, who I shouldn&#39;t marry, why I shouldn&#39;t have a child.  Did I listen to them?  No-o-o, because I knew better -- okay maybe not better, but I wasn&#39;t about to let them know that.  I wasn&#39;t about to let them control me for another minute of my life.  I&#39;d show them!  And by 22 my life was a huge mess -- drugs, abusive husband, baby on the way.  Suddenly, it was time to grow up, and the last people I wanted any help from was my parents. <br/>\n   <br/>\n  And, for the record, -- people (kids included) make mistakes all the time, whether not you give them permission to do so. &lt;g&gt;<br/>\n   <br/>\n  Sylvia<br/>\n  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nDon&#39;t be flakey. Get Yahoo! Mail for Mobile and <br/>\nalways stay connected to friends.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Ren","postDate":"1181243458","msgId":24214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEOUI1MUYwLUVFNEYtNDYxNy05RkZFLTZBN0YwRDNEMUMyQ0BkaWVyYXVlci5uZXQ+","inReplyToHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24212,"nextInTopic":24216,"prevInTime":24213,"nextInTime":24215,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... I don t think parents suddenly start forbidding dating following 13 years of otherwise being completely respectful and trusting. I don t think teenage","messageBody":"<div id=\"ygrps-yiv-378349012\">On Jun 7, 2007, at 9:41 AM, Lorrie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So then you are saying if your parents don&#39;t allow you to date,  <br/>\n&gt; then it is perfectly all right to plan with your boyfriend to kill  <br/>\n&gt; them??<br/>\n&gt; Do you really think that a girl just turning 14 should be having  <br/>\n&gt; sex with a boy? You don&#39;t think that her parents were looking out  <br/>\n&gt; for her, and cared about her, so they were restricitng her from  <br/>\n&gt; seeing a boy too old for her?<br/>\n<br/>\n </span></blockquote>I don&#39;t think parents suddenly start forbidding dating following 13  <br/>\nyears of otherwise being completely respectful and trusting. I don&#39;t  <br/>\nthink teenage girls sneak around on their parents if they&#39;ve learned  <br/>\nto trust their parents and their parents&#39; judgement.<br/>\n<br/>\nI started to reply to an earlier post on this topic and then decided  <br/>\nit wasn&#39;t relevant, but now I think maybe it is. When I hear about  <br/>\ngirls in relationships with abusive or dangerous boys, who might need  <br/>\nhelp from parents but don&#39;t ask for it, who keep sneaking around to  <br/>\nsee the boy even if they&#39;re feeling scared or troubled about it, I  <br/>\nthink about how my parents treated me with regard to food.<br/>\n<br/>\nMy parents loved to put me into situations from which I could not  <br/>\nescape in any kind of face-saving way. I was cautious about trying  <br/>\nnew foods, and they ridiculed me for it. If I hesitated to try a new  <br/>\nfood, they harassed and shamed me. If I eventually tried it and  <br/>\ndidn&#39;t care for it, they thought I was faking and made me eat it  <br/>\nanyway. If I eventually tried it and liked it, they lectured me on  <br/>\nhow stupid I had been to think I wouldn&#39;t like it and used it as an  <br/>\nexample of how they knew better than me and I should listen to them.  <br/>\nFaced with a new food, I was trapped--there was absolutely no way out  <br/>\nfor me without being shamed, lectured, and humiliated.<br/>\n<br/>\nOnce when I was the passenger in a bad car accident, I walked through  <br/>\nthe door of my house hoping for a &quot;thank god you&#39;re OK&quot; and instead  <br/>\ngot a lecture about my failings, because I was the one who had taught  <br/>\nthe driver of the car that rolled over how to drive a stick shift!  <br/>\nWay to build the trust, mom and dad!<br/>\n<br/>\nMy father was so unable to put himself into anyone else&#39;s shoes that  <br/>\nwhen I was sixteen and had long, thick hair, he could not imagine why  <br/>\nI would need to use more shampoo than he did--him, the guy who was  <br/>\nalready bald in his wedding pictures at age 24. He showed me in the  <br/>\npalm of his hand how much shampoo he used, and said that was how much  <br/>\nI was allowed to use. Mr. Sensitive.<br/>\n<br/>\nI don&#39;t want to just crank on my parents--I&#39;ve mostly worked through  <br/>\nit for myself. But I want to show examples of how parents who would  <br/>\neasily have been described as good parents by outsiders were actually  <br/>\nunsympathetic, controlling, and judgmental. Parents who get to, &quot;You  <br/>\nabsolutely cannot go on a date!&quot; usually start with, &quot;Eat the green  <br/>\nbeans you don&#39;t want because they&#39;re good for you and because I say  <br/>\nso,&quot; and they see themselves the whole time as protecting and caring  <br/>\nfor their kids.<br/>\n<br/>\nSuppose I&#39;d gotten involved with, say, a drug-using abuser (I did  <br/>\nhave a &quot;bad boy&quot; thing for awhile there, so it could easily have  <br/>\nhappened, if only the bad boys had liked me back). Could I have ever  <br/>\ngone to my parents for help resolving that relationship? For  <br/>\nprotection if I felt unsafe? Not likely. Heck, they criticized all my  <br/>\nfriends and boyfriends, and I hung out with non-drinking, non-drug- <br/>\nusing, honor student virgins all the way through high school. There&#39;s  <br/>\nno way I&#39;d have gone to my mother with a relationship crisis.<br/>\n<br/>\nI will concede that controlling parents can be entirely well- <br/>\nintentioned. But they are not building trust; they are not  <br/>\ncommunicating respect; they are not being people their children can  <br/>\nrespect and whose judgment their children trust.<br/>\n<br/>\nI don&#39;t know about this specific family. But I see patterns. I hope  <br/>\nto build a relationship with my kids, who are still young children,  <br/>\nthat will allow me to say, &quot;I&#39;m concerned about your boyfriend&#39;s  <br/>\nbehavior,&quot; and that will allow them to hear that without  <br/>\ndefensiveness. I hope they&#39;ll be able to make their own decisions,  <br/>\nand trust that my non-judgmental support is there when they make  <br/>\nmistakes--not a big &quot;I told you so,&quot; but a safe place they can always  <br/>\ncome to.<br/>\n<br/>\nSu</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ren","postDate":"1181239443","msgId":24201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0OWhhait0cXNyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0OHM2NStibXM0QGVHcm91cHMuY29tPg=="},"prevInTopic":24198,"nextInTopic":24206,"prevInTime":24200,"nextInTime":24202,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"Ren, we saw similar things happen in my in-laws family. My SIL was told that the boy was unhealthy for her, she was too young for a relationship (at fifteen)","messageBody":"<div id=\"ygrps-yiv-244260749\">Ren, <br/>\nwe saw similar things happen in my in-laws family. My SIL was told that the boy was <br/>\n&#39;unhealthy&#39; for her, she was too young for a relationship (at fifteen) and what happened <br/>\nwas they started sneaking around. Even when things got bad for HER, there was no way <br/>\nshe was going to tell her parents it was out of control, because they had alienated her so <br/>\nmuch. Two years down the line, she was dead and he was gone. All of that could have <br/>\nbeen prevented with being able to talk to her parents, knowing that she had a safe retreat.<br/>\n<br/>\nSadly enough the same thing is happening with the next younger SIL (19 yo), she started <br/>\ndating a guy no one approved of, and the family has completely alienated her again. The <br/>\nguy has been abusive, he&#39;s been in jail for beating up previous girlfriends and his dad. She <br/>\nsees his musical sensitive side, and knowing his family, I KNOW where the rage comes <br/>\nfrom. Now that they are married, I&#39;m sure she&#39;s not going to come back to her family for <br/>\nsupport. i only hope that they both felt accepted enough in *our* home to ask us for any <br/>\nthing they need (whether together or apart)<br/>\n<br/>\nSheesh. What horrible lessons to have to learn. But it has helped us with our own children<br/>\nMelissa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; &lt;starsuncloud@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ~~I am also pretty sure that both parents did treat all of their kids<br/>\n&gt; with respect and as far as trust goes, she was told she could not date<br/>\n&gt; a boy that was that much older with her, and she was only 14 to begin<br/>\n&gt; with, and was not even allowed to be dating. ~~<br/>\n&gt; <br/>\n&gt; Hmmmm...what you described isn&#39;t trusting OR respectful.<br/>\n&gt; All that &quot;not allowed&quot; stuff is controlling and manipulative. No<br/>\n&gt; wonder she learned that behavior.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269152394,"authorName":"Lorrie","from":"Lorrie &lt;iamhisservant4ever@...&gt;","profile":"iamhisservant4ever","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Ren","postDate":"1181223679","msgId":24206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3MjM1Ny4xOTE1Ni5xbUB3ZWIzODUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24201,"nextInTopic":24210,"prevInTime":24205,"nextInTime":24207,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"So then you are saying if your parents don t allow you to date, then it is perfectly all right to plan with your boyfriend to kill them?? Do you really think","messageBody":"<div id=\"ygrps-yiv-514555347\">So then you are saying if your parents don&#39;t allow you to date, then it is perfectly all right to plan with your boyfriend to kill them??<br/>\nDo you really think that a girl just turning 14 should be having sex with a boy? You don&#39;t think that her parents were looking out for her, and cared about her, so they were restricitng her from seeing a boy too old for her?<br/>\nIf your child isn&#39;t allowed to date at say 13 or 14 then you distrust them and disrespect them?? Are you kidding? Isn&#39;t it more like you are protecting them? &quot;Not allowed&quot; stuff is controlling and manipulative??  Are you saying that parents that have younger kids that are interested in say, trying drugs, having sex, and anything else that is harmful to them should be &quot;allowed&quot; to do these things no matter how old they are??<br/>\nThat isn&#39;t being manipulative or controlling, that is being a caring parent. If a kids parents are &quot;allowing&quot; them to do these things then they should be reported to child welfare.<br/>\n <br/>\nTalking to your kids is great and I fully believe in that, but there are those kids that don&#39;t care and do what they want no matter what you try to teach them or talk with them about. So I am guessing in your opinion if your child does not want to listen to you then it is fine to do what they want no matter what it is.<br/>\n <br/>\nMy kids were given alot of freedom, including freedom to make mistakes. Luckily, mine never desired to try drugs, or do anything that would end up harming them. That is not always the case in every home. If they did, I certainly would have stepped in and not stood there and watched them hurt themselves. That is NOT being controlling, it is being a parent that loves their children!<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thursday, June 7, 2007 8:03:17 AM<br/>\nSubject: [unschoolingbasics] Re: Ren<br/>\n<br/>\n~~I am also pretty sure that both parents did treat all of their kids<br/>\nwith respect and as far as trust goes, she was told she could not date<br/>\na boy that was that much older with her, and she was only 14 to begin<br/>\nwith, and was not even allowed to be dating. ~~<br/>\n<br/>\nHmmmm...what you described isn&#39;t trusting OR respectful.<br/>\nAll that &quot;not allowed&quot; stuff is controlling and manipulative. No<br/>\nwonder she learned that behavior.<br/>\n<br/>\nIt certainly doesn&#39;t explain murder, I&#39;m not trying to say that. But<br/>\nit&#39;s pretty obvious that she felt controlled to the degree that she<br/>\nwanted to get away from her parents. <br/>\n<br/>\nThis list exists to talk about better ways to relate to our kids,<br/>\nrather than limiting and controlling.<br/>\n<br/>\nRen<br/>\nlearninginfreedom. com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n____________________________________________________________________________________<br/>\nTake the Internet to Go: Yahoo!Go puts the Internet in your pocket: mail, news, photos & more. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/go?refer=1GNXIC\">http://mobile.yahoo.com/go?refer=1GNXIC</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ren","postDate":"1181217797","msgId":24198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0OHM2NStibXM0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgzODg1NC43MDU4MS5xbUB3ZWIzODUwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24194,"nextInTopic":24201,"prevInTime":24197,"nextInTime":24199,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"~~I am also pretty sure that both parents did treat all of their kids with respect and as far as trust goes, she was told she could not date a boy that was","messageBody":"<div id=\"ygrps-yiv-205863710\">~~I am also pretty sure that both parents did treat all of their kids<br/>\nwith respect and as far as trust goes, she was told she could not date<br/>\na boy that was that much older with her, and she was only 14 to begin<br/>\nwith, and was not even allowed to be dating. ~~<br/>\n<br/>\nHmmmm...what you described isn&#39;t trusting OR respectful.<br/>\nAll that &quot;not allowed&quot; stuff is controlling and manipulative. No<br/>\nwonder she learned that behavior.<br/>\n<br/>\nIt certainly doesn&#39;t explain murder, I&#39;m not trying to say that. But<br/>\nit&#39;s pretty obvious that she felt controlled to the degree that she<br/>\nwanted to get away from her parents. <br/>\n<br/>\nThis list exists to talk about better ways to relate to our kids,<br/>\nrather than limiting and controlling.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":269152394,"authorName":"Lorrie","from":"Lorrie &lt;iamhisservant4ever@...&gt;","profile":"iamhisservant4ever","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Ren","postDate":"1181182724","msgId":24194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzODg1NC43MDU4MS5xbUB3ZWIzODUwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":13448,"nextInTopic":24198,"prevInTime":24193,"nextInTime":24195,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"I actually knew this girl s family and her Mom was not at all controlling. Both girls were always allowed to have parties and were also allowed to go just","messageBody":"<div id=\"ygrps-yiv-473295736\">I actually knew this girl&#39;s family and her Mom was not at all controlling. Both girls were always allowed to have parties and were also allowed to go just about anywhere they wanted to go. Their Mom was a sweet, kind woman, and probably the nicest woman I met here, that was in the homeschool circle. Of course she wasn&#39;t from here originally, which I am sure is why she was so friendly.<br/>\n <br/>\nI am also pretty sure that both parents did treat all of their kids with respect and as far as trust goes, she was told she could not date a boy that was that much older with her, and she was only 14 to begin with, and was not even allowed to be dating. From what I know, she had many &quot;secret&quot; boyfriends before David came along. I am sure that they did trust her, but in the end she wanted her way and had the boy sneaking up into her room so she could have sex with him while her family slept in nearby rooms.  <br/>\n <br/>\nI do believe that overly controlling kids can damage them mentally, but as far as I could see and anyone else who knew them, that was never the case. Now what went on on in David Ludwig&#39;s home, I have no idea. I had never met that family and they were never involved in anything that we were.<br/>\nMental abuse can happen in any family homeschooled or not.<br/>\n <br/>\nlorrie<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, June 6, 2007 5:01:39 PM<br/>\nSubject: [unschoolingbasics] Re: interesting article needs some attention lol<br/>\n<br/>\n<br/>\n~~Believe me homeschooling had nothing to do with it. The young girl<br/>\ninvolved was a sneak and a liar. My daughter was friends with her for<br/>\na short time until I could see that she was manipulative and sneaky. ~~<br/>\n<br/>\nManipulation and sneakiness are learned by being overly controlled.<br/>\n<br/>\n~~She had snuck this boy into her room right behind her families back,<br/>\nwhile they were asleep, on more then one occasion. Did she learn this<br/>\nfrom homeschooling? ~~<br/>\n<br/>\nMaybe if her parents had treated her with trust and respect from the<br/>\nbeginning, she wouldn&#39;t have had to sneak anything.<br/>\n<br/>\n~~It doesn&#39;t matter where you live or if kids are homeschooled,<br/>\nunschooled, public, private, whatever. The method of teaching has<br/>\nnothing to do with how a kid turns out mentally.~~<br/>\n<br/>\nWhile I agree that tragedy can strike anyone, I don&#39;t believe that<br/>\nmethod of schooling has no effect on mental health. If that were true,<br/>\nthen unschooling wouldn&#39;t be my best option. But it is. And I don&#39;t<br/>\nhave teens that are sneaky, and I don&#39;t have kids trying to manipulate<br/>\nanyone.<br/>\n<br/>\nMethod of teaching can greatly affect mental health. I&#39;ve been witness<br/>\nto it countless times. The damage produced by overly controlling<br/>\nparents and schooling isn&#39;t as apparent in some kids, but it&#39;s still<br/>\ndamaging them.<br/>\n<br/>\nUnschooling isn&#39;t a teaching method. It isn&#39;t a schooling method.<br/>\nUnschooling is saying that there is no need for a method of any<br/>\nkind...that humans learn just fine without any of that bullcrap.<br/>\n<br/>\nRen<br/>\nlearninginfreedom. com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n____________________________________________________________________________________<br/>\nGot a little couch potato? <br/>\nCheck out fun summer activities for kids.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://search.yahoo.com/search?fr=oni_on_mail&p=summer+activities+for+kids&cs=bz\">http://search.yahoo.com/search?fr=oni_on_mail&p=summer+activities+for+kids&cs=bz</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":201330991,"authorName":"Queana","from":"&quot;Queana&quot; &lt;queana7@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Ren","postDate":"1148098781","msgId":13448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGU0ZjdoMStkZTE2QGVHcm91cHMuY29tPg=="},"prevInTopic":13358,"nextInTopic":24194,"prevInTime":13447,"nextInTime":13449,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"Please do!  That would be great!  Unfortunately, I m in California, so I couldn t get it myself :) ~Q~ aka Sarah http://www.unbridledlearning.com ... From:","messageBody":"<div id=\"ygrps-yiv-1385702781\">Please do!  That would be great!  Unfortunately, I&#39;m in California, so I<br/>\ncouldn&#39;t get it myself :)<br/>\n<br/>\n~Q~<br/>\naka Sarah<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unbridledlearning.com\">http://www.unbridledlearning.com</a><br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Ren Allen<br/>\nSent: Wednesday, May 17, 2006 6:13 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Ren<br/>\n<br/>\n&quot; But, IL law you dont have to register with the school.  You actually<br/>\ndont  have to do anything in IL.  For future reference. &quot;<br/>\n<br/>\nOoooh...good thing I said &quot;I BELIEVE your state is like that......&quot; <br/>\nand he agreed as though he knew!! HA!:)<br/>\nI really don&#39;t like answering law questions. Tried to skirt it with<br/>\nthe whole thing about everyone needing to research their own state.<br/>\n<br/>\nPhew. Glad it&#39;s over with. And thank you SO much for recording it.<br/>\nMaybe we could get it to Queanna for a podcast? I&#39;d love to have it<br/>\narchived somewhere for reference.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.392 / Virus Database: 268.6.1/343 - Release Date: 5/18/2006<br/>\n <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.392 / Virus Database: 268.6.1/343 - Release Date: 5/18/2006</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Ren","postDate":"1147914838","msgId":13358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVY3Q0MzQUFDQUNERUE1MjJFNTM2NkJEM0E2MEBwaHguZ2JsPg==","referencesHeader":"PDMwMS41M2M0YTI0LjMxOWQxZDZlQGFvbC5jb20+"},"prevInTopic":13355,"nextInTopic":13448,"prevInTime":13357,"nextInTime":13359,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"I didn t catch it... I tried to see if we had an affiliate down here in\ncentral IL but I could find one and I didn t see a live stream (which in\nthis day and","messageBody":"<div id=\"ygrps-yiv-1409450092\">I didn&#39;t catch it... I tried to see if we had an affiliate down here in<br/>\ncentral IL but I could find one and I didn&#39;t see a live stream (which in<br/>\nthis day and age is really lame not to have one) at the website. \r<br/>\n\r<br/>\n \r<br/>\n~*~*~\r<br/>\nLesa\r<br/>\nLIFE Academy\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeacademy.homeschooljournal.net\">http://lifeacademy.homeschooljournal.net</a>\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://qtpiecraftsandthings.etsy.com\">http://qtpiecraftsandthings.etsy.com</a>\r<br/>\n\r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\n Did  you catch the show?\r<br/>\n\r<br/>\n~Alyssa \r<br/>\nSlightly crunchy, non-vaxing, unschooling Mom to  Landen(2 1/2) and Gage(7 \r<br/>\nmonths)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195223619,"authorName":"SquishyMommy1@aol.com","from":"SquishyMommy1@...","profile":"steveshotwife2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Ren","postDate":"1147913070","msgId":13355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwMS41M2M0YTI0LjMxOWQxZDZlQGFvbC5jb20+"},"prevInTopic":13354,"nextInTopic":13358,"prevInTime":13354,"nextInTime":13356,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/2006 7:43:29 P.M. Central Daylight Time, lesajm@hotmail.com writes: yeah for  IL law!!!!  woohoo!!!!  I thank God I live in  IL... OMG","messageBody":"<div id=\"ygrps-yiv-108475693\">In a message dated 5/17/2006 7:43:29 P.M. Central Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lesajm@...\">lesajm@...</a> writes:<br/>\n<br/>\nyeah for  IL law!!!!  woohoo!!!!  I thank God I live in  IL...<br/>\n<br/>\n<br/>\nOMG ME TO.  I always hope it stays this way.  Did  you catch the show?<br/>\n <br/>\n~Alyssa <br/>\nSlightly crunchy, non-vaxing, unschooling Mom to  Landen(2 1/2) and Gage(7 <br/>\nmonths)<br/>\n<br/>\n&quot;Work like you don&#39;t need the money,  love like you&#39;ve never been hurt, and <br/>\ndance like you do when nobody&#39;s  watching.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Ren","postDate":"1147912929","msgId":13354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVY5MEI1RjBBRTczNDdGRUNFQzVGNDBEM0E2MEBwaHguZ2JsPg==","referencesHeader":"PGU0ZjdoMStkZTE2QGVHcm91cHMuY29tPg=="},"prevInTopic":13353,"nextInTopic":13355,"prevInTime":13353,"nextInTime":13355,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"... Maybe we could get it to Queanna for a podcast? I d love to have it archived somewhere for reference.","messageBody":"<div id=\"ygrps-yiv-1226497877\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Phew. Glad it&#39;s over with. And thank you SO much for recording it.\r<br/>\n </span></blockquote>Maybe we could get it to Queanna for a podcast? I&#39;d love to have it\r<br/>\narchived somewhere for reference.&lt;&lt;&lt;\r<br/>\n\r<br/>\nI&#39;d love to hear it!  I hope you can do that.\r<br/>\n \r<br/>\n~*~*~\r<br/>\nLesa\r<br/>\nLIFE Academy\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeacademy.homeschooljournal.net\">http://lifeacademy.homeschooljournal.net</a>\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://qtpiecraftsandthings.etsy.com\">http://qtpiecraftsandthings.etsy.com</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Ren","postDate":"1147912857","msgId":13353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYxMTFEOEVGRDg2Mjc3Q0I1OTlENjExRDNBNjBAcGh4LmdibD4=","referencesHeader":"PDQ1Ni45MWZlMmUuMzE5Yzc4MjVAYW9sLmNvbT4="},"prevInTopic":13329,"nextInTopic":13354,"prevInTime":13352,"nextInTime":13354,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"yeah for IL law!!!!  woohoo!!!!  I thank God I live in IL... ~*~*~ Lesa LIFE Academy http://lifeacademy.homeschooljournal.net ","messageBody":"<div id=\"ygrps-yiv-1820127670\">yeah for IL law!!!!  woohoo!!!!  I thank God I live in IL...\r<br/>\n \r<br/>\n \r<br/>\n~*~*~\r<br/>\nLesa\r<br/>\nLIFE Academy\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeacademy.homeschooljournal.net\">http://lifeacademy.homeschooljournal.net</a>\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://qtpiecraftsandthings.etsy.com\">http://qtpiecraftsandthings.etsy.com</a>\r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SquishyMommy1@...\">SquishyMommy1@...</a>\r<br/>\nDate: 05/17/06 08:01:00\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: [unschoolingbasics] Ren\r<br/>\n \r<br/>\nGreat job this morning.  I got it all recorded for you.   But, IL law you \r<br/>\ndont have to register with the school.  You actually dont  have to do<br/>\nanything in \r<br/>\nIL.  For future reference.  But great job i  enjoyed listening.\r<br/>\n\r<br/>\n~Alyssa \r<br/>\nSlightly crunchy, non-vaxing, unschooling Mom to  Landen(2 1/2) and Gage(7 \r<br/>\nmonths)\r<br/>\n\r<br/>\n&quot;Work like you don&#39;t need the money,  love like you&#39;ve never been hurt, and \r<br/>\ndance like you do when nobody&#39;s  watching.&quot;\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n[Non-text portions of this message have been removed]\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nYAHOO! GROUPS LINKS \r<br/>\n\r<br/>\n Visit your group &quot;unschoolingbasics&quot; on the web.\r<br/>\n  \r<br/>\n To unsubscribe from this group, send an email to:\r<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>\r<br/>\n  \r<br/>\n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195223619,"authorName":"SquishyMommy1@aol.com","from":"SquishyMommy1@...","profile":"steveshotwife2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Ren","postDate":"1147871926","msgId":13329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1NC45MjdhYTMuMzE5YzdjYjZAYW9sLmNvbT4="},"prevInTopic":13328,"nextInTopic":13353,"prevInTime":13328,"nextInTime":13330,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/2006 8:14:11 A.M. Central Daylight Time, starsuncloud@comcast.net writes:  But,  IL law you dont have to register with the school.","messageBody":"<div id=\"ygrps-yiv-358958623\">In a message dated 5/17/2006 8:14:11 A.M. Central Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\n&quot; But,  IL law you dont have to register with the school.  You  actually<br/>\ndont  have to do anything in IL.  For future reference.  &quot;<br/>\n<br/>\nOoooh...good thing I said &quot;I BELIEVE your state is like that......&quot;  <br/>\nand he agreed as though he knew!! HA!:)<br/>\nI really don&#39;t like answering  law questions. Tried to skirt it with<br/>\nthe whole thing about everyone  needing to research their own state.<br/>\n<br/>\nPhew. Glad it&#39;s over with. And  thank you SO much for recording it.<br/>\nMaybe we could get it to Queanna for a  podcast? I&#39;d love to have it<br/>\narchived somewhere for  reference.<br/>\n<br/>\n<br/>\nSure whatever you want.  I have it on it&#39;s own tape so i  can send it to you, <br/>\n or Queanna whatever just let me know and give me a  address. But it was <br/>\ngreat.   Loved the throw in for Sandra&#39;s page that  was awsome. LOL  great job <br/>\nagain.  It came of very very  well.<br/>\n <br/>\n~Alyssa <br/>\nSlightly crunchy, non-vaxing, unschooling Mom to  Landen(2 1/2) and Gage(7 <br/>\nmonths)<br/>\n<br/>\n&quot;Work like you don&#39;t need the money,  love like you&#39;ve never been hurt, and <br/>\ndance like you do when nobody&#39;s  watching.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Ren","postDate":"1147871585","msgId":13328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0ZjdoMStkZTE2QGVHcm91cHMuY29tPg=="},"prevInTopic":13327,"nextInTopic":13329,"prevInTime":13327,"nextInTime":13329,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":" But, IL law you dont have to register with the school.  You actually dont  have to do anything in IL.  For future reference.  Ooooh...good thing I said I","messageBody":"<div id=\"ygrps-yiv-447241720\">&quot; But, IL law you dont have to register with the school.  You actually<br/>\ndont  have to do anything in IL.  For future reference. &quot;<br/>\n<br/>\nOoooh...good thing I said &quot;I BELIEVE your state is like that......&quot; <br/>\nand he agreed as though he knew!! HA!:)<br/>\nI really don&#39;t like answering law questions. Tried to skirt it with<br/>\nthe whole thing about everyone needing to research their own state.<br/>\n<br/>\nPhew. Glad it&#39;s over with. And thank you SO much for recording it.<br/>\nMaybe we could get it to Queanna for a podcast? I&#39;d love to have it<br/>\narchived somewhere for reference.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":195223619,"authorName":"SquishyMommy1@aol.com","from":"SquishyMommy1@...","profile":"steveshotwife2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Ren","postDate":"1147870757","msgId":13327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1Ni45MWZlMmUuMzE5Yzc4MjVAYW9sLmNvbT4="},"prevInTopic":11267,"nextInTopic":13328,"prevInTime":13326,"nextInTime":13328,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"Great job this morning.  I got it all recorded for you.   But, IL law you dont have to register with the school.  You actually dont  have to do anything in IL.","messageBody":"<div id=\"ygrps-yiv-661613554\">Great job this morning.  I got it all recorded for you.   But, IL law you <br/>\ndont have to register with the school.  You actually dont  have to do anything in <br/>\nIL.  For future reference.  But great job i  enjoyed listening.<br/>\n <br/>\n~Alyssa <br/>\nSlightly crunchy, non-vaxing, unschooling Mom to  Landen(2 1/2) and Gage(7 <br/>\nmonths)<br/>\n<br/>\n&quot;Work like you don&#39;t need the money,  love like you&#39;ve never been hurt, and <br/>\ndance like you do when nobody&#39;s  watching.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Ren","postDate":"1144015917","msgId":11267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUwcGk3ZCs0cDVvQGVHcm91cHMuY29tPg=="},"prevInTopic":1605,"nextInTopic":13327,"prevInTime":11266,"nextInTime":11268,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"I think it was ren, who wrote about a body art book. what is the title? i wouldn t mind checking it out. I found the MAC Deck of Cards at this site:","messageBody":"<div id=\"ygrps-yiv-1915413849\">&quot;I think it was ren, who wrote about a body art book.<br/>\nwhat is the title? i wouldn&#39;t mind checking it out.&quot;<br/>\n<br/>\nI found the MAC Deck of Cards at this site:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.assouline.com/\">http://www.assouline.com/</a><br/>\nAssouline teamed up with MAC to create a Deck of Cards based on body<br/>\nart. Then the book was printed, part of the proceeds go to the MAC<br/>\nAids foundation. Very cool.<br/>\n<br/>\nAssouline publishing has many interesting books I&#39;d like to buy. One<br/>\nof them is a book on Video Game Art, one of the first serious books on<br/>\ngaming art I&#39;ve seen.<br/>\n<br/>\nAfter you enter the site, click on &quot;search all books&quot; then choose the<br/>\nletter &quot;M&quot;. It&#39;s the third book down on the  &quot;M&quot; page. It&#39;s titled<br/>\n&quot;MAC: Deck of Cards&quot; but the cover is completely black so it&#39;s easy to<br/>\nmiss.<br/>\n<br/>\nAssouline focuses on art and fashion books. Great stuff.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":125789604,"authorName":"Onesnotenough@aol.com","from":"Onesnotenough@...","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Ren","postDate":"1089336082","msgId":1605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5LmVjZmJhYzMuMmUxZjRkMTJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":11267,"prevInTime":1604,"nextInTime":1606,"topicId":1605,"numMessagesInTopic":0,"msgSnippet":"I really like what you wrote! syndi ...since  we can t know what knowledge will be most needed in the future, it is senseless  to try to teach it in advance.","messageBody":"<div id=\"ygrps-yiv-596559433\">I really like what you wrote!<br/>\nsyndi<br/>\n <br/>\n&quot;...since  we can&#39;t know what knowledge will be most needed in the future, it <br/>\nis senseless  to try to teach it in advance. Instead, we should try to turn <br/>\nout people who  love learning so much and learn so well that they will be able <br/>\nto learn whatever  needs to be learned.&quot;<br/>\n-- _John  Holt_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quoteworld.org/author.php?thetext=John+Holt)\">http://www.quoteworld.org/author.php?thetext=John+Holt)</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":24240,"nextTopicId":24307}}