{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: You don&#39;t make them-another book","postDate":"1191412464","msgId":26673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxODUyNC45MzkxMy5xbUB3ZWI1NjExNS5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDI5MzE0Mi4zNjAzLnFtQHdlYjU5MjA5Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":26656,"nextInTopic":0,"prevInTime":26672,"nextInTime":26674,"topicId":26639,"numMessagesInTopic":0,"msgSnippet":"Awesome, looks I need to make a trip to the bookstore or go on-line thank you becca Cameron Parham  wrote:          I d like to suggest","messageBody":"<div id=\"ygrps-yiv-1296789019\">Awesome, looks I need to make a trip to the bookstore or go on-line thank you becca<br/>\n<br/>\nCameron Parham &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:acsp2205@...\">acsp2205@...</a>&gt; wrote:          I&#39;d like to suggest another book here. It has a rather unfortunate title, The Explosive Child, <br/>\nbut it is a lovely plan to get a family onto a consensual path. It is so hard for people to realize how ingrained the &#39;might makes right&#39; stance is in our lives. So hard for parents who mean to love and hear their children to realize how often when parents say they want to hear a child, it&#39;s really just to lure them into a discussion that ends up showing the child how the parent is right and the parent&#39;s agenda must be followed. <br/>\nThis book helps guide parents into a simple &#39;decision tree&#39; which helps the parent more clearly hear the child, and actually work out a true joint decision or solution to a problem. It is filled with assurances that this can truly be accomplished without all those parental fears of the child &#39;taking over and being in charge&#39; coming true. The author is clearly very respectful of all humans of all ages. I think the book got its title because the author&#39;s theory (seems good to me!) is that many explosions/behavior problems/apparent ADD, etc are really simply a very frusrated child who feels unheard. The author is delightful, although he makes no references to unschooling or consensual living literature. He writes like a &#39;professional&#39; who through his own practice, and thought, and real respect has figured out some very important things and wants to share them. Though at the start the book appears to focus on severly explosive kids, as the book<br/>\nunfolds it is apparent that his stance is important to all families. <br/>\nThis is a great resource to use if getting started on consensual living is scarey to a parent. The decision schema is easy to comprehend: Plan A is the child must do as the parent wants. Plan B is real discussion, real listening, practicing empathy and how to find genuinely consensual decisions. Plan C is parent lets go of outcome; it&#39;s not a high priority right now. There is a good exploration of how to stop pretend plan B&#39;s which are really disguised plan A&#39;s. A good chapter on how to help a child who&#39;s having trouble even knowing what she&#39;d like to say. And a very good section addressing the inevitable argument of &quot;How can I take time for that?&quot; <br/>\nThere is no book on earth that can speak to everyone who picks it up, of course. But it is a very good book. I wish most parents read it! I wish my parents had! Cameron<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nCatch up on fall&#39;s hot new shows on Yahoo! TV.  Watch previews, get listings, and more!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: You don&#39;t make them-another book","postDate":"1191359161","msgId":26656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcxMDAyMTQwNmkyY2VjZTg5dWYzZWUzNGQxMTEzY2VhMjdAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDI5MzE0Mi4zNjAzLnFtQHdlYjU5MjA5Lm1haWwucmUxLnlhaG9vLmNvbT4=","referencesHeader":"PDI5MzE0Mi4zNjAzLnFtQHdlYjU5MjA5Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":26646,"nextInTopic":26673,"prevInTime":26655,"nextInTime":26657,"topicId":26639,"numMessagesInTopic":0,"msgSnippet":"... I have this book on my wish list! I scanned through the previous conversations in the related threads, but didn t catch the title of the other book that","messageBody":"<div id=\"ygrps-yiv-1077413199\">Cameron Parham wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d like to suggest another book here.  It has a rather unfortunate title, The Explosive Child<br/>\n<br/>\n </span></blockquote>I have this book on my wish list! I scanned through the previous<br/>\nconversations in the related threads, but didn&#39;t catch the title of<br/>\nthe other book that was mentioned first (the one that prompted Cameron<br/>\nto suggest the Explosive Child). Can someone please tell me what it<br/>\nwas?<br/>\n<br/>\nThanks!<br/>\n~ Susan</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: You don&#39;t make them-another book","postDate":"1191352162","msgId":26646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczMzg2NzE2LTY2NDAtNDU2Qy04M0ZBLUUzNTFEODlCMDE4Q0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDI5MzE0Mi4zNjAzLnFtQHdlYjU5MjA5Lm1haWwucmUxLnlhaG9vLmNvbT4=","referencesHeader":"PDI5MzE0Mi4zNjAzLnFtQHdlYjU5MjA5Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":26639,"nextInTopic":26656,"prevInTime":26645,"nextInTime":26647,"topicId":26639,"numMessagesInTopic":0,"msgSnippet":"... I second the suggestion of this book. It helped me tremendously. I had one, in particular, who was especially explosive and this book really helped me","messageBody":"<div id=\"ygrps-yiv-851824967\">On Oct 2, 2007, at 7:59 AM, Cameron Parham wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d like to suggest another book here. It has a rather unfortunate  <br/>\n&gt; title, The Explosive Child,<br/>\n&gt; but it is a lovely plan to get a family onto a consensual path.<br/>\n<br/>\n </span></blockquote>I second the suggestion of this book. It helped me tremendously. I  <br/>\nhad one, in particular, who was especially &quot;explosive&quot; and this book  <br/>\nreally helped me get some perspective and to make super beneficial  <br/>\nchanges in my parenting of her (this was before we were unschooling).  <br/>\nShe is now a delightful young woman of 20 years old and people have a  <br/>\nhard time believing it when I say that there were a few years when my  <br/>\nmost fervent dream was to ever get through a day (one day) without  <br/>\nher having a major meltdown.<br/>\n<br/>\nIf I only knew then what I know now .... &lt;G&gt;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: You don&#39;t make them-another book","postDate":"1191337182","msgId":26639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5MzE0Mi4zNjAzLnFtQHdlYjU5MjA5Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":26646,"prevInTime":26638,"nextInTime":26640,"topicId":26639,"numMessagesInTopic":0,"msgSnippet":"I d like to suggest another book here.  It has a rather unfortunate title, The Explosive Child, but it is a lovely plan to get a family onto a consensual path.","messageBody":"<div id=\"ygrps-yiv-1107841116\">I&#39;d like to suggest another book here.  It has a rather unfortunate title, The Explosive Child, <br/>\nbut it is a lovely plan to get a family onto a consensual path.  It is so hard for people to realize how ingrained the &#39;might makes right&#39; stance is in our lives.  So hard for parents who mean to love and hear their children to realize how often when parents say they want to hear a child, it&#39;s really just to lure them into a discussion that ends up showing the child how the parent is right and the parent&#39;s agenda must be followed. <br/>\n  This book helps guide parents into a simple &#39;decision tree&#39; which helps the parent more clearly hear the child, and actually work out a true joint decision or solution to a problem.  It is filled with assurances that this can truly be accomplished without all those parental fears of the child &#39;taking over and being in charge&#39; coming true.  The author is clearly very respectful of all humans of all ages.  I think the book got its title because the author&#39;s theory (seems good to me!) is that many explosions/behavior problems/apparent ADD, etc are really simply a very frusrated child who feels unheard.  The author is delightful, although he makes no references to unschooling or consensual living literature.  He writes like a &#39;professional&#39; who through his own practice, and thought, and real respect has figured out  some very important things and wants to share them.  Though at the start the book appears to focus on severly explosive kids, as the book<br/>\n unfolds it is apparent that his stance is important to all families. <br/>\n  This is a great resource to use if getting started on consensual living is scarey to a parent.  The decision schema is easy to comprehend:  Plan A is the child must do as the parent wants.  Plan B is real discussion, real listening, practicing empathy and how to find genuinely consensual decisions. Plan C is parent lets go of outcome; it&#39;s not a high priority right now. There is a good exploration of how to stop pretend plan B&#39;s which are really disguised plan A&#39;s.  A good chapter on how to help a child who&#39;s having trouble even knowing what she&#39;d like to say.  And a very good section addressing the inevitable argument of &quot;How can I take time for that?&quot; <br/>\n  There is no book on earth that can speak to everyone who picks it up, of course.   But it is a very good book.  I wish most parents read it!  I wish my parents had!  Cameron<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26664,"nextTopicId":26659}}