{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 6yo sharing","postDate":"1375598812","msgId":49908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0a3RjcytqNHM5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0aGwxaitwc3RwQGVHcm91cHMuY29tPg=="},"prevInTopic":49906,"nextInTopic":0,"prevInTime":49907,"nextInTime":49909,"topicId":49898,"numMessagesInTopic":0,"msgSnippet":"... On the food issue, I was wondering whether you ve tried putting out two identical platters of snacks, one for the guests, and one for your kids. And can","messageBody":"<div id=\"ygrps-yiv-717642312\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-owner@yahoogroups.com\">unschoolingbasics-owner@yahoogroups.com</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m posting this for someone anonymously:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ... My son is 6 years old, and he has a sibling.  Overall, he is<br/>\n&gt; fine with sharing with family members, but when we have<br/>\n&gt; people/friends over to our home for play, he has a really big<br/>\n&gt; challenge with sharing.  We have extra food, and I&#39;ll ask ahead of<br/>\n&gt; time what to put on a monkey platter.  If someone is here and asks<br/>\n&gt; for food beyond that, or sometimes even on the platter, he gets<br/>\n&gt; incredibly upset.  <br/>\n&gt; <br/>\n&gt; It is the same with toys.  ....<br/>\n<br/>\n </span></blockquote>On the food issue, I was wondering whether you&#39;ve tried putting out two identical platters of snacks, one for the guests, and one for your kids. And can you make it clear that when a child asks for something that is not on the tray, it is *you* doing the sharing?<br/>\n<br/>\nAlso, do you have the resources to buy some extra toys that you can let your son know are *your* toys to share with guests? (And to share with your own kids too.)<br/>\n<br/>\nIf your son objects to *your* sharing with guests, but still says he wants friends to come over, what *I* would do in that situation is tell my son something like the following: <br/>\n&quot;I understand that this is upsetting you. Can you tell me why it makes you unhappy when I share with friends?&quot; <br/>\nand also: <br/>\n&quot;I&#39;m not going to be mean to your friends to make you happy - that would make *me* feel very bad! I don&#39;t feel good about myself when I do things that make other people - especially guests - feel uncomfortable, hungry, or left out or bored. But I do want YOU to be happy too! What else can we do to make you feel better about me sharing food and toys with them? What can we do to make you and me  AND your friends feel good?&quot;<br/>\n<br/>\nUnderstanding and expressing what fears or other feeling are causing him to want to withhold food and toys from guests, and having you acknowledge and accept his feelings as valid, and then being invited to brainstorm with you to come up with a win-win solution for everyone involved seem to me like the best things to do in this situation.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: 6yo sharing","postDate":"1375564417","msgId":49906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0anJxMSszOTRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0aGwxaitwc3RwQGVHcm91cHMuY29tPg=="},"prevInTopic":49905,"nextInTopic":49908,"prevInTime":49905,"nextInTime":49907,"topicId":49898,"numMessagesInTopic":0,"msgSnippet":"... If I knew that my child felt very upset about those things, I d take a break from doing them.  There are ways to socialize with others at places where","messageBody":"<div id=\"ygrps-yiv-1723386274\"><blockquote><span title=\"ireply\">&gt; If someone is here and asks for food beyond that, or sometimes even on the platter, he gets incredibly upset.  <br/>\n&gt; It is the same with toys. <br/>\n<br/>\n </span></blockquote>If I knew that my child felt very upset about those things, I&#39;d take a break from doing them.  There are ways to socialize with others at places where sharing your own food and own toys aren&#39;t involved.  <br/>\n<br/>\nPerhaps after a time, your son may begin to feel comfortable sharing things.  In the meantime, be very generous with him.  And model being grateful when people share with you.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He will tell me he is okay with sharing these toys, then someone picks it up to play with it, and he gets very upset. <br/>\n <br/>\n </span></blockquote>Could he be saying he will share toys because he knows that is what you wish him to do?  But maybe inside he really doesn&#39;t want to and can&#39;t bear it when people start using them?  <br/>\n<br/>\nI think it is kind to share too, but if my child were having such  difficulties (even when you try to be preventative), I&#39;d try not to put him in a position where anyone might expect him to share and I&#39;d stop encouraging him to do so.  <br/>\n<br/>\nDo more of the things he likes to do that don&#39;t involve pressure or expectations to share.  <br/>\n<br/>\nIf ever he&#39;s in a situation (by chance) where he has the opportunity to share, can you let him decide if and when he wants to?    <br/>\n<br/>\nIn time and without pressure and by witnessing others being generous, he may decide to share some things.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to be a hostess, and for people to enjoy food and fun in our &gt;home. It is an important role for me to have. <br/>\n<br/>\n </span></blockquote>What is more important, being the mom your kid needs you to be at this time or being the kind of hostess you want to be to your friends and their kids?  <br/>\n<br/>\nRight now, your child is having a hard time.  It probably won&#39;t last forever.  Even if it were to, there are still ways to do things where you can be generous and dote on company.  <br/>\n<br/>\nWould your husband be willing to take your son out for a fun playdate while you entertain friends for a while?  Or have friends visit while your child plays at a friend&#39;s or family member&#39;s home?  Or host a gathering outside of your home that your son doesn&#39;t come to (maybe he stays home with dad or another caregiver, if he and you would be comfortable with that)?     <br/>\n<br/>\nMy son Li (12) had some suggestions..hope it is okay to post...He said to &quot;Make sure you are generous to him and maybe one day he will be generous to others.  But make sure you don&#39;t push him or pressure him.  Make him your priority.&quot;<br/>\n<br/>\nLaurie</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: 6yo sharing","postDate":"1375541051","msgId":49905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0ajR2cisxZjZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0aGwxaitwc3RwQGVHcm91cHMuY29tPg=="},"prevInTopic":49903,"nextInTopic":49906,"prevInTime":49904,"nextInTime":49906,"topicId":49898,"numMessagesInTopic":0,"msgSnippet":"... ****Are these his friends or yours? Kids of friends of yours, kids of relatives, friends he has met at the park? ... ****That sounds like a punishment. You","messageBody":"<div id=\"ygrps-yiv-113613886\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-owner@yahoogroups.com\">unschoolingbasics-owner@yahoogroups.com</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m posting this for someone anonymously:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I am looking for insights from long time unschoolers on an issue/situation happening in our home.  The situation revolves around sharing with guests. My son is 6 years old, and he has a sibling.  Overall, he is fine with sharing with family members, but when we have people/friends over to our home for play, he has a really big challenge with sharing.  We have extra food, and I&#39;ll ask ahead of time what to put on a monkey platter.  If someone is here and asks for food beyond that, or sometimes even on the platter, he gets incredibly upset.  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>****Which isn&#39;t really sharing. It&#39;s not like he&#39;s going to get the food back. :)  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is the same with toys.  I have asked before people come over &quot;Is it okay for people to play with these things or should we put them in my room&quot; as an off limits place.  He will tell me he is okay with sharing these toys, then someone picks it up to play with it, and he gets very upset.  I know he can change his mind, but it is really becoming difficult to have people over and to take things away from children who start playing with something, or when someone asks for food that we have plenty of to share, but he doesn&#39;t want them to have that item.  <br/>\n<br/>\n </span></blockquote>****Are these his friends or yours? Kids of friends of yours, kids of relatives, friends he has met at the park? <br/>\n<br/>\n****How many kids are there playing with his toys at one time? Maybe he&#39;s picturing one kid he knows and the whole family shows up to devour his stuff? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I want to honor his feelings, but it is becoming very difficult to have friends over when he doesn&#39;t want to share things.  I suggested maybe we take a break from having friends over, and that upset him too. <br/>\n<br/>\n </span></blockquote>****That sounds like a punishment. You can&#39;t share and so we&#39;re not going to have friends over. <br/>\n<br/>\n****How about just slowing the visits down for a while? Giving him some space to realize he misses having so-and-so over or he doesn&#39;t miss that as much as you might have thought?<br/>\n<br/>\n<br/>\n<br/>\n When we go to park days, which would be neutral, sometimes he is okay about sharing and sometimes not (even when we buy food specifically for sharing).  The same for going to someone else&#39;s house - sometimes it is okay and sometimes not to share the food we have brought.  I have said things in the past &quot;but when we go to your friends house, he shares his food with us.&quot; I don&#39;t think this helps the situation at all.  I don&#39;t know how to have people here and tell them, &quot;you can&#39;t have any of our food&quot; That&#39;s where I am leaning right now, but it doesn&#39;t feel like the kind of home I want to have. I want to be a hostess, and for people to enjoy food and fun in our home. It is an important role for me to have. <br/>\n<br/>\n<br/>\n****It&#39;s not more important than your 6-year-old. And when he is a bit older, maybe he&#39;ll be more comfortable with some of these things and you can go back to being a hostess.<br/>\n<br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 6yo sharing","postDate":"1375534825","msgId":49903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0aXV0OStybDdpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0aGwxaitwc3RwQGVHcm91cHMuY29tPg=="},"prevInTopic":49902,"nextInTopic":49905,"prevInTime":49902,"nextInTime":49904,"topicId":49898,"numMessagesInTopic":0,"msgSnippet":"... ************* I wonder what that looks like: incredibly upset . If getting upset means crying, then maybe mom can cuddle and reassure the child and see","messageBody":"<div id=\"ygrps-yiv-641573604\"><blockquote><span title=\"ireply\">&gt;If someone is here and asks for food beyond that, or sometimes even on the platter, he gets incredibly upset.  <br/>\n </span></blockquote>*************<br/>\n<br/>\nI wonder what that looks like: &quot;incredibly upset&quot;. If getting upset means crying, then maybe mom can cuddle and reassure the child and see what happens. If it means hitting and yelling at other kids, maybe removing the child from the situation and then letting him cry. Sometimes being upset is okay - something to move through and then move on, rather than looking for ways to keep that upset from occurring. Honoring feelings doesn&#39;t mean trying to keep negative feelings from ever happening at all. <br/>\n<br/>\nIf being upset means he&#39;s in a full blown meltdown until the other person goes home, that&#39;s a different matter! It could be better not to have guests in the home for awhile, or not for very long, if problems don&#39;t develop right away - short visits only - or to have specific, planned activities rather than &quot;free play&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I suggested maybe we take a break from having friends over, and that upset him too.<br/>\n </span></blockquote>*************<br/>\n<br/>\nSometimes kids want to do things they aren&#39;t capable of doing - driving a car, reading, going to big parties or events... It doesn&#39;t help to set things like that up as choices because they aren&#39;t, really. The choice of doing something you&#39;re going to fail at certainly isn&#39;t a good one! So rather than talking about the matter as a choice, don&#39;t talk about it for the most part. Plan to do other things. If he specifically asks for friends to come over, make alternative suggestions.<br/>\n<br/>\n If you&#39;re going to be in a situation where some sharing will be expected, be really clear about the fact that those aren&#39;t choices your son will be making - I don&#39;t mean necessarily saying &quot;you don&#39;t get to say no&quot; I mean something more like &quot;I am bringing food/toys to share&quot; without making that negotiable.<br/>\n<br/>\nAnd he may still be upset! Sometimes learning about the world is a very frustrating process! Relax into the fact that some things are going to frustrate him for awhile and you may not be able to do more than commiserate with his frustration. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also wonder how much of this is possibly to do with introversion.<br/>\n<br/>\n </span></blockquote>I don&#39;t think it has anything to do with introversion. It seems like it has more to do with predicting outcomes - when other people don&#39;t do what he expects in the moment, he tries to change that and control the outcome so it matches his expectation. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] 6yo sharing","postDate":"1375527520","msgId":49902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGRDg4NjJELTc3MzItNDZGMi1BN0E2LUNDQjg0OENCQkU1RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGt0aGwxaitwc3RwQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0aGwxaitwc3RwQGVHcm91cHMuY29tPg=="},"prevInTopic":49898,"nextInTopic":49903,"prevInTime":49901,"nextInTime":49903,"topicId":49898,"numMessagesInTopic":0,"msgSnippet":"... Not all feelings are honorable ;-) Or useful. There s more choices other than, Your feelings are right, and Your feelings are wrong. He knows his","messageBody":"<div id=\"ygrps-yiv-1109117905\">On Aug 2, 2013, at 9:05 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-owner@yahoogroups.com\">unschoolingbasics-owner@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to honor his feelings,<br/>\n<br/>\n </span></blockquote>Not all feelings are honorable ;-) Or useful.<br/>\n<br/>\nThere&#39;s more choices other than, &quot;Your feelings are right,&quot; and &quot;Your feelings are wrong.&quot;<br/>\n<br/>\nHe knows his feelings are legitimate. *Something&#39;s* bothering him. And he doesn&#39;t know how to deal with the feeling *and* help his guests be comfortable.<br/>\n<br/>\nHave you asked him -- at some other time, like when you&#39;re in the car (not having to look at someone can help ease talking) -- what his thoughts are when this happens? Not to criticize his thoughts but to give you some idea on what might help.<br/>\n<br/>\nAsking won&#39;t work for all kids. Not all kids are articulate. Not all kids -- or adults! -- can put words to complex feelings.<br/>\n<br/>\nYou can ask him for ideas of what to do when these feelings come over him. You can say, &quot;Let&#39;s try this next time and see if it makes it easier.&quot; And, if he&#39;s a talker, ask about it afterwards or guess from how he reacts if he&#39;s not. Make some adjustments. Try other ideas.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also wonder how much of this is possibly to do with introversion.<br/>\n<br/>\n </span></blockquote>It might be a sign of stress. Or that he needs something. Do you feel a shift before he gets these feelings of protectiveness? Is he tired? Is he hungry? Is the guest doing something specific? See if you can tune into him.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"","from":"unschoolingbasics-owner@yahoogroups.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"6yo sharing","postDate":"1375491955","msgId":49898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0aGwxaitwc3RwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49902,"prevInTime":49897,"nextInTime":49899,"topicId":49898,"numMessagesInTopic":0,"msgSnippet":"I m posting this for someone anonymously: I am looking for insights from long time unschoolers on an issue/situation happening in our home.  The situation","messageBody":"<div id=\"ygrps-yiv-361534200\">I&#39;m posting this for someone anonymously:<br/>\n<br/>\n<br/>\nI am looking for insights from long time unschoolers on an issue/situation happening in our home.  The situation revolves around sharing with guests. My son is 6 years old, and he has a sibling.  Overall, he is fine with sharing with family members, but when we have people/friends over to our home for play, he has a really big challenge with sharing.  We have extra food, and I&#39;ll ask ahead of time what to put on a monkey platter.  If someone is here and asks for food beyond that, or sometimes even on the platter, he gets incredibly upset.  <br/>\n<br/>\nIt is the same with toys.  I have asked before people come over &quot;Is it okay for people to play with these things or should we put them in my room&quot; as an off limits place.  He will tell me he is okay with sharing these toys, then someone picks it up to play with it, and he gets very upset.  I know he can change his mind, but it is really becoming difficult to have people over and to take things away from children who start playing with something, or when someone asks for food that we have plenty of to share, but he doesn&#39;t want them to have that item.  <br/>\n<br/>\nI want to honor his feelings, but it is becoming very difficult to have friends over when he doesn&#39;t want to share things.  I suggested maybe we take a break from having friends over, and that upset him too.  When we go to park days, which would be neutral, sometimes he is okay about sharing and sometimes not (even when we buy food specifically for sharing).  The same for going to someone else&#39;s house - sometimes it is okay and sometimes not to share the food we have brought.  I have said things in the past &quot;but when we go to your friends house, he shares his food with us.&quot; I don&#39;t think this helps the situation at all.  I don&#39;t know how to have people here and tell them, &quot;you can&#39;t have any of our food&quot; That&#39;s where I am leaning right now, but it doesn&#39;t feel like the kind of home I want to have. I want to be a hostess, and for people to enjoy food and fun in our home. It is an important role for me to have. <br/>\n <br/>\nI also wonder how much of this is possibly to do with introversion.  I am extremely extroverted, and he is extremely introverted.  There are things I have read recently about introverted people that help me understand some aspects of guests in our home - that sometimes it can be draining for him, sometimes he may need to feel more in control of his space because there are too many people, or things outside his control. <br/>\n Any thoughts on this?</div>","specialLinks":[]}],"prevTopicId":49891,"nextTopicId":49900}}