{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":212934673,"authorName":"scrapgal","from":"&quot;scrapgal&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Homeschooling malaise","postDate":"1107825651","msgId":4889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1OTQ1ais4bjRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGN1ODVubytldWNzQGVHcm91cHMuY29tPg=="},"prevInTopic":4880,"nextInTopic":0,"prevInTime":4888,"nextInTime":4890,"topicId":4878,"numMessagesInTopic":0,"msgSnippet":"... Mine is sort of like that.  My kids get a dollar per age per week (depending on if A) I have it and B) I and they remember.  It isn t because I think my 6","messageBody":"<div id=\"ygrps-yiv-1394239277\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@n...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;  They get money because we&#39;re a family, and the wage <br/>\n&gt; earning ability of some members is greater than others, but <br/>\n&gt; shouldn&#39;t limit them to an arbitrary amount.<br/>\n&gt; If the amount is based on budget, that&#39;s a real reason.<br/>\n<br/>\n </span></blockquote>Mine is sort of like that.  My kids get a dollar per age per week <br/>\n(depending on if A) I have it and B) I and they remember.  It isn&#39;t <br/>\nbecause I think my 6 yo only needs $6, but because most of what he <br/>\nwants to buy is in the $6 a week range.  A pack of M&M&#39;s here and a <br/>\nlittle car there.  And my 12 yo generally has needs that are around <br/>\n$12.  A CD this week or some piece of jewelry that week.  And they <br/>\naren&#39;t limited by their allowance.  If they want a CD or a new DVD <br/>\nor Gameboy cartridge they know they will get it if it fits into our <br/>\nbudget.  They *totally* understand &quot;We don&#39;t have the money for it <br/>\nthis week&quot; because they know they will get it next week (or after <br/>\nthe next pay period.)  What my children want is the ability to make <br/>\npurchases.  To do the entire transaction themselves whether it is a <br/>\npack of 20¢ gum or a $20 outfit.  The love spending &quot;their own&quot; <br/>\nmoney (even when they know mom is going to help them out at the cash <br/>\nregister!)  :-)  Keon especially loves places like Walmart that have <br/>\nself check out lines.  He gets to scan the items himself, put in his <br/>\nmoney, get his change, bag his own items, collect his receipt.  This <br/>\nis great fun!  (For you Pensacola people, the Walmart on 29 has <br/>\nthese as does the Home Depot on Davis!)<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":184232345,"authorName":"CherylWarnke@AOL.com","from":"CherylWarnke@...","profile":"csleaf43","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Homeschooling malaise","postDate":"1107799220","msgId":4880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOS4zMTEzMWI5NS4yZjM5MDZiNEBhb2wuY29tPg=="},"prevInTopic":4878,"nextInTopic":4889,"prevInTime":4879,"nextInTime":4881,"topicId":4878,"numMessagesInTopic":0,"msgSnippet":"Apparently, you took what I wrote wrong.  I do not deprive my children  from them expanding their horizons because they may not have the funds to get  it. But,","messageBody":"<div id=\"ygrps-yiv-2104528144\">Apparently, you took what I wrote wrong.  I do not deprive my children  from <br/>\nthem expanding their horizons because they may not have the funds to get  it.  <br/>\nBut, if you are like most parents, I don&#39;t think you can afford Yugioh  cards <br/>\nor a dvd everytime you go to a store and if you can, I moving in with  you.  <br/>\nThey are learning how to handle money.  I do not dictate to them  what they <br/>\ncan buy and for how long they need to save for.  You kind of make  in sound in <br/>\nyour letter that I do not have a relationship with my  children.  For the <br/>\nrecord, Me and my three children are extremely close and  we have experienced <br/>\nthings in life that most have not (i.e., my daughter&#39;s  illness with Cancer, their <br/>\nfather dying)  I am not rich here.  I  almost all the time have to wait and <br/>\nsave even for the things I want, which are  usually last on the list. <br/>\n <br/>\nFor anyone on the list, my e-mail was not to step on anyone&#39;s toes but  to <br/>\noffer some advice.  Take it or leave it, but don&#39;t be nasty.  I  wasn&#39;t when I <br/>\nfirst replied.<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homeschooling malaise","postDate":"1107794488","msgId":4878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1ODVubytldWNzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":4880,"prevInTime":4877,"nextInTime":4879,"topicId":4878,"numMessagesInTopic":0,"msgSnippet":"My job is to provide them with clothes, food,  haircuts, an education, curriculum needs - those kinds of things.   This is pretty mainstream thought. Most","messageBody":"<div id=\"ygrps-yiv-89950647\">&quot;My job is to provide them with clothes, food,  haircuts, an <br/>\neducation, curriculum needs - those kinds of things.  &quot;<br/>\n<br/>\nThis is pretty mainstream thought. Most parents would agree with <br/>\nthis and pat you on the back...I&#39;m here to say we need to think <br/>\noutside of that box.<br/>\n<br/>\nAn unschooling parents job is different. My job is not to provide <br/>\nthem with an education and curriculum needs, my job is to provide <br/>\nthem with the things they love, the things that interest them and <br/>\nthe things that they are curious about.<br/>\nThat often includes items they don&#39;t have money for at the moment, <br/>\nhow fair is it to withhold that item to teach them some kind of <br/>\nlesson in money management? It only teaches them that Mom is <br/>\narbitrary with how she spends her money and that you can&#39;t count on <br/>\nMom to help out when you need something.<br/>\nI don&#39;t want those kind of lessons imparted to my children.<br/>\nI want them to know I&#39;m on their side.<br/>\nIf I have the money, I will gladly help them.<br/>\nIf I don&#39;t have the money, they are very understanding. <br/>\nWe&#39;re a family, not a dictatorship. <br/>\n<br/>\nIf I decided how much money they got, what kind of hoops they had to <br/>\njump through to get that money and refused to pay for &quot;extras&quot;, I <br/>\ndon&#39;t believe unschooling would be unfolding as beautifully as it is <br/>\naround here.<br/>\nI don&#39;t believe I&#39;d have the kind of relationship I have with my <br/>\nchildren either, which is based on trust.<br/>\n<br/>\nI would really resent the hell out of my dh if he gave me a list of <br/>\nchores and paid me allowance based on my performance. Yuck.<br/>\nAnd if he told me to pay for my own &quot;extras&quot; because he deemed them <br/>\nunworthy of his investment...more yuck.<br/>\nMy children&#39;s wants are worthy. Discussing ways to get where they <br/>\nwant to go, is far more useful than arbitrarily deciding the money <br/>\nthey get based on performance.<br/>\nMy kids help out when I ask for help, because I only ask when I <br/>\nreally need it. They get money because we&#39;re a family, and the wage <br/>\nearning ability of some members is greater than others, but <br/>\nshouldn&#39;t limit them to an arbitrary amount.<br/>\nIf the amount is based on budget, that&#39;s a real reason.<br/>\nIf the amount is based on performance, that&#39;s not respectful in my <br/>\nopinion. Adults don&#39;t do that to each other.<br/>\nOn the other hand, if there are certain jobs I&#39;d be willing to pay <br/>\nfor extra help, then my kids certainly have first dibs at those <br/>\njobs. But I don&#39;t tie their money to chores in any way.<br/>\nThey get money, because they&#39;re part of our family and I happen to <br/>\nhave money to give them.<br/>\nIf they don&#39;t have money and need help, I help them. I think that&#39;s <br/>\na more useful way to assist children in their learning adventures.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":2660,"nextTopicId":4860}}