{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Speach Therapy Frustration","postDate":"1238203330","msgId":39147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0RDMyQUZGOTlFQjRFQTJBQjdCMUQyNEZBODJDNEI1QGJpZ3N1cnByaXNlPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":39146,"nextInTime":39148,"topicId":39147,"numMessagesInTopic":0,"msgSnippet":"***So, if we drop speech therapy, he is going to continue to experience the frustration ....**** He s going to continue to experience that frustration until he","messageBody":"<div id=\"ygrps-yiv-1518110113\">***So, if we drop speech therapy, he is going<br/>\nto continue to experience the frustration ....****<br/>\n<br/>\nHe&#39;s going to continue to experience that frustration until he can communicate more effectively.    He&#39;s been in  therapy and he&#39;s still frustrated.  The therapy isn&#39;t going to provide an immediate solution.  I know you know that but what you wrote above sounds absolute; If we stop therapy, he stays frustrated.   When the truth is he&#39;s going to be frustrated for then next while, either way.   What he needs is time.      <br/>\nSee how he feels about fewer sessions for shorter periods.   He will get older, he will learn more skills for coping with communication problems and with frustration.  Eight is very, very young and you can give him the gift (and help) of your calm confidence in him.   <br/>\n<br/>\nIt&#39;s not honest if you tell him that if he endures the frustration of speech therapy he will be happier at the park.(or wherever)    He&#39;s going to be frustrated by his different communication style for some time even while he has to endure the frustration of therapy.   You&#39;re not exchanging one for the other, you&#39;re adding frustration, from his point of view.      Maybe, for now, if you could ease frustration in other parts of his life he&#39;d have more patience and energy for coping with his frustration about communicating with other people.    <br/>\n<br/>\nWhat if you found a therapist who spoke his first language, would that make a difference?  Maybe he would feel more at ease with the language he heard the first seven years of his life.  Kids at the park still won&#39;t understand him but he might feel less frustration during therapy.  If he spent seven years listening to another language his brain is familiar with those sounds and they might be easier for him to make.   <br/>\n<br/>\nDoes he like to sing?  Songs in his first language and in different languages, if he&#39;s the type to sing along, will offer a bunch of different sounds. <br/>\n<br/>\nIf you could have a guarantee that his communication problems would resolve magically on some future date without your help or intervention,  what would you do to help him be more comfortable and happy now?  What can you do to help him with frustration?   Can you have *one* friend over at a time and help translate for your son?  Some personal time, over time with different friends, will help him and the friends get better at communicating and it will help him when he&#39;s out at the park with a bunch of kids too, if a couple of them are kids who already (somewhat) understand him. <br/>\n<br/>\n<br/>\nDeb Lewis, mom to always unschooled Dylan, 16. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39131,"nextTopicId":39127}}