{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":345817076,"authorName":"Sylvia Woodman","from":"Sylvia Woodman &lt;sylvia057@...&gt;","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Books for baby/toddler","postDate":"1360309629","msgId":49534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTUhKS0xfc1d3UVNXVkxXRzB4VVA2dnp6RkV2V2QrUkNESHozejEzZzUwMkd5cWlpUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtmMWEwcCtqbjZ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGtmMWEwcCtqbjZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":49533,"nextInTopic":0,"prevInTime":49533,"nextInTime":49535,"topicId":49532,"numMessagesInTopic":0,"msgSnippet":"Congratulations on your new baby! My kids especially loved books with photographs of other babies in them. We also bought some soft covered small photograph","messageBody":"<div id=\"ygrps-yiv-2013003701\">Congratulations on your new baby!<br/>\n<br/>\nMy kids especially loved books with photographs of other babies in them.<br/>\n We also bought some soft covered small photograph albums that we filled<br/>\nwith photographs of family members.  We also sang a lot and my husband and<br/>\nI (and our whole extended family really) liked to make up songs with our<br/>\nchildren&#39;s names in them.  You could read poetry to them, play music.  My<br/>\nmother in law likes to quilt and she made our kids a number of books out of<br/>\ncloth which were quite durable.  I think they liked the different textures<br/>\nof books, fabric, cardboard, soft cover, hard cover, magazines...<br/>\n<br/>\nSylvia<br/>\n(Gabriella 8 and Harry 6)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Feb 7, 2013 at 5:31 PM, keely_boom &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:keelyboom@...\">keelyboom@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi there,<br/>\n&gt;<br/>\n&gt; I just joined the list. I live with my DH and DD (11 weeks) in Australia<br/>\n&gt; near Sydney. I read a couple of books on unschooling during my pregnancy<br/>\n&gt; and am very inspired by the approach.<br/>\n&gt;<br/>\n&gt; I&#39;m wondering what kind of things are appropriate to have around our baby<br/>\n&gt; as she grows through her early years. I love to read and would like to have<br/>\n&gt; some children&#39;s books to read to her. I&#39;ve bought one (Peter Rabbit and<br/>\n&gt; Peekaboo) but the others I&#39;ve seen seem are focused on the task of learning<br/>\n&gt; the alphabet and numbers/counting from a young age - seems a bit forced...<br/>\n&gt; Would you read these types of books to your LO or look for something else?<br/>\n&gt;<br/>\n&gt; I&#39;m planning to make some hard cover books for our DD in the next few<br/>\n&gt; months and then make them with her when she is interested.<br/>\n&gt;<br/>\n&gt; I suppose another option is that I could read to her what I&#39;m reading?<br/>\n&gt;<br/>\n&gt; Any advice/ideas would be great!<br/>\n&gt;<br/>\n&gt; Best wishes,<br/>\n&gt; Keely<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Books for baby/toddler","postDate":"1360281140","msgId":49533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmMWVuaytqY2NsQGVHcm91cHMuY29tPg=="},"prevInTopic":49532,"nextInTopic":49534,"prevInTime":49532,"nextInTime":49534,"topicId":49532,"numMessagesInTopic":0,"msgSnippet":"To start out with, if you like to read aloud, read whatever appeals to you - adult books, children s books, anything. Go to book sales and look for things","messageBody":"<div id=\"ygrps-yiv-836959914\">To start out with, if you like to read aloud, read whatever appeals to you - adult books, children&#39;s books, anything. Go to book sales and look for things which make you say: Wow, that&#39;s a cool book! and don&#39;t worry too much about other criteria. Fill your bookshelves with wonderful things.<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/museum\">http://sandradodd.com/museum</a><br/>\n<br/>\nMore important than what you read is to notice your child&#39;s responses. Those will change over time! It&#39;s normal, for instance, once babies are sitting up and able to grab things, for them to be more interested in grabbing, mouthing, maybe even tearing up books than the process of reading them - and then you&#39;ll want to stock up on books which are conveniently mauled and maybe move the more fragile books out of reach for awhile.<br/>\n<br/>\nShe might like to listen to you read long passages, or she might not like to hear you read much at all - that was a shock to me, I got a baby who didn&#39;t like being read to! What she liked best, as a toddler, was ABC type books and books where everything has a label - teachy sort of books, you might think, although given Mo&#39;s personality I&#39;d call them &quot;infant and toddler non-fiction&quot; of a sort. She loves diagrams and instruction manuals, and in retrospect that&#39;s what those books were to her.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m planning to make some hard cover books for our DD in the next few months and then make them with her when she is interested.<br/>\n </span></blockquote>*************<br/>\n<br/>\nI made some simple &quot;window books&quot; for Mo when she was a baby, where each page was a piece of colored paper cut kind of like a paper snowflake so you could see the next page through the holes. Each page I &quot;laminated&quot; with clear contact paper. I taped the whole thing together with... colored tape of some kind. They were cute and the plastic protected the paper from sticky and wetness, without having the kinds of hard edges you get with more formal lamination. Since Mo was more of a looker than a listening, those were a good fit for her - but once she was 2, she was on the go so much I didn&#39;t have time to make cute crafty things any more! And by the time she slowed down she&#39;d figured out how to make her own books with very little help from me.<br/>\n<br/>\nThe most important thing is not to get locked into any particular expectations. Kids change and change and change again - and they&#39;ll suprise you in so many ways. Be open to adapting to your child&#39;s interests as she grows, and you&#39;ll get to grow and learn along with her. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":326216246,"authorName":"keely_boom","from":"&quot;keely_boom&quot; &lt;keelyboom@...&gt;","profile":"keely_boom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Books for baby/toddler","postDate":"1360276313","msgId":49532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmMWEwcCtqbjZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49533,"prevInTime":49531,"nextInTime":49533,"topicId":49532,"numMessagesInTopic":0,"msgSnippet":"Hi there, I just joined the list. I live with my DH and DD (11 weeks) in Australia near Sydney. I read a couple of books on unschooling during my pregnancy and","messageBody":"<div id=\"ygrps-yiv-391630863\">Hi there,<br/>\n<br/>\nI just joined the list. I live with my DH and DD (11 weeks) in Australia near Sydney. I read a couple of books on unschooling during my pregnancy and am very inspired by the approach.<br/>\n<br/>\nI&#39;m wondering what kind of things are appropriate to have around our baby as she grows through her early years. I love to read and would like to have some children&#39;s books to read to her. I&#39;ve bought one (Peter Rabbit and Peekaboo) but the others I&#39;ve seen seem are focused on the task of learning the alphabet and numbers/counting from a young age - seems a bit forced... Would you read these types of books to your LO or look for something else? <br/>\n<br/>\nI&#39;m planning to make some hard cover books for our DD in the next few months and then make them with her when she is interested.<br/>\n<br/>\nI suppose another option is that I could read to her what I&#39;m reading?<br/>\n<br/>\nAny advice/ideas would be great!<br/>\n<br/>\nBest wishes,<br/>\nKeely</div>","specialLinks":[]}],"prevTopicId":49500,"nextTopicId":49483}}