{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":42,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1254014655","msgId":41635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxQkMwQUMzLTA4RDgtNEE1NC05OTg5LTc5N0M4MkU5Q0YxREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGg5bWM2ZiszN2JiQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5bWM2ZiszN2JiQGVHcm91cHMuY29tPg=="},"prevInTopic":41634,"nextInTopic":41636,"prevInTime":41634,"nextInTime":41636,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... It s a good way to get him to learn how to be sneaky and hide what he s doing. The actions say it s okay to spy on someone just because you think it s","messageBody":"<div id=\"ygrps-yiv-444437417\"><blockquote><span title=\"ireply\">&gt; Use of mirrors carefully locations in a room reorg. is a good way  <br/>\n&gt; to catch your older sibling out!<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s a good way to get him to learn how to be sneaky and hide what  <br/>\nhe&#39;s doing.<br/>\n<br/>\nThe actions say it&#39;s okay to spy on someone just because you think  <br/>\nit&#39;s right. So it would be okay if the kids put a tape recorder under  <br/>\nthe couch to make sure you weren&#39;t keeping secrets, or put a video  <br/>\ncamera in the shower to make sure you were washing as thoroughly as  <br/>\nyou insist they do?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Next time he hits you, Turn round and thwack him back. None too  <br/>\n&gt; gently and none to hard, just enough to send a message that you too  <br/>\n&gt; have a boundary.<br/>\n<br/>\n </span></blockquote>If I were so upset by something that I hit my husband, and he hit me  <br/>\nback, would I stop and reassess? Would I reasonably conclude that I  <br/>\nneeded to find a better outlet for my feels? No, I&#39;d be even more  <br/>\nemotional and less rational.<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;You WILL stop NOW and you will NOT hit me again. Do You Hear Me?&quot;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Which says &quot;I don&#39;t care why you&#39;re upset. What&#39;s important is my  <br/>\nneeds.&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; and make sure you get a Yes Mommy.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Why is it assumed that a child going through the motions of  <br/>\npoliteness and obedience has the same feelings inside?<br/>\n<br/>\nDo you know that a contract signed under duress can be challenged in  <br/>\ncourt? But your actions are saying it&#39;s okay to make someone say  <br/>\nsomething they don&#39;t agree with. So it will be okay if your kids do  <br/>\nthat as adults in business?<br/>\n<blockquote><span title=\"ireply\"> &gt; Instead I suggest a Thinking Spot, where your son thinks about his  <br/>\n&gt; behaviour.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>When someone humiliated me and left me to think about it, I did *not*  <br/>\nthink about how I could do better. I thought about how much I  <br/>\ndisliked them and why would they think making me feel small and awful  <br/>\nwould be a good way to handle anything.<br/>\n<br/>\nDo people forget what it felt like when they were kids? Have they  <br/>\nforgotten their own thoughts as children when they were treated like  <br/>\nthat? Do adults think kids are alien creatures that don&#39;t react like  <br/>\nhumans to humiliation and feeling powerless?<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a particularly strong willed son who one time only was sent  <br/>\n&gt; this kind of room just once. He ended up staying all afternoon. We  <br/>\n&gt; checked on him at regular intervals - hardly any talking. In the  <br/>\n&gt; end he did back down.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>What if someone said, &quot;I have a particularly strong willed wife who  <br/>\none time only was sent this kind of room just once. She ended up  <br/>\nstaying all afternoon. I checked on her at regular intervals - hardly  <br/>\nany talking. In the end she did back down.&quot;<br/>\n<br/>\nIf anyone thinks it would be barbaric for a husband to treat his wife  <br/>\nthat way, why is it any less barbaric for a parent to treat a child  <br/>\nthat way?<br/>\n<br/>\nChildren are human beings. They have a lesser understanding of how to  <br/>\nbe in the world, but it doesn&#39;t make them less human. Humiliation,  <br/>\npowerlessness, disregard of feelings, being slapped, children  have  <br/>\nthe same emotions in response to those that adults do. Why would a  <br/>\nparent want to make their child feel that way *when there are other  <br/>\nmore respectful ways* to deal with situations?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1254014202","msgId":41634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bWVkcSsza3NnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFBNjBDMTU3LTkxREItNDkzRC1CNTAwLTc0REU5RDExQTExRkBnbWFpbC5jb20+"},"prevInTopic":41633,"nextInTopic":41635,"prevInTime":41633,"nextInTime":41635,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"~~The thing that is burning in my head right now is the smacking the child to teach them that hitting is wrong. I m just not getting that one.~~ Exactly. My","messageBody":"<div id=\"ygrps-yiv-1462479972\">~~The thing that is burning in my head right now is the smacking the<br/>\nchild to &#39;teach&#39; them that hitting is wrong. I&#39;m just not getting that<br/>\none.~~<br/>\n<br/>\nExactly.<br/>\n<br/>\nMy other thought is that if you have the energy to &quot;spy&quot; on your kids with mirrors, maybe just get more connected and assist them rather than waiting for things to go wrong. <br/>\n<br/>\nLots of thoughts. Anyhoo....the person wrote to me and said they&#39;ve unsubscribed because we obviously are on a different thought process and she feels &quot;gentle discipline&quot; is sometimes necessary but maybe someone else will benefit from the responses here. It&#39;s not gentle to hit. It&#39;s not exactly modeling the kind of behavior you&#39;d want your child to learn either.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1254013438","msgId":41633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBNjBDMTU3LTkxREItNDkzRC1CNTAwLTc0REU5RDExQTExRkBnbWFpbC5jb20+","inReplyToHeader":"PGg5bWM2ZiszN2JiQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5bWM2ZiszN2JiQGVHcm91cHMuY29tPg=="},"prevInTopic":41632,"nextInTopic":41634,"prevInTime":41632,"nextInTime":41634,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"Wow! I really wish I could fully repond but I have only the phone right now. I feel like this is very disrespectful of all parties involved. It is mainstream","messageBody":"<div id=\"ygrps-yiv-1810961866\">Wow! I really wish I could fully repond but I have only the phone  <br/>\nright now.<br/>\n<br/>\nI feel like this is very disrespectful of all parties involved. It is  <br/>\nmainstream thinking and not likely to garner understanding or love or  <br/>\nrespect. I would not like to be treated that way. I would not treat a  <br/>\nfriend that way.<br/>\n<br/>\nThe thing that is burning in my head right now is the smacking the  <br/>\nchild to &#39;teach&#39; them that hitting is wrong. I&#39;m just not getting that  <br/>\none.<br/>\n<br/>\nI look forward to reading the thread on this one.<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\nOn Sep 26, 2009, at 8:38 PM, &quot;gruvystarchild&quot;  <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m posting this anonymously for someone because I feel feedback on  <br/>\n&gt; this might help a lot of people. It wasn&#39;t sent anonymously but I  <br/>\n&gt; feel it necessary to post that way for a member that might not be  <br/>\n&gt; prepared for the responses.<br/>\n&gt; Ren<br/>\n&gt; ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n&gt;<br/>\n&gt; Various thoughts....<br/>\n&gt;<br/>\n&gt; 1) Are you sure your other son isn&#39;t provoking him behind your back?  <br/>\n&gt; Your younger son would then be really mad with you as he feels you  <br/>\n&gt; are unfair and then he will hit you, what do you expect? If he can&#39;t  <br/>\n&gt; get your fair assessment of the situation, then will do what he can  <br/>\n&gt; to get your attention<br/>\n&gt;<br/>\n&gt; Use of mirrors carefully locations in a room reorg. is a good way to  <br/>\n&gt; catch your older sibling out!<br/>\n&gt;<br/>\n&gt; 2) Do you intervene in your boys fights? If not it sounds like you  <br/>\n&gt; might need to get them both to sit down and work out how to get  <br/>\n&gt; along and how to treat each other better. No you should not  <br/>\n&gt; intervene a lot but if you don&#39;t teach them to say avoid each other  <br/>\n&gt; when they are annoyed or feeling annoying, rather than going to the  <br/>\n&gt; other sibling and creating a fight. May be one doesn&#39;t like a  <br/>\n&gt; certain type of behaviour and that causes the fight ? Whatever the  <br/>\n&gt; reason when that aspect is reached they need to be taught what to do  <br/>\n&gt; so that their fight does not begin.<br/>\n&gt;<br/>\n&gt; 3) This thought probably will not go down well with any of you but I  <br/>\n&gt; shall say it anyway.<br/>\n&gt;<br/>\n&gt; First and foremost I think you should be measured in your response<br/>\n&gt; AND Know you are in control of yourself<br/>\n&gt;<br/>\n&gt; Next time he hits you, Turn round and thwack him back. None too  <br/>\n&gt; gently and none to hard, just enough to send a message that you too  <br/>\n&gt; have a boundary.<br/>\n&gt;<br/>\n&gt; Then, catch his arms so you don&#39;t get a return, go down to his level  <br/>\n&gt; and say without shouting - calmly and in a controlled strong voice.  <br/>\n&gt; &quot;You WILL stop NOW and you will NOT hit me again. Do You Hear Me?&quot;<br/>\n&gt; and make sure you get a Yes Mommy. If you don&#39;t get those words and  <br/>\n&gt; he squirms etc then you put him on a &#39;spot&#39;. I used to use a naughty  <br/>\n&gt; spot but I find that immotive. Instead I suggest a Thinking Spot,  <br/>\n&gt; where your son thinks about his behaviour. The spot should not have  <br/>\n&gt; anything interesting around. Child needs to be made to sit rather  <br/>\n&gt; than lie there etc. I use the bottom step. No toys to play with,  <br/>\n&gt; less likely to lol around. I don&#39;t particularly like this technique  <br/>\n&gt; but it is not a bad way to get the message across that you are in  <br/>\n&gt; charge.<br/>\n&gt;<br/>\n&gt; Thinking time - 1 minute for every year of his age. No longer. Still  <br/>\n&gt; no luck in getting the message from him that he will stop, then send  <br/>\n&gt; him to a room with nothing to play with in - not his own room and  <br/>\n&gt; say he is to stay there until he assures you he will not hit you  <br/>\n&gt; again. I have a particularly strong willed son who one time only was  <br/>\n&gt; sent this kind of room just once. He ended up staying all afternoon.  <br/>\n&gt; We checked on him at regular intervals - hardly any talking. In the  <br/>\n&gt; end he did back down. I think it killed us more than him! It was  <br/>\n&gt; worth it as it DID work. Don&#39;t of course do that on a regular basis  <br/>\n&gt; but it may be necessary to get this message well and truly home. You  <br/>\n&gt; son CAN help it okay. You don&#39;t want to be a battered mother as he  <br/>\n&gt; grows up - yes this is extremist but I believe rightly or wrongly  <br/>\n&gt; that if you don&#39;t get these priorities clear at this age you don&#39;t  <br/>\n&gt; stand a hope in hell later!<br/>\n&gt;<br/>\n&gt; I perceive that you need to a) catch him out by surprising him that  <br/>\n&gt; you do have ability to hit him and then send the signal of this is  <br/>\n&gt; the end of the line.<br/>\n&gt;<br/>\n&gt; Is cause and effect now understood? I suggest this will help. You  <br/>\n&gt; can say, well if you like I can hit you back or better still we just  <br/>\n&gt; do not have this behaviour at all.<br/>\n&gt;<br/>\n&gt; 4) Each time he hits you, you take away something that he loves  <br/>\n&gt; most, be it a toy or an activity. That does not get returned for a  <br/>\n&gt; good period of time, minimum a week - depends on the frequency of  <br/>\n&gt; his hitting you. DO NOT RELENT!<br/>\n&gt;<br/>\n&gt; Good luck<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1254011919","msgId":41632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bWM2ZiszN2JiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg5bTVhaStnZzVwQGVHcm91cHMuY29tPg=="},"prevInTopic":41631,"nextInTopic":41633,"prevInTime":41631,"nextInTime":41633,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"I m posting this anonymously for someone because I feel feedback on this might help a lot of people. It wasn t sent anonymously but I feel it necessary to post","messageBody":"<div id=\"ygrps-yiv-462440276\">I&#39;m posting this anonymously for someone because I feel feedback on this might help a lot of people. It wasn&#39;t sent anonymously but I feel it necessary to post that way for a member that might not be prepared for the responses.<br/>\n Ren<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\n<br/>\n<br/>\nVarious thoughts....<br/>\n<br/>\n1)  Are you sure your other son isn&#39;t provoking him behind your back?  Your younger son would then be really mad with you as he feels you are unfair and then he will hit you, what do you expect?  If he can&#39;t get your fair assessment of the situation, then will do what he can to get your attention<br/>\n<br/>\nUse of mirrors carefully locations in a room reorg. is a good way to catch your older sibling out!<br/>\n<br/>\n2)    Do you intervene in your boys fights?  If not it sounds like you might need to get them both to sit down and work out how to get along and how to treat each other better.  No you should not intervene a lot but if you don&#39;t teach them to say avoid each other when they are annoyed or feeling annoying, rather than going to the other sibling and creating a fight.  May be one doesn&#39;t like a certain type of behaviour and that causes the fight ?  Whatever the reason when that aspect is reached they need to be taught what to do so that their fight does not begin.<br/>\n<br/>\n3) This thought probably will not go down well with any of you but I shall say it anyway.<br/>\n<br/>\nFirst and foremost I think you should be measured in your response<br/>\nAND Know you are in control of yourself<br/>\n<br/>\nNext time he hits you, Turn round and thwack him back.  None too gently and none to hard, just enough to send a message that you too have a boundary.<br/>\n<br/>\nThen, catch his arms so you don&#39;t get a return, go down to his level and say without shouting - calmly and in a controlled strong voice.  &quot;You WILL stop NOW and you will NOT hit me again.  Do You Hear Me?&quot;<br/>\nand make sure you get a Yes Mommy.  If you don&#39;t get those words and he squirms etc then you put him on a &#39;spot&#39;.   I used to use a naughty spot but I find that immotive.  Instead I suggest a Thinking Spot, where your son thinks about his behaviour.  The spot should not have anything interesting around.  Child needs to be made to sit rather than lie there etc.  I use the bottom step.  No toys to play with, less likely to lol around.  I don&#39;t particularly like this technique but it is not a bad way to get the message across that you are in charge.<br/>\n<br/>\nThinking time - 1 minute for every year of his age.  No longer.  Still no luck in getting the message from him that he will stop, then send him to a room with nothing to play with in - not his own room and say he is to stay there until he assures you he will not hit you again.  I have a particularly strong willed son who one time only was sent this kind of room just once.  He ended up staying all afternoon.  We checked on him at regular intervals - hardly any talking.  In the end he did back down.  I think it killed us more than him!  It was worth it as it DID work.  Don&#39;t of course do that on a regular basis but it may be necessary to get this message well and truly home.  You son CAN help it okay.  You don&#39;t want to be a battered mother as he grows up - yes this is extremist but I believe rightly or wrongly that if you don&#39;t get these priorities clear at this age you don&#39;t stand a hope in hell later!<br/>\n<br/>\nI perceive that you need to a) catch him out by surprising him that you do have ability to hit him and then send the signal of this is the end of the line.<br/>\n<br/>\nIs cause and effect now understood?  I suggest this will help.  You can say, well if you like I can hit you back or better still we just do not have this behaviour at all.<br/>\n<br/>\n4)  Each time he hits you, you take away something that he loves most, be it a toy or an activity.  That does not get returned for a good period of time, minimum a week - depends on the frequency of his hitting you.  DO NOT RELENT!<br/>\n<br/>\nGood luck</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1254004882","msgId":41631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bTVhaStnZzVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg5bTBkNitqZzkwQGVHcm91cHMuY29tPg=="},"prevInTopic":41630,"nextInTopic":41632,"prevInTime":41630,"nextInTime":41632,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"A couple things occured to me, just now. One is - do the boys have Guys to play with? That was something that helped Ray a lot. I m good at things like","messageBody":"<div id=\"ygrps-yiv-174242121\">A couple things occured to me, just now. One is - do the boys have Guys to play with? That was something that helped Ray a lot. I&#39;m good at things like climbing and running around (moreso ten years ago when he was little!) but not rough-housing, and neither is George. So we found Ray some &quot;guy&quot; friends he could get really rough with. <br/>\n<br/>\nThe other part is tied into this, bc there are 2 boys involved - one is hitting you, but the other is still involved and, at 9 he&#39;s old enough to be saying things to get his brother all worked up to the point where he wants to hit something. So it may be as much a matter of finding ways for the older boy to blow off steam as the younger. If the 9yo (I&#39;m forgetting names already, sorry) isn&#39;t as physical, he may still need someone he can bounce things off of, verbally maybe. Just this morning Mo and George were engaged in a hearty insult contest - George is good at that sort of &quot;rough&quot; play, better than I am. Even if the older boy is just as physical as the younger, though, he may want a rough-and-tumble playmate he doesn&#39;t have to share all the time. Your guys are right at that gap in ages where they can really grate on one anothers nerves. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253999846","msgId":41630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bTBkNitqZzkwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg5bHYxZCtqNXVwQGVHcm91cHMuY29tPg=="},"prevInTopic":41629,"nextInTopic":41631,"prevInTime":41629,"nextInTime":41631,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"~~Of course that only works if we re in the house.~~ Take things with you then. Take a pillow to hit, or a squeezy toy to mash. Pushing games work really well","messageBody":"<div id=\"ygrps-yiv-193652710\">~~Of course that only works if we&#39;re in the house.~~<br/>\n<br/>\n<br/>\nTake things with you then. Take a pillow to hit, or a squeezy toy to mash. Pushing games work really well for Jalen. When he starts amping up I yell &quot;hey, push me!&quot; and hold out my hands. We push against each other (only effective if it&#39;s utilized as an outlet way before a need to hit) or I push on his feet while he &quot;cycles&quot;. <br/>\n<br/>\nResistance games, large movements, anything where he can funnel all that energy into something before the dynamics are devolving.<br/>\n<br/>\nBack when he was really quick to hit, I would sometimes see it coming and grab a pillow (instead of saying &quot;no&quot; or &quot;stop&quot;) and say &quot;Hit it! Hit it hard!&quot; and encourage the hitting that way. It worked really well for him but he was actually blowing up in milli-seconds, rather than searching someone out to pound on after an incident. <br/>\n<br/>\nIn the case of delayed reaction, I would think someone needs to be there making sure the dynamics are smooth before he reaches melting point.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253998445","msgId":41629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bHYxZCtqNXVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI1MTk1MnAxY2M1N2U5ZXJjZjE2Y2QzMzMzZTFmNmViQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41628,"nextInTopic":41630,"prevInTime":41628,"nextInTime":41630,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... ********************* It sounds like you have some strategies already - maybe its just a matter of being more present with him and applying them more","messageBody":"<div id=\"ygrps-yiv-1154939092\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Three Mommies &lt;3mommies@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We&#39;ve tried re-directing his anger. It is a physical anger. I can see it go<br/>\n&gt; through his body. The only thing that really works well is going with him to<br/>\n&gt; the TV room where there are big soft blocks and pillows he can throw around.<br/>\n&gt; He said that really helps. Of course that only works if we&#39;re in the house.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nIt sounds like you have some strategies already - maybe its just a matter of being more present with him and applying them more consistently. That can be challenging with several kids and two other adults vying for your attention, I&#39;m sure! <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253997866","msgId":41628,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bHVmYStmOHBrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg5bGg4MCszZjI3QGVHcm91cHMuY29tPg=="},"prevInTopic":41627,"nextInTopic":41629,"prevInTime":41627,"nextInTime":41629,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... *********************** I want to second this. Pare your words down to sound bites in the moment. A shouted Whoa! can be more informative, in the moment,","messageBody":"<div id=\"ygrps-yiv-339551175\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;carenkh&quot; &lt;carenkh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And I don&#39;t mean to be picky, and I don&#39;t know if that&#39;s the way you say it, but boy, that&#39;s a lot of words! A simple, &quot;NO!&quot; or &quot;Don&#39;t hit me!&quot; or &quot;hit this pillow!&quot; might work better in the moment. Longer phrases later, after he&#39;s calm.<br/>\n </span></blockquote>***********************<br/>\n<br/>\nI want to second this. Pare your words down to sound bites in the moment. A shouted &quot;Whoa!&quot; can be more informative, in the moment, than a sentence of explanation. If he&#39;s mad, he&#39;s not really going to be able to process a whole lot of words, so keep them to an absolute minimum. <br/>\n<br/>\nRay liked lots and lots of words most of the time when he was little, so I had to learn to speak in single words or short phrases with Mo. It helped me to actually think about which words I would use next time I needed to convey something, since I wasn&#39;t used to conveying information in such short packets. So &quot;Don&#39;t do that&quot; was pared down to &quot;Not&quot; for instance and &quot;Here, hit this&quot; became simply &quot;This.&quot; <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253997197","msgId":41627,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bHRxZCttYWluQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2MTkyOC42MDQ5NS5xbUB3ZWI1NTgwMS5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":41626,"nextInTopic":41628,"prevInTime":41626,"nextInTime":41628,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... *********************** I think this is a really important point, that kids often need our help in dealing with difficult emotions. Simply saying no to","messageBody":"<div id=\"ygrps-yiv-307956464\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jeff Sabo &lt;freeboysdad@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We found that this helped with two issues: the need to hit (which we interpreted as the need to get a physical release for their anger or frustration), and the need to hit US (which we interpreted as the need to get us involved in their feelings so we could interact with them and help them.) <br/>\n </span></blockquote>***********************<br/>\n<br/>\nI think this is a really important point, that kids often need our help in dealing with difficult emotions. Simply saying &quot;no&quot; to behavior that arises out of those feelings isn&#39;t helping the underlying need - what do I do with all this anger? Being on-hand with some suggestions can help a lot, but it will help most in a context of offers like those Jeff and others have suggested. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253996673","msgId":41626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bHRhMSsyMHBxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg5bGNsOSttYTkyQGVHcm91cHMuY29tPg=="},"prevInTopic":41625,"nextInTopic":41627,"prevInTime":41625,"nextInTime":41627,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... There s a difference between showing anger and turning it against someone, but in the moment, and with kids, and working around personal baggage, that s","messageBody":"<div id=\"ygrps-yiv-2084572023\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;kazglc&quot; &lt;kazzarat@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  There&#39;s lots of advice about controlling your anger and breathing through the hard times but then other advice saying show when you are angry when it is valid like when you or someone else is being hit.   But when I show my anger and the kid cries and is upset cos they feel i have been horrible then has my anger turned into a punishment? <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>There&#39;s a difference between showing anger and turning it against someone, but in the moment, and with kids, and working around personal baggage, that&#39;s pretty nuancy territory, too. Mo is sensitive to shouting, so I&#39;m careful not to shout at her, or in ways that startle or upset her. That was something I had to learn, though. I have big, loud reactions and had to figure out how to be big and loud without those things being threatening. Its doable, but its challenging - and I really had to be clear in my own head that I Didn&#39;t want to direct my anger at my kid. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; A counsellor once told me it seemed that i was very scared of using my own power, she said many people who felt very scared and powerless as kids are uncomfortable using their power as adults - maybe that has something to do with it? <br/>\n </span></blockquote>*******************<br/>\n<br/>\nI&#39;m not trying to use my personal power *against* my kids - although I am trying to use it For them, not in the &quot;for their own good&quot; sense, but in the sense of being their advocate and helper, even in the face of other adults. But I&#39;m also really good at being clear about my boundaries, not just in terms of things like hitting but letting people around me know when I&#39;m tired, or things are too loud, or I&#39;m in a grouchy mood. It might help, if boundaries are something you struggle with, to start with those kinds of things. Those tend to be less loaded with emotion in the moment and easier to express without snapping. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;i guess its hard in this kinda format where people cant really tell what is going on for sure cos they only have a posters words to paint a picture.<br/>\n </span></blockquote>**************<br/>\n<br/>\nYes, that&#39;s a big part of the conflicting-seeming information being thrown out. The other thing that makes it hard is that issues like this happen in a wider context than just the five minutes surrounding the incident. Sometimes its a matter of changing the way you do Everything, to change that context. That, ultimately, was what we found with Ray when he was little. It wasn&#39;t about changing any one thing, but everything, so that he wasn&#39;t melting down as much. Then the &quot;in the moment&quot; strategies were more effective, too. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253993740","msgId":41625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bHFlYytta2FrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2MTkyOC42MDQ5NS5xbUB3ZWI1NTgwMS5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":41624,"nextInTopic":41626,"prevInTime":41624,"nextInTime":41626,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"Something else to consider with a child that can get mad at a sibling and then go seek out someone else to pound... are you present and involved in their","messageBody":"<div id=\"ygrps-yiv-1177028631\">Something else to consider with a child that can get mad at a sibling and then go seek out someone else to pound...<br/>\nare you present and involved in their interactions long before it gets to a need for hitting? If there are difficult interactions between them the younger one may be feeling powerless and need more help from you.<br/>\n<br/>\nAre they on their own or is a parent present, connected and involved in their activities? This may be preventable earlier on. You need to know what is leading up to a need to hit and how to buffer things when they don&#39;t have the tools to cope.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253993588","msgId":41624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bHE5ays4YTY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg5bGg4MCszZjI3QGVHcm91cHMuY29tPg=="},"prevInTopic":41623,"nextInTopic":41625,"prevInTime":41623,"nextInTime":41625,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"~~*He* hits. He s in our family. By saying, our family doesn t hit or, we live in a no-hitting house , I was essentially putting him outside of the family!","messageBody":"<div id=\"ygrps-yiv-1434880607\">~~*He* hits. He&#39;s in our family. By saying, &quot;our family doesn&#39;t hit&quot; or, &quot;we live in a no-hitting house&quot;, I was essentially putting him outside of the family! *We&#39;re* over here, and YOU, the bad hitting child, are over there. Not the message I wanted to send.~~<br/>\n<br/>\nI&#39;m glad you brought this up Caren. The other problem with being a &quot;no-hitting&quot; house is what happens when a child SHOULD hit someone (the rare possibility they might be attacked or for some reason need to defend themselves) and then feels like they aren&#39;t allowed?  Better to set your own personal boundaries, confidently than to label the entire household or an entire behavior.<br/>\n<br/>\nThere are times I hope my kids would hit, tear, kick, scratch...whatever they needed to do to get away from something/someone dangerous. Hitting is ok. Hitting someone who doesn&#39;t like being hit is not. I can think of times when certain kinds of hitting were part of a game too...and both parties were agreeable to the physicality of it. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":284534827,"authorName":"Jeff Sabo","from":"Jeff Sabo &lt;freeboysdad@...&gt;","profile":"freeboysdad","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253986129","msgId":41623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2MTkyOC42MDQ5NS5xbUB3ZWI1NTgwMS5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PGg5bGg4MCszZjI3QGVHcm91cHMuY29tPg==","referencesHeader":"PGg5bGg4MCszZjI3QGVHcm91cHMuY29tPg=="},"prevInTopic":41622,"nextInTopic":41624,"prevInTime":41622,"nextInTime":41624,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"One thing we have done when hitting was an issue (it s now wrestling instead) was pretty simple: we would periodically go to yard sales and get things that","messageBody":"<div id=\"ygrps-yiv-1737518629\">One thing we have done when hitting was an issue (it&#39;s now wrestling instead) was pretty simple: we would periodically go to yard sales and get things that would be fun to destroy with a hammer or a stick, like old broken guitars or something similar that you could get for $2. When the hitting stared, we&#39;d break in with a simple &quot;Your brother and I don&#39;t like being hit, but you know what would be a BLAST to hit? How about that old guitar? We could destroy the HELL out of that thing! You grab the hammer, I&#39;ll get your goggles, and let&#39;s go get it!&quot; <br/>\n<br/>\nWe found that this helped with two issues: the need to hit (which we interpreted as the need to get a physical release for their anger or frustration), and the need to hit US (which we interpreted as the need to get us involved in their feelings so we could interact with them and help them.) If we beat up an old guitar or unwanted toy, they got to release the anger - and if we helped, they got to see that we understood.  <br/>\n<br/>\nJeff <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253985758","msgId":41622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4QjhFQkRFLTc0N0UtNEY2RC04Mzc0LUJEM0Q2MjRERjZDNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGg5bGNsOSttYTkyQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5bGNsOSttYTkyQGVHcm91cHMuY29tPg=="},"prevInTopic":41621,"nextInTopic":41623,"prevInTime":41621,"nextInTime":41623,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... You don t need to be angry to be firm and adamant. Maybe that s where it feels like you re taking a wrong turn? Maybe get down on his level and look him","messageBody":"<div id=\"ygrps-yiv-523305984\">On Sep 26, 2009, at 11:40 AM, kazglc wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I dont like showing very strong anger - the sort that does cause  <br/>\n&gt; the crying but also brings a &#39;sorry&#39; and a hug afterwards from my son<br/>\n<br/>\n </span></blockquote>You don&#39;t need to be angry to be firm and adamant. Maybe that&#39;s where  <br/>\nit feels like you&#39;re taking a wrong turn?<br/>\n<br/>\nMaybe get down on his level and look him right in the eye and state  <br/>\nyour boundary firmly.<br/>\n<br/>\nDon&#39;t think of it as a method to stop him from hitting because *you*  <br/>\ncan&#39;t stop him taking a swing at you, only he can. But you are making  <br/>\nyour boundaries clear.<br/>\n<br/>\nThat said, recognize that he&#39;s trying to meet a need. He&#39;s got  <br/>\nsomething building up in him and hitting is a satisfying release. If  <br/>\nyou turn the whole focus on you&#39;re need not to be hit and what he  <br/>\ncan&#39;t do with his need, you haven&#39;t helped him find something better.  <br/>\nAs others suggested, help him find an acceptable outlet.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253984320","msgId":41621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bGg4MCszZjI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI1MjExMmkxZGY5MjdjYnQ2ZjIxMjcyOTc2Y2EzMzI1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41620,"nextInTopic":41622,"prevInTime":41620,"nextInTime":41622,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"-=-I have moved aside, caught his hands, held him when necessary, and said loudly, clearly, and firmly that I don t hit and I don t allow to hit me. We live","messageBody":"<div id=\"ygrps-yiv-2090777584\">-=-I have moved aside, caught his hands, held him when necessary, and said loudly, clearly, and firmly that I don&#39;t hit and I don&#39;t allow to hit me. &quot;We live in a no-hitting house. I don&#39;t hit you or anyone else and I&#39;m not going to let you hit me or anyone else. Period.&quot; (Said in that annoying slow clear loud voice that no one wants to hear, and sometimes, to be honest, even yelled.)-=-<br/>\n<br/>\nWhen I was just learning about mindful parenting, I overheard a friend of mine use the phrase to  her son: &quot;Our family doesn&#39;t hit!&quot; At the time, I thought it was a kind way of setting boundaries. The first time I said it, though, to Seth, I felt in my gut how harmful it was to say that to him. *He* hits. He&#39;s in our family. By saying, &quot;our family doesn&#39;t hit&quot; or, &quot;we live in a no-hitting house&quot;, I was essentially putting him outside of the family! *We&#39;re* over here, and YOU, the bad hitting child, are over there. Not the message I wanted to send.<br/>\n<br/>\nI changed it to, &quot;If you need to hit, hit this&quot;, hitting the back of the couch at the same time.<br/>\n<br/>\nAnd I don&#39;t mean to be picky, and I don&#39;t know if that&#39;s the way you say it, but boy, that&#39;s a lot of words! A simple, &quot;NO!&quot; or &quot;Don&#39;t hit me!&quot; or &quot;hit this pillow!&quot; might work better in the moment. Longer phrases later, after he&#39;s calm.<br/>\n<br/>\nIf there&#39;s any wavering in your intent, if you&#39;re saying &quot;no!&quot; but thinking, &quot;Maybe he&#39;s hitting me because he needs to hit and I&#39;m a safe person to hit, and I want to meet his need, etc., etc., etc.&quot; then he&#39;ll pick up on the energy, not the words. Being clear in your own self sends a strong message: Don&#39;t hit me! Ever!<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":269037874,"authorName":"kazglc","from":"&quot;kazglc&quot; &lt;kazzarat@...&gt;","profile":"kazglc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253979625","msgId":41620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5bGNsOSttYTkyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI1MjExMmkxZGY5MjdjYnQ2ZjIxMjcyOTc2Y2EzMzI1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41619,"nextInTopic":41621,"prevInTime":41619,"nextInTime":41621,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"I struggle with the hitting thing too and have been told i m not saying no strongly enough or whatever in an online forum - like you, i do think i say it","messageBody":"<div id=\"ygrps-yiv-1920540339\">I struggle with the hitting thing too and have been told i&#39;m not saying &#39;no&#39; strongly enough or whatever in an online forum - like you, i do think i say it strongly etc and i just kinda feel really confused about it all. <br/>\n<br/>\n There&#39;s lots of advice about controlling your anger and breathing through the hard times but then other advice saying show when you are angry when it is valid like when you or someone else is being hit.   But when I show my anger and the kid cries and is upset cos they feel i have been horrible then has my anger turned into a punishment? <br/>\n<br/>\n I dont like showing very strong anger - the sort that does cause the crying but also brings a &#39;sorry&#39; and a hug afterwards from my son (he&#39;s 4, i have a 15mth old too).  It feels like i have been an ogre and &#39;not nice&#39;.  And i feel guilty - maybe I shouldnt, maybe its cos it reminds me of my mums very scary anger which was often followed by violence.  A counsellor once told me it seemed that i was very scared of using my own power, she said many people who felt very scared and powerless as kids are uncomfortable using their power as adults - maybe that has something to do with it?   Maybe most of the time I&#39;m not showing it strongly even though i think i am - i dont know, but i do know i find it really confusing on how to handle it and the advice can be confusing too - not that people mean it to be and i know they are trying to be helpful but i guess its hard in this kinda format where people cant really tell what is going on for sure cos they only have a posters words to paint a picture.<br/>\n<br/>\nAnyway - just to say i am struggling with similar stuff, only my son hits the baby too, and i&#39;m reading this thread with interest<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":342162722,"authorName":"Chris","from":"Chris &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253972963","msgId":41619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEQkRCRTNCLUU5QjAtNDFBNS1BNUQ2LTA1RDZDMjJCNUREQ0BtY2hzaS5jb20+","inReplyToHeader":"PDM2RjlEMzk5LTQxMTUtNDhGNi1CRERGLTAxQUNENDkwMzczN0BnbWFpbC5jb20+","referencesHeader":"PDM2NDRjMGIzMDkwOTI1MTk1MnAxY2M1N2U5ZXJjZjE2Y2QzMzMzZTFmNmViQG1haWwuZ21haWwuY29tPiA8aDlrMGhwK25nbWZAZUdyb3Vwcy5jb20+IDwzNjQ0YzBiMzA5MDkyNTIxMTJpMWRmOTI3Y2J0NmYyMTI3Mjk3NmNhMzMyNUBtYWlsLmdtYWlsLmNvbT4gPDM2RjlEMzk5LTQxMTUtNDhGNi1CRERGLTAxQUNENDkwMzczN0BnbWFpbC5jb20+"},"prevInTopic":41618,"nextInTopic":41620,"prevInTime":41618,"nextInTime":41620,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... When my son was young like yours, and hit me, I asked my partner to step up and tell our son that he would not allow anybody to hit me, because it is not","messageBody":"<div id=\"ygrps-yiv-2038972894\"><blockquote><span title=\"ireply\">&gt; Perhaps you need another mommy to set in sometimes. She can reitterate<br/>\n&gt; that hitting isn&#39;t ok. While physically removing Ryan from hitting  <br/>\n&gt; you.<br/>\n<br/>\n </span></blockquote>When my son was young like yours, and hit me, I asked my partner to  <br/>\nstep up and tell our son that he would not allow anybody to hit me,  <br/>\nbecause it is not okay and he loves me and wants to protect me from  <br/>\nharm.  He told our son that he loves him and will protect him from  <br/>\nanybody harming him too. That seemed to reach our boy and he never hit  <br/>\nme again.<br/>\n<br/>\nChris in IA<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253965774","msgId":41618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2RjlEMzk5LTQxMTUtNDhGNi1CRERGLTAxQUNENDkwMzczN0BnbWFpbC5jb20+","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI1MjExMmkxZGY5MjdjYnQ2ZjIxMjcyOTc2Y2EzMzI1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDM2NDRjMGIzMDkwOTI1MTk1MnAxY2M1N2U5ZXJjZjE2Y2QzMzMzZTFmNmViQG1haWwuZ21haWwuY29tPiA8aDlrMGhwK25nbWZAZUdyb3Vwcy5jb20+IDwzNjQ0YzBiMzA5MDkyNTIxMTJpMWRmOTI3Y2J0NmYyMTI3Mjk3NmNhMzMyNUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":41617,"nextInTopic":41619,"prevInTime":41617,"nextInTime":41619,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"I find when you choose respectful parenting over punative parenting it takes longer. It sounds like you are doing what you need to do. It sounds like he may","messageBody":"<div id=\"ygrps-yiv-823016075\">I find when you choose respectful parenting over punative parenting it  <br/>\ntakes longer. It sounds like you are doing what you need to do. It  <br/>\nsounds like he may need to grow into knowning he can&#39;t hit you. It&#39;s  <br/>\nfrustrating to wait but kids sometimes need to hear things a thousand  <br/>\ntimes.<br/>\n<br/>\nPerhaps you need another mommy to set in sometimes. She can reitterate  <br/>\nthat hitting isn&#39;t ok. While physically removing Ryan from hitting you.<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 26, 2009, at 12:12 AM, Three Mommies &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:3mommies@...\">3mommies@...</a>&gt; wrote:<br/>\n<br/>\n&gt; &gt;<br/>\n&gt; &gt; He has enough to get mad at someone, then go seek out another  <br/>\n&gt; person to<br/>\n&gt; &gt; hit. Big message that your signals to him are very different from  <br/>\n&gt; what his<br/>\n&gt; &gt; brother is sending.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; I have no idea why this is.<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; If he needs to hit, it sounds like there are great options. Allowing<br/>\n&gt; &gt; someone to hit you is not ok. Even my child who has very intense  <br/>\n&gt; behaviors<br/>\n&gt; &gt; and had almost zero impulse control at the age of six, did not hit  <br/>\n&gt; me. I<br/>\n&gt; &gt; won&#39;t let people hit me. He tried, he caught me by surprise very<br/>\n&gt; &gt; infrequently.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; The same is true here.<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I had ways of blocking, moving back while very firmly stating &quot;I  <br/>\n&gt; will NOT<br/>\n&gt; &gt; let anyone hit me!&quot; and such....I like myself too much to let  <br/>\n&gt; anyone hit me<br/>\n&gt; &gt; and a child needs to know that you care for yourself enough to  <br/>\n&gt; stop them<br/>\n&gt; &gt; when they&#39;re hurting you. You&#39;d protect your other children from  <br/>\n&gt; his blows,<br/>\n&gt; &gt; protect yourself too.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; I have moved aside, caught his hands, held him when necessary, and  <br/>\n&gt; said<br/>\n&gt; loudly, clearly, and firmly that I don&#39;t hit and I don&#39;t allow to  <br/>\n&gt; hit me.<br/>\n&gt; &quot;We live in a no-hitting house. I don&#39;t hit you or anyone else and  <br/>\n&gt; I&#39;m not<br/>\n&gt; going to let you hit me or anyone else. Period.&quot; (Said in that  <br/>\n&gt; annoying slow<br/>\n&gt; clear loud voice that no one wants to hear, and sometimes, to be  <br/>\n&gt; honest,<br/>\n&gt; even yelled.)<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Unschooling isn&#39;t about always saying &quot;yes&quot; or using a sweet voice  <br/>\n&gt; when<br/>\n&gt; &gt; things aren&#39;t cool. There are times to be firm and when someone  <br/>\n&gt; tries to hit<br/>\n&gt; &gt; me (or anyone else), that&#39;s one of them. Yes, look at underlying  <br/>\n&gt; needs and<br/>\n&gt; &gt; provide outlets. But also be clear with others about how you want  <br/>\n&gt; to be<br/>\n&gt; &gt; treated. Not just after it happens.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Ren<br/>\n&gt;<br/>\n&gt; I have never been accused of always using a sweet voice ;) The word  <br/>\n&gt; &quot;no&quot; is<br/>\n&gt; used here when no is called for and hitting is one of those times. I  <br/>\n&gt; have<br/>\n&gt; held Ryan and to keep him from hurting me. I have even picked him up  <br/>\n&gt; and<br/>\n&gt; moved him to someplace where I could hold more comfortably. I wish I  <br/>\n&gt; had<br/>\n&gt; more tools in my toolbox for this one.<br/>\n&gt;<br/>\n&gt; Peace,<br/>\n&gt; Jean Elizabeth<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253963398","msgId":41617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2UwMWNhM2U5OSRmMWJkNjRjMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PDM2NDRjMGIzMDkwOTI1MTk1MnAxY2M1N2U5ZXJjZjE2Y2QzMzMzZTFmNmViQG1haWwuZ21haWwuY29tPiA8aDlrMGhwK25nbWZAZUdyb3Vwcy5jb20+IDwzNjQ0YzBiMzA5MDkyNTIxMTJpMWRmOTI3Y2J0NmYyMTI3Mjk3NmNhMzMyNUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":41616,"nextInTopic":41618,"prevInTime":41616,"nextInTime":41618,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"Why can t you get a punching bag or even make one from a bag filled with sawdust? Hitting is a physical way to express and get out of the system the adrenaline","messageBody":"<div id=\"ygrps-yiv-1913075463\">Why can&#39;t you get a punching bag or even make one from a bag filled with sawdust?<br/>\n<br/>\nHitting is a physical way to express and get out of the system the adrenaline generated in the body of a person who gets into  a dangerous situation. With dangerous situation I mean any experience that the person may &#39;interpret&#39; in their own mind as upsetting the &#39;comfort zone&#39;.<br/>\n<br/>\nWe used to have a big bag hanging outside from a strong tree branch and I&#39;ve done my sessions on it as a kid.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253938364","msgId":41616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NDRjMGIzMDkwOTI1MjExMmkxZGY5MjdjYnQ2ZjIxMjcyOTc2Y2EzMzI1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGg5azBocCtuZ21mQGVHcm91cHMuY29tPg==","referencesHeader":"PDM2NDRjMGIzMDkwOTI1MTk1MnAxY2M1N2U5ZXJjZjE2Y2QzMzMzZTFmNmViQG1haWwuZ21haWwuY29tPgkgPGg5azBocCtuZ21mQGVHcm91cHMuY29tPg=="},"prevInTopic":41615,"nextInTopic":41617,"prevInTime":41615,"nextInTime":41617,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... I have no idea why this is. ... The same is true here. ... I have moved aside, caught his hands, held him when necessary, and said loudly, clearly, and","messageBody":"<div id=\"ygrps-yiv-46778905\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; He has enough to get mad at someone, then go seek out another person to<br/>\n&gt; hit. Big message that your signals to him are very different from what his<br/>\n&gt; brother is sending.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I have no idea why this is.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If he needs to hit, it sounds like there are great options. Allowing<br/>\n&gt; someone to hit you is not ok. Even my child who has very intense behaviors<br/>\n&gt; and had almost zero impulse control at the age of six, did not hit me. I<br/>\n&gt; won&#39;t let people hit me. He tried, he caught me by surprise very<br/>\n&gt; infrequently.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>The same is true here.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I had ways of blocking, moving back while very firmly stating &quot;I will NOT<br/>\n&gt; let anyone hit me!&quot; and such....I like myself too much to let anyone hit me<br/>\n&gt; and a child needs to know that you care for yourself enough to stop them<br/>\n&gt; when they&#39;re hurting you. You&#39;d protect your other children from his blows,<br/>\n&gt; protect yourself too.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I have moved aside, caught his hands, held him when necessary, and said<br/>\nloudly, clearly, and firmly that I don&#39;t hit and I don&#39;t allow to hit me.<br/>\n&quot;We live in a no-hitting house. I don&#39;t hit you or anyone else and I&#39;m not<br/>\ngoing to let you hit me or anyone else. Period.&quot; (Said in that annoying slow<br/>\nclear loud voice that no one wants to hear, and sometimes, to be honest,<br/>\neven yelled.)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Unschooling isn&#39;t about always saying &quot;yes&quot; or using a sweet voice when<br/>\n&gt; things aren&#39;t cool. There are times to be firm and when someone tries to hit<br/>\n&gt; me (or anyone else), that&#39;s one of them. Yes, look at underlying needs and<br/>\n&gt; provide outlets. But also be clear with others about how you want to be<br/>\n&gt; treated. Not just after it happens.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n<br/>\n<br/>\n </span></blockquote>I have never been accused of always using a sweet voice ;) The word &quot;no&quot; is<br/>\nused here when no is called for and hitting is one of those times. I have<br/>\nheld Ryan and to keep him from hurting me. I have even picked him up and<br/>\nmoved him to someplace where I could hold more comfortably. I wish I had<br/>\nmore tools in my toolbox for this one.<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253934457","msgId":41615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5azBocCtuZ21mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI1MTk1MnAxY2M1N2U5ZXJjZjE2Y2QzMzMzZTFmNmViQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41614,"nextInTopic":41616,"prevInTime":41614,"nextInTime":41616,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"~~I m not convinced he has enough impulse control to refrain from hitting.~~ He has enough to get mad at someone, then go seek out another person to hit. Big","messageBody":"<div id=\"ygrps-yiv-1449756109\">~~I&#39;m not convinced he has enough impulse control to refrain from hitting.~~<br/>\n<br/>\nHe has enough to get mad at someone, then go seek out another person to hit. Big message that your signals to him are very different from what his brother is sending. <br/>\n<br/>\nIf he needs to hit, it sounds like there are great options. Allowing someone to hit you is not ok. Even my child who has very intense behaviors and had almost zero impulse control at the age of six, did not hit me. I won&#39;t let people hit me. He tried, he caught me by surprise very infrequently. <br/>\n<br/>\nI had ways of blocking, moving back while very firmly stating &quot;I will NOT let anyone hit me!&quot; and such....I like myself too much to let anyone hit me and a child needs to know that you care for yourself enough to stop them when they&#39;re hurting you. You&#39;d protect your other children from his blows, protect yourself too.<br/>\n<br/>\nUnschooling isn&#39;t about always saying &quot;yes&quot; or using a sweet voice when things aren&#39;t cool. There are times to be firm and when someone tries to hit me (or anyone else), that&#39;s one of them. Yes, look at underlying needs and provide outlets. But also be clear with others about how you want to be treated. Not just after it happens. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253934156","msgId":41614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5azA4YysyZWpyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI1MTk0OHYzOWJmZTc4ZXUzNDE3M2EzYWRhNWM4YTIzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41613,"nextInTopic":41615,"prevInTime":41613,"nextInTime":41615,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"~~ I asked Ryan about this and he said, Ethan might hit me, but you won t. ~~ So there you go. Big brother has let it be known that he won t tolerate being","messageBody":"<div id=\"ygrps-yiv-2125833192\">~~<br/>\nI asked Ryan about this and he said, &quot;Ethan might hit me, but you won&#39;t.&quot;~~<br/>\n<br/>\nSo there you go. Big brother has let it be known that he won&#39;t tolerate being hit. You need to do the same without resorting to harming anyone. I can grab an arm before it connects with me, look someone in the eye and say &quot;DON&#39;T hit me&quot;. The message that it&#39;s not ok needs to be clear, not wishy-washy at all. If he has enough control to hit someone other than who he&#39;s pissed at, he has enough to stop with some clear direction.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253933560","msgId":41613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NDRjMGIzMDkwOTI1MTk1MnAxY2M1N2U5ZXJjZjE2Y2QzMzMzZTFmNmViQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGg5aWlwayticTVvQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5Z200OCtkaTRjQGVHcm91cHMuY29tPiA8aDlpaXBrK2JxNW9AZUdyb3Vwcy5jb20+"},"prevInTopic":41612,"nextInTopic":41614,"prevInTime":41612,"nextInTime":41614,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... I asked Ryan about this and he said, Ethan might hit me, but you won t. I m curious because it doesn t make sense for a 6 y.o. to have enough ... We","messageBody":"<div id=\"ygrps-yiv-2072391181\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Typically when kids are mad at each other, they might hit their<br/>\n&gt; sibling....that&#39;s understandable. I&#39;m curious why Ryan feels it is not ok to<br/>\n&gt; hit his sibling and ok to hit you? Is it possible that his brother has made<br/>\n&gt; it very clear his does NOT want to be hit and you&#39;re having trouble letting<br/>\n&gt; that be known?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I asked Ryan about this and he said, &quot;Ethan might hit me, but you won&#39;t.&quot;<br/>\n<br/>\nI&#39;m curious because it doesn&#39;t make sense for a 6 y.o. to have enough<br/>\n<blockquote><span title=\"ireply\"> &gt; impulse control to transfer his anger over to someone other than the person<br/>\n&gt; he&#39;s mad at. If he has enough impulse control for that, I&#39;m guessing he has<br/>\n&gt; enough to stop hitting you.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n<br/>\n<br/>\n </span></blockquote>We talked about how I could help him to stop hitting, and, like always, he<br/>\nsaid we could try a secret word or maybe I could just remind him not to hit.<br/>\nThat works some of the time. Maybe it works most of the time. I don&#39;t keep<br/>\nscore of how often something works. It works best if I can catch it just<br/>\nbefore he hits or threatens me.  Esther (one of Ryan&#39;s other moms) thinks it<br/>\nshows that Ryan trusts me in that he is secure in the knowledge that no<br/>\nmatter what he does, I won&#39;t hit him. I suppose that&#39;s true, but I don&#39;t<br/>\nlike being hit.<br/>\n<br/>\nWe&#39;ve tried re-directing his anger. It is a physical anger. I can see it go<br/>\nthrough his body. The only thing that really works well is going with him to<br/>\nthe TV room where there are big soft blocks and pillows he can throw around.<br/>\nHe said that really helps. Of course that only works if we&#39;re in the house.<br/>\nI&#39;m not convinced he has enough impulse control to refrain from hitting.<br/>\nSometimes he does and sometimes he doesn&#39;t. I know that control will come. I<br/>\nhave told him, very clearly that I do not want to be hit ever. I have<br/>\nprevented him from hitting me and even walked away for a few minutes leaving<br/>\nhim with one of his other moms. I always tell him that I love him no matter<br/>\nwhat but that I don&#39;t hit and I don&#39;t want to be hit ever.<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253933285","msgId":41612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NDRjMGIzMDkwOTI1MTk0OHYzOWJmZTc4ZXUzNDE3M2EzYWRhNWM4YTIzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGg5aWlwayticTVvQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5Z200OCtkaTRjQGVHcm91cHMuY29tPiA8aDlpaXBrK2JxNW9AZUdyb3Vwcy5jb20+"},"prevInTopic":41609,"nextInTopic":41613,"prevInTime":41611,"nextInTime":41613,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... I asked Ryan about this and he said, Ethan might hit me, but you won t. I m curious because it doesn t make sense for a 6 y.o. to have enough ... We","messageBody":"<div id=\"ygrps-yiv-47911002\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Typically when kids are mad at each other, they might hit their<br/>\n&gt; sibling....that&#39;s understandable. I&#39;m curious why Ryan feels it is not ok to<br/>\n&gt; hit his sibling and ok to hit you? Is it possible that his brother has made<br/>\n&gt; it very clear his does NOT want to be hit and you&#39;re having trouble letting<br/>\n&gt; that be known?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I asked Ryan about this and he said, &quot;Ethan might hit me, but you won&#39;t.&quot;<br/>\n<br/>\nI&#39;m curious because it doesn&#39;t make sense for a 6 y.o. to have enough<br/>\n<blockquote><span title=\"ireply\"> &gt; impulse control to transfer his anger over to someone other than the person<br/>\n&gt; he&#39;s mad at. If he has enough impulse control for that, I&#39;m guessing he has<br/>\n&gt; enough to stop hitting you.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n<br/>\n<br/>\n </span></blockquote>We talked about how I could help him to stop hitting, and, like always, he<br/>\nsaid we could try a secret word or maybe I could just remind him not to hit.<br/>\nThat works some of the time. Maybe it works most of the time. I don&#39;t keep<br/>\nscore of how often something works. It works best if I can catch it just<br/>\nbefore he hits or threatens me.  Esther (one of Ryan&#39;s other moms) thinks it<br/>\nshows that Ryan trusts me in that he is secure in the knowledge that o<br/>\nmatter what he does, I won&#39;t hit him. I suppose that&#39;s true, but I don&#39;t<br/>\nlike being hit.<br/>\n<br/>\nWe&#39;ve tried re-directing his anger. It is a physical anger. I can see it go<br/>\nthrough his body. The only thing that really works well is going with him to<br/>\nthe TV room where there are big soft blocks and pillows he can throw around.<br/>\nHe said that really helps. Of course that only works if we&#39;re in the house.<br/>\nI&#39;m not convinced he has enough impulse control to refrain from hitting.<br/>\nSometimes he does adn sometimes he doesn&#39;t. I know that control will come. I<br/>\nhave told him, very clearly that I do not want to be hit ever. I have<br/>\nprevented him from hitting me and even walked away for a few minutes leaving<br/>\nhim with one of his other moms. I always tell him that I love him no matter<br/>\nwhat but that I don&#39;t hit and I don&#39;t want to be hit ever.<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253913210","msgId":41609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5amJwcSsxMGJuZkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDU3NTIzLjU3Mjg5LnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":41606,"nextInTopic":41612,"prevInTime":41608,"nextInTime":41610,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... That one bothers me, too. Kids learn pack behavior left to themselves, not good social skills! That being said, though, there can be issues if parents get","messageBody":"<div id=\"ygrps-yiv-324522634\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I took a quick look of what this site bullies2buddies.com says and I see some ideas that I have a probelm with.<br/>\n&gt; &quot;Children learn how to get along all by themselves.&quot;<br/>\n<br/>\n </span></blockquote>That one bothers me, too. Kids learn pack behavior left to themselves, not good social skills! That being said, though, there can be issues if parents get in the middle and take over the problem solving *from* kids on a regular basis. Kids do need to learn to work things out and develop their own relationships without parents jumping in the middle of things all the time.<br/>\n<br/>\nIts not an either-or kind of situation, though - either parents do it all or kids do it all, I mean. Kids may need help communicating while also needing parents to step back and let them work things out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Experiencing difficulty and pain is essential for emotional growth.<br/>\n&gt; All truly resilient people have had experience with harsh life situations and learned how to overcome them.&quot;<br/>\n<br/>\n </span></blockquote>Good grief, this person needs to meet some more dysfunctional families before making statements like that! I can think of a ton of examples of difficulty and pain getting smack dab in the Way of emotional growth. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with hitting","postDate":"1253899785","msgId":41606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NTIzLjU3Mjg5LnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGg5aXJ1YStjcm9pQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5aXJ1YStjcm9pQGVHcm91cHMuY29tPg=="},"prevInTopic":41605,"nextInTopic":41609,"prevInTime":41605,"nextInTime":41607,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"I took a quick look of what this site bullies2buddies.com says and I see some ideas that I have a probelm with. Here is some of the things that jumped out for","messageBody":"<div id=\"ygrps-yiv-314257560\">I took a quick look of what this site bullies2buddies.com says and I see some ideas that I have a probelm with.<br/>\nHere is some of the things that jumped out for me:<br/>\n<br/>\n<br/>\n<br/>\n&quot;Experiencing difficulty and pain is essential for emotional growth.<br/>\nAll truly resilient people have had experience with harsh life situations and learned how to overcome them.<br/>\nIf we actually succeeded in raising children who never experience any abuse and neglect, they would grow up to be emotional marshmallows, frustrated when they don’t get what they want, and unable to handle people being mean or inconsiderate towards them &quot;<br/>\n <br/>\n&quot;Children learn how to get along all by themselves.&quot;<br/>\n <br/>\nThere are some ideas I do agree with.<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253896970","msgId":41605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5aXJ1YStjcm9pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI0MTA0OW81NTdhYzc5MXQ0NzMwODBiNWJjYTJmZTA4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41603,"nextInTopic":41606,"prevInTime":41604,"nextInTime":41606,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"I ve got two kids who used to fight a LOT!! And, then I discovered www.bullies2buddies.com thanks to someone on either this board or another board. Applying","messageBody":"<div id=\"ygrps-yiv-779385419\">I&#39;ve got two kids who used to fight a LOT!!<br/>\n<br/>\nAnd, then I discovered www.bullies2buddies.com thanks to someone on either this board or another board.  <br/>\n<br/>\nApplying this understanding and approach has helped tons in our home!!<br/>\n<br/>\nWe still have some ways to go, but things are much better, after a couple of weeks of being much worse.  Getting worse before getting better was part of the deal, as kids floundered about trying to get mom or dad to get into the middle again.  <br/>\n<br/>\nGood luck.<br/>\n<br/>\nElli</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253887604","msgId":41603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5aWlwayticTVvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg5Z200OCtkaTRjQGVHcm91cHMuY29tPg=="},"prevInTopic":41601,"nextInTopic":41605,"prevInTime":41602,"nextInTime":41604,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"~~I m really not sure how to handle this one and could use some advice. Ryan is 6. His older brother, Ethan, is 9. Lately (the past 3 months or so) when  Ethan","messageBody":"<div id=\"ygrps-yiv-1769372584\">~~I&#39;m really not sure how to handle this one and could use some advice. Ryan is 6. His older brother, Ethan, is 9. Lately (the past 3 months or so) when  Ethan and Ryan have a fight, Ryan will hit me.~~<br/>\n<br/>\n<br/>\nTypically when kids are mad at each other, they might hit their sibling....that&#39;s understandable.  I&#39;m curious why Ryan feels it is not ok to hit his sibling and ok to hit you? Is it possible that his brother has made it very clear his does NOT want to be hit and you&#39;re having trouble letting that be known?<br/>\n<br/>\nI&#39;m curious because it doesn&#39;t make sense for a 6 y.o. to have enough impulse control to transfer his anger over to someone other than the person he&#39;s mad at. If he has enough impulse control for that, I&#39;m guessing he has enough to stop hitting you. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with hitting","postDate":"1253825480","msgId":41601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5Z200OCtkaTRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDRjMGIzMDkwOTI0MTA0OW81NTdhYzc5MXQ0NzMwODBiNWJjYTJmZTA4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41599,"nextInTopic":41603,"prevInTime":41600,"nextInTime":41602,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"... It sounds like you need to change the way you interact with them when they fight - if you re jumping right in to help, step back more, or vice versa. If","messageBody":"<div id=\"ygrps-yiv-199522092\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Three Mommies &lt;3mommies@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m really not sure how to handle this one and could use some advice. Ryan<br/>\n&gt; is 6. His older brother, Ethan, is 9. Lately (the past 3 months or so) when<br/>\n&gt; Ethan and Ryan have a fight, Ryan will hit me.<br/>\n<br/>\n </span></blockquote>It sounds like you need to change the way you interact with them when they fight - if you&#39;re jumping right in to help, step back more, or vice versa. If you&#39;re using a lot of words, work on using less. <br/>\n<br/>\nAt the same time, look for any unmet needs Ryan may have *outside* those moments. Is he needing more attention overall? Conversely, is he an introvert and feeling overwhelmed by too much social contact? Does he need more rough-and-tumble play? Less? Does Ethan need other social outlets to give his brother a break? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Once he calms down he runs to me and apologizes and hugs me, but I know he&#39;s<br/>\n&gt; going to do it again.<br/>\n<br/>\n </span></blockquote>Are you and he able to talk and make some plans, come up with some strategies and agreements for &quot;next time&quot;? Some kids are able to talk about things like this outside the moment and you can come up with a plan of action together and try it out. If he needs you to be his &quot;safe space&quot; to vent his frustrations, for example, you can come up with ways to do that that don&#39;t include you getting whacked (at least without protective gear). <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Help with hitting","postDate":"1253814546","msgId":41599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NDRjMGIzMDkwOTI0MTA0OW81NTdhYzc5MXQ0NzMwODBiNWJjYTJmZTA4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":41601,"prevInTime":41598,"nextInTime":41600,"topicId":41599,"numMessagesInTopic":0,"msgSnippet":"I m really not sure how to handle this one and could use some advice. Ryan is 6. His older brother, Ethan, is 9. Lately (the past 3 months or so) when Ethan","messageBody":"<div id=\"ygrps-yiv-1257810967\">I&#39;m really not sure how to handle this one and could use some advice. Ryan<br/>\nis 6. His older brother, Ethan, is 9. Lately (the past 3 months or so) when<br/>\nEthan and Ryan have a fight, Ryan will hit me. His excuse for this &quot;Well,<br/>\nEthan did [insert whatever here] to me and it&#39;s your fault because you<br/>\nborned him!&quot; I&#39;ve waited until a quiet time and talked with Ryan about it.<br/>\nHe seems to understand that that&#39;s not OK, but then he does it again. When<br/>\nit happens and I tell him that I don&#39;t allow anyone to hurt me, he laughs<br/>\nand tries to hit me again. He follows me around the house if I walk away.<br/>\nOnce he calms down he runs to me and apologizes and hugs me, but I know he&#39;s<br/>\ngoing to do it again.<br/>\n<br/>\nAny suggestions/thoughts/ideas?<br/>\n<br/>\nThanks,<br/>\n<br/>\nJean Elizabeth<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":41655,"nextTopicId":41239}}