{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1241103675","msgId":39857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0Mzk4Ny45NjMzMi5xbUB3ZWI1NjEwNS5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PGNjNjEyMGExMDkwNDI4MTM1MnVjZDVjMDljeDYzMTAwMTkwYTYzOTkwMGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":39848,"nextInTopic":0,"prevInTime":39856,"nextInTime":39858,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Dear new to this ,    It s always awesome to here Faith s comments because she is so opening and observent of her every day life with her children..  as I","messageBody":"<div id=\"ygrps-yiv-521592011\">Dear &quot;new to this&quot;,  <br/>\n  It&#39;s always awesome to here Faith&#39;s comments because she is so opening and observent of her every day life with her children..  as I read her response I see that - that is the point -- being in the moments throughout the day, breathing in, basking in the now.  I personally am reallllly still working on this however as I let go of all my old baggage (deschooling) and let go of fear I recognize all that faith said below and many other &#39;unschooling folks&#39; .   Let me tell you when I started the journey of unschooling I had the thoughts of &quot;schoolish&quot; stuff and not sure I have entirely let them go yet, especially since my son (6) wanted to go to kindergarten this year and we did it.. So on my part I ride the fence ... anyway when I go to a couple of my friends that unschool this is what I see:<br/>\n<br/>\nrooms filled with things their children enjoyed  : ie:  wooden kitchen set, a doll house, etc and much of their rooms you can tell teh children are in middle of  thier various projects, I see tons of books strewn everywhere ... bookshelfs full, baskets, by beds, and knowing  their children a little books are picked because of thier interests.  The mom follows her heart and has many of her own books all over and you can tell by pictures hanging or projects that have been done that the parents are mixed in the fun and joy of creating the home and life. I know that when her daughter became interested in horses, she read  everything about horses and  took her to lessons.   What I&#39;m trying to get at is those of us that are struggling with our fears is that we need to give ourselves some time.  Start asking yourself and your children some questions?  or just be very observant.  When you are giving assignments or encouraging  your children to read<br/>\n something you think they should step back and ask yourself ? why???? what are they really going to glean from this? <br/>\n    I substitute teach and the more I do the more I am becoming an unschooling mind.  Yesterday I was in a 3rd grade class and I was giving there lesson and talk about boring!!  Lesson was: first ask the kids what they think of when I say elephants? then read a portion about elephants then have them pair up and discuss what they learned and discuss with each other one other animal they have seen display emotions?  then have them write in their own journals about a book their reading -what the authors trying to say?  what have they learned from it?&gt;&gt;&gt; <br/>\n   boring -- than in another 3rd grade class they were making posters on the steps to read and make connections in the non-fiction genre.. now the teacher made this fun with the posters and the children were allowed to use their imagination -- <br/>\nbut tell me this isn&#39;t reading just reading ?  why do we have to put all this steps into it and &quot;connections&quot; to it .  Where making reading very unnatural. Making it sooo not fun.. I&#39;m sorry I love little house on the prairie series of books but I imagine not every child in that class likes it -- why should they read it!!  what makes the teacher, curriculum, society more authoratative over my individual child on what he should or should not read.  <br/>\n   Wouldn&#39;t allowing our children to read and follow their own interests be much more productive?  I see childrens lights gone in learning when I sub --- and I do not want that for my son!! <br/>\n   I know a young man that is now 12 years old , put through special ed and now sent to the school intermediate school district -- granted now he will get more personalized help and he is now walking around wanting to learn how to read -- and I have no doubt that he will now learn -- but is it because he&#39;s been shoved around or because now HE wants to learn.. I understand the parents were doing what they have felt is best but what if he would have been just allowed to pick up books of his choice ?? imagine how he must truly feel inside with all this stuff??<br/>\n<br/>\n ohh sorry I&#39;m veering way off now ! I was trying to just encourage anyone new to unschooling to keep exploring it... It&#39;s going to challenge what you have always known, some replys may even down right &quot;piss&quot; you off.  But push past it and search for those answers...  the more I let go of my stuff the more I see what these crazy unschoolers are saying is right! (at least right for me and mine it may not be for you and that is ok -- take what fits ---that&#39;s my crazy philosophy anyway).  <br/>\nbecca<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Tue, 4/28/09, Faith Void &lt;littlemsvoid@...&gt; wrote:<br/>\nFrom: Faith Void &lt;littlemsvoid@...&gt;<br/>\nSubject: Re: [unschoolingbasics] new to this! would like your responses! :)<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nDate: Tuesday, April 28, 2009, 4:52 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            <br/>\n            <br/>\n<br/>\n<br/>\n      <br/>\n      OP: I have just joined this group in hope of discovering a little (or a lot)<br/>\n<br/>\nmore about unschooling.<br/>\n<br/>\n<br/>\n<br/>\n***I think in learning more about unschooling it is helpful to sit back and<br/>\n<br/>\nread on here for a while. If you have a burning question them post. There is<br/>\n<br/>\na nice variety of unschholing information available out there.<br/>\n<br/>\n<br/>\n<br/>\na wonderful place to start with easy to use question/answer format; *<br/>\n<br/>\nhttp://joyfullyrejo ycing.com/ *<br/>\n<br/>\na collection of unschooling wisdom; *http://www.sandrado dd.com/*<br/>\n<br/>\n-=-=-=-=-=-= -==-=-=-= -=-=-=-=- =-=-=-=-= -=-=-=-== -=-=-=-=- =-=-=-=-= =-=-=--<br/>\n<br/>\n<br/>\n<br/>\nOP: We are currently homeschoolers with a variety of curriculum books but<br/>\n<br/>\nlooking to tweak some things.<br/>\n<br/>\n<br/>\n<br/>\n***If you are planning on unschooling you&#39;ll need to do a bit more than<br/>\n<br/>\n&quot;tweaking&quot; a curriculum. Unschooling is a lifestyle and though process, a<br/>\n<br/>\nperspective shift. It is loving life without school.<br/>\n<br/>\n-=-=-=-=-=-= -=-=-=-=- =-==-=-=- =-=-=-=-= -=-=-=-=- ==-=-=-=- =-=-=-=-= -=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nOP: I would like to hear from some families on what their typical day looks<br/>\n<br/>\nlike. I have looked at several websites so I have familiarized myself with<br/>\n<br/>\nthe term but would like to know how the days work out.<br/>\n<br/>\n<br/>\n<br/>\n***I am curious as to which websites you&#39;ve looked at? Have you checked out<br/>\n<br/>\nblogs. That is a great way to catch the flavor of daily life of unschoolers.<br/>\n<br/>\nI have a link to mine at the bottom of my page. There is a link to more on<br/>\n<br/>\nSandra&#39;s pages. We may even have a page in the database on this group.<br/>\n<br/>\n<br/>\n<br/>\nThe only thing I can say that is typical is that we follow our bliss daily.<br/>\n<br/>\n-=-=-=-=-=-= -=-=-=-=- =-=-=-=-= -=-=-==-= -=-=-==-= -=-=-=-=- =-==-=-=- =-==-<br/>\n<br/>\n<br/>\n<br/>\nOP: I am also wondering if you get out any books at all throughout the day<br/>\n<br/>\nor if your child completely leads his/her learning every day on his/her own.<br/>\n<br/>\n<br/>\n<br/>\n***Do you mean do we pull out school books? Unscholling is living life<br/>\n<br/>\n*without* school. My children learn through living their lives it is not<br/>\n<br/>\nsepreate from life. We have a library of books, dvds, VG and periodicals at<br/>\n<br/>\ntheir disposal. We have the internet and my dd12 even has internet available<br/>\n<br/>\non her phone (and we use it, I &lt;3 googling) But these are not a thing we do<br/>\n<br/>\neach day. We live our lives. If we need or want a book we get one.<br/>\n<br/>\n<br/>\n<br/>\nToday I think we have gone thus far without reading. Except my dd12 read a<br/>\n<br/>\ncouple picture books to dd1 while I did breakfast dishes. Then we had things<br/>\n<br/>\nto do outside. In general my kids read becasue they enjoy it or need the<br/>\n<br/>\ninformation that a book has to offer.<br/>\n<br/>\n<br/>\n<br/>\nI never demand my kids &quot;learn&quot; stuff. We pick up a variety of knowledge<br/>\n<br/>\nthrough living. Yesterday we went to City Island in Harrisburg (the capital<br/>\n<br/>\nof PA) we talked about the river, we talked about the city. We all found out<br/>\n<br/>\nthat CI is in the Susquehannah River. We also found out it is polluted and<br/>\n<br/>\nthat swimming is no longer allowed (it was last year). We made plans to look<br/>\n<br/>\ninto why. We learned that too much chocolate milkshake in 90 degree heat<br/>\n<br/>\nfeels yucky, lol. I am sure much more. I didn&#39;t ask tehm leading questions<br/>\n<br/>\nor impart knowledge to them. It was/is there for the taking.<br/>\n<br/>\n-=-=-=-=-=-= -=-=-=-== -=-=-=-== -=-=-=-=- ==-=-=-== --=-==-=- =-=-==-=-<br/>\n<br/>\n<br/>\n<br/>\nOP: I am also interested in unit studies and I think the 2 might go well<br/>\n<br/>\ntogether.<br/>\n<br/>\n<br/>\n<br/>\n***This is still schoolish thinking. If you want to unschool step back and<br/>\n<br/>\nbreathe. Let it go. Have a big long summer vacation full of FUN! Do think<br/>\n<br/>\nabout learning to read or recognising geometrical shapes or getting the kids<br/>\n<br/>\nto do worksheets. Just explore the world. Listen to your kids and follow<br/>\n<br/>\ntheir interests. Show them things you think they might love/like but with no<br/>\n<br/>\nattachments to whether they do or not. Go berry picking or swimming or to a<br/>\n<br/>\nmuseum to explore not to &quot;learn&quot;. If your kid loves dinosaurs do dinosaur<br/>\n<br/>\nthings. Go to dinosaur movies, make dino crafts, eat dino shaped foods, make<br/>\n<br/>\na book of dino friends. And when they are done, you be done as well. Let it<br/>\n<br/>\ngo. Move joyously on tot he next thing. Sprinkle their lives with<br/>\n<br/>\nincredible, wonderous things.<br/>\n<br/>\n-=-=-=-=-=-= -=-=-=-=- =-==-=-=- =-=-=-=-= -=-=-=-=- =-=-=-=-= =-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nI am all for allowing our children explore their own likes/curiosities, I<br/>\n<br/>\njust wonder if that will inevitably lead to opening up any books at<br/>\n<br/>\nall.....??!!<br/>\n<br/>\n<br/>\n<br/>\n*** It seems that you have a fear. You are seeing books as the only way to<br/>\n<br/>\nlearn something. What can you learn from a book but not from another source?<br/>\n<br/>\nI can&#39;t think of one thing. What is the worst case senario in your mind?<br/>\n<br/>\nWhat would life look like with no books?<br/>\n<br/>\n<br/>\n<br/>\nBooks are like anything else in our family, they carry the same weight as a<br/>\n<br/>\nvideo game or a toy or a paint brush. They are all valid objects. They are<br/>\n<br/>\nall worthy of our time and attention. We learn from it all.<br/>\n<br/>\n-=-=-=-=-=-= -=-=-=-=- =-=-=-=-= -=-=-=-=- =-=-==-=- =-=-=-=-= -=-=-=-=- =<br/>\n<br/>\n<br/>\n<br/>\nRight now my 7 yr old daughter is playing with a cash registar and I can see<br/>\n<br/>\nhow that can lead to many learning activities! Your responses would be<br/>\n<br/>\ngreatly appreciated! !<br/>\n<br/>\n<br/>\n<br/>\n***Can she just play with the cash register? Can you have fun playing with<br/>\n<br/>\nher? Play with no agenda. Just fun. What does that look like to you? What<br/>\n<br/>\nkind of learning can take place when there is not agenda?<br/>\n<br/>\n<br/>\n<br/>\nWhat kind of activity can one do where no learning at all takes place? Even<br/>\n<br/>\nsitting passively behind a desk/table gives you time to space out and day<br/>\n<br/>\ndream and learn about your self and make plans to do fabulous things once<br/>\n<br/>\nyour free.<br/>\n<br/>\n-=-=-=-=-=-= -=-=-=-=- =-=-=-=-= =-=-=-=-= -==-=-=-= -=-==-=-= -=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\nhttp://faithvoid. blogspot. com/<br/>\n<br/>\nwww.bearthmama. com<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:new to this! would like your responses! :)","postDate":"1241004991","msgId":39847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRkNDQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39844,"nextInTopic":39848,"prevInTime":39846,"nextInTime":39848,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Depends on what you mean - we have, read, use many books throughout an average day. I m usually reading at least one book plus random magazines at any time, DH","messageBody":"<div id=\"ygrps-yiv-1882474278\">Depends on what you mean - we have, read, use many books throughout an\r<br/>\naverage day. I&#39;m usually reading at least one book plus random magazines\r<br/>\nat any time, DH also. Add in cookbooks when we&#39;re looking up new\r<br/>\nrecipes. We&#39;ve lately been into The Home Creamery book to figure out\r<br/>\nabout making yogurt and cheeses at home. DS also picks up something to\r<br/>\nread as he chooses - currently on book 15 of the Animorphs series (there\r<br/>\nare some 50+ books in the series; he moved on to them after finishing\r<br/>\nsome 20 books in Bionicles). If you&#39;re asking do we sit him down and do\r<br/>\nschoolwork, the answer is nope. However, there have been times when he\r<br/>\nhas wanted to learn a particular thing, like &quot;how do I write my name in\r<br/>\nscript?&quot; or &quot;how do you figure out the area of a circle?&quot; or &quot;where is\r<br/>\nHungary?&quot; or &quot;why is it called a window?&quot; If we don&#39;t know the answer\r<br/>\nright off, we look it up together. Same as if DH asks me a question like\r<br/>\n&quot;what&#39;s a  bodega?&quot; (he took German in high school, I took Spanish,\r<br/>\n&quot;bodega&quot; occurs in a song he recently downloaded). I don&#39;t tell him to\r<br/>\ngo get a Spanish dictionary and sit him down and explain it all, I just\r<br/>\nanswer him if I know the answer, and we partner together to find the\r<br/>\nanswer - maybe the dictionary, maybe Wikipedia, maybe some other\r<br/>\nresource (history questions, we often call my dad - he&#39;s *old* LOL and\r<br/>\nlived through most of history - ever think it wasn&#39;t fair that there was\r<br/>\nso much less history for your parents to memorize when they were in\r<br/>\nschool? LOL)\r<br/>\n\r<br/>\n \r<br/>\n\r<br/>\nA typical day is me heading to work, DH getting up (usually around the\r<br/>\nsame time I do) and having breakfast and all. DS sleeps until he&#39;s done\r<br/>\nsleeping then gets up and has breakfast. Dishes, laundry, food prep &\r<br/>\neating, and so on get done (today will include the first lawn mowing of\r<br/>\nthe season too). Reading, videogames of various sorts (online,\r<br/>\nPlayStation, Nintendo DS) get played, TV gets watched, maybe a trip out\r<br/>\nto a local hiking trail in nice weather. LOTS of interaction and\r<br/>\ndiscussion the whole time. What does a Saturday or school holiday (with\r<br/>\nno assignments due upon return) look like at your house? Do you get out\r<br/>\nworkbooks or texts in July? \r<br/>\n\r<br/>\n \r<br/>\n\r<br/>\nFor the record, DS is almost 11, has never been enrolled in school or\r<br/>\nschooled at home. He&#39;s grown up living, loving, laughing, learning. It&#39;s\r<br/>\na lifestyle of exploration and curiosity and partnership rather than us\r<br/>\ntrying to fill him up with some set body of information. Reading,\r<br/>\nwriting, arithmetic are TOOLS not ends in themselves (unlike how school\r<br/>\nperceives them) and developed as his need for those tools grew. Just as\r<br/>\nhis typing speed and spelling ability grew as he spent more time\r<br/>\ncommunicating with others in online gaming (where communication mostly\r<br/>\ntakes place by text message type conversations not verbal), his reading\r<br/>\nand numeracy skills grew/are growing as he uses them in pursuit of his\r<br/>\nown goals and objectives.\r<br/>\n\r<br/>\n \r<br/>\n\r<br/>\n--Deb\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62589750,"authorName":"JudithAnneMurphy@aol.com","from":"JudithAnneMurphy@...","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:new to this! would like your responses! :)","postDate":"1240999757","msgId":39848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2MS40N2FlZTRkNy4zNzI5ODE0ZEBhb2wuY29tPg=="},"prevInTopic":39847,"nextInTopic":39857,"prevInTime":39847,"nextInTime":39849,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"We re in a kind of deschooling process at the moment, and I think that dd has never been such a voracious reader - but I suspect it s different for every","messageBody":"<div id=\"ygrps-yiv-1128474356\">We&#39;re in a kind of deschooling process at the moment, and I think that dd  <br/>\nhas never been such a voracious reader - but I suspect it&#39;s different for  <br/>\nevery child, depending on what they feel they&#39;ve been missing while at  <br/>\nschool?   All I can say from my observations are that dd  was asked to read lots <br/>\nof &#39;worthy&#39; books at school that she ploughed  through dutifully.  Now she <br/>\nhas time to really enjoy her manga and  fantasy/sci-fi, she is making the <br/>\nmost of it.  So, probably down to  the individual and their own tastes and <br/>\nexperiences?<br/>\n <br/>\nThat&#39;s my guess based on what we&#39;re seeing - I&#39;m sure  experienced <br/>\nunschoolers will be able to give far better insights.<br/>\n <br/>\nJude x<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240951925","msgId":39844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDI4MTM1MnVjZDVjMDljeDYzMTAwMTkwYTYzOTkwMGRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39842,"nextInTopic":39847,"prevInTime":39843,"nextInTime":39845,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"OP: I have just joined this group in hope of discovering a little (or a lot) more about unschooling. ***I think in learning more about unschooling it is","messageBody":"<div id=\"ygrps-yiv-1050214061\">OP: I have just joined this group in hope of discovering a little (or a lot)<br/>\nmore about unschooling.<br/>\n<br/>\n***I think in learning more about unschooling it is helpful to sit back and<br/>\nread on here for a while. If you have a burning question them post. There is<br/>\na nice variety of unschholing information available out there.<br/>\n<br/>\na wonderful place to start with easy to use question/answer format; *<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/*\">http://joyfullyrejoycing.com/*</a><br/>\na collection of unschooling wisdom; *<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/*\">http://www.sandradodd.com/*</a><br/>\n-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-==-=-=--<br/>\n<br/>\nOP: We are currently homeschoolers with a variety of curriculum books but<br/>\nlooking to tweak some things.<br/>\n<br/>\n***If you are planning on unschooling you&#39;ll need to do a bit more than<br/>\n&quot;tweaking&quot; a curriculum. Unschooling is a lifestyle and though process, a<br/>\nperspective shift. It is loving life without school.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\nOP: I would like to hear from some families on what their typical day looks<br/>\nlike. I have looked at several websites so I have familiarized myself with<br/>\nthe term but would like to know how the days work out.<br/>\n<br/>\n***I am curious as to which websites you&#39;ve looked at? Have you checked out<br/>\nblogs. That is a great way to catch the flavor of daily life of unschoolers.<br/>\nI have a link to mine at the bottom of my page. There is a link to more on<br/>\nSandra&#39;s pages. We may even have a page in the database on this group.<br/>\n<br/>\nThe only thing I can say that is typical is that we follow our bliss daily.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-==-=-=-=-=-=-=-==-=-=-=-==-<br/>\n<br/>\nOP: I am also wondering if you get out any books at all throughout the day<br/>\nor if your child completely leads his/her learning every day on his/her own.<br/>\n<br/>\n<br/>\n***Do you mean do we pull out school books? Unscholling is living life<br/>\n*without* school. My children learn through living their lives it is not<br/>\nsepreate from life. We have a library of books, dvds, VG and periodicals at<br/>\ntheir disposal. We have the internet and my dd12 even has internet available<br/>\non her phone (and we use it, I &lt;3 googling) But these are not a thing we do<br/>\neach day. We live our lives. If we need or want a book we get one.<br/>\n<br/>\nToday I think we have gone thus far without reading. Except my dd12 read a<br/>\ncouple picture books to dd1 while I did breakfast dishes. Then we had things<br/>\nto do outside. In general my kids read becasue they enjoy it or need the<br/>\ninformation that a book has to offer.<br/>\n<br/>\nI never demand my kids &quot;learn&quot; stuff. We pick up a variety of knowledge<br/>\nthrough living. Yesterday we went to City Island in Harrisburg (the capital<br/>\nof PA) we talked about the river, we talked about the city. We all found out<br/>\nthat CI is in the Susquehannah River. We also found out it is polluted and<br/>\nthat swimming is no longer allowed (it was last year). We made plans to look<br/>\ninto why. We learned that too much chocolate milkshake in 90 degree heat<br/>\nfeels yucky, lol. I am sure much more. I didn&#39;t ask tehm leading questions<br/>\nor impart knowledge to them. It was/is there for the taking.<br/>\n-=-=-=-=-=-=-=-=-=-==-=-=-=-==-=-=-=-=-==-=-=-==--=-==-=-=-=-==-=-<br/>\n<br/>\nOP: I am also interested in unit studies and I think the 2 might go well<br/>\ntogether.<br/>\n<br/>\n***This is still schoolish thinking. If you want to unschool step back and<br/>\nbreathe. Let it go. Have a big long summer vacation full of FUN! Do think<br/>\nabout learning to read or recognising geometrical shapes or getting the kids<br/>\nto do worksheets. Just explore the world. Listen to your kids and follow<br/>\ntheir interests. Show them things you think they might love/like but with no<br/>\nattachments to whether they do or not. Go berry picking or swimming or to a<br/>\nmuseum to explore not to &quot;learn&quot;. If your kid loves dinosaurs do dinosaur<br/>\nthings. Go to dinosaur movies, make dino crafts, eat dino shaped foods, make<br/>\na book of dino friends. And when they are done, you be done as well. Let it<br/>\ngo. Move joyously on tot he next thing. Sprinkle their lives with<br/>\nincredible, wonderous things.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-<br/>\n<br/>\nI am all for allowing our children explore their own likes/curiosities, I<br/>\njust wonder if that will inevitably lead to opening up any books at<br/>\nall.....??!!<br/>\n<br/>\n*** It seems that you have a fear. You are seeing books as the only way to<br/>\nlearn something. What can you learn from a book but not from another source?<br/>\nI can&#39;t think of one thing. What is the worst case senario in your mind?<br/>\nWhat would life look like with no books?<br/>\n<br/>\nBooks are like anything else in our family, they carry the same weight as a<br/>\nvideo game or a toy or a paint brush. They are all valid objects. They are<br/>\nall worthy of our time and attention. We learn from it all.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nRight now my 7 yr old daughter is playing with a cash registar and I can see<br/>\nhow that can lead to many learning activities! Your responses would be<br/>\ngreatly appreciated!!<br/>\n<br/>\n***Can she just play with the cash register? Can you have fun playing with<br/>\nher? Play with no agenda. Just fun. What does that look like to you? What<br/>\nkind of learning can take place when there is not agenda?<br/>\n<br/>\nWhat kind of activity can one do where no learning at all takes place? Even<br/>\nsitting passively behind a desk/table gives you time to space out and day<br/>\ndream and learn about your self and make plans to do fabulous things once<br/>\nyour free.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-==-=-=-=-=-==-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\nFaith<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: new to this! would like your responses! :)","postDate":"1240942849","msgId":39842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzNTEzOC4xNjMyLnFtQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGd0N2g0dSs0MTNrQGVHcm91cHMuY29tPg==","referencesHeader":"PGd0N2g0dSs0MTNrQGVHcm91cHMuY29tPg=="},"prevInTopic":39841,"nextInTopic":39844,"prevInTime":39841,"nextInTime":39843,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Where in Brazil did you go? feel free to e-mail me  !   Alex Polikowsky http://polykow.blogspot.com/ http://groups.yahoo.com/group/unschoolingmn/   ","messageBody":"<div id=\"ygrps-yiv-1963001995\">Where in Brazil did you go?<br/>\nfeel free to e-mail me  !<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: amberlee_b &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amberlee16@...\">amberlee16@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, April 28, 2009 1:15:58 PM<br/>\nSubject: [unschoolingbasics] Re: new to this! would like your responses! :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThis is soooo important! I want to share a story as I was pretty impressed. There is a 21 year old here near us who has opened his own pizza shop. He went through PS and did ok and thought he *had* to go on to college but he said (we got to talk to him while waiting to try his subs...wow!) after a semester he knew it wasn&#39;t for him! He realized he didn&#39;t need a piece of paper to make his dream of owning a pizza place where he could honor his Italian hertiage and his grandma&#39;s meatballs everyday of his life. He is living his dream now, not at some time in the unforeseen future after spending thousands on college.<br/>\n<br/>\nHe wasn&#39;t unschooled or even homeschooled, but he gets it now that he is out of those institutions. He knew at age 12 he wanted to own his own place. He found ways of working in the restaurant biz from age 13 through buying his own little shop. His parents are very supportive and his dad even is learning how to run the store so he can work it on Saturdays. I am so excited for this young man! I wish I had figured that out by his age--would have saved me some money....but then again I wouldn&#39;t have gone to Brazil or Mexico at that time either. <br/>\n<br/>\nStill my point is that he knew where he wanted to go and that formal education wasn&#39;t going to get him there. We just have to let go of all the preconceived, spoon-fed info we have been given over the years and relax. You will begin to see that life is learning, there is no way you can live and not learn anything ever. <br/>\n<br/>\nI am off to watch my kids play the World of Goo (so funny) and enjoy this gorgeous day!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: new to this! would like your responses! :)","postDate":"1240942558","msgId":39841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0N2g0dSs0MTNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY2MDM2MS45MjE1NC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39840,"nextInTopic":39842,"prevInTime":39840,"nextInTime":39842,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"This is soooo important!  I want to share a story as I was pretty impressed.  There is a 21 year old here near us who has opened his own pizza shop.  He went","messageBody":"<div id=\"ygrps-yiv-668751405\">This is soooo important!  I want to share a story as I was pretty impressed.  There is a 21 year old here near us who has opened his own pizza shop.  He went through PS and did ok and thought he *had* to go on to college but he said (we got to talk to him while waiting to try his subs...wow!) after a semester he knew it wasn&#39;t for him!  He realized he didn&#39;t need a piece of paper to make his dream of owning a pizza place where he could honor his Italian hertiage and his grandma&#39;s meatballs everyday of his life.  He is living his dream now, not at some time in the unforeseen future after spending thousands on college.<br/>\n<br/>\nHe wasn&#39;t unschooled or even homeschooled, but he gets it now that he is out of those institutions.  He knew at age 12 he wanted to own his own place.  He found ways of working in the restaurant biz from age 13 through buying his own little shop.  His parents are very supportive and his dad even is learning how to run the store so he can work it on Saturdays.  I am so excited for this young man!  I wish I had figured that out by his age--would have saved me some money....but then again I wouldn&#39;t have gone to Brazil or Mexico at that time either.  <br/>\n<br/>\nStill my point is that he knew where he wanted to go and that formal education wasn&#39;t going to get him there.  We just have to let go of all the preconceived, spoon-fed info we have been given over the years and relax.  You will begin to see that life is learning, there is no way you can live and not learn anything ever.  <br/>\n<br/>\nI am off to watch my kids play the World of Goo (so funny) and enjoy this gorgeous day!</div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240939796","msgId":39840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzMTQwMDQzOC4xNjA5NjExMjQwOTM5Nzk2Mzk2LkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg==","inReplyToHeader":"PDE4NDA1NjU5NjMuMTYwODMwMTI0MDkzOTY2NDg0NC5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4="},"prevInTopic":39839,"nextInTopic":39841,"prevInTime":39839,"nextInTime":39841,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Hi Kari-- I m also new to unschooling; I just pulled my son out of first grade a few weeks ago. I must have learned a few things since then, because I could","messageBody":"<div id=\"ygrps-yiv-879820891\">Hi Kari-- <br/>\n<br/>\n<br/>\n<br/>\nI&#39;m also new to unschooling; I just pulled my son out of first grade a few weeks ago. I must have learned a few things since then, because I could see right away a few things in your post that reminded of where I was the first time I came to this list! ;) I think I wrote something about how my son loves math so much, I was surprised he didn&#39;t just start working on his math workbooks for fun. If I&#39;m really honest with myself, I have to admit that I was HOPING he&#39;d open the math books. In fact, I was strategically leaving them out on the kitchen table for just that reason. I suppose it&#39;s a sign of my own deschooling progress that today as I write this I have no idea where they are. <br/>\n<br/>\n<br/>\n<br/>\nKari, you MUST deschool. The first time I homeschooled, almost 10 years ago, I considered myself very relaxed and eclectic, but we still &quot;did school&quot;. I still remember my kids asking me if we were &quot;done school&quot; so they could get to the fun part of the day! I realize now that I had set myself up for failure by separating &quot;educational&quot; pursuits from everything else. If you are waiting with bated breath for them to open up books, then you have some deschooling to do. Have you been to Sandra Dodd&#39;s Unschooling  site? There&#39;s a deschooling page that I read at least once a day. And while you are in the process of breaking down the walls of the box you&#39;re in, just relax and let your daughter play. The wise members here advised me to relax and treat every day like summer vacation, and that has helped immensely! <br/>\n<br/>\n<br/>\n<br/>\nBut I&#39;m still in the box, too. (although at least I&#39;m aware of it now!) We had gift cards for Barnes and Noble, and as I sat down with my son to make up our wish list, I caught myself mentally dividing up all the games into &quot;educational&quot; and &quot;non.&quot; He wanted Bananagrams. Yes! Educational. He wanted the Scrambled States of America. Yes! Educational. He wanted Trouble. Hmm, wait a minute......        And just today, we were playing Mille Bornes, and in the back of my mind I was thinking, okay, he&#39;s doing mental math while we play, 3-digit addition. Ugh. Do you see what I mean? As long as we&#39;re thinking alo ng those lines, unschooling won&#39;t work. The trick is to catch yourself having those kinds of thoughts. The more I learn, the more I&#39;m realizing that unschooling is an all or nothing kind of thing. Your mention of unit studies sent up a red flag for me, because the first time around I was very big on unit studies. Just the other day, when we were doing  some fun Earth Day-related things , my fingers were itching to go online and put together an Earth Day unit. But I stopped myself just in time, because I suddenly remembered how my well-intentioned units killed quite a few of my kids&#39; budding interests. You&#39;re interested in volcanoes? Great! Here&#39;s a bunch of worksheets! :P <br/>\n<br/>\n<br/>\n<br/>\nThe first thing I did was make the decision to erase all lines between school days and weekends, between the school year and summer, between daytime and evening. Living IS learning. Living IS learning. I have to repeat that to myself about 100 times a day, but I&#39;m getting there. You will, too, if you want the unschooling lifestyle badly enough. <br/>\n<br/>\n<br/>\n<br/>\nOh yeah, and above all, h ave fun! <br/>\n<br/>\nDenise <br/>\n<br/>\n(Logan, 7) <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Kari Vermette&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:knv318@...\">knv318@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Monday, April 27, 2009 2:23:11 PM GMT -09:00 Alaska <br/>\nSubject: [unschoolingbasics] new to this! would like your responses! :) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHello everyone! <br/>\n<br/>\nI have just joined this group in hope of discovering a little (or a lot) more about unschooling. We are currently homeschoolers with a variety of curriculum books but looking to tweak some things. I would like to hear from some families on what their typical day looks like. I have looked at several websites so I have familiarized myself with the term but would like to know how the days work out. I am also wondering if you get out any books at all throughout the day or if your child completely leads his/her learning every day on his/her own. I am also interested in unit studies and I think the 2 might go well together. I am all for allowing our children explore their own likes/curiosities, I just wonder if that will inevitably lead to opening up any books at all.....??!! Right now my 7 yr old daughter is playing with a cash registar and I can see how that can lead to many learning activities! Your responses would be greatly appreciated!! <br/>\n<br/>\nTHanks!! <br/>\nKari <br/>\n<br/>\n[Non-text portions of this message have been removed] <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240927162","msgId":39839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNDYxOTc3LUE0N0YtNEQzQy04RDkzLThCQkREODI3QzdBQ0BmcmlpLmNvbT4=","inReplyToHeader":"PDE5NDI3OS43ODE4NC5xbUB3ZWI0NTQwOS5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PDE5NDI3OS43ODE4NC5xbUB3ZWI0NTQwOS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39838,"nextInTopic":39840,"prevInTime":39838,"nextInTime":39840,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"... This is not true (in case there are any other Coloradoans reading this), and I will respond off list since it is a particular state homeschooling law, not","messageBody":"<div id=\"ygrps-yiv-1152975914\">On Apr 27, 2009, at 9:35 PM, Rala Brubaker wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In CO they arent required to go to school till they are 7<br/>\n<br/>\n </span></blockquote>This is not true (in case there are any other Coloradoans reading  <br/>\nthis), and I will respond off list since it is a particular state  <br/>\nhomeschooling law, not appropriate for this list.<br/>\n<br/>\n~Jill in Colorado<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:new to this! would like your responses! :)","postDate":"1240926741","msgId":39838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxMEYzMEJCRTcyRjQzRjY4NkFDOUU5RDRFMzA4OUE1QFJvY2tldFNhdWNlMj4=","inReplyToHeader":"PDk2MzYyLjYxNzYzLnFtQHdlYjgzODEzLm1haWwuc3AxLnlhaG9vLmNvbT4=","referencesHeader":"PDk2MzYyLjYxNzYzLnFtQHdlYjgzODEzLm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":39837,"nextInTopic":39839,"prevInTime":39837,"nextInTime":39839,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Yes, at some point opening a book will in all likelihood happen--if it is of VALUE and USE to the exploration of the child!  If you push and fuss about it and","messageBody":"<div id=\"ygrps-yiv-1719065998\">Yes, at some point opening a book will in all likelihood happen--if it is of VALUE and USE to the exploration of the child!  If you push and fuss about it and don&#39;t support your child&#39;s explorations (tv, books, movies, playing in the creek, daydreaming--whatever), you will make the idea of using books for info or fun go away.  The child will see it as something to be avoided.  Do you read, around your child, for pleasure?  <br/>\n<br/>\n~Melissa, in MD<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: N CONFER <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, April 28, 2009 7:08 AM<br/>\n  Subject: [unschoolingbasics] Re:new to this! would like your responses! :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  I am all for allowing our children explore their own likes/curiosities, I just wonder if that will inevitably lead to opening up any books at all.....?<br/>\n<br/>\n  ***************<br/>\n<br/>\n  Yes, I read a book yesterday! :) <br/>\n<br/>\n  Part of one anyway. In between the other things I was doing. <br/>\n<br/>\n  Oh, and DD read something too. She is devouring our local library branches.<br/>\n<br/>\n  DS doesn&#39;t usually read books. He lives on the intertubes. Unless he asks me to get him something specific from the library.<br/>\n<br/>\n  Nance<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG - www.avg.com <br/>\n  Version: 8.0.238 / Virus Database: 270.12.6/2084 - Release Date: 04/28/09 06:15:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":193064123,"authorName":"N CONFER","from":"N CONFER &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:new to this! would like your responses! :)","postDate":"1240916924","msgId":39836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2MzYyLjYxNzYzLnFtQHdlYjgzODEzLm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":39834,"nextInTopic":39837,"prevInTime":39835,"nextInTime":39837,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"I am all for allowing our children explore their own likes/curiosities, I just wonder if that will inevitably lead to opening up any books at all.....? ","messageBody":"<div id=\"ygrps-yiv-585823465\">I am all for allowing our children explore their own likes/curiosities, I just wonder if that will inevitably lead to opening up any books at all.....?<br/>\n<br/>\n***************<br/>\n<br/>\nYes, I read a book yesterday! :) <br/>\n<br/>\nPart of one anyway. In between the other things I was doing. <br/>\n<br/>\nOh, and DD read something too. She is devouring our local library branches.<br/>\n<br/>\nDS doesn&#39;t usually read books. He lives on the intertubes. Unless he asks me to get him something specific from the library.<br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":201262326,"authorName":"Rala Brubaker","from":"Rala Brubaker &lt;kravmamma@...&gt;","profile":"kravmamma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240889751","msgId":39837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NDI3OS43ODE4NC5xbUB3ZWI0NTQwOS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39836,"nextInTopic":39838,"prevInTime":39836,"nextInTime":39838,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Hi Kari,   I am fairly new to this too.  Currently we are deschooling   and the first month was great....now one of mine seems to be releasing the school","messageBody":"<div id=\"ygrps-yiv-1294859008\">Hi Kari,<br/>\n <br/>\nI am fairly new to this too.  Currently we are &quot;deschooling&quot;  and the first month was great....now one of mine seems to be releasing the school enviornment through her skin.  The other one talks a lot about being ored but isn&#39;t willing to do much in the way of traditional learning.  We are hanging out and getting to know one another again.  <br/>\n <br/>\nHaving said that, they willing work out math problems of many varities.  My 7 yo dd would refuse to math of any kind while in school and now that we only follow her lead she is reciting times tables, willing do all types of math transactions and getting a great grip on the concept of money.  The other subjects are quite easy for her and we learn all of the time.  Its the 5 yo I worry about.  In CO they arent required to go to school till they are 7 so <br/>\nwe will wait and see....hope you get it all worked out!<br/>\n <br/>\nRala<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 4/27/09, Kari Vermette &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:knv318@...\">knv318@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Kari Vermette &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:knv318@...\">knv318@...</a>&gt;<br/>\nSubject: [unschoolingbasics] new to this! would like your responses! :)<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Monday, April 27, 2009, 4:23 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHello everyone!<br/>\n<br/>\nI have just joined this group in hope of discovering a little (or a lot) more about unschooling. We are currently homeschoolers with a variety of curriculum books but looking to tweak some things. I would like to hear from some families on what their typical day looks like. I have looked at several websites so I have familiarized myself with the term but would like to know how the days work out. I am also wondering if you get out any books at all throughout the day or if your child completely leads his/her learning every day on his/her own. I am also interested in unit studies and I think the 2 might go well together. I am all for allowing our children explore their own likes/curiosities, I just wonder if that will inevitably lead to opening up any books at all.....??!! Right now my 7 yr old daughter is playing with a cash registar and I can see how that can lead to many learning activities! Your responses would be greatly appreciated! !<br/>\n<br/>\nTHanks!!<br/>\nKari<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":179855323,"authorName":"Betj","from":"&quot;Betj&quot; &lt;bkind28@...&gt;","profile":"bkind28","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240885244","msgId":39834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwOTY0OTM2My0xMjQwODg1MjQ5LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtMzgzOTk5NTUyLUBieGUxMjY5LmJpc3gucHJvZC5vbi5ibGFja2JlcnJ5Pg==","inReplyToHeader":"PDlFQ0IwNUM1NkYwNjQwMEM4NTlEMjkxQzYzNjkxQzQ1QFJvY2tldFNhdWNlMj4=","referencesHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+PDY2MDM2MS45MjE1NC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+PDlFQ0IwNUM1NkYwNjQwMEM4NTlEMjkxQzYzNjkxQzQ1QFJvY2tldFNhdWNlMj4="},"prevInTopic":39833,"nextInTopic":39836,"prevInTime":39833,"nextInTime":39835,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Perfect example: got the movie Nixon Frost and my DS asked about what happened. So we discussed not only Nixon and Watergate but JFK because as Presidents are","messageBody":"<div id=\"ygrps-yiv-255867585\">Perfect example: got the movie Nixon Frost and my DS asked about what happened. So we discussed not only Nixon and Watergate but JFK because as Presidents are not my strong suit I could only think of LBJ and not Ford as who took over. Luckily my parents helped us out! \r<br/>\nSent from my Verizon Wireless BlackBerry\r<br/>\n\r<br/>\n-----Original Message-----\r<br/>\nFrom: &quot;DJ250&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dj250@...\">dj250@...</a>&gt;\r<br/>\n\r<br/>\nDate: Mon, 27 Apr 2009 22:08:12 \r<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;\r<br/>\nSubject: Re: [unschoolingbasics] new to this! would like your responses! :)\r<br/>\n\r<br/>\n\r<br/>\nExactly.  I&#39;d say definitely pretend that such a thing as school never existed!  Then, live that way!  Children (humans, really!) are hardwired to learn from birth--they can&#39;t help it.  We are their guides, if they need it.  Learn to see EVERYthing as a resource, not just &quot;educational&quot; things (books, toys, etc identified as such).  That&#39;s how your child sees everything, though he/she probably wouldn&#39;t put it that way!  This doesn&#39;t mean you turn everything into a unit study or a project, unless your child WANTS you to.  Follow your child&#39;s lead!  \r<br/>\n\r<br/>\nAnother way to look at it is that this is childhood and by definition it belongs to the child.  It is THEIR time to explore, to play, as they were designed to.  Have fun alongside them!\r<br/>\n\r<br/>\n~Melissa, in MD\r<br/>\n\r<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- \r<br/>\n  From: BRIAN POLIKOWSKY \r<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> \r<br/>\n  Sent: Monday, April 27, 2009 9:09 PM\r<br/>\n  Subject: Re: [unschoolingbasics] new to this! would like your responses! :)\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n  Hi Kari.\r<br/>\n  Unschoolers live as school did not exist.\r<br/>\n  To read more on unschooling go to:\r<br/>\n\r<br/>\n   <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a>\r<br/>\n\r<br/>\n  and\r<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a>\r<br/>\n\r<br/>\n  Here is  a post where Meredith shared some wise words from Pam Sooroshian:\r<br/>\n\r<br/>\n  &quot;Meredith wrote:\r<br/>\n  &gt; While unschooling is considered, for the purpose of the law, to be a form of homeschooling, radical unschooling is not a method of education. Its an approach to living with children in partnership, as if school did not exist.\r<br/>\n  &gt; \r<br/>\n\r<br/>\n  This is so important and seems like such a difficult shift for so many \r<br/>\n  people.\r<br/>\n\r<br/>\n  For some people, unschooling is still a form of education in which the \r<br/>\n  parents take on the responsibility of enticing their children to learn \r<br/>\n  the things they (the parents) think they should learn. They set up fun \r<br/>\n  experiences that the children will choose to participate in - with an \r<br/>\n  ulterior motive of educating the kids sort of surreptitiously. Back when \r<br/>\n  Mary Griffith wrote, &quot;The Unschooling Handbook,&quot; for example, I think \r<br/>\n  that&#39;s really what the vast majority of unschoolers probably had in \r<br/>\n  mind. It took time and the internet for the idea of unschooling to \r<br/>\n  develop into what we talk about here and on most of the other \r<br/>\n  unschooling lists, today.\r<br/>\n\r<br/>\n  Back then, there were people who &quot;got it&quot; pretty deeply and quickly and \r<br/>\n  did give up trying to &quot;educate&quot; and, instead, focused on &quot;living the \r<br/>\n  good life.&quot; And, today that is still true. But most people seem to need \r<br/>\n  to go through an evolutionary process in their thinking to get past that \r<br/>\n  &quot;educate&quot; concept and on to the &quot;live the good life,&quot; focus. These days, \r<br/>\n  there are a lot more people who have gotten to that level of \r<br/>\n  understanding and it is a lot easier to hear about it and talk about it \r<br/>\n  and I think more people &quot;get it&quot; a lot more easily and quickly, too. \r<br/>\n  Still, that process of &quot;getting it&quot; might be almost instantaneous or it \r<br/>\n  might take a couple of years - depending on the person.\r<br/>\n\r<br/>\n  You&#39;ll know it when you&#39;re there because you&#39;ll really know that what \r<br/>\n  you&#39;re doing is not trying any longer to live a life that &quot;educates&quot; \r<br/>\n  your children.\r<br/>\n\r<br/>\n  -pam\r<br/>\n\r<br/>\n  Alex Polikowsky\r<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a>\r<br/>\n\r<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a>\r<br/>\n\r<br/>\n  [Non-text portions of this message have been removed]\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n  \r<br/>\n\r<br/>\n\r<br/>\n------------------------------------------------------------------------------\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n  No virus found in this incoming message.\r<br/>\n  Checked by AVG - www.avg.com \r<br/>\n  Version: 8.0.238 / Virus Database: 270.12.4/2082 - Release Date: 04/27/09 06:19:00\r<br/>\n\r<br/>\n\r<br/>\n[Non-text portions of this message have been removed]\r<br/>\n\r<br/>\n\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240884492","msgId":39833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFQ0IwNUM1NkYwNjQwMEM4NTlEMjkxQzYzNjkxQzQ1QFJvY2tldFNhdWNlMj4=","inReplyToHeader":"PDY2MDM2MS45MjE1NC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+IDw2NjAzNjEuOTIxNTQucW1Ad2ViODE1MDYubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":39832,"nextInTopic":39834,"prevInTime":39832,"nextInTime":39834,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Exactly.  I d say definitely pretend that such a thing as school never existed!  Then, live that way!  Children (humans, really!) are hardwired to learn from","messageBody":"<div id=\"ygrps-yiv-78678098\">Exactly.  I&#39;d say definitely pretend that such a thing as school never existed!  Then, live that way!  Children (humans, really!) are hardwired to learn from birth--they can&#39;t help it.  We are their guides, if they need it.  Learn to see EVERYthing as a resource, not just &quot;educational&quot; things (books, toys, etc identified as such).  That&#39;s how your child sees everything, though he/she probably wouldn&#39;t put it that way!  This doesn&#39;t mean you turn everything into a unit study or a project, unless your child WANTS you to.  Follow your child&#39;s lead!  <br/>\n<br/>\nAnother way to look at it is that this is childhood and by definition it belongs to the child.  It is THEIR time to explore, to play, as they were designed to.  Have fun alongside them!<br/>\n<br/>\n~Melissa, in MD<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: BRIAN POLIKOWSKY <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Monday, April 27, 2009 9:09 PM<br/>\n  Subject: Re: [unschoolingbasics] new to this! would like your responses! :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Hi Kari.<br/>\n  Unschoolers live as school did not exist.<br/>\n  To read more on unschooling go to:<br/>\n<br/>\n   <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\n  and<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\n  Here is  a post where Meredith shared some wise words from Pam Sooroshian:<br/>\n<br/>\n  &quot;Meredith wrote:<br/>\n  &gt; While unschooling is considered, for the purpose of the law, to be a form of homeschooling, radical unschooling is not a method of education. Its an approach to living with children in partnership, as if school did not exist.<br/>\n  &gt; <br/>\n<br/>\n  This is so important and seems like such a difficult shift for so many <br/>\n  people.<br/>\n<br/>\n  For some people, unschooling is still a form of education in which the <br/>\n  parents take on the responsibility of enticing their children to learn <br/>\n  the things they (the parents) think they should learn. They set up fun <br/>\n  experiences that the children will choose to participate in - with an <br/>\n  ulterior motive of educating the kids sort of surreptitiously. Back when <br/>\n  Mary Griffith wrote, &quot;The Unschooling Handbook,&quot; for example, I think <br/>\n  that&#39;s really what the vast majority of unschoolers probably had in <br/>\n  mind. It took time and the internet for the idea of unschooling to <br/>\n  develop into what we talk about here and on most of the other <br/>\n  unschooling lists, today.<br/>\n<br/>\n  Back then, there were people who &quot;got it&quot; pretty deeply and quickly and <br/>\n  did give up trying to &quot;educate&quot; and, instead, focused on &quot;living the <br/>\n  good life.&quot; And, today that is still true. But most people seem to need <br/>\n  to go through an evolutionary process in their thinking to get past that <br/>\n  &quot;educate&quot; concept and on to the &quot;live the good life,&quot; focus. These days, <br/>\n  there are a lot more people who have gotten to that level of <br/>\n  understanding and it is a lot easier to hear about it and talk about it <br/>\n  and I think more people &quot;get it&quot; a lot more easily and quickly, too. <br/>\n  Still, that process of &quot;getting it&quot; might be almost instantaneous or it <br/>\n  might take a couple of years - depending on the person.<br/>\n<br/>\n  You&#39;ll know it when you&#39;re there because you&#39;ll really know that what <br/>\n  you&#39;re doing is not trying any longer to live a life that &quot;educates&quot; <br/>\n  your children.<br/>\n<br/>\n  -pam<br/>\n<br/>\n  Alex Polikowsky<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG - www.avg.com <br/>\n  Version: 8.0.238 / Virus Database: 270.12.4/2082 - Release Date: 04/27/09 06:19:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240880989","msgId":39832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2MDM2MS45MjE1NC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39831,"nextInTopic":39833,"prevInTime":39831,"nextInTime":39833,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Hi Kari. Unschoolers live as school did not exist. To read more on unschooling go to:  http://joyfullyrejoycing.com/ and http://sandradodd.com/unschooling ","messageBody":"<div id=\"ygrps-yiv-660612576\">Hi Kari.<br/>\nUnschoolers live as school did not exist.<br/>\nTo read more on unschooling go to:<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nand<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\nHere is  a post where Meredith shared some wise words from Pam Sooroshian:<br/>\n<br/>\n<br/>\n&quot;Meredith wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; While unschooling is considered, for the purpose of the law, to be a form of homeschooling, radical unschooling is not a method of education. Its an approach to living with children in partnership, as if school did not exist.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>This is so important and seems like such a difficult shift for so many <br/>\npeople.<br/>\n<br/>\nFor some people, unschooling is still a form of education in which the <br/>\nparents take on the responsibility of enticing their children to learn <br/>\nthe things they (the parents) think they should learn. They set up fun <br/>\nexperiences that the children will choose to participate in - with an <br/>\nulterior motive of educating the kids sort of surreptitiously. Back when <br/>\nMary Griffith wrote, &quot;The Unschooling Handbook,&quot; for example, I think <br/>\nthat&#39;s really what the vast majority of unschoolers probably had in <br/>\nmind. It took time and the internet for the idea of unschooling to <br/>\ndevelop into what we talk about here and on most of the other <br/>\nunschooling lists, today.<br/>\n<br/>\nBack then, there were people who &quot;got it&quot; pretty deeply and quickly and <br/>\ndid give up trying to &quot;educate&quot; and, instead, focused on &quot;living the <br/>\ngood life.&quot; And, today that is still true. But most people seem to need <br/>\nto go through an evolutionary process in their thinking to get past that <br/>\n&quot;educate&quot; concept and on to the &quot;live the good life,&quot; focus. These days, <br/>\nthere are a lot more people who have gotten to that level of <br/>\nunderstanding and it is a lot easier to hear about it and talk about it <br/>\nand I think more people &quot;get it&quot; a lot more easily and quickly, too. <br/>\nStill, that process of &quot;getting it&quot; might be almost instantaneous or it <br/>\nmight take a couple of years - depending on the person.<br/>\n<br/>\nYou&#39;ll know it when you&#39;re there because you&#39;ll really know that what <br/>\nyou&#39;re doing is not trying any longer to live a life that &quot;educates&quot; <br/>\nyour children.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new to this! would like your responses! :)","postDate":"1240878265","msgId":39831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5Njc5NS41NzE0NC5xbUB3ZWI0NTMxMC5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39830,"nextInTopic":39832,"prevInTime":39830,"nextInTime":39832,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Kari, Welcome to the list. Unschooling isn t about learning moments (something that took me a while to grasp) it is about living, it is more of a lifestyle","messageBody":"<div id=\"ygrps-yiv-961139934\">Kari,<br/>\n<br/>\nWelcome to the list. Unschooling isn&#39;t about learning moments (something that took me a while to grasp) it is about living, it is more of a lifestyle than a homeschooling method. That being said, my kids and I go to the library frequently they love it, we have books all over the house. My daughter enjoys doing unit studies and worksheets occasionally but she chooses which ones she does and when, typically we do them together. We are in our first year of being at home. She went to PS through 3rd grade last year, but do not ask me what grade level she would be at now a year later. We usually tell people 4th when they ask it makes it easier for them to understand. She is busy most days discovering her passions, currently manga anime, sewing/fashion design, jewelry making and a couple of other things. My 4 yr old son is passionate about everything he comes into contact with on a daily basis, however currently Bakugan is the thing that he loves most. The kids<br/>\n hang out with a variety of friends they have PS friends, homeschooling friends, and we have discovered a few other unschooling families in the area. <br/>\n<br/>\nBesides the library we have gotten a chance to work on a brand new local organic farm. So we will be spending time there working and getting some really good fresh veggies. We play games as a family, snuggle a lot, and we are learning more about each other and building stronger relationships. We just live each day and take what it has to offer to us. <br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":369705008,"authorName":"Kari Vermette","from":"Kari Vermette &lt;knv318@...&gt;","profile":"knv318","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"new to this! would like your responses! :)","postDate":"1240870991","msgId":39830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4Njc2MS4zMTYzMS5xbUB3ZWI0NjIxMC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":39831,"prevInTime":39829,"nextInTime":39831,"topicId":39830,"numMessagesInTopic":0,"msgSnippet":"Hello everyone! I have just joined this group in hope of discovering a little (or a lot) more about unschooling. We are currently homeschoolers with a variety","messageBody":"<div id=\"ygrps-yiv-1307915117\">Hello everyone!<br/>\n<br/>\nI have just joined this group in hope of discovering a little (or a lot) more about unschooling. We are currently homeschoolers with a variety of curriculum books but looking to tweak some things. I would like to hear from some families on what their typical day looks like. I have looked at several websites so I have familiarized myself with the term but would like to know how the days work out. I am also wondering if you get out any books at all throughout the day or if your child completely leads his/her learning every day on his/her own. I am also interested in unit studies and I think the 2 might go well together. I am all for allowing our children explore their own likes/curiosities, I just wonder if that will inevitably lead to opening up any books at all.....??!! Right now my 7 yr old daughter is playing with a cash registar and I can see how that can lead to many learning activities! Your responses would be greatly appreciated!!<br/>\n<br/>\nTHanks!!<br/>\nKari<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39852,"nextTopicId":39859}}