{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":78134331,"authorName":"Genant2@aol.com","from":"Genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fear and Food","postDate":"1152710451","msgId":15663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3MS4xYTQ4YjgxLjMxZTY1MTMzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":15662,"nextInTime":15664,"topicId":15663,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/11/2006 11:53:18 P.M. Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: Are my  personal food choices and those I make with","messageBody":"<div id=\"ygrps-yiv-355928148\">In a message dated 7/11/2006 11:53:18 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n<br/>\nAre my  personal food choices and those I make with my family based on fear <br/>\nor  fact?&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nFor me, I can say both.  I know my parents were very much in control  of <br/>\nfood, at least in the house, and I can see (fact) what it did for me,  LOL.  I so <br/>\ndid not want to pass that baggage onto my children (fear) so I  did a lot of <br/>\nresearch and soul search (fact) and dh and I decided together that  we were <br/>\ngoing to handle food differently.  We have no restrictions in this  house, no <br/>\nmeal times, no mandatory foods.  We do have what some might  consider junk food <br/>\nin the house etc.  Actually I can see my boys halloween  candy bags from where <br/>\nI am sitting now.<br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;It is unfortunate that the American diet has moved in so many  directions <br/>\n </span></blockquote>that what is best for human consumption is unclear to most people in  our <br/>\ncountry. &lt;&lt;&lt;&lt;<br/>\n <br/>\nI am not sure that is fact.  I would bet, now I don&#39;t  know for sure but just <br/>\nthinking about my own community of friends, that most  people know what the <br/>\nbody needs and how to best feed their body.  I know I  do, doesn&#39;t mean I eat <br/>\nthat way though.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; it is about their physical health as well,  which I believe integrates <br/>\n </span></blockquote>inextricably with overall health and the  aforementioned subcategories.....Most <br/>\nindividuals who have not had food  restrictions still do not make ideal or <br/>\nclose-to-ideal health choices.... The  majority of humans, especially Americans, <br/>\ndon&#39;t automatically do what is best  for our<br/>\nbodies ....We no longer supply the house with low- or no-nutrient  foods. If <br/>\nwe go out, they get what they want, and when we stay in, they get what  they <br/>\nwant within those options&lt;&lt;&lt;&lt;<br/>\n <br/>\nSo you believe it is a fact(?) that if you don&#39;t limit  their food choices <br/>\nthey can&#39;t do it for themselves?  That is not our  reality.  I have never <br/>\nlimited my children but we have worked together to  really be able to sense what <br/>\ntheir bodies need, so that they will never have to  rely on anyone else for food <br/>\nhelp.  They can &quot;instinctively&quot; eat, for lack  of a better word.  My oldest <br/>\nwas having migranes a couple of years ago, and  occasionally does now, we did <br/>\nsome research and found out that 95% of childhood  migranes come from lack of <br/>\nprotein.  So he is aware of that and knows when  he hasn&#39;t eaten enough protein <br/>\nand will come to me and say, mom can you stir fry  me up some tofu.  My <br/>\nyoungest has figured out that if drinks coke he gets a  stomach ache.  We shop <br/>\ntogether and they pick out what they want and I pick  out what I want.  And they <br/>\nare just as likely to put carrots and apples in  the cart, knowing we are <br/>\ngetting low as soda or chips.  <br/>\n <br/>\nPeople here know that I don&#39;t restrict my children and  have this image in <br/>\ntheir mind that they eat nothing but candy all day  long.  But in reality they <br/>\ndon&#39;t.  They eat less candy than I  do.  When we go to the movies we always get <br/>\ncandy, they will eat a little  and bring most of it back to the car with <br/>\nthem, it sits in the car until it is a  melted blob and then it gets tossed.  My <br/>\non the other hand, I have to eat  it all within the first 30 minutes of the <br/>\nmovie.  <br/>\n <br/>\nMy children, as I have said before, have never had food  controlled, they <br/>\nmake great choices on what they want to eat.  Me on the  other hand, I have grown <br/>\nup with food control and I make terrible ones.  So  I am not sure your <br/>\nstatements work out in reality.  I do believe it is  what most people THINK would <br/>\nhappen.  I also think it is great for you  and your family that you care so much <br/>\nand are really thinking about the choices  you make.  More than most people <br/>\ndo.  <br/>\n <br/>\nNow can I show my brothers your statement about smoking  &quot;Many people quit <br/>\nsmoking after learning about lung and other smoking-associated  cancers&quot;.  We <br/>\nhave had several people in our family die of lung cancer at a  young age and <br/>\nthey continue to smoke.<br/>\n <br/>\nPam G<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15467,"nextTopicId":15645}}