{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] cleaning up","postDate":"1297526755","msgId":46125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQUE0ODk5OENERjQ2NjM5RTk0NTdEMUJDRjEzMTREQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDM3NUNGMzI2LTk4RjUtNDU0Ny1BQkM3LTUwMUM4QjA4MkY3MEBtYWMuY29tPg=="},"prevInTopic":46118,"nextInTopic":0,"prevInTime":46124,"nextInTime":46126,"topicId":46109,"numMessagesInTopic":0,"msgSnippet":"***also want them to freely participate in cleaning the house, so it is a fun and safe place to be.*** They re too young to care about clean or messy.  They","messageBody":"<div id=\"ygrps-yiv-1384226149\">***also want them to freely participate in cleaning the house, so it is a fun and safe place to be.***<br/>\n<br/>\nThey&#39;re too young to care about clean or messy.  They don&#39;t see &quot;mess,&quot; they see their stuff.    If you can clean up happily they may sometimes happily join you for small tasks but if your expectation is that they will start cleaning and get the whole job done, that won&#39;t happen.  <br/>\n<br/>\nMake peace with that.  The house *is* your responsibility.  If you didn&#39;t have kids you&#39;d still be cleaning your house. <br/>\n<br/>\nMaybe there&#39;s a young teen in your neighborhood who would come in for a few dollars and pick up for you or engage your kids while you clean up.<br/>\n<br/>\n***A messy craft table (as in being overloaded with food remnants, pieces of discarded paper, unfinished and forgotten projects)***<br/>\n <br/>\nPam Sorooshian wrote about using trays for craft projects.  They are cheap, easily stored and offer a flat surface for projects or paperwork that can be moved in a hurry when you need that table for something else.   You can get those old melamine lunch trays online pretty cheaply.   Buy or build some shelves or cupboards where unfinished projects can be stacked on trays or in shoe boxes or whatever.  Get another craft table.    <br/>\n<br/>\nThe times when I&#39;ve felt overwhelmed with mess were really times I was disorganized.  It wasn&#39;t the &quot;stuff&quot; it was my lack of planning and poor utilization of space.   More bins, more shelves, more tables, more trash cans... think about things that would make it easier for you.   Metal or wire shelving is usually cheaper than wood.  Bin storage units or carts are fairly inexpensive.  The bin carts are especially great for kids because they can be scooted to any room in the house.   Stackable totes are great for markers, crayons, paints, paper bits, glue sticks, doo-dads and smallish projects.   <br/>\n<br/>\n***cat puke and poopy (he&#39;s an old cat and slowly losing his abilities)***<br/>\n<br/>\nThe absolutely best thing I ever did was tear all the carpet out of my house.  Critter accidents can be cleaned up fast from a bare floor.   In just a few minutes.  Less time than it takes you to go pee.   <br/>\n<br/>\n***I feel however if we can shift from me &quot;doing it all&quot; to distributing the responsibilities more ***<br/>\n<br/>\nThat just won&#39;t work.  You can&#39;t give someone responsibility.  And it&#39;s too much to expect little kids to feel the same way you do about clean space.  They don&#39;t even see the same thing you see when you look at all the stuff.    So if you must make someone else help you, hire someone. <br/>\n<br/>\n*** I can feel more free to be myself, more inspired and essentially a better unschooling parent.***<br/>\n<br/>\nI think that&#39;s an excuse.  Get better organized.  Spend some money on storage solutions and more trash bins.  You&#39;ll be a better unschooling mom when you can solve grown up problems without yelling at your kids and expecting them to do what they just can&#39;t do right now.   And if you have a better organized space it will be easier for the kids to help you when they are inspired to. There will be places to put things in a hurry so they can get to some new project quickly.  <br/>\n<br/>\nDylan really liked lap desks and we had them all over the house.  A lap desk makes a great little table for food in addition to being a portable work space. <br/>\n<br/>\nThe more you feel stressed by cleaning up, the more you feel those tasks are too much for you, the more your kids will see cleaning up as a chore and a problem to be avoided.   You will be less likely to ever get their willing help. <br/>\n<br/>\nThe more you can clean happily, accept some degree of clutter and mess, stay positive and joyful the more likely your children will help you when asked (in time.)    Some kids really don&#39;t see the value in a clean house until they&#39;re older, twelve or thirteen or even older.   And in that time your attitude (negative or positive)  will affect theirs.  <br/>\n<br/>\nDeb Lewis <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: cleaning up","postDate":"1297517044","msgId":46118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNjFsaysyMWdlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM3NUNGMzI2LTk4RjUtNDU0Ny1BQkM3LTUwMUM4QjA4MkY3MEBtYWMuY29tPg=="},"prevInTopic":46114,"nextInTopic":46125,"prevInTime":46117,"nextInTime":46119,"topicId":46109,"numMessagesInTopic":0,"msgSnippet":"Well, the 4-yo and I recently wanted to play with the Play-Doh but as we walked toward the table I saw it was full of Legos and blocks and said so. Now, his","messageBody":"<div id=\"ygrps-yiv-95353485\">Well, the 4-yo and I recently wanted to play with the Play-Doh but as we walked toward the table I saw it was full of Legos and blocks and said so. Now, his version of clearing the table was not how I would have done it, but it did get done. And most of the blocks ended up in the tub. <br/>\n<br/>\nCan you work in some transition clear ups that really make sense -- there realy isn&#39;t space to do the next thing until we clear this up? And be OK with an imperfect job? Sure, there were a few Legos mixed in with the Play-Doh but life went on. <br/>\n<br/>\nI find that a small thing being cleared up just makes the rest of the mess more tolerable, somehow. :)<br/>\n<br/>\nNance<br/>\n<br/>\n <br/>\n <br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, nani &lt;nanismith@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I have recently noticed that I&#39;m getting more uncomfortable with a &quot;messy&quot; house and I find myself cleaning up for several hours a day, between laundry, dishes, kids craft messes, toys to step over and trip over, cat puke and poopy (he&#39;s an old cat and slowly losing his abilities), making healthy foods 3 times a day, 3 or more snack times a day, blahblablah, I feel overwhelmed to the point where I say to my kids (ages 3 and 6) &quot;I can&#39;t snuggle you in bed if I can&#39;t safely get up afterwards and not trip over things when I leave the room&quot; in other words withholding my love unless they clean up. I&#39;ve taken a step back into conditional thinking and want to free myself from it, however I also want them to freely participate in cleaning the house, so it is a fun and safe place to be. I personally value cleaning up a project area after being done with that particular idea, as to make space for a new idea. A messy craft table (as in being overloaded with food remnants, pieces of discarded paper, unfinished and forgotten projects) doesn&#39;t give the pace for a new idea to unfold, so in essence things get stuck and nothing flows forward. Since my kids are very creative and love crafts, they just extend that area then onto the floor, they end up eating food using the trashcan surface as a table top, the floor as a craft table, ya know....<br/>\n&gt; And after a few days of this I just blow up and say &quot;clean NOW!&quot; <br/>\n&gt; Ok, so how can I align things better, have a happy space that is open for projects, let them see the value of free flow after cleaning up, and most of all free myself from being the nagging Ueber-Mom of Clean-Up-Now? I feel however if we can shift from me &quot;doing it all&quot; to distributing the responsibilities more that I can feel more free to be myself, more inspired and essentially a better unschooling parent.<br/>\n&gt; Please be kind.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: cleaning up","postDate":"1297469918","msgId":46114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGprdSt0dTVkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM3NUNGMzI2LTk4RjUtNDU0Ny1BQkM3LTUwMUM4QjA4MkY3MEBtYWMuY29tPg=="},"prevInTopic":46111,"nextInTopic":46118,"prevInTime":46113,"nextInTime":46115,"topicId":46109,"numMessagesInTopic":0,"msgSnippet":"... *************** It sounds nice to talk about distributing the responsibilities and everyone chipping in but that s a purely adult point of view. You","messageBody":"<div id=\"ygrps-yiv-803202154\">nani &lt;nanismith@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel however if we can shift from me &quot;doing it all&quot; to distributing the responsibilities more that I can feel more free to be myself, more inspired and essentially a better unschooling parent.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt sounds nice to talk about &quot;distributing the responsibilities&quot; and &quot;everyone chipping in&quot; but that&#39;s a purely adult point of view. You can&#39;t give a responsibility to someone else, only a duty. Responsibilities are taken on voluntarily. <br/>\n<br/>\nSo how do you get young kids to Want to help? Make it sensible, easy and convenient for them. Make it something they see the point of, and can see how to do pretty easily. How that happens will take some thoughtfulness and creativity, though! You may need to change the way you think about cleaning so that you see the process from a child&#39;s point of view. Kids are busy, distracted people. How can you make cleaning valuable to Your busy, distracted people?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I find myself cleaning up for several hours a day, between laundry, dishes, kids craft messes, toys to step over and trip over, cat puke and poopy (he&#39;s an old cat and slowly losing his abilities), making healthy foods 3 times a day, 3 or more snack times a day, blahblablah, I feel overwhelmed <br/>\n </span></blockquote>***************<br/>\n<br/>\nIt sounds overwhelming! Look for ways to streamline all of that so that there&#39;s less to be done. It might help to step back from the idea of kid involvement and ask yourself &quot;how would I do this if all my kids were disabled and I had chronic fatigue?&quot; That might let you re-think the logistical puzzle with less emotions tied up. The emotional load of &quot;kids Should help&quot; is getting in your way.<br/>\n<br/>\n Maybe it would help to pare down the cooking and snack prep so that you&#39;re combining more of it. Have more food readily available so you don&#39;t Have to do so much cooking, food is already there. If you can pare down cooking, you&#39;ll be paring down dishwashing and kitchen clean-up, too, so its a 3-for-1 deal in terms of what you get &quot;back&quot;. <br/>\n<br/>\nBins and baskets work well for some people for tidying up - toss armloads of stuff into a basket to be sorted some other time. Sweep the contents of the table into a bin and set it aside. Or put down cloths that let you gather things up in a fell swoop. <br/>\n<br/>\nCan you find another home for that cat?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;A messy craft table (as in being overloaded with food remnants, pieces of discarded paper, unfinished and forgotten projects) doesn&#39;t give the pace for a new idea to unfold, so in essence things get stuck and nothing flows forward. Since my kids are very creative and love crafts, they just extend that area then onto the floor, they end up eating food using the trashcan surface as a table top, the floor as a craft table, ya know....<br/>\n </span></blockquote>****************<br/>\n<br/>\nProjects moving elsewhere isn&#39;t a sign that &quot;things get stuck and nothing flows&quot; - its more a sign of flow accomodating the situation. The trouble is, you have an idea that crafts and food belong on the table. What&#39;s wrong with the transhcan surface? Drape a vinyl table cloth over it and another on the floor - that way the mess gets gathered up in the cloth, too, when it&#39;s no longer of interest to anyone. We use all sorts of things as tables, here - boxes, chairs, step stools - and plenty of projects happen on the couch, bed or floor. I&#39;m fussy about Food being on something table-like because that way I can let a mess &quot;go&quot; for longer than I really want without the added worry of a cookie turning into a science experiment under the couch :P<br/>\n<br/>\nYou mentioned wanting to clean when things are Done, but it&#39;s often more realistic to clean when things are Starting - easier to get the kids involved kindly because cleaning up Makes Sense when you want to start a project and something else is in the way. But! Its important to make clean-up as easy on the kids as possible, and to some extent what&#39;s going to make it seem easy depends on personality. Some people like &quot;a place for everything etc&quot; while others are happy to dump it all in a heap (or basket) and move on. <br/>\n<br/>\nAnother thing to consider is to think of the ways your kids are trying to be helpful on their own terms. 3yos often like to wash things, so look for ways and things for your 3yo to wash. Of course, that may mean you clear the counter/floor/space in front of the window first so your little one can wash it ;) 6yos are more likely to take on little responsibilities if you let them - but again, they may not be the most &quot;convenient&quot; of things from your perspective. Watering plants and feeding pets and organizing the cans on the shelves can feel big and important to a 6yo - more so than tidying up the table. If you can see your kids as Wanting to take on responsibilities on their own terms, it may help you feel better about the responsibilities you&#39;ve chosent - like having two little kids at home ;)<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":184045447,"authorName":"momfrohlich73@sbcglobal.net","from":"momfrohlich73@...","profile":"momfrohlich73@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] cleaning up","postDate":"1297450096","msgId":46111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MDg0NC4xMDEyMS5xbUB3ZWI4MjgwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDM3NUNGMzI2LTk4RjUtNDU0Ny1BQkM3LTUwMUM4QjA4MkY3MEBtYWMuY29tPg=="},"prevInTopic":46109,"nextInTopic":46114,"prevInTime":46110,"nextInTime":46112,"topicId":46109,"numMessagesInTopic":0,"msgSnippet":"I find saying Let s helps a lot. Shannan","messageBody":"<div id=\"ygrps-yiv-1079164694\">I find saying &quot;Let&#39;s&quot; helps a lot.<br/>\n<br/>\nShannan</div>","specialLinks":[]},{"userId":275092036,"authorName":"nani","from":"nani &lt;nanismith@...&gt;","profile":"sophia_amara","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"cleaning up","postDate":"1297449772","msgId":46109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3NUNGMzI2LTk4RjUtNDU0Ny1BQkM3LTUwMUM4QjA4MkY3MEBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":46111,"prevInTime":46108,"nextInTime":46110,"topicId":46109,"numMessagesInTopic":0,"msgSnippet":"I have recently noticed that I m getting more uncomfortable with a messy house and I find myself cleaning up for several hours a day, between laundry,","messageBody":"<div id=\"ygrps-yiv-707969792\">I have recently noticed that I&#39;m getting more uncomfortable with a &quot;messy&quot; house and I find myself cleaning up for several hours a day, between laundry, dishes, kids craft messes, toys to step over and trip over, cat puke and poopy (he&#39;s an old cat and slowly losing his abilities), making healthy foods 3 times a day, 3 or more snack times a day, blahblablah, I feel overwhelmed to the point where I say to my kids (ages 3 and 6) &quot;I can&#39;t snuggle you in bed if I can&#39;t safely get up afterwards and not trip over things when I leave the room&quot; in other words withholding my love unless they clean up. I&#39;ve taken a step back into conditional thinking and want to free myself from it, however I also want them to freely participate in cleaning the house, so it is a fun and safe place to be. I personally value cleaning up a project area after being done with that particular idea, as to make space for a new idea. A messy craft table (as in being overloaded with food remnants, pieces of discarded paper, unfinished and forgotten projects) doesn&#39;t give the pace for a new idea to unfold, so in essence things get stuck and nothing flows forward. Since my kids are very creative and love crafts, they just extend that area then onto the floor, they end up eating food using the trashcan surface as a table top, the floor as a craft table, ya know....<br/>\nAnd after a few days of this I just blow up and say &quot;clean NOW!&quot; <br/>\nOk, so how can I align things better, have a happy space that is open for projects, let them see the value of free flow after cleaning up, and most of all free myself from being the nagging Ueber-Mom of Clean-Up-Now? I feel however if we can shift from me &quot;doing it all&quot; to distributing the responsibilities more that I can feel more free to be myself, more inspired and essentially a better unschooling parent.<br/>\nPlease be kind.</div>","specialLinks":[]}],"prevTopicId":46120,"nextTopicId":46131}}