{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling creates people who are motivated!","postDate":"1285621955","msgId":44890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDJDOUZENzI1M0UzMi0xOTg0LTE1NEB3ZWJtYWlsLW0wMzcuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":44889,"nextInTime":44891,"topicId":44890,"numMessagesInTopic":0,"msgSnippet":"From Bob s Newsletter too, but Idzie can always be found on her blog.  http://yes-i-can-write.blogspot.com ~Kelly Kelly Lovejoy There is no single effort more","messageBody":"<div id=\"ygrps-yiv-1134328182\">From Bob&#39;s Newsletter too, but Idzie can always be found on her blog.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://yes-i-can-write.blogspot.com\">http://yes-i-can-write.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nFriday, September 17, 2010<br/>\n<br/>\n<br/>\nMisconceptions About Unschooling<br/>\n<br/>\n<br/>\nThis blog was linked on an MSN Lifestyle blog called Embrace The Chaos (in a post about unschooling, of course).  Since then, I&#39;ve been getting a LOT of hits from there, and a couple of slightly aggressive comments to boot.  But that&#39;s not what I want to talk about right now. <br/>\n<br/>\nBecause my blog was linked in the article, I broke my no-reading-comments rule, and of course the comments are filled with the same type of anti-unschooling rhetoric you find in the comments section of any unschooling article directed at the general public (one gem was &quot;how do people have the arrogance to say that parents know what is best for their children?&quot;).  There are so, so many misconceptions out there, and most of the time I just let it all slide, but today I felt inspired to address a few of them:<br/>\n<br/>\nStructure  One of the biggest misconceptions about unschooling is that it&#39;s about a lack of structure. It isn&#39;t. What it *is* about is choice. The freedom for the learner, the unschooler, to choose more or less structure as <br/>\nthey desire.<br/>\n<br/>\nUn-Educating  Unschooling is NOT &quot;un-learning&quot; or &quot;un-educating&quot;.  It&#39;s simply a different way of &quot;getting an education&quot; than most people are familiar with.  School is synonymous with learning and education for most of the populace, but unschoolers totally reject that idea.  Many unschoolers see school as an oppressive institution that turns learning (which should be joyful) into an unpleasant act that is more about memorization to pass the test than true, deep learning.  The word unschooling is used in the same way you&#39;d use unbinding or unchaining.  It&#39;s not about getting rid of learning, it&#39;s about freeing yourself from schooling.<br/>\n<br/>\nUnschooling Is Not New  In many articles, and if not in the article itself then in the comments, people refer to unschooling as a &quot;fad&quot;: a newfangled idea that is sure to fail when these unschooled kids grow up.  What the people making such statements fail to realize is that learning from life (unschooling) is how humans have learned for the vast majority of our existence as a species.  Schooling, on the other hand, is pretty new, and thus the real &quot;experiment&quot; in education, not unschooling.  And even looking only at the last century, unschooling still isn&#39;t a new phenomena.  It&#39;s been around in it&#39;s modern form (as has the word unschooling) since the 70&#39;s, and there are hundreds of grown unschoolers (myself included) who prove that unschooling works. <br/>\n<br/>\nEducated Parents  Many people, if they agree that unschooling might, possibly, in some situations, work, say that you must have highly educated parents for unschooling to be successful.  Well, my mother has a high school diploma, and nearly finished a nursing program in college, which is the extent of her institutionalized education (of course, she loves to learn things without the aid of school, and is a true life learner herself.).  My father is a university dropout, who for years has worked in jobs that usually require a university degree, proving that skills trump pieces of paper.  So to much of the world, I don&#39;t think my parents would look &quot;highly educated&quot;.  What they are is very good at learning what they need to know outside of a school building!<br/>\n<br/>\nTo Be a Successful Unschooler, You Have to Be Motivated  Now this one I&#39;ve heard a LOT.  Like, an insanely large amount of times.  It&#39;s right up there for me with the socialization thing (though I think socialization still wins).  This is what I hear most often from people who see how happy, articulate, and socially capable my sister and I are, so are forced to realize that unschooling must work some of the time.  But, to preserve their own vision of the world--and to make the years they spent in school/the years they&#39;re forcing their children to spend in school, worthwhile--they have to believe that it would only work in special cases.  That it would only work for special people.  People who are especially intelligent and especially motivated.  Now, as much as this is flattering to me as an individual in a sense (&quot;you&#39;re really smart so it worked for you!&quot;), this idea drives me absolutely crazy.  Because here&#39;s the thing: unschooling does not work for motivated people.  Unschooling creates people who are motivated!  The act of placing the power over learning and life into the individual&#39;s hands is both empowering and motivating.  If learning is never made into something unpleasant, then it continues to be something joyful and fun throughout life.  That&#39;s what this &quot;motivation&quot; people see in unschoolers really is: it&#39;s a joy in learning that is seen far less often among the masses in school.  <br/>\n<br/>\nUnschooling Could Never Produce Doctors  Well, I know two unschoolers who are pursuing just such a path.  Know how they&#39;re doing it?  By taking the tests they need to get into their chosen program, the same as anyone schooled would!  Just because you&#39;re an unschooler and was never required to take tests when growing up, doesn&#39;t mean that you&#39;re unwilling or unable to study for and take tests when that&#39;s what you desire.  Remember, it&#39;s all about free choice, not lack-of-structure.<br/>\n<br/>\nAn Unschooler Can&#39;t Learn Anything Their Parents Don&#39;t Know  Where on earth did anyone get the idea that an unschoolers only resource was their parents??  Unschoolers can get the information they need from: the internet; the library; homeschool co-op classes; college classes; people in their community/mentors; cultural and community centers that offer classes...  There are many, many ways to learn every single thing they teach in school plus a million other things, while outside of the compulsory school system.<br/>\n<br/>\nNow, there are enough misconceptions about unschooling out there to write a dozen posts (at least!) dispelling them, but I think that&#39;s enough for now!  I hope this will be helpful to at least some of the people who are just starting to find out about unschooling, and have landed on my blog to do so...<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44889,"nextTopicId":44895}}