{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: new to the group and a ?","postDate":"1316115337","msgId":47281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0dGsyOStwZnVrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTYwOTk0MzguMTg5MzMuWWFob29NYWlsUkNAd2ViODExMDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":47279,"nextInTopic":0,"prevInTime":47280,"nextInTime":47282,"topicId":47272,"numMessagesInTopic":0,"msgSnippet":"... Focus on this - on what s getting better rather than what you Wish were better. Four days is no time at all! Learning to see your kids in a positive light","messageBody":"<div id=\"ygrps-yiv-1931264315\">Kristie &lt;messy_boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have <br/>\n&gt; been treating them completely different the last four days, and have already <br/>\n&gt; seen improvements...<br/>\n<br/>\n </span></blockquote>Focus on this - on what&#39;s getting better rather than what you Wish were better. Four days is no time at all! <br/>\n<br/>\nLearning to see your kids in a positive light is one of the new skills you&#39;ll be developing as an unschooling parent. It&#39;s an important one! As you see the positive in your kids, they&#39;ll start to notice and pick up on it. It&#39;s the sort of the attitude that spreads - but not if you try to push it. You can&#39;t teach them to see each other in a positive light, but you can show they you see each one of them in a good way, which will help them feel good - and as a result they&#39;ll have less reason to pick and criticize. They won&#39;t Need to build up their own sense of self by cutting each other down. There will still be some competition, most likely - as I said, some of that is natural - but it will become more friendly competition over time as they all start to feel like they&#39;re &quot;on the same side&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The 13 yo is always very quick to criticize the 10 yo as being immature, lazy, <br/>\n </span></blockquote>***************<br/>\n<br/>\nHave you apologized for your own past behavior and expectations? That could help. It may also help to be candid about some of your own flaws  - not as a &quot;lesson&quot; in being a better person, but as a way to connect with your kids. The sharp division between parents and kids as teacher and taught sets family members up to dehumanize one another - look at the way most people talk about children and especially teens - as if they&#39;re another species! So part of your work for awhile will be learning to see a group of people with different needs and skills living together where there have been opposing camps of Parents and Kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; having weird ideas, etc.<br/>\n<br/>\n </span></blockquote>Do you see &quot;weird ideas&quot; as a positive thing? If not, work on that! It might help to read or watch some movies about people who have been out of step with the norm to shift your perspective. Again, not as a kind of lesson, but a way to change your own thinking. <br/>\n<br/>\nThat being said, some families prize &quot;weird&quot; above &quot;normal&quot; and it could be helpful to think about people who are &quot;normal&quot; as being just as valuable as people who stand out. Again, its a matter of seeing people as people rather than icons - seeing the world in terms of &quot;freaks&quot; and &quot;muggles&quot; doesn&#39;t help kids get along in a family full of different personalities. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My 10 yo is very sensitive and I can see that this <br/>\n&gt; hurts him and just furthers his self-defeating behavior.  He has built a shell <br/>\n&gt; for himself.  Many times he just doesn&#39;t even try.<br/>\n<br/>\n </span></blockquote>Doesn&#39;t even try what? If his goals and interests are very different from other family members, that could be part of the problem. It&#39;s not that &quot;he doesn&#39;t try&quot; but that what he values is so different y&#39;all don&#39;t see him doing what he cares about, only not-doing those things he doesn&#39;t see as important. If he&#39;s not cleaning the bathroom because he&#39;s too busy pondering the wonders of the universe, that could seem like not-trying... or it could seem like a person who is so deeply concerned with larger issues as to not mind the small stuff. There are whole religious practices built around a set of values of that nature ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well, I just had a real life example.  They were fighting over a toy.  My 3 yo <br/>\n&gt; calls my 5 yo a name.  Whenever they are frustrated with a situation (like a toy <br/>\n&gt; not working right) or with each other, they automatically go to anger and <br/>\n&gt; name-calling.  It&#39;s very &quot;eat or be eaten&quot; if you know what I mean.<br/>\n<br/>\n </span></blockquote>It also helps to keep in mind that 3 and 5yos are not 10 and 13 year olds! It&#39;s perfectly natural for a young child, with few skills as yet, to try whatever tool comes to hand. It&#39;s perfectly normal for 5yos to call people names, for that matter, even in warm fuzzy unschooling homes. Try to get involved sooner so you can diffuse the conflict Before it gets to the name-calling, but also see levels of skillfulness. Calling a name is a much better choice than hitting, for instance. That doesn&#39;t make it the Best Of All Choices, but often in moments of stress its hard to find the Best Of All Choices. That&#39;s true of adults, too! If you or your kids can see a choice and are going for the better option - kinder, more peaceful, more supportive - that&#39;s a good thing. More than that comes with practice. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just hate it that they don&#39;t...<br/>\n<br/>\n </span></blockquote>Practice even in the words you use, even the words you say to yourself. Don&#39;t hate, not even rhetorically. Hating anything about your kids won&#39;t help anything. See them as people who need your help. You can&#39;t help them if you&#39;re hating. It sounds like a little, nit-picky thing, but changing the way you talk to yourself will slowly change the way you see your kids - so think positive! They&#39;re people trying to get their needs met. How can you help? You don&#39;t have to know the answer yet! You&#39;re learning too, after all. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: new to the group and a ?","postDate":"1316113495","msgId":47279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0dGk4bitsMWM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTYwOTE5NzUuNTEyMzIuWWFob29NYWlsUkNAd2ViODExMDMubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":47277,"nextInTopic":47281,"prevInTime":47278,"nextInTime":47280,"topicId":47272,"numMessagesInTopic":0,"msgSnippet":"... A certain amount of that is normal, especially with boys. But it is also aggravated by the way schools set everything up to be competitive. If you re","messageBody":"<div id=\"ygrps-yiv-1702070071\">Kristie &lt;messy_boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My kids, particularly my older two (boys, <br/>\n&gt; 13 and 10) can be quite rude to each other.  There seems to be a lot of <br/>\n&gt; competition between them and comparison. <br/>\n<br/>\n </span></blockquote>A certain amount of that is normal, especially with boys. But it is also aggravated by the way schools set everything up to be competitive. If you&#39;re working on the making the home environment supportive, that will help! In that regard, keep in mind that &quot;fair&quot; doesn&#39;t mean &quot;equal&quot; - if someone has bigger needs, then it&#39;s better to give that person more support in the moment rather than trying to balance things out. That actually creates situations where people tend to be more supportive overall. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new to the group and a ?","postDate":"1316110229","msgId":47277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MDIzRjFCQTY1NzRCMTg4QjY2OUYwODE2ODM1ODFCQEx5bGFQQz4=","inReplyToHeader":"PDEzMTYwOTk0MzguMTg5MzMuWWFob29NYWlsUkNAd2ViODExMDEubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDEzMTYwOTE5NzUuNTEyMzIuWWFob29NYWlsUkNAd2ViODExMDMubWFpbC5tdWQueWFob28uY29tPiA8Qzg5NjhDOUMtQ0NFMS00RTZELTkxQTktODIwRkJFNzNENzEyQHZlcml6b24ubmV0PiA8MTMxNjA5OTQzOC4xODkzMy5ZYWhvb01haWxSQ0B3ZWI4MTEwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":47274,"nextInTopic":47279,"prevInTime":47276,"nextInTime":47278,"topicId":47272,"numMessagesInTopic":0,"msgSnippet":"4 days is a very short amount of time to see changes, or the impact/reflection of *your* changes. here’s a short, simple article on helping siblings resolve","messageBody":"<div id=\"ygrps-yiv-26411566\">4 days is a very short amount of time to see changes, or the impact/reflection of *your* changes.    <br/>\nhere’s a short, simple article on helping siblings resolve conflicts, that might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/peacemeal/201010/3-steps-transform-sibling-conflict-sibling-camaraderie?page=1\">http://www.psychologytoday.com/blog/peacemeal/201010/3-steps-transform-sibling-conflict-sibling-camaraderie?page=1</a><br/>\nit won’t stop the name calling and power struggling right away, or magically, but it might provide you with some simple tools, and help them develop those tools as well.<br/>\nmainly though, give it time, with the backing off on chores and schoolwork, and them being treated more harshly, etc, it’s going to take time for them to decompress from what was their reality to what is – and to transform their treatment of each other to reflect the new paradigm.<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237699340,"authorName":"Kristie","from":"Kristie &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [unschoolingbasics] new to the group and a ?","postDate":"1316099438","msgId":47274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTYwOTk0MzguMTg5MzMuWWFob29NYWlsUkNAd2ViODExMDEubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PEM4OTY4QzlDLUNDRTEtNEU2RC05MUE5LTgyMEZCRTczRDcxMkB2ZXJpem9uLm5ldD4=","referencesHeader":"PDEzMTYwOTE5NzUuNTEyMzIuWWFob29NYWlsUkNAd2ViODExMDMubWFpbC5tdWQueWFob28uY29tPiA8Qzg5NjhDOUMtQ0NFMS00RTZELTkxQTktODIwRkJFNzNENzEyQHZlcml6b24ubmV0Pg=="},"prevInTopic":47273,"nextInTopic":47277,"prevInTime":47273,"nextInTime":47275,"topicId":47272,"numMessagesInTopic":0,"msgSnippet":"Thanks, Joyce.  I just reserved that book at the library. Some examples: Who is farther on a video game and who did or didn t use cheats to get there. Who is","messageBody":"<div id=\"ygrps-yiv-741358388\">Thanks, Joyce.  I just reserved that book at the library.<br/>\n<br/>\nSome examples:<br/>\n<br/>\nWho is farther on a video game and who did or didn&#39;t use cheats to get there.<br/>\n<br/>\nWho is &#39;laziest&#39; because they didn&#39;t do their chores or do them right. (We just <br/>\ndropped formal chores, so maybe this will help.  I can really see how I set us <br/>\nup for this.  My 10 yo is very unmotivated to help and therefore &quot;lazy.&quot;  I hope <br/>\nI can undo that damage.)<br/>\n<br/>\nWho can run faster, climb higher, ride a bike better...<br/>\n<br/>\nThe 13 yo is always very quick to criticize the 10 yo as being immature, lazy, <br/>\nhaving weird ideas, etc.  My 10 yo is very sensitive and I can see that this <br/>\nhurts him and just furthers his self-defeating behavior.  He has built a shell <br/>\nfor himself.  Many times he just doesn&#39;t even try.<br/>\n<br/>\nI am trying to be more present and aware of what is going on.  I admit that I <br/>\nhave been &quot;too busy&quot; with school, housework, computer, etc...to be very present <br/>\nfor them.  I have also been so stressed out that I just gave up.  They have <br/>\noften been on their own to work out their differences - or not.  (I feel like <br/>\ncrap admitting this - but I am being honest)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;See behavior as communication. Why do they need to call each other <br/>\n&gt;&gt;names? Why do they need to be disrespectful? What *need* are they <br/>\n&gt;&gt;trying to meet in these anti-social ways?<br/>\n<br/>\n </span></blockquote>Well, I just had a real life example.  They were fighting over a toy.  My 3 yo <br/>\ncalls my 5 yo a name.  Whenever they are frustrated with a situation (like a toy <br/>\nnot working right) or with each other, they automatically go to anger and <br/>\nname-calling.  It&#39;s very &quot;eat or be eaten&quot; if you know what I mean.<br/>\n<br/>\nI just hate it that they don&#39;t have any consideration and respect for each <br/>\nother.  No, I haven&#39;t been a good example of this at all, I have been absent, <br/>\nbut I am determined to change myself and be there for them from now on.  I have <br/>\nbeen treating them completely different the last four days, and have already <br/>\nseen improvements...<br/>\n<br/>\nI appreciate any further input!!!<br/>\nKristie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thu, September 15, 2011 9:28:34 AM<br/>\nSubject: Re: [unschoolingbasics] new to the group and a ?<br/>\n<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 15, 2011, at 9:06 AM, Kristie wrote:<br/>\n<br/>\n&gt; My kids, particularly my older two (boys,<br/>\n&gt; 13 and 10) can be quite rude to each other. There seems to be a lot of<br/>\n&gt; competition between them and comparison.<br/>\n<br/>\nHave you read Siblings Without Rivalry? There may be things you&#39;re <br/>\ndoing or not doing that&#39;s setting them up to feel they need to compete <br/>\nto get their needs met.<br/>\n<br/>\nBoys in particular, though, can be competitive! Competition shouldn&#39;t <br/>\nbe seen as a bad thing. And what&#39;s competition if there isn&#39;t the <br/>\nability to compare against something or someone?<br/>\n<br/>\nCan you give some examples?<br/>\n<br/>\nThe first, best thing a mom can do is be more present. It&#39;s easy to <br/>\nread that and either say &quot;I am&quot; -- but the kids are showing that <br/>\nyou&#39;re idea of enough isn&#39;t enough for them. Or to say &quot;I <br/>\ncan&#39;t&quot; (because of other things going on). It&#39;s better for problem <br/>\nsolving to see this as a must and adjust your life, come up with <br/>\ncreative ways, ask here for input on creative ideas.<br/>\n<br/>\nIt won&#39;t solve everything but if you can be there and notice the build <br/>\nup and redirect the situation, you can cut way down on them.<br/>\n<br/>\nRather than fixating on changing them -- which you can&#39;t! -- focus on <br/>\nchanging the environment around them. Focus on you being different. <br/>\nStep back and look at what lead up to something hurtful. Find ways to <br/>\nredirect *before* it breaks down.<br/>\n<br/>\nSandra Dodd has some good pages on sibling relationships:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n<br/>\nThere are links there that lead to more.<br/>\n<br/>\n&gt; How can I help them want to treat each<br/>\n&gt; other better?<br/>\n<br/>\nYou can&#39;t. You can only change you.<br/>\n<br/>\nDo stop them if they&#39;re hurting someone or damaging something. But <br/>\ndon&#39;t focus on the choice. They aren&#39;t deliberately choosing the &quot;bad&quot; <br/>\nchoice. They&#39;re making choices they understand, that seem a good match <br/>\nin the (emotional) moment.<br/>\n<br/>\nThey need help with better ways. They need to see lots and lots of <br/>\nbetter ways before they can actually do those better ways themselves. <br/>\nBecause the better ways are complex! (Many adults haven&#39;t figured out <br/>\nhow to negotiate with someone else.) They will intellectually <br/>\nunderstand better ways long before they can figure out how to put them <br/>\ninto practice in the heat of the moment, in<br/>\n<br/>\n&gt; The younger ones are starting to copy this behavior (name calling<br/>\n&gt; and disrespect) and I really don&#39;t want that to happen.<br/>\n<br/>\nSee behavior as communication. Why do they need to call each other <br/>\nnames? Why do they need to be disrespectful? What *need* are they <br/>\ntrying to meet in these anti-social ways?<br/>\n<br/>\nIf people have all their needs met, they don&#39;t need to fight. We don&#39;t <br/>\nhave control over all of kids&#39; needs. But we can make them more <br/>\ncomfortable while they work through something. We can control the <br/>\nenvironment. *Be* the peaceful insert into the environment. You can&#39;t <br/>\nmake them feel peace. But you can be peaceful.<br/>\n<br/>\nHopefully people will be along with practical applications of that! <br/>\nBut that&#39;s the mindset you want to be working towards.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new to the group and a ?","postDate":"1316096914","msgId":47273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4OTY4QzlDLUNDRTEtNEU2RC05MUE5LTgyMEZCRTczRDcxMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMTYwOTE5NzUuNTEyMzIuWWFob29NYWlsUkNAd2ViODExMDMubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDEzMTYwOTE5NzUuNTEyMzIuWWFob29NYWlsUkNAd2ViODExMDMubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":47272,"nextInTopic":47274,"prevInTime":47272,"nextInTime":47274,"topicId":47272,"numMessagesInTopic":0,"msgSnippet":"... Have you read Siblings Without Rivalry? There may be things you re doing or not doing that s setting them up to feel they need to compete to get their","messageBody":"<div id=\"ygrps-yiv-274834175\">On Sep 15, 2011, at 9:06 AM, Kristie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My kids, particularly my older two (boys,<br/>\n&gt; 13 and 10) can be quite rude to each other. There seems to be a lot of<br/>\n&gt; competition between them and comparison.<br/>\n<br/>\n </span></blockquote>Have you read Siblings Without Rivalry? There may be things you&#39;re  <br/>\ndoing or not doing that&#39;s setting them up to feel they need to compete  <br/>\nto get their needs met.<br/>\n<br/>\nBoys in particular, though, can be competitive! Competition shouldn&#39;t  <br/>\nbe seen as a bad thing. And what&#39;s competition if there isn&#39;t the  <br/>\nability to compare against something or someone?<br/>\n<br/>\nCan you give some examples?<br/>\n<br/>\nThe first, best thing a mom can do is be more present. It&#39;s easy to  <br/>\nread that and either say &quot;I am&quot; -- but the kids are showing that  <br/>\nyou&#39;re idea of enough isn&#39;t enough for them. Or to say &quot;I  <br/>\ncan&#39;t&quot; (because of other things going on). It&#39;s better for problem  <br/>\nsolving to see this as a must and adjust your life, come up with  <br/>\ncreative ways, ask here for input on creative ideas.<br/>\n<br/>\nIt won&#39;t solve everything but if you can be there and notice the build  <br/>\nup and redirect the situation, you can cut way down on them.<br/>\n<br/>\nRather than fixating on changing them -- which you can&#39;t! -- focus on  <br/>\nchanging the environment around them. Focus on you being different.  <br/>\nStep back and look at what lead up to something hurtful. Find ways to  <br/>\nredirect *before* it breaks down.<br/>\n<br/>\nSandra Dodd has some good pages on sibling relationships:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n<br/>\nThere are links there that lead to more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I help them want to treat each<br/>\n&gt; other better?<br/>\n<br/>\n </span></blockquote>You can&#39;t. You can only change you.<br/>\n<br/>\nDo stop them if they&#39;re hurting someone or damaging something. But  <br/>\ndon&#39;t focus on the choice. They aren&#39;t deliberately choosing the &quot;bad&quot;  <br/>\nchoice. They&#39;re making choices they understand, that seem a good match  <br/>\nin the (emotional) moment.<br/>\n<br/>\nThey need help with better ways. They need to see lots and lots of  <br/>\nbetter ways before they can actually do those better ways themselves.  <br/>\nBecause the better ways are complex! (Many adults haven&#39;t figured out  <br/>\nhow to negotiate with someone else.) They will intellectually  <br/>\nunderstand better ways long before they can figure out how to put them  <br/>\ninto practice in the heat of the moment, in<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The younger ones are starting to copy this behavior (name calling<br/>\n&gt; and disrespect) and I really don&#39;t want that to happen.<br/>\n<br/>\n </span></blockquote>See behavior as communication. Why do they need to call each other  <br/>\nnames? Why do they need to be disrespectful? What *need* are they  <br/>\ntrying to meet in these anti-social ways?<br/>\n<br/>\nIf people have all their needs met, they don&#39;t need to fight. We don&#39;t  <br/>\nhave control over all of kids&#39; needs. But we can make them more  <br/>\ncomfortable while they work through something. We can control the  <br/>\nenvironment. *Be* the peaceful insert into the environment. You can&#39;t  <br/>\nmake them feel peace. But you can be peaceful.<br/>\n<br/>\nHopefully people will be along with practical applications of that!  <br/>\nBut that&#39;s the mindset you want to be working towards.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237699340,"authorName":"Kristie","from":"Kristie &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"new to the group and a ?","postDate":"1316091975","msgId":47272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTYwOTE5NzUuNTEyMzIuWWFob29NYWlsUkNAd2ViODExMDMubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":47273,"prevInTime":47271,"nextInTime":47273,"topicId":47272,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, I am new to unschooling - today is day 4.  :)  Literally.  But I am absolutely loving it!!!  A couple years ago, we tried unschooling, but I","messageBody":"<div id=\"ygrps-yiv-1924216478\">Hello everyone,<br/>\n<br/>\nI am new to unschooling - today is day 4.  :)  Literally.  But I am absolutely <br/>\nloving it!!!  A couple years ago, we &#39;tried&#39; unschooling, but I did not have the <br/>\ninformation and support I needed to continue and eventually caved to the &quot;my <br/>\nkids need to be doing something&quot; mentality, plus all my irrational fears of them <br/>\ngrowing up to be undisciplined and uneducated (don&#39;t laugh).  Now, after a year <br/>\nand a half of torture, I feel like I&#39;ve been set free from prison!!!<br/>\n<br/>\nUnschooling is definitely my natural bend.  It has been truly painful trying to <br/>\nforce my kids into doing workbooks, reading what&#39;s &#39;good&#39; for them, and limiting <br/>\ntheir electronics.  Did I mention torture?<br/>\n<br/>\nSo, here I am...hoping to set myself, and my kids, up for success this time!  I <br/>\ndo have a question I wanted to ask:  My kids, particularly my older two (boys, <br/>\n13 and 10) can be quite rude to each other.  There seems to be a lot of <br/>\ncompetition between them and comparison.  How can I help them want to treat each <br/>\nother better?  The younger ones are starting to copy this behavior (name calling <br/>\nand disrespect) and I really don&#39;t want that to happen.<br/>\n<br/>\nThanks for being here!<br/>\nKristie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47241,"nextTopicId":47269}}