{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Rules vs Principles","postDate":"1209924052","msgId":32391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwNTA0MTEwMGo1NTk3OWU4Mmw5MDU0MTQ4ODVlM2FkZGJlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAwMGYwMWM4YWRmOCRhOTU4MjU0MCQwMzAxYThjMEBiaWdzdXJwcmlzZT4=","referencesHeader":"PDAwMGYwMWM4YWRmOCRhOTU4MjU0MCQwMzAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":32380,"nextInTopic":0,"prevInTime":32390,"nextInTime":32392,"topicId":32380,"numMessagesInTopic":0,"msgSnippet":"On Sun, May 4, 2008 at 10:08 AM, Deb Lewis  wrote: ","messageBody":"<div id=\"ygrps-yiv-1641566381\"><blockquote><span title=\"qreply\">On Sun, May 4, 2008 at 10:08 AM, Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n&lt;&lt;Recently a little girl I know thought she could cheer her mom with a<br/>\nsong at dinner but remembered the rule about *no singing at the table*<br/>\nand then, not knowing what to do, cried instead. &gt;&gt;<br/>\n<br/>\n<br/>\nThis is one of the SADDEST things I&#39;ve read in a long time.  That poor<br/>\nchild&#39;s soul.<br/>\n<br/>\nKaren </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Rules vs  Principles","postDate":"1209913688","msgId":32380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGYwMWM4YWRmOCRhOTU4MjU0MCQwMzAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":0,"nextInTopic":32391,"prevInTime":32379,"nextInTime":32381,"topicId":32380,"numMessagesInTopic":0,"msgSnippet":"***you made an incorrect assumption:*** The comment isn t about you, personally,  it s about the *idea* of asking a child for examples of what *** being safe","messageBody":"<div id=\"ygrps-yiv-1955983114\">***you made an<br/>\nincorrect assumption:***<br/>\n<br/>\nThe comment isn&#39;t about you, personally,  it&#39;s about the *idea* of asking a child for examples of what *** &quot;being<br/>\n safe when crossing the (relatively busy) street&quot; by our house looks<br/>\n like. ***<br/>\n<br/>\nI don&#39;t think any of us would do that to a respected adult.  Of adults we usually ask questions to get information we don&#39;t yet have.  Of children we very often know the answers we&#39;ll accept as right answers and we ask questions to find out if what the child knows is what we will accept as right.    If the child had given what seemed a wrong answer, would that idea have been incorporated into the rules you were making together or would you have rejected it, and if some of the child&#39;s answers were wrong or rejected how would that be a mutually agreed upon rule?  Ultimately the adult makes the rule and convinces the child it&#39;s worth agreeing with or, more often, insists the child adhere to it under penalty of punishment.<br/>\n<br/>\n***&quot;life is short&quot; <br/>\n&quot;rules are always bad&quot; <br/>\n&quot;making any behavior automatic is bad&quot;. ***<br/>\n<br/>\nPlease don&#39;t misquote.      I wrote &quot;Time&#39;s short.&quot; I said adherence to a rule &quot;can&quot; interfere with judgment and I said just because a thing becomes automatic doesn&#39;t necessarily make an automatic act good.   <br/>\n<br/>\nOur time with our children is short.  We should be thinking in every interaction with them for the good of our relationships with them and as a model of the benefits of being thoughtful. Of our children, a couple of thoughts:  I don&#39;t think it&#39;s our place to decide whether some actions should become automatic to another person.  We think doing a thing automatically might better insure the thing routinely done but it&#39;s not up to us which things our children consider important to do.  It seems to suppose our kids aren&#39;t capable of understanding the benefits of some things if we wish they&#39;d do them without thinking.  If we wish someone would just do things our way without thinking maybe we&#39;re not even sure it&#39;s beneficial.  Anything that&#39;s really beneficial will stand up to thought.  And still, the choice to do that thing or not is an individual choice.  Some people are quite deliberate.  My mother in law counts each brush stroke.  With all her own teeth at eighty two maybe paying close attention to her oral health has been beneficial.  We&#39;ll never know, of course, but if she&#39;d been another kind of person, a mind-wandering-while-she-brushed person, maybe somewhere she would have missed important health cues.  It&#39;s likely some things will become automatic to us, even if we&#39;re very thoughtful people, probably because we have busy lives and a lot to think about.  My feeling though is if we find ourselves very often not thinking about what we&#39;re doing it might be better to do something more interesting. <br/>\n<br/>\n ***...rather than make a blanket statement like<br/>\n&quot;rules are always bad&quot; or &quot;making any behavior automatic is bad&quot;.  In fact,<br/>\nit seems to me that such blanket statements and the kind of thinking they<br/>\nrepresent are actually a very good example of that &quot;adherence to strict<br/>\nrules&quot; which you say to be against. ***<br/>\n<br/>\nYou&#39;ve misquoted the post.     The statement I made was &quot;It&#39;s better to think and to use judgment,&quot;   Neither the statement or the thinking are examples of *adherence to strict rules.* (which is yet another misquote)   <br/>\n<br/>\nThere were some odd experiments called the Milgram Experiments which looked at obedience to authority.   Participants did things they believed were hurting another person but did them anyway because an authority figure told them to.   The soldiers charged in the abuse at Abu Ghraib prison claimed they were only following orders.  These are some very extreme examples of people who gave up their own judgment to follow authority.  In little ways it happens to children frequently, kids who want to stand up for a friend but don&#39;t because there&#39;s a rule about not fighting.  Kids who want to help someone else but don&#39;t because there&#39;s a rule that says *no cheating,*  kids who want to comfort a sick pet but can&#39;t because the rule is the dog stays outside at night.  There are more ways than I can count that the rules of adults interfere with the natural judgment of children.  Recently a little girl I know thought she could cheer her mom with a song at dinner but remembered the rule about *no singing at the table* and then, not knowing what to do, cried instead. <br/>\n<br/>\n*** I on the other hand,  by advocating<br/>\nflexible rules, believe I&#39;m closer to living the principles.***<br/>\n<br/>\nI&#39;m not sure what being closer to living the principles of safety would look like.  My own experience with my always unschooled sixteen year old is that we haven&#39;t had and haven&#39;t needed rules.         <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":31900,"nextTopicId":32272}}