{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: videos and ranking importance","postDate":"1103923827","msgId":4474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3NzA0NTY1LTU1RjMtMTFEOS05M0Y1LTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PEJERjE3NTI1LjJGNjQ2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PEJERjE3NTI1LjJGNjQ2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":4473,"nextInTopic":0,"prevInTime":4473,"nextInTime":4475,"topicId":4466,"numMessagesInTopic":0,"msgSnippet":"... Not letting him do something now because it would be on me but if he does it when he s older it is on him, is a nonproductive way of thinking about it","messageBody":"<div id=\"ygrps-yiv-288090559\"><blockquote><span title=\"ireply\">&gt;&gt; when he&#39;s old enough to<br/>\n&gt;&gt; understand then we will tell him what&#39;s up and if he feels he can<br/>\n&gt;&gt; handle the consequences, it&#39;s on him not me any longer.<br/>\n<br/>\n </span></blockquote>Not letting him do something now because it would be &quot;on me&quot; but if he <br/>\ndoes it when he&#39;s older it is &quot;on him,&quot; is a nonproductive way of <br/>\nthinking about it at all. Who cares who the blame falls on? WHY focus <br/>\non that? If he makes a mistake and there is a negative reaction you can <br/>\nsay, &quot;Your own choice - don&#39;t blame me?&quot; Wash your hands of it? That&#39;s <br/>\nthe feeling the above sentence gives. I&#39;ve heard this a million times - <br/>\nin a million different contexts. &quot;I am in charge NOW, while the child <br/>\nis young I will make decisions for him to protect him. I&#39;m responsible <br/>\nfor his well-being right now. But - when he&#39;s older then HE is in <br/>\ncharge and I&#39;m no longer responsible.&quot;<br/>\n<br/>\nIt doesn&#39;t have to be so cut-and-dried. It doesn&#39;t have to be <br/>\neither/or. And this kind of thinking is dangerous - much better to <br/>\nfocus on developing a solution-oriented relationship-based approach to <br/>\nlife. I say it is dangerous because it is this approach that leads to <br/>\ntwo things: (1) kids feeling restricted have the natural human urge to <br/>\npush back and sometimes to be sneaky about that and (2) when &quot;freed&quot; <br/>\nfrom the restrictions they often flounder and/or go too far in taking <br/>\nadvantage of their release.<br/>\n<br/>\nInstead of focusing on who is in control, better to focus on <br/>\nmaintaining solution-oriented and relationship-based attitudes - this <br/>\nis what will carry kids (and us) forward with the ability to deal with <br/>\nwhatever life tosses at us - to have a good life NOW and in the future.<br/>\n<br/>\nSolution-oriented means that you are constantly asking yourselves - <br/>\nwhat is the problem and how many solutions can we think of - which <br/>\nsolution do we want to try right now. This is a different attitude <br/>\nthan, &quot;The rule is you cannot have milk and I&#39;m in control of enforcing <br/>\nthat on you.&quot;<br/>\n<br/>\nRelationship-based means that, as you make decisions, you consciously <br/>\ntake into consideration the short and long-term impact on your <br/>\nrelationship that giving orders, imposing rules, taking control will <br/>\nhave - versus the effects that working together to come up with <br/>\nsolutions to very real problems would have, instead.<br/>\n<br/>\nI&#39;ve seen it - parents who see themselves as &quot;taking charge&quot; for the <br/>\nchild&#39;s own sake, when he is young, are the same parents who keep on <br/>\ntrying to control their older kids, as well. They don&#39;t change their <br/>\nway of relating to children - of seeing parent-child relationships as <br/>\none in charge versus the other. And that sets up parents and kids as <br/>\nadversaries and that is truly dangerous because teenagers who see <br/>\nparents as adversaries are far more at risk of engaging in all kinds of <br/>\nbehaviors with serious consequences.</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"videos and ranking importance","postDate":"1103921159","msgId":4473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNxaHY2Nys0YWRxQGVHcm91cHMuY29tPg=="},"prevInTopic":4471,"nextInTopic":4474,"prevInTime":4472,"nextInTime":4474,"topicId":4466,"numMessagesInTopic":0,"msgSnippet":" so i do commend you for being MINDFUL of your child and his ... This implies that the rest of us that aren t advocating arbitrary restrictions, are NOT","messageBody":"<div id=\"ygrps-yiv-2059651043\">&quot;&gt; so i do commend you for being MINDFUL of your child and his<br/>\n<blockquote><span title=\"ireply\"> &gt; health and setting up reasonable limitations until he is able to<br/>\n&gt; fully comprehend the repercussions involved.&quot;<br/>\n<br/>\n </span></blockquote>This implies that the rest of us that aren&#39;t advocating arbitrary <br/>\nrestrictions, are NOT mindful. Maybe you didn&#39;t mean to imply that, <br/>\nbut it sure comes through that way!<br/>\nI&#39;m a pretty MINDFUL parent. I am constantly examining how we do <br/>\nthings and how I react and trying to adjust my behavior to be more <br/>\naware and more mindful.<br/>\nI think putting arbitrary restrictions on a child, takes a lot less <br/>\ncreativity and mindfulness than sifting through many options and <br/>\ntrying to come up with a useful solution for all involved.<br/>\nI would say that this list attracts some of the most mindful parents <br/>\nout there. <br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: videos and ranking importance","postDate":"1103891190","msgId":4471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJERjE3NTI1LjJGNjQ2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDQxMjIzMTYxNDQzLjU5MTY3LnFtYWlsQHdlYjIwNzA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":4466,"nextInTopic":4473,"prevInTime":4470,"nextInTime":4472,"topicId":4466,"numMessagesInTopic":0,"msgSnippet":"... I think it s helpful to see the advice given on unschooling lists as *alternatives* to control for those parents who want to figure out how to trust and","messageBody":"<div id=\"ygrps-yiv-1787565056\">on 12/23/04 11:14 AM, Sunita T. at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kingzjewel@...\">kingzjewel@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i guess this goes to the second poster who was implementing certain<br/>\n&gt; limitations for her son:i think that i would probably do<br/>\n&gt; the same thing in your situation.<br/>\n<br/>\n </span></blockquote>I think it&#39;s helpful to see the advice given on unschooling lists as<br/>\n*alternatives* to control for those parents who want to figure out how to<br/>\ntrust and respect their kids *and* help their kids with their problems.<br/>\n<br/>\nI think everyone can figure out how to take over control from a child! And<br/>\nthere are lots of lists where parents will share their methods of control.<br/>\n<br/>\nBut if parents don&#39;t want to use control, they often don&#39;t know what else<br/>\nthey can do. There&#39;s a vast range of choices between controlling kids and<br/>\nignoring kids but there aren&#39;t many places those choices get discussed. (But<br/>\n1000&#39;s of places where control of children gets discussed.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; there are certain things im going to do<br/>\n&gt; differently b/c im doing christian unschooling and have other<br/>\n&gt; factors to contend with as well.<br/>\n<br/>\n </span></blockquote>And there are certain things that someone who &quot;unschools except for math&quot;<br/>\nwill do differently than someone who &quot;unschools everything&quot;. But that won&#39;t<br/>\nmake their advice about math unschooling.<br/>\n<br/>\nPam Sorooshian said years ago that her kids had to go to religious services.<br/>\nBut she&#39;s never suggested that making kids go to services was unschooling<br/>\nadvice. And she&#39;s never suggested that, because of her religous beliefs,<br/>\nadvice that&#39;s not based on the unschooling philosophy was unschooling.<br/>\n<br/>\nIt&#39;s okay to pick and choose. It&#39;s okay to adapt. It&#39;s okay to not extend<br/>\nthe unschooling philosophy into every aspect of your lives. But just because<br/>\nan unschooler does something that doesn&#39;t automatically mean the action is<br/>\nbased on the unschooling philosophy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my son is allergic to milk, not<br/>\n&gt; lactose, just milk in general when in liquid uncooked form. i have<br/>\n&gt; to put restrictions on him because of his medical condition. he is<br/>\n&gt; not even 2 yet and doesnt know about what im doing anyway.<br/>\n<br/>\n </span></blockquote>I could call not letting my daughter play on the highway at 2 restricting<br/>\nher. And I could call not letting her watch more than 1 hour of TV<br/>\nrestricting her.<br/>\n<br/>\nBut the importance lies in their differences rather than their similarities.<br/>\n<br/>\nGetting run over by a car is a real danger with known unpleasant<br/>\nconsequences. Drinking milk for your son has known unpleasant consequences.<br/>\n<br/>\nWe know our kids don&#39;t want those consequences -- I&#39;m sure your son wants<br/>\ndiarrhea less than you do! -- so we help them avoid the causes while they&#39;re<br/>\nstill too young to understand the connections between the cause and the<br/>\neffect and too young to avoid the causes. So I wouldn&#39;t call not giving milk<br/>\nto your son a restriction. I would call it helping him get what he wants:<br/>\nbeing healthy and safe.<br/>\n<br/>\nBut once he gets old enough to want the ice cream his cousin has, there are<br/>\nmore options than &quot;No,&quot; and &quot;Do whatever you want to because you know the<br/>\nconsequences.&quot; The area between the two that encompasses respect and trust<br/>\nis where people on this list can help with ideas.<br/>\n<br/>\n*If* our goal is to trust and respect our kids -- which is the type of<br/>\nadvice offered on this list -- then helping kids get what they want is a<br/>\nbetter path to that goal than restricting them from what we fear. All kids<br/>\nwant to be safe and healthy! But they want other things too. Our job is to<br/>\nhelp them explore their options. Sometimes they&#39;ll have to set a goal at a<br/>\nlower prioirty to get something else. (Like setting aside sleep needs in<br/>\norder to experience staying up all night.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; when he&#39;s old enough to<br/>\n&gt; understand then we will tell him what&#39;s up and if he feels he can<br/>\n&gt; handle the consequences, it&#39;s on him not me any longer.<br/>\n<br/>\n </span></blockquote>I think rather than letting go, a better option is always being there to<br/>\nhelp and support them in what they&#39;re trying to achieve. There may be more<br/>\noptions he could explore than no milk for the rest of his life. If I were in<br/>\nthat position, I&#39;d love to have my mom there to help me explore my<br/>\nalternatives.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; just like <br/>\n&gt; with your son and his food intake and now onto his eyes. we are<br/>\n&gt; watching my son for eye problems b/c it does run in both our<br/>\n&gt; families and we both have had our own eye problems *mine were when i<br/>\n&gt; was younger*.<br/>\n<br/>\n </span></blockquote>Bad eyes from too much screen time is not on the order of the certain danger<br/>\nof getting hit by a Mack truck. And how to restrict kids in order to protect<br/>\nthem from feared danger is not the best topic of discussion on an<br/>\nunschooling list.<br/>\n<br/>\nDiscussing how to pass on information we strongly believe in -- and help<br/>\nkids analyze information critically! -- while helping our kids get what they<br/>\nwant *is* a helpful topic for an unschooling list.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; so i do commend you for being MINDFUL of your child and his<br/>\n&gt; health and setting up reasonable limitations until he is able to<br/>\n&gt; fully comprehend the repercussions involved.<br/>\n<br/>\n </span></blockquote>While the rest of us are UNMINDFUL and let kids do whatever they want<br/>\nwithout regard to whether they understand what will happen or not.<br/>\n<br/>\nNo. There are more options than imposing limitations to protect them and<br/>\nignoring their problems. And those options get discussed here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my whole thing is that if everyone was intent on their<br/>\n&gt; own stuff more and just tolerated that people have different views<br/>\n&gt; on unschool, parenting, and life in general maybe debates like<br/>\n&gt; these could be avoided on and off the computer.<br/>\n<br/>\n </span></blockquote>This list was created because there were unschooling beginners who *wanted*<br/>\ndebates and discussion. The Unschooling-101 list blew up because there were<br/>\npeople who wanted to debate and people who wanted to just share what they<br/>\ndid.<br/>\n<br/>\nSo it wouldn&#39;t be very helpful to figure out ways to avoid what people<br/>\ncreated and joined the list in order to have! ;-)<br/>\n<br/>\nI think the Unschooling-101 list has been renamed as HEM-NewHomeschoolers.<br/>\n(Where the word homeschooling is being used synonymous with unschooling,<br/>\nthough the word unschooling isn&#39;t necessarily how it gets defined here. But<br/>\nit might be closer to what you&#39;re looking for.)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/HEM-NewHomeschoolers/\">http://groups.yahoo.com/group/HEM-NewHomeschoolers/</a><br/>\n<br/>\n(I think I&#39;m wrong. Unschooling-101 may have been absorbed into the already<br/>\nexisting HEM-NewHomeschoolers. It had a big peak of posts at the same time<br/>\nthis list was created.)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":103263481,"authorName":"Sunita T.","from":"&quot;Sunita T.&quot; &lt;kingzjewel@...&gt;","profile":"kingzjewel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: videos and ranking importance","postDate":"1103818483","msgId":4466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMjIzMTYxNDQzLjU5MTY3LnFtYWlsQHdlYjIwNzA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExMDM4MTAwODEuMTM2NS41Njg1NC5tMTJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":4471,"prevInTime":4465,"nextInTime":4467,"topicId":4466,"numMessagesInTopic":0,"msgSnippet":"... you gals at each others collective throats? ... the same thing in your situation. i probably dont fit the entire mold of unschooling anyway. there are","messageBody":"<div id=\"ygrps-yiv-1430419180\"><blockquote><span title=\"ireply\">&gt; geez! im gone for 5 days and a riot breaks out! what&#39;s up with all <br/>\n </span></blockquote>you gals at each others collective throats?<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; i guess this goes to the second poster who was implementing certain limitations for her son:i think that i would probably do <br/>\n </span></blockquote>the same thing in your situation. i probably dont fit the entire <br/>\nmold of unschooling anyway. there are certain things im going to do <br/>\ndifferently b/c im doing christian unschooling and have other <br/>\nfactors to contend with as well. my son is allergic to milk, not <br/>\nlactose, just milk in general when in liquid uncooked form. i have <br/>\nto put restrictions on him because of his medical condition. he is <br/>\nnot even 2 yet and doesnt know about what im doing anyway. he wont <br/>\nremember the bleeding diaper rashes and days of uncontrollable <br/>\ndiarrhea, but i will and so will his father. when he&#39;s old enough to <br/>\nunderstand then we will tell him what&#39;s up and if he feels he can <br/>\nhandle the consequences, it&#39;s on him not me any longer. just like <br/>\nwith your son and his food intake and now onto his eyes. we are <br/>\nwatching my son for eye problems b/c it does run in both our <br/>\nfamilies and we both have had our own eye problems *mine were when i <br/>\nwas younger*.<br/>\n<blockquote><span title=\"ireply\"> &gt;  so i do commend you for being MINDFUL of your child and his <br/>\n </span></blockquote>health and setting up reasonable limitations until he is able to <br/>\nfully comprehend the repercussions involved.  ***THE END***<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt; ::::now, speaking just for myself here, i know that my <br/>\n </span></blockquote>parenting style being &quot;different&quot; as it has been called and every <br/>\nmove i make has been analyzed by family members at every turn of my <br/>\nson&#39;s life. my whole thing is that if everyone was intent on their <br/>\nown stuff more and just tolerated that people have different views <br/>\non unschool, parenting, and life in general maybe debates like <br/>\nthese could be avoided on and off the computer.<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; just my 2 cents...dont go &quot;throwing them at my head&quot; LOL <br/>\n&gt;  <br/>\n&gt; Suni<br/>\n <br/>\n\t\t<br/>\n </span></blockquote>---------------------------------<br/>\nDo you Yahoo!?<br/>\n Yahoo! Mail - Helps protect you from nasty viruses.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":4460,"nextTopicId":4467}}