{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling dogs","postDate":"1171066898","msgId":21341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2ODkyMi43MzI3Mi5xbUB3ZWI2MDMxNC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":21328,"nextInTopic":0,"prevInTime":21340,"nextInTime":21342,"topicId":21321,"numMessagesInTopic":0,"msgSnippet":"Have you read Elizabeth Marshall Thomas The Hidden Life of Dogs?  (I don t see how you could have been into dogs for that long without having having read it,","messageBody":"<div id=\"ygrps-yiv-1624265518\">Have you read Elizabeth Marshall Thomas&#39; The Hidden Life of Dogs?  (I don&#39;t see how you could have been into dogs for that long without having having read it, but thought I&#39;d ask.)  The theme of her book is this question of what makes a fulfilled dog -- left to their own devices, what would dogs choose to do:-)  It&#39;s a great book for any dog-lovers out there.<br/>\n<br/>\nKatharine<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: JULIE WOOD-HOLMLUND &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:woodswords@...\">woodswords@...</a>&gt;<br/>\nT<br/>\n<br/>\n  And now I&#39;m left wondering if it really works that well for my dogs.  Sure, they&#39;re well trained.  They know 70+ behaivors on command and can work in crazy environments.  And they&#39;ve always seemed to genuinely enjoy the training and the work.  But are they happy?  Fulfilled?  Who would THEY liked to have been?  (Of course I&#39;ll never know those answers &#39;cause I can&#39;t discuss it with them.  But I now wonder... :)<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nDon&#39;t get soaked.  Take a quick peak at the forecast<br/>\nwith the Yahoo! Search weather shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#loc_weather\">http://tools.search.yahoo.com/shortcuts/#loc_weather</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling dogs","postDate":"1171040960","msgId":21328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTFBODQyQzdGQzhBRC03RjgtMTNEN0BXRUJNQUlMLVJBMTMuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDIwMDcwMjA5MTU0MjM1Ljk3MzQ2LnFtYWlsQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDcwMjA5MTU0MjM1Ljk3MzQ2LnFtYWlsQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":21321,"nextInTopic":21341,"prevInTime":21327,"nextInTime":21329,"topicId":21321,"numMessagesInTopic":0,"msgSnippet":"... From: woodswords@btinternet.com So, are there any recovering behaviorists out there who have thought these issues through and can provide some insight? ","messageBody":"<div id=\"ygrps-yiv-294346762\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:woodswords@...\">woodswords@...</a><br/>\n<br/>\n<br/>\n   So, are there any recovering behaviorists out there who have thought <br/>\nthese<br/>\nissues through and can provide some insight?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nRecovering behaviorist. &lt;bwg&gt; I&#39;ll have to remember to use that <br/>\nsometime. &lt;bwg&gt;<br/>\n<br/>\nMost of my life, too, as been spent in the serious company of dogs. I <br/>\nstarted training (Koehler & Strickland---jerk-praise---methods) in 1970 <br/>\nwhen I was ten. I trained my mutt to UDTX level by 1973, but she could <br/>\nnever complete in trials back then, so she was untitled. Things have <br/>\nchanged so much. It&#39;s so nice to see folks making an effort to see <br/>\nbeyond that. It&#39;s nice to see dogs who are *eager* to work compared to <br/>\nthe dogs in competition in the 70s. I tend to take long breaks from <br/>\ndogs and then come back to be amazed at the progress made in training <br/>\nover time.<br/>\n<br/>\nThere were the food incentives popular in the 80s. And whatever (balls <br/>\n, toys, playtime) incentives of the 90s. Now, from what i&#39;ve observed, <br/>\nit&#39;s more about seeing things from the dog&#39;s PoV and working from where <br/>\nthe dog is---learning his language---instead of teaching him ours.<br/>\n<br/>\nI&#39;ve been &quot;in&quot; dogs, off & on for over 35 years. Breeding, showing, <br/>\nobedience, agility, pointer field trials, tracking, handling, judging, <br/>\nwriting, and now mostly just grooming (specializing in handstripping <br/>\nterriers).<br/>\n<br/>\nI&#39;m raising my second guide dog pup. That&#39;s an amazing bit of training. <br/>\nThe DOG&#39;s in charge! &lt;bwg&gt; Not in my house, of course. &lt;g&gt; But that&#39;s <br/>\nthe goal---ain&#39;t *that* some shit! *Trusting* and *respecting* that dog <br/>\nand his decisions more than your own self?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n   How do you dedicated unschoolers live with your dogs?  Have you found <br/>\na way to<br/>\nlive an unschooly life with your dogs?  Or do you use &quot;traditional <br/>\ndiscipline&quot;<br/>\nwith them?  If so, how do you justify -- to yourself and your children <br/>\n-- the<br/>\ndifference between how you treat humans vs. nonhumans?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nIt&#39;s not either - or. It&#39;s living together and takes both and neither <br/>\nand all.<br/>\n<br/>\nI treat the dogs as dogs. They are NOT my children. They DO understand <br/>\npack order and dominance---very, very clearly. ANd if it&#39;s not clear, <br/>\nthey&#39;re happy to clarify *for* you! &lt;G&gt; (Why so many dogs end up in <br/>\nrescue. *They&#39;ve* had to determine pack order.)<br/>\n<br/>\nI think after the pack order is established, everything else falls into <br/>\nplace here. I *do* use behavior modification. It works. BUT I also try <br/>\nto work *with* the dog, rather than against him. I try to figure out <br/>\nwhy he thinks the way he does and come at things from his PoV. It&#39;s <br/>\nharder at first, but the pay-offs (like unschooling) are bigger and <br/>\nbetter. Plus, it gets easier in the long run.<br/>\n<br/>\nI&#39;m working with a friend who gived classes here in town, We&#39;ve known <br/>\neach other since we were kids and training. She&#39;s very into <br/>\nnon-punitive training (for the most part). Mostly she&#39;s showing folks <br/>\nhow to &quot;understand&quot; &quot;dog-speak&quot;---it&#39;s wierd. Hard to go into in one <br/>\npost. &lt;g&gt; But we work with the *dog&#39;s* language and his physiology to <br/>\ncommunicate. We make sure he---and WE  *understand*--a lot different <br/>\nfrom strict obedience!<br/>\n<br/>\nWorking with guide dogs, I&#39;ve learned a lot about &quot;reasoning&quot;---and I <br/>\nthink many dogs do it really, really well. Especially of they are <br/>\nexposed to many different situations. Back yard/couch potato dogs have <br/>\nno reason to reason. &lt;g&gt; But working dogs are processing things every <br/>\nminute. They&#39;re different. Not necessarily in ability---just in <br/>\nexposure and out of necessity.<br/>\n<br/>\nAs for my pets: the goal is harmony. And I think most of that is <br/>\naccomplished with pack order first, then working *together*. I could <br/>\n*force* correct heel position; but when a dog is attached for hours on <br/>\nend, it&#39;s more of a *dance* than control or obedience: we work <br/>\ntogether.<br/>\n<br/>\nI&#39;m having issues right now with the smooth collie we&#39;ve taken over <br/>\nraising as a guide dog (14 months old and with another family before <br/>\nus). She doesn&#39;t come when called. She gets a cookie EVERY time she <br/>\ncomes inside. Why? Because it works AND because she needs to understand <br/>\nthat *I* am not the bad guy. As soon as she trusts me, we can wean <br/>\naway. But right now, we need the reward. AFter she trusts me, I&#39;ll <br/>\nstart trying to use &quot;come&quot; again.<br/>\n<br/>\nAt the same time, I&#39;m known for saying, &quot;You&#39;re a DAWG&quot; which is <br/>\nshorthand for:  &quot;stop whatever you&#39;re doing---it&#39;s not proper behavior <br/>\nfor a dog. People come first.&quot; &lt;G&gt; That&#39;ll get the dog off the <br/>\nfurniture or out of the front seat or whatever quickly because he <br/>\nreally doesn&#39;t have the same rights. &lt;G&gt;  Overall though, our life with <br/>\ndogs is fairly unschooly---well, I&#39;d rather use &quot;harmonious.&quot; It&#39;s not <br/>\nreally unschooly, but it&#39;s listening to the dog and trying to <br/>\nunderstand where&#39;s he is at the minute. It&#39;s using his language and his <br/>\nabilities to communicate---so in that it&#39;s unschooly.&lt;g&gt; I&#39;m making no <br/>\nsense. &lt;bwg&gt;<br/>\n<br/>\nAs for my boys: they know who&#39;s human and who&#39;s not. &lt;bwg&gt; It&#39;s not a <br/>\nstretch! &lt;G&gt; We communicate differently. We&#39;re different species. But <br/>\nworking WITH the dog certainly makes things easier all the way around.<br/>\n<br/>\nOh--and we&#39;re tihnking about Search and Rescue later when the boys are <br/>\ngone. I LOVE working dogs!<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n    The current dog thread has motivated me to post about my recent <br/>\ndog-related<br/>\nthoughts.<br/>\n<br/>\n   Before my DS was born in &#39;06, my life had been ALL dogs ALL the time <br/>\nfor about<br/>\n10 years.  Search and rescue, agility, film work -- behavior <br/>\nmodification,<br/>\nclicker training, positive reinforcement -- pack theory, dominance <br/>\nissues --<br/>\nthese were the primary focus of my thoughts, reading, training, etc. <br/>\nfor years.<br/>\n<br/>\n   Then along came Jake and I started questioning behaviorism. <br/>\nCry-it-out is<br/>\nsimply extinguishing an &quot;unwanted behavior&quot; right?  WRONG!!!  By the <br/>\ntime he was<br/>\njust six months old I realized how my dog training experience had <br/>\nactually<br/>\npolluted my ability to parent in an unconditional way.  Thankfully I <br/>\nran into<br/>\nAlfie Kohn&#39;s work last summer and I FINALLY found the answers regarding <br/>\nwhy<br/>\nbehaviorism -- punishment or rewards -- doesn&#39;t work well for humans.<br/>\n<br/>\n   And now I&#39;m left wondering if it really works that well for my dogs.  <br/>\nSure,<br/>\nthey&#39;re well trained.  They know 70+ behaivors on command and can work <br/>\nin crazy<br/>\nenvironments.  And they&#39;ve always seemed to genuinely enjoy the <br/>\ntraining and the<br/>\nwork.  But are they happy?  Fulfilled?  Who would THEY liked to have <br/>\nbeen?  (Of<br/>\ncourse I&#39;ll never know those answers &#39;cause I can&#39;t discuss it with <br/>\nthem.  But I<br/>\nnow wonder... :)<br/>\n<br/>\n   Back to parenting though...  The most pressing question on my mind at <br/>\nthe<br/>\nmoment is: how do my behavior-modification-based interactions with my <br/>\ndogs<br/>\ninfluence Jake about how to interact with other living creatures?<br/>\n<br/>\n  In other words... what kind of example am I setting!?!?<br/>\n<br/>\n   If I want to model an unschooling, empathic style of living, I <br/>\nbelieve that<br/>\nneeds to include how I live and interact with our dogs.  If I coerce my <br/>\ndogs to<br/>\nbe &quot;obedient&quot; through reward and/or punishment, how will Jake know that <br/>\nsuch<br/>\ncoercion is only reserved for non-humans.  And now I&#39;m questioning if <br/>\nit should<br/>\neven be used on them.<br/>\n<br/>\n   I understand that when raising a canine in a human environment, <br/>\n&quot;guidance&quot; is<br/>\nessential to help them live in harmony with us.  Their natural <br/>\ninstincts to<br/>\nchew, dig, kill, etc., don&#39;t mesh well with modern human lives.  I&#39;ve <br/>\ncome a<br/>\nLONG way from my early years of mostly using punishment, or threat of<br/>\npunishment, physical dominance and bullying (aka &quot;The Dog Whisperer&quot; -- <br/>\nYUCK!!!)<br/>\nand for years now have almost exclusively used positive reinforcement <br/>\nand<br/>\nreward-based methods.  But now I recognize that even these gentler <br/>\nmethods are<br/>\nstill just external control mechanisms.<br/>\n<br/>\n   Now that I see how wonderful empathic parenting is in my life with <br/>\nJake, and<br/>\nwith my DH, I&#39;m aching to find a more empathic and organic way to live <br/>\nwith my<br/>\ndogs.  But I&#39;m truly not sure how to do that, and have dogs that are <br/>\nenjoyable<br/>\nto live with.<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]},{"userId":183028146,"authorName":"JULIE WOOD-HOLMLUND","from":"JULIE WOOD-HOLMLUND &lt;woodswords@...&gt;","profile":"julie24272","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling dogs","postDate":"1171035755","msgId":21321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwMjA5MTU0MjM1Ljk3MzQ2LnFtYWlsQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":21328,"prevInTime":21320,"nextInTime":21322,"topicId":21321,"numMessagesInTopic":0,"msgSnippet":"The current dog thread has motivated me to post about my recent dog-related thoughts. Before my DS was born in 06, my life had been ALL dogs ALL the time for","messageBody":"<div id=\"ygrps-yiv-45642544\">The current dog thread has motivated me to post about my recent dog-related thoughts.<br/>\n   <br/>\n  Before my DS was born in &#39;06, my life had been ALL dogs ALL the time for about 10 years.  Search and rescue, agility, film work -- behavior modification, clicker training, positive reinforcement -- pack theory, dominance issues -- these were the primary focus of my thoughts, reading, training, etc. for years.<br/>\n   <br/>\n  Then along came Jake and I started questioning behaviorism. Cry-it-out is simply extinguishing an &quot;unwanted behavior&quot; right?  WRONG!!!  By the time he was just six months old I realized how my dog training experience had actually polluted my ability to parent in an unconditional way.  Thankfully I ran into Alfie Kohn&#39;s work last summer and I FINALLY found the answers regarding why behaviorism -- punishment or rewards -- doesn&#39;t work well for humans.  <br/>\n   <br/>\n  And now I&#39;m left wondering if it really works that well for my dogs.  Sure, they&#39;re well trained.  They know 70+ behaivors on command and can work in crazy environments.  And they&#39;ve always seemed to genuinely enjoy the training and the work.  But are they happy?  Fulfilled?  Who would THEY liked to have been?  (Of course I&#39;ll never know those answers &#39;cause I can&#39;t discuss it with them.  But I now wonder... :)<br/>\n   <br/>\n  Back to parenting though...  The most pressing question on my mind at the moment is: how do my behavior-modification-based interactions with my dogs influence Jake about how to interact with other living creatures?<br/>\n   <br/>\n  In other words... what kind of example am I setting!?!?  <br/>\n   <br/>\n  If I want to model an unschooling, empathic style of living, I believe that needs to include how I live and interact with our dogs.  If I coerce my dogs to be &quot;obedient&quot; through reward and/or punishment, how will Jake know that such coercion is only reserved for non-humans.  And now I&#39;m questioning if it should even be used on them.  <br/>\n   <br/>\n  I understand that when raising a canine in a human environment, &quot;guidance&quot; is essential to help them live in harmony with us.  Their natural instincts to chew, dig, kill, etc., don&#39;t mesh well with modern human lives.  I&#39;ve come a LONG way from my early years of mostly using punishment, or threat of punishment, physical dominance and bullying (aka &quot;The Dog Whisperer&quot; -- YUCK!!!) and for years now have almost exclusively used positive reinforcement and reward-based methods.  But now I recognize that even these gentler methods are still just external control mechanisms.  <br/>\n   <br/>\n  Now that I see how wonderful empathic parenting is in my life with Jake, and with my DH, I&#39;m aching to find a more empathic and organic way to live with my dogs.  But I&#39;m truly not sure how to do that, and have dogs that are enjoyable to live with.<br/>\n   <br/>\n  So, are there any recovering behaviorists out there who have thought these issues through and can provide some insight?<br/>\n   <br/>\n  How do you dedicated unschoolers live with your dogs?  Have you found a way to live an unschooly life with your dogs?  Or do you use &quot;traditional discipline&quot; with them?  If so, how do you justify -- to yourself and your children -- the difference between how you treat humans vs. nonhumans?  <br/>\n   <br/>\n  Thanks for any thoughts you all can share.<br/>\n   <br/>\n  Sincerely,<br/>\n   <br/>\n  Julie H.<br/>\n   <br/>\n  Mom to Jake, 18 months<br/>\n  and furkids Hawk & Bearette<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21194,"nextTopicId":21345}}