{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Chores, Messes and Madness","postDate":"1139964571","msgId":9995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzNUFBNzQwLTU0MkQtNEI0QS1CRDYyLTZFMjI3Q0ZBMjU5NEBkaWVyYXVlci5uZXQ+","inReplyToHeader":"PDFhOC40ODRlNzY2Ni4zMTIzM2EzYUBhb2wuY29tPg==","referencesHeader":"PDFhOC40ODRlNzY2Ni4zMTIzM2EzYUBhb2wuY29tPg=="},"prevInTopic":9985,"nextInTopic":0,"prevInTime":9994,"nextInTime":9996,"topicId":9985,"numMessagesInTopic":0,"msgSnippet":"... It was a big breakthrough in my relationship with my partner David when he said to me one day...after we d been together, what, 10 years or something and","messageBody":"<div id=\"ygrps-yiv-1662873944\">On Feb 14, 2006, at 8:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ohpurple1@...\">ohpurple1@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; rom their side<br/>\n&gt; but until now have not really understood that it was my issue.  I just<br/>\n&gt; couldn&#39;t understand how they &quot;couldn&#39;t see&quot; the same crap I was  <br/>\n&gt; stepping over, etc.<br/>\n<br/>\n </span></blockquote>It was a big breakthrough in my relationship with my partner David  <br/>\nwhen he said to me one day...after we&#39;d been together, what, 10 years  <br/>\nor something and still wrangling about house stuff...&quot;Where is the  <br/>\nclutter you are always talking about? You&#39;re always saying that this  <br/>\nhouse is cluttered and I don&#39;t see any clutter, so can you just point  <br/>\nsome things out?&quot; What an eye-opener! He did not experience things as  <br/>\nclutter that I thought were obvious.<br/>\n<br/>\nYou said something later in your post about having a happier,  <br/>\nmessier, house. You may end up with a happier CLEANER house. I have.  <br/>\nThe more I relax about the housework, the more able I am to jump in  <br/>\nand do it, because it&#39;s not like a heavy burden I have to drag myself  <br/>\nto. So I find I am ending up with what I thought I wanted--the  <br/>\ncleaner, tidier house--with the added bonus of feeling more relaxed  <br/>\nmyself and enjoying my family more. Wow.<br/>\n<br/>\nSu</div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Chores, Messes and Madness","postDate":"1139925050","msgId":9985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOC40ODRlNzY2Ni4zMTIzM2EzYUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":9995,"prevInTime":9984,"nextInTime":9986,"topicId":9985,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/13/2006 4:18:35 PM Eastern Standard Time, lesajm@hotmail.com writes: But i am currently in a state of mind where i want my house in order","messageBody":"<div id=\"ygrps-yiv-525154837\">In a message dated 2/13/2006 4:18:35 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lesajm@...\">lesajm@...</a> writes:<br/>\nBut i am currently in a state of mind where i want my house in order and<br/>\nresent the hell out of feeling like the maid and cook for everyone else. <br/>\nNeedless to say i am not liking myself much these days because i am<br/>\nexhibiting such anger. I am feeling this overwhelming need for order in my<br/>\nenvironment. And thus this is taking precedence over doing other things with<br/>\nmy kids.  Along with the feeling that whatever i am doing it just doesn&#39;t<br/>\nseem like enough.  Something is very off kilter here...wonder if it&#39;s<br/>\nhormonal.<br/>\nCould be hormonal.  I have sought help for this &quot;clean house, kids are <br/>\nresponsible&quot; obsession from my midwife.  She said it may get better with time <br/>\n(hormonal changes) and suggested I lower my expectations which I have not been <br/>\nsuccessful at doing.  I have been in the same place (feeling off kilter) and have <br/>\nbeen since I had my second child. He is 6.5 so its been quite awhile. I am <br/>\nconsumed with having an immaculate house and I yell at my kids and freak out at <br/>\nleast weekly about their messes.  Sometimes more often.  I have cried about my <br/>\noutbursts, apologized incessantly and have tried to look at it from their side <br/>\nbut until now have not really understood that it was my issue.  I just <br/>\ncouldn&#39;t understand how they &quot;couldn&#39;t see&quot; the same crap I was stepping over, etc.  <br/>\nI have accused them of not caring about my feelings and other such insanity <br/>\nwhen in actuality they are just busy, creative, carefree kids who just want to <br/>\nhave fun and live in a happy world.  People who know us are completely unaware <br/>\nof this ugly side of our lives (thankfully) but the water delivery man caught <br/>\nme in action a few months ago.  I was sure the protective service people would <br/>\nbe at my door after he heard me screaming for my kids to pick up their crap.  <br/>\nI was a raving lunatic over an emptied bin of Fashion Polly toys.  Yikes.  I <br/>\nam admitting this to complete strangers in the hope that it may help me stay <br/>\non this newfound path. <br/>\n<br/>\nYesterday was my first day of not asking them to clean up anything and just <br/>\nsimply putting away stuff I wanted put away.  Reading the wise words of those <br/>\non this loop has helped me see things in a new light.  Basically, this really <br/>\nis my issue and I am going to continue to try very hard to stay on this new <br/>\npath and try to enjoy my family and their messes more.  We officially have a <br/>\nnon-yelling household as I grew up with a loud Italian yelling mother and I do not <br/>\nwant to pass on this legacy.  I am the only one who breaks the no yelling <br/>\nrule with my ranting about house cleaning.  No more.  Here&#39;s to another day of <br/>\nfinding joy in housework.  This is corny but I was folding laundry yesterday and <br/>\nlooking at all of my two year old&#39;s tiny little dresses and sweet clothes I <br/>\nwas able to actually enjoy folding them and realize how short a time they are <br/>\ngoing to be this small. I found myself thinking grateful thoughts like how <br/>\nwonderful it is that she is able to feed herself and smear yogurt around the <br/>\nhouse. Instead of getting upset with my 8 year old who changes her clothes several <br/>\ntimes a day and who produces the majority of laundry in our home I praised her <br/>\nfor always looking so beautiful and neat and for caring about herself. As I <br/>\nwas saying the words to her I realized that the words represented my true <br/>\nfeelings and that I really do love all these qualities about her. This awakening is <br/>\na result of reading these posts you have shared.  For the first time ever I <br/>\nhave hope that I can be a better mother and am committed to having a happier <br/>\nworld for my sweet children.  I have shifted my thinking and so far it feels <br/>\ngood and I feel like it is going to work for us.<br/>\n<br/>\nThis has been a source of guilt and shame for me for years and I have looked <br/>\ninto all sorts of solutions but changing myself was never proposed.  Except <br/>\nwhen I&#39;ve been told to learn to live with the mess which definitely makes me <br/>\ncrazy and has never worked.  As reported in one post, my husband is also a source <br/>\nof aggravation when he comes home and asks me why the house is such a mess <br/>\neven after I&#39;ve ranted and yelled all day at my kids to keep it clean.  We&#39;ll <br/>\nsee if he notices any changes in the condition of the house or in our new found <br/>\njoy. As someone else posted, I don&#39;t want my children to remember me a a <br/>\nneurotic screaming lunatic.  I hope this new joy continues as I do not miss my old <br/>\nways or the guilt and self loathing that went with it. <br/>\n<br/>\nThank you again ladies.  For sharing your insight.  You are helping to make <br/>\nour (I mean my family&#39;s) world a better place.  I am going to go play Herd Your <br/>\nHorses at 8:00 in the morning.  The dishes will wait.<br/>\n<br/>\nWarmly,<br/>\nRobin in MA, truly enjoying the morning with 8 year old Melissa, 6 year old <br/>\nSam and darling Madison who is 2.  I also have two messy foster sons ages 15 <br/>\nand 16 who I am appreciating more as well. They will learn housekeeping through <br/>\nosmosis.  Hopefully hubby won&#39;t freak out with his new happier, messier <br/>\nfamily.  Happy Valentine&#39;s Day!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9978,"nextTopicId":9993}}