{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"An unschooling success moment, schoolish though","postDate":"1139503360","msgId":9912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMDkyMDA2MTY0Mi45OTEzLjQzRUI3MTAwMDAwNEZCQjcwMDAwMjZCOTIyMDcwMjE2MzMwMjBFMDMwNTBDMDcwODAwMDNAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":9911,"nextInTime":9913,"topicId":9912,"numMessagesInTopic":0,"msgSnippet":"Hi, Not sure if this is totally unschooling related, but I just wanted to share with anyone who questions will this work, will they be able to do........ My","messageBody":"<div id=\"ygrps-yiv-1389336432\">Hi,<br/>\n<br/>\nNot sure if this is totally unschooling related, but I just wanted to share with anyone who questions will this work, will they be able to do........<br/>\n<br/>\nMy oldest was unschooled from birth, but at 10 wanted to try public school. She is still enrolled with the same teacher  now, it is her second year, she&#39;s in 6th grade. Her teacher pulled me aside yesterday, I was on campus because I noticed my dd&#39;s homework in the printer and brought it in, and asked if we , meaning Tim and I, work on math with her at home. Never really I told her, Ashley is completely independant with her work. Occasionally she will ask me  what does this mean, but we don&#39;t work with her at all. I don&#39;t even bug her about it&#39;s homework time, I do ask what she might have so we can plan the evening. Her teacher is completely amazed at how Ashley gets all the math she hands her, at a very deep level and I completely attribute this to Ashley&#39;s unschooling days, where life and learning flowed naturally. We played around with so many mathmatical concepts simply living, playing games, being together, that now at a more mature age, she is able to put those symbols to the knowledge she already has and go with it. The dots connect for her.<br/>\n<br/>\nThis same teacher is trying to figure out what is different about Ashley than the masses. She has a completely different work ethic and again I know it is because she is choosing to go to school and this is only her second year, not her 7th, like those who have been in since K. While being in school is not my ideal for my child, she still lives in a home where her younger siblings are unschooling, her home is a safe place  of freedom, connection and love. We do not stress over missed days or grades and she continually gets up everyday on time out the door and brings home top notch grades because it is important to her. <br/>\n<br/>\nShe did let me know she&#39;s not so sure about continuing public school, but for now it is what she chooses. I need to be very careful not to latch onto her being home again, but I am hopeful that she is getting what she wanted from going and it seems she is nearing her satisifaction and starting to make different plans for her future. I wish I had a cyrstal ball to peek into the future.<br/>\n<br/>\nMary</div>","specialLinks":[]}],"prevTopicId":9864,"nextTopicId":9914}}