{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"OT:  Lisa&#39;s Memorial Today...","postDate":"1204174529","msgId":30294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDgwMjI4MDQ1NS5tMVM0dGkzSzAyMjgzNUBvbXI4Lm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":30293,"nextInTime":30295,"topicId":30294,"numMessagesInTopic":0,"msgSnippet":"Hiya, Folks, Lisa was buried today very near her home in Lake Peekskill, New York.  The part of New York where she was laid to rest is just to the east of","messageBody":"<div id=\"ygrps-yiv-1158046514\">Hiya, Folks,<br/>\n<br/>\nLisa was buried today very near her home in Lake Peekskill, New <br/>\nYork.  The part of New York where she was &quot;laid to rest&quot; is just to <br/>\nthe east of the beautiful Hudson River and is notable for its <br/>\nverdant, rolling hills.  The site where she was buried is, if my <br/>\nnavigational skills are intact, in a western-facing slope of one of <br/>\nthese hills.  If standing on a rather steep slope under a steely <br/>\nFebruary sky with a biting, chilly wind weren&#39;t, um, challenging <br/>\nenough, the slushy snow and ice underfoot definitely added an <br/>\nintensity to the moment.  Every now and again, someone would succumb <br/>\nand suddenly slip, even though they were standing still.<br/>\n<br/>\nYet, somehow we were warm, all of us there together.  (We reminded <br/>\nme, just a little, of the penguins who huddle in Antarctica.  Perhaps <br/>\nI&#39;m exaggerating just a tad!)<br/>\n<br/>\nThe rabbi who conducted the service (I didn&#39;t catch his name) was <br/>\neloquent and impassioned.  As Liam said as we drove home later, &quot;How <br/>\ncould he not be?  He had excellent material to work with.&quot;  So <br/>\ntrue.  You really got the sense, you *knew* that this man knew Who <br/>\nLisa was.  He was thorough and kind.<br/>\n<br/>\nWhen the opportunity for the mourners to speak came, I stepped up <br/>\nwith my 20-page-long list of messages, some lengthy, some brief, that <br/>\nhad been sent from very near and very far.  Before I left the house <br/>\nfor the funeral, I timed the reading of the whole thing and found it <br/>\nto be more than 30 minutes long!  And that was with some editing.  I <br/>\nfelt that I couldn&#39;t do that to this slipping-and-sliding, shivering <br/>\nbunch.  So, although I was prepared to read all the submissions, I <br/>\nread only one rather brief piece and told folks that they could look <br/>\nat the tribute blog I am creating to see the rest in all their <br/>\nunabridged beauty.  The URL for that site, by the way, is <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://lheyman.blogspot.com\">http://lheyman.blogspot.com</a>&gt;, and it is about halfway done.  There <br/>\nare still many tributes and photos for me to post.<br/>\n<br/>\nBut, I am positively fried right now, so I&#39;m going to tackle the <br/>\ncompletion of this another day.  Perhaps tomorrow?<br/>\n<br/>\nFor a while, there, last year, Lisa and I and a couple of other local <br/>\nunschoolers (Mary Ann and Robin) were trying to get an unschooling <br/>\ninformation night going for folks who expressed an interest in <br/>\nlearning about unschooling.  I believe it was Lisa&#39;s idea, and she <br/>\ninvited me to participate ~ how incredibly honored I felt!  For some <br/>\nreason tonight, I looked back through our email exchanges; we were <br/>\nworking on refining the notices for the event and the event <br/>\nitself.  Looking through these emails, I felt a sharp pain in my <br/>\nheart that I will not be having these exchanges any longer with this <br/>\nimpossibly wonderful, bright, sweet person.<br/>\n<br/>\nWe also talked about her puzzling, frustrating illness in many of <br/>\nthese emails; the illness, by the way, precluded our ever getting <br/>\nthis thing off the ground.  It was the consensus of the three of us, <br/>\nMary Ann, Robin, and me, that Lisa and Roxanne and Ruby were <br/>\nindispensable; I felt they could have gotten along without *me* just <br/>\nfine, but I couldn&#39;t imagine the thing without Lisa.  ::sigh::<br/>\n<br/>\nI&#39;m really rambling when I ought to be sleeping.  Thanks, folks, for <br/>\nlistening.  Do check out the blog, and if you&#39;re moved to post <br/>\nsomething on there and you haven&#39;t already sent me something, please <br/>\ndo send me something now.  It&#39;ll never be too late.<br/>\n<br/>\nSending you all love,<br/>\n<br/>\nMarji</div>","specialLinks":[]}],"prevTopicId":30168,"nextTopicId":30288}}