{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: At the end of my rope","postDate":"1103298604","msgId":4362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNwdXY3Yys1c3BiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNwcWQycis5cjVzQGVHcm91cHMuY29tPg=="},"prevInTopic":4361,"nextInTopic":0,"prevInTime":4361,"nextInTime":4363,"topicId":4315,"numMessagesInTopic":0,"msgSnippet":"... gradually ... over ... I m so sorry you re going through this. A few years ago I wrote something very similar to another list when I thought *I* was going","messageBody":"<div id=\"ygrps-yiv-1907295732\"><blockquote><span title=\"ireply\">&gt; Background-4 kids-ds9, ds7, ds5, dd2<br/>\n&gt; Have homeschooled all along.  I&#39;ve always been relaxed, but <br/>\n </span></blockquote>gradually <br/>\n<blockquote><span title=\"ireply\"> &gt; shifted to unschooling. <br/>\n&gt; My kids fight all the time.  I repeat, all the time.  They fight <br/>\n </span></blockquote>over <br/>\n<blockquote><span title=\"ireply\"> &gt; everything.  I&#39;m going insane.<br/>\n<br/>\n </span></blockquote>I&#39;m so sorry you&#39;re going through this.<br/>\nA few years ago I wrote something very similar to another list when <br/>\nI thought *I* was going to lose it with my kids fighting.<br/>\nActually there were several times.  The examples you gave I can *so* <br/>\nrelate to- the details are different from one incident to the next <br/>\nbut the overall theme stays frustratingly the same, doesn&#39;t it?<br/>\n<br/>\nMy boys are now 11, 9, and 5.  I think the worst point was around <br/>\nthe time my older 2 boys were around 6 and 8.   Even though I never <br/>\nactually went through with it (thankfully) there were times I almost <br/>\nput them in school because I didn&#39;t think I could survive another <br/>\nday without a break from constant bickering.  <br/>\nSo I won&#39;t give you band-aid solutions for those examples, because I <br/>\nknow from experience that if it&#39;s not one thing it&#39;s something else, <br/>\nalmost like they need to get animosity toward each other out of <br/>\ntheir systems or something.<br/>\n  <br/>\nI can promise you that it gets better.  Now that they&#39;re older it&#39;s <br/>\ndefinitely lessened and they are good friends more often than not.<br/>\nI can also say that then, and even now (but especially then), having <br/>\nanother child over changed the dynamic considerably and there was <br/>\n*much* less fighting.  Several friends would be even better- more <br/>\nchaos and clean-up and noise, but LESS FIGHTING!  I&#39;ll take it. :-)<br/>\nI also figured out that validation without judgement of each child&#39;s <br/>\nfeelings towards the other helped a *lot* more than shaming or <br/>\nchiding them for such feelings.  This helps even now... if my oldest <br/>\nneeds to vent I just listen without adding my own emotional baggage <br/>\nto what he&#39;s saying.  For example, he might need to tell me <br/>\nprivately in a moment of anger that sometimes he wishes his brother <br/>\nhad never been born, that he &quot;hates&quot; him, that he drives him crazy, <br/>\netc.   Saying &quot;well but he&#39;s a part of this family and you have to <br/>\nlearn to get along!&quot; doesn&#39;t help at all, but &quot;I know how you feel, <br/>\nI used to feel like that sometimes toward my sister when I was <br/>\ngrowing up.  It&#39;s *hard* to have a brother around all the time isn&#39;t <br/>\nit?&quot; really does help.  He&#39;s able to release the anger and go back <br/>\nto being his brother&#39;s buddy more quickly.<br/>\n<br/>\nI also think it&#39;s important to get one on one time with each child.  <br/>\nMy children, especially when they were younger, were truly different <br/>\npeople one at a time than when with their brothers.  I think it&#39;s <br/>\nimportant for each child to be the only kid around sometimes, and I <br/>\nalso think it&#39;s important for *you* to get to know each child as an <br/>\nindividual outside of the context of sibling dynamics.  This is more <br/>\npractical for some people than it is for others, but if it&#39;s at all <br/>\npossible it *really* helps if only to get a glimpse of who they <br/>\nreally are and to try to remember that when the together-times are <br/>\nrough.  <br/>\n<br/>\nIt really does pass.  <br/>\nI hope something in there is helpful.<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: At the end of my rope","postDate":"1103296005","msgId":4361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNwdXNtNStkMWU1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTAwMWM0ZTQzYyQyY2FjZjY4MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":4360,"nextInTopic":4362,"prevInTime":4360,"nextInTime":4362,"topicId":4315,"numMessagesInTopic":0,"msgSnippet":"...  wrote: Kids ARE nuts during this time.  The media and society, sometimes family, have them hyped up to the nth degree. But it doesn t have","messageBody":"<div id=\"ygrps-yiv-1341876481\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;J. Stauffer&quot; <br/>\n&lt;jnjstau@d...&gt; wrote:<br/>\n Kids ARE nuts during this time.  The media and society, sometimes <br/>\nfamily, have them hyped up to the nth degree.  <br/>\n<br/>\nBut it doesn&#39;t have to be. We haven&#39;t seen that at all with DS (6 <br/>\n1/2) because we just have never &quot;bought in&quot; to the media and society <br/>\nand family hype. We don&#39;t write letters to Santa, we don&#39;t leave out <br/>\nmilk and cookies (and carrots for the reindeer), he chooses whether <br/>\nor not to get a picture with Santa (usually a disinterested No <br/>\nthanks), his presents under the tree are from &quot;Mommy and Daddy&quot; <br/>\n(with the occasional package from Mrs. Claus that my mom ships up <br/>\ninstead of waiting until we get down there). We do love to watch all <br/>\nthe holiday classics, especially things like Charlie Brown and the <br/>\nold Grinch and Rudolph and all and we went to see Polar Express <br/>\nwhich was pretty cool (but not the IMAX - I get motion sick at those <br/>\nbleh) so it&#39;s not like he doesn&#39;t know these things happen. <br/>\n<br/>\nWe&#39;ve been to the mall TWICE this past week (the height of holiday <br/>\nmadness for some) and both times we had an absolute BLAST. The first <br/>\ntime, we looked at and he played with some RC cars (really cool) but <br/>\nthey were $40 which we didn&#39;t have at the time available to spend. <br/>\nSo, we looked, played, talked about how neat they were, how much <br/>\nthey cost, reminded each other to tell DH (who was hiking out to the <br/>\ncar to save us the walk) about them, went and looked at puppies, got <br/>\nsome chocolate at Godiva (mmmm!) and left the mall. No fuss, no <br/>\nwhine, nada. Then last night we decided to go eat at the food court <br/>\nand people watch. After eating, we browsed around and found the RC <br/>\nvehicles again (after I got to go look at puppies - we&#39;ve got two <br/>\nbig dogs but I love/hate looking in the pet store). DS got to drive <br/>\na different one, DH and I consulted and we got a car and a hover <br/>\ncraft type thingie (payday occurred in between Sunday and Thursday). <br/>\nNo mysterious packages, no &quot;wait until Christmas&quot; or ducking back <br/>\nthere secretly. We just took them home and DH and DS played with <br/>\nthem (took the hovercraftie outside to see the lights hovering in <br/>\nthe air in the pitch dark - cool!). They had just enough life in the <br/>\nrechargeable batteries for about 30 minutes of play, then they got <br/>\nplugged in and we headed up to bed for more of DH&#39;s wonderful <br/>\ncharacter voices reading Captain Underpants.</div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] At the end of my rope","postDate":"1103290051","msgId":4360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTAwMWM0ZTQzYyQyY2FjZjY4MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDczNTg1NDMyLTUwMTgtMTFEOS05OTZGLTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":4359,"nextInTopic":4361,"prevInTime":4359,"nextInTime":4361,"topicId":4315,"numMessagesInTopic":0,"msgSnippet":"I don t know where you live but I would suggest an outing.  This time of year we go looking for a grand Yule Log (actually a piece of Juniper that has fallen).","messageBody":"<div id=\"ygrps-yiv-1209315690\">I don&#39;t know where you live but I would suggest an outing.  This time of<br/>\nyear we go looking for a grand Yule Log (actually a piece of Juniper that<br/>\nhas fallen).  We gather berries, various organic material and hot glue it to<br/>\nthe log.  It then gets the place of honor in the fire place until the<br/>\nSolstice.<br/>\n<br/>\nWhen we look back on all those old holiday movies, you notice that the<br/>\npeople are always baking, doing crafts, singing.  I think we might have<br/>\nsomething to learn there.  Kids ARE nuts during this time.  The media and<br/>\nsociety, sometimes family, have them hyped up to the nth degree.  We have<br/>\nfound that if we turn everything non-Christmas to the back burner and spend<br/>\nthis week with an activity each day, it helps tremendously.  Doesn&#39;t have to<br/>\ncost money, does take patience and a happy attitude.<br/>\n<br/>\njulie S.<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Joanne Watson&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joannecwatson@...\">joannecwatson@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, December 17, 2004 4:43 AM<br/>\nSubject: Re: [unschoolingbasics] At the end of my rope<br/>\n<br/>\n<br/>\n<br/>\nOne thing that you might want to look at is reducing the sugar intake?<br/>\nMy kids get wilder when they eat things like brownies or frosting.  Pop<br/>\ntarts?  You&#39;re asking for it, girlfriend.  Try some healthier<br/>\nalternatives for snacks maybe?  And know too that you&#39;re not alone.<br/>\nKids are just off the wall the week before Christmas.  Mine fight over<br/>\ncandy canes while I stand there looking pretty imbecilic,  or so I<br/>\nwould imagine, offering them trail mix.  Oh yes, mom, do please pass<br/>\nthe trail mix - LOL.  A sense of humor always helps...hang in there<br/>\n:-)))) You are not alone!<br/>\n<br/>\nJoanne<br/>\nOn Wednesday, December 15, 2004, at 05:15  PM, hlf30 wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Please help me.  I&#39;m shaking and crying.  I just blew up at my kids<br/>\n&gt; big time.  I&#39;m just sick.<br/>\n&gt;<br/>\n&gt; Background-4 kids-ds9, ds7, ds5, dd2<br/>\n&gt; Have homeschooled all along.  I&#39;ve always been relaxed, but gradually<br/>\n&gt; shifted to unschooling.<br/>\n&gt;<br/>\n&gt; My kids fight all the time.  I repeat, all the time.  They fight over<br/>\n&gt; everything.  I&#39;m going insane.  Here are examples just from today:<br/>\n&gt;<br/>\n&gt; I&#39;m on the couch reading to dd2 while ds7 is building with blocks at<br/>\n&gt; my feet.  Dd5 comes into the room sort of walking/wiggling/being a<br/>\n&gt; little boy.  As he gets closer to me I say, &quot;Be Careful of ds7&#39;s<br/>\n&gt; tower.&quot;  At that point he wiggles his hips extra hard and his leg<br/>\n&gt; knocks over the whole thing.  Ds7 jumps on him from behind and<br/>\n&gt; tackles him.  &quot;How come you knocked over my tower??!!!&quot;  (hit,<br/>\n&gt; hit)  &quot;Leave my stuff alone&quot; (hit,hit)  Ds5 starts sobbing.<br/>\n&gt;<br/>\n&gt; Later.<br/>\n&gt;<br/>\n&gt; I&#39;m sitting down and ds7 comes over to show me something he just read<br/>\n&gt; in a magazine. While he&#39;s talking to me ds5 comes and leans on ds7<br/>\n&gt; hard enough for him to fall over.  I said `Please stop&#39;.  He didn&#39;t,<br/>\n&gt; knocked ds7 over, ds7 got up and kicked ds5.<br/>\n&gt;<br/>\n&gt; Later.<br/>\n&gt;<br/>\n&gt; I&#39;m making brownies as we&#39;re going to a friend&#39;s house for supper.<br/>\n&gt; I&#39;m starting the filling and ds9 calls &quot;Can I like the filling bowl<br/>\n&gt; when you&#39;re done?&quot; I say yes.  Ds7 pipes up &quot;Hey, I want to lick the<br/>\n&gt; filling bowl.&quot;  I say &quot;You can lick the frosting bowl when I make<br/>\n&gt; that this afternoon.&quot;  Ds5 says &quot;Hey that&#39;s not fair!  I want<br/>\n&gt; something to lick.&quot;  I say &quot;Well you can help me make the frosting.&quot;<br/>\n&gt; OK everything seems fine.<br/>\n&gt;<br/>\n&gt; I make the filling, give the bowl to ds9.  Ds7 says &quot;can&#39;t I have<br/>\n&gt; just a little?&quot;  &quot;No!&quot; says ds9, &quot;Mom said I could have it.&quot;  Later<br/>\n&gt; when I give the frosting bowl to ds7, ds 5 starts crying &quot;How come I<br/>\n&gt; don&#39;t have anything to lick?&quot;  I ask ds7 if he&#39;d like to share.  Of<br/>\n&gt; course, he wouldn&#39;t.  Now dd2 starts crying…she wants to lick<br/>\n&gt; something.  I have nothing more to offer!  Everyone is mad.<br/>\n&gt;<br/>\n&gt; Later.<br/>\n&gt;<br/>\n&gt; Dd2 asks for a poptart.  I say yes and get it for her.  There&#39;s two<br/>\n&gt; left in the package.  (you already know what&#39;s coming, right?)  I<br/>\n&gt; hand her one; she asks for the other.  She has never, never, never<br/>\n&gt; eaten more than one pop tart, she gets too full.  I tell her to eat<br/>\n&gt; the first one and then we&#39;ll see if she&#39;s still hungry.  At that<br/>\n&gt; point ds5 grabs the second pop tart off the counter and runs way<br/>\n&gt; shouting &quot;It&#39;s mine It&#39;s mine.  I&#39;m having this pop tart.&quot;  Dd 2<br/>\n&gt; starts screaming.  I asked ds5 to please give the pop tart back to me<br/>\n&gt; and we&#39;d try to work something out.  &quot;No&quot; he says and turns around to<br/>\n&gt; try to hold it out of my reach. I try to grab it and think `this is<br/>\n&gt; crazy, I&#39;m not going to get into a grabbing match with a 5yo.&quot;  Now<br/>\n&gt; ds7 is crying there&#39;s no pop tarts left for him and I know ds9 is<br/>\n&gt; going to throw a huge fit (crying, stomping) when he gets home from a<br/>\n&gt; friend&#39;s house and sees there aren&#39;t any left.<br/>\n&gt;<br/>\n&gt; I suppose I could go buy more Pop tarts at the store, but I couldn&#39;t<br/>\n&gt; go this exact minute and when would it end.  How many pop tarts would<br/>\n&gt; I have to buy to make everyone happy?<br/>\n&gt;<br/>\n&gt; I finally just blew up and yelled and stomped out of the room and<br/>\n&gt; into my bedroom where I locked the door.  Not the most mature thing,<br/>\n&gt; but I was scared I was going to abuse my children if I didn&#39;t leave<br/>\n&gt; the room NOW.<br/>\n&gt;<br/>\n&gt; This is just a small sampling.  It&#39;s all the time.  Fighting over<br/>\n&gt; everything, being so cruel to one another.  Sometimes I feel they&#39;d<br/>\n&gt; be better off on a ps playground then home with siblings.<br/>\n&gt;<br/>\n&gt; I&#39;ve read these boards for years.  I try to breathe.  I say Yes<br/>\n&gt; whenever I can.  I try to be gentle and calm.  I try to give everyone<br/>\n&gt; tons of attention.  I&#39;m just stretched too thin.  I feel as if<br/>\n&gt; someone is always whining or crying or complaining or grumbling.<br/>\n&gt;<br/>\n&gt; I&#39;m at the end of my rope.  Sandra, Ren, Kelly, others….please help.<br/>\n&gt; Sorry if you are reading this more than once.  I&#39;m going to post it<br/>\n&gt; on a few boards.<br/>\n&gt;<br/>\n&gt; Fonty<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links </span></blockquote></div>","specialLinks":[]},{"userId":161813777,"authorName":"Joanne Watson","from":"Joanne Watson &lt;joannecwatson@...&gt;","profile":"stargrlwonder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] At the end of my rope","postDate":"1103280192","msgId":4359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczNTg1NDMyLTUwMTgtMTFEOS05OTZGLTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4=","inReplyToHeader":"PGNwcWQycis5cjVzQGVHcm91cHMuY29tPg=="},"prevInTopic":4315,"nextInTopic":4360,"prevInTime":4358,"nextInTime":4360,"topicId":4315,"numMessagesInTopic":0,"msgSnippet":"One thing that you might want to look at is reducing the sugar intake? My kids get wilder when they eat things like brownies or frosting.  Pop tarts?  You re","messageBody":"<div id=\"ygrps-yiv-128265888\">One thing that you might want to look at is reducing the sugar intake?  <br/>\nMy kids get wilder when they eat things like brownies or frosting.  Pop <br/>\ntarts?  You&#39;re asking for it, girlfriend.  Try some healthier <br/>\nalternatives for snacks maybe?  And know too that you&#39;re not alone.  <br/>\nKids are just off the wall the week before Christmas.  Mine fight over <br/>\ncandy canes while I stand there looking pretty imbecilic,  or so I <br/>\nwould imagine, offering them trail mix.  Oh yes, mom, do please pass <br/>\nthe trail mix - LOL.  A sense of humor always helps...hang in there <br/>\n:-)))) You are not alone!<br/>\n<br/>\nJoanne<br/>\n<blockquote><span title=\"qreply\"> On Wednesday, December 15, 2004, at 05:15  PM, hlf30 wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Please help me.  I&#39;m shaking and crying.  I just blew up at my kids<br/>\n&gt; big time.  I&#39;m just sick.<br/>\n&gt;<br/>\n&gt; Background-4 kids-ds9, ds7, ds5, dd2<br/>\n&gt; Have homeschooled all along.  I&#39;ve always been relaxed, but gradually<br/>\n&gt; shifted to unschooling.<br/>\n&gt;<br/>\n&gt; My kids fight all the time.  I repeat, all the time.  They fight over<br/>\n&gt; everything.  I&#39;m going insane.  Here are examples just from today:<br/>\n&gt;<br/>\n&gt; I&#39;m on the couch reading to dd2 while ds7 is building with blocks at<br/>\n&gt; my feet.  Dd5 comes into the room sort of walking/wiggling/being a<br/>\n&gt; little boy.  As he gets closer to me I say, &quot;Be Careful of ds7&#39;s<br/>\n&gt; tower.&quot;  At that point he wiggles his hips extra hard and his leg<br/>\n&gt; knocks over the whole thing.  Ds7 jumps on him from behind and<br/>\n&gt; tackles him.  &quot;How come you knocked over my tower??!!!&quot;  (hit,<br/>\n&gt; hit)  &quot;Leave my stuff alone&quot; (hit,hit)  Ds5 starts sobbing.<br/>\n&gt;<br/>\n&gt; Later.<br/>\n&gt;<br/>\n&gt; I&#39;m sitting down and ds7 comes over to show me something he just read<br/>\n&gt; in a magazine. While he&#39;s talking to me ds5 comes and leans on ds7<br/>\n&gt; hard enough for him to fall over.  I said `Please stop&#39;.  He didn&#39;t,<br/>\n&gt; knocked ds7 over, ds7 got up and kicked ds5.<br/>\n&gt;<br/>\n&gt; Later.<br/>\n&gt;<br/>\n&gt; I&#39;m making brownies as we&#39;re going to a friend&#39;s house for supper.<br/>\n&gt; I&#39;m starting the filling and ds9 calls &quot;Can I like the filling bowl<br/>\n&gt; when you&#39;re done?&quot; I say yes.  Ds7 pipes up &quot;Hey, I want to lick the<br/>\n&gt; filling bowl.&quot;  I say &quot;You can lick the frosting bowl when I make<br/>\n&gt; that this afternoon.&quot;  Ds5 says &quot;Hey that&#39;s not fair!  I want<br/>\n&gt; something to lick.&quot;  I say &quot;Well you can help me make the frosting.&quot;<br/>\n&gt; OK everything seems fine.<br/>\n&gt;<br/>\n&gt; I make the filling, give the bowl to ds9.  Ds7 says &quot;can&#39;t I have<br/>\n&gt; just a little?&quot;  &quot;No!&quot; says ds9, &quot;Mom said I could have it.&quot;  Later<br/>\n&gt; when I give the frosting bowl to ds7, ds 5 starts crying &quot;How come I<br/>\n&gt; don&#39;t have anything to lick?&quot;  I ask ds7 if he&#39;d like to share.  Of<br/>\n&gt; course, he wouldn&#39;t.  Now dd2 starts crying…she wants to lick<br/>\n&gt; something.  I have nothing more to offer!  Everyone is mad.<br/>\n&gt;<br/>\n&gt; Later.<br/>\n&gt;<br/>\n&gt; Dd2 asks for a poptart.  I say yes and get it for her.  There&#39;s two<br/>\n&gt; left in the package.  (you already know what&#39;s coming, right?)  I<br/>\n&gt; hand her one; she asks for the other.  She has never, never, never<br/>\n&gt; eaten more than one pop tart, she gets too full.  I tell her to eat<br/>\n&gt; the first one and then we&#39;ll see if she&#39;s still hungry.  At that<br/>\n&gt; point ds5 grabs the second pop tart off the counter and runs way<br/>\n&gt; shouting &quot;It&#39;s mine It&#39;s mine.  I&#39;m having this pop tart.&quot;  Dd 2<br/>\n&gt; starts screaming.  I asked ds5 to please give the pop tart back to me<br/>\n&gt; and we&#39;d try to work something out.  &quot;No&quot; he says and turns around to<br/>\n&gt; try to hold it out of my reach. I try to grab it and think `this is<br/>\n&gt; crazy, I&#39;m not going to get into a grabbing match with a 5yo.&quot;  Now<br/>\n&gt; ds7 is crying there&#39;s no pop tarts left for him and I know ds9 is<br/>\n&gt; going to throw a huge fit (crying, stomping) when he gets home from a<br/>\n&gt; friend&#39;s house and sees there aren&#39;t any left.<br/>\n&gt;<br/>\n&gt; I suppose I could go buy more Pop tarts at the store, but I couldn&#39;t<br/>\n&gt; go this exact minute and when would it end.  How many pop tarts would<br/>\n&gt; I have to buy to make everyone happy?<br/>\n&gt;<br/>\n&gt; I finally just blew up and yelled and stomped out of the room and<br/>\n&gt; into my bedroom where I locked the door.  Not the most mature thing,<br/>\n&gt; but I was scared I was going to abuse my children if I didn&#39;t leave<br/>\n&gt; the room NOW.<br/>\n&gt;<br/>\n&gt; This is just a small sampling.  It&#39;s all the time.  Fighting over<br/>\n&gt; everything, being so cruel to one another.  Sometimes I feel they&#39;d<br/>\n&gt; be better off on a ps playground then home with siblings.<br/>\n&gt;<br/>\n&gt; I&#39;ve read these boards for years.  I try to breathe.  I say Yes<br/>\n&gt; whenever I can.  I try to be gentle and calm.  I try to give everyone<br/>\n&gt; tons of attention.  I&#39;m just stretched too thin.  I feel as if<br/>\n&gt; someone is always whining or crying or complaining or grumbling.<br/>\n&gt;<br/>\n&gt; I&#39;m at the end of my rope.  Sandra, Ren, Kelly, others….please help.<br/>\n&gt; Sorry if you are reading this more than once.  I&#39;m going to post it<br/>\n&gt; on a few boards.<br/>\n&gt;<br/>\n&gt; Fonty<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":7589338,"authorName":"hlf30","from":"&quot;hlf30&quot; &lt;lawfonta@...&gt;","profile":"hlf30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"At the end of my rope","postDate":"1103148955","msgId":4315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNwcWQycis5cjVzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":4359,"prevInTime":4314,"nextInTime":4316,"topicId":4315,"numMessagesInTopic":0,"msgSnippet":"Please help me.  I m shaking and crying.  I just blew up at my kids big time.  I m just sick. Background-4 kids-ds9, ds7, ds5, dd2 Have homeschooled all along.","messageBody":"<div id=\"ygrps-yiv-1681288885\">Please help me.  I&#39;m shaking and crying.  I just blew up at my kids <br/>\nbig time.  I&#39;m just sick.<br/>\n<br/>\nBackground-4 kids-ds9, ds7, ds5, dd2<br/>\nHave homeschooled all along.  I&#39;ve always been relaxed, but gradually <br/>\nshifted to unschooling.<br/>\n<br/>\nMy kids fight all the time.  I repeat, all the time.  They fight over <br/>\neverything.  I&#39;m going insane.  Here are examples just from today:<br/>\n<br/>\nI&#39;m on the couch reading to dd2 while ds7 is building with blocks at <br/>\nmy feet.  Dd5 comes into the room sort of walking/wiggling/being a <br/>\nlittle boy.  As he gets closer to me I say, &quot;Be Careful of ds7&#39;s <br/>\ntower.&quot;  At that point he wiggles his hips extra hard and his leg <br/>\nknocks over the whole thing.  Ds7 jumps on him from behind and <br/>\ntackles him.  &quot;How come you knocked over my tower??!!!&quot;  (hit, <br/>\nhit)  &quot;Leave my stuff alone&quot; (hit,hit)  Ds5 starts sobbing.<br/>\n<br/>\nLater.<br/>\n<br/>\nI&#39;m sitting down and ds7 comes over to show me something he just read <br/>\nin a magazine. While he&#39;s talking to me ds5 comes and leans on ds7 <br/>\nhard enough for him to fall over.  I said `Please stop&#39;.  He didn&#39;t, <br/>\nknocked ds7 over, ds7 got up and kicked ds5.<br/>\n<br/>\nLater.<br/>\n<br/>\nI&#39;m making brownies as we&#39;re going to a friend&#39;s house for supper.  <br/>\nI&#39;m starting the filling and ds9 calls &quot;Can I like the filling bowl <br/>\nwhen you&#39;re done?&quot; I say yes.  Ds7 pipes up &quot;Hey, I want to lick the <br/>\nfilling bowl.&quot;  I say &quot;You can lick the frosting bowl when I make <br/>\nthat this afternoon.&quot;  Ds5 says &quot;Hey that&#39;s not fair!  I want <br/>\nsomething to lick.&quot;  I say &quot;Well you can help me make the frosting.&quot;  <br/>\nOK everything seems fine.<br/>\n<br/>\nI make the filling, give the bowl to ds9.  Ds7 says &quot;can&#39;t I have <br/>\njust a little?&quot;  &quot;No!&quot; says ds9, &quot;Mom said I could have it.&quot;  Later <br/>\nwhen I give the frosting bowl to ds7, ds 5 starts crying &quot;How come I <br/>\ndon&#39;t have anything to lick?&quot;  I ask ds7 if he&#39;d like to share.  Of <br/>\ncourse, he wouldn&#39;t.  Now dd2 starts cryingshe wants to lick <br/>\nsomething.  I have nothing more to offer!  Everyone is mad.<br/>\n<br/>\nLater.<br/>\n<br/>\nDd2 asks for a poptart.  I say yes and get it for her.  There&#39;s two <br/>\nleft in the package.  (you already know what&#39;s coming, right?)  I <br/>\nhand her one; she asks for the other.  She has never, never, never <br/>\neaten more than one pop tart, she gets too full.  I tell her to eat <br/>\nthe first one and then we&#39;ll see if she&#39;s still hungry.  At that <br/>\npoint ds5 grabs the second pop tart off the counter and runs way <br/>\nshouting &quot;It&#39;s mine It&#39;s mine.  I&#39;m having this pop tart.&quot;  Dd 2 <br/>\nstarts screaming.  I asked ds5 to please give the pop tart back to me <br/>\nand we&#39;d try to work something out.  &quot;No&quot; he says and turns around to <br/>\ntry to hold it out of my reach. I try to grab it and think `this is <br/>\ncrazy, I&#39;m not going to get into a grabbing match with a 5yo.&quot;  Now <br/>\nds7 is crying there&#39;s no pop tarts left for him and I know ds9 is <br/>\ngoing to throw a huge fit (crying, stomping) when he gets home from a <br/>\nfriend&#39;s house and sees there aren&#39;t any left.<br/>\n<br/>\nI suppose I could go buy more Pop tarts at the store, but I couldn&#39;t <br/>\ngo this exact minute and when would it end.  How many pop tarts would <br/>\nI have to buy to make everyone happy?<br/>\n<br/>\nI finally just blew up and yelled and stomped out of the room and <br/>\ninto my bedroom where I locked the door.  Not the most mature thing, <br/>\nbut I was scared I was going to abuse my children if I didn&#39;t leave <br/>\nthe room NOW.<br/>\n<br/>\nThis is just a small sampling.  It&#39;s all the time.  Fighting over <br/>\neverything, being so cruel to one another.  Sometimes I feel they&#39;d <br/>\nbe better off on a ps playground then home with siblings.<br/>\n<br/>\nI&#39;ve read these boards for years.  I try to breathe.  I say Yes <br/>\nwhenever I can.  I try to be gentle and calm.  I try to give everyone <br/>\ntons of attention.  I&#39;m just stretched too thin.  I feel as if <br/>\nsomeone is always whining or crying or complaining or grumbling.<br/>\n<br/>\nI&#39;m at the end of my rope.  Sandra, Ren, Kelly, others.please help.<br/>\nSorry if you are reading this more than once.  I&#39;m going to post it <br/>\non a few boards.<br/>\n<br/>\nFonty</div>","specialLinks":[]}],"prevTopicId":4314,"nextTopicId":4365}}