{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":223130287,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: An Intro, and comments on recalcritrant dads","postDate":"1132683605","msgId":7900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMTIyMTgyMC5qQU1JSzBtSTAwNDc5MEBtcy1zbXRwLTAzLWVyaTAuc29jYWwucnIuY29tPg==","inReplyToHeader":"PDExMzI2NzA1NTYuMjEzLjIzMDAzLm0yMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":7860,"nextInTopic":0,"prevInTime":7899,"nextInTime":7901,"topicId":7859,"numMessagesInTopic":0,"msgSnippet":"This is such a good suggestion from Pam.  I think there is a tendency to try to say well I can t unschool because DH doesn t get it or worse even, to get angry","messageBody":"<div id=\"ygrps-yiv-2029943011\">This is such a good suggestion from Pam.  I think there is a tendency to try<br/>\nto say well I can&#39;t unschool because DH doesn&#39;t get it or worse even, to get<br/>\nangry or impatient with a husband who is still on the beginning of the<br/>\nlearning curve.  Wrecking that relationship does nothing to help the kids.<br/>\nKWIM?   My husband is soooo patient and trusting of what I want to<br/>\naccomplish with the kids.  But at times when he has been wanting something<br/>\nto change, I need to get to the root of what he really wants and brain storm<br/>\nwith him about how we might accomplish that.  (it&#39;s not always as peaceful<br/>\nas that sounds LOL)  Recently, he started talking about getting them to go<br/>\nto bed earlier and &quot;Do they really have to watch that much TV?&quot;  Well, my<br/>\nhackles went up about limits and respecting their rhythms etc. but when we<br/>\ngot to the bottom of it he really just wanted more time to interact with<br/>\nthem without them saying &quot;I&#39;m watching this show&quot; or whatever.  His schedule<br/>\nafter all is much more limited by work (what a guy as Sandra says) than<br/>\ntheirs is.  <br/>\n<br/>\nSo, to shorten this long story, we decided (discussed, it with the kids<br/>\netc.) that we could all - including dh- leave our individual pursuits at 8pm<br/>\nand get together to do something together.  This would not have occurred to<br/>\nme bc I see the kids all day every day but he doesn&#39;t and we decided that 8<br/>\nto whenever was a good time for us to connect as a family.  10yo Sydney took<br/>\nthat idea and ran with it.  She organized movie night, &quot;family fun night&quot;<br/>\nand Saturday breakfast which she and dad cook togethter.  After bkfst we<br/>\ntalk about (well actually it is more like a detailed family meeting) what<br/>\nmovies to put on the Netflix list for movie night and what games we want to<br/>\nplay for family fun night, vacation plans and any other business people<br/>\nbring up.  Hubby is happy with all the involvement and the kids are way<br/>\nhappy to have more of his energy in the mix of our busy lives.<br/>\n<br/>\nThe kids don&#39;t see it as an imposition, (though there is sometimes some<br/>\ncomplaining at the moment when it&#39;s time to leave off what they&#39;re doing.)<br/>\nThey understand that the bit of structure helps us meet one of our needs<br/>\n(Dad&#39;s) and we try to meet all of everyone&#39;s needs here.  <br/>\n<br/>\nI know this isn&#39;t the same as &quot;homeschool time&quot; as it was put forth on this<br/>\nthread but the same kind of approach would work for that as well as other<br/>\nconcerns dads have that threaten to derail unschooling or cause tention<br/>\nbetween the parents.  Having a peaceful happy family where everybody cares<br/>\nabout each other is the biggest reason I wanted to unschool in the first<br/>\nplace.<br/>\n<br/>\nKrisula<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- <br/>\nGood insight. Thanks Allan.<br/>\n<br/>\nI also wanted to mention that i know moms who had recalcitrant husbands and<br/>\nthey had &quot;homeschool time&quot; every day, but it was always fun stuff that the<br/>\nkids decided on. Mom and kids would brainstorm topics and activities to do<br/>\nduring &quot;homeschool time.&quot; Sometimes it would be a topic like &quot;weather&quot; and<br/>\nmom would gather fun/interesting stuff related to that topic - movie from<br/>\nthe library, a home weather station, etc. Mom would always keep the kids<br/>\ninterests in mind - hands-on activities that the kids would enjoy, for<br/>\nexample. The kids NEVER had to do it if they didn&#39;t feel like it - so it was<br/>\nmom&#39;s challenge to make it fun enough to entice them. Other times it would<br/>\nbe a certain game they all wanted to play or a time to do art stuff or<br/>\nlisten to a book on tape.  The husbands seemed to be satisfied by the<br/>\nexistence of &quot;homeschool time&quot; each day - even though it didn&#39;t look like<br/>\nconventional school with workbooks, etc. The kids liked that dedicated time<br/>\n- mom not distracted b anything else and the moms were really good at coming<br/>\nup with things to do that the kids really did enjoy.<br/>\n<br/>\nIt isn&#39;t unschooling but it is a lot better than regular school-at- home and<br/>\na good transition TO unschooling.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] An Intro, and comments on recalcritrant dads","postDate":"1132627567","msgId":7860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3MTYwQ0Y3LUE4RDItNEY2OS05NkQzLUM4QTEyOTdDMTMyMUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDZiMWI5NzQ4MDUxMTIxMTYzNGw0ZjYxMzI2Y3I1ZjY1YzA4MjY1MzY4YjFhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDZiMWI5NzQ4MDUxMTIxMTYzNGw0ZjYxMzI2Y3I1ZjY1YzA4MjY1MzY4YjFhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":7859,"nextInTopic":7900,"prevInTime":7859,"nextInTime":7861,"topicId":7859,"numMessagesInTopic":0,"msgSnippet":"Good insight. Thanks Allan. I also wanted to mention that i know moms who had recalcitrant husbands and they had homeschool time every day, but it was always","messageBody":"<div id=\"ygrps-yiv-503086167\">Good insight. Thanks Allan.<br/>\n<br/>\nI also wanted to mention that i know moms who had recalcitrant  <br/>\nhusbands and they had &quot;homeschool time&quot; every day, but it was always  <br/>\nfun stuff that the kids decided on. Mom and kids would brainstorm  <br/>\ntopics and activities to do during &quot;homeschool time.&quot; Sometimes it  <br/>\nwould be a topic like &quot;weather&quot; and mom would gather fun/interesting  <br/>\nstuff related to that topic - movie from the library, a home weather  <br/>\nstation, etc. Mom would always keep the kids interests in mind -  <br/>\nhands-on activities that the kids would enjoy, for example. The kids  <br/>\nNEVER had to do it if they didn&#39;t feel like it - so it was mom&#39;s  <br/>\nchallenge to make it fun enough to entice them. Other times it would  <br/>\nbe a certain game they all wanted to play or a time to do art stuff  <br/>\nor listen to a book on tape.  The husbands seemed to be satisfied by  <br/>\nthe existence of &quot;homeschool time&quot; each day - even though it didn&#39;t  <br/>\nlook like conventional school with workbooks, etc. The kids liked  <br/>\nthat dedicated time - mom not distracted b anything else and the moms  <br/>\nwere really good at coming up with things to do that the kids really  <br/>\ndid enjoy.<br/>\n<br/>\nIt isn&#39;t unschooling but it is a lot better than regular school-at- <br/>\nhome and a good transition TO unschooling.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 21, 2005, at 4:34 PM, Allans Email wrote:<br/>\n<br/>\n&gt; As a man, and hopefully, understanding the way men think,<br/>\n&gt; I always wanted my children to be independent and think for  <br/>\n&gt; themselves (yes,<br/>\n&gt; even though I would chastise them for being independent of what I  <br/>\n&gt; thought<br/>\n&gt; :grin: )<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":219952851,"authorName":"Allans Email","from":"Allans Email &lt;allansemail@...&gt;","profile":"allan2015","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] An Intro, and comments on recalcritrant dads","postDate":"1132619652","msgId":7859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZiMWI5NzQ4MDUxMTIxMTYzNGw0ZjYxMzI2Y3I1ZjY1YzA4MjY1MzY4YjFhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":7860,"prevInTime":7858,"nextInTime":7860,"topicId":7859,"numMessagesInTopic":0,"msgSnippet":"Hello all My name is Allan, and I m an unschooler. ;-) I am a single parent, homeschooling two boys ages 13 and 18 right now, and within two weeks my daughters","messageBody":"<div id=\"ygrps-yiv-225687005\">Hello all<br/>\nMy name is Allan, and I&#39;m an unschooler. ;-)<br/>\n<br/>\nI am a single parent, homeschooling two boys ages 13 and 18 right now, and<br/>\nwithin two weeks my daughters ages 12 and 17 will be here and join the<br/>\nunschooling team. I only recently arranged for my children&#39;s escape from the<br/>\npenal system we call publik school, and we are all the better for it.<br/>\nEveryone&#39;s attitude and behavior have undergone a remarkable transformation.<br/>\nNot that I would have said it was &#39;bad&#39; before, but thats only because I<br/>\ndidn&#39;t know what &#39;good&#39; was.<br/>\n<br/>\nThe day before I broke them out of the pen, I bought a few books to use as<br/>\nour curriculum; a pre-Algebra book, a grammar book, a daily reader on Texas<br/>\nhistory, and because we already had a Biology text book, teachers, edition,<br/>\nI thought I had it covered, should anyone say anything.<br/>\n<br/>\nI had been researching home schooling as an option because of the typical<br/>\nthings that one endures while their children are incarcerated from 8:00-3:45<br/>\nPM in the schooljailhouse, e.g. defending against bullying, boredom with the<br/>\nnecessary-but-snail&#39;s pace of &#39;learning&#39; in the class room, arrogant wardens<br/>\nand guards.. er, I mean principals and teachers, anyway you know what I<br/>\nmean. I came across a few unschooling sites and the dam burst. I KNEW right<br/>\naway that this was the method I wanted to use with my children.<br/>\n<br/>\nBut... I bought my &#39;textbooks&#39; just in case someone questioned me. I worried<br/>\nfor awhile that they would get &#39;behind&#39;, although now I think of it as,<br/>\n&#39;behind what, exactly?&#39; Because I have already in just a short couple of<br/>\nweeks, watched my boys interests grow exponentially. I discussed the idea of<br/>\nunschooling with them, told them what was involved and, to the best of my<br/>\nunderstanding, what it would and would not entail. And of course they loved<br/>\nthe idea. :-)<br/>\n<br/>\nWhen my oldest two children were very young, I was quite the disciplinarian.<br/>\nI didn&#39;t want the boys to cry, you always had to do what the teacher said,<br/>\nyada yada yada. I was a military man as well as a law enforcement officer.<br/>\nYou did what was expected of you, to the best of your ability.<br/>\n<br/>\nHow I wish I had those years back. I tell my children now that my youngest<br/>\ntwo have benefited so much from my experiences with my eldest. I have told<br/>\nmy kids that I regret those days and wish I could turn back the clock and be<br/>\ntheir guide and mentor instead of their lord and taskmaster. But you can<br/>\nonly do what you can do, and, thankfully, I have a wonderful relationship<br/>\nwith all four of my kids today.<br/>\n<br/>\nWhat prompted me to write an intro, finally, was reading the discussions<br/>\nbetween a few of the members here who are having trouble dealing with<br/>\nrecalcitrant husbands. Those who sound a lot like I was, a long time ago. :D<br/>\nI find this exchange fascinating, because over the past few years I have<br/>\nfound that I, the male father figure, am the one who has been more lenient.<br/>\nI am the one who didn&#39;t want to enforce bedtimes, saying, they will learn<br/>\nthey need to get up when they are tired all day the next day. I didn&#39;t want<br/>\nto enforce certain mealtimes nor did I mind if someone wasn&#39;t hungry<br/>\n(although I admit I enjoyed dinners when we were all together). I would<br/>\nNEVER make a child clean his plate of food; I hated that when I was a child<br/>\nand I hate it today. I was the one who was lenient in style of dress,<br/>\nhairstyles, music, movies, you name it.<br/>\n<br/>\nDon&#39;t get me wrong, I did try to &#39;enforce&#39; certain rules when I felt that it<br/>\nwould bring negative or unwanted attention upon ME, but over time I learned<br/>\nnot to worry about those things, either. I have found that setting a good<br/>\nexample is the best teacher of all. If you want your children to be polite<br/>\nto others, then thank the cashier and the waitress in front of them. Smile<br/>\nat people and engage them in conversation. Return lost items. Simple,<br/>\nreally.<br/>\n<br/>\nAs for learning and &quot;teaching&quot; things, I have always handled (well always is<br/>\na big word, but in general), I have always tried to explain, to the best of<br/>\nmy ability, the answer to a question posed by one of my children. I remember<br/>\ntrying to explain the way a clutch and transmission work when my son, who<br/>\nwas six or seven at the time, asked me why I had to shift gears while<br/>\ndriving. :-)<br/>\n<br/>\nI find now that my sons&#39; knowledge far surpasses mine in many areas. My 13<br/>\nyear old is a self-taught web designer, and is working his way through a<br/>\nmanual on programming in C++. Trust me, he didn&#39;t learn this in junior high<br/>\njail. My 18 year old is a history and mythology buff. He can rattle off so<br/>\nmuch ancient history it is hard to keep up. And again, you can believe me<br/>\nwhen I say that he was *not* taught that in high school. I&#39;m waiting for my<br/>\ngirls to arrive. I think they are nervous about being &#39;home skooled&#39;, but I<br/>\ntruly believe when they find out they can read watch talk learn about<br/>\nwhatever THEY want, they will be happy to have moved here.<br/>\n<br/>\nTo those wives who are struggling to unschool with traditional dads, may I<br/>\nsuggest something? As a man, and hopefully, understanding the way men think,<br/>\nI always wanted my children to be independent and think for themselves (yes,<br/>\neven though I would chastise them for being independent of what I thought<br/>\n:grin: ) So perhaps one way you might begin to sublty influence your<br/>\nhusbands to come to the &#39;dark side&#39; is to illuminate how independent little<br/>\nJohnny or Jane is, since you&#39;ve been unschooling. Introduce into the<br/>\nconversation that the child was so interested in this certain topic, ALL ON<br/>\nHIS OWN. Tell hubby how great it is that Jane picks out her own clothes,<br/>\nputs on her own shoes, decides on her own what she wants to eat, etc. &quot;This<br/>\ngirl will be a real LEADER some day! She won&#39;t let anybody pull her around<br/>\nby the nose! She&#39;s a thinker, she knows what she wants. I bet that she gets<br/>\nit from you, Dear!&quot; :wink wink:<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":7896,"nextTopicId":7876}}