{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Advice please","postDate":"1279732405","msgId":44585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNzlybCs5M3F1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRGNTI1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":44583,"nextInTopic":44586,"prevInTime":44584,"nextInTime":44586,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Thank you so much for your advice. It has never occurred to me that he didn t like the way he was raised because he always seemed so happy when we were kids. I","messageBody":"<div id=\"ygrps-yiv-1897578503\">Thank you so much for your advice. It has never occurred to me that he didn&#39;t like the way he was raised because he always seemed so happy when we were kids. I was always the one that was second guessing everything I did, while he is more confident than anyone I&#39;ve ever me. I think this has been the biggest lightbulb moment I&#39;ve had in a long time. You&#39;ve really given me something to think about. I&#39;m sure I&#39;ve given the impression that he&#39;s not a good dad, but he really is. We both have bad tempers and my way of dealing is to walk away at the moment, and calm down. His is to react with yelling. I used to be the same way and I still have my moments. It&#39;s not even so much that I&#39;m trying to get him to change, as I&#39;ve probably sounded like. It&#39;s the fact that I&#39;m trying to change because I don&#39;t like the way I am, and it&#39;s like he&#39;s irritated by that. I can&#39;t just keep on with the way things are because then I get in bed every night and want to cry for the awful way I behave. I&#39;m completely willing to find a happy medium with him, I&#39;m honestly happy to just unschool, or even homeschool if that&#39;s as much as I can get out of him. It&#39;s the yelling I don&#39;t like.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; How does he feel about how he was parented? It sounds a lot like he felt<br/>\n&gt; very alone, left to his own devices to sort things out, which can feel<br/>\n&gt; really out of control for a kid. And, what he&#39;s seeing/perceiving is<br/>\n&gt; that you are trying to do the same things that his parents did which<br/>\n&gt; were uncomfortable for him. So he&#39;s holding tighter to control, to being<br/>\n&gt; the &#39;father role&#39; that he saw others being that seemed more secure for<br/>\n&gt; their families than he felt in his family. <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Changes of any kind can be difficult and scary. Losing control is scary<br/>\n&gt; and people in general tend to hold on tighter if they feel out of<br/>\n&gt; control. Just think about how it feels if the car starts to skid and<br/>\n&gt; slide - first reaction is to hold tighter to the steering wheel, isn&#39;t<br/>\n&gt; it?<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Don&#39;t even try to get him to change how he interacts with the kids. You<br/>\n&gt; do it yourself. I wouldn&#39;t even ask him to &quot;please speak more gently to<br/>\n&gt; them&quot;. However, if he jumped in when I was in the middle of handling a<br/>\n&gt; situation, I might say &quot;Thanks honey but I&#39;m handling this, please give<br/>\n&gt; me a moment&quot; or some such - he needs to know that you have the situation<br/>\n&gt; under control, that it&#39;s not the chaos that it may seem when he&#39;s<br/>\n&gt; looking at it. Know what I mean? It sounds like he&#39;s trying really hard<br/>\n&gt; to be the good father that he maybe didn&#39;t have - being a father not a<br/>\n&gt; friend, which he equates with out of control, uncared for kids. That may<br/>\n&gt; even be part of his change in his religious beliefs - don&#39;t all &quot;good&quot;<br/>\n&gt; fathers raise their kids in some belief system? (speaking from the<br/>\n&gt; possible perception he may have there)<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Maybe start with (a) change how you speak to the kids but don&#39;t change<br/>\n&gt; how he relates to the kids (b) work on communication between the two of<br/>\n&gt; you - it sounds like there&#39;s a lot going on apart from the kids as far<br/>\n&gt; as your relationship goes.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; --Deb R<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":177657999,"authorName":"westcoastmamaa","from":"&quot;westcoastmamaa&quot; &lt;caelen@...&gt;","profile":"westcoastmamaa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279728764","msgId":44586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNzY5cys2MGJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyNHBwaStncWJyQGVHcm91cHMuY29tPg=="},"prevInTopic":44585,"nextInTopic":0,"prevInTime":44585,"nextInTime":44587,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"This sounds like such a difficult situation for all of you to navigate. Some things you said recently reminded me of my own experiences. Your dh says your","messageBody":"<div id=\"ygrps-yiv-216616833\">This sounds like such a difficult situation for all of you to navigate. Some things you said recently reminded me of my own experiences. Your dh says your parenting is a rebellion against your childhood; does he see how his is too? I&#39;m not finger-pointing. For me it really helped my process when I drew my own connections between my childhood and my parenting. (yes, I was motivated, no one made me, so yeah this is tricky. I&#39;m just aiming for food for thought here). <br/>\n<br/>\nfor now, it reads to me like your dh takes his chosen role in the family very seriously, which is great, and of course sees success for his kids in this sme light: get a good job, THEN happiness ect. That is what he knows, and his love for his kids is coming through that way. My in-laws are the same, they see ONE way of proceeding in life, and as much as I disagree with them, and we do not live that way, I constantly remind myself that it is because they care about their son/us that they want this &#39;success&#39; that they believe in. Just as anyone countering our unschooling POV does so (I tell myself :)) from a place of caring, of wanting us to be happy in the way they best know it. I guess I&#39;m saying that, even though you are already trying so hard to respect him and your kids and your own process and needs, I wanted to pipe up about the pressure he puts on himself to BE this role, this authoritarian father who earns the money and thinks he&#39;s &#39;defending&#39; you by ordering the kids to listen and obey. I am guilty of this in the past, and my role was the domineering mother who RAN her home. So suggestions to the contrary to him can sound utterly scary and he has no example of what this other role looks like. <br/>\n<br/>\n<br/>\nIt sounds like you are trying to so hard and feeling like it&#39;s going nowhere. I just want to say I hear your struggles, and your dh&#39;s, and applaud you for finding that place of respect for him and trying to work it out instead of throwing your hands up thinking &#39;he&#39;s WRONG&#39;. :)</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279709806","msgId":44583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRGNTI1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":44582,"nextInTopic":44585,"prevInTime":44582,"nextInTime":44584,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"How does he feel about how he was parented? It sounds a lot like he felt very alone, left to his own devices to sort things out, which can feel really out of","messageBody":"<div id=\"ygrps-yiv-978780439\">How does he feel about how he was parented? It sounds a lot like he felt<br/>\nvery alone, left to his own devices to sort things out, which can feel<br/>\nreally out of control for a kid. And, what he&#39;s seeing/perceiving is<br/>\nthat you are trying to do the same things that his parents did which<br/>\nwere uncomfortable for him. So he&#39;s holding tighter to control, to being<br/>\nthe &#39;father role&#39; that he saw others being that seemed more secure for<br/>\ntheir families than he felt in his family. <br/>\n<br/>\n <br/>\n<br/>\nChanges of any kind can be difficult and scary. Losing control is scary<br/>\nand people in general tend to hold on tighter if they feel out of<br/>\ncontrol. Just think about how it feels if the car starts to skid and<br/>\nslide - first reaction is to hold tighter to the steering wheel, isn&#39;t<br/>\nit?<br/>\n<br/>\n <br/>\n<br/>\nDon&#39;t even try to get him to change how he interacts with the kids. You<br/>\ndo it yourself. I wouldn&#39;t even ask him to &quot;please speak more gently to<br/>\nthem&quot;. However, if he jumped in when I was in the middle of handling a<br/>\nsituation, I might say &quot;Thanks honey but I&#39;m handling this, please give<br/>\nme a moment&quot; or some such - he needs to know that you have the situation<br/>\nunder control, that it&#39;s not the chaos that it may seem when he&#39;s<br/>\nlooking at it. Know what I mean? It sounds like he&#39;s trying really hard<br/>\nto be the good father that he maybe didn&#39;t have - being a father not a<br/>\nfriend, which he equates with out of control, uncared for kids. That may<br/>\neven be part of his change in his religious beliefs - don&#39;t all &quot;good&quot;<br/>\nfathers raise their kids in some belief system? (speaking from the<br/>\npossible perception he may have there)<br/>\n<br/>\n <br/>\n<br/>\nMaybe start with (a) change how you speak to the kids but don&#39;t change<br/>\nhow he relates to the kids (b) work on communication between the two of<br/>\nyou - it sounds like there&#39;s a lot going on apart from the kids as far<br/>\nas your relationship goes.<br/>\n<br/>\n <br/>\n<br/>\n--Deb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279651418","msgId":44582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNHFvcSszb25xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyNG1raytkdnBoQGVHcm91cHMuY29tPg=="},"prevInTopic":44581,"nextInTopic":44583,"prevInTime":44581,"nextInTime":44583,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"... I found it helpful with George to give specific examples of things that worked and things that didn t. He didn t need to flounder around brainstorming with","messageBody":"<div id=\"ygrps-yiv-1035405407\">&quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;later I might say &quot;I wish we could have handled that differently.&quot; <br/>\n<br/>\n </span></blockquote>I found it helpful with George to give specific examples of things that worked and things that didn&#39;t. He didn&#39;t need to flounder around brainstorming with me ;) he needed solid information. To some extent that&#39;s a male-female thing: men tend not to want to read the theoretical stuff about parenting/learning and then try to put it into practice, instead they want to know what the strategies are. They&#39;ll still resist to some extent - that&#39;s a normal human reaction to change, but ongoing reports of &quot;this works&quot; can make a difference. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;honey, can you please just speak a little more gently to them? They seem to respond better that way.&quot;  <br/>\n<br/>\n </span></blockquote>Try &quot;I&quot; statements, those can work better. Instead of &quot;honey can You...&quot; say &quot;I&#39;ve found that when I yell, the kids yell back, but when I speak softly, they listen to me&quot; (or whatever). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;he says that&#39;s not parenting, that&#39;s being their friend<br/>\n<br/>\n </span></blockquote>Do some research into gentle discipline - that could be a good compromise. While you&#39;re at it, look into classical monetssori theory, which doesn&#39;t use punishments or rewards but has good &quot;name recognition&quot;, its over a hundred years old, and not overly associated with hippies. Those are places you may find some good middle ground. Unschooling *is* about being your child&#39;s friend, and to some extent you&#39;re not going to be able to gloss that over, but you may be able to transition through being &quot;gentle but firm&quot; to something more like a partnership, in time. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Advice please","postDate":"1279650418","msgId":44581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNHBwaStncWJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQxM0Q5MEZDMDExMTRGMzVBQjk0NzQyQTIwNjczOTdEQENvbm5pZVBDPg=="},"prevInTopic":44579,"nextInTopic":44582,"prevInTime":44580,"nextInTime":44582,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"I m not even SOLD on the idea of whole life unschooling ;) so I definitely am not trying to push that on my husband. What I m trying to do is speak more gently","messageBody":"<div id=\"ygrps-yiv-524670417\">I&#39;m not even SOLD on the idea of whole life unschooling ;) so I definitely am not trying to push that on my husband. What I&#39;m trying to do is speak more gently to my kids, because I don&#39;t like yelling at them. I&#39;m trying to give them more choices because I realize how much having controlling parents messed me up. I&#39;ve tried explaining this to my husband. By the way, his household was almost like being unschooled except for they went to school. His parents had very few rules and punishments. The kids were allowed to cuss, eat what they wanted, do what they wanted, without to much interference from the parents. Mine was the exact opposite. I once got grounded because my dad didn&#39;t like the way I cut my hair, I&#39;m not making this crap up! My dad eventually embraced my unique (or colorful as he puts it) personality and even got defensive when others made fun of me. So it is strange to see that he parents the way my parents did, and I want to parent more the way his did. His parenting style is directly from super nanny, exactly the way my mom is, she even gave me the book, LOL!<br/>\n<br/>\nWe have talked about what we both want for the kids. I want them to be happy fulfilled individuals, whether that means they have good paying jobs or not. He wants them to have good paying jobs and be successful and happy. Our daughter wants a job working with animals but he tries to encourage her away from that because those jobs typically don&#39;t pay much. <br/>\n<br/>\nSure he can send them to their rooms and scream and yell at them, he has just as much right to parent the way he wants as I do. However, expecting me to do the same seems just as controlling as what you&#39;re saying I&#39;m trying to do. I have discussed with him that I don&#39;t want to talk to the kids like that anymore, that I&#39;ve tried to picture what I look like when I&#39;m yelling and angry and I don&#39;t like it, and that&#39;s the reason I want to change. I am VERY nice to him, I don&#39;t know how it can come off like I&#39;m not. I do everything he asks of me, laundry, dinner, be a stay at home parent (this is why I&#39;m trying to find a better way to interact with them, which I&#39;ve tried to explain. He wants me to be a stay at home mom, but I can&#39;t do that if I have to continue on the way it&#39;s been, with constant arguing.) I don&#39;t push my unschooling agenda on him because I don&#39;t have one. As I said earlier, I&#39;m not completely sold on the idea, but I&#39;m trying to parent more gently and live by principles rather than rules. I&#39;m trying to go slowly, changing the way I speak to everyone first. I&#39;m hardly throwing caution to the wind and diving in head first. It&#39;s like he WANTS me to yell or he doesn&#39;t think I care. I&#39;ve asked to go to counseling but he doesn&#39;t see the need for it. I&#39;m going to start going by myself. He sees this type of parenting as a rebellion against the way I was raised and I&#39;d have to agree. Of course I don&#39;t want to raise my kids the way I was raised, I&#39;m too afraid of making decisions, because I&#39;ve never had to, and when I&#39;ve ever tried too either my parents or now my husband like to belittle me and look down their nose at me. I don&#39;t want my kids to be afraid of making decisions. Why would I want to set them up to have those same feelings?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;otherstar&quot; &lt;otherstar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  &gt;&gt;&gt;No unschooling doesn&#39;t mean more to me than my relationship with my husband.&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Then perhaps you need to take a step back and let go of the idea of whole life unschooling. Maybe you can do it in increments. Is he comfortable not having a curriculum? What limits does he feel are absolutely necessary? Have you talked about what limits he thinks are absolutely necessary? Have you asked him which areas he is willing to relax? Have you asked him about his childhood and how he felt about rules? What kind of childhood did he have? What were some things that he really loved as a child? What are some of the things that he hated as a child? What does he want? What are his ideas? Have you asked him what his ideas and goals are? What does parenting mean to him? Have you sat and actually listened to him and asked him for his point of view? There is a good chance that you both want the same thing. <br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;When I try to gently parent he accuses me of not parenting and instead trying to be my kids friend.&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Have you asked him why being their friend is a problem? It is not uncommon for mainstream parents to have a problem with parents and children being friends. I think more people in the world hold his view than yours. It doesn&#39;t matter but that is often used as reason. <br/>\n&gt; <br/>\n&gt;  &gt;&gt;&gt;If I&#39;m trying to wait and see if the kids can settle an argument on their own before I intervene, he again accuses me of not parenting.&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Is it possible to intervene right away but do it gently? <br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;By gently parenting, I mean that I&#39;m trying to figure out why the kids are acting out, instead of just scolding them and sending them to their room. I like to listen to their reasons for their behavior, he likes to just send them to their room when their fighting, no questions asked and no reasons listened to.&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Maybe you can let him send them to their room but then you can follow up with him and find out why he sent them to their room. Then, you can follow up with the kids and talk to them about it. <br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;I can change myself, but that seems to be the problem. The fact that I AM changing and he doesn&#39;t want me to.&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Why would he want you to change? It sounds like you are trying to control his relationship with the kids and micromanage how he chooses to parent. If you could change and internalize the the basic principles of unschooling and apply them to your relationship with him, then you would be a lot nicer to him and would actually listen to him without trying to provide counter arguments for everything that he says and does. He probably sees unschooling as some kind of weird cult that makes wives be mean to their husbands while handing complete control of everything to the kids. : -)<br/>\n&gt; <br/>\n&gt; It sounds like you use pretty much every opportunity to push your unschooling agenda onto your husband. I have always been of the opinion that you need to work on unschooling in your relationship with your spouse before ever trying it with the kids. That was a big aha moment for me. If you can&#39;t trust and empower your husband, how is it possible to trust and empower your kids? When you try to take power away from your husband so that you can give it to the kids, all that is creating is a power struggle that will not have a good outcome for anybody involved. <br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;I&#39;m fine with the kids having a bed time, my husband is a very light sleeper and all our rooms are on the second floor of the house, so the kids are allowed to watch a movie in their room or play their hand held games, but they need to stay in their room after 9pm. I do try to understand his point of view but at the same time, I&#39;m not going to adopt it.&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; I am sure that he feels the same way. There is no way he is ever going to adopt your point of view. He has a lot of examples of parenting his way to hold up as an example. Has he ever seen any real unschoolers? You are both so stubborn and emotionally invested in being right that neither of you are willing to budge. What would happen if you let things rest for a while and tried to be nicer to him and tried to ask his opinion more? What would happen if you actually gave him an opportunity to share his point of view without you arguing about it?<br/>\n&gt; <br/>\n&gt; Connie<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279647188","msgId":44579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNG1raytkdnBoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwZjYwMWNiMjgwZiQ3N2QwMjAyMCQ2NzcwNjA2MCRAdXM+"},"prevInTopic":44578,"nextInTopic":44581,"prevInTime":44578,"nextInTime":44580,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Funny you should mention marrying an atheist who then finds religion, LOL! That is yet another of our problems. When I was younger I was forced to go to","messageBody":"<div id=\"ygrps-yiv-529513782\">Funny you should mention marrying an atheist who then finds religion, LOL! That is yet another of our problems. When I was younger I was forced to go to church. We&#39;ve been together since I was 15 so he was there during that time. He was an atheist, I was the church girl. Along the way I&#39;ve come to the conclusion that I don&#39;t want religion in my life and he has &quot;found&quot; religion. Just yesterday he jumped all over me and my &quot;pagan&quot; change. I&#39;m 31 years old, and I feel like he wants me to be exactly the same as when I was 15. I have obviously changed from that time, as I think most people are not the exact same as they were as teenagers. I don&#39;t have a problem with him being religious, he doesn&#39;t go to church, or try to get me to go, he never even talks about it. I start to get the feeling that he just finds things that are different from me and my beliefs and focuses on them to start a fight with me. I&#39;m honestly so confused right now. <br/>\n<br/>\nAlso, I don&#39;t really talk about unschooling. I have just tried to go from the screaming and &quot;go to your room!&quot; type of parenting, to a more understanding, gentle way of parenting. I feel like people on here act as if I&#39;m controlling my husband but this is what it looks like in my home: Kids are fighting and I&#39;m trying to settle things down and he jumps in with &quot;Don&#39;t argue with your mother!!! Now go to your room!&quot; I don&#39;t say another word, later I might say &quot;I wish we could have handled that differently.&quot; His response is usually something along this line: &quot; Yeah? Like how? You&#39;re trying to negotiate with them instead of being a parent&quot; I will try to explain that &quot;I&#39;m trying to find out how a fight started so that everyone can explain their side&quot;  His  response to the 3 year old crying is usually to yell at one of the older kids because he assumes they must have done something to provoke her. That immediately puts the older two on the defensive. It seems to be the very fact that I&#39;m changing my interactions with them that pisses him off. I&#39;ve tried saying &quot;honey, can you please just speak a little more gently to them? They seem to respond better that way.&quot;  I don&#39;t see that as trying to control his interactions with his kids, just helping him get the response from the kids that he wants. He&#39;s asked for suggestions on what he could do better, but then when I&#39;ve mentioned the things I&#39;ve tried, he says that&#39;s not parenting, that&#39;s being their friend. UGH!! Things will work out one way or another I guess.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Amanda Mayan&quot; &lt;amanda@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Sometimes, once people dig their heels in with an idea, it&#39;s hard to let<br/>\n&gt; go.you are probably both experiencing this in divergent ways. Maybe drop the<br/>\n&gt; whole idea of unschooling (books, discussions, ect) for a while.so that he&#39;s<br/>\n&gt; not feeling so threatened by it. At the same time, in places where you can<br/>\n&gt; alter your interaction with your children (towards an interaction that feels<br/>\n&gt; good for you, unschooling or otherwise), that will not rile him, you can do<br/>\n&gt; so. Once things are calmer (as in months from now) you can very gently and<br/>\n&gt; slowly continue on a path that works for both of you..without titling it as<br/>\n&gt; &quot;unschooling&quot;. <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;  If you are already unschooling &quot;academically&quot; you&#39;ve probably already<br/>\n&gt; achieved a lot (in terms of him compromising).if not, how is the learning<br/>\n&gt; situation now? Maybe that can be a bit more relaxed than before.but be sure<br/>\n&gt; to include him in what the kids are learning, interested in, ect.(you can<br/>\n&gt; find posts in the archives about &quot;school speak&quot; to translate unschooling<br/>\n&gt; activities and how to talk to grandparents ect about &quot;what the kids are<br/>\n&gt; learning&quot;)<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Remember, your husband was probably happy with the way things were, you&#39;re<br/>\n&gt; the one that&#39;s changing and he&#39;s got a certain right to be upset about that<br/>\n&gt; (imagine marrying an atheist who then finds religion)..not that change is<br/>\n&gt; not good, and necessary.of course there is always room for improvement as a<br/>\n&gt; human, but as he may see it.you&#39;ve now converted and are trying to drag him<br/>\n&gt; along, when he didn&#39;t feel like there was anything wrong in the first place.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Also, couples counseling can sometimes help.maybe this is not really about<br/>\n&gt; the unschooling, but another issue you&#39;re not even realizing? Lastly, &quot;adult<br/>\n&gt; time&quot; can really help ease these transitions sometimes!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":201683594,"authorName":"LR","from":"&quot;LR&quot; &lt;zanyzingzap@...&gt;","profile":"zanyzingzap","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Advice please","postDate":"1279638790","msgId":44578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmUwMWNiMjgxZSQxMTQ2ZTVhMCQzM2Q0YjBlMCRAY29tPg=="},"prevInTopic":44577,"nextInTopic":44579,"prevInTime":44577,"nextInTime":44579,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"I am not used to answering questions on here, I am still learning so if I fumble please understand I have the best intentions. There have been a lot of great","messageBody":"<div id=\"ygrps-yiv-428762541\">I am not used to answering questions on here, I am still learning so if I<br/>\nfumble please understand I have the best intentions. There have been a lot<br/>\nof great points made so far. especially about unschooling the partnership<br/>\nwith your husband. That was a big eye opener for me at the beginning.<br/>\nFinding out what common goals partners have is a great way to get a<br/>\nconversation going. It means being allies instead of adversaries. <br/>\n<br/>\n <br/>\n<br/>\nUnconditional compassion goes a long way in my experience. For yourself, for<br/>\nyour husband, and especially for your children. You all deserve to have<br/>\nthose around you hold you in unconditional compassion. This is not ideas<br/>\nthat are known at large and it is a major shift from much of the folks<br/>\naround us. It&#39;s a challenge to change how our lives are handled when our<br/>\nlives have been a certain way. Sometimes this leap seems so different from<br/>\nthe point of view of the person who didn&#39;t &quot;discover&quot; it. It can be<br/>\nunsettling to have how things have been done up till now, to have how one&#39;s<br/>\nown parents handled their children to be questioned. Is he seeing these<br/>\nchanges as judgment? It took our extended family longer to let go of their<br/>\nideas. And some still haven&#39;t but my son is old enough now that it isn&#39;t<br/>\nsuch a big deal, we have the benefit of living far enough away to be left to<br/>\nour own. BUT with everything I have done differently as a parent, there have<br/>\nbeen times where I realized they took the changes we were making as a<br/>\njudgment of their own ways. When I am centered I am able to stay in a place<br/>\nof compassion with them and gently remind them I have no judgment for them,<br/>\nI have more access to information than they ever did and I know they did the<br/>\nbest they could with the information they had. Luckily, my parents get that<br/>\npart and while my mom is still uncertain about the no formal schoolwork<br/>\nthing, she sees how my son is and the joy he has in his life and she knows<br/>\nthat is a good thing. <br/>\n<br/>\n <br/>\n<br/>\nI think too leaving room for grieving is important. For some people moving<br/>\ninto unschooling (or any alternative parenting) too quickly seems to trigger<br/>\nimmense guilt and grief over all they realize they did not get from their<br/>\nown families whether that recognition is conscious or not. Trying to move<br/>\ntoo quickly into unschooling may be unnerving defenses against something<br/>\nfrom the past. We had a little of that from my husband. I had a less<br/>\ndifficult time with looking at those issues and facing them because I was<br/>\nthe one who started the movement toward unschooling. It took my husband a<br/>\nlittle longer, though he adapted pretty readily when we really examined the<br/>\nalternatives. <br/>\n<br/>\n <br/>\n<br/>\nCould you start a conversation with what goals you both have as parents for<br/>\nyour children? Ask him what he wants for the children? I think we (my<br/>\nhusband and I) have the benefit of finally really seeing the results of<br/>\nyelling and punishment based parenting around us, as well as our own<br/>\nexperiences with it from our parents. It was easier to point out the cause<br/>\nand effect that we were seeing by observing other families. We recognized<br/>\neveryone is different but at the same time we saw pretty consistent things<br/>\nabout the families we observed. Namely that the yelling and threats and<br/>\npunishments only left everyone feeling bad and that they really didn&#39;t work<br/>\nthe way the parents intended. That opened the door to look at alternatives.<br/>\nWe wanted more joy, truly heartfelt joy, than that. We certainly don&#39;t have<br/>\nperfection cornered but it&#39;s getting better all the time. <br/>\n<br/>\n <br/>\n<br/>\nIf he indicates he is open to ideas, what if you frame ideas in something<br/>\nother than unschooling? Even on military bases most of the family advocacy<br/>\nand family support groups are offering pamphlets/books/classes on parenting<br/>\nthat, while not unschooling, are much more compatible to being a stepping<br/>\nstone, getting away from yelling and punishments. There are books out there<br/>\nabout positive discipline (Jane Nelson) and about family life that are not<br/>\nunschooling but do approach the why&#39;s and how&#39;s of having less tension in<br/>\nthe family. I have a copy of &quot;Kids Learn What They Live&quot; that I got from<br/>\nfamily advocacy when my son was born- it&#39;s a pretty powerful poem. Since he<br/>\nis a former military guy, what if you touch base with military OneSource?<br/>\nThey have some articles that are not unschooling but encourage gentler<br/>\nparenting. Baby steps, you know? Maybe coming from a military endorsed<br/>\nsource some of the ideas will seem less far- fetched. It&#39;s all a process. <br/>\n<br/>\n <br/>\n<br/>\nGood luck! <br/>\n<br/>\nLisaR<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":351836297,"authorName":"Amanda Mayan","from":"&quot;Amanda Mayan&quot; &lt;amanda@...&gt;","profile":"amandabpearl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279632519","msgId":44576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjYwMWNiMjgwZiQ3N2QwMjAyMCQ2NzcwNjA2MCRAdXM+"},"prevInTopic":44575,"nextInTopic":44577,"prevInTime":44575,"nextInTime":44577,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Sometimes, once people dig their heels in with an idea, it s hard to let go.you are probably both experiencing this in divergent ways. Maybe drop the whole","messageBody":"<div id=\"ygrps-yiv-776267645\">Sometimes, once people dig their heels in with an idea, it&#39;s hard to let<br/>\ngo.you are probably both experiencing this in divergent ways. Maybe drop the<br/>\nwhole idea of unschooling (books, discussions, ect) for a while.so that he&#39;s<br/>\nnot feeling so threatened by it. At the same time, in places where you can<br/>\nalter your interaction with your children (towards an interaction that feels<br/>\ngood for you, unschooling or otherwise), that will not rile him, you can do<br/>\nso. Once things are calmer (as in months from now) you can very gently and<br/>\nslowly continue on a path that works for both of you..without titling it as<br/>\n&quot;unschooling&quot;. <br/>\n<br/>\n <br/>\n<br/>\n If you are already unschooling &quot;academically&quot; you&#39;ve probably already<br/>\nachieved a lot (in terms of him compromising).if not, how is the learning<br/>\nsituation now? Maybe that can be a bit more relaxed than before.but be sure<br/>\nto include him in what the kids are learning, interested in, ect.(you can<br/>\nfind posts in the archives about &quot;school speak&quot; to translate unschooling<br/>\nactivities and how to talk to grandparents ect about &quot;what the kids are<br/>\nlearning&quot;)<br/>\n<br/>\n <br/>\n<br/>\nRemember, your husband was probably happy with the way things were, you&#39;re<br/>\nthe one that&#39;s changing and he&#39;s got a certain right to be upset about that<br/>\n(imagine marrying an atheist who then finds religion)..not that change is<br/>\nnot good, and necessary.of course there is always room for improvement as a<br/>\nhuman, but as he may see it.you&#39;ve now converted and are trying to drag him<br/>\nalong, when he didn&#39;t feel like there was anything wrong in the first place.<br/>\n<br/>\n <br/>\n<br/>\nAlso, couples counseling can sometimes help.maybe this is not really about<br/>\nthe unschooling, but another issue you&#39;re not even realizing? Lastly, &quot;adult<br/>\ntime&quot; can really help ease these transitions sometimes!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12742563,"authorName":"bnforgiven","from":"&quot;bnforgiven&quot; &lt;bnforgiven@...&gt;","profile":"bnforgiven","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279631188","msgId":44577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNDcwaytxOTgzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyNDE1ZytsOXFhQGVHcm91cHMuY29tPg=="},"prevInTopic":44576,"nextInTopic":44578,"prevInTime":44576,"nextInTime":44578,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Elli - Wow that sounds amazing!!! And I loved your perspective on the principles and practical ways to implement them. Very helpful for me right now too :) ","messageBody":"<div id=\"ygrps-yiv-2055751504\">Elli - Wow that sounds amazing!!!<br/>\nAnd I loved your perspective on the principles and practical ways to implement them. Very helpful for me right now too :)<br/>\n<br/>\n<br/>\nSarah - <br/>\nWhat came to my mind when reading about your husband, is to focus on &quot;loving/healing&quot; him. Not being controlling at all but loving him. He does have a reason to be acting the way he is. But the question is, why? Is it his upbringing? Is it him watching another child grow up out of control and he thinks of that as unschooling? Or is it having to do with things he has been through and witnessed in the military. He has been through alot and control may be his way of staying in control of himself. He may be mentally going through ALOT of stress that he hasn&#39;t shared with anyone. He may be afraid of letting go, loosing it, loosing his job, loosing himself, etc, so he needs some love and support. You changing his &quot;routine&quot; is threatening to him and his mindset, but finding out why will start the ball rolling. And I would NOT push him, just be with him. Explain to him you may still disagree, but your marriage is most important (if it is). Just changing you internal frame of mind can change situations. Just letting go so to speak instead of being angry. Love. I have seen it work. But with that said, I do believe unschooling or anything similar can bring out rifts in marriages that should not have been in the first place. I am not saying that is the case with you but he may take a LONG time to change and you need to be aware of that and decide what if it takes 10 yrs, what will you do, without making yourself worry about it everyday? :)<br/>\n<br/>\nEven my rather easy going hubby isn&#39;t keen on unschooling as much as I am. And this week I refused to budge. But when I woke the next morning I realized my husband is SOOOoo much like my son that my hubby may be right. My son may need a bit more structure schoolwise, or just in general. It won&#39;t be forced on him but my very adaptable, free, outspoken (mostly unschooled just by instinct up to this point) child even asked for mealtimes in the last 3 months. I think our life, which has included moving ALOT in his short life has left him needing some security. We both work at home but that hasn&#39;t always been enough. He actually transitions better when there are some routines (not rules). My hubby wants to see &quot;real&quot; schooling now that my son is 6 and legally in school so to speak. He did not agree with me when I tried to tell him my thoughts - I did not even mention the word unschooling! During the discussion that night, I think I just needed to feel that I was right, that I had stood my ground for me and my son. No voices were raised and I was in shock that he just sat there. We both let the discussion die with us not even agreeing at the end, but we were calm the whole time. He is normally more uptight/stressed (but flexible as we both bore easily), but he is not military. I realized it would take more time to figure this whole thing out. I also realized I too had been yelling too much as I slaved over the &#39;net trying to &quot;help&quot; us, lol. In my mind I see it all as a balancing game. Life kinda is in my opinion.<br/>\n <br/>\nJust this week I realized why my son hated to color or write or draw. For years we lived in very expensive houses that were always for sale, yet we did not own them. It made us very uptight and we took away all writing/coloring items. He could have them anytime he asked, but I monitored it, and he rarely asked. It&#39;s no wonder my son freaked out when he was asked to color or write his name. He was old enough he should have been able to do it quite well and he knew it! So he was frustrated so much that he shut down. He saw others doing better than he did. He has always had that need to be perfect right away and a lack of patience even as a baby, but this only fueled the issue. So this week I made him his own &quot;art&quot; table with Shrinky Dinks, Coloring pencils, markers, paper and crayons. I told him it was there and held my tongue. I was trying not to force my enthusiasm on him. And a few days later, I found him happily doing Shrinky Dinks all on his own! A few times I had to encourage him when he wanted me to do it and thought he couldn&#39;t. Each time I saw a light bulb go off in his head and he realized he could do it. I just explain how he could do it and why I thought he could. If he still had said no, I would have gladly helped! It involved &quot;reading&quot; him and knowing what to say when. Now he is hooked on them and we are going to start making Pokemon &quot;Wind&quot; Mobiles for his room. I thought he would NEVER EVER enjoy coloring. Well, I hoped he would and knew it was possible, but really did not know when it would take place. It was mostly a hope in this &quot;unschooling&quot; thing in my mind, lol. And it just took me, finding a way to help &quot;unlock&quot; him. He had been willing the whole time. I was the one who had started the locking down on his creativity at age 3 when he colored on the walls with a pen that would not come off even with Magic Eraser. If I had just found the &quot;key&quot; sooner maybe he would have reached this point sooner. I say this because it may be similar with your husband. Don&#39;t push and seek the key. Until you find it, aggervating him may make things worse. Patience isn&#39;t the same thing as giving up. It is having hope, looking, thinking, seeking, supporting and trusting.  It can also mean appologizing. <br/>\n<br/>\nIf I were you, I would definitely get my hands on as many books as I could too. And not just on homeschooling, but learning to resolve issues with you and your husband, because (I am just assuming here so don&#39;t shoot me!) I am sure you two do not properly communicate anyway. If you are like me, your issues have always been there and this new &quot;venture&quot; has brought it to the foreground. But only you know what is going on and I may be totally off base!!!<br/>\n<br/>\nAnd for me, just a few years ago around Mother&#39;s Day I thought my hubby and I may need to separate or something. I was at the end of my ropes. I kept thinking he was the one with the issues and I was doing what was &quot;right&quot; and did nothing wrong. I had developed new friends. They were great but my hubby was loosing me to them. He lost me to books. He saw me changing and it FREAKED him out. He had been married 2 times before me and he thought I was going to leave him and so he pushed me &quot;out&quot; so to speak. He put mandates on my friendships (which was new!). I tested it and didn&#39;t just try to work it out with him. I asked others. And while they gave sage advice, they were not on the inside. They did not know why he was acting the way he was. And to this day I still can&#39;t be close friends with one person because I know it will cause him too much stress. It is his issue, but it is also mine. I pushed too hard. I tried to control him and I looked to outside sources for help instead of loving him and trusting him as I always had. And while I was seeking a better me, I ignored him and my son, all the while I thought I was doing more for them both. But if that is what my husband saw and felt, then in a way it is what happened. So I had to find a way to please us all cause our marriage is the best thing that has happened to me in my entire life. He is my best friend and he felt threatened.  Sometimes we seek wisdom from books/people and neglect those around us, so when I said I would read, read, read earlier.... I think I would but I wouldn&#39;t let it consume you too much. Find the balance in growing yourself, and changing yourself and changing those around you. They see something alot different than you see sometimes. :)<br/>\n<br/>\n<br/>\nOne last thought that came to me was to get away with hubby, without the kids. Reconnect with him. Focus on him. Listen, listen, listen. I would not talk about schooling, and maybe not even the children. Focus on his goals, dreams, fears, etc. Reconnect and find that love you both once had, however you can, then go slowly from there. Just because you are a race horse, doesn&#39;t mean he is!<br/>\n<br/>\n<br/>\nHope you all work it out. hopefully I made some sense.<br/>\n<br/>\nPeace, Love and JOY!<br/>\nHeather<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Sarah -<br/>\n&gt; <br/>\n&gt; I LOVE this question!!!  I experienced something similar in my marriage at the start of radical unschooling.  My hubby was terrified!  He wondered if I was going crazy, taking the kids out of school, not teaching them, letting them stay up all night if they wanted to and sleep in all day if that&#39;s what their bodies desired.  He really struggled and so did I as I tried to communicate with him.  <br/>\n&gt; <br/>\n&gt; He also used to yell a lot at the kids and sometimes even at me.  In a fit of rage he might pick up a kid and toss him on a bed while yelling at the same time.  Yikes!  Scary.  But, like a frog who doesn&#39;t realize the pot of water has gotten hot, after 12 years of marriage I was in boiling water and didn&#39;t know it.<br/>\n&gt; <br/>\n&gt; I am happy to say that we are still married and he is a completely different man/father/husband now.  He rarely yells and never uses physical force.  He loves radical unschooling and feels proud about the leadership I take in our marriage to bring fresh ideas for healing and growth.<br/>\n&gt; <br/>\n&gt; I&#39;ve changed too!  I used to be controlling.  I knew what was right and I was going to let him know, right in front of the kids.  I knew how he should handle everything and judged his actions.<br/>\n&gt; <br/>\n&gt; One of the things I did that helped me was to talk to him and the kids about the idea of living by principles rather than rules.  Rules don&#39;t fit everyone in the same way.  &quot;No music after 8 pm&quot; is a rule that might work for someone who has to get up early in the morning and needs a full night of sleep.  The same rule wouldn&#39;t make sense for a family that enjoys late night tv watching together, although, maybe it would if the music disturbed the TV watching experience.  However, the principle of &quot;Our family treats everyone with kindness and respect.&quot; might lead one to turn down the music or wear earphones if someone in the family tells you the he needs a full night of sleep that particular night and the music is disturbing him.  Or the same principle might allow for a discussion between family members about whether tonight was a good night for loud music.  In fact, that conversation might lead to a decision to dance together in the living room.  You and your family might end the night dancing, laughing, refreshed and ready for an even better night&#39;s sleep.<br/>\n&gt; <br/>\n&gt; So I wrote our family principles on our dry erase board (which is also where we all write our desires and to-do list and where we track our schedule for the week.)<br/>\n&gt; <br/>\n&gt; Our principles are simple:<br/>\n&gt; <br/>\n&gt; Kindness and Respect<br/>\n&gt; Encouragement and Understanding<br/>\n&gt; <br/>\n&gt; When we are struggling with each other I try my best to reflect on our principles and bring those into the conversation.  &quot;Your sister likes her privacy.  She wants you to knock on her door and ask for permission to enter.  She will let you know if you may come in.  She would feel respected if you did that.&quot;  &quot;Your brother is working hard to change his behavior.  He is trying to remember to knock on your door.  When anyone is changing habits it takes time.  Please speak to him with kindness and respect when he forgets.  And, be patient - he needs your understanding and encouragement.&quot;  Voila, six months later, Peter knocks and most times Sophia invites him in to visit.  When she doesn&#39;t invite him in, he respectfully waits at her door or goes to find something else to do.<br/>\n&gt; <br/>\n&gt; There have been nights that I spent time unraveling a situation between hubby, daughter, and son.  I would go to each of them and speak kindly and respectfully to them, seeking understanding by asking for their perspective and feelings.  Then I would encourage them to receive communication from the other person and to do so with an attitude of kindness and respect.  &quot;Sophia recognizes that she yelled at you.  She wants to apologize to you.  Are you willing to listen to her?&quot;  <br/>\n&gt; <br/>\n&gt; Hubby and I took a big leap forward after attending Retrouvaille this summer...we were on the verge of divorce and this program, which I discovered through another unschooling/marriage group, saved our relationship...but that&#39;s another discussion....<br/>\n&gt; <br/>\n&gt; Good luck!<br/>\n&gt; <br/>\n&gt; Love,<br/>\n&gt; <br/>\n&gt; Elli<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279625200","msgId":44575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNDE1ZytsOXFhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg=="},"prevInTopic":44574,"nextInTopic":44576,"prevInTime":44574,"nextInTime":44576,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Sarah - I LOVE this question!!!  I experienced something similar in my marriage at the start of radical unschooling.  My hubby was terrified!  He wondered if I","messageBody":"<div id=\"ygrps-yiv-281648774\">Sarah -<br/>\n<br/>\nI LOVE this question!!!  I experienced something similar in my marriage at the start of radical unschooling.  My hubby was terrified!  He wondered if I was going crazy, taking the kids out of school, not teaching them, letting them stay up all night if they wanted to and sleep in all day if that&#39;s what their bodies desired.  He really struggled and so did I as I tried to communicate with him.  <br/>\n<br/>\nHe also used to yell a lot at the kids and sometimes even at me.  In a fit of rage he might pick up a kid and toss him on a bed while yelling at the same time.  Yikes!  Scary.  But, like a frog who doesn&#39;t realize the pot of water has gotten hot, after 12 years of marriage I was in boiling water and didn&#39;t know it.<br/>\n<br/>\nI am happy to say that we are still married and he is a completely different man/father/husband now.  He rarely yells and never uses physical force.  He loves radical unschooling and feels proud about the leadership I take in our marriage to bring fresh ideas for healing and growth.<br/>\n<br/>\nI&#39;ve changed too!  I used to be controlling.  I knew what was right and I was going to let him know, right in front of the kids.  I knew how he should handle everything and judged his actions.<br/>\n<br/>\nOne of the things I did that helped me was to talk to him and the kids about the idea of living by principles rather than rules.  Rules don&#39;t fit everyone in the same way.  &quot;No music after 8 pm&quot; is a rule that might work for someone who has to get up early in the morning and needs a full night of sleep.  The same rule wouldn&#39;t make sense for a family that enjoys late night tv watching together, although, maybe it would if the music disturbed the TV watching experience.  However, the principle of &quot;Our family treats everyone with kindness and respect.&quot; might lead one to turn down the music or wear earphones if someone in the family tells you the he needs a full night of sleep that particular night and the music is disturbing him.  Or the same principle might allow for a discussion between family members about whether tonight was a good night for loud music.  In fact, that conversation might lead to a decision to dance together in the living room.  You and your family might end the night dancing, laughing, refreshed and ready for an even better night&#39;s sleep.<br/>\n<br/>\nSo I wrote our family principles on our dry erase board (which is also where we all write our desires and to-do list and where we track our schedule for the week.)<br/>\n<br/>\nOur principles are simple:<br/>\n<br/>\nKindness and Respect<br/>\nEncouragement and Understanding<br/>\n<br/>\nWhen we are struggling with each other I try my best to reflect on our principles and bring those into the conversation.  &quot;Your sister likes her privacy.  She wants you to knock on her door and ask for permission to enter.  She will let you know if you may come in.  She would feel respected if you did that.&quot;  &quot;Your brother is working hard to change his behavior.  He is trying to remember to knock on your door.  When anyone is changing habits it takes time.  Please speak to him with kindness and respect when he forgets.  And, be patient - he needs your understanding and encouragement.&quot;  Voila, six months later, Peter knocks and most times Sophia invites him in to visit.  When she doesn&#39;t invite him in, he respectfully waits at her door or goes to find something else to do.<br/>\n<br/>\nThere have been nights that I spent time unraveling a situation between hubby, daughter, and son.  I would go to each of them and speak kindly and respectfully to them, seeking understanding by asking for their perspective and feelings.  Then I would encourage them to receive communication from the other person and to do so with an attitude of kindness and respect.  &quot;Sophia recognizes that she yelled at you.  She wants to apologize to you.  Are you willing to listen to her?&quot;  <br/>\n<br/>\nHubby and I took a big leap forward after attending Retrouvaille this summer...we were on the verge of divorce and this program, which I discovered through another unschooling/marriage group, saved our relationship...but that&#39;s another discussion....<br/>\n<br/>\nGood luck!<br/>\n<br/>\nLove,<br/>\n<br/>\nElli</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Advice please","postDate":"1279596095","msgId":44574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxM0Q5MEZDMDExMTRGMzVBQjk0NzQyQTIwNjczOTdEQENvbm5pZVBDPg==","inReplyToHeader":"PGkyMmp1aytoOGo5QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMmp1aytoOGo5QGVHcm91cHMuY29tPg=="},"prevInTopic":44572,"nextInTopic":44575,"prevInTime":44573,"nextInTime":44575,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"... Then perhaps you need to take a step back and let go of the idea of whole life unschooling. Maybe you can do it in increments. Is he comfortable not having","messageBody":"<div id=\"ygrps-yiv-1270993313\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;No unschooling doesn&#39;t mean more to me than my relationship with my husband.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Then perhaps you need to take a step back and let go of the idea of whole life unschooling. Maybe you can do it in increments. Is he comfortable not having a curriculum? What limits does he feel are absolutely necessary? Have you talked about what limits he thinks are absolutely necessary? Have you asked him which areas he is willing to relax? Have you asked him about his childhood and how he felt about rules? What kind of childhood did he have? What were some things that he really loved as a child? What are some of the things that he hated as a child? What does he want? What are his ideas? Have you asked him what his ideas and goals are? What does parenting mean to him? Have you sat and actually listened to him and asked him for his point of view? There is a good chance that you both want the same thing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;When I try to gently parent he accuses me of not parenting and instead trying to be my kids friend.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Have you asked him why being their friend is a problem? It is not uncommon for mainstream parents to have a problem with parents and children being friends. I think more people in the world hold his view than yours. It doesn&#39;t matter but that is often used as reason. <br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;If I&#39;m trying to wait and see if the kids can settle an argument on their own before I intervene, he again accuses me of not parenting.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Is it possible to intervene right away but do it gently? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;By gently parenting, I mean that I&#39;m trying to figure out why the kids are acting out, instead of just scolding them and sending them to their room. I like to listen to their reasons for their behavior, he likes to just send them to their room when their fighting, no questions asked and no reasons listened to.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Maybe you can let him send them to their room but then you can follow up with him and find out why he sent them to their room. Then, you can follow up with the kids and talk to them about it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I can change myself, but that seems to be the problem. The fact that I AM changing and he doesn&#39;t want me to.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why would he want you to change? It sounds like you are trying to control his relationship with the kids and micromanage how he chooses to parent. If you could change and internalize the the basic principles of unschooling and apply them to your relationship with him, then you would be a lot nicer to him and would actually listen to him without trying to provide counter arguments for everything that he says and does. He probably sees unschooling as some kind of weird cult that makes wives be mean to their husbands while handing complete control of everything to the kids. : -)<br/>\n<br/>\nIt sounds like you use pretty much every opportunity to push your unschooling agenda onto your husband. I have always been of the opinion that you need to work on unschooling in your relationship with your spouse before ever trying it with the kids. That was a big aha moment for me. If you can&#39;t trust and empower your husband, how is it possible to trust and empower your kids? When you try to take power away from your husband so that you can give it to the kids, all that is creating is a power struggle that will not have a good outcome for anybody involved. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I&#39;m fine with the kids having a bed time, my husband is a very light sleeper and all our rooms are on the second floor of the house, so the kids are allowed to watch a movie in their room or play their hand held games, but they need to stay in their room after 9pm. I do try to understand his point of view but at the same time, I&#39;m not going to adopt it.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I am sure that he feels the same way. There is no way he is ever going to adopt your point of view. He has a lot of examples of parenting his way to hold up as an example. Has he ever seen any real unschoolers? You are both so stubborn and emotionally invested in being right that neither of you are willing to budge. What would happen if you let things rest for a while and tried to be nicer to him and tried to ask his opinion more? What would happen if you actually gave him an opportunity to share his point of view without you arguing about it?<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Advice please","postDate":"1279588725","msgId":44572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMnRobCs1aGowQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI5ODY4QzUxRjEwODQwMTBCNEQ2MDcwOUYwODExM0RCQFBIUFZpZGVvVkFJTz4="},"prevInTopic":44571,"nextInTopic":44574,"prevInTime":44571,"nextInTime":44573,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"~~The best you can do is ask him by speaking gently to him. You can be sweet and kind to him and hope he does the same for the kids. You can t make him do","messageBody":"<div id=\"ygrps-yiv-672821996\">~~The best you can do is ask him by speaking gently to him. You can be sweet and kind to him and hope he does the same for the kids. You can&#39;t make him do anything. You can&#39;t control him and the more you try the more likely you&#39;ll end up divorced. ~~<br/>\n<br/>\n<br/>\nThis is true and good advice.<br/>\n<br/>\n One thing I&#39;d do when my husband was more uptight years ago, is step in and try helping the kids when he was getting upset with them. I&#39;d just stay calm and talk to them gently, maybe even say &quot;I&#39;ve got this&quot; if he was really mad. He&#39;d sometimes just stomp off but we could talk later and I&#39;d explain that we can deal with whatever issue was bothering him exactly the same in calm and respectful tones. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Advice please","postDate":"1279584182","msgId":44570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1NTU3Q0JBLTIzMjYtNDg0RS1CNDY3LUNDRUZEQjQ5NjMzN0BnbWFpbC5jb20+","inReplyToHeader":"PGkyMm85MSsydnVnQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMm85MSsydnVnQGVHcm91cHMuY29tPg=="},"prevInTopic":44569,"nextInTopic":44571,"prevInTime":44569,"nextInTime":44571,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Nope, not offended just giving some more information. Faith Sent from my iPhone ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-520664948\">Nope, not offended just giving some more information.<br/>\n<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 19, 2010, at 7:48 PM, &quot;sarahrandom78&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bdb1978@...\">bdb1978@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I hope you didn&#39;t think I was putting down the article in any way,  <br/>\n&gt; shape or form. I thought it was brilliant when I read it about a  <br/>\n&gt; week ago, it really made sense to me and I tried to explain it to my  <br/>\n&gt; husband..brought it up at a time when we weren&#39;t in a moment and  <br/>\n&gt; were just walking along the beach. He just immediately shut down and  <br/>\n&gt; did the whole eyeroll thing :(<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Faith Void Taintor  <br/>\n&gt; &lt;littlemsvoid@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Ben Lovejoy is presently *IN* the military. He is NO hippy :-) in  <br/>\n&gt; fact<br/>\n&gt; &gt; he is quite conservative :-) a wonderful human, and father of two<br/>\n&gt; &gt; young men (14 & 22).<br/>\n&gt; &gt;<br/>\n&gt; &gt; Faith<br/>\n&gt; &gt;<br/>\n&gt; &gt; Sent from my iPhone<br/>\n&gt; &gt;<br/>\n&gt; &gt; On Jul 19, 2010, at 6:37 PM, &quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; Yes my husband is a retired marine. Yes I read that and even tried<br/>\n&gt; &gt; &gt; discussing it with him about a week ago. He said he just doesn&#39;t  <br/>\n&gt; see<br/>\n&gt; &gt; &gt; the difference. He wants no part of reading anything about<br/>\n&gt; &gt; &gt; unschooling. To him it&#39;s all just hippie new age BS.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Heather &lt;heather@&gt;  <br/>\n&gt; wrote:<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; Maybe you and your dh could read this...<br/>\n&gt; &gt; &gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/benrules\">http://sandradodd.com/benrules</a><br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; Ben is an unschooling dad with a military background.<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; heather<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; On Mon, Jul 19, 2010 at 2:33 PM, JJ &lt;jrossedd@&gt; wrote:<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; &gt; This is the husband who you said in an earlier post was a<br/>\n&gt; &gt; &gt; Marine? And<br/>\n&gt; &gt; &gt; &gt; &gt; you&#39;re wondering why he (particularly) would think you &quot;need<br/>\n&gt; &gt; &gt; rules and<br/>\n&gt; &gt; &gt; &gt; &gt; regulations? LOL!<br/>\n&gt; &gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; &gt; My dad was Air Force and always toughest on himself first.  <br/>\n&gt; It&#39;s<br/>\n&gt; &gt; &gt; just not a<br/>\n&gt; &gt; &gt; &gt; &gt; mindset I would expect to ever make compatible with whole life<br/>\n&gt; &gt; &gt; unschooling.<br/>\n&gt; &gt; &gt; &gt; &gt; My dad was barely compatible with young children, period!<br/>\n&gt; &gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279583329","msgId":44569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMm85MSsydnVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMzOTAzRERCLUNEOEUtNDcxMi1BRjc0LTZFNzMwMkRCNzgwNUBnbWFpbC5jb20+"},"prevInTopic":44568,"nextInTopic":44570,"prevInTime":44568,"nextInTime":44570,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"I hope you didn t think I was putting down the article in any way, shape or form. I thought it was brilliant when I read it about a week ago, it really made","messageBody":"<div id=\"ygrps-yiv-1318914385\">I hope you didn&#39;t think I was putting down the article in any way, shape or form. I thought it was brilliant when I read it about a week ago, it really made sense to me and I tried to explain it to my husband..brought it up at a time when we weren&#39;t in a moment and were just walking along the beach. He just immediately shut down and did the whole eyeroll thing :( <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Faith Void Taintor &lt;littlemsvoid@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Ben Lovejoy is presently *IN* the military. He is NO hippy :-) in fact  <br/>\n&gt; he is quite conservative :-) a wonderful human, and father of two  <br/>\n&gt; young men (14 & 22).<br/>\n&gt; <br/>\n&gt; Faith<br/>\n&gt; <br/>\n&gt; Sent from my iPhone<br/>\n&gt; <br/>\n&gt; On Jul 19, 2010, at 6:37 PM, &quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; Yes my husband is a retired marine. Yes I read that and even tried  <br/>\n&gt; &gt; discussing it with him about a week ago. He said he just doesn&#39;t see  <br/>\n&gt; &gt; the difference. He wants no part of reading anything about  <br/>\n&gt; &gt; unschooling. To him it&#39;s all just hippie new age BS.<br/>\n&gt; &gt;<br/>\n&gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Heather &lt;heather@&gt; wrote:<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Maybe you and your dh could read this...<br/>\n&gt; &gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/benrules\">http://sandradodd.com/benrules</a><br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Ben is an unschooling dad with a military background.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; heather<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; On Mon, Jul 19, 2010 at 2:33 PM, JJ &lt;jrossedd@&gt; wrote:<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; This is the husband who you said in an earlier post was a  <br/>\n&gt; &gt; Marine? And<br/>\n&gt; &gt; &gt; &gt; you&#39;re wondering why he (particularly) would think you &quot;need  <br/>\n&gt; &gt; rules and<br/>\n&gt; &gt; &gt; &gt; regulations? LOL!<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; My dad was Air Force and always toughest on himself first. It&#39;s  <br/>\n&gt; &gt; just not a<br/>\n&gt; &gt; &gt; &gt; mindset I would expect to ever make compatible with whole life  <br/>\n&gt; &gt; unschooling.<br/>\n&gt; &gt; &gt; &gt; My dad was barely compatible with young children, period!<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Advice please","postDate":"1279583098","msgId":44568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzOTAzRERCLUNEOEUtNDcxMi1BRjc0LTZFNzMwMkRCNzgwNUBnbWFpbC5jb20+","inReplyToHeader":"PGkyMmszaitodGI5QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMmszaitodGI5QGVHcm91cHMuY29tPg=="},"prevInTopic":44567,"nextInTopic":44569,"prevInTime":44567,"nextInTime":44569,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Ben Lovejoy is presently *IN* the military. He is NO hippy :-) in fact he is quite conservative :-) a wonderful human, and father of two young men (14 & 22). ","messageBody":"<div id=\"ygrps-yiv-1818911975\">Ben Lovejoy is presently *IN* the military. He is NO hippy :-) in fact  <br/>\nhe is quite conservative :-) a wonderful human, and father of two  <br/>\nyoung men (14 & 22).<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 19, 2010, at 6:37 PM, &quot;sarahrandom78&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bdb1978@...\">bdb1978@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Yes my husband is a retired marine. Yes I read that and even tried  <br/>\n&gt; discussing it with him about a week ago. He said he just doesn&#39;t see  <br/>\n&gt; the difference. He wants no part of reading anything about  <br/>\n&gt; unschooling. To him it&#39;s all just hippie new age BS.<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Heather &lt;heather@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Maybe you and your dh could read this...<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/benrules\">http://sandradodd.com/benrules</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; Ben is an unschooling dad with a military background.<br/>\n&gt; &gt;<br/>\n&gt; &gt; heather<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; On Mon, Jul 19, 2010 at 2:33 PM, JJ &lt;jrossedd@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; This is the husband who you said in an earlier post was a  <br/>\n&gt; Marine? And<br/>\n&gt; &gt; &gt; you&#39;re wondering why he (particularly) would think you &quot;need  <br/>\n&gt; rules and<br/>\n&gt; &gt; &gt; regulations? LOL!<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; My dad was Air Force and always toughest on himself first. It&#39;s  <br/>\n&gt; just not a<br/>\n&gt; &gt; &gt; mindset I would expect to ever make compatible with whole life  <br/>\n&gt; unschooling.<br/>\n&gt; &gt; &gt; My dad was barely compatible with young children, period!<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Advice please","postDate":"1279579059","msgId":44567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMmszaitodGI5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluUXpiMkxudVR5OHZNcWM0Q01PbVE1WUVHZFFzQU9lSlNHVnFmWUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44566,"nextInTopic":44568,"prevInTime":44566,"nextInTime":44568,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Yes my husband is a retired marine. Yes I read that and even tried discussing it with him about a week ago. He said he just doesn t see the difference. He","messageBody":"<div id=\"ygrps-yiv-347369420\">Yes my husband is a retired marine. Yes I read that and even tried discussing it with him about a week ago. He said he just doesn&#39;t see the difference. He wants no part of reading anything about unschooling. To him it&#39;s all just hippie new age BS. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Heather &lt;heather@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Maybe you and your dh could read this...<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/benrules\">http://sandradodd.com/benrules</a><br/>\n&gt; <br/>\n&gt; Ben is an unschooling dad with a military background.<br/>\n&gt; <br/>\n&gt; heather<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Mon, Jul 19, 2010 at 2:33 PM, JJ &lt;jrossedd@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; This is the husband who you said in an earlier post was a Marine? And<br/>\n&gt; &gt; you&#39;re wondering why he (particularly) would think you &quot;need rules and<br/>\n&gt; &gt; regulations? LOL!<br/>\n&gt; &gt;<br/>\n&gt; &gt; My dad was Air Force and always toughest on himself first. It&#39;s just not a<br/>\n&gt; &gt; mindset I would expect to ever make compatible with whole life unschooling.<br/>\n&gt; &gt; My dad was barely compatible with young children, period!<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Advice please","postDate":"1279578900","msgId":44566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMmp1aytoOGo5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBFMjdCQTVDQUExNjREOEJCQ0NENzg3RkMxQzdFQzYwQENvbm5pZVBDPg=="},"prevInTopic":44565,"nextInTopic":44567,"prevInTime":44565,"nextInTime":44567,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"No unschooling doesn t mean more to me than my relationship with my husband. The hard part is finding that middle ground. When I try to gently parent he","messageBody":"<div id=\"ygrps-yiv-1281624244\">No unschooling doesn&#39;t mean more to me than my relationship with my husband. The hard part is finding that middle ground. When I try to gently parent he accuses me of not parenting and instead trying to be my kids friend. If I&#39;m trying to wait and see if the kids can settle an argument on their own before I intervene, he again accuses me of not parenting. By gently parenting, I mean that I&#39;m trying to figure out why the kids are acting out, instead of just scolding them and sending them to their room. I like to listen to their reasons for their behavior, he likes to just send them to their room when their fighting, no questions asked and no reasons listened to. I can change myself, but that seems to be the problem. The fact that I AM changing and he doesn&#39;t want me to. I&#39;m fine with the kids having a bed time, my husband is a very light sleeper and all our rooms are on the second floor of the house, so the kids are allowed to watch a movie in their room or play their hand held games, but they need to stay in their room after 9pm. I do try to understand his point of view but at the same time, I&#39;m not going to adopt it. <br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;otherstar&quot; &lt;otherstar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Unschooling is all about relationships. Does unschooling mean more to you than your relationship with your husband? I think I would rather find a middle ground where there are some rules and regulations. All your husband sees is you losing your mind. Why does he have to accept unschooling right now? Why can&#39;t you change yourself and work on yourself and let him work at his own pace? Are you trying to control your husband so that your children will have more control? That&#39;s really a contradiction. Instead of trying to force your husband to go along with unschooling would it be possible to apply unschooling principles to your relationship with your spouse? Accept him right where he is and try to understand his point of view rather than trying to make him see your point of view. <br/>\n&gt; <br/>\n&gt; Connie<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; From: sarahrandom78 <br/>\n&gt; Sent: Monday, July 19, 2010 3:54 PM<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n&gt; Subject: [unschoolingbasics] Advice please<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; Hi, I need advice again. My husband doesn&#39;t agree with whole life unschooling at all. He thinks we need rules and regulations, and is starting to question our whole relationship because of the way I parent. I&#39;ve read postings from others who had a spouse that wasn&#39;t especially supportive, but I&#39;m saying my husband is dead set against it. What do you do when you&#39;re trying to gently parent and your husband is constantly yelling at the kids? I was more traditional with my oldest (now 11) but have been much less so with the younger 2 (now 3 and almost 5) I&#39;m trying to say yes more, and see things from their perspective. There have been some things I&#39;ve seen on the message board that I don&#39;t agree with, but lots of things I do agree with. I was the youngest in my home and always felt so powerless, so this way of parenting goes along with the way I wish I had been treated, given more freedom and say. It is hard, because I&#39;m also a control freak, probably a leftover from my childhood, but I&#39;m constantly working at it. It&#39;s just very hard when I see my husband blow up at the kids and not let them even say what they&#39;re trying to say. I don&#39;t want to divorce if I can avoid it, because I&#39;m sure a court would side with him and make our kids go to school. That&#39;s why I&#39;m here, asking for your advice on how to get him to, if nothing else, speak more gently to our kids.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --------------------------------------------------------------------------------<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; No virus found in this incoming message.<br/>\n&gt; Checked by AVG - www.avg.com <br/>\n&gt; Version: 9.0.839 / Virus Database: 271.1.1/3015 - Release Date: 07/19/10 01:36:00<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":35875473,"authorName":"Heather","from":"Heather &lt;heather@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Advice please","postDate":"1279577693","msgId":44565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluUXpiMkxudVR5OHZNcWM0Q01PbVE1WUVHZFFzQU9lSlNHVnFmWUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkyMmdhcytvMjg1QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPgk8aTIyZ2FzK28yODVAZUdyb3Vwcy5jb20+"},"prevInTopic":44564,"nextInTopic":44566,"prevInTime":44564,"nextInTime":44566,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Maybe you and your dh could read this... http://sandradodd.com/benrules Ben is an unschooling dad with a military background. heather ... [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-1437061962\">Maybe you and your dh could read this...<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/benrules\">http://sandradodd.com/benrules</a><br/>\n<br/>\nBen is an unschooling dad with a military background.<br/>\n<br/>\nheather<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Jul 19, 2010 at 2:33 PM, JJ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This is the husband who you said in an earlier post was a Marine? And<br/>\n&gt; you&#39;re wondering why he (particularly) would think you &quot;need rules and<br/>\n&gt; regulations? LOL!<br/>\n&gt;<br/>\n&gt; My dad was Air Force and always toughest on himself first. It&#39;s just not a<br/>\n&gt; mindset I would expect to ever make compatible with whole life unschooling.<br/>\n&gt; My dad was barely compatible with young children, period!<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":255388392,"authorName":"Kelly Halldorson","from":"&quot;Kelly Halldorson&quot; &lt;kelly@...&gt;","profile":"kellygrafx","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  [unschoolingbasics] Advice please","postDate":"1279575781","msgId":44571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5ODY4QzUxRjEwODQwMTBCNEQ2MDcwOUYwODExM0RCQFBIUFZpZGVvVkFJTz4=","inReplyToHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg=="},"prevInTopic":44570,"nextInTopic":44572,"prevInTime":44570,"nextInTime":44572,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"... It s not possible without his support. If he is dead set against it and you go for it you ll likely wind up divorced. Then there will be no unschooling","messageBody":"<div id=\"ygrps-yiv-1062037282\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; Hi, I need advice again. My husband doesn&#39;t agree with whole life unschooling at all. He thinks we need rules and regulations, and is starting to question our whole relationship because of the way I parent. I&#39;ve read postings from others who had a spouse that wasn&#39;t especially supportive, but I&#39;m saying my husband is dead set against it. &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It&#39;s not possible without his support. If he is &quot;dead set&quot; against it and you go for it you&#39;ll likely wind up divorced. Then there will be no unschooling and probably forced public/private schooling. Go slow, very slow. Invite him to meet other unschooling families, unschooling Dads that *are* supportive. Slowly show him how things can work by being more peaceful yourself. <br/>\n<br/>\nTry allowing him to vent his concerns to you *without* you countering with anything. Try just listening TO him a few times. Show him you care about his concerns. Don&#39;t push. Don&#39;t push. Don&#39;t push. If you do you&#39;ll push him right out the door screaming.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;What do you do when you&#39;re trying to gently parent and your husband is constantly yelling at the kids? &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Try to head off the yelling. Why does he yell? Can you see it brewing? Can you try and meet his needs before he gets upset? I think I need more info as to what he is actually yelling about...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I was more traditional with my oldest (now 11) but have been much less so with the younger 2 (now 3 and almost 5) I&#39;m trying to say yes more, and see things from their perspective. &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>You are still only trying. He&#39;s not even interested in trying yet. <br/>\n<br/>\nTry and see things from his perspective too. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;It is hard, because I&#39;m also a control freak, &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>And since you are letting go of some of the control of your kids you are probably redirecting that to your husband?? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I see my husband blow up at the kids and not let them even say what they&#39;re trying to say. &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Try and head it off as much as you can. Try and keep him happy...if you are loving him up and down he&#39;s going to be less focused on the kid&#39;s perceived (by him) shortcomings.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I don&#39;t want to divorce if I can avoid it, because . I&#39;m sure a court would side with him and make our kids go to school. &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Then stop pushing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;That&#39;s why I&#39;m here, asking for your advice on how to get him to, if nothing else, speak more gently to our kids.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>The best you can do is ask him by speaking gently to him. You can be sweet and kind to him and hope he does the same for the kids. You can&#39;t make him do anything. You can&#39;t control him and the more you try the more likely you&#39;ll end up divorced. <br/>\n<br/>\nPeace,<br/>\nKelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Advice please","postDate":"1279575196","msgId":44564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMmdhcytvMjg1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg=="},"prevInTopic":44563,"nextInTopic":44565,"prevInTime":44563,"nextInTime":44565,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"This is the husband who you said in an earlier post was a Marine?  And you re wondering why he (particularly)  would think you need rules and regulations?","messageBody":"<div id=\"ygrps-yiv-790872813\">This is the husband who you said in an earlier post was a Marine?  And you&#39;re wondering why he (particularly)  would think you &quot;need rules and regulations?  LOL!  <br/>\n<br/>\nMy dad was Air Force and always toughest on himself first. It&#39;s just not a mindset I would expect to ever make compatible with whole life unschooling. My dad was barely compatible with young children, period! <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi, I need advice again. My husband doesn&#39;t agree with whole life unschooling at all. He thinks we need rules and regulations, and is starting to question our whole relationship because of the way I parent. I&#39;ve read postings from others who had a spouse that wasn&#39;t especially supportive, but I&#39;m saying my husband is dead set against it. What do you do when you&#39;re trying to gently parent and your husband is constantly yelling at the kids? I was more traditional with my oldest (now 11) but have been much less so with the younger 2 (now 3 and almost 5) I&#39;m trying to say yes more, and see things from their perspective. There have been some things I&#39;ve seen on the message board that I don&#39;t agree with, but lots of things I do agree with. I was the youngest in my home and always felt so powerless, so this way of parenting goes along with the way I wish I had been treated, given more freedom and say. It is hard, because I&#39;m also a control freak, probably a leftover from my childhood, but I&#39;m constantly working at it. It&#39;s just very hard when I see my husband blow up at the kids and not let them even say what they&#39;re trying to say. I don&#39;t want to divorce if I can avoid it, because I&#39;m sure a court would side with him and make our kids go to school. That&#39;s why I&#39;m here, asking for your advice on how to get him to, if nothing else, speak more gently to our kids.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Advice please","postDate":"1279574730","msgId":44563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFMjdCQTVDQUExNjREOEJCQ0NENzg3RkMxQzdFQzYwQENvbm5pZVBDPg==","inReplyToHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg=="},"prevInTopic":44562,"nextInTopic":44564,"prevInTime":44562,"nextInTime":44564,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Unschooling is all about relationships. Does unschooling mean more to you than your relationship with your husband? I think I would rather find a middle ground","messageBody":"<div id=\"ygrps-yiv-134888727\">Unschooling is all about relationships. Does unschooling mean more to you than your relationship with your husband? I think I would rather find a middle ground where there are some rules and regulations. All your husband sees is you losing your mind. Why does he have to accept unschooling right now? Why can&#39;t you change yourself and work on yourself and let him work at his own pace? Are you trying to control your husband so that your children will have more control? That&#39;s really a contradiction. Instead of trying to force your husband to go along with unschooling would it be possible to apply unschooling principles to your relationship with your spouse? Accept him right where he is and try to understand his point of view rather than trying to make him see your point of view. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\nFrom: sarahrandom78 <br/>\nSent: Monday, July 19, 2010 3:54 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Advice please<br/>\n<br/>\n<br/>\n  <br/>\nHi, I need advice again. My husband doesn&#39;t agree with whole life unschooling at all. He thinks we need rules and regulations, and is starting to question our whole relationship because of the way I parent. I&#39;ve read postings from others who had a spouse that wasn&#39;t especially supportive, but I&#39;m saying my husband is dead set against it. What do you do when you&#39;re trying to gently parent and your husband is constantly yelling at the kids? I was more traditional with my oldest (now 11) but have been much less so with the younger 2 (now 3 and almost 5) I&#39;m trying to say yes more, and see things from their perspective. There have been some things I&#39;ve seen on the message board that I don&#39;t agree with, but lots of things I do agree with. I was the youngest in my home and always felt so powerless, so this way of parenting goes along with the way I wish I had been treated, given more freedom and say. It is hard, because I&#39;m also a control freak, probably a leftover from my childhood, but I&#39;m constantly working at it. It&#39;s just very hard when I see my husband blow up at the kids and not let them even say what they&#39;re trying to say. I don&#39;t want to divorce if I can avoid it, because I&#39;m sure a court would side with him and make our kids go to school. That&#39;s why I&#39;m here, asking for your advice on how to get him to, if nothing else, speak more gently to our kids.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com <br/>\nVersion: 9.0.839 / Virus Database: 271.1.1/3015 - Release Date: 07/19/10 01:36:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Advice please","postDate":"1279574415","msgId":44562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltWjJjZmZhUF9UdHloUWYwaDl4OWtrTDVmdFptWThWNk9kOUtlbkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg=="},"prevInTopic":44561,"nextInTopic":44563,"prevInTime":44561,"nextInTime":44563,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Others will have better advice for you so I m not going to try to give too much.  I want you to know that my husband is military (and is WAY into good order","messageBody":"<div id=\"ygrps-yiv-480291494\">Others will have better advice for you so I&#39;m not going to try to give too<br/>\nmuch.  I want you to know that my husband is military (and is WAY into good<br/>\norder and discipline) and was NOT into living this way at all.  And here we<br/>\nare several years into it and I still have to remind him not to yell<br/>\nsometimes, but then so does he with me.  Not all the time.  We both<br/>\nbackslide still.  Once he began to see the benefits it helped.  But in the<br/>\nbeginning he said to me once &quot;Well they are getting better than I got.&quot;<br/>\nMeaning that the way we were parenting was better than he and I were<br/>\nparented so they should be glad.<br/>\n<br/>\nIn defense of your husband it seems to be a BIZARRE way to parent.  We are<br/>\nsimply not habituated to the idea that little people have rights and should<br/>\nbe respected and that doing so doesn&#39;t mean that you&#39;ll have a 7 yr old<br/>\nsmoking crack on the living room couch.  It&#39;s a lot to absorb and frankly it<br/>\ntakes a good bit of faith to embrace ESPECIALLY if like us, you don&#39;t know<br/>\nany kids parented this way that can be held up as an example.  But kids who<br/>\nhave parents who don&#39;t care and are out of control are everywhere and when<br/>\nyou first look at it, it looks like it could be the same.  And frankly, if<br/>\nit were the same, then he&#39;d be right to be worried and it would be<br/>\nnegligence.  But it&#39;s not the same and only time will bring that to the<br/>\nfore.  The best thing I did was give my husband Rue Kream&#39;s book (I think<br/>\nthat&#39;s how her last name is spelled) to read.  I read it first.  Were I you,<br/>\nI would ask him if he would be willing to read it and discuss it with you.<br/>\nBut ask him.  Don&#39;t tell him.<br/>\n<br/>\nSee, we get all caught up in this and want what&#39;s better for the kids and in<br/>\nthe meantime we steamroll our spouses and basically say &quot;PISS OFF we are<br/>\ngoing to PARENT THE WAY I SAY!&quot;  And no one likes that.  So there is a<br/>\nbalance to strike there which some of these other good people will be kind<br/>\nenough to explain to you.  I just want you to know that 1.) if my husband<br/>\ncan get there, there is hope for yours and 2.) it takes time.<br/>\n<br/>\nHTH, hang in there,<br/>\n<br/>\n<br/>\nKaren<br/>\n&quot;The really bright student, the eager questioner, the probing searcher,<br/>\nespecially if he is brighter than his teacher, is too often seen as a &#39;wise<br/>\nguy,&#39; a threat to discipline, a challenger of his teacher&#39;s<br/>\nauthority.&quot; ~Abraham<br/>\nMaslow<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Jul 19, 2010 at 3:54 PM, sarahrandom78 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bdb1978@...\">bdb1978@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi, I need advice again. My husband doesn&#39;t agree with whole life<br/>\n&gt; unschooling at all. He thinks we need rules and regulations, and is starting<br/>\n&gt; to question our whole relationship because of the way I parent. I&#39;ve read<br/>\n&gt; postings from others who had a spouse that wasn&#39;t especially supportive, but<br/>\n&gt; I&#39;m saying my husband is dead set against it. What do you do when you&#39;re<br/>\n&gt; trying to gently parent and your husband is constantly yelling at the kids?<br/>\n&gt; I was more traditional with my oldest (now 11) but have been much less so<br/>\n&gt; with the younger 2 (now 3 and almost 5) I&#39;m trying to say yes more, and see<br/>\n&gt; things from their perspective. There have been some things I&#39;ve seen on the<br/>\n&gt; message board that I don&#39;t agree with, but lots of things I do agree with. I<br/>\n&gt; was the youngest in my home and always felt so powerless, so this way of<br/>\n&gt; parenting goes along with the way I wish I had been treated, given more<br/>\n&gt; freedom and say. It is hard, because I&#39;m also a control freak, probably a<br/>\n&gt; leftover from my childhood, but I&#39;m constantly working at it. It&#39;s just very<br/>\n&gt; hard when I see my husband blow up at the kids and not let them even say<br/>\n&gt; what they&#39;re trying to say. I don&#39;t want to divorce if I can avoid it,<br/>\n&gt; because I&#39;m sure a court would side with him and make our kids go to school.<br/>\n&gt; That&#39;s why I&#39;m here, asking for your advice on how to get him to, if nothing<br/>\n&gt; else, speak more gently to our kids.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Advice please","postDate":"1279572866","msgId":44561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMmUyMitrN3JzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44562,"prevInTime":44560,"nextInTime":44562,"topicId":44561,"numMessagesInTopic":0,"msgSnippet":"Hi, I need advice again. My husband doesn t agree with whole life unschooling at all. He thinks we need rules and regulations, and is starting to question our","messageBody":"<div id=\"ygrps-yiv-162229322\">Hi, I need advice again. My husband doesn&#39;t agree with whole life unschooling at all. He thinks we need rules and regulations, and is starting to question our whole relationship because of the way I parent. I&#39;ve read postings from others who had a spouse that wasn&#39;t especially supportive, but I&#39;m saying my husband is dead set against it. What do you do when you&#39;re trying to gently parent and your husband is constantly yelling at the kids? I was more traditional with my oldest (now 11) but have been much less so with the younger 2 (now 3 and almost 5) I&#39;m trying to say yes more, and see things from their perspective. There have been some things I&#39;ve seen on the message board that I don&#39;t agree with, but lots of things I do agree with. I was the youngest in my home and always felt so powerless, so this way of parenting goes along with the way I wish I had been treated, given more freedom and say. It is hard, because I&#39;m also a control freak, probably a leftover from my childhood, but I&#39;m constantly working at it. It&#39;s just very hard when I see my husband blow up at the kids and not let them even say what they&#39;re trying to say. I don&#39;t want to divorce if I can avoid it, because I&#39;m sure a court would side with him and make our kids go to school. That&#39;s why I&#39;m here, asking for your advice on how to get him to, if nothing else, speak more gently to our kids.</div>","specialLinks":[]}],"prevTopicId":44537,"nextTopicId":44590}}