{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Fw: Great Newletter about reading and more","postDate":"1218855438","msgId":35396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5ODg5OC4yODMwNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":35395,"nextInTime":35397,"topicId":35396,"numMessagesInTopic":0,"msgSnippet":"I really like Naomi Aldort and this is her latest newsletter I received! It talks about trusting you child to learn to read at any age and children growing up","messageBody":"<div id=\"ygrps-yiv-1570369439\">I really like Naomi Aldort and this is her latest newsletter I received!<br/>\nIt talks about trusting you child to learn to read at any age and<br/>\nchildren growing up and moving on.<br/>\nAlex P<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----- Message Forwarded on Fri, 15 Aug 2008 20:51:03 -0600<br/>\n-----<br/>\nFrom: &quot;Aldort Parenting Newsletter&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:naomi@...\">naomi@...</a>&gt;<br/>\nTo: &quot;alexandra poliowsky&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykow@...\">polykow@...</a>&gt;<br/>\nSubject: Aldort Parenting 08/08<br/>\nDate: Fri, 15 Aug 2008 20:33:35 -0500<br/>\n<br/>\nDear Parents,<br/>\n<br/>\nLots of changes and newness in my family life and I would<br/>\nlike to share some of it with you as a personal connection<br/>\nand, for many of you, a view into what future with children<br/>\ncan hold.<br/>\n<br/>\nBut first announcements and your notes:<br/>\n<br/>\n1) Teleclasses and skype classes<br/>\n2) Networking section: Vaccines<br/>\n3) Your notes with some responses<br/>\n4) Naomi&#39;s reflections<br/>\n<br/>\n* Please be reminded that when you write to me, you<br/>\nautomatically give me  permission to quote you unless you<br/>\nrequest otherwise.<br/>\n<br/>\n1) Please visit my site for new information about<br/>\nphone/skype classes. The link is second from the top on the<br/>\nleft.<br/>\n<br/>\nYou can have your own group class or community event. We<br/>\nhave one group from NYC going every other or third week. I<br/>\nam flexible with dates and regularity  as I am with private<br/>\nsessions.<br/>\n<br/>\nHere is Emily&#39;s note after a teleclass with her group:<br/>\n<br/>\nNaomi,<br/>\nThe call was GREAT - so inspiring and helpful!  A few people<br/>\nalready wrote to me that they would like to take part in any<br/>\nfuture calls with you! I think a lot of people would be<br/>\ninterested in continuing with Jamie&#39;s question.  Are you<br/>\nfree next Wed ...? ...For the music class I already have 20<br/>\npeople interested in. Warmly,<br/>\nEmily<br/>\n<br/>\n2) Networking:<br/>\nI would like to start a network of parenting help in this<br/>\nnewsletter. The first subject I would like to explore is<br/>\nvaccines. I did not vaccinate my children, but I know that<br/>\nsome of you have or would like to know more about the<br/>\nsubject. Many believe that mercury has been removed from<br/>\nvaccines.  I hear that it has only been reduced very<br/>\nslightly. I also hear that mercury is not the only health<br/>\nhazard in vaccines.<br/>\n    If any of you have reliable knowledge on the state of<br/>\nmercury in vaccines and other facts that could help all of<br/>\nus, would you share it with us? If you can share a few links<br/>\nand a short summary about vaccines, I will put it in the<br/>\nnext newsletter. It must be concise and with reliable<br/>\nsources. In other words, don&#39;t write an article, but provide<br/>\nlinks, book titles, and a short informative overview (100<br/>\nwords.) A link to an article is fine.<br/>\n    Other subjects to consider for sharing here can be food,<br/>\nenvironmental issues for children, health, toy safety, herbs<br/>\nand healing, opportunities for teens etc. The key is to be<br/>\nshort and provide links and resources. I am looking forward<br/>\nto learning from all of you and to making this an on going<br/>\nplatform for sharing vital information for parents.<br/>\n<br/>\n3) Your notes with some of my responses:<br/>\n<br/>\nDear Naomi,<br/>\n<br/>\nFirst off, Thank you for your sharing your insights and<br/>\nguidance.  As a whole, I have found your advice very<br/>\nhelpful.  I don&#39;t often write in to comment on things (to<br/>\nmagazines, email groups, etc.), but I find it hard not to<br/>\nrespond to your comment about the child struggling with<br/>\nreading.<br/>\n<br/>\n(Naomi&#39;s note: Is he struggling? I don&#39;t think so. He is not<br/>\ninto reading. Without adults&#39; struggle with his timing,<br/>\nthere is no struggle in the child. I respond fully at the<br/>\nend of this email.)<br/>\n<br/>\n    I do believe in your principle of &quot;trust&quot; and think it<br/>\nis an important one.  However, with reading still not coming<br/>\nto this child at age 11, it is my personal opinion that it<br/>\nis a bit unwise to give blanket advice to trust.  There<br/>\nreally is not enough known about this situation to have a<br/>\nsimplistic response.  It may be a relief for the mom to hear<br/>\nthose words now, but in the end, do they serve her?  Would<br/>\nwe say the same to a child who didn&#39;t walk or speak, but had<br/>\nthe potential to?  I think, out of love, we would get<br/>\nhim/her the extra services needed to develop those important<br/>\nskills.  The concerns I see here are: 1) is there a learning<br/>\ndisability? (people needlessly suffer when this goes<br/>\nundiagnosed), 2) there are effective and ineffective ways to<br/>\nhelp a child to read (maybe mom needs to explore other<br/>\noptions since her first child required no assistance), and/<br/>\nor 3) is there a lot of anxiety around this issue for the<br/>\nchild? (which also could be addressed).<br/>\n<br/>\n(Naomi&#39;s note: without wanting him to read, there is no<br/>\nanxiety. To avoid anxiety, trust.)<br/>\n<br/>\nI really think more information is needed here.  Though<br/>\nthere are people who make it in this world without reading,<br/>\nI don&#39;t think it is an easy path.  Just basic life in the<br/>\ngrocery store, driving down a road, filling out a form in<br/>\nthe doctor&#39;s office, etc. requires some basic literacy.  I<br/>\nam concerned about such a cavalier response.<br/>\n<br/>\nI hope not to offend you, but offer another perspective. I<br/>\nam a homeschooling mom who believes in letting my kids play<br/>\nthe majority of the day, explore things on their own terms,<br/>\nand pursue what interests them in the ways that fit their<br/>\ntemperament.<br/>\n<br/>\nSincerely,<br/>\n<br/>\nRachel Tessier<br/>\n<br/>\nDear Rachel,<br/>\n<br/>\nThank you for your loving concern. I hear you. And, I think<br/>\nwhat makes me so confident in offering nothing but trust, is<br/>\nmy experience with parents and children world wide. I have<br/>\nlots of direct evidence.<br/>\n<br/>\nIf (like you say) it is difficult to live without reading,<br/>\nthen he will read. Nothing can stop him. He will want it on<br/>\nhis own. If he doesn&#39;t read then it isn&#39;t difficult for him<br/>\nto live without reading, and it serves him in some amazing<br/>\nway which we cannot fathom (or maybe his parents do.)Â <br/>\n<br/>\nI am happy to pass on my confidence which relies<br/>\nonÂ personally knowing kids who learned to read on their<br/>\nown<br/>\nbeyond age 14. Not a problem. They learn in a couple of days<br/>\n, and, within a week, read as good as one who read at four.<br/>\nThe idea that a child should read by a certain age, or, that<br/>\nif he doesn&#39;t read by this age, it means something, is<br/>\nsimply not true. Such ideas cause a desire to orchestrate<br/>\nthe child&#39;s development instead of serve him on his path.<br/>\n<br/>\nAt the same time, if you enjoy your ideas about reading,<br/>\nthen, by all means, teach your children to read and enjoy. I<br/>\nwas giving this mother the assurance in the direction she<br/>\nwas looking for with a normal, healthy and happy<br/>\nself-directed child.<br/>\n<br/>\nAs for your concern for learning issues: Learning<br/>\ndisabilities are created by pushing children to<br/>\nread/learnÂ ahead of their eye, brain and heart<br/>\nreadiness.<br/>\nPlease read my two advice columns on labels in Life Learning<br/>\nMagazine. Some of the kids who read late are way way ahead<br/>\nof their peers in other areas they focus on (and reading<br/>\nwould have harmed their development.) They must do it their<br/>\nown way to optimize their own talents. I know kids who are<br/>\nvery physical who read late, or those who are musical,<br/>\nartistic and mostly creative kids seem to delay the<br/>\ndependency on the written word. Reading is not a basic<br/>\nbiological development like walking and talking. Therefore<br/>\nthe differences in age, style and usage are very great.<br/>\n<br/>\nYour examples of walking and talking are so great. Thank you<br/>\nfor that. Yes, I would not ignore a child whose legs are<br/>\nlimp with no life, whose voice or tongue are missing, who<br/>\ndoes not hear, or displays other brain disfunction. A child<br/>\nwho has real brain issue will show clear symptoms. Children<br/>\nwalk when they walk, talk when they talk. Those who use<br/>\nspeech therapy due to speaking later or due to<br/>\nfunnyÂ pronunciationsÂ are too often harmed by those<br/>\ntherapies which contradict their brain development and<br/>\nemotional direction. Those who are trusted, walk and talk<br/>\nwhen they do. Einstein didn&#39;t talk till age four. He would<br/>\nhave been severely harmedÂ by our modern rush to &quot;fix&quot;<br/>\nhim,<br/>\nas though there was a problem.Â <br/>\n<br/>\nI suggested to the mother to keep reading to the boy and<br/>\nenjoy his association with the written word. The rest is up<br/>\nto him. I know he will read. When I say that if he doesn&#39;t ,<br/>\nit would be amazing, I say so knowing that it is not<br/>\npossible and just to relax us. And truly, if with the<br/>\nfreedom and opportunities provided, he does not choose to<br/>\nread (really really not possible), he would do so without<br/>\nsuffering and for a great advantage unknown to you and I.<br/>\nWho knows how manyÂ geniusÂ innovations we lose by<br/>\nfocusing<br/>\nso much on perception through visual words. We greatly<br/>\ndiminish the child&#39;s reliance on ear, imagination, fantasy,<br/>\nmemory and much more.Â We must trust and honor<br/>\npossibilities<br/>\nthat are way beyond our ability to know. I don&#39;t run the<br/>\nworld (I don&#39;t decide when one should read.) I only guide in<br/>\nliving joyfully and powerfully with children and with<br/>\nourselves.<br/>\n<br/>\nI know this is radical thinking and I hope it helps a bit<br/>\neven if it raises more questions than answers.<br/>\n<br/>\nWith love,<br/>\n<br/>\nNaomi<br/>\n<br/>\nHello,<br/>\nI have been blessed by your parenting advice and would like<br/>\nto print off the articles for personal use to include in a<br/>\nnotebook. I want to honor your copyright. Is it okay for me<br/>\nto print them off for personal use? Thank you,<br/>\nKristi Palmer<br/>\nMama to Lukey (2 yr. 5 mo.)<br/>\nPortland, OR<br/>\n<br/>\nDear Kristi,<br/>\n<br/>\nYou (and all of you) are welcome to print articles of mine<br/>\nand share with others. Please include the copyright, book<br/>\nand web site information.<br/>\n<br/>\nWith love,<br/>\n<br/>\nNaomi<br/>\n<br/>\nNaomi, (about the forum advertising The Work and my request<br/>\nto suggest my guidance before sending parents to Katie&#39;s.)<br/>\n<br/>\nIf you want this, you need to make your work your own and<br/>\ndeter away from facilitating someone else. You are good at<br/>\nwhat you do.<br/>\n<br/>\nKim<br/>\n<br/>\nDear Kim,<br/>\n<br/>\nThank you. I love the support and the direction in your<br/>\nemail. I find that for some parents doing TW connects them<br/>\nto something they already know. I don&#39;t see anything as mine<br/>\n, or anyone else&#39;s. It is what it is and comes through<br/>\nwhoever it comes through. Obviously, I do my work, and I did<br/>\nbefore Katie&#39;s work came to my knowledge. People like to<br/>\nconnect what I do to hers, so I flow with that, in order to<br/>\nsimplify it for those people.Â I respond to all of you<br/>\nwhere<br/>\nyou are. I do The Work with parents because they want to and<br/>\nI do it Naomi&#39;s way, because can&#39;t be anyone else. I mostly<br/>\ndo whatever I do which combines everything and invents newly<br/>\non the spot in response to each parent and child.<br/>\n<br/>\nI respond to each person and use thoughts and ideas that<br/>\nseem to come through me, yet I don&#39;t own thoughts just like<br/>\nI don&#39;t own the air I breath. I don&#39;t do &quot;mine, his, hers&quot; I<br/>\njust do what is invited to be done in the moment to bring<br/>\nease, peace and joy. We don&#39;t own our thoughts even when<br/>\nthey come from us, so to me it is all ours and all FOR us.<br/>\n<br/>\nYet, we are still separate bodies with ideas and I therefore<br/>\nI understand what you are saying. So, in business reality,<br/>\nKatie promotes hers, I promotes mine. My forum is here to<br/>\nengage parentsÂ who are into what I offer and to promote<br/>\nmy<br/>\nwork. I don&#39;t mind including in my work ideas from other<br/>\ngreat people and it is still what I offer and uniquely<br/>\nNaomi. When parents don&#39;t know or ask for TW,Â I do what<br/>\nI<br/>\ndo, like you said, (my own work) and some of it may sound<br/>\nsimilar to it, and it did sound like it before I knew of<br/>\nKatie. In fact, I learned about TW when a participant in my<br/>\nworkshop said I sounded like her. I didn&#39;t know of her at<br/>\nthe time. So, I followed by reading the book and found it to<br/>\nfit with my work wonderfully.<br/>\n<br/>\nThank you dear one.Â <br/>\n<br/>\nLots of love,<br/>\n<br/>\nNaomi<br/>\n<br/>\nNaomi,<br/>\n<br/>\nThank you for responding to me. I value your time and feel<br/>\nhonored to have your feedback. I to am a practicing<br/>\ntherapist in Phoenix. I have personally been inspired by<br/>\nyour book and work. I found you in my own research working<br/>\nwith my 2 year old! You have a very genuine message. In the<br/>\n&quot;business&quot; world, people get stuck on names. I&#39;d hate to see<br/>\nothers get your business!<br/>\n<br/>\nThank you,<br/>\n<br/>\nMy Best,<br/>\n<br/>\n&#39;Kim Kino<br/>\n<br/>\nDear Kim,<br/>\n<br/>\nThank you for your support and care.<br/>\n<br/>\nNaomi<br/>\n<br/>\nDear Naomi, (about the forum)<br/>\nI will certainly keep that in mind in future posts.Â  It<br/>\ndidn&#39;t even occur to me that that might be a problem.Â <br/>\nThank you for telling me.Â  I can see how doing the Work<br/>\nwithout your resources could be confusing and difficult. In<br/>\nlove,  Rachel Salavon<br/>\n<br/>\nThank you all for the overwhelming support and love.<br/>\n<br/>\nNaomi<br/>\n<br/>\nDear Naomi, (on Crying Babies)<br/>\n<br/>\nI hope you don&#39;t mind me writing but I wanted to say thank<br/>\nyou so much for your article about crying babies. It made me<br/>\nwant to cry actually. My little boy cried so often for the<br/>\nfirst few months of his life. Even when I &quot;discovered&quot; baby<br/>\nwearing and got support with breastfeeding (so he was not<br/>\nhungry) he still continued to cry a lot and I could never<br/>\nwork out why. It didn&#39;t seem &quot;colicky&quot;; he didn&#39;t appear to<br/>\nbe in pain. But many times he would even cry even when I<br/>\nheld him. I was told he was asked, &quot;if he still cries when<br/>\nyou hold him, why bother?&quot; or words to that effect. The<br/>\nworst one was when I went to a breastfeeding support group -<br/>\nBertie screaming and screaming - and one of the Mums sat<br/>\nthere with her smiling, quiet boy on her lap saying &quot;isn&#39;t<br/>\nit true that a breastfed baby is a contented baby?&quot;<br/>\n<br/>\nI felt so guilty that I couldn&#39;t make him contented.<br/>\n<br/>\nAt about four months the crying in the main cleared up, or<br/>\nat least, was soothable by picking up / wearing / nursing. I<br/>\nnever knew what it was. I suspect the difficult and<br/>\nprolonged induced labor didn&#39;t help matters. I was very<br/>\nstressed during my pregnancy too which may have contributed.<br/>\n<br/>\nHe is nearly sixteen months old now. His personality is such<br/>\nthat he is very, very sure of what he wants, and if there is<br/>\neven a few second delay in getting hold of whatever it is,<br/>\nhe shouts and cries with frustration. Needless to say I try<br/>\nto keep delays to a bare minimum! He is usually very happy<br/>\nand cheerful. I wouldn&#39;t say &quot;contented&quot; actually because<br/>\n&quot;contented&quot; means to me a sort of laid-back attitude and you<br/>\ncertainly couldn&#39;t call him &quot;laid-back&quot;; it is an intense<br/>\nkind of happiness, a joy, if you know what I mean.<br/>\n<br/>\nThanks again and I&#39;m looking forward to receiving more of<br/>\nyour newsletters.<br/>\n<br/>\nRuth xx<br/>\n<br/>\nDear Naomi, (about bragging)<br/>\n<br/>\nThank you again for all the gifts of your newsletter!<br/>\nIÂ´ve<br/>\nthought a lot about the competition issue during the last<br/>\nyears and you brought it to the point: all children are our<br/>\nchildren....each achievement is our achievement....no<br/>\nseparation ( that is so painful) possible that way. Peace.<br/>\n<br/>\nLove and gratitude,<br/>\nHeike<br/>\n<br/>\nDear Naomi,<br/>\nthanks for your ongoing inspiring advice!!<br/>\nI just read your last newsletter and was happy to find the<br/>\nPOEM (no. 6) in it I sent to you a while back!! I just<br/>\nwanted to let you and others know that I did not write it<br/>\n(although I wish i did:))), it is a different lady; i have<br/>\nto apologize, i don&#39;t remember her name...!!<br/>\n<br/>\nI am once again struggling with the divide in parenting<br/>\nstyles, or even life styles that my husband and I have! Do<br/>\nyou have any articles on how to deal with a partner who does<br/>\nnot embrace the same parenting style, and who is f.ex.<br/>\ntotally against unschooling in contrast to the mother who is<br/>\nin favor of it!!?!?<br/>\n<br/>\nWith love,<br/>\nAngela Kersten,<br/>\nSouth-Africa<br/>\n<br/>\nDear Angela,<br/>\n<br/>\nThanks for passing on the poem and we honor whoever wrote<br/>\nit.<br/>\n<br/>\nI don&#39;t have an article about husbands who oppose a mother&#39;s<br/>\nparenting. The closest is one from Life Learning Magazine<br/>\nabout this subject, but not reallyÂ about a total<br/>\ndiscord<br/>\nlike you are describing.<br/>\n<br/>\nThe short answer is: You are the Mother!!!!!! You read the<br/>\nbooks, you are with the child/ren. You decide and lead the<br/>\nway. The more helpful answer may be to book yourself a phone<br/>\nsession with me. I have assisted parents with this common<br/>\nissue before. I know it is hard from South Africa. Check<br/>\nNatural Life magazine for my advice columns. I will keep<br/>\nthis theme in mind for a future column.<br/>\n<br/>\nWith love,<br/>\n<br/>\nNaomi<br/>\n<br/>\n4) Naomi&#39;s personal reflections:<br/>\n<br/>\nA week or so ago Oliver (14) said to me, &quot;mom, what happened<br/>\nto our life, it seems all over.&quot; Oliver&#39;s life with a home<br/>\nfull of children and play came to an end sooner because he<br/>\nis the youngest. His older brothers moved on into travel,<br/>\ngirlfriends and work. Although Lennon still lives at home,<br/>\nhe doesn&#39;t really play much any more. When all three kids<br/>\nwere younger I hardly worked and my husband made a point of<br/>\ncoming home early. There were five engaged people at play<br/>\nand life. Now Oliver finds himself an only child of very<br/>\nbusy parents. In a way, the youngest of three experiences<br/>\nthe &quot;emptying of the nest&quot; before he is ready for it.<br/>\n<br/>\nMy personal life is now one of constant surprises and<br/>\nchanges. Yonatan is 22, living with his girlfriend in a<br/>\ncommitted relationship a few hours away from home and<br/>\nplanning to move with her to San Francisco in two years at<br/>\nthe end of college. Lennon has just turned 18 and he too has<br/>\na girlfriend, here in WA state and is therefore committed to<br/>\nstaying here.<br/>\n<br/>\nWe used to move and travel together with the two younger<br/>\nboys for their musical needs. But now, when we think to<br/>\nmoving where Oliver&#39;s life will be enriched, we face leaving<br/>\nthe other boys out of our daily family life and, my husband<br/>\nis unable to move his work... so he too may stay behind.<br/>\n<br/>\nThe rdf TV channel from England has done a search of the top<br/>\nmusical prodigies in the world and chose Oliver as one of<br/>\nthe few. (If you think this is bragging, please reread the<br/>\nlast two newsletters.) He will perform two concerts in Miami<br/>\nFlorida which will be broadcasted (with an interview) in<br/>\nEngland and possibly internationally.  Oliver may also be<br/>\nperforming in London... and who knows where this may lead.<br/>\n<br/>\nSo, fourteen years after the birth of our third baby, our<br/>\nnest is not empty, but moving in the wind of individual<br/>\nopportunities and human connections (girlfriends.)<br/>\n<br/>\nThey are ready. Am I??? Are you??? I look at the swing set<br/>\nin the yard; most of the time the swings are empty and only<br/>\nthe wind pushes them lightly. The sand pile has grown grass.<br/>\nThe scooters are rusting.  Except for the times when a<br/>\nfamily is here for counseling and their children play, the<br/>\nyard tells a story of the past.<br/>\n<br/>\nThe expansion is exciting; like a creek that merges with<br/>\nother streams to become a river our kids are bringing into<br/>\nour home their friends&#39; families and our lives are richer<br/>\nand growing.<br/>\n<br/>\nWhy am I sharing these reflections? First, to simply share<br/>\nmy life with you and connect with you. In addition, I think<br/>\nthat sometimes we forget to cherish the moment, and then it<br/>\nmoves on and parents say, &quot;I wish I spent more time with my<br/>\nchildren when they were young.&quot; Our family ride is not<br/>\ntypical. Yet, the principal of surprise will be there for<br/>\neveryone.<br/>\n<br/>\nIt is fine to find ways to nurture yourself away from your<br/>\nchild. But, when not available, enjoy the ride. If you knew<br/>\nhow close the end of this period is, maybe it would be<br/>\neasier to relax and enjoy each moment. Discover that time<br/>\nfor yourself, is time with your child. Being with your child<br/>\nis the way your nurture yourself; it is a treat available<br/>\nfor a fleeting moment; it is the gift you chose to give to<br/>\nyourself by bringing this child/ren into your life.<br/>\n<br/>\nBeing with the joys of mothering now is fulfilling. Fearing<br/>\nthat you are missing something (or needing a clean house) is<br/>\npainful. When the children become independent, you will find<br/>\nthat your interests have changed anyway, or that you can<br/>\npick them up further than where you left them. These former<br/>\nskills may or may not be relevant to you any more. Life<br/>\nmoves only forward. Attaching to the past hurts and<br/>\nseparates us from the happy moment of now and now and now.<br/>\nWithout the wish to do something else, you love the moment<br/>\nfully and peacefully. Enjoy it. Like the rest of life, it is<br/>\na passing ride that gives no second chance.<br/>\n<br/>\nWith love,<br/>\n<br/>\nNaomi                  Â©Copyright Naomi Aldort<br/>\n<br/>\n<br/>\nNaomi Aldort Ph.D.<br/>\nAuthor, Raising Our Children, Raising Ourselves<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://naomialdort.com/book.html\">http://naomialdort.com/book.html</a><br/>\nParenting counseling and workshops<br/>\nFacilitator of The Work of Byron Katie<br/>\n<br/>\nPOB 1719 Eastsound, WA 98245, USA<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:naomi@...\">naomi@...</a><br/>\n<br/>\nTransforming parent-child relationships from reaction and<br/>\nstruggle to Freedom, Power and Joy.<br/>\n<br/>\n<br/>\nIf you no longer wish to receive communication from us:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://autocontactor.com/app/r.asp?ID=1002130386&ARID=0&D=\">http://autocontactor.com/app/r.asp?ID=1002130386&ARID=0&D=</a><br/>\n<br/>\nTo update your contact information:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://autocontactor.com/app/r.asp?c=1&ID=1002130386&D=\">http://autocontactor.com/app/r.asp?c=1&ID=1002130386&D=</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":35188,"nextTopicId":35095}}