{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Learning objectives","postDate":"1350517307","msgId":49169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1bmZucit0dnNwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1a2hoaytocWIxQGVHcm91cHMuY29tPg=="},"prevInTopic":49163,"nextInTopic":0,"prevInTime":49168,"nextInTime":49170,"topicId":49156,"numMessagesInTopic":0,"msgSnippet":"... *************** One of the fundamental principles of unschooling is that a person s perspective utterly effects learning - it can t Not effect learning. So","messageBody":"<div id=\"ygrps-yiv-1503383241\">&quot;Sunny&quot; &lt;sunny_sof@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How do unschoolers see the role of a teacher&#39;s learning objectives/agenda meshing with unschooling and learner-led learning? <br/>\n </span></blockquote>***************<br/>\n<br/>\nOne of the fundamental principles of unschooling is that a person&#39;s perspective utterly effects learning - it can&#39;t Not effect learning. So a teacher&#39;s learning objectives are only valid in as much as they intersect with the Learners objectives in the moment. If a person chooses to be taught, then that person may aquiesce to a teachers objectives... but of course the hallmark of good teaching is the ability to modify those objectives along with other attributes of teaching to meet the specific needs of the student(s). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I learned how to knit from an older auntie. She agreed to teach me, and started lessons but with very specific &quot;lesson plans&quot; that were designed to build on the skills she thought were necessary to learn to knit - first casting on, knit stitches, purl stiches, casting off.<br/>\n </span></blockquote>***************<br/>\n<br/>\nStarting with casting on is common, but totally unnecessary and in some cases highly unproductive. Lots of people learn to cast on but not knit. I&#39;ve sometimes cast on and knit half a dozen rows for someone so he or she can start with knitting without having to deal with that extra-hard stage for novices: knitting the first couple rows without twisting them. I also usually show people how to pick up stitches, do simple adds and decreases before switching to purling or casting off - this lets some people feel safe and secure if they get to end of a row and find they have the wrong number of stitches. I don&#39;t recommend anyone learn how to purl until he or she is comfortable knitting... but that&#39;s not a hard and fast rule since some people find purling easier than knitting and some get more satisfaction of learning to knit stockingette from the start. <br/>\n<br/>\nIn any case, that&#39;s a fair example of what I mean by modifying the objectives etc to the needs of the learner - I ask questions, try to gain an understanding of the other person&#39;s objectives and then solicit feedback as to what&#39;s working for them, what they want, how they&#39;re feeling about things. And that&#39;s true whether the person who has asked me to teach is 5 or 50. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; In teacher training, the idea that you need to have lesson objectives in order to plan your lessons is emphasized, and that the teacher as &quot;expert&quot; has a better sense of how skills need to be introduced, or in what order, or what level of mastery a student should have before moving on.<br/>\n </span></blockquote>*************<br/>\n<br/>\nUh huh, and that works for 100% of students all the time, does it? No, of course not, not unless you&#39;re very good at modifying all those expectations based on the needs of individual students... which isn&#39;t always possible even in a class of people (of any age) who have chosen to be there. But people who are in a class voluntarily at least have the option of saying &quot;this isn&#39;t working for me&quot; and leaving. If a child is being Required to attend a class, he or she doesn&#39;t have that option. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;As a novice in a particular field, I HAVE to rely on someone else&#39;s judgement of where to begin, although of course as I learn more, I will be able to apply my own insights.<br/>\n </span></blockquote>**************<br/>\n<br/>\nRubbish. I&#39;ve learned an impressive number of things without relying on someone else&#39;s judgement as to where to begin. Sometimes I&#39;ve gotten help later in the process, but not always. And my kids learn a vast amount without relying on other people telling them where to start - even when they&#39;ve chosen to learn directly from other people they often do that as step two or three (as it were) of their learning process. Not because they started in the &quot;wrong place&quot; but because they found some part of what they wanted to learn which was easier learned in person. For them. At that particular moment. Other times they use books, videos, the internet, and personal experience to learn. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Does unschooling differ in its approach from this conventional teacher-student relationship<br/>\n </span></blockquote>************<br/>\n<br/>\nYes. Totally. It&#39;s better to think of unschooling as a whole different paradigm of learning than an educational approach at all. In unschooling, learning is most often a side effect of people living their lives, it is ubiquitous and personal. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":506344661,"authorName":"fundayeveryday","from":"fundayeveryday &lt;kristenssrr@...&gt;","profile":"kristenssrr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Learning objectives","postDate":"1350480538","msgId":49163,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTA0ODA1MzguMjQzNTguWWFob29NYWlsTmVvQHdlYjEyNTMwMy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDZDNDcyOTk3LTQzNUQtNDAyNS04MzFDLUUzMkY2MENENEIzOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGs1a2hoaytocWIxQGVHcm91cHMuY29tPiA8NkM0NzI5OTctNDM1RC00MDI1LTgzMUMtRTMyRjYwQ0Q0QjM5QHZlcml6b24ubmV0Pg=="},"prevInTopic":49160,"nextInTopic":49169,"prevInTime":49162,"nextInTime":49164,"topicId":49156,"numMessagesInTopic":0,"msgSnippet":"I am thankful that someone asked this question and appreciate this particular response...thank you..well written. Kristen From: Joyce Fetteroll","messageBody":"<div id=\"ygrps-yiv-963947530\">I am thankful that someone asked this question and appreciate this particular response...thank you..well written.<br/>\nKristen<br/>\n<br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Tuesday, October 16, 2012 10:05 PM<br/>\nSubject: Re: [unschoolingbasics] Learning objectives<br/>\n<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 16, 2012, at 4:54 PM, Sunny wrote:<br/>\n<br/>\n&gt; I guess I am wondering if unschooling is actually a pedagogical method, or not.<br/>\n<br/>\nNot.<br/>\n<br/>\nUnschooling is creating an environment that supports a child learning through exploring what interests them. The form the learning takes will depend on what the child feels suits his needs. The child may continue with a particular form for a few minutes or a lifetime. The child gets to decide in each moment if how he&#39;s learning is worth continuing. The learning might look like asking someone to show them how to do something. It might look like watching a TV show. It might look like a conversation. It might look like staring up into the sky ;-)<br/>\n<br/>\n&gt; She agreed to teach me, and started lessons but with very specific <br/>\n&gt; &quot;lesson plans&quot; that were designed to build on the skills she thought <br/>\n&gt; were necessary to learn to knit - first casting on, knit stitches, purl <br/>\n&gt; stiches, casting off. As the expert in knitting, I trusted her judgement<br/>\n&gt; in what skills I needed to master before moving on, and how well I <br/>\n&gt; had to do those things before she would move on to the next step.<br/>\n<br/>\nThat we higher order mammals naturally learn by pulling patterns from the world around us isn&#39;t in any way connected to how someone might want to impart their knowledge. If someone wants to impart knowledge in a step by step way that desire has everything to do with them and nothing to do with the learner. If a learner deciders they want to learn from someone who is sharing their knowledge step by step, that&#39;s their choice.<br/>\n<br/>\nIn school, of course, kids don&#39;t have a choice. They&#39;re made to pay attention while someone goes step by step.<br/>\n<br/>\n&gt; In teacher training, the idea that you need to have lesson objectives in order to plan your lessons is emphasized<br/>\n<br/>\nIf you have 30 students and a requirement to get a particular amount of some specific information into them in a set time, it would be foolish not to have a plan. ;-)<br/>\n<br/>\n&gt; and that the teacher as &quot;expert&quot; has a better sense of how<br/>\n&gt; skills need to be introduced, or in what order, or what level<br/>\n&gt; of mastery a student should have before moving on.<br/>\n<br/>\n*If* there&#39;s a room full of 30 students with the above requirements, yes.<br/>\n<br/>\nWhere teachers get confused by unschooling is in assuming that people need to understand one step before they can move onto the next step. And believing that understanding can be taught.<br/>\n<br/>\nA good example is the step by step teaching of a foreign language. Kids are taught everything in a particular order and they don&#39;t move on until they&#39;ve &quot;mastered&quot; what they&#39;ve been taught. In fact they can&#39;t move on in a classroom since the learning is based on what came before.<br/>\n<br/>\nBut how well do most students learn that language? Do they have a knowledge they can actually use?<br/>\n<br/>\nIn real life, kids learn their native language in no order. They use it with a flawed understanding. They get feedback. They improve. But they improve not for the sake of improvement. They use it because it&#39;s useful. They improve because they use it.<br/>\n<br/>\nAfter 2 years kids *do* understand a fair amount of what&#39;s being said to them in their native language. Kids learning in school generally have a very limited understanding that soon fades.<br/>\n<br/>\n&gt; but the HOW (ie the lesson contents) seems a bit mushy to me. <br/>\n<br/>\nIt is mushy because someone who is learning naturally isn&#39;t moving towards a particular goal. They&#39;re pulling in what they need, what they find interesting. It might be a little. It might be a lot. It&#39;s rarely &quot;balanced&quot; as it might be in school, but it&#39;s highly functional for what the child wants it for.<br/>\n<br/>\nJust as a child learning to speak isn&#39;t moving towards a particular goal. They aren&#39;t trying to acquire English language competency. They&#39;re asking for juice. They&#39;re asking for someone to Look! See!. They&#39;re telling stories. As a side effect of using it they learn. And they learn far more effectively than someone being taught step by step in a class room.<br/>\n<br/>\n&gt; I can seek out an &quot;expert&quot; in a particular area- a person<br/>\n&gt; with the knowledge or skills, but I defer to their experience<br/>\n&gt; in how to best acquire it and what topics are most essential to learn.<br/>\n<br/>\nThat&#39;s a choice you made to let someone else decide what path to take.<br/>\n<br/>\n*If* someone wants a specific chunk of knowledge in a short amount of time, that&#39;s a quick way to get it.<br/>\n<br/>\nBut unless the knowledge is physical -- like learning to knit, learning TaeKwon Do, learning how to make bread -- what people generally end up with is a chunk of memorized knowledge. The knowledge can look like understanding but it&#39;s generally only parroting back someone else&#39;s understanding. And if it isn&#39;t used most of it fades.<br/>\n<br/>\n&gt; As a novice in a particular field, I HAVE to rely on someone<br/>\n&gt; else&#39;s judgement of where to begin, although of course as<br/>\n&gt; I learn more, I will be able to apply my own insights.<br/>\n<br/>\nYou *believe* you have to rely on someone. You *choose* to rely on someone. You don&#39;t *have to*.<br/>\n<br/>\nIt&#39;s incredibly freeing to realize everything is a choice:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nWhere your thinking is getting stuck is you&#39;re seeing acquiring a particular body of knowledge as the only learning that&#39;s valuable. That&#39;s understandable since you&#39;ve been living it for a couple of decades. You&#39;ve been judged almost exclusively on how well you can memorize. Everyone around you believes that&#39;s the most valuable kind of learning.<br/>\n<br/>\nWhich is why it&#39;s so hard to grasp unschooling. Unschooling doesn&#39;t look like memorizing knowledge. It looks chaotic. It looks like it&#39;s not headed in any particular direction.<br/>\n<br/>\nAnd yet it &quot;works&quot;. Through unschooling each individual child learns what that child needs to be who they are and grow into who they are drawn to be.<br/>\n<br/>\nIt doesn&#39;t &quot;work&quot; as school does. It doesn&#39;t give a child a specific chunk of knowledge. Which is why some people can&#39;t understand unschooling. The goals are different. The definition of &quot;works&quot; is different.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Learning objectives","postDate":"1350440242","msgId":49160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTA0NDAyNDIuNTQ0MDMuWWFob29NYWlsTmVvQHdlYjg3OTAxLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGs1a2hoaytocWIxQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1a2hoaytocWIxQGVHcm91cHMuY29tPg=="},"prevInTopic":49159,"nextInTopic":49163,"prevInTime":49159,"nextInTime":49161,"topicId":49156,"numMessagesInTopic":0,"msgSnippet":"Unschooling isn t a structured approach. So, to use your example of knitting, there wouldn t be a set series of skills acquired that necessarily lead on to","messageBody":"<div id=\"ygrps-yiv-1524306639\">Unschooling isn&#39;t a structured approach. So, to use your example of knitting, there wouldn&#39;t be a set series of skills acquired that necessarily lead on to knitting proficiency. I learned to knit by looking in books and having a go and then when I didn&#39;t think it was quite right I asked for advice and got a little but mostly I watched other people knit and that&#39;s how I learned to knit. I did a similar approach to ukulele playing and to bread making, less watching other people and more tasting, but similar. A lot of the people I watch put videos up on youtube. And I stop and start a lot. Some things I stop completely and other things I put aside for awhile. <br/>\n<br/>\nSimon and Linnaea learn much the same way. They pick up things as they go along, mostly, but if there is a specific skill or interest that they want to pursue, like roller skating, they get out and do it and watch others and screw up a bit and do it and think about it and do it and then they are skating. <br/>\n<br/>\nI struggle, mightily, with someone else defining how I learn something. Working to someone else&#39;s schedule, or learning scaffolding, or framework frustrates and bores me. When I first started learning to play the ukulele a friend was learning guitar. While I was screwing around with strumming and finding songs I knew and liked and playing those, he was working on scales and practising at specific times a day. When I got bored with what I was doing and started looking for more and varied ways to play, ways that were way beyond my ability to play them, different from the basics, he was learning to read sheet music and playing only the beginner songs. I would have quit. I wouldn&#39;t still be playing ukulele 2 years on if I had relied on someone else teaching me how to play ukulele. <br/>\n<br/>\nAll that said, Simon and Linnaea are in a golf class and enjoy and appreciate the instruction. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Sunny &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sunny_sof@...\">sunny_sof@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Wednesday, 17 October 2012, 6:54<br/>\nSubject: [unschoolingbasics] Learning objectives<br/>\n <br/>\n<br/>\n  <br/>\nHow do unschoolers see the role of a teacher&#39;s learning objectives/agenda meshing with unschooling and learner-led learning? <br/>\n<br/>\nHere&#39;s my example: when I was younger, I learned how to knit from an older auntie. She agreed to teach me, and started lessons but with very specific &quot;lesson plans&quot; that were designed to build on the skills she thought were necessary to learn to knit - first casting on, knit stitches, purl stiches, casting off. As the expert in knitting, I trusted her judgement in what skills I needed to master before moving on, and how well I had to do those things before she would move on to the next step.<br/>\n<br/>\nIn teacher training, the idea that you need to have lesson objectives in order to plan your lessons is emphasized, and that the teacher as &quot;expert&quot; has a better sense of how skills need to be introduced, or in what order, or what level of mastery a student should have before moving on. I can totally understand the unschooling view that a learner needs to WANT to learn about a particular topic, but the HOW (ie the lesson contents) seems a bit mushy to me. I can seek out an &quot;expert&quot; in a particular area- a person with the knowledge or skills, but I defer to their experience in how to best acquire it and what topics are most essential to learn. As a novice in a particular field, I HAVE to rely on someone else&#39;s judgement of where to begin, although of course as I learn more, I will be able to apply my own insights.<br/>\n<br/>\nDoes unschooling differ in its approach from this conventional teacher-student relationship, other than the fact that its a consensual relationship? I guess I am wondering if unschooling is actually a pedagogical method, or not.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Learning objectives","postDate":"1350439526","msgId":49159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDNDcyOTk3LTQzNUQtNDAyNS04MzFDLUUzMkY2MENENEIzOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGs1a2hoaytocWIxQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1a2hoaytocWIxQGVHcm91cHMuY29tPg=="},"prevInTopic":49156,"nextInTopic":49160,"prevInTime":49158,"nextInTime":49160,"topicId":49156,"numMessagesInTopic":0,"msgSnippet":"... Not. Unschooling is creating an environment that supports a child learning through exploring what interests them. The form the learning takes will depend","messageBody":"<div id=\"ygrps-yiv-37259049\">On Oct 16, 2012, at 4:54 PM, Sunny wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I am wondering if unschooling is actually a pedagogical method, or not.<br/>\n<br/>\n </span></blockquote>Not.<br/>\n<br/>\nUnschooling is creating an environment that supports a child learning through exploring what interests them. The form the learning takes will depend on what the child feels suits his needs. The child may continue with a particular form for a few minutes or a lifetime. The child gets to decide in each moment if how he&#39;s learning is worth continuing. The learning might look like asking someone to show them how to do something. It might look like watching a TV show. It might look like a conversation. It might look like staring up into the sky ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She agreed to teach me, and started lessons but with very specific <br/>\n&gt; &quot;lesson plans&quot; that were designed to build on the skills she thought <br/>\n&gt; were necessary to learn to knit - first casting on, knit stitches, purl <br/>\n&gt; stiches, casting off. As the expert in knitting, I trusted her judgement<br/>\n&gt; in what skills I needed to master before moving on, and how well I <br/>\n&gt; had to do those things before she would move on to the next step.<br/>\n<br/>\n </span></blockquote>That we higher order mammals naturally learn by pulling patterns from the world around us isn&#39;t in any way connected to how someone might want to impart their knowledge. If someone wants to impart knowledge in a step by step way that desire has everything to do with them and nothing to do with the learner. If a learner deciders they want to learn from someone who is sharing their knowledge step by step, that&#39;s their choice.<br/>\n<br/>\nIn school, of course, kids don&#39;t have a choice. They&#39;re made to pay attention while someone goes step by step.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In teacher training, the idea that you need to have lesson objectives in order to plan your lessons is emphasized<br/>\n<br/>\n<br/>\n </span></blockquote>If you have 30 students and a requirement to get a particular amount of some specific information into them in a set time, it would be foolish not to have a plan. ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  and that the teacher as &quot;expert&quot; has a better sense of how<br/>\n&gt; skills need to be introduced, or in what order, or what level<br/>\n&gt; of mastery a student should have before moving on.<br/>\n<br/>\n<br/>\n </span></blockquote>*If* there&#39;s a room full of 30 students with the above requirements, yes.<br/>\n<br/>\nWhere teachers get confused by unschooling is in assuming that people need to understand one step before they can move onto the next step. And believing that understanding can be taught.<br/>\n<br/>\nA good example is the step by step teaching of a foreign language. Kids are taught everything in a particular order and they don&#39;t move on until they&#39;ve &quot;mastered&quot; what they&#39;ve been taught. In fact they can&#39;t move on in a classroom since the learning is based on what came before.<br/>\n<br/>\nBut how well do most students learn that language? Do they have a knowledge they can actually use?<br/>\n<br/>\nIn real life, kids learn their native language in no order. They use it with a flawed understanding. They get feedback. They improve. But they improve not for the sake of improvement. They use it because it&#39;s useful. They improve because they use it.<br/>\n<br/>\nAfter 2 years kids *do* understand a fair amount of what&#39;s being said to them in their native language. Kids learning in school generally have a very limited understanding that soon fades.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but the HOW (ie the lesson contents) seems a bit mushy to me. <br/>\n<br/>\n<br/>\n </span></blockquote>It is mushy because someone who is learning naturally isn&#39;t moving towards a particular goal. They&#39;re pulling in what they need, what they find interesting. It might be a little. It might be a lot. It&#39;s rarely &quot;balanced&quot; as it might be in school, but it&#39;s highly functional for what the child wants it for.<br/>\n<br/>\nJust as a child learning to speak isn&#39;t moving towards a particular goal. They aren&#39;t trying to acquire English language competency. They&#39;re asking for juice. They&#39;re asking for someone to Look! See!. They&#39;re telling stories. As a side effect of using it they learn. And they learn far more effectively than someone being taught step by step in a class room.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can seek out an &quot;expert&quot; in a particular area- a person<br/>\n&gt; with the knowledge or skills, but I defer to their experience<br/>\n&gt; in how to best acquire it and what topics are most essential to learn.<br/>\n<br/>\n </span></blockquote>That&#39;s a choice you made to let someone else decide what path to take.<br/>\n<br/>\n*If* someone wants a specific chunk of knowledge in a short amount of time, that&#39;s a quick way to get it.<br/>\n<br/>\nBut unless the knowledge is physical -- like learning to knit, learning TaeKwon Do, learning how to make bread -- what people generally end up with is a chunk of memorized knowledge. The knowledge can look like understanding but it&#39;s generally only parroting back someone else&#39;s understanding. And if it isn&#39;t used most of it fades.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As a novice in a particular field, I HAVE to rely on someone<br/>\n&gt; else&#39;s judgement of where to begin, although of course as<br/>\n&gt; I learn more, I will be able to apply my own insights.<br/>\n<br/>\n<br/>\n </span></blockquote>You *believe* you have to rely on someone. You *choose* to rely on someone. You don&#39;t *have to*.<br/>\n<br/>\nIt&#39;s incredibly freeing to realize everything is a choice:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nWhere your thinking is getting stuck is you&#39;re seeing acquiring a particular body of knowledge as the only learning that&#39;s valuable. That&#39;s understandable since you&#39;ve been living it for a couple of decades. You&#39;ve been judged almost exclusively on how well you can memorize. Everyone around you believes that&#39;s the most valuable kind of learning.<br/>\n<br/>\nWhich is why it&#39;s so hard to grasp unschooling. Unschooling doesn&#39;t look like memorizing knowledge. It looks chaotic. It looks like it&#39;s not headed in any particular direction.<br/>\n<br/>\nAnd yet it &quot;works&quot;. Through unschooling each individual child learns what that child needs to be who they are and grow into who they are drawn to be.<br/>\n<br/>\nIt doesn&#39;t &quot;work&quot; as school does. It doesn&#39;t give a child a specific chunk of knowledge. Which is why some people can&#39;t understand unschooling. The goals are different. The definition of &quot;works&quot; is different.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":101111430,"authorName":"Sunny","from":"&quot;Sunny&quot; &lt;sunny_sof@...&gt;","profile":"sunny_sof","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Learning objectives","postDate":"1350420852","msgId":49156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1a2hoaytocWIxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49159,"prevInTime":49155,"nextInTime":49157,"topicId":49156,"numMessagesInTopic":0,"msgSnippet":"How do unschoolers see the role of a teacher s learning objectives/agenda meshing with unschooling and learner-led learning? Here s my example: when I was","messageBody":"<div id=\"ygrps-yiv-1802715073\">How do unschoolers see the role of a teacher&#39;s learning objectives/agenda meshing with unschooling and learner-led learning? <br/>\n<br/>\nHere&#39;s my example: when I was younger, I learned how to knit from an older auntie. She agreed to teach me, and started lessons but with very specific &quot;lesson plans&quot; that were designed to build on the skills she thought were necessary to learn to knit - first casting on, knit stitches, purl stiches, casting off. As the expert in knitting, I trusted her judgement in what skills I needed to master before moving on, and how well I had to do those things before she would move on to the next step.<br/>\n<br/>\nIn teacher training, the idea that you need to have lesson objectives in order to plan your lessons is emphasized, and that the teacher as &quot;expert&quot; has a better sense of how skills need to be introduced, or in what order, or what level of mastery a student should have before moving on. I can totally understand the unschooling view that a learner needs to WANT to learn about a particular topic, but the HOW (ie the lesson contents) seems a bit mushy to me. I can seek out an &quot;expert&quot; in a particular area- a person with the knowledge or skills, but I defer to their experience in how to best acquire it and what topics are most essential to learn. As a novice in a particular field, I HAVE to rely on someone else&#39;s judgement of where to begin, although of course as I learn more, I will be able to apply my own insights.<br/>\n<br/>\nDoes unschooling differ in its approach from this conventional teacher-student relationship, other than the fact that its a consensual relationship? I guess I am wondering if unschooling is actually a pedagogical method, or not.</div>","specialLinks":[]}],"prevTopicId":49150,"nextTopicId":49161}}