{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":221315529,"authorName":"hmsdragonfly","from":"&quot;hmsdragonfly&quot; &lt;hmsdragonfly@...&gt;","profile":"hmsdragonfly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: challenged mother in need of perspective change","postDate":"1200167115","msgId":28829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZtYjVjYitya2RtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDgwMTEwMTgzN2wyNTRmMDE0M3BiODI1OTJjNzc3MWFiMjI3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":28827,"nextInTopic":0,"prevInTime":28828,"nextInTime":28830,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"... You said you wanted a perspective change. I recommend starting with the above. You had a bad moment. That s all. The joyful family life is still there. You","messageBody":"<div id=\"ygrps-yiv-1962818041\">--- Faith Void wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I thought of a question: How can I reestablish healthy boundaries <br/>\n&gt; and get back to a joyful family life with resorting to coercion?<br/>\n<br/>\n </span></blockquote>You said you wanted a perspective change. I recommend starting with <br/>\nthe above. You had a bad moment. That&#39;s all. The joyful family life <br/>\nis still there. You only have to step back into it, and doing *that* <br/>\nis as easy as doing something fun with your kids. It doesn&#39;t have to <br/>\nbe anything fancy: make a pig pile, build a fort, snuggle together <br/>\nfor a while. Simply start fresh.<br/>\n<br/>\nI&#39;m not saying you pretend the bad moment never happened. Maybe you <br/>\nneed to talk to your kids about it, and maybe you can learn something <br/>\nfrom it that will prevent or help you with the next time. But <br/>\nreconnecting with your kids takes one small step in the right <br/>\ndirection. And then another. And then another.<br/>\n<br/>\nHere is what I try for when I&#39;m &quot;in the moment.&quot;<br/>\n<br/>\n* Breathe. Except when someone is in peril, there is always time for <br/>\na deep breath -- and I&#39;m not talking about that big breath one takes <br/>\nbefore you letting fly with some yelling. ;-) I take a deep breath <br/>\nand feel where it goes, paying attention to its effect on the tense <br/>\nspots in my shoulders, stomach, and neck (in that order, evidently, <br/>\nsince that&#39;s where I felt it when I did it just now). As I exhale, I <br/>\nrelax those tense spots even more, and then...<br/>\n<br/>\n* Decide if I am capable of empathy yet, and if I&#39;m not, I buy some <br/>\ntime. (Remember, there is no immediate peril. You can have more <br/>\ntime.) I think or say something like, &quot;I need a minute here. I&#39;m <br/>\nfeeling really tense and helpless, and I&#39;m worried I&#39;m going to lose <br/>\nmy temper.&quot; I had a therapist describe this as building a box around <br/>\nthe emotions. I haven&#39;t shut them off, and the box isn&#39;t to be used <br/>\nfor shoving them into some dusty attic that they might later escape <br/>\nfrom. It&#39;s a place where I can look at them, get a little distance <br/>\nfrom them, and start to be more objective. <br/>\n<br/>\n* Still not there? I leave the room. I worry about my kids feeling <br/>\nabandoned with their big feelings, so I try to preface this <br/>\nwith &quot;I&#39;ll be right back,&quot; but I don&#39;t always manage it. Just the <br/>\nother night, I was irritated with Chloe and sort of stomped up the <br/>\nstairs to my room. She can have been in no doubt as to my state of <br/>\nmind. ;-) But we&#39;ve been together a long time now, and she also <br/>\nwasn&#39;t surprised when I returned a few minutes later in a more <br/>\ncheerful mindset. Once I&#39;ve had my timeout and I&#39;m ready to <br/>\nempathize...<br/>\n<br/>\n* I think about what this situation looks like for my child. I get <br/>\ninto her shoes. I think &quot;All she wants is ___________&quot; and fill in <br/>\nthe blank. In my experience, whatever it is that goes in that blank <br/>\nwill not be unreasonable.<br/>\n<br/>\n* We move on to finding solutions.<br/>\n<br/>\n--- Joyce Fetteroll wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; A lot of times, anger and frustration come from a feeling of not  <br/>\n&gt; being in control of your life. Could that be it? (snip)<br/>\n&gt; Here&#39;s something Scott Noelle wrote a few days ago...<br/>\n<br/>\n </span></blockquote>I have a quote for this, too:<br/>\n<br/>\n&quot;Sooner or later we will come to the edge of all that we can control <br/>\nand find life, waiting there for us.&quot;  Rachel Naomi Remen, M.D.<br/>\n<br/>\nI first read that six or seven years ago. It jumped off the page <br/>\nof &quot;My Grandfather&#39;s Blessings&quot; to smack me upside the head. :-)<br/>\n<br/>\nHope something in there helps!<br/>\nRonnie<br/>\nwww.zombieprincess.blogspot.com</div>","specialLinks":[]},{"userId":122041763,"authorName":"natasha lawson","from":"natasha lawson &lt;nlawson2@...&gt;","profile":"nlawson2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: challenged mother in need of perspective change","postDate":"1200154074","msgId":28827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNDkyMy40NTgwNi5xbUB3ZWI1NDUwNi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":28824,"nextInTopic":28829,"prevInTime":28826,"nextInTime":28828,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for sharing from your heart.  I can definitely relate to what you are feeling.  I have found that when I am frustrated and/or angry it is","messageBody":"<div id=\"ygrps-yiv-1818505005\">Thanks so much for sharing from your heart.  I can definitely relate to what you are feeling.  I have found that when I am frustrated and/or angry it is usually because I have not given myself the time and attention I need.  This is very important to do.  I have also realized that when I was working outside of the home, I felt purposeful and connected in some way.  What I have had to remind myself is that the time that I am investing in my family at this time takes purpose and is a worthy aspiration.  Making time and taking it to do the things I enjoy doing most for myself is what I am going to do to stay connected with other adults.  Thanks again for sharing.  Congratulations on taking the steps to homeschool your children.  Remember that when you decide to step out of the familiar, you will most often meet resistance.  We are all in this fight together.  STAY STRONG and TAKE COURAGE!<br/>\n   <br/>\n   <br/>\n<br/>\n<br/>\nNatasha Lawson<br/>\n  www.pamperedchef.biz/nlawson <br/>\n  301-420-3367<br/>\n  &quot;Change your thoughts and you change your world.&quot;     Norman Vincent Peale <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNever miss a thing.   Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: challenged mother in need of perspective change","postDate":"1200069260","msgId":28816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDgwMTExMDgzNHM2MGMwNjZkYnAxMzc0OTIyNjY3OTk1ZmUyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQxMjA4Mi4xOTcwOS5xbUB3ZWI1NjEwMi5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDU0MzYyNC4xNTMyMC5xbUB3ZWI1NDEwMy5tYWlsLnJlMi55YWhvby5jb20+CSA8NDEyMDgyLjE5NzA5LnFtQHdlYjU2MTAyLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":28815,"nextInTopic":28824,"prevInTime":28815,"nextInTime":28817,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"The times when I have flown off the handle have almost always been times when I have felt out of control of something or another.  From simple causes like","messageBody":"<div id=\"ygrps-yiv-915348097\">The times when I have flown off the handle have almost always been times<br/>\nwhen I have felt out of control of something or another.  From simple causes<br/>\nlike sleep-deprivation or hunger to feeling pressured at my job to money.<br/>\nOften, it&#39;s a combination.<br/>\n<br/>\nAnd for some reason, I&#39;m always giving away my &quot;power&quot; so that I am more<br/>\nhelpless.<br/>\n<br/>\n--Rob Saxon<br/>\nDH to Seana for 11 years<br/>\n&quot;Daddy!&quot; to Elissa (4.5-ish) and Genevieve (6)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: challenged mother in need of perspective change","postDate":"1200068628","msgId":28815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMjA4Mi4xOTcwOS5xbUB3ZWI1NjEwMi5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDU0MzYyNC4xNTMyMC5xbUB3ZWI1NDEwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":28814,"nextInTopic":28816,"prevInTime":28814,"nextInTime":28816,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"PHEWWW glad to knowt that I am not the only person to do this!! love ya for mentioned it and what perfect timing to hear it!!! Jodi Bezzola","messageBody":"<div id=\"ygrps-yiv-713804697\">PHEWWW glad to knowt that I am not the only person to do this!! love ya for mentioned it and what perfect timing to hear it!!!<br/>\n<br/>\nJodi Bezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:          Hi Faith,<br/>\n<br/>\nI just want to say that I appreciate SO much the honesty of your post, because I can completely relate to your issue. We have been quite disconnected lately as well, with lots of stress from inside and outside our family unit. We visited my sister and family which always takes me some emotional recovery time, then we were hit with the flu on the car trip home (nothing like puking kids in the car to push my buttons, don&#39;t know about you!).<br/>\n<br/>\nI have felt my patience and compassion seeping away over the last 5 days of being isolated with my kids, being sick myself and not being able to get the rest I need, and this angry, resentful attitude taking its place and yesterday I started to yell at the girls. I was bawling about it in regret shortly thereafter when I looked into their little faces and saw how confused they were - just feeling yucky and wanting me to be the mature one and I was the one throwing a fit. I ended up in that place again today, and we all ended up on the bed today crying and reading books, with them saying &#39;don&#39;t cry mommy just read&#39;. Thank god my dh could swing home for an hour and let me sleep and have them cling to him for awhile, then I could get up and be a much more kind and compassionate mom.<br/>\n<br/>\nI want to say thank you Pam as well for the practice you suggested - it comes at a much needed time for me as well! I know there isn&#39;t just one thing that makes it a black and white issue for me as learning to deal with anger is a work in progress for me. I now understand that feeling the rage does feel more powerful in the moment (and can be quite addicting) and it takes work and effort and mindfulness to be willing to feel the hurt, the sadness, the powerlessness that comes when I breathe and am conscious of my kids and my own experience and how hard it is sometimes to be a parent and not be able to put myself first. Thank god I&#39;m willing to learn. Thanks for being out there working on this stuff too.<br/>\n<br/>\nGood night :o)<br/>\nJodi <br/>\n<br/>\n<br/>\n<br/>\nPamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 10, 2008, at 6:37 PM, Faith Void wrote:<br/>\n<br/>\n&gt; I thought of a question: How can I reestablish healthy boundaries and<br/>\n&gt; get back to a joyful family life with resorting to coercion?<br/>\n<br/>\nThis may sound silly, but every time you feel your temper rising, make <br/>\nyourself get down and look into your child&#39;s eyes and make yourself <br/>\nsmile with love. That&#39;ll short-circuit the pattern. Tell yourself, <br/>\nthroughout the day, &quot;If I feel my temper rising, I am going to <br/>\nremember to make direct eye contact and smile and think how much I <br/>\nlove that kid BEFORE I react any other way.&quot; Be prepared - you might <br/>\nforget to do it. If you do, don&#39;t spend too much time berating <br/>\nyourself, it just shows this is going to be a bit hard and take some <br/>\neffort for you. Recognize that - then remind yourself that next time <br/>\nyou&#39;re going to do it. Do it whenever you remember - the positive <br/>\nresults will be reinforcing and it will become a habit. Just don&#39;t <br/>\ngive up if you aren&#39;t immediately perfect - ease into it so that it <br/>\nbecomes a habit.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n---------------------------------<br/>\nNever miss a thing. Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] challenged mother in need of perspective change","postDate":"1200067814","msgId":28814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNzQ0NS4zODU0NC5xbUB3ZWI1NjExNC5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PEJBNkNCQ0Q1LUZDNDgtNEEzOC1BRTEwLUJDRjVBNEQ5ODM4OEB2ZXJpem9uLm5ldD4="},"prevInTopic":28813,"nextInTopic":28815,"prevInTime":28813,"nextInTime":28815,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"Joyce said a lot of times, anger and frustration come from a feeling of not being in control of your life. Could that be it? This statement is soooo true!!  I","messageBody":"<div id=\"ygrps-yiv-949281064\">Joyce said a lot of times, anger and frustration come from a feeling of not being in control of your life. Could that be it?<br/>\n   <br/>\n   <br/>\n  This statement is soooo true!!  I have found myself doing this over and over... but at least now I am catching myself quicker.  Just recently I was finding myself flying off the handle all the time with the boys and I had to really dig deep and realize that I was not happy with the relationship I was in -- so I got out of it!!  Lifes been much better!!  <br/>\n   <br/>\n  Than yesterday I had a blow out with my mom because she&#39;s not happy with my choice to homeschool (as of Wednesday been home for 3 days).. Started to feel agitated with boys , took a breath and thought to myself there not doing anything out of the ordinary I&#39;m just upset.  Preceded with my plans for the day , checked out karate class for oldest son and went to a local childrens musuem where we all had a blast for 3 hours!!!   <br/>\n   <br/>\n  So once we recognize where the anger is stemming from we can shorten or eliminated it a lot quicker.  I hate that I take my frustration out on the kids but hopefully with practice it won&#39;t happen...... <br/>\n                         <br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: challenged mother in need of perspective change","postDate":"1200062525","msgId":28824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZtN3Y3dCs4dWtuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDgwMTEwMTgzN2wyNTRmMDE0M3BiODI1OTJjNzc3MWFiMjI3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":28816,"nextInTopic":28827,"prevInTime":28823,"nextInTime":28825,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"Hi Faith, First and foremost I wanted to mention you are NOT alone.  I just got over the first trimester of my pregnancy.  The whole 3 months I felt like I was","messageBody":"<div id=\"ygrps-yiv-1967644206\">Hi Faith,<br/>\n<br/>\nFirst and foremost I wanted to mention you are NOT alone.  I just got<br/>\nover the first trimester of my pregnancy.  The whole 3 months I felt<br/>\nlike I was in this fog.  No one could find me and I couldn&#39;t find<br/>\nthem.  Luckily it has passed and I&#39;m slowly picking up the pieces. <br/>\nAccording to my husband, it wasn&#39;t as bad as I thought.  Still, I felt<br/>\nlike I was stuck in a world very much like you described.  <br/>\n<br/>\nI don&#39;t think you are &quot;gone&quot;.  You are seeking advice and support. <br/>\nThat&#39;s not &quot;gone&quot;.  You know, if you don&#39;t make mistakes then you<br/>\ndon&#39;t learn.  I can&#39;t imagine that anyone has this perfect unschooling<br/>\nworld 100% of the time.  For whatever reason you have made a<br/>\nconnection with what you don&#39;t want.  It&#39;s from these times in my<br/>\nhousehold that I feel the most strongly about who I want to be as a<br/>\nmother.  I think you know where you want to be, and it&#39;s important not<br/>\nto lose sight of that.  <br/>\n<br/>\nHonesty is really important.  Be honest with yourself and with your<br/>\nchildren.  I know that if I look my child in the eyes and apologize<br/>\nand explain why I am feeling the way I am, everyone feels better.  I<br/>\nalso ended up having a talk with my husband and telling him that I<br/>\nreally needed his help.  (I never ask for help  LOL)  I was in<br/>\ndesperate need of some space, and he really came through for me.  I<br/>\ndon&#39;t know that I have sure-fire advice for you.  Like I said I&#39;m<br/>\npregnant and feeling a bit out of it anyway!I I just wanted you to<br/>\nknow that its not just you!  <br/>\n<br/>\nConnecting with other is really important.  I know its hard, when<br/>\nunschoolers seem few and far between.  I certainly, treasure my<br/>\ncomputer during these times.  Also, I&#39;m looking forward to connecting<br/>\nwith others at the waterpark.  I think it will be a nice to meet other<br/>\nunschoolers and I&#39;m hoping to leave feeling supported and refreshed<br/>\nand if not, the lazy river should at least help with the relaxing<br/>\npart.  LOL<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Faith Void&quot;<br/>\n&lt;littlemsvoid@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; I thought of a question: How can I reestablish healthy boundaries and<br/>\n&gt; get back to a joyful family life with resorting to coercion?<br/>\n&gt; Faith<br/>\n&gt; <br/>\n&gt; On Jan 10, 2008 9:34 PM, Faith Void &lt;littlemsvoid@...&gt; wrote:<br/>\n&gt; &gt; I feel frustrated and lost. Our family is in a challenging space<br/>\n&gt; &gt; filled with much stress, internally and externally. We have become<br/>\n&gt; &gt; disconnected frequently. We have never done school at home or sent the<br/>\n&gt; &gt; kids to school. I started practicing attachment parenting with my<br/>\n&gt; &gt; first since birth. Somewhere I got lost, perhaps we (my family) all<br/>\n&gt; &gt; got lost from this path. I am feeling stressed out and angry more<br/>\n&gt; &gt; often then I feel joy. We don&#39;t know any other unschoolers or parents<br/>\n&gt; &gt; with a similar philosophy irl. Our family means well but isn&#39;t very<br/>\n&gt; &gt; supportive. I am just feeling alone and undirected. I want to get back<br/>\n&gt; &gt; on our joyous life journey but I can&#39;t figure out how. I have begun to<br/>\n&gt; &gt; yell at the kids. I even punished them this evening, my 5 y/o has<br/>\n&gt; &gt; never been punished and was very confused. I was so angry I started to<br/>\n&gt; &gt; yell mean things but stopped myself. Then I sent them into their room<br/>\n&gt; &gt; so I could have space, and regain my composure. I had intended to talk<br/>\n&gt; &gt; to them but they both fell asleep within 30 minutes of me sending them<br/>\n&gt; &gt; to their room. It was only 8 pm. I was very afraid that I would<br/>\n&gt; &gt; emotionally abuse them, as I was as a child. I am scared to feel so<br/>\n&gt; &gt; far gone. I can&#39;t even think of good questions to ask myself to get<br/>\n&gt; &gt; back on track. I can hardly see where I am much less change my<br/>\n&gt; &gt; perspective, which I know is what I need. I am sure this is very vague<br/>\n&gt; &gt; but maybe someone has a good idea.<br/>\n&gt; &gt; thanks<br/>\n&gt; &gt; Faith<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] challenged mother in need of perspective change","postDate":"1200043827","msgId":28813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNkNCQ0Q1LUZDNDgtNEEzOC1BRTEwLUJDRjVBNEQ5ODM4OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGNjNjEyMGExMDgwMTEwMTgzNG8yYzM4YzM4OXkzMjNmYTI5MzRjN2VkYjZjQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGNjNjEyMGExMDgwMTEwMTgzNG8yYzM4YzM4OXkzMjNmYTI5MzRjN2VkYjZjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":28812,"nextInTopic":28814,"prevInTime":28812,"nextInTime":28814,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"... A lot of times, anger and frustration come from a feeling of not being in control of your life. Could that be it? It will help to cut out unnecessary","messageBody":"<div id=\"ygrps-yiv-1384118750\">On Jan 10, 2008, at 9:34 PM, Faith Void wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am feeling stressed out and angry more<br/>\n&gt; often then I feel joy.<br/>\n<br/>\n </span></blockquote>A lot of times, anger and frustration come from a feeling of not  <br/>\nbeing in control of your life. Could that be it?<br/>\n<br/>\nIt will help to cut out unnecessary things draining your time. It  <br/>\nwill help to simplify life to cut down on what you want to control.  <br/>\nIt will help to get a handle on one thing you love. It will help to  <br/>\nlet go of the desire to control and embrace your kids for all their  <br/>\nchaoticness :-)<br/>\n<br/>\nObviously that&#39;s all rather vague. If you have some specific problems  <br/>\nit will help.<br/>\n<br/>\nHere&#39;s something Scott Noelle wrote a few days ago that might help  <br/>\nyou get into a more positive habit:<br/>\n<br/>\nTHE DAILY GROOVE ~ by Scott Noelle<br/>\nwww.enjoyparenting.com/dailygroove<br/>\n<br/>\n:: Do You Know How I Know...? ::<br/>\n<br/>\nThere&#39;s a scene in the comedy movie &quot;The 40-Year-Old<br/>\nVirgin&quot; where two men get into a back-and-forth<br/>\nexchange of insults, each beginning with &quot;You know<br/>\nhow I know you&#39;re gay?&quot;<br/>\n<br/>\nWhile I&#39;m not inclined to re-enact the homophobic<br/>\nbanter, the scene inspired me and my wife to use the<br/>\nback-and-forth format in a positive, playful way...<br/>\n<br/>\nOne day, when we were stressed about money, we<br/>\ndeliberately shifted from scarcity to prosperity<br/>\nthinking by asking each other repeatedly:<br/>\n<br/>\n    &quot;Do you know how I know we&#39;re rich?&quot;<br/>\n<br/>\nEach time, we sifted through our current life<br/>\nexperience for evidence of abundance and answered...<br/>\n<br/>\n    * Because we have two wonderful children.<br/>\n    * Because we have plenty of good food.<br/>\n    * Because we have supportive friends.<br/>\n<br/>\nSoon our kids caught wind of the fun and joined the<br/>\ngame enthusiastically...<br/>\n<br/>\n    * Because we can play all day.<br/>\n    * Because we all love each other.<br/>\n    * Because... Because... Because...<br/>\n<br/>\nSoon we were all *feeling* rich, and the ebb in our<br/>\ncash flow didn&#39;t seem like such a big problem anymore!<br/>\n<br/>\nSo... How do you know YOU&#39;RE rich? :-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dailygroove.net/how-i-know\">http://dailygroove.net/how-i-know</a><br/>\n<br/>\nFeel free to forward this message to your friends!<br/>\n(Please include this paragraph and everything above.)<br/>\nCopyright (c) 2008 by Scott Noelle<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: challenged mother in need of perspective change","postDate":"1200029483","msgId":28812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0MzYyNC4xNTMyMC5xbUB3ZWI1NDEwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PEMyMEEzNzM2LTI4MjYtNDVGNy1BMzEwLTJBNDQ1QkU0QjZBMkBtYWMuY29tPg=="},"prevInTopic":28811,"nextInTopic":28813,"prevInTime":28811,"nextInTime":28813,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"Hi Faith, I just want to say that I appreciate SO much the honesty of your post, because I can completely relate to your issue.  We have been quite","messageBody":"<div id=\"ygrps-yiv-1381076844\">Hi Faith,<br/>\n   <br/>\n  I just want to say that I appreciate SO much the honesty of your post, because I can completely relate to your issue.  We have been quite disconnected lately as well, with lots of stress from inside and outside our family unit.  We visited my sister and family which always takes me some emotional recovery time, then we were hit with the flu on the car trip home (nothing like puking kids in the car to push my buttons, don&#39;t know about you!).<br/>\n   <br/>\n  I have felt my patience and compassion seeping away over the last 5 days of being isolated with my kids, being sick myself and not being able to get the rest I need, and this angry, resentful attitude taking its place and yesterday I started to yell at the girls.  I was bawling about it in regret shortly thereafter when I looked into their little faces and saw how confused they were - just feeling yucky and wanting me to be the mature one and I was the one throwing a fit.  I ended up in that place again today, and we all ended up on the bed today crying and reading books, with them saying &#39;don&#39;t cry mommy just read&#39;.  Thank god my dh could swing home for an hour and let me sleep and have them cling to him for awhile, then I could get up and be a much more kind and compassionate mom.<br/>\n   <br/>\n  I want to say thank you Pam as well for the practice you suggested - it comes at a much needed time for me as well!  I know there isn&#39;t just one thing that makes it a black and white issue for me as learning to deal with anger is a work in progress for me.  I now understand that feeling the rage does feel more powerful in the moment (and can be quite addicting) and it takes work and effort and mindfulness to be willing to feel the hurt, the sadness, the powerlessness that comes when I breathe and am conscious of my kids and my own experience and how hard it is sometimes to be a parent and not be able to put myself first.  Thank god I&#39;m willing to learn.  Thanks for being out there working on this stuff too.<br/>\n   <br/>\n  Good night :o)<br/>\n  Jodi <br/>\n   <br/>\n  <br/>\n<br/>\nPamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n          <br/>\n<blockquote><span title=\"qreply\"> On Jan 10, 2008, at 6:37 PM, Faith Void wrote:<br/>\n<br/>\n&gt; I thought of a question: How can I reestablish healthy boundaries and<br/>\n&gt; get back to a joyful family life with resorting to coercion?<br/>\n<br/>\nThis may sound silly, but every time you feel your temper rising, make <br/>\nyourself get down and look into your child&#39;s eyes and make yourself <br/>\nsmile with love. That&#39;ll short-circuit the pattern. Tell yourself, <br/>\nthroughout the day, &quot;If I feel my temper rising, I am going to <br/>\nremember to make direct eye contact and smile and think how much I <br/>\nlove that kid BEFORE I react any other way.&quot; Be prepared - you might <br/>\nforget to do it. If you do, don&#39;t spend too much time berating <br/>\nyourself, it just shows this is going to be a bit hard and take some <br/>\neffort for you. Recognize that - then remind yourself that next time <br/>\nyou&#39;re going to do it. Do it whenever you remember - the positive <br/>\nresults will be reinforcing and it will become a habit. Just don&#39;t <br/>\ngive up if you aren&#39;t immediately perfect - ease into it so that it <br/>\nbecomes a habit.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNever miss a thing.   Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: challenged mother in need of perspective change","postDate":"1200024225","msgId":28811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyMEEzNzM2LTI4MjYtNDVGNy1BMzEwLTJBNDQ1QkU0QjZBMkBtYWMuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDgwMTEwMTgzN2wyNTRmMDE0M3BiODI1OTJjNzc3MWFiMjI3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGNjNjEyMGExMDgwMTEwMTgzNG8yYzM4YzM4OXkzMjNmYTI5MzRjN2VkYjZjQG1haWwuZ21haWwuY29tPiA8Y2M2MTIwYTEwODAxMTAxODM3bDI1NGYwMTQzcGI4MjU5MmM3NzcxYWIyMjdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":28810,"nextInTopic":28812,"prevInTime":28810,"nextInTime":28812,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"... This may sound silly, but every time you feel your temper rising, make yourself get down and look into your child s eyes and make yourself smile with love.","messageBody":"<div id=\"ygrps-yiv-366601830\">On Jan 10, 2008, at 6:37 PM, Faith Void wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I thought of a question: How can I reestablish healthy boundaries and<br/>\n&gt; get back to a joyful family life with resorting to coercion?<br/>\n<br/>\n </span></blockquote>This may sound silly, but every time you feel your temper rising, make  <br/>\nyourself get down and look into your child&#39;s eyes and make yourself  <br/>\nsmile with love. That&#39;ll short-circuit the pattern. Tell yourself,  <br/>\nthroughout the day, &quot;If I feel my temper rising, I am going to  <br/>\nremember to make direct eye contact and smile and think how much I  <br/>\nlove that kid BEFORE I react any other way.&quot; Be prepared - you might  <br/>\nforget to do it. If you do, don&#39;t spend too much time berating  <br/>\nyourself, it just shows this is going to be a bit hard and take some  <br/>\neffort for you. Recognize that - then remind yourself that next time  <br/>\nyou&#39;re going to do it. Do it whenever you remember - the positive  <br/>\nresults will be reinforcing and it will become a habit. Just don&#39;t  <br/>\ngive up if you aren&#39;t immediately perfect - ease into it so that it  <br/>\nbecomes a habit.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: challenged mother in need of perspective change","postDate":"1200019071","msgId":28810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDgwMTEwMTgzN2wyNTRmMDE0M3BiODI1OTJjNzc3MWFiMjI3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDgwMTEwMTgzNG8yYzM4YzM4OXkzMjNmYTI5MzRjN2VkYjZjQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGNjNjEyMGExMDgwMTEwMTgzNG8yYzM4YzM4OXkzMjNmYTI5MzRjN2VkYjZjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":28809,"nextInTopic":28811,"prevInTime":28809,"nextInTime":28811,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"I thought of a question: How can I reestablish healthy boundaries and get back to a joyful family life with resorting to coercion? Faith","messageBody":"<div id=\"ygrps-yiv-884653762\">I thought of a question: How can I reestablish healthy boundaries and<br/>\nget back to a joyful family life with resorting to coercion?<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 10, 2008 9:34 PM, Faith Void &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:littlemsvoid@...\">littlemsvoid@...</a>&gt; wrote:<br/>\n&gt; I feel frustrated and lost. Our family is in a challenging space<br/>\n&gt; filled with much stress, internally and externally. We have become<br/>\n&gt; disconnected frequently. We have never done school at home or sent the<br/>\n&gt; kids to school. I started practicing attachment parenting with my<br/>\n&gt; first since birth. Somewhere I got lost, perhaps we (my family) all<br/>\n&gt; got lost from this path. I am feeling stressed out and angry more<br/>\n&gt; often then I feel joy. We don&#39;t know any other unschoolers or parents<br/>\n&gt; with a similar philosophy irl. Our family means well but isn&#39;t very<br/>\n&gt; supportive. I am just feeling alone and undirected. I want to get back<br/>\n&gt; on our joyous life journey but I can&#39;t figure out how. I have begun to<br/>\n&gt; yell at the kids. I even punished them this evening, my 5 y/o has<br/>\n&gt; never been punished and was very confused. I was so angry I started to<br/>\n&gt; yell mean things but stopped myself. Then I sent them into their room<br/>\n&gt; so I could have space, and regain my composure. I had intended to talk<br/>\n&gt; to them but they both fell asleep within 30 minutes of me sending them<br/>\n&gt; to their room. It was only 8 pm. I was very afraid that I would<br/>\n&gt; emotionally abuse them, as I was as a child. I am scared to feel so<br/>\n&gt; far gone. I can&#39;t even think of good questions to ask myself to get<br/>\n&gt; back on track. I can hardly see where I am much less change my<br/>\n&gt; perspective, which I know is what I need. I am sure this is very vague<br/>\n&gt; but maybe someone has a good idea.<br/>\n&gt; thanks<br/>\n&gt; Faith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"challenged mother in need of perspective change","postDate":"1200018893","msgId":28809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDgwMTEwMTgzNG8yYzM4YzM4OXkzMjNmYTI5MzRjN2VkYjZjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":28810,"prevInTime":28808,"nextInTime":28810,"topicId":28809,"numMessagesInTopic":0,"msgSnippet":"I feel frustrated and lost. Our family is in a challenging space filled with much stress, internally and externally. We have become disconnected frequently. We","messageBody":"<div id=\"ygrps-yiv-259929942\">I feel frustrated and lost. Our family is in a challenging space<br/>\nfilled with much stress, internally and externally. We have become<br/>\ndisconnected frequently. We have never done school at home or sent the<br/>\nkids to school. I started practicing attachment parenting with my<br/>\nfirst since birth. Somewhere I got lost, perhaps we (my family) all<br/>\ngot lost from this path. I am feeling stressed out and angry more<br/>\noften then I feel joy. We don&#39;t know any other unschoolers or parents<br/>\nwith a similar philosophy irl. Our family means well but isn&#39;t very<br/>\nsupportive. I am just feeling alone and undirected. I want to get back<br/>\non our joyous life journey but I can&#39;t figure out how. I have begun to<br/>\nyell at the kids. I even punished them this evening, my 5 y/o has<br/>\nnever been punished and was very confused. I was so angry I started to<br/>\nyell mean things but stopped myself. Then I sent them into their room<br/>\nso I could have space, and regain my composure. I had intended to talk<br/>\nto them but they both fell asleep within 30 minutes of me sending them<br/>\nto their room. It was only 8 pm. I was very afraid that I would<br/>\nemotionally abuse them, as I was as a child. I am scared to feel so<br/>\nfar gone. I can&#39;t even think of good questions to ask myself to get<br/>\nback on track. I can hardly see where I am much less change my<br/>\nperspective, which I know is what I need. I am sure this is very vague<br/>\nbut maybe someone has a good idea.<br/>\nthanks<br/>\nFaith</div>","specialLinks":[]}],"prevTopicId":28820,"nextTopicId":28834}}