{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":158915970,"authorName":"alanlmarshall","from":"&quot;alanlmarshall&quot; &lt;alanlmarshall@...&gt;","profile":"alanlmarshall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with almost 5yr old","postDate":"1253116628","msgId":41473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cjFzaytmZWEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg4cGpxMCt0bmlpQGVHcm91cHMuY29tPg=="},"prevInTopic":41471,"nextInTopic":0,"prevInTime":41472,"nextInTime":41474,"topicId":41457,"numMessagesInTopic":0,"msgSnippet":"These all seem like normal developmental things to me. Try not to focus on changing your dd, instead change they way you view her behavior. Assume she s doing","messageBody":"<div id=\"ygrps-yiv-225030504\">These all seem like normal developmental things to me. Try not to focus on changing your dd, instead change they way you view her behavior. Assume she&#39;s doing her best, keep in mind that it is part of her development and temporary.<br/>\n<br/>\n***We can&#39;t afford to waste all kinds of food around here.***<br/>\n<br/>\nIf that is true then keep some food out of reach, but you may want to closely examine the real cost of a little food compared to your daughter&#39;s happiness. Would you spend $1 for a toy she wanted to play with for only one day? Try buying some inexpensive food pnly for the purpose of playing with it.<br/>\n<br/>\n<br/>\n***She&#39;s telling on everyone for everything they do or say.<br/>\n<blockquote><span title=\"ireply\"> &gt; If she asks for something and we say hold on, she keeps asking while we are getting it. Or I&#39;ll be tying her sister shoes, or putting laundry up, or coloring with them, and she wants something. I ask her to hold on while I stop what I&#39;m doing to get whatever it is she wants, but that&#39;s not good enough. Not fast enough.***<br/>\n<br/>\n </span></blockquote>These behaviors don&#39;t harm anyone, it is more of an annoyance. Concentrate on how you respond. It will pass.<br/>\n <br/>\n***I&#39;m so scared we are going to end up like me and my mom if I don&#39;t get to the root of the problem.***<br/>\n<br/>\nTruly, from what you&#39;ve written I don&#39;t think there is a problem to get to the root of. My dd age 6 has a developmental delay and it would be the happiest day of my life if she &quot;told on&quot; somebody. I know of parents who have lost children who would give anything to have these problems. I don&#39;t say this to be harsh, but to help you have some perspective. In moments of frustration, you might think about what it would be like if your dd wasn&#39;t there.<br/>\n<br/>\nTake deep breaths and enjoy and appreciate the time you have with your children.<br/>\n<br/>\nAlan</div>","specialLinks":[]},{"userId":348218801,"authorName":"Rachelle Marsden","from":"Rachelle Marsden &lt;overhereinheaven@...&gt;","profile":"musicgluttony","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with almost 5yr old","postDate":"1253083781","msgId":41471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjY2YyYjM1MDkwOTE1MjM0OXI0Y2JiOWQxYW01OTNmOTkwZGEzYzQzZDM4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGg4cGpxMCt0bmlpQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4cGpxMCt0bmlpQGVHcm91cHMuY29tPg=="},"prevInTopic":41469,"nextInTopic":41473,"prevInTime":41470,"nextInTime":41472,"topicId":41457,"numMessagesInTopic":0,"msgSnippet":"When we first started our unschooling journey this past April, I felt so connected to her. Apart from your daughter, what was going on in your life back in","messageBody":"<div id=\"ygrps-yiv-848695773\">When we first started our unschooling journey this past April, I felt so<br/>\nconnected to her.<br/>\n<br/>\n Apart from your daughter, what was going on in your life back in April that<br/>\nis different from now?  Was something joyful back then that is absent now?<br/>\n<br/>\nLove and Infinite Light,<br/>\nRachelle<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with almost 5yr old","postDate":"1253077127","msgId":41459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWUwMWNhMzY4YSQ2YzgyZDIyMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PGg4cGpxMCt0bmlpQGVHcm91cHMuY29tPg=="},"prevInTopic":41457,"nextInTopic":41469,"prevInTime":41458,"nextInTime":41460,"topicId":41457,"numMessagesInTopic":0,"msgSnippet":"Dear Darcel AS you were telling your story I had the clear picture in my mind of certain energetic interactions between you and your daughter and hubby and","messageBody":"<div id=\"ygrps-yiv-1081175820\">Dear Darcel<br/>\n<br/>\nAS you were telling your story I had the clear picture in my mind of certain energetic interactions between you and your daughter and hubby and daughter. We come into life with certain definitions, different from every other person where we are as we are. And each is also very open in many areas where we take on whatever energy may be defined with the people around us and amplify this energy and express it and eventually learn to become very wise about these energies. But it is a learning process somehow and requires lots of growing awareness. Check out Human Design. There are some practitioners who specialize in parent child relationships already. Otherwise you can contact me off this group and I&#39;ll gladly tell you more.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Help with almost 5yr old","postDate":"1253077084","msgId":41469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPRUVJTkNMQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGg4cGpxMCt0bmlpQGVHcm91cHMuY29tPg=="},"prevInTopic":41459,"nextInTopic":41471,"prevInTime":41468,"nextInTime":41470,"topicId":41457,"numMessagesInTopic":0,"msgSnippet":"... failing her. I feel like she requires more then I have to give. It seems like after I ve given all I have it s still not enough. It seems nothing I do is","messageBody":"<div id=\"ygrps-yiv-1426380744\"><blockquote><span title=\"ireply\">&gt;She will be 5 in December. She is my Spirited child, and I feel like I&#39;m<br/>\n </span></blockquote>failing her. I feel like she requires more then I have to give. It seems<br/>\nlike after I&#39;ve given all I have it&#39;s still not enough. It seems nothing I<br/>\ndo is ever enough.<br/>\nI just found out I&#39;m pregnant, so my energy is low, but I&#39;m still trying my<br/>\nbest to be there for them. &lt;<br/>\n<br/>\nBoth of my oldest girls (now 5 & 8) went through some of the same things<br/>\naround that age. It seems like every time my children get to a point where<br/>\nthey are ready to have a big growth spurt (intellectually or physically)<br/>\nthey begin to behave in ways that are not &quot;normal&quot; for them. Did you tell<br/>\nyour 5 year old about the pregnancy? If so, her behaviour could be caused by<br/>\nthe fact that she is trying to digest the fact that she will have to share<br/>\nher parents with another sibling. When my oldest found out we were expecting<br/>\nwith our fourth child, she was devastated. She was angry because she did not<br/>\nwant to share with another sibling. After all, she didn&#39;t get a say in<br/>\nwhether or not we got pregnant. Even if you haven&#39;t told your daughter, kids<br/>\nhave a sixth sense about those kinds of things. She may not know that you<br/>\nare pregnant but may sense that you are tired and frustrated and is acting<br/>\nout because of that. Also, if the two of you are really connected, her<br/>\nfrustrations could stem from you being frustrated and tired. I know it isn&#39;t<br/>\ngood for my kids when I am tired and flustered. You need to talk to her<br/>\nabout how she feels about things and let her express negative feelings<br/>\nwithout taking it personally.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t understand why she behaves so differently around him. With me she<br/>\n </span></blockquote>is so independent. I&#39;ve backed off on offering my help because she would<br/>\ntell me no. So now I let her come to me. Maybe that&#39;s not the right thing to<br/>\ndo? &lt;<br/>\n<br/>\nMy girls do this too. They behave differently around your husband because he<br/>\nis a different person with different perspectives. He interacts with them in<br/>\na totally different way than you do. With my girls, I notice that I am with<br/>\nthem all of the time so we have created a certain level of trust. My girls<br/>\ntrust their dad but it is a different kind of trust. My girls ask their dad<br/>\nto do stuff that they do not ask me to do. It boils down to them wanting<br/>\ndaddy&#39;s attention. There have been times that they behave exactly as you<br/>\nhave described with the button pushing incident.<br/>\n<br/>\nWith my girls, backing off tends to work. Sometimes an offer of help can be<br/>\ninterpreted as you don&#39;t trust her abilities. When people offer to help too<br/>\nmuch, it can be offensive because it comes across as a lack of trust rather<br/>\nthan a sincere attempt to help. That may not be what is going on but it is<br/>\nsomething to be mindful of when offering help.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Recent Activity<br/>\n    a..  12New Members<br/>\n  Visit Your Group<br/>\n  Give Back<br/>\n  Yahoo! for Good<br/>\n<br/>\n  Get inspired<br/>\n<br/>\n  by a good cause.<br/>\n<br/>\n  Y! Toolbar<br/>\n  Get it Free!<br/>\n<br/>\n  easy 1-click access<br/>\n<br/>\n  to your groups.<br/>\n<br/>\n  Yahoo! Groups<br/>\n  Start a group<br/>\n<br/>\n  in 3 easy steps.<br/>\n<br/>\n  Connect with others.<br/>\n  .<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336663632,"authorName":"harmonpanther228","from":"&quot;harmonpanther228&quot; &lt;harmonpanther228@...&gt;","profile":"harmonpanther228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help with almost 5yr old","postDate":"1253069440","msgId":41457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cGpxMCt0bmlpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41459,"prevInTime":41456,"nextInTime":41458,"topicId":41457,"numMessagesInTopic":0,"msgSnippet":"She will be 5 in December. She is my Spirited child, and I feel like I m failing her. I feel like she requires more then I have to give. It seems like after","messageBody":"<div id=\"ygrps-yiv-1757131553\">She will be 5 in December. She is my Spirited child, and I feel like I&#39;m failing her. I feel like she requires more then I have to give. It seems like after I&#39;ve given all I have it&#39;s still not enough. It seems nothing I do is ever enough.<br/>\nI just found out I&#39;m pregnant, so my energy is low, but I&#39;m still trying my best to be there for them. <br/>\n<br/>\nOver the past few months her behavior has me lost. I&#39;m not sure what I&#39;m doing wrong.<br/>\nShe&#39;s been playing with her food a lot more lately. Or she&#39;ll ask for something to eat and then let it set.<br/>\nI notice she likes to eat off of our plates, so I&#39;ve been fixing a big enough portion on our plates for the girls to share with us. <br/>\nSometimes she says she wants her own plate, but then she wastes it.<br/>\nWe can&#39;t afford to waste all kinds of food around here.<br/>\nWe grocery shop with them in mind, and ask her what she wants when we are at the store.<br/>\n<br/>\nShe&#39;s telling on everyone for everything they do or say.<br/>\nIf she asks for something and we say hold on, she keeps asking while we are getting it. Or I&#39;ll be tying her sister shoes, or putting laundry up, or coloring with them, and she wants something. I ask her to hold on while I stop what I&#39;m doing to get whatever it is she wants, but that&#39;s not good enough. Not fast enough.<br/>\n<br/>\nTonight I ran upstairs to grab their PJ&#39;s and on my way back down, my youngest informs me that her sister is playing with her food. I get to the living room and my oldest is hiding under a blanket. I asked her where the food was and she pulls out a bowl of water with fruit puffs in it. She had dumped the entire container into the bowl of water.<br/>\nAll of their snack food is easy for them to get to, and I offer them food as I eat throughout the day.<br/>\nMaybe I should put the food away?<br/>\n<br/>\n<br/>\nI understand her need to explore and as much as we say yes, it still doesn&#39;t seem to be enough for her. The times we do say no she doesn&#39;t accept that answer and does it anyway.<br/>\nThen she has been crying over everything. <br/>\n<br/>\n<br/>\nWe go for walks several times a week, and she loves to push the button for the cross walk. Today my husband was off work, so we all went together. I asked her if she wanted to push the button and she starts falling out! She starts screaming about how scared she is, and how she can&#39;t do it. I didn&#39;t know what to say or do. I was thinking&quot; we do this several times a week and it&#39;s not a problem, but today it is&quot;<br/>\nSo hubby asks her if she wants him to go with her, she says yes. He carries her over there and she pushes the button.<br/>\nI&#39;ve posted about that before. How once he comes in the door she starts acting different.<br/>\n<br/>\nI don&#39;t understand why she behaves so differently around him. With me she is so independent. I&#39;ve backed off on offering my help because she would tell me no. So now I let her come to me. Maybe that&#39;s not the right thing to do?<br/>\n<br/>\nWhen we first started our unschooling journey this past April, I felt so connected to her. I&#39;ve always had trouble bonding with her since birth.<br/>\nNow I feel out of touch with her again.<br/>\nI&#39;m so scared we are going to end up like me and my mom if I don&#39;t get to the root of the problem.<br/>\nI&#39;m really lost and don&#39;t know what to do or say anymore.<br/>\nI&#39;m feeling defeated.<br/>\n<br/>\nThis is long and all over the place. My head is all over the place.<br/>\n<br/>\nDarcel</div>","specialLinks":[]}],"prevTopicId":41472,"nextTopicId":41426}}