{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":61,"messages":[{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168276204","msgId":20463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJiZC5kYTg0Y2NlLjMyZDNkNGVjQGFvbC5jb20+"},"prevInTopic":20452,"nextInTopic":20467,"prevInTime":20462,"nextInTime":20464,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/8/2007 10:08:01 A.M. Eastern Standard Time, MystikMomma@frontiernet.net writes: Why doesn t he feel capable of saying I need to brush","messageBody":"<div id=\"ygrps-yiv-2015655975\">In a message dated 1/8/2007 10:08:01 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MystikMomma@...\">MystikMomma@...</a> writes:<br/>\n<br/>\nWhy doesn&#39;t he feel capable of saying I need to brush after this  snickers or <br/>\nto respond to a gentle reminder?<br/>\nWhy does the candy still  &quot;need&quot; restrictions?<br/>\n<br/>\n<br/>\n<br/>\nhe doesn&#39;t feel like he can remember to brush every time  and he doesn&#39;t <br/>\nthink he will limit himself if there is a huge bowl of  candy in front of him. I <br/>\nfeel that way about plenty of things myself and  have asked friends to remind <br/>\nme, or have set my life up in a way that  makes things better and healthier for <br/>\nme. I am really proud that he  understands his limitations and welcomes the <br/>\nhelp. He&#39;s pretty darn mature  for 9!<br/>\nAdriana <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":832843,"authorName":"Ariannah Armstrong","from":"Ariannah Armstrong &lt;adagio@...&gt;","profile":"guitarsarebeautiful","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168273272","msgId":20452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QTI2Rjc4LjUwMTAwMDBAZm91bnRhaW4ubnNsdWcubnMuY2E+","inReplyToHeader":"PDAwNWYwMWM3MzMzZiRlN2Q4ZjRhMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4=","referencesHeader":"PDAwNWYwMWM3MzMzZiRlN2Q4ZjRhMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20450,"nextInTopic":20463,"prevInTime":20451,"nextInTime":20453,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"... Sure.  I am learning a lot.  But I hope I ve said some valid things. Ariannah in Nova Scotia -- May we all have a vision now and then Of a world where","messageBody":"<div id=\"ygrps-yiv-522220892\">Deb Lewis wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; But first I want to ask some new members to read more and post less.  <br/>\n<br/>\n </span></blockquote>Sure.  I am learning a lot.  But I hope I&#39;ve said some valid things.<br/>\nAriannah in Nova Scotia<br/>\n<br/>\n-- <br/>\n&quot;May we all have a vision now and then<br/>\nOf a world where every neighbour is a friend&quot;<br/>\nAbba &quot;Happy New Year&quot; 1980<br/>\nPersonal Blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://ec.lecti.ca\">http://ec.lecti.ca</a></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168272796","msgId":20450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWYwMWM3MzMzZiRlN2Q4ZjRhMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20441,"nextInTopic":20452,"prevInTime":20449,"nextInTime":20451,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"There was a recent post about the dangers of candy and I want to address a few unschooling concepts. But first I want to ask some new members to read more and","messageBody":"<div id=\"ygrps-yiv-1532935379\">There was a recent post about the dangers of candy and I want to address a <br/>\nfew unschooling concepts.<br/>\n<br/>\nBut first I want to ask some new members to read more and post less.   Think <br/>\nabout why you&#39;re here.  Are you hear to learn about unschooling?   If you <br/>\nare then arguing and telling unschoolers the many ways they are wrong won&#39;t <br/>\nhelp you.   You&#39;re setting up a blockade in your mind to new ideas.<br/>\n<br/>\nNow, if you don&#39;t want new ideas, that&#39;s up to you, but then, you shouldn&#39;t <br/>\nbe wasting our time with all your reasons why unschooling won&#39;t work.   We <br/>\nknow it works.   We&#39;ve been living this life a long time.   You can&#39;t tell <br/>\nus anything about mainstream parenting ideas we haven&#39;t already given a lot <br/>\nof thought to and can&#39;t find abundantly available in our everyday lives.<br/>\n<br/>\n<br/>\nUnschooling is not a vacation from paying attention to what&#39;s going on with <br/>\nour kids.  Kids need food.  Kids need mom&#39;s to be aware of what&#39;s happening <br/>\nto their health.  Any child who puts any kind of food into his mouth is also <br/>\nintroducing bacteria and making a cozy place for bacteria to grow.  Yes, <br/>\nbacteria grows in sugar, but it also grows in other foods.   Bacteria can <br/>\nlive in plain water, which is one reason we chlorinate our water supplies. <br/>\nBut candy itself is not bacteria.  It is another food that humans sometimes <br/>\neat.<br/>\n<br/>\nSome people, because of genetics, because of bacteria&#39;s common to their <br/>\nenvironment or family will, have tooth decay even if they brush regularly <br/>\nand eat few sweets.   Some people will have good, strong, decay resistant <br/>\nteeth with little fuss.  There is more to tooth decay than candy.<br/>\n<br/>\nThinking in extremes is not good thinking.   Unschooling won&#39;t work well for <br/>\npeople who can&#39;t or won&#39;t think clearly.  It wont work well for people who <br/>\nhave modeled their world around fear.<br/>\n<br/>\nThere are more ways to help kids keep their mouths clean than making them <br/>\nbrush and denying or limiting candy.<br/>\n<br/>\nWhen Dylan was very little we got some soft tooth brushes for him.  I would <br/>\nhold him on my hip while I brushed my teeth.  I am something of an obsessive <br/>\ntooth brusher, (and always have been and that didn&#39;t save me from tooth <br/>\ndecay) so he saw me brush my teeth a lot.  And he had a little brush to hold <br/>\nand play with while I brushed.  He could poke it into the stream of water <br/>\nfrom the faucet and them brush my cheek or the mirror or his face or put it <br/>\nin his mouth.<br/>\n<br/>\nI would talk about how good it felt to have a clean mouth.   His dad, who is <br/>\na creature of habit would snap his teeth together a few times and say &quot;Ah, <br/>\nclean choppers.!&quot; and Dylan found that amusing.<br/>\n<br/>\nDylan didn&#39;t get teeth early but he had a tooth brush very early and he had <br/>\na consistent examples of pleasant tooth brushing.<br/>\n<br/>\nAnd we always talked to him about why we did things, why we washed our hands <br/>\nafter going potty, or touching the dog bowl or taking out the trash.  Why we <br/>\nwashed our hands before we prepared food.  Why we used a clean dish cloth to <br/>\nwipe the counter and table, etc.   Not as a lecture in hygiene but as <br/>\nconversation.<br/>\n<br/>\nDylan is fourteen and has never had a cavity.    If I was going to brush my <br/>\nteeth before leaving the house I&#39;d invite him to come brush with me.<br/>\nThere was a time he wanted me to brush his teeth for him, and I did that. <br/>\nWe never talked about brushing as if it was unpleasant (and it&#39;s not) or a <br/>\nchore, we just brushed with the same attitude as we might have about getting <br/>\ndressed or any other ordinary thing.   And we never talked about brushing as <br/>\nif was desperately important.   It was just one thing we did as part of <br/>\nliving.<br/>\n<br/>\nI had read, before Dylan was born, that it was possible for mothers to <br/>\nimmunize their babies against the familial bacteria that can cause tooth <br/>\ndecay.  I wish now I could find that bit I read, I have looked for it <br/>\nwithout success.   But the idea was that by sharing kisses or a spoon - <br/>\nsaliva, essentially - with a child before he has teeth, a mother might be <br/>\nable to sort of inoculate her child.  Introducing that common family <br/>\nbacteria to a child before he has teeth can help build his immunity to that <br/>\nbacteria.    I don&#39;t know if that has been proved or disproved or ever will <br/>\nbe, but it&#39;s one of many things I read about tooth decay.<br/>\n<br/>\nThere were five children in our family and four of us had childhood cavities <br/>\nand some as adults.  My sister has no cavities.  She&#39;s now fifty one.  She <br/>\neats sweets and brushes her teeth.   After my sister was born my mother had <br/>\npostpartum depression and my aunt took my sister to live with her for <br/>\nseveral months.    I have often wondered if my sister&#39;s time with my aunt <br/>\ninoculated her against our common family bacteria.  My mother made an <br/>\nattempt at boiling everything that would come in contact with her children&#39;s <br/>\nmouths.  My aunt was more practical.   I&#39;ll never know the answer, but my <br/>\nsister has healthy teeth while her siblings have had cavities.<br/>\n<br/>\nSo, Dylan had tooth brushes early and could use them however he wanted and <br/>\nwas given a consistent example of happy brushing.  He was never told to <br/>\nbrush and never forced to brush and if he fell asleep for the night before <br/>\nbrushing it was no big deal.  I believe that actually increased his <br/>\nawareness of the difference between a clean feeling mouth and an unbrushed <br/>\nmouth.<br/>\n<br/>\nI cannot conceive of how a child&#39;s teeth could &quot;rot out&quot; without a mother <br/>\nbeing aware there was a problem long before.  It&#39;s easy to look in the <br/>\nmouths of children.  It&#39;s easy to detect infection by smell.  I&#39;m guessing <br/>\nthe term &quot;rotted out&quot; was used as part of the extreme language that&#39;s being <br/>\nused in several of these posts and is an exaggeration of the facts.  If it&#39;s <br/>\nnot, and if a child&#39;s teeth &quot;rotted out&quot; before he was give help then I <br/>\ndon&#39;t know what to say, except that unschooling will take more awareness on <br/>\nthe part of a parent than that.<br/>\n<br/>\nMy young nieces had cavities in their baby teeth so I understand that it <br/>\nhappens.  I don&#39;t understand &quot;rotted out.&quot;<br/>\n<br/>\n***My son never wants to go through this hell again but he needs my help in <br/>\nkeeping him away<br/>\nfrom it and getting his health in order! ***<br/>\n<br/>\nI&#39;m sure he&#39;d never want to go through that again but the truth is he needed <br/>\nyour help long before this.  It need never have happened and while that&#39;s <br/>\nnot easy to say nor I&#39;m sure to hear, or consider, I&#39;m addressing this <br/>\nbecause you&#39;ve come to this list and offered this information freely and <br/>\nseem to be trying to convince many long time unschoolers, who don&#39;t force <br/>\nbrushing or restrict sweets, that the culprit was candy.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":248268539,"authorName":"MystikMomma@frontiernet.net","from":"&quot;MystikMomma@...&quot; &lt;MystikMomma@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168268124","msgId":20441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWUwMWM3MzMzNSQwNzhhMGVjMCQwMWZlYThjMEBzcXVpZD4=","referencesHeader":"PGMxZS5kMmUyNzc4LjMyZDMyMGY5QGFvbC5jb20+"},"prevInTopic":20438,"nextInTopic":20450,"prevInTime":20440,"nextInTime":20442,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"he thinks it would be cruel to keep things the way they are and have him get sick again ***** Does he not feel that he has control over the situation? He saw","messageBody":"<div id=\"ygrps-yiv-1091804977\">he thinks it would be cruel to <br/>\nkeep things the way they are and have him get sick again<br/>\n*****<br/>\nDoes he not feel that he has control over the situation? He saw himself in a mirror, he felt the pain and discomfort, he had to be poked and prodded and stuck with needles. Why doesn&#39;t he feel capable of saying I need to brush after this snickers or to respond to a gentle reminder?<br/>\nWhy does the candy still &quot;need&quot; restrictions?<br/>\nElissa Jill<br/>\nOTN: <br/>\nsilk/wool blend tie front mini sweater<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mystikmusings.blogspot.com/\">http://mystikmusings.blogspot.com/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168261154","msgId":20438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMDY1Ny43MDIxNi5xbUB3ZWI1MzgwNi5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGVuczdoaCtka2I3QGVHcm91cHMuY29tPg=="},"prevInTopic":20435,"nextInTopic":20441,"prevInTime":20437,"nextInTime":20439,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"My daughter is not afraid to eat candy because she thinks her teeth will fall out. She ate the candy she wanted that day. But I have explained to her that if","messageBody":"<div id=\"ygrps-yiv-697510381\">My daughter is not afraid to eat candy because she thinks her teeth <br/>\nwill fall out. She ate the candy she wanted that day. But I have <br/>\nexplained to her that if she eats and eats and eats nothing but junk <br/>\nher teeth will fall out (just like her dad&#39;s did when he was younger <br/>\nand could eat whatever he wanted... he had nothing but cavities.)<br/>\n<br/>\n******<br/>\n   <br/>\n  For the record, unhealthy teeth is more a matter of genetics and water quality than of sugar eaten.  Some people who are meticulous about tooth care, still have cavities.  Some teeth come in with cavities -- Dan&#39;s teeth had weak, white spots even before they&#39;d fully emerged.  I have a cousin and a nephew who both had similar issues.  I have three kids -- all fed the same kind of diet -- two with very few cavities (in spite of sporadic brushing on their parts), one with several crowns and fillings.  It&#39;s not always about what one eats, or whether one brushes, etc.<br/>\n   <br/>\n  Do you honestly believe that anyone with bad teeth eats candy non-stop?<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n<br/>\n          Gary (dh)<br/>\n  Will (almost 22!) Andy (10-1/2) and Dan (almost 6) <br/>\n   <br/>\n      Peace is the vibrant space which stimulates the dance of kindness, merriment and freedom. ~ unknown<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourhapahome.blogspot.com\">http://ourhapahome.blogspot.com</a><br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":832843,"authorName":"Ariannah Armstrong","from":"Ariannah Armstrong &lt;adagio@...&gt;","profile":"guitarsarebeautiful","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168255917","msgId":20435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QTIyQkFELjkwNjA2MDVAZm91bnRhaW4ubnNsdWcubnMuY2E+","inReplyToHeader":"PGVuczZrais3NjA3QGVHcm91cHMuY29tPg==","referencesHeader":"PGVuczZrais3NjA3QGVHcm91cHMuY29tPg=="},"prevInTopic":20433,"nextInTopic":20438,"prevInTime":20434,"nextInTime":20436,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Our family has been out of the school system for 4 years, and it s gradually morphed into unschooling. One of the euphoric honeymoon phases of our first","messageBody":"<div id=\"ygrps-yiv-444645989\">Our family has been out of the school system for 4 years, and it&#39;s<br/>\ngradually morphed into unschooling.<br/>\n<br/>\nOne of the euphoric honeymoon phases of our first homeschooling years<br/>\nwas that our family&#39;s principles were no longer undermined with the<br/>\nonslaught of mainstream plastic values and such - we could learn<br/>\ntogether in freedom without labels.  This was the one place we could<br/>\ncome and breathe (literally) free of chemical scents (many of us have a<br/>\nmoderate sensitivity).<br/>\n<br/>\nI think food choice is a highly personal thing, as is food guidance.<br/>\nEach body is different, and can tolerate different things, and for<br/>\ndifferent reasons.  Some families grow up vegetarian or vegan, some<br/>\npeople grow up meat eaters, some people add candy to the mix of both.<br/>\nWe were vegetarian for a good long while and ironically, even though we<br/>\ngot teased about it quite a bit, any dishes we brought to potluck style<br/>\ngatherings, from delicious salads, to lasagnas and such, said teasers<br/>\nwere often the first to dive into our dishes and we were lucky if *we*<br/>\nhad anything to eat by the time we got around to it (grin).  I&#39;d bring<br/>\ntrays of fruit and melons and organic grapes, and they&#39;d practically be<br/>\nfighting over the last melon slice, because &quot;It has been a long time<br/>\nsince we had something like this!&quot;.<br/>\n<br/>\nI&#39;m kind of new to getting used to the unschooling, deschooling<br/>\nprinciples, and what makes someone a &quot;true unschooler&quot;.    What I love<br/>\nabout unschooling is that it&#39;s not jumping from one &quot;box&quot; into another,<br/>\nand if one family doesn&#39;t typically have candy lying around their house<br/>\nand one does, what matters is that the child is well loved and nourished<br/>\nin freedom.<br/>\n<br/>\nIn general, at our house, candy isn&#39;t sought out or included as a &quot;food<br/>\ngroup&quot; any more than my knitting needles and yarn are.  I don&#39;t even<br/>\nhave to buy it, as our neighbours seem to have a steady supply going<br/>\nthat they offer to our children (grin).  My kids eat it and enjoy the<br/>\ntaste, but even they know, without me having to tell them, that it&#39;s not<br/>\n&quot;food&quot; (as in the sense of it is nourishing), but more something to<br/>\ntickle the taste buds only.  At Christmas time I spent an unusual amount<br/>\nof money on candy to decorate cookie houses (I think I spent about $20<br/>\non the whole works).  I told them they were allowed to eat as much of<br/>\ntheir creations as they wished.  Well, there are quite a bit of<br/>\n&quot;leftovers&quot; on the kitchen counter growing stale and gross, and soon to<br/>\nbe tossed, and ny most people&#39;s definitions we are &quot;restrictive&quot; when it<br/>\ncomes to candy and things.<br/>\n<br/>\nBut for us, the main thing isn&#39;t that we say &quot;no, that&#39;s bad&quot; ( we<br/>\ndon&#39;t).  Our kids themselves see that candy is nothing more than sugar<br/>\nand fluff, and doesn&#39;t really satisfy them in the long term - they&#39;ve<br/>\ncome to be quite practical people :)  They like more bang for their<br/>\nbuck.  They don&#39;t get excited about it because we don&#39;t get excited<br/>\nabout it.<br/>\n<br/>\nAriannah in Nova Scotia<br/>\n--<br/>\n&quot;May we all have a vision now and then<br/>\nOf a world where every neighbour is a friend&quot;<br/>\nAbba &quot;Happy New Year&quot; 1980<br/>\nPersonal Blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://ec.lecti.ca\">http://ec.lecti.ca</a></div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] was: kids need to hear NO from parents! now teeth","postDate":"1168233382","msgId":20433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzOC5jOWQ0YzNiLjMyZDMyZGE2QGFvbC5jb20+"},"prevInTopic":20431,"nextInTopic":20435,"prevInTime":20432,"nextInTime":20434,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/7/2007 11:56:37 P.M. Eastern Standard Time, trektheory@yahoo.com writes: A lot of my problems stem from not having fluoridated water as  a","messageBody":"<div id=\"ygrps-yiv-1800732910\">In a message dated 1/7/2007 11:56:37 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trektheory@...\">trektheory@...</a> writes:<br/>\n<br/>\nA lot of my problems stem from not having fluoridated water as  a<br/>\nchild. My husband did. My son had fluoride drops from infancy.  So<br/>\nmy problems are not from eating sweets, but from having cavities  (I<br/>\ndidn&#39;t floss until I was an adult, and not regularly until more  recent<br/>\nyears) as a child, and not taking proper care of my teeth  years ago.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI don&#39;t allow fluoride at the dentist&#39;s office (but they  brush with regular <br/>\nfluoridated toothpaste). Do you think I should allow  the fluoride treatments? <br/>\nI&#39;ve read mixed things about it and decided not  to do it because it was in <br/>\nagreement with the not-vaccinating  crowd (which we are a part of)<br/>\n <br/>\nAdriana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"was: kids need to hear NO from parents! now teeth","postDate":"1168230969","msgId":20428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuc2hucCtqcW5jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVuczdoaCtka2I3QGVHcm91cHMuY29tPg=="},"prevInTopic":20423,"nextInTopic":20431,"prevInTime":20427,"nextInTime":20429,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"... I have lousy teeth.  My dh has reasonably good teeth.  My son has excellent teeth.  We all love sweets, and have been known to overindulge.  We brush","messageBody":"<div id=\"ygrps-yiv-1648648711\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;kristenhendricks55&quot;<br/>\n&lt;kristenhendricks55@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; So your daughter does not eat it because you have made her afraid of <br/>\n&gt; it??? What will it happen when she realizes lots of other kids eat <br/>\n&gt; candy and their teeth does not fall out?????&quot;<br/>\n&gt; <br/>\n&gt; My daughter is not afraid to eat candy because she thinks her teeth <br/>\n&gt; will fall out. She ate the candy she wanted that day. But I have <br/>\n&gt; explained to her that if she eats and eats and eats nothing but junk <br/>\n&gt; her teeth will fall out (just like her dad&#39;s did when he was younger <br/>\n&gt; and could eat whatever he wanted... he had nothing but cavities.)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I have lousy teeth.  My dh has reasonably good teeth.  My son has<br/>\nexcellent teeth.  We all love sweets, and have been known to<br/>\noverindulge.  We brush afterwards, and ya know what -- we all have<br/>\ngreat checkups.  <br/>\n<br/>\nA lot of my problems stem from not having fluoridated water as a<br/>\nchild.  My husband did.  My son had fluoride drops from infancy.  So<br/>\nmy problems are not from eating sweets, but from having cavities (I<br/>\ndidn&#39;t floss until I was an adult, and not regularly until more recent<br/>\nyears) as a child, and not taking proper care of my teeth years ago.<br/>\n<br/>\nI haven&#39;t had a new cavity in years.<br/>\n<br/>\nI eat sweets.<br/>\n<br/>\nI don&#39;t always even brush right away.  <br/>\n<br/>\nI will say, your dd will probably feel better within her own body by<br/>\nnot eating too many sweets -- I know I do.  (I still eat &#39;em<br/>\nsometimes, because, well, I was born with a set of genetically<br/>\nprogrammed sweet teeth!)  <br/>\n<br/>\nThat said, when my ds was younger, we did limit sweets at times.  He<br/>\nis now 15, and has been known to have too much.  Logical consequences<br/>\ndon&#39;t always seem to teach the lesson, and we do intervene as parents.<br/>\nWe view it as guiding.  That, too, can be done respectfully, though.  <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168230137","msgId":20431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxZS5kMmUyNzc4LjMyZDMyMGY5QGFvbC5jb20+"},"prevInTopic":20428,"nextInTopic":20433,"prevInTime":20430,"nextInTime":20432,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/7/2007 11:04:59 P.M. Eastern Standard Time, starsuncloud@comcast.net writes: That s just downright cruel. Why not disallow trick or","messageBody":"<div id=\"ygrps-yiv-735374770\">In a message dated 1/7/2007 11:04:59 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\nThat&#39;s just downright cruel. Why not disallow trick or treating  all<br/>\ntogether if you&#39;re going to take everything away at the end? That  stinks.<br/>\nCRUEL? leaving 10 or 12 candies isn&#39;t taking it all  away. They pick the ca<br/>\nndies and they came up with this number! We talked  about what to do and this is <br/>\nwhat we came up with (democratically) as a  family. we went through HELL with <br/>\nthis, it is what we all thought the  solution should be. Cruel was seeing him <br/>\nwith one side of his face  blown up LIKE A BALOON from infection. If you want <br/>\nto see pictures I will  email them to you privately. We thought he had mumps. <br/>\nThis wasn&#39;t some  small thing! My son (the one that almost had an infection <br/>\ngo to his BRAIN)  doesn&#39;t think it is cruel. he thinks it would be cruel to <br/>\nkeep things the  way they are and have him get sick again. He hates the needles, <br/>\nthe  medicine (he&#39;s actually sitting right next to me telling me this,  <br/>\ndictating) LOL, but he says if there is a big bowl of candy he will eat it  &quot;no <br/>\nmatter what.&quot; I am really proud of him for knowing this about himself!  The kids <br/>\nLOVE LOVE LOVE getting dressed up. They love going door to  door. The love <br/>\ngetting together with friends. All agree that the candy  is not the part of trick <br/>\nor treating that is great. They do love  candy and will treasure the pieces <br/>\nthat they decide are most important to  them. And will brush (and hopefully <br/>\nfloss) after.  <br/>\n<br/>\nAre your only two choices to control their food OR have  unhealthy<br/>\nkids? Nope. Seeing only those two choices is preventing you  from<br/>\nseeing the hundreds of options, the many ways you don&#39;t have  to<br/>\ncontrol what they eat AND have healthy children.<br/>\n<br/>\n<br/>\n<br/>\nMy son, who had the infection, was born with a rare  congenital defect of his <br/>\nbile ducts. The other two are super healthy and  do not have this problem. He <br/>\nis VERY attracted (craves like crazy)  everything that causes him to turn <br/>\nyellow/jaundiced, become too acidic,  and get things like canker-sores, cavities <br/>\nand infections. (even too much  fruit is a problem for him, if I have a large <br/>\nbowl of strawberries for  example, and put the whole bowl on the table, he <br/>\nwill eat the whole thing,  get the sores in his mouth, get a low grade infection, <br/>\nturn yellow) It  took us the longest time to even see that there was any <br/>\nrelation to what  he ate and his problems. Now that we know, I can&#39;t IMAGINE why <br/>\nyou  would think that I shouldn&#39;t help him with this? I LOVE HIM. I want him to <br/>\n live a long healthy life. He does too. <br/>\n <br/>\nWhen you have a child telling you &quot;I don&#39;t want to be  sick again help me&quot; <br/>\nyou help them!<br/>\n <br/>\nAdriana <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168228718","msgId":20423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuc2ZoZStmdnY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQwYi41ZTkyYTM3LjMyZDMxNzBmQGFvbC5jb20+"},"prevInTopic":20419,"nextInTopic":20428,"prevInTime":20422,"nextInTime":20424,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"~~Well, first of all next Halloween they will have to go through their candies and pick maybe 10 or 12 that they like, the rest go in the trash.~~ That s just","messageBody":"<div id=\"ygrps-yiv-960042587\">~~Well, first of all next Halloween they will<br/>\nhave to go through their candies and pick maybe 10 or 12 that they<br/>\nlike, the rest go in the trash.~~<br/>\n<br/>\nThat&#39;s just downright cruel. Why not disallow trick or treating all<br/>\ntogether if you&#39;re going to take everything away at the end? That stinks.<br/>\n<br/>\nAre your only two choices to control their food OR have unhealthy<br/>\nkids? Nope. Seeing only those two choices is preventing you from<br/>\nseeing the hundreds of options, the many ways you don&#39;t have to<br/>\ncontrol what they eat AND have healthy children.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168227599","msgId":20419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwYi41ZTkyYTM3LjMyZDMxNzBmQGFvbC5jb20+"},"prevInTopic":20417,"nextInTopic":20423,"prevInTime":20418,"nextInTime":20420,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Candy can lead to SERIOUS complications and I am living  proof of someone that tried the do what you want with your candy  approach and seriously regret it.","messageBody":"<div id=\"ygrps-yiv-1439097892\">Candy can lead to SERIOUS complications and I am living  proof of someone <br/>\nthat tried the &quot;do what you want with your candy&quot;  approach and seriously regret <br/>\nit. I have unschooled my kids  with candy, have very little at home but let <br/>\nthem have what is offered to  them; mostly from goody bags at parties (parties <br/>\nhappen all year long) and  Halloween. One of mine, the oldest really doesn&#39;t <br/>\nlike  it, the youngest likes it but mostly is into chocolate and that isn&#39;t  <br/>\nsomething that really has hurt her teeth much. The middle one eats all he  can <br/>\nget, loves the gooey colored sugary crap, plus what the  other two don&#39;t want. <br/>\nHe has had rotted out baby molars that ended  up needing fillings and <br/>\nextractions. One needed a deep filling and  bacteria grew under when that tooth got <br/>\nloose and then he ended up with an  abscess and with severe toxemia in his body; <br/>\nlost tons of weight wasn&#39;t  growing, needed antibiotics which I HATE the idea <br/>\nof. Now he is on  lacto-bacilicus to get his intestines back in order. We also <br/>\n unschooled with toothbrushing and flossing. He only brushes once a day and  <br/>\nflosses about once a month. The other two that do it more have better  teeth. <br/>\nWhere am I with all of this now? Well, first of all next Halloween  they will <br/>\nhave to go through their candies and pick maybe 10 or 12  that they like, the <br/>\nrest go in the trash. They know this already and are  ok with it. My son never <br/>\nwants to go through this hell again but he needs  my help in keeping him away <br/>\nfrom it and getting his health in  order! I&#39;m also limiting what we accept <br/>\nfrom others, and will  stand by him and make sure he brushes and flosses twice a <br/>\nday even if he  hates it. The infection ALMOST SPREAD TO HIS BRAIN! They (the <br/>\ndentists)  told me of numerous occasions where this can happen and where kids <br/>\nwere on  antibiotics (IV) in the hospital because a tooth got screwed up, <br/>\nbaby or  permanent, all because of things like juice (even 100% fruit), sodas and <br/>\n candies. So what candy can do to you IS serious. It can hurt a  child&#39;s <br/>\nblood sugar, pancreas, behavior, teeth, chances of proper  digestion of other <br/>\nfoods and can be addictive.<br/>\n <br/>\nNOT GOOD STUFF! I feel terribly guilty about all of  this. I&#39;m one of those <br/>\npeople who would NEVER allow someone to smoke  around my child, yet I feel <br/>\nthere has been something inside of them that&#39;s  been potentially almost as <br/>\ndamaging. We are making big changes around here  because of it.  <br/>\n <br/>\nAdriana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168227129","msgId":20417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2EwMWM3MzJkNSQ5NDAzNWUyMCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PGVuczdoaCtka2I3QGVHcm91cHMuY29tPg=="},"prevInTopic":20415,"nextInTopic":20419,"prevInTime":20416,"nextInTime":20418,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Kids that are allowed to eat all and what they want without guilt, coercion or limits will not choose to eat only candy. Period. And Ren is right. Sugar alone","messageBody":"<div id=\"ygrps-yiv-2377391\">Kids that are allowed to eat all and what they want without guilt, coercion or limits will not choose to eat only candy. Period.<br/>\nAnd Ren is right. Sugar alone will not cause cavities. Genetics, and other factors plus the needed Strep Mutans bacteria are necessary for cavities to occur.<br/>\n I never cared about candies but one of my cousins and my best friend love them and always had candies and gum when we were young. They both are cavity free.<br/>\nWe are not saying that our kids eat &quot;junk and &quot;candy&quot; all day long without us providing healthy foods and guidance.<br/>\nMy ds ( 4 and a half years old ) is really getting into discussing healthy foods now. <br/>\nAlex<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168224784","msgId":20415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuc2JtZysyaGJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVuczdscisxMGhlNEBlR3JvdXBzLmNvbT4="},"prevInTopic":20413,"nextInTopic":20417,"prevInTime":20414,"nextInTime":20416,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"~~I m sorry, but I dont see where I said that allowing a child to eat candy to get them to shut up had anything to do with unschooling? Where did you get the","messageBody":"<div id=\"ygrps-yiv-1613063557\">~~I&#39;m sorry, but I dont see where I said that allowing a child to eat<br/>\ncandy to get them to shut up had anything to do with unschooling?<br/>\nWhere did you get the idea that I was saying that?~~<br/>\n<br/>\n<br/>\nBecause you were using it as an example of why &quot;allowing&quot; a child to<br/>\neat all the candy they want is a bad idea. We&#39;re not here to tell<br/>\npeople &quot;give your kid all the candy they want&quot; or &quot;let them eat candy<br/>\nso they&#39;ll leave you alone&quot;.<br/>\n<br/>\nThe kind of parenting paradigm we&#39;re discussing is about being<br/>\nmindful, being aware and NOT just doing things without thought. <br/>\n<br/>\nIt wasn&#39;t a good example for using against our advice to give kids<br/>\nmore autonomy over their food choices.<br/>\n<br/>\nInterestingly, all of the kids I know that DO have free choice over<br/>\nfood, don&#39;t WANT to eat nothing but candy. Show me a kid that will eat<br/>\nnothing but candy for more than a day. The human body does not feel<br/>\nvery good after a very short time of this. Worst case, it will<br/>\nprobably last for about 3 days. I don&#39;t think most humans can go three<br/>\ndays on nothing but sweets though.<br/>\n<br/>\nI dare you to try it.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168220667","msgId":20413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuczdscisxMGhlNEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGVuczZrais3NjA3QGVHcm91cHMuY29tPg=="},"prevInTopic":20412,"nextInTopic":20415,"prevInTime":20412,"nextInTime":20414,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Allowing a child to eat candy to shut them up has nothing to do ... I m sorry, but I dont see where I said that allowing a child to eat candy to get them","messageBody":"<div id=\"ygrps-yiv-1908482574\">&quot;Allowing&quot; a child to eat candy to &quot;shut them up&quot; has nothing to do <br/>\n<blockquote><span title=\"ireply\"> &gt; with unschooling.<br/>\n<br/>\n </span></blockquote>I&#39;m sorry, but I dont see where I said that allowing a child to eat <br/>\ncandy to get them to shut up had anything to do with unschooling? <br/>\nWhere did you get the idea that I was saying that?<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Joanne&quot; <br/>\n&lt;billyandjoanne@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;kristenhendricks55&quot; <br/>\n&gt; &lt;kristenhendricks55@&gt; wrote:<br/>\n&gt; &gt;&gt;&gt;&gt;Thats why I restrict sweets at our house. My daughter who is <br/>\n&gt; three had some friends over a few days after halloween and one mom <br/>\n&gt; allowed her kids to eat candy after candy just to keep him quiet. <br/>\n&gt; Mom never said anything, however, my 3 year old jumped right in <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; told him &quot;your teeth will fall out of your mouth&quot;. LOL&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Teeth don&#39;t fall out from eating candy. <br/>\n&gt; <br/>\n&gt; &quot;Allowing&quot; a child to eat candy to &quot;shut them up&quot; has nothing to <br/>\n </span></blockquote>do <br/>\n<blockquote><span title=\"ireply\"> &gt; with unschooling.  <br/>\n&gt; <br/>\n&gt; My 8 year old daughter has total freedom to choose what she puts <br/>\n&gt; into her body. This same daughter just threw out candy that she <br/>\n </span></blockquote>got <br/>\n<blockquote><span title=\"ireply\"> &gt; for Halloween. It&#39;s been sitting there for 2 months and she only <br/>\n </span></blockquote>ate <br/>\n<blockquote><span title=\"qreply\"> &gt; about a quarter of it.  <br/>\n&gt; <br/>\n&gt; ~ Joanne ~<br/>\n&gt; Mom to Jacqueline (8), Shawna (11) & Cimion (14)<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168220529","msgId":20412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuczdoaCtka2I3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMWYwMWM3MzJjMCQ2NzRkZjNhMCQ2NDU4YThjMEBPZmZpY2U+"},"prevInTopic":20409,"nextInTopic":20413,"prevInTime":20411,"nextInTime":20413,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"So your daughter does not eat it because you have made her afraid of it??? What will it happen when she realizes lots of other kids eat candy and their teeth","messageBody":"<div id=\"ygrps-yiv-508381313\">So your daughter does not eat it because you have made her afraid of <br/>\nit??? What will it happen when she realizes lots of other kids eat <br/>\ncandy and their teeth does not fall out?????&quot;<br/>\n<br/>\nMy daughter is not afraid to eat candy because she thinks her teeth <br/>\nwill fall out. She ate the candy she wanted that day. But I have <br/>\nexplained to her that if she eats and eats and eats nothing but junk <br/>\nher teeth will fall out (just like her dad&#39;s did when he was younger <br/>\nand could eat whatever he wanted... he had nothing but cavities.)<br/>\n<br/>\nLet me ask you a question....<br/>\n<br/>\nWould you feel right if you let your child eat nothing but candy (if <br/>\nthat is what they choose to do) but you never sat them down and told <br/>\nthem that they could get cavities and could lose teeth because of <br/>\nlal the sugar? Would they be making an informed decision or would <br/>\nyou be denying them the truth?<br/>\n<br/>\nI would rather tell my kids the truth, bad or good and then if they <br/>\nchoose to tell others and spread the knowledge... I say spread on!!!!<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Brian & Alexandra <br/>\nPolikowsky&quot; &lt;polykow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  Kristen wrote:<br/>\n&gt; <br/>\n&gt; Thats why I restrict sweets at our house. My daughter who is three <br/>\n&gt; had some friends over a few days after halloween and one mom <br/>\n </span></blockquote>allowed <br/>\n<blockquote><span title=\"ireply\"> &gt; her kids to eat candy after candy just to keep him quiet. Mom <br/>\n </span></blockquote>never <br/>\n<blockquote><span title=\"ireply\"> &gt; said anything, however, my 3 year old jumped right in and told <br/>\n&gt; him &quot;your teeth will fall out of your mouth&quot;. LOL<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;So your daughter does not eat it because you have made <br/>\n </span></blockquote>her afraid of it??? What will it happen when she realizes lots of <br/>\nother kids eat candy and their teeth does not fall out?????<br/>\n<blockquote><span title=\"ireply\"> &gt; Will she have the same trust on you as before?<br/>\n&gt; And worse than binging on something that was limited or prohibit <br/>\n </span></blockquote>is eating something you feel pleasure eating but immense guilt for <br/>\ndoing it.<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t want my kids to grow up and feel guilty if they feel <br/>\n </span></blockquote>pleasure eating a bom-bom. I hope they can enjoy it and be happy and <br/>\ntrust their mom to be truthful to them and not use scare tatics to <br/>\ncontrol them. <br/>\n<blockquote><span title=\"qreply\"> &gt; Alex<br/>\n&gt; <br/>\n&gt; ,___ <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168219603","msgId":20409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuczZrais3NjA3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVucnV0YSsyMjltQGVHcm91cHMuY29tPg=="},"prevInTopic":20407,"nextInTopic":20412,"prevInTime":20408,"nextInTime":20410,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"... three had some friends over a few days after halloween and one mom allowed her kids to eat candy after candy just to keep him quiet. Mom never said","messageBody":"<div id=\"ygrps-yiv-1191790805\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;kristenhendricks55&quot; <br/>\n&lt;kristenhendricks55@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Thats why I restrict sweets at our house. My daughter who is <br/>\n </span></blockquote>three had some friends over a few days after halloween and one mom <br/>\nallowed her kids to eat candy after candy just to keep him quiet. <br/>\nMom never said anything, however, my 3 year old jumped right in and <br/>\ntold him &quot;your teeth will fall out of your mouth&quot;. LOL&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nTeeth don&#39;t fall out from eating candy. <br/>\n<br/>\n&quot;Allowing&quot; a child to eat candy to &quot;shut them up&quot; has nothing to do <br/>\nwith unschooling.  <br/>\n<br/>\nMy 8 year old daughter has total freedom to choose what she puts <br/>\ninto her body. This same daughter just threw out candy that she got <br/>\nfor Halloween. It&#39;s been sitting there for 2 months and she only ate <br/>\nabout a quarter of it.  <br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (8), Shawna (11) & Cimion (14)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a></div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168218034","msgId":20407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWYwMWM3MzJjMCQ2NzRkZjNhMCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PGVucnV0YSsyMjltQGVHcm91cHMuY29tPg=="},"prevInTopic":20405,"nextInTopic":20409,"prevInTime":20406,"nextInTime":20408,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Kristen wrote: Thats why I restrict sweets at our house. My daughter who is three had some friends over a few days after halloween and one mom allowed her kids","messageBody":"<div id=\"ygrps-yiv-963261842\">Kristen wrote:<br/>\n<br/>\nThats why I restrict sweets at our house. My daughter who is three <br/>\nhad some friends over a few days after halloween and one mom allowed <br/>\nher kids to eat candy after candy just to keep him quiet. Mom never <br/>\nsaid anything, however, my 3 year old jumped right in and told <br/>\nhim &quot;your teeth will fall out of your mouth&quot;. LOL<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;So your daughter does not eat it because you have made her afraid of it??? What will it happen when she realizes lots of other kids eat candy and their teeth does not fall out?????<br/>\n </span></blockquote>Will she have the same trust on you as before?<br/>\nAnd worse than binging on something that was limited or prohibit is eating something you feel pleasure eating but immense guilt for doing it.<br/>\nI don&#39;t want my kids to grow up and feel guilty if they feel pleasure eating a bom-bom. I hope they can enjoy it and be happy and trust their mom to be truthful to them and not use scare tatics to control them. <br/>\nAlex<br/>\n<br/>\n,___ <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168216358","msgId":20403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMDY5NC41MzIucW1Ad2ViNTM4MDYubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDQzMzU0LjYxODM4LnFtQHdlYjgzMDA5Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":20401,"nextInTopic":20404,"prevInTime":20402,"nextInTime":20404,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"What I m saying is that it IS a theory that kids who were never forbidden something will never binge on it. It is ALSO a theory that a child who IS forbidden","messageBody":"<div id=\"ygrps-yiv-1762325053\">What I&#39;m saying is that it IS a theory that kids who were never forbidden something will never binge on it.<br/>\n<br/>\nIt is ALSO a theory that a child who IS forbidden something will binge on the forbidden thing when he is on his own.<br/>\n<br/>\nNot true.<br/>\n<br/>\n<br/>\n  *****<br/>\n   <br/>\n  Actually for some of us, it is true.  I was raised in a house where we weren&#39;t allowed junk - -the only cereal we ever had at home was Total, and we only ate Roman Meal bread.  My sister, brother and I were the 20-something-olds (and we each left home at 18, so the food thing took years to work thru) roaming the grocery store with our carts filled with Cap&#39;n Crunch cereal, Froot Loops, fruit cocktail drinks, wonder bread and all manner of other artificial food  It was years before any of us came back around to eating healthy food by choice.  <br/>\n   <br/>\n  And don&#39;t even get me started on the weight issues that confront some of us who lived on very tightly controlled diets.  <br/>\n   <br/>\n  So, for some it is hypothetical, others have personal experience  As with all things your mileage may vary, and we all make our choices with our own past experiences in mind, no matter what the choice. For me the choice is to give my kids as much autonomy as humanly possible, so they can figure out their own dietary needs, preferences and how to moderate all that while they&#39;re still young.<br/>\n   <br/>\n   <br/>\n  also, the above text I snipped was confusing, because I&#39;m not sure if the same person said all those things... <br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n<br/>\n          Gary (dh)<br/>\n  Will (almost 22!) Andy (10-1/2) and Dan (almost 6) <br/>\n   <br/>\n      Peace is the vibrant space which stimulates the dance of kindness, merriment and freedom. ~ unknown<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourhapahome.blogspot.com\">http://ourhapahome.blogspot.com</a><br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168213490","msgId":20405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4Yi42Nzg3MGU2LjMyZDJkZmYyQGFvbC5jb20+"},"prevInTopic":20404,"nextInTopic":20407,"prevInTime":20404,"nextInTime":20406,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/7/2007 6:10:43 P.M. Eastern Standard Time, kristenhendricks55@yahoo.com writes: I was raised with rules and good morals and I know doing","messageBody":"<div id=\"ygrps-yiv-561911975\">In a message dated 1/7/2007 6:10:43 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kristenhendricks55@...\">kristenhendricks55@...</a> writes:<br/>\n<br/>\nI was raised with rules and good morals and I know doing those  things is <br/>\nwrong, so I don&#39;t do them. I have no desire to harm my body is  any way, so I <br/>\nchoose not to.<br/>\n<br/>\n<br/>\n<br/>\nI made the same choice as you, but people who  choose to do those <br/>\n(self-destructive) things are often ALSO raised  with great morals, know those things are <br/>\nwrong but they instead  decide they want to hurt themselves and mess their <br/>\nlives up. I  don&#39;t blame the parents or rules or the word &#39;no&#39; for that. I blame <br/>\n the individual who made that bad choice. This reminds  me of a story that my <br/>\nmom always tells about two sons of an alcoholic. one  became a drinker and <br/>\nthe other never touched alcohol in his life, but when  asked &quot;why do you drink / <br/>\nwhy do you not drink&quot; they both  responded with the answer &quot;because my father <br/>\ndrinks.&quot; <br/>\n <br/>\nWe live in a society of victims who love to blame  their parents, the <br/>\ngovernment, their lack of opportunities, etc...and seek  out therapists who search <br/>\ntheir past for all sorts of abuses that can  answer why they aren&#39;t how they <br/>\nwish they were. They blame  others for everything that didn&#39;t go right rather <br/>\nthan pointing  the finger at themselves and remembering that they had a choice. I <br/>\nrarely  hear people saying &quot;oh yeah, my mom (who tried her hardest and  <br/>\ncommunicated the only way she knew how) DID tell me it would hurt me,  I didn&#39;t <br/>\nlisten and did it anyway and have continued to rebel  and do things that I know <br/>\nwill hurt me for years after, what is wrong  with ME, not my parents, what do I <br/>\nneed to do to straighten  MYSELF out and become self-respecting?&quot;<br/>\n <br/>\nAdriana    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168213085","msgId":20401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuczA4dCt1ajM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzMzU0LjYxODM4LnFtQHdlYjgzMDA5Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":20396,"nextInTopic":20403,"prevInTime":20400,"nextInTime":20402,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"~~What I m saying is that it IS a theory that kids who were never forbidden something will never binge on it. It is ALSO a theory that a child who IS forbidden","messageBody":"<div id=\"ygrps-yiv-1597818539\">~~What I&#39;m saying is that it IS a theory that kids who were never<br/>\nforbidden something will never binge on it.<br/>\n<br/>\nIt is ALSO a theory that a child who IS forbidden something will binge<br/>\non the forbidden thing when he is on his own.<br/>\n<br/>\nNot true.~~<br/>\n<br/>\n<br/>\nFirst of all, the above ideas are NOT just theories, they&#39;re<br/>\nwell-studied human behavior traits. Secondly, you&#39;re painting it in<br/>\nabsolutes and human behavior is never like that.<br/>\n<br/>\nYou can never say &quot;If you do ______, then______ will happen&quot;. That&#39;s<br/>\nsetting up a false argument because there just aren&#39;t any absolutes<br/>\nwhere human&#39;s are concerned. Every person responds to stimulus and<br/>\nenvironment differently. When a very large percentage of people react<br/>\na certain way, we can learn from those situations about what is<br/>\nhelpful or harmful.<br/>\n<br/>\nIt&#39;s pretty easy to see that MOST humans are going to react to food<br/>\ncontrols with some form of binging. Happens all the time. There&#39;s book<br/>\nafter book written on this topic, with solid research to back them.<br/>\nGood research.<br/>\n<br/>\nMy kids &quot;binge&quot; on certain items at times, even though their food is<br/>\nNOT controlled by me. Heck, we all love a good dose of truffles or<br/>\nmashed potatoes or some of the things that we don&#39;t have every day.<br/>\nSometimes root beer floats sound really great and we have a bunch of<br/>\nthose. Trying to keep my kids from binging is not my goal.<br/>\n<br/>\nAll of my children will request foods like brocolli, potatoes,<br/>\nnoodles, pita pockets with hummus, homemade bread and other healthy<br/>\nsnacks. They&#39;ll also ask for candy bars and soda sometimes. I trust<br/>\nthat when their body has had enough, they&#39;ll eat something<br/>\ndifferent...and they do.<br/>\n<br/>\nIt doesn&#39;t FEEL very good to eat a bunch of sugar and nothing else.<br/>\nAfter a while you just crave some protein or a hot meal. I have free<br/>\nchoice over my food and so do they. We all listen to our own body and<br/>\nI trust their learning process with food, just as with all other<br/>\ntopics in the universe.<br/>\n<br/>\nJust because SOME humans won&#39;t react to food controls with unhealthy<br/>\nhabits and behaviors, doesn&#39;t make food controls a good idea.<br/>\n<br/>\nOur prisons are FULL of people that were raised in abusive homes.<br/>\nThere are also some people that were raised in abusive homes that<br/>\ncreate a great life for themselves and do positive things. Does that<br/>\nmean abuse is a good idea, just because SOME people seem to overcome it?  <br/>\n<br/>\nI&#39;m not attempting any specific outcome other than children that trust<br/>\nand know their OWN limits and preferences. If they binge, they<br/>\nbinge....that&#39;s their choice. So far, they&#39;re really healthy and eat a<br/>\nvery balanced diet overall. I don&#39;t use food controls because I think<br/>\nthey suck. I wouldn&#39;t want someone telling ME what to do, what to eat<br/>\netc....so I don&#39;t perpetuate that on my children. <br/>\n<br/>\nBottom line, this lifestyle makes sense to me. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168211690","msgId":20404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucnV0YSsyMjltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwMDY4Ny4zMTc0LnFtQHdlYjgzMDEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":20403,"nextInTopic":20405,"prevInTime":20403,"nextInTime":20405,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"At the time I thought it was alot of rules, but now I see why they did it. I was never just told no because if I had been, I m sure I would have rebelled","messageBody":"<div id=\"ygrps-yiv-617379087\">At the time I thought it was alot of rules, but now I see why they <br/>\ndid it.<br/>\n<br/>\nI was never just told &quot;no&quot; because if I had been, I&#39;m sure I would <br/>\nhave rebelled because I wanted to do it anyway.<br/>\n<br/>\nThey explained to me why I couldnt smoke or drink or what have you. <br/>\nThey told me what it would do to my body and how it would hurt me.<br/>\n<br/>\nThats why I restrict sweets at our house. My daughter who is three <br/>\nhad some friends over a few days after halloween and one mom allowed <br/>\nher kids to eat candy after candy just to keep him quiet. Mom never <br/>\nsaid anything, however, my 3 year old jumped right in and told <br/>\nhim &quot;your teeth will fall out of your mouth&quot;. LOL<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Charles Coleman <br/>\n&lt;shamma346@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wow Kristen!  It sounds like your parents did a really good job on <br/>\n </span></blockquote>you.  It sounds like you were brought up with a lot of love and <br/>\nrespect. It sounds like they took time to explain why they did or <br/>\ndid not allow you to do or have certain things.  <br/>\n<blockquote><span title=\"ireply\"> &gt;   I&#39;m sure his parents did what they believed was the best and I&#39;m <br/>\n </span></blockquote>glad he is starting to take better care of himself.<br/>\n<blockquote><span title=\"ireply\"> &gt;   <br/>\n&gt; <br/>\n&gt; Kristen Hendricks &lt;kristenhendricks55@...&gt; wrote:<br/>\n&gt;           &quot;Her boyfriend is doing better at eating healthy now but <br/>\n </span></blockquote>when he moved out of his parents house and control all he wanted to <br/>\neat was junk and play video games. All the stuff he was not allowed <br/>\nat home. She says he still binges on junk a lot but has gotten more <br/>\nrelaxed after 5 years of only eating junk. &quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; While that is a good theory and may be true in alot of situations, <br/>\n </span></blockquote>not all kids who were not allowed junk food/or were limited on junk <br/>\nfood, will end up eating it non-stop after they move out.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I am only 21 years old, moved out of my parents house when I was <br/>\n </span></blockquote>17. I was not allowed junk food most of the time and wasn&#39;t allowed <br/>\nto eat much in between meals. To this day, I still don&#39;t eat much <br/>\njunkfood... really none at all most of the time.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I never felt the need to binge on it after I moved out.<br/>\n&gt; <br/>\n&gt; While it may be a good theory, it&#39;s not true in my situation.<br/>\n&gt; <br/>\n&gt; I think, is anything, my parents taught me to eat it in moderation <br/>\n </span></blockquote>because it&#39;s bad for me. Therefore, I understood that when I got <br/>\nolder and just decided not to eat it since it was bad for my body.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Brian & Alexandra Polikowsky &lt;polykow@...&gt; wrote:<br/>\n&gt; Wood_haven wrote:<br/>\n&gt; All of his friends are told what to eat, when to eat, and how much <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; eat. Food is labeled as good or bad, etc. I have been startled at <br/>\n </span></blockquote>how <br/>\n<blockquote><span title=\"ireply\"> &gt; many occasions that I see these kids STEAL food from plates and <br/>\n&gt; drawers and sneak around to eat them. The parents tell me that if <br/>\n&gt; they don&#39;t control what the kids eat that they would never stop. <br/>\n </span></blockquote>So <br/>\n<blockquote><span title=\"ireply\"> &gt; what happens when mom or dad are no longer there?<br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I will tell you what happens. My 23 year old nice <br/>\n </span></blockquote>was here visiting us from NC where she goes to College. Her <br/>\nboyfriend that she has been dating since High School was <br/>\nhomeschooled and his mom was somewhat an unschooler. But she did <br/>\nlimit TV and allowed no video games or any junk food. They only ate <br/>\nhealthy organic stuff.<br/>\n<blockquote><span title=\"ireply\"> &gt; My niece was not homeschooled by my sister never limited or <br/>\n </span></blockquote>controlled her food because that was they way we were raise by my <br/>\nmom. My niece eats very healthy and she is a lacto-ova vegetarian by <br/>\nchoice since she was I think 15 or 16 ( my sister is not and never <br/>\nwas). Her boyfriend is doing better at eating healthy now but when <br/>\nhe moved out of his parents house and control all he wanted to eat <br/>\nwas junk and play video games. All the stuff he was not allowed at <br/>\nhome. She says he still binges on junk a lot but has gotten more <br/>\nrelaxed after 5 years of only eating junk. He still likes junk more <br/>\nthan healthy food.<br/>\n<blockquote><span title=\"ireply\"> &gt; So all the controlling his parents did only cause him to not like <br/>\n </span></blockquote>the healthy food and crave &quot;junk&quot;.<br/>\n<blockquote><span title=\"ireply\"> &gt; Alex<br/>\n&gt; <br/>\n&gt; __,_&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;._,___ <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; *Kristen*<br/>\n&gt; Kendall MacKenzie<br/>\n&gt; 8/30/2003<br/>\n&gt; Riley Elizabeth<br/>\n&gt; 11/7/2005<br/>\n&gt; Nolan Alexander<br/>\n&gt; 9/20/2006<br/>\n&gt; <br/>\n&gt; ---------------------------------<br/>\n&gt; Any questions? Get answers on any topic at Yahoo! Answers. Try it <br/>\n </span></blockquote>now.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;          <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":214857126,"authorName":"Kristen Hendricks","from":"Kristen Hendricks &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168210205","msgId":20396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMzU0LjYxODM4LnFtQHdlYjgzMDA5Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDAwZGEwMWM3MzJhMyRlZmJkY2Q0MCQ2NDU4YThjMEBPZmZpY2U+"},"prevInTopic":20395,"nextInTopic":20401,"prevInTime":20395,"nextInTime":20397,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"The idea is a theory... maybe not your particular situation sinc eyou know this person. What I m saying is that it IS a theory that kids who were never","messageBody":"<div id=\"ygrps-yiv-346383996\">The idea is a theory... maybe not your particular situation sinc eyou know this person.<br/>\n   <br/>\n  What I&#39;m saying is that it IS a theory that kids who were never forbidden something will never binge on it.<br/>\n   <br/>\n  It is ALSO a theory that a child who IS forbidden something will binge on the forbidden thing when he is on his own.<br/>\n   <br/>\n  Not true.<br/>\n   <br/>\n  My parents made it very clear I was not to drink, smoke or do drugs growing up. And that was the bottom line... I was not to question their decisions whatsoever.<br/>\n   <br/>\n  To this day I have never done any sort of drug, I have had two drinks EVER (one this new years eve and one last year) and have never even raised a cigarette to my mouth.<br/>\n   <br/>\n  I have no desire to, because I as my own person can make my own decisions now based on what I feel is right for me.<br/>\n   <br/>\n  I was raised with rules and good morals and I know doing those things is wrong, so I don&#39;t do them. I have no desire to harm my body is any way, so I choose not to.<br/>\n   <br/>\n  And this is coming from a person who was brought up in a house FULL of rules. <br/>\n<br/>\nBrian & Alexandra Polikowsky &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykow@...\">polykow@...</a>&gt; wrote:<br/>\n          Kristen wrote<br/>\n<br/>\nWhile that is a good theory and may be true in alot of situations, not all kids who were not allowed junk food/or were limited on junk food, will end up eating it non-stop after they move out.<br/>\n<br/>\nI am only 21 years old, moved out of my parents house when I was 17. I was not allowed junk food most of the time and wasn&#39;t allowed to eat much in between meals. To this day, I still don&#39;t eat much junkfood... really none at all most of the time.<br/>\n<br/>\nI never felt the need to binge on it after I moved out.<br/>\n<br/>\nWhile it may be a good theory, it&#39;s not true in my situation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;First of all this case is not a &quot;theory&quot;. This is a kid I have known since he was 17 years old. Second of all the percentage of kids that binge eat and drink and gain weight in College is so big you may wonder why. Is it because the parents are not there to control them????I was also raised in Brazil where it is like France and a lot of parents will let their kids drink. I remember drinking as early as 6. Sunday late afternoon lunches always included a glass of red wine if a kid wanted and our parents bar was always open. Non of the four kids in our family drink in a regular basis now. And I don&#39;t remember a lot of drinking in College either. There were two times I had too much to drink when I was on my twenties and because I did not like not being totally on control of MYSELF I really dislike being drunk. I cannot image why kids go to College and go crazy drinking until they are sick....<br/>\n </span></blockquote>Alex<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n      *Kristen*<br/>\n  Kendall MacKenzie<br/>\n  8/30/2003<br/>\n  Riley Elizabeth<br/>\n  11/7/2005<br/>\n  Nolan Alexander<br/>\n  9/20/2006<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nHave a burning question? Go to Yahoo! Answers and get answers from real people who know.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168205808","msgId":20393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGEwMWM3MzJhMyRlZmJkY2Q0MCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PDc5MjI5NS45MTUxMS5xbUB3ZWI4MzAwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":20389,"nextInTopic":20395,"prevInTime":20392,"nextInTime":20394,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Kristen wrote While that is a good theory and may be true in alot of situations, not all kids who were not allowed junk food/or were limited on junk food, will","messageBody":"<div id=\"ygrps-yiv-542414984\">Kristen wrote<br/>\n<br/>\nWhile that is a good theory and may be true in alot of situations, not all kids who were not allowed junk food/or were limited on junk food, will end up eating it non-stop after they move out.<br/>\n<br/>\nI am only 21 years old, moved out of my parents house when I was 17. I was not allowed junk food most of the time and wasn&#39;t allowed to eat much in between meals. To this day, I still don&#39;t eat much junkfood... really none at all most of the time.<br/>\n<br/>\nI never felt the need to binge on it after I moved out.<br/>\n<br/>\nWhile it may be a good theory, it&#39;s not true in my situation.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;First of all this case is not a &quot;theory&quot;. This is a kid I have known since he was 17 years old. Second of all the percentage of kids that binge eat and drink and gain weight in College is so big you may wonder why. Is it because the parents are not there to control them????I was also raised in Brazil where it is like France and a lot of parents will let their kids drink. I remember drinking as early as 6. Sunday late afternoon lunches always included a glass of red wine if a kid wanted and our parents bar was always open. Non of the four kids in our family drink in a regular basis now. And I don&#39;t remember a lot of drinking in College either. There were two times I had too much to drink when I was on my twenties and because I did not like not being totally on control of MYSELF I really dislike being drunk. I cannot image why kids go to College and go crazy drinking until they are sick....<br/>\n </span></blockquote>Alex<br/>\n   <br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168199190","msgId":20389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5QzU0REM3LTUxNzYtNDU3NC1BRkZELUQ0RjU4OTIyOEQ4OEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDc5MjI5NS45MTUxMS5xbUB3ZWI4MzAwNC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDc5MjI5NS45MTUxMS5xbUB3ZWI4MzAwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":20383,"nextInTopic":20393,"prevInTime":20388,"nextInTime":20390,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"... It s not a theory. It s statistics. Some kids come out of school barely able to function. Some kids come out of school and go onto Harvard. Which is the","messageBody":"<div id=\"ygrps-yiv-197188129\">On Jan 7, 2007, at 12:45 PM, Kristen Hendricks wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While that is a good theory and may be true in alot of situations,  <br/>\n&gt; not all kids who were not allowed junk food/or were limited on junk  <br/>\n&gt; food, will end up eating it non-stop after they move out.<br/>\n<br/>\n </span></blockquote>It&#39;s not a theory. It&#39;s statistics.<br/>\n<br/>\nSome kids come out of school barely able to function.<br/>\n<br/>\nSome kids come out of school and go onto Harvard.<br/>\n<br/>\nWhich is the right theory?<br/>\n<br/>\nNone. It&#39;s statistics. A certain percentage will go onto Harvard and  <br/>\na certain percentage will have a tough time getting a job at Wal-Mart.<br/>\n<br/>\nIt is a common *human* behavior to respond to limits by hoarding or  <br/>\nexcessively craving what was once limited. It won&#39;t be 100% response.  <br/>\nMaybe not even 75%. I haven&#39;t kept statistics on it over the past 12  <br/>\nyears of reading the stories of the outcomes of removing limits, but  <br/>\nit&#39;s *very* common for kids to binge on what they&#39;ve been denied. It  <br/>\ncan be TV or snacky food or anything (but those are the most common  <br/>\nthings parents limit so those are what most of the stories are about.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":281428919,"authorName":"Charles Coleman","from":"Charles Coleman &lt;shamma346@...&gt;","profile":"sanus346","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168199078","msgId":20395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMDY4Ny4zMTc0LnFtQHdlYjgzMDEyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDc5MjI5NS45MTUxMS5xbUB3ZWI4MzAwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":20393,"nextInTopic":20396,"prevInTime":20394,"nextInTime":20396,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Wow Kristen!  It sounds like your parents did a really good job on you.  It sounds like you were brought up with a lot of love and respect. It sounds like they","messageBody":"<div id=\"ygrps-yiv-576690052\">Wow Kristen!  It sounds like your parents did a really good job on you.  It sounds like you were brought up with a lot of love and respect. It sounds like they took time to explain why they did or did not allow you to do or have certain things.  <br/>\n  I&#39;m sure his parents did what they believed was the best and I&#39;m glad he is starting to take better care of himself.<br/>\n  <br/>\n<br/>\nKristen Hendricks &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kristenhendricks55@...\">kristenhendricks55@...</a>&gt; wrote:<br/>\n          &quot;Her boyfriend is doing better at eating healthy now but when he moved out of his parents house and control all he wanted to eat was junk and play video games. All the stuff he was not allowed at home. She says he still binges on junk a lot but has gotten more relaxed after 5 years of only eating junk. &quot;<br/>\n<br/>\nWhile that is a good theory and may be true in alot of situations, not all kids who were not allowed junk food/or were limited on junk food, will end up eating it non-stop after they move out.<br/>\n<br/>\nI am only 21 years old, moved out of my parents house when I was 17. I was not allowed junk food most of the time and wasn&#39;t allowed to eat much in between meals. To this day, I still don&#39;t eat much junkfood... really none at all most of the time.<br/>\n<br/>\nI never felt the need to binge on it after I moved out.<br/>\n<br/>\nWhile it may be a good theory, it&#39;s not true in my situation.<br/>\n<br/>\nI think, is anything, my parents taught me to eat it in moderation because it&#39;s bad for me. Therefore, I understood that when I got older and just decided not to eat it since it was bad for my body.<br/>\n<br/>\nBrian & Alexandra Polikowsky &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykow@...\">polykow@...</a>&gt; wrote:<br/>\nWood_haven wrote:<br/>\nAll of his friends are told what to eat, when to eat, and how much to <br/>\neat. Food is labeled as good or bad, etc. I have been startled at how <br/>\nmany occasions that I see these kids STEAL food from plates and <br/>\ndrawers and sneak around to eat them. The parents tell me that if <br/>\nthey don&#39;t control what the kids eat that they would never stop. So <br/>\nwhat happens when mom or dad are no longer there?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I will tell you what happens. My 23 year old nice was here visiting us from NC where she goes to College. Her boyfriend that she has been dating since High School was homeschooled and his mom was somewhat an unschooler. But she did limit TV and allowed no video games or any junk food. They only ate healthy organic stuff.<br/>\n </span></blockquote>My niece was not homeschooled by my sister never limited or controlled her food because that was they way we were raise by my mom. My niece eats very healthy and she is a lacto-ova vegetarian by choice since she was I think 15 or 16 ( my sister is not and never was). Her boyfriend is doing better at eating healthy now but when he moved out of his parents house and control all he wanted to eat was junk and play video games. All the stuff he was not allowed at home. She says he still binges on junk a lot but has gotten more relaxed after 5 years of only eating junk. He still likes junk more than healthy food.<br/>\nSo all the controlling his parents did only cause him to not like the healthy food and crave &quot;junk&quot;.<br/>\nAlex<br/>\n<br/>\n__,_&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;._,___ <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n*Kristen*<br/>\nKendall MacKenzie<br/>\n8/30/2003<br/>\nRiley Elizabeth<br/>\n11/7/2005<br/>\nNolan Alexander<br/>\n9/20/2006<br/>\n<br/>\n---------------------------------<br/>\nAny questions? Get answers on any topic at Yahoo! Answers. Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":214857126,"authorName":"Kristen Hendricks","from":"Kristen Hendricks &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168191950","msgId":20383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5MjI5NS45MTUxMS5xbUB3ZWI4MzAwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDAwNjEwMWM3MzI4MCQxZWQ3YTQ4MCQ2NDU4YThjMEBPZmZpY2U+"},"prevInTopic":20382,"nextInTopic":20389,"prevInTime":20382,"nextInTime":20384,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Her boyfriend is doing better at eating healthy now but when he moved out of his parents house and control all he wanted to eat was junk and play video games.","messageBody":"<div id=\"ygrps-yiv-1379070449\">&quot;Her boyfriend is doing better at eating healthy now but when he moved out of his parents house and control all he wanted to eat was junk and play video games. All the stuff he was not allowed at home. She says he still binges on junk a lot but has gotten more relaxed after 5 years of only eating junk. &quot;<br/>\n   <br/>\n  While that is a good theory and may be true in alot of situations, not all kids who were not allowed junk food/or were limited on junk food, will end up eating it non-stop after they move out.<br/>\n   <br/>\n  I am only 21 years old, moved out of my parents house when I was 17. I was not allowed junk food most of the time and wasn&#39;t allowed to eat much in between meals. To this day, I still don&#39;t eat much junkfood... really none at all most of the time.<br/>\n   <br/>\n  I never felt the need to binge on it after I moved out.<br/>\n   <br/>\n  While it may be a good theory, it&#39;s not true in my situation.<br/>\n   <br/>\n  I think, is anything, my parents taught me to eat it in moderation because it&#39;s bad for me. Therefore, I understood that when I got older and just decided not to eat it since it was bad for my body.<br/>\n<br/>\nBrian & Alexandra Polikowsky &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykow@...\">polykow@...</a>&gt; wrote:<br/>\n          Wood_haven wrote:<br/>\nAll of his friends are told what to eat, when to eat, and how much to <br/>\neat. Food is labeled as good or bad, etc. I have been startled at how <br/>\nmany occasions that I see these kids STEAL food from plates and <br/>\ndrawers and sneak around to eat them. The parents tell me that if <br/>\nthey don&#39;t control what the kids eat that they would never stop. So <br/>\nwhat happens when mom or dad are no longer there?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I will tell you what happens. My 23 year old nice was here visiting us from NC where she goes to College. Her boyfriend that she has been dating since High School was homeschooled and his mom was somewhat an unschooler. But she did limit TV and allowed no video games or any junk food. They only ate healthy organic stuff.<br/>\n </span></blockquote>My niece was not homeschooled by my sister never limited or controlled her food because that was they way we were raise by my mom. My niece eats very healthy and she is a lacto-ova vegetarian by choice since she was I think 15 or 16 ( my sister is not and never was). Her boyfriend is doing better at eating healthy now but when he moved out of his parents house and control all he wanted to eat was junk and play video games. All the stuff he was not allowed at home. She says he still binges on junk a lot but has gotten more relaxed after 5 years of only eating junk. He still likes junk more than healthy food.<br/>\nSo all the controlling his parents did only cause him to not like the healthy food and crave &quot;junk&quot;.<br/>\nAlex<br/>\n<br/>\n__,_&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;._,___ <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n      *Kristen*<br/>\n  Kendall MacKenzie<br/>\n  8/30/2003<br/>\n  Riley Elizabeth<br/>\n  11/7/2005<br/>\n  Nolan Alexander<br/>\n  9/20/2006<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nAny questions?  Get answers on any topic at Yahoo! Answers. Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: kids need to hear NO from parents!","postDate":"1168190425","msgId":20382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjEwMWM3MzI4MCQxZWQ3YTQ4MCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PGVucTdjbis3ZWhzQGVHcm91cHMuY29tPg=="},"prevInTopic":20374,"nextInTopic":20383,"prevInTime":20381,"nextInTime":20383,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"Wood_haven wrote: All of his friends are told what to eat, when to eat, and how much to eat. Food is labeled as good or bad, etc. I have been startled at how ","messageBody":"<div id=\"ygrps-yiv-483162041\">Wood_haven wrote:<br/>\nAll of his friends are told what to eat, when to eat, and how much to <br/>\neat. Food is labeled as good or bad, etc. I have been startled at how <br/>\nmany occasions that I see these kids STEAL food from plates and <br/>\ndrawers and sneak around to eat them. The parents tell me that if <br/>\nthey don&#39;t control what the kids eat that they would never stop. So <br/>\nwhat happens when mom or dad are no longer there?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I will tell you what happens. My 23 year old nice was here visiting us from NC where she goes to College. Her boyfriend that she has been dating since High School was homeschooled and his mom was somewhat an unschooler. But she did limit TV and allowed no video games or any junk food. They only ate healthy organic stuff.<br/>\n </span></blockquote>My niece was not homeschooled by my sister never limited or controlled her food because that was they way we were raise by my mom. My niece eats very healthy and she is a lacto-ova vegetarian by choice since she was I think 15 or 16 ( my sister is not and never was). Her boyfriend is doing better at eating healthy now but when he moved out of his parents house and control all he wanted to eat was junk and play video games. All the stuff he was not allowed at home. She says he still binges on junk a lot but has gotten more relaxed after 5 years of only eating junk. He still likes junk more than healthy food.<br/>\nSo all the controlling his parents did only cause him to not like the healthy food and crave &quot;junk&quot;.<br/>\nAlex<br/>\n<br/>\n<br/>\n   <br/>\n  __,_&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;._,___ <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137994288,"authorName":"woodhaven_farm","from":"&quot;woodhaven_farm&quot; &lt;woodhaven_farm@...&gt;","profile":"woodhaven_farm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168154839","msgId":20370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucTdjbis3ZWhzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVucHZmbitpMjhpQGVHcm91cHMuY29tPg=="},"prevInTopic":20366,"nextInTopic":20374,"prevInTime":20369,"nextInTime":20371,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"... When I first started parenting, I was very concerned about food. I was very selective about what came in the house. Then I started noticing how friends","messageBody":"<div id=\"ygrps-yiv-227176109\">--- &lt;fivefreebirds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;&lt;&lt;As much as I like to give free<br/>\n&gt; choice (they can pick between healthy foods) and I offer junk food<br/>\n&gt; in moderation... I just don&#39;t feel comfortable saying you can have<br/>\n&gt; it whenever you want it.&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>When I first started parenting, I was very concerned about food. I <br/>\nwas very selective about what came in the house. Then I started <br/>\nnoticing how friends older kids acted about food and feeling like a <br/>\nhypocrit when I wanted the food that I was concealing from my child. <br/>\nBy the time Ihad my first bio child, I had changed my views on many <br/>\nthings.<br/>\n<br/>\nDS (4) has never had any food restrictions. Certain foods upset his <br/>\nstomach, and I have helped with that connection, but sometimes he <br/>\nwants to try them, and that is his choice. He is an active <br/>\nparticipant when we grocery shop. He may chose what ever he wants. <br/>\nThis is not to say that I do not provide him with little tidbits <br/>\nabout nutrition and ingrediants, but if he were to prefer goldfish to <br/>\nhis chedder bunnies, that is his choice.<br/>\n<br/>\nOverall, ds eats a pretty healthy diet. He eats when he is hungry. <br/>\nWhen people offer him treats sometimes he says yes, sometimes no. We <br/>\nhave had two buckets of halloween candy on the table since halloween. <br/>\nI think he has eaten a handful so far (and there is lots of &quot;good&quot; <br/>\ncandy in there). <br/>\n<br/>\nAll of his friends are told what to eat, when to eat, and how much to <br/>\neat. Food is labeled as good or bad, etc. I have been startled at how <br/>\nmany occasions that I see these kids STEAL food from plates and <br/>\ndrawers and sneak around to eat them. The parents tell me that if <br/>\nthey don&#39;t control what the kids eat that they would never stop. So <br/>\nwhat happens when mom or dad are no longer there?<br/>\n<br/>\nIt makes me so sad to see the power that food has in these kids <br/>\nlives. The kids cry, beg, whine, and meltdown all over food. We had a <br/>\nChristmas party complete with Santa, but most of the kids were to <br/>\nbusy watching the goodies and slipping past them to sneak a bite to <br/>\nenjoy Santa. My son was so excited that he didn&#39;t even eat any sweets.<br/>\n<br/>\nI watched a kid swipe candy from a desk while their parent was <br/>\nchecking them in (drs office). The kid slipped in the corner to eat, <br/>\nlooked nervously at me, and asked me if I let my kid eat candy. I <br/>\nsaid sure. She asked how much or something to that effect. I told her <br/>\nthat he could eat what he wanted when he wanted. She was dumbfounded, <br/>\nthen told me what an awesome mom I was. I don&#39;t want my kid growing <br/>\nup coveting a candy bar.<br/>\n<br/>\nWhile every person has different tastes, I really think if &quot;junk <br/>\nfood&quot; is just there and not assigned any power, that kids will show <br/>\nmoderation without soemone having to &quot;control&quot; them. Maybe not at the <br/>\nget go, but as soon as they realize that it is available at their <br/>\ndiscretion.</div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids need to hear NO from parents!","postDate":"1168149985","msgId":20374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucTJsMStqN2s2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVucHZmbitpMjhpQGVHcm91cHMuY29tPg=="},"prevInTopic":20370,"nextInTopic":20382,"prevInTime":20373,"nextInTime":20375,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"It s funny the way you explained that. It just got me thinking of something. At home, all the candy is put up and my three year old asks for it when she wants","messageBody":"<div id=\"ygrps-yiv-2116197006\">It&#39;s funny the way you explained that. It just got me thinking of <br/>\nsomething.<br/>\n<br/>\nAt home, all the candy is put up and my three year old asks for it <br/>\nwhen she wants some. (my younger two are only 14 mos and 3 mos so <br/>\nthey dont get candy lol)<br/>\n<br/>\nSo when she has the chance to get her hands on some, it&#39;s gone in a <br/>\nheartbeat.<br/>\n<br/>\nBut now that I think about it... we go to gym class every week and <br/>\nafterwards we always hit the pizza buffet restaurant. They have <br/>\npizza, pasta, and salad. <br/>\n<br/>\nI guess since pizza would be the &quot;junk food&quot; of the three... and <br/>\nshes always been able to have the pizza... its not as desirable to <br/>\nher anymore. That would explain why she now only wants the salad and <br/>\nbreadsticks. Okay and maybe a brownie too LOL<br/>\n<br/>\nBut I guess if I look at it from the way youre explaining it... shes <br/>\nnow picking the salad and veggies(and it blows my mind since shes <br/>\nthree lol) because she knows the pizza will be there if she wants it.<br/>\n<br/>\nIve never thought of it like that I guess... hmmm...<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;frozenandcold&quot; <br/>\n&lt;fivefreebirds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;&lt;&lt;As much as I like to give free<br/>\n&gt; choice (they can pick between healthy foods) and I offer junk food<br/>\n&gt; in moderation... I just don&#39;t feel comfortable saying you can have<br/>\n&gt; it whenever you want it.&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; The point being is that when kids are in control of what they put <br/>\n </span></blockquote>in <br/>\n<blockquote><span title=\"ireply\"> &gt; their mouth they begin to listen to their bodies and make wise <br/>\n </span></blockquote>food <br/>\n<blockquote><span title=\"ireply\"> &gt; choices most of the time.  My kids have total control over what <br/>\n </span></blockquote>they <br/>\n<blockquote><span title=\"ireply\"> &gt; choose to eat or not and most of the time they choose those things <br/>\n&gt; that are healthier for them.  We have &quot;junk food&quot; around and we <br/>\n&gt; have &quot;healthy&quot; things around and they usually eat a little of <br/>\n </span></blockquote>both.  <br/>\n<blockquote><span title=\"ireply\"> &gt; I put out platters of vegetables, fruit, cheese, crackers, etc.  <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; the vegetables are usually the first to go.  After a few pieces of <br/>\n&gt; candy Tristan will usually ask me to make him something healthy <br/>\n&gt; because he doesn&#39;t feel so good.  They really do learn to listen <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; cues their bodies give them.  <br/>\n&gt; <br/>\n&gt; The problem lies with children who are controlled and then when <br/>\n&gt; given that control they will gorge on the stuff that they usually <br/>\n&gt; can&#39;t have, because they believe it won&#39;t be there tomorrow.  They <br/>\n&gt; will ignore how they feel because they are hording.  Poverty <br/>\n&gt; stricken people or ones that, at some point in their lives have <br/>\n </span></blockquote>had <br/>\n<blockquote><span title=\"ireply\"> &gt; to live in poverty, will do the same thing, as was already <br/>\n </span></blockquote>mentioned.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Many, many times my kids will say &#39;no thanks&#39; to sweets and <br/>\n </span></blockquote>goodies <br/>\n<blockquote><span title=\"qreply\"> &gt; because they don&#39;t feel like it and they do it because they know <br/>\n&gt; they can wake up in the morning and have the same thing at home if <br/>\n&gt; they want.  Tristan threw away half of his Halloween candy because <br/>\n&gt; he knew he would never finish it.  People are always flabbergasted <br/>\n&gt; that my kids will say no to goodies.  And I certainly haven&#39;t put <br/>\n&gt; their health in jeopordy, they are some of the healthiest kids I <br/>\n&gt; know and they will eat all sorts of things that most kids wouldn&#39;t <br/>\n&gt; even touch, ie tofu, Thai food, hummus, etc.  And they HATE <br/>\n&gt; McDonalds! (except the fries on occasion)  <br/>\n&gt; <br/>\n&gt; Heidi<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":236897304,"authorName":"frozenandcold","from":"&quot;frozenandcold&quot; &lt;fivefreebirds@...&gt;","profile":"frozenandcold","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"re: kids need to hear NO from parents!","postDate":"1168146743","msgId":20366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucHZmbitpMjhpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20370,"prevInTime":20365,"nextInTime":20367,"topicId":20366,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-361531302\">&lt;&lt;&lt;&lt;As much as I like to give free<br/>\nchoice (they can pick between healthy foods) and I offer junk food<br/>\nin moderation... I just don&#39;t feel comfortable saying you can have<br/>\nit whenever you want it.&gt;&gt;&gt;&gt;<br/>\n<br/>\nThe point being is that when kids are in control of what they put in <br/>\ntheir mouth they begin to listen to their bodies and make wise food <br/>\nchoices most of the time.  My kids have total control over what they <br/>\nchoose to eat or not and most of the time they choose those things <br/>\nthat are healthier for them.  We have &quot;junk food&quot; around and we <br/>\nhave &quot;healthy&quot; things around and they usually eat a little of both.  <br/>\nI put out platters of vegetables, fruit, cheese, crackers, etc.  and <br/>\nthe vegetables are usually the first to go.  After a few pieces of <br/>\ncandy Tristan will usually ask me to make him something healthy <br/>\nbecause he doesn&#39;t feel so good.  They really do learn to listen to <br/>\ncues their bodies give them.  <br/>\n<br/>\nThe problem lies with children who are controlled and then when <br/>\ngiven that control they will gorge on the stuff that they usually <br/>\ncan&#39;t have, because they believe it won&#39;t be there tomorrow.  They <br/>\nwill ignore how they feel because they are hording.  Poverty <br/>\nstricken people or ones that, at some point in their lives have had <br/>\nto live in poverty, will do the same thing, as was already mentioned.<br/>\n<br/>\n<br/>\nMany, many times my kids will say &#39;no thanks&#39; to sweets and goodies <br/>\nbecause they don&#39;t feel like it and they do it because they know <br/>\nthey can wake up in the morning and have the same thing at home if <br/>\nthey want.  Tristan threw away half of his Halloween candy because <br/>\nhe knew he would never finish it.  People are always flabbergasted <br/>\nthat my kids will say no to goodies.  And I certainly haven&#39;t put <br/>\ntheir health in jeopordy, they are some of the healthiest kids I <br/>\nknow and they will eat all sorts of things that most kids wouldn&#39;t <br/>\neven touch, ie tofu, Thai food, hummus, etc.  And they HATE <br/>\nMcDonalds! (except the fries on occasion)  <br/>\n<br/>\nHeidi</div>","specialLinks":[]}],"prevTopicId":20676,"nextTopicId":20275}}