{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Taking in a teen (LONG)","postDate":"1157048498","msgId":16988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwODMxMTgyMTM4LjYxMDU5LnFtYWlsQHdlYjMyNjExLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDExNTcwMzg5ODMuNDkzLjkwNzU0Lm0yMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":16987,"nextInTime":16989,"topicId":16988,"numMessagesInTopic":0,"msgSnippet":"I ll try to keep this brief, but not sure that I can. A young girl (13) has sort of fallen into our lives.  We have known her for about 3 years, but she","messageBody":"<div id=\"ygrps-yiv-97400540\">I&#39;ll try to keep this brief, but not sure that I can.  <br/>\n <br/>\nA young girl (13) has sort of fallen into our lives.  We have known her for about 3 years, but she recently moved to a rather dangerous neighborhood and is definitely considered a &quot;high-risk&quot; teen (I&#39;ll call her DR).  Until about 3 months ago, we didn&#39;t have any idea about her situation as we knew her though another family in the neighborhood.  She liked to hang around and play with my children when she was visiting her friend and needed a break, etc.  Little by little, she (and we) have all become attached to each other.  <br/>\n <br/>\nA few background pieces: She and her 18-mo-old brother are both US citizens (born here), but mom is not though DR will sponsor her in 5 years and she will become legal.  Her dad has never been in the picture and baby&#39;s dad was deported about 6 months ago (I was told only because he was an illegal alien).  Baby has a medical syndrome and requires a little extra care, though not much so far.  They live in a 1-bedroom apartment.  She has smoked pot a few times and recently tried crystal meth.  She is active on MySpace and is communicating with who-knows-how-many total strangers, many who say they are in their 20s.  If she enters the school system where they just moved, there is a lot of black-on-black gang violence and Hispanic/black fighting (her words, not mine).  She has traveled by public transportation all over Los Angeles, including home to a rough part of Compton, at all hours of the day and night *alone*.  She has been suspended from school 4x and would really rather<br/>\n be home-schooled.  Thus far, she has been open and told me all of this.  <br/>\n <br/>\nShe WANTS to live with us and we have the means (though not a lot of space) to do so.  We BOTH really want to help her.  DH and I both feel like she is at a crucial turning point in her life.  We do not want to foster her because that would mean involving CPS, which would hurt her mother and brother, but there are 2 other options (guardianship and advocacy affidavit), which allow us to educate her (and more in the case of guardianship).  Her mother is young and struggling, loving and kind, but it also sounds like she resorts to hitting, etc. when she cannot &quot;control&quot; her daughter.  Mom is open to us helping to raise DR and just having visits.  Mom is overwhelmed.  Mom basically leaves her on her own (e.g. went to her elementary graduation, but never went to her violin concerts, teacher conferences, etc.), but does try to prevent the car rides with older teens, etc. (though not successfully).  <br/>\n <br/>\nThrough a lot of discussion with DR, we have come to many agreements about how life will look on a daily basis.  Despite the challenges that she has faced, she is mature, caring, kind and genuinely hoping to take charge of her life.  She feels like to survive and be protected in her potential new school, she will have to hang out with the rough kids and do what they do to fit in.  I tend to agree and think she would do much better (as would almost anyone) at home, if she had caring supervision.<br/>\n <br/>\nI should also add that we have taken her us on a few trips (each a week long) and she has been great, enthusiastic, positive, etc.  She still totally loves learning.  <br/>\n <br/>\nMy main concern is MySpace, which I believe can be very positive, however, I think is very risky in this situation.  There is enough information on her site to help any predator find her (and us) and I&#39;m sure I don&#39;t even know 10% of what is going on there.  Any tips on how to handle that if we take her in?  Generally, she is on MySpace (one of our extra computers) and her cell phone (provided by our neighbors in case she gets stuck in an emergency) all night long.<br/>\n <br/>\nShe has historically also hung out with 17-20-year-olds (one of which was the drug source).  Now, I think it is great for kids to be friends with people of all ages, but in this situation, it flat out scares me.<br/>\n <br/>\nI love DR and want to help her, but I also don&#39;t want to put my family (with very little ones) at risk by being completely trusting that she will make wise decisions with all the strangers in cyberspace when she has no previous guidance in this area (and it shows -- provocative pictures, wrong age, etc.).  <br/>\n <br/>\nSince she has been schooled her whole life and largely unsupervised, what other things can I do to start her off on the right foot?  DH says he is not sure we can approach this as we would with our own kids who haven&#39;t been exposed to much of anything yet.  We will have to do some reporting, but she wants to &quot;do school at home&quot; for now (maybe that will be less of an issue later -- and I need to look into that if we do something formal like assume guardianship).  Is it crazy to take her in?  We feel like there is a *reason* she has come into our lives, but I also think that the heart can override the head in a way that might be harmful.  <br/>\n <br/>\nAny thoughts and tips would be greatly appreciated.  If anyone has experience with something similar (fostering, adopting older kids, etc.), I would love to hear your ideas.  I also want her to be protected on MySpace, but I don&#39;t want to forbid or be authoritarian about it.  <br/>\n <br/>\nThanks!  <br/>\n <br/>\nChriste<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":16982,"nextTopicId":16970}}