{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What to do when older sibling acts unsafely with younger sibling","postDate":"1258734545","msgId":42119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFRTlFRDIzOEVERTQwREZBNzRENUE2NTAzNUIyMDNBQGJpZ3N1cnByaXNlPg=="},"prevInTopic":42117,"nextInTopic":0,"prevInTime":42118,"nextInTime":42120,"topicId":42117,"numMessagesInTopic":0,"msgSnippet":"***I ve tried explaining that what she is doing can break the play-pen, and that she is hurting him, but she doesn t stop. **** She may be trying to keep him","messageBody":"<div id=\"ygrps-yiv-2079675253\">***I&#39;ve tried explaining that what she is doing can break the play-pen, and that she is hurting him, but she doesn&#39;t stop. ****<br/>\n<br/>\nShe may be trying to keep him in the playpen.  When he&#39;s standing, holding on to the edge, he may look to her like he&#39;s about to climb out.  She might think she&#39;s helping you.<br/>\n<br/>\nShe&#39;s not acting unsafely.  She&#39;s three.  It&#39;s your responsibility to keep the baby safe, not hers. <br/>\n<br/>\n***I don&#39;t want to continue in this direction and end up with time-outs...*** <br/>\n<br/>\nTime out isn&#39;t the answer.   People don&#39;t respond to punishment in positive ways.  It might seem to parents that punishment sometimes get the behavior they want but what really happens is kids figure a way to do/get what they want AND avoid the punishment.   Punishment can make kids sneaky.   <br/>\n<br/>\n***... or being in her room until she can act better.***<br/>\n<br/>\nAre you prepared to keep her in her room for weeks, months, years?  Probably not.    Your three year olds development and understanding is happening on her schedule, not yours and not her baby brother&#39;s.   You won&#39;t change a behavior by keeping her in her room.  When she can understand why it&#39;s better not to push her little brother down and when she can control the impulse to do so, you&#39;ll see less pushing.  She&#39;s very little.  <br/>\n<br/>\nIf the playpen seems to be the problem, get rid of it.  Would it really break if your three year old was in it?    Maybe she&#39;d like to play in there!  It probably would only be a sometimes thing.  Three year olds are not long interested in confinement. &lt;g&gt;  You mentioned twice your concern about the play pen getting broken.  It was even listed first, before hurting brother, as a reason the three year old shouldn&#39;t push the baby down.  If the baby isn&#39;t at real risk of getting hurt and the issue is really the playpen then put it away or, if it&#39;s borrowed, give it back.   That&#39;s a lot of stress over a playpen. &lt;g&gt;<br/>\n<br/>\nLike some of the other moms here, I had my baby with me, in a sling or back pack, on my hip, sitting in the tub or in the kitchen sink or at my feet, if he wanted down.     <br/>\n<br/>\nIf you&#39;re not wanting to give up the idea of the playpen for the baby, then have the three year old with you.<br/>\n<br/>\nIf the problem is that your attention is focused elsewhere, remember lot&#39;s of things can wait for you to get to them.  The bulk of my housework was (and still is) done when my kid&#39;s asleep.  You can get stuff done much faster if you&#39;re not trying to entertain children at the same time, you can do a lot of thinking while your body is on repetitive task autopilot&lt;g&gt; and when your kids are up you can spend all your time with them, focused on them, and not be thinking of how you&#39;ll get to the dishes or whatever.   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What to do when older sibling acts unsafely with younger sibling","postDate":"1258721539","msgId":42117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMDY5MTAzLjUwNDA5MDdAeWFob28uY2E+"},"prevInTopic":0,"nextInTopic":42119,"prevInTime":42116,"nextInTime":42118,"topicId":42117,"numMessagesInTopic":0,"msgSnippet":"Great thoughts.  I do all of your suggestions already, the playpen is a very small portion of our life, and on rethinking about why/when I use it, I think its","messageBody":"<div id=\"ygrps-yiv-641126303\">Great thoughts.  I do all of your suggestions already, the playpen is a <br/>\nvery small portion of our life, and on rethinking about why/when I use <br/>\nit, I think its those moments when I&#39;m really tired, and in my mind I <br/>\nthought that I could put him in it to play, the 3YO could play somewhere <br/>\nelse and I could have a moment to myself... but I think thats not <br/>\nrealistic,  you are right.  I already bring the kids with me wherever I <br/>\ngo in the house, whatever I&#39;m doing.  I use carriers, I let them crawl <br/>\naround, play together, etc.  We sit and read on the couch while the baby <br/>\nexplores the floor, etc.  I think its my expectation of being able to <br/>\n&#39;separate&#39; them in a safe way for a few minutes for me to sit that I <br/>\nneed to change.  The playpen is actually useful, we live in a walk-up <br/>\napartment, and my 3YO won&#39;t come up alone, and I can&#39;t carry them both <br/>\nup at once, and our bags too.  So I usually carry him up, leave him in <br/>\nthe playpen (so he won&#39;t crawl out the door and fall down the stairs), <br/>\nand then fetch her.  So, it is useful to have a safe place to put him in <br/>\nsome situations.  I realized after I started reading that I definitely <br/>\ndon&#39;t use it when I&#39;m trying to &#39;get stuff done&#39; and I don&#39;t know why I <br/>\nwrote that.</div>","specialLinks":[]}],"prevTopicId":42108,"nextTopicId":42125}}