{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":238795563,"authorName":"Lisa Blocker","from":"Lisa Blocker &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Looking for Advice","postDate":"1173064769","msgId":21883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4Nzc3OC44MTIzMy5xbUB3ZWIzNTkwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":21882,"nextInTime":21884,"topicId":21883,"numMessagesInTopic":0,"msgSnippet":"I am so glad that someone brought this up!!!   We just spent 5 days on vacation skiing in West Virginia with our 4 children.   My two oldest girls ages 16 and","messageBody":"<div id=\"ygrps-yiv-1214639084\">I am so glad that someone brought this up!!!   We just spent 5 days on vacation skiing in West Virginia with our 4 children.   My two oldest girls ages 16 and 13 took to skiing naturally as though they had skied their entire lives although only the older one had been and it&#39;s been a long time!  They have both been tubing so perhaps they had some sense of how snow behaves or knowledge of physics helped them .. who knows but they had a ball.   My youngest, a boy age 5, strapped on skis, buckled his helmet, shouted YAHOOOOOO and zoomed off down the mountain!   He was even good natured about it when he skied off the side and was hanging upside down by one ski when he skied through the retaining fence!!!    I would have taken pictures but I was afraid of his grandmother&#39;s reaction! HA!   At any rate my 11 yr old daughter who has special needs(genetic syndrome and autism) was NOT so sure about the whole process.    We asked her to try it ... she was in tears a few times saying<br/>\n she didn&#39;t like skiing and only wanted to go tubing.    I asked her to give it a try and that I would sit with her taking breaks as much as she needed or wanted but I wanted her to give it a try because I thought skiing was fun and wanted her to be able to really decide what she thought for herself.     I reminded her of other things she had tried to do and that had taken her a long time to learn to do (she spent the past year learning to do a forward tumble and handstand for her special needs cheerleading team routine).   She agreed to try and by the end of the first day she skied by herself  halfway down one of the beginner slopes!!!   The rest of the time she was content to ski between Dad&#39;s skis and get to go on most of the beginner slopes with his help.     I kept wondering what I would have done if she just flatly refused to try... I wondered if I could really be ok with her not wanting to try or wanting to quit before even trying.    I want to think I could be ok<br/>\n with that.   I kept having flashbacks of our recent trips to Disney World and my skin crawling every time I heard some parent shriek at their kid &quot;I spent ALL THIS MONEY you better quit crying and HAVE FUN NOW!!&quot;  while they were dragging said kid who appeared to be all of 2 yrs old and they just wanted to watch the parade in between the two scheduled character meals and 3 shows and 2 other special extra adventures.    I have really learned to be less bothered by plans going off kilter since having a child with special needs but there are definitely times when I wish life was simpler!    I have spent the past few days telling myself I would have just gone with the flow if she sat down and refused to try the whole skiing thing (I mean really when you think of it who was using better judgment ?  Mom who was asking a kid to strap two flat sticks to her feet and go hurtling down a mountain or the kid who thought it was a bit scary?)   I will have to say there is never a dull<br/>\n moment juggling all the different needs that arise from 4 children who may have come from the same gene pool but are as different as beings from 4 different planets!<br/>\nLisa  Blocker <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nThe fish are biting. <br/>\nGet more visitors on your site using Yahoo! Search Marketing.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://searchmarketing.yahoo.com/arp/sponsoredsearch_v2.php\">http://searchmarketing.yahoo.com/arp/sponsoredsearch_v2.php</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21862,"nextTopicId":21844}}