{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":32,"messages":[{"userId":274177100,"authorName":"Vicki","from":"&quot;Vicki&quot; &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Public School","postDate":"1192144883","msgId":27034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlbWI1ais2ZXVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlbGVwMys3OGNtQGVHcm91cHMuY29tPg=="},"prevInTopic":27031,"nextInTopic":27038,"prevInTime":27033,"nextInTime":27035,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"Hi Genevieve, I m coming at this from the other end, meaning that my daughter is 17 and never (un)homeschooled.  (I currently unschool my ds 9) When I divorced","messageBody":"<div id=\"ygrps-yiv-1567278917\">Hi Genevieve,<br/>\n<br/>\nI&#39;m coming at this from the other end, meaning that my daughter is 17 <br/>\nand never (un)homeschooled.  (I currently unschool my ds 9)<br/>\n<br/>\nWhen I divorced her dad, I had to use daycare.  Thank God I found a <br/>\ngood one.  Then she did public Kindergarten, private first through <br/>\nfifth, then gifted 6th- IB, AP high school only to &#39;drop-out&#39; in <br/>\n11th, when her two best friends were killed this last spring.  She <br/>\nhas since taken her GED (scoring 100%) and SAT (scoring again very <br/>\nhigh). <br/>\n<br/>\nShe is currently waiting to enroll in the Fire Academy a total switch <br/>\nfrom her original goal of a lingustics major studying in Germany.<br/>\n<br/>\nLife happens.  <br/>\n<br/>\nThis same daughter has a manic depressive father who made our lives <br/>\nliving hell.  In Kindergarten she learned to ask who was picking her <br/>\nup.  If I said your father, she would double over and claim she was <br/>\ntoo sick for school. (Her father refused to watch a sick child.)  <br/>\n<br/>\nI never made her go if she didn&#39;t want to.  I never made her do <br/>\nschool work if she didn&#39;t want to.  She was always over the alloted <br/>\nmissed days by October until 8th grade when she decided on her own, <br/>\nthe classes were too hard to miss class and keep up.  <br/>\n<br/>\nThis daughter of mine makes me proud to call her mine.  <br/>\n<br/>\nAs for my son, we started out in public Kindergarten ~ then <br/>\nhomeschooled the rest of that year.  We put him in gifted 1st.<br/>\nthat lasted 15 days.  We tried private.  That lasted till Nov of 2nd <br/>\ngrade.  Then I tried &#39;school at home&#39; which totally sucked.<br/>\n<br/>\nNow he unschools and is extremely happy.  I have told him anytime he <br/>\nwishes to try school again, he can.  And I&#39;ll pull him right back out <br/>\nif he changes his mind.  So far, he has NO desire to ever return and <br/>\nthat&#39;s just fine with me.<br/>\n<br/>\nVicki</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Public School","postDate":"1192133012","msgId":27031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QzZEOEYyLTM4RjctNEZDOS04QzhDLTMwRUI1MzU5OUYzMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGZlbGVwMys3OGNtQGVHcm91cHMuY29tPg==","referencesHeader":"PGZlbGVwMys3OGNtQGVHcm91cHMuY29tPg=="},"prevInTopic":27030,"nextInTopic":27034,"prevInTime":27030,"nextInTime":27032,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... Quick answer, Sandra Dodd wrote an essay about schooling by choice: http://sandradodd.com/schoolchoice Joyce [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-607397641\">On Oct 11, 2007, at 11:16 AM, Genevieve wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am wondering how to deal with the issues of homework and<br/>\n&gt; attendance.<br/>\n<br/>\n </span></blockquote>Quick answer, Sandra Dodd wrote an essay about schooling by choice:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":27314618,"authorName":"Genevieve","from":"&quot;Genevieve&quot; &lt;katgrl705@...&gt;","profile":"katgrl705","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Public School","postDate":"1192115811","msgId":27030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlbGVwMys3OGNtQGVHcm91cHMuY29tPg=="},"prevInTopic":25863,"nextInTopic":27031,"prevInTime":27029,"nextInTime":27031,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"My 11yo Daughter decided that this year she would like to try public school. So far she s loving it, but I need some help, lol. Besides missing her (which","messageBody":"<div id=\"ygrps-yiv-418635089\">My 11yo Daughter decided that this year she would like to try public <br/>\nschool. So far she&#39;s loving it, but I need some help, lol. Besides <br/>\nmissing her (which every mom has to deal with I think if your baby is <br/>\naway) I am wondering how to deal with the issues of homework and <br/>\nattendance. SO far she doesn&#39;t have much homework with this school <br/>\nand I haven&#39;t even had to remind her about it. There was one math <br/>\nassignment which she had to do about 30 problems of the same type and <br/>\nwe both agreed it seemed redundant and I told her if she wanted to I <br/>\nwould tell the teacher I didn&#39;t see the point in it if she already <br/>\nhad the concept down, but she opted to do it anyway. I&#39;m wondering <br/>\nwhat I am going to do if she comes home with some assignment that she <br/>\nreally doesn&#39;t want to do, do I just let her not turn it in and get a <br/>\n0? My husband wouldn&#39;t agree to that :/<br/>\n  My other question is how do I handle the days when she&#39;s just too <br/>\ntired to go to school. Really it&#39;s how do I handle the system, not my <br/>\ndaughter who is wonderful. I don&#39;t see forcing her to go, but they do <br/>\nhave a maximum number of days she can miss. Neither of us are morning <br/>\npeople and there have been a couple days where she just didn&#39;t want <br/>\nto get up, so I called her in sick. Today my husband didn&#39;t get her <br/>\nto the bus on time and she&#39;s home. We only have one car right now or <br/>\nI would have taken her, she&#39;s missing a pep rally which apparently <br/>\nshe loves. I just want to keep the unschooling ethic with her as much <br/>\nas possible, and who knows maybe next year she&#39;ll decide to stay home <br/>\nagain. Any advice would be greatly appreciated.<br/>\n-Genevieve<br/>\nmom to Bethany(11), Valerie (3), Aiden (2), and Odin (6mos)</div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Public School","postDate":"1187447277","msgId":25863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhNnZsZCtnNmR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyRTM0QkMzLUIyM0QtNDlBNi1CRTM5LTQ5MEQ4NUQwOUI3QkBjaG9vc2Vvcmdhbmljcy5jb20+"},"prevInTopic":25862,"nextInTopic":27030,"prevInTime":25862,"nextInTime":25864,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... We had a funny experience regarding this recently... my dad was raised in the 40 s and 50 s in the time of being seen and not heard.. had a very strict","messageBody":"<div id=\"ygrps-yiv-775217585\">Arun wrote: <br/>\n<blockquote><span title=\"ireply\"> &gt; Its not what you were raising directly but this aspect of the thread  <br/>\n&gt; reminds me of the argument that children have to learn to accept the  <br/>\n&gt; way things are and know how to work within a system in learning to be  <br/>\n&gt; responsible  etc.. While I agree that we do have to understand and  <br/>\n&gt; work within the system at times, I hope that our unschooling approach  <br/>\n&gt; is assisting our children to develop creative and lateral solution  <br/>\n&gt; seeking perspectives that will sometimes take them outside the box.<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>We had a funny experience regarding this recently... my dad was raised<br/>\nin the 40&#39;s and 50&#39;s in the time of being seen and not heard.. had a<br/>\nvery strict father who really ruled with an iron fist etc... that said<br/>\nhe has always been the type to really listen to us when we were kids<br/>\nbecause he never felt like his side was heard.  As a child he felt<br/>\nthat by being a child he was automatically at fault and could not be<br/>\nright.      He used to tell me when my kids were little that I needed<br/>\nto be firmer with them, that if I didn&#39;t tighten up on them they would<br/>\nrun me over.   Over time he&#39;s seen that the freedom I give them works<br/>\nto make them kids who have no desire to run over anyone because they<br/>\nare treated fairly and gently.    <br/>\n<br/>\nRecently we were visiting and my father said he wanted to take the<br/>\nboats out but since my brother&#39;s boat was broken there wasn&#39;t room for<br/>\neveryone to go in just one boat.  He wanted to be fair and not leave<br/>\nanyone out so he was trying to figure out how to do it.   My 6 yr old<br/>\nwalks over pats him and says &quot;it&#39;s ok grand daddy I will help you<br/>\nfigure it out&quot;  then he proceeded to brainstorm ideas for how it would<br/>\nwork... take all the little kids first, take the teens that wanted to<br/>\nski next, go out again with anyone else that didn&#39;t get to go or<br/>\nwanted to go again.   My Dad was really impressed and commented on how<br/>\nthoughtful he thought it was that Jack really cared about him getting<br/>\nto do what he wanted to do and how mature he thought it was that he<br/>\nwas able to give possible solutions to make it happen.  Then my dad<br/>\nsaid &quot;you know it really makes you feel like you matter when someone<br/>\ngoes to the trouble to help you get what you want or need even if it&#39;s<br/>\nalot of work&quot;.    I think that is my goal... I want my kids to know<br/>\nthey matter within my family, their community and their world.  <br/>\nLisa Blocker</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Public School","postDate":"1187442382","msgId":25862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhNnFzZStnMm1yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNDYwMWM3ZTE3YSQ2Zjc4OGVhMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":25861,"nextInTopic":25863,"prevInTime":25861,"nextInTime":25863,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"~~ It seems to me that the lesson that was being taught was not to do something that his parents begged him not to. Or don t try anything new unless you are","messageBody":"<div id=\"ygrps-yiv-1691015135\">~~ It seems to me that the lesson that was being taught was not to do<br/>\nsomething that his parents begged him not to. Or don&#39;t try anything<br/>\nnew unless you are willing to do it for whatever the contract period<br/>\nis.~~ <br/>\n<br/>\n<br/>\nMy always unschooled nephew starts High School on Monday.  I&#39;m not<br/>\nsure how all of this will go for him, but I think the school got more<br/>\nthan they bargained for in my sister.;)<br/>\n<br/>\nSo far, everything the school has required of them has been<br/>\nquestioned. Her friends sitting outside the door as she went through<br/>\nthe registration process were laughing hysterically because all they<br/>\ncould hear is my sister saying &quot;WHAT? Why do you need THAT? You have<br/>\ngot to be KIDDING me!!&quot; over and over.<br/>\n<br/>\nThey claimed to require the names and ages of all the other children<br/>\nin the house. She knows the law and told them &quot;no thanks, you don&#39;t<br/>\nneed that.&quot;  They claimed that Kevin would need to have his vax up to<br/>\ndate. Uh-uh....they went to a doc that is supportive of non-vax and<br/>\ngot a form filled out. The school counselor said something about &quot;Well<br/>\nTHIS is going to be a big shock for him&quot;<br/>\n&quot;And why is that?&quot; my sister asks.<br/>\n&quot;Well grades and tests and all, he&#39;s never had that before.&quot;<br/>\n&quot;Why would that be a shock when we don&#39;t place any emphasis on grades<br/>\nor tests?&quot;<br/>\nNo answer to that.<br/>\n<br/>\nThe point is....Kevin knows his family is on his side. He OWNS this<br/>\nschool experience and there is ZERO shame in changing his mind.<br/>\n<br/>\nI was thinking about what school would have been like without the<br/>\ngrade and test pressure. I think I actually would have enjoyed a lot<br/>\nof it. Not only does Kevin have no grade or test pressure, but no<br/>\nexpectations about how long he attends or how he utilizes this<br/>\nlearning experience. That makes a big difference.<br/>\n<br/>\nHe&#39;s already scratching his head at some of the arbitrary rule stuff.<br/>\nHe sees right through it. Wish I could have at that age. School isn&#39;t<br/>\ngoing to be soul-crushing for him. What a great thing to have parents<br/>\nthat support your choices 100%.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187429433","msgId":25861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDYwMWM3ZTE3YSQ2Zjc4OGVhMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGZhM3E2YytpMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":25860,"nextInTopic":25862,"prevInTime":25860,"nextInTime":25862,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... It seems to me that the lesson that was being taught was not to do something that his parents begged him not to. Or don t try anything new unless you are ","messageBody":"<div id=\"ygrps-yiv-770230337\"><blockquote><span title=\"ireply\">&gt; I might say that in the case of a very young child. But this was an<br/>\n&gt; older child(7th grade)and he was made well aware of the what would<br/>\n&gt; happen. I don&#39;t think it was a punishment so much as a lesson in<br/>\n&gt; taking responsibility for one&#39;s actions.<br/>\n<br/>\n </span></blockquote>It seems to me that the lesson that was being taught was not to do something <br/>\nthat his parents begged him not to. Or don&#39;t try anything new unless you are <br/>\nwilling to do it for whatever the contract period is. Or that his parents <br/>\naren&#39;t willing to let him gently and comfortably explore the world and to <br/>\nhelp him do it slowly and in his own time.<br/>\n<br/>\nI think it is a pretty normal for parents to say &quot;You made your bed, now lie <br/>\nin it.&quot; Y&#39;know, it&#39;ll teach &#39;em that when they make a commitment to do <br/>\nsomething they should follow through. I don&#39;t think it helps, though. I had <br/>\nthat lesson given to me repeatedly throughout my childhood. I had many terms <br/>\nof lessons and classes that I&#39;d made a &quot;commitment to&quot; so I had to finish at <br/>\nleast that term before being allowed to quit. I don&#39;t really know that I <br/>\never asked to quit, either. I knew that I was in for the long haul. I would <br/>\nonly ask not to be re-enrolled in the next session. The funny thing is that <br/>\nI have a real sense that I&#39;m a quitter. That I can&#39;t follow anything <br/>\nthrough. I think if I&#39;d been allowed to drop in and out of different <br/>\nexperiences, different classes until I&#39;d found the kind of extracurricular <br/>\nactivity that appealled I would have understood the dabbling nature that I <br/>\nhave more than having to finish anything that I signed up to do ever helped <br/>\nme to do.<br/>\n<br/>\nThere is a recent paper/study out by a social psychologist, Dr. Brooke <br/>\nFeeney, that argues that adults in emotionally supportive relationships are <br/>\nmore confident and capable than adults in relationships that aren&#39;t <br/>\nnurturing. It is the complete opposite of what this boy&#39;s parents were <br/>\narguing. A review of the paper is here: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.postgazette.com/pg/07155/791406-51.stm\">http://www.postgazette.com/pg/07155/791406-51.stm</a> (hopefully I&#39;ll be able to <br/>\nget my hands on the paper sometime soon). The interesting finding is summed <br/>\nup in this quote:<br/>\n<br/>\n<br/>\n&quot;With both groups, Dr. Feeney interviewed the couples to see how well they <br/>\nfelt one partner met the other&#39;s needs in times of distress, and then <br/>\nvideotaped them interacting with each other. They were also interviewed <br/>\nabout the independence and confidence of the person seeking help.<br/>\n&quot;A clear pattern emerged. Those whose partners were best at responding to <br/>\ntheir emotional needs also felt the most confident and capable of achieving <br/>\ntheir own goals.&quot;<br/>\n<br/>\n---<br/>\n<br/>\nIt seems intuitive, really. That being emotionally supportive of your <br/>\npartner helps them to feel strong and independent. But it is something that <br/>\nparents seem to forget, or intuitively detach from. The idea that a child <br/>\nshould be forced to sit through something, should be made to suffer in order <br/>\nto learn a lesson (and really, what is the lesson they are going to learn?) <br/>\nseems to prevail while the more intuitive, supportive approach loses out.<br/>\n<br/>\nI would argue that your friends damaged their relationship with their son by <br/>\nfirst arguing that he couldn&#39;t possibly know that wanting to go to school <br/>\nwas what he wanted to do and then by telling him that he didn&#39;t have any <br/>\nother options but to stick with the obviously wrong-headed choice he made. I <br/>\nwouldn&#39;t trust David (my husband) if he did something to me like that, nor <br/>\nwould I expect him to trust me if I made him stick it out. Given that, why <br/>\nwould I ever think that doing that to my son Simon or daughter Linnaea would <br/>\nhelp them to feel nurtured and safe.<br/>\n<br/>\nSchuyler<br/>\n<br/>\nwww.waynforth.blogspot.com</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187417006","msgId":25860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUFGNzRBMDcwQzk4Qy01MDQtNUQ0RkBXRUJNQUlMLU1CMDcuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGZhMGIzaCs3cXY1QGVHcm91cHMuY29tPg=="},"prevInTopic":25854,"nextInTopic":25861,"prevInTime":25859,"nextInTime":25861,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... From: castlecarver  One of my friend s sons decided that he wanted to go to public school. Her only requirement was that if he","messageBody":"<div id=\"ygrps-yiv-1369453866\">-----Original Message-----<br/>\nFrom: castlecarver &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:artist@...\">artist@...</a>&gt;<br/>\n<br/>\nOne of my friend&#39;s sons decided that he wanted to go to public school.<br/>\nHer only requirement was that if he started a school year at the<br/>\npublic school, he must finish the entire year. He did... But he is<br/>\nback home now and does not want to return.<br/>\n<br/>\n-=-=-<br/>\n<br/>\nMy question is, &quot;What does the mother think he learned?&quot;<br/>\n<br/>\nNot that you need to answer this! &lt;G&gt; Just throwing it out there!<br/>\n<br/>\nVery often a child does not learn the &quot;lesson&quot; we think he ought <br/>\nto/should. I&#39;m sure she felt he&#39;d learn responsibility and commitment.<br/>\n<br/>\nIn reality, he learned that he couldn&#39;t trust his parents to help him <br/>\nout of an uncomforatble situation.<br/>\n<br/>\nHe learned that trying something new---no matter how inviting ot <br/>\nattractive---might just not be worth the effort. What if you find you <br/>\ndon&#39;t like it? *MUST* you always finish what you start? If so, why <br/>\nstart anything? It might end up being horrible, and there you are STUCK <br/>\nwith no way out. Better to not try at all.<br/>\n<br/>\nIt&#39;s a *very* huge gift we give when we allow our children to try many <br/>\nnew things without the long commitment attached. Enduring is not the <br/>\nsame as enjoying. When enjoyment switches to endurance---it&#39;s time to <br/>\nfind a better use of our time!<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics]Public School","postDate":"1187408180","msgId":25854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5OTI0NS4yNTg1LnFtQHdlYjU5MjAyLm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":25851,"nextInTopic":25860,"prevInTime":25853,"nextInTime":25855,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"* While I agree that we do have to understand and work within the system at times, I hope that our unschooling approach is assisting our children to develop","messageBody":"<div id=\"ygrps-yiv-117793578\">* While I agree that we do have to understand and  <br/>\nwork within the system at times, I hope that our unschooling approach  <br/>\nis assisting our children to develop creative and lateral solution  <br/>\nseeking perspectives that will sometimes take them outside the box.*<br/>\n<br/>\n   I just love this attitude, and I am trying to help explore this with my kids daily.  What is another option or viewpoint?  What are the other possibilities? You must believe in them to see them! I tell my kids that there are a few absolutely unavoidable facts or rules in life, but there are lots more that are unneeded, false, pointless. One of the most creative opportunities in life is to seek these areas and go beyond them.<br/>\n    I think that this also overlaps with a post I read by Joyce Fetteroll. In it she was perceptively admitting that if one of her kids decided to believe in creation instead of evolution, she&#39;d be upset. Yet she knew that really that wasn&#39;t the answer, posing the great question &quot;What would we hope the response would be to a child of a creationist who decided to believe in evolution?&quot;  Now actually I don&#39;t mean that finding creative solutions to problems overlaps with the creationist/evolutionist debate. But this devisive debate actually is an example of a highly divisive conflict that I see as pointless. We can easily believe a third thing (or a fourth thing) such as, maybe once things are created then they evolve. Or maybe evolution is a creative process.  The examples aren&#39;t the point, but rather the notion of finding another view.  <br/>\n    Public school in my experince specializes in squelching peoples&#39; hopes that there is another way, that life is full of possibilities.  It never ceases to amaze me how most folks deny that!</div>","specialLinks":[]},{"userId":279529800,"authorName":":: anne | arun ::","from":"&quot;:: anne | arun ::&quot; &lt;life@...&gt;","profile":"arunaway72","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Public School","postDate":"1187399238","msgId":25851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRTM0QkMzLUIyM0QtNDlBNi1CRTM5LTQ5MEQ4NUQwOUI3QkBjaG9vc2Vvcmdhbmljcy5jb20+"},"prevInTopic":25850,"nextInTopic":25854,"prevInTime":25850,"nextInTime":25852,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"I have not kept up with all of the posts to this thread but this caught my attention... ... ======== I was in a similar situation a few years ago. In contrast","messageBody":"<div id=\"ygrps-yiv-1361921439\">I have not kept up with all of the posts to this thread but this  <br/>\ncaught my attention...<br/>\n<br/>\n========<br/>\n<blockquote><span title=\"ireply\"> &gt; Here is a turn on your analogy.<br/>\n&gt; I signed a contract to work for a year on a new job. Then found I  <br/>\n&gt; didn&#39;t like<br/>\n&gt; the job. Yet I still honored the contract. You see, I made an  <br/>\n&gt; informed decision<br/>\n&gt; in taking the job in the first place and I understood the contract  <br/>\n&gt; in advance. I<br/>\n&gt; stayed for one year exactly because I made the choice to be there.  <br/>\n&gt; And I made<br/>\n&gt; the agreement to work for that amount of time regardless of how  <br/>\n&gt; much I disliked<br/>\n&gt; it.<br/>\n </span></blockquote>========<br/>\n<br/>\nI was in a similar situation a few years ago. In contrast to your  <br/>\nexperience I broke my contract and kept my boss happy by finding a  <br/>\nwilling and probably more capable replacement for myself (he was a  <br/>\nfriend of mine who then always would talk about how he &quot;owed me&quot; for  <br/>\nlanding them such &quot;a good job&quot;).<br/>\n<br/>\nIts not what you were raising directly but this aspect of the thread  <br/>\nreminds me of the argument that children have to learn to accept the  <br/>\nway things are and know how to work within a system in learning to be  <br/>\nresponsible  etc.. While I agree that we do have to understand and  <br/>\nwork within the system at times, I hope that our unschooling approach  <br/>\nis assisting our children to develop creative and lateral solution  <br/>\nseeking perspectives that will sometimes take them outside the box.<br/>\n<br/>\nIn the instance I mentioned about my job � If I had to and could find  <br/>\nno options, yes I would have made the most of the situation and  <br/>\nstayed in my job... but ive found that it is difficult to see open  <br/>\ndoors unless you are open to the possibility of them existing and try  <br/>\nto seek them out.<br/>\n<br/>\nI hope my children do not accept things unnecessarily. I hope that I  <br/>\nam helping them to become creative in exploring/ experimenting in  <br/>\ndiscovering who they are and what they want. And I hope that I can be  <br/>\nas &quot;unreasonable, determined and creative&quot; at times in my own life...  <br/>\nas that is where much of the interesting stuff and major change tends  <br/>\nto happen.<br/>\n<br/>\narun<br/>\n<br/>\n_____________________________________________<br/>\n<br/>\n| anne + arun |<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theparentingpit.com\">http://www.theparentingpit.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187372367","msgId":25850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1MzcwLjk2MjI3LnFtQHdlYjUzODA2Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGZhNGJuMytobGlsQGVHcm91cHMuY29tPg=="},"prevInTopic":25849,"nextInTopic":25851,"prevInTime":25849,"nextInTime":25851,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"My oldest child is looking to move out of the house this fall. He s never held a job long-term (worked for his Dad a few months and volunteered with a friend","messageBody":"<div id=\"ygrps-yiv-671426271\">My oldest child is looking to move out of the house this fall. He&#39;s<br/>\nnever held a job long-term (worked for his Dad a few months and<br/>\nvolunteered with a friend for a while), he doesn&#39;t have his drivers<br/>\npermit yet. I could be a negative force in his decision. I don&#39;t think<br/>\nthat will do anything but put a wedge between us. He knows we support<br/>\nhim 100% and will do everything in our power to help him figure this out.<br/>\n   <br/>\n  *****<br/>\n<br/>\n  How exciting!  Will left home at 18, going to North Carolina to work for my brother -- his first full-time job, no driver&#39;s license.  He stayed just over two years, came back home for about 9 months, and is back in his own place since last April.  He still has no driver&#39;s license, tho he did get one (and a car) during his time in NC.  The expense of a car and insurance, maintenance and upkeep, as well as his philosophy about the pollution and *green* factors, and his desire to live alone (paying for a car would require roommates) make car ownership undesirable for him.  He found an apartment on a city bus line, within walking distance of his job, once a week I pick him up when I&#39;m in town anyway so he can come here to do laundry and check the internet (a puter isn&#39;t really in his budge right now, either).  So, it is possible to move away from home without a car or full-time job experience, if it&#39;s really the right step.<br/>\n   <br/>\n  Of course, it&#39;s downright surreal to have that little boy grow into a *man* with his own place and life outside the family.  A whole new season for Mom & Dad, too!<br/>\n   <br/>\n  Sylvia <br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nSick sense of humor? Visit Yahoo! TV&#39;s Comedy with an Edge to see what&#39;s on, when. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187366427","msgId":25849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1Ni4xYTBjYzY0Ny4zM2Y3MjAxYkBhb2wuY29tPg=="},"prevInTopic":25848,"nextInTopic":25850,"prevInTime":25848,"nextInTime":25850,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/17/2007 2:36:53 A.M. Pacific Daylight Time, artist@greycastle.us writes: That  child most certainly did have a choice. His parents tried","messageBody":"<div id=\"ygrps-yiv-1437385606\">In a message dated 8/17/2007 2:36:53 A.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:artist@...\">artist@...</a> writes:<br/>\n<br/>\nThat  child most certainly did have a choice. His parents tried for<br/>\nweeks to  persuade him to stay home. But they made that particular<br/>\nagreement with him  because taking a child out of the public system in<br/>\nthe middle of the school  year in this state is something akin to<br/>\nextracting teeth... and he  understood that. He did exactly what I<br/>\nwould have done having made that  agreement. He honored his contract.<br/>\nHe never said a word all year about not  liking public school. But at<br/>\nthe end of the year he asked to be home  schooled again. <br/>\n<br/>\n<br/>\n<br/>\nThat doesn&#39;t sound like choice to me, personally. It sounds like, to my  <br/>\nears, &quot;See? Told you public school was terrible. Now you have to finish this  year <br/>\nno matter what, Mister!&quot; I understand that may not be the way it really  was, <br/>\nbut via emails, that&#39;s the impression (possibly wrongly!) am picking up. A  <br/>\nwhole year of something that is so disliked...well, I just don&#39;t see it as the  <br/>\nsame for an 11 year old young-young adult vs an adult with financial  <br/>\nresponsibilities. 11 is a great time to try new things and make changes because  it&#39;s <br/>\na sampling time of life. I don&#39;t know...I guess it really makes very little  <br/>\ndifference at this point, and it&#39;s just talk now anyway. I was just thinking  <br/>\nabout on the opposite, kinda, side of things, my daughter Grace wanting to  <br/>\ncontinue public school, and my wanting her to do unschooling. I told her that  <br/>\nshe is free to decide what she wants to do, with or without my help, and that  <br/>\nany time during the year, we can make needed changes if that should arise. And <br/>\n vice versa - back IN to public school if she leaves and wants to return. <br/>\n <br/>\nIt&#39;s a good discussion for me to read about though. I always get stuff to  <br/>\nthink about from especially those that do things differently from the way I  <br/>\nthink I would. <br/>\n <br/>\nKaren <br/>\n<br/>\n<br/>\n<br/>\n************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187361660","msgId":25848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODE3MTQ0MS5sN0hFZjZMdzAyMDMxNEBvbXIxMS5uZXR3b3Jrc29sdXRpb25zZW1haWwuY29tPg==","inReplyToHeader":"PGZhNGJuMytobGlsQGVHcm91cHMuY29tPg==","referencesHeader":"PDE4Mzg2NS44NjA1OC5xbUB3ZWI1MzgxMC5tYWlsLnJlMi55YWhvby5jb20+IDxmYTRibjMraGxpbEBlR3JvdXBzLmNvbT4="},"prevInTopic":25847,"nextInTopic":25849,"prevInTime":25847,"nextInTime":25849,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... (((((((((((Ren))))))))))) Love, Marji [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-278376806\">At 10:35 8/17/2007, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My oldest child is looking to move out of the house this fall. He&#39;s<br/>\n&gt;never held a job long-term (worked for his Dad a few months and<br/>\n&gt;volunteered with a friend for a while), he doesn&#39;t have his drivers<br/>\n&gt;permit yet. I could be a negative force in his decision. I don&#39;t think<br/>\n&gt;  that will do anything but put a wedge between us. He knows we support<br/>\n&gt;him 100% and will do everything in our power to help him figure this out.<br/>\n<br/>\n </span></blockquote>(((((((((((Ren)))))))))))<br/>\n<br/>\nLove,<br/>\nMarji<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Public School","postDate":"1187361315","msgId":25847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhNGJuMytobGlsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4Mzg2NS44NjA1OC5xbUB3ZWI1MzgxMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":25846,"nextInTopic":25848,"prevInTime":25846,"nextInTime":25848,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"~~I might say that in the case of a very young child. But this was an older child(7th grade)and he was made well aware of the what would happen. I don t think","messageBody":"<div id=\"ygrps-yiv-1921403100\">~~I might say that in the case of a very young child. But this was an<br/>\nolder child(7th grade)and he was made well aware of the what would<br/>\nhappen. I don&#39;t think it was a punishment so much as a lesson in<br/>\ntaking responsibility for one&#39;s actions. ~~<br/>\n<br/>\n<br/>\nSo if my dh makes me &quot;well aware&quot; of what can happen, then he has the<br/>\nright to force me to do something I don&#39;t want to do? Children are the<br/>\nonly members of society that are made to put up with such behavior.<br/>\nIt&#39;s wrong.<br/>\n<br/>\nHow can a person take responsibility for their own actions when<br/>\nsomeone else is forcing them to do something?  That isn&#39;t personal<br/>\nresponsibility at all! How can a child feel safe in coming to a parent<br/>\nwith stress or unhappiness if the parent made it very clear there<br/>\nwould be no help in solving the problem?<br/>\n<br/>\nI would not lay that heavy burden on my child. I want them to know I<br/>\nsupport THEIR decisions and will be there for them no matter what. I<br/>\ndon&#39;t want them to be afraid to discuss issues with me due to<br/>\njudgement about the choice.<br/>\n<br/>\nI wouldn&#39;t try to talk my child out of going to school either. I would<br/>\nlay out all the information, help them research all ends of it and<br/>\ntrust their choice.<br/>\n<br/>\nMy oldest child is looking to move out of the house this fall. He&#39;s<br/>\nnever held a job long-term (worked for his Dad a few months and<br/>\nvolunteered with a friend for a while), he doesn&#39;t have his drivers<br/>\npermit yet. I could be a negative force in his decision. I don&#39;t think<br/>\n that will do anything but put a wedge between us. He knows we support<br/>\nhim 100% and will do everything in our power to help him figure this out.<br/>\n<br/>\nHe&#39;s already decided to purchase a bike and not drive for now. I<br/>\nreally had the idea that he would be home for a few more years...it&#39;s<br/>\nnot easy to let go. I also know that he may change his mind, we will<br/>\nsupport that 100% too. He knows we are on his side. He knows we trust<br/>\nhis choices and won&#39;t berate him for those choices regardless of the<br/>\noutcome. I think that is vital to trust and in unschooling, trust is<br/>\neverything.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187361233","msgId":25846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODE3MTQzNC5sN0hFWTB3YTAwNDAxN0BvbXIzLm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+","inReplyToHeader":"PDE4Mzg2NS44NjA1OC5xbUB3ZWI1MzgxMC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGZhM3E2YytpMXZ1QGVHcm91cHMuY29tPiA8MTgzODY1Ljg2MDU4LnFtQHdlYjUzODEwLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":25845,"nextInTopic":25847,"prevInTime":25845,"nextInTime":25847,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... But at what cost?  I certainly can t know for sure, but from what you re saying, if Mom and Dad really made it sound like helping him come back home was","messageBody":"<div id=\"ygrps-yiv-1894767264\">At 10:16 8/17/2007, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Of course I am sure if he were truly miserable they would have done <br/>\n&gt;something even so.<br/>\n<br/>\n </span></blockquote>But at what cost?  I certainly can&#39;t know for sure, but from what <br/>\nyou&#39;re saying, if Mom and Dad really made it sound like helping him <br/>\ncome back home was akin to getting their teeth pulled, perhaps it <br/>\nwould have been too costly for him to have to put up with their <br/>\nwhining and moaning about how difficult this was, and &quot;Didn&#39;t we tell <br/>\nyou before that you shouldn&#39;t have gone in the first <br/>\nplace?&quot;**  Sounds like this young child may have had to pick his <br/>\nmisery, the lesser perhaps of two unpalatable choices.  Perhaps he <br/>\nreasoned that sticking it out for the year was a more finite misery <br/>\nthan having to put up with the emotional crap he might have received <br/>\nat the hands of his rescuers.  KWIM?<br/>\n<br/>\n** And, if this is true, what an awful message to receive from your <br/>\nparents.  Essentially:  We know better than you about you.  Don&#39;t <br/>\nexperiment, just ask us and we&#39;ll tell you if it&#39;d be good for you or <br/>\nnot.  Ewww.<br/>\n<br/>\nThe whole thing sounds sad to me, hardly the joy that makes <br/>\nunschooling the magical thing it can be!<br/>\n<br/>\n~Marji<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187360174","msgId":25845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4Mzg2NS44NjA1OC5xbUB3ZWI1MzgxMC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGZhM3E2YytpMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":25844,"nextInTopic":25846,"prevInTime":25844,"nextInTime":25846,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"I might say that in the case of a very young child. But this was an older child(7th grade)and he was made well aware of the what would happen. I don t think it","messageBody":"<div id=\"ygrps-yiv-1506197935\">I might say that in the case of a very young child. But this was an older child(7th grade)and he was made well aware of the what would happen. I don&#39;t think it was a punishment so much as a lesson in taking responsibility for one&#39;s actions. <br/>\n<br/>\n  ****<br/>\n  Recognizing that school wasn&#39;t right for him and asking to come home would be *responsibility* enough in our family.<br/>\n   <br/>\n  ****<br/>\n  <br/>\nHere is a turn on your analogy. <br/>\nI signed a contract to work for a year on a new job. Then found I didn&#39;t like the job. Yet I still honored the contract. You see, I made an informed decision in taking the job in the first place and I understood the contract in advance. I stayed for one year exactly because I made the choice to be there. And I made the agreement to work for that amount of time regardless of how much I disliked it. <br/>\n   <br/>\n  ****<br/>\n  Not really a good analogy, IMO.  When you take a JOB people are counting on you.  When a child goes to school the only one counting on anything is the local school board hoping to get the federal money that filled desk brings on day 40.  <br/>\n   <br/>\n  *****<br/>\n  That child most certainly did have a choice. His parents tried for weeks to persuade him to stay home. But they made that particular agreement with him because taking a child out of the public system in the middle of the school year in this state is something akin to<br/>\nextracting teeth... and he understood that. He did exactly what I would have done having made that agreement. He honored his contract. He never said a word all year about not liking public school. But at the end of the year he asked to be home schooled again. <br/>\n<br/>\n  *****<br/>\n  Sure, he said nothing -- because he already knew no one would care how unhappy he was, no one would offer him any break or any out. Why bother to share your pain when no one cares enough to help you?<br/>\n   <br/>\n  *****<br/>\nOf course I am sure if he were truly miserable they would have done something even so. <br/>\n<br/>\n  *****<br/>\n   <br/>\n  Truly miserable?!  Maybe he was miserable and just never saw any reason to tell his parents.  After all, his year wasn&#39;t up yet, so what difference would his pain make?  <br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nReady for the edge of your seat? Check out tonight&#39;s top picks on Yahoo! TV. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187357109","msgId":25844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MDc0Ny44MDczMy5xbUB3ZWI1NDQxMC5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGZhM3E2YytpMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":25842,"nextInTopic":25845,"prevInTime":25843,"nextInTime":25845,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... Most work contract have a clause that allows either party to break the contract. It can be as simple as a 2 week notice. You need not have stayed. I really","messageBody":"<div id=\"ygrps-yiv-981842151\">--- castlecarver &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:artist@...\">artist@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Here is a turn on your analogy. <br/>\n&gt; I signed a contract to work for a year on a new job.<br/>\n&gt; Then found I<br/>\n&gt; didn&#39;t like the job. Yet I still honored the<br/>\n&gt; contract. You see, I made<br/>\n&gt; an informed decision in taking the job in the first<br/>\n&gt; place and I<br/>\n&gt; understood the contract in advance. I stayed for one<br/>\n&gt; year exactly<br/>\n&gt; because I made the choice to be there. And I made<br/>\n&gt; the agreement to<br/>\n&gt; work for that amount of time regardless of how much<br/>\n&gt; I disliked it. <br/>\n&gt;<br/>\n </span></blockquote>Most work contract have a clause that allows either<br/>\nparty to break the contract. It can be as simple as a<br/>\n2 week notice. You need not have stayed.<br/>\n<br/>\nI really don&#39;t think it&#39;s fair to compare work<br/>\nsituations with school. When I go to work I&#39;m being<br/>\npaid to put up with some of the nonsense. I get to<br/>\ndecided whether to deal with the nonsense or quit.<br/>\nAlso I can see the purpose of my work - it is not<br/>\nmeaningless as school often is. <br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n____________________________________________________________________________________<br/>\nNeed a vacation? Get great deals<br/>\nto amazing places on Yahoo! Travel.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://travel.yahoo.com/\">http://travel.yahoo.com/</a></div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187345712","msgId":25841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBOEFCNDQ3LTlCREEtNDY0Ni1BNzNCLUJENUZENTM2NTEwQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGZhM3E2YytpMXZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGZhM3E2YytpMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":25840,"nextInTopic":25842,"prevInTime":25840,"nextInTime":25842,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... That was your choice though. You *could* have chosen to quit. What if you were upset by the job but *your husband* took away your ability to choose and","messageBody":"<div id=\"ygrps-yiv-181247082\">On Aug 17, 2007, at 5:36 AM, castlecarver wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I signed a contract to work for a year on a new job. Then found I<br/>\n&gt; didn&#39;t like the job. Yet I still honored the contract.<br/>\n<br/>\n </span></blockquote>That was your choice though. You *could* have chosen to quit.<br/>\n<br/>\nWhat if you were upset by the job but *your husband* took away your  <br/>\nability to choose and made you stay the year? Would it feel the same  <br/>\nas choosing to stick it out yourself?<br/>\n<br/>\nThe two situations are treated the same by adults but they aren&#39;t the  <br/>\nsame at all. Forcing someone to go through the motions of a  <br/>\ncommitment isn&#39;t the same as having the freedom to choose to stick  <br/>\nwith something or not.<br/>\n<br/>\nWe don&#39;t teach kids to honor commitments by taking away their ability  <br/>\nto quit. All we do is teach them that it rocks to be the one in  <br/>\npower, to be the one who can make others do what they want them to  <br/>\nand it sucks to be the one without power. They learn to honor  <br/>\ncommitments -- to their own standards! -- by us honoring our  <br/>\ncommitments, especially to them.<br/>\n<br/>\nAnd I don&#39;t believe honoring commitments blindly is a good quality.  <br/>\nAnyone can grit their teeth and put up with something. It&#39;s a much  <br/>\nmore useful skill to learn to assess when something is taking more  <br/>\nfrom us than it&#39;s giving back and weigh that against what impact  <br/>\nwe&#39;re having on others. (I&#39;m betting 99% of the managers would say  <br/>\nthey&#39;d much rather have an employee who wanted the job than one who  <br/>\nis counting the days until the torment is over. While you may have  <br/>\nbeen an uncomplaining employee, you took away the ability of the  <br/>\nmanager to find someone who may have loved the job and given 110%.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That child most certainly did have a choice. His parents tried for<br/>\n&gt; weeks to persuade him to stay home.<br/>\n<br/>\n </span></blockquote>He wanted to try something. He can&#39;t make an *informed* choice unless  <br/>\nhe has experience.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But they made that particular<br/>\n&gt; agreement with him because taking a child out of the public system in<br/>\n&gt; the middle of the school year in this state is something akin to<br/>\n&gt; extracting teeth<br/>\n<br/>\n </span></blockquote>It&#39;s a hugely relationship tearing message to tell a child that his  <br/>\ncomfort is less important than our convenience. If we want a  <br/>\nconvenient life, we shouldn&#39;t choose to have kids!<br/>\n<br/>\nPart of the commitment as mindful unschooling parents is to help our  <br/>\nchildren explore the world. We *will* need to inconvenience ourselves  <br/>\nto make that happen. If we keep turned towards the inconvenience,  <br/>\nwe&#39;ll make ourselves miserable! If we keep turned towards our kids,  <br/>\nthe inconvenience will just be part of what we *choose* to do to help  <br/>\nthem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am sure if he were truly miserable they would have done<br/>\n&gt; something even so.<br/>\n<br/>\n </span></blockquote>Why does someone need to be *truly* miserable in order for someone to  <br/>\nlisten to them?<br/>\n<br/>\nThat&#39;s a philosophical question. What you&#39;re saying by that is that  <br/>\nit&#39;s okay to ignore someone&#39;s discomfort until it reaches a level  <br/>\nthat you believe is worthy of attending to. *Is* that what you mean?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":146582081,"authorName":"castlecarver","from":"&quot;castlecarver&quot; &lt;artist@...&gt;","profile":"castlecarver","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Public School","postDate":"1187343372","msgId":25840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhM3E2YytpMXZ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyN2EwMWM3ZGZhYiRhYzUyZmNmMCRmYjhhZGNjY0BPZmZpY2U+"},"prevInTopic":25829,"nextInTopic":25841,"prevInTime":25839,"nextInTime":25841,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... started a school year at the ... year.","messageBody":"<div id=\"ygrps-yiv-305096353\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Brian & Alexandra<br/>\nPolikowsky&quot; &lt;polykow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Her only requirement was that if he<br/>\n </span></blockquote>started a school year at the<br/>\n<blockquote><span title=\"ireply\"> &gt; public school, he must finish the entire<br/>\n </span></blockquote>year.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; That is like punishing him for trying something new and making a<br/>\n </span></blockquote>mistake.<br/>\n<blockquote><span title=\"ireply\"> &gt; Not what mindful parents want in creating a relationship of trust<br/>\n </span></blockquote>between them and their kids.<br/>\n<blockquote><span title=\"ireply\"> &gt; If I took a new different job and after whatever time I decided it<br/>\n </span></blockquote>wasn&#39;t for me I would just quit.<br/>\n<blockquote><span title=\"ireply\"> &gt; I have that choice. That child did not.<br/>\n&gt; Alex<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Alex,<br/>\n<br/>\nI might say that in the case of a very young child. But this was an<br/>\nolder child(7th grade)and he was made well aware of the what would<br/>\nhappen. I don&#39;t think it was a punishment so much as a lesson in<br/>\ntaking responsibility for one&#39;s actions. <br/>\n<br/>\nHere is a turn on your analogy. <br/>\nI signed a contract to work for a year on a new job. Then found I<br/>\ndidn&#39;t like the job. Yet I still honored the contract. You see, I made<br/>\nan informed decision in taking the job in the first place and I<br/>\nunderstood the contract in advance. I stayed for one year exactly<br/>\nbecause I made the choice to be there. And I made the agreement to<br/>\nwork for that amount of time regardless of how much I disliked it. <br/>\n<br/>\nThat child most certainly did have a choice. His parents tried for<br/>\nweeks to persuade him to stay home. But they made that particular<br/>\nagreement with him because taking a child out of the public system in<br/>\nthe middle of the school year in this state is something akin to<br/>\nextracting teeth... and he understood that. He did exactly what I<br/>\nwould have done having made that agreement. He honored his contract.<br/>\nHe never said a word all year about not liking public school. But at<br/>\nthe end of the year he asked to be home schooled again. <br/>\n<br/>\nOf course I am sure if he were truly miserable they would have done<br/>\nsomething even so. <br/>\n<br/>\nSandi</div>","specialLinks":[]},{"userId":93478817,"authorName":"GWilhelm","from":"&quot;GWilhelm&quot; &lt;gwilhelm@...&gt;","profile":"giatwo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187316574","msgId":25842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTkwMWM3ZTA3MyRhODQ1OGUyMCQ2NDc4ZmZkZkBNYWluQ29tcHV0ZXI+","referencesHeader":"PEJBWTEwNS1GMTY1M0Y2QTM1RjFGRjM0NDdDRDlCNkNBREYwQHBoeC5nYmw+"},"prevInTopic":25841,"nextInTopic":25844,"prevInTime":25841,"nextInTime":25843,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"Hi- I am normally a lurker but wanted to pop in to say that my now 16yo daughter wanted to try high school out last year.   She was there for 4 days.  On the ","messageBody":"<div id=\"ygrps-yiv-580940893\">Hi-<br/>\nI am normally a lurker but wanted to pop in to say that my now 16yo daughter <br/>\nwanted to try high school out last year.   She was there for 4 days.  On the <br/>\n5th day, she was up and dressed and decided that she didn&#39;t want to go. She <br/>\nstayed home and said maybe on Monday. I ended up calling her in sick for the <br/>\nnext week until she was positive that she didn&#39;t want to return.  Then I <br/>\nwithdrew her and sent in my homeshooling paperwork.  She is even more <br/>\nadamant now that she never wants to return.  She realized that there was <br/>\nonly one, possibly two classes that she  enjoyed but the rest were not worth <br/>\nthe hassle, certainly not worth getting up at 5:30 am!  She kids around that <br/>\nshe is a 4day hs drop-out! LOL!<br/>\nOn the other hand, my now 17 year old son wanted to try out hs and is still <br/>\nthere.  He is there for the social aspect, as he really enjoys being around <br/>\na big group of kids all the time.  Unfortunately, that was not something I <br/>\nwas able to provide for him on a continuous basis.<br/>\nG<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Wildflower Car&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolfool@...\">unschoolfool@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Thursday, August 16, 2007 2:32 PM<br/>\nSubject: RE: [unschoolingbasics] Re: Public School<br/>\n<br/>\n<br/>\n&gt; &gt;<br/>\n&gt;&gt;Why?<br/>\n&gt;<br/>\n&gt; It is for social and dance team.<br/>\n&gt;&gt;<br/>\n&gt;&gt;What is it about ps that is intriguing?<br/>\n&gt;<br/>\n&gt; Her friends are almost all there. She says she just feels like she is<br/>\n&gt; missing out on some right of passage.<br/>\n&gt;&gt;<br/>\n&gt;&gt;Can he/she say,hey this is dumb. Can he/she just be there for social<br/>\n&gt;&gt;and pull ds and have it be okay with you?<br/>\n&gt;<br/>\n&gt; Sure!<br/>\n&gt;<br/>\n&gt;&gt;Can he/she just try it for a day and come home and never go again.<br/>\n&gt;<br/>\n&gt; I&#39;m thinking it will be about a month, but of course she could quit.<br/>\n&gt;<br/>\n&gt; Wildflower<br/>\n&gt;<br/>\n&gt; _________________________________________________________________<br/>\n&gt; Booking a flight? Know when to buy with airfare predictions on MSN Travel.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://travel.msn.com/Articles/aboutfarecast.aspx&ocid=T001MSN25A07001\">http://travel.msn.com/Articles/aboutfarecast.aspx&ocid=T001MSN25A07001</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187291059","msgId":25828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNS1GMzlBMThFQTk4MTc5QTNENjQ4Q0Y3OENBREYwQHBoeC5nYmw+","inReplyToHeader":"PDA4MTYyMDA3MDMwNC4xMjMxMy40NkMzQkVCRDAwMEJDNkZEMDAwMDMwMTkyMjAwNzUwNzg0OUIwRTA1MDE5RDA3MEVAY29tY2FzdC5uZXQ+"},"prevInTopic":25823,"nextInTopic":25829,"prevInTime":25827,"nextInTime":25829,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... No such luck around here. _________________________________________________________________ Now you can see trouble…before he arrives ","messageBody":"<div id=\"ygrps-yiv-1128307455\"><blockquote><span title=\"ireply\">&gt;Look for a small charter school.<br/>\n&gt;Kathryn<br/>\n<br/>\n </span></blockquote>No such luck around here.<br/>\n<br/>\n_________________________________________________________________<br/>\nNow you can see trouble�before he arrives <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507\">http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507</a></div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Public School","postDate":"1187289161","msgId":25823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNS1GMTY1M0Y2QTM1RjFGRjM0NDdDRDlCNkNBREYwQHBoeC5nYmw+","inReplyToHeader":"PGZhMGZoZitqa2ZhQGVHcm91cHMuY29tPg=="},"prevInTopic":25816,"nextInTopic":25828,"prevInTime":25822,"nextInTime":25824,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... It is for social and dance team. ... Her friends are almost all there. She says she just feels like she is missing out on some right of passage. ... Sure! ","messageBody":"<div id=\"ygrps-yiv-356739341\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;Why?<br/>\n<br/>\n </span></blockquote>It is for social and dance team.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;What is it about ps that is intriguing?<br/>\n<br/>\n </span></blockquote>Her friends are almost all there. She says she just feels like she is <br/>\nmissing out on some right of passage.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;Can he/she say,hey this is dumb. Can he/she just be there for social<br/>\n&gt;and pull ds and have it be okay with you?<br/>\n<br/>\n </span></blockquote>Sure!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Can he/she just try it for a day and come home and never go again.<br/>\n<br/>\n </span></blockquote>I&#39;m thinking it will be about a month, but of course she could quit.<br/>\n<br/>\nWildflower<br/>\n<br/>\n_________________________________________________________________<br/>\nBooking a flight? Know when to buy with airfare predictions on MSN Travel. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://travel.msn.com/Articles/aboutfarecast.aspx&ocid=T001MSN25A07001\">http://travel.msn.com/Articles/aboutfarecast.aspx&ocid=T001MSN25A07001</a></div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Public School","postDate":"1187269416","msgId":25816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxYS4xMWUzNTBjNy4zM2Y1YTUyOEBhb2wuY29tPg=="},"prevInTopic":25810,"nextInTopic":25823,"prevInTime":25815,"nextInTime":25817,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... school. ;-) ","messageBody":"<div id=\"ygrps-yiv-818090383\"><blockquote><span title=\"ireply\">&gt;&gt;I think the one thing unschooled kids miss out on is experiencing  <br/>\n </span></blockquote>school. ;-) &lt;&lt;<br/>\n <br/>\nJulian was in school through the third grade. He says that he&#39;s kind of  glad <br/>\nabout that, because he has always been SURE that he didn&#39;t want to go  back.<br/>\n <br/>\nThe advantage of doing this at 16 is that if she decides she doesn&#39;t like  <br/>\nit, it&#39;s REALLY easy to pull her out. No big hoops. And she already has a good  <br/>\nsense of herself, so she&#39;s not going to put up with any bull-doodoo.<br/>\n <br/>\nKathryn<br/>\n<br/>\n<br/>\n<br/>\n************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187266321","msgId":25829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2QzQzRjExLjkwNjAyMDVAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGZhMGZoZitqa2ZhQGVHcm91cHMuY29tPg==","referencesHeader":"PGZhMGZoZitqa2ZhQGVHcm91cHMuY29tPg=="},"prevInTopic":25828,"nextInTopic":25840,"prevInTime":25828,"nextInTime":25830,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"Hi Wildflower- The first time my son mentioned the possibility of wanting to try public school I was very upset and didn t really respond very well. I needed","messageBody":"<div id=\"ygrps-yiv-1864309264\">Hi Wildflower-<br/>\n<br/>\nThe first time my son mentioned the possibility of wanting to try public <br/>\nschool I was very upset and didn&#39;t really respond very well. I needed to <br/>\nprocess my own fears and return to trusting him to be able to make his <br/>\nown decision. After I did that  I was able to him less biased <br/>\ninformation about what it was like for me at school and what I know <br/>\nabout schools in general, including local schools. There is quite a bit <br/>\nof news about racial conflict in the local schools.<br/>\n<br/>\nHe has since then gotten involved with the music program at the local <br/>\nhigh school. After that he has no interest in going there- not impressed <br/>\nwith how the kids interact - though he will continue to be involved with <br/>\nthe music program- a few hours a week is tolerable. He would be <br/>\ninterested in going to another school in a district nearby which we may <br/>\npossibly move to in the future. Though he has a good friend in high <br/>\nschool there and sees how totally stressed this kid is- it is a public <br/>\nschool with a college prep focus. The friend&#39;s parents really ride him <br/>\nhard too, and my son is really put off by this and doesn&#39;t understand <br/>\nwhy they think it necessary- sometimes he doesn&#39;t have so good a time <br/>\nover there because of it. He is pretty aware of the difference between <br/>\nthe behavior of schooled kids and his home schooled friends- though not <br/>\nall of them are unschooled- and some of their parents ride them pretty <br/>\nhard as well- they still seem to be decent to each other.<br/>\n<br/>\nHe is absolutely &quot;allowed&quot; to attend school if he wishes and to come <br/>\nhome the next day if that is what he decides. I agree that insisting <br/>\nthat the child attend an entire year is cruel- I have a friend who did <br/>\nthat with her son and I never understood the purpose- kind of like <br/>\npunishment for his rejecting what she had given him.<br/>\n<br/>\nSince he first thought that school might be a good idea we have also <br/>\ngotten very involved with a learning center(all kinds of homschooling <br/>\nfamilies) and that has met needs for social contact with a group of <br/>\npeers, things to do, and contact with other adults who have things to <br/>\nshare. We also make a HUGE effort to find ways for him to get involved <br/>\nwith other adults in the community- he is now assisting with the sound <br/>\nset-up for a local live music radio program, and has done an <br/>\napprenticeship with a luthier among other things. People are always very <br/>\nimpressed with his behavior and one thing tends to lead to another- lots <br/>\nof opportunity. This more than anything is what I think some teens might <br/>\nneed to fill a gap they are feeling - real involvement with people doing <br/>\nreal work-<br/>\n<br/>\ngood luck-<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Public School","postDate":"1187256019","msgId":25810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFNjY3QjlDLTQ2NUItNDU5OS1BNUIzLUE1QzMyMEQ3NkIyMkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PEJBWTEwNS1GMjZEMjkyMjgzRTQ1M0NGNTNBNEY5M0NBREYwQHBoeC5nYmw+","referencesHeader":"PEJBWTEwNS1GMjZEMjkyMjgzRTQ1M0NGNTNBNEY5M0NBREYwQHBoeC5nYmw+"},"prevInTopic":25806,"nextInTopic":25816,"prevInTime":25809,"nextInTime":25811,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... And how can she truly know what crap it is until she s experienced it? Isn t that what unschooling is about: letting them learn by experience rather than","messageBody":"<div id=\"ygrps-yiv-1719758536\">On Aug 15, 2007, at 9:07 PM, Wildflower Car wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My 16 year old has asked to try public school. Okay, so we check  <br/>\n&gt; into it.<br/>\n&gt; What crap!<br/>\n<br/>\n </span></blockquote>And how can she truly know what crap it is until she&#39;s experienced  <br/>\nit? Isn&#39;t that what unschooling is about: letting them learn by  <br/>\nexperience rather than by telling?<br/>\n<br/>\nIt will be hard! Kat tried 2nd grade for 3 months. At the beginning  <br/>\nfor her it was worth putting up with the crap in order to experience  <br/>\nthe whole deal. Eventually the bad parts out weighed the good parts.  <br/>\nAnd she hasn&#39;t had any desire to return. Two years ago she joined the  <br/>\nhigh school cross country team and though she&#39;s enjoyed being with  <br/>\nthe kids, even that hasn&#39;t pulled her back. She took an art class  <br/>\nlast year and this year will take art and calculus (just for fun :-)  <br/>\nbut she can see the bogusness of the social stuff and the difference  <br/>\nbetween real learning and learning for a test. She can see the  <br/>\ndifferences in their attitudes towards learning: they&#39;re going  <br/>\nthrough the motions to get a grade whereas she&#39;s there to understand  <br/>\nthe material because she wants to. (Choice is a powerful thing!)<br/>\n<br/>\nI think the one thing unschooled kids miss out on is experiencing  <br/>\nschool. ;-) *We* (the unschooling parents) can speak with authority  <br/>\nabout how much better unschooling is because we&#39;ve experienced both.  <br/>\nWe can point out to schooling parents who want to argue that their  <br/>\nopinion on how learning must be is skewed because they&#39;ve never  <br/>\nexperienced unschooling. Our kids are more like schooling parents in  <br/>\nthat they&#39;ve only experienced unschooling. They can&#39;t speak with  <br/>\nauthority on how much better it is. ;-)<br/>\n<br/>\nThough some kids do pick up the damage that school does to their  <br/>\nfriends and will have an opinion on what they have to go through to  <br/>\nlearn, it really isn&#39;t the same as experiencing it first hand.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Public School","postDate":"1187234159","msgId":25805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhMGZoZitqa2ZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEyMC1EQVYxNjIxRjlFRDZCNUZCNjlEMjFERERCQzRERjBAcGh4LmdibD4="},"prevInTopic":25804,"nextInTopic":25806,"prevInTime":25804,"nextInTime":25806,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... Message ----- ... into it. ... Why? What is it about ps that is intriguing? Can he/she say,hey this is dumb. Can he/she just be there for social and pull","messageBody":"<div id=\"ygrps-yiv-1073306317\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &gt;   ----- Original <br/>\nMessage ----- <br/>\n<blockquote><span title=\"ireply\"> &gt;   From: Wildflower Car&lt;mailto:unschoolfool@...&gt; <br/>\n&gt;   My 16 year old has asked to try public school. Okay, so we check <br/>\n </span></blockquote>into it. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;   Any thoughts?<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Why?<br/>\n<br/>\nWhat is it about ps that is intriguing? <br/>\n<br/>\nCan he/she say,hey this is dumb. Can he/she just be there for social <br/>\nand pull ds and have it be okay with you?<br/>\n<br/>\nCan he/she just try it for a day and come home and never go again.<br/>\n<br/>\nI am sorry Wildflower this is a tough one.<br/>\n<br/>\nKathleen</div>","specialLinks":[]},{"userId":295439124,"authorName":"Julie Hampton","from":"&quot;Julie Hampton&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Public School","postDate":"1187233752","msgId":25804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEyMC1EQVYxNjIxRjlFRDZCNUZCNjlEMjFERERCQzRERjBAcGh4LmdibD4=","referencesHeader":"PEJBWTEwNS1GMjZEMjkyMjgzRTQ1M0NGNTNBNEY5M0NBREYwQHBoeC5nYmw+"},"prevInTopic":25803,"nextInTopic":25805,"prevInTime":25803,"nextInTime":25805,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"Let her try it out - at least she knows she can always leave if she wants to. I think it is a -I want to see what it is like- sort of thing JulieH ... From:","messageBody":"<div id=\"ygrps-yiv-1136806048\">Let her try it out - at least she knows she can always leave if she wants to. I think it is a -I want to see what it is like- sort of thing<br/>\n<br/>\nJulieH<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Wildflower Car&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolfool@...\">unschoolfool@...</a>&gt; <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; <br/>\n  Sent: Wednesday, August 15, 2007 7:07 PM<br/>\n  Subject: [unschoolingbasics] Public School<br/>\n<br/>\n<br/>\n  My 16 year old has asked to try public school. Okay, so we check into it. <br/>\n  What crap! At least IMHO.<br/>\n<br/>\n  I feel like sending her to public school is like letting her juggle knives <br/>\n  at age 3. Okay, maybe I&#39;m being rather dramatic, but I hate it. All the <br/>\n  stuff required to just enroll her is so crazy. But if she wants to do it and <br/>\n  is willing jump through the hoops to get in, we are trying to do our part.<br/>\n<br/>\n  Any thoughts?<br/>\n<br/>\n  Wildflower<br/>\n<br/>\n  _________________________________________________________________<br/>\n  Now you can see trouble.before he arrives <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507&lt;http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507\">http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507&lt;http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n  Yahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":153118561,"authorName":"airokat@comcast.net","from":"airokat@...","profile":"dawakat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187233469","msgId":25806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4MTYyMDA3MDMwNC4xMjMxMy40NkMzQkVCRDAwMEJDNkZEMDAwMDMwMTkyMjAwNzUwNzg0OUIwRTA1MDE5RDA3MEVAY29tY2FzdC5uZXQ+"},"prevInTopic":25805,"nextInTopic":25810,"prevInTime":25805,"nextInTime":25808,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"Look for a small charter school. Kathryn ... From: castlecarver  ... into it. This hasn t happened to me yet. One of my friend s sons","messageBody":"<div id=\"ygrps-yiv-1898928180\">Look for a small charter school.<br/>\nKathryn<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;castlecarver&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:artist@...\">artist@...</a>&gt; <br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Wildflower Car&quot;<br/>\n&lt;unschoolfool@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My 16 year old has asked to try public school. Okay, so we check<br/>\n </span></blockquote>into it. <br/>\nThis hasn&#39;t happened to me yet.<br/>\nOne of my friend&#39;s sons decided that he wanted to go to public school.<br/>\nHer only requirement was that if he started a school year at the<br/>\npublic school, he must finish the entire year. He did... But he is<br/>\nback home now and does not want to return. <br/>\nSandi<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What crap! At least IMHO.<br/>\n&gt; <br/>\n&gt; I feel like sending her to public school is like letting her juggle<br/>\n </span></blockquote>knives <br/>\n<blockquote><span title=\"ireply\"> &gt; at age 3. Okay, maybe I&#39;m being rather dramatic, but I hate it. All the <br/>\n&gt; stuff required to just enroll her is so crazy. But if she wants to<br/>\n </span></blockquote>do it and <br/>\n<blockquote><span title=\"ireply\"> &gt; is willing jump through the hoops to get in, we are trying to do our<br/>\n </span></blockquote>part.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Any thoughts?<br/>\n&gt; <br/>\n&gt; Wildflower<br/>\n&gt; <br/>\n&gt; __________________________________________________________<br/>\n&gt; Now you can see trouble�before he arrives <br/>\n&gt;<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507\">http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507</a><br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Public School","postDate":"1187230682","msgId":25803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyN2EwMWM3ZGZhYiRhYzUyZmNmMCRmYjhhZGNjY0BPZmZpY2U+","referencesHeader":"PGZhMGIzaCs3cXY1QGVHcm91cHMuY29tPg=="},"prevInTopic":25801,"nextInTopic":25804,"prevInTime":25802,"nextInTime":25804,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... public school, he must finish the entire year.","messageBody":"<div id=\"ygrps-yiv-1916548803\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Her only requirement was that if he started a school year at the<br/>\n </span></blockquote>public school, he must finish the entire year.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nThat is like punishing him for trying something new and making a mistake.<br/>\nNot what mindful parents want in creating a relationship of trust between them and their kids.<br/>\nIf I took a new different job and after whatever time I decided it wasn&#39;t for me I would just quit.<br/>\nI have that choice. That child did not.<br/>\nAlex<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":146582081,"authorName":"castlecarver","from":"&quot;castlecarver&quot; &lt;artist@...&gt;","profile":"castlecarver","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Public School","postDate":"1187229617","msgId":25801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhMGIzaCs3cXY1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEwNS1GMjZEMjkyMjgzRTQ1M0NGNTNBNEY5M0NBREYwQHBoeC5nYmw+"},"prevInTopic":25799,"nextInTopic":25803,"prevInTime":25800,"nextInTime":25802,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"... into it. This hasn t happened to me yet. One of my friend s sons decided that he wanted to go to public school. Her only requirement was that if he started","messageBody":"<div id=\"ygrps-yiv-954600409\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Wildflower Car&quot;<br/>\n&lt;unschoolfool@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My 16 year old has asked to try public school. Okay, so we check<br/>\n </span></blockquote>into it. <br/>\nThis hasn&#39;t happened to me yet.<br/>\nOne of my friend&#39;s sons decided that he wanted to go to public school.<br/>\nHer only requirement was that if he started a school year at the<br/>\npublic school, he must finish the entire year. He did... But he is<br/>\nback home now and does not want to return. <br/>\nSandi<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What crap! At least IMHO.<br/>\n&gt; <br/>\n&gt; I feel like sending her to public school is like letting her juggle<br/>\n </span></blockquote>knives <br/>\n<blockquote><span title=\"ireply\"> &gt; at age 3. Okay, maybe I&#39;m being rather dramatic, but I hate it. All the <br/>\n&gt; stuff required to just enroll her is so crazy. But if she wants to<br/>\n </span></blockquote>do it and <br/>\n<blockquote><span title=\"ireply\"> &gt; is willing jump through the hoops to get in, we are trying to do our<br/>\n </span></blockquote>part.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Any thoughts?<br/>\n&gt; <br/>\n&gt; Wildflower<br/>\n&gt; <br/>\n&gt; _________________________________________________________________<br/>\n&gt; Now you can see troublebefore he arrives <br/>\n&gt;<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507\">http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507</a><br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Public School","postDate":"1187226431","msgId":25799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNS1GMjZEMjkyMjgzRTQ1M0NGNTNBNEY5M0NBREYwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":25801,"prevInTime":25798,"nextInTime":25800,"topicId":25799,"numMessagesInTopic":0,"msgSnippet":"My 16 year old has asked to try public school. Okay, so we check into it. What crap! At least IMHO. I feel like sending her to public school is like letting","messageBody":"<div id=\"ygrps-yiv-162836003\">My 16 year old has asked to try public school. Okay, so we check into it. <br/>\nWhat crap! At least IMHO.<br/>\n<br/>\nI feel like sending her to public school is like letting her juggle knives <br/>\nat age 3. Okay, maybe I&#39;m being rather dramatic, but I hate it. All the <br/>\nstuff required to just enroll her is so crazy. But if she wants to do it and <br/>\nis willing jump through the hoops to get in, we are trying to do our part.<br/>\n<br/>\nAny thoughts?<br/>\n<br/>\nWildflower<br/>\n<br/>\n_________________________________________________________________<br/>\nNow you can see trouble�before he arrives <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507\">http://newlivehotmail.com/?ocid=TXT_TAGHM_migration_HM_viral_protection_0507</a></div>","specialLinks":[]}],"prevTopicId":26987,"nextTopicId":26722}}