{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":209687569,"authorName":"rikisgirl","from":"&quot;rikisgirl&quot; &lt;jacque.valdez@...&gt;","profile":"rikisgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry! TO REN","postDate":"1251472321","msgId":41154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3OHM0MStpbTY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg3N2xvaitqaDBsQGVHcm91cHMuY29tPg=="},"prevInTopic":41152,"nextInTopic":0,"prevInTime":41153,"nextInTime":41155,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"That is so neat....I love the fact that there is such diversity on this list so many ideas and things going on.. Jacque","messageBody":"<div id=\"ygrps-yiv-1783315723\">That is so neat....I love the fact that there is such diversity on this list so many ideas and things going on..<br/>\nJacque</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry! TO REN","postDate":"1251433043","msgId":41152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3N2xvaitqaDBsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg3NjltbStwOHRqQGVHcm91cHMuY29tPg=="},"prevInTopic":41149,"nextInTopic":41154,"prevInTime":41151,"nextInTime":41153,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"~~I wanted to ask you said you were working on an article for a german magazine is there any reason in particular that it was for a german magazine are they","messageBody":"<div id=\"ygrps-yiv-428022221\">~~I wanted to ask you said you were working on an article for a german magazine is there any reason in particular that it was for a german magazine are they someone you work with often? ~~<br/>\n<br/>\nJohanna (a member here) lives in Germany and helps publish the magazine &quot;Unerzogen&quot;. It&#39;s an unschooling-based publication in a country in which homeschooling of any kind is illegal so it&#39;s very cool that they&#39;re trying to make changes this way.<br/>\n<br/>\nShe put out a call for writers on a certain topic and I was one of the people that responded. It will be a two-part essay (one written by me and the other by a Mum I met at Life is Good) and I&#39;m not sure when it will be published. I won&#39;t be able to understand the final version but I trust Johanna!:)<br/>\n<br/>\nShe&#39;s on here so maybe she can chime in here about Unerzogen and how it&#39;s doing in Germany. I know other members here have been published in it. Rue did an article about consensual use of money in their home.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":209687569,"authorName":"rikisgirl","from":"&quot;rikisgirl&quot; &lt;jacque.valdez@...&gt;","profile":"rikisgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry! TO REN","postDate":"1251387926","msgId":41149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3NjltbStwOHRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg2bmxxNStuMmI2QGVHcm91cHMuY29tPg=="},"prevInTopic":41148,"nextInTopic":41152,"prevInTime":41148,"nextInTime":41150,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"Ren I spent a good amount of time last night reading over your blogspot and first wanted to say how refreshing it all was....I hope that I can find people here","messageBody":"<div id=\"ygrps-yiv-1789619416\">Ren I spent a good amount of time last night reading over your blogspot and first wanted to say how refreshing it all was....I hope that I can find people here in my city that are doing the kinds of stuff that you and your family is involved in then I wanted to ask you said you were working on an article for a german magazine is there any reason in particular that it was for a german magazine are they someone you work with often?  I don&#39;t know why it mattered I was just curious....hahaha<br/>\nJacque<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;gruvystarchild&quot; &lt;starsuncloud@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ~~Has anyone had experiences with situations like this?  Those out there with kids with autism, how do you view therapies?  Are we supposed to get them &quot;help&quot; from professionals when we can&#39;t handle it ourselves or should I be a stronger mom and work even harder to bring him out of his depression, anxiety attacks, and sometimes violent behavior?  Has anyone worked with professionals that come from a positive view of a child, or are they all negative? ~~<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I&#39;m working on an article about this very topic right now, but it will be published in a German mag so I&#39;ll ask about posting it in English at my blog or something. If the magazine is ok with that I&#39;ll share it when I&#39;m done.:)<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; radicalunschooling.blogspot.com<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":209687569,"authorName":"rikisgirl","from":"&quot;rikisgirl&quot; &lt;jacque.valdez@...&gt;","profile":"rikisgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1251387632","msgId":41148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3NjlkZys2YTM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg2bjNyOStnbTA2QGVHcm91cHMuY29tPg=="},"prevInTopic":41134,"nextInTopic":41149,"prevInTime":41147,"nextInTime":41149,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"I am new to unschooling so I am not sure how others would respond to such a question but my 8 year old son is diagnosised autistic and honestly I don t give","messageBody":"<div id=\"ygrps-yiv-983058293\">I am new to unschooling so I am not sure how others would respond to such a question but my 8 year old son is diagnosised &quot;autistic&quot; and honestly I don&#39;t give much thought to what the doctors say are wrong with my kids seems to me so many times they are mearly a cruch with that said we spent many years going to speech therapists, occupational therapists and physical therapists running this way and that and not that I am saying none of it helped because some obviously did some good but the running around and trying to make appointments all week long were so stressful on all of us as a family that it far outweighed the benefits of it all.  Now I have a son who didn&#39;t speak until he was almost 5 so we are not talking about a minor thing BUT I had an autism activist say to me one day Jacque at some point you have to decide what kind of quality of life you want for you and your family.  Is it stuck in traffic driving around town to appointments or is there a better way.  It has also been my experience that the therapists are constantly changing positions and if your child is like mine change in most things is not a big option, we had a different therapist all the time and as soon as my son got to know them they were gone.  My son is doing great and I do my own forms of therapy with him....like sensory things there are a ton of things you can do to work with your child on your own in your home in a relaxing and fun way......I would be happy to talk to you here or off list about things we do and are still working on.....I hope some of what I said helped and didn&#39;t confuse the issue.<br/>\nJacque<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jamieminnis&quot; &lt;jamieminnis@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I apologize if this topic has already been covered (I looked thru the archives, with no luck). I have a 7 yo son who has been diagnosed with PDD-NOS by one dr. and Asperger&#39;s by his old school district (both autism spectrum disorders).  Let me step back for a minute to say that we have been unschooling (everything other than bedtimes, due to daddy&#39;s frustration level at nighttime) for a little over a year now. DS has always been very high-strung, active, and anxious, but lately his anger & frustration are barely controllable. I have been trying my VERY best to be the calm person in the room, but I am not perfect. So, I too have been getting frustrated (usually inside but sometimes it is visible to the kiddos). DS has been screaming a lot, lashing out both verbally and physically at his brother (6 yo also mildly autistic) who responds in kind. I have been thinking of trying to really figure out what the triggers are for Jason&#39;s (DS 7yo) anger and anxiety about leaving the house and have been contemplating finding some kind of &quot;therapy&quot; and/or counseling that would help him diminish his anxiety and anger, while helping him build self-confidence and other wonderful parts of his personality and interests.  I really feel that he needs more help than I personally can give. Today, in sheer frustration, he told me that he just can&#39;t help yelling.  He said his anger just gets so big that he doesn&#39;t know what else to do.  My heart just about broke to realize that he is aware of it, but still can&#39;t do anything about it himself.<br/>\n&gt; <br/>\n&gt; Has anyone had experiences with situations like this?  Those out there with kids with autism, how do you view therapies?  Are we supposed to get them &quot;help&quot; from professionals when we can&#39;t handle it ourselves or should I be a stronger mom and work even harder to bring him out of his depression, anxiety attacks, and sometimes violent behavior?  Has anyone worked with professionals that come from a positive view of a child, or are they all negative? (As you may notice, my experience with most professionals in the &quot;special ed&quot; realm hasn&#39;t been very good)? Any thoughts would be super appreciated!  I feel like I just don&#39;t know what the &quot;unschooling&quot; way to handle this is, but I know that something does need to be done for him.  He is desperate for it and because of that, so am I.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1251244983","msgId":41134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3MXUzbis2cWJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM5OTU4OC45NTczMS5xbUB3ZWI1MjgwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":41129,"nextInTopic":41148,"prevInTime":41133,"nextInTime":41135,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"... ******************* That sounds fantastic. Its always a good idea to give kids a heads up about difficult situations and do some problem solving","messageBody":"<div id=\"ygrps-yiv-1759921012\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jamie Minnis &lt;jamieminnis@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Like, when you get tired at the grocery store, let me know and we can find somewhere to sit down or they can ride in the cart.  (The grocery store is a big challenge for them and daddy isn&#39;t always home to make it work for them to stay home.)  Does this sound ok?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThat sounds fantastic. Its always a good idea to give kids a &quot;heads up&quot; about difficult situations and do some problem solving beforehand. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":206695648,"authorName":"Jamie Minnis","from":"Jamie Minnis &lt;jamieminnis@...&gt;","profile":"jamieminnis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1251158461","msgId":41129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5OTU4OC45NTczMS5xbUB3ZWI1MjgwNy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGg2czdnaCtiYjIyQGVHcm91cHMuY29tPg=="},"prevInTopic":41128,"nextInTopic":41134,"prevInTime":41128,"nextInTime":41130,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"No, my boys know nothing of their autism (well, at least not from myself or dh, I don t know about what they heard when they were in school).  I have only","messageBody":"<div id=\"ygrps-yiv-1754926638\">No, my boys know nothing of their autism (well, at least not from myself or dh, I don&#39;t know about what they heard when they were in school).  I have only talked with them (mainly the older one, who has more social challenges) about listening to what their friends are saying/asking when they are playing, finding some place quiet to relax if they start to feel overwhelmed, etc.  Really just things that will make their play times easier and more enjoyable for them.  There are really more examples of things we talk about, but they just kinda come about when I am thinking of what we are going to do that day and any challenges they might face.  Like, when you get tired at the grocery store, let me know and we can find somewhere to sit down or they can ride in the cart.  (The grocery store is a big challenge for them and daddy isn&#39;t always home to make it work for them to stay home.)  Does this sound ok?  Any advice about talking about issues.  We<br/>\n sometimes talk about appropriate behavior (like not yelling mean names at people or using a quieter voice inside the house or right next to someone).  Thanks for continuing to make me think!<br/>\n <br/>\nJamie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sun, 8/23/09, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Help with/for autistic son - LONG!! Sorry!<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Sunday, August 23, 2009, 4:06 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, &quot;alanlmarshall&quot; &lt;alanlmarshall@ ...&gt; wrote:<br/>\n&gt;That kind of description works well for neurologists who want to study it or school administrators who need funding, but for unschoolers it is much more helpful to think in terms of the specific needs and strengths of the child.<br/>\n************ *********<br/>\n<br/>\nSometimes looking into specific issues can be helpful for parents in terms of understanding children, and their unique points of view, better. And sometimes using a lable can be helpful in terms of getting other adults (especially well-meaning family) to back off! <br/>\n<br/>\nThat being said, a diagnosis tells very very little about a person. Its possible, after all, for two people with the same diagnosis to have very different sets of symptoms - and even very different needs (beyond the most basic needs, I mean). <br/>\n<br/>\n&gt; Do your sons know of and often hear about their supposed autism? I hope not, I think that could be very damaging.<br/>\n************ ******<br/>\n<br/>\nTalking with kids about how they are different from other people *can* be helpful for them, but its certainly very nuancy territory. There was a time when we talked a lot with Ray about the differences between extroverts and introverts, for instance. He really didn&#39;t Know that some people like to be alone, like quiet and stillness. He didn&#39;t like those things, after all. Similarly, Mo has a really conservative sense of taste and texture where food is concerned and we&#39;ve periodically discussed why other people sometimes offer her foods she doesn&#39;t like. It didn&#39;t occur to her that they didn&#39;t know those foods were disgusting! Those are both small instances where talking about differences was helpful to the kids - they felt better about themselves and/or the world as a result. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1251111062","msgId":41128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg2dHJhbStkbGpqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg2czdnaCtiYjIyQGVHcm91cHMuY29tPg=="},"prevInTopic":41127,"nextInTopic":41129,"prevInTime":41127,"nextInTime":41129,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"Oh, that rings so true! DH is a morning person. Can you imagine! He s actually chatty! And I have to remember not to bite his head off when he actually speaks","messageBody":"<div id=\"ygrps-yiv-1130961176\">Oh, that rings so true! <br/>\n<br/>\nDH is a morning person. Can you imagine! He&#39;s actually chatty! And I have to remember not to bite his head off when he actually speaks to me pre-coffee. <br/>\n<br/>\nAnd both DH and DS -- well, DD and I just don&#39;t get why they would pass on all the interesting food choices. <br/>\n<br/>\nSometimes it is difficult to see how others can be so, well, wrong! :)<br/>\n<br/>\nNance<br/>\n<br/>\n**************<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Talking with kids about how they are different from other people *can* be helpful for them, but its certainly very nuancy territory. There was a time when we talked a lot with Ray about the differences between extroverts and introverts, for instance. He really didn&#39;t Know that some people like to be alone, like quiet and stillness. He didn&#39;t like those things, after all. Similarly, Mo has a really conservative sense of taste and texture where food is concerned and we&#39;ve periodically discussed why other people sometimes offer her foods she doesn&#39;t like. It didn&#39;t occur to her that they didn&#39;t know those foods were disgusting! Those are both small instances where talking about differences was helpful to the kids - they felt better about themselves and/or the world as a result. <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 15)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1251058001","msgId":41127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg2czdnaCtiYjIyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg2cXNrNytpZjExQGVHcm91cHMuY29tPg=="},"prevInTopic":41126,"nextInTopic":41128,"prevInTime":41126,"nextInTime":41128,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"... ********************* Sometimes looking into specific issues can be helpful for parents in terms of understanding children, and their unique points of","messageBody":"<div id=\"ygrps-yiv-1875939931\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;alanlmarshall&quot; &lt;alanlmarshall@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;That kind of description works well for neurologists who want to study it or school administrators who need funding, but for unschoolers it is much more helpful to think in terms of the specific needs and strengths of the child.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nSometimes looking into specific issues can be helpful for parents in terms of understanding children, and their unique points of view, better. And sometimes using a lable can be helpful in terms of getting other adults (especially well-meaning family) to back off! <br/>\n<br/>\nThat being said, a diagnosis tells very very little about a person. Its possible, after all, for two people with the same diagnosis to have very different sets of symptoms - and even very different needs (beyond the most basic needs, I mean). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do your sons know of and often hear about their supposed autism? I hope not, I think that could be very damaging.<br/>\n </span></blockquote>******************<br/>\n<br/>\nTalking with kids about how they are different from other people *can* be helpful for them, but its certainly very nuancy territory. There was a time when we talked a lot with Ray about the differences between extroverts and introverts, for instance. He really didn&#39;t Know that some people like to be alone, like quiet and stillness. He didn&#39;t like those things, after all. Similarly, Mo has a really conservative sense of taste and texture where food is concerned and we&#39;ve periodically discussed why other people sometimes offer her foods she doesn&#39;t like. It didn&#39;t occur to her that they didn&#39;t know those foods were disgusting! Those are both small instances where talking about differences was helpful to the kids - they felt better about themselves and/or the world as a result. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":158915970,"authorName":"alanlmarshall","from":"&quot;alanlmarshall&quot; &lt;alanlmarshall@...&gt;","profile":"alanlmarshall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1251014087","msgId":41126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg2cXNrNytpZjExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg2bjNyOStnbTA2QGVHcm91cHMuY29tPg=="},"prevInTopic":41123,"nextInTopic":41127,"prevInTime":41125,"nextInTime":41127,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"***Today, in sheer frustration, he told me that he just can t help yelling.  He said his anger just gets so big that he doesn t know what else to do. *** I","messageBody":"<div id=\"ygrps-yiv-1226938456\">***Today, in sheer frustration, he told me that he just can&#39;t help yelling.  He said his anger just gets so big that he doesn&#39;t know what else to do. ***<br/>\n<br/>\nI have some experience with this - my dd has a developmental delay - and my first thought is that if your son is capable of telling you that then it&#39;s probably not helpful to think in terms of autism or any other particular diagnosis.<br/>\n<br/>\nIf he is that verbal at age 7 it is usually considered Asperger&#39;s, and for an unschooler I just don&#39;t think that is a useful way to see your child. That kind of description works well for neurologists who want to study it or school administrators who need funding, but for unschoolers it is much more helpful to think in terms of the specific needs and strengths of the child. <br/>\n<br/>\n***lashing out both verbally and physically at his brother (6 yo also mildly autistic) who responds in kind.***<br/>\n<br/>\nDo your sons know of and often hear about their supposed autism? I hope not, I think that could be very damaging. If not, good, but even just thinking of them in those terms and  describing them to others that way could be contributing to some of the challenges you&#39;ve been having. <br/>\n<br/>\nI think one of the best ways you could start to help both your sons live a more peaceful life would be to make one of the last things you say about them  to yourself, to them, and to others  is that they are autistic. <br/>\n<br/>\nAlan</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1250908805","msgId":41123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg2bmxxNStuMmI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg2bjNyOStnbTA2QGVHcm91cHMuY29tPg=="},"prevInTopic":41122,"nextInTopic":41126,"prevInTime":41122,"nextInTime":41124,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"~~Has anyone had experiences with situations like this?  Those out there with kids with autism, how do you view therapies?  Are we supposed to get them help","messageBody":"<div id=\"ygrps-yiv-536043863\">~~Has anyone had experiences with situations like this?  Those out there with kids with autism, how do you view therapies?  Are we supposed to get them &quot;help&quot; from professionals when we can&#39;t handle it ourselves or should I be a stronger mom and work even harder to bring him out of his depression, anxiety attacks, and sometimes violent behavior?  Has anyone worked with professionals that come from a positive view of a child, or are they all negative? ~~<br/>\n<br/>\n<br/>\nI&#39;m working on an article about this very topic right now, but it will be published in a German mag so I&#39;ll ask about posting it in English at my blog or something. If the magazine is ok with that I&#39;ll share it when I&#39;m done.:)<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":206695648,"authorName":"Jamie Minnis","from":"Jamie Minnis &lt;jamieminnis@...&gt;","profile":"jamieminnis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1250905805","msgId":41122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2MzAxMy45MjMxLnFtQHdlYjUyODAxLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGg2bmRlditkc2pyQGVHcm91cHMuY29tPg=="},"prevInTopic":41121,"nextInTopic":41123,"prevInTime":41121,"nextInTime":41123,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"Thank you, Meredith!  Thank you!  Your reply and the blog you passed on were like the blinding sun shining in my darkness!  I was blind and now I see!  I","messageBody":"<div id=\"ygrps-yiv-1821259224\">Thank you, Meredith!  Thank you!  Your reply and the blog you passed on were like the blinding sun shining in my darkness!  I was blind and now I see!  I know that sounds overly dramatic, but it is truly how I feel.  Through reading your response and truly thinking about my thoughts when Jason has his rages, I realized that I simply allowed myself to be: 1) tired and defeated. 2) not the best mom I know I can be. 3) willing to pass him off to some &quot;professional&quot; for a quick fix.  It&#39;s that third one that has really shocked me.  Unconsciously, I allowed myself to fall back into old ways of thinking and acting.  Thank you for calling me on it, possibly without even knowing you were doing it!  Wow!<br/>\n <br/>\nI now look forward to tomorrow, instead of dreading it.  I truly love my son (completely as he is) and recognize the feelings of anger that he has as some that I have had in my life, but was not allowed to express.  I definitely do not want to do this to my children! I don&#39;t remember exactly which wonderful unschooling mentor said this, but &quot;The truth will set you free, but it will piss you off first!&quot;  Ha!  So true! So true!<br/>\n <br/>\nJamie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 8/21/09, plaidpanties666 &lt;meredith@...&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: plaidpanties666 &lt;meredith@...&gt;<br/>\nSubject: [unschoolingbasics] Re: Help with/for autistic son - LONG!! Sorry!<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nDate: Friday, August 21, 2009, 8:17 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, &quot;jamieminnis&quot; &lt;jamieminnis@ ...&gt; wrote:<br/>\n&gt;Today, in sheer frustration, he told me that he just can&#39;t help yelling. He said his anger just gets so big that he doesn&#39;t know what else to do. <br/>\n************ ********* **<br/>\n<br/>\nIs there somewhere he can go and yell? Does it help him to yet At someone? Can you be that someone? <br/>\n<br/>\nIt can help to think of Big emotions as like being caught in a storm. You can&#39;t control a storm, the best you can do is to weather it safely. That&#39;s a skill to be learned - several skills, really. To see/feel the storm coming, to move through the storm safely, and to recover afterwards. If you&#39;ve been working on ways for him to control his anger, you may have been inadvertantly making matters worse. When dealing with Big emotions, there&#39;s a time for trying to change emotional gears and a time for accepting that a storm is coming. <br/>\n<br/>\nCommon triggers for intense kids are usually things that make them feel helpless. All kids need to feel capable and like they have the ability to make choices that are important to them - but intense kids are, ultimately, more sensitive. They take it Hard when they don&#39;t feel as capable as they possibly can. So look for ways to make your guy&#39;s life easier. Little things can &quot;build&quot; too, so the triggers you may be seeing are &quot;last straws&quot; - insignificant in and of themselves, but the end of a series of tiny triggers. That&#39;s imporant to talk about, if you can, with your son. It may help both of you to openly acknowledge that he&#39;s really dealing with a dozen tiny frustrations beautifully before he melts down. It can help boost his self-esteem *and* your image of him.<br/>\n<br/>\n&gt;&gt;DS has been screaming a lot, lashing out both verbally and physically at his brother<br/>\n************ ********* **<br/>\n<br/>\nWhat are the triggers for this? Are they things you can prevent? Remember the &quot;last straw&quot; possibility, too - if his brother is the most common &quot;last straw&quot; then it may be better to work on those other triggers. Snacks and rest and attention are good places to start.<br/>\n<br/>\nSometimes kids will get stuck wanting to control other people. That can be really hard for everyone in the family! Helping the kid in question be in control of as many other things as possible is something that can help that - but it likely won&#39;t help 100%. Other people are terribly inconvenient at times.<br/>\n<br/>\n&gt;&gt;I have been trying my VERY best to be the calm person in the room, but I am not perfect. So, I too have been getting frustrated (usually inside but sometimes it is visible to the kiddos).<br/>\n************ ********* ***<br/>\n<br/>\nThat&#39;s not necessarily a bad thing. Kids do need to see real adult emotions and how real adults deal with them. Maybe your kids need to see more of how you deal with your own frustration - can you make your own process more &quot;transparent&quot; to them? If that&#39;s not natural for you, it may feel awkward at first, but its a kind of modeling that can be really important - both in terms of your kids getting to see what an adult process really looks like *and* in terms of letting them know that adults aren&#39;t some kind of &quot;finished product&quot;. We don&#39;t have all the right answers and solutions and it Okay that we don&#39;t. So its okay when kids are imperfect, too.<br/>\n<br/>\n&gt;&gt;I have been thinking of trying to really figure out what the triggers are for Jason&#39;s (DS 7yo) anger and anxiety about leaving the house <br/>\n************ ***<br/>\n<br/>\nIntense kids often need to &quot;nest&quot; more. They need to be in spaces where they have the most choices and can exercise the most capability. If that&#39;s what&#39;s going on with your son, it will help him to be able to expand his comfort zone slowly and gently. What do you do, now, when you go out? Do you help him transition at his own pace? Do you bring plenty of things along to help him feel secure, help him feel like he still has plenty of choices? Do you go into every new space looking for ways to help him feel capable? Those would all be things to try (not just once, but enough to build a predictable pattern) before looking into outside help.<br/>\n<br/>\n&gt;&gt;finding some kind of &quot;therapy&quot; and/or counseling that would help him diminish his anxiety and anger, while helping him build self-confidence and other wonderful parts of his personality and interests.<br/>\n************ *********<br/>\n<br/>\nIn order to build his self esteem, its vitally important that you accept the intensity of his feelings. Otherwise you are not honoring Who He Is - you are looking at the parts you like and saying &quot;too bad we can&#39;t cut off the rest&quot;. That&#39;s a harsh way of putting it, but strong emotions are something your son isn&#39;t likely to grow out of. Some people have very strong feelings! When you can honor your son for Who he is, then you can help him move through the Big negative stuff more gracefully - with more love and acceptance. When he can feel that he&#39;s loved and accepted he&#39;ll feel better about who he is as a person, which will reduce his stress overall and give him a greater sense of capability. Which will help him be less frustrated. Which will give him more energy to deal with problems before becoming overwhelmed by emotions. The idea, the goal, is to turn the vicious circle around, so that good can build on good. Its not instantaneous! But its certainly<br/>\n possible.<br/>\n<br/>\n&gt;&gt;DS has been screaming a lot, lashing out both verbally and physically at his brother<br/>\n************ ********* **<br/>\n<br/>\nCreate a &quot;safe space&quot; in the home - a safe place to rage. When your ds is lashing out, go there with him and stay with him (make sure you&#39;ve agreed to this beforehand! don&#39;t spring it on him). Tell him you love him and want to help him. Don&#39;t let him hurt you! but be as available as you possibly can to help him release and move through the storm. If yelling helps, be the one he can yell at. If physical stuff helps, have pillows or whatever to help him vent some physical energy. Be his rock in the middle of the storm.<br/>\n<br/>\nHere&#39;s a collection of one mom&#39;s stories unschooling with her very intense child:<br/>\nhttp://daniellecong er.organiclearni ng.org/spirited. html<br/>\n<br/>\n---Meredith (Mo 8, Ray 15)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\nhttp://mail.yahoo.com <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with/for autistic son - LONG!! Sorry!","postDate":"1250900255","msgId":41121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg2bmRlditkc2pyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg2bjNyOStnbTA2QGVHcm91cHMuY29tPg=="},"prevInTopic":41120,"nextInTopic":41122,"prevInTime":41120,"nextInTime":41122,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"... *********************** Is there somewhere he can go and yell? Does it help him to yet At someone? Can you be that someone? It can help to think of Big","messageBody":"<div id=\"ygrps-yiv-1144765783\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jamieminnis&quot; &lt;jamieminnis@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Today, in sheer frustration, he told me that he just can&#39;t help yelling.  He said his anger just gets so big that he doesn&#39;t know what else to do. <br/>\n </span></blockquote>***********************<br/>\n<br/>\nIs there somewhere he can go and yell? Does it help him to yet At someone? Can you be that someone? <br/>\n<br/>\nIt can help to think of Big emotions as like being caught in a storm. You can&#39;t control a storm, the best you can do is to weather it safely. That&#39;s a skill to be learned - several skills, really. To see/feel the storm coming, to move through the storm safely, and to recover afterwards. If you&#39;ve been working on ways for him to control his anger, you may have been inadvertantly making matters worse. When dealing with Big emotions, there&#39;s a time for trying to change emotional gears and a time for accepting that a storm is coming. <br/>\n<br/>\nCommon triggers for intense kids are usually things that make them feel helpless. All kids need to feel capable and like they have the ability to make choices that are important to them - but intense kids are, ultimately, more sensitive. They take it Hard when they don&#39;t feel as capable as they possibly can. So look for ways to make your guy&#39;s life easier. Little things can &quot;build&quot; too, so the triggers you may be seeing are &quot;last straws&quot; - insignificant in and of themselves, but the end of a series of tiny triggers. That&#39;s imporant to talk about, if you can, with your son. It may help both of you to openly acknowledge that he&#39;s really dealing with a dozen tiny frustrations beautifully before he melts down. It can help boost his self-esteem *and* your image of him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;DS has been screaming a lot, lashing out both verbally and physically at his brother<br/>\n </span></blockquote>***********************<br/>\n<br/>\nWhat are the triggers for this? Are they things you can prevent? Remember the &quot;last straw&quot; possibility, too - if his brother is the most common &quot;last straw&quot; then it may be better to work on those other triggers. Snacks and rest and attention are good places to start.<br/>\n<br/>\nSometimes kids will get stuck wanting to control other people. That can be really hard for everyone in the family! Helping the kid in question be in control of as many other things as possible is something that can help that - but it likely won&#39;t help 100%. Other people are terribly inconvenient at times.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have been trying my VERY best to be the calm person in the room, but I am not perfect. So, I too have been getting frustrated (usually inside but sometimes it is visible to the kiddos).<br/>\n </span></blockquote>************************<br/>\n<br/>\nThat&#39;s not necessarily a bad thing. Kids do need to see real adult emotions and how real adults deal with them. Maybe your kids need to see more of how you deal with your own frustration - can you make your own process more &quot;transparent&quot; to them? If that&#39;s not natural for you, it may feel awkward at first, but its a kind of modeling that can be really important - both in terms of your kids getting to see what an adult process really looks like *and* in terms of letting them know that adults aren&#39;t some kind of &quot;finished product&quot;. We don&#39;t have all the right answers and solutions and it Okay that we don&#39;t. So its okay when kids are imperfect, too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have been thinking of trying to really figure out what the triggers are for Jason&#39;s (DS 7yo) anger and anxiety about leaving the house <br/>\n </span></blockquote>***************<br/>\n<br/>\nIntense kids often need to &quot;nest&quot; more. They need to be in spaces where they have the most choices and can exercise the most capability. If that&#39;s what&#39;s going on with your son, it will help him to be able to expand his comfort zone slowly and gently. What do you do, now, when you go out? Do you help him transition at his own pace? Do you bring plenty of things along to help him feel secure, help him feel like he still has plenty of choices? Do you go into every new space looking for ways to help him feel capable? Those would all be things to try (not just once, but enough to build a predictable pattern) before looking into outside help.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;finding some kind of &quot;therapy&quot; and/or counseling that would help him diminish his anxiety and anger, while helping him build self-confidence and other wonderful parts of his personality and interests.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nIn order to build his self esteem, its vitally important that you accept the intensity of his feelings. Otherwise you are not honoring Who He Is - you are looking at the parts you like and saying &quot;too bad we can&#39;t cut off the rest&quot;. That&#39;s a harsh way of putting it, but strong emotions are something your son isn&#39;t likely to grow out of. Some people have very strong feelings! When you can honor your son for Who he is, then you can help him move through the Big negative stuff more gracefully - with more love and acceptance. When he can feel that he&#39;s loved and accepted he&#39;ll feel better about who he is as a person, which will reduce his stress overall and give him a greater sense of capability. Which will help him be less frustrated. Which will give him more energy to deal with problems before becoming overwhelmed by emotions. The idea, the goal, is to turn the vicious circle around, so that good can build on good. Its not instantaneous! But its certainly possible.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;DS has been screaming a lot, lashing out both verbally and physically at his brother<br/>\n </span></blockquote>***********************<br/>\n<br/>\nCreate a &quot;safe space&quot; in the home - a safe place to rage. When your ds is lashing out, go there with him and stay with him (make sure you&#39;ve agreed to this beforehand! don&#39;t spring it on him). Tell him you love him and want to help him. Don&#39;t let him hurt you! but be as available as you possibly can to help him release and move through the storm. If yelling helps, be the one he can yell at. If physical stuff helps, have pillows or whatever to help him vent some physical energy. Be his rock in the middle of the storm.<br/>\n<br/>\nHere&#39;s a collection of one mom&#39;s stories unschooling with her very intense child:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://danielleconger.organiclearning.org/spirited.html\">http://danielleconger.organiclearning.org/spirited.html</a><br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":206695648,"authorName":"jamieminnis","from":"&quot;jamieminnis&quot; &lt;jamieminnis@...&gt;","profile":"jamieminnis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help with/for autistic son - LONG!! Sorry!","postDate":"1250890409","msgId":41120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg2bjNyOStnbTA2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41121,"prevInTime":41119,"nextInTime":41121,"topicId":41120,"numMessagesInTopic":0,"msgSnippet":"I apologize if this topic has already been covered (I looked thru the archives, with no luck). I have a 7 yo son who has been diagnosed with PDD-NOS by one dr.","messageBody":"<div id=\"ygrps-yiv-681275996\">I apologize if this topic has already been covered (I looked thru the archives, with no luck). I have a 7 yo son who has been diagnosed with PDD-NOS by one dr. and Asperger&#39;s by his old school district (both autism spectrum disorders).  Let me step back for a minute to say that we have been unschooling (everything other than bedtimes, due to daddy&#39;s frustration level at nighttime) for a little over a year now. DS has always been very high-strung, active, and anxious, but lately his anger & frustration are barely controllable. I have been trying my VERY best to be the calm person in the room, but I am not perfect. So, I too have been getting frustrated (usually inside but sometimes it is visible to the kiddos). DS has been screaming a lot, lashing out both verbally and physically at his brother (6 yo also mildly autistic) who responds in kind. I have been thinking of trying to really figure out what the triggers are for Jason&#39;s (DS 7yo) anger and anxiety about leaving the house and have been contemplating finding some kind of &quot;therapy&quot; and/or counseling that would help him diminish his anxiety and anger, while helping him build self-confidence and other wonderful parts of his personality and interests.  I really feel that he needs more help than I personally can give. Today, in sheer frustration, he told me that he just can&#39;t help yelling.  He said his anger just gets so big that he doesn&#39;t know what else to do.  My heart just about broke to realize that he is aware of it, but still can&#39;t do anything about it himself.<br/>\n<br/>\nHas anyone had experiences with situations like this?  Those out there with kids with autism, how do you view therapies?  Are we supposed to get them &quot;help&quot; from professionals when we can&#39;t handle it ourselves or should I be a stronger mom and work even harder to bring him out of his depression, anxiety attacks, and sometimes violent behavior?  Has anyone worked with professionals that come from a positive view of a child, or are they all negative? (As you may notice, my experience with most professionals in the &quot;special ed&quot; realm hasn&#39;t been very good)? Any thoughts would be super appreciated!  I feel like I just don&#39;t know what the &quot;unschooling&quot; way to handle this is, but I know that something does need to be done for him.  He is desperate for it and because of that, so am I.</div>","specialLinks":[]}],"prevTopicId":41132,"nextTopicId":4016}}