{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Cleaning and scheduling","postDate":"1146721823","msgId":12780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0Yi5hZjg4NjEwLjMxOGFmMDFmQGFvbC5jb20+"},"prevInTopic":12753,"nextInTopic":0,"prevInTime":12779,"nextInTime":12781,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"**We also dropped things that weren t important to us and aren t health or safety issues - like making beds. Beds get formally made when we change the linens","messageBody":"<div id=\"ygrps-yiv-994014556\">**We also dropped things that weren&#39;t important to us and aren&#39;t <br/>\n<br/>\nhealth or safety issues - like making beds. Beds get &#39;formally&#39; made <br/>\n<br/>\nwhen we change the linens each week. In between times we just tug <br/>\n<br/>\nthe sheets and comforters into alignment before climbing in at night.**<br/>\n<br/>\nAs it happens, making beds may actually be a health and safety issue...<br/>\n<br/>\n&quot;Failing to make your bed in the morning may actually help keep you healthy, <br/>\nscientists believe. <br/>\n<br/>\nResearch suggests that while an unmade bed may look scruffy it is also <br/>\nunappealing to house dust mites thought to cause asthma and other allergies. <br/>\n<br/>\nA Kingston University study discovered the bugs cannot survive in the warm, <br/>\ndry conditions found in an unmade bed.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://news.bbc.co.uk/2/hi/health/4181629.stm\">http://news.bbc.co.uk/2/hi/health/4181629.stm</a><br/>\n<br/>\nDeborah in IL  :-D</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Cleaning and scheduling","postDate":"1146660180","msgId":12753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUzYThnaytiNWo1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGUzMDA2byszbjFqQGVHcm91cHMuY29tPg=="},"prevInTopic":12750,"nextInTopic":12780,"prevInTime":12752,"nextInTime":12754,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"Something that DH (the at home parent) has been doing lately that seems to be working for him is one hour per day. Whether it s one hour cleaning the kitchen,","messageBody":"<div id=\"ygrps-yiv-502668169\">Something that DH (the at home parent) has been doing lately that <br/>\nseems to be working for him is one hour per day. Whether it&#39;s one <br/>\nhour cleaning the kitchen, one hour sweeping the floors, whatever. <br/>\nIt&#39;s manageable for him because it isn&#39;t that open ended &quot;endless&quot; <br/>\ntask feeling - feeling like he&#39;d be at it for &quot;Hours and hours&quot; was <br/>\ntoo overwhelming so he&#39;d postpone things and they&#39;d get bigger and <br/>\nbigger... One hour is also a concept that DS can manage - rather <br/>\nthan Daddy being busy indefinitely into the future cleaning, it&#39;s <br/>\none hour - or two Spongebobs or a couple battles in BattleFront 2 <br/>\n(Star Wars videogame) - and he can handle that on his own (unless he <br/>\nchooses to give Daddy a hand with something, he likes sweeping for <br/>\nsome reason). The only thing that doesn&#39;t fall into that is laundry. <br/>\nWith just the 3 of us, DH prefers to do it all in one shot. So they <br/>\ntake a day and haul all the laundry downstairs to the utility area <br/>\nof the basement and he starts the wash. Then they &quot;adjourn&quot; to the <br/>\nfinished area of the basement and play videogames, pausing the game <br/>\nas needed to cycle the laundry. By the end of the day, they&#39;ve <br/>\nusually conquered the galaxy (LOL) and the laundry is all clean and <br/>\ndry and waiting to be hauled back upstairs. After dinner, we dump <br/>\nall the laundry onto our bed (guarantees it gets folded before we <br/>\nget to go to sleep) and pop in a movie and have a folding party. Or <br/>\nsometimes not (sometimes we live out of the clean baskets for a <br/>\nwhile - it helps that I work in jeans and sweatshirts or tshirts so <br/>\nthere&#39;s not a lot of ironing needed or stuff that needs special <br/>\ncare). Everything gets &#39;touched&#39; over the course of a week and we <br/>\ncan do &#39;special&#39; cleaning as needed (doing a touch up on the floors <br/>\nand bathroom if we&#39;re having guests and it&#39;s been a few days since <br/>\nthey were done).<br/>\n<br/>\nWe also dropped things that weren&#39;t important to us and aren&#39;t <br/>\nhealth or safety issues - like making beds. Beds get &#39;formally&#39; made <br/>\nwhen we change the linens each week. In between times we just tug <br/>\nthe sheets and comforters into alignment before climbing in at night.<br/>\n<br/>\nAnd, we have LOTS of bins, baskets, and shelves - that way we can <br/>\ntuck away things easily and quickly instead of trekking back and <br/>\nforth up and down stairs to put things away.<br/>\n<br/>\nTips from a friend who used to do house cleaning professionally:<br/>\n-get several &#39;maid baskets&#39; (usually can find them at the dollar <br/>\nstore) and stock each one with the gear for a specific area. For <br/>\ninstance, one basket might contain glass cleaner, tub & tile <br/>\ncleaner, all purpose cleaner for surfaces, toilet brush and <br/>\ncleanser, sponges and/or cleaning rags, paper towels. That way you <br/>\ncan just grab the basket, head to the bathroom, clean everything and <br/>\nbe done - no roaming looking for the cleansers and the sponges and <br/>\nall. The maid basket can also hold a small trash bag so that you <br/>\naren&#39;t stopping one thing to go put something in the trash - you can <br/>\nkeep on dusting and just toss trash items in the bag and move on, <br/>\ndumping it in the trash when you finish that basket&#39;s tasks. You can <br/>\neven add a laminated card listing the tasks that the basket pertains <br/>\nto if you routinely &#39;farm out&#39; tasks to the rest of the family.<br/>\n<br/>\nSomething I do is make sure each room has the appropriate gear <br/>\nnearby - for instance, I have two sets of toilet brushes and <br/>\ncleanser, two bottles of glass and surface cleaner, etc - one for <br/>\neach bathroom (full bath and half bath) that way I can just up and <br/>\nclean the room whenever without having to go get stuff. For <br/>\ninstance, I can clean the bathroom counter, back of the commode, <br/>\nsink, mirror, toilet in the time it takes to get the water pressure <br/>\nand temp right for my shower in the morning. Then DH can sweep the <br/>\nfloor and &#39;fluff&#39; the bath mat and that room is essentially done. <br/>\nThe key is having the gear right there so I don&#39;t have to go roaming <br/>\naround half awake and half dressed to get to it.<br/>\n<br/>\nThis is getting really long - hope it sparks some ideas <br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146658459","msgId":12750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODNDQzIzRDA0MzIwOC0xQzc0LTQyRUBtYmxrLXIzNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPg==","referencesHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPg=="},"prevInTopic":12634,"nextInTopic":12753,"prevInTime":12749,"nextInTime":12751,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"... From: cmcchess  I feel like I am always saying no when my desire (my philosophy) is to say yes as much as possible. NO, I won t","messageBody":"<div id=\"ygrps-yiv-1025843466\">-----Original Message-----<br/>\n From: cmcchess &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cmcchess@...\">cmcchess@...</a>&gt;<br/>\n<br/>\n<br/>\n I feel like I am always saying &quot;no&quot; when my desire (my philosophy)<br/>\n is to say &quot;yes&quot; as much as possible. NO, I won&#39;t play right now, no<br/>\n I can&#39;t read, no I HAVE to do the laundry, no I&#39;m reading to her<br/>\n right now, no.<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n  Just try rephrasing. It means the same thing, but it&#39;s positive <br/>\ninstead of negative:<br/>\n<br/>\n YES, I can play right after I read this chapter.<br/>\n  Yes, I can read; let&#39;s sit outside and read while the baby plays with <br/>\ncups and water.<br/>\n  Yes, you can help me with laundry! Let&#39;s fold outside while we watch <br/>\nthe &quot;monkey&quot; swing.<br/>\n  Yes, I&#39;m reading to her now, but I can listen to your story as soon as <br/>\nwe&#39;re finished.<br/>\n<br/>\n ALL said with BIG smiles!<br/>\n<br/>\n -=-=-=-=-=-<br/>\n<br/>\n<br/>\n I am terribly disorganized which adds to my problem. So not only do<br/>\n I feel the need to &quot;be there&quot; for my children whenever they may need<br/>\n me, but I need to get the laundry done, supper, dishes and cleaning.<br/>\n Plus ironing, etc. Also I do want some quiet time sometime, but so<br/>\n far that only means I loose sleep and am a grump.<br/>\n<br/>\n -=-=-=-=-=-=-=-<br/>\n<br/>\n Then get organized. Make lists. DO them.<br/>\n<br/>\n  I&#39;m amazed that people bitch about laundry. I do it in my sleep. You <br/>\nthrow a load in, toss the just washed one into the dryer, and fold the <br/>\njust dried load. The only one that takes more than two minutes is the <br/>\nfolding part. Where is the pain in all that?<br/>\n<br/>\n Supper? What kind of supper takes more than 30 minutes? Seriously?<br/>\n<br/>\n  Dishes? 20 minutes---even with bad pots & pans. And my 10 year old <br/>\nloves to do dishes. And there&#39;s always paper/plastic if that&#39;s a huge <br/>\nproblem.<br/>\n<br/>\n  Cleaning can be done in spurts or all at once---or a combination of <br/>\nboth. I usually pick a room a day that gets *cleaned*---and the kitchen <br/>\nis always being wiped down---that&#39;s ongoing! &lt;g&gt; The rest just get <br/>\npicked up. It&#39;s clean enough.<br/>\n<br/>\n Ironing???? People IRON???? Really?<br/>\n<br/>\n  When Cameron was eight, we had quiet time every day. We took it during <br/>\nDuncan&#39;s nap. Gave me time to regroup and clear my head. Cameron would <br/>\nplay quietly by himself. I was always---well, almost always &lt;g&gt;, calmer <br/>\nand refreshed with this little bit of down time each day. Cameron <br/>\ndidn&#39;t mind &quot;giving&quot; me this time; I was a better mom when we had quiet <br/>\ntime. He could tell.<br/>\n<br/>\n -==-=-=-=-<br/>\n<br/>\n I talked to a girl who had been unschooled (through e-mail) who said<br/>\n she was pulled out of school around 5th grade and felt that her<br/>\n mother neglected her. That was the beginning of her unschooling<br/>\n experience.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n Well, there&#39;s unschooling---and then there&#39;s neglect.<br/>\n<br/>\n  I know families who are neglectful. I don&#39;t consider them unschoolers. <br/>\nThey do though. I can&#39;t change what they think. I can do better than <br/>\nthat for my own family though. *I* know the difference!<br/>\n<br/>\n -=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n So I wonder should I not worry so much about being availabe for them<br/>\n all the time (which I&#39;m not because there are 4 of them and they<br/>\n don&#39;t exactly line up and wait their turn). Should I just do what I<br/>\n need to do, which might take all day. Should I slow down and live<br/>\n like I just have the two little ones, and spend my time getting<br/>\n dressed, getting them dressed, getting meals, cleaning up meals,<br/>\n doing some laundry in there too and a little play time. If my older<br/>\n ones were in school my days would be pretty much like that, calmer.<br/>\n<br/>\n -=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n  Well, one thing to remember is that the children get older every <br/>\nyear---every day, every minute. They will not be these ages ever again.<br/>\n<br/>\n  Two sides to that: you can rest assured that this won&#39;t last. They <br/>\nwill grow up, and you will have YEARS alone to keep your house spotless.<br/>\n<br/>\n  At the same time, you can rest assured that this won&#39;t last. They <br/>\nwon&#39;t stay little for much longer (even though it seems that way now! <br/>\n&lt;G&gt;), and you&#39;ll MISS having them snuggled up beside you, wanting you <br/>\nevery minute!<br/>\n<br/>\n  Doing what you *need* to do??? What do you really feel, deep down, <br/>\nthat you NEED to do? laundry? Then do it. Supper? Then do it.<br/>\n<br/>\n  If it&#39;s spending time with these people you have brought into the <br/>\nworld and who won&#39;t be with you all that much longer---relatively <br/>\nspeaking, then DO it.<br/>\n<br/>\n  Having the older two in school might make you days seems calmer, but <br/>\nyour late afternoons, evenings, nights, and early mornings would be <br/>\nHELL!<br/>\n<br/>\n<br/>\n -=-=-=-=-=-<br/>\n<br/>\n I have thought of getting a big calendar (huge) so we can all see<br/>\n what is going on each day of the month, easily. Then beside it a<br/>\n huge white board where I can put like a day planner for a week and<br/>\n write what I will be doing and when, and then if someone wants me to<br/>\n read to them or do a project or go fishing or ????? they<br/>\n can &quot;schedule&quot; time.<br/>\n<br/>\n -=-==-=-<br/>\n<br/>\n  Sounds like an organizational plan! But I think you need to reevaluate <br/>\nwhat&#39;s really important FIRST.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n I am torn between scheduled time and just living. I know that if I<br/>\n say I&#39;ll be cleaning or whatever at a certain time, it is not really<br/>\n gonna happen, but when will I clean?????<br/>\n<br/>\n -=-=-=--<br/>\n<br/>\n Clean-schmean!<br/>\n<br/>\n  How about getting up an hour earlier every day just to clean? Then you <br/>\nwill be ahead of the game every morning.<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n I have tried FlyLady, and SHE card file system, but if I do<br/>\n everything that needs to be done on a daily basis I feel like there<br/>\n is not much time for anything else. And if I let it pile up , I have<br/>\n one or two &quot;cleaning&quot; days where I say NO all day long! I need a<br/>\n homeschooling perspective on this<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n<br/>\n  Are your cleaning expectations too high? What really NEEDS to be done <br/>\non a daily basis?<br/>\n<br/>\n  You have four children under ten. Do you really think the house needs <br/>\nto be *that* clean?<br/>\n<br/>\n Housekeeper? Maid? Once a week? Might be worth the $$$.<br/>\n<br/>\n ~Kelly</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Cleaning and scheduling","postDate":"1146323992","msgId":12634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUzMDA2byszbjFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGUydWQ5ZytqZzNkQGVHcm91cHMuY29tPg=="},"prevInTopic":12625,"nextInTopic":12750,"prevInTime":12633,"nextInTime":12635,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"I hope this is on topic for unschooling because in a way, I think that how we see ourselves and our homes is also part of our unschooling lifestyle.  :) As I","messageBody":"<div id=\"ygrps-yiv-2113963746\">I hope this is &#39;on topic&#39; for unschooling because in a way, I think <br/>\nthat how we see ourselves and our homes is also part of our <br/>\nunschooling lifestyle.  :)<br/>\n<br/>\nAs I read a few more notes about this topic, I realized that maybe <br/>\nthere is an all or nothing thought here.  For example, Flylady has <br/>\nbeen a successful program for me, BUT... I don&#39;t do it exactly as <br/>\nshe suggests.  I modified her ideas to suit my lifestyle.  I found <br/>\nher book much more helpful than her website or her email list.  I do <br/>\nnot wear shoes all day and I do not focus on a shiny sink.  But the <br/>\nfew changes I have made were very helpful.  Here are some of the <br/>\nthings I do:<br/>\n<br/>\nLaundry - I aim for one load per day whether it is clothes or <br/>\nlinens.  I don&#39;t care if the clothes sit in the washer for a while <br/>\nbefore going to the dryer, or in the dryer for a while before being <br/>\npulled out.  Just knowing it is only ONE load to think about each <br/>\nday is easy for me to handle.<br/>\n<br/>\nCleaning zones - I divided my house into zones like she suggested, <br/>\nbut instead of focusing on one zone per week, I do one zone per <br/>\nday.  Every room in my house is getting touched every week.  I spend <br/>\nabout 30 minutes cleaning one room each day, usually with my <br/>\nchildren&#39;s help because they truly enjoy helping.  I don&#39;t have to <br/>\nworry about the other rooms too much because I know I&#39;ll get to them <br/>\nduring the week.  Now, we also do room rescues where we take about 5 <br/>\nminutes to pick up stuff but it&#39;s not a big deal.  (It also helps <br/>\nthat my youngest is 8 now, so we don&#39;t have as many toys spread <br/>\naround as we did 4 years ago.)<br/>\n<br/>\nMeal plans - We worked as a family to put together a 4-week meal <br/>\nplan.  We aren&#39;t slaves to it, meaning we can change the menu <br/>\nanytime we feel like it, but for the most part, we like knowing in <br/>\nadvance what we&#39;re having for dinner.  It&#39;s cool to look on the <br/>\nschedule, see BBQ chicken and know all I need to do is run to the <br/>\nstore for chicken.  There&#39;s no thought involved, which for me was <br/>\nthe most difficult part of preparing meals.<br/>\n<br/>\nWe did try the routines for making beds and clearing dirty clothes <br/>\nout of the rooms each morning, but that didn&#39;t last too long.  We <br/>\ndid it long enough to see if we could make it a habit but it&#39;s just <br/>\nnot us so we stopped doing it.  I do make my bed occasionally.  I <br/>\nlove my bedding and how my room looks when it&#39;s all neat and tidy.  <br/>\nWe also like clearing the kitchen before we go to bed so the <br/>\ndishwasher can run at night.  I like waking up in the mornings and <br/>\ncoming into a clean kitchen so I can head straight for my coffee <br/>\npot.  But, if we are too tired, we just push the dishes back and <br/>\nknow we&#39;ll get to them the next day.<br/>\n<br/>\nI&#39;m definitely not a cleaning expert like the Flylady, but I no <br/>\nlonger hate housework.  I do exactly what needs to be done each day <br/>\nbut it doesn&#39;t consume my thoughts.  Well... it is consuming me <br/>\ntoday, I must confess.  *lol*  I decided to move furniture around <br/>\nyesterday so everything is out of whack and I need to straighten it <br/>\nall out.  But it&#39;s not like I do this every day.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":257390633,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;earthspirit393@...&gt;","profile":"earthspirit393","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146314218","msgId":12624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMC1EQVY3MzlCMzFDOTE1OUJERTk3NUI0OEU5OUIzMEBwaHguZ2JsPg==","referencesHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPiA8ODYzQ0YyQTMtRTVEOC00RTY4LTg0QTEtMTY0MzkzQkU2RTU0QGNveC5uZXQ+"},"prevInTopic":12622,"nextInTopic":12625,"prevInTime":12623,"nextInTime":12625,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"Wow Melissa - reading your post made me feel a lot more unstressed!  hee hee.  Thanks for that! Maisha ","messageBody":"<div id=\"ygrps-yiv-2063718703\">Wow Melissa - reading your post made me feel a lot more unstressed!  hee hee.  Thanks for that!<br/>\n<br/>\n<br/>\nMaisha<br/>\nhttp://khalfanifamilyadventures.blogspot.com/&lt;http://khalfanifamilyadventures.blogspot.com/&gt;<br/>\nhttp://www.geocities.com/maitai373/EarthSpirit.html&lt;http://www.geocities.com/maitai373/EarthSpirit.html&gt;<br/>\n&quot;Don&#39;t be afraid of showing affection. Be warm and tender, thoughtful and affectionate. Mankind is more helped by sympathy than by service. Love is more than money, and a kind word will give more pleasure than a present.&quot; <br/>\n~ Jean Baptiste Lacordaire<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Melissa&lt;mailto:autismhelp@...&gt; <br/>\n  To: unschoolingbasics@yahoogroups.com&lt;mailto:unschoolingbasics@yahoogroups.com&gt; <br/>\n  Sent: Friday, April 28, 2006 8:03 PM<br/>\n  Subject: Re: [unschoolingbasics] I need ideas about how to &quot;schedule&quot; the day...<br/>\n<br/>\n<br/>\n<br/>\n  On Apr 28, 2006, at 4:39 PM, cmcchess wrote:<br/>\n  &gt;<br/>\n  &gt; I feel like I am always saying &quot;no&quot; when my desire (my philosophy)<br/>\n  &gt; is to say &quot;yes&quot; as much as possible. NO, I won&#39;t play right now, no<br/>\n  &gt; I can&#39;t read, no I HAVE to do the laundry, no I&#39;m reading to her<br/>\n  &gt; right now, no.<br/>\n  &gt;<br/>\n  You don&#39;t HAVE to do the laundry. You don&#39;t have to do dishes. And do  <br/>\n  people still iron in the land of wrinkle free cotton? ;-)  LOL<br/>\n  More specifically, you don&#39;t have to do it right then. Or you could  <br/>\n  say, How about five minutes so I can change out the laundry loads?  <br/>\n  Read a book with her after that.<br/>\n<br/>\n  &gt; I am terribly disorganized which adds to my problem. So not only do<br/>\n  &gt; I feel the need to &quot;be there&quot; for my children whenever they may need<br/>\n  &gt; me, but I need to get the laundry done, supper, dishes and cleaning.<br/>\n  &gt; Plus ironing, etc. Also I do want some quiet time sometime, but so<br/>\n  &gt; far that only means I loose sleep and am a grump.<br/>\n  I don&#39;t get a lot of sleep either, and I can get grumpy too. Taking  <br/>\n  my vitamins helps some with that (my prenatals still, as well as a  <br/>\n  complete omega complex), plus I have my quiet time in the afternoon,  <br/>\n  just five minutes, but it really helps. As for organizing, I could go  <br/>\n  on and on, but I just found a website that I really love that says  <br/>\n  everything I would say at http://cleanhome.savedme.com&lt;http://cleanhome.savedme.com/&gt; . (Ril, hope  <br/>\n  you don&#39;t mind the endorsement!)<br/>\n<br/>\n  &gt; So I wonder should I not worry so much about being availabe for them<br/>\n  &gt; all the time (which I&#39;m not because there are 4 of them and they<br/>\n  &gt; don&#39;t exactly line up and wait their turn). Should I just do what I<br/>\n  &gt; need to do, which might take all day. Should I slow down and live<br/>\n  &gt; like I just have the two little ones, and spend my time getting<br/>\n  &gt; dressed, getting them dressed, getting meals, cleaning up meals,<br/>\n  &gt; doing some laundry in there too and a little play time. If my older<br/>\n  &gt; ones were in school my days would be pretty much like that, calmer.<br/>\n<br/>\n  Let go of the expectations that you have a clean house and perfectly  <br/>\n  coiffed kids. your kids need you more than the house does. My kids  <br/>\n  dress themselves, two yo and up. The baby is the only one I dress.  <br/>\n  They don&#39;t match, but they like what they are wearing, and they are  <br/>\n  comfy. Make meals easier to prepare. Ask if they want to help. My  <br/>\n  eleven yo loves to make lunch, or start dinner. As long as I stay off  <br/>\n  his back about how he&#39;s doing it. Make cleanup easier with paper  <br/>\n  dishes or soaking. Don&#39;t fold clothes, just hang them all up or shove  <br/>\n  them into drawers. Get an extension cord for your vacuum so you can  <br/>\n  just go room to room (including tile and wood, vacuum&#39;s work  <br/>\n  amazingly well there). Vacuum while they are eating lunch. Or  <br/>\n  watching a movie. or playing a game. Be willing to stop if they need  <br/>\n  you. The vacuum won&#39;t go anywhere :-P  And they might surprise you by  <br/>\n  finishing!<br/>\n  &gt;<br/>\n  &gt; I have thought of getting a big calendar (huge) so we can all see<br/>\n  &gt; what is going on each day of the month, easily. Then beside it a<br/>\n  &gt; huge white board where I can put like a day planner for a week and<br/>\n  &gt; write what I will be doing and when, and then if someone wants me to<br/>\n  &gt; read to them or do a project or go fishing or ????? they<br/>\n  &gt; can &quot;schedule&quot; time.<br/>\n  Every family should have a big calender for events that are going on  <br/>\n  outside the home. I wouldn&#39;t put stuff like &#39;Read to dd&#39; on it  <br/>\n  though, because what I&#39;ve seen in my house is that once you start  <br/>\n  that, there is no end. People feel legislated, they feel that they  <br/>\n  only time they will get is on the calender, or they will not want  <br/>\n  time with you outside of the calender. Put on outside activities. If  <br/>\n  someone wants to go fishing, that&#39;s definitely an outside project.  <br/>\n  Write it down. See who all wants to go. Take them when someone (dh?)  <br/>\n  can watch the others. Or make it fun for everyone by providing for  <br/>\n  kids who don&#39;t want to fish (Take books for the reader, take  <br/>\n  notebooks for the artist, take a bug kit for the explorer)<br/>\n  &gt;<br/>\n  &gt; I am torn between scheduled time and just living. I know that if I<br/>\n  &gt; say I&#39;ll be cleaning or whatever at a certain time, it is not really<br/>\n  &gt; gonna happen, but when will I clean?????<br/>\n<br/>\n  You can clean forever. If you say, I&#39;ll do this when I&#39;m done  <br/>\n  cleaning, there will always be more to do. Trust me. i do that too  <br/>\n  much. There are times when I drop the cleaning supplies where they  <br/>\n  are at and walk away, or I will continue to say &quot;ONE MORE THING&quot;.  <br/>\n  Cat&#39;s in the cradle says it all, right?<br/>\n  &gt;<br/>\n  &gt; I have tried FlyLady, and SHE card file system, but if I do<br/>\n  &gt; everything that needs to be done on a daily basis I feel like there<br/>\n  &gt; is not much time for anything else. And if I let it pile up , I have<br/>\n  &gt; one or two &quot;cleaning&quot; days where I say NO all day long!<br/>\n<br/>\n  Clean a little at a time. Keep a spray bottle under each bathroom  <br/>\n  sink with vinegar/water solution, with some paper towels. When you  <br/>\n  go, spray the whole bathroom down (or when you&#39;re bathing the kids,  <br/>\n  that&#39;s how I do it. Plus vinegar isn&#39;t toxic and is definitely  <br/>\n  multipurpose. WHen they get out of the tub, spray the floor and dry  <br/>\n  it with their bath towels. Take a basket room to room when you do  <br/>\n  bedtime rituals and gather laundry then. Forget about making beds, if  <br/>\n  they don&#39;t care, why should you? Get lots of bins so you can just  <br/>\n  throw stuff in. Seriously check out the URL I already posted.<br/>\n<br/>\n  &gt; Sorry about all the babble, probably we all feel this way, right?<br/>\n  &gt; Anyway, any help would be great!!<br/>\n<br/>\n  I have felt that way. I&#39;m choosing now not to. KWIM? There has to be  <br/>\n  a point where you make a choice to let go of the issues and just be  <br/>\n  with your kids. They won&#39;t always be small, and maybe you won&#39;t  <br/>\n  always have them. Don&#39;t live your life in a way you would regret  <br/>\n  later on! Saying this with the utmost respect and love. i have seven  <br/>\n  kids ages eleven to five months. I know it&#39;s hard. But you really do  <br/>\n  have to make choices and decide what&#39;s important. Live for your kids.  <br/>\n  Find naturally quiet times of the day where you can fit in cleaning.  <br/>\n  Ours is almost always first thing in the morning, when everyone is  <br/>\n  still groggy or independent, and that&#39;s when I gather laundry and get  <br/>\n  it started. Then we do our things, usually playing video games, or  <br/>\n  reading, or playing whatever. I play for a while with each one, fully  <br/>\n  focussed on them, then I ask another one if I can play with them. If  <br/>\n  someone comes up, they are welcome to play too, or sit patiently  <br/>\n  waiting  on my lap, or sometimes i&#39;ll ask the first child if they  <br/>\n  mind if I do such and so with this other person. Or if they are  <br/>\n  interested in doing x, y, or z (based on what they&#39;ve been interested  <br/>\n  in lately) I usually make lunch with one or two hanging around in the  <br/>\n  kitchen helping or keeping me company. I might ask one to check  <br/>\n  laundry loads, or tidy the game room while I&#39;m cooking. While they  <br/>\n  are eating, I sit and talk a while, then get up and vacuum and do  <br/>\n  dishes quickly. WHen my husband gets home, the kids are all over him  <br/>\n  so it&#39;s a great time to start dinner (if I haven&#39;t done one of our  <br/>\n  crockpots), or do whatever I didn&#39;t have a chance to do. and then at  <br/>\n  nighttime when the little ones are in bed, i tidy up their rooms,  <br/>\n  gather whatever laundry we missed, stopping to talk to the older  <br/>\n  ones, play a card game or read with them.<br/>\n  Melissa<br/>\n<br/>\n<br/>\n  SPONSORED LINKS Secondary school education&lt;http://groups.yahoo.com/gads?t=ms&k=Secondary+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=ZmtJ9eV8jDgLVf_rQitp3g&gt;  Graduate school education&lt;http://groups.yahoo.com/gads?t=ms&k=Graduate+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=_ar44lA2aVf7qUVJT2dfbA&gt;  Home school education&lt;http://groups.yahoo.com/gads?t=ms&k=Home+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=igfV0UPAcfSvC6KUmUYY6w&gt;  <br/>\n        Graduate school education online&lt;http://groups.yahoo.com/gads?t=ms&k=Graduate+school+education+online&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=OHt1qK6J19R35_4ff-oJHg&gt;  High school education&lt;http://groups.yahoo.com/gads?t=ms&k=High+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=BV3EOkp5uIRJ0eqRAZQNcw&gt;  Chicago school education&lt;http://groups.yahoo.com/gads?t=ms&k=Chicago+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=pesFSb8HMcPS2_oNEoEwuw&gt;  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    a..  Visit your group &quot;unschoolingbasics&lt;http://groups.yahoo.com/group/unschoolingbasics&gt;&quot; on the web.<br/>\n      <br/>\n    b..  To unsubscribe from this group, send an email to:<br/>\n     unschoolingbasics-unsubscribe@yahoogroups.com&lt;mailto:unschoolingbasics-unsubscribe@yahoogroups.com?subject=Unsubscribe&gt;<br/>\n      <br/>\n    c..  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service&lt;http://docs.yahoo.com/info/terms/&gt;. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":257390633,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;earthspirit393@...&gt;","profile":"earthspirit393","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146314097","msgId":12625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMC1EQVYxNkEwN0JCNkNBMUVGRjdBMUMzMzAyOTlCMzBAcGh4LmdibD4=","referencesHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPg=="},"prevInTopic":12624,"nextInTopic":12634,"prevInTime":12624,"nextInTime":12626,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"Hey Cathy - I ll be reading the responses with interest.  Your house sounds JUST LIKE mine - except my kids are 16, 7, 6, 3, and 1.  And the 16 year old needs","messageBody":"<div id=\"ygrps-yiv-670217092\">Hey Cathy - I&#39;ll be reading the responses with interest.  Your house sounds JUST LIKE mine - except my kids are 16, 7, 6, 3, and 1.  And the 16 year old needs my time as much as the one year old does!  LOL<br/>\n<br/>\nMaisha<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://khalfanifamilyadventures.blogspot.com/&lt;http://khalfanifamilyadventures.blogspot.com/\">http://khalfanifamilyadventures.blogspot.com/&lt;http://khalfanifamilyadventures.blogspot.com/</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/maitai373/EarthSpirit.html&lt;http://www.geocities.com/maitai373/EarthSpirit.html\">http://www.geocities.com/maitai373/EarthSpirit.html&lt;http://www.geocities.com/maitai373/EarthSpirit.html</a>&gt;<br/>\n&quot;Don&#39;t be afraid of showing affection. Be warm and tender, thoughtful and affectionate. Mankind is more helped by sympathy than by service. Love is more than money, and a kind word will give more pleasure than a present.&quot; <br/>\n~ Jean Baptiste Lacordaire<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: cmcchess&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cmcchess@...\">cmcchess@...</a>&gt; <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; <br/>\n  Sent: Friday, April 28, 2006 5:39 PM<br/>\n  Subject: [unschoolingbasics] I need ideas about how to &quot;schedule&quot; the day...<br/>\n<br/>\n<br/>\n  I am feeling a bit overwhelmed. I have 4 children, ages 2 to 10. I <br/>\n  feel like I should be able to do everything they want to do when <br/>\n  they want to do it. Or at least be able to set up an appointment to <br/>\n  do it with them at a later time. <br/>\n<br/>\n  I need both philosophical ideas and practical ideas here. I&#39;m gonna <br/>\n  babble a lot and send it. Usually I babble in my messages then erase <br/>\n  it all and ask one simple question, but I&#39;ll send it this time :)<br/>\n<br/>\n  If the 2 yo sees me she want&#39;s me to play, which to her means watch <br/>\n  her play.<br/>\n  The 4 yo is pretty independent, but really likes me to read to her.<br/>\n  The 6 yo wants to do stuff outside like fishing or watching him <br/>\n  do &quot;circus acts&quot; on the swings. <br/>\n  And the 10 yo wants to talk and talk and talk, saying the same thing <br/>\n  20 times in slightly different ways.<br/>\n<br/>\n  I feel like I am always saying &quot;no&quot; when my desire (my philosophy) <br/>\n  is to say &quot;yes&quot; as much as possible. NO, I won&#39;t play right now, no <br/>\n  I can&#39;t read, no I HAVE to do the laundry, no I&#39;m reading to her <br/>\n  right now, no.<br/>\n<br/>\n  I am terribly disorganized which adds to my problem. So not only do <br/>\n  I feel the need to &quot;be there&quot; for my children whenever they may need <br/>\n  me, but I need to get the laundry done, supper, dishes and cleaning. <br/>\n  Plus ironing, etc. Also I do want some quiet time sometime, but so <br/>\n  far that only means I loose sleep and am a grump. <br/>\n<br/>\n  I talked to a girl who had been unschooled (through e-mail) who said <br/>\n  she was pulled out of school around 5th grade and felt that her <br/>\n  mother neglected her. That was the beginning of her unschooling <br/>\n  experience. <br/>\n<br/>\n  So I wonder should I not worry so much about being availabe for them <br/>\n  all the time (which I&#39;m not because there are 4 of them and they <br/>\n  don&#39;t exactly line up and wait their turn). Should I just do what I <br/>\n  need to do, which might take all day. Should I slow down and live <br/>\n  like I just have the two little ones, and spend my time getting <br/>\n  dressed, getting them dressed, getting meals, cleaning up meals, <br/>\n  doing some laundry in there too and a little play time. If my older <br/>\n  ones were in school my days would be pretty much like that, calmer. <br/>\n<br/>\n  I have thought of getting a big calendar (huge) so we can all see <br/>\n  what is going on each day of the month, easily. Then beside it a <br/>\n  huge white board where I can put like a day planner for a week and <br/>\n  write what I will be doing and when, and then if someone wants me to <br/>\n  read to them or do a project or go fishing or ????? they <br/>\n  can &quot;schedule&quot; time.  <br/>\n<br/>\n  I am torn between scheduled time and just living. I know that if I <br/>\n  say I&#39;ll be cleaning or whatever at a certain time, it is not really <br/>\n  gonna happen, but when will I clean?????<br/>\n<br/>\n  I have tried FlyLady, and SHE card file system, but if I do <br/>\n  everything that needs to be done on a daily basis I feel like there <br/>\n  is not much time for anything else. And if I let it pile up , I have <br/>\n  one or two &quot;cleaning&quot; days where I say NO all day long! I need a <br/>\n  homeschooling perspective on this, not a perspective from someone <br/>\n  who&#39;s kids go off all day long and they great them with a smile at <br/>\n  the end of the day with a nice clean house, and a willingness to <br/>\n  dedicate the evening to their kids. (no I am not trying to be mean <br/>\n  to school families, It&#39;s just that all the advice I see, read or <br/>\n  hear is from them. )<br/>\n<br/>\n  Sorry about all the babble, probably we all feel this way, right?  <br/>\n  Anyway, any help would be great!!<br/>\n<br/>\n  Thanks,<br/>\n  Cathy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS Secondary school education&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Secondary+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=ZmtJ9eV8jDgLVf_rQitp3g\">http://groups.yahoo.com/gads?t=ms&k=Secondary+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=ZmtJ9eV8jDgLVf_rQitp3g</a>&gt;  Graduate school education&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Graduate+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=_ar44lA2aVf7qUVJT2dfbA\">http://groups.yahoo.com/gads?t=ms&k=Graduate+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=_ar44lA2aVf7qUVJT2dfbA</a>&gt;  Home school education&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Home+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=igfV0UPAcfSvC6KUmUYY6w\">http://groups.yahoo.com/gads?t=ms&k=Home+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=igfV0UPAcfSvC6KUmUYY6w</a>&gt;  <br/>\n        Graduate school education online&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Graduate+school+education+online&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=OHt1qK6J19R35_4ff-oJHg\">http://groups.yahoo.com/gads?t=ms&k=Graduate+school+education+online&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=OHt1qK6J19R35_4ff-oJHg</a>&gt;  High school education&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=High+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=BV3EOkp5uIRJ0eqRAZQNcw\">http://groups.yahoo.com/gads?t=ms&k=High+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=BV3EOkp5uIRJ0eqRAZQNcw</a>&gt;  Chicago school education&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Chicago+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=pesFSb8HMcPS2_oNEoEwuw\">http://groups.yahoo.com/gads?t=ms&k=Chicago+school+education&w1=Secondary+school+education&w2=Graduate+school+education&w3=Home+school+education&w4=Graduate+school+education+online&w5=High+school+education&w6=Chicago+school+education&c=6&s=185&.sig=pesFSb8HMcPS2_oNEoEwuw</a>&gt;  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    a..  Visit your group &quot;unschoolingbasics&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics\">http://groups.yahoo.com/group/unschoolingbasics</a>&gt;&quot; on the web.<br/>\n      <br/>\n    b..  To unsubscribe from this group, send an email to:<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n      <br/>\n    c..  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146302028","msgId":12622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMTIzRkQ1LTI3NEMtNDhBOS05NDlDLUI3QUZCMkI4NUVDN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGUydWN2dStyNXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGUydWN2dStyNXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":12612,"nextInTopic":12624,"prevInTime":12621,"nextInTime":12623,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"... You have to take shirts out of the drier as soon as it s done (on permanent press setting) and hang them up to keep them from wrinkling. At least that s","messageBody":"<div id=\"ygrps-yiv-150233223\">On Apr 28, 2006, at 8:45 PM, cmcchess wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You know, I tried to not iron ;) it didn&#39;t work.<br/>\n<br/>\n </span></blockquote>You have to take shirts out of the drier as soon as it&#39;s done (on  <br/>\npermanent press setting) and hang them up to keep them from  <br/>\nwrinkling. At least that&#39;s what my husband does! ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265647787,"authorName":"jnjstau@hughes.net","from":"&quot;jnjstau@...&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146272142","msgId":12612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OTQzMTg4LjExNDYyNzIxNDIxNDYuSmF2YU1haWwuP0BmaDAyOC5kaWEuY3AubmV0Pg=="},"prevInTopic":12611,"nextInTopic":12622,"prevInTime":12611,"nextInTime":12613,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"I used to not iron my husbands clothes...or anybody else s for that matter.  Dh would get up at 5am and iron the front and sleeves of a shirt. Then one week,","messageBody":"<div id=\"ygrps-yiv-1975608393\">I used to not iron my husbands clothes...or anybody else&#39;s for that <br/>\nmatter.  Dh would get up at 5am and iron the front and sleeves of a <br/>\nshirt.<br/>\n<br/>\nThen one week, we were having construction done to the house and I <br/>\nwanted to get all the clothing out of the laundry room so they wouldn&#39;t <br/>\nget dusty.  I just went ahead and ironed dh&#39;s shirts.  He was so <br/>\ntouched that I did that for him.  It really seemed to mean a lot.<br/>\n<br/>\nNow I do it every week.  I still don&#39;t love it but I remember his face <br/>\nwhen he saw that I did them the first time.  It takes me 20 minutes and <br/>\nit is truly a gift to him.<br/>\n<br/>\nOnce I got into it, I remember coming home from school as a child, <br/>\ngetting a snack and watching &quot;Dark Shadows&quot; while my mom ironed.  I <br/>\nalways enjoyed the smell of the starch.<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146271856","msgId":12611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUydWQ5ZytqZzNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPg=="},"prevInTopic":12609,"nextInTopic":12612,"prevInTime":12610,"nextInTime":12612,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"Hi Cathy, I m not sure a scheduled day will help you any.  I mean, you can do broad schedules, i.e. plan on getting the majority of housework done in the","messageBody":"<div id=\"ygrps-yiv-1858923699\">Hi Cathy,<br/>\n<br/>\nI&#39;m not sure a scheduled day will help you any.  I mean, you can do <br/>\nbroad schedules, i.e. plan on getting the majority of housework done <br/>\nin the mornings to have the afternoons free or vice versa.  But if <br/>\nyou&#39;re operating on a strict schedule where you&#39;re cleaning the <br/>\nhouse from 10:00am to 10:30am, I would think that would put even <br/>\nmore pressure on you because if you don&#39;t get the &#39;job&#39; done, you&#39;ll <br/>\nfeel behind.  <br/>\n<br/>\nI&#39;m surprised Flylady didn&#39;t help.  I found that her plan freed up <br/>\nmy day.  Before my flylady routines, I was just sort of skimming the <br/>\nentire house every day, fighting fires so to speak.  With her plan, <br/>\nI knew that I&#39;d get to everything within the week so it was okay if <br/>\nI didn&#39;t do everything every day.  I don&#39;t follow those plans <br/>\nanymore.  We downsized to a smaller house and things are so much <br/>\nbetter now!  <br/>\n<br/>\nI am curious if your children enjoy helping out around the house?  <br/>\nMy kids love helping with the housework but I have never had <br/>\nmandatory chores.  The kids rarely refuse to help when I ask but <br/>\nthey know that I won&#39;t ever get mad if they choose to say no.  There <br/>\nare some things that they do not do, but they are volunteering for <br/>\nmore stuff as they get older.  All 3 of my kids love to do laundry - <br/>\ngo figure!  Of course, I mean putting clothes in the washer and then <br/>\nflipping to the dryer.  When we pull clothes out, we yell LAUNDRY <br/>\nand everyone comes and folds their own clothes.  When we first <br/>\nstarted that, I had to consciously keep myself from interfering.  <br/>\nWhy does it matter if they fold shirts differently than me??  It&#39;s <br/>\ntheir clothes.  Then they put them away and they always know where <br/>\neverything is.  But because we do it this way, we&#39;re all doing this <br/>\nat the same time and we talk while we do it.  So it&#39;s really no big <br/>\ndeal.  Occasionally someone will be busy with something and get <br/>\ntheir laundry later, and sometimes one of us might fold and put away <br/>\nclothes for that person.  I have friends who prefer their children <br/>\nto not help because the kids can never do it as well as the parents, <br/>\nbut I don&#39;t feel that way at all!  <br/>\n<br/>\nSometimes, I plan a big cleaning like the living room, dining room <br/>\nand kitchen one right after the other.  The kids always jump up to <br/>\nhelp.  We love to turn on music (Johnny B Good is great!) and dance <br/>\naround while we dust, vacuum, wipe windows, counters and <br/>\nappliances.  Afterwards we spend time together reading or playing a <br/>\nboard game.<br/>\n<br/>\nI&#39;m sure it must be challenging with 4 children.  I&#39;m only with 2, <br/>\nages 8 and 9 all day, and my 13 yr. old comes home every weekend.  <br/>\nShe&#39;s tons of fun though and loves to do things with us.  That <br/>\nfreaked her stepmom out years ago when she found out my daughter <br/>\nwillingly does housework without my asking.  But I told her the same <br/>\nthing.... that it&#39;s just a part of living and shouldn&#39;t be <br/>\nconsidered chores or a job.  It&#39;s just stuff we do.<br/>\n<br/>\nAnyway, I hope some of this helped you a little.<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":75461233,"authorName":"cmcchess","from":"&quot;cmcchess&quot; &lt;cmcchess@...&gt;","profile":"cmcchess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146271550","msgId":12609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUydWN2dStyNXB0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2RTFBRTM3LTEwREQtNDA3Ni05MzQwLUYxMkVEMTY1RjMwOEBjb3gubmV0Pg=="},"prevInTopic":12607,"nextInTopic":12611,"prevInTime":12608,"nextInTime":12610,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"You know, I tried to not iron ;) it didn t work. My dh ironed all the clothes in the basket one night and said that he s never doing that again! He has ironed","messageBody":"<div id=\"ygrps-yiv-1484633509\">You know, I tried to not iron ;) it didn&#39;t work. My dh ironed all <br/>\nthe clothes in the basket one night and said that he&#39;s never doing <br/>\nthat again! He has ironed since, but the last time it looked as <br/>\nthough he didn&#39;t!  That&#39;s something that I can&#39;t let go, he probably <br/>\nwouldn&#39;t iron, but I wonder if it will affect his ability to get <br/>\nsales, thus the income that we depend on??<br/>\n<br/>\nI hate to iron too. No matter how hard I used to try, the clothes <br/>\nalways looked like I didn&#39;t do anything to them even though I stood <br/>\nthere for 10 minutes trying to iron. But now I use spray starch and <br/>\nit is great! They actually look ironed, but I still don&#39;t like to do <br/>\nit!<br/>\n<br/>\nMy Mom used to wonder how I could vacuum the room with the lights <br/>\noff! But I think my voices are more because my husbands Mom has such <br/>\na clean house all the time. But it&#39;s just her and her husband, so <br/>\nwhy should I care????<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Melissa &lt;autismhelp@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Ooh. PMS. Ya know, you&#39;d think after so many years I&#39;d know. But  <br/>\n&gt; still, every month I start and think &quot;Oh. That&#39;s why I&#39;ve been <br/>\n </span></blockquote>such a  <br/>\n<blockquote><span title=\"ireply\"> &gt; gripe&quot;. Sigh.<br/>\n&gt; <br/>\n&gt; anyway, now you make me feel bad. Does everyone iron their <br/>\n </span></blockquote>husbands  <br/>\n<blockquote><span title=\"ireply\"> &gt; work clothes? all my IRL friends do, and I feel horrible because <br/>\n </span></blockquote>my  <br/>\n<blockquote><span title=\"ireply\"> &gt; husband has to iron his own. I told him either iron them himself <br/>\n </span></blockquote>or  <br/>\n<blockquote><span title=\"ireply\"> &gt; plan on seeing a bill for taking them to be pressed lol!I hate to  <br/>\n&gt; iron, probably because my mom always made me iron her clothes. <br/>\n </span></blockquote>Plus  <br/>\n<blockquote><span title=\"ireply\"> &gt; ironing gives me the heeby jeebies. i cannot stand the feel of <br/>\n </span></blockquote>too  <br/>\n<blockquote><span title=\"ireply\"> &gt; much fabric, makes my hands dry and tingly, then on to nausea and  <br/>\n&gt; migraines. Sounds weird, but shuffling bare feet across carpet <br/>\n </span></blockquote>does  <br/>\n<blockquote><span title=\"ireply\"> &gt; the same thing. ick.<br/>\n&gt; <br/>\n&gt; It&#39;s hard to let go. i know I have so much trouble because my mom <br/>\n </span></blockquote>was  <br/>\n<blockquote><span title=\"ireply\"> &gt; always beating me over the head with &#39;what will people think if <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; house is dirty?&#39; Dang inner voices. They drag you down.<br/>\n&gt; Melissa<br/>\n&gt; Mom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), <br/>\n </span></blockquote>Dan  <br/>\n<blockquote><span title=\"qreply\"> &gt; (2), and Avari Rose<br/>\n&gt; <br/>\n&gt; share our lives at<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Apr 28, 2006, at 7:18 PM, cmcchess wrote:<br/>\n&gt; <br/>\n&gt; &gt; Thank-you Melissa!<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have to say I am PMS&#39;ing today, just an excuse. Once  a month I<br/>\n&gt; &gt; get a lot less &quot;relaxed&quot; about things! And need to find<br/>\n&gt; &gt; the &quot;answers&quot;. And I really needed that encouragement from you!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146271286","msgId":12607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2RTFBRTM3LTEwREQtNDA3Ni05MzQwLUYxMkVEMTY1RjMwOEBjb3gubmV0Pg==","inReplyToHeader":"PGUydWJkaithcXA2QGVHcm91cHMuY29tPg==","referencesHeader":"PGUydWJkaithcXA2QGVHcm91cHMuY29tPg=="},"prevInTopic":12604,"nextInTopic":12609,"prevInTime":12606,"nextInTime":12608,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"Ooh. PMS. Ya know, you d think after so many years I d know. But still, every month I start and think Oh. That s why I ve been such a gripe . Sigh. anyway,","messageBody":"<div id=\"ygrps-yiv-1375244683\">Ooh. PMS. Ya know, you&#39;d think after so many years I&#39;d know. But  <br/>\nstill, every month I start and think &quot;Oh. That&#39;s why I&#39;ve been such a  <br/>\ngripe&quot;. Sigh.<br/>\n<br/>\nanyway, now you make me feel bad. Does everyone iron their husbands  <br/>\nwork clothes? all my IRL friends do, and I feel horrible because my  <br/>\nhusband has to iron his own. I told him either iron them himself or  <br/>\nplan on seeing a bill for taking them to be pressed lol!I hate to  <br/>\niron, probably because my mom always made me iron her clothes. Plus  <br/>\nironing gives me the heeby jeebies. i cannot stand the feel of too  <br/>\nmuch fabric, makes my hands dry and tingly, then on to nausea and  <br/>\nmigraines. Sounds weird, but shuffling bare feet across carpet does  <br/>\nthe same thing. ick.<br/>\n<br/>\nIt&#39;s hard to let go. i know I have so much trouble because my mom was  <br/>\nalways beating me over the head with &#39;what will people think if the  <br/>\nhouse is dirty?&#39; Dang inner voices. They drag you down.<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 28, 2006, at 7:18 PM, cmcchess wrote:<br/>\n<br/>\n&gt; Thank-you Melissa!<br/>\n&gt;<br/>\n&gt; I have to say I am PMS&#39;ing today, just an excuse. Once  a month I<br/>\n&gt; get a lot less &quot;relaxed&quot; about things! And need to find<br/>\n&gt; the &quot;answers&quot;. And I really needed that encouragement from you! </span></blockquote></div>","specialLinks":[]},{"userId":75461233,"authorName":"cmcchess","from":"&quot;cmcchess&quot; &lt;cmcchess@...&gt;","profile":"cmcchess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146269939","msgId":12604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUydWJkaithcXA2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg2M0NGMkEzLUU1RDgtNEU2OC04NEExLTE2NDM5M0JFNkU1NEBjb3gubmV0Pg=="},"prevInTopic":12603,"nextInTopic":12607,"prevInTime":12603,"nextInTime":12605,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"Thank-you Melissa! I have to say I am PMS ing today, just an excuse. Once  a month I get a lot less relaxed about things! And need to find the answers . And","messageBody":"<div id=\"ygrps-yiv-2098325449\">Thank-you Melissa!<br/>\n<br/>\nI have to say I am PMS&#39;ing today, just an excuse. Once  a month I <br/>\nget a lot less &quot;relaxed&quot; about things! And need to find <br/>\nthe &quot;answers&quot;. And I really needed that encouragement from you!<br/>\n<br/>\n<br/>\nI will definately not schedule daily time with each kid, I know what <br/>\nyou mean about them feeling legislated about it then. <br/>\n<br/>\nOh, and yes I do have to iron :) my husband wears a suit and I don&#39;t <br/>\ntake things out of the dryer right away and hang them. Even when I <br/>\ndid that my Dad called and asked who ironed my dh&#39;s clothes! We do <br/>\nhave some that are wrinkle free, but not all. But it does seem <br/>\npointless when I go to his work and see him after he has sat there <br/>\nall day and is worse looking than he would have been just getting <br/>\nhis clothes out of the dryer and going! :)<br/>\n<br/>\nMy house is not organized, my kids are not clean and some times I&#39;m <br/>\nok with that, but others, like today I&#39;m totally not. <br/>\n<br/>\nI beat myself up about it a lot. And I don&#39;t know why, lots of <br/>\npeople live this way, whether they homeschool or not, and they don&#39;t <br/>\nseem to care. <br/>\n<br/>\nI&#39;ll check out that website. Thanks again,<br/>\nCathy<br/>\n<br/>\n-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Melissa &lt;autismhelp@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 28, 2006, at 4:39 PM, cmcchess wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I feel like I am always saying &quot;no&quot; when my desire (my <br/>\n </span></blockquote>philosophy)<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; is to say &quot;yes&quot; as much as possible. NO, I won&#39;t play right now, <br/>\n </span></blockquote>no<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I can&#39;t read, no I HAVE to do the laundry, no I&#39;m reading to her<br/>\n&gt; &gt; right now, no.<br/>\n&gt; &gt;<br/>\n&gt; You don&#39;t HAVE to do the laundry. You don&#39;t have to do dishes. And <br/>\n </span></blockquote>do  <br/>\n<blockquote><span title=\"ireply\"> &gt; people still iron in the land of wrinkle free cotton? ;-)  LOL<br/>\n&gt; More specifically, you don&#39;t have to do it right then. Or you <br/>\n </span></blockquote>could  <br/>\n<blockquote><span title=\"ireply\"> &gt; say, How about five minutes so I can change out the laundry <br/>\n </span></blockquote>loads?  <br/>\n<blockquote><span title=\"ireply\"> &gt; Read a book with her after that.<br/>\n&gt; <br/>\n&gt; &gt; I am terribly disorganized which adds to my problem. So not only <br/>\n </span></blockquote>do<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I feel the need to &quot;be there&quot; for my children whenever they may <br/>\n </span></blockquote>need<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; me, but I need to get the laundry done, supper, dishes and <br/>\n </span></blockquote>cleaning.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Plus ironing, etc. Also I do want some quiet time sometime, but <br/>\n </span></blockquote>so<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; far that only means I loose sleep and am a grump.<br/>\n&gt; I don&#39;t get a lot of sleep either, and I can get grumpy too. <br/>\n </span></blockquote>Taking  <br/>\n<blockquote><span title=\"ireply\"> &gt; my vitamins helps some with that (my prenatals still, as well as <br/>\n </span></blockquote>a  <br/>\n<blockquote><span title=\"ireply\"> &gt; complete omega complex), plus I have my quiet time in the <br/>\n </span></blockquote>afternoon,  <br/>\n<blockquote><span title=\"ireply\"> &gt; just five minutes, but it really helps. As for organizing, I could <br/>\n </span></blockquote>go  <br/>\n<blockquote><span title=\"ireply\"> &gt; on and on, but I just found a website that I really love that <br/>\n </span></blockquote>says  <br/>\n<blockquote><span title=\"ireply\"> &gt; everything I would say at <a rel=\"nofollow\" target=\"_blank\" href=\"http://cleanhome.savedme.com\">http://cleanhome.savedme.com</a> . (Ril, <br/>\n </span></blockquote>hope  <br/>\n<blockquote><span title=\"ireply\"> &gt; you don&#39;t mind the endorsement!)<br/>\n&gt; <br/>\n&gt; &gt; So I wonder should I not worry so much about being availabe for <br/>\n </span></blockquote>them<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; all the time (which I&#39;m not because there are 4 of them and they<br/>\n&gt; &gt; don&#39;t exactly line up and wait their turn). Should I just do <br/>\n </span></blockquote>what I<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; need to do, which might take all day. Should I slow down and live<br/>\n&gt; &gt; like I just have the two little ones, and spend my time getting<br/>\n&gt; &gt; dressed, getting them dressed, getting meals, cleaning up meals,<br/>\n&gt; &gt; doing some laundry in there too and a little play time. If my <br/>\n </span></blockquote>older<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; ones were in school my days would be pretty much like that, <br/>\n </span></blockquote>calmer.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Let go of the expectations that you have a clean house and <br/>\n </span></blockquote>perfectly  <br/>\n<blockquote><span title=\"ireply\"> &gt; coiffed kids. your kids need you more than the house does. My <br/>\n </span></blockquote>kids  <br/>\n<blockquote><span title=\"ireply\"> &gt; dress themselves, two yo and up. The baby is the only one I <br/>\n </span></blockquote>dress.  <br/>\n<blockquote><span title=\"ireply\"> &gt; They don&#39;t match, but they like what they are wearing, and they <br/>\n </span></blockquote>are  <br/>\n<blockquote><span title=\"ireply\"> &gt; comfy. Make meals easier to prepare. Ask if they want to help. My  <br/>\n&gt; eleven yo loves to make lunch, or start dinner. As long as I stay <br/>\n </span></blockquote>off  <br/>\n<blockquote><span title=\"ireply\"> &gt; his back about how he&#39;s doing it. Make cleanup easier with paper  <br/>\n&gt; dishes or soaking. Don&#39;t fold clothes, just hang them all up or <br/>\n </span></blockquote>shove  <br/>\n<blockquote><span title=\"ireply\"> &gt; them into drawers. Get an extension cord for your vacuum so you <br/>\n </span></blockquote>can  <br/>\n<blockquote><span title=\"ireply\"> &gt; just go room to room (including tile and wood, vacuum&#39;s work  <br/>\n&gt; amazingly well there). Vacuum while they are eating lunch. Or  <br/>\n&gt; watching a movie. or playing a game. Be willing to stop if they <br/>\n </span></blockquote>need  <br/>\n<blockquote><span title=\"ireply\"> &gt; you. The vacuum won&#39;t go anywhere :-P  And they might surprise you <br/>\n </span></blockquote>by  <br/>\n<blockquote><span title=\"ireply\"> &gt; finishing!<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have thought of getting a big calendar (huge) so we can all see<br/>\n&gt; &gt; what is going on each day of the month, easily. Then beside it a<br/>\n&gt; &gt; huge white board where I can put like a day planner for a week <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; write what I will be doing and when, and then if someone wants <br/>\n </span></blockquote>me to<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; read to them or do a project or go fishing or ????? they<br/>\n&gt; &gt; can &quot;schedule&quot; time.<br/>\n&gt; Every family should have a big calender for events that are going <br/>\n </span></blockquote>on  <br/>\n<blockquote><span title=\"ireply\"> &gt; outside the home. I wouldn&#39;t put stuff like &#39;Read to dd&#39; on it  <br/>\n&gt; though, because what I&#39;ve seen in my house is that once you start  <br/>\n&gt; that, there is no end. People feel legislated, they feel that <br/>\n </span></blockquote>they  <br/>\n<blockquote><span title=\"ireply\"> &gt; only time they will get is on the calender, or they will not want  <br/>\n&gt; time with you outside of the calender. Put on outside activities. <br/>\n </span></blockquote>If  <br/>\n<blockquote><span title=\"ireply\"> &gt; someone wants to go fishing, that&#39;s definitely an outside <br/>\n </span></blockquote>project.  <br/>\n<blockquote><span title=\"ireply\"> &gt; Write it down. See who all wants to go. Take them when someone <br/>\n </span></blockquote>(dh?)  <br/>\n<blockquote><span title=\"ireply\"> &gt; can watch the others. Or make it fun for everyone by providing <br/>\n </span></blockquote>for  <br/>\n<blockquote><span title=\"ireply\"> &gt; kids who don&#39;t want to fish (Take books for the reader, take  <br/>\n&gt; notebooks for the artist, take a bug kit for the explorer)<br/>\n&gt; &gt;<br/>\n&gt; &gt; I am torn between scheduled time and just living. I know that if <br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; say I&#39;ll be cleaning or whatever at a certain time, it is not <br/>\n </span></blockquote>really<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; gonna happen, but when will I clean?????<br/>\n&gt; <br/>\n&gt; You can clean forever. If you say, I&#39;ll do this when I&#39;m done  <br/>\n&gt; cleaning, there will always be more to do. Trust me. i do that <br/>\n </span></blockquote>too  <br/>\n<blockquote><span title=\"ireply\"> &gt; much. There are times when I drop the cleaning supplies where <br/>\n </span></blockquote>they  <br/>\n<blockquote><span title=\"ireply\"> &gt; are at and walk away, or I will continue to say &quot;ONE MORE THING&quot;.  <br/>\n&gt; Cat&#39;s in the cradle says it all, right?<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have tried FlyLady, and SHE card file system, but if I do<br/>\n&gt; &gt; everything that needs to be done on a daily basis I feel like <br/>\n </span></blockquote>there<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; is not much time for anything else. And if I let it pile up , I <br/>\n </span></blockquote>have<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; one or two &quot;cleaning&quot; days where I say NO all day long!<br/>\n&gt; <br/>\n&gt; Clean a little at a time. Keep a spray bottle under each bathroom  <br/>\n&gt; sink with vinegar/water solution, with some paper towels. When <br/>\n </span></blockquote>you  <br/>\n<blockquote><span title=\"ireply\"> &gt; go, spray the whole bathroom down (or when you&#39;re bathing the <br/>\n </span></blockquote>kids,  <br/>\n<blockquote><span title=\"ireply\"> &gt; that&#39;s how I do it. Plus vinegar isn&#39;t toxic and is definitely  <br/>\n&gt; multipurpose. WHen they get out of the tub, spray the floor and <br/>\n </span></blockquote>dry  <br/>\n<blockquote><span title=\"ireply\"> &gt; it with their bath towels. Take a basket room to room when you do  <br/>\n&gt; bedtime rituals and gather laundry then. Forget about making beds, <br/>\n </span></blockquote>if  <br/>\n<blockquote><span title=\"ireply\"> &gt; they don&#39;t care, why should you? Get lots of bins so you can just  <br/>\n&gt; throw stuff in. Seriously check out the URL I already posted.<br/>\n&gt; <br/>\n&gt; &gt; Sorry about all the babble, probably we all feel this way, right?<br/>\n&gt; &gt; Anyway, any help would be great!!<br/>\n&gt; <br/>\n&gt; I have felt that way. I&#39;m choosing now not to. KWIM? There has to <br/>\n </span></blockquote>be  <br/>\n<blockquote><span title=\"ireply\"> &gt; a point where you make a choice to let go of the issues and just <br/>\n </span></blockquote>be  <br/>\n<blockquote><span title=\"ireply\"> &gt; with your kids. They won&#39;t always be small, and maybe you won&#39;t  <br/>\n&gt; always have them. Don&#39;t live your life in a way you would regret  <br/>\n&gt; later on! Saying this with the utmost respect and love. i have <br/>\n </span></blockquote>seven  <br/>\n<blockquote><span title=\"ireply\"> &gt; kids ages eleven to five months. I know it&#39;s hard. But you really <br/>\n </span></blockquote>do  <br/>\n<blockquote><span title=\"ireply\"> &gt; have to make choices and decide what&#39;s important. Live for your <br/>\n </span></blockquote>kids.  <br/>\n<blockquote><span title=\"ireply\"> &gt; Find naturally quiet times of the day where you can fit in <br/>\n </span></blockquote>cleaning.  <br/>\n<blockquote><span title=\"ireply\"> &gt; Ours is almost always first thing in the morning, when everyone <br/>\n </span></blockquote>is  <br/>\n<blockquote><span title=\"ireply\"> &gt; still groggy or independent, and that&#39;s when I gather laundry and <br/>\n </span></blockquote>get  <br/>\n<blockquote><span title=\"ireply\"> &gt; it started. Then we do our things, usually playing video games, <br/>\n </span></blockquote>or  <br/>\n<blockquote><span title=\"ireply\"> &gt; reading, or playing whatever. I play for a while with each one, <br/>\n </span></blockquote>fully  <br/>\n<blockquote><span title=\"ireply\"> &gt; focussed on them, then I ask another one if I can play with them. <br/>\n </span></blockquote>If  <br/>\n<blockquote><span title=\"ireply\"> &gt; someone comes up, they are welcome to play too, or sit patiently  <br/>\n&gt; waiting  on my lap, or sometimes i&#39;ll ask the first child if they  <br/>\n&gt; mind if I do such and so with this other person. Or if they are  <br/>\n&gt; interested in doing x, y, or z (based on what they&#39;ve been <br/>\n </span></blockquote>interested  <br/>\n<blockquote><span title=\"ireply\"> &gt; in lately) I usually make lunch with one or two hanging around in <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; kitchen helping or keeping me company. I might ask one to check  <br/>\n&gt; laundry loads, or tidy the game room while I&#39;m cooking. While <br/>\n </span></blockquote>they  <br/>\n<blockquote><span title=\"ireply\"> &gt; are eating, I sit and talk a while, then get up and vacuum and do  <br/>\n&gt; dishes quickly. WHen my husband gets home, the kids are all over <br/>\n </span></blockquote>him  <br/>\n<blockquote><span title=\"ireply\"> &gt; so it&#39;s a great time to start dinner (if I haven&#39;t done one of <br/>\n </span></blockquote>our  <br/>\n<blockquote><span title=\"ireply\"> &gt; crockpots), or do whatever I didn&#39;t have a chance to do. and then <br/>\n </span></blockquote>at  <br/>\n<blockquote><span title=\"qreply\"> &gt; nighttime when the little ones are in bed, i tidy up their rooms,  <br/>\n&gt; gather whatever laundry we missed, stopping to talk to the older  <br/>\n&gt; ones, play a card game or read with them.<br/>\n&gt; Melissa<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146268981","msgId":12603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2M0NGMkEzLUU1RDgtNEU2OC04NEExLTE2NDM5M0JFNkU1NEBjb3gubmV0Pg==","inReplyToHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPg==","referencesHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPg=="},"prevInTopic":12602,"nextInTopic":12604,"prevInTime":12602,"nextInTime":12604,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"... You don t HAVE to do the laundry. You don t have to do dishes. And do people still iron in the land of wrinkle free cotton? ;-)  LOL More specifically, you","messageBody":"<div id=\"ygrps-yiv-89776131\">On Apr 28, 2006, at 4:39 PM, cmcchess wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I feel like I am always saying &quot;no&quot; when my desire (my philosophy)<br/>\n&gt; is to say &quot;yes&quot; as much as possible. NO, I won&#39;t play right now, no<br/>\n&gt; I can&#39;t read, no I HAVE to do the laundry, no I&#39;m reading to her<br/>\n&gt; right now, no.<br/>\n&gt;<br/>\n </span></blockquote>You don&#39;t HAVE to do the laundry. You don&#39;t have to do dishes. And do  <br/>\npeople still iron in the land of wrinkle free cotton? ;-)  LOL<br/>\nMore specifically, you don&#39;t have to do it right then. Or you could  <br/>\nsay, How about five minutes so I can change out the laundry loads?  <br/>\nRead a book with her after that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am terribly disorganized which adds to my problem. So not only do<br/>\n&gt; I feel the need to &quot;be there&quot; for my children whenever they may need<br/>\n&gt; me, but I need to get the laundry done, supper, dishes and cleaning.<br/>\n&gt; Plus ironing, etc. Also I do want some quiet time sometime, but so<br/>\n&gt; far that only means I loose sleep and am a grump.<br/>\n </span></blockquote>I don&#39;t get a lot of sleep either, and I can get grumpy too. Taking  <br/>\nmy vitamins helps some with that (my prenatals still, as well as a  <br/>\ncomplete omega complex), plus I have my quiet time in the afternoon,  <br/>\njust five minutes, but it really helps. As for organizing, I could go  <br/>\non and on, but I just found a website that I really love that says  <br/>\neverything I would say at <a rel=\"nofollow\" target=\"_blank\" href=\"http://cleanhome.savedme.com\">http://cleanhome.savedme.com</a> . (Ril, hope  <br/>\nyou don&#39;t mind the endorsement!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I wonder should I not worry so much about being availabe for them<br/>\n&gt; all the time (which I&#39;m not because there are 4 of them and they<br/>\n&gt; don&#39;t exactly line up and wait their turn). Should I just do what I<br/>\n&gt; need to do, which might take all day. Should I slow down and live<br/>\n&gt; like I just have the two little ones, and spend my time getting<br/>\n&gt; dressed, getting them dressed, getting meals, cleaning up meals,<br/>\n&gt; doing some laundry in there too and a little play time. If my older<br/>\n&gt; ones were in school my days would be pretty much like that, calmer.<br/>\n<br/>\n </span></blockquote>Let go of the expectations that you have a clean house and perfectly  <br/>\ncoiffed kids. your kids need you more than the house does. My kids  <br/>\ndress themselves, two yo and up. The baby is the only one I dress.  <br/>\nThey don&#39;t match, but they like what they are wearing, and they are  <br/>\ncomfy. Make meals easier to prepare. Ask if they want to help. My  <br/>\neleven yo loves to make lunch, or start dinner. As long as I stay off  <br/>\nhis back about how he&#39;s doing it. Make cleanup easier with paper  <br/>\ndishes or soaking. Don&#39;t fold clothes, just hang them all up or shove  <br/>\nthem into drawers. Get an extension cord for your vacuum so you can  <br/>\njust go room to room (including tile and wood, vacuum&#39;s work  <br/>\namazingly well there). Vacuum while they are eating lunch. Or  <br/>\nwatching a movie. or playing a game. Be willing to stop if they need  <br/>\nyou. The vacuum won&#39;t go anywhere :-P  And they might surprise you by  <br/>\nfinishing!<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have thought of getting a big calendar (huge) so we can all see<br/>\n&gt; what is going on each day of the month, easily. Then beside it a<br/>\n&gt; huge white board where I can put like a day planner for a week and<br/>\n&gt; write what I will be doing and when, and then if someone wants me to<br/>\n&gt; read to them or do a project or go fishing or ????? they<br/>\n&gt; can &quot;schedule&quot; time.<br/>\n </span></blockquote>Every family should have a big calender for events that are going on  <br/>\noutside the home. I wouldn&#39;t put stuff like &#39;Read to dd&#39; on it  <br/>\nthough, because what I&#39;ve seen in my house is that once you start  <br/>\nthat, there is no end. People feel legislated, they feel that they  <br/>\nonly time they will get is on the calender, or they will not want  <br/>\ntime with you outside of the calender. Put on outside activities. If  <br/>\nsomeone wants to go fishing, that&#39;s definitely an outside project.  <br/>\nWrite it down. See who all wants to go. Take them when someone (dh?)  <br/>\ncan watch the others. Or make it fun for everyone by providing for  <br/>\nkids who don&#39;t want to fish (Take books for the reader, take  <br/>\nnotebooks for the artist, take a bug kit for the explorer)<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am torn between scheduled time and just living. I know that if I<br/>\n&gt; say I&#39;ll be cleaning or whatever at a certain time, it is not really<br/>\n&gt; gonna happen, but when will I clean?????<br/>\n<br/>\n </span></blockquote>You can clean forever. If you say, I&#39;ll do this when I&#39;m done  <br/>\ncleaning, there will always be more to do. Trust me. i do that too  <br/>\nmuch. There are times when I drop the cleaning supplies where they  <br/>\nare at and walk away, or I will continue to say &quot;ONE MORE THING&quot;.  <br/>\nCat&#39;s in the cradle says it all, right?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have tried FlyLady, and SHE card file system, but if I do<br/>\n&gt; everything that needs to be done on a daily basis I feel like there<br/>\n&gt; is not much time for anything else. And if I let it pile up , I have<br/>\n&gt; one or two &quot;cleaning&quot; days where I say NO all day long!<br/>\n<br/>\n </span></blockquote>Clean a little at a time. Keep a spray bottle under each bathroom  <br/>\nsink with vinegar/water solution, with some paper towels. When you  <br/>\ngo, spray the whole bathroom down (or when you&#39;re bathing the kids,  <br/>\nthat&#39;s how I do it. Plus vinegar isn&#39;t toxic and is definitely  <br/>\nmultipurpose. WHen they get out of the tub, spray the floor and dry  <br/>\nit with their bath towels. Take a basket room to room when you do  <br/>\nbedtime rituals and gather laundry then. Forget about making beds, if  <br/>\nthey don&#39;t care, why should you? Get lots of bins so you can just  <br/>\nthrow stuff in. Seriously check out the URL I already posted.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sorry about all the babble, probably we all feel this way, right?<br/>\n&gt; Anyway, any help would be great!!<br/>\n<br/>\n </span></blockquote>I have felt that way. I&#39;m choosing now not to. KWIM? There has to be  <br/>\na point where you make a choice to let go of the issues and just be  <br/>\nwith your kids. They won&#39;t always be small, and maybe you won&#39;t  <br/>\nalways have them. Don&#39;t live your life in a way you would regret  <br/>\nlater on! Saying this with the utmost respect and love. i have seven  <br/>\nkids ages eleven to five months. I know it&#39;s hard. But you really do  <br/>\nhave to make choices and decide what&#39;s important. Live for your kids.  <br/>\nFind naturally quiet times of the day where you can fit in cleaning.  <br/>\nOurs is almost always first thing in the morning, when everyone is  <br/>\nstill groggy or independent, and that&#39;s when I gather laundry and get  <br/>\nit started. Then we do our things, usually playing video games, or  <br/>\nreading, or playing whatever. I play for a while with each one, fully  <br/>\nfocussed on them, then I ask another one if I can play with them. If  <br/>\nsomeone comes up, they are welcome to play too, or sit patiently  <br/>\nwaiting  on my lap, or sometimes i&#39;ll ask the first child if they  <br/>\nmind if I do such and so with this other person. Or if they are  <br/>\ninterested in doing x, y, or z (based on what they&#39;ve been interested  <br/>\nin lately) I usually make lunch with one or two hanging around in the  <br/>\nkitchen helping or keeping me company. I might ask one to check  <br/>\nlaundry loads, or tidy the game room while I&#39;m cooking. While they  <br/>\nare eating, I sit and talk a while, then get up and vacuum and do  <br/>\ndishes quickly. WHen my husband gets home, the kids are all over him  <br/>\nso it&#39;s a great time to start dinner (if I haven&#39;t done one of our  <br/>\ncrockpots), or do whatever I didn&#39;t have a chance to do. and then at  <br/>\nnighttime when the little ones are in bed, i tidy up their rooms,  <br/>\ngather whatever laundry we missed, stopping to talk to the older  <br/>\nones, play a card game or read with them.<br/>\nMelissa</div>","specialLinks":[]},{"userId":75461233,"authorName":"cmcchess","from":"&quot;cmcchess&quot; &lt;cmcchess@...&gt;","profile":"cmcchess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I need ideas about how to &quot;schedule&quot; the day...","postDate":"1146260344","msgId":12602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUydTIxbytzcjJiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":12603,"prevInTime":12601,"nextInTime":12603,"topicId":12602,"numMessagesInTopic":0,"msgSnippet":"I am feeling a bit overwhelmed. I have 4 children, ages 2 to 10. I feel like I should be able to do everything they want to do when they want to do it. Or at","messageBody":"<div id=\"ygrps-yiv-687571071\">I am feeling a bit overwhelmed. I have 4 children, ages 2 to 10. I <br/>\nfeel like I should be able to do everything they want to do when <br/>\nthey want to do it. Or at least be able to set up an appointment to <br/>\ndo it with them at a later time. <br/>\n<br/>\nI need both philosophical ideas and practical ideas here. I&#39;m gonna <br/>\nbabble a lot and send it. Usually I babble in my messages then erase <br/>\nit all and ask one simple question, but I&#39;ll send it this time :)<br/>\n<br/>\nIf the 2 yo sees me she want&#39;s me to play, which to her means watch <br/>\nher play.<br/>\nThe 4 yo is pretty independent, but really likes me to read to her.<br/>\nThe 6 yo wants to do stuff outside like fishing or watching him <br/>\ndo &quot;circus acts&quot; on the swings. <br/>\nAnd the 10 yo wants to talk and talk and talk, saying the same thing <br/>\n20 times in slightly different ways.<br/>\n<br/>\nI feel like I am always saying &quot;no&quot; when my desire (my philosophy) <br/>\nis to say &quot;yes&quot; as much as possible. NO, I won&#39;t play right now, no <br/>\nI can&#39;t read, no I HAVE to do the laundry, no I&#39;m reading to her <br/>\nright now, no.<br/>\n<br/>\nI am terribly disorganized which adds to my problem. So not only do <br/>\nI feel the need to &quot;be there&quot; for my children whenever they may need <br/>\nme, but I need to get the laundry done, supper, dishes and cleaning. <br/>\nPlus ironing, etc. Also I do want some quiet time sometime, but so <br/>\nfar that only means I loose sleep and am a grump. <br/>\n<br/>\nI talked to a girl who had been unschooled (through e-mail) who said <br/>\nshe was pulled out of school around 5th grade and felt that her <br/>\nmother neglected her. That was the beginning of her unschooling <br/>\nexperience. <br/>\n<br/>\nSo I wonder should I not worry so much about being availabe for them <br/>\nall the time (which I&#39;m not because there are 4 of them and they <br/>\ndon&#39;t exactly line up and wait their turn). Should I just do what I <br/>\nneed to do, which might take all day. Should I slow down and live <br/>\nlike I just have the two little ones, and spend my time getting <br/>\ndressed, getting them dressed, getting meals, cleaning up meals, <br/>\ndoing some laundry in there too and a little play time. If my older <br/>\nones were in school my days would be pretty much like that, calmer. <br/>\n<br/>\nI have thought of getting a big calendar (huge) so we can all see <br/>\nwhat is going on each day of the month, easily. Then beside it a <br/>\nhuge white board where I can put like a day planner for a week and <br/>\nwrite what I will be doing and when, and then if someone wants me to <br/>\nread to them or do a project or go fishing or ????? they <br/>\ncan &quot;schedule&quot; time.  <br/>\n<br/>\nI am torn between scheduled time and just living. I know that if I <br/>\nsay I&#39;ll be cleaning or whatever at a certain time, it is not really <br/>\ngonna happen, but when will I clean?????<br/>\n<br/>\nI have tried FlyLady, and SHE card file system, but if I do <br/>\neverything that needs to be done on a daily basis I feel like there <br/>\nis not much time for anything else. And if I let it pile up , I have <br/>\none or two &quot;cleaning&quot; days where I say NO all day long! I need a <br/>\nhomeschooling perspective on this, not a perspective from someone <br/>\nwho&#39;s kids go off all day long and they great them with a smile at <br/>\nthe end of the day with a nice clean house, and a willingness to <br/>\ndedicate the evening to their kids. (no I am not trying to be mean <br/>\nto school families, It&#39;s just that all the advice I see, read or <br/>\nhear is from them. )<br/>\n<br/>\nSorry about all the babble, probably we all feel this way, right?  <br/>\nAnyway, any help would be great!!<br/>\n<br/>\nThanks,<br/>\nCathy</div>","specialLinks":[]}],"prevTopicId":12687,"nextTopicId":12759}}