{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"lego- brikwars","postDate":"1152820967","msgId":15725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5Njh0NytiMzczQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5NjZtcStkbjBlQGVHcm91cHMuY29tPg=="},"prevInTopic":15717,"nextInTopic":0,"prevInTime":15724,"nextInTime":15726,"topicId":15703,"numMessagesInTopic":0,"msgSnippet":"Deb, Loved this part off the BrikWars site... Rules are for the small-minded and weak. Let a little kid loose among your collection of bricks sometime, and","messageBody":"<div id=\"ygrps-yiv-974401097\">Deb,<br/>\nLoved this part off the BrikWars site...<br/>\n<br/>\nRules are for the small-minded and weak. Let a little kid loose <br/>\namong your collection of bricks sometime, and watch the way he <br/>\nplays. In his hands, those minifigs will have all kinds of crazy <br/>\nbattles and adventures, there&#39;ll be all the drama, death, and <br/>\nexplosions you could ever want, and the whole time that kid won&#39;t <br/>\nhave to crack open the rulebook even once. How is it that he&#39;s so <br/>\nmuch smarter than we are? The answer is that most of us have had a <br/>\nlot more years of schooling than he has. Wait until he&#39;s eighteen, <br/>\nhe&#39;ll have become just as slack-jawed and dull-eyed as the rest of <br/>\nus. <br/>\n<br/>\nBrikWars has a lot of rules. If the mandatory education system has <br/>\nhad the chance to get its hooks in you, then you&#39;ll respect the <br/>\nauthority of those rules, because they&#39;re all written down in a <br/>\nbook, and some of them are capitalized. If things went so badly that <br/>\nyou ended up going to college as well, then you&#39;ll probably not only <br/>\nshackle yourself to those rules but also then try to lovingly twist <br/>\nthem to your own ends, weaseling out loopholes and exploits to <br/>\ncleverly frustrate the other players and ingeniously prevent fun for <br/>\nthe entire group. <br/>\n<br/>\nIf you find yourself engaging in that kind of rules-lawyering and <br/>\nmunchkinism, then you have just failed at BrikWars. Stamp a big F on <br/>\nyour report card, schedule a get-together between your face and the <br/>\nHammer of Discipline, and see if you can&#39;t spend a little time <br/>\nafterwards with a couple of five-year-olds to remember the things <br/>\nyou&#39;ve forgotten about having fun. <br/>\n<br/>\nThe reason BrikWars has so many rules is that it&#39;s a lot more fun to <br/>\nflout a large rules system than a small one. Hopefully you can use <br/>\nthese rules as a springboard for the imagination rather than as <br/>\nmanacles with which to enslave yourself. However, we also recognize <br/>\nthat not everyone is mentally ready to live without the safety net <br/>\nthat a system of rules provides, especially while in competition <br/>\nwith others. <br/>\n<br/>\n<br/>\n:)<br/>\n<br/>\nKiersten</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: exploring TV..long","postDate":"1152818714","msgId":15717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NjZtcStkbjBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5NjA2aCs5NGE2QGVHcm91cHMuY29tPg=="},"prevInTopic":15709,"nextInTopic":15725,"prevInTime":15716,"nextInTime":15718,"topicId":15703,"numMessagesInTopic":0,"msgSnippet":"... Exactly - that s stuff we have in abundance so it works well. The only thing we did buy was a couple packs of assorted sided dice so that both DH and DS","messageBody":"<div id=\"ygrps-yiv-349174602\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kiersten Pasciak&quot; <br/>\n&lt;kjl8@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Deb,<br/>\n&gt; Thanks for all the ideas!<br/>\n&gt; I especially like the &quot;squirt&quot; game and the lego idea since we <br/>\n&gt;have <br/>\n&gt; most of that stuff around :)<br/>\n </span></blockquote>Exactly - that&#39;s stuff we have in abundance so it works well. The <br/>\nonly thing we did buy was a couple packs of assorted sided dice so <br/>\nthat both DH and DS have their own sets.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I am trying to wean myself off buying so many toys and things and <br/>\n&gt; make more. (our balance here is the oposite of some families- &quot;I&quot; <br/>\n&gt; always want to buy new stuff (even if it is ebay&#39;d or from a <br/>\n&gt;thrift <br/>\n&gt; store), the kids generally think we can MAKE anything. Last night, <br/>\n&gt; Jacob decided we should build a car that doesn&#39;t polute, LOL. <br/>\n </span></blockquote>The Bionicle game we got for a dollar or two at a huge tag sale. The <br/>\nBattle Ball game was $5 brand new at Toys R Us. Often, if you check <br/>\nHasbro&#39;s website you can find some of their hard-to-find-on-the-<br/>\nshelf type things.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; P.S. Glad to know others out there have battling youngsters as <br/>\n&gt;well.<br/>\n&gt; Some of my extended family say things like &quot;There&#39;s enough <br/>\n&gt;violence <br/>\n&gt; in the world, we don&#39;t need to create more&quot; and try to stop any <br/>\n&gt; rough play, real or imaginary.<br/>\n&gt; <br/>\n </span></blockquote>BTW another inexpensive fun battling thing is making &quot;boppers&quot; - <br/>\npick up some pool noodles when they go on sale cheap. Cut them in <br/>\nhalf (they&#39;ll end up roughly 3 feet long or you can cut them even <br/>\nshorter, your choice). Buy some PVC pipe at the hardware store, <br/>\nroughly same outer diameter as the inner diameter of the noodle. Cut <br/>\nthat, or have them cut it, into 3 foot lengths (or whatever length <br/>\nthe noodles are cut into). Insert the pipe into the noodle, leaving <br/>\nabout 6 inches of pipe sticking out for a handle. Use duct tape or <br/>\nbetter yet colorful electrical tape to wrap the handle all the way <br/>\nup onto the noodle to hold things together. We also wrap about 4 to <br/>\n6 inches at the other end of the noodle as well to help it hold up a <br/>\nbit better since there&#39;s no pipe at that end. Makes a bunch of <br/>\nsomewhat padded &quot;swords&quot; or &quot;light sabers&quot; that give when &quot;stabbed&quot; <br/>\nrather than impaling anyone. DH came up with this one when we were <br/>\ngetting bruised by the plastic light sabers DS loved playing with. <br/>\nNow, we still use the light sabers (plastic ones) but his aim is <br/>\nbetter and/or we&#39;re better at ducking.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: exploring TV..long","postDate":"1152812049","msgId":15709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NjA2aCs5NGE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5NXE3MysybGtqQGVHcm91cHMuY29tPg=="},"prevInTopic":15708,"nextInTopic":15717,"prevInTime":15708,"nextInTime":15710,"topicId":15703,"numMessagesInTopic":0,"msgSnippet":"... Deb, Thanks for all the ideas! I especially like the squirt game and the lego idea since we have most of that stuff around :) I am trying to wean myself","messageBody":"<div id=\"ygrps-yiv-792515045\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deb&quot; &lt;soggyboysmom@...&gt; <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you tell we like battle games? LOL<br/>\n&gt; --Deb<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Deb,<br/>\nThanks for all the ideas!<br/>\nI especially like the &quot;squirt&quot; game and the lego idea since we have <br/>\nmost of that stuff around :)<br/>\n<br/>\nI am trying to wean myself off buying so many toys and things and <br/>\nmake more. (our balance here is the oposite of some families- &quot;I&quot; <br/>\nalways want to buy new stuff (even if it is ebay&#39;d or from a thrift <br/>\nstore), the kids generally think we can MAKE anything. Last night, <br/>\nJacob decided we should build a car that doesn&#39;t polute, LOL. <br/>\n<br/>\nThanks again!<br/>\n<br/>\nP.S. Glad to know others out there have battling youngsters as well.<br/>\nSome of my extended family say things like &quot;There&#39;s enough violence <br/>\nin the world, we don&#39;t need to create more&quot; and try to stop any <br/>\nrough play, real or imaginary.<br/>\n<br/>\nKiersten<br/>\nmom to Jacob 4 1/2 and Emma 3</div>","specialLinks":[]},{"userId":257390633,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;earthspirit393@...&gt;","profile":"earthspirit393","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] exploring TV..long","postDate":"1152807141","msgId":15708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMC1EQVYxMTc1REMxNTA3OTY3RTQ5ODAxRUY0OTk2RTBAcGh4LmdibD4=","referencesHeader":"PGU5NWxkMitrZ3Z0QGVHcm91cHMuY29tPg=="},"prevInTopic":15706,"nextInTopic":15709,"prevInTime":15707,"nextInTime":15709,"topicId":15703,"numMessagesInTopic":0,"msgSnippet":"Kiersten - your ideas were WAY COOL!!!!  And very creative.  Once we made up a game about Lord of the Rings.  The kids had a lot of fun creating the rules and","messageBody":"<div id=\"ygrps-yiv-1164635848\">Kiersten - your ideas were WAY COOL!!!!  And very creative.  Once we made up a game about Lord of the Rings.  The kids had a lot of fun creating the rules and the game board and everything.<br/>\n<br/>\nYou&#39;re right - it makes it better to be involved that way.<br/>\n<br/>\nMaisha Khalfani<br/>\nKhalfani Family Adventures<br/>\nhttp://khalfanifamilyadventures.blogspot.com&lt;http://khalfanifamilyadventures.blogspot.com/&gt;<br/>\nEarthSpirit Readings<br/>\nhttp://www.geocities.com/maitai373/EarthSpirit.html&lt;http://www.geocities.com/maitai373/EarthSpirit.html&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: exploring TV..long","postDate":"1152805923","msgId":15706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NXE3MysybGtqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5NWxkMitrZ3Z0QGVHcm91cHMuY29tPg=="},"prevInTopic":15703,"nextInTopic":15708,"prevInTime":15705,"nextInTime":15707,"topicId":15703,"numMessagesInTopic":0,"msgSnippet":"... A couple to look for - the Star Wars Attactix figures (if you re into Star Wars) - they have various things that actually shoot (small plastic","messageBody":"<div id=\"ygrps-yiv-1930978814\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kiersten Pasciak&quot; <br/>\n&lt;kjl8@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;It is also hard to find &quot;battle games&quot; <br/>\n&gt; at a level for a 4 year old. <br/>\n </span></blockquote>A couple to look for - the Star Wars &quot;Attactix&quot; figures (if you&#39;re <br/>\ninto Star Wars) - they have various things that actually shoot <br/>\n(small plastic projectiles), object is to knock down your opponents <br/>\nplayers. Each figure can move a set number of &quot;clicks&quot; (audible <br/>\nclick click click sounds) - number is marked on the figure - in any <br/>\ndirection. All 3 figures in play move on each turn. Then 2 of the 3 <br/>\ncan &#39;attack&#39; whichever of the other player&#39;s 3 figures chosen <br/>\n(attack 2 different figures or attack the same one sequentially). <br/>\nWhen a figure is knocked over, it is picked up and a marking on the <br/>\nbottom is checked to see if it is white (it&#39;s kind of a roller wheel <br/>\nthat goes from black to white at variable intervals so it&#39;s pretty <br/>\nrandom). If it is white, the &quot;special power&quot; on the bottom applies - <br/>\nfor example if disguised Han Solo gets knocked over and his marker <br/>\nis white, you can put the other Han Solo figure into play from your <br/>\nbackup figures (if you have him). Other than reading the &quot;Special <br/>\npowers&quot; there&#39;s no reading, adding, or other skills needed that <br/>\nwould be beyond a 4 yr old. Battles tend to run maybe 15 minutes or <br/>\nso, depending. Oh, each player picks their &quot;teams&quot; based on the <br/>\npoint values of the figures - we play with 150 points worth of <br/>\nfigures (some figures are worth more than others) - so there&#39;d be a <br/>\nlittle adding involved (almost fogot about that), although we often <br/>\nend up picking the same exact assortments each time so we know that <br/>\nif we pick figures a,b,c and d it adds up to 150 without consciously <br/>\nadding them.<br/>\n<br/>\nIf you can find it, there&#39;s a Bionicle board game where the board <br/>\ngets built puzzle piece style as you play. Some reading involved to <br/>\ndetermine the &quot;special powers&quot; of the various objects and all. <br/>\nMostly dice rolls and moving around the board collecting things.<br/>\n<br/>\nBattle Ball by Hasbro is sort of &quot;extreme football&quot; on a board with <br/>\ndice and really ugly figures (monster types - cool for kids I <br/>\nsuppose lol). Once you&#39;ve gone over the rules, there&#39;s no reading. <br/>\nThere&#39;s a basic game and the advanced game - basic is just as fun, <br/>\njust doesn&#39;t have some of the more complex rules. Different figures <br/>\nuse different dice to determine their moves (the dice are color <br/>\ncoded to match the base of the figure so it&#39;s easy to tell which die <br/>\ngoes with who). Object is basically to get the little football thing <br/>\n(looks like a Monopoly piece) across the opposite goal line (like <br/>\nfootball). Your opponent can &quot;tackle&quot; you by coming up to a square <br/>\nnext to you and you each roll your appropriate die - low number wins <br/>\nUNLESS certain figuress get a 1, then they lose. The square where <br/>\nthe losing figure was (loser gets removed from play for the &quot;half&quot;) <br/>\ngets marked with what looks like a bomb crater piece and is not <br/>\nusable (gotta find a path around it). The advanced rules include <br/>\npassing and fumbling and such.<br/>\n<br/>\nCheck online for Lego BrikWars - you build houses and such with your <br/>\nLego collection and then use the Lego people as your &quot;warriors&quot;. <br/>\nRequires assorted dice (6, 8, 10, 12 sided types). The basic rules <br/>\nare in a downloadable format online. You can add to or subtract from <br/>\nthe rules at will, and again, there&#39;s a basic quick form of the game.<br/>\n<br/>\nAnd here&#39;s one DS made up called Squirt:<br/>\nObject: To &quot;squirt&quot; all your opponent&#39;s pieces before all of yours <br/>\nare squirted<br/>\n<br/>\nCheckerboard set up with 8 checkers on last row of each side &quot;the <br/>\ncamp&quot;<br/>\n<br/>\n8 Markers &quot;trees&quot; (squares of paper or cardboard work fine)  4 <br/>\neach  are placed in the middle of the board &quot;the forest&quot;, by turns. <br/>\nOnly one &quot;tree&quot; can occupy a file.<br/>\nPieces can move one square in any direction on each turn<br/>\nYou can &quot;squirt&quot; and remove any opposing pieces that are in a direct <br/>\nline with your piece in any direction, any distance<br/>\nYou cannot &quot;squirt&quot; pieces still in &quot;camp&quot;<br/>\nYou cannot &quot;squirt&quot; using a piece that is still in your camp<br/>\nYou cannot &quot;squirt&quot; through &quot;trees&quot;<br/>\nYou cannot step on a square occupied by a &quot;tree&quot;<br/>\nWhen you &quot;squirt&quot; you maintain the space you are &quot;squirting&quot; from<br/>\nYou can move sideways in camp if you choose<br/>\nYou can always move back into camp if you&#39;ve left camp<br/>\nIf you get across to the other &quot;camp&quot;, you can remove one &quot;tree&quot;<br/>\n<br/>\nCan you tell we like battle games? LOL<br/>\n--Deb</div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"exploring TV..long","postDate":"1152800994","msgId":15703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NWxkMitrZ3Z0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15706,"prevInTime":15702,"nextInTime":15704,"topicId":15703,"numMessagesInTopic":0,"msgSnippet":"Someone posted about not wanting to watch the TV shows with her kids because she dislikes TV. While I understand the sentiment, I think it is important to know","messageBody":"<div id=\"ygrps-yiv-1732971095\">Someone posted about not wanting to watch the TV shows with her kids <br/>\nbecause she dislikes TV. While I understand the sentiment, I think <br/>\nit is important to know what your kids are watching and what they <br/>\nlike about it, especially if you are trying to strew things around <br/>\nfor them to enjoy. <br/>\n<br/>\nMy son has been loving Pokemon for months. At first, I used the show <br/>\ntime as a way to get things done. Eventually I started to watch with <br/>\nhim and learn the characters and get the jokes. I was amazed at the <br/>\ndetails he noticed. Then I looked for books and movies at the <br/>\nlibrary/book store that he might enjoy. We explored the internet and <br/>\nfound a Pokedex (which got him reading by first letters and sorting <br/>\nthem by type, he was mesmerized) I got him a few plastic toys which <br/>\nhe played with and held imaginary &quot;Pokemon Battles&quot;. I began to <br/>\nbattle him (verbally, you give commands) and his sister joined in. <br/>\nNot much fun for me as his Pokemon always won!<br/>\n<br/>\nLately, we have made up card games with Pokemon themes to give me a <br/>\nfighting chance :) I printed out pictures of the characters and made <br/>\n40 playing cards out of recycled cereal boxes. (glue picture in <br/>\nmiddle, add values 1-10 in corners) We started out with &quot;WAR&quot;, but <br/>\nit wasn&#39;t challenging enough for them. I did get to see that my son <br/>\nknows what numbers are bigger than others, though. And that he knows <br/>\nall the Pokemon names without needing to read them. And that Emma <br/>\nknows most of them though she rarely watches. We made it more <br/>\ninteresting by adding coins into the mix. You get as many coins as <br/>\nthe number on your card (now called Hit Points) and throw down. <br/>\nHighest number of &quot;heads&quot; wins. Both kids can count out the coins, <br/>\ncount the heads, and verbally &quot;battle&quot; at the same time. They are <br/>\nstarting to make up their own rules for games, like 3 on 3 battles, <br/>\netc.<br/>\n<br/>\nI found a site online that has great resources for TV images and <br/>\ntheme stuff. I printed off her BINGO &quot;call sheets&quot; for the cards I <br/>\nmade. We have also made the Kid&#39;s TV BINGO game which has images <br/>\nform Nick Jr. and PBS.<br/>\nShe also has dominos and coloring pages and crafts to make for <br/>\nseasonal or TV themes.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dltk-cards.com/bingo/\">http://www.dltk-cards.com/bingo/</a><br/>\n<br/>\nPerhaps for the mom dreading TV, she could offer some related games, <br/>\nimaginary play, dress up, computer games, etc. that involve similar <br/>\ncharacters or themes that her kids will enjoy. <br/>\n<br/>\nHere, we are into making games because the kids like to play when <br/>\nthey get to decide on the rules and when it is something interesting <br/>\nfor them. My son actually plays WHOLE games of the ones we create, <br/>\nwhereas he dislikes most &quot;packaged&quot; games because he doesn&#39;t like <br/>\nthe rules or they are boring. It is also hard to find &quot;battle games&quot; <br/>\nat a level for a 4 year old. <br/>\n<br/>\nOur first game was a kid D&D game we created with cards laid out <br/>\nface down in a path. You roll a die and move along, picking up the <br/>\ncard you land on. There are cards to cast spells in battle, move <br/>\nforward or back, gain defense with shields and cloaks, gain <br/>\noffensive power with swords or axes, gain or lose HP&#39;s by eating <br/>\npoisoned mushrooms or drinking magic potions, and of course many <br/>\nBATTLE cards. &quot;Battle&quot; consists of dice rolling to determine if the <br/>\nhero (the player) beats the current monster (drawn from a card pile) <br/>\nWe use bubble dots on the hero and monster cards to show HP&#39;s and <br/>\ncross them off when &quot;hit&quot;. The goal is for the hero to make it to <br/>\nthe castle at the end of the path without losing all his hitpoints. <br/>\nThe game is always different and it can be played cooperatively or <br/>\ncompetively. It can also be expanded at any time. This evolved from <br/>\nstumbling upon my husband&#39;s dice collection from his D&D days. The <br/>\nkids loved all the different shaped dice! Jacob tries to play D&D <br/>\nwith his dad on the computer, but it is a bit too tricky for him, so <br/>\nthis was a perfect fit for us. He loves coming up with new monsters <br/>\nor treasures, etc. It makes it &quot;his&quot; game.<br/>\n<br/>\nMaybe some of this will offer up some options for expanding on TV <br/>\n(or video games for that matter)<br/>\n <br/>\nKiersen<br/>\nmom to Jacob 4 1/2 and Emma 3</div>","specialLinks":[]}],"prevTopicId":15679,"nextTopicId":15629}}