{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Moving out","postDate":"1257011128","msgId":41990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjaHQzbythamJnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhjZnVtaithNTRhQGVHcm91cHMuY29tPg=="},"prevInTopic":41980,"nextInTopic":0,"prevInTime":41989,"nextInTime":41991,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"... ******************* If she was in college, how much do you think you d spend on housing? That might be one way to look at it, the same way, with a younger","messageBody":"<div id=\"ygrps-yiv-316189675\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;blue_mountain34&quot; &lt;blue_mountain34@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Yes, these are some of his concerns - that we could end up paying for 2 places, and also that she is not moving towards looking for a job very actively.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIf she was in college, how much do you think you&#39;d spend on housing? That might be one way to look at it, the same way, with a younger kid, you might compare buying toys to buying curriculum materials. <br/>\n<br/>\nSomething else to think about is what you&#39;d like to be able to offer her in terms of Time. Many kids go to college, really, to get Time. They dabble in classes, goof off a whole lot, meet people, think, dream, figure some things out. You can offer her that Time without the expectation of college - or work for that matter. <br/>\n<br/>\nInstead of talking about work and housing, maybe talk with her about the fund, itself. It&#39;d be nice not to spend it all in one year on an apartment, after all. Would she like to set up a plan where she&#39;d get a certain amount of that money on a regular basis for whatever she wants? Then you could talk about if she wants small amounts regularly, or big chunks so she can think about using it for bigger purchases (like, $100 a week is nice, but with $400 once a month she could get a computer one month and chip in on a cheap car the next (or get a super cheap car, I have one I spent $400 on!)). <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re:Moving out","postDate":"1256993588","msgId":41980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkxMDMxMDU1M2kyMWYzYjRjZmhjZDE1Yjg4ODA1OGI0MmQ0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhjZnVtaithNTRhQGVHcm91cHMuY29tPg==","referencesHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGQTYzQEJPWC5DTkNTT0ZUV0FSRS5DT00+CSA8aGNmdW1qK2E1NGFAZUdyb3Vwcy5jb20+"},"prevInTopic":41975,"nextInTopic":41990,"prevInTime":41979,"nextInTime":41981,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"OP: all during that time has not persevered in finding a job whereby she could save money towards that goal. She believes the area that we live in doesn t","messageBody":"<div id=\"ygrps-yiv-1188095335\">OP: all during that time has not persevered in finding a job whereby she<br/>\ncould save money towards that goal. She believes the area that we live in<br/>\n&quot;doesn&#39;t have jobs&quot;. The area that she moved to however is no better off in<br/>\nterms of available employment. That it is just before Christmas will be an<br/>\nadvantage.<br/>\n<br/>\n***Are there ways that you have or could help her look for employment or to<br/>\nfacilitate work in some way? has anything helped? What is she looking for in<br/>\nher experience of &quot;being on her own&quot;? Does she want to work or have a job?<br/>\nMaybe she just wants the freedom of being on her own without working. Maybe<br/>\nthere are no jobs that interest her.<br/>\n<br/>\nYou say she is living 7 hours away, is that because that is where her<br/>\nfriends are? Were there friends closer to home? Maybe it is more related to<br/>\nfriendship than wanting to live on her own. She may have the desire but not<br/>\nbe able to just yet.<br/>\n<br/>\nAre there things she likes to do that may provide income?<br/>\n<br/>\nFaith<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":275193975,"authorName":"blue_mountain34","from":"&quot;blue_mountain34&quot; &lt;blue_mountain34@...&gt;","profile":"blue_mountain34","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Moving out","postDate":"1256947219","msgId":41975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjZnVtaithNTRhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGQTYzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":41974,"nextInTopic":41980,"prevInTime":41974,"nextInTime":41976,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"Yes, these are some of his concerns - that we could end up paying for 2 places, and also that she is not moving towards looking for a job very actively. She","messageBody":"<div id=\"ygrps-yiv-402313923\">Yes, these are some of his concerns - that we could end up paying for 2 places, and also that she is not moving towards looking for a job very actively. She considers herself moved out now. She is staying with friends who are in college and who she has just recently met, one of whom is now her boyfriend, in a town that is 7 hours drive away. <br/>\n<br/>\nShe has been planning on moving out for a couple of years, but all during that time has not persevered in finding a job whereby she could save money towards that goal. She believes the area that we live in &quot;doesn&#39;t have jobs&quot;. The area that she moved to however is no better off in terms of available employment. That it is just before Christmas will be an advantage.<br/>\n<br/>\nThanks to everyone for their input. We are continuing to work toward how best to support her choices, and it is very helpful to have everyone&#39;s ideas.<br/>\n<br/>\nMarie<br/>\n<br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; A few considerations that popped to mind include: at 17, she can&#39;t get<br/>\n&gt; her own apartment without a legal adult&#39;s name on the lease<br/>\n&gt; (yours/hubby&#39;s most likely). That would mean you are on the hook for the<br/>\n&gt; rent should she have trouble making enough money to pay it. Could your<br/>\n&gt; DH be concerned about that extra financial responsibility (supporting<br/>\n&gt; two households when it&#39;s hard enough to manage one these days). Full<br/>\n&gt; time jobs (the kind that can support an apartment, utilities, food, etc)<br/>\n&gt; might be difficult to get if high school typically ends at 18 where you<br/>\n&gt; live. A &quot;small college fund&quot; might give her enough for apartment<br/>\n&gt; security deposit (first/last month&#39;s rent) and setting up utilities but<br/>\n&gt; is it enough to carry her for 6 months while she looks for work and gets<br/>\n&gt; a bank account built up? (could be, I don&#39;t know) Just thinking that<br/>\n&gt; these may be among the concerns on your DH&#39;s mind.<br/>\n&gt; <br/>\n&gt; So, maybe, sit down with your DD and help her figure out what a<br/>\n&gt; realistic budget is (if that hasn&#39;t already happened) - how much would<br/>\n&gt; an average studio apartment cost in her chosen area (studios are usually<br/>\n&gt; the cheapest)? How much is the security deposit? How much would<br/>\n&gt; utilities (electric, heat, etc) cost per month? How much is charged for<br/>\n&gt; setting up the utility accounts (if anything)? Food is usually the most<br/>\n&gt; flexible (we&#39;ve lived on beans, rice, canned tomato sauce and cereal a<br/>\n&gt; time or two over the years) but what&#39;s realistic for a simple, healthy<br/>\n&gt; amount of food (at least a couple meals per day). What about<br/>\n&gt; transportation needs (whether it&#39;s car insurance, gas, etc or bus pass<br/>\n&gt; or whatever in that area)? Then look at potential jobs in that area that<br/>\n&gt; she might get - do they pay anywhere near what she needs to meet that<br/>\n&gt; budget? Assume that she WILL be moving out and help her to move in that<br/>\n&gt; direction - the timing might just need a little adjustment as to when<br/>\n&gt; she has her OWN place (sharing with others would split expenses at<br/>\n&gt; least). Maybe even suggest sharing an apartment for a time.<br/>\n&gt; <br/>\n&gt; Deb R<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving out","postDate":"1256925233","msgId":41974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBRUIyODMxLjEwNTA1QG1hYy5jb20+","inReplyToHeader":"PGhjZDdpaCtnZWp1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhjZDdpaCtnZWp1QGVHcm91cHMuY29tPg=="},"prevInTopic":41972,"nextInTopic":41975,"prevInTime":41973,"nextInTime":41975,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"Small college funds can be more hindrance than help, you know, in terms of actually paying for college. They can reduce the financial aid you qualify for,","messageBody":"<div id=\"ygrps-yiv-1988978934\">Small college funds can be more hindrance than help, you know, in terms <br/>\nof actually paying for college. They can reduce the financial aid you <br/>\nqualify for, while not providing enough to pay for college. Just a weird <br/>\nthing that can happen - not saying that&#39;s what would happen in your <br/>\ncase, of course. Depends on lots of factors - but it is possible for <br/>\npeople to save up just enough to disqualify them for aid, but not enough <br/>\nto actually afford college.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/29/2009 4:13 PM, blue_mountain34 wrote:<br/>\n&gt; Her plan is to find a job and her own apartment there. Since this is what she wants, I would like to support her in doing this; including making her small college fund available, since that is what she has asked for. My husband does not believe that she is ready to be on her own and does not want to give her the college fund money until she is older (and preferably attending college, although he accepts that she may not choose to go to college).<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Moving out","postDate":"1256918119","msgId":41972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjZjI5Nys2N3RvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGQTYzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":41966,"nextInTopic":41974,"prevInTime":41971,"nextInTime":41973,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"Like Debra I had some thoughts, based on our own unschooled now-19 year old (I ll get to her in a minute) but also a professional dance family we know whose","messageBody":"<div id=\"ygrps-yiv-399873940\">Like Debra I had some thoughts, based on our own unschooled now-19 year old (I&#39;ll get to her in a minute) but also a professional dance family we know whose late-birthday 18-year-old son wanted to leave his alternative arts high school a year early to accept a cruise ship contract performing from Mexico to Alaska. <br/>\n<br/>\nI got involved because they came to me looking for out-of-the-box options. This was the youngest child of college-educated parents who had a good college fund ready for their son, and the dad wouldn&#39;t hear of him leaving school without at least that diploma, hoping he would someday come back to the college path. But legally the boy was 18 and didn&#39;t &quot;need&quot; their consent; the mom was happy he wanted to dance professionally although like the dad, worried about his formal education, and she was the one who realized the real issue was that the relationship between the boy and dad was at risk.<br/>\n<br/>\nUnschooling was my first suggestion (legally filing to home-educate for his senior year, waving bon voyage and then just &quot;graduating&quot; him at the end of the calendar year.)  The dad wouldn&#39;t hear of it because that wouldn&#39;t be a &quot;real&quot; diploma, you&#39;ve all heard that tune.  No time to educate dad. So my next idea was working with the alternative school to have this approved as a senior year independent study abroad or some such. We explored it briefly but no dice.  Legal credit and seat-time requirements, even allowed absences, have become much too rigid.  Again, no time to work through it, the ship was leaving.<br/>\n<br/>\nSo for this one family, the best option turned out to be a correspondence private/homeschool in Maine that I referred the mom to.  It was in the news for being used heavily by football players in my state who couldn&#39;t manage to pass the state exit exam hence graduate to accept their college scholarships. You send in your high school transcripts and the Maine school evaluates them and offers you their (private accredited) diploma in return for paying a fee.  I thought this had less credibility than a real in-state home education diploma but hey, it wasn&#39;t my husband and son having the problem.  They checked it out, spent the money -- hundreds of dollars, maybe a thousand -- and bought themselves peace and freedom.<br/>\n<br/>\nFast forward three or four years and the boy in his mid-20s has been living on his own mostly in NYC, scraping by on low-pay jobs to keep training and auditioning without starving, trying to make it as a dancer on Broadway. His parents are proud and though a little sad to accept openly he isn&#39;t coming back to college, when he asks for his  college fund so he can keep going, they agree.  Process and timing and relationships all count.<br/>\n<br/>\nMy idea relating to my daughter was that she and a friend wanted to go to Europe alone when they were 16 and 17. We got excited too, encouraged the dream and suggested all sorts of resources for planning and choosing and getting ready to go, not just itinerary planning but driving versus rail transportation, the history of hostels, passport applications and travel bag selection, and communicating in words in pictures while they were gone, just on and on. So it was a wonderful project, a coming-of-age journey of almost two years rather than just the few weeks they actually spent there.<br/>\n<br/>\nSo what I&#39;m thinking is, the OP and her husband-youngest daughter can find some attitudes and approaches within these two experiences that might transform the way they&#39;re thinking about what&#39;s happening, even if it doesn&#39;t change what&#39;s happening.  :)  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; A few considerations that popped to mind include: </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Moving out","postDate":"1256905508","msgId":41966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGQTYzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":41962,"nextInTopic":41972,"prevInTime":41965,"nextInTime":41967,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"A few considerations that popped to mind include: at 17, she can t get her own apartment without a legal adult s name on the lease (yours/hubby s most likely).","messageBody":"<div id=\"ygrps-yiv-1393989180\">A few considerations that popped to mind include: at 17, she can&#39;t get<br/>\nher own apartment without a legal adult&#39;s name on the lease<br/>\n(yours/hubby&#39;s most likely). That would mean you are on the hook for the<br/>\nrent should she have trouble making enough money to pay it. Could your<br/>\nDH be concerned about that extra financial responsibility (supporting<br/>\ntwo households when it&#39;s hard enough to manage one these days). Full<br/>\ntime jobs (the kind that can support an apartment, utilities, food, etc)<br/>\nmight be difficult to get if high school typically ends at 18 where you<br/>\nlive. A &quot;small college fund&quot; might give her enough for apartment<br/>\nsecurity deposit (first/last month&#39;s rent) and setting up utilities but<br/>\nis it enough to carry her for 6 months while she looks for work and gets<br/>\na bank account built up? (could be, I don&#39;t know) Just thinking that<br/>\nthese may be among the concerns on your DH&#39;s mind.<br/>\n<br/>\nSo, maybe, sit down with your DD and help her figure out what a<br/>\nrealistic budget is (if that hasn&#39;t already happened) - how much would<br/>\nan average studio apartment cost in her chosen area (studios are usually<br/>\nthe cheapest)? How much is the security deposit? How much would<br/>\nutilities (electric, heat, etc) cost per month? How much is charged for<br/>\nsetting up the utility accounts (if anything)? Food is usually the most<br/>\nflexible (we&#39;ve lived on beans, rice, canned tomato sauce and cereal a<br/>\ntime or two over the years) but what&#39;s realistic for a simple, healthy<br/>\namount of food (at least a couple meals per day). What about<br/>\ntransportation needs (whether it&#39;s car insurance, gas, etc or bus pass<br/>\nor whatever in that area)? Then look at potential jobs in that area that<br/>\nshe might get - do they pay anywhere near what she needs to meet that<br/>\nbudget? Assume that she WILL be moving out and help her to move in that<br/>\ndirection - the timing might just need a little adjustment as to when<br/>\nshe has her OWN place (sharing with others would split expenses at<br/>\nleast). Maybe even suggest sharing an apartment for a time.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Moving out","postDate":"1256860910","msgId":41962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkxMDI5MTcwMXQ3MWEwMWM3ZHFjM2RjNjNiMjJkNTJkMmM0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhjZDdpaCtnZWp1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhjZDdpaCtnZWp1QGVHcm91cHMuY29tPg=="},"prevInTopic":41960,"nextInTopic":41966,"prevInTime":41961,"nextInTime":41963,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"... ***What are his concerns? Is he afraid that by supporting this choice he is hurting her in someway? Would he be supporting her if she were living at home? ","messageBody":"<div id=\"ygrps-yiv-152400306\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Her plan is to find a job and her own apartment there. Since this is what<br/>\n&gt; she wants, I would like to support her in doing this; including making her<br/>\n&gt; small college fund available, since that is what she has asked for. My<br/>\n&gt; husband does not believe that she is ready to be on her own and does not<br/>\n&gt; want to give her the college fund money until she is older (and preferably<br/>\n&gt; attending college, although he accepts that she may not choose to go to<br/>\n&gt; college).<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***What are his concerns? Is he afraid that by supporting this choice he is<br/>\nhurting her in someway? Would he be supporting her if she were living at<br/>\nhome?<br/>\n<br/>\nIf she is wanting to be on her own she is ready. She just may need a varying<br/>\ndegree of support for that venture than if she were older or more<br/>\nexperienced.<br/>\n<br/>\n-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am looking for ideas on how to support her while also addressing my<br/>\n&gt; husband&#39;s concerns.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***What does your daughter want? How does she need or want to be supported?<br/>\nCan you three sit down and brain storm so ideas?<br/>\n<br/>\nWhen we have two divergent (or seemingly) needs in our family we talk it<br/>\nout. We set our needs out openly. She wants X and He wants Y. Where are<br/>\nthe similarities in their needs and where do they differ? Like they both<br/>\nwant her to have a safe place to live. Then figure out how to meet both<br/>\nneeds. Many times this can be done with no compromise. Sometimes just the<br/>\nact of talking it through does wonders.<br/>\n<br/>\n<br/>\nMy 12 year old is ready to travel the world. I am not quite as ready as she<br/>\nis. So together we have been looking for ways that she can have her own<br/>\nadventures and explore some bigger things on her own or with others outside<br/>\nher immediate family. It has taken many dialogs to come up with solutions.<br/>\nWe have tried several things. Some worked some needed to be reworked.<br/>\n<br/>\n-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\nFaith<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":275193975,"authorName":"blue_mountain34","from":"&quot;blue_mountain34&quot; &lt;blue_mountain34@...&gt;","profile":"blue_mountain34","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Moving out","postDate":"1256858001","msgId":41960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjZDdpaCtnZWp1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41962,"prevInTime":41959,"nextInTime":41961,"topicId":41960,"numMessagesInTopic":0,"msgSnippet":"Our family has been unschooling for about 3 years. Prior to learning about unschooling, we were very relaxed homeschoolers, and parented traditionally. Our","messageBody":"<div id=\"ygrps-yiv-454941358\">Our family has been unschooling for about 3 years. Prior to learning about unschooling, we were very relaxed homeschoolers, and parented traditionally. <br/>\n<br/>\nOur youngest is 17, and for a couple of years has been talking about moving out. A week ago, she started living with some friends who attend college in a town several hours from here. <br/>\n<br/>\nHer plan is to find a job and her own apartment there. Since this is what she wants, I would like to support her in doing this; including making her small college fund available, since that is what she has asked for. My husband does not believe that she is ready to be on her own and does not want to give her the college fund money until she is older (and preferably attending college, although he accepts that she may not choose to go to college).<br/>\n<br/>\nI am looking for ideas on how to support her while also addressing my husband&#39;s concerns. He very much agrees with unschooling in terms of not using curriculum but he has a harder time with letting go of the traditional approach in other aspects of family life. He does not yet see that we are partners with our daughter, nor that our role is one of helping her get what she wants.<br/>\n<br/>\nHe and I discuss unschooling chores, food, trust etc., we attended one unschooling conference 2 years ago, and I often (but not *too* often) send him various links from places like Joyce Fetteroll&#39;s and Sandra Dodd&#39;s sites that address his particular concerns as they arise.<br/>\n<br/>\nAny ideas welcome!<br/>\n<br/>\nMarie</div>","specialLinks":[]}],"prevTopicId":41982,"nextTopicId":41996}}