{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":69,"messages":[{"userId":72521049,"authorName":"Wendy E","from":"&quot;Wendy E&quot; &lt;mommytoluc@...&gt;","profile":"mommytoluc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Joanne....Re: Speaking of bedtimes....","postDate":"1088082904","msgId":950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiZWs0byt2MHZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQzOERCMzE3LUM1Q0QtMTFEOC1BQzk1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":947,"nextInTopic":951,"prevInTime":949,"nextInTime":951,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"I m sorry you feel this way Joanne...I really appreciated your comments and perspective...and you seemed pretty firm in your own opinions and agreeing to","messageBody":"<div id=\"ygrps-yiv-1681168529\">I&#39;m sorry you feel this way Joanne...I really appreciated your <br/>\ncomments and perspective...and you seemed pretty firm in your own <br/>\nopinions and &quot;agreeing to disagree&quot; stance a few post back.  I know <br/>\nwhen some don&#39;t &quot;agree to disagree&quot; and challenge your choices it is <br/>\ndifficult to keep a thick skin...especially when we are talking <br/>\nabout those dearest to us...our children.  This is a discussion <br/>\ngroup and people will discuss...and people state their views.  It is <br/>\ninteresting for me to get all different points of view.  I <br/>\npersonally feel you are still very eligible for inclusion...and I <br/>\ndon&#39;t think those who disagreed with you see you as ineligible <br/>\neither...they just had a different opinion than you.  Tolerance?  Is <br/>\nquestioning or disagreeing with your choice not tolerating you?  One <br/>\nthing I have learned is that sometimes you have to be the tolerant <br/>\none...tolerant that other people might not agree with everything you <br/>\ndo, KWIM?    Anyway, if you are still reading this and haven&#39;t <br/>\nunsubbed...thanks for your comments and I hope you stay on....<br/>\n<br/>\nWendy<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joanne Watson <br/>\n&lt;joannecwatson@c...&gt; wrote:<br/>\nI am leaving the group because my  <br/>\n<blockquote><span title=\"qreply\"> &gt; having bedtimes in my house has apparently made me ineligible for  <br/>\n&gt; tolerance and inclusion. </span></blockquote></div>","specialLinks":[]},{"userId":170260284,"authorName":"sandrewmama","from":"sandrewmama &lt;sandrewmama@...&gt;","profile":"sandrewmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088082133","msgId":947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMDAzQjA0LkU0NiVzYW5kcmV3bWFtYUBtY2hzaS5jb20+"},"prevInTopic":944,"nextInTopic":950,"prevInTime":946,"nextInTime":948,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"... Well, I wouldn t say we resolved it, exactly. Grandma and Grandpa have 13 grandchildren of which my son was #3 and the first boy. By the time he was six","messageBody":"<div id=\"ygrps-yiv-461819315\">on 6/24/04 3:02 AM, Robyn Coburn at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m interested to know how you resolved this issue with Grandma. Obviously<br/>\n&gt; you have, or you wouldn&#39;t be allowing your dd to be over there. I&#39;m always<br/>\n&gt; keen to hear how people deal with these relatives whom they love, but have<br/>\n&gt; different philosophies, kind of banking this wisdom for the future.<br/>\n<br/>\n<br/>\n </span></blockquote>Well, I wouldn&#39;t say we resolved it, exactly.<br/>\n<br/>\nGrandma and Grandpa have 13 grandchildren of which my son was #3 and the<br/>\nfirst boy. By the time he was six and trying to sleep-over I figure at least<br/>\nseven of the thirteen grandchildren had been born and had already slept over<br/>\nat Grandmas.  Most all of the other granchildren besides mine, started<br/>\nregular sleep-overs at Grandma&#39;s within their first 6 months of life,<br/>\nwhether they liked it or not.<br/>\n<br/>\nOur family is the only one of the seven (in my husband&#39;s family) who did any<br/>\nof the following: were vegetarian, used a nurse-midwife, had natural<br/>\nchildbirth, came home within 6 hours of birth, practiced the family bed,<br/>\nbreastfed exclusively for 12+ months, extended nursed, didn&#39;t vaccinate,<br/>\nattachment parented, used a sling, didn&#39;t participate in church and<br/>\nhomeschooled.  <br/>\n<br/>\nMy mother and father-in-law must&#39;ve thought I was from a different planet<br/>\nand had come to abduct their beloved son and grandchildren!<br/>\n<br/>\nKeeping all that in mind, I must say that that Grandma is the most warm and<br/>\nloving of the three that my children have (or have had -- step-Grandma<br/>\npassed away).  She gets down on the floor and really plays with the kids,<br/>\nfinds fun kitchen projects for little ones to &quot;help&quot; with, gives lots of<br/>\nhugs and attends pretty much all events she&#39;s invited to. They have one of<br/>\nthe most grandchild-friendly homes I&#39;ve seen.<br/>\n<br/>\nDd is also a completely different child than her older brother.  She is<br/>\nfiercely independent, driven to be bigger and older than the rest in spite<br/>\nof her placement as #8 in the cousin lineup and she has a special bond with<br/>\nGrandma that older brother never developed.<br/>\n<br/>\nSo, with differences in personality along with our experience and knowledge<br/>\nof what to expect, dd was much better prepared to succeed with her first<br/>\novernight attempt.  We didn&#39;t try to change Grandma, we just made sure dd<br/>\nwas ready.<br/>\n<br/>\nChris</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Speaking of bedtimes....","postDate":"1088078515","msgId":944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEQzOERCMzE3LUM1Q0QtMTFEOC1BQzk1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":943,"nextInTopic":947,"prevInTime":943,"nextInTime":945,"topicId":890,"numMessagesInTopic":0,"msgSnippet":" Well I had asked Joanne a question about one of her posts regarding teens - a clarification really, of the phrase of course -","messageBody":"<div id=\"ygrps-yiv-1017043871\">&lt;&lt;&lt;I am leaving the group.&gt;&gt;&gt;<br/>\n<br/>\nWell I had asked Joanne a question about one of her posts regarding teens -<br/>\na clarification really, of the phrase &quot;of course&quot; - since my dd is 4.5 and I<br/>\ndon&#39;t know much about teens. I guess she won&#39;t be around to answer it. <br/>\n<br/>\nI can ask a different version generally to the list, however.<br/>\n<br/>\nI am wondering if people&#39;s experiences have been that the tolerance of or<br/>\ndesire for routines (of any sort) have increased or decreased as kids become<br/>\nteens/adolescents. Do they simply become the opposite of what they were as<br/>\nyoungsters, or do those traits intensify, or are the experiences so widely<br/>\nvarying that there is no predicting. I am referring to routines that are<br/>\ninitiated by the child in question, not imposed upon them, *of course*.<br/>\n<br/>\nAt the close of my last lengthy bedtime post, I wrote about Jayn growing out<br/>\nof her current diurnal rhythm. So I started thinking about changes that can<br/>\nbe expected, or not at all expected, and then I was re-reading Joanne&#39;s<br/>\nbedtime post...and so I started to wonder....Jayn has no set routines of any<br/>\nkind. Nor do I, other than to stave off a later headache by having a cup of<br/>\ncoffee when I wake up. Nor does dh, as far as I can tell (he is a classic<br/>\nGemini, I gather). Maybe if I am more mindful of searching for them, I might<br/>\nfind some. Jayn is the happiest, least moody child I know. I don&#39;t want to<br/>\nstart trying to fix what ain&#39;t broke.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088076989","msgId":943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEM2QkIwMTk1LUM1MEItMTFEOC04QTU4LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":942,"nextInTopic":944,"prevInTime":942,"nextInTime":944,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-961267309\">&lt;&lt;&lt;10:00 is bedtime for the 13 year old.  She&#39;s much less into routines, <br/>\nof course  &gt;&gt;&gt;<br/>\n<br/>\nI&#39;m curious about the &quot;of course&quot;, since my dd is 4.5 and I have no<br/>\nexperience with teens. <br/>\n<br/>\nWhat do you mean?<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sleep at our home - Loooong","postDate":"1088076014","msgId":941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEM2QkIwMTk1LUM1MEItMTFEOC04QTU4LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":940,"nextInTopic":942,"prevInTime":940,"nextInTime":942,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"Here s what happens at our home. I should preface by saying that my dh presently has no work schedule that requires he sleep/wake by any clock other than his","messageBody":"<div id=\"ygrps-yiv-1671999640\">Here&#39;s what happens at our home. I should preface by saying that my dh<br/>\npresently has no work schedule that requires he sleep/wake by any clock<br/>\nother than his own choosing, so we are thankful that our whole life is<br/>\nprobably much more flexible than most. I also only have the one child.<br/>\n<br/>\nJayn (4.5) lives by a 26-28 hour day. This means that her sleep/wake<br/>\nschedule is pretty much always on a slow march around the clock. To a great<br/>\nextent that means mine is too. As a baby she slept 4 hour stretches from the<br/>\nget-go, sometimes more, so I got my rest back then. ;)<br/>\n<br/>\nIt has been in the last few months that naps have mostly disappeared from<br/>\nour life, although sometimes Jayn seems to use a nap as a tool to get back<br/>\nonto a day shift. If she catches a cold, as she did last week, she seems to<br/>\nsleep a little longer, accelerating the clock march. DH is the big nap taker<br/>\nhere now. I have never liked naps, and since having a baby just can&#39;t. It<br/>\nseems like every time you hear a story like some kid that wandered out into<br/>\nthe snow, the mother starts her interview with &quot;I was taking a nap.....&quot; I<br/>\nam twitchy and don&#39;t rest if I am in bed during the day and Jayn is not.<br/>\n<br/>\nShe and I are currently on a night shift. We stay in this mode for a few<br/>\ndays every 6 or so weeks, before Jayn suddenly &quot;flips&quot; back to really early<br/>\nmornings. Jayn gets up at about 3-4pm; I am usually up a couple of hours<br/>\nearlier and spending time with dh. We have been dashing outside to our pool<br/>\neach afternoon, often with our neighbor kids, taking advantage of the<br/>\ndaylight savings time. We are up all night (dinner is like an early lunch),<br/>\nand I usually start to wilt at about 5am. Jayn has been staying up until<br/>\nabout 7 or 8am. <br/>\n<br/>\nIn the course of all of us going to bed close to the same time, as occurs<br/>\nfor part of our cycle, we have a few practices. For example Jayn will nurse<br/>\nto sleep on the sofa, then I will carry her into bed, and dh and I go also,<br/>\ntalking together for a while before lights out. Another thing is for Jayn to<br/>\ncome to bed earlier with us, and quietly watch cartoons before nursing to<br/>\nsleep. This is great for when she is ready to sleep anytime between 11 and<br/>\nsay 2am, because she naturally settles and the cartoons are on for such a<br/>\nbrief period. I will come awake to realize she is sleeping and switch off<br/>\nthe set. We have tried this procedure when Jayn has not been tired and she<br/>\nhas watched cartoons for so long that they start to disturb both dh&#39;s and my<br/>\nsleep, not to mention her interrupting my sleep for me to get her snacks. <br/>\n<br/>\nWhen she is not tired late at night, therefore, she stays in the living room<br/>\nwith me, and dh goes to bed, usually around 2am if he has napped earlier, or<br/>\naround midnight. (He just said goodnight) We are fortunate that this old<br/>\napartment building is very sound proof. By their own admission, our<br/>\nneighbors never heard Jayn crying when she was younger. <br/>\n<br/>\nIf I am getting too tired, and hopefully before I become grouchy, I start to<br/>\nlet Jayn know how I am feeling. I will put on my pj&#39;s when I am ready, and<br/>\nwill lay down on the sofa to rest if it is clear to me that Jayn is still<br/>\nfull of energy. <br/>\n<br/>\nIf I can tell that she is starting to wilt, she may only need a few minutes<br/>\nof quiet before being ready to sleep. I will go to the bedroom, telling her<br/>\nI am very tired, and she will follow a few minutes later. The magic key here<br/>\nis that if she is tired she is happy for me to go to the bedroom, and<br/>\ndoesn&#39;t start calling out asking for things, or becoming afraid and lonely.<br/>\n<br/>\nThere are also times when Jayn is on a kind of reverse pattern. She awakens<br/>\nextremely early - like 3.30 or 4am. This is another time, when *I* feel more<br/>\ncomfortable if I go to the sofa while she plays in the living room, rather<br/>\nthan tossing fretfully in the bedroom. I can get her a snack, and she will<br/>\noften either watch tv or her dvd&#39;s, and I just put a pillow over my head and<br/>\ntime passes fast, until I am rested well enough. We then have a pretty<br/>\nnormal day, with outings, playdates, the park, visitors.<br/>\n<br/>\nThe great development is in Jayn starting to recognize her own cues and<br/>\ntiredness level. In the recent past she would just suddenly become whiney,<br/>\ncranky or even sometimes instantly frustrated to a fury by simple stuff in<br/>\nher playing. These have been very obvious signs to me that she was ready to<br/>\nsleep, and I start turning off lights (unless she protests) and offer<br/>\ncomfort and nursing. Now she has started initiating her own wind down<br/>\nprocess, changing her playing from various vigorous games, and loud and<br/>\ntalkative storytelling, to quiet computer games with gentle music, wanting<br/>\nto sit and draw, and recently requesting quiet music from the satellite to<br/>\ndance gently to instead of Tom and Jerry type cartoons. There is much less<br/>\nof the crying type of transition. These days she rarely wants to read as<br/>\npart of a wind down process - preferring reading for long periods in the<br/>\n&quot;day&quot;, followed by really enriched seeming role playing games with her<br/>\ndolls, derived from the characters.    <br/>\n<br/>\nWould I prefer that we lived a more normal schedule all the time? Sure,<br/>\npartly because it is somewhat physically grueling for me - less so now that<br/>\nI am not mentally fighting it - plus we sometimes have to miss stuff when<br/>\nJayn is sleeping through it. Partly because it is hard on dh to be<br/>\nrelatively isolated from us so much of the time. However, he also spends a<br/>\nlot of time out of the house doing stuff, regardless of whether Jayn and I<br/>\nare sleeping in. In fact sometimes he comes home around midday/lunchtime and<br/>\nwe are just getting up and it is perfect. Tonight we went for a &quot;night walk&quot;<br/>\naround our neighborhood, at Jayn&#39;s instigation. <br/>\n<br/>\nSometimes I think he has an exaggerated idea of how much Jayn&#39;s odd sleep<br/>\npatterns are really affecting his daily life. In the past it has made him<br/>\ngrumpier if I suggested this to him, so now I don&#39;t. We do a lot of talking<br/>\nabout how happy Jayn is, and I express my gratitude to him, and we are all<br/>\nhappier when he makes the effort to choose acceptance. <br/>\n<br/>\nOn the other hand, there is quite a lot that could be lost. Jayn and I get<br/>\nto spend a lot of time together without distractions. Since her friends are<br/>\nsleeping, they can&#39;t come over. Nor can I be getting on with housework in<br/>\nthe middle of the night. I mean the neighbors don&#39;t hear much, but I think<br/>\nturning on the Hoover might stretch the goodwill, not to mention dh&#39;s rest.<br/>\nThe kind of play that she does late in her day, the equivalent of after<br/>\ndinner, seems extra imaginative, exciting, creative, and full of connections<br/>\nbeing made. It seems to me that we have deeply bonding, wondrous<br/>\nconversations and games very easily.<br/>\n<br/>\nI just trust that this physical inborn thing of a longer diurnal rhythm is<br/>\nsomething that she will either naturally grow out of, or learn to adapt to<br/>\nin time, when she has the motivation to do so from wanting to engage in more<br/>\nactivities in the outside world.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":161813777,"authorName":"Joanne Watson","from":"Joanne Watson &lt;joannecwatson@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Speaking of bedtimes....","postDate":"1088074881","msgId":942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQzOERCMzE3LUM1Q0QtMTFEOC1BQzk1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4=","inReplyToHeader":"PDAxMjIwMWM0NTk0ZSQyYWFmOWUxMCQ2NTAxYThjMEBmbG9zc2llPg=="},"prevInTopic":941,"nextInTopic":943,"prevInTime":941,"nextInTime":943,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"Hi Sherri-Lee, Thanks for your friendly words and for trying to promote respect for freedom of choice and diversity.   I am leaving the group because my having","messageBody":"<div id=\"ygrps-yiv-1505565128\">Hi Sherri-Lee,<br/>\n<br/>\nThanks for your friendly words and for trying to promote respect for  <br/>\nfreedom of choice and diversity.   I am leaving the group because my  <br/>\nhaving bedtimes in my house has apparently made me ineligible for  <br/>\ntolerance and inclusion.<br/>\n<br/>\n  I wonder if all these people who are so passionate about knowing  <br/>\nwhat&#39;s right for everyone else&#39;s children are promoting this kind of  <br/>\narrogance and lack of tolerance in their own homes?  I would hope not.   <br/>\nIt&#39;s hard enough<br/>\nfor kids to learn arrogant behavior, but to have to be tired and  <br/>\narrogant simultaneously, now that could be a really rough road.  But  <br/>\nlike everything else, I guess they&#39;ll just have to sleuth that out for  <br/>\nthemselves.<br/>\n<br/>\nAnyway, thanks again for your kindness and respect.<br/>\n<br/>\nBlessings -<br/>\n<br/>\nJoanne<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wednesday, June 23, 2004, at 02:16  PM, Sherri-Lee Pressman wrote:<br/>\n<br/>\n&gt; Hi Joanne,<br/>\n&gt;<br/>\n&gt; I just wanted to say I hear what you are saying and respect your  <br/>\n&gt; choice. Sounds like you are doing what is right for your family and  <br/>\n&gt; they are thriving because of it.<br/>\n&gt;<br/>\n&gt; I to believe in more structure around bedtimes and food issues than  <br/>\n&gt; many purist unschoolers, maybe not as much as you (who&#39;s to know and  <br/>\n&gt; what does it matter?) but more than the people who go with no  <br/>\n&gt; resistrictions at all. I have loosened up on them a lot since joining  <br/>\n&gt; this list and others and have found positive benefits to doing that,  <br/>\n&gt; but for me my goal is not to remove all limits as that isn&#39;t what I  <br/>\n&gt; want.<br/>\n&gt;<br/>\n&gt; I am thinking that when my dd is finally ready to sleep in her own  <br/>\n&gt; room (who knows whent that will be) I *might* be ready to let go and  <br/>\n&gt; say to her that she can go to bed when she wants but I will still have  <br/>\n&gt; a time when she needs to be ready and in her room for quiet &gt; activities.<br/>\n&gt;<br/>\n&gt; The peace in our home is saying loudly that this is working for us now.<br/>\n&gt;<br/>\n&gt; Thanks for sharing your perspective,<br/>\n&gt;<br/>\n&gt; Sherri-Lee<br/>\n&gt; Looking for safe and natural health products?<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aloeessence.com\">http://www.aloeessence.com</a><br/>\n&gt;   ----- Original Message -----<br/>\n&gt;   From: Joanne Watson<br/>\n&gt;   To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;   Sent: Wednesday, June 23, 2004 10:40 AM<br/>\n&gt;   Subject: Re: [unschoolingbasics] Re: Speaking of bedtimes....<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   There is an underlying current of mutual respect for our own unique<br/>\n&gt;   ways and needs,<br/>\n&gt;   but in terms of health and care, I think it would be irresponsible of<br/>\n&gt;   me to be quite that<br/>\n&gt;   passive.  There are lots of things for her to learn through trial and<br/>\n&gt;   error.   Minimally, I think<br/>\n&gt;   I can locate health-related pitfalls  if she&#39;s not yet ready to<br/>\n&gt;   recognize them as such.  I<br/>\n&gt;   don&#39;t view setting these kinds of boundaries as being restrictive.  I<br/>\n&gt;   think I understand<br/>\n&gt;   that you do and I respect your perspective.  It comes from a loving<br/>\n&gt;   place and if it<br/>\n&gt;   works for you and your family, don&#39;t mess with it.<br/>\n&gt;<br/>\n&gt;   I was an over-protected child.  I am so careful to follow the old<br/>\n&gt;   wisdom about giving<br/>\n&gt;   children roots first, and then wings.  We&#39;re still on the roots  <br/>\n&gt; phase.<br/>\n&gt;   I let her go and I<br/>\n&gt;   trust, but I guide.  I am called to that kind of mothering.  How  <br/>\n&gt; could<br/>\n&gt;   I violate my basic<br/>\n&gt;   instincts when they are serving her so well so far?  Shouldn&#39;t a  <br/>\n&gt; change<br/>\n&gt;   be in response<br/>\n&gt;   to some unfulfilled needs of hers, some unhappiness?  Something she<br/>\n&gt;   asks of me?<br/>\n&gt;<br/>\n&gt;   Happy, Healthy, Safe, Free to be Herself- that&#39;s what I&#39;m seeing in  <br/>\n&gt; my<br/>\n&gt;   daughter.<br/>\n&gt;   I think children need to be cared for and nurtured.  I guess we all<br/>\n&gt;   have different ways of<br/>\n&gt;   addressing those need, which is cool.  This exchange has been<br/>\n&gt;   stimulating.<br/>\n&gt;<br/>\n&gt;   Peace-<br/>\n&gt;<br/>\n&gt;   Joanne<br/>\n&gt;<br/>\n&gt;   On Wednesday, June 23, 2004, at 12:52  PM, Valerie wrote:<br/>\n&gt;<br/>\n&gt;&gt; ****** It&#39;s all about choices - hers and yours. You deciding what<br/>\n&gt;&gt; she needs isn&#39;t possible, just as you would probably find it<br/>\n&gt;&gt; ludicrous if she told you what time you had to go to bed.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;         Yahoo! Groups Sponsor<br/>\n&gt;               ADVERTISEMENT<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ----------------------------------------------------------------------- <br/>\n&gt; -------<br/>\n&gt;   Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     a.. To visit your group on the web, go to:<br/>\n&gt;     <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n&gt;<br/>\n&gt;     b.. To unsubscribe from this group, send an email to:<br/>\n&gt;     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;     c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of  <br/>\n&gt; Service.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088064167","msgId":940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEJDRkY0MTIzLkRFNCVzYW5kcmV3bWFtYUBtY2hzaS5jb20+"},"prevInTopic":934,"nextInTopic":941,"prevInTime":939,"nextInTime":941,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1740593536\">&lt;&lt;&lt;Grandma&#39;s.  At age 4, we received a 4:00 a.m. call to pick him up from<br/>\nhis first attempt at sleeping over.  At age 6, he snuck down to Grandma&#39;s<br/>\nbasement around midnight, to secretly call us to pick him up.  It seemed<br/>\nthat Grandma was going to force him to stay in spite of his desire to come<br/>\nhome and she wasn&#39;t letting him call us! When we arrived he was crying and<br/>\nGrandma was obviously angry with him.-- Grrr!&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m interested to know how you resolved this issue with Grandma. Obviously<br/>\nyou have, or you wouldn&#39;t be allowing your dd to be over there. I&#39;m always<br/>\nkeen to hear how people deal with these relatives whom they love, but have<br/>\ndifferent philosophies, kind of banking this wisdom for the future. <br/>\n<br/>\nI am very distrustful of some other people in my family. Nothing on earth<br/>\nwould induce me to leave my daughter alone for five minutes with my MIL,<br/>\neven assuming she would willingly not smoke cigarettes in the closed room<br/>\nwith Jayn. Luckily Granny definitely wants to stay a phone visitor. <br/>\n<br/>\nMy mother has had a brain aneurism that has affected both her mental<br/>\ncompetence, and her physical ability to play. Even before that, her time<br/>\nwith Jayn was always lightly supervised by either dh or myself. Not because<br/>\nshe doesn&#39;t love Jayn to the ends of the earth but because I know how<br/>\ncontrolling and manipulating she is. (I was there for a long time) I think<br/>\nshe knows that if she ever raised a hand to Jayn, we would probably never<br/>\nallow her to see her again.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"ruekream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Speaking of bedtimes....","postDate":"1088037610","msgId":934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNmEwMWM0NTk4MyRjZWJkNTk0MCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PDZFMkE3RUU5LUM1M0MtMTFEOC1CRUQ1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":930,"nextInTopic":940,"prevInTime":933,"nextInTime":935,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"... be in response to some unfulfilled needs of hers, some unhappiness?  Something she asks of me? **In an earlier post you said she balks at having to go to","messageBody":"<div id=\"ygrps-yiv-1259895105\"><blockquote><span title=\"ireply\">&gt;&gt;Shouldn&#39;t a change<br/>\n </span></blockquote>be in response<br/>\nto some unfulfilled needs of hers, some unhappiness?  Something she<br/>\nasks of me?<br/>\n<br/>\n**In an earlier post you said she &quot;balks at having to go to bed&quot; at the<br/>\nbedtime you&#39;ve set for her.  Couldn&#39;t it be that she is expressing a need?<br/>\nThat she&#39;s asking something of you through her behavior?  ~Rue<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speaking of bedtimes....","postDate":"1088019501","msgId":928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiY203ZCtraGV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDllLmRhYWRiNDIuMmUwYWQ3NTNAYW9sLmNvbT4="},"prevInTopic":927,"nextInTopic":930,"prevInTime":927,"nextInTime":929,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"... Given  time, ... day to ... knowing our ... Oh, Kelly, I believe you in the long term, I m just afraid of the short term! We have a bunch of little things","messageBody":"<div id=\"ygrps-yiv-916739025\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Uh huh. But knowing what&#39;s right for someone else is impossible. <br/>\n </span></blockquote>Given  time, <br/>\n<blockquote><span title=\"ireply\"> &gt; she will figure out what&#39;s needed for her to function properly from <br/>\n </span></blockquote>day to  <br/>\n<blockquote><span title=\"ireply\"> &gt; day. Forcing sleep or food on someone only contributes to NOT <br/>\n </span></blockquote>knowing our  <br/>\n<blockquote><span title=\"ireply\"> &gt; bodies and how best to deal with problems. <br/>\n&gt;  <br/>\n&gt; It&#39;s trust. Trust her to know her body. And she&#39;ll trust in herself.<br/>\n&gt;  <br/>\n&gt; ~Kelly<br/>\n<br/>\n </span></blockquote>Oh, Kelly, I believe you in the long term, I&#39;m just afraid of the <br/>\nshort term! <br/>\n<br/>\nWe have a bunch of little things that make it hard for me to even <br/>\nwant to let go of controling bed time. Dh goes to sleep early and <br/>\ngets very stressed at noise upstairs. Caroline goes to sleep later <br/>\nand makes a ton of noise (we call it the manic hour before she goes <br/>\nto sleep) so it&#39;s hard for Mikey to go to sleep downstairs. <br/>\n<br/>\nWe have an exercise class that we go to in the mornings--we have to <br/>\nleave at 8:35 to get there on time. I love it, I feel sooo much <br/>\nbetter when I&#39;m exercising, I get to see friends. The kids have a <br/>\ngreat time--the babysitters are great, they like the other kids <br/>\nthere, yadda yadda yadda. <br/>\n<br/>\nI&#39;m afraid if I let Mikey stay up until he&#39;s ready to go to sleep, <br/>\nthere will be a period of time when he stays up late, wakes up late <br/>\nand we either miss class a bunch or I wake him up and he&#39;s grumpy and <br/>\nthe other kids and the babysitter have to deal with him. It&#39;s one <br/>\nthing for me to deal with it, but another to give a grumpy kid to <br/>\nsomeone else, kwim? <br/>\n<br/>\nAs far as getting ready for bed, I&#39;m finding that it&#39;s much, much <br/>\nbetter if I start much earlier than I&#39;d thought and ask Mikey what he <br/>\nwants to do first, try to suggest fun ways to do things, act silly, <br/>\netc. Last night I asked him what he wanted to do first, brushing <br/>\nteeth, putting on pjs or reading a story. He said all three, so I <br/>\nchanged his pjs while reading a story and dh brushed his teeth!<br/>\n<br/>\nI don&#39;t know if this makes sense (or is really obvious!), but things <br/>\nare a lot better since I moved away from a &quot;stop having fun it&#39;s time <br/>\nto take a bath, get into pjs, go to bed&quot; and more toward &quot;this is the <br/>\ntime of day when we play in the bathtub and change into clothes <br/>\nwithout zippers and buttons.&quot; Like, ya know, life is fun, esp. with <br/>\nbattery-operated toothbrushes shaped like fire engines and different <br/>\nflavors of toothpaste!<br/>\n<br/>\nSigh. I haven&#39;t exercised in a couple weeks because I&#39;ve been sick <br/>\nand then we were out of town and I&#39;m actually not really well yet. <br/>\nMaybe on the nights we don&#39;t have class the next day and in a couple <br/>\nweeks when I&#39;ve worked out more, I&#39;ll relax bedtimes. This is an area <br/>\nI need to take baby steps in otherwise I&#39;ll be so damn uptight that <br/>\nI&#39;d become a martyr: &quot;Fine, stay up late. It doesn&#39;t matter how much <br/>\nsleep I get...&quot;<br/>\n<br/>\n--aj, who started writing this many hours ago before a very fun trip <br/>\nto the park, despite the rain!</div>","specialLinks":[]},{"userId":170260284,"authorName":"sandrewmama","from":"sandrewmama &lt;sandrewmama@...&gt;","profile":"sandrewmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088018163","msgId":930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRkY0MTIzLkRFNCVzYW5kcmV3bWFtYUBtY2hzaS5jb20+","inReplyToHeader":"PDIwMDQwNjIzLjEyMzIxMi4xNzY4LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":928,"nextInTopic":934,"prevInTime":929,"nextInTime":931,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"on 6/23/04 1:32 PM, Deb Lewis at ddzimlew@juno.com wrote: ***... I only have one kid, so have limited experience helping two kids get comfortable and relaxed","messageBody":"<div id=\"ygrps-yiv-700396829\">on 6/23/04 1:32 PM, Deb Lewis at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> wrote:<br/>\n***...<br/>\n<br/>\nI only have one kid, so have limited experience helping two kids get<br/>\ncomfortable and relaxed enough that sleep seems welcome and friendly<br/>\ninstead of like the enemy of happy play it must seem to be.&lt;g&gt;<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\nDeb,<br/>\n<br/>\nI remember sleep as the enemy as a young child.  I have a vivid memory of<br/>\nsitting at the top our stairs, crying to be able to come down because I was<br/>\nnot tired and the grown-ups seemed to be having fun.<br/>\n<br/>\nYour nighttime routine sounds peaceful and much more like how I&#39;ve handled<br/>\nmy children&#39;s sleep.<br/>\n<br/>\nI learned early on, that there was nothing more frustrating for me than to<br/>\ntry to gentle a young child to sleep (we practiced co-sleeping) when I was<br/>\ntired and he/she was not!  Bedtime was so much more pleasant when I waited<br/>\nuntil I was sure my little one was ready for sleep.  Now that my two are<br/>\nolder, they still follow their bodie&#39;s signals for sleep and they also<br/>\nrespect that come 10:00 p.m. Mommy needs quiet time and to be able to go to<br/>\nsleep if I am ready.  Ds finds something quiet to do in his room until he is<br/>\nready to sleep and dd usually wants to be tucked in before I go to bed.  On<br/>\nthe rare occassion she isn&#39;t sleepy, she plays quietly until she is.<br/>\n<br/>\nBoth my kids nursed and practiced co-sleeping past age 5.  Just recently, dd<br/>\nhas started going to sleep in her own bed -- her motivation was that she<br/>\nwanted to be able to go on sleepovers at Grandma&#39;s and Grandma doesn&#39;t do<br/>\nco-sleeping!  We&#39;d learned the hard way, with older ds, that being able to<br/>\nsleep happily in your own bed was a necessity for sleeping over at<br/>\nGrandma&#39;s.  At age 4, we received a 4:00 a.m. call to pick him up from his<br/>\nfirst attempt at sleeping over.  At age 6, he snuck down to Grandma&#39;s<br/>\nbasement around midnight, to secretly call us to pick him up.  It seemed<br/>\nthat Grandma was going to force him to stay in spite of his desire to come<br/>\nhome and she wasn&#39;t letting him call us! When we arrived he was crying and<br/>\nGrandma was obviously angry with him.-- Grrr!<br/>\n<br/>\nDd&#39;s first sleepover was much different.  She happily went to bed in her own<br/>\nbed there and slept all night.<br/>\n<br/>\nThanks for the memories!<br/>\n<br/>\nChris<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speaking of bedtimes....","postDate":"1088016828","msgId":927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiY2pqcytwaTRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3QTU0MjY2LUM1M0QtMTFEOC1CRUQ1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":925,"nextInTopic":928,"prevInTime":926,"nextInTime":928,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"... a ... ****** I agree to disagree. :-) love, Valerie","messageBody":"<div id=\"ygrps-yiv-702518930\"><blockquote><span title=\"ireply\">&gt; Is it okay if we agree to disagree?  I do hear you, and I don&#39;t <br/>\n&gt; challenge your ideals as being invalid.<br/>\n&gt; I just don&#39;t share them.  I hope that&#39;s okay.  You seem like such <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; loving, enlightened soul.   What can<br/>\n&gt; we learn from each other?<br/>\n&gt; <br/>\n&gt; Peace-<br/>\n&gt; <br/>\n&gt; Joanne<br/>\n<br/>\n </span></blockquote>****** I agree to disagree. :-)  <br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088015532","msgId":923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIzLjEyMzIxMi4xNzY4LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":922,"nextInTopic":925,"prevInTime":922,"nextInTime":924,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"***...I just feel the need to start the bedtime ball rolling at a reasonable hour...Sometimes we have things go pretty smoothly, and other times it ends up","messageBody":"<div id=\"ygrps-yiv-244044253\">***...I just feel the need to start the bedtime ball <br/>\nrolling at a reasonable hour...Sometimes we have things go pretty <br/>\nsmoothly, and other times it ends up being a real frustrating <br/>\nventure trying to get the bath, PJs, teeth brushed, in bed, story <br/>\nnegotiations, etc.... ***<br/>\n<br/>\nWhen Dylan was little I had a ritual more for his dad and I than for him.<br/>\n His dad always went to bed before the rest of us so I&#39;d calm the house. <br/>\n I&#39;d get the dishes done and pick up a little so that I could relax.  I&#39;d<br/>\ndim the lights and turn the TV down.  We had a very small house in those<br/>\ndays and we made an effort to be quiet while David was falling asleep.  <br/>\n<br/>\nWhen I noticed Dylan was starting to rub the back of his head, or twirl<br/>\nhis hair with one little finger, I knew he was getting tired.  I didn&#39;t<br/>\nsay &quot;time for bed&quot; I just helped him get comfortable and fall asleep when<br/>\nhe was ready.  <br/>\n<br/>\nWith the house calm and quiet and dim I&#39;d say &quot;lets get into our jammies<br/>\nand get cozy on the couch.&quot;   <br/>\nSometimes we&#39;d have hot chocolate and read.  Sometimes we&#39;d watch TV. <br/>\nDylan nursed until he was almost four so sometimes after the house was<br/>\nquiet and things were settling down he&#39;d want to nurse and he&#39;d fall<br/>\nasleep.  Sometimes we&#39;d just snuggle on the couch until he fell asleep or<br/>\nuntil he asked to go sleep with Daddy.  <br/>\n<br/>\nI waited for signs from Dylan that he was tired and I helped him relax. <br/>\nI didn&#39;t make him go to bed, and some nights when sleep didn&#39;t come<br/>\neasily I&#39;d do what I could to keep him happy.   <br/>\n<br/>\nI have this idea that peace is as good for us as sleep.  If my goal was<br/>\nhelping him find restful sleep so he could feel good and be healthy, then<br/>\ncreating a situation (in order to get him to sleep)  where we were<br/>\nstressing and unhappy seemed contrary to that goal.  <br/>\n<br/>\nI only have one kid, so have limited experience helping two kids get<br/>\ncomfortable and relaxed enough that sleep seems welcome and friendly<br/>\ninstead of like the enemy of happy play it must seem to be.&lt;g&gt;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":86288922,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;s-lp@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Speaking of bedtimes....","postDate":"1088014568","msgId":922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjIwMWM0NTk0ZSQyYWFmOWUxMCQ2NTAxYThjMEBmbG9zc2llPg==","referencesHeader":"PDZFMkE3RUU5LUM1M0MtMTFEOC1CRUQ1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":919,"nextInTopic":923,"prevInTime":921,"nextInTime":923,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"Hi Joanne, I just wanted to say I hear what you are saying and respect your choice. Sounds like you are doing what is right for your family and they are","messageBody":"<div id=\"ygrps-yiv-1988398354\">Hi Joanne,<br/>\n<br/>\nI just wanted to say I hear what you are saying and respect your choice. Sounds like you are doing what is right for your family and they are thriving because of it.<br/>\n<br/>\nI to believe in more structure around bedtimes and food issues than many purist unschoolers, maybe not as much as you (who&#39;s to know and what does it matter?) but more than the people who go with no resistrictions at all. I have loosened up on them a lot since joining this list and others and have found positive benefits to doing that, but for me my goal is not to remove all limits as that isn&#39;t what I want.<br/>\n<br/>\nI am thinking that when my dd is finally ready to sleep in her own room (who knows whent that will be) I *might* be ready to let go and say to her that she can go to bed when she wants but I will still have a time when she needs to be ready and in her room for quiet activities. <br/>\n<br/>\nThe peace in our home is saying loudly that this is working for us now.<br/>\n<br/>\nThanks for sharing your perspective,<br/>\n<br/>\nSherri-Lee<br/>\nLooking for safe and natural health products?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aloeessence.com\">http://www.aloeessence.com</a><br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Joanne Watson <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, June 23, 2004 10:40 AM<br/>\n  Subject: Re: [unschoolingbasics] Re: Speaking of bedtimes....<br/>\n<br/>\n<br/>\n  There is an underlying current of mutual respect for our own unique <br/>\n  ways and needs,<br/>\n  but in terms of health and care, I think it would be irresponsible of <br/>\n  me to be quite that<br/>\n  passive.  There are lots of things for her to learn through trial and <br/>\n  error.   Minimally, I think<br/>\n  I can locate health-related pitfalls  if she&#39;s not yet ready to <br/>\n  recognize them as such.  I<br/>\n  don&#39;t view setting these kinds of boundaries as being restrictive.  I <br/>\n  think I understand<br/>\n  that you do and I respect your perspective.  It comes from a loving <br/>\n  place and if it<br/>\n  works for you and your family, don&#39;t mess with it.<br/>\n<br/>\n  I was an over-protected child.  I am so careful to follow the old <br/>\n  wisdom about giving<br/>\n  children roots first, and then wings.  We&#39;re still on the roots phase.  <br/>\n  I let her go and I<br/>\n  trust, but I guide.  I am called to that kind of mothering.  How could <br/>\n  I violate my basic<br/>\n  instincts when they are serving her so well so far?  Shouldn&#39;t a change <br/>\n  be in response<br/>\n  to some unfulfilled needs of hers, some unhappiness?  Something she <br/>\n  asks of me?<br/>\n<br/>\n  Happy, Healthy, Safe, Free to be Herself- that&#39;s what I&#39;m seeing in my <br/>\n  daughter.<br/>\n  I think children need to be cared for and nurtured.  I guess we all <br/>\n  have different ways of<br/>\n  addressing those need, which is cool.  This exchange has been <br/>\n  stimulating.<br/>\n<br/>\n  Peace-<br/>\n<br/>\n  Joanne<br/>\n<br/>\n  On Wednesday, June 23, 2004, at 12:52  PM, Valerie wrote:<br/>\n<br/>\n  &gt; ****** It&#39;s all about choices - hers and yours. You deciding what<br/>\n  &gt; she needs isn&#39;t possible, just as you would probably find it<br/>\n  &gt; ludicrous if she told you what time you had to go to bed.<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":161813777,"authorName":"Joanne Watson","from":"Joanne Watson &lt;joannecwatson@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Speaking of bedtimes....","postDate":"1088012933","msgId":919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3QTU0MjY2LUM1M0QtMTFEOC1CRUQ1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4=","inReplyToHeader":"PGNiY2NuYyttOGpzQGVHcm91cHMuY29tPg=="},"prevInTopic":918,"nextInTopic":922,"prevInTime":918,"nextInTime":920,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"Valerie, I think we sort of decide together on various issues where the readiness lies.  She asks for my trust and always receives it .  But where health and","messageBody":"<div id=\"ygrps-yiv-368198606\">Valerie,<br/>\n<br/>\nI think we sort of decide together on various issues where the <br/>\nreadiness lies.  She asks for my trust and always receives it .  But <br/>\nwhere health and safety conjoin,  I have the over-ride.<br/>\n<br/>\n  Ice cream for dinner every once in a while?  Fun.  Stay up to watch a <br/>\ngood flick every now<br/>\nand then?  Of course!  But routines can be nurturing and supportive.  <br/>\nYou can choose to view them all as<br/>\nrestrictive, but I would have a different perspective.   She&#39;s still a <br/>\nlittle girl, and she&#39;s growing up.  Maturity is<br/>\na process, not a proclamation.  I view setting boundaries as part of <br/>\nparenting.  This is just how I see it.<br/>\nIs it okay if we agree to disagree?  I do hear you, and I don&#39;t <br/>\nchallenge your ideals as being invalid.<br/>\nI just don&#39;t share them.  I hope that&#39;s okay.  You seem like such a <br/>\nloving, enlightened soul.   What can<br/>\nwe learn from each other?<br/>\n<br/>\nPeace-<br/>\n<br/>\nJoanne<br/>\n<blockquote><span title=\"qreply\"> On Wednesday, June 23, 2004, at 12:56  PM, Valerie wrote:<br/>\n<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joanne Watson<br/>\n&gt; &lt;joannecwatson@c...&gt; wrote:<br/>\n&gt;&gt; When the maturity kicks in, so will the trust.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Joanne<br/>\n&gt;<br/>\n&gt; ****** Am I misunderstanding this sentence? You won&#39;t trust her<br/>\n&gt; until she matures? Does that mean you decide when she&#39;s mature?<br/>\n&gt; Please correct me if I&#39;m wrong.<br/>\n&gt;<br/>\n&gt; love, Valerie<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":161813777,"authorName":"Joanne Watson","from":"Joanne Watson &lt;joannecwatson@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Speaking of bedtimes....","postDate":"1088012434","msgId":918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFMkE3RUU5LUM1M0MtMTFEOC1CRUQ1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4=","inReplyToHeader":"PGNiY2NmbysydHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":917,"nextInTopic":919,"prevInTime":917,"nextInTime":919,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"There is an underlying current of mutual respect for our own unique ways and needs, but in terms of health and care, I think it would be irresponsible of me to","messageBody":"<div id=\"ygrps-yiv-1640102858\">There is an underlying current of mutual respect for our own unique <br/>\nways and needs,<br/>\nbut in terms of health and care, I think it would be irresponsible of <br/>\nme to be quite that<br/>\npassive.  There are lots of things for her to learn through trial and <br/>\nerror.   Minimally, I think<br/>\nI can locate health-related pitfalls  if she&#39;s not yet ready to <br/>\nrecognize them as such.  I<br/>\ndon&#39;t view setting these kinds of boundaries as being restrictive.  I <br/>\nthink I understand<br/>\nthat you do and I respect your perspective.  It comes from a loving <br/>\nplace and if it<br/>\nworks for you and your family, don&#39;t mess with it.<br/>\n<br/>\nI was an over-protected child.  I am so careful to follow the old <br/>\nwisdom about giving<br/>\nchildren roots first, and then wings.  We&#39;re still on the roots phase.  <br/>\nI let her go and I<br/>\ntrust, but I guide.  I am called to that kind of mothering.  How could <br/>\nI violate my basic<br/>\ninstincts when they are serving her so well so far?  Shouldn&#39;t a change <br/>\nbe in response<br/>\nto some unfulfilled needs of hers, some unhappiness?  Something she <br/>\nasks of me?<br/>\n<br/>\nHappy, Healthy, Safe, Free to be Herself- that&#39;s what I&#39;m seeing in my <br/>\ndaughter.<br/>\nI think children need to be cared for and nurtured.  I guess we all <br/>\nhave different ways of<br/>\naddressing those need, which is cool.  This exchange has been <br/>\nstimulating.<br/>\n<br/>\nPeace-<br/>\n<br/>\nJoanne<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wednesday, June 23, 2004, at 12:52  PM, Valerie wrote:<br/>\n<br/>\n&gt; ****** It&#39;s all about choices - hers and yours. You deciding what<br/>\n&gt; she needs isn&#39;t possible, just as you would probably find it<br/>\n&gt; ludicrous if she told you what time you had to go to bed. </span></blockquote></div>","specialLinks":[]},{"userId":161813777,"authorName":"Joanne Watson","from":"Joanne Watson &lt;joannecwatson@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088011356","msgId":917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCNkY1MzY2LUM1MzktMTFEOC1CRUQ1LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4=","inReplyToHeader":"PDIwMDQwNjIzLjA5MDIwOC4xNzY4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":914,"nextInTopic":918,"prevInTime":916,"nextInTime":918,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"... I understand.  I read a book once that stayed with me called Everyday Blessings: The Inner Work of Mindful Parenting - and your philosophies seem","messageBody":"<div id=\"ygrps-yiv-1022520667\">On Wednesday, June 23, 2004, at 11:02  AM, Deb Lewis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t mind if you don&#39;t want to discuss it, but I don&#39;t see it as<br/>\n&gt; honoring my role as a parent.  I try to think of it as honoring my son <br/>\n&gt; as<br/>\n&gt; a fellow Earthling.<br/>\n<br/>\n </span></blockquote>I understand.  I read a book once that stayed with me called &quot;Everyday <br/>\nBlessings: The Inner Work of<br/>\nMindful Parenting&quot; - and your philosophies seem connected to much of <br/>\nwhat I read.  I like your perspective.<br/>\nMy girl has a lot of challenges socially and she will come to <br/>\nunderstand, in her own time, that she is more<br/>\npleasant company when properly rested and fed, and that she is happier <br/>\nwith herself as well.  I see it<br/>\nhappening, and I see myself as sort of a facilitator in that process <br/>\nrather than someone forcing my ways<br/>\non her.  She has come to trust me but is also in that adolescent phase <br/>\nof letting go of the reins and finding<br/>\nthings in her own ways.  I don&#39;t squelch her natural learning curve but <br/>\nI&#39;d like to think that I help her keep<br/>\nher balance a little while she&#39;s testing her wings.<br/>\n<br/>\nJoanne</div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speaking of bedtimes....","postDate":"1088009772","msgId":914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiY2NuYyttOGpzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI4RTc3QkQwLUM1MUItMTFEOC1BM0Q0LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":913,"nextInTopic":917,"prevInTime":913,"nextInTime":915,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"... ****** Am I misunderstanding this sentence? You won t trust her until she matures? Does that mean you decide when she s mature? Please correct me if I m","messageBody":"<div id=\"ygrps-yiv-1167827034\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joanne Watson <br/>\n&lt;joannecwatson@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; When the maturity kicks in, so will the trust.  <br/>\n&gt; <br/>\n&gt; Joanne<br/>\n<br/>\n </span></blockquote>****** Am I misunderstanding this sentence? You won&#39;t trust her <br/>\nuntil she matures? Does that mean you decide when she&#39;s mature? <br/>\nPlease correct me if I&#39;m wrong. <br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speaking of bedtimes....","postDate":"1088009528","msgId":913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiY2NmbysydHM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDllLmRhYWRiNDIuMmUwYWQ3NTNAYW9sLmNvbT4="},"prevInTopic":912,"nextInTopic":914,"prevInTime":912,"nextInTime":914,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"... But she would stay up all  night and be cranky the next day.  It s a quality of life issue.  I know she has seen the difference between the right  amount","messageBody":"<div id=\"ygrps-yiv-2079167738\"><blockquote><span title=\"ireply\">&gt; In a message dated 6/23/2004 8:37:07 AM Eastern Daylight Time,  <br/>\n&gt; joannecwatson@c... writes:<br/>\n<br/>\n </span></blockquote> But she would stay up all  night and be cranky the next day.  It&#39;s <br/>\na quality of life issue.  I know she has seen the difference between <br/>\nthe right  amount of sleep and not enough.<br/>\n  <br/>\n****** It&#39;s all about choices - hers and yours. You deciding what <br/>\nshe needs isn&#39;t possible, just as you would probably find it <br/>\nludicrous if she told you what time you had to go to bed. <br/>\n<br/>\nIf she has seen the difference between the &#39;right&#39; amount and <br/>\nthe &#39;wrong&#39; amount, then she&#39;ll figure out how much she needs and <br/>\nwhen, IF she&#39;s given the chance. There might be a few cranky days, <br/>\nbut wouldn&#39;t those few cranky days be better than the balking every <br/>\nnight? The balking is her way of telling you that she wants to own <br/>\nthe responsibility of when she sleeps. Trust her to follow her <br/>\nbody&#39;s messages. She&#39;ll find the quality of life she needs. <br/>\n<br/>\nLaurie stayed up all night for years. She&#39;s still a nightowl at <br/>\ntimes. She knew from a very early age that if she wanted to go <br/>\nsomewhere early the next morning, that she&#39;d need to go to bed at an <br/>\nearly hour the night before. She missed a few hours of sleep from <br/>\ntime-to-time, but all that did was tune her in better to what she <br/>\nneeded. No one had to tell her (and no one did) that she hadn&#39;t had <br/>\nenough sleep. <br/>\n<br/>\nWhen her crankiness reared its ugly head, I knew why it was <br/>\nhappening and let her figure out for herself that the crankiness was <br/>\na direct cause of not enough sleep. I remained calm and pleasant and <br/>\nlet her work through her discomfort...much like I would do with <br/>\nanother adult who hadn&#39;t gotten enough...uhm... sleep &lt;g&gt;. Common <br/>\nsense told her that it was totally up to her to decide when to sleep <br/>\nand for how long and totally her &#39;fault&#39; when she didn&#39;t get enough. <br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":165509949,"authorName":"Andrea","from":"&quot;Andrea&quot; &lt;andrealynn@...&gt;","profile":"tobinsmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088009342","msgId":925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0NTk0MiQwMTI1ZTFmMCQwMjAwYThjMEBXdW5qbz4=","inReplyToHeader":"PDllLmRhYWRiNDIuMmUwYWQ3NTNAYW9sLmNvbT4="},"prevInTopic":923,"nextInTopic":927,"prevInTime":924,"nextInTime":926,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"My son, who is now 4 has always gone to bed around 9:30.  I am an early bird, and so this has been a little struggle for me, but time and time again I have","messageBody":"<div id=\"ygrps-yiv-972212911\">My son, who is now 4 has always gone to bed around 9:30.  I am an early<br/>\nbird, and so this has been a little struggle for me, but time and time<br/>\nagain I have seen him totally immersed and focused at those late hours.<br/>\nKnowing that his best learning time is late, I have done away with an<br/>\nactual time, but his natural rhythm is pretty consistent.  We do our<br/>\nbedtime routine around 9:00, usually with very little fuss and usually<br/>\nhe is still a bit wired and likes to jump on the bed etc.I&#39;m now<br/>\nthinking that if he has that much energy we should go for a short night<br/>\nhike (we live in the mountains) or go star gazing.  If I weren&#39;t so<br/>\ntired at 9:00 it would make it easier.  Sometimes, if he isn&#39;t so<br/>\nenergetic, he is content to read books in bed with us sleeping next to<br/>\nhim.  <br/>\n<br/>\n <br/>\n<br/>\nPeace,<br/>\n<br/>\n <br/>\n<br/>\nAndrea<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=1298dv937/M=298184.5022502.6152625.3001176/\">http://us.ard.yahoo.com/SIG=1298dv937/M=298184.5022502.6152625.3001176/</a><br/>\nD=groups/S=1705081972:HM/EXP=1088082080/A=2164339/R=0/SIG=11e2d64in/*htt<br/>\np:/www.netflix.com/Default?mqso=60183348&gt; click here<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=298184.5022502.6152625.3001176/D=group\">http://us.adserver.yahoo.com/l?M=298184.5022502.6152625.3001176/D=group</a><br/>\ns/S=:HM/A=2164339/rand=639386502&gt; <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*        To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n<br/>\n*        To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscrib<br/>\ne&gt; <br/>\n  <br/>\n<br/>\n*        Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166012225,"authorName":"Nichole in Round Rock","from":"&quot;Nichole in Round Rock&quot; &lt;skhosaeviani@...&gt;","profile":"ms_fausey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088005529","msgId":912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDYwMWM0NTkzOSQxYzc2NzYzMCQyZjAyYThjMEBGcmVlZG9tPg==","referencesHeader":"PDIwMDQwNjIzLjA5MDIwOC4xNzY4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":910,"nextInTopic":913,"prevInTime":911,"nextInTime":913,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"Beautiful post, Deb.  What about a single mom who is doing unschooling and has to be to work at a certain time while her children are with a trusted","messageBody":"<div id=\"ygrps-yiv-286052779\">Beautiful post, Deb.  What about a single mom who is doing unschooling and has to be to work at a certain time while her children are with a trusted unschooling mom or grandma?  I have some ideas, but would love to hear yours.<br/>\n<br/>\n:o)<br/>\nNichole<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Deb Lewis <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, June 23, 2004 10:02 AM<br/>\n  Subject: Re: [unschoolingbasics] Speaking of bedtimes....<br/>\n<br/>\n<br/>\n  ***What she likes to do takes precedence over what is good for her body<br/>\n  because of her age. ***<br/>\n<br/>\n  I like to think about this kind of extension of unschooling this way.  My<br/>\n  child didn&#39;t know how to read the moment he picked up a book, and didn&#39;t<br/>\n  suddenly gain an understanding of money the first time he paid for his<br/>\n  own juice at the store.   Learning is a process that takes just exactly<br/>\n  the amount of time it takes for each individual learner.   So learning<br/>\n  about what make us feel our very best doesn&#39;t happen all at once the<br/>\n  first time we eat protein or get eight hours of sleep.  I don&#39;t see<br/>\n  learning about his personal rhythms and needs as any different than<br/>\n  learning how to read.  It takes the amount of time it&#39;s going to take.  <br/>\n  So, I don&#39;t require him to read a certain amount during the day, or at<br/>\n  certain times, and I don&#39;t require him to sleep at certain times.  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088005206","msgId":910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQT0VBTUNOQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDIwMDQwNjIzLjA5MDIwOC4xNzY4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":908,"nextInTopic":912,"prevInTime":909,"nextInTime":911,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"I very much like what Deb wrote (thanks!)... My kids are learning about their own needs for sleep and their own bodies in much the way Deb described.  If I","messageBody":"<div id=\"ygrps-yiv-683290679\">I very much like what Deb wrote (thanks!)... My kids are learning about<br/>\ntheir own needs for sleep and their own bodies in much the way Deb<br/>\ndescribed.  If I were prescribing what I thought the amount of time should<br/>\nbe that they need to sleep or when they need to do it, I think they would<br/>\nlose their ability to be in touch and figure it out as they need to.  My son<br/>\nneeds a vastly lower amount of sleep as my daughter, even though he is 2 yrs<br/>\nyounger.  I do think that it helps for me to point out indicators I see that<br/>\nmight help them evaluate their needs, so I&#39;ll point out to them at night if<br/>\nthey&#39;re getting cranky, or rubbing their eyes, and we&#39;ll try to determine if<br/>\nit could be they&#39;re tired...we&#39;ll talk about what time they got up this<br/>\nmorning, was it super early?  I think my role can be to let them have<br/>\ncontrol and trust but also to help them find some indicators to help them.<br/>\nWhat I do is ask them to check in with their bodies, just like when my<br/>\ndaughter&#39;s urge to play overrides her willingness to take a few minutes to<br/>\nuse the potty - I might say &quot;I see lots of wiggling going on.  Usually that<br/>\nmeans your bladder is full&quot; and I ask her to check in with her bladder - She<br/>\ncould be wiggling for another reason - like excitement - so I wouldn&#39;t<br/>\npresume to tell her &quot;You need to go to the potty&quot;.  I wouldn&#39;t presume to<br/>\ntell my kids &quot;You need to go to bed&quot;.  If I do feel they are overtired, but<br/>\nwant to be with me, I just head to bed myself, and it almost never fails<br/>\nthat within 5 minutes they are sleeping peacefully beside me.<br/>\n<br/>\nMy daughter who is now 5.7 will often indicate verbally when she is tired<br/>\nand ready to fall asleep, and that is really what I&#39;d like to see.  I don&#39;t<br/>\nthink this type of realization comes suddenly from just her getting older, I<br/>\nthink it comes from her evaluating her needs over a period of time and<br/>\ngetting the chance to learn about her body with input from me.<br/>\n<br/>\nJoan<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Deb Lewis [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>]<br/>\nSent: Wednesday, June 23, 2004 11:02 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Speaking of bedtimes....<br/>\n<br/>\n<br/>\n***What she likes to do takes precedence over what is good for her body<br/>\nbecause of her age. ***<br/>\n<br/>\nI like to think about this kind of extension of unschooling this way.  My<br/>\nchild didn&#39;t know how to read the moment he picked up a book, and didn&#39;t<br/>\nsuddenly gain an understanding of money the first time he paid for his<br/>\nown juice at the store.   Learning is a process that takes just exactly<br/>\nthe amount of time it takes for each individual learner.</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088002928","msgId":908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIzLjA5MDIwOC4xNzY4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":906,"nextInTopic":910,"prevInTime":907,"nextInTime":909,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"***What she likes to do takes precedence over what is good for her body because of her age. *** I like to think about this kind of extension of unschooling","messageBody":"<div id=\"ygrps-yiv-1208853230\">***What she likes to do takes precedence over what is good for her body<br/>\nbecause of her age. ***<br/>\n<br/>\nI like to think about this kind of extension of unschooling this way.  My<br/>\nchild didn&#39;t know how to read the moment he picked up a book, and didn&#39;t<br/>\nsuddenly gain an understanding of money the first time he paid for his<br/>\nown juice at the store.   Learning is a process that takes just exactly<br/>\nthe amount of time it takes for each individual learner.   So learning<br/>\nabout what make us feel our very best doesn&#39;t happen all at once the<br/>\nfirst time we eat protein or get eight hours of sleep.  I don&#39;t see<br/>\nlearning about his personal rhythms and needs as any different than<br/>\nlearning how to read.  It takes the amount of time it&#39;s going to take.  <br/>\nSo, I don&#39;t require him to read a certain amount during the day, or at<br/>\ncertain times, and I don&#39;t require him to sleep at certain times.  <br/>\n<br/>\nThere are so many differences in people.  My husband can work all week,<br/>\ntwelve hour days, on six hours sleep a night, but if he could just sleep<br/>\nas long as he wanted every night he&#39;d sleep ten hours.<br/>\n<br/>\nI almost never sleep past four hours.  As a young teen I could sleep<br/>\nsixteen hours.  <br/>\n<br/>\nMy son has never much liked sleeping.  He only slept in two hour<br/>\nintervals as a baby.  As a toddler if he fell asleep during the day he<br/>\nwas extraordinarily crabby when he woke up.   Over the years he&#39;s needed<br/>\nsometimes ten hours sleep, sometimes eight hours.  It changes as he<br/>\nchanges.   He&#39;s twelve and lately enjoys staying up all night.  He goes<br/>\nto bed around five am and sleeps until noon.  <br/>\n<br/>\nMy thoughts are, first, I can&#39;t know which amount of sleep and at what<br/>\ntimes will make him feel his best.  I can only know I need my four hours.<br/>\n Lots of people have told me four hours isn&#39;t enough but that&#39;s seems to<br/>\nbe all my body wants.   I think sleep time changes alot for young people<br/>\nwho are still growing and they have different needs at different times in<br/>\ntheir lives.  I think my son could never learn to trust his own judgement<br/>\nabout how much sleep he&#39;ll need and what time he needs to go to bed to be<br/>\nup for some event if I am the one determining his sleep schedule.   I<br/>\ndon&#39;t have any expectation that he&#39;ll suddenly settle on eight hours of<br/>\nsleep during regular sleep hours, and I haven&#39;t made a judgement that<br/>\nwould be the best thing he could do.  I don&#39;t know what life has in store<br/>\nfor him, if he&#39;ll be a TV anchor who works all night or if he&#39;ll be an<br/>\noffice guy who has to be on the job at eight AM.   All I know is he has<br/>\nlot&#39;s of time to explore and learn about the sleep times that make him<br/>\nfeel his best.  I can give him that now while he&#39;s young and won&#39;t<br/>\noversleep for a job interview if he stays up all night.&lt;g&gt; <br/>\n<br/>\nI&#39;ve seen him change so much in twelve years that I don&#39;t expect the up<br/>\nall night, sleep &#39;til noon person he is today is the person he&#39;ll always<br/>\nbe.  But if it turns out he is an up all night person his whole life, I<br/>\nknow he&#39;ll find a life that fits who he is.   I really trust that he<br/>\nwants the best for himself.  His &quot;best&quot; might not look like the choices I<br/>\nwould make for myself, but then, he&#39;s not me.   He&#39;s his own person. <br/>\nHe&#39;s a really interesting person who&#39;s making a lot of wonderful<br/>\ndiscoveries about his world and about himself. <br/>\n<br/>\n***I don&#39;t want to debate over how we honor our roles as parents.***<br/>\n<br/>\nI don&#39;t mind if you don&#39;t want to discuss it, but I don&#39;t see it as<br/>\nhonoring my role as a parent.  I try to think of it as honoring my son as<br/>\na fellow Earthling.   No one else on earth needs me to tell them when to<br/>\nsleep and what to eat.  I don&#39;t believe that because my son came from my<br/>\nbody he needs me to determine what foods are best for him and what sleep<br/>\ntime is best any more than I believe he needs me to determine how much<br/>\nhistory he should learn or how many science books he should read.  <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":9543528,"authorName":"Dana Matt","from":"Dana Matt &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1088001399","msgId":906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIzMTQzNjM5LjM0NDk1LnFtYWlsQHdlYjQwNDA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNiYjVmdit0c3BnQGVHcm91cHMuY29tPg=="},"prevInTopic":905,"nextInTopic":908,"prevInTime":905,"nextInTime":907,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"Perhaps your children s internal clocks are no longer true to themselves, and that is why they will wake with less sleep than needed?  If you gave up control ","messageBody":"<div id=\"ygrps-yiv-1345315554\">Perhaps your children&#39;s internal clocks are no longer<br/>\ntrue to themselves, and that is why they will wake<br/>\nwith less sleep than needed?  If you gave up control<br/>\nfor &quot;only a week&quot;, or &quot;only a month&quot;, you might see<br/>\nthat they actually *do* get the amount of sleep that<br/>\n*they* need.  Other things that help are nice, dark<br/>\nwindow coverings, as I know I don&#39;t sleep well when<br/>\nit&#39;s light, even if I feel the need for more sleep.<br/>\n<br/>\nMy kids are 6 and almost 12, and have never had<br/>\nbedtimes implemented on them.  The kids and I co-sleep<br/>\nduring the week, and dad sleeps in another room as dad<br/>\nhas to get up at 3 am for work (POOR DAD!).  Dad also<br/>\nsleeps with us on the weekends.  We go to bed nightly<br/>\naround 11:30-1:30, and wake up any time from<br/>\n8:30-noon.  Usually, as I need a bit less sleep, I get<br/>\nup on the 8:30 side of things, and the kids sleep more<br/>\nuntil the 10:30-11 side of the morning, and I have all<br/>\nmorning to get the internet done, some laundry, drink<br/>\na cup or 8 of coffee, whatever...<br/>\n<br/>\nDana<br/>\nin Montana<br/>\n<br/>\n--- Wendy E &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mommytoluc@...\">mommytoluc@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Dare I open this can of worms?   I don&#39;t see this<br/>\n&gt; subject as <br/>\n&gt; specifically having to do with unschooling...but I<br/>\n&gt; too can see the <br/>\n&gt; value in letting go of (or changing my thinking<br/>\n&gt; about) some other <br/>\n&gt; things as I embrace the unschooling thing .... I<br/>\n&gt; think one of the <br/>\n&gt; things Pam said in her post was that things change<br/>\n&gt; over the course <br/>\n&gt; of time. I can totally see letting a somewhat older<br/>\n&gt; child choose <br/>\n&gt; when he will go to bed.  I have a 2yo. and 5 yo. and<br/>\n&gt; really feel the <br/>\n&gt; need to have them in bed by a reasonable hour for<br/>\n&gt; several <br/>\n&gt; reasons.   -Whether they go to bed at 8:30 or 11<br/>\n&gt; they seem to get up <br/>\n&gt; around the same time and it seems they have a better<br/>\n&gt; day if they are <br/>\n&gt; more rested.  -I want to get to sleep too!!!  -My<br/>\n&gt; husband and I need <br/>\n&gt; a bit of time in the evening for ourselves. If they<br/>\n&gt; are up, we are <br/>\n&gt; up...usually involved in whatever activity they<br/>\n&gt; are...and we also co-<br/>\n&gt; sleep.  I can see an older kid staying up and<br/>\n&gt; reading until he feels <br/>\n&gt; the need to go to bed, but I am pretty much done<br/>\n&gt; with &quot;you be the <br/>\n&gt; T.Rex and I&#39;ll be the Allosaurus&quot; when the sun goes<br/>\n&gt; down, KWIM?  <br/>\n&gt; So...those are my reasons for a somewhat imposed<br/>\n&gt; bedtime...I am sure <br/>\n&gt; I will get some arguements against this...and I am<br/>\n&gt; open to listening <br/>\n&gt; to them...but my actual question is...for those of<br/>\n&gt; you who DO have <br/>\n&gt; some kind of bedtime guideline for younger kids, how<br/>\n&gt; do (or did) you <br/>\n&gt; go about it?   I say &quot;somewhat&quot; imposed because we<br/>\n&gt; don&#39;t have a <br/>\n&gt; specific &quot;time&quot;...I just feel the need to start the<br/>\n&gt; bedtime ball <br/>\n&gt; rolling at a reasonable hour...Sometimes we have<br/>\n&gt; things go pretty <br/>\n&gt; smoothly, and other times it ends up being a real<br/>\n&gt; frustrating <br/>\n&gt; venture trying to get the bath, PJs, teeth brushed,<br/>\n&gt; in bed, story <br/>\n&gt; negotiations, etc....  Just wondering what other&#39;s<br/>\n&gt; experiences are <br/>\n&gt; in this area.<br/>\n&gt; <br/>\n&gt; Wendy<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------ Yahoo! Groups Sponsor<br/>\n&gt; --------------------~--&gt; <br/>\n&gt; Yahoo! Domains - Claim yours for only $14.70<br/>\n&gt;<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/Z1wmxD/DREIAA/yQLSAA/0xXolB/TM\">http://us.click.yahoo.com/Z1wmxD/DREIAA/yQLSAA/0xXolB/TM</a><br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>--------------------------------------------------------------------~-&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n&gt; <br/>\n&gt;      <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n </span></blockquote>__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - 50x more storage than other providers!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a></div>","specialLinks":[]},{"userId":170260284,"authorName":"sandrewmama","from":"sandrewmama &lt;sandrewmama@...&gt;","profile":"sandrewmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1087999032","msgId":905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRkVGNjY4LkQ5NiVzYW5kcmV3bWFtYUBtY2hzaS5jb20+","inReplyToHeader":"PEM2QkIwMTk1LUM1MEItMTFEOC04QTU4LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4="},"prevInTopic":904,"nextInTopic":906,"prevInTime":904,"nextInTime":906,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"We practiced co-sleeping with both kids until they chose to sleep in their own beds around the age of 7 and 6.  In our house, ds (13) and dd (6) start ","messageBody":"<div id=\"ygrps-yiv-146813532\">We practiced co-sleeping with both kids until they chose to sleep in their<br/>\nown beds around the age of 7 and 6.  In our house, ds (13) and dd (6) start<br/>\n&quot;heading&quot; to bed around 10:00.    Most nights this allows them time to enjoy<br/>\na late dinner with Dad and some play/talk time with him too.  Then he<br/>\nusually heads back into work.  Ds gladly heads up to his room then but often<br/>\nreads until midnight or 1:00 a.m.  Dd needs some help with bedtime routine,<br/>\nbrushing teeth, pajamas and we read a chapter or two from her book.  Then<br/>\nit&#39;s &quot;Good night, I love you, see you in the morning,&quot; and she&#39;s out within<br/>\n5 - 10 mins.    On the rare occasion that dd isn&#39;t ready to go to sleep<br/>\nshe&#39;s allowed to play quietly or read books in her room until she gets<br/>\nsleepy and then she climbs back into bed and falls asleep.<br/>\n<br/>\nDd almost always (just now) gets up before 9:00 a.m. on her own and we call<br/>\nup to ds at 9:00 to get him up.  We&#39;ve experimented with allowing him to<br/>\nwake up naturally but his whole schedule shifts several hours later (up &#39;til<br/>\n2:00 or 3:00 a.m. and sleeping in until 11:00 or noon) and then he is cranky<br/>\nand difficult to live with when we have activities that need him up ealier<br/>\nthan that (which is most days).  We decided to regulate the getting up time<br/>\nrather than the going to sleep time because: a) it&#39;s easier, I&#39;m already up<br/>\nin the morning to wake him but I&#39;m not up as late to make sure his lights<br/>\nare out; b) it just seems to make life more peaceful for all if he gets<br/>\nenough sleep and is up to pariticipate with the family acitivites.<br/>\n<br/>\nIncidentally, dh is not a good role model when it comes to self-regulation<br/>\nof sleep.  He is continually sleep-deprived.  He frequently stays up<br/>\nextremely late working (self-employed) or playing (out with friends, vegging<br/>\nin front of the TV, computer games etc.) and sleeps in when he can get away<br/>\nwith it [read: no pressing business deadlines or client meetings.]  OTOH, I<br/>\nam much more a creature of routine -- to sleep by 11:00 and up by 7:00<br/>\npretty much no matter what.<br/>\n<br/>\nFWIW,<br/>\n<br/>\nChris<br/>\n<br/>\non 6/23/04 6:52 AM, Joanne Watson at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joannecwatson@...\">joannecwatson@...</a> wrote:<br/>\n<br/>\n And over time I find myself observing other families and  their bedtime<br/>\nhabits too. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":161813777,"authorName":"Joanne Watson","from":"Joanne Watson &lt;joannecwatson@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1087998144","msgId":904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4RTc3QkQwLUM1MUItMTFEOC1BM0Q0LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4=","inReplyToHeader":"PDllLmRhYWRiNDIuMmUwYWQ3NTNAYW9sLmNvbT4="},"prevInTopic":902,"nextInTopic":905,"prevInTime":903,"nextInTime":905,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"When the maturity kicks in, so will the trust.  Right now it s okay for me to be her mother and help her learn about cause and affect as it applies to her own","messageBody":"<div id=\"ygrps-yiv-1090945644\">When the maturity kicks in, so will the trust.  Right now it&#39;s okay for <br/>\nme to be her mother and help<br/>\nher learn about cause and affect as it applies to her own biology so <br/>\nthat later on she&#39;ll be in a more<br/>\ninformed position to know what&#39;s right for her.  She loves sweets and <br/>\nloves to stay up all night.<br/>\nShe&#39;s a kid.  What she likes to do takes precedence over what is good <br/>\nfor her body because of<br/>\nher age.  Other kids are more into being responsible.  It&#39;s about <br/>\nknowing your own kid and<br/>\ngiving them the support  they need to get what they need rather than <br/>\nwhat they want.  I see<br/>\nthat as a function of being a parent.  Cool though if you don&#39;t.  I <br/>\ndon&#39;t want to debate over how<br/>\nwe honor our roles as parents.<br/>\n<br/>\nJoanne<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wednesday, June 23, 2004, at 08:53  AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n&gt; In a message dated 6/23/2004 8:37:07 AM Eastern Daylight Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joannecwatson@...\">joannecwatson@...</a> writes:<br/>\n&gt;<br/>\n&gt; 10:00 is  bedtime for the 13 year old.  She&#39;s much less into routines,<br/>\n&gt; of  course, and balks<br/>\n&gt; at having to go to bed.  But she would stay up all  night and be cranky<br/>\n&gt; the next day.  It&#39;s<br/>\n&gt; a quality of life  issue.  I know she has seen the difference between<br/>\n&gt; the right  amount<br/>\n&gt; of sleep and not enough.  And over time I find myself observing  other<br/>\n&gt; families and  their<br/>\n&gt; bedtime habits too.  I believe that  the right amount of sleep and the<br/>\n&gt; right meals really can<br/>\n&gt; make a world  of difference.&lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Uh huh. But knowing what&#39;s right for someone else is impossible. Given <br/>\n&gt;  time,<br/>\n&gt; she will figure out what&#39;s needed for her to function properly from <br/>\n&gt; day to<br/>\n&gt; day. Forcing sleep or food on someone only contributes to NOT knowing <br/>\n&gt; our<br/>\n&gt; bodies and how best to deal with problems.<br/>\n&gt;<br/>\n&gt; It&#39;s trust. Trust her to know her body. And she&#39;ll trust in herself.<br/>\n&gt;<br/>\n&gt; ~Kelly<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1087995219","msgId":902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDllLmRhYWRiNDIuMmUwYWQ3NTNAYW9sLmNvbT4="},"prevInTopic":898,"nextInTopic":904,"prevInTime":901,"nextInTime":903,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/23/2004 8:37:07 AM Eastern Daylight Time, joannecwatson@charter.net writes: 10:00 is  bedtime for the 13 year old.  She s much less into","messageBody":"<div id=\"ygrps-yiv-963131775\">In a message dated 6/23/2004 8:37:07 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joannecwatson@...\">joannecwatson@...</a> writes:<br/>\n<br/>\n10:00 is  bedtime for the 13 year old.  She&#39;s much less into routines, <br/>\nof  course, and balks<br/>\nat having to go to bed.  But she would stay up all  night and be cranky <br/>\nthe next day.  It&#39;s<br/>\na quality of life  issue.  I know she has seen the difference between <br/>\nthe right  amount<br/>\nof sleep and not enough.  And over time I find myself observing  other <br/>\nfamilies and  their<br/>\nbedtime habits too.  I believe that  the right amount of sleep and the <br/>\nright meals really can<br/>\nmake a world  of difference.&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nUh huh. But knowing what&#39;s right for someone else is impossible. Given  time, <br/>\nshe will figure out what&#39;s needed for her to function properly from day to  <br/>\nday. Forcing sleep or food on someone only contributes to NOT knowing our  <br/>\nbodies and how best to deal with problems. <br/>\n <br/>\nIt&#39;s trust. Trust her to know her body. And she&#39;ll trust in herself.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":161813777,"authorName":"Joanne Watson","from":"Joanne Watson &lt;joannecwatson@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1087991537","msgId":898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM2QkIwMTk1LUM1MEItMTFEOC04QTU4LTAwMDM5M0JDOEYyOEBjaGFydGVyLm5ldD4=","inReplyToHeader":"PDE1ZS4zMDkyYmY3NS4yZTBhYzdiZUBhb2wuY29tPg=="},"prevInTopic":897,"nextInTopic":902,"prevInTime":897,"nextInTime":899,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"We have a standard bedtime routine for my four year old.  I think she enjoys it very much. I read to her, then she has her cookies and milk, then she brushes","messageBody":"<div id=\"ygrps-yiv-1511562854\">We have a standard bedtime routine for my four year old.  I think she <br/>\nenjoys it very much.<br/>\nI read to her, then she has her cookies and milk, then she brushes her <br/>\nteeth, then feeds<br/>\nthe fish, and off to bed she goes with her dad.  They look out the <br/>\nwindow and say some<br/>\nappreciative things about the earth or the sky or the powers that be - <br/>\nit&#39;s pretty neat, really.<br/>\nKinda makes me want to be a kid again.  8:00 is bedtime for the 4 year <br/>\nold.<br/>\n<br/>\n10:00 is bedtime for the 13 year old.  She&#39;s much less into routines, <br/>\nof course, and balks<br/>\nat having to go to bed.  But she would stay up all night and be cranky <br/>\nthe next day.  It&#39;s<br/>\na quality of life issue.  I know she has seen the difference between <br/>\nthe right amount<br/>\nof sleep and not enough.  And over time I find myself observing other <br/>\nfamilies and  their<br/>\nbedtime habits too.  I believe that the right amount of sleep and the <br/>\nright meals really can<br/>\nmake a world of difference.<br/>\n<br/>\nJoanne<br/>\n<blockquote><span title=\"qreply\"> On Wednesday, June 23, 2004, at 07:47  AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; In a message dated 6/23/2004 1:55:48 AM Eastern Daylight Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mommytoluc@...\">mommytoluc@...</a> writes:<br/>\n&gt;<br/>\n&gt; So...those are my reasons for a somewhat imposed bedtime...I am sure<br/>\n&gt; I will get some arguements against this...and I am open to listening<br/>\n&gt; to them...but my actual question is...for those of you who DO have<br/>\n&gt; some kind of bedtime guideline for younger kids, how do (or did) you<br/>\n&gt; go about it?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Cameron had a strict bedtime (this was pre-unschooling), but he was <br/>\n&gt; also a<br/>\n&gt; kid who LOVED to sleep---he has always needed more sleep than the <br/>\n&gt; average Joe.<br/>\n&gt; Even now, he&#39;ll gladly take a nap. He&#39;s 16. Bedtime was never really an<br/>\n&gt; issue.  He usually fell asleep before seven each night (on his own) <br/>\n&gt; and not wake<br/>\n&gt; until  seven the next morning----and take 1-2 naps each day as a <br/>\n&gt; toddler!<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Duncan (8) has never had a bedtime. That doesn&#39;t mean that we didn&#39;t  <br/>\n&gt; let him<br/>\n&gt; &quot;slow down&quot; and have a &quot;bedtime ritual&quot;. When he was little and <br/>\n&gt; starting  to<br/>\n&gt; look tired, we would turn down the lights, rub his head, sing a few  <br/>\n&gt; songs,<br/>\n&gt; maybe read a book (or ten). We&#39;d yawn a lot! &lt;G&gt; He often  listened to <br/>\n&gt; books on<br/>\n&gt; tape or Jim Weiss stories on his CD player. He could call  us at any <br/>\n&gt; time. He<br/>\n&gt; could sleep whereever he wanted (our bed, his bed, his  brother&#39;s bed, <br/>\n&gt; the<br/>\n&gt; floor, the sofa, in a tent...). Often he&#39;d fall asleep in our  arms, <br/>\n&gt; and we&#39;d put<br/>\n&gt; him in his bed after he was asleep.<br/>\n&gt;<br/>\n&gt; But we would do the same things for *us*----so he associated these <br/>\n&gt; things<br/>\n&gt; with sleep.<br/>\n&gt;<br/>\n&gt; Lots of these folks still nurse their older kids---that&#39;s a nice segue <br/>\n&gt; into<br/>\n&gt; sleep.<br/>\n&gt;<br/>\n&gt; We&#39;ve always been respectful of sleeping people in our house----late<br/>\n&gt; sleepers, early sleepers, nappers----so everyone knows to be quiet <br/>\n&gt; when  someone&#39;s<br/>\n&gt; sleeping.<br/>\n&gt;<br/>\n&gt; It&#39;s hard when you&#39;re little and mom & dad seem to want time without  <br/>\n&gt; you.<br/>\n&gt; &quot;What could *they* be doing that excludes *me*??&quot; &lt;g&gt; If everyone  <br/>\n&gt; goes to sleep<br/>\n&gt; at the same time, there&#39;s no wondering &quot;what am I missing?&quot;   The <br/>\n&gt; older I<br/>\n&gt; get, the earlier I hit the sack, so noone&#39;s missing me! &lt;g&gt;  Often <br/>\n&gt; now, Duncan is<br/>\n&gt; still awake after I&#39;m long gone!<br/>\n&gt;<br/>\n&gt; Even as adults, it&#39;s nice to have things we do to help induce sleep. <br/>\n&gt; Let  him<br/>\n&gt; see *you* do that too.<br/>\n&gt;<br/>\n&gt; But forced bedtimes can result in not knowing when you&#39;re really tired.<br/>\n&gt; Forced awake in the morings will result in not knowing how much sleep <br/>\n&gt; your body<br/>\n&gt; actually needs. And every body is different.<br/>\n&gt;<br/>\n&gt; Knowing what you need; how your body feels when it&#39;s rested, full, or  <br/>\n&gt; needy;<br/>\n&gt;  what you want to learn, and how you want to learn it----   these are <br/>\n&gt; some of<br/>\n&gt; the biggest benefits of unschooling to me!<br/>\n&gt;<br/>\n&gt; ~Kelly<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speaking of bedtimes....","postDate":"1087991230","msgId":897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZS4zMDkyYmY3NS4yZTBhYzdiZUBhb2wuY29tPg=="},"prevInTopic":896,"nextInTopic":898,"prevInTime":896,"nextInTime":898,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/23/2004 1:55:48 AM Eastern Daylight Time, mommytoluc@yahoo.com writes: So...those are my reasons for a somewhat imposed bedtime...I am","messageBody":"<div id=\"ygrps-yiv-1431832250\">In a message dated 6/23/2004 1:55:48 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mommytoluc@...\">mommytoluc@...</a> writes:<br/>\n<br/>\nSo...those are my reasons for a somewhat imposed bedtime...I am sure  <br/>\nI will get some arguements against this...and I am open to listening  <br/>\nto them...but my actual question is...for those of you who DO have  <br/>\nsome kind of bedtime guideline for younger kids, how do (or did) you  <br/>\ngo about it? <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nCameron had a strict bedtime (this was pre-unschooling), but he was also a  <br/>\nkid who LOVED to sleep---he has always needed more sleep than the average Joe.  <br/>\nEven now, he&#39;ll gladly take a nap. He&#39;s 16. Bedtime was never really an <br/>\nissue.  He usually fell asleep before seven each night (on his own) and not wake <br/>\nuntil  seven the next morning----and take 1-2 naps each day as a toddler!<br/>\n <br/>\n <br/>\nDuncan (8) has never had a bedtime. That doesn&#39;t mean that we didn&#39;t  let him <br/>\n&quot;slow down&quot; and have a &quot;bedtime ritual&quot;. When he was little and starting  to <br/>\nlook tired, we would turn down the lights, rub his head, sing a few  songs, <br/>\nmaybe read a book (or ten). We&#39;d yawn a lot! &lt;G&gt; He often  listened to books on <br/>\ntape or Jim Weiss stories on his CD player. He could call  us at any time. He <br/>\ncould sleep whereever he wanted (our bed, his bed, his  brother&#39;s bed, the <br/>\nfloor, the sofa, in a tent...). Often he&#39;d fall asleep in our  arms, and we&#39;d put <br/>\nhim in his bed after he was asleep.<br/>\n <br/>\nBut we would do the same things for *us*----so he associated these things  <br/>\nwith sleep.<br/>\n <br/>\nLots of these folks still nurse their older kids---that&#39;s a nice segue into  <br/>\nsleep.<br/>\n <br/>\nWe&#39;ve always been respectful of sleeping people in our house----late  <br/>\nsleepers, early sleepers, nappers----so everyone knows to be quiet when  someone&#39;s <br/>\nsleeping.<br/>\n <br/>\nIt&#39;s hard when you&#39;re little and mom & dad seem to want time without  you. <br/>\n&quot;What could *they* be doing that excludes *me*??&quot; &lt;g&gt; If everyone  goes to sleep <br/>\nat the same time, there&#39;s no wondering &quot;what am I missing?&quot;   The older I <br/>\nget, the earlier I hit the sack, so noone&#39;s missing me! &lt;g&gt;  Often now, Duncan is <br/>\nstill awake after I&#39;m long gone!<br/>\n <br/>\nEven as adults, it&#39;s nice to have things we do to help induce sleep. Let  him <br/>\nsee *you* do that too. <br/>\n <br/>\nBut forced bedtimes can result in not knowing when you&#39;re really tired.  <br/>\nForced awake in the morings will result in not knowing how much sleep your body  <br/>\nactually needs. And every body is different. <br/>\n <br/>\nKnowing what you need; how your body feels when it&#39;s rested, full, or  needy; <br/>\n what you want to learn, and how you want to learn it----   these are some of <br/>\nthe biggest benefits of unschooling to me!<br/>\n <br/>\n~Kelly<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":58132404,"authorName":"MarSi77@aol.com","from":"MarSi77@...","profile":"m6hschch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  Speaking of bedtimes....","postDate":"1087989652","msgId":896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4LjViNzE3ZGQ1LjJlMGFjMTk0QGFvbC5jb20+"},"prevInTopic":890,"nextInTopic":897,"prevInTime":895,"nextInTime":897,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/23/2004 1:55:47 AM Eastern Daylight Time, ... ******* Here s my experience: Soon after we started unschooling I let go of bed TIMES. I was","messageBody":"<div id=\"ygrps-yiv-1107837528\">In a message dated 6/23/2004 1:55:47 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mommytoluc@...\">mommytoluc@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but my actual question is...for those of you who DO have <br/>\n&gt; some kind of bedtime guideline for younger kids, how do (or did) you <br/>\n&gt; go about it?   I say &quot;somewhat&quot; imposed because we don&#39;t have a <br/>\n&gt; specific &quot;time&quot;...I just feel the need to start the bedtime ball <br/>\n&gt; rolling at a reasonable hour...<br/>\n<br/>\n </span></blockquote>*******<br/>\n Here&#39;s my experience:   <br/>\n <br/>\n   Soon after we started unschooling I let go of bed TIMES. I was soon <br/>\noverwhelmed, as my kids ( 7 and 51/2 at the time) were up so late...sometimes <br/>\n11:30pm!...which led to many &quot;grouchy&quot; daytimes, not to mention never having a <br/>\n&quot;break&quot; from them . ( love them dearly but we all need our space &lt;&lt;G&gt;&gt;).<br/>\n <br/>\n  So then I started with them needing to be upstairs BY 9:30 and all ready <br/>\nfor bed <br/>\n( pj&#39;s, teeth,shower, etc) BUT they could do what they wanted until they were <br/>\nready for sleep. They did tend to choose quieter activities but still were <br/>\nawake until 10 or 11. It worked for me because I was able to have MY <br/>\ntime...adult time.( even though there still were many &quot;grouchy&quot; daytimes...hahahha).<br/>\n  <br/>\n  Ok...NOW...almost 6 months later... kids 8 (almost) and 6..they seem to <br/>\n&quot;get ready&quot; ON THEIR OWN when they are tired and are usually asleep soon after 9. <br/>\nThey have self-regulated their bedtimes!   Woohoo!  It DOES work!<br/>\nOf course there are the days that too many cool things are going on that they <br/>\ngo later but that&#39;s life!<br/>\n<br/>\n~Marcia Simonds<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":72521049,"authorName":"Wendy E","from":"&quot;Wendy E&quot; &lt;mommytoluc@...&gt;","profile":"mommytoluc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Speaking of bedtimes....","postDate":"1087969599","msgId":890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiYjVmdit0c3BnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":896,"prevInTime":889,"nextInTime":891,"topicId":890,"numMessagesInTopic":0,"msgSnippet":"Dare I open this can of worms?   I don t see this subject as specifically having to do with unschooling...but I too can see the value in letting go of (or","messageBody":"<div id=\"ygrps-yiv-457483615\">Dare I open this can of worms?   I don&#39;t see this subject as <br/>\nspecifically having to do with unschooling...but I too can see the <br/>\nvalue in letting go of (or changing my thinking about) some other <br/>\nthings as I embrace the unschooling thing .... I think one of the <br/>\nthings Pam said in her post was that things change over the course <br/>\nof time. I can totally see letting a somewhat older child choose <br/>\nwhen he will go to bed.  I have a 2yo. and 5 yo. and really feel the <br/>\nneed to have them in bed by a reasonable hour for several <br/>\nreasons.   -Whether they go to bed at 8:30 or 11 they seem to get up <br/>\naround the same time and it seems they have a better day if they are <br/>\nmore rested.  -I want to get to sleep too!!!  -My husband and I need <br/>\na bit of time in the evening for ourselves. If they are up, we are <br/>\nup...usually involved in whatever activity they are...and we also co-<br/>\nsleep.  I can see an older kid staying up and reading until he feels <br/>\nthe need to go to bed, but I am pretty much done with &quot;you be the <br/>\nT.Rex and I&#39;ll be the Allosaurus&quot; when the sun goes down, KWIM?  <br/>\nSo...those are my reasons for a somewhat imposed bedtime...I am sure <br/>\nI will get some arguements against this...and I am open to listening <br/>\nto them...but my actual question is...for those of you who DO have <br/>\nsome kind of bedtime guideline for younger kids, how do (or did) you <br/>\ngo about it?   I say &quot;somewhat&quot; imposed because we don&#39;t have a <br/>\nspecific &quot;time&quot;...I just feel the need to start the bedtime ball <br/>\nrolling at a reasonable hour...Sometimes we have things go pretty <br/>\nsmoothly, and other times it ends up being a real frustrating <br/>\nventure trying to get the bath, PJs, teeth brushed, in bed, story <br/>\nnegotiations, etc....  Just wondering what other&#39;s experiences are <br/>\nin this area.<br/>\n<br/>\nWendy</div>","specialLinks":[]}],"prevTopicId":1237,"nextTopicId":1263}}