{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":315074728,"authorName":"Robin","from":"&quot;Robin&quot; &lt;robinkibby@...&gt;","profile":"robinkibby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Potty training","postDate":"1356760713","msgId":49341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtibTBxOStiM3RuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGthZTBiOCs1dDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":49324,"nextInTopic":0,"prevInTime":49340,"nextInTime":49342,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"I wanted to offer a simple hope. My son was ready to use the bathroom for awhile, but had zero interest in actually sitting on the potty. We attempted some","messageBody":"<div id=\"ygrps-yiv-967076920\">I wanted to offer a simple hope.<br/>\n<br/>\nMy son was &quot;ready&quot; to use the bathroom for awhile, but had zero interest in actually sitting on the potty.<br/>\n<br/>\nWe attempted some of the bribery methods. They backfired and resulted in tantrums.<br/>\n<br/>\nWhat worked? Patience. We read the potty books, offered potty time, but never forced. Every few months we&#39;d try to work on it (have some naked days, or practice sitting on the potty with clothes on). Then one day around 3.5, we let or son run around naked outside during the summer, and he learned to use the potty in about a week. There was nothing special about the timing. He wore diapers at night for a couple weeks, then decided not to one night. Only a handful of accidents since then.<br/>\n<br/>\nAs an aside he had some allergies, etc, so I think pooping was very uncomfortable. As his gut has healed, I think he was finally ready to tackle this step.<br/>\n Wish you luck and patience.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Potty training","postDate":"1355449512","msgId":49324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZTBiOCs1dDNlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGthZGFjNitycWoyQGVHcm91cHMuY29tPg=="},"prevInTopic":49323,"nextInTopic":49341,"prevInTime":49323,"nextInTime":49325,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"If you re looking for a way to guarantee your child will be potty trained by a certain age, an unschooling list is the worst place to ask - because what your","messageBody":"<div id=\"ygrps-yiv-2080656634\">If you&#39;re looking for a way to guarantee your child will be potty trained by a certain age, an unschooling list is the worst place to ask - because what your asking is &quot;how do I get my kid to do something specific?&quot; no &quot;how do I help my child explore the world in his own way?&quot;<br/>\n<br/>\n If what you want to do is walk with your child in partnership, you need to step back from what you want your son to learn and look at your child, see what his needs and values are, his hopes and wishes and loves. He&#39;s little - 3 is soooo little! Some kids are still nursing at 3. Be gentle and sweet with your baby and help him learn about the world and his body in His way, not the ways which work for you or worked for your other kids. Trust him to know when he&#39;s ready where his own body is concerned. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another reason it was kind of bothering me is because he has such a strong aversion to it.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSome kids are really intimidated and upset by elimination for awhile. Some feel it as a kind of helplessness - their bodies are acting without them! (Some kids feel that way about falling asleep, btw). Others are freaked out by the idea that a part of them is falling out, going away - what a terrifying idea (some kids feel this way about losing teeth). What helps kids like that is to avoid putting any kind of pressure on them at all to use the toilet and wait until they&#39;re old enough to have a better idea of what&#39;s happening to them. Having some potty books around the house can help in terms of providing reassurance that this is normal. Some kids are also reassured if the toilet is not emptied so they can see the poo and have time to &quot;say good bye&quot;.<br/>\n<br/>\nIt&#39;s especially important not to push kids who are afraid because some kids will learn to &quot;hold&quot; poop for long periods of time - so long the bowel stretches and it becomes more difficult to poo. It can develop into a real - and frightening - medical condition which can have long-lasting effects.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;This one almost seems like hes terrified or embarrassed to be naked, or to have his pants off<br/>\n </span></blockquote>**************<br/>\n<br/>\nHe could be really uncomfortable, physically, when he&#39;s undressed - a sensory thing, or a security thing. It won&#39;t help to ignore or belittle his feelings in that matter. It won&#39;t help him learn any faster! Respect his feelings. Look for ways to help him be more comfortable and in control of the situation - pull-ups can be good for that, or vinyl diaper covers with cloth inserts he can remove on his own. <br/>\n<br/>\nHe could also feel like he&#39;s under alot of pressure to perform - and that doesn&#39;t help learning Or elimination. Some grown men won&#39;t pee in front of another person and use a stall rather than a urinal &quot;pee shy&quot; is the term I know. Once, in college, when I had all male room-mates, I got treated to a description all their tricks for peeing in public - reciting multiplication tables, or poetry or the constitution in their heads to &quot;take the pressure off&quot; mentally. I was amazed! I never knew so many men had trouble using the urinal!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote> I know I shouldn&#39;t let it bother me but it does.  And I think if I waited until he was 4 or 5 there would be a while lot more than just my in laws harassing me... <br/>\n****************<br/>\n<br/>\nIt might help to remind yourself (often!) that you don&#39;t get to decide when your son will use the toilet independently. He will, regardless of what you do. You only get to decide if this is going to be &quot;an issue&quot; or not. You can decide to have a power struggle that might last another five or six years, or you can back off and see him as a person with a unique perspective and needs. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; it definitely is pressure from outside sources that is making me impatient.  Namely my in laws, they even try to get him to go when he is at their house to stay the night. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nRemember, even if he uses the toilet tomorrow, he may need help with this for several more years. He may need help wiping for years, still. He may not be able to sleep dry - consistently - for years. You don&#39;t get to speed things up - you only get to make learning and growing easier or harder.<br/>\n<br/>\nIt will help a whoooooole lot if you can accept that you may be looking at as much as 5 more years of helping your child deal with elimination issues - longer than he&#39;s even been alive! If you can settle in to that understanding, relax into it, all the issues change utterly. You get to be his friend, his helper, his partner, not his biggest foe, captain of a world full of foes. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Im just one of those shy<br/>\n </span></blockquote>people who doesn&#39;t like to be confronted.<br/>\n***************<br/>\n<br/>\nIt might help to see your son the same way! He doesn&#39;t want to be confronted, and yet he&#39;s expected to perform a complicated trick which leaves him feeling scared and helpless. Poor guy! Offer him the kind of compassionate support you&#39;d want for yourself. It may mean stretching your own boundaries a bit so that you can protect him from well-meaning others who would (lovingly and with all the best intentions) bully him and leave him feeling even more frightened and helpless. Give him the kind of care you would have wished for as a child.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":474971233,"authorName":"sara","from":"&quot;sara&quot; &lt;sarajoturtle@...&gt;","profile":"sarajoturtle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Potty training","postDate":"1355427014","msgId":49323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZGFjNitycWoyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":49317,"nextInTopic":49324,"prevInTime":49322,"nextInTime":49324,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"Thanks for all the responses, it definitely is pressure from outside sources that is making me impatient.  Namely my in laws, they even try to get him to go","messageBody":"<div id=\"ygrps-yiv-851892404\">Thanks for all the responses, it definitely is pressure from outside sources that is making me impatient.  Namely my in laws, they even try to get him to go when he is at their house to stay the night.  I know I shouldn&#39;t let it bother me but it does.  And I think if I waited until he was 4 or 5 there would be a while lot more than just my in laws harassing me... Im just one of those shy people who doesn&#39;t like to be confronted.<br/>\n<br/>\nAnother reason it was kind of bothering me is because he has such a strong aversion to it.  My other son wasnt completely trained until over age 4 but he didn&#39;t hate going on the there.  This one almost seems like hes terrified or embarrassed to be naked, or to have his pants off, and that just worries me a little, I&#39;m not sure where he got such a song phobia of the potty...</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Potty training","postDate":"1355372140","msgId":49317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthYmtwYyttYml2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":49316,"nextInTopic":49323,"prevInTime":49316,"nextInTime":49318,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"My son is three (will be four at the end of this month) and wears Pull-ups.  He asks me to change him after he pees or poops.  He sometimes says he has to pee","messageBody":"<div id=\"ygrps-yiv-1785704173\">My son is three (will be four at the end of this month) and wears Pull-ups.  He asks me to change him after he pees or poops.  He sometimes says he has to pee and wants to use the potty to do so...so we go and he uses it.  Most often he still pees in his diaper.  I don&#39;t pressure him one way or the other.  He sees the rest of the family use the toilet and I think one day he too will prefer that over the diaper. Laurie</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Potty training","postDate":"1355338571","msgId":49316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthYWswYitsZmZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGthYWRkNys2Zjc4QGVHcm91cHMuY29tPg=="},"prevInTopic":49315,"nextInTopic":49317,"prevInTime":49315,"nextInTime":49317,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"... ************** Depending on the child, too, it can be helpful to put a potty chair someplace easily accessible, like the living room - although some kids","messageBody":"<div id=\"ygrps-yiv-1264339353\">&quot;judyw0607&quot; &lt;judyw0607@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;maybe give him the choice of diapers, a pull-up, underwear, or even going bare-bottomed (at home, if appropriate)<br/>\n </span></blockquote>**************<br/>\n<br/>\nDepending on the child, too, it can be helpful to put a potty chair someplace easily accessible, like the living room - although some kids find that intimidating! Others prefer an adapter for the regular toilet, sometimes with a step-stool, sometimes with a kind of home-made platform which allows the child to do a sort of standing squat. Other squatters prefer a basin on the floor - for those not lucky enough to have a toilet which easily accommodates squatting. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":411981224,"authorName":"apprentice_mom","from":"&quot;apprentice_mom&quot; &lt;justine@...&gt;","profile":"apprentice_mom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Potty training","postDate":"1355333506","msgId":49315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthYWYyMisyZnM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQT1wU21SY3BWNDJ5ZXNnb1FiNUpSNDd0SmVqWGRPRVhSWWdMRnhSMHJOcTBON3RMQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49314,"nextInTopic":49316,"prevInTime":49314,"nextInTime":49316,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"If it makes you feel any better, my son is 4 1/2 and still wears pull-ups all the time.  He is completely uninterested in using the toilet.  He just doesn t","messageBody":"<div id=\"ygrps-yiv-953363885\">If it makes you feel any better, my son is 4 1/2 and still wears pull-ups all the time.  He is completely uninterested in using the toilet.  He just doesn&#39;t want to.  I was really concerned for awhile because he was getting bigger and bigger growing out of the largest sized pull-ups, but, then I realized that the &quot;night time underwear&quot; marketed for older kids who wet the bed are actually just large pull ups by another name.<br/>\n<br/>\nYes, I sometimes get a few sideways glances that my son is still wearing pull-ups, but he is happy and doesn&#39;t have any problems with it.  I do try to gently suggest the toilet, and sometimes he is amenable, but if he isn&#39;t, I don&#39;t push.  I don&#39;t think there is anything you can do to &quot;make&quot; a child use the toilet without hurting them emotionally or damaging your relationship.  For such an easily manageable thing (using pull-ups or the night time pants so they fit properly), I don&#39;t believe it is worth the risk of hurt.<br/>\n<br/>\nI believe that he will give this up when he is ready, and I&#39;m content to wait until that happens on his own schedule.  It might be that if you just ask yourself why you think that this is so important, you may realize that it isn&#39;t really about him, it is about you, and then you can work through whatever your own issues about it are and take the pressure of your son to do that part of it for you.<br/>\n<br/>\nJustine:)</div>","specialLinks":[]},{"userId":482616263,"authorName":"judyw0607","from":"&quot;judyw0607&quot; &lt;judyw0607@...&gt;","profile":"judyw0607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Potty training","postDate":"1355331815","msgId":49314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthYWRkNys2Zjc4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":49312,"nextInTopic":49315,"prevInTime":49312,"nextInTime":49315,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"I could have written this post myself, nearly 2 years ago.  Just after my younger son turned 3, I took him to the pediatrician for a well check, wearing a","messageBody":"<div id=\"ygrps-yiv-626626605\">I could have written this post myself, nearly 2 years ago.  Just after my younger son turned 3, I took him to the pediatrician for a well check, wearing a pull-up.  The doctor didn&#39;t make a huge deal out of it, but he made it clear (to me) that my son should&#39;ve already been done with those.  Unfortunately, I let that message get under my skin, and I went too far with &quot;training.&quot;  One day, in the midst of another unhappy (me yelling, my son crying -- aacckkk, a totally shameful memory!) changing another set of soiled clothes, I asked my son if some day, when He decided he was ready, he was just going to start using the toilet on his own.  His answer was yes, and he wasn&#39;t fooling!  :)<br/>\n<br/>\nI would recommend backing way off from the idea of &quot;training,&quot; and maybe give him the choice of diapers, a pull-up, underwear, or even going bare-bottomed (at home, if appropriate).  This is what I eventually did with my little guy, and before I knew it (it was probably months, really, but in retrospect seems like no time at all),  he was using the bathroom consistently.  <br/>\n<br/>\nI So regret that I let the pressure from outside influences (including my own mom, who claims all 5 of her kids were potty trained before age 2 -- yeah, right!) interfere with my treating my son kindly as he was learning this skill.<br/>\n<br/>\nJudy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sara&quot; &lt;sarajoturtle@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Idk what to do about potty training me youngest.  He turned 3 in september...<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":532773099,"authorName":"Jorie Denny","from":"Jorie Denny &lt;joriedenny@...&gt;","profile":"twostorie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Potty training","postDate":"1355272068","msgId":49312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQkg2eDBQMXd2dXB1RWhkZ2IxajZhNFU1RV92TWlBVTM2d0ZhT3oyMWFIQjQ0M1dhZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg==","referencesHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":49311,"nextInTopic":49314,"prevInTime":49311,"nextInTime":49314,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"I can hear that you are really wanting your son to potty train and I had a similar experience, here s what I did. My youngest son (just turned 4 on Sunday) has","messageBody":"<div id=\"ygrps-yiv-997272956\">I can hear that you are really wanting your son to potty train and I had a<br/>\nsimilar experience, here&#39;s what I did.<br/>\nMy youngest son (just turned 4 on Sunday) has JUST in the last few months<br/>\nstarted to really want to use the potty (almost every time) he is still<br/>\nwearing pull-ups because when he gets distracted with playing he tends to<br/>\nchoose to ignore the signals and it&#39;s just easier for me if he&#39;s in a pull<br/>\nup vs. changing his pants (and cleaning the carpet) every time. We gave up<br/>\non &quot;formally&quot; potty training him when we knew his BODY was ready, (he was<br/>\nholding it all night and his diaper would stay dry for long periods of time<br/>\nduring the day) but when we tried to have him use the potty he would flat<br/>\nout refuse, cry and a struggle would ensue. He was clearly showing us that<br/>\nhe was not emotionally and/or mentally ready so I decided to completely<br/>\nstop trying. He eventually started using the potty randomly on his own and<br/>\nwe intentionally did not make a fuss about it. (didn&#39;t want to bring<br/>\npossibly unwanted attention to it)  At first he only wanted to pee in the<br/>\npotty and now he is doing both almost every time. He is slightly sensitive<br/>\nabout his diapers now (doesn&#39;t want his friends to know he wears one) but<br/>\nhe still chooses to use them sometimes even when we&#39;re at home and the<br/>\nbathroom is right there. I changed a poppy diaper twice last month. I plan<br/>\non continuing with nighttime diapers but I will discontinue daytime use as<br/>\nsoon as we run out of this supply. My main point to all this info is that<br/>\neventually, I think all children want to start using the toilet. I was<br/>\nworried at first but when the struggles began I decided that it was not<br/>\nworth potentially traumatizing him or injuring our relationship over. I<br/>\nknew he would not be a teenager wearing diapers. As soon as I let go of my<br/>\nown expectations it felt so much more natural to just let it happen. It may<br/>\nhave been anxiety, or a need for him to have control over it, and that&#39;s<br/>\nall O.K.. He got to do it when he was REALLY ready, in the way HE needed to<br/>\nbe ready. Once I completely stopped interfering with his process, he was<br/>\nable to have it at his own pace. If I had another child, I would do it the<br/>\nsame way. I truly think your son will teach himself, when all of him is<br/>\nready. Try letting it go and trusting that it will happen eventually. You<br/>\nmay be changing diapers for another year like me, but you will be trading<br/>\nthat for those horrible struggles. Once I let the idea of it happening go<br/>\nand decided to be truly OK with continuing to change diapers for as long as<br/>\nit took, it was a much happier existence for everyone. Then it happened<br/>\neffortlessly. Just wanted to share my story/opinion, I hope you find it<br/>\nuseful. Good luck with whatever you choose. :)<br/>\n<br/>\nJ.D.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Dec 10, 2012 at 9:51 PM, sara &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sarajoturtle@...\">sarajoturtle@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Idk what to do about potty training me youngest. He turned 3 in september,<br/>\n&gt; and he is completely ready to learn (as in he has the readiness signs, he<br/>\n&gt; tells me to change him as soon as he goes) but for some reason he is very<br/>\n&gt; against the idea. Neither of my other two were like this, my oldest was<br/>\n&gt; HARD to potty train but he still liked siting on the potty. This one<br/>\n&gt; refuses, he fights me every time I suggest it no mater how fun I make it<br/>\n&gt; sound or how much I sugar coat it...I&#39;m really not sure what to do...<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":411185478,"authorName":"Karen","from":"Karen &lt;karen@...&gt;","profile":"karenmomp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Potty training","postDate":"1355240945","msgId":49311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQT1wU21SY3BWNDJ5ZXNnb1FiNUpSNDd0SmVqWGRPRVhSWWdMRnhSMHJOcTBON3RMQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBQ0ZXc3lvWU80d0ZkQUJHLVgtX2tYR3lpaEU0NDE1M2dWT3RLaT09R2tBMzd5VVVVUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQ0ZXc3lvWU80d0ZkQUJHLVgtX2tYR3lpaEU0NDE1M2dWT3RLaT09R2tBMzd5VVVVUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49310,"nextInTopic":49312,"prevInTime":49310,"nextInTime":49312,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"And it s not until later for some boys.  I know a couple that were 11 or so before they were dry at night.  One of my friend s sons ended up using an alarm at","messageBody":"<div id=\"ygrps-yiv-514261361\">And it&#39;s not until later for some boys.  I know a couple that were 11 or so<br/>\nbefore they were dry at night.  One of my friend&#39;s sons ended up using an<br/>\nalarm at night that would go off when he started to go when he was sleeping<br/>\nso his body could learn to wake up-- he was a very heavy sleeper and just<br/>\nwouldn&#39;t hear his body&#39;s signals.<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Dec 11, 2012 at 8:27 AM, Carrie Kinnard &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cj53037@...\">cj53037@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; With my two boys we used this - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joshuaandprudence.com/\">http://www.joshuaandprudence.com/</a><br/>\n&gt;<br/>\n&gt; But they also spent alot of time with daddy in the bathroom.<br/>\n&gt;<br/>\n&gt; Good to know that its common for boys to still wet the bed until 7 or 8 -<br/>\n&gt; as my 6 yr old still wears pull ups at night. It frustrates my husband,<br/>\n&gt; but I keep telling him, in time.. in time.. :)<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":315550895,"authorName":"Carrie Kinnard","from":"Carrie Kinnard &lt;cj53037@...&gt;","profile":"navinmouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Potty training","postDate":"1355232430","msgId":49310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQ0ZXc3lvWU80d0ZkQUJHLVgtX2tYR3lpaEU0NDE1M2dWT3RLaT09R2tBMzd5VVVVUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49309,"nextInTopic":49311,"prevInTime":49309,"nextInTime":49311,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"With my two boys we used this - http://www.joshuaandprudence.com/ But they also spent alot of time with daddy in the bathroom. Good to know that its common for","messageBody":"<div id=\"ygrps-yiv-1559794958\">With my two boys we used this - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joshuaandprudence.com/\">http://www.joshuaandprudence.com/</a><br/>\n<br/>\nBut they also spent alot of time with daddy in the bathroom.<br/>\n<br/>\nGood to know that its common for boys to still wet the bed until 7 or 8 -<br/>\nas my 6 yr old still wears pull ups at night.  It frustrates my husband,<br/>\nbut I keep telling him, in time.. in time.. :)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Potty training","postDate":"1355231695","msgId":49309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthN2JrZitvaHZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":49308,"nextInTopic":49310,"prevInTime":49308,"nextInTime":49310,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"... Why do you think he needs to be trained ? You don t have to answer that here, but it s something to think about. Lots of kids aren t ready to use the","messageBody":"<div id=\"ygrps-yiv-1746175348\">&quot;sara&quot; &lt;sarajoturtle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Idk what to do about potty training me youngest.<br/>\n<br/>\n </span></blockquote>Why do you think he needs to be &quot;trained&quot;? You don&#39;t have to answer that here, but it&#39;s something to think about. Lots of kids aren&#39;t ready to use the toilet consistently and independently at 3, but there has become an expectation that they should be, because of the increasing popularity of (pressure to make use of) preschool programs. If your child isn&#39;t going to preschool, there&#39;s no need for him to be trained. You have time for him to learn in ways which work for him.<br/>\n<br/>\nBoys often need longer to become more-or-less independent with the potty, and it&#39;s good to keep the &quot;more-or-less&quot; part in mind. Some kids need help using the toilet (wiping in particular) until they&#39;re much older - 8 or so isn&#39;t unheard of, especially for boys. And it&#39;s not uncommon for boys to wet the bed until 7 or 8. <br/>\n<br/>\nKids who go to school deal with this as best they can. I&#39;ve heard a shocking number of stories from adult men about learning to &quot;hold it&quot; all day long because they never felt right or safe going to the toilet at school. And of course some kids can&#39;t, and have accidents in school. The idea that every kid in school is actually capable of using the toilet independently is a myth. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;he tells me to change him as soon as he goes<br/>\n<br/>\n </span></blockquote>Don&#39;t see that as a &quot;readiness sign&quot; of anything - it&#39;s pure communication and evidence that he&#39;s growing more aware of his needs and his environment. Those are good things, in themselves. Learning - real, natural learning - doesn&#39;t take place in a steady forward progression. Kids are learning all the time, but what they&#39;re learning will change from minute to minute as their perceptions change. Right now there are so many other wonderful things to learn, this whole &quot;potty&quot; business is just a distraction - but it won&#39;t be forever. At some point he&#39;ll be interested in doing what the big kids and grown-ups do. There&#39;s no need to push it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Neither of my other two were like this<br/>\n<br/>\n </span></blockquote>Of course not, they&#39;re different people with different perspectives ;) Learning depends absolutely on individual perspectives - that&#39;s why teaching doesn&#39;t equate to learning. Don&#39;t compare your kids like this, it won&#39;t help you see them as unique individuals or help them explore the world, each on his or her own terms. <br/>\n<br/>\nFor now, back all the way off. The Biggest problems with this issue come from power struggles!  That&#39;s true of all parenting issues, really, so learn to stop being the one to perpetuate the struggle. Learn to become your child&#39;s friend and helper, rather than his director and adversary. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Potty training","postDate":"1355226964","msgId":49308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwRjZBQ0QwLUREOTItNDczQy1BRDQyLTc4NDlBRTE0OEE2Q0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg==","referencesHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":49307,"nextInTopic":49309,"prevInTime":49307,"nextInTime":49309,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"... The wording of this is odd which is why you re feeling confused. He isn t ready to learn. He *is* learning. He s figuring things out. But he s figuring out","messageBody":"<div id=\"ygrps-yiv-2056998415\">On Dec 11, 2012, at 12:51 AM, sara wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  he is completely ready to learn (as in he has the readiness signs, he tells me to change him as soon as he goes)<br/>\n<br/>\n </span></blockquote>The wording of this is odd which is why you&#39;re feeling confused.<br/>\n<br/>\nHe isn&#39;t ready to learn. He *is* learning. He&#39;s figuring things out. But he&#39;s figuring out what&#39;s important to him, not the parts you want him to learn right now.<br/>\n<br/>\nIs there are reason you want him to figure it all out on a schedule that&#39;s different from his own?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":474971233,"authorName":"sara","from":"&quot;sara&quot; &lt;sarajoturtle@...&gt;","profile":"sarajoturtle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Potty training","postDate":"1355205080","msgId":49307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthNmhrbytuNmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49308,"prevInTime":49306,"nextInTime":49308,"topicId":49307,"numMessagesInTopic":0,"msgSnippet":"Idk what to do about potty training me youngest.  He turned 3 in september, and he is completely ready to learn (as in he has the readiness signs, he tells me","messageBody":"<div id=\"ygrps-yiv-356419416\">Idk what to do about potty training me youngest.  He turned 3 in september, and he is completely ready to learn (as in he has the readiness signs, he tells me to change him as soon as he goes) but for some reason he is very against the idea.  Neither of my other two were like this, my oldest was HARD to potty train but he still liked siting on the potty.  This one refuses, he fights me every time I suggest it no mater how fun I make it sound or how much I sugar coat it...I&#39;m really not sure what to do...</div>","specialLinks":[]}],"prevTopicId":49318,"nextTopicId":49345}}