{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Sharing, tantrums, Creating Interesting \tEnvironment","postDate":"1246850365","msgId":40736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNzA1MjAxOXMxNWU2MzJlOG84MDY2YWVhMzVhMjA1MmZkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGgyZTF2dSs2dXAzQGVHcm91cHMuY29tPg==","referencesHeader":"PDAwMjgwMWM5Zjk5ZiQwM2VjNjRiMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4JIDxoMmUxdnUrNnVwM0BlR3JvdXBzLmNvbT4="},"prevInTopic":40735,"nextInTopic":0,"prevInTime":40735,"nextInTime":40737,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"... This is really important. We have one Xbox. It is everyone s but it is on my sons room.  He needs it there and everyone else is OK with that. We have the ","messageBody":"<div id=\"ygrps-yiv-429543172\">On Tue, Jun 30, 2009 at 6:01 PM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Equal isn&#39;t always fair. Life isn&#39;t often equal -<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>This is really important. We have one Xbox. It is everyone&#39;s but it is on my<br/>\nsons room.  He needs it there and everyone else is OK with that. We have the<br/>\nwii on the common TV. Everyone who wants a TV has one. My oldest didn&#39;t want<br/>\na TV she wanted a computer so she has one. DS doesn&#39;t mind using the common<br/>\ncomputer but has recent asked for one in his room. But he knows that if<br/>\nthat&#39;s what he wants we will find a way to get it. My dd has a scanner and I<br/>\ndon&#39;t.<br/>\n<br/>\nWhen I went to the Wendy&#39;s drive thru one of my kids got a frosty and the<br/>\nother two declined.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Sharing, tantrums, Creating Interesting \tEnvironment","postDate":"1246849731","msgId":40735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNzA1MjAwOGo3ZjllYmM4Mm00YWZhYTQzOTE1YmZiZDI0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg==","referencesHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":40725,"nextInTopic":40736,"prevInTime":40734,"nextInTime":40736,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"OP: First, sharing. We have some expensive things that need to be shared by everyone in the home. ***It may help to open up. When you say things like this to","messageBody":"<div id=\"ygrps-yiv-1113118121\">OP: First, sharing. We have some expensive things that need to be shared by<br/>\neveryone in the home.<br/>\n<br/>\n***It may help to open up. When you say things like this to yourself it<br/>\nreally closes a lot of options.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nOP: Television, Video Game Systems, Computer, Musical Instruments. It&#39;s<br/>\nunreasonable for me to purchase multiples of some of these things.<br/>\n<br/>\n***TV are fairly easy to get multiples of cheaply. Even the rest of it can<br/>\nbe got cheap! We picked up a playstation for a few bucks. I will likely just<br/>\noffer it free online at some point soon. We saved and got two systems the<br/>\npast year. On craigslist you can even ask for stuff.<br/>\n<br/>\nRight now our family is working on ways we can cut expenses and save money<br/>\nfor a few big things we want. We stash a little at a time. We have a vision<br/>\nboard so the kids can see what we are working on. They each have a space to<br/>\nlist their wants. Then when we get money we get them. or we save money for<br/>\nthem.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nThere needs to be some sort of compromise on sharing them with each other.<br/>\n<br/>\n***YOU would like their to be some sort of compromise made in sharing them.<br/>\nHow are you feeling about the conflict? Are you feeling like there needs to<br/>\nbe the absence of conflict? How are the kids feeling about the conflict? Do<br/>\nthey have any ideas on how to effectively share with one another?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nBut, my oldest son is not interested in sharing them. He is overbearing when<br/>\nsomeone is having their turn on a video game, or computer, or whatever it<br/>\nis.<br/>\n<br/>\n***Have you asked your son about this? or are you assuming from his actions?<br/>\nWhat does overbearing look like with him?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI tried two player games, or one of them plays one instrument while another<br/>\nplays a different instrument. But, it just doesn&#39;t seem to work. Then, I<br/>\nfind myself thinking, &quot;If they aren&#39;t going to get along sharing these<br/>\nthings, I might as well get rid of the stuff. It is not worth the<br/>\naggravation.&quot;<br/>\n<br/>\n***Perhaps the arguing is part of the learning that&#39;s happening right now.<br/>\nAre you willing to take away their possessions or to withhold things that<br/>\nbring them joy to meet your need for the absence of aggravation? What about<br/>\n&quot;sharing&quot; is a hot button for you?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nMy husband gets very annoyed by the seemingly constant battle over who gets<br/>\nwhat. That is understandable, he works and then comes home to frequent<br/>\narguments over the oldest child&#39;s pestering others during their turns with<br/>\nthings.<br/>\n<br/>\n***It seems like the older child may be feeling like he doesn&#39;t get his<br/>\nneeds met. He is becoming obnoxious to demand that his needs are met. What<br/>\nkinds of things is he asking for?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nIf I tell my oldest son that it is someone else&#39;s turn, he will say &quot;No.&quot;<br/>\nBut, it has to be someone else&#39;s turn because they are waiting patiently to<br/>\nplay or use the object. I try to give oldest enough time to accomplish a<br/>\ngoal, then I need him to take maybe a 30 minute break while someone else<br/>\ngets to use the game/comp/instruments. He doesn&#39;t want to share with other<br/>\nchildren, or adults. While it is not his turn with the object in question,<br/>\nhe will hover over the other person, pestering them. Sometimes, he will<br/>\nflail around, throwing his body in a tantrum if his turn is over. I try to<br/>\nnot interrupt him mid-mission.. I allow him to finish levels, or finish<br/>\nchecking emails, or finish playing a song. On the computer, he can leave his<br/>\ngame or window open, just minimized, so he doesn&#39;t actually have to exit it<br/>\nwhile the other person has a turn. But, it doesn&#39;t seem to help. I have a<br/>\nwireless mouse and he will steal it from people trying to use the computer.<br/>\nOr, if they are playing a nintendo game, he will constantly hit the reset<br/>\nbutton and run. Also, if a child gets one turn, he says he should get twice<br/>\nas much.. so, if they play two levels, he should get to play four levels. I<br/>\ndon&#39;t understand where this logic comes from?<br/>\n<br/>\n***Can you put yourself in his shoes? As painful as this is for you and the<br/>\npeople who are interacting with him imagine how much pain he must be feeling<br/>\nto act this way. I am not saying this is ok and you shouldn&#39;t help him. I am<br/>\nsaying he needs help in navigating this, it is obviously hard for *him*.<br/>\n<br/>\nI would set it up so that he has more say in the sharing. Have him<br/>\nbrainstorm ideas instead of telling him that he has to take turns. Don&#39;t<br/>\ninsist that he share your way. He can figure something out.<br/>\n<br/>\nAlso the way you write about him is painful. He is likely feeling your anger<br/>\nand frusrtration at him. He may be feeling like the bad child.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nHe will threaten the other kids with deleting their games, characters, etc.<br/>\nHe doesn&#39;t really do it.. he just likes to get a rise out of them. (He<br/>\nfrequently says things just to get a reaction out of the other kids). I try<br/>\nto direct him toward doing something else.. eat a snack, or we&#39;ll do artwork<br/>\nor something. But, nothing seems to be so interesting that it keeps his<br/>\nattention from the fact that someone else is having their turn on the<br/>\ncomputer or video game or watching the movie they like.<br/>\n<br/>\n***He is screaming really loud that he has a need. Is it absolutely<br/>\nimposible to get a second gaming station? What are his favorite things to<br/>\nplay?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nAnd that is that. I need help. I can&#39;t just go off and buy computers for<br/>\neveryone (we already have two), several copies of the same video game<br/>\nsystems (we do have several different systems, but no duplicate systems), or<br/>\nmultiple instruments - though we have a wide variety of instruments and some<br/>\nare duplicates.<br/>\n<br/>\n***You keep saying can&#39;t. OPEN, look for a way. Start with a vision board.<br/>\nFind out from him what he really wants most. set goals.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nSo, another thing is creating an interesting environment for my oldest..<br/>\nsome way to captivate his attention while others have their turns. Maybe I<br/>\njust haven&#39;t been very good at creating an interesting environment for him.<br/>\nI have puppets, games, instruments, books, tons of arts n crafts, we cook<br/>\nrecipes, but nothing seems to take his mind off the fact that someone else<br/>\nis having a turn with the computer or video games, or whatever. He&#39;s always<br/>\ninterested in what they are doing, no matter what I try to get involved with<br/>\nhim. Instead of enjoying time doing something else, he simply watches over<br/>\nhis shoulder.. or makes excuses to go to where ever they are, and watching<br/>\nthe clock for his next turn.<br/>\n<br/>\n***His need to be on isn&#39;t being filled. What is standing in the way?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nOther kids are not as intense as him, but are beginning to follow in his<br/>\nfootsteps. Such as, asking constantly.. when is so-and-so going to be done<br/>\nand they can have their turn (even though they can all tell time and I show<br/>\nthem the time when it will be their turn), and pitching fits when their<br/>\nturns are up. Not wanting to be engaged in other activities while they wait<br/>\nfor their turns..<br/>\n<br/>\n***Have you read, Raising Your Spirited Child?  That might be a good place<br/>\nto start.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nI have too many people here and not enough room or money, for everyone to<br/>\nhave their very own Wii, or their very own private computer, when these<br/>\nitems are designed to allow multiple people to use them and are generally<br/>\nexpensive and require space and other equipment to set them up.<br/>\n<br/>\n*** &quot;Argue for your limitations and surely they will be yours&quot; --Richard<br/>\nBach<br/>\n<br/>\n*when these items are designed to allow multiple people to use them and are<br/>\ngenerally expensive and require space and other equipment to set them up.*<br/>\n<br/>\nthis is where you are hung up. Let it go. Do you care more about being right<br/>\nor serving your child&#39;s needs? Aer you afraid of something? What is it?<br/>\n<br/>\nWhat can you do to make things POSSIBLE ;-)<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nCan you put a game console in his room for a while? Can he get his own<br/>\ncomputer? Does he have his own space?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\nI need them to share things peaceably or I&#39;m going to lose my mind.<br/>\n<br/>\n***That is your need. Seperate it from their needs. You need to get your<br/>\nneeds met elsewhere, they are not responsible for you. Do you have a<br/>\nrecharge space? You need to be calm and focused on them.<br/>\n<br/>\nAre you really going to loose your mind? Is that reality?<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nFaith<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246581467","msgId":40725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyampzcitrNmE3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgyaXBiaysxMTNya0BlR3JvdXBzLmNvbT4="},"prevInTopic":40722,"nextInTopic":40735,"prevInTime":40724,"nextInTime":40726,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"... ************************ Actually, sometimes changing expectations *is* a solution, especially if those expectations are unrealistic. When I have an","messageBody":"<div id=\"ygrps-yiv-1878230521\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@...&quot; &lt;marbleface@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; OK, I&#39;m going to suggest that you are just expecting too much peace between this many young children. It doesn&#39;t seem unusual at all to me that kids this age would not be able to share well, have little idea about how much time has passed in their &quot;turn,&quot; or care. :) <br/>\n&gt; <br/>\n&gt; No solutions. Sorry. :)<br/>\n </span></blockquote>************************<br/>\n<br/>\nActually, sometimes changing expectations *is* a solution, especially if those expectations are unrealistic. When I have an expectation and its not met, that&#39;s much more stressful for me than if I can let go of that expectation. Sometimes when I take my stress levels down a notch or two, I become more creative and thoughtful, but Always when I can reduce my stress, there&#39;s less stress in the whole dynamic. And that can make a substantial difference.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246554292","msgId":40722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyaXBiaysxMTNya0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGgyZm41ays2MW9mQGVHcm91cHMuY29tPg=="},"prevInTopic":40692,"nextInTopic":40725,"prevInTime":40721,"nextInTime":40723,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"OK, I m going to suggest that you are just expecting too much peace between this many young children. It doesn t seem unusual at all to me that kids this age","messageBody":"<div id=\"ygrps-yiv-1141414705\">OK, I&#39;m going to suggest that you are just expecting too much peace between this many young children. It doesn&#39;t seem unusual at all to me that kids this age would not be able to share well, have little idea about how much time has passed in their &quot;turn,&quot; or care. :) <br/>\n<br/>\nNo solutions. Sorry. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;synonymous@...&quot; &lt;synonymous@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; The childrens ages are as follows; 7, 6, and 4. The conflict is primarily between the older two, but extends to the youngest and adults also. I try to do all of my computing early in the morning, before anyone wakes up. <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":404746948,"authorName":"synonymous@att.net","from":"&quot;synonymous@...&quot; &lt;synonymous@...&gt;","profile":"synonymous@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246453748","msgId":40692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZm41ays2MW9mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgyY3VhNCsyMzMzQGVHcm91cHMuY29tPg=="},"prevInTopic":40683,"nextInTopic":40722,"prevInTime":40691,"nextInTime":40693,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"The childrens ages are as follows; 7, 6, and 4. The conflict is primarily between the older two, but extends to the youngest and adults also. I try to do all","messageBody":"<div id=\"ygrps-yiv-395348090\">The childrens ages are as follows; 7, 6, and 4. The conflict is primarily between the older two, but extends to the youngest and adults also. I try to do all of my computing early in the morning, before anyone wakes up. <br/>\n<br/>\nI just don&#39;t feel like a lack of systems is the problem, or even a lack of time. I am almost positive that this same conflict will lend itself to another area, if I patch it up by introducing duplicate systems. They already are having conflict over who is brushing their teeth when and for how long... And I don&#39;t understand it. That&#39;s the same conflict as with the video game systems, the instruments, etc.. only what&#39;s the point about fighting over brushing your teeth? I would have brought that up earlier, but I just realized that it&#39;s the same conflict.<br/>\n<br/>\nWhat about time apart? Could it be that they don&#39;t have enough time, but that it&#39;s not about enough time on the video games or tvs.. it&#39;s about having enough time away from each other? That sounds a little more likely to me.. considering that they all get a lots of time with the items they like, but they don&#39;t get much time separated from one another. They&#39;re always over each others shoulders, they&#39;re always together in the same house, in the same car, going the same places to do the same things.<br/>\n<br/>\nMiddle son was away yesterday with grandparents. Oldest goes today. But, oldest wasn&#39;t nearly as intense as he is when middle son is around. He felt much more relaxed. His attitude was more cheerful. Because he got a longer turn? No. The computer messed up and I had to go download some patches and reconfigure things and that took a good couple of hours and he didn&#39;t play with any of the usually conflict-generating items. <br/>\n<br/>\nDusty</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246400511","msgId":40683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZTM2MCtmaHVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":40682,"nextInTopic":40692,"prevInTime":40682,"nextInTime":40684,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"-=-I have too many people here and not enough room or money, for everyone to have their very own Wii, or their very own private computer, when these items are","messageBody":"<div id=\"ygrps-yiv-303844217\">-=-I have too many people here and not enough room or money, for everyone to have their very own Wii, or their very own private computer, when these items are designed to allow multiple people to use them and are generally expensive and require space and other equipment to set them up.-=-<br/>\n<br/>\nDoes *everyone* need their own Wii? Or their own computer? Would adding just one more ease some of the pressure? There are plenty of ways to say &quot;yes&quot;, it doesn&#39;t have to be that you run right out and go into debt - ask friends, look around thrift stores, etc. Show your son you&#39;re helping this to happen, not naysaying and negating.<br/>\n<br/>\nMy youngest wanted a Wii... and I SO wanted to give him one! He knew I was saving for it, and doing what I could to get it for him. He chose to sell a couple sets of DragonBall Z books on ebay to make money to go towards it, he saved his allowance. Don&#39;t immediately say &quot;no&quot;; ask your son - your family - &#39;how can we make this happen&#39;? It took a little over a year, but my son got his Wii.<br/>\n<br/>\nI was resistant to getting another TV, not because we couldn&#39;t afford it, but because I had the belief that a happy family meant a family that was together in one room, sharing happily. I brought it up at an unschooling gathering, and immediately saw where I was stuck about it! Other moms there let me know it could bring MORE peace, and more togetherness to go ahead and get a second TV - because when we were together, it would be because everyone CHOSE to be! A friend told me in passing that he has a TV just sitting in his room, unused, and they had 3 other TVs in their house, so I asked for his! And got a &quot;sure!&quot;<br/>\n<br/>\nI could have been stuck on NO, but I chose to see how I could say YES instead.<br/>\n<br/>\nOnce you shift your thinking on this, and ask &quot;How can we make this happen?&quot;, things DO happen! And your son will see you supporting his needs. Even if you can&#39;t provide that thing right now, he&#39;ll know you&#39;re saying &quot;yes&quot;.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246399294","msgId":40682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZTF2dSs2dXAzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjgwMWM5Zjk5ZiQwM2VjNjRiMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4="},"prevInTopic":40681,"nextInTopic":40683,"prevInTime":40681,"nextInTime":40683,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"... Some people have bigger needs than others, that s the thing. The measuring was your mom s attempt to say look, its fair bc its Equal but you didn t","messageBody":"<div id=\"ygrps-yiv-874963422\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ulrike Haupt&quot; &lt;rica@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Maybe If I had been secure in the knowing that my needs where met then the <br/>\n&gt; &#39;measuring&#39; would have been tolerable. I do not know.<br/>\n<br/>\n </span></blockquote>Some people have bigger needs than others, that&#39;s the thing. The &quot;measuring&quot; was your mom&#39;s attempt to say &quot;look, its fair bc its Equal&quot; but you didn&#39;t need equal, you needed more. That was the way you were, for whatever reason - biology or birth order or past woes. <br/>\n<br/>\nRay used to have enormous needs and for a long time we struggled with the idea of fairness. It wasn&#39;t &quot;fair&quot; that this little boy was taking up so much time and energy and resources... but it wasn&#39;t fair to him when his needs weren&#39;t met, and when they weren&#39;t he was miserable. And that wasn&#39;t fair to anyone. So we found that by accepting Ray&#39;s big needs, and prioritizing them, he was happier. There was less conflict, less drama in our lives. Life became more peaceful. <br/>\n<br/>\nEqual isn&#39;t always fair. Life isn&#39;t often equal - George is taller than I am and a more reliable cook. I&#39;m sunnier than he is (most of the time) and don&#39;t get bogged down in my personal bs as much. Ray&#39;s more social than either of us, and stronger, too. Mo&#39;s more focused than any of us. Balancing all our needs is an ever evolving dynamic, where sometimes one person&#39;s needs are more important for a day, or a few years!<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246398235","msgId":40681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZTB1cit1bjZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":40676,"nextInTopic":40682,"prevInTime":40680,"nextInTime":40682,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"... ************************ Who decides how long a turn is? Its possible, you know, for every person in your home to have a different need in terms of what","messageBody":"<div id=\"ygrps-yiv-1589662363\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;synonymous@...&quot; &lt;synonymous@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If I tell my oldest son that it is someone else&#39;s turn, he will say &quot;No.&quot; But, it has to be someone else&#39;s turn because they are waiting patiently to play or use the object. <br/>\n </span></blockquote>************************<br/>\n<br/>\nWho decides how long a turn is? Its possible, you know, for every person in your home to have a different need in terms of what feels &quot;long enough.&quot; My 7yo likes to spend at least several hours doing something, sometimes a whole day! So the rest of the family plans our turns with that in mind.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But, my oldest son is not interested in sharing them. He is overbearing when someone is having their turn on a video game, or computer, or whatever it is.<br/>\n </span></blockquote>****************************<br/>\n<br/>\nAs irritating as this may seem, try to see things from your ds&#39;s perspective. He has a longer attention span, a big need to really focus for long amounts of time. Its hard for him to stop before he&#39;s ready, hard for him to transition to someone else&#39;s time table. People with longer attention spans need more time to transition *and* it takes longer to &quot;get into something&quot;. So if you&#39;re setting turns at an hour, for instance, he may be barely settled in before he has to jump up again. That&#39;s excruciating!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; So, another thing is creating an interesting environment for my oldest.. some way to captivate his attention while others have their turns. <br/>\n </span></blockquote>*******************<br/>\n<br/>\nIt sounds as though you have a lot of stuff *he* likes, maybe it would be more helpful to look at it from the other angle and find more fun things for the rest to do. Is it possible that *he&#39;s* the most interesting thing in the house? Try redirecting the others around him. Once he has a good long turn, as long as He likes, he&#39;s probably not going to be hanging around harrassing the next kid - so it becomes a win-win situation. He gets his turn, as long as he needs it to be, and the others don&#39;t get interrupted so they get as long a turn as they need, too. <br/>\n<br/>\nIn the short run, you&#39;ll end up doing a lot of negotiating and redirecting. That&#39;s Okay! As a family, you will all be learning to problem solve together in a new way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I need them to share things peaceably or I&#39;m going to lose my mind.<br/>\n<br/>\n </span></blockquote>You already know that trying to get your eldest to stop doing something before he&#39;s ready *isn&#39;t* going to create peace. So the first, most important thing you can do is to drop that expectation. Find ways for him to have longer turns! All day... all week! Commiserate with whoever else wants a turn, too, and look for other solutions. There likely won&#39;t be one, permanent solution - there almost never is, with kids, because they keep growing and changing!. So creating peace is going to involve you being very involved in what&#39;s going on.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Sharing, tantrums, Creating Interesting Environment","postDate":"1246385679","msgId":40676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1OTg2OS4xNjQ0LnFtQHdlYjM2OTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":40675,"nextInTopic":40681,"prevInTime":40675,"nextInTime":40677,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"We have tv s in every room of the house, and computers for everyone.  There is never a time when someone feels like they need more time on something, but ","messageBody":"<div id=\"ygrps-yiv-1620569980\">We have tv&#39;s in every room of the house, and computers for everyone.  There is never a time when someone feels like they need more time on something, but  others are waiting.  We did not spend that much money--we got my son a 35 inch tv for his room for $35 on Craigslist.  I was just on there today, and saw numerous TV&#39;s, DVD players, computers, game systems...I don&#39;t know where you live, but no doubt there is a craigslist near you, too.  Also, see if your area has a free-cycle or potlatch--we get free stuff all the time, too--good stuff, not just junk, but you have to check the lists often.<br/>\n<br/>\nAlso, there is bartering--do you or your husband, or even your kids, have any skills that you could barter for goods?  Find a computer tech who can build you a computer out of scrap parts, and trade for once-a-week homecooked meals, or dog walking, or weeding his yard.  <br/>\n<br/>\nYour son obviously feels like he doesn&#39;t have enough--so give him ENOUGH.  :)<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246376902","msgId":40675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjgwMWM5Zjk5ZiQwM2VjNjRiMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PGgyZDZzdStkcGxwQGVHcm91cHMuY29tPg=="},"prevInTopic":40673,"nextInTopic":40676,"prevInTime":40674,"nextInTime":40676,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"Dear Ren I hear you  I wrote ~~Totally irrational and very painful.~~ And you wrote Not really irrational at all. You were getting a measured","messageBody":"<div id=\"ygrps-yiv-1506079616\">Dear Ren<br/>\n<br/>\nI hear you &lt;and feel hugged&gt;<br/>\n<br/>\nI wrote<br/>\n~~Totally irrational and very painful.~~<br/>\n<br/>\nAnd you wrote<br/>\nNot really irrational at all. You were getting a measured portion, chosen by <br/>\nanother human. That&#39;s not &quot;fair&quot; actually. Every human has different needs <br/>\nin order to be filled-up. With food, with attention, with everything. Until <br/>\nthe child gets to have the portion that makes them feel satisfied, there <br/>\nwill be a sense of lack.<br/>\n<br/>\n<br/>\n*** of course it it is/was not fair and whenever a parent says that they <br/>\nhave to be fair in their allowing of anything I totally freak out because I <br/>\nknow that that is not possible. No, I want to express something else here. I <br/>\ndon&#39;t have the words.<br/>\n<br/>\nThe &#39;irrational&#39; comes from that I did not have a &#39;rationale&#39; for this <br/>\nFutterneid thing going on all the time until recently. Looking back now I <br/>\ncan see how my mother did her best to give me what I wanted but the &#39;damage&#39; <br/>\nwas done before and the symptom of Futterneid kept coming up until I managed <br/>\nto become aware of it and do something about it.<br/>\n<br/>\nMaybe If I had been secure in the knowing that my needs where met then the <br/>\n&#39;measuring&#39; would have been tolerable. I do not know.<br/>\n<br/>\nMaybe th measuring in Dusty&#39;s family is a big deal because there is a pain. <br/>\nMaybe it would not be a big deal if there is no &#39;Futterneid&#39; issue. I do not <br/>\nknow. I do know thought that measuring, as you exprssed it still triggeres <br/>\nthe core of my Futterneid thing.<br/>\n<br/>\nThough my post was not so much about myself but more in response to Dusty.<br/>\n<br/>\nThank you for your patience with my unschooled past.<br/>\nUlrike<br/>\n<br/>\n<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________ NOD32 4193 (20090626) Information __________<br/>\n<br/>\nThis message was checked by NOD32 antivirus system.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a></div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246373292","msgId":40673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZDhqYytkdHFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":40672,"nextInTopic":40675,"prevInTime":40672,"nextInTime":40674,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"... ******Why?  Why is it unreasonable?  I m not suggesting you run right out and break the bank, but certainly there are more options.  My children each have","messageBody":"<div id=\"ygrps-yiv-1038874993\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;synonymous@...&quot; &lt;synonymous@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It&#39;s unreasonable for me to purchase multiples of some of these things. <br/>\n<br/>\n </span></blockquote>******Why?  Why is it unreasonable?  I&#39;m not suggesting you run right out and break the bank, but certainly there are more options.  My children each have their own computer.  As do my husband and I.  Is that unreasonable?  <br/>\n<br/>\nHe needs more time.  Are you willing to help him meet his needs?  Can you find a way to save some money each week for a second [insert object here].  <br/>\n<br/>\nHeather<br/>\nwww.swissarmywife.net<br/>\n========================================================================</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246371550","msgId":40672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZDZzdStkcGxwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjcwMWM5Zjk1MiQ2ZjgwYjQzMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4="},"prevInTopic":40669,"nextInTopic":40673,"prevInTime":40671,"nextInTime":40673,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"~~Totally irrational and very painful.~~ Not really irrational at all. You were getting a measured portion, chosen by another human. That s not fair","messageBody":"<div id=\"ygrps-yiv-1874941235\">~~Totally irrational and very painful.~~<br/>\n<br/>\nNot really irrational at all. You were getting a measured portion, chosen by another human. That&#39;s not &quot;fair&quot; actually. Every human has different needs in order to be filled-up. With food, with attention, with everything. Until the child gets to have the portion that makes them feel satisfied, there will be a sense of lack.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sharing, tantrums, Creating Interesting Environment","postDate":"1246362756","msgId":40669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyY3VhNCsyMzMzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":40665,"nextInTopic":40672,"prevInTime":40668,"nextInTime":40670,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"How old are the children? Nance","messageBody":"<div id=\"ygrps-yiv-2135445461\">How old are the children?<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;synonymous@...&quot; &lt;synonymous@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I need some advice on a couple things. <br/>\n&gt; <br/>\n&gt; First, sharing. </span></blockquote></div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Sharing, tantrums, Creating Interesting Environment","postDate":"1246346030","msgId":40665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjcwMWM5Zjk1MiQ2ZjgwYjQzMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":40661,"nextInTopic":40669,"prevInTime":40664,"nextInTime":40666,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"Dusty Your post caught my eye and I beg you to allow me to say a few things that came to my mind. The overwhelming image I get from your story is the pattern","messageBody":"<div id=\"ygrps-yiv-1497859885\">Dusty<br/>\n<br/>\nYour post caught my eye and I beg you to allow me to say a few things that came to my mind.<br/>\n<br/>\nThe overwhelming &#39;image&#39; I get from your story is the pattern of &quot;Futterneid&quot;. This is something I still battle with within myself occasionally even at nearly 58 years. :)<br/>\n<br/>\nI am the eldest of four. When I was 15 months old my first brother was born followed by two more brothers also in 15 months intervals. It was an overwhelming time for my mother and I always &#39;felt&#39; as if I was not part of the rest of humanity. I may possibly be on the spectrum with a lot of what I learned about Asperger&#39;s. Now, relating to the Futterneid thing. I remember always &#39;feeling&#39; that I don&#39;t get my share. I could sit at the table and have had my serving and be quite satisfied but &#39;needed&#39; to get the last bite of the piece of bread my mother would eat. Deserts were the worst. My mother would measure out equal portions - even put them on a scale - and I ALWAYS felt that I did not get my share. Totally irrational and very painful.<br/>\nAnd I only became aware of this very recently and used meridian tapping to release most of this emotional block within. I &#39;tapped&#39; on feeling rejected and abandonded and &#39;never getting enough&#39; and a lot on &#39;nobody loves me&#39;.<br/>\nAnd now when I think back at my childhood I can see how my mother did her best to give me what she could. Before I believed that I had a troubled childhood.<br/>\n<br/>\nSo, back to your little one. Maybe he carries a similar emotional scar, irrational and painful and the only way he can express it is the way he does at present. I don&#39;t know if giving him &#39;Extras&#39; is a solution though. <br/>\n<br/>\nYou can learn about meridian tapping for free at emofree.com. I am also willing to &#39;work&#39; with you through this for the little one. We could chat on Skype or Yahoo Messenger.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":404746948,"authorName":"synonymous@att.net","from":"&quot;synonymous@...&quot; &lt;synonymous@...&gt;","profile":"synonymous@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sharing, tantrums, Creating Interesting Environment","postDate":"1246281343","msgId":40661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyYWVwdit0bWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40665,"prevInTime":40660,"nextInTime":40662,"topicId":40661,"numMessagesInTopic":0,"msgSnippet":"I need some advice on a couple things. First, sharing. We have some expensive things that need to be shared by everyone in the home. Television, Video Game","messageBody":"<div id=\"ygrps-yiv-1179418261\">I need some advice on a couple things. <br/>\n<br/>\nFirst, sharing. We have some expensive things that need to be shared by everyone in the home. Television, Video Game Systems, Computer, Musical Instruments. It&#39;s unreasonable for me to purchase multiples of some of these things. There needs to be some sort of compromise on sharing them with each other. But, my oldest son is not interested in sharing them. He is overbearing when someone is having their turn on a video game, or computer, or whatever it is. I tried two player games, or one of them plays one instrument while another plays a different instrument. But, it just doesn&#39;t seem to work. Then, I find myself thinking, &quot;If they aren&#39;t going to get along sharing these things, I might as well get rid of the stuff. It is not worth the aggravation.&quot; My husband gets very annoyed by the seemingly constant battle over who gets what. That is understandable, he works and then comes home to frequent arguments over the oldest child&#39;s pestering others during their turns with things.<br/>\n<br/>\nIf I tell my oldest son that it is someone else&#39;s turn, he will say &quot;No.&quot; But, it has to be someone else&#39;s turn because they are waiting patiently to play or use the object. I try to give oldest enough time to accomplish a goal, then I need him to take maybe a 30 minute break while someone else gets to use the game/comp/instruments. He doesn&#39;t want to share with other children, or adults. While it is not his turn with the object in question, he will hover over the other person, pestering them. Sometimes, he will flail around, throwing his body in a tantrum if his turn is over. I try to not interrupt him mid-mission.. I allow him to finish levels, or finish checking emails, or finish playing a song. On the computer, he can leave his game or window open, just minimized, so he doesn&#39;t actually have to exit it while the other person has a turn. But, it doesn&#39;t seem to help. I have a wireless mouse and he will steal it from people trying to use the computer. Or, if they are playing a nintendo game, he will constantly hit the reset button and run. Also, if a child gets one turn, he says he should get twice as much.. so, if they play two levels, he should get to play four levels. I don&#39;t understand where this logic comes from?<br/>\n<br/>\nHe will threaten the other kids with deleting their games, characters, etc. He doesn&#39;t really do it.. he just likes to get a rise out of them. (He frequently says things just to get a reaction out of the other kids). I try to direct him toward doing something else.. eat a snack, or we&#39;ll do artwork or something. But, nothing seems to be so interesting that it keeps his attention from the fact that someone else is having their turn on the computer or video game or watching the movie they like.<br/>\n<br/>\nAnd that is that. I need help. I can&#39;t just go off and buy computers for everyone (we already have two), several copies of the same video game systems (we do have several different systems, but no duplicate systems), or multiple instruments - though we have a wide variety of instruments and some are duplicates.<br/>\n<br/>\nSo, another thing is creating an interesting environment for my oldest.. some way to captivate his attention while others have their turns. Maybe I just haven&#39;t been very good at creating an interesting environment for him. I have puppets, games, instruments, books, tons of arts n crafts, we cook recipes, but nothing seems to take his mind off the fact that someone else is having a turn with the computer or video games, or whatever. He&#39;s always interested in what they are doing, no matter what I try to get involved with him. Instead of enjoying time doing something else, he simply watches over his shoulder.. or makes excuses to go to where ever they are, and watching the clock for his next turn. <br/>\n<br/>\nOther kids are not as intense as him, but are beginning to follow in his footsteps. Such as, asking constantly.. when is so-and-so going to be done and they can have their turn (even though they can all tell time and I show them the time when it will be their turn),  and pitching fits when their turns are up. Not wanting to be engaged in other activities while they wait for their turns..<br/>\n<br/>\nI have too many people here and not enough room or money, for everyone to have their very own Wii, or their very own private computer, when these items are designed to allow multiple people to use them and are generally expensive and require space and other equipment to set them up.<br/>\n<br/>\nI need them to share things peaceably or I&#39;m going to lose my mind. <br/>\n<br/>\nThanks in Advance<br/>\nDusty</div>","specialLinks":[]}],"prevTopicId":40734,"nextTopicId":40660}}