{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":196381819,"authorName":"ANGELA BERRY","from":"ANGELA BERRY &lt;berryajj@...&gt;","profile":"jennafirst2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:being with the kids vs. in other room","postDate":"1235567717","msgId":38473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3MDYyNS44NTYwMi5xbUB3ZWI4MDIwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":38451,"nextInTopic":0,"prevInTime":38472,"nextInTime":38474,"topicId":38451,"numMessagesInTopic":0,"msgSnippet":"Amanda, We have the same ages and mine are both girls in the same boat!  We all use to hang out together and keep very busy with different objects, crafts,","messageBody":"<div id=\"ygrps-yiv-2027676781\">Amanda,<br/>\n<br/>\nWe have the same ages and mine are both girls in the same boat!  We all use to hang out together and keep very busy with different objects, crafts, kitchen etc.  Now this past winter it has been the same.  It seems the pattern of ton more friend play has drawn my girls away.  As like you it makes me so sad to see and yet happy about the confident growth they are having. Such a two way feeling street, huh?<br/>\n<br/>\nI have been doing a candle lite circle time with them and they love it so once we are done I will suggest another idea for us to do and keep them as long as I can that hour.<br/>\n<br/>\nIt is amazing how much of your email matched myself currently.  How much time I feel I have and get not much accomplished trying to plan things that are not working out.  I do have a toddler too and he is so busy and maybe that is what has drawn us apart some too.<br/>\n<br/>\n;o(  Angela <br/>\nMom to Jenna 9<br/>\nRylee 6<br/>\nGavin 19mo<br/>\nWe are in the cold state - Michigan<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":346413918,"authorName":"bokusfam@localnet.com","from":"bokusfam@...","profile":"amandabokus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"being with the kids vs. in other room","postDate":"1235414572","msgId":38451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDkwMjIzMTM0MjUyLmY3Nm9weXNzZ3c4MGdzdzRAd2VibWFpbC5sb2NhbG5ldC5jb20+"},"prevInTopic":0,"nextInTopic":38473,"prevInTime":38450,"nextInTime":38452,"topicId":38451,"numMessagesInTopic":0,"msgSnippet":"This topic was touched on maybe last week but I didn t get the chance to chime in then.  I ve been trying to spend more time each day connected with the kids","messageBody":"<div id=\"ygrps-yiv-283042250\">This topic was touched on maybe last week but I didn&#39;t get the chance <br/>\nto chime in then.  I&#39;ve been trying to spend more time each day <br/>\nconnected with the kids and doing something with them.  I too, find <br/>\nthat since we are home &quot;together&quot; all day that it is sometimes easy to <br/>\nthink to myself &quot;gee- since we&#39;re always together, I&#39;ll go off and do <br/>\nmy own thing (cook, email, read a book) upstairs while the kids watch <br/>\nthis show, use the PS2, etc&quot; <br/>\n<br/>\n  So, I try to make sure that I do some of those things &quot;with&quot; them <br/>\neach day too (we are all loving the new Playstation & DS)- plus the <br/>\nother stuff like cuddling, reading books together, and what-not. <br/>\n<br/>\n  The thing is, I find that they don&#39;t always &quot;want&quot; me to hang out and <br/>\ndo those things with them.  We used to play board games A LOT and have <br/>\ntons of great ones- lately they&#39;ve been using the PS2, DS, or watching <br/>\nTV alot and I have to admit that I am feeling left out. I&#39;m NOT feeling <br/>\nbad about all the other stuff that isn&#39;t getting used this winter now <br/>\nthat we have video games & a TV (as we are really enjoying them) it&#39;s <br/>\njust that we do have lots of other great stuff to do too...<br/>\n<br/>\n  Yes, we do those things (video gaming & TV) together too (I have <br/>\nfigured out a few games on the PS2 and dd needs my help for most of her <br/>\nDS games at least to get her started).  We cuddle up on the couch <br/>\ntogether to watch TV and read, but I have been feeling like although <br/>\nI&#39;m strewing or suggesting other interesting stuff to do together, <br/>\nright now they are pretty happy with this groove they have of building <br/>\nwith legos alone (well actually the kids are together in the basement <br/>\nplaying) and don&#39;t really &quot;need&quot; me down there with them anymore.   <br/>\nThey don&#39;t complain though if I plop down next to them on the couch <br/>\nwhile they watch a movie, it&#39;s just that they don&#39;t always &quot;need&quot; me to <br/>\nbe there.<br/>\n<br/>\n  So, part of it may be that they are growing up- almost 9 and 6, they <br/>\nare also getting along great lately and have been enjoying playing <br/>\ntogether without me, plus the introduction of the electronics has kept <br/>\nthem busy this winter too.  When they were younger, there was always <br/>\nthat constant interaction between us and the need to entertain/ play <br/>\nwith them, as they get older and become more independent, that has <br/>\nchanged..<br/>\n<br/>\n  But, even though they don&#39;t need me there as much any more, I&#39;ve been <br/>\ntrying to make a concious effort to be near them when they are doing <br/>\nthings even if we&#39;re not doing them together- I can read my book in the <br/>\nbasement near the woodstove while they build with legos and listen to a <br/>\nbook on tape- then I&#39;m there to see each creation, change the CD <br/>\nwithout them needing to yell up to find me, etc.<br/>\n<br/>\n  And I try to find new things for us to do together, suggest playing a <br/>\ngame together, cooking something together, etc sometimes they take me <br/>\nup on it, sometimes not.<br/>\n<br/>\n  We are also waiting for a foster care placement of an infant in our <br/>\nhome and I know that once the baby comes, we won&#39;t have as much time to <br/>\ndo some things together- I&#39;ll be busy with baby care...<br/>\n<br/>\n  Just wanted to mention how we&#39;&#39;ve been handling this issue here lately.<br/>\n<br/>\n  Amanda<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38472,"nextTopicId":38480}}