{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Where do I start and what should I expect?","postDate":"1274373834","msgId":44249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M29zYStwc3JjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGh0MmQ5cCtoZGZsQGVHcm91cHMuY29tPg=="},"prevInTopic":44239,"nextInTopic":0,"prevInTime":44248,"nextInTime":44250,"topicId":44232,"numMessagesInTopic":0,"msgSnippet":"... ***************** Unschooling isn t about permissiveness, its about reframing your understanding of childhood and learning. A child who s showing a lot of","messageBody":"<div id=\"ygrps-yiv-1397295321\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Tawnya&quot; &lt;tawferdo@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My question is what should we do to begin to turn things around?? I also wonder what to potentially expect from the kids in response to what&#39;s likely to be perceived as newfound permissiveness..<br/>\n </span></blockquote>*****************<br/>\n<br/>\nUnschooling isn&#39;t about permissiveness, its about reframing your understanding of childhood and learning. A child who&#39;s showing a lot of &quot;bad behavior&quot; is trying to tell you something and doesn&#39;t have another, better way of doing that. He may be needing a lot of attention - so give him lots of attention! That&#39;s a good place to start any time one of your kids is having trouble (unless they&#39;re telling you to back off, of course ;)). If nothing else, the more time and attention you give your 3yo, the better you&#39;ll be able to figure out what he needs. <br/>\n<br/>\nAnother big big issue for 3yos is that they want what they want when they want it. When they want to be independent they get upset when you try to help. When they want help they scream for it, or hit or use some other, very basic coping/communication skill. So it can help a Lot to make sure your home is set up for the convenience of a 3yo. Make sure he can he reach everything he wants to reach so he doesn&#39;t have to ask. Make sure the things he wants help with you&#39;re jumping in and offering help before he has to ask. Make his life Easy. It goes a loooooong way, I promise (and of course, its impossible to make life perfect, so understand that there will, of course, be upsets, too). <br/>\n<br/>\nIts harder with several children, and even harder with a new baby, but direct as much time and attention as you can toward helping your 3yo navigate his world successfully - that&#39;s a good way to think about unschooling: setting kids up for success in whatever they choose to do. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Where do I start and what should I expect?","postDate":"1274363938","msgId":44239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NEJCMEJBLTM1MzMtNEM5OC04NTg5LTNDM0YyOUE2NjY1MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGh0MmQ5cCtoZGZsQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0MmQ5cCtoZGZsQGVHcm91cHMuY29tPg=="},"prevInTopic":44232,"nextInTopic":44249,"prevInTime":44238,"nextInTime":44240,"topicId":44232,"numMessagesInTopic":0,"msgSnippet":"... I would say definitely the events are a contributor if not a big contributor. Age can also be a contributor. I don t think radical unschooling should be","messageBody":"<div id=\"ygrps-yiv-1333109383\">On May 20, 2010, at 12:20 AM, Tawnya wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I list these events because I think they were all hard on him and I  <br/>\n&gt; don&#39;t know if his behavior can/should be attributed to this sequence  <br/>\n&gt; of events...or is it possible that he would have/will be better  <br/>\n&gt; equipped to handle challenges if our relationships reflected the  <br/>\n&gt; values of radical unschooling<br/>\n<br/>\n </span></blockquote>I would say definitely the events are a contributor if not a big  <br/>\ncontributor. Age can also be a contributor.<br/>\n<br/>\nI don&#39;t think radical unschooling should be seen as a way of ensuring  <br/>\na harmonious life. Life throws monkey wrenches at us. Radical  <br/>\nunschooling can&#39;t stop that or make the wrenches not hurt. What  <br/>\nradical unschooling can do is create a comforting nest to recover and  <br/>\nheal in *and* eliminate as many monkey wrenches that parents  <br/>\ninadvertently throw at their kids without realizing it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We&#39;ve reduced ourselves to unsuccessful coercive parenting  <br/>\n&gt; techniques as a response to hitting siblings, arguing, defiant acts  <br/>\n&gt; and disrespectful language.<br/>\n<br/>\n<br/>\n </span></blockquote>His actions say he has a big need in him that&#39;s irritating that he&#39;s  <br/>\ntrying to relieve. By focusing on the way he&#39;s going about it, the  <br/>\nmessage he&#39;s getting from your actions is that you don&#39;t care about  <br/>\nhis needs, only your agenda.<br/>\n<br/>\nIf you were arguing loudly with a friend over something important and  <br/>\nsomeone stepped in and focused on the way you were arguing, would that  <br/>\nbe helpful or irritating? Wouldn&#39;t it feel like they didn&#39;t care about  <br/>\nyou and your friend&#39;s problem only about their problem with arguing?  <br/>\nThey could help by focusing on the problem between you, not the arguing.<br/>\n<br/>\nFocus less on the symptoms of his irritation and more on making him  <br/>\nmore comfortable so you can redirect the build up before it gets to  <br/>\nthe explosion. Do, yes, stop him if he does hit. Call him away to do  <br/>\nsomething more interesting. But even better is being aware of the  <br/>\ndynamics going on. Do the equivalent of feeding them before they&#39;re  <br/>\ncrying from starvation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also wonder what to potentially expect from the kids in response  <br/>\n&gt; to what&#39;s likely to be perceived as newfound permissiveness.<br/>\n<br/>\n </span></blockquote>You go slow to hopefully avoid that! ;-)<br/>\n<br/>\nSay &quot;Yes&quot; more rather than removing all the rules or declaring that  <br/>\nyou&#39;ve changed things. Don&#39;t make a big deal out of it. Be the good  <br/>\nguy and say yes more. If there are problems with a suggestion, talk  <br/>\nabout ways to solve that.<br/>\n<br/>\nHave you read:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a><br/>\n<br/>\nThere are loads more at Sandra&#39;s site that should help you avoid  <br/>\nfalling into the feeling of there suddenly being no rules.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":328499124,"authorName":"Tawnya","from":"&quot;Tawnya&quot; &lt;tawferdo@...&gt;","profile":"tawferdo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Where do I start and what should I expect?","postDate":"1274329209","msgId":44232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0MmQ5cCtoZGZsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44239,"prevInTime":44231,"nextInTime":44233,"topicId":44232,"numMessagesInTopic":0,"msgSnippet":"I am a long-time lurker who is drawn to radical unschooling in theory but hasn t made any effort to put it into practice in my home.  We do and always have","messageBody":"<div id=\"ygrps-yiv-127197047\">I am a long-time lurker who is drawn to radical unschooling in theory but hasn&#39;t made any effort to put it into practice in my home.  We do and always have homeschooled. Our family consists of my husband, myself (the stay-at-home parent) and our four sons who are ages 9, 5, 3 and 6 months. We have always had a fairly easy time parenting our kids in a way that made us feel like we were all relatively content. Recently, however, that has changed. I believe that my kids, my 3 yo especially, need us to<br/>\nput in the effort to shift our relationships and treat eachother differently. The interactions between my 3 yo and each of the other family members are in crisis. He is, most of the time, antagonistic, negative and seems unhappy. This has been more pronounced in the past few months and has been present in some way for about 8 or 9 months. I don&#39;t want to get too long-winded, but a brief history of our last year includes a LOT of big changes, including the death of my uncle, the birth of our fourth, long-term house hunting followed by purchasing a home and moving and losing a pet dog after she attacked the new neighbor. I list these events because I think they were all hard on him and I don&#39;t know if his behavior can/should be attributed to this sequence of events...or is it possible that he would have/will be better equipped to handle challenges if our relationships reflected the values of radical unschooling. We&#39;ve reduced ourselves to unsuccessful coercive parenting techniques as a response to hitting siblings, arguing, defiant acts and disrespectful language.<br/>\n<br/>\nMy question is what should we do to begin to turn things around?? I also wonder what to potentially expect from the kids in response to what&#39;s likely to be perceived as newfound permissiveness..<br/>\n<br/>\nThanks for taking the time to read and offer your insights.<br/>\n<br/>\nSincerely,<br/>\nTawnya</div>","specialLinks":[]}],"prevTopicId":3865,"nextTopicId":44261}}