{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Can I vent here? finale!","postDate":"1136391378","msgId":8718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwZ3NjaStyczVlQGVHcm91cHMuY29tPg=="},"prevInTopic":8717,"nextInTopic":0,"prevInTime":8717,"nextInTime":8719,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"swallowing my objections about handling glass, splashing in water, etc. I could feel my strength grow as I remained positive, and instead of saying STOP","messageBody":"<div id=\"ygrps-yiv-889789797\">&quot;swallowing my objections about handling glass, <br/>\nsplashing in water, etc. I could feel my strength grow as I remained <br/>\npositive, and instead of saying <br/>\n&quot;STOP PLAYING with the BROKEN glass!&quot; crouching down and affirming <br/>\ntheir interests, explaining why we needed to be careful, etc. Led to <br/>\nan interesting conversation about how glass is made, why people <br/>\nleave it at the lake, and the kids want to come back <br/>\nand do litter duty next weekend.&quot;<br/>\n<br/>\n<br/>\nThis was really great to read about!!! Once you see how your <br/>\nopenness and curiosity leads to conversations and learning moments, <br/>\nit gets easier and easier to shush those negative voices. <br/>\nOne positive moment leads to another, because we can see more easily <br/>\nwhat creates a truly joyful moment.<br/>\n<br/>\nI talked once about being an &quot;open door&quot; for your children and how <br/>\nsaying &quot;NO&quot; closes the door in their face.<br/>\nYou can say &quot;no&quot; without really saying &quot;no&quot; even....by saying &quot;yes, <br/>\nI like that idea, but it won&#39;t work today&quot; you are at least leaving <br/>\nthe door open.<br/>\nTry to leave the door open as much as possible, it leads to some <br/>\nreally amazing places!<br/>\n<br/>\nThanks for sharing your joyful day.:)<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Can I vent here? finale!","postDate":"1136353559","msgId":8717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGODBFMkE2LUQ2OEUtNDQ5OC1CQTdFLTFCNUM0ODU1N0JENUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRwZmwzcStxMjVvQGVHcm91cHMuY29tPg==","referencesHeader":"PGRwZmwzcStxMjVvQGVHcm91cHMuY29tPg=="},"prevInTopic":8716,"nextInTopic":8718,"prevInTime":8716,"nextInTime":8718,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"... WONDERFUL. Thanks for that story - it was great. And - just reading your posts we can ALL feel your strength growing! Have fun! -pam [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-992855576\">On Jan 3, 2006, at 9:06 PM, multimomma wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; i can already feel my brain changing, yesterday at the lake was an  <br/>\n&gt; awesome experience, a<br/>\n&gt; few hours hiking around the shoreline, no agenda, no plans, just  <br/>\n&gt; watching the kids watch<br/>\n&gt; the world, answering questions, swallowing my objections about  <br/>\n&gt; handling glass, splashing<br/>\n&gt; in water, etc. I could feel my strength grow as I remained  <br/>\n&gt; positive, and instead of saying<br/>\n&gt; &quot;STOP PLAYING with the BROKEN glass!&quot; crouching down and affirming  <br/>\n&gt; their interests,<br/>\n&gt; explaining why we needed to be careful, etc. Led to an interesting  <br/>\n&gt; conversation about how<br/>\n&gt; glass is made, why people leave it at the lake, and the kids want  <br/>\n&gt; to come back and do<br/>\n&gt; litter duty next weekend. With the drought there is a lot of  <br/>\n&gt; interesting stuff to be seen, and<br/>\n&gt; lots of cool conversations.<br/>\n<br/>\n </span></blockquote>WONDERFUL. Thanks for that story - it was great. And - just reading  <br/>\nyour posts we can ALL feel your strength growing!<br/>\n<br/>\nHave fun!<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"multimomma","from":"&quot;multimomma&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Can I vent here? finale!","postDate":"1136351162","msgId":8716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwZmwzcStxMjVvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwZGlmbitrdWM5QGVHcm91cHMuY29tPg=="},"prevInTopic":8696,"nextInTopic":8717,"prevInTime":8715,"nextInTime":8717,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"Thanks all for all the replies, insights and ideas. I think the most important thing that I m walking away with is more insight to my hubby s brain, and a","messageBody":"<div id=\"ygrps-yiv-747637791\">Thanks all for all the replies, insights and ideas.<br/>\nI think the most important thing that I&#39;m walking away with is more insight to my hubby&#39;s <br/>\nbrain, and a little more compassion, and some willingness to compromise with him about <br/>\nlittle things until we see that it&#39;s working. Right now it&#39;s very hard. The kids are testing <br/>\nboundaries and are unsure of me as it is. I&#39;m unsure of me half the time. all I know is that I <br/>\nwant them to feel joy, love and interest in every day. And when he questions it, I question <br/>\nmyself.<br/>\n<br/>\nDh does bring so much strength to the table, there is no way I could make it without him. <br/>\nHe&#39;s a loving father, and up til now has been more tolerant of noise and nonsense. Less <br/>\ntolerant of messes, so maybe that was his battle and I&#39;m stealing it? He&#39;s really great about <br/>\ntaking a moment and making it shine, if that makes sense. He&#39;s the kind of person who <br/>\nknows something about everything, or if he doesn&#39;t he knows how to question it and show <br/>\nthe kids some thought process. He doesn&#39;t lecture, which I&#39;m jealous of...I slip into it <br/>\nwithout thinking sometimes. ;-)<br/>\n<br/>\ni can already feel my brain changing, yesterday at the lake was an awesome experience, a <br/>\nfew hours hiking around the shoreline, no agenda, no plans, just watching the kids watch <br/>\nthe world, answering questions, swallowing my objections about handling glass, splashing <br/>\nin water, etc. I could feel my strength grow as I remained positive, and instead of saying <br/>\n&quot;STOP PLAYING with the BROKEN glass!&quot; crouching down and affirming their interests, <br/>\nexplaining why we needed to be careful, etc. Led to an interesting conversation about how <br/>\nglass is made, why people leave it at the lake, and the kids want to come back and do <br/>\nlitter duty next weekend. With the drought there is a lot of interesting stuff to be seen, and <br/>\nlots of cool conversations.<br/>\n<br/>\nAnyway, thanks to the listmates who responded, and all. It&#39;s late, dh is playing chess with <br/>\nour oldest, the little ones are asleep, and I&#39;m typing while nursing. Not easy, but it&#39;s my <br/>\nonly free time.<br/>\n<br/>\nMelissa</div>","specialLinks":[]},{"userId":106155453,"authorName":"Sonia","from":"&quot;Sonia&quot; &lt;soniacrane46@...&gt;","profile":"yookaysonia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Can I vent here? (long post w/ ?)","postDate":"1136282935","msgId":8696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwZGlmbitrdWM5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyYjAwMWM2MGZmNyQyODVkOWMwMCQ2YTAwYThjMEBjb21wdXRlcj4="},"prevInTopic":8690,"nextInTopic":8716,"prevInTime":8695,"nextInTime":8697,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"Tyra, I knew somone would put it in a way that I felt but couldn t express, such insight too.....wonderfully worded.  I will cut and paste this post for","messageBody":"<div id=\"ygrps-yiv-618675578\">Tyra,<br/>\n<br/>\nI knew somone would put it in a way that I felt but couldn&#39;t <br/>\nexpress, such insight too.....wonderfully worded.  I will cut and <br/>\npaste this post for further reference.  A BIG THANK YOU<br/>\n<br/>\n....I do lose the plot sometimes, well, regularly, really, but <br/>\nthankfully, people on this site can pull me back to where I want to <br/>\nbe.  <br/>\n<br/>\nI also take the path of least resistance, sometimes for peace sake, <br/>\nand to set a happy environment.  Since unschooling, I am not up for <br/>\nwinning battles or wars, just seeking a better way for us to live in <br/>\nharmony with what is going on in our lives, and hopefully spreading <br/>\nthe &#39;unschooling&#39; way of life!!!  <br/>\n<br/>\nSonia<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Mother Earth &#92;(Tyra&#92;)&quot; <br/>\n&lt;motherspirit@b...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Melissa!<br/>\n&gt; <br/>\n&gt; First of all, here is a {{{HUG}}}!  I can really relate to some of <br/>\n </span></blockquote>what you are saying.  What I have done over the years when I feel <br/>\nunsupported by my dh is I try to not focus on my frustration with my <br/>\nhusband.  I have found that if I really think about it, for every <br/>\nthing that I don&#39;t like about his behavior, he has the same number <br/>\nof dislikes with respect to my behavior.  The other thing is that I <br/>\ndon&#39;t want to conform to what he wants to do unless I choose to and <br/>\nso I will not expect him to conform to what I want him to do unless <br/>\nhe chooses to out of respect.  That does not make him or me right <br/>\nour wrong, it just frees my mind up to focus on what I want to do <br/>\nAND brings me PEACE!!!!!!!!!!!!!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I often feel like I am the parent that is more connected, more <br/>\n </span></blockquote>willing to make changes in order to bring out the best in both my <br/>\nchildren and myself.  But, I do believe that each parent brings <br/>\nstrengths and weaknesses to the table that will eventually help the <br/>\nentire family grow.  Since I started unschooling and becoming much <br/>\nmore relaxed and comfortable with my children, when I here my <br/>\nhusband set limitations on them or barks commands at them, it jars <br/>\nme.  However, I have decided that he has to grow in his own way as I <br/>\nhave and all I can do is be an example.  Over time I have found that <br/>\nhe usually softens down as he sees that I have AND that it works.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Let me qualify all of this with the fact that I am a path of least <br/>\n </span></blockquote>resistance type of gal AND my husband is not the type of person that <br/>\nis open to someone changing him.  As a matter of fact, he will do <br/>\nthe exact opposite if I do kind of push a certain way of being onto <br/>\nhim.  I believe that our hubby&#39;s can in some weird almost sick way <br/>\nsupport us although they do not operate like us.  My husband does <br/>\nnot say that he is against what I am doing.  He tells me to do what <br/>\nI want to do but that does not mean that he subscribes to my ways.  <br/>\n(That sucka!  LOL!)  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So, if I don&#39;t have the pressure of him wanting me to do things a <br/>\n </span></blockquote>certain way, then I don&#39;t worry too much about what he is doing or <br/>\nnot doing to support me.  That takes away from my peace and joy with <br/>\nthe children.  Plus, I often think that when my children are grown <br/>\nand gone, I will have memories of completion rather than trying to <br/>\nrecapture with my grandchildren what I should have done with my <br/>\nchildren.  In the midst of my greatest frustration with hubby, that <br/>\nhelps to settle me down.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I wish you much success and thank you for sharing.  Because <br/>\n </span></blockquote>although I am describing me in general, these last few days I have <br/>\nwanted to ring my hubby&#39;s neck almost for the EXACT same reason as <br/>\nyou.  Must be something in the cosmic air!  LOL!<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Love<br/>\n&gt; Tyra<br/>\n&gt;   ----- Original Message ----- <br/>\n&gt;   From: multimomma <br/>\n&gt;   To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n&gt;   Sent: Sunday, January 01, 2006 10:34 PM<br/>\n&gt;   Subject: [unschoolingbasics] Can I vent here? (long post w/ ?)<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;   I know I&#39;m new to all this, but I&#39;m trying hard. <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":183015595,"authorName":"Mother Earth (Tyra)","from":"&quot;Mother Earth &#92;(Tyra&#92;)&quot; &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Can I vent here? (long post w/ ?)","postDate":"1136244636","msgId":8690,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYjAwMWM2MGZmNyQyODVkOWMwMCQ2YTAwYThjMEBjb21wdXRlcj4=","referencesHeader":"PGRwYWFmcisxMGdvckBlR3JvdXBzLmNvbT4="},"prevInTopic":8687,"nextInTopic":8696,"prevInTime":8689,"nextInTime":8691,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"Melissa! First of all, here is a {{{HUG}}}!  I can really relate to some of what you are saying.  What I have done over the years when I feel unsupported by my","messageBody":"<div id=\"ygrps-yiv-723510953\">Melissa!<br/>\n<br/>\nFirst of all, here is a {{{HUG}}}!  I can really relate to some of what you are saying.  What I have done over the years when I feel unsupported by my dh is I try to not focus on my frustration with my husband.  I have found that if I really think about it, for every thing that I don&#39;t like about his behavior, he has the same number of dislikes with respect to my behavior.  The other thing is that I don&#39;t want to conform to what he wants to do unless I choose to and so I will not expect him to conform to what I want him to do unless he chooses to out of respect.  That does not make him or me right our wrong, it just frees my mind up to focus on what I want to do AND brings me PEACE!!!!!!!!!!!!!<br/>\n<br/>\nI often feel like I am the parent that is more connected, more willing to make changes in order to bring out the best in both my children and myself.  But, I do believe that each parent brings strengths and weaknesses to the table that will eventually help the entire family grow.  Since I started unschooling and becoming much more relaxed and comfortable with my children, when I here my husband set limitations on them or barks commands at them, it jars me.  However, I have decided that he has to grow in his own way as I have and all I can do is be an example.  Over time I have found that he usually softens down as he sees that I have AND that it works.<br/>\n<br/>\nLet me qualify all of this with the fact that I am a path of least resistance type of gal AND my husband is not the type of person that is open to someone changing him.  As a matter of fact, he will do the exact opposite if I do kind of push a certain way of being onto him.  I believe that our hubby&#39;s can in some weird almost sick way support us although they do not operate like us.  My husband does not say that he is against what I am doing.  He tells me to do what I want to do but that does not mean that he subscribes to my ways.  (That sucka!  LOL!)  <br/>\n<br/>\nSo, if I don&#39;t have the pressure of him wanting me to do things a certain way, then I don&#39;t worry too much about what he is doing or not doing to support me.  That takes away from my peace and joy with the children.  Plus, I often think that when my children are grown and gone, I will have memories of completion rather than trying to recapture with my grandchildren what I should have done with my children.  In the midst of my greatest frustration with hubby, that helps to settle me down.<br/>\n<br/>\nI wish you much success and thank you for sharing.  Because although I am describing me in general, these last few days I have wanted to ring my hubby&#39;s neck almost for the EXACT same reason as you.  Must be something in the cosmic air!  LOL!<br/>\n<br/>\nLove<br/>\nTyra<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: multimomma <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Sunday, January 01, 2006 10:34 PM<br/>\n  Subject: [unschoolingbasics] Can I vent here? (long post w/ ?)<br/>\n<br/>\n<br/>\n  I know I&#39;m new to all this, but I&#39;m trying hard. <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":95897089,"authorName":"simplemom3","from":"&quot;simplemom3&quot; &lt;sja3k@...&gt;","profile":"simplemom3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Can I vent here? (long post w/ ?)","postDate":"1136235097","msgId":8687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwYzNvcCs5c2syQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwYWFmcisxMGdvckBlR3JvdXBzLmNvbT4="},"prevInTopic":8677,"nextInTopic":8690,"prevInTime":8686,"nextInTime":8688,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"I m trying hard. My hubby, however, is not. He is (sorta) okay ... phase), ********************** Hi Melissa, My husband was quite reluctant when he heard the","messageBody":"<div id=\"ygrps-yiv-441360600\">I&#39;m trying hard. My hubby, however, is not. He is (sorta) okay <br/>\n<blockquote><span title=\"ireply\"> &gt; with the not schooling on purpose (he probably thinks it&#39;s a <br/>\n </span></blockquote>phase), <br/>\n**********************<br/>\n<br/>\nHi Melissa,<br/>\nMy husband was quite reluctant when he heard the word &quot;unschooling.&quot;  <br/>\nIt accidentally slipped out while I was talking with him a few months <br/>\nago. I was explaining how much more relaxed our days are, and how <br/>\nmuch more enjoyable life seems.  The word &quot;unschooling&quot; slipped out, <br/>\nand his reaction was not what I was hoping for.  BUT -- he has come <br/>\naround by leaps and bounds.  <br/>\n<br/>\nHis thing is math.  He absolutely insists that they do some formal <br/>\nmath 3 times a week or so.  I am going along with this, even though I <br/>\nreally don&#39;t want to.  I feel like I have to placate him a bit, <br/>\nbecause his worries and concerns (about them getting &quot;behind&quot;) are <br/>\nreal to him.  I feel he deserves some say in the matter, since he is, <br/>\nafter all, The Dad.  :)  <br/>\n<br/>\nI guess what I&#39;m trying to say is that -- with your hubby, the issue <br/>\nseems to be chores.  With mine, it&#39;s math.  Can you just humor him <br/>\n(at least for a while), by pitching in to help the kids with chores <br/>\nwhen he gives them orders (as Ren suggested)?  Sometimes it seems <br/>\nthat we need to take baby steps to get where we really want to <br/>\nbe....especially when it involves keep the marriage partners united.  <br/>\nMom and Dad being at odds creates so much tension...not only with <br/>\neach other, but with the children.  It seems like your situation <br/>\nmight be one of those times when it&#39;s best to make the changes you <br/>\ndesire in very small increments, at least while he is at home.  Like <br/>\nmany of the others said, you can &quot;live life&quot; the way you want to when <br/>\nhe&#39;s otherwise occupied.<br/>\n<br/>\nMy thoughts are with you as you adjust to the new little bundle in <br/>\nyour home while simultaneously fighting a nasty cold :-(<br/>\n<br/>\nBlessings,<br/>\nSharon</div>","specialLinks":[]},{"userId":154681619,"authorName":"michele oquinn","from":"michele oquinn &lt;mmoquinn@...&gt;","profile":"mmoquinn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Can I vent here? (long post w/ ?)","postDate":"1136178248","msgId":8677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTAyMDUwNDA4Ljg1NjEzLnFtYWlsQHdlYjM2NTA5Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGRwYWFmcisxMGdvckBlR3JvdXBzLmNvbT4="},"prevInTopic":8676,"nextInTopic":8687,"prevInTime":8676,"nextInTime":8678,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"I, too, need advice as my husband and my relationship seems so adversarial.  We ve been married 17.5 years and have a dd 14yr and ds 11yr.  I think my husbands","messageBody":"<div id=\"ygrps-yiv-904049899\">I, too, need advice as my husband and my relationship<br/>\nseems so adversarial.  We&#39;ve been married 17.5 years<br/>\nand have a dd 14yr and ds 11yr.  I think my husbands<br/>\nexpectations and general gruffness make me feel the<br/>\nneed to &quot;protect&quot; the kids.  My 11 yo in particular<br/>\nreacts negatively to his dads requests/demands.  There<br/>\nis so much explosiveness in our home...I had hoped for<br/>\nmore peace.<br/>\n<br/>\nFamily conversations generally end up with dad saying<br/>\nwe just all need to do things his way and things would<br/>\nbe fine.  BS!<br/>\n<br/>\n<br/>\n<br/>\n--- multimomma &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:autismhelp@...\">autismhelp@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know I&#39;m new to all this, but I&#39;m trying hard. My<br/>\n&gt; hubby, however, is not. He is (sorta) okay <br/>\n&gt; with the not schooling on purpose (he probably<br/>\n&gt; thinks it&#39;s a phase), but everything else. <br/>\n&gt; Ugh, I can&#39;t even begin to describe it, and maybe<br/>\n&gt; it&#39;s just newbaby hormones, but it <br/>\n&gt; honestly seems like he&#39;s trying to make things<br/>\n&gt; *harder* for me! When I talked to him about <br/>\n&gt; not forcing the kids to do chores, etc, he kind of<br/>\n&gt; laughed it off and said that he&#39;ll see how <br/>\n&gt; long I last. I mean, I thought he understood all the<br/>\n&gt; lead up, agreed when we talked about <br/>\n&gt; how when WE do chores we don&#39;t think twice about<br/>\n&gt; sitting down to rest or grabbing a soda <br/>\n&gt; or whatever. Every time I turned around today, he<br/>\n&gt; did something that he totally would not <br/>\n&gt; have done before though. Including hiding all the<br/>\n&gt; game pieces that were accidentally left <br/>\n&gt; out when the kids (voluntarily!) cleaned up their<br/>\n&gt; games. His pet peeve is that he&#39;s a <br/>\n&gt; workaholic (Iike me) but wants everyone else to bust<br/>\n&gt; their butts working all the time <br/>\n&gt; (unlike me). <br/>\n&gt; <br/>\n&gt; I can deal with the kids, but I&#39;m about to kill my<br/>\n&gt; husband. I was going to talk to him <br/>\n&gt; tonight, but I think I need to rationally think for<br/>\n&gt; a day or two, and get advice from other <br/>\n&gt; parents who had to deal with partners who didn&#39;t<br/>\n&gt; back them up. (or maybe purposefully <br/>\n&gt; sabotaged!) I&#39;m so tired anyway, I don&#39;t need this<br/>\n&gt; kind of crap. I don&#39;t understand why he <br/>\n&gt; was willing to split housework 50/50 before the kids<br/>\n&gt; were able to help, but isn&#39;t willing to <br/>\n&gt; do it now. It&#39;s like his job is to make sure the<br/>\n&gt; kids do all the work. grrr! Considering how <br/>\n&gt; much work they did when I was on bedrest, and<br/>\n&gt; they&#39;re still so young. <br/>\n&gt; <br/>\n&gt; Does this make sense? I know it&#39;s late and I&#39;m still<br/>\n&gt; not asleep, AND I have a cold, so maybe <br/>\n&gt; I&#39;m not making sense. I just know that I&#39;m mad<br/>\n&gt; enough to lay in bed and stew, so I wanted <br/>\n&gt; to come and post here just to get it off my chest<br/>\n&gt; and see if someone has some advice for <br/>\n&gt; me. I know it&#39;s hard on dh, I get frustrated too.<br/>\n&gt; Throughout this pregnancy things have <br/>\n&gt; changed significantly in our lives, our relationship<br/>\n&gt; with each other, with the kids, etc. He&#39;s <br/>\n&gt; had to take on a lot of roles that I&#39;ve covered<br/>\n&gt; since marriage (Ha! I did everything until the <br/>\n&gt; bedrest, housework, yard work, car maintainance,<br/>\n&gt; bills, therapy, schoolwork) In less than <br/>\n&gt; nine months, he&#39;s doing much of this, we started<br/>\n&gt; homeschooling, I&#39;ve changed my <br/>\n&gt; parenting, but doesn&#39;t it seem that he should be<br/>\n&gt; able to roll with the punches? I&#39;m not <br/>\n&gt; asking him to do more work, just support me as I<br/>\n&gt; take on more. Or at least be respectful <br/>\n&gt; of the what the kids do, and when they do it.<br/>\n&gt; <br/>\n&gt; Thanks for listening, I hope this was ok to post<br/>\n&gt; such a long vent, I think I&#39;ll go back and <br/>\n&gt; put that in my subject line as a warning!!!<br/>\n&gt; <br/>\n&gt; melissa <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n\t\t<br/>\n </span></blockquote>__________________________________ <br/>\nYahoo! for Good - Make a difference this year. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://brand.yahoo.com/cybergivingweek2005/\">http://brand.yahoo.com/cybergivingweek2005/</a></div>","specialLinks":[]},{"userId":205483142,"authorName":"multimomma","from":"&quot;multimomma&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Can I vent here? (long post w/ ?)","postDate":"1136176443","msgId":8676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwYWFmcisxMGdvckBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":8677,"prevInTime":8675,"nextInTime":8677,"topicId":8676,"numMessagesInTopic":0,"msgSnippet":"I know I m new to all this, but I m trying hard. My hubby, however, is not. He is (sorta) okay with the not schooling on purpose (he probably thinks it s a","messageBody":"<div id=\"ygrps-yiv-979659352\">I know I&#39;m new to all this, but I&#39;m trying hard. My hubby, however, is not. He is (sorta) okay <br/>\nwith the not schooling on purpose (he probably thinks it&#39;s a phase), but everything else. <br/>\nUgh, I can&#39;t even begin to describe it, and maybe it&#39;s just newbaby hormones, but it <br/>\nhonestly seems like he&#39;s trying to make things *harder* for me! When I talked to him about <br/>\nnot forcing the kids to do chores, etc, he kind of laughed it off and said that he&#39;ll see how <br/>\nlong I last. I mean, I thought he understood all the lead up, agreed when we talked about <br/>\nhow when WE do chores we don&#39;t think twice about sitting down to rest or grabbing a soda <br/>\nor whatever. Every time I turned around today, he did something that he totally would not <br/>\nhave done before though. Including hiding all the game pieces that were accidentally left <br/>\nout when the kids (voluntarily!) cleaned up their games. His pet peeve is that he&#39;s a <br/>\nworkaholic (Iike me) but wants everyone else to bust their butts working all the time <br/>\n(unlike me). <br/>\n<br/>\nI can deal with the kids, but I&#39;m about to kill my husband. I was going to talk to him <br/>\ntonight, but I think I need to rationally think for a day or two, and get advice from other <br/>\nparents who had to deal with partners who didn&#39;t back them up. (or maybe purposefully <br/>\nsabotaged!) I&#39;m so tired anyway, I don&#39;t need this kind of crap. I don&#39;t understand why he <br/>\nwas willing to split housework 50/50 before the kids were able to help, but isn&#39;t willing to <br/>\ndo it now. It&#39;s like his job is to make sure the kids do all the work. grrr! Considering how <br/>\nmuch work they did when I was on bedrest, and they&#39;re still so young. <br/>\n<br/>\nDoes this make sense? I know it&#39;s late and I&#39;m still not asleep, AND I have a cold, so maybe <br/>\nI&#39;m not making sense. I just know that I&#39;m mad enough to lay in bed and stew, so I wanted <br/>\nto come and post here just to get it off my chest and see if someone has some advice for <br/>\nme. I know it&#39;s hard on dh, I get frustrated too. Throughout this pregnancy things have <br/>\nchanged significantly in our lives, our relationship with each other, with the kids, etc. He&#39;s <br/>\nhad to take on a lot of roles that I&#39;ve covered since marriage (Ha! I did everything until the <br/>\nbedrest, housework, yard work, car maintainance, bills, therapy, schoolwork) In less than <br/>\nnine months, he&#39;s doing much of this, we started homeschooling, I&#39;ve changed my <br/>\nparenting, but doesn&#39;t it seem that he should be able to roll with the punches? I&#39;m not <br/>\nasking him to do more work, just support me as I take on more. Or at least be respectful <br/>\nof the what the kids do, and when they do it.<br/>\n<br/>\nThanks for listening, I hope this was ok to post such a long vent, I think I&#39;ll go back and <br/>\nput that in my subject line as a warning!!!<br/>\n<br/>\nmelissa</div>","specialLinks":[]}],"prevTopicId":8692,"nextTopicId":8713}}