{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":52,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and diet/medical issues","postDate":"1151275238","msgId":14918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bjNkNis2aDNsQGVHcm91cHMuY29tPg=="},"prevInTopic":14917,"nextInTopic":14919,"prevInTime":14917,"nextInTime":14919,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"For instance, we don t buy Oreos. Instead we buy Newman-O s. All of us enjoy the flavor as much and in some cases more than the Nabisco brands of the same","messageBody":"<div id=\"ygrps-yiv-1025859917\">&quot;For instance, we don&#39;t buy Oreos. Instead we buy Newman-O&#39;s. All of<br/>\nus enjoy the flavor as much and in some cases more than the Nabisco<br/>\nbrands of the same type of cookies (choc oreos, gingersnaps, and choc<br/>\nmints), so there has been nothing lost or restricted.&quot;<br/>\n<br/>\nThat&#39;s what I&#39;m talking about...meeting the true, underlying need (in<br/>\nthis case for a cookie) while also considering health issues. Getting<br/>\nrestrictive with food creates a sense of lack. Finding creative ways<br/>\nto meet the need is simply compromise. <br/>\n<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and diet/medical issues","postDate":"1151275085","msgId":14917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bjM4ZCs3aTJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":14916,"nextInTopic":14918,"prevInTime":14916,"nextInTime":14918,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"~Ren said if she had a diabetic child she wouldn t leave the M&M bowl out. My niece was diagnosed with diabetes when she was eleven and she s twenty one now.","messageBody":"<div id=\"ygrps-yiv-1801036181\">~Ren said if she had a diabetic child she wouldn&#39;t leave the M&M<br/>\nbowl out. My niece was diagnosed with diabetes when she was eleven and<br/>\nshe&#39;s twenty one now. She&#39;s completely insulin dependant. She eats<br/>\nM&M&#39;s and in fact her doctor told her parents NOT to restrict her diet,<br/>\nbut to give her good information and free choice and to encourage her to<br/>\nmanage her insulin to meet her body&#39;s needs no matter what she was<br/>\neating.~<br/>\n<br/>\n11 is a very different age than 3 or 5 or even 8. A small child with<br/>\nsome kind of life threatening illness should not have something<br/>\ndangerous left within their reach. I don&#39;t believe  unschooling means<br/>\nabdicating parental responsibilty to keep our children safe.<br/>\n<br/>\nUnfortunately, &quot;safe&quot; often means parental fears getting in the way of<br/>\nlogic. LIFE isn&#39;t safe. We&#39;re all going to die. At the same time, it&#39;s<br/>\nour instinct to survive and protect our young...so we do that to the<br/>\nbest of our ability.<br/>\n<br/>\nYou can get M&M&#39;s and other candies that won&#39;t mess up your health as<br/>\nmuch if you ARE diabetic. I know people that maintain very good <br/>\nhealth because they ARE strict with their diet. Finding ways to meet<br/>\nthe desires of a child with health issues is more important to me than<br/>\nsimply leaving every available option within reach.<br/>\n<br/>\nThat&#39;s the key....honoring and meeting the desires of the individual.<br/>\nIt&#39;s our job to be creative enough to do that.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151275019","msgId":14916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bjM2Yit1YjJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU3bXBkOStoNWU4QGVHcm91cHMuY29tPg=="},"prevInTopic":14915,"nextInTopic":14917,"prevInTime":14915,"nextInTime":14917,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"... Thank you Ren!  Your interpretation of my situation is exactly what I meant!  I too think it s important to understand why my son has the constipation","messageBody":"<div id=\"ygrps-yiv-1405164135\"><blockquote><span title=\"ireply\">&gt; We can discuss many solutions to the desire for healthier eating,<br/>\n&gt; without reverting to mainstream methods that lack respect for the<br/>\n&gt; child.<br/>\n&gt; Ren<br/>\n<br/>\n </span></blockquote>Thank you Ren!  Your interpretation of my situation is exactly what <br/>\nI meant!  I too think it&#39;s important to understand why my son has <br/>\nthe constipation issues in the first place.  I&#39;m floored that the <br/>\ndoctors don&#39;t seem to care that he can&#39;t pass a BM without the aid <br/>\nof a laxative.  I&#39;m sure there must be something more to it than <br/>\njust waiting for him to outgrow the problem which is the only thing <br/>\nI get from the doctors.  Because of Jeffrey&#39;s nature (Aspergers, <br/>\nSensory Integration), finding foods that he finds acceptable is <br/>\nreally challenging.  I was hoping to get suggestions from the list <br/>\non how to make some changes while still respecting his choices.  For <br/>\nexample, I&#39;ve read that apples and bananas are to be avoided as they <br/>\ncause constipation.  Yet I&#39;ve also read that apples and bananas are <br/>\ngood fiber foods and should be eaten to prevent constipation.  It&#39;s <br/>\nthese kinds of inconsistencies that make me want to cry.  My son has <br/>\nsuch a self-limited diet and I respect his rights to choose his <br/>\nfoods.  However, I&#39;m reading that the foods he eats are supposedly <br/>\nknown for their addictive qualities and can cause the types of <br/>\nproblems that my son suffers from.  It&#39;s all so confusing to me.<br/>\n<br/>\nOkay, let&#39;s get to specifics and start with one thing at a time.  <br/>\nBeverages.  My son likes 2% milk both plain or with Nestles <br/>\nchocolate, Tab, Coke and orange juice.  He says water makes him gag <br/>\nif he drinks too much of it.  A typical amount of Coke for him is 4 -<br/>\n 5 cans per day.  I&#39;d also estimate that he drinks 36 - 48 oz. of <br/>\nmilk per day.  How can I help him switch to drinks that might be <br/>\nbetter, such as more orange juice and less soda or milk?  He is <br/>\nextremely upset at the idea of having to give up milk which I <br/>\nsuggested because of the constipation.  So I bought Lactaid Milk, <br/>\nwondering if that would help any since it&#39;s easier to digest than <br/>\nregular milk.  He really likes the taste of it, which is good, but <br/>\nit&#39;s still considered milk so I&#39;m not sure if it makes any <br/>\ndifference in switching to it.  <br/>\n<br/>\nBTW, when I asked our former pediatrician about Jeffrey&#39;s milk <br/>\nconsumption possibly being linked to his constipation, the doctor <br/>\nseemed totally unconcerned.  He said the Miralax would make it <br/>\nbetter and to just serve it in his milk.  Our new pediatrician seems <br/>\na bit more knowledgeable.  We&#39;ve only seen him once but we have <br/>\nanother appt. in July.  I&#39;m going to ask him about this and see if I <br/>\ncan&#39;t get some answers instead of just a band-aid for the situation.<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:   Unschooling and diet/medical issues","postDate":"1151274743","msgId":14915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjI1LjE2MzIyMy4yNjM2LjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14914,"nextInTopic":14916,"prevInTime":14914,"nextInTime":14916,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"***I m looking for suggestions on how to approach this type of situation within a radical unschooling family. *** Within a radical unschooling family the","messageBody":"<div id=\"ygrps-yiv-34309658\">***I&#39;m looking for suggestions on how to approach this type of situation<br/>\nwithin a radical unschooling family. ***<br/>\n<br/>\nWithin a radical unschooling family the approach won&#39;t be taking the<br/>\nchild&#39;s choice away.   <br/>\n<br/>\nBut maybe you can tell him all the reasons you think it would be a good<br/>\nidea to try the diet and maybe he&#39;ll agree with you.  Or maybe you can<br/>\nfind some other thing to try that he can feel good about.<br/>\n<br/>\n***I was hoping someone with experience could help,<br/>\nnot someone who has no clue what we&#39;re living with making comparisons<br/>\nto victims of kidnappers. ***<br/>\n<br/>\nYou&#39;re only in control of what you post, not in what or who posts in<br/>\nreply.  That&#39;s not how it works. <br/>\n<br/>\nI have years of unschooling experience and experience with a child who<br/>\nhas specific medical issues AND whose medical problems have been touted<br/>\nas being helped by various special diets or other treatments.   I have<br/>\nexperience living happily and peacefully with a kid who has total and<br/>\ncomplete control over what he eats.  <br/>\n<br/>\nI have experience with a kid who twisted and pulled his hair, who paced,<br/>\nwho flapped and who has insomnia. <br/>\n<br/>\nAnything else? <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":227139139,"authorName":"elizabeth roberts","from":"elizabeth roberts &lt;joyfullzoo@...&gt;","profile":"joyfullzoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Unschooling and diet/medical issues","postDate":"1151274284","msgId":14914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjI1MjIyNDQ0Ljk4ODk3LnFtYWlsQHdlYjUyMDEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwNGUwMWM2OTg4YSQ5Mzk1ZTFhMCQ2NTAxYThjMEBKb2FubmU+"},"prevInTopic":14913,"nextInTopic":14915,"prevInTime":14913,"nextInTime":14915,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Beth, Here are two other lists that you might not be aware of: Anne Ohman s ShineWithUnschooling@Yahoogroups.com and mine","messageBody":"<div id=\"ygrps-yiv-969762455\">Beth, <br/>\n   <br/>\n  Here are two other lists that you might not be aware of: Anne Ohman&#39;s <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ShineWithUnschooling@...\">ShineWithUnschooling@...</a> and mine <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingSpecialNeeds@...\">UnschoolingSpecialNeeds@...</a> .  <br/>\n   <br/>\n  Beth R.<br/>\n<br/>\n<br/>\nSing, Dance, Laugh...LOVE!<br/>\n \t\t<br/>\n---------------------------------<br/>\nYahoo! Groups gets better. Check out the new email design. Plus theres much more to come.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  Unschooling and diet/medical issues","postDate":"1151274127","msgId":14913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjI1LjE2MjIwOC4yNjM2LjMuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14912,"nextInTopic":14914,"prevInTime":14912,"nextInTime":14914,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"***He doesn t eat much fiber because he doesn t like the things that fiber is found in. *** What kinds of things does he like?   What do you make for him?  In","messageBody":"<div id=\"ygrps-yiv-2097830962\">***He doesn&#39;t eat much fiber because he doesn&#39;t like the things that<br/>\nfiber<br/>\nis found in. ***<br/>\n<br/>\nWhat kinds of things does he like?   What do you make for him?  In a<br/>\ntypical day, what will he eat?   If you give us some info we can help you<br/>\nfind ways of offering higher fiber choices along with what he usually<br/>\nlikes. <br/>\n<br/>\n***The problem is that we do let him make his own choices<br/>\nand he doesn&#39;t eat or drink the things that make his body function<br/>\nnormally. ***<br/>\n<br/>\nFive years ago you put him on medication.  He&#39;s not in the same place he<br/>\nwas in five years ago and you are a different mom now, these five years<br/>\nlater.   You can give him information about what might help him feel<br/>\nbetter.  You can provide a variety of foods.  You can talk about what the<br/>\nmedication did for him and what foods might do that same thing without<br/>\nthe possibility of side effects.   <br/>\n<br/>\nThe problem is not that he has choice.  The problem is constipation.  How<br/>\ndo you address that problem?   Taking away his choice might result in<br/>\nadded stress and stress is one factor in ill health.  <br/>\n<br/>\n***I&#39;m sure that&#39;s very difficult<br/>\nfor you to understand but I&#39;m living with it on a daily basis.***<br/>\n<br/>\nDon&#39;t be too sure.  My son has debilitating psoriatic arthritis.  <br/>\n<br/>\n***As for the hair pulling, look up trichotillomania. That&#39;s a real<br/>\ndisorder. Fortunately, I don&#39;t think my son suffers from it<br/>\nspecifically, but rather as part of his autistic behaviors.***<br/>\n<br/>\nAnd lots and lots of kids twist and pull their hair and don&#39;t have<br/>\ndisorders.   Lot&#39;s and lots of kids would figure out they don&#39;t want to<br/>\npull out their hair and they would modify their behavior themselves if<br/>\nthey weren&#39;t made to feel like everything they did was a compulsion or<br/>\nsymptom of some disorder they have no control over.    <br/>\n<br/>\n***I&#39;m simply looking into<br/>\noptions because for the past 5 years we&#39;ve done nothing except give<br/>\nhim the Miralax. ***<br/>\n<br/>\nDo you really mean that for five years you had a child with chronic<br/>\nconstipation and did *nothing* but give him medicine? <br/>\n<br/>\nHe should have been living in a house were people made good food choices,<br/>\nwhere people talked about what foods made them feel better, what foods<br/>\nhave natural fiber.  What foods contribute to constipation.   He should<br/>\nhave been provided with information all along about his body and health. <br/>\nAll kids should be.  That&#39;s not the same as being made to eat what mom<br/>\nwants you to eat, it means having good information and good foods<br/>\navailable as part of a wide choice of foods.  <br/>\n<br/>\nIf you make pancakes you can add bran.  Same with waffles.  You can make<br/>\nhigher fiber bread.  You an add fiber to muffins, cake, cookies. <br/>\n<br/>\n***But I&#39;m watching his involuntary<br/>\nbehaviors such as hand flapping, hand smelling, pacing, twisting &<br/>\npulling hair, and insomnia gradually become more of a problem for<br/>\nhim. ***<br/>\n<br/>\nSo you believe the diet is a factor here as well?  Not just with the<br/>\nconstipation?  <br/>\n<br/>\nWhat do you do when he flaps?  Have you had the same approach as with the<br/>\nfood?  Have you never said, &quot;Flap at home or in the car but when you&#39;re<br/>\nin the store DONT because you&#39;re bothering people?&quot;     Who is offended<br/>\nby his had smelling, or do you mean he&#39;s smelling other people&#39;s hands?  <br/>\nHave you just said &quot;Stop that.&quot;     If he was poking someone with a stick<br/>\nwould you not say, STOP THAT?  <br/>\n<br/>\nSo, maybe you&#39;ve said stop that and he can&#39;t stop because he can&#39;t help<br/>\nhimself, then don&#39;t take him places where his hand flapping is going to<br/>\nbe a problem and just be honest with him about it.   Go somewhere else<br/>\nwhere people can flap if they want to.  Hell, bring him to my house,<br/>\nwe&#39;re all hand flappers.  Go dancing.    <br/>\n<br/>\nI don&#39;t see a big issue with pacing.  Lots of people pace.  I pace.   But<br/>\nif it&#39;s a body motion thing then maybe set up a swing for him or a<br/>\ntrampoline or a bungee jump so he can fulfill his body&#39;s requirements for<br/>\nmotion in a way that won&#39;t disturb others. <br/>\n<br/>\nInsomnia is a very common thing in young boys especially boys approaching<br/>\npuberty.  I wouldn&#39;t be so fast to call that a symptom of a wider<br/>\nproblem.  Lot&#39;s of people have insomnia without it being a big deal.  <br/>\nInsomnia is pretty prevalent in my family and no one&#39;s life has been<br/>\nruined over it.   <br/>\n<br/>\n***If changing his diet might help those things, why wouldn&#39;t I<br/>\nwant to try it?*** <br/>\n<br/>\nIf you want to then do it.  You don&#39;t have to justify it in an<br/>\nunschooling way.   If you want unschooling answers then be willing to<br/>\ncalm down and consider them.   Unschooling will require you to trust your<br/>\nkid and if you can&#39;t (for whatever reason, health reasons, anything) then<br/>\nyou can&#39;t.  You don&#39;t owe us an explanation.  <br/>\n<br/>\nA lot of what you&#39;re talking about is fear.  Fear of what will happen<br/>\nwhen he goes off the meds.  Fear of what will happen if you don&#39;t impose<br/>\nsome new diet.  So from the start we&#39;re not talking about reality but<br/>\nabout your fear of what might happen if you don&#39;t do this new diet.   But<br/>\ndeath or this new diet are not the only choices and it seems like you&#39;re<br/>\nnot remembering that. <br/>\n<br/>\n***Obviously life as it is now isn&#39;t working out well<br/>\nfor him. So what would you propose I do? Seriously?***<br/>\n<br/>\nI would have proposed a lot of conversation and modeling of food choices<br/>\nthese last five years, but we&#39;re going forward now and not backward.  So<br/>\nI would start now to talk about why he gets constipated and why you feel<br/>\nhe shouldn&#39;t be on that medication anymore and ask HIM what he&#39;d like to<br/>\ndo to address those two concerns.   I&#39;d start now making higher fiber<br/>\nfood choices myself and offering plenty of higher fiber snacks and<br/>\ngoodies and dinner choices and experimenting with his favorite cookie<br/>\nrecipes.  <br/>\n<br/>\nSeriously I&#39;d try six million things before I&#39;d force him to change his<br/>\ndiet.   Ren said if she had a diabetic child she wouldn&#39;t leave the M&M<br/>\nbowl out.   My niece was diagnosed with diabetes when she was eleven and<br/>\nshe&#39;s twenty one now.  She&#39;s completely insulin dependant.  She eats<br/>\nM&M&#39;s and in fact her doctor told her parents NOT to restrict her diet,<br/>\nbut to give her good information and free choice and to encourage her to<br/>\nmanage her insulin to meet her body&#39;s needs no matter what she was<br/>\neating.   People dying from lung cancer sometimes don&#39;t quit smoking. <br/>\nPeople critically ill with heart disease sometimes don&#39;t quit eating<br/>\nbacon.   If these people find a change so hard to make they&#39;re risking<br/>\ndeath what makes you believe you can force a change on your child without<br/>\nit having wider complications, itself?  <br/>\n<br/>\nHave you talked with him?  Start from the idea he wants to be healthy and<br/>\nthen give him good information about what can help him feel good.  <br/>\nHe will make some bad choices I&#39;m sure.  We all do.  He will make better<br/>\nchoices when he knows better.  All along he can get help from you. <br/>\n<br/>\nYou seem to see this as all or nothing.   Either he stays on this<br/>\nmedication or he goes off.   But can he try a different kind?  Can he use<br/>\nan over the counter stool softener?   Can he take a magnesium supplement<br/>\nor chew some vitamin C?  <br/>\n<br/>\nIs he willing to try your diet or would he be willing to drink a smoothie<br/>\nin the morning?    There are a lot of choices but they all start with you<br/>\nproviding him good information and a good example. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":173427227,"authorName":"Vijay Owens","from":"Vijay Owens &lt;vijayowens@...&gt;","profile":"vijay_berry_owens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151270378","msgId":14912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0MDQwNTVmMTlmNTU3YTY3ZmIyOTkyZmQxM2E4OTNjQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDY4NWIyZjIwNjA2MjUxMjQybjZhM2MwYmFjZ2EwZGE1YWJlNDVhMjRmNDdAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDIwMDYwNjI1LjA5NDEwNS4yNjM2LjAuZGR6aW1sZXdAanVuby5jb20+IDxkNzE1MmU5NWRmODRjODkxMjZmMzVjYjNkZjg0MzIwMkBlYXJ0aGxpbmsubmV0PiA8Njg1YjJmMjA2MDYyNTEyNDJuNmEzYzBiYWNnYTBkYTVhYmU0NWEyNGY0N0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":14911,"nextInTopic":14913,"prevInTime":14911,"nextInTime":14913,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Huh? Where in my post did I suggest that the child should be forced to do anything? I was merely commenting that these compulsions are very strong, and the","messageBody":"<div id=\"ygrps-yiv-153134804\">Huh? Where in my post did I suggest that the child should be forced to <br/>\ndo anything? I was merely commenting that these compulsions are very <br/>\nstrong, and the child was probably not pulling their hair out <br/>\naccidentally as a side-effect of twirling it.<br/>\n<br/>\nPlease respond to my actual words in the future, and do not make me out <br/>\nto be the kind of person who would forcibly shave a child&#39;s head. That <br/>\nis very offensive to me.<br/>\n<br/>\n-Vijay<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 25, 2006, at 3:42 PM, Michelle/Melbrigða wrote:<br/>\n<br/>\n&gt; On 6/25/06, Vijay Owens &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vijayowens@...\">vijayowens@...</a>&gt; wrote:<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; Actually, this is not true in many cases. As recently as 2-3 years <br/>\n&gt; ago,<br/>\n&gt;  &gt; DH had to give up his Van Dyke b/c he couldn&#39;t stop pulling the <br/>\n&gt; hairs<br/>\n&gt;  &gt; out and (sorry) eating them. It&#39;s called trichotillomania (sp?) and <br/>\n&gt; is<br/>\n&gt;  &gt; a form of OCD I believe. Even being 30ish years old and knowing that<br/>\n&gt;  &gt; pulling those hairs out made his beard look patchy and sparse <br/>\n&gt; couldn&#39;t<br/>\n&gt;  &gt; stop him. He eventually had to just go clean-shaven and has been so<br/>\n&gt;  &gt; ever since. He also has to keep his head hair short, though that&#39;s <br/>\n&gt; also<br/>\n&gt;  &gt; because it just looks better that way (he has a really big head!).<br/>\n&gt;<br/>\n&gt;  You are talking about an adult and it sounds as though he chose to do<br/>\n&gt;  these things on his own. Did you force him to shave and crop his hair<br/>\n&gt;  or did he do these for himself as he didn&#39;t like have a patchy beard<br/>\n&gt;  and thought he looked better with short hair? The difference is that<br/>\n&gt;  we are talking about a child and that child learning to trust the<br/>\n&gt;  adults/parents in his life. Trust is not going to be gained by a<br/>\n&gt;  parent forcing a child to do things because the adults think that the<br/>\n&gt;  changes are better for them.<br/>\n&gt;<br/>\n&gt;  --<br/>\n&gt;  Michelle<br/>\n&gt;  aka Melbrigða<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":209676473,"authorName":"joanne","from":"&quot;joanne&quot; &lt;oh.kneel@...&gt;","profile":"kc2ark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151269067","msgId":14911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGIwMWM2OTg5YSQwNGUxY2JkMCQ2NTAxYThjMEBKb2FubmU+","referencesHeader":"PGU3bXBkOStoNWU4QGVHcm91cHMuY29tPg=="},"prevInTopic":14910,"nextInTopic":14912,"prevInTime":14910,"nextInTime":14912,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Just some thoughts that came up for me around different word choices.  Diet has many definitions.  I think the one that I was reacting to is the definition :to","messageBody":"<div id=\"ygrps-yiv-1242341978\">Just some thoughts that came up for me around different word choices.  Diet has many definitions.  I think the one that I was reacting to is the definition :to eat or drink in a prescribed regimen.  The Feingold Diet I believe fits into that definition.  It was the discussion of the use of that specific diet in particular that I was suggesting be done off line.  Or perhaps it is because of the many and exhausting conversations I have had with some of the people I have met in an autism support group locally who use that diet (although none are unschoolers). We ended up doing our own reading and experimenting and didn&#39;t feel it did enough to warrant all the struggles.  That was the right decision for our family.<br/>\n<br/>\n  I have been so distanced from my own inner knowledge and guidance that I still like working with medical professionals as part of my medical team.  <br/>\n  When I have gone off some of my medications at different times I needed to do so under the advise of a physician not only because of having been on them so long and at such a high dose but also because on those particular medications it can cause complications to stop taking them too quickly.  I only learned that because I had discontinued medications before on my own that I didn&#39;t realize had to be tapered and it caused me problems.  <br/>\n<br/>\n  In our household there are just too many different and complicated medical conditions for me to research them all well in addition to keep up to date on the new research . I select my doctors (and the ones for my son) carefully and if they are willing to develop a relationship with me, answer any and all of my questions, treat me with respect, be open to exploring new ideas, try new things (including trying to be taken off a previous medication) then I remain with them.  If not, I move on until I can find one who will. <br/>\n<br/>\n  Joanne O&#39;Neill<br/>\n  Lake Carmel, NY<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265202862,"authorName":"Tina Layne","from":"Tina Layne &lt;tinalayne@...&gt;","profile":"tinalayne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151268178","msgId":14910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjI1MjA0MjU4Ljc5MDA2LnFtYWlsQHdlYjM3MjA5Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGU3bXBkOStoNWU4QGVHcm91cHMuY29tPg=="},"prevInTopic":14909,"nextInTopic":14911,"prevInTime":14909,"nextInTime":14911,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Diet isn t always the right word, either, especially in the case of all of us wanting to give freedom to our family instead of dictating rules and","messageBody":"<div id=\"ygrps-yiv-589901123\">&quot;Diet&quot; isn&#39;t always the right word, either, especially in the case of all of us wanting to give freedom to our family instead of dictating rules and restrictions.  &quot;Lifestyle&quot; or &quot;meal plan&quot; might be better words to use than &quot;diet&quot;.  <br/>\n   <br/>\n  For my family, I don&#39;t dictate a specific diet that restricts foods from them.  We follow a meal plan that coincides with an additive-free lifestyle, and we don&#39;t restrict any particular food- just certain brands.  The new lifestyle was also began over a year ago with everyone&#39;s full knowledge and agreement after much discussion. <br/>\n   <br/>\n  For instance, we don&#39;t buy Oreos.  Instead we buy Newman-O&#39;s.  All of us enjoy the flavor as much and in some cases more than the Nabisco brands of the same type of cookies (choc oreos, gingersnaps, and choc mints), so there has been nothing lost or restricted.  I know all of us would have been upset to lose certain food items, but none of us have complained about the brands we have switched to so that we could keep our favorite foods.<br/>\n   <br/>\n  Tina<br/>\n  Hawaii<br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and diet/medical issues","postDate":"1151266620","msgId":14909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bXF2cytrcDk1QGVHcm91cHMuY29tPg=="},"prevInTopic":14908,"nextInTopic":14910,"prevInTime":14908,"nextInTime":14910,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"If changing his diet might help those things, why wouldn t I want to try it? Obviously life as it is now isn t working out well for him. So what would you","messageBody":"<div id=\"ygrps-yiv-158086098\">&quot;If changing his diet might help those things, why wouldn&#39;t I<br/>\nwant to try it? Obviously life as it is now isn&#39;t working out well<br/>\nfor him. So what would you propose I do? Seriously?&quot;<br/>\n<br/>\nI think these are really great questions!<br/>\n<br/>\nObviously, when our children have very real issues and problems, we<br/>\ntry to look at a variety of solutions. Diet may be one of those issues.<br/>\n<br/>\nI think at this point, maybe various list members could come up with<br/>\nyummy, interesting foods that you could prepare and offer up that have<br/>\nmore fiber. I personally love smoothies for this. My kids ADORE them<br/>\nand you can even slip great supplements in that they won&#39;t taste.<br/>\n<br/>\nWe blend frozen fruit (raspberries, blackberries and strawberries are<br/>\nfaves) with 1/2 can frozen OJ concentrate and some milk. They&#39;re thick<br/>\nand really yummy. Some banana adds a great flavor too.<br/>\n<br/>\nSome delicious and healthful foods might address the whole<br/>\nconstipation issue, but I really think that most of his behaviors are<br/>\nsomething you have to accept as part of HIM. The more we can meet our<br/>\nchildren where they&#39;re at, the more peaceful things can be. Instead of<br/>\nseeing his behavior as something that needs changing, maybe you can<br/>\nfocus more on how it&#39;s all part of the package, part of his beauty?<br/>\n<br/>\nI realize that some of it might be really hard. If there are areas<br/>\nfrustrating him, of course you want to find ways to ease his<br/>\nfrustration. Some of it is simply part of his personal development and<br/>\nlearning process.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and diet/medical issues","postDate":"1151265442","msgId":14908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bXByMit0ODZhQGVHcm91cHMuY29tPg=="},"prevInTopic":14906,"nextInTopic":14909,"prevInTime":14907,"nextInTime":14909,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"I m looking for suggestions on how to approach this type of situation within a radical unschooling family. And that s what the list is for. I think you ll","messageBody":"<div id=\"ygrps-yiv-1771420722\">&quot;I&#39;m looking for suggestions on how to approach this type of situation<br/>\nwithin a radical unschooling family.&quot;<br/>\n<br/>\nAnd that&#39;s what the list is for.<br/>\n<br/>\nI think you&#39;ll hear some frustration from old-timers when a bunch of<br/>\nposts come through to try this or that restrictive diet, rather than<br/>\nworking within his very real medical issues and try to find<br/>\nNON-restrictive ways to help you all.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and diet/medical issues","postDate":"1151265001","msgId":14906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bXBkOStoNWU4QGVHcm91cHMuY29tPg=="},"prevInTopic":14905,"nextInTopic":14908,"prevInTime":14905,"nextInTime":14907,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Do you think that families with special needs children cannot unschool radically because if they have to make any decisions for the child at all, then they","messageBody":"<div id=\"ygrps-yiv-1329317652\">&quot;Do you think that families with special needs children cannot<br/>\nunschool radically because if they have to make any decisions for<br/>\nthe child at all, then they might as well try not to unschool at<br/>\nall?&quot;<br/>\n<br/>\n<br/>\nNot at all!<br/>\nUnschooling isn&#39;t just about freedom, as we discussed before. Freedom<br/>\nwithout awareness is just plain crazy. Awareness dictates that we are<br/>\nin tune with our children and obviously concerned for safety and health. <br/>\n<br/>\nIf my child had diabetes, I wouldn&#39;t just leave the M&M jar sitting<br/>\nout like I do now. I&#39;d be damn sure I had foods they liked that they<br/>\ncould safely eat though. It&#39;s about respecting the desires of the<br/>\nindividual within the very REAL limitations that life can throw at us<br/>\nsometimes.<br/>\n<br/>\nI think diet discussions are very relevant to this list.  Finding ways<br/>\nto address health concerns while still respecting the autonomy of the<br/>\nindividual are on par with unschooling.<br/>\n<br/>\nI am NOT a fan of diets, nor do I think an entire family needs to be<br/>\non one just because an individual has real health issues. At the same<br/>\ntime, I wouldn&#39;t want to eat foods that would be problematic for one<br/>\nchild right in front of them. There are creative ways to meet the<br/>\nneeds of all members. <br/>\n<br/>\nPersonally, I trust my own inner knowledge and guidance more than any<br/>\ndoctor. I use doctors as consultants and do my OWN research to make<br/>\ndecisions. I would certainly trust my own research on the medication<br/>\nover what ANY damn doctor told me and do whatever it took to get my<br/>\nchild off of it, while finding alternative ways to keep them healthy.<br/>\n<br/>\nConstipation is no joke, but at what point do you decide that he can&#39;t<br/>\nbe medicated for his entire life and try to find better solutions?  I<br/>\nwould want to understand the health issue, not just medicate it and<br/>\nignore it.  There are a number of ways to help children get healthy<br/>\nfood, without being controlling. Monkey platters disappear quite<br/>\nreadily around here and my children happily eat a variety of foods.<br/>\nWe can discuss many solutions to the desire for healthier eating,<br/>\nwithout reverting to mainstream methods that lack respect for the child.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151264531","msgId":14905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MjUxMjQybjZhM2MwYmFjZ2EwZGE1YWJlNDVhMjRmNDdAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGQ3MTUyZTk1ZGY4NGM4OTEyNmYzNWNiM2RmODQzMjAyQGVhcnRobGluay5uZXQ+","referencesHeader":"PDIwMDYwNjI1LjA5NDEwNS4yNjM2LjAuZGR6aW1sZXdAanVuby5jb20+CSA8ZDcxNTJlOTVkZjg0Yzg5MTI2ZjM1Y2IzZGY4NDMyMDJAZWFydGhsaW5rLm5ldD4="},"prevInTopic":14903,"nextInTopic":14906,"prevInTime":14904,"nextInTime":14906,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"... You are talking about an adult and it sounds as though he chose to do these things on his own.  Did you force him to shave and crop his hair or did he do","messageBody":"<div id=\"ygrps-yiv-1895158473\">On 6/25/06, Vijay Owens &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vijayowens@...\">vijayowens@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Actually, this is not true in many cases. As recently as 2-3 years ago,<br/>\n&gt; DH had to give up his Van Dyke b/c he couldn&#39;t stop pulling the hairs<br/>\n&gt; out and (sorry) eating them. It&#39;s called trichotillomania (sp?) and is<br/>\n&gt; a form of OCD I believe. Even being 30ish years old and knowing that<br/>\n&gt; pulling those hairs out made his beard look patchy and sparse couldn&#39;t<br/>\n&gt; stop him. He eventually had to just go clean-shaven and has been so<br/>\n&gt; ever since. He also has to keep his head hair short, though that&#39;s also<br/>\n&gt; because it just looks better that way (he has a really big head!).<br/>\n<br/>\n </span></blockquote>You are talking about an adult and it sounds as though he chose to do<br/>\nthese things on his own.  Did you force him to shave and crop his hair<br/>\nor did he do these for himself as he didn&#39;t like have a patchy beard<br/>\nand thought he looked better with short hair?  The difference is that<br/>\nwe are talking about a child and that child learning to trust the<br/>\nadults/parents in his life.  Trust is not going to be gained by a<br/>\nparent forcing a child to do things because the adults think that the<br/>\nchanges are better for them.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":209676473,"authorName":"joanne","from":"&quot;joanne&quot; &lt;oh.kneel@...&gt;","profile":"kc2ark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Unschooling and diet/medical issues","postDate":"1151262436","msgId":14903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWM2OTg4YSQ5Mzk1ZTFhMCQ2NTAxYThjMEBKb2FubmU+","referencesHeader":"PGU3bWhsNytzNGdvQGVHcm91cHMuY29tPg=="},"prevInTopic":14901,"nextInTopic":14905,"prevInTime":14902,"nextInTime":14904,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Not at all.  I think any and all topics should be posted. Radical unschooling encompasses all aspects of life.  My comment was that when the discussion moves","messageBody":"<div id=\"ygrps-yiv-101212868\">Not at all.  I think any and all topics should be posted. Radical unschooling encompasses all aspects of life.  My comment was that when the discussion moves from unschooling issues to diet restrictions in particular I feel that we have left the unschooling arena and when that occurs then it would probably be best continued that particular topic off-line privately e-mailing. <br/>\n<br/>\nI also have a special needs son (diagnosed PDD-NOS on the autism spectrum with ADHD).  You might also find help and support on the SHINE list.  I am growing as our family learns more and more about unschooling through trial and error, reading  and also posting and reviewing discussions on groups like these.<br/>\n<br/>\nWe are at a place in our journey now in our family where we do a lot of talking.  We consider each member of the family a member of the team.  We are trying to deschool and also detox ourselves from past messages power and control.  It is a wonderful and exciting journey with moments of joy and moments of frustration.<br/>\n<br/>\nI think exploring unschooling will help you and your family find what works best for you and your family.  The only thing I would caution you about is that we tried to make too many changes at the same time in the beginning of our exploration.  This resulted in us feeling overwhelmed and questioning the whole unschooling paradigm instead of the way in which we were trying to make the transition :)<br/>\n<br/>\nI am not a medical doctor and would not presume to advise you regarding impacted stool.  If you are unsure about what your current doctor is telling you, how about seeking a second professional opinion?  There are holistic doctors as well.  You may need to travel further to see one and your insurance may not pay for them but it is worth looking into if you want a more holistic perspective.  <br/>\n<br/>\nPersonally, I would not take my child off his medication if it was against his doctor&#39;s advice unless I had another doctor that I was going to replace my previous doctor with.   But that in it of itself is a debate that should be pursued privately off line.  You may do so with me if you would like to do so.<br/>\n<br/>\nJoanne O&#39;Neill<br/>\nds: age 5, almost 6<br/>\nLake Carmel, NY <br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n  From: freepsgal <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Sunday, June 25, 2006 1:37 PM<br/>\n  Subject: [unschoolingbasics] Re: Unschooling and diet/medical issues<br/>\n<br/>\n<br/>\n  &gt; Perhaps those still interested in discussing diets could do so off <br/>\n  &gt; line so we could focus back to unschooling basics. <br/>\n  &gt; <br/>\n  &gt; Respectfully,<br/>\n  &gt; Joanne O&#39;Neill<br/>\n<br/>\n  Okay, but please realize that I posted my situation because I need <br/>\n  to know how to deal with it from an unschooling lifestyle. No, it&#39;s <br/>\n  not about academics. It&#39;s about health, life and family. Are you <br/>\n  suggesting those things are not included in the basics of <br/>\n  unschooling?<br/>\n<br/>\n  Do you think that families with special needs children cannot <br/>\n  unschool radically because if they have to make any decisions for <br/>\n  the child at all, then they might as well try not to unschool at <br/>\n  all? I guess what I&#39;m really worried about is taking my son off the <br/>\n  medication, against doctors advice and letting my son continue to <br/>\n  make the choices that are making him geniunely sick. If he gets <br/>\n  really sick or even dies, can I go to jail for it? Won&#39;t the court <br/>\n  system say it&#39;s my responsibility to make sure he does the things <br/>\n  that keep him healthy? And no, I&#39;m not overreacting. We actually <br/>\n  know someone who died from impacted stool rupturing his bowels, but <br/>\n  he was an adult so no one was blamed except him. <br/>\n<br/>\n  Beth M.<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151257063","msgId":14901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bWhsNytzNGdvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU3bWNibitnM2lxQGVHcm91cHMuY29tPg=="},"prevInTopic":14900,"nextInTopic":14903,"prevInTime":14900,"nextInTime":14902,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"... Okay, but please realize that I posted my situation because I need to know how to deal with it from an unschooling lifestyle.  No, it s not about","messageBody":"<div id=\"ygrps-yiv-392975631\"><blockquote><span title=\"ireply\">&gt; Perhaps those still interested in discussing diets could do so off <br/>\n&gt; line so we could focus back to unschooling basics. <br/>\n&gt; <br/>\n&gt; Respectfully,<br/>\n&gt; Joanne O&#39;Neill<br/>\n<br/>\n </span></blockquote>Okay, but please realize that I posted my situation because I need <br/>\nto know how to deal with it from an unschooling lifestyle.  No, it&#39;s <br/>\nnot about academics.  It&#39;s about health, life and family.  Are you <br/>\nsuggesting those things are not included in the basics of <br/>\nunschooling?<br/>\n<br/>\nDo you think that families with special needs children cannot <br/>\nunschool radically because if they have to make any decisions for <br/>\nthe child at all, then they might as well try not to unschool at <br/>\nall?  I guess what I&#39;m really worried about is taking my son off the <br/>\nmedication, against doctors advice and letting my son continue to <br/>\nmake the choices that are making him geniunely sick.  If he gets <br/>\nreally sick or even dies, can I go to jail for it?  Won&#39;t the court <br/>\nsystem say it&#39;s my responsibility to make sure he does the things <br/>\nthat keep him healthy?  And no, I&#39;m not overreacting.  We actually <br/>\nknow someone who died from impacted stool rupturing his bowels, but <br/>\nhe was an adult so no one was blamed except him.  <br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151255843","msgId":14900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bWdmMytpZTBmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNjI1LjA5NTYxMy4yNjM2LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14899,"nextInTopic":14901,"prevInTime":14899,"nextInTime":14901,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"... *LOL*  Geez Deb.  It s a good thing I ve learned to not take these kinds of responses personally.  No, I m not looking for permission. I m looking for","messageBody":"<div id=\"ygrps-yiv-469878690\"><blockquote><span title=\"ireply\">&gt; Are you looking for permission?  <br/>\n<br/>\n </span></blockquote>*LOL*  Geez Deb.  It&#39;s a good thing I&#39;ve learned to not take these <br/>\nkinds of responses personally.  No, I&#39;m not looking for permission.  <br/>\nI&#39;m looking for suggestions on how to approach this type of situation <br/>\nwithin a radical unschooling family.  I figured asking this list would <br/>\nmake the most sense.  I was hoping someone with experience could help, <br/>\nnot someone who has no clue what we&#39;re living with making comparisons <br/>\nto victims of kidnappers.  Mercy me!  *laugh*<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151255579","msgId":14899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bWc2cit2ZW9kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNjI1LjA5NDEwNS4yNjM2LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14898,"nextInTopic":14900,"prevInTime":14898,"nextInTime":14900,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Oh Deb, if it were that easy, I would have done it long ago.  He doesn t eat much fiber because he doesn t like the things that fiber is found in.  The problem","messageBody":"<div id=\"ygrps-yiv-130951479\">Oh Deb, if it were that easy, I would have done it long ago.  He <br/>\ndoesn&#39;t eat much fiber because he doesn&#39;t like the things that fiber <br/>\nis found in.  The problem is that we do let him make his own choices <br/>\nand he doesn&#39;t eat or drink the things that make his body function <br/>\nnormally.  I didn&#39;t mean for this thread to turn into a <br/>\ndiet/behavior discussion, but how to address such needs in an <br/>\nunschooling atmosphere.  Jeffrey knows all too well what it feels <br/>\nlike to be impacted.  It&#39;s painful, and there is a possibility of <br/>\ntoxins leaking out and poisoning the body.  Some people have gotten <br/>\nvery sick from this and some have even died of an impaction causing <br/>\nbowels to rupture.  <br/>\n<br/>\nI want to everything to be laid back, non-stressful, happy and <br/>\naverage.  Believe me.  But the question is what do we do when a body <br/>\njust doesn&#39;t act natural by itself?  I&#39;m sure that&#39;s very difficult <br/>\nfor you to understand but I&#39;m living with it on a daily basis.  <br/>\n<br/>\nAs for the hair pulling, look up trichotillomania.  That&#39;s a real <br/>\ndisorder.  Fortunately, I don&#39;t think my son suffers from it <br/>\nspecifically, but rather as part of his autistic behaviors.<br/>\n<br/>\nI&#39;m all for letting people live natually the way they are meant to <br/>\nbe, but not looking into medical solutions when the situation <br/>\nwarrants it is negligent, don&#39;t you think?  I&#39;m simply looking into <br/>\noptions because for the past 5 years we&#39;ve done nothing except give <br/>\nhim the Miralax.  We have followed his lead on foods, never forcing <br/>\nhim to eat things he doesn&#39;t want to eat.  I specifically find the <br/>\nfoods he wants, like if we want to eat out and everyone wants Wendys <br/>\nbut he wants McDonald&#39;s fries only because he hates everything <br/>\nelse.  I totally understand and never make him feel bad for him <br/>\nchoosing other foods than we eat.  But I&#39;m watching his involuntary <br/>\nbehaviors such as hand flapping, hand smelling, pacing, twisting & <br/>\npulling hair, and insomnia gradually become more of a problem for <br/>\nhim.  If changing his diet might help those things, why wouldn&#39;t I <br/>\nwant to try it?  Obviously life as it is now isn&#39;t working out well <br/>\nfor him.  So what would you propose I do?  Seriously?<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":173427227,"authorName":"Vijay Owens","from":"Vijay Owens &lt;vijayowens@...&gt;","profile":"vijay_berry_owens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151254935","msgId":14898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ3MTUyZTk1ZGY4NGM4OTEyNmYzNWNiM2RmODQzMjAyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDIwMDYwNjI1LjA5NDEwNS4yNjM2LjAuZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDYwNjI1LjA5NDEwNS4yNjM2LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14897,"nextInTopic":14899,"prevInTime":14897,"nextInTime":14899,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Actually, this is not true in many cases. As recently as 2-3 years ago, DH had to give up his Van Dyke b/c he couldn t stop pulling the hairs out and (sorry)","messageBody":"<div id=\"ygrps-yiv-458311267\">Actually, this is not true in many cases. As recently as 2-3 years ago, <br/>\nDH had to give up his Van Dyke b/c he couldn&#39;t stop pulling the hairs <br/>\nout and (sorry) eating them. It&#39;s called trichotillomania (sp?) and is <br/>\na form of OCD I believe. Even being 30ish years old and knowing that <br/>\npulling those hairs out made his beard look patchy and sparse couldn&#39;t <br/>\nstop him. He eventually had to just go clean-shaven and has been so <br/>\never since. He also has to keep his head hair short, though that&#39;s also <br/>\nbecause it just looks better that way (he has a really big head!).<br/>\n<br/>\nThis may not be the phenomenon that you are dealing with, but if he&#39;s <br/>\npulling hard enough to pull the hair out by the root it may be a strong <br/>\ncompulsion that he has trouble fighting. It might not be as simple as <br/>\nwanting to twirl and accidentally pulling it out and being able to stop <br/>\ndoing it at will.<br/>\n<br/>\n-Vijay<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 25, 2006, at 11:41 AM, Deb Lewis wrote:<br/>\n<br/>\n&gt; ***We are concerned with a recent behavior of hair pulling and twisting<br/>\n&gt;  that has resulted in hair loss. ***<br/>\n&gt;<br/>\n&gt;  Maybe since he knows now that he can pull his hair right out, he&#39;ll<br/>\n&gt;  modify his twisting in time, to reduce the chances of hair loss.<br/>\n&gt;  There&#39;s nothing wrong with hair twisting. He probably isn&#39;t interested<br/>\n&gt;  in really pulling his hair out. I&#39;d remain calm and see how he handles<br/>\n&gt;  it.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":209676473,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;oh.kneel@...&gt;","profile":"kc2ark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151251639","msgId":14897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bWNibitnM2lxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNjI1LjA5NDEwNS4yNjM2LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14896,"nextInTopic":14898,"prevInTime":14896,"nextInTime":14898,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"That s my caution.  I d start with a calm mind, a peaceful house,  a helpful, willing attitude, suggestions if he s having problems and a lot of time and","messageBody":"<div id=\"ygrps-yiv-1713732370\">&quot;That&#39;s my caution.  I&#39;d start with a calm mind, a peaceful house,  a<br/>\nhelpful, willing attitude, suggestions if he&#39;s having problems and a <br/>\nlot of time and freedom and help (not force) for him to come to his <br/>\nown terms with whatever his personal issues are.&quot;<br/>\n<br/>\nOur experince has rung true for what Deb is suggesting.  Our son has <br/>\na traditional diagnosis given by various traditional sources and <br/>\nvarious diets were suggested.  Trying to implement them brought too <br/>\nmuch stress and conflict into our family.  We, too, have found that <br/>\nfreedom and time and support are by far the greatest gifts that has <br/>\nbenefitted our son. <br/>\n<br/>\nPerhaps those still interested in discussing diets could do so off <br/>\nline so we could focus back to unschooling basics. <br/>\n<br/>\nRespectfully,<br/>\nJoanne O&#39;Neill</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151250973","msgId":14896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjI1LjA5NTYxMy4yNjM2LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14895,"nextInTopic":14897,"prevInTime":14895,"nextInTime":14897,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"***He is a very particular eater, because of these issues, and the diet would mean a drastic change to his familiar diet.  But from what I read, the kids who","messageBody":"<div id=\"ygrps-yiv-1657117244\">***He is a very particular eater, because of these issues, <br/>\nand the diet would mean a drastic change to his familiar diet.  But <br/>\nfrom what I read, the kids who make it to the other end are truly <br/>\nhappy with the changes even if they were resistant to the diet in <br/>\nthe first place.  ***<br/>\n<br/>\nAre you looking for permission?  <br/>\n<br/>\nYou can do what you want.  Lots and lots of people would say you&#39;d be<br/>\ndoing the right thing to force your son to accept the diet you think he<br/>\nshould be eating.   <br/>\n<br/>\nPeople released from kidnappers are sympathetic to the kidnappers cause<br/>\neven though they didn&#39;t want to be kidnapped.<br/>\nPeople who graduate from school believe school was necessary even though<br/>\nthey were miserable there.<br/>\n<br/>\nYou can eventually convince a kid that his suffering or misery is good<br/>\nfor him.    <br/>\n<br/>\nIf you change his diet and he doesn&#39;t want to and if you fight with him<br/>\nabout it sometimes or get frustrated with him about it sometimes and in<br/>\nthe end the diet doesn&#39;t help enough to warrant the fight or frustration<br/>\nyou run the risk of having altered your relationship and lost some of<br/>\nyour credibility.   That&#39;s the danger of taking his choice away.    That<br/>\nwouldn&#39;t be good for him or for you.   <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling and diet/medical issues","postDate":"1151250064","msgId":14895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjI1LjA5NDEwNS4yNjM2LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14893,"nextInTopic":14896,"prevInTime":14894,"nextInTime":14896,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"***We are concerned with a recent behavior of hair pulling and twisting that has resulted in hair loss. *** Maybe since he knows now that he can pull his hair","messageBody":"<div id=\"ygrps-yiv-706236599\">***We are concerned with a recent behavior of hair pulling and twisting <br/>\nthat has resulted in hair loss. ***<br/>\n<br/>\nMaybe since he knows now that he can pull his hair right out, he&#39;ll<br/>\nmodify his twisting in time, to reduce the chances of hair loss.  <br/>\nThere&#39;s nothing wrong with hair twisting.  He probably isn&#39;t interested<br/>\nin really pulling his hair out.  I&#39;d remain calm and see how he handles<br/>\nit.  <br/>\n<br/>\n***I found some interesting information regarding diet. ***<br/>\n<br/>\nI&#39;m personally irked by these threads about diet and behavior or diet as<br/>\na cure for a wispy diagnosis.   I know some people shouldn&#39;t eat certain<br/>\nthings but the majority of unschoolers are not people with special<br/>\ndietary needs.   I&#39;m skeptical.   Omnivorous humans have been eating<br/>\nfluctuating diets for thousands and thousands and thousands of years.  <br/>\nNow I hope there won&#39;t be a flood of mail about how this or that kid or<br/>\nsomeone would DIE if they ate this or that something.  The deal is, most<br/>\npeople can eat without fear of death and I get grumpy when the list turns<br/>\ninto a fear of foods list instead of an unschooling list.  <br/>\n<br/>\nIf your son has been on a laxative for five years, how do you know that<br/>\nwith time, off the meds and in a calm and stress free house, his body<br/>\nwouldn&#39;t find it&#39;s right balance?    What, in your mind, makes the<br/>\nlargely anecdotal promise of better health from a gluten free, casein<br/>\nfree diet more valid that the evidence unschoolers have been giving for<br/>\nyears and years about peaceful home life and calm mothers, freedom to<br/>\nchoose and varied diet?  <br/>\n<br/>\n***I&#39;d like to see him off this medication but he&#39;s going to have to<br/>\nchange <br/>\nhis diet. ***<br/>\n<br/>\nWhy is he &quot;going to have to&quot; change his diet?   How do you even know how<br/>\nhis body is going to react off the meds?  How do you even know if this<br/>\nnew diet will help him?     <br/>\n<br/>\nIf you&#39;re concerned about constipation maybe adding more fiber to the<br/>\nthings he already likes to eat will be enough.   Maybe adding a vitamin<br/>\nsupplement with magnesium will be enough.   Maybe more orange juice would<br/>\nbe enough.  Maybe going for a walk with him every morning would be<br/>\nenough.   None of those things would be things he&#39;d &quot;have to&quot; do, just<br/>\nideas if, after time off the meds, he&#39;d like to try ways to get more<br/>\ncomfortable. <br/>\n<br/>\nHow much pressure are you willing to put on him or how much force are you<br/>\nwilling to subject him to, on the vague promise things will improve?  <br/>\nThat&#39;s my caution.  I&#39;d start with a calm mind, a peaceful house,  a<br/>\nhelpful, willing attitude, suggestions if he&#39;s having problems and a lot<br/>\nof time and freedom and help (not force) for him to come to his own terms<br/>\nwith whatever his personal issues are.   <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151245610","msgId":14893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bTZmYSt2cGFhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU3bDNoNCtlaTJxQGVHcm91cHMuY29tPg=="},"prevInTopic":14889,"nextInTopic":14895,"prevInTime":14892,"nextInTime":14894,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Pat, thank you for the very detailed post.  My son and I have been talking and he s warming up to the ideas.  It s just taking patient discussion to help him","messageBody":"<div id=\"ygrps-yiv-2129902362\">Pat, thank you for the very detailed post.  My son and I have been <br/>\ntalking and he&#39;s warming up to the ideas.  It&#39;s just taking patient <br/>\ndiscussion to help him see the &#39;middle&#39; areas he often overlooks.  <br/>\nHe&#39;s an all-or-nothing type personality so his initial thoughts are <br/>\neither that he gets to eat what he wants or he can&#39;t have any of the <br/>\nfoods he likes.  We&#39;re going to work on finding acceptable <br/>\nalternatives before we make any drastic changes.  I&#39;ll take a look at <br/>\nthe Feingold diet too.  thanks!!  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151209828","msgId":14889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3bDNoNCtlaTJxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU3azl0cytyMWg2QGVHcm91cHMuY29tPg=="},"prevInTopic":14884,"nextInTopic":14893,"prevInTime":14888,"nextInTime":14890,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Beth, I don t usually post here; but we radically unschool and have dietary issues which we handle with full consent of our son, who is 5. It is much harder to","messageBody":"<div id=\"ygrps-yiv-293471518\">Beth, I don&#39;t usually post here; but we radically unschool and have <br/>\ndietary issues which we handle with full consent of our son, who is <br/>\n5. It is much harder to implement than to have always done it this <br/>\nway, I imagine. And it is difficult to have a diet free of foods <br/>\nwhich create behavioral concerns for the whole family. I would say <br/>\nthat our son was about age 3 when he could identify which foods had <br/>\nartificial colors, dairy and protein and chose with awareness (not <br/>\nrequiring agreement or approval on my part though). His choices have <br/>\nbeen his to make. <br/>\n<br/>\nHowever, we do discuss our observations and our concerns regarding <br/>\nhis behavior which directly effects us; and we discuss <br/>\ncorrelations/patterns associated with specific food ingredients. It <br/>\nis easier to see correlations since our diet is generally free of <br/>\ndairy, soy, wheat, high fructose corn syrup, artificial colors, <br/>\nflavors and preservatives and high salicylate foods.....usually. <br/>\n<br/>\nWe basically follow the Feingold Diet and see dramatic correllations <br/>\nbetween the food ingredients and his sleep, physical aggression, <br/>\nvocalizations, ability to negotiate and consider other&#39;s personal <br/>\nboundaries and needs, and hyperactive/restlessness. The most <br/>\nimportant aspect is providing preferred substitutions, NOT <br/>\neliminating choice. This has taken years of reading labels of <br/>\ningredients on everything that comes into our home to find hundreds <br/>\nof foods that are free of additives and taste wonderful to our <br/>\nindividual tastes. Outside of our home, we bring our favorites, we <br/>\nconsume the culprit foods, we find substitutes and we delay <br/>\nconsumption, depending upon individual preferences. <br/>\n<br/>\nI have heard incredible benefits about the enzymes also. And we are <br/>\nconsidering that alternative ourselves. We also have added <br/>\nmagnesium, cod liver oil, and coconut oil as important dietary <br/>\nsupplements, which are often associated with sensory integration <br/>\nbehaviors. Again, these are utilized with ds&#39;s preferences (flavors-<br/>\nnatural, consumption, refusal, etc). And we use additive free <br/>\nmultivitamin supplements for good measure. <br/>\n<br/>\nThe intervention that has helped our son&#39;s dietary tolerance the <br/>\nmost has been classical homeopathy. As an infant, there were many <br/>\nMORE foods that we avoided due to gastric issues associated with <br/>\nthem. There are also some &quot;food allergy homeopathics&quot; which are used <br/>\nat the time of consuming a culprit food. For instance there is one <br/>\nfor wheat, dairy, corn, etc. These are taken when you anticipate, or <br/>\nate, the food that causes symptoms. This is acute homeopathy, which <br/>\nis different than classical homeopathy. But, dh and ds have had <br/>\nsignificant improvement of many different allergy issues with <br/>\nclassical homeopathy.<br/>\n<br/>\nClassical homeopathy would address the hair pulling, twisting, <br/>\nconstipation, carb craving, etc. I highly recommend considering this <br/>\nalternative in conjunction with making gradual dietary changes and <br/>\nfacilitating awareness about food and behavior, with your son&#39;s <br/>\nagreement, of course. I suspect that the sensory seeking and <br/>\nrepetitive behaviors are associated with dairy. Our son&#39;s sensory <br/>\nseeking behaviors certainly are directly associated with dairy <br/>\nconsumption frequency and quantity. He becomes physically aggressive <br/>\nabout one hour after consumption and it lasts for 1-6 hours, <br/>\ndepending upon amount consumed. <br/>\n<br/>\nFrom what I understand, it takes about 3-10 days to see significant <br/>\nbehavioral changes after eliminating dairy. And then it is easier to <br/>\nsee the effects/benefits. Some people see changes in only one or two <br/>\ndays of a dairy free diet. However, dairy (including casein and <br/>\nwhey) is hard to eliminate. Wheat is harder to eliminate; and corn <br/>\nsyrup is the hardest to eliminate, ime. But, they are not hard to <br/>\navoid once we are aware. And our son&#39;s willingness to avoid <br/>\ningredients is directly related to how much he has recently <br/>\nconsumed. Not from a taste pov, but from an cognitive awareness of <br/>\ncause/effect pov. <br/>\n<br/>\nA friend&#39;s 13-year old felt so much better on the Feingold Diet that <br/>\nhe chooses to continue it after willingly trying it for one week. <br/>\nYou might discuss that type of trial run with your son. But, you&#39;d <br/>\nneed to find the substitute foods first and not expose him to <br/>\ntemptation by eating stuff in front of him for the duration. Our <br/>\nwhole family chooses a similar diet for convienence and support. <br/>\n<br/>\nSo, I&#39;d tell your dh, as soon as *he* joins in, ds would probably be <br/>\nmore willing to give it a go. We use EarthFare for most packaged, <br/>\nprocessed and fresh foods free of additives. They have nitrate and <br/>\nnitrite free bacon for instance. I believe that Whole Foods has a <br/>\nsimilar selection. Check out www.Feingold.org for more information. <br/>\nI believe it is well worth the effort.<br/>\n<br/>\nPat</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and diet/medical issues","postDate":"1151183612","msgId":14884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3azl0cytyMWg2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU3amtpMCtxYTBjQGVHcm91cHMuY29tPg=="},"prevInTopic":14881,"nextInTopic":14889,"prevInTime":14883,"nextInTime":14885,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"I appreciate all the responses so far.  Here is some more information. The medication I mentioned is Miralax.  He s been on it for almost 5 years.  It s an","messageBody":"<div id=\"ygrps-yiv-197531788\">I appreciate all the responses so far.  Here is some more <br/>\ninformation.<br/>\n<br/>\nThe medication I mentioned is Miralax.  He&#39;s been on it for almost 5 <br/>\nyears.  It&#39;s an osmotic laxative that has a suggestion to use it for <br/>\n2 weeks unless prescribed longer by a doctor.  5 years??  And I just <br/>\nfound out on the main website for the medication that it isn&#39;t even <br/>\napproved to be used in children.  The doctors at Kaiser don&#39;t seem <br/>\nconcerned in the least about figuring out WHY my son suffers from <br/>\nchronic constipation.  They tell me he&#39;ll outgrow this problem <br/>\neventually.  Every time I&#39;ve lowered the daily doseage to attempt to <br/>\nget him off of it, he gets a stool impaction and requires an enema.  <br/>\nTo say this has been a long unpleasant ordeal is quite an <br/>\nunderstatement.<br/>\n<br/>\nMy son&#39;s diet is mostly carbs and dairy.  I&#39;m fairly positive his <br/>\nbowel issues are because of his diet but he doesn&#39;t care because as <br/>\nlong as he&#39;s on the Miralax, he feels like it&#39;s okay to eat whatever <br/>\nhe wants.  I have talked to him about this but he&#39;d rather eat what <br/>\nhe wants and take the Miralax than change his diet.  My DH thinks we <br/>\nneed to implement changes.  I&#39;m caught in the middle, not sure <br/>\nwhat&#39;s best.  I do not know if diet changes would make this problem <br/>\nbetter.  I&#39;m only making a guess.<br/>\n<br/>\nAs for the hair pulling, we have suggested a shorter hair cut but <br/>\nJeffrey is definitely against that solution.  He likes the feel of <br/>\nhis hair long, on his neck and over his ears.  <br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":265202862,"authorName":"Tina Layne","from":"Tina Layne &lt;tinalayne@...&gt;","profile":"tinalayne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151168285","msgId":14881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjI0MTY1ODA1LjI2MzU4LnFtYWlsQHdlYjM3MjAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDU0Zi4xYmVmZTIuMzFjZWMzNmNAYW9sLmNvbT4="},"prevInTopic":14880,"nextInTopic":14884,"prevInTime":14880,"nextInTime":14882,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Speaking of synthetics and artificial colors and flavors, our family follows the Feingold Diet (www.feingold.org) which eliminates all of those things. My","messageBody":"<div id=\"ygrps-yiv-723091866\">Speaking of synthetics and artificial colors and flavors, our family follows the Feingold Diet (www.feingold.org) which eliminates all of those things. My oldest dd and my ds are the targest, but we&#39;ve all seen improvements.  Most members have children with AS, ADD/ADHD, autism, and other differences.  We all have seen great improvements on the program. <br/>\n   <br/>\n  Take a few minutes to look into it.  It&#39;s well worth the time investigating, and the membership fees.<br/>\n   <br/>\n  Tina<br/>\nHawaii<br/>\n<br/>\nLeslie530@... wrote:<br/>\n          <br/>\nIn a message dated 6/24/2006 11:10:29 A.M. Eastern Daylight Time, <br/>\nfreepsgal@... writes:<br/>\n<br/>\nI found some interesting information regarding diet. <br/>\nI&#39;ve found some recommendations for a Gluten Free Casein Free diet <br/>\n<br/>\nBeth, I am going to suggest the food enzymes created to replace the GFCF <br/>\ndiet before you try the diet. My kids have been on them since Nov. and I have <br/>\nseen remarkable progress. You can get info at _www.enzymestuff.com_ <br/>\n(http://www.enzymestuff.com) and some at _www.houstonni.com_ <br/>\n(http://www.houstonni.com) . I would be happy to answer any questions off-list.<br/>\n<br/>\nThe GFCF diet is hard and expensive and often takes months before you notice <br/>\nif it is working or not. I highly recommending trying the enzyme approach <br/>\nfirst.<br/>\n<br/>\nBut, I will say that diet is a big issue in my home. We have gone off <br/>\nartificial colors and we are working towards removing most other artificials. <br/>\nUnfortunately, some kids just don&#39;t tolerate this stuff well. It is hard <br/>\nbalancing out food freedom and problem foods, but with my kids, it makes such a <br/>\nhuge difference in our entire family and unschooling life! Sometimes I handle <br/>\nit better than others and I just keep trying to do my best. <br/>\n<br/>\nI keep lots of good alternatives around, do a lot of talking, and try to <br/>\nkeep safe food free and easily accessed.<br/>\n<br/>\nLeslie in SC<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\nhttp://mail.yahoo.com <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151166828","msgId":14880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0Zi4xYmVmZTIuMzFjZWMzNmNAYW9sLmNvbT4="},"prevInTopic":14879,"nextInTopic":14881,"prevInTime":14879,"nextInTime":14881,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/24/2006 11:10:29 A.M. Eastern Daylight Time, freepsgal@yahoo.com writes: I  found some interesting information regarding diet. I ve found","messageBody":"<div id=\"ygrps-yiv-1018634631\">In a message dated 6/24/2006 11:10:29 A.M. Eastern Daylight Time,  <br/>\nfreepsgal@... writes:<br/>\n<br/>\nI  found some interesting information regarding diet. <br/>\nI&#39;ve found some  recommendations for a Gluten Free Casein Free diet  <br/>\n<br/>\n<br/>\n<br/>\nBeth, I am going to suggest the food enzymes created to  replace the GFCF <br/>\ndiet before you try the diet.  My kids have been on  them since Nov. and I have <br/>\nseen remarkable progress.  You can get info at  _www.enzymestuff.com_ <br/>\n(http://www.enzymestuff.com)  and some at _www.houstonni.com_ <br/>\n(http://www.houstonni.com) .  I would be happy to  answer any questions off-list.<br/>\n <br/>\nThe GFCF diet is hard and expensive and often takes months before you  notice <br/>\nif it is working or not.  I highly recommending trying the enzyme  approach <br/>\nfirst.<br/>\n <br/>\nBut, I will say that diet is a big issue in my home.  We have gone off  <br/>\nartificial colors and we are working towards removing most other  artificials.  <br/>\nUnfortunately, some kids just don&#39;t tolerate this stuff  well.  It is hard <br/>\nbalancing out food freedom and problem foods, but with my  kids, it makes such a <br/>\nhuge difference in our entire family and unschooling  life!  Sometimes I handle <br/>\nit better than others and I just keep trying to  do my best.  <br/>\n <br/>\nI keep lots of good alternatives around, do a lot of talking, and try to  <br/>\nkeep safe food free and easily accessed.<br/>\n <br/>\nLeslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151165310","msgId":14878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDNzc3MkQzLTY3MzQtNEYxQy1BQTRDLTAzREMyNjZBRENCNkBjb3gubmV0Pg==","inReplyToHeader":"PGU3amtpMCtxYTBjQGVHcm91cHMuY29tPg==","referencesHeader":"PGU3amtpMCtxYTBjQGVHcm91cHMuY29tPg=="},"prevInTopic":14877,"nextInTopic":14879,"prevInTime":14877,"nextInTime":14879,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"I don t know if the diet will help your son or not. I have a son with aspergers, a daughter with autism, one with adhd, one with SAD. We tried the diet. It","messageBody":"<div id=\"ygrps-yiv-1033120161\">I don&#39;t know if the diet will help your son or not. I have a son with  <br/>\naspergers, a daughter with autism, one with adhd, one with SAD. We  <br/>\ntried the diet. It didn&#39;t help any one of them. From what I&#39;ve  <br/>\npersonally witnessed, it doesn&#39;t help most children. Some of the  <br/>\nstudies that the articles are based on were flawed for several  <br/>\nreasons, primarily to me is that the number of participants were low,  <br/>\nless than ten in most cases, and don&#39;t reflect the overall population  <br/>\nwho have a spectrum disorder. Some of the studies aren&#39;t experiments  <br/>\nbut merely presentation of epidemiological observations, and some in  <br/>\nturn were affected by the scientist knowing who was on which diet  <br/>\n(particularly the one from 1994, i don&#39;t recall the name, sorry)<br/>\n<br/>\nI only say all this because I hate for anyone to go into something  <br/>\nlike this *knowing* that it will *cure* their child. In my work in  <br/>\nthe autism society, I&#39;ve seen dozens of families start this diet,  <br/>\nonly to have their hopes crushed when little changes. I&#39;ve seen a few  <br/>\nfamilies whom have been helped, but it&#39;s difficult to say why it  <br/>\nworked, when they start a couple of meds, new therapies, and change  <br/>\nthe way they parent due to diagnosis all at the same time. If you  <br/>\nplan on changing any drugs he is taking, I would suggest spacing the  <br/>\nchange by at least six weeks.<br/>\n<br/>\nIf you want to do this diet, be prepared to find lots of alternatives  <br/>\nthat are appealing. You&#39;ll need to do the diet for six months to a  <br/>\nyear, because it takes at least 28 days for all proteins to clear the  <br/>\nsystem, and a few more months for any damage to be repaired. We did  <br/>\nthe gluten-free diet before we were unschoolers, it was difficult  <br/>\nbecause of me. We do have several special diets, ironically, years  <br/>\nafter our gluten free diet we have two younger children with celiac  <br/>\ndisease ;-) So we know where we are going there. It&#39;s tougher than  <br/>\nyou think, be sure to join a celiac support group, because wheat is  <br/>\nsoo hidden, toothpaste, shampoo, playdough, fingerpaints, all of  <br/>\nthose are things that make our boys very sick. My daughter with  <br/>\nautism is on a corn free diet, which we found oddly, while trying to  <br/>\nabstain from wheat. Totally reacts to that. She&#39;s a little tougher,  <br/>\nbut probably because she&#39;s very very developmentally delayed. The  <br/>\nboys didn&#39;t have a choice about the diet. But I work hard to make  <br/>\nsure there are alternatives, so I just say &quot;That has wheat in it, let  <br/>\nme get  you some wheat-free&quot;. Breanna has been off of corn for maybe  <br/>\neighteen months? I have let her have some of the products every now  <br/>\nand then, and she can feel the change. Sometimes she likes it, and I  <br/>\nhave to bite my tongue. But most of the time, she&#39;s very  <br/>\nuncomfortable. And I&#39;m starting to see her think about it. When I  <br/>\npoint out it has corn in it, she&#39;ll choose something else (usually  <br/>\nafter throwing one of her tantrums, which I don&#39;t blame her, it  <br/>\nsucks, corn syrup is in EVERYTHING good!)<br/>\n<br/>\nHOpe all this is okay, I&#39;m probably missing vital stuff or sounding  <br/>\nlike a prig. DH will be back today, and I am so glad. A full week  <br/>\nwith little help is a little crazy, and *I* am totally crazy. LMK if  <br/>\nyou have any other questions, or if I need to rephrase anything.<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 24, 2006, at 10:08 AM, freepsgal wrote:<br/>\n<br/>\n&gt; Okay, I have another challenge. My son, who is almost 10 years old,<br/>\n&gt; has been diagnosed with Aspergers Syndrome. The label doesn&#39;t<br/>\n&gt; concern me, nor do most of his behaviors. He&#39;s just himself. We<br/>\n&gt; are concerned with a recent behavior of hair pulling and twisting<br/>\n&gt; that has resulted in hair loss. At first he was upset by it but now<br/>\n&gt; he says he doesn&#39;t even see the bald patch on his head and he<br/>\n&gt; doesn&#39;t think there is a problem. We&#39;ve also been dealing with some<br/>\n&gt; other medical issues for nearly 5 years now and with my research on<br/>\n&gt; Aspergers, I found some interesting information regarding diet.<br/>\n&gt; I&#39;ve found some recommendations for a Gluten Free Casein Free diet<br/>\n&gt; for children suffering the same issues my son has been dealing<br/>\n&gt; with. I&#39;ve also learned some negative information about a<br/>\n&gt; medication he&#39;s been on for almost 5 years for constipation. I&#39;d<br/>\n&gt; like to see him off this medication but he&#39;s going to have to change<br/>\n&gt; his diet. He is a very particular eater, because of these issues,<br/>\n&gt; and the diet would mean a drastic change to his familiar diet. But<br/>\n&gt; from what I read, the kids who make it to the other end are truly<br/>\n&gt; happy with the changes even if they were resistant to the diet in<br/>\n&gt; the first place.<br/>\n&gt;<br/>\n&gt; Now, we&#39;re unschoolers. I don&#39;t like forcing anything upon my son.<br/>\n&gt; I&#39;d rather discuss it with him and have him leading the way with me<br/>\n&gt; in a supporting role rather than me dragging him along. Has anyone<br/>\n&gt; dealt with a situation like this from an unschooling point of view?<br/>\n&gt; If my son is adamantly against the changes, and he is at this point,<br/>\n&gt; do I just drop it and wait for him to make the choice at a later<br/>\n&gt; time? I&#39;m trying to find compromises but he has a real fear of new<br/>\n&gt; things. The fears are part of his Aspergers which I know would<br/>\n&gt; improve if we could change his diet. How do I approach this?<br/>\n&gt;<br/>\n&gt; Beth M.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151164501","msgId":14879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MjQyMDA2MTU1NS4xMTQ5My40NDlENjA1NTAwMDU1RTVDMDAwMDJDRTUyMjA2ODI0NjkzMEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":14878,"nextInTopic":14880,"prevInTime":14878,"nextInTime":14880,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"... Can you make small changes, a little bit at a time? Maybe add or    remove just one food and see how he takes it. It s worth playing around with his diet,","messageBody":"<div id=\"ygrps-yiv-1966701271\"><blockquote><span title=\"ireply\">&gt;&gt;If my son is adamantly against the changes, and he is at this point,do I just drop it and wait for him to make the choice at a later time? I&#39;m trying to find compromises but he has a real fear of new things. The fears are part of his Aspergers which I know would improve if we could change his diet. How do I approach this?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Can you make small changes, a little bit at a time? Maybe add or    remove just one food and see how he takes it. It&#39;s worth playing around with his diet, but you&#39;ll want his cooperation.<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: &quot;freepsgal&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freepsgal@...\">freepsgal@...</a>&gt;<br/>\n<blockquote><span title=\"qreply\"> &gt; Okay, I have another challenge.  My son, who is almost 10 years old, <br/>\n&gt; has been diagnosed with Aspergers Syndrome.  The label doesn&#39;t <br/>\n&gt; concern me, nor do most of his behaviors.  He&#39;s just himself.  We <br/>\n&gt; are concerned with a recent behavior of hair pulling and twisting <br/>\n&gt; that has resulted in hair loss.  At first he was upset by it but now <br/>\n&gt; he says he doesn&#39;t even see the bald patch on his head and he <br/>\n&gt; doesn&#39;t think there is a problem.  We&#39;ve also been dealing with some <br/>\n&gt; other medical issues for nearly 5 years now and with my research on <br/>\n&gt; Aspergers, I found some interesting information regarding diet.  <br/>\n&gt; I&#39;ve found some recommendations for a Gluten Free Casein Free diet <br/>\n&gt; for children suffering the same issues my son has been dealing <br/>\n&gt; with.  I&#39;ve also learned some negative information about a <br/>\n&gt; medication he&#39;s been on for almost 5 years for constipation.  I&#39;d <br/>\n&gt; like to see him off this medication but he&#39;s going to have to change <br/>\n&gt; his diet.  He is a very particular eater, because of these issues, <br/>\n&gt; and the diet would mean a drastic change to his familiar diet.  But <br/>\n&gt; from what I read, the kids who make it to the other end are truly <br/>\n&gt; happy with the changes even if they were resistant to the diet in <br/>\n&gt; the first place.  <br/>\n&gt; <br/>\n&gt; Now, we&#39;re unschoolers.  I don&#39;t like forcing anything upon my son.  <br/>\n&gt; I&#39;d rather discuss it with him and have him leading the way with me <br/>\n&gt; in a supporting role rather than me dragging him along.  Has anyone <br/>\n&gt; dealt with a situation like this from an unschooling point of view?  <br/>\n&gt; If my son is adamantly against the changes, and he is at this point, <br/>\n&gt; do I just drop it and wait for him to make the choice at a later <br/>\n&gt; time?  I&#39;m trying to find compromises but he has a real fear of new <br/>\n&gt; things.  The fears are part of his Aspergers which I know would <br/>\n&gt; improve if we could change his diet.  How do I approach this?<br/>\n&gt; <br/>\n&gt; Beth M.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling and diet/medical issues","postDate":"1151163820","msgId":14877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MjQwODQzdDdmODIzNTY3ZzZlNWIwYTA1OTM3MTllNWJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU3amtpMCtxYTBjQGVHcm91cHMuY29tPg==","referencesHeader":"PGU3amtpMCtxYTBjQGVHcm91cHMuY29tPg=="},"prevInTopic":14876,"nextInTopic":14878,"prevInTime":14876,"nextInTime":14878,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"... Have either of you thought of a really short haircut?  Buzz cut that would be difficult to pull out? We ve also been dealing with some ... Could there be a","messageBody":"<div id=\"ygrps-yiv-333156913\">On 6/24/06, freepsgal &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freepsgal@...\">freepsgal@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; Okay, I have another challenge. My son, who is almost 10 years old,<br/>\n&gt; has been diagnosed with Aspergers Syndrome. The label doesn&#39;t<br/>\n&gt; concern me, nor do most of his behaviors. He&#39;s just himself. We<br/>\n&gt; are concerned with a recent behavior of hair pulling and twisting<br/>\n&gt; that has resulted in hair loss.<br/>\n<br/>\n </span></blockquote>Have either of you thought of a really short haircut?  Buzz cut that<br/>\nwould be difficult to pull out?<br/>\n<br/>\n We&#39;ve also been dealing with some<br/>\n<blockquote><span title=\"ireply\"> &gt; other medical issues for nearly 5 years now and with my research on<br/>\n&gt; Aspergers, I found some interesting information regarding diet.<br/>\n&gt; I&#39;ve found some recommendations for a Gluten Free Casein Free diet<br/>\n&gt; for children suffering the same issues my son has been dealing<br/>\n&gt; with. I&#39;ve also learned some negative information about a<br/>\n&gt; medication he&#39;s been on for almost 5 years for constipation.<br/>\n<br/>\n </span></blockquote>Could there be a connection between the medication and his behaviour?<br/>\nWhat happens if he doesn&#39;t take the medication?  Your son is old<br/>\nenough to be able to talk to him about diet and how it is impacting<br/>\nhis health.  Heck, Emily was 4 when we talked about how certain<br/>\ningredients impacted her health.  She&#39;s made decisions based on how<br/>\nshe felt to not consume (or consume much of) those ingredients.  He<br/>\nmay be willing to change what he eats if he can be guaranteed that<br/>\nsome of his favorites will remain, such as bread, but just not wheat<br/>\nbread, etc.  Have you read Doris Rupp&#39;s books?  She is the most well<br/>\nwritten author on behavioural allergies.  Very good information.  And<br/>\nwith the age of your son you could easily do these things together.<br/>\nIf he chooses not to follow a specific diet things are not going to<br/>\nget worse than they are now, right?<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and diet/medical issues","postDate":"1151161728","msgId":14876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3amtpMCtxYTBjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":14877,"prevInTime":14875,"nextInTime":14877,"topicId":14876,"numMessagesInTopic":0,"msgSnippet":"Okay, I have another challenge.  My son, who is almost 10 years old, has been diagnosed with Aspergers Syndrome.  The label doesn t concern me, nor do most of","messageBody":"<div id=\"ygrps-yiv-161764367\">Okay, I have another challenge.  My son, who is almost 10 years old, <br/>\nhas been diagnosed with Aspergers Syndrome.  The label doesn&#39;t <br/>\nconcern me, nor do most of his behaviors.  He&#39;s just himself.  We <br/>\nare concerned with a recent behavior of hair pulling and twisting <br/>\nthat has resulted in hair loss.  At first he was upset by it but now <br/>\nhe says he doesn&#39;t even see the bald patch on his head and he <br/>\ndoesn&#39;t think there is a problem.  We&#39;ve also been dealing with some <br/>\nother medical issues for nearly 5 years now and with my research on <br/>\nAspergers, I found some interesting information regarding diet.  <br/>\nI&#39;ve found some recommendations for a Gluten Free Casein Free diet <br/>\nfor children suffering the same issues my son has been dealing <br/>\nwith.  I&#39;ve also learned some negative information about a <br/>\nmedication he&#39;s been on for almost 5 years for constipation.  I&#39;d <br/>\nlike to see him off this medication but he&#39;s going to have to change <br/>\nhis diet.  He is a very particular eater, because of these issues, <br/>\nand the diet would mean a drastic change to his familiar diet.  But <br/>\nfrom what I read, the kids who make it to the other end are truly <br/>\nhappy with the changes even if they were resistant to the diet in <br/>\nthe first place.  <br/>\n<br/>\nNow, we&#39;re unschoolers.  I don&#39;t like forcing anything upon my son.  <br/>\nI&#39;d rather discuss it with him and have him leading the way with me <br/>\nin a supporting role rather than me dragging him along.  Has anyone <br/>\ndealt with a situation like this from an unschooling point of view?  <br/>\nIf my son is adamantly against the changes, and he is at this point, <br/>\ndo I just drop it and wait for him to make the choice at a later <br/>\ntime?  I&#39;m trying to find compromises but he has a real fear of new <br/>\nthings.  The fears are part of his Aspergers which I know would <br/>\nimprove if we could change his diet.  How do I approach this?<br/>\n<br/>\nBeth M.</div>","specialLinks":[]}],"prevTopicId":14981,"nextTopicId":15003}}