{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First days of vacation","postDate":"1152378329","msgId":15457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDREQ0E1MzZDLUJDODctNDUxNi04NUI1LUEwQkE0N0Q5RTQxOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU4bzFpOStrYWptQGVHcm91cHMuY29tPg==","referencesHeader":"PGU4bzFpOStrYWptQGVHcm91cHMuY29tPg=="},"prevInTopic":15454,"nextInTopic":0,"prevInTime":15456,"nextInTime":15458,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"... We have all gone through it. I took to unschooling instantly - got it - knew it was right, knew it was what we d do. It felt natural to me - it was a","messageBody":"<div id=\"ygrps-yiv-637618240\">On Jul 8, 2006, at 3:31 AM, seccotine_ch wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not looking for excuses, I&#39;m trying to understand what&#39;s going<br/>\n&gt; on in me :) Ren said in another post that unschooling was such a<br/>\n&gt; healing process, and I really think that too - but I&#39;m always<br/>\n&gt; surprised (though it is not the first time) with the resistance and<br/>\n&gt; fights such a process encounters.<br/>\n<br/>\n </span></blockquote>We have all gone through it. I took to unschooling instantly - &quot;got  <br/>\nit&quot; - knew it was right, knew it was what we&#39;d do. It felt natural to  <br/>\nme - it was a logical and easy extension of the way I&#39;d been raised  <br/>\nand the way I&#39;d lived with my babies and toddlers.<br/>\n<br/>\nBut STILL I resort to yelling and guilt-inducing and sometimes get so  <br/>\nfrustrated and angry that I say things I thoroughly regret. Each new  <br/>\nage of kids (and adults) - each new stage - brings new challenges and  <br/>\nwe have new things to learn about ourselves and how we react.<br/>\n<br/>\nWhat has helped me is this:  In the midst of reacting in a way I  <br/>\nreally don&#39;t want to act, a little voice in my head says, &quot;Think of  <br/>\ntwo options first.&quot; What that means is that I&#39;m telling myself to not  <br/>\nreact until I&#39;m choosing the best of at least two possible reactions.  <br/>\nSo - I quickly think - &quot;YELL!&quot; because that is what is about to come  <br/>\nout, and then I think &quot;OR ......&quot; - and I force myself to think of  <br/>\nsomething else. Often, that much of a pause is enough to get me to  <br/>\nthink of what someone on this list has previously suggested - hug,  <br/>\ntouch, breathe, etc. So I choose the better of the two alternatives.  <br/>\nEVEN if my urge is to throw something and the only other alternative  <br/>\nI can think of is to slam a door - slamming a door is a better  <br/>\nalternative (usually). It is a PROCESS - and getting the habit of  <br/>\nchoosing between at least two options is a HUGE big step in that  <br/>\nprocess - if that can become a habit, then you&#39;ll find that you start  <br/>\nto choose between better and better options.<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":160045678,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First days of vacation","postDate":"1152354697","msgId":15454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4bzFpOStrYWptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA3MDcxMTAwaDQxNWUyN2JidDc1ODQzMzcwZTMwN2FhZjZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":15438,"nextInTopic":15457,"prevInTime":15453,"nextInTime":15455,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"Michelle and Pam, thank you so much for your answers ... I m glad to see that I m not the only one who estivate (the word exists : in the Sahara desert, little","messageBody":"<div id=\"ygrps-yiv-1283400872\">Michelle and Pam, thank you so much for your answers ...<br/>\n<br/>\nI&#39;m glad to see that I&#39;m not the only one who estivate (the word <br/>\nexists : in the Sahara desert, little mice spend the whole summer <br/>\nburied into the sand, waiting for a more clement season) !<br/>\n<br/>\nMy husband came home and I left to walk the dogs. While I was <br/>\nwalking in the countryside, watching the beautiful changing sky, I <br/>\nfelt the tension leaving my body. I realised that during the day, I <br/>\nget more and more tensed, and suddenly, I explode for a little <br/>\nincident ... I was wondering if there were a way to relax physically <br/>\nin order to avoid these outbursts ...  (though I don&#39;t know, between <br/>\nthe physical tension and the mental one which is the hen and which <br/>\nis the egg ...)<br/>\n<br/>\nI guess that the problem is the shift from segmented/specialised <br/>\ntimes to the more organic/intertwined life I&#39;m experiencing now. I <br/>\nhave to find new marks. By reading your posts, I realise that I am <br/>\nsuch a beginner in this new life, that this is something so<br/>\ndifferent (not only the radical unschooling thing, but also <br/>\nthe &quot;living together&quot; one), that this is not surprising if I <br/>\nfeel lost and not good at it ... <br/>\n<br/>\nPam, I really liked the way you told me that I couldn&#39;t afford self-<br/>\npity - it was so empowering ! I absolutely agree with you. I&#39;m not <br/>\ndepressed, actually, I usually feel very privileged and happy, but <br/>\nyesterday, I was this miserable little thing who &quot;didn&#39;t even know <br/>\nwhat to cook for luhuhuhunch&quot;. <br/>\n<br/>\nI wrote about it, because I have moments like this from time to <br/>\ntime, though they&#39;re only moments, where I feel at loss and <br/>\noverwhelmed by the huge responsibility of being a parent ... but I <br/>\nnotice that it happens mostly when I loose touch with my children <br/>\n(which was very the case yesterday). <br/>\n<br/>\nThat&#39;s one of the reasons why I like so much the way you, radical <br/>\nunschoolers, talk about parenting. When I read you, it really feel <br/>\nlike : yes, this is truth. And the reason why I feel that is not <br/>\nthat I&#39;m inclined to follow a new guru - it is because what you say <br/>\nspeaks directly to the life in me (what I tried to translate once <br/>\nby &quot;talking to my cells&quot;), the part which has remained undamaged and <br/>\nwhich is constantly seeking for healing forces. <br/>\n<br/>\nBut this is also why I felt so strange this week, because on the one <br/>\nhand, I read words which were driving me in the right track (sorry <br/>\nfor the image, cannot find my words to express what I really felt <br/>\nhere) and on the other hand, there was something (what ???) <br/>\nresisting in me, which makes me act in complete contradiction with <br/>\nmy beliefs - at the moment where my beliefs where so much reinforced <br/>\nby my readings. (Does anybody understand what I&#39;m writing here ?)<br/>\n<br/>\nI&#39;m not looking for excuses, I&#39;m trying to understand what&#39;s going <br/>\non in me :) Ren said in another post that unschooling was such a <br/>\nhealing process, and I really think that too - but I&#39;m always <br/>\nsurprised (though it is not the first time) with the resistance and <br/>\nfights such a process encounters.<br/>\n<br/>\nMany, many thanks. I really appreciate your bluntness AND <br/>\nkindness - and also all these practical, down to the earth pieces of <br/>\nadvice you give, which are sooo helpful ? useful ? don&#39;t know, but <br/>\npriceless anyway :)<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First days of vacation","postDate":"1152295259","msgId":15438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA3MDcxMTAwaDQxNWUyN2JidDc1ODQzMzcwZTMwN2FhZjZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU4bHVscytsa2J2QGVHcm91cHMuY29tPg==","referencesHeader":"PDQ0QUQzMTRDLjcwODA0MDZAYWRlbHBoaWEubmV0PiA8ZThsdWxzK2xrYnZAZUdyb3Vwcy5jb20+"},"prevInTopic":15437,"nextInTopic":15454,"prevInTime":15437,"nextInTime":15439,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"I had to respond to this part of your original post: So we spend our mornings in our (tiny) garden, then we flow back inside, close everything and wait for","messageBody":"<div id=\"ygrps-yiv-191565345\">I had to respond to this part of your original post:<br/>\n&quot;So we spend our mornings in our (tiny) garden, then we flow back<br/>\ninside, close everything and wait for the sun to turn - and at five,<br/>\nwe live again.&quot;<br/>\n<br/>\nI could have written that but it would look more like:  So we spend<br/>\nour springs in our (tiny) garden, then we flow back inside, close<br/>\neverything and wait for the seasons to turn - and at autumn we live<br/>\nagain.&quot;  :-)  We are not summer people (so what the heck are we doing<br/>\nliving in  Florida?).  We joke (although it is mostly true) that we go<br/>\nfrom air conditioned building to air conditioned car into a different<br/>\nair conditioned building during the summer.  None of us truly enjoy<br/>\nthe heat, so we tend to hibernate during the summer and then go out to<br/>\nplay in the cooler months.  It doesn&#39;t help that poor Keon is horribly<br/>\nallergic to misquitos and gets huge welts on him that make him look<br/>\nlike he has a perpetual case of chicken pox and that he is allergic to<br/>\ngrass.  Anytime someone cuts their grass in the neighborhood (which is<br/>\noften) he has to stay inside for most of the day or he will get stuffy<br/>\nand wheezy.  And people wonder why we don&#39;t water our grass and have<br/>\nlet it go dormant in this stupid draught.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe it&#39;s the fact of being the only person in charge - I<br/>\n&gt; guess that there must be a little bit of that, because I can feel<br/>\n&gt; the tension go when my husband comes back - even when he does<br/>\n&gt; nothing but reading the paper ...<br/>\n<br/>\n </span></blockquote>I used to be like that.  In fact for a short while (even though I only<br/>\nworked when Emily was a few months old and have been a SAHM since) I<br/>\nactually waited for my co-parent to get home before doing *anything.*<br/>\nIt was like we waited for his arrival to begin our lives.  I got over<br/>\nit by just being used to being alone with our children.  I think his<br/>\nworking out of town for weeks on end made me want to have a life.  :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Anyway, I don&#39;t know why, all I&#39;m thinking of is &quot;getting a little<br/>\n&gt; space for me&quot; ...<br/>\n<br/>\n </span></blockquote>When my children were much younger I would actually schedule &quot;me<br/>\ntime.&quot;  Whether it was just doing the grocery shopping alone or a<br/>\nmonthly or weekly craft class, I scheduled time for me.  I&#39;m an<br/>\nimportant part of the family as well.  I did this even when our babies<br/>\nwere small because I learned their schedules and knew that I could be<br/>\naway from them for 1.5-3 hours here and there.  For a while I was<br/>\ntaking myself to the movies and going to the showings that started at<br/>\n9:30 or 10:00 at night because I knew our baby would be in his long<br/>\nslumber at that time and not wake up.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have the feeling they would like me to initiate things, but I<br/>\n&gt; don&#39;t know what to do with them : I love reading stories, I love<br/>\n&gt; discussing with them, I love going with them ... anywhere, the fact<br/>\n&gt; of being together ... I&#39;m not so good in playing with toys (I mean :<br/>\n&gt; I can have a great fun playing in the pool, jumping, splashing, all<br/>\n&gt; these, but give me a Playmobil soldier and I suddenly feel goofy and<br/>\n&gt; stupid ...).<br/>\n<br/>\n </span></blockquote>It&#39;s ok to feel goofy and silly (I doubt you are stupid :) )  That&#39;s<br/>\nwhat play is.  Laugh, enjoy, be silly!  All too soon they are going to<br/>\nbe dressing in black and only be concerned with serious things like<br/>\nthe Korean missile testing and why the heck the Jews and Muslems can&#39;t<br/>\nget along in Israel and why the environment is going to hell in a hand<br/>\nbasket.  Enjoy this goofy silly time!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not very good in being there just in case, when<br/>\n&gt; Sylvain plays with the computer, for instance, and asks for help<br/>\n&gt; again and again ...<br/>\n<br/>\n </span></blockquote>When Keon first started getting on the computer he had problems<br/>\nreading URL&#39;s to type them in.  To help him with this and to also<br/>\nlimit his accidentally ending up at a website that featured nude<br/>\nDisney characters doing things I didn&#39;t think he was quite ready for<br/>\nat 3 years old LOL!  I created shortcuts for him on the desktop so he<br/>\ncould click on an icon and go straight to Disney, or Hotwheels or<br/>\nNeopets.  All his user names and passwords were the same and written<br/>\non a 3x5 card that was taped to the computer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Yes, I think that&#39;s the most difficult for me is to be there, at<br/>\n&gt; their disposal, and knowing that I can&#39;t do anything for me, whether<br/>\n&gt; it is for my pleasure or because it needs to be done, because I know<br/>\n&gt; that I&#39;ll be interrupted again and again ... I also know that it<br/>\n&gt; would be better if I were truly with them, instead of being half<br/>\n&gt; there, half thinking of my various to-do lists ... but I can&#39;t help<br/>\n&gt; it (yet)<br/>\n<br/>\n </span></blockquote>This is all new to you.  Give yourself time and if you get interupted,<br/>\nknow that that task will still be there when you are finished playing<br/>\nwith your kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I often read here that we are work in progress, so let&#39;s hope in<br/>\n&gt; progress ...<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We are always a work in progress.  We are always on a journey.  if the<br/>\nwork gets completed or the journey completed, there won&#39;t be anything<br/>\nworth living for.  Sure would be boring without all the self-discovery<br/>\nand adventures!<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: First days of vacation","postDate":"1152292839","msgId":15437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMjdGRTU2LUM0NUQtNDA4RS04QjIyLTgyMDRCMzJCRjg3REBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU4bHVscytsa2J2QGVHcm91cHMuY29tPg==","referencesHeader":"PGU4bHVscytsa2J2QGVHcm91cHMuY29tPg=="},"prevInTopic":15435,"nextInTopic":15438,"prevInTime":15436,"nextInTime":15438,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"... This time will end! My kids are now 15, 18, and 21 and I just had to make a lunch date with my 21 year old in order to be sure I d even SEE her in the next","messageBody":"<div id=\"ygrps-yiv-259173048\">On Jul 7, 2006, at 8:30 AM, seccotine_ch wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, I think that&#39;s the most difficult for me is to be there, at<br/>\n&gt; their disposal, and knowing that I can&#39;t do anything for me, whether<br/>\n&gt; it is for my pleasure or because it needs to be done, because I know<br/>\n&gt; that I&#39;ll be interrupted again and again ...<br/>\n<br/>\n </span></blockquote>This time will end! My kids are now 15, 18, and 21 and I just had to  <br/>\nmake a lunch date with my 21 year old in order to be sure I&#39;d even  <br/>\nSEE her in the next week. It won&#39;t last - really!  I remember feeling  <br/>\nthe same way you do after I left my regular full-time employment to  <br/>\nstay home with my little ones - I felt like my whole day went by with  <br/>\nnothing &quot;done&quot; and like I&#39;d never get to do something satisfying to  <br/>\nmyself ever again. What I &quot;did&quot; about that was to get super into  <br/>\nreading about child development and about learning and then I&#39;d keep  <br/>\nmy focus on my own kids - watching, observing them. I kept a journal  <br/>\n- just jotted down little notes like: &quot;Rosie seems to be guessing  <br/>\nwhat words are based on the first letter,&quot; or &quot;Roxana needs needs to  <br/>\nbe left alone when she&#39;s upset - not comforted immediately.&quot; Keeping  <br/>\na journal (even though it was sometimes 3 or 4 words in an entry  <br/>\nbecause that&#39;s all the time I got) helped me feel more like something  <br/>\nwas &quot;happening&quot; while getting my focus more clearly on the kids - out  <br/>\nof my own head. And - I always had a book going, but I had to learn  <br/>\nto read in bits - not like how I read before, in long uninterrupted  <br/>\nstretches. Nonfiction works way better for this than fiction - so  <br/>\nthere were about 18 years of me reading almost entirely nonfiction -  <br/>\nuntil I got back into fiction a couple of years ago.<br/>\n<br/>\nAlso - it REALLY helped to take the kids out of the house to a public  <br/>\narea where there might be other parents. Even when my kids were  <br/>\nschool age and the other parents only had toddlers and babies, it  <br/>\ngave me someone to talk to who understood how to carry on a  <br/>\nconversation in the midst of constant interruption. Where I live, it  <br/>\nis easy to start up a conversation with another parent - just stand  <br/>\nwatching the kids on the playground and say, &quot;Oh, your little boy is  <br/>\nso cute - look how well he&#39;s climbing that ladder. How old is he?&quot;  <br/>\nParents here are open to conversations with other parents. I&#39;m not  <br/>\nsure that is the case everywhere, I know in Germany people didn&#39;t  <br/>\nseem to commonly talk to strangers in public settings like we do  <br/>\nhere. But, if that works where you are, it is a great way to have a  <br/>\nlittle adult conversation during the day.  In rainy weather I&#39;d take  <br/>\nthe kids to a shopping mall just to buy a cookie and I&#39;d have a cup  <br/>\nof coffee (that someone ELSE had made - it was a treat!).<br/>\n<br/>\nALSO - I had a mother&#39;s helper - a teenage girl who came in and  <br/>\nplayed with the kids while I was there, in the house, but went off to  <br/>\ndo my own thing for a while. I worked from home during some periods  <br/>\nof time - other times I just went and took a bath and read a book in  <br/>\nthe tub. Sometimes I made phone calls. The time went fast - but I  <br/>\nthink even an hour or two a couple of times per week could make a  <br/>\nHUGE difference.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also know that it<br/>\n&gt; would be better if I were truly with them, instead of being half<br/>\n&gt; there, half thinking of my various to-do lists ... but I can&#39;t help<br/>\n&gt; it (yet)<br/>\n&gt;<br/>\n </span></blockquote>Yes you can - you can help it. You can do better for an hour, for  <br/>\nexample. You can tell yourself: &quot;For the next hour I&#39;m on vacation  <br/>\nwith my kids and we have nothing to do but have fun together.&quot; So do  <br/>\nthat for an hour. Then tell the kids, &quot;Okay, now I&#39;m on work time and  <br/>\nwon&#39;t be paying as much attention for the next hour.&quot; Alternate like  <br/>\nthat. What you end up with is half your time with full focus on the  <br/>\nkids and half the time partially focused on them and partially on  <br/>\ngetting other stuff done. That&#39;s FINE! That&#39;s awesome!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel quite depressed today, because when I began to read you (and<br/>\n&gt; Sandra and Joyce&#39;s sites), it really had an impact in my ways with<br/>\n&gt; the kids, I really felt more patient and relaxed ... and now that I<br/>\n&gt; do have time, I&#39;m stressed out again, and I yell again ... IT&#39;s as<br/>\n&gt; if I had too much responsibilities and I don&#39;t feel like I can do<br/>\n&gt; it. This morning, as I burst into cries, hidden behind a wall of<br/>\n&gt; toilet paper in the supermaket, I was thinking &quot;I shouldn&#39;t have all<br/>\n&gt; these kids, I&#39;m not able to take care of them as they deserve, etc.&quot;<br/>\n<br/>\n </span></blockquote>Sweetie - you don&#39;t get the luxury of self-pity (even if you deserve  <br/>\nit). You do have kids and they need a happy mommy. So you do owe it  <br/>\nto them to take care of yourself. Do you get enough sleep, eat well,  <br/>\nget a little regular exercise? If you really are a little depressed,  <br/>\ntry St. John&#39;s Wort - it works great for mild to moderate depression.  <br/>\nIf you think you&#39;re seriously depressed please see a doctor - you can  <br/>\ntake an anti-depressant for a while, jump start yourself and begin  <br/>\nfeeling like having more fun in your life again, and pretty soon you  <br/>\nmight not need the medications. Also, I have a friend who goes out  <br/>\nEVERY Friday night by herself or with girlfriends. She almost always  <br/>\ngoes to a movie - she picks artsy interesting movies that her husband  <br/>\nprobably wouldn&#39;t even want to see. She&#39;s done this every Friday  <br/>\nnight for probably 12 years or more. Would a night out help? Having  <br/>\nsomething like that to look forward to this WEEK?<br/>\n<br/>\nI never liked to play &quot;Little People&quot; or dolls or any of that stuff  <br/>\nwith my kids. They could tell. So - occasionally I&#39;d be part of their  <br/>\nplay, but they&#39;d have to tell me what to do &lt;G&gt;. It wasn&#39;t that  <br/>\nsatisfying to any of us - they didn&#39;t ask it of me too often. But I  <br/>\ndid lots of other things with them. I don&#39;t think adults need to be  <br/>\nwatching kids play and cheering them on or anything - just be  <br/>\navailable, you don&#39;t have to be part of it all the time, or even most  <br/>\nof the time.<br/>\n<br/>\nThink of things you might enjoy, yourself, that you could share with  <br/>\nthe kids. Get good quality finger paints and fingerpainting paper and  <br/>\nYOU fingerpaint and invite them to join in. Same with watercolors. Or  <br/>\n- buy a bunch of disposable cameras and all of you go out and take  <br/>\nphotos together of nature or city life or whatever. You get to  <br/>\nparticipate at YOUR level, too, that way.<br/>\n<br/>\nAlthough you do have to get used to be interrupted all the time - and  <br/>\nfunctioning that way is a skill you might not yet have -- you don&#39;t  <br/>\nhave to put ALL your attention on your kids to the point that you&#39;re  <br/>\nfeeling martyred - that&#39;s not even very good for them. Think of it as  <br/>\nmodeling an adult being interested in things, too.<br/>\n<br/>\nWhat are your hobbies? What would you like to do with yourself OTHER  <br/>\nthan clean the house and do laundry, etc.?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":160045678,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First days of vacation","postDate":"1152286204","msgId":15435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4bHVscytsa2J2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ0QUQzMTRDLjcwODA0MDZAYWRlbHBoaWEubmV0Pg=="},"prevInTopic":15406,"nextInTopic":15437,"prevInTime":15434,"nextInTime":15436,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"Thank you so much for this message, Alice. ... pushing ... laughing ... them? ... fine ... to take ... with ... about what ... bothers you ... Yes, that s what","messageBody":"<div id=\"ygrps-yiv-1700469826\">Thank you so much for this message, Alice. <br/>\n<br/>\nYou wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Your time with your children should be enjoyable.  What are you <br/>\n </span></blockquote>pushing <br/>\n<blockquote><span title=\"ireply\"> &gt; yourself to do with them that feels like such a drain?  Are you <br/>\n </span></blockquote>laughing <br/>\n<blockquote><span title=\"ireply\"> &gt; and having fun together?  Are you cuddling in bed and reading to <br/>\n </span></blockquote>them?  <br/>\n<blockquote><span title=\"ireply\"> &gt; Are you letting them lead the activities or are you organizing <br/>\n&gt; activities and making them do it?  Having some time to yourself is <br/>\n </span></blockquote>fine <br/>\n<blockquote><span title=\"ireply\"> &gt; but I get the impression from your letter that your time with your <br/>\n&gt; children is not enjoyable, not nourishing and therefore you have <br/>\n </span></blockquote>to take <br/>\n<blockquote><span title=\"ireply\"> &gt; breaks or avoid it, if possible.  That tells me something is wrong <br/>\n </span></blockquote>with <br/>\n<blockquote><span title=\"ireply\"> &gt; how you and your children are interacting.  Tell us some more <br/>\n </span></blockquote>about what <br/>\n<blockquote><span title=\"ireply\"> &gt; goes on and what specifically it is about your children that <br/>\n </span></blockquote>bothers you <br/>\n<blockquote><span title=\"ireply\"> &gt; and that you feel you need to avoid.<br/>\n<br/>\n </span></blockquote>Yes, that&#39;s what bothers me so much. Usually, I like being with <br/>\nthem, following their games, reading them stories ... But I don&#39;t <br/>\nknow why, this week, it&#39;s not at all like this. Maybe it&#39;s because <br/>\nI&#39;m not used to spend my whole day with somebody (I&#39;m a rather <br/>\nsolitary person), and it&#39;s hard for me to take other habits ... <br/>\nMaybe it&#39;s because I find hard to be on call, like that, all day <br/>\nlong ... Maybe it&#39;s the fact of being the only person in charge - I <br/>\nguess that there must be a little bit of that, because I can feel <br/>\nthe tension go when my husband comes back - even when he does <br/>\nnothing but reading the paper ... <br/>\n<br/>\nAnyway, I don&#39;t know why, all I&#39;m thinking of is &quot;getting a little <br/>\nspace for me&quot; ... I try to control that, I think : you were so sad <br/>\nleaving them all the time, and you&#39;ll see, before you even know it, <br/>\nthey&#39;ll leave home, enjoy while they&#39;re here ... They won&#39;t always <br/>\nneed you so much and you&#39;ll even miss the constant interruptions ... <br/>\n<br/>\nI have the feeling they would like me to initiate things, but I <br/>\ndon&#39;t know what to do with them : I love reading stories, I love <br/>\ndiscussing with them, I love going with them ... anywhere, the fact <br/>\nof being together ... I&#39;m not so good in playing with toys (I mean : <br/>\nI can have a great fun playing in the pool, jumping, splashing, all <br/>\nthese, but give me a Playmobil soldier and I suddenly feel goofy and <br/>\nstupid ...). I&#39;m not very good in being there just in case, when <br/>\nSylvain plays with the computer, for instance, and asks for help <br/>\nagain and again ... <br/>\n<br/>\nYes, I think that&#39;s the most difficult for me is to be there, at <br/>\ntheir disposal, and knowing that I can&#39;t do anything for me, whether <br/>\nit is for my pleasure or because it needs to be done, because I know <br/>\nthat I&#39;ll be interrupted again and again ... I also know that it <br/>\nwould be better if I were truly with them, instead of being half <br/>\nthere, half thinking of my various to-do lists ... but I can&#39;t help <br/>\nit (yet)<br/>\n<br/>\nI feel quite depressed today, because when I began to read you (and <br/>\nSandra and Joyce&#39;s sites), it really had an impact in my ways with <br/>\nthe kids, I really felt more patient and relaxed ... and now that I <br/>\ndo have time, I&#39;m stressed out again, and I yell again ... IT&#39;s as <br/>\nif I had too much responsibilities and I don&#39;t feel like I can do <br/>\nit. This morning, as I burst into cries, hidden behind a wall of <br/>\ntoilet paper in the supermaket, I was thinking &quot;I shouldn&#39;t have all <br/>\nthese kids, I&#39;m not able to take care of them as they deserve, etc.&quot;<br/>\n<br/>\nI often read here that we are work in progress, so let&#39;s hope in <br/>\nprogress ...<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":160045678,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First days of vacation (episode 2)","postDate":"1152201394","msgId":15406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4amJyaSs1OTBmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNzA2MDg0NDEwLkVERjk1NzQ5RTRAc210cDgud2FuYWRvby5ubD4="},"prevInTopic":15402,"nextInTopic":15435,"prevInTime":15405,"nextInTime":15407,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"Thanks Eugenie I found this morning the word that describes how I feel these days (though I don t know if the translation is correct) : desynchronized. Gotta","messageBody":"<div id=\"ygrps-yiv-827108280\">Thanks Eugenie<br/>\n<br/>\nI found this morning the word that describes how I feel these days <br/>\n(though I don&#39;t know if the translation is correct) : desynchronized.<br/>\n<br/>\nGotta go, dogs are waiting ;)<br/>\n<br/>\nHelen<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Eugenie van Ruitenbeek&quot; <br/>\n&lt;emmvr@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi Helen,<br/>\n&gt; <br/>\n&gt; I have the same kind of feelings and I feel them the strongest in <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; morning, after waking up. &quot;Oh mai.... what should I do today with <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; kids...??&quot;<br/>\n&gt; <br/>\n&gt; I see that this has nothing to do with the kids. It is my <br/>\n </span></blockquote>perspective of my<br/>\n<blockquote><span title=\"ireply\"> &gt; life.. I can see that my brains start right away with telling me <br/>\n </span></blockquote>about all<br/>\n<blockquote><span title=\"ireply\"> &gt; the things that must be done and when I don&#39;t listen to that, I <br/>\n </span></blockquote>feel scared<br/>\n<blockquote><span title=\"ireply\"> &gt; and tense.... I feel the struggle and tension in my body which I <br/>\n </span></blockquote>feel all my<br/>\n<blockquote><span title=\"ireply\"> &gt; life, when I am lost, out of connection with my heart, my breath...<br/>\n&gt; <br/>\n&gt; I feel devastated but there is nothing really wrong.. My brains <br/>\n </span></blockquote>give me the<br/>\n<blockquote><span title=\"ireply\"> &gt; wrong information... they act as if there is an emergency but the <br/>\n </span></blockquote>real thing<br/>\n<blockquote><span title=\"ireply\"> &gt; is.. all is well... Jesse is at home for almost a year now and I <br/>\n </span></blockquote>am still<br/>\n<blockquote><span title=\"qreply\"> &gt; working on this issue. You are not alone..<br/>\n&gt; <br/>\n&gt; Warmly,<br/>\n&gt; Eugenie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":220662483,"authorName":"Alice Sackman","from":"Alice Sackman &lt;thesackmans@...&gt;","profile":"alice_in_idaho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: First days of vacation","postDate":"1152201036","msgId":15402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0QUQzMTRDLjcwODA0MDZAYWRlbHBoaWEubmV0Pg=="},"prevInTopic":15397,"nextInTopic":15406,"prevInTime":15401,"nextInTime":15403,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"Posted by: seccotine_ch seccotine@bluemail.ch  seccotine_ch","messageBody":"<div id=\"ygrps-yiv-946381071\">Posted by: &quot;seccotine_ch&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:seccotine@...\">seccotine@...</a> <br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:seccotine@...\">seccotine@...</a>?Subject=Re:%20First%20days%20of%20vacation&gt; <br/>\n  seccotine_ch &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://profiles.yahoo.com/seccotine_ch\">http://profiles.yahoo.com/seccotine_ch</a>&gt;Tue Jul 4, 2006 <br/>\n5:01 pm<br/>\nHelen wrote:  &quot;There is another problem ... how do you do when your <br/>\nenergy level is<br/>\ncompletely down ? I let them do quite whatever they want, and at some <br/>\npoint, I feel that I should do something, take them with me somewhere, <br/>\ninitiate a game, whatever, but change the energy of the moment, because <br/>\nthey get bored ... and I can&#39;t. &quot;<br/>\n<br/>\n***First of all, recognize you are just at the beginning of the long <br/>\nprocess of deschooling.  Next year at this time, if you keep making <br/>\nprogress, you will just be starting to truly &quot;unschool&quot; - so give <br/>\nyourself a break and realize it is a process - a long process. <br/>\n<br/>\n My recommendation to you is to drop all the &quot;shoulds&quot;.  Every time you <br/>\nfeel like you &quot;should&quot; do something, but you don&#39;t really feel like it <br/>\n(whether because of energy levels or whatever), then don&#39;t do it!  <br/>\nDeschooling at this point is about learning to honor your self, your <br/>\nenergy levels.  Do what you want to do, not what you feel you should do <br/>\nor feel that you have to do.  If you can&#39;t do that for yourself, how <br/>\nwill you ever do it for your children?  Unschooling is about trusting <br/>\nand honoring the desires/rhythyms of ourselves and our children.  Keep <br/>\nreminding yourself you are on summer break - you are taking a break from <br/>\neverything. <br/>\n<br/>\nSo, if you want to lay around, lay around!  If you can&#39;t bring yourself <br/>\nto clean the house or feel resistance every time you think &quot;I should <br/>\nclean the house&quot; than don&#39;t do it.  What do you feel like doing?  What <br/>\ndo the kids feel like doing?  Do those things.  You are probably all <br/>\nexhausted from pushing yourselves when you should have been resting and <br/>\nnow you will need a long break to catch up.  Begin unschooling by <br/>\nhonoring that; by ignoring all the &quot;shoulds&quot; that keep echoing around in <br/>\nyour head and do what you feel like doing.<br/>\n<br/>\nMy guess is that you feel like your children are exhausting you because <br/>\nyou are not honoring what you need and what they need.  It is exhuasting <br/>\nto push/control people constantly.  You are probably not even aware that <br/>\nyou are doing it - it has become so second nature to you that you are <br/>\nunaware that it is happening.  I fall into this trap too, and my biggest <br/>\nindication that it is happening again is when my energy levels drop and <br/>\nI feel like I am dragging everyone along.  When this happens, I know I <br/>\nam &quot;going against the grain&quot; and I need to give myself a time-out.  And <br/>\nI usually need to drop my expectations about what &quot;should&quot; be happening. <br/>\n<br/>\nYour time with your children should be enjoyable.  What are you pushing <br/>\nyourself to do with them that feels like such a drain?  Are you laughing <br/>\nand having fun together?  Are you cuddling in bed and reading to them?  <br/>\nAre you letting them lead the activities or are you organizing <br/>\nactivities and making them do it?  Having some time to yourself is fine <br/>\nbut I get the impression from your letter that your time with your <br/>\nchildren is not enjoyable, not nourishing and therefore you have to take <br/>\nbreaks or avoid it, if possible.  That tells me something is wrong with <br/>\nhow you and your children are interacting.  Tell us some more about what <br/>\ngoes on and what specifically it is about your children that bothers you <br/>\nand that you feel you need to avoid.<br/>\n-Alice<br/>\n(only one year into the deschooling process so by no means an expert!)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196491767,"authorName":"Eugenie van Ruitenbeek","from":"&quot;Eugenie van Ruitenbeek&quot; &lt;emmvr@...&gt;","profile":"janeugenie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] First days of vacation (episode 2)","postDate":"1152175455","msgId":15397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzA2MDg0NDEwLkVERjk1NzQ5RTRAc210cDgud2FuYWRvby5ubD4=","inReplyToHeader":"PGU4aDlmdStjdGtxQGVHcm91cHMuY29tPg=="},"prevInTopic":15383,"nextInTopic":15402,"prevInTime":15396,"nextInTime":15398,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"Hi Helen, I have the same kind of feelings and I feel them the strongest in the morning, after waking up. Oh mai.... what should I do today with the ","messageBody":"<div id=\"ygrps-yiv-1131446589\">Hi Helen,<br/>\n<br/>\nI have the same kind of feelings and I feel them the strongest in the<br/>\nmorning, after waking up. &quot;Oh mai.... what should I do today with the<br/>\nkids...??&quot;<br/>\n<br/>\nI see that this has nothing to do with the kids. It is my perspective of my<br/>\nlife.. I can see that my brains start right away with telling me about all<br/>\nthe things that must be done and when I don&#39;t listen to that, I feel scared<br/>\nand tense.... I feel the struggle and tension in my body which I feel all my<br/>\nlife, when I am lost, out of connection with my heart, my breath...<br/>\n<br/>\nI feel devastated but there is nothing really wrong.. My brains give me the<br/>\nwrong information... they act as if there is an emergency but the real thing<br/>\nis.. all is well... Jesse is at home for almost a year now and I am still<br/>\nworking on this issue. You are not alone..<br/>\n<br/>\nWarmly,<br/>\nEugenie</div>","specialLinks":[]},{"userId":160045678,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"First days of vacation (episode 2)","postDate":"1152133438","msgId":15383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4aDlmdStjdGtxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU4ZXBtNCszZmw1QGVHcm91cHMuY29tPg=="},"prevInTopic":15336,"nextInTopic":15397,"prevInTime":15382,"nextInTime":15384,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"OK. So here I am, trying to do better everyday (baby steps, though). The cool thing is, when I sit in front of my computer, I always find food for thought,","messageBody":"<div id=\"ygrps-yiv-1538222351\">OK. So here I am, trying to do better everyday (baby steps, though).<br/>\n<br/>\nThe cool thing is, when I sit in front of my computer, I always find <br/>\nfood for thought, allowing me to put the events of the day in <br/>\nperspective :) Sometimes, it is incredibly to the point !!!<br/>\n<br/>\nAnyway. I have a concern, which I tried to express in my previous <br/>\nmessage, with my elementary English that make the exercise of <br/>\ntranslating my thoughts such a hard and frustrating exercise ... I <br/>\nhope that nobody won&#39;t be irritated by my insistance <br/>\n<br/>\nIt&#39;s about being WITH my children. I have a lot of questions around <br/>\nthat. <br/>\n<br/>\nAs I said, I&#39;m really not used to live like that - I know how to <br/>\nlive separate lives, I&#39;m used to separation in the morning and <br/>\nreunion in the evening, used to do my own business during the day, <br/>\nliving at my own rhythm ... I know how to put things aside in order <br/>\nto take care of my children when they are here, how to give them my <br/>\nfull attention when we are together, evenings and week-ends<br/>\n<br/>\nThough it is really what I want (I hated leaving them every <br/>\nmorning),  I don&#39;t know how to live together day after day after <br/>\nday - I&#39;m so lost ! <br/>\n<br/>\nI&#39;ve always needed to have time by myself - and suddenly I don&#39;t <br/>\nhave any, and I miss it very much. Strangely, in the same time, I&#39;m <br/>\nhaving doubts : is it really a need by itself, or is it hiding <br/>\nanother one ? <br/>\n<br/>\nI try to preserve some little times for me during the day, but the <br/>\noutcome of this attitude is &quot;disastrous&quot;, because it doesn&#39;t work, <br/>\nof course, and I&#39;m kind of frustrated all the time (and I guess that <br/>\nthey are, too). I really have a hard time going to them - it&#39;s as if <br/>\nI was trying to escape all the time. <br/>\n<br/>\nI&#39;m wondering if they finally don&#39;t have less time WITH me than <br/>\nbefore.<br/>\n<br/>\nI have also noticed that they get bored and electric when we don&#39;t <br/>\nregularly do organized things together ... The balance between <br/>\nproposing activities and letting them organize their own time is <br/>\ndifficult to find, particularly when I&#39;m very tired or longing for <br/>\nsolitude. On the other hand, I don&#39;t really know what to propose ! <br/>\nThey made lots of things at daycare, and my role was to let them <br/>\nfree of their time, so they could rest from all this &quot;collective <br/>\norganisation&quot; ...  <br/>\n<br/>\nI&#39;m wondering : will it always be like that ? Am I experiencing a <br/>\ntransition time, getting accustomed to a new pattern of life ? Am I <br/>\ngoing to learn being with my kids all the time, balancing our needs, <br/>\ninitiating things, sensing when they need a little help from me <br/>\nthrough their day and when they need me to leave them alone ? <br/>\n<br/>\nI&#39;m sorry if I&#39;m redundant with my previous message, sorry of being <br/>\nso confused and talkative - but I&#39;m actuallly looking for help :)<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":160045678,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"First days of vacation","postDate":"1152051716","msgId":15336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4ZXBtNCszZmw1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15383,"prevInTime":15335,"nextInTime":15337,"topicId":15336,"numMessagesInTopic":0,"msgSnippet":"School is over and we are on vacation. We have two months before us, now, and in September, if Sylvain doesn t want to go back to school, well, he won t. For","messageBody":"<div id=\"ygrps-yiv-726515566\">School is over and we are on vacation. We have two months before us, <br/>\nnow, and in September, if Sylvain doesn&#39;t want to go back to school, <br/>\nwell, he won&#39;t. <br/>\n<br/>\nFor me, these two months are a bit like a test : let&#39;s see what <br/>\nhappens when I&#39;m left alone all day with my three kids - it has <br/>\nnever happened before : I&#39;ve always worked, at least part-time and <br/>\nmy two elder have spent their week at daycare. I&#39;m on leave since <br/>\nCircé was born, on November, and I&#39;ll go back to University in <br/>\nOctober, two days a week.<br/>\n<br/>\nBut until then, I&#39;ll be with them all day ... and it&#39;s quite <br/>\ndifficult for me. I&#39;m so used to have some time by myself during the <br/>\nday, and I realise that I need it very much - or at least, that I <br/>\ndon&#39;t know yet how to manage without these little moments alone. <br/>\n<br/>\nSo it&#39;s the 3rd day of vacation, and I haven&#39;t done so well yet. At <br/>\ntimes, I simply cannot stand being needed so much ... and I hate <br/>\nmyself for my poor reactions. And of course, I&#39;m quite worried for <br/>\nthe future (though I&#39;m trying not to focus on that, but on the <br/>\nmoment ...)<br/>\n<br/>\nThere is another problem ... how do you do when your energy level is <br/>\ncompletely down ? I let them do quite whatever they want, and at <br/>\nsome point, I feel that I should do something, take them with me <br/>\nsomewhere, initiate a game, whatever, but change the energy of the <br/>\nmoment, because they get bored ... and I can&#39;t. The hot weather <br/>\n(though I know it&#39;s not an excuse) doesn&#39;t help me, because I really <br/>\nhate that, it really gets on my nerves, I know it, I do my best to <br/>\novercome this, but my best isn&#39;t enough sometimes ... so, I said it <br/>\ndoesn&#39;t help, because I don&#39;t want to go out during the afternoon. <br/>\nSo we spend our mornings in our (tiny) garden, then we flow back <br/>\ninside, close everything and wait for the sun to turn - and at five, <br/>\nwe live again. <br/>\n<br/>\nIs there any secret trick to find the energy to do things when you <br/>\njust feel like laying down on the floor ?<br/>\n<br/>\nI guess that living with kids all day when you&#39;re not used to that <br/>\nrythm is, like anything else, an apprenticeship and that, in theory, <br/>\nI&#39;ll do better next week than this one, but I must say that I&#39;m <br/>\nsuddenly feeling a bit frightened : and if I wasn&#39;t able to <br/>\nunschool ? What if I wasn&#39;t &quot;maternal&quot; enough ? I really do love my <br/>\nkids, and I really like spending time with them and watching them <br/>\nspending time together and bringing up things, really ... but I&#39;ve <br/>\nbeen such a poor companion these days ...<br/>\n<br/>\nI hope it is just a phase<br/>\nThanks for reading me anyway<br/>\n<br/>\nHelen, who still reads you and still finds this list very helpful</div>","specialLinks":[]}],"prevTopicId":15405,"nextTopicId":15474}}