{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":279433414,"authorName":"lelania1","from":"&quot;lelania1&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: my two cents about rules/WOW/saying no....etc","postDate":"1168104784","msgId":20317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVub21nZytmNWlxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVub2g2Mys1c3JiQGVHcm91cHMuY29tPg=="},"prevInTopic":20316,"nextInTopic":0,"prevInTime":20316,"nextInTime":20318,"topicId":20306,"numMessagesInTopic":0,"msgSnippet":"... I really liked your post here. I have found in my own life which has included extensive contact with families of many persuasions and children of endless","messageBody":"<div id=\"ygrps-yiv-578295762\"><blockquote><span title=\"ireply\">&gt; Perhaps there&#39;s no absolute-- each child has their own needs and <br/>\n&gt; issues, as does each parent.  <br/>\n<br/>\n </span></blockquote>I really liked your post here. I have found in my own life which has <br/>\nincluded extensive contact with families of many persuasions and <br/>\nchildren of endless variation, that parenting is best accomplished <br/>\nwhen it is responsive to the individual child, and not reactive. And <br/>\nwhen it is responsive to a set of rules, societal norms or idealistic <br/>\nmodels and philosophies more so than to the child himself, I think <br/>\nthat&#39;s a big problem.<br/>\n<br/>\nHow many of us thought judgemental things about families who had a <br/>\nchild that did X or behaved like Y, only to later on have our own <br/>\nchild who did the same things? If only those people were more <br/>\ncontrolling. If only they were less controlling. It really never <br/>\nends. I remember a woman in my midwifery apprenticeship long ago <br/>\nwhose baby just didn&#39;t seem right to her, and everyone blamed her and <br/>\nher husband, after first denying anything was wrong. People asserted <br/>\nhe was off because she had projected it onto him. Because their <br/>\nmarriage ended (it ended more from the stress of the parenting <br/>\nactually)Turns out, he is autistic, and now several more families <br/>\nhave had children with various neurological issues and that community <br/>\nhas had to really look at their perceptions and judgments. <br/>\n<br/>\nI don&#39;t have absolutely factual information about much of what I need <br/>\nto make decisions on in my life, including parenting. Accepting this <br/>\nhas been a relief in a lot of ways. I accept that I will handle <br/>\nthings poorly sometimes, and that I will make the best decision I can <br/>\nand it will still turn out poorly sometimes. I remember when I was <br/>\nearlier on in my midwifery career and realized that the death of a <br/>\nbaby was an inevitability. No matter how hard I tried and how good a <br/>\nmidwife I was, if I did a lot of births in all likelihood a baby I <br/>\nwas involved with would die. The anticipation of this was papralyzing <br/>\nsometimes. I just didn&#39;t want it to ever ever happen. I wanted to do <br/>\neverything right, never make a mistake, and knowing I was human and <br/>\ncould screw up was so frustrating. Knowing I could not screw up and a <br/>\nbaby could still die was also frustrating. And then it happened. It <br/>\nwas horrible, it was no ones fault, it was life. It just was.  I <br/>\nrecognized somewhere in there that all I could do was really think <br/>\nabout my choices, and make the decisions that my intuition and head- <br/>\nheart combo guided me to make. This has become true of my life <br/>\noutside my job. And it really applies to parenting for me.<br/>\n<br/>\nI use the word &quot;no&quot; very rarely. I always look for a way to frame my <br/>\nresponse positively. I find this more honest actually. Because the <br/>\ntrue answer isn&#39;t usually &quot;no&quot;, its &quot;yes, but later on&quot;, &quot;Yes, if we <br/>\ndo it like this&quot;, &quot;yes, if I help you with this part&quot; and &quot;yes <br/>\nwhatever.&quot; The knee jerk preface &quot;NO&quot; before the further explination <br/>\nto the child is so ubiquitous, and so unexamined. I hear it all the <br/>\ntime. It takes some retraining to stop no-ing kids when the answer is <br/>\nactually more complex than &quot;NO&quot;. It also makes the &quot;NO&quot; way more <br/>\neffective when you need a child to stop moving toward a rattlesnack.<br/>\n<br/>\nI worked in a health clinic for years as a counselor. I ran a lot of <br/>\nHIV tests, pregnancy tests, did STD screening and counseling and much <br/>\nof it for teenagers. Their parents weren&#39;t there, because their <br/>\nparents had made the message clear: If you screw up, I won&#39;t love <br/>\nyou. And the kids heard that message loud and clear and believed it. <br/>\nThe ways in which parents use terror, fear, conditional love and <br/>\nthreats to try and control their childrens sexuality are shocking to <br/>\nme. Do you really want to be the last person to know about your <br/>\nchilds pregnancy? Do you really want your child managing a serious <br/>\nhealth problem or STD all alone with adult strangers to help them? <br/>\nBecause if you use these tactics, that&#39;s what some of you will get.<br/>\n<br/>\nIt strikes me, that most of the unschooled teens I know are pretty <br/>\ngeeky sexually. Meaning, they aren&#39;t actually doing it. I know a lot <br/>\nof teen and adult unschooled kids, and the vast majority (I mean, <br/>\n99%) never had sex til they were adults. I can&#39;t say that of ANY of <br/>\nthe kids I went to school with. I think its because their parental <br/>\nrelationships are fulfilling enough that they don&#39;t have to look <br/>\nelsewhere to try and meet those emotional needs or validate their <br/>\nself worth. Adults have this bizarre mythology sometimes that if they <br/>\njust tell their kids not to have sex, or threaten them with death and <br/>\nhomelessness then they just won&#39;t do these things. Yet statistics <br/>\nkeep telling us it isn&#39;t true. They do these things MORE often, they <br/>\ndo them LESS safely, and they do it while hiding it as best they can <br/>\nfrom their parents.<br/>\nThe other approach you can have is unconditional love for your child. <br/>\nSending the message consistently, thoroughly and with respect to <br/>\neverything, that your child is your heart, and nothing ever will <br/>\nchange that. That they can do anything and tell you about it and you <br/>\nwill love them and help them as best you can. That they will not be <br/>\npunished, or rejected, ever by you. You can&#39;t protect them from the <br/>\ntruly natural consequences of the world, or from the consequences <br/>\nsocietally imposed, but it won&#39;t affect your love of them and their <br/>\nplace in their family.<br/>\nI feel like it isn&#39;t enough just to say this stuff in a big lecture <br/>\nformat, it takes consistent behavior that really says this to them <br/>\nwith action from birth onward. <br/>\ncarrie</div>","specialLinks":[]},{"userId":269365084,"authorName":"Donna Brown","from":"Donna Brown &lt;trinityneli@...&gt;","profile":"sayonlyalittlebutsayitwell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] my two cents about rules/WOW/saying no....etc","postDate":"1168104668","msgId":20316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwMTA2MTczMTA4LjY4Mjc4LnFtYWlsQHdlYjM4NjAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":20306,"nextInTopic":20317,"prevInTime":20315,"nextInTime":20317,"topicId":20306,"numMessagesInTopic":0,"msgSnippet":"I appreciate the individual respect unschooling has at the heart of it s philosphy.  This reply seems to take that into account.  We nuture and allow our","messageBody":"<div id=\"ygrps-yiv-1948657934\">I appreciate the individual respect unschooling has at the heart of it&#39;s philosphy.  This reply seems to take that into account.  We nuture and allow our families the freedom to chose; to be whatever they need in whatever enviroment is best.  We are the only ones who can recognize the needs and work toward the healthiest life possible for our families. <br/>\nThanks for the contribution. <br/>\n<br/>\n----- Original Message ----<br/>\nFrom: lpodietz &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lpodietz@...\">lpodietz@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Saturday, January 6, 2007 11:02:11 AM<br/>\nSubject: [unschoolingbasics] my two cents about rules/WOW/saying no....etc<br/>\n<br/>\nI&#39;ve been lurking around, reading the various postings that have <br/>\ncome up lately, and I guess I want to add my two cents on the topic <br/>\nof rules/limits/ yes/no/maybe. ....<br/>\n<br/>\nPerhaps there&#39;s no absolute-- each child has their own needs and <br/>\nissues, as does each parent. As my husband said last night when we <br/>\nwere discussing this, it&#39;s all relative. In one situation, no <br/>\nlimits is an expression of total trust and love, and the <br/>\nchild &quot;gets&quot; that (even if they wish their parents had said &quot;no&quot; <br/>\nmore often, as we heard from an unschooled person). In another <br/>\nsituation, no limits is perceived as neglect and the child feels <br/>\nunloved and insignificant, wishing their parents cared enough to say <br/>\nno occasionally. And few of us are in a utopic situation; demands <br/>\nlike work, chores, perhaps aging parents, illnesses, or <br/>\nother challenges present themselves and we need to adjust to meet <br/>\nthese challenges.<br/>\n<br/>\nFor one child playing WOW all day may be an expression of passion <br/>\nand determination, for another it may be a fearful escape from <br/>\nhaving to deal with the real world, which may be a painful or scary <br/>\nplace for them to be... <br/>\n<br/>\nLife is a work in progress, and anyone who thinks that they have the <br/>\none and only answer, and because it works for them it will work for <br/>\neveryone, is taking a narrow and unrealistic view in my opinion... I <br/>\nthink we each have to follow our gut, be sensitive to and respectful <br/>\nof those around us...easier said than done...!<br/>\n<br/>\nFor instance, school definitely works for our 11th grade daughter---<br/>\nnobody needs <br/>\nto feel sorry for her because she does not have the freedom of an <br/>\nunschooled life. On the other hand, school was a living hell for our <br/>\n14 yo son and when he crashed last spring, he left and never went <br/>\nback. This turned our world, our expectations, our assumptions, our <br/>\nthinking, upside down.<br/>\n<br/>\nSo from where I&#39;m sitting, the only absolute is our love for our <br/>\nfamilies, the rest is an open question... and we each have to try to <br/>\ndetermine for ourselves what is best, given the circumstances that <br/>\npresent themselves. We make mistakes, we try a different approach, <br/>\nwe stay open, we communicate. .. definitely more shades of gray than <br/>\nblack and white.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":63209806,"authorName":"lpodietz","from":"&quot;lpodietz&quot; &lt;lpodietz@...&gt;","profile":"lpodietz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"my two cents about rules/WOW/saying no....etc","postDate":"1168099331","msgId":20306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVub2g2Mys1c3JiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20316,"prevInTime":20305,"nextInTime":20307,"topicId":20306,"numMessagesInTopic":0,"msgSnippet":"I ve been lurking around, reading the various postings that have come up lately, and I guess I want to add my two cents on the topic of","messageBody":"<div id=\"ygrps-yiv-1750330386\">I&#39;ve been lurking around, reading the various postings that have <br/>\ncome up lately, and I guess I want to add my two cents on the topic <br/>\nof rules/limits/yes/no/maybe.....<br/>\n<br/>\nPerhaps there&#39;s no absolute-- each child has their own needs and <br/>\nissues, as does each parent.  As my husband said last night when we <br/>\nwere discussing this, it&#39;s all relative.  In one situation, no <br/>\nlimits is an expression of total trust and love, and the <br/>\nchild &quot;gets&quot; that (even if they wish their parents had said &quot;no&quot; <br/>\nmore often, as we heard from an unschooled person).  In another <br/>\nsituation, no limits is perceived as neglect and the child feels <br/>\nunloved and insignificant, wishing their parents cared enough to say <br/>\nno occasionally.  And few of us are in a utopic situation; demands <br/>\nlike work, chores, perhaps aging parents, illnesses, or <br/>\nother challenges present themselves and we need to adjust to meet <br/>\nthese challenges.<br/>\n<br/>\nFor one child playing WOW all day may be an expression of passion <br/>\nand determination, for another it may be a fearful escape from <br/>\nhaving to deal with the real world, which may be a painful or scary <br/>\nplace for them to be... <br/>\n<br/>\nLife is a work in progress, and anyone who thinks that they have the <br/>\none and only answer, and because it works for them it will work for <br/>\neveryone, is taking a narrow and unrealistic view in my opinion... I <br/>\nthink we each have to follow our gut, be sensitive to and respectful <br/>\nof those around us...easier said than done...!<br/>\n<br/>\nFor instance, school definitely works for our 11th grade daughter---<br/>\nnobody needs <br/>\nto feel sorry for her because she does not have the freedom of an <br/>\nunschooled life. On the other hand, school was a living hell for our <br/>\n14 yo son and when he crashed last spring, he left and never went <br/>\nback. This turned our world, our expectations, our assumptions, our <br/>\nthinking, upside down.<br/>\n<br/>\nSo from where I&#39;m sitting, the only absolute is our love for our <br/>\nfamilies, the rest is an open question... and we each have to try to <br/>\ndetermine for ourselves what is best, given the circumstances that <br/>\npresent themselves.  We make mistakes, we try a different approach, <br/>\nwe stay open, we communicate... definitely more shades of gray than <br/>\nblack and white.</div>","specialLinks":[]}],"prevTopicId":20249,"nextTopicId":20260}}