{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling workbooks","postDate":"1181239056","msgId":24200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0OWd1Zys5bHB0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0N3M5bCs0ZHJzQGVHcm91cHMuY29tPg=="},"prevInTopic":24199,"nextInTopic":0,"prevInTime":24199,"nextInTime":24201,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"I just wanted to chime in on this conversation, for two reasons. One being Emily, and the other being Josh. Emily is a girl who loves workbooks of any kind.","messageBody":"<div id=\"ygrps-yiv-1187893425\">I just wanted to chime in on this conversation, for two reasons. One being Emily, and the <br/>\nother being Josh.<br/>\n<br/>\nEmily is a girl who loves workbooks of any kind. She&#39;ll pick up a math workbook at <br/>\nwalmart just like I&#39;d pick up a crossword or sudoku. It&#39;s fun for her, and she enjoys it. Her <br/>\nfavorite are the &#39;everything&#39; series from some publishing company, they have one for each <br/>\ngrade, and she picks and chooses what to do. Sometimes the writing prompts are funny <br/>\nand kickstart another video with their Tom and Bill characters. Sometimes it&#39;s geography <br/>\nand she gets online to google about a country. Mostly it&#39;s math because math is fun to <br/>\nher, like a puzzle.<br/>\n<br/>\nJosh did workbooks for a while. The difference between the way he did them and the way <br/>\nEmily does them was astounding. Josh was still under the impression that written work <br/>\nproves intelligence, after five years of school, it was pretty engrained. He did choose to do <br/>\nthem, but only because workbooks are what kids do. He enjoyed them because it was to <br/>\nhim, a measure of intelligence, and he couldn&#39;t let go that there were other ways of being <br/>\nsmart. It wasn&#39;t until I had a dream that he and I were standing over a cliff with a garbage <br/>\nlot full of textbooks that I realized how much it was damaging him. In my dream, I gave <br/>\nhim permission to throw his algebra off the cliff, and he just started crying. That morning I <br/>\ntold him my dream, and I asked him what he thought it meant. It was a lovely <br/>\nconversation, and I basically asked him not to do workbooks for a while. i asked him if he <br/>\nwanted to throw them away, and he gave them all to Emily ;-) He did keep his algebra <br/>\nbook, just in case. A few months later after watching South Park he got it out to check <br/>\nsomething the characters were talking about, and finished the entire subject in a matter of <br/>\nmonths. <br/>\n<br/>\nI would never say a family should or should not use workbooks, but I would always ask <br/>\nthem to look closely at underlying assumptions of why the workbooks are there. We <br/>\nobviously have kids who go both ways. <br/>\n<br/>\nMelissa<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Becca and Sarai&quot; <br/>\n&lt;angel_eyes_becca_and_hannah@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;He has choose to do workbooks...  He <br/>\n&gt; actually loves them believe it or not.  Its his choice when he does it <br/>\n&gt; and I dont tell him how much to do he just goes and does it when he <br/>\n&gt; wants too.  Its amazing how he does it.  &gt; </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: unschooling (Ren)","postDate":"1181236877","msgId":24199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2N0YyN0UzLTYzMzUtNEI1Ni04MDhFLThCRDRDQTYyQjlDREBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY0N3M5bCs0ZHJzQGVHcm91cHMuY29tPg==","referencesHeader":"PGY0N3M5bCs0ZHJzQGVHcm91cHMuY29tPg=="},"prevInTopic":24195,"nextInTopic":24200,"prevInTime":24198,"nextInTime":24200,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"... If it were a video game or a comic book or an action figure, would you say with the same conviction of course Im going to get it if I can ? Those are the","messageBody":"<div id=\"ygrps-yiv-1283689813\">On Jun 6, 2007, at 10:59 PM, Becca and Sarai wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but he is the one that goes to the store and says<br/>\n&gt; mom can I get this and of course Im going to get it if I can<br/>\n<br/>\n </span></blockquote>If it were a video game or a comic book or an action figure, would  <br/>\nyou say with the same conviction &quot;of course Im going to get it if I  <br/>\ncan&quot;?<br/>\n<br/>\nThose are the areas of ourselves it&#39;s useful to take out and examine.<br/>\n<br/>\nIt can be comforting for moms who aren&#39;t entirely sold on unschooling  <br/>\nto have a child who does enjoy workbooks or things that feel like  <br/>\nsomething that resembles school. It&#39;s good to examine our own  <br/>\nfeelings to see if we&#39;d be as relieved if they were choosing IMing  <br/>\nwith friends  or cartoons or skateboarding as often and instead of  <br/>\nthe workbooks. Would we be as comfortable and pleased?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198317027,"authorName":"Becca and Sarai","from":"&quot;Becca and Sarai&quot; &lt;angel_eyes_becca_and_hannah@...&gt;","profile":"angeleyesgroup","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling (Ren)","postDate":"1181185141","msgId":24195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0N3M5bCs0ZHJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0N2NwNCs4aHFlQGVHcm91cHMuY29tPg=="},"prevInTopic":24191,"nextInTopic":24199,"prevInTime":24194,"nextInTime":24196,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"How about giving him the choice to never touch another workbook again? Actually Ren it is his choice.  He has choose to do workbooks...  He actually loves them","messageBody":"<div id=\"ygrps-yiv-394197992\">How about giving him the choice to never touch another workbook again?<br/>\n<br/>\n<br/>\nActually Ren it is his choice.  He has choose to do workbooks...  He <br/>\nactually loves them believe it or not.  Its his choice when he does it <br/>\nand I dont tell him how much to do he just goes and does it when he <br/>\nwants too.  Its amazing how he does it.  He actually does more on his <br/>\nown then if I was to try to set a limit and tell him to do so much in <br/>\na day thats what I was getting at.  But it is his choice what he does <br/>\nand when he does it.  Math is actually easy for him he has always <br/>\nloved to work with numbers.  It just depends on his moods what he does <br/>\nif its a game or a workbook that he decides to pick up and do and who <br/>\nbuys them will I do but he is the one that goes to the store and says <br/>\nmom can I get this and of course Im going to get it if I can.... <br/>\n<br/>\nBecca</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling","postDate":"1181169252","msgId":24191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0N2NwNCs4aHFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg3OTMzLjkxNTAxLnFtQHdlYjMxNDEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":24190,"nextInTopic":24195,"prevInTime":24190,"nextInTime":24192,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"~~As long as it is his choice he is a lot better~~ How about giving him the choice to never touch another workbook again? How about playing and connecting with","messageBody":"<div id=\"ygrps-yiv-1923461365\">~~As long as it is his choice he is a lot better~~<br/>\n<br/>\nHow about giving him the choice to never touch another workbook again?<br/>\nHow about playing and connecting with whatever he chooses, even if it<br/>\ndoesn&#39;t look like learning to you?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":198317027,"authorName":"Becca","from":"Becca &lt;angel_eyes_becca_and_hannah@...&gt;","profile":"angeleyesgroup","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling","postDate":"1181166109","msgId":24189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3OTMzLjkxNTAxLnFtQHdlYjMxNDEyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEJBWTEyMS1EQVYxMUJCQTRGOTZCOTNEOTEwRTVBMDRBRkEyNzBAcGh4LmdibD4="},"prevInTopic":24187,"nextInTopic":24190,"prevInTime":24188,"nextInTime":24190,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"Hi Kara I guess Ill start on this as I have a child that was totally agaisnt structure thats how we started unschooling...  He is 8 now and when I tried to","messageBody":"<div id=\"ygrps-yiv-112400382\">Hi Kara I guess Ill start on this as I have a child that was totally agaisnt structure thats how we started unschooling...  He is 8 now and when I tried to force him to do school work he would find away to get upstairs and out the door and run off down the street.  Constantly had the neighbors turning me into SRS for homeschooling my kids.  He would do the work it was just at his own time that he choose to do it.  So I became more laxed and told him when he was ready he could pick it up and do whatever.....  Needless to say it stopped the temper tandtrums, the running off down the street, the disrubtiviness in (class time) the attitude and all.  I have a totally different child.  He yes still has his mood swings at times but they are at least bearable and we can sit down and work through it.......   I do have available workbooks that they can pick up at anytime and do.  Its not a forced thing here but they do have them available....  I have seen him numourous times go and<br/>\n pick up a Math workbook and do 40 pages in 1 day.  He may not pick it up for 2 or 3 weeks again and then he may pick it up the next day I have seen both happen here...  As long as it is his choice he is a lot better.  He loves hands on activities also so last year around Thanksgiving we decided to talk about Indians as we were doing a theme dinner.  we got books from the library on different types of Indians.  My kids choose a branch of indians they wanted to learn more about each one picked a different branch.  They made one of the foods they ate and also built a house.  It was awesome as I would sit back and watch and they were telling the others about their choice of Indians.  It was a history lesson in itsself, and the fun thing was they were telling their Dad and myself all about thier tribe and to make it neater they still talk about it and want to do it again and are talking of doing it a lot bigger....  I hope this helps feel free to ask more as there is so much<br/>\n more I have seen with my kids....  If they want to learn about something they are going to do it on their own a lot better then me shoving it down them and they will remeber it cause it is something they want to learn about....<br/>\n   <br/>\n  Becca<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nGet the free Yahoo! toolbar and rest assured with the added security of spyware protection. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling","postDate":"1181164869","msgId":24190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MDA4NS45MTIwMC5xbUB3ZWIzMTkxMC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEJBWTEyMS1EQVYxMUJCQTRGOTZCOTNEOTEwRTVBMDRBRkEyNzBAcGh4LmdibD4="},"prevInTopic":24189,"nextInTopic":24191,"prevInTime":24189,"nextInTime":24191,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"my only concern is my kids are 14 12 and 3 my older two hate reading and are not even willing to try to learn my 14 year old is so so at reading my 12 year old","messageBody":"<div id=\"ygrps-yiv-1875427895\">my only concern is my kids are 14 12 and 3 my older two hate reading and are not even willing to try to learn my 14 year old is so so at reading my 12 year old for get it she hates it she is ADHD and dyslexic so I have to take that in to consideration I am just a little nervous about doing away with the structure of schooling &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n   <br/>\n  Insanity.......doing the same thing over and over and expecting different results.<br/>\n   <br/>\n  Do you think buckling down more and making them practice more will make them like reading more or even make them better at it?<br/>\n   <br/>\n  Do you think that reading is the only way to learn about something?<br/>\n   <br/>\n   <br/>\n   <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nFood fight? Enjoy some healthy debate<br/>\nin the Yahoo! Answers Food & Drink Q&A.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238249531,"authorName":"KARA CASSIDY","from":"&quot;KARA CASSIDY&quot; &lt;dachac3@...&gt;","profile":"dachac3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling","postDate":"1181161793","msgId":24187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEyMS1EQVYxMUJCQTRGOTZCOTNEOTEwRTVBMDRBRkEyNzBAcGh4LmdibD4="},"prevInTopic":17163,"nextInTopic":24189,"prevInTime":24186,"nextInTime":24188,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"How do you unschool well I guess what I am trying to say is I have gone from homeschooling to unschooling I have done away with lesson plans and schedules and","messageBody":"<div id=\"ygrps-yiv-1401610107\">How do you unschool well I guess what I am trying to say is I have gone from homeschooling to unschooling I have done away with lesson plans and schedules and I am going with what ever the kids are interested in my family was not happy with homeschooling so they are really not happy with unschooling my only concern is my kids are 14 12 and 3 my older two hate reading and are not even willing to try to learn my 14 year old is so so at reading my 12 year old for get it she hates it she is ADHD and dyslexic so I have to take that in to consideration I am just a little nervous about doing away with the structure of schooling has any one else had these feelings and how did you go from work books to trusting in the unschooling approach?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling","postDate":"1157943175","msgId":17163,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA5MTAxOTUyczU3YTI1YTQ2eWQ1YTgxZTg0NWZjMGEyYzhAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDIwMDYwOTEwMjExMTM1Ljk1Ny5xbWFpbEB3ZWI1ODMxNC5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDIwMDYwOTEwMjExMTM1Ljk1Ny5xbWFpbEB3ZWI1ODMxNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":17160,"nextInTopic":24187,"prevInTime":17162,"nextInTime":17164,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"... Why are you loyal to something that is not working for you?  Also you don t need a cover school now that he is 16 as he is beyond the age of mandatory ","messageBody":"<div id=\"ygrps-yiv-38067769\">On 9/10/06, Toney , Cynthia Hammontree &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ushamntres@...\">ushamntres@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thanks for the reply ladies. I hate to change cover schools because I&#39;ve<br/>\n&gt; been with this school every since we started homeschooling, 9 yrs. ago.<br/>\n<br/>\n<br/>\n </span></blockquote>Why are you loyal to something that is not working for you?  Also you don&#39;t<br/>\nneed a cover school now that he is 16 as he is beyond the age of mandatory<br/>\nattendance.<br/>\n<br/>\n I also hate to see my son not be able to graduate just because he can&#39;t do<br/>\n<blockquote><span title=\"ireply\"> &gt; testing after we have spent so many years of schooling. He wants to graduate<br/>\n&gt; so he can be finished with school. He has no desire of going to college. He<br/>\n&gt; just wants to get out there and work, he does this everyday. He has just<br/>\n&gt; turned 17 years old, he doesn&#39;t want to quit school, he wants to graduate.<br/>\n&gt; The bad thing about the test is that he remembers doing all the things that<br/>\n&gt; are on the test last year and the year before.<br/>\n&gt;<br/>\n </span></blockquote>Did you know he can &quot;graduate&quot; by printing him out a &quot;diploma&quot; on the<br/>\ncomputer?  There is no &quot;finishing&quot; in unschooling.  This is lifelong<br/>\nlearning.  We don&#39;t quit learning just because we have reached a certain age<br/>\nor completed a certain course work.  And just because he manages to struggle<br/>\nthrough a checklist of &quot;needs to be completed&quot; doesn&#39;t mean that he has<br/>\nlearned anything from that.  What is it that he wants to do?  What is his<br/>\npassion? What kind of work interests him? What does he need to do in order<br/>\nto do that kind of work?  *That* is what is important, not this piece of<br/>\npaper.  No employer is ever going to ask to see his diploma.  I&#39;ve never had<br/>\none ask to see mine.  When he fills out an application and it asks for<br/>\n&quot;Education History&quot; he can say that he &quot;completed&quot; his homeschool<br/>\neducation.  Getting this diploma is not going to help him get a job.  He&#39;d<br/>\nprobably get more positive feed-back by filling out the subjects that he has<br/>\nstudied that are relevant to the job he is applying for.<br/>\n<br/>\nI would really encourage you to read some of the articles and links from<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com\">http://www.sandradodd.com</a> and to check out the book The Teenage Liberation<br/>\nHandbook (for both your son *and* you). It will give you both a totally<br/>\ndifferent view of what unschooling is about and the &quot;finishing&quot; of school.<br/>\nThere are so many times that I look back at my high school education and<br/>\nwished I had just &quot;skimmed through&quot; rather than challenged myself and taken<br/>\nthe classes that I really wanted to take rather than the classes that I felt<br/>\nI needed to take.<br/>\n<br/>\nMichelle<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":233219230,"authorName":"Homeschlfor2@aol.com","from":"Homeschlfor2@...","profile":"chrissysspoiled","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling","postDate":"1157932449","msgId":17160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJkOS40ZWNkNWYwMC4zMjM1ZmZhMUBhb2wuY29tPg=="},"prevInTopic":17159,"nextInTopic":17163,"prevInTime":17159,"nextInTime":17161,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/10/2006 6:07:27 PM Central Daylight Time, ushamntres@yahoo.com writes: The  bad thing about the test is that he remembers doing all the","messageBody":"<div id=\"ygrps-yiv-1109315213\">In a message dated 9/10/2006 6:07:27 PM Central Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ushamntres@...\">ushamntres@...</a> writes:<br/>\n<br/>\nThe  bad thing about the test is that he remembers doing all the things that <br/>\nare on  the test last year and the year before. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nJust curious  but who gives the test?  If its something you  give at home <br/>\ncant you &quot;help&quot; him?  Maybe give the questions orally or  somehow modify it for <br/>\nhis success?<br/>\n <br/>\nChrissy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":38011408,"authorName":"Toney , Cynthia Hammontree","from":"&quot;Toney , Cynthia Hammontree&quot; &lt;ushamntres@...&gt;","profile":"ushamntres","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling","postDate":"1157922695","msgId":17159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwOTEwMjExMTM1Ljk1Ny5xbWFpbEB3ZWI1ODMxNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":17160,"prevInTime":17158,"nextInTime":17160,"topicId":17159,"numMessagesInTopic":0,"msgSnippet":"Thanks for the reply ladies. I hate to change cover schools because I ve been with this school every since we started homeschooling, 9 yrs. ago. I also hate to","messageBody":"<div id=\"ygrps-yiv-101230301\">Thanks for the reply ladies. I hate to change cover schools because I&#39;ve been with this school every since we started homeschooling, 9 yrs. ago. I also hate to see my son not be able to graduate just because he can&#39;t do testing after we have spent so many years of schooling. He wants to graduate so he can be finished with school. He has no desire of going to college. He just wants to get out there and work, he does this everyday. He has just turned 17 years old, he doesn&#39;t want to quit school, he wants to graduate. The bad thing about the test is that he remembers doing all the things that are on the test last year and the year before. <br/>\n  We done a little unschooling last year for the 2nd half of the year. <br/>\n  Blessings to all, Cynthia<br/>\n<br/>\n \t\t<br/>\n---------------------------------<br/>\nHow low will we go? Check out Yahoo! Messengers low  PC-to-Phone call rates.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":24197,"nextTopicId":24172}}