{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: handling young sibling dramas","postDate":"1185114504","msgId":25091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3dnBpOCtpbDFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU0RjE1NkI0LTI3ODYtNDM4OC05MjRELUMwMTY2NjIzQkM2QkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":25072,"nextInTopic":0,"prevInTime":25090,"nextInTime":25092,"topicId":25060,"numMessagesInTopic":0,"msgSnippet":"My older kids love to tell the share story at our house.... when they were all little.. I had 3 kids in 5 yrs there was the constant wrangling for the much","messageBody":"<div id=\"ygrps-yiv-343915705\">My older kids love to tell the &quot;share story&quot; at our house.... when<br/>\nthey were all little.. I had 3 kids in 5 yrs there was the constant<br/>\nwrangling for the much coveted toy of the moment.   My rule has always<br/>\nbeen that I do not intervene by awarding one child the toy when they<br/>\nargue or tussle over something... I suggest possible solutions but I<br/>\nhave always felt that I can&#39;t really get involved in a sibling dispute<br/>\nwithout choosing sides (at least in appearance to the child who feels<br/>\nthey lost!)  so I work towards meeting everyone&#39;s needs by suggesting<br/>\nsolutions (no swooping in and taking the toy and announcing NOW NO ONE<br/>\nhas it! like my sister in law was fond of doing to her kids!)  If one<br/>\ntoy is always the favorite I buy one for each kid... it&#39;s just<br/>\ntorturing them otherwise!   Anyway my kids worked out for themselves<br/>\nthat when they were playing if they wanted to switch toys they would<br/>\ncall out &quot;share&quot; and everyone would trade.    My then 4 yr old mostly<br/>\nnon verbal child with autism would shriek &quot;SHARE&quot;  which meant she<br/>\nwanted it ALL! HA!   She would chase down the other two yelling SHARE<br/>\nand practically tackle them and wrest away the toy she wanted totally<br/>\nmissing the &quot;trading&quot; part of the equation!   They were good natured<br/>\nabout it even as wee ones because they knew she didn&#39;t understand that<br/>\npart of the game. Even now when they want all of something they will<br/>\ncall out &quot;SHARE!&quot; in the same little squeaky voice their sister had at<br/>\nthat age and then crack up in evil laughter!  <br/>\nLisa Blocker</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: handling young sibling dramas","postDate":"1184975661","msgId":25072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3cmh2ZCt1YThiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY3b243aitqODZqQGVHcm91cHMuY29tPg=="},"prevInTopic":25060,"nextInTopic":25091,"prevInTime":25071,"nextInTime":25073,"topicId":25060,"numMessagesInTopic":0,"msgSnippet":"... Being proactive is really helpful, here - and ounce of prevention, as they say. Be right there with them - down on the floor and everything. Then you have","messageBody":"<div id=\"ygrps-yiv-1599263399\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elly&quot; &lt;elly@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; how do you handle snatching without ever removing the toy <br/>\n&gt; from the snatcher&#39;s hands? <br/>\n<br/>\n </span></blockquote>Being proactive is really helpful, here - and ounce of prevention, <br/>\nas they say. Be right there with them - down on the floor and <br/>\neverything. Then you have a better chance to see the moment coming <br/>\nand help them *ask* for what they want.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; if it were just about not punishing the snatcher, it&#39;d be one <br/>\n&gt; thing, but it clearly (in our family) teaches the snatchee to <br/>\n&gt;snatch;<br/>\n<br/>\n </span></blockquote>You have two very young kids who may not have the best <br/>\ncommunications skills in the world, yet. Grabbing something is an <br/>\neasy way to get what they want - its not necessarily a matter <br/>\nof &quot;teaching&quot;. If the goal is &quot;get x&quot; snatching works. <br/>\n<br/>\nSo the key is to help them communicate - help them discover more <br/>\ntools, more ways of getting needs met, so they don&#39;t need to default <br/>\nto snatching. At their ages, alot of that is going to come from <br/>\nmodelling, rather than showing or explaining. Once again, being <br/>\nright there in the middle of things is going to be your best <br/>\nstrategy - even when things are running smoothly! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and anyways, there&#39;s no <br/>\n&gt; reason for the snatchee to be punished (by having his/her toy <br/>\n </span></blockquote>removed) just because the <br/>\n<blockquote><span title=\"ireply\"> &gt; other kiddo wants to snatch.<br/>\n<br/>\n </span></blockquote>Part of moving away from punishment involves moving away from <br/>\nasigning the lables of &quot;punishment&quot; and &quot;reward&quot; to random acts and <br/>\nevents. If your dh unthinkingly leaves the seat up, is he punishing <br/>\nyou? No, but you&#39;re probably irritated anyway. See the grabbing as a <br/>\nbit thoughtless, a less-than-stellar means of communication, but not <br/>\nintentionally unkind. <br/>\n<br/>\nIt may be the snatchee will be happy with some other toy, especially <br/>\nthe little one, or that some other solution can be reached. <br/>\nDepending on what&#39;s being snatched, maybe you just need duplicates <br/>\nof some favorite toys. Or maybe you can have some special items <br/>\nstashed away for moments when both kids want the same toy - bubbles <br/>\nare a good quick-fix for some kids. Whipped cream. You just need to <br/>\nbreak the tension.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes she&#39;s &quot;inspired&quot; by ds to be &quot;little&quot;. and <br/>\n&gt; sometimes they&#39;re so hysterical together that she won&#39;t listen to <br/>\n </span></blockquote>me. which is fine until he <br/>\n<blockquote><span title=\"ireply\"> &gt; gets clobbered in the head with something hard, for the umpteenth <br/>\n </span></blockquote>time. how do you <br/>\n<blockquote><span title=\"ireply\"> &gt; handle these not-quite-safety issues with little kids? <br/>\n<br/>\n </span></blockquote>She *is* little. Four is little. I have a 13yo and sometimes I have <br/>\nto remind myself how young that really is. At the risk of sounding <br/>\nrepetitive, being right there with them helps to stop these kinds of <br/>\nsituations from starting in the first place. Encouraging kids to <br/>\ncommunicate with one another, and filling in meaning for them when <br/>\nthey are struggling for words, helps them have more skills to <br/>\ndiffuse these kinds of things themselves, over time. Sometimes kids <br/>\nneed seemingly obvious pieces of information, like &quot;ouch means I <br/>\ndon&#39;t like that&quot;. <br/>\n<br/>\nI&#39;ve found it helpful to have a word or phrase that I can use <br/>\nquickly in over-the-top moments - in our house its &quot;stop&quot; <br/>\nand/or &quot;stop means stop&quot;. Danielle&#39;s is nicer, she uses &quot;No thank <br/>\nyou&quot;. With very little kids, using a firm tone - not necessarily <br/>\nloud or angry, but firm - can work wonders. Kids who are <br/>\noverstimulated seem to take a few extra seconds to process actual <br/>\nwords sometimes, so tone is important. Also important is using <br/>\nyour &quot;quicky phrase&quot; in less over-the-top moments, so you can <br/>\nencourage them to say it to each other. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; is there any more gentle way to handle these things?<br/>\n<br/>\n </span></blockquote>When all else fails and you find yourself physically separating your <br/>\nkids, appologise. Appologise in the moment if you think anyone will <br/>\nhear it, but absolutely appologise after the fact, when they and you <br/>\nhave calmed down. Let them know that you didn&#39;t know what else to do <br/>\nto keep them from getting hurt. With your 4yo, you can then ask for <br/>\nsuggestions and do some brainstorming for the future. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":187564736,"authorName":"Elly","from":"&quot;Elly&quot; &lt;elly@...&gt;","profile":"ellyzoe1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"handling young sibling dramas","postDate":"1184882739","msgId":25060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3b243aitqODZqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25072,"prevInTime":25059,"nextInTime":25061,"topicId":25060,"numMessagesInTopic":0,"msgSnippet":"hi all, i joined a few weeks ago and have really enjoyed reading all this; had no idea there was this whole world of whole life unschooling out there; i","messageBody":"<div id=\"ygrps-yiv-1216040251\">hi all,<br/>\n<br/>\ni joined a few weeks ago and have really enjoyed reading all this; had no idea there was <br/>\nthis whole world of &quot;whole life&quot; unschooling out there; i thought i was joining a schooling-<br/>\nrelated unschooling list, if you know what i mean!<br/>\n<br/>\ni&#39;ve got two kids; dd is a few months from 4 and ds has just turned 1. they LOVE each <br/>\nother. and i mean LOOOVE. but of course sometimes we have toy snatching, exploratory <br/>\nhitting, play that&#39;s fun for one person but not for others (tackling, body holding, etc). so <br/>\nfar, we have ended the inappropriate behaviors on both sides physically when talking <br/>\ndidn&#39;t work (this usually involves pulling a grasping dd off of a crying ds, who HATES <br/>\nhaving his body physically restrained, even if it&#39;s in one of dd&#39;s pretend games). we&#39;ve <br/>\ntalked and talked to her about why these things are no fun for him, and noted that he&#39;s <br/>\ncrying etc, and often she&#39;ll let go herself, but sometimes we still have to pull her off him, <br/>\nand sometimes there are incidents in which she&#39;s hit him and then run off, or look at us; <br/>\nseemingly for no reason at all (as far as we know, all needs are met, etc).<br/>\n<br/>\nSO, here are my questions. how do you handle snatching without ever removing the toy <br/>\nfrom the snatcher&#39;s hands? if it were just about not punishing the snatcher, it&#39;d be one <br/>\nthing, but it clearly (in our family) teaches the snatchee to snatch; and anyways, there&#39;s no <br/>\nreason for the snatchee to be punished (by having his/her toy removed) just because the <br/>\nother kiddo wants to snatch. i love lots of the things i&#39;ve read here and elsewhere, but <br/>\nmost are aimed towards older kids. dd is getting to an age where she can discuss things <br/>\nrationally (well, sometimes), but sometimes she&#39;s &quot;inspired&quot; by ds to be &quot;little&quot;. and <br/>\nsometimes they&#39;re so hysterical together that she won&#39;t listen to me. which is fine until he <br/>\ngets clobbered in the head with something hard, for the umpteenth time. how do you <br/>\nhandle these not-quite-safety issues with little kids? if i had a kid running for the oven, i&#39;d <br/>\nphysically restrain the child. but i feel yucky getting in a pulling battle over a snatched toy <br/>\nwith a freaking out child, not to mention pulling a screaming little girl off her crying <br/>\nbrother. is there any more gentle way to handle these things?<br/>\n<br/>\nsorry this is incredibly verbose; my head is only half screwed on this morning. ;)<br/>\n<br/>\nelly</div>","specialLinks":[]}],"prevTopicId":25049,"nextTopicId":25070}}