{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I am going to explain further and don&#39;t want it to get lost in the shuffle","postDate":"1330993070","msgId":48001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqM2wzZStqNW5kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpqM2ZsNitvanRwQGVHcm91cHMuY29tPg=="},"prevInTopic":47998,"nextInTopic":0,"prevInTime":48000,"nextInTime":48002,"topicId":47997,"numMessagesInTopic":0,"msgSnippet":"Sorry to cross-post this, but the stuff about divorce bears repeating: ... Ahhhhhh, that s a big, important detail. Divorce can play havoc with unschooling. It","messageBody":"<div id=\"ygrps-yiv-1771879684\">Sorry to cross-post this, but the stuff about divorce bears repeating:<br/>\n<br/>\n&quot;Lora P&quot; &lt;lcmpek@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I got a divorce from their father last year.<br/>\n<br/>\n </span></blockquote>Ahhhhhh, that&#39;s a big, important detail. Divorce can play havoc with<br/>\nunschooling. It is not always possible to unschool as fully as you might like<br/>\nacross a divorce.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just needed to be reassured yet again that what I have chosen for them is<br/>\n </span></blockquote>the best path for us and reaffirm it in my gut.<br/>\n*******************<br/>\n<br/>\nIt may not be, if it is a source of conflict with the other parent. If<br/>\nunschooling isn&#39;t fully supported by both parents (or at least one is saying<br/>\n&quot;You&#39;re in charge of education, you make the call&quot;) then it can set up one more<br/>\nugly situation where the kids are stuck in the middle. It&#39;s better to step back<br/>\nfrom unschooling and focus on making your home a warm, loving haven for your<br/>\nchildren than to use unschooling as a whipping post.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;When I say I have &quot;kind of unschooled&quot; it is because the boys have always had<br/>\n </span></blockquote>a lot of friends in school who do book work and they have always wanted to be<br/>\nlike them.<br/>\n****************<br/>\n<br/>\nA lot of the advice on this list won&#39;t be helpful for &quot;kind of unschooling&quot;. You<br/>\nmight do better looking at resources for eclectic homeschooling.<br/>\n<br/>\nGiven that you&#39;ve been &quot;kind of unschooling&quot; and your children&#39;s father isn&#39;t<br/>\nhappy with their education, I&#39;d suggest you step away from unschooling entirely<br/>\nand look into eclectic homeschooling in a serious way. You can certainly go on<br/>\nworking to make your life and home peaceful, to parent by principles rather than<br/>\nby rules, but it doesn&#39;t seem like unschooling is a good fit for your family.<br/>\n<br/>\nUnschooling hasn&#39;t always been a good fit for all of my family. I have a<br/>\nstepson, and with split custody I&#39;ve certainly dealt with a great many issues<br/>\naround how much the other parent will allow. It Does Not Help to try and make a<br/>\nstand around unschooling - your kids get hurt over and over if you do that. It&#39;s<br/>\nmuch kinder to them to set them up to be easy and happy and comfortable when<br/>\nthey visit their other parent and his family.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I am going to explain further and don&#39;t want it to get lost in the shuffle","postDate":"1330989372","msgId":47998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzA5ODkzNzIuMjgxMDYuWWFob29NYWlsTmVvQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpqM2ZsNitvanRwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpqM2ZsNitvanRwQGVHcm91cHMuY29tPg=="},"prevInTopic":47997,"nextInTopic":48001,"prevInTime":47997,"nextInTime":47999,"topicId":47997,"numMessagesInTopic":0,"msgSnippet":"I do not understand what is computer time and book time. Can you explain that? Did your kids go to school or were they always homeschooled? Is their dad OK","messageBody":"<div id=\"ygrps-yiv-693756887\">I do not understand what is computer time and book time. Can you explain that?<br/>\nDid your kids go to school or were they always homeschooled?<br/>\nIs their dad OK with them unschooling?<br/>\nDo they only have schooled friends? Do you all do things with other homeschoolers?|<br/>\nHow do you think unschooling works? When you think about it how do you think a good day for an unschooler should be?<br/>\nWhat do you kids like to do?  <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":162651771,"authorName":"Lora P","from":"&quot;Lora P&quot; &lt;lcmpek@...&gt;","profile":"lcmpek","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"I am going to explain further and don&#39;t want it to get lost in the shuffle","postDate":"1330987494","msgId":47997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqM2ZsNitvanRwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47998,"prevInTime":47996,"nextInTime":47998,"topicId":47997,"numMessagesInTopic":0,"msgSnippet":"OK, when I typed that I left out some details because I hit a low spot. First of all, thank you so much for the responses you have. Here is the situation: My","messageBody":"<div id=\"ygrps-yiv-1244416016\">OK, when I typed that I left out some details because I hit a low spot.  <br/>\n<br/>\nFirst of all, thank you so much for the responses you have.<br/>\n<br/>\nHere is the situation:<br/>\n<br/>\nMy boys are 12 and 9.  I got a divorce from their father last year.  When I say I have &quot;kind of unschooled&quot; it is because the boys have always had a lot of friends in school who do book work and they have always wanted to be like them.  So my plan has always been to unschool them and I have done that with them for the most part, except for when they want to do book work and ask for help.  The other issue is their father who is no longer in the house hounding me and his family hounding him and then me about where they are in comparison to their cousins,etc. and then of course he has a customer that used to be a principal at a school who said a lot of kids go from homeschool to public school in 6th grade and are &quot;caught up&quot; and then they are &quot;fine.&quot;  <br/>\n<br/>\nNeedless to say with the divorce, etc., our schedule has taken on some new dynamics and we are all trying to adapt.  Our days consist of making our meals together (I know they are learning math), building tents, drawing and creative stuff all on what they have wanted.  And now we have book time and computer time. They love the &quot;work&quot; they do on their computers, the books even though the desperately want to do the work is causing frustration.  <br/>\n<br/>\nI just needed to be reassured yet again that what I have chosen for them is the best path for us and reaffirm it in my gut.<br/>\n<br/>\nLora</div>","specialLinks":[]}],"prevTopicId":47992,"nextTopicId":47995}}