{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1269032956","msgId":43410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvMHA1cytwMGZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvMGN1bCtxYTZtQGVHcm91cHMuY29tPg=="},"prevInTopic":43407,"nextInTopic":0,"prevInTime":43409,"nextInTime":43411,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... ********* Good heavens no! That would be exausting! And its not what other unschoolers are suggesting. There are other ways to help everyone get their","messageBody":"<div id=\"ygrps-yiv-1080177949\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rmacasa@...&quot; &lt;rmacasa@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Expecting mom to be short order cook 24/7 does not model behavior I want to pass down to my children.<br/>\n </span></blockquote>*********<br/>\n<br/>\nGood heavens no! That would be exausting! And its not what other unschoolers are suggesting. There are other ways to help everyone get their needs met without feelings being hurt *and* cut down on waste in the process.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Fact is no one can please everybody ALL the time. <br/>\n<br/>\n </span></blockquote>And yet it is possible for every family member to be happy with the food choices the vast majority of the time, even in a household with different food needs and desires, and on a very slim budget. We do, in my family!<br/>\n<br/>\nHaving more ready-to-eat snacks on hand is a big help. I don&#39;t mean that in the sense of &quot;commercial&quot; foods, necessarily, I mean you can pre-prep foods so its easy for kids to grab a snack or toss some leftovers in the microwave. That&#39;s not any more work than doing regular meals, and can even be a part of that process - when you&#39;re making a salad, do some extra veggies for snacks. While you&#39;re putting away leftovers, dish a few plates of kid-size servings for whoever&#39;s hungry at inconvenient times. When you&#39;re baking, include muffins and rolls and cookies along with slicing breads so kids (and adults too) can grab something convenient while busy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We cook 3 meals a day<br/>\n<br/>\n </span></blockquote>Kids so often need to eat at different intervals than traditional meals that cooking meals can actually set some families up for more waste, rather than less, and more hurt feelings. Its hard for a parent who&#39;s put time and care into cooking to watch a loved one frown at the food - and its easy to turn that ache into defensiveness and say &quot;you get what you get&quot; especially when that&#39;s the established norm of parenting anyway. Creating an environment where food is available all the time can alleviate that enormously. My dd is a veeeerrrry conservative eater, and it has made a big difference to have food on hand at all times, but also *invite* her to attend meals. She doesn&#39;t always eat with the family, but when she does, she&#39;s a gracious and social meal-companion who&#39;s there primarily to be in our company. That&#39;s charming! And my partner and I get to feel good about her company at the meal, rather than unhappy when she doesn&#39;t want to join us, or doesn&#39;t want to eat what we&#39;re eating. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We remind them another meal is just hours away and mention snacks that will be ready later on.<br/>\n </span></blockquote>***********<br/>\n<br/>\nThis is when ready-to-eat snacks can come in extra-handy. A child who is hungry, but doesn&#39;t like the food can grab a snack and still join in. A muffin or a bowl of cereal and its smiles all &#39;round. Chances are, you already know many of your kids&#39; preferences, too (general &quot;you&quot; - most parents can name a few foods their kids dislike), so its not too hard to modify your cooking for one less person, or divvy up the leftovers differently. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We LOVINGLY sympathize<br/>\n<br/>\n </span></blockquote>Loving sympathy is a wonderful way to support someone when there aren&#39;t any other options. Sometimes, despite all the choices in our house, my dd has a hard time feeling good about any of them, and I offer her my sympathy and some of my own strategies. If she&#39;s dissatisfied with choices more than occasionally, though, I look for ways to offer her more options where food is concerned. That very dissatisfaction, lately, has been her way of discovering she&#39;s ready to try something new, and that&#39;s been pretty exciting!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":415240058,"authorName":"rmacasa@sbcglobal.net","from":"&quot;rmacasa@...&quot; &lt;rmacasa@...&gt;","profile":"rmacasa@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1269020437","msgId":43407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvMGN1bCtxYTZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFRTU0QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":43397,"nextInTopic":43410,"prevInTime":43406,"nextInTime":43408,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"What works for our family... We have a 5 person, 2 dogs, 1 rabbit family.  We have limited resources such as time, money, space.  We also strive to live simply","messageBody":"<div id=\"ygrps-yiv-1950189242\">What works for our family...<br/>\n<br/>\nWe have a 5 person, 2 dogs, 1 rabbit family.  We have limited resources such as time, money, space.  We also strive to live simply and green.  Wasting resources like time, water, energy, food, money do not mesh with our desire to live simply.<br/>\n<br/>\nWe cook 3 meals a day and have snacks.  We have a &quot;get what you get&quot; system. It is loving, appropriate, and accepted by all those in our family.  <br/>\n<br/>\nWe talk as a family about meal planning before going to the grocery store.  We talk as a family about what meals we will make for the day.  On good days everyone is happy with the choice made.  Some days this does not work out.  If left overs are available or if PB & J is on hand we offer the person a chance to make their own alternative.  <br/>\n<br/>\nWe LOVINGLY sympathize with whomever is displeased with the main course.  We encourage picking things off or choosing one of the other dishes offered.  We remind them another meal is just hours away and mention snacks that will be ready later on.<br/>\n<br/>\nWe meal plan, shop, and cook along side our older girls.  Fact is no one can please everybody ALL the time.  We can be LOVING about the choices we make together and be respectful of folks when they are upset.  <br/>\n<br/>\nBringing everyone into all levels of the process IS empowering to all our family members.  Expecting mom to be short order cook 24/7 does not model behavior I want to pass down to my children.<br/>\n<br/>\nPeace is the way...<br/>\n<br/>\nRya</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1268928209","msgId":43397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFRTU0QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":43396,"nextInTopic":43407,"prevInTime":43396,"nextInTime":43398,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... on seeing him as himself first. Part of that was shifting how I talked and wrote about him I even do that with myself - I have type 2 diabetes but I don t ","messageBody":"<div id=\"ygrps-yiv-1459388603\"><blockquote><span title=\"ireply\">&gt;. It helped, in terms of having a better relationship with him, to work<br/>\n </span></blockquote>on seeing him as himself first. Part of that was shifting how I talked<br/>\nand wrote about him<br/>\n<br/>\nI even do that with myself - I have type 2 diabetes but I don&#39;t<br/>\nprimarily identify myself as a &quot;diabetic&quot;. I&#39;m me, I have diabetes, life<br/>\ngoes on. When I read Parenting Your Spirited Child, the descriptions and<br/>\nexamples in the book clicked. But, I don&#39;t identify DS as &quot;my spirited<br/>\nchild&quot;, I call him by his name and if, as in a post like this, I need to<br/>\nprovide explanation, I say that he has a spirited personality (my DH is<br/>\nsimilarly a spirited personality - I always said they share a brain<br/>\nlol!). It&#39;s part of him, just like &quot;he has blue eyes&quot; or &quot;he has a<br/>\ndimple on his chin just like his dad&quot;.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1268915343","msgId":43396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhudDZhZis0bHA2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuczY1cCs4cDE5QGVHcm91cHMuY29tPg=="},"prevInTopic":43393,"nextInTopic":43397,"prevInTime":43395,"nextInTime":43397,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... I remember how overwhelmed I felt by Ray s issues when he was younger -not food issues, although we did look for food triggers. His issues sort of","messageBody":"<div id=\"ygrps-yiv-145643144\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lalow66&quot; &lt;lalow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; not calling your children celiacs and anaphylatic might sound a little less harsh.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I remember how overwhelmed I felt by Ray&#39;s issues when he was younger -not food issues, although we did look for food triggers. His &quot;issues&quot; sort of dominated my world for awhile and I tended to fall into the habit of describing him thus. He was &quot;explosive&quot; or &quot;intense&quot; more often than he was Ray in my mind. It helped, in terms of having a better relationship with him, to work on seeing him as himself first. Part of that was shifting how I talked and wrote about him. He wasn&#39;t &quot;my intense kid&quot; he was Ray, who happened to be explosive. <br/>\n<br/>\nOne of the challenges of that is its not the norm! All the parents around me were describing kids as symptoms and issues - my asthmatic, my bedwetter, my gifted kid, my ADHD kid... It&#39;s a kind of short hand that can end up eroding the way one see&#39;s ones own child - it did me, for sure.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] More on food.","postDate":"1268902394","msgId":43393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNDM0MS44Mjk1NS5xbUB3ZWI1MDQwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg=="},"prevInTopic":43392,"nextInTopic":43396,"prevInTime":43392,"nextInTime":43394,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"I m not sure how old your kids are.... Is it possible, with the exception of tree nuts, to have the other foods in the house and help the kids learn to tell","messageBody":"<div id=\"ygrps-yiv-904427434\">I&#39;m not sure how old your kids are....<br/>\n<br/>\nIs it possible, with the exception of tree nuts, to have the other foods in the house and help the kids learn to tell the difference in the home? Something like &quot;this food isn&#39;t going to react well with your body, but you could have this & this & this & this & this&quot;<br/>\n<br/>\nMy daughter has peanut allergies. She&#39;s 3.5 years old now & we&#39;ve known she has a peanut allergy since she was two.<br/>\n<br/>\nWe have peanut butter in the house (on a high shelf).  We have candy with peanuts in the house sometimes. If she sees a food she wants and it has nuts in it, I tell her it has nuts in it and will make her sick. Not in a dramatic or scary way...just the truth.<br/>\n<br/>\nShe&#39;s been hospitalized 2x for asthma issues (and multiple ER visits in between), so if I say &quot;Zoe, this will make you sick & we&#39;ll have to go to the hospital&quot; - she knows what that means.<br/>\n<br/>\nI take her allergy (and her asthma) very seriously, but I don&#39;t want those things to interfere with her life. It is a part of her life, but it shouldn&#39;t be the focus. <br/>\n<br/>\nGwen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 3/15/10, riverkatie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:riverkatie@...\">riverkatie@...</a>&gt; wrote:<br/>\nI do have food rules, VERY strict ones.<br/>\n<br/>\nI have 2 coeliacs and an anaphylatic. We only have food in the house that everybody can eat, particularly tree nuts as the anaphylatic is very sensitive. Then I can say &quot;if its in our house, you can eat it&quot;<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1268882425","msgId":43392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuczY1cCs4cDE5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMzMzM4NC4zNDIyNS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":43391,"nextInTopic":43393,"prevInTime":43391,"nextInTime":43393,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... I have 2 coeliacs and an anaphylatic. We only have food in the house that everybody can eat, particularly tree nuts as the anaphylatic is very sensitive.","messageBody":"<div id=\"ygrps-yiv-547917502\"><blockquote><span title=\"ireply\">&gt; <br/>\n </span></blockquote>&quot;I have 2 coeliacs and an anaphylatic. We only have food in the house that everybody can eat, particularly tree nuts as the anaphylatic is very sensitive. Then I can say &quot;if its in our house, you can eat it&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Question, does this sound too controlling? Any ideas about how to manage this any better? Obliviously I would restrain my toddler from running across a busy road, I feel these food rules come into the same category. <br/>\n&gt; <br/>\n </span></blockquote>&quot;<br/>\n<br/>\nI dont know but not calling your children celiacs and anaphylatic might sound a little less harsh.<br/>\n<br/>\nI dont allow peanuts in my house.. i have been known to ask people to leave stuff in the car.  I try to be very nice about it.  I try to keep my house safe for my son.</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1268882109","msgId":43391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuczVydCtuYTdpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIyMTMzNzEyLTFEOEYtNEVFOC1CQzVBLTgwNzlCOTM5N0IwM0B2ZXJpem9uLm5ldD4="},"prevInTopic":43383,"nextInTopic":43392,"prevInTime":43390,"nextInTime":43392,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... when my son , who is allergic to milk and peanuts, was that age we avoided alot of group situations like that. we stuck to playing with friends that we","messageBody":"<div id=\"ygrps-yiv-787955062\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; &gt; My son who is anaphatyic to dairy is only 2 with a very limited  <br/>\n&gt; &gt; vocab, the problem comes at a playgroup, when 1 child is having a  <br/>\n&gt; &gt; snack and my son seeing food takes some in his mouth, or a person  <br/>\n&gt; &gt; handing our cookies, or crackers, gives him one. I have taken the  <br/>\n&gt; &gt; approcah with him that he only gets what I leave/have with me, away  <br/>\n&gt; &gt; from other children and their food. It may sound harsh<br/>\n&gt; <br/>\n </span></blockquote>when my son , who is allergic to milk and peanuts, was that age we avoided alot of group situations like that. we stuck to playing with friends that we knew well and knew about his allergies.  I tried to always had ready snacks on hand that he could eat and that he liked.  If we were going to a party, I brought cookies or cupcakes for him and he knew I had them. I outright asked people not to offer him food with the explanation that he had allergies and I had food for him. If we did have activities with snacks I offered to bring them alot of the time so I knew it was something he could have.  But I backed out of alot of activities to avoid food situations.  As he has gotten older he is very good about asking about foods, but he has always had lots of say and choices about foods.  Keeping a child safe doesnt have to be overbearing.  But, I did realize early on, that you cant really expect others to remember and unless they are dealing with the same kinds of food allergies they typically dont think to ask.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: More on food.","postDate":"1268825436","msgId":43383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyMTMzNzEyLTFEOEYtNEVFOC1CQzVBLTgwNzlCOTM5N0IwM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhucGU5OStrczlsQGVHcm91cHMuY29tPg==","referencesHeader":"PGhucGU5OStrczlsQGVHcm91cHMuY29tPg=="},"prevInTopic":43381,"nextInTopic":43391,"prevInTime":43382,"nextInTime":43384,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... The real question is: Does it *feel* harsh to him? If it feels harsh to him then it s no different than if you intended to be harsh to him. If my husband","messageBody":"<div id=\"ygrps-yiv-439218850\">On Mar 16, 2010, at 10:20 PM, zeph32 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son who is anaphatyic to dairy is only 2 with a very limited  <br/>\n&gt; vocab, the problem comes at a playgroup, when 1 child is having a  <br/>\n&gt; snack and my son seeing food takes some in his mouth, or a person  <br/>\n&gt; handing our cookies, or crackers, gives him one. I have taken the  <br/>\n&gt; approcah with him that he only gets what I leave/have with me, away  <br/>\n&gt; from other children and their food. It may sound harsh<br/>\n<br/>\n </span></blockquote>The real question is: Does it *feel* harsh to him? If it feels harsh  <br/>\nto him then it&#39;s no different than if you intended to be harsh to him.<br/>\n<br/>\nIf my husband took me to parties regularly and everyone was eating  <br/>\nand drinking freely, handing me cool new foods that he then snatched  <br/>\naway telling me I can only eat what he brings, I&#39;d be livid. The food  <br/>\nallergy is immaterial if your son doesn&#39;t fully understand why others  <br/>\ncan freely eat and he can&#39;t.<br/>\n<br/>\n2 yos don&#39;t need groups of children. So the biggest thing he may be  <br/>\ngetting from the play group is a desire to not have someone hovering  <br/>\nover him taking food away. That set up is a good recipe for a child  <br/>\nlearning how to sneak. Parents who become roadblocks between their  <br/>\nchildren and what their children want create opportunities for kids  <br/>\nto learn how to get around them. That&#39;s why there&#39;s lots of help here  <br/>\nto be a child&#39;s partner.<br/>\n<br/>\nIf there were a special situation you wanted to take him to, a  <br/>\nwedding reception or family reunion or once a year church picnic for  <br/>\ninstance, being right with him every moment and redirecting to your  <br/>\nown food might be the easiest solution. But a weekly play group  <br/>\ndoesn&#39;t sound like a good fit for him until he has understanding --  <br/>\nnot just you telling him but knowledge -- that his body doesn&#39;t like  <br/>\ncertain foods.<br/>\n<blockquote><span title=\"ireply\"> &gt; There needs to be more education to the public in my mind to change  <br/>\n&gt; people and what they do with food around children.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s more useful for parents to spend time respectfully helping their  <br/>\nchildren navigate the world they live in than to wish the world would  <br/>\nchange to make their lives easier. In fact, it would make the world  <br/>\nmore dangerous. It&#39;s unreasonable to expect every adult could be  <br/>\nfully aware of food allergies and would suppress the friendly gesture  <br/>\nof sharing food. If you depend on other people not to offer, you&#39;re  <br/>\nputting your child at risk. He lives in a world where people share  <br/>\nfood and that&#39;s the world he needs to navigate.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62985947,"authorName":"zeph32","from":"&quot;zeph32&quot; &lt;zeph32@...&gt;","profile":"zeph32","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1268792425","msgId":43381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhucGU5OStrczlsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg=="},"prevInTopic":43374,"nextInTopic":43383,"prevInTime":43380,"nextInTime":43382,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"I also have 2 severe allergies in the house, dairy and tree nuts. I find people can be overy friendly with food and children and do not give allergens a second","messageBody":"<div id=\"ygrps-yiv-558638518\">I also have 2 severe allergies in the house, dairy and tree nuts. I find people can be overy friendly with food and children and do not give allergens a second thought. My son who is anaphatyic to dairy is only 2 with a very limited vocab, the problem comes at a playgroup, when 1 child is having a snack and my son seeing food takes some in his mouth, or a person handing our cookies, or crackers, gives him one. I have taken the approcah with him that he only gets what I leave/have with me, away from other children and their food. It may sound harsh but is much easier at this stage of his life when he cannot speak for himself. My other is 6 and is good at asking if something has nuts in it, or coming to find me first. There needs to be more education to the public in my mind to change people and what they do with food around children. <br/>\n<br/>\nSarah<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;riverkatie&quot; &lt;riverkatie@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Just a question,<br/>\n&gt; <br/>\n&gt; I do have food rules, VERY strict ones.<br/>\n&gt; <br/>\n&gt; I have 2 coeliacs and an anaphylatic. We only have food in the house that everybody can eat, particularly tree nuts as the anaphylatic is very sensitive. Then I can say &quot;if its in our house, you can eat it&quot;<br/>\n&gt; <br/>\n&gt; If people bring food, I check it for nuts, gluten etc. If it contains these I ask them (politely but firmly) to not bring it into my house.<br/>\n&gt; <br/>\n&gt; Out and about though.....<br/>\n&gt; <br/>\n&gt; Rule one. If anybody ever offers you food you MUST bring it to me before eating it. If you cannot eat it I promise I will replace it with a food OF YOUR CHOICE as soon as possible.<br/>\n&gt; <br/>\n&gt; Rule two. If i am not there, or there is not another trusted adult (named by me in advance) you must only eat the food I provide. I&#39;m sorry.  <br/>\n&gt; This one came after I taught my anaphylatic to ask before eating. She asked &quot;can I eat this?&quot; the reply was &quot;of course darling&quot;. We nearly lost her, I cannot praise the paramedics highly enough....<br/>\n&gt; <br/>\n&gt; My kids are OK with this at the moment. They know why, they know whats wrong. The anaphylatic HATES anaphylatic attacks (who wouldn&#39;t?)and is always careful to ask/check. <br/>\n&gt; <br/>\n&gt; Beyond these rules they may eat what they like. <br/>\n&gt; <br/>\n&gt; Question, does this sound too controlling? Any ideas about how to manage this any better? Obliviously I would restrain my toddler from running across a busy road, I feel these food rules come into the same category.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":256450034,"authorName":"riverkatie","from":"&quot;riverkatie&quot; &lt;riverkatie@...&gt;","profile":"riverkatie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1268760747","msgId":43374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhub2ZiYitpZm83QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI4ODVENjlGQ0IxOTRBQkM5MDZFQTBBQ0ExQ0ZFQzgxQExZTEFMQVAyPg=="},"prevInTopic":43372,"nextInTopic":43381,"prevInTime":43373,"nextInTime":43375,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"- ... Yes, I agree, we all learnt a lot from that one! I was actually there (with the ana-kit), but not beside her, and it was the first time I had to deal","messageBody":"<div id=\"ygrps-yiv-783310667\">-<br/>\n<blockquote><span title=\"ireply\"> &gt; ************************<br/>\n&gt; <br/>\n&gt; this sounds like an illustration of exactly WHY such a rule is actually more dangerous!  what if she had learned to ask for help in determining if something had an allergin in it instead?  &quot;does this have nuts or was it manufactured with  nuts&quot; would be a much clearer question to the adult who&#39;s being asked, and the answer would be much more helpful/safe.  it will also take your child with such a life threatening allergy into the future, with the skills to find help/determine for herself, as she&#39;s capable.  <br/>\n&gt; <br/>\n&gt; in addition, if a child has an anaphalactyc allergy, and is being left in the care of another adult, i&#39;d definitely make sure that adult understood the severity and was clued in too how to help/interpret safety of foods.  not doing so is like leaving a 2 year ld child in the care of a horse, near a cliff and telling the child that she must ask the horse if it&#39;s ok to play near the cliff. it&#39;s not fair to the child or the horse.<br/>\n&gt; <br/>\n&gt; lyla<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, I agree, we all learnt a lot from that one! <br/>\nI was actually there (with the ana-kit), but not beside her, and it was the first time I had to deal with the situation in &#39;real time&#39; and i did not handle it well.  After this we all role played the situation, including the siblings and we are all more confident. The next time (a mislabeled product from a bakery) went more smoothly, if not less scarily<br/>\n<br/>\nThank you people for advice and info, I&#39;ll go and look up the old threads as well.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on food.","postDate":"1268760284","msgId":43372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhub2VzcytwMWxwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg=="},"prevInTopic":43368,"nextInTopic":43374,"prevInTime":43371,"nextInTime":43373,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... ***************** Joyce has a wonderful quote on her site about giving kids rules vs reasons - if your kids understand the reasons and agree with them,","messageBody":"<div id=\"ygrps-yiv-1678938701\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;riverkatie&quot; &lt;riverkatie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Question, does this sound too controlling? Any ideas about how to manage this any better?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nJoyce has a wonderful quote on her site about giving kids rules vs reasons - if your kids understand the reasons and agree with them, then the rules don&#39;t matter, they&#39;re more like reminders in your case. In my world, similar reminders would be &quot;any animal may bite you&quot; and &quot;some animals are venomous&quot; (we&#39;ve had eastern timber rattlers in our yard). My kids aren&#39;t interested in being bitten by a rattlesnake, so they know to exercise a good deal of caution around snakes. We&#39;ve talked about what that looks like, and someone else might phrase those strategies as rules, but they really aren&#39;t, they&#39;re reminders. Its a good idea to know what kind of snake it is before getting too close, for instance - it&#39;d be easy to say that as &quot;Don&#39;t...&quot; but it doesn&#39;t need to be a rule, as such. Its something to keep in mind. <br/>\n<br/>\nYour kids don&#39;t want to be sick, much less stop breathing! While they&#39;re young and can&#39;t check the ingredients of food for themselves, naturally they depend on you to help them And its important for them to realize that they Can&#39;t depend on random other mommies and daddies in the same capacity. So you&#39;re &quot;rules&quot; are more an iteration of things to keep in mind - not all food is safe, not all adults know what your safety needs are. Mom&#39;s your best ally for now (but eventually they&#39;ll be able to handle things on their own).<br/>\n<br/>\nWhere things could get sticky is with your kid with celiac, since not all the effects of eating wheat are as imediately obvious as anaphylactic shock! So its a good idea to think about how you want to help your kids explore that area with as much safety as possible. Obviously you don&#39;t want them to be sick, and they really don&#39;t want to Be sick, but you also don&#39;t want to set up the sort of situation where they&#39;ll &quot;test the rules&quot; and hurt themselves as a result.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] More on food.","postDate":"1268757628","msgId":43368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODVENjlGQ0IxOTRBQkM5MDZFQTBBQ0ExQ0ZFQzgxQExZTEFMQVAyPg==","inReplyToHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg=="},"prevInTopic":43364,"nextInTopic":43372,"prevInTime":43367,"nextInTime":43369,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"Rule two. If i am not there, or there is not another trusted adult (named by me in advance) you must only eat the food I provide. I m sorry. This one came","messageBody":"<div id=\"ygrps-yiv-1578244491\">Rule two. If i am not there, or there is not another trusted adult (named by me in advance) you must only eat the food I provide. I&#39;m sorry. <br/>\nThis one came after I taught my anaphylatic to ask before eating. She asked &quot;can I eat this?&quot; the reply was &quot;of course darling&quot;. We nearly lost her, I cannot praise the paramedics highly enough....<br/>\n<br/>\n************************<br/>\n<br/>\nthis sounds like an illustration of exactly WHY such a rule is actually more dangerous!  what if she had learned to ask for help in determining if something had an allergin in it instead?  &quot;does this have nuts or was it manufactured with  nuts&quot; would be a much clearer question to the adult who&#39;s being asked, and the answer would be much more helpful/safe.  it will also take your child with such a life threatening allergy into the future, with the skills to find help/determine for herself, as she&#39;s capable.  <br/>\n<br/>\nin addition, if a child has an anaphalactyc allergy, and is being left in the care of another adult, i&#39;d definitely make sure that adult understood the severity and was clued in too how to help/interpret safety of foods.  not doing so is like leaving a 2 year ld child in the care of a horse, near a cliff and telling the child that she must ask the horse if it&#39;s ok to play near the cliff. it&#39;s not fair to the child or the horse.<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] More on food.","postDate":"1268739267","msgId":43364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0RjM4QzA3LTkyQTctNDBENy05NzA2LUFGRUVDRDA1QTgyMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg=="},"prevInTopic":43362,"nextInTopic":43368,"prevInTime":43363,"nextInTime":43365,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"... The basic idea about rules is they re bits of behavior people can memorize without needing to know or think about the reasons. If kids aren t old enough to","messageBody":"<div id=\"ygrps-yiv-920611083\">On Mar 15, 2010, at 10:56 PM, riverkatie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Rule one. If anybody ever offers you food you MUST bring it to me  <br/>\n&gt; before eating it...<br/>\n&gt;<br/>\n&gt; Rule two. If i am not there, or there is not another trusted adult...<br/>\n<br/>\n </span></blockquote>The basic idea about rules is they&#39;re bits of behavior people can  <br/>\nmemorize without needing to know or think about the reasons.<br/>\n<br/>\nIf kids aren&#39;t old enough to think through something, handing them  <br/>\nrules is remote parenting. Parents need to be there if kids can&#39;t  <br/>\nmake the safe decisions for themselves. A rule of not running in  <br/>\nfront of cars isn&#39;t safe. Being there to keep kids from running in  <br/>\nfront of cars, avoiding places where they can run in front of cars,  <br/>\nis necessary until they&#39;re old enough to understand not to run.<br/>\n<br/>\nIf they&#39;re old enough to understand -- but not necessarily capable of  <br/>\ncoming up with solutions -- parents can help them with strategies.  <br/>\nThe strategies may be &quot;bring the food to me or a trusted adult before  <br/>\nyou eat it&quot; *but* the atmosphere around it will be one of helping and  <br/>\ntrusting a child rather than one of distrust.<br/>\n<br/>\nThe problem with rules and when parents say &quot;I won&#39;t allow you ...&quot;  <br/>\nthey intend it to mean &quot;I care about you too much to let you do  <br/>\nthat.&quot; What gets felt is &quot;I don&#39;t trust you. You&#39;re not capable of  <br/>\nhandling this. You need an adult to supervise. The world is too scary  <br/>\nand dangerous for you to handle without me.&quot;<br/>\n<br/>\nWhile those may be true, reacting to situations from that point of  <br/>\nview whittles at the relationship and can make it harder for kids to  <br/>\ntrust that you&#39;re on their side. (For some kids, rules make them feel  <br/>\nsmall and unsure. And for some kids rules feel like a challenge to  <br/>\ntest themselves against. Adults can often get kids to dare a  <br/>\nchallenge by saying &quot;I bet you can&#39;t.&quot; ;-) Adults don&#39;t get to choose  <br/>\nwhen a child sees a &quot;can&#39;t&quot; as a challenge or as an uncrossable  <br/>\nbarrier.)<br/>\n<br/>\nThere are better, more relationship building ways to handle the  <br/>\nsituation.<br/>\n<br/>\nIn the archives are many posts of how parents have handled life  <br/>\nthreatening food allergies in respectful ways with little kids,  <br/>\nworking with the understanding that kids don&#39;t want to be sick or get  <br/>\nhurt and helping them find ways to avoid that. Searching for &quot;food  <br/>\nallerg&quot; (which will get you allergy and allergies) or even just  <br/>\npeanut should turn up several threads.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] More on food.","postDate":"1268736231","msgId":43362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzMzM4NC4zNDIyNS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg=="},"prevInTopic":43360,"nextInTopic":43364,"prevInTime":43361,"nextInTime":43363,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"The first thought I have is can you bring food with you when you are out that you know they d like? So if you are at a friends, have a bag filled with good to","messageBody":"<div id=\"ygrps-yiv-166167460\">The first thought I have is can you bring food with you when you are out that you know they&#39;d like? So if you are at a friends, have a bag filled with good to trade for food or fantastic nut free, coeliac safe treats that they&#39;ll go for first. Being the better thing available would help to make them feel less constricted by their biology. <br/>\n<br/>\nYou are working to protect your children from their choices by limiting those choices. It may help them more if you can help them see how they can make choices that keep them feeling better. Your daughter has experienced the consequence of her allergy. I&#39;m guessing she is fairly willing to work within the limitations of that allergy. I don&#39;t know what coeliac looks like in your children, but talking about it and how it can play out will probably help your children make informed choices. I have a friend who suffers from coeliac disease and he chooses to eat things containing wheat gluten on occasion. Knowing absolutely that it can wreak havoc in future days. I think that is what a parent can hope for, a child who is aware of their body and how they react to things and can make choices based on that awareness. At some point they will be making their own choices without you there to limit them. Much better that they have a history of choices rather than a<br/>\n history of rules. <br/>\n<br/>\nI quoted Rue Kream in my last post so her words are fresh in my mind. In the same question and answer section of the book she mentions pool safety. When they got a pool rather than having a bunch of rules about how to be in a pool they got together and talked about what would make them more comfortable about having a pool. Having a hook to rescue someone, having a strong swimmer around when weaker swimmers wanted to swim, and so on. And that&#39;s what they did. They made sure that whenever anyone wanted to use the pools the things that made people comfortable about the pool being used were available, were switched on. So, rather than seeing rules as the way that you are keeping your children safe from the food that can hurt them, seeing it as being about trust and knowledge and their own vested interest in feeling good may help you all to continue to be safe, even when it may not be the easiest of choices. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: riverkatie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:riverkatie@...\">riverkatie@...</a>&gt;<br/>\n<br/>\nJust a question,<br/>\n<br/>\nI do have food rules, VERY strict ones.<br/>\n<br/>\nI have 2 coeliacs and an anaphylatic. We only have food in the house that everybody can eat, particularly tree nuts as the anaphylatic is very sensitive. Then I can say &quot;if its in our house, you can eat it&quot;<br/>\n<br/>\nIf people bring food, I check it for nuts, gluten etc. If it contains these I ask them (politely but firmly) to not bring it into my house.<br/>\n<br/>\nOut and about though.....<br/>\n<br/>\nRule one. If anybody ever offers you food you MUST bring it to me before eating it. If you cannot eat it I promise I will replace it with a food OF YOUR CHOICE as soon as possible.<br/>\n<br/>\nRule two. If i am not there, or there is not another trusted adult (named by me in advance) you must only eat the food I provide. I&#39;m sorry.  <br/>\nThis one came after I taught my anaphylatic to ask before eating. She asked &quot;can I eat this?&quot; the reply was &quot;of course darling&quot;. We nearly lost her, I cannot praise the paramedics highly enough....<br/>\n<br/>\nMy kids are OK with this at the moment. They know why, they know whats wrong. The anaphylatic HATES anaphylatic attacks (who wouldn&#39;t?)and is always careful to ask/check. <br/>\n<br/>\nBeyond these rules they may eat what they like. <br/>\n<br/>\nQuestion, does this sound too controlling? Any ideas about how to manage this any better? Obliviously I would restrain my toddler from running across a busy road, I feel these food rules come into the same category. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":256450034,"authorName":"riverkatie","from":"&quot;riverkatie&quot; &lt;riverkatie@...&gt;","profile":"riverkatie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"More on food.","postDate":"1268708191","msgId":43360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhubXMwditmYjU4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43362,"prevInTime":43359,"nextInTime":43361,"topicId":43360,"numMessagesInTopic":0,"msgSnippet":"Just a question, I do have food rules, VERY strict ones. I have 2 coeliacs and an anaphylatic. We only have food in the house that everybody can eat,","messageBody":"<div id=\"ygrps-yiv-419980607\">Just a question,<br/>\n<br/>\nI do have food rules, VERY strict ones.<br/>\n<br/>\nI have 2 coeliacs and an anaphylatic. We only have food in the house that everybody can eat, particularly tree nuts as the anaphylatic is very sensitive. Then I can say &quot;if its in our house, you can eat it&quot;<br/>\n<br/>\nIf people bring food, I check it for nuts, gluten etc. If it contains these I ask them (politely but firmly) to not bring it into my house.<br/>\n<br/>\nOut and about though.....<br/>\n<br/>\nRule one. If anybody ever offers you food you MUST bring it to me before eating it. If you cannot eat it I promise I will replace it with a food OF YOUR CHOICE as soon as possible.<br/>\n<br/>\nRule two. If i am not there, or there is not another trusted adult (named by me in advance) you must only eat the food I provide. I&#39;m sorry.  <br/>\nThis one came after I taught my anaphylatic to ask before eating. She asked &quot;can I eat this?&quot; the reply was &quot;of course darling&quot;. We nearly lost her, I cannot praise the paramedics highly enough....<br/>\n<br/>\nMy kids are OK with this at the moment. They know why, they know whats wrong. The anaphylatic HATES anaphylatic attacks (who wouldn&#39;t?)and is always careful to ask/check. <br/>\n<br/>\nBeyond these rules they may eat what they like. <br/>\n<br/>\nQuestion, does this sound too controlling? Any ideas about how to manage this any better? Obliviously I would restrain my toddler from running across a busy road, I feel these food rules come into the same category.</div>","specialLinks":[]}],"prevTopicId":43305,"nextTopicId":43388}}