{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":248175779,"authorName":"nrskay","from":"&quot;nrskay&quot; &lt;k_bird@...&gt;","profile":"nrskay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Newbie- unschooling and parent direction?","postDate":"1136659022","msgId":8828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwcDFvZStpamtxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEY1OUMxOTk0LURGQzMtNDQ1Ri1CRDZCLUNDQkJFODRCQjZCOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":8820,"nextInTopic":0,"prevInTime":8827,"nextInTime":8829,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"... It ... wrong. Study ... from ... an ... Pam I never thought about the word study before in that context.  Your right, it does sound schoolish and needs","messageBody":"<div id=\"ygrps-yiv-1443215556\"><blockquote><span title=\"ireply\">&gt; How about as a next step try giving up even talking about 11 year  <br/>\n&gt; olds &quot;studying&quot; things - but change the terminology to say they are  <br/>\n&gt; learning about things by pursuing their interests in various ways. <br/>\n </span></blockquote>It  <br/>\n<blockquote><span title=\"ireply\"> &gt; may sound nitpicky, but it really helps to get away from that school-<br/>\n <br/>\n&gt; think - the idea that to learn you have to &quot;study&quot; is <br/>\n </span></blockquote>wrong. &quot;Study&quot;  <br/>\n<blockquote><span title=\"ireply\"> &gt; has such a different ring to it and if we&#39;re trying to get away <br/>\n </span></blockquote>from  <br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;school-think&quot; we might want to let that word slip out of our  <br/>\n&gt; vocabulary for a while, along with &quot;teach.&quot; (I KNOW there are times  <br/>\n&gt; to use it - people say they &quot;study karate,&quot; for example. But - as <br/>\n </span></blockquote>an  <br/>\n<blockquote><span title=\"ireply\"> &gt; exercise to help &quot;get&quot; unschooling better - try to use &quot;learn&quot; in  <br/>\n&gt; place of &quot;study&quot; or &quot;teach&quot; whenever possible.<br/>\n<br/>\n<br/>\n </span></blockquote>Pam<br/>\n<br/>\nI never thought about the word study before in that context.  Your <br/>\nright, it does sound &quot;schoolish&quot; and needs to be avoided.  So <br/>\nElizabeth was learning about cats and their behavior.<br/>\n<br/>\nAnd Elizabeth will most likely change her mind about what career she <br/>\nwants several times before she finally decides.  Actually I was a <br/>\nAdmin Asst for 10 years and decided to go to college at 30 to become a <br/>\nnurse.  Now, I stay home to be a mom, the greatest job yet!<br/>\n<br/>\nKay</div>","specialLinks":[]},{"userId":245074059,"authorName":"kkraczek1969","from":"&quot;kkraczek1969&quot; &lt;kkraczek1969@...&gt;","profile":"kkraczek1969","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Newbie- unschooling and parent direction?","postDate":"1136644407","msgId":8820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwb2pmbytvNDg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIxNTlGRTVCLTRERkYtNDdDNS04NjUzLUQzQTNBOTRDQkVFOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":8815,"nextInTopic":8828,"prevInTime":8819,"nextInTime":8821,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"Thanks for your response Pam, but I think that I may have been misunderstood. The question that I posted was in regards to a one-time conversation that I had","messageBody":"<div id=\"ygrps-yiv-1984391073\">Thanks for your response Pam, but I think that I may have been<br/>\nmisunderstood. The question that I posted was in regards to a one-time<br/>\nconversation that I had with my daughter... I didn&#39;t mean to make it<br/>\nsound as if that were my entire FOCUS. <br/>\n<br/>\nThe truth of it is, I brought her home so that she can be HERSELF- and<br/>\n I never have held any expectations for her other than that she be<br/>\nHAPPY. Her last two years of PS were so difficult for her that I knew<br/>\nshe didn&#39;t belong there, and I have no intention of re-creating that<br/>\nfor her at home. I enjoy encouraging ALL of her interests, and I have<br/>\nseen her blossom into such a vibrant person in the last six months,<br/>\nthat I can hardly contain my enthusiasm when people ask about her. <br/>\n<br/>\nIt just so happened that the subject of college came up, and I didn&#39;t<br/>\nwant to be forceful- I&#39;m trying very hard to avoid that- so I regret<br/>\nthat it sounded like I was.<br/>\n<br/>\nPlease don&#39;t take this as a negative post, as I really just feel the<br/>\nneed to clarify my objectives- (and I hate the way that writing<br/>\ndoesn&#39;t allow body language to show that I am NOT trying to be crabby<br/>\nhere) I fully intend to let my children choose, at all times, what it<br/>\nis that they want to pursue. I simply was worried about those old<br/>\nfears creeping into my conversation when the &quot;c&quot; word came up. She<br/>\nasked, I told. Perhaps I told too much, but it hasn&#39;t come up since,<br/>\nand I don&#39;t think she&#39;ll be picking up textbooks ANYTIME soon. :)<br/>\n<br/>\nThanks again- this post as well as all the others have been helpful in<br/>\nmy pursuit of answers!<br/>\n<br/>\nKristin<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Jan 6, 2006, at 10:11 AM, kkraczek1969 wrote:<br/>\n&gt; <br/>\n&gt; &gt; If I were to discuss with my daughter her plans for the future, and<br/>\n&gt; &gt; she said that she wanted to go to college, would it be against the<br/>\n&gt; &gt; unschooling philosophy to give her direction on what types of things<br/>\n&gt; &gt; that she may need to do to get there?<br/>\n&gt; <br/>\n&gt; There is NOTHING an 11 year old needs to do now to get ready for  <br/>\n&gt; college. Absolutely nothing.<br/>\n&gt; <br/>\n&gt; &gt; For example, if I explain to her<br/>\n&gt; &gt; that she may need to practice writing and math?<br/>\n&gt; <br/>\n&gt; She doesn&#39;t need to practice writing and math at 11 to go to college  <br/>\n&gt; later - probably at least 7 or more years away.<br/>\n&gt; <br/>\n&gt; &gt; I&#39;m not forcing her to<br/>\n&gt; &gt; do these things, but I want her to at least be aware that these are<br/>\n&gt; &gt; things she would probably need to do.<br/>\n&gt; <br/>\n&gt; Are you really thinking that kids need to &quot;practice&quot; writing and math  <br/>\n&gt; in order to go to college? It isn&#39;t true. Try reading &quot;The  <br/>\n&gt; Unprocessed Child&quot; by Valerie Fitzenreiter if you don&#39;t believe me.<br/>\n&gt; <br/>\n&gt; &gt; Is this too much direction?<br/>\n&gt; <br/>\n&gt; If you&#39;re misleading her into thinking that she needs to even THINK  <br/>\n&gt; about college now - then it is not that it is too much, it is that it  <br/>\n&gt; is wrong. You need to get your own information right so that you can  <br/>\n&gt; give her better counsel.<br/>\n&gt; <br/>\n&gt; &gt; I<br/>\n&gt; &gt; just don&#39;t know if my daughter would even be aware of some things if I<br/>\n&gt; &gt; did not tell her.<br/>\n&gt; <br/>\n&gt; By the time she&#39;s 16, 17, 18, 19 -- she&#39;ll know lots of things that  <br/>\n&gt; you don&#39;t know, too. She&#39;ll have lots of sources of information  <br/>\n&gt; besides just you. In fact, part of your job is to help her become  <br/>\n&gt; aware of OTHER sources of information. But not about college now. At  <br/>\n&gt; 11 she shouldn&#39;t have to be THINKING at all about her future - at  <br/>\n&gt; least not beyond the kid kind of thinking about what she wants to be  <br/>\n&gt; when she grows up - NOT to be held to.<br/>\n&gt; <br/>\n&gt; &gt; (Of course, she&#39;s only 11, but I want her to know<br/>\n&gt; &gt; all of her options, all of the time)<br/>\n&gt; <br/>\n&gt; That&#39;s not honest or a good idea. NOBODY can know all options all the  <br/>\n&gt; time. Impossible. You&#39;re picking out college - but are you making  <br/>\n&gt; sure she knows ALL her options that don&#39;t involve college? Are you  <br/>\n&gt; making sure she knows what she&#39;d need to do to get into the Peace  <br/>\n&gt; Corps? The military? An apprenticeship? A technical school? Every  <br/>\n&gt; possible kind of career that she might eventually be interested in?<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; Please help me decide if I&#39;m getting too involved...<br/>\n&gt; <br/>\n&gt; Not too involved - involved in the wrong things. Concerned about the  <br/>\n&gt; wrong things.<br/>\n&gt; <br/>\n&gt; &gt; I just know that<br/>\n&gt; &gt; my own options as a child were few, and I want my kids to do whatever<br/>\n&gt; &gt; makes them happy, but also to be prepared for anything!<br/>\n&gt; <br/>\n&gt; Impossible.<br/>\n&gt; <br/>\n&gt; BUT - support their CURRENT interests - get involved, be aware of  <br/>\n&gt; THEIR passions. Observe them and how they choose to learn things -  <br/>\n&gt; what lights up their eyes, what gets their attention, what kinds of  <br/>\n&gt; things do they keep coming back to, what do they talk about, and so on.<br/>\n&gt; <br/>\n&gt; Your job is to support those things while providing a rich  <br/>\n&gt; environment with a variety of options -- notice the word &quot;option&quot; -  <br/>\n&gt; everything is optional - but you do make sure that kids have lots of  <br/>\n&gt; opportunity to FIND their own interests and passions - lots of  <br/>\n&gt; experience, lots to choose from.<br/>\n&gt; <br/>\n&gt; The big THING about unschooling that is so amazing is that kids WILL  <br/>\n&gt; figure out what they want to do and what it takes to do it when they  <br/>\n&gt; are used to -- guess what? Figuring out what they want to do and what  <br/>\n&gt; it takes to do it. But at 11, figuring out what she wants to do and  <br/>\n&gt; what it takes to do it means figuring out that she really likes to  <br/>\n&gt; play dressups and that she needs to go to a thrift store to get more  <br/>\n&gt; things to dress up in.<br/>\n&gt; <br/>\n&gt; Your part in that might be to notice that she&#39;s having a lot of fun  <br/>\n&gt; playing dressups and you might say, &quot;Hey, while we&#39;re out let&#39;s stop  <br/>\n&gt; at the thrift store and see if you can find any cool dress-ups.&quot; If  <br/>\n&gt; she&#39;s never heard of a thrift store before then there you go - you&#39;ve  <br/>\n&gt; introduced her to something new. And while you&#39;re there, you might  <br/>\n&gt; see some appliance that she&#39;s never seen - a waffle iron or a  <br/>\n&gt; watering can....whatever. You&#39;ll say, &quot;Oh, look at this - how cool.&quot;  <br/>\n&gt; And if she&#39;s interested, you MIGHT talk about it and if she&#39;s REALLY  <br/>\n&gt; interested you might buy it and go home and make waffles. And maybe  <br/>\n&gt; she will enjoy that and you&#39;ll get into cooking a lot together -  <br/>\n&gt; starting with making up unusual toppings for your waffles.<br/>\n&gt; <br/>\n&gt; Or maybe none of that will happen. Maybe while you&#39;re in the thrift  <br/>\n&gt; store you&#39;ll see a handpainted umbrella and she&#39;ll say, &quot;Hey, I could  <br/>\n&gt; do that - I could paint umbrellas and sell them.&quot; And you&#39;ll talk  <br/>\n&gt; about what kind of paint to use and maybe get some and try it out and  <br/>\n&gt; who knows where that might lead.<br/>\n&gt; <br/>\n&gt; OR - maybe you&#39;ll browse around, find a gorgeous wedding dress for  <br/>\n&gt; sale and buy it and she&#39;ll go home and play &quot;wedding&quot; for months and  <br/>\n&gt; develop a lifelong love of creating beautiful weddings and end up a  <br/>\n&gt; wedding planner.<br/>\n&gt; <br/>\n&gt; OR not. Maybe you&#39;ll just browse around and find nothing of interest  <br/>\n&gt; and leave and do something else. That&#39;s okay. Move on.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Newbie- unschooling and parent direction?","postDate":"1136613146","msgId":8815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyQ0JEMjYwLTFGN0YtNDMyMC1BRTBELUYyMjYxNzQ2QUVFM0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRwbWRoOSs4c2V1QGVHcm91cHMuY29tPg==","referencesHeader":"PGRwbWRoOSs4c2V1QGVHcm91cHMuY29tPg=="},"prevInTopic":8814,"nextInTopic":8820,"prevInTime":8814,"nextInTime":8816,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"... My daughter sometimes has wanted to know what people have done to get into the careers they re into. And one time we got a chance to chat with one of the","messageBody":"<div id=\"ygrps-yiv-2114430769\">On Jan 6, 2006, at 10:39 AM, kkraczek1969 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, I just didn&#39;t know if it would be too pushy to inform her of<br/>\n&gt; requirements and such when the subject comes up.<br/>\n<br/>\n </span></blockquote>My daughter sometimes has wanted to know what people have done to get  <br/>\ninto the careers they&#39;re into. And one time we got a chance to chat  <br/>\nwith one of the women working with the whales at Sea World and my  <br/>\ndaughter asked her what her training was.<br/>\n<br/>\nIf a child is INTERESTED in what the training or background is of  <br/>\npeople in certain careers, then you&#39;d help them pursue that interest.<br/>\n<br/>\nBut that seems really different to me than telling an 11 year old  <br/>\nthat if she wants to be a vet she&#39;d better get started practicing  <br/>\nhandwriting and math.<br/>\n<br/>\nNot sure if that difference is clear, but it is critical to &quot;getting&quot;  <br/>\nunschooling, i think.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Newbie- unschooling and parent direction?","postDate":"1136612884","msgId":8814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1OUMxOTk0LURGQzMtNDQ1Ri1CRDZCLUNDQkJFODRCQjZCOUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRwbWNwYStlNGg1QGVHcm91cHMuY29tPg==","referencesHeader":"PGRwbWNwYStlNGg1QGVHcm91cHMuY29tPg=="},"prevInTopic":8813,"nextInTopic":8815,"prevInTime":8813,"nextInTime":8815,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"... How about as a next step try giving up even talking about 11 year olds studying things - but change the terminology to say they are learning about things","messageBody":"<div id=\"ygrps-yiv-235526284\">On Jan 6, 2006, at 10:26 AM, nrskay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But she<br/>\n&gt; is interested in studing animals, mainly cats and their behavior.  She<br/>\n&gt; has done a lot of research on her own through the computer.  She also<br/>\n&gt; is starting to volunteer with our vet a few hours each week.<br/>\n<br/>\n </span></blockquote>How about as a next step try giving up even talking about 11 year  <br/>\nolds &quot;studying&quot; things - but change the terminology to say they are  <br/>\nlearning about things by pursuing their interests in various ways. It  <br/>\nmay sound nitpicky, but it really helps to get away from that school- <br/>\nthink - the idea that to learn you have to &quot;study&quot; is wrong. &quot;Study&quot;  <br/>\nhas such a different ring to it and if we&#39;re trying to get away from  <br/>\n&quot;school-think&quot; we might want to let that word slip out of our  <br/>\nvocabulary for a while, along with &quot;teach.&quot; (I KNOW there are times  <br/>\nto use it - people say they &quot;study karate,&quot; for example. But - as an  <br/>\nexercise to help &quot;get&quot; unschooling better - try to use &quot;learn&quot; in  <br/>\nplace of &quot;study&quot; or &quot;teach&quot; whenever possible.<br/>\n<br/>\nI just spent 20 minutes reading up on an actor I&#39;d never seen - his  <br/>\nname is Kyle MacLachlan and he plays David Swain on &quot;In Justice.&quot; I  <br/>\nwasn&#39;t &quot;studying about Kyle MacLachlan&quot; - but I was learning about  <br/>\nhim. And the reason I was interested in him is because a young friend  <br/>\nof mine is playing David Swain as a young child - so I was curious  <br/>\nabout how much he actually looked like Kyle MacLachlan and one thing  <br/>\nled to another and I just satisfied my smidgen of curiosity about the  <br/>\nactor. Who knows - maybe if he&#39;d been absolutely fascinating I&#39;d have  <br/>\ngotten seriously interested and moved on to start an international  <br/>\nfan club. LOL - my point is that, yes, let&#39;s support our kids&#39;  <br/>\ninterests but, let&#39;s be careful about making too big a deal about  <br/>\nthem being on a &quot;path&quot; toward a career. LOTS of kids say they want to  <br/>\nbe vets when they are 11 years old. I did, myself. At 11, my 15 year  <br/>\nold, Rosie, was absolutely totally planning to have a career  <br/>\ninvolving horses. Now she says she wants to be a librarian. So we got  <br/>\nvery involved in 4-H and horses for several years and now she  <br/>\nvolunteers in the library every week and is doing a Girl Scout Silver  <br/>\nAward Project related to libraries. And she could very possibly end  <br/>\nup becoming a librarian. Maybe a horseback riding librarian &lt;G&gt;. But  <br/>\nmaybe she&#39;ll move on to something else. We parents have to be really  <br/>\ncareful about not getting ourselves over-excited about our young  <br/>\nkids&#39; plans - let them have those plans, but don&#39;t make such a big  <br/>\ndeal of them that we inadvertently make it hard for them to reconsider.<br/>\n<br/>\nIf we think of it MORE as supporting their current interests and not  <br/>\nas getting them prepared for the future, we&#39;ll do better by them.  <br/>\nReally - and it is worth talking a LOT about why that is true - so  <br/>\nI&#39;d suggest that those who aren&#39;t convinced or aren&#39;t sure they  <br/>\nunderstand why, please ask questions or go ahead and state the  <br/>\ncounter-arguments that might be running through your heads as you  <br/>\nread this, so that we can get them out in the open and dissect them.  <br/>\nIt might be a little hard to do - but VERY worth it. SO worth it!<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Newbie- unschooling and parent direction?","postDate":"1136610819","msgId":8813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNTlGRTVCLTRERkYtNDdDNS04NjUzLUQzQTNBOTRDQkVFOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRwbWJ0Nis3ZTZrQGVHcm91cHMuY29tPg==","referencesHeader":"PGRwbWJ0Nis3ZTZrQGVHcm91cHMuY29tPg=="},"prevInTopic":8800,"nextInTopic":8814,"prevInTime":8812,"nextInTime":8814,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"... There is NOTHING an 11 year old needs to do now to get ready for college. Absolutely nothing. ... She doesn t need to practice writing and math at 11 to go","messageBody":"<div id=\"ygrps-yiv-53745149\">On Jan 6, 2006, at 10:11 AM, kkraczek1969 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I were to discuss with my daughter her plans for the future, and<br/>\n&gt; she said that she wanted to go to college, would it be against the<br/>\n&gt; unschooling philosophy to give her direction on what types of things<br/>\n&gt; that she may need to do to get there?<br/>\n<br/>\n </span></blockquote>There is NOTHING an 11 year old needs to do now to get ready for  <br/>\ncollege. Absolutely nothing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For example, if I explain to her<br/>\n&gt; that she may need to practice writing and math?<br/>\n<br/>\n </span></blockquote>She doesn&#39;t need to practice writing and math at 11 to go to college  <br/>\nlater - probably at least 7 or more years away.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not forcing her to<br/>\n&gt; do these things, but I want her to at least be aware that these are<br/>\n&gt; things she would probably need to do.<br/>\n<br/>\n </span></blockquote>Are you really thinking that kids need to &quot;practice&quot; writing and math  <br/>\nin order to go to college? It isn&#39;t true. Try reading &quot;The  <br/>\nUnprocessed Child&quot; by Valerie Fitzenreiter if you don&#39;t believe me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is this too much direction?<br/>\n<br/>\n </span></blockquote>If you&#39;re misleading her into thinking that she needs to even THINK  <br/>\nabout college now - then it is not that it is too much, it is that it  <br/>\nis wrong. You need to get your own information right so that you can  <br/>\ngive her better counsel.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I<br/>\n&gt; just don&#39;t know if my daughter would even be aware of some things if I<br/>\n&gt; did not tell her.<br/>\n<br/>\n </span></blockquote>By the time she&#39;s 16, 17, 18, 19 -- she&#39;ll know lots of things that  <br/>\nyou don&#39;t know, too. She&#39;ll have lots of sources of information  <br/>\nbesides just you. In fact, part of your job is to help her become  <br/>\naware of OTHER sources of information. But not about college now. At  <br/>\n11 she shouldn&#39;t have to be THINKING at all about her future - at  <br/>\nleast not beyond the kid kind of thinking about what she wants to be  <br/>\nwhen she grows up - NOT to be held to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (Of course, she&#39;s only 11, but I want her to know<br/>\n&gt; all of her options, all of the time)<br/>\n<br/>\n </span></blockquote>That&#39;s not honest or a good idea. NOBODY can know all options all the  <br/>\ntime. Impossible. You&#39;re picking out college - but are you making  <br/>\nsure she knows ALL her options that don&#39;t involve college? Are you  <br/>\nmaking sure she knows what she&#39;d need to do to get into the Peace  <br/>\nCorps? The military? An apprenticeship? A technical school? Every  <br/>\npossible kind of career that she might eventually be interested in?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Please help me decide if I&#39;m getting too involved...<br/>\n<br/>\n </span></blockquote>Not too involved - involved in the wrong things. Concerned about the  <br/>\nwrong things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just know that<br/>\n&gt; my own options as a child were few, and I want my kids to do whatever<br/>\n&gt; makes them happy, but also to be prepared for anything!<br/>\n<br/>\n </span></blockquote>Impossible.<br/>\n<br/>\nBUT - support their CURRENT interests - get involved, be aware of  <br/>\nTHEIR passions. Observe them and how they choose to learn things -  <br/>\nwhat lights up their eyes, what gets their attention, what kinds of  <br/>\nthings do they keep coming back to, what do they talk about, and so on.<br/>\n<br/>\nYour job is to support those things while providing a rich  <br/>\nenvironment with a variety of options -- notice the word &quot;option&quot; -  <br/>\neverything is optional - but you do make sure that kids have lots of  <br/>\nopportunity to FIND their own interests and passions - lots of  <br/>\nexperience, lots to choose from.<br/>\n<br/>\nThe big THING about unschooling that is so amazing is that kids WILL  <br/>\nfigure out what they want to do and what it takes to do it when they  <br/>\nare used to -- guess what? Figuring out what they want to do and what  <br/>\nit takes to do it. But at 11, figuring out what she wants to do and  <br/>\nwhat it takes to do it means figuring out that she really likes to  <br/>\nplay dressups and that she needs to go to a thrift store to get more  <br/>\nthings to dress up in.<br/>\n<br/>\nYour part in that might be to notice that she&#39;s having a lot of fun  <br/>\nplaying dressups and you might say, &quot;Hey, while we&#39;re out let&#39;s stop  <br/>\nat the thrift store and see if you can find any cool dress-ups.&quot; If  <br/>\nshe&#39;s never heard of a thrift store before then there you go - you&#39;ve  <br/>\nintroduced her to something new. And while you&#39;re there, you might  <br/>\nsee some appliance that she&#39;s never seen - a waffle iron or a  <br/>\nwatering can....whatever. You&#39;ll say, &quot;Oh, look at this - how cool.&quot;  <br/>\nAnd if she&#39;s interested, you MIGHT talk about it and if she&#39;s REALLY  <br/>\ninterested you might buy it and go home and make waffles. And maybe  <br/>\nshe will enjoy that and you&#39;ll get into cooking a lot together -  <br/>\nstarting with making up unusual toppings for your waffles.<br/>\n<br/>\nOr maybe none of that will happen. Maybe while you&#39;re in the thrift  <br/>\nstore you&#39;ll see a handpainted umbrella and she&#39;ll say, &quot;Hey, I could  <br/>\ndo that - I could paint umbrellas and sell them.&quot; And you&#39;ll talk  <br/>\nabout what kind of paint to use and maybe get some and try it out and  <br/>\nwho knows where that might lead.<br/>\n<br/>\nOR - maybe you&#39;ll browse around, find a gorgeous wedding dress for  <br/>\nsale and buy it and she&#39;ll go home and play &quot;wedding&quot; for months and  <br/>\ndevelop a lifelong love of creating beautiful weddings and end up a  <br/>\nwedding planner.<br/>\n<br/>\nOR not. Maybe you&#39;ll just browse around and find nothing of interest  <br/>\nand leave and do something else. That&#39;s okay. Move on.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":229237531,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Newbie- unschooling and parent direction?","postDate":"1136581678","msgId":8800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQkVEQzJFLjIwMTA4MDVAZ21haWwuY29tPg==","inReplyToHeader":"PGRwbWRoOSs4c2V1QGVHcm91cHMuY29tPg==","referencesHeader":"PGRwbWRoOSs4c2V1QGVHcm91cHMuY29tPg=="},"prevInTopic":8796,"nextInTopic":8813,"prevInTime":8799,"nextInTime":8801,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"... As a former academic, I think the best thing *any* parent can do to help a child prepare for a career is to help them get hands-on experience--internships,","messageBody":"<div id=\"ygrps-yiv-1021331017\">kkraczek1969 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thanks Kay :)<br/>\n&gt;<br/>\n&gt; My daughter wants to work with animals as well- she wants to be a<br/>\n&gt; dolphin trainer at SeaWorld! (Or a chef, or a paleontologist, or an<br/>\n&gt; artist... ;)  ) We had asked what type of training is required to be a<br/>\n&gt; dolphin trainer, and were told that a Psychology degree would be her<br/>\n&gt; best bet.<br/>\n<br/>\n<br/>\n </span></blockquote>As a former academic, I think the best thing *any* parent can do to help <br/>\na child prepare for a career is to help them get hands-on <br/>\nexperience--internships, other volunteer work, self-employment, etc.<br/>\n<br/>\nUnschoolers are particularly well-suited to facilitate this kind of <br/>\nexperience, and it&#39;s what will make the single biggest difference, <br/>\nimnsho, whether on a college track or not.<br/>\n<br/>\nInterested in a career that works with animals? The math can fall into <br/>\nplace very quickly when it&#39;s time for tests. In the meantime, consider <br/>\nvolunteering at a local vet or animal shelter, starting a pet-sitting or <br/>\ndog-walking or clean-up service. Make contacts, get experience. This is <br/>\nwhat impresses employers and admissions officers both.<br/>\n<br/>\n-- <br/>\n~~Danielle<br/>\nEmily (8), Julia (7), Sam (5)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a><br/>\n<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*<br/>\n<br/>\n&quot;With our thoughts, we make the world.&quot; ~~Buddha</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Newbie- unschooling and parent direction?","postDate":"1136572889","msgId":8796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwbWRrcCs2Z2llQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwbWJ0Nis3ZTZrQGVHcm91cHMuY29tPg=="},"prevInTopic":8795,"nextInTopic":8800,"prevInTime":8795,"nextInTime":8797,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"How about helping her find out the requirements and then discuss with her how to develop those skills rather than telling her okay college means you have to","messageBody":"<div id=\"ygrps-yiv-1932306484\">How about helping her find out the requirements and then discuss <br/>\nwith her how to develop those skills rather than telling her &quot;okay <br/>\ncollege means you have to do writing and math let&#39;s get the <br/>\nworkbooks&quot; - if her writing and math skills aren&#39;t &#39;ready&#39; when she <br/>\napplies, she might need to take remedial classes. But guess what? <br/>\nThose classes are already there and are typically filled with public <br/>\nhigh school graduates. There are lots of ways to develop writing and <br/>\nmath skills. Discuss them together. Depending on what she wants to <br/>\npursue (assuming she chooses college), she may be able to simply <br/>\ntake a CLEP test (college level exam for placement) and have that <br/>\ncount for all the math she&#39;ll need (DH took all the CLEP tests at <br/>\nage 27 when he started college and got about 1 1/2 semesters worth <br/>\nof credit for spending some $ to pay for the tests and some time, a <br/>\ncouple hours each test, and was able to skip most of the general <br/>\ncourses like fine arts, math, science, comp 101, etc. Not only was <br/>\nthe cost of the tests less than the cost of the credit hours but it <br/>\nfreed up space in his schedule to fit courses he took for enjoyment <br/>\nthat wouldn&#39;t otherwise fit into an undergraduate major).<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":245074059,"authorName":"kkraczek1969","from":"&quot;kkraczek1969&quot; &lt;kkraczek1969@...&gt;","profile":"kkraczek1969","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Newbie- unschooling and parent direction?","postDate":"1136572777","msgId":8795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwbWRoOSs4c2V1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwbWNwYStlNGg1QGVHcm91cHMuY29tPg=="},"prevInTopic":8794,"nextInTopic":8796,"prevInTime":8794,"nextInTime":8796,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"Thanks Kay :) My daughter wants to work with animals as well- she wants to be a dolphin trainer at SeaWorld! (Or a chef, or a paleontologist, or an artist...","messageBody":"<div id=\"ygrps-yiv-1305738284\">Thanks Kay :)<br/>\n<br/>\nMy daughter wants to work with animals as well- she wants to be a<br/>\ndolphin trainer at SeaWorld! (Or a chef, or a paleontologist, or an<br/>\nartist... ;)  ) We had asked what type of training is required to be a<br/>\ndolphin trainer, and were told that a Psychology degree would be her<br/>\nbest bet.<br/>\n<br/>\nI agree with you Kay- she will definitely do it when she&#39;s ready. In<br/>\nthe meantime I love watching and listening to her fascination with<br/>\nanimals- and art, and cooking, and... everything!<br/>\n<br/>\nAgain, I just didn&#39;t know if it would be too pushy to inform her of<br/>\nrequirements and such when the subject comes up. <br/>\n<br/>\nThanks for your help- I don&#39;t think I ever would have considered<br/>\nunschooling if not for these boards!<br/>\n<br/>\nKristin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Kristen:<br/>\n&gt; <br/>\n&gt; My dd, 11, wants to be a vet.  She has asked what she will need to <br/>\n&gt; study in order to be one.  I have told her, but at this point she is <br/>\n&gt; not ready to study the science, biology or the math needed.  But she <br/>\n&gt; is interested in studing animals, mainly cats and their behavior.  She <br/>\n&gt; has done a lot of research on her own through the computer.  She also <br/>\n&gt; is starting to volunteer with our vet a few hours each week.<br/>\n&gt; <br/>\n&gt; For us, I feel that when my dd is ready to start studying the <br/>\n&gt; sciences, biology and math, she will.  Here in CA she will be able to <br/>\n&gt; attend the jr. college and receive dual credit (high school/community <br/>\n&gt; college).<br/>\n&gt; <br/>\n&gt; Eleven is still young enough to just enjoy life and pursue her own <br/>\n&gt; interest and she will decided when she is ready to seek the knowledge <br/>\n&gt; needed to pursue a certain career.<br/>\n&gt; <br/>\n&gt; Kay<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":248175779,"authorName":"nrskay","from":"&quot;nrskay&quot; &lt;k_bird@...&gt;","profile":"nrskay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Newbie- unschooling and parent direction?","postDate":"1136572010","msgId":8794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwbWNwYStlNGg1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwbWJ0Nis3ZTZrQGVHcm91cHMuY29tPg=="},"prevInTopic":8792,"nextInTopic":8795,"prevInTime":8793,"nextInTime":8795,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"Kristen: My dd, 11, wants to be a vet.  She has asked what she will need to study in order to be one.  I have told her, but at this point she is not ready to","messageBody":"<div id=\"ygrps-yiv-683517409\">Kristen:<br/>\n<br/>\nMy dd, 11, wants to be a vet.  She has asked what she will need to <br/>\nstudy in order to be one.  I have told her, but at this point she is <br/>\nnot ready to study the science, biology or the math needed.  But she <br/>\nis interested in studing animals, mainly cats and their behavior.  She <br/>\nhas done a lot of research on her own through the computer.  She also <br/>\nis starting to volunteer with our vet a few hours each week.<br/>\n<br/>\nFor us, I feel that when my dd is ready to start studying the <br/>\nsciences, biology and math, she will.  Here in CA she will be able to <br/>\nattend the jr. college and receive dual credit (high school/community <br/>\ncollege).<br/>\n<br/>\nEleven is still young enough to just enjoy life and pursue her own <br/>\ninterest and she will decided when she is ready to seek the knowledge <br/>\nneeded to pursue a certain career.<br/>\n<br/>\nKay</div>","specialLinks":[]},{"userId":245074059,"authorName":"kkraczek1969","from":"&quot;kkraczek1969&quot; &lt;kkraczek1969@...&gt;","profile":"kkraczek1969","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Newbie- unschooling and parent direction?","postDate":"1136571110","msgId":8792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwbWJ0Nis3ZTZrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":8794,"prevInTime":8791,"nextInTime":8793,"topicId":8792,"numMessagesInTopic":0,"msgSnippet":"Hi, I apologize if this has been answered before, but I don t quite have a grip on this particular question, even with all that I have read. If I were to","messageBody":"<div id=\"ygrps-yiv-1875955999\">Hi, I apologize if this has been answered before, but I don&#39;t quite<br/>\nhave a grip on this particular question, even with all that I have read.<br/>\n<br/>\nIf I were to discuss with my daughter her plans for the future, and<br/>\nshe said that she wanted to go to college, would it be against the<br/>\nunschooling philosophy to give her direction on what types of things<br/>\nthat she may need to do to get there? For example, if I explain to her<br/>\nthat she may need to practice writing and math? I&#39;m not forcing her to<br/>\ndo these things, but I want her to at least be aware that these are<br/>\nthings she would probably need to do. Is this too much direction? I<br/>\njust don&#39;t know if my daughter would even be aware of some things if I<br/>\ndid not tell her. (Of course, she&#39;s only 11, but I want her to know<br/>\nall of her options, all of the time) <br/>\n<br/>\nPlease help me decide if I&#39;m getting too involved... I just know that<br/>\nmy own options as a child were few, and I want my kids to do whatever<br/>\nmakes them happy, but also to be prepared for anything!<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\nKristin<br/>\nMom to Alex(14) Haley (11) and Rachel (9)</div>","specialLinks":[]}],"prevTopicId":8791,"nextTopicId":8821}}