{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"The Continuum Concept","postDate":"1153487523","msgId":15934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5cWpyMytmYmQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":15931,"nextInTopic":0,"prevInTime":15933,"nextInTime":15935,"topicId":15931,"numMessagesInTopic":0,"msgSnippet":"I think that too often, a mom will come here and complain that she has no life---she gives it all to her children. She NEEDS her own life. And her children","messageBody":"<div id=\"ygrps-yiv-948683021\">&quot;I think that too often, a mom will come here and complain that she has<br/>\nno life---she gives it all to her children. She NEEDS her own life. And<br/>\nher children NEED to see that too.&quot;<br/>\n<br/>\nYes. I mentioned in a recent post that having our &quot;own life&quot; includes<br/>\nhaving children. They ARE central but what Kelly ( and I think Jean L)<br/>\nare saying, is parents need to be living THEIR dreams.<br/>\n<br/>\nKids are part of our &quot;dream life&quot; obviously...a BIG part. But if<br/>\nthat&#39;s ALL a parent has, if her kids are her only passion and<br/>\ninterest, I don&#39;t believe that&#39;s a very helpful way to raise<br/>\nunschoolers! It isn&#39;t showing your child what a passionate life looks<br/>\nlike. And I don&#39;t mean everyone in the world needs driving PASSIONS<br/>\ngoing in a million different directions. A passionate life is more<br/>\nabout living in tune with yourself, your interests, your values and<br/>\nliving gratefully and abundantly!:)<br/>\n<br/>\nKelly and I read some article that used the tag &quot;helicopter parents&quot;,<br/>\nthese parents that hover and are constantly checking their children,<br/>\nmicro-directing their activities etc... <br/>\nWhile I don&#39;t think unschoolers are trying to direct their children&#39;s<br/>\nactivities constantly, I HAVE met folks trying to understand<br/>\nunschooling that are so hyperfocused on their kids (and what the kids<br/>\nare, or are not learning) that they seem to have no life if their own,<br/>\nno interests, no driving passions.<br/>\n<br/>\nI think some of our greatest moments unfold around here, when I&#39;m deep<br/>\ninto some project of my own and the kids swirl in (and sometimes back<br/>\nout). Art is a big part of my life, so I&#39;ll use that as an example.<br/>\n<br/>\nI set up an art area in the garage. All of our supplies and such are<br/>\ndown there, it&#39;s a huge, happy mess. I made sure to put a desk and<br/>\nchair for smaller people,so they can get to paper and other supplies<br/>\nwith ease. I was down there yesterday, creating spirit dolls. Sierra<br/>\nwanders in and gets excited, so I help her start one of her own. Jalen<br/>\neventually joins us and starts painting and stamping. <br/>\n<br/>\nThis is a frequent scenario. I&#39;m involved in something, and the kids<br/>\njoin in as they choose. All of the family has asked questions about<br/>\nthe dolls and given me their opinion on different ones. Our interests<br/>\noverlap and affect each other, that&#39;s the way interests work.<br/>\n<br/>\nWhile I was showing the boys a new doll, they were excitedly telling<br/>\nme about their day on World of Warcraft and how they were killing off<br/>\nAlliance characters from a vantage point that left the enemy baffled.<br/>\nThey were having SO much fun with it! <br/>\n<br/>\nThe whole point is, do the parents have activities they joyfully<br/>\nparticipate in just because they enjoy it? Do the parents KNOW what<br/>\ntheir interests and passions are?  Are they actively pursuing the<br/>\nthings that bring joy?  I think there&#39;s a balance of meeting our<br/>\nchildren&#39;s needs and also having an interesting, full and bubbly life<br/>\nthat shows them what an authentic life looks like!<br/>\n<br/>\nIf you have very young children, it&#39;s hard to imagine having any<br/>\ntime...but it will come. And in the mean time, interests can be<br/>\nadapted to fit around those very young children in smaller doses.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":78134331,"authorName":"Genant2@aol.com","from":"Genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Continuum Concept","postDate":"1153486145","msgId":15931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJlZi4zNjI1M2EuMzFmMjI3NDFAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":15934,"prevInTime":15930,"nextInTime":15932,"topicId":15931,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/21/2006 8:13:52 A.M. Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: In her  book The Continuum Concept, she also starts","messageBody":"<div id=\"ygrps-yiv-1380375482\">In a message dated 7/21/2006 8:13:52 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n<br/>\nIn her  book The Continuum Concept, she also starts by saying that <br/>\nwhat the  children want is not a permissive parent but a &quot;strong, <br/>\nbusy, central  figure to whom he can be peripheral (...)&quot;. I thought <br/>\nRU was about being  parallel with our children...Need some  <br/>\nclarification!&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nThe book, The Continuum Concept, is not about radical unschooling.   Although <br/>\nI loved the book and that is what started our family on our path of  living <br/>\nconsensually before we even had children.  Here is a description  from the <br/>\nsite:   <br/>\n&quot;Though not written as a child-rearing manual, The Continuum Concept  has <br/>\nearned a reputation as an excellent resource for parents and parents-to-be  who <br/>\nintuitively feel that the parenting &quot;techniques&quot; of the modern era are  <br/>\ninherently misguided. It has also been helpful to many adults — parents and  <br/>\nnon-parents alike — who hope to recover the natural state of happiness lost as a  <br/>\nresult of the modern child-rearing practices of their well-meaning parents.&quot; <br/>\nI do agree with her that children need to be able to see  parents/adults in <br/>\naction.  My children need to see that I have interests  and passions and see me <br/>\nworking at those.  That is very much a part of it  for us.  And I believe my <br/>\nhusband and I are sort of like anchors or  &quot;central figures&quot;.  Our boys know <br/>\nthey can always come to us, and  we are strong individuals.  We will be there <br/>\nto help, guide, talk things  over, just listen, whatever they need.  And that <br/>\nwe will help the best we  can.  We do live consensually, but having a bit more <br/>\nlife experience, my  boys know that we might have more information, more <br/>\ninsight, more ideas  (although not always LOL).    <br/>\nAnyway this is getting long for me, LOL <br/>\nPam G<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15927,"nextTopicId":15817}}