{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148622741","msgId":13674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1NjUybCtjNW9pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU1NXA3aytoNjJmQGVHcm91cHMuY29tPg=="},"prevInTopic":13669,"nextInTopic":0,"prevInTime":13673,"nextInTime":13675,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... her bedroom is so tiny that she d lose all her play space if we put a big bed in her room.  When she s a little older, she might not mind that too much but","messageBody":"<div id=\"ygrps-yiv-942008274\"><blockquote><span title=\"ireply\">&gt; My dd8 would really like a queen bed, or at least a double bed, but <br/>\n </span></blockquote>her bedroom is so tiny that she&#39;d lose all her play space if we put a <br/>\nbig bed in her room.  When she&#39;s a little older, she might not mind <br/>\nthat too much but she enjoys having her space right now so has <br/>\nresigned herself to keep the twin size.  :)&gt;&gt;&gt;<br/>\n<br/>\nMy dd (13) has a queen sleigh bed now, we bought it last year when <br/>\nshopping for new furniture for our room, she saw it and loved it, so <br/>\nwe said what the heck!   Before that she was using my old canopy bed <br/>\nfrom when I was young (twin).   It DOES take up a good chunk of the <br/>\nroom, but now that she&#39;s older, play space has changed (to computer <br/>\nand TV!) and she doesn&#39;t mind.<br/>\n(Beth, I notice you&#39;re on &quot;shine&quot; too, both my dh and dd are HSPs!  <br/>\nadds to the mix of working out this new life style, but never a dull <br/>\nmoment!  I&#39;m glad I found the info on HS, it&#39;s helped SO much knowing!)<br/>\nJann</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148610612","msgId":13669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1NXA3aytoNjJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU1NTU0NitnZ3ZyQGVHcm91cHMuY29tPg=="},"prevInTopic":13652,"nextInTopic":13674,"prevInTime":13668,"nextInTime":13670,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... Oh!  That makes sense.  My dd8 would really like a queen bed, or at least a double bed, but her bedroom is so tiny that she d lose all her play space if we","messageBody":"<div id=\"ygrps-yiv-203713120\"><blockquote><span title=\"ireply\">&gt; The bed I&#39;m in is a kingsize and the master bedroom is the only<br/>\n&gt; one it will fit in (we just built this house last year!). <br/>\n&gt; Jann<br/>\n<br/>\n </span></blockquote>Oh!  That makes sense.  My dd8 would really like a queen bed, or at <br/>\nleast a double bed, but her bedroom is so tiny that she&#39;d lose all her <br/>\nplay space if we put a big bed in her room.  When she&#39;s a little <br/>\nolder, she might not mind that too much but she enjoys having her <br/>\nspace right now so has resigned herself to keep the twin size.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148590022","msgId":13652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1NTU0NitnZ3ZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU1NHYxMit1YnNtQGVHcm91cHMuY29tPg=="},"prevInTopic":13649,"nextInTopic":13669,"prevInTime":13651,"nextInTime":13653,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... be moved?  I mean, not that I m saying you have to change, but just to throw the idea out there. The bed I m in is a kingsize and the master bedroom is","messageBody":"<div id=\"ygrps-yiv-364672420\"><blockquote><span title=\"ireply\">&gt; Please forgive me if this comes across as stupid, but can&#39;t the beds <br/>\n </span></blockquote>be moved?  I mean, not that I&#39;m saying you have to change, but just to <br/>\nthrow the idea out there.&gt;&gt;&gt;<br/>\n<br/>\nThe bed I&#39;m in is a kingsize and the master bedroom is the only one it <br/>\nwill fit in (we just built this house last year!).  The other bedrooms <br/>\nare smaller, so, it&#39;s not feasible to move them around.  Not knowing <br/>\nthe layout we have, it&#39;s not a stupid question at all! Actually, as I <br/>\nposted before, he sleeps with the radio on in his ear all night and <br/>\nsnores loud enough for me to hear him through the wall! (I have to run <br/>\na fan for white noise!), I think it&#39;s more that he wakes up to use the <br/>\nbathroom and realizes she&#39;s still up, but I&#39;m not witnessing it to <br/>\nknow for sure.   No biggie, we&#39;re trying the headphones and dd being <br/>\nmore aware of the volume!<br/>\n<br/>\nI&#39;m hoping after this weekend at the conference (he&#39;s not going to all <br/>\nof it, but agreed to some), that he&#39;ll get a better picture of <br/>\nunschooling.  I&#39;m really looking forward to it, and to meeting so many <br/>\nI&#39;ve only met in cyber space!<br/>\nJann</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148583778","msgId":13649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1NHYxMit1YnNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU1NHQ5aitwZW50QGVHcm91cHMuY29tPg=="},"prevInTopic":13647,"nextInTopic":13652,"prevInTime":13648,"nextInTime":13650,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... Yes, I ve heard the argument.  Let s see... 1. Children need to wake up early to go to school even if they are homeschooled because we have to help them","messageBody":"<div id=\"ygrps-yiv-979238666\"><blockquote><span title=\"ireply\">&gt; Mine is more worried about &quot;later on&quot;, that she WON&#39;T be able to<br/>\n&gt; get up or change her sleep habits.<br/>\n<br/>\n </span></blockquote>Yes, I&#39;ve heard the argument.  Let&#39;s see...<br/>\n<br/>\n1. Children need to wake up early to go to school even if they are <br/>\nhomeschooled because we have to help them form the habit so when <br/>\nthey become adults they&#39;ll know how to wake up on time when they <br/>\nhave jobs.<br/>\n<br/>\n2. Kids are healthier when they go to bed early and wake up early.<br/>\n<br/>\n3. Our forefathers used to wake/work/sleep with the sun&#39;s pattern.  <br/>\nThey woke up at dawn and went to bed at dusk.  We&#39;d be better <br/>\nworkers if we kept that tradition.<br/>\n<br/>\nThose are the first three off the top of my head.  *laugh*  Before I <br/>\nbecame a college student, I worked at the university.  One of the <br/>\nfirst things I learned was that morning classes were the least <br/>\npopular among students and professors.  Very few people wanted to go <br/>\nto bed early and wake up early if they didn&#39;t have to do so.  Since <br/>\nbecoming a homeschooling parent and hearing this argument that our <br/>\nchildren won&#39;t know how to wake up early if we don&#39;t &quot;teach&quot; them, <br/>\nI&#39;ve often wondered how long it takes to undo that teaching.  If a <br/>\ncollege student spends all his/her time taking afternoon classes and <br/>\nnever waking up early, will his conditioning from childhood kick <br/>\nback in when they graduate and have to work?  Was there ever <br/>\nconditioning?  Or was it just a control that parents insist on <br/>\nbecause it&#39;s the parent-y kind of thing to do?  Couldn&#39;t the <br/>\nstudent, child, adult, etc. now be motivated to get up early in <br/>\ntheir anticipation or obligation of responsibility of going to work?<br/>\n<br/>\nIn helping your DH see this, ask him if the only reason he wakes up <br/>\nin the morning to go to work is because his mom and dad forced him <br/>\nto keep those &#39;normal&#39; hours?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unfortunately the sleeping locations can&#39;t be changed.<br/>\n&gt; Jann<br/>\n<br/>\n </span></blockquote>Please forgive me if this comes across as stupid, but can&#39;t the beds <br/>\nbe moved?  I mean, not that I&#39;m saying you have to change, but just <br/>\nto throw the idea out there.<br/>\n<br/>\nWe&#39;re tossing around ideas for our own family right now.  My dd14 <br/>\nhas the huge bedroom downstairs.  It&#39;s even larger than our master <br/>\nsuite!  But!!!, she doesn&#39;t have a bathroom.  We might switch with <br/>\nher, giving her the master suite, but we haven&#39;t yet decided what to <br/>\ndo.  The two younger kids are also kind of vying for that space.  <br/>\nWe&#39;re just trying to figure out how we would all best fit into this <br/>\nhome.  We&#39;re not a traditional family, obviously, so we don&#39;t really <br/>\ncare too much if we&#39;re in the master suite or not.  But we do care <br/>\nabout being near a bathroom because we&#39;re old and wake up in the <br/>\nmiddle of the night.  *lol*<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148582003","msgId":13647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1NHQ5aitwZW50QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU1NDhmcCszYm1rQGVHcm91cHMuY29tPg=="},"prevInTopic":13625,"nextInTopic":13649,"prevInTime":13646,"nextInTime":13648,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... children get more sleep than he does because there is no particular reason to wake them up so early.  However, when we do need to wake up to do something","messageBody":"<div id=\"ygrps-yiv-24598206\"><blockquote><span title=\"ireply\">&gt; He was worried about their health.  But I pointed out that our <br/>\n </span></blockquote>children get more sleep than he does because there is no particular <br/>\nreason to wake them up so early.  However, when we do need to wake <br/>\nup to do something particular, they aren&#39;t dragging, grumpy and <br/>\nwhining.  It&#39;s usually an activity of their choice or something <br/>\ntruly necessary that they don&#39;t mind waking up for.&gt;&gt;&gt;<br/>\n<br/>\nMine is more worried about &quot;later on&quot;, that she WON&#39;T be able to get <br/>\nup or change her sleep habits.   It will take time for him to truly <br/>\nunderstand that if and when she wants/needs to change because of <br/>\nwhat she wants to do with her life, then she will make the changes <br/>\nnecessary!  And because this is so new to us, she&#39;s still <br/>\ndeschooling and healing, so I know it will take some time.   She, <br/>\ntoo, will get up if there&#39;s something of her choosing to do the next <br/>\nday.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One change I might suggest is the location of everyone&#39;s sleeping <br/>\n </span></blockquote>places.  Since you and he sleep in different rooms, is it possible <br/>\nto change places so that he&#39;s not near your daughter&#39;s room and late <br/>\nnight noises?&gt;&gt;&gt;&gt;<br/>\n<br/>\nUnfortunately the sleeping locations can&#39;t be changed.  I have <br/>\nchronic back pain, the bed we have now is the best I can tolerate, <br/>\nthe bed (futon) in the room that dh is sleeping on would not be a <br/>\ngood choice for me.   I DID consider that switching would be ideal, <br/>\nbut it won&#39;t work in this case.<br/>\n<br/>\nMy dd was more aware last night of the volume and dh said he didn&#39;t <br/>\nnotice it, so, for now, it&#39;s working out.<br/>\n<br/>\nThanks for everyone&#39;s thoughts!<br/>\nJann</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148560697","msgId":13625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1NDhmcCszYm1rQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU1MXU5OCs0dGg3QGVHcm91cHMuY29tPg=="},"prevInTopic":13611,"nextInTopic":13647,"prevInTime":13624,"nextInTime":13626,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... If he s open to the idea of talking and of being challenged, like we are on this list, you could ask him how his sleep patterns would be different if he","messageBody":"<div id=\"ygrps-yiv-1998288176\"><blockquote><span title=\"ireply\">&gt; (some of this, I think, is that he is resentful of having to<br/>\n&gt; get up early, NONE of us are morning people, and he&#39;d really<br/>\n&gt; rather not have to!   But he does it).<br/>\n&gt; Jann<br/>\n<br/>\n </span></blockquote>If he&#39;s open to the idea of talking and of being challenged, like we <br/>\nare on this list, you could ask him how his sleep patterns would be <br/>\ndifferent if he didn&#39;t have to wake up early for work.  What if his <br/>\nhours changed and he could work 11am to 7pm or something <br/>\nhypothetical.  Would he still think it was important to go to bed at <br/>\na certain time and wake up early to begin his day?  <br/>\n<br/>\nI&#39;ve just had this conversation with my DH and children.  My DH <br/>\ndidn&#39;t mind the change in bedtimes at first but did grow concerned <br/>\nafter a while.  He was worried about their health.  But I pointed <br/>\nout that our children get more sleep than he does because there is <br/>\nno particular reason to wake them up so early.  However, when we do <br/>\nneed to wake up to do something particular, they aren&#39;t dragging, <br/>\ngrumpy and whining.  It&#39;s usually an activity of their choice or <br/>\nsomething truly necessary that they don&#39;t mind waking up for.  <br/>\n<br/>\nOne change I might suggest is the location of everyone&#39;s sleeping <br/>\nplaces.  Since you and he sleep in different rooms, is it possible <br/>\nto change places so that he&#39;s not near your daughter&#39;s room and late <br/>\nnight noises?  In our house, our kids rooms are directly across from <br/>\nour bedroom, so they do not play in their bedrooms after we&#39;ve gone <br/>\nto sleep.  They are either in the living room or downstairs in my <br/>\ndd14&#39;s room.  Then when they do go to bed, they are quiet and we <br/>\noften sleep right through them getting into pjs, brushing teeth, <br/>\netc.  Now that my DH isn&#39;t getting disturbed anymore, he&#39;s not <br/>\nconcerned about our children staying up late anymore.<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148499250","msgId":13611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1MmNmaSs3ajRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERCRTk2NEVCLUJFMTktNDhFOS04NjJBLURFMDE4QUFGM0E5NEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":13610,"nextInTopic":13625,"prevInTime":13610,"nextInTime":13612,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... $40 or less. (In fact, we re going to move into a 2-bedroom apartment for the next 6 or so months….  I m going to check out those wireless headphones","messageBody":"<div id=\"ygrps-yiv-1469702871\"><blockquote><span title=\"ireply\">&gt;Get her headphones for the tv  there are wireless ones that cost <br/>\n </span></blockquote>$40 or less. (In fact, we&#39;re going to move into a 2-bedroom <br/>\napartment for the next 6 or so months. &gt;<br/>\n<br/>\nI&#39;m going to check out those wireless headphones for sure!   EEK!  <br/>\nGood luck moving into a smaller place, I&#39;m glad to hear it&#39;s <br/>\ntemporary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It is annoying to have to get up - wakes you up even more and makes <br/>\n </span></blockquote>it harder to get back to sleep and then the noise in the background <br/>\nis just MORE annoying. So I understand why he doesn&#39;t want to have <br/>\nto get up and ask her to turn it down.&gt;&gt;<br/>\n<br/>\nOddly enough, he has his radio on all night (he likes the &quot;noise&quot; in <br/>\nthe background, his own version of &quot;white noise&quot;), another reason we <br/>\ndon&#39;t do well sleeping in the same room!.  So, in a way I find it <br/>\nodd that he&#39;s even hearing the sound from her room  makes me wonder <br/>\nif a lot of it is more that he wakes up to use the bathroom, <br/>\nrealizes she&#39;s still up and is bothered because &quot;it&#39;s not normal&quot;.   <br/>\n(and he usually falls to sleep VERY quickly, even after getting up, <br/>\nso not sure about that either).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve asked my husband not to complain to me about the kids. He <br/>\n </span></blockquote>still does it once in a while and I just say, &quot;Is there something <br/>\nspecific you&#39;re asking me to do?&quot; If he said, &quot;I want you to make <br/>\nher go to bed,&quot; then we could talk about that - but I won&#39;t listen <br/>\nto him whining on about them just for the sake of venting because <br/>\nhe&#39;s too prone to get negative and focus on faults and not ever <br/>\nnotice the wonderful amazing people they really are.&gt;<br/>\n<br/>\nBoy, you could have written this about my dh!   I&#39;ll have to try <br/>\nasking if he has a specific request.<br/>\n<br/>\nI&#39;ve seen the info on the nhen site (sent it to him at work.... <br/>\nwe&#39;ll see if he checks it out, he usually does if it&#39;s not too <br/>\nlengthy!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My husband, too. And he genuinely doesn&#39;t seem to be able to &quot;get&quot;<br/>\n </span></blockquote>how that affects our ability to discuss things.&gt;<br/>\n<br/>\nGlad to hear it&#39;s not just here (of course, I know I&#39;m not the only <br/>\none with a dh who isn&#39;t totally on-board!).  He has 3 older <br/>\nbrothers, and his mother was VERY intrusive and nagging.  We&#39;ve <br/>\ntalked MANY times about all of this, but I wish he would try harder <br/>\nto approach his relationship with his daughter in a more respectful <br/>\nway, instead of &quot;playing the old tapes&quot;.   And I know I have to try <br/>\nharder to be more respectful of him, even though he still has his <br/>\nown issues surrounding trust and self-worth.<br/>\n<br/>\nThanks for your input!   You&#39;ve given me more to think about!<br/>\nJann</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: DH doesn&#39;t get it - help","postDate":"1148497287","msgId":13610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1MmFpNytkNmFpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcuMC4xLjAuMC4yMDA2MDUyNDEyMTIzMy4wMWFjMGE1MEBnYWlhd29sZi5vcmc+"},"prevInTopic":13606,"nextInTopic":13611,"prevInTime":13609,"nextInTime":13611,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... disturbing anyone s sleep.  It s just not the right thing to do! We talked about using headphones, she s going to try that.  She DOES understand, just","messageBody":"<div id=\"ygrps-yiv-590558333\"><blockquote><span title=\"ireply\">&gt;&gt;At any rate, she needs to understand fully that she shouldn&#39;t be <br/>\n </span></blockquote>disturbing anyone&#39;s sleep.  It&#39;s just not the right thing to do!&gt;&gt;<br/>\n<br/>\nWe talked about using headphones, she&#39;s going to try that.  She DOES <br/>\nunderstand, just didn&#39;t realize that the sound was carrying so <br/>\nmuch.  When I was staying up late with her I would remind her to <br/>\nturn it down a bit if need be, but when it&#39;s just her she gets <br/>\nabsorbed and doesn&#39;t think about it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I would really feel pissed off if I had to do that were I in his <br/>\n </span></blockquote>shoes, and I might say all kinds of mean, nasty things I don&#39;t <br/>\nmean!  And some of it may be that he&#39;s feeling like his needs aren&#39;t <br/>\nbeing considered.&gt;&gt;&gt;<br/>\n<br/>\nI didn&#39;t really think about it that way, you&#39;re right, I&#39;m not <br/>\nrespecting HIS needs at all!  Mean and nasty because he was woken up <br/>\nis understandable, it&#39;s when he&#39;s awake at other times and doesn&#39;t <br/>\nrealize how his tone can be a turn off (been there, done that!) that <br/>\ncan makes communicating effectively difficult.<br/>\nWe both tend to react to conflict in the same way as when we were <br/>\ngrowing up (combative and defensive).  Neither of us had the kind of <br/>\nsupport where we were really &quot;heard&quot; and I work very hard at being <br/>\nrespectful of my daughter, but I sometimes don&#39;t do as much as I can <br/>\nfor my husband, because I&#39;m responding on an emotional level, <br/>\nanticipating his negativity.<br/>\n<br/>\nBeyond this is the issue that he thinks she should be going to sleep <br/>\nearlier, &quot;it&#39;s not normal&quot; etc.   I need to think some more on this <br/>\npart.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I bet if your husband feels that his needs are being considered, <br/>\n </span></blockquote>it may help the situation greatly.  It will also help for your <br/>\ndaughter in many ways to feel that she&#39;s part of the solution.  The <br/>\nalternative of her not playing at night could only breed resentment, <br/>\nwhich is partly what your husband is probably feeling now.&gt;&gt;<br/>\n<br/>\nI DO want her to feel she&#39;s part of the solution, not just being <br/>\ntold she needs to go to bed earlier because he is bothered by it <br/>\n(one of his balloons).   NOT playing at night is not an option for <br/>\nthe reason you state above!   I don&#39;t have problem with her staying <br/>\nup at all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve tried talking to him about how allowing her to make her own <br/>\n </span></blockquote>choices isn&#39;t hurting anyone, and how it&#39;s an important part of <br/>\nunschooling, but he doesn&#39;t see it that way.&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;But, in this case, her choices are &quot;hurting&quot; someone.  Him!  Not a <br/>\n </span></blockquote>good idea if you&#39;re trying to get his support!  ;-)&gt;&gt;<br/>\n<br/>\nAgain, you&#39;re right.   What I wrote is partially true, but I didn&#39;t <br/>\nfinish the connection.  Staying up late isn&#39;t going to turn her into <br/>\na useless human being (is what I meant) but didn&#39;t take it one step <br/>\nfurther in that if she&#39;s making enough sound to disturb his sleep, <br/>\nthen it IS hurting him.  Respect goes both ways.  I can really see <br/>\nhow it has improved things between my dd and I.  We need to work <br/>\nharder on including dad more (sometimes it&#39;s hard when he doesn&#39;t <br/>\nwant to meet us half way though!)<br/>\n<br/>\nThanks for your input Marji, I really appreciate it.   Looking <br/>\nforward to meeting you!<br/>\nJann</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] DH doesn&#39;t get it - help","postDate":"1148488326","msgId":13606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCRTk2NEVCLUJFMTktNDhFOS04NjJBLURFMDE4QUFGM0E5NEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU1MXU5OCs0dGg3QGVHcm91cHMuY29tPg==","referencesHeader":"PGU1MXU5OCs0dGg3QGVHcm91cHMuY29tPg=="},"prevInTopic":13605,"nextInTopic":13610,"prevInTime":13605,"nextInTime":13607,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... Rearrange things - be creative. Get her headphones for the tv - there are wireless ones that cost $40 or less. (In fact, we re going to move into a","messageBody":"<div id=\"ygrps-yiv-80806158\">On May 24, 2006, at 8:31 AM, jlh44music wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; etimes be, and doesn&#39;t self regulate the<br/>\n&gt; level) and it wakes him up.<br/>\n<br/>\n </span></blockquote>Rearrange things - be creative. Get her headphones for the tv - there  <br/>\nare wireless ones that cost $40 or less. (In fact, we&#39;re going to  <br/>\nmove into a 2-bedroom apartment for the next 6 or so months - after  <br/>\nliving in our own 4-bedroom house for years and now in a huge  <br/>\nspacious house for the past 3 months. We&#39;re going to need to figure  <br/>\nout how to handle noise - and I&#39;m about to go order several sets  <br/>\nwireless headphones.)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I suggested he get up and ask her to<br/>\n&gt; turn it down, but that hasn&#39;t happened, he usually complains to me<br/>\n&gt; the next day,<br/>\n<br/>\n </span></blockquote>It is annoying to have to get up - wakes you up even more and makes  <br/>\nit harder to get back to sleep and then the noise in the background  <br/>\nis just MORE annoying. So I understand why he doesn&#39;t want to have to  <br/>\nget up and ask her to turn it down.<br/>\n<br/>\nI&#39;ve asked my husband not to complain to me about the kids. He still  <br/>\ndoes it once in a while and I just say, &quot;Is there something specific  <br/>\nyou&#39;re asking me to do?&quot; If he said, &quot;I want you to make her go to  <br/>\nbed,&quot; then we could talk about that - but I won&#39;t listen to him  <br/>\nwhining on about them just for the sake of venting because he&#39;s too  <br/>\nprone to get negative and focus on faults and not ever notice the  <br/>\nwonderful amazing people they really are.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; saying it isn&#39;t &quot;normal&quot; for her to be up so late<br/>\n&gt; etc.  (some of this, I think, is that he is resentful of having to<br/>\n&gt; get up early, NONE of us are morning people, and he&#39;d really rather<br/>\n&gt; not have to!   But he does it).<br/>\n<br/>\n </span></blockquote>Teens and sleep - the NHEN website has some good articles here:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/teens/default.asp?id=2\">http://www.nhen.org/teens/default.asp?id=2</a>&gt;<br/>\nthat explain why teens naturally gravitate toward staying awake until  <br/>\nthe wee hours of the morning.<br/>\n<br/>\n  Page down to the VERY bottom - it is the last set of articles on a  <br/>\nlong page.<br/>\n<br/>\nHe might be more understanding if he understands the chemistry of  <br/>\nsleep - that there are physiological reasons teenagers tend to stay  <br/>\nup really late and sleep late the next day.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I suggested that we all sit down tonight to discuss this.  The<br/>\n&gt; problem is that he tends to be negative, coming out with statements<br/>\n&gt; like &quot;you need to go to bed!&quot; etc in a tone of voice that is<br/>\n&gt; demanding.<br/>\n<br/>\n </span></blockquote>My husband, too. And he genuinely doesn&#39;t seem to be able to &quot;get&quot;  <br/>\nhow that affects our ability to discuss things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I&#39;ve tried talking to him about how allowing her to make<br/>\n&gt; her own choices isn&#39;t hurting anyone, and how it&#39;s an important part<br/>\n&gt; of unschooling, but he doesn&#39;t see it that way.<br/>\n<br/>\n </span></blockquote>So - will he read more? Will he just trust you? I remind my husband  <br/>\nthat &quot;I&quot; was an American girl - &quot;he&quot; was neither a girl nor an  <br/>\nAmerican, so maybe he needs to trust me when I tell him how he&#39;s  <br/>\ncoming across to the girls. I&#39;m more an expert than he is - and that  <br/>\nmakes some sense to him - he&#39;s willing to take advice from an  <br/>\n&#39;expert.&quot; &lt;G&gt;<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] DH doesn&#39;t get it - help","postDate":"1148488058","msgId":13605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDUyNDEyMTIzMy4wMWFjMGE1MEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PGU1MXU5OCs0dGg3QGVHcm91cHMuY29tPg==","referencesHeader":"PGU1MXU5OCs0dGg3QGVHcm91cHMuY29tPg=="},"prevInTopic":13601,"nextInTopic":13606,"prevInTime":13604,"nextInTime":13606,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"... I think the first thing that needs to happen is that your daughter needs to understand how important it is that her pursuit of happiness doesn t infringe","messageBody":"<div id=\"ygrps-yiv-1378929582\"><blockquote><span title=\"ireply\">&gt;At 11:31 5/24/2006, you wrote:<br/>\n&gt;Plus, he sleeps in the room right<br/>\n&gt;next to hers (his snoring has intensified over the past year, and he<br/>\n&gt;keeps me awake when we sleep in the same room!) so since he gets up<br/>\n&gt;early to go to work, has agreed to sleep in a different room.  He<br/>\n&gt;hears her computer (and sometimes she has the TV on, which is<br/>\n&gt;against the wall of the room he&#39;s in ­ she and I talked about how<br/>\n&gt;she needs to be respectful and keep it down, but I don&#39;t think she<br/>\n&gt;realizes how loud it can sometimes be, and doesn&#39;t self regulate the<br/>\n&gt;level) and it wakes him up.<br/>\n<br/>\n<br/>\n </span></blockquote>I think the first thing that needs to happen is <br/>\nthat your daughter needs to understand how <br/>\nimportant it is that her pursuit of happiness <br/>\ndoesn&#39;t infringe on anyone else&#39;s.  Perhaps the <br/>\nconversation you all have tonight could be <br/>\nbrainstorming ways that your daughter can do her <br/>\nthing (play on her &#39;puter and watch the tube) and <br/>\nyour husband can do his (have uninterrupted <br/>\nsleep).  Both are valid and good and neither <br/>\nshould have to give up one for the other.  Maybe <br/>\nshe can use headphones for the computer and the <br/>\nTV after your husband goes to bed.  Maybe the <br/>\ncomputer can be located in a different part of <br/>\nthe room so it&#39;s not adjacent to your husband&#39;s <br/>\nsleeping space.  At any rate, she needs to <br/>\nunderstand fully that she shouldn&#39;t be disturbing <br/>\nanyone&#39;s sleep.  It&#39;s just not the right thing to do!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I suggested he get up and ask her to<br/>\n&gt;turn it down, but that hasn&#39;t happened, he usually complains to me<br/>\n&gt;the next day, saying it isn&#39;t &quot;normal&quot; for her to be up so late<br/>\n&gt;etc.<br/>\n<br/>\n </span></blockquote>He really should not have to get up in the night <br/>\nto ask her to turn it down.  I would really feel <br/>\npissed off if I had to do that were I in his <br/>\nshoes, and I might say all kinds of mean, nasty <br/>\nthings I don&#39;t mean!  I gotta tell ya, I really <br/>\nand truly don&#39;t mind if my son stays up the whole <br/>\nnight (he has on many occasions); he just needs <br/>\nto respect my need for sleep the way I do his.<br/>\n<br/>\nI bet if your husband feels that his needs are <br/>\nbeing considered, it may help the situation <br/>\ngreatly.  It will also help for your daughter in <br/>\nmany ways to feel that she&#39;s part of the <br/>\nsolution.  The alternative of her not playing at <br/>\nnight could only breed resentment, which is <br/>\npartly what your husband is probably feeling now.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;(some of this, I think, is that he is resentful of having to<br/>\n&gt;get up early...<br/>\n<br/>\n </span></blockquote>And some of it may be that he&#39;s feeling like his <br/>\nneeds aren&#39;t being considered.  I can really understand how he&#39;s feeling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve tried talking to him about how allowing her to make<br/>\n&gt;her own choices isn&#39;t hurting anyone, and how it&#39;s an important part<br/>\n&gt;of unschooling, but he doesn&#39;t see it that way.<br/>\n<br/>\n </span></blockquote>But, in this case, her choices are &quot;hurting&quot; <br/>\nsomeone.  Him!  Not a good idea if you&#39;re trying to get his support!  ;-)<br/>\n<br/>\nAnyway, that&#39;s the first thing that pops into me <br/>\nhead.  I hope it&#39;s a little helpful!<br/>\n<br/>\nSee ya this weekend!!!<br/>\n<br/>\n~Marji<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"DH doesn&#39;t get it - help","postDate":"1148484712","msgId":13601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1MXU5OCs0dGg3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":13605,"prevInTime":13600,"nextInTime":13602,"topicId":13601,"numMessagesInTopic":0,"msgSnippet":"My dd (13) had been out of school for the first time since last June.   She s still deschooling.   Up until this past week, she has always wanted to end the","messageBody":"<div id=\"ygrps-yiv-1493940768\">My dd (13) had been out of school for the first time since last <br/>\nJune.   She&#39;s still deschooling.   Up until this past week, she has <br/>\nalways wanted to end the day with our bedtime routine of saying <br/>\ngoodnight, she didn&#39;t like staying up on her own.  Even though I <br/>\ndon&#39;t usually have to get up early (this is MY first time not <br/>\nworking full time!) I have been finding that I just can&#39;t stay up <br/>\nuntil 2, 3 or even 4AM, I can&#39;t make up for the sleep I need at the <br/>\nother end by sleeping later like she does.   We talked about it and <br/>\nI have been going to bed with her staying up on her own.   She&#39;s <br/>\nbeen heavily into playing World of Warcraft online, and has <br/>\nconnected with quite a few of the other players, who are often on <br/>\nlate at night (many live is different time zones, so it&#39;s earlier in <br/>\nthe day for them).   She&#39;s struggled in the past making friends IRL, <br/>\nand I know that these online connections are very important to her.<br/>\n<br/>\nI&#39;m supportive of her choices, however my dh is having a hard time <br/>\nwith this.   He&#39;s been agreeable about homeschooling, but really <br/>\ndoesn&#39;t understand unschooling.  Plus, he sleeps in the room right <br/>\nnext to hers (his snoring has intensified over the past year, and he <br/>\nkeeps me awake when we sleep in the same room!) so since he gets up <br/>\nearly to go to work, has agreed to sleep in a different room.  He <br/>\nhears her computer (and sometimes she has the TV on, which is <br/>\nagainst the wall of the room he&#39;s in  she and I talked about how <br/>\nshe needs to be respectful and keep it down, but I don&#39;t think she <br/>\nrealizes how loud it can sometimes be, and doesn&#39;t self regulate the <br/>\nlevel) and it wakes him up.   I suggested he get up and ask her to <br/>\nturn it down, but that hasn&#39;t happened, he usually complains to me <br/>\nthe next day, saying it isn&#39;t &quot;normal&quot; for her to be up so late <br/>\netc.  (some of this, I think, is that he is resentful of having to <br/>\nget up early, NONE of us are morning people, and he&#39;d really rather <br/>\nnot have to!   But he does it).<br/>\n<br/>\nI suggested that we all sit down tonight to discuss this.  The <br/>\nproblem is that he tends to be negative, coming out with statements <br/>\nlike &quot;you need to go to bed!&quot; etc in a tone of voice that is <br/>\ndemanding.  I&#39;ve tried talking to him about how allowing her to make <br/>\nher own choices isn&#39;t hurting anyone, and how it&#39;s an important part <br/>\nof unschooling, but he doesn&#39;t see it that way.<br/>\n<br/>\nBTW, we&#39;re going to the conference this weekend (well, he&#39;s at least <br/>\nagreed to go to Ben&#39;s dad&#39;s group) but I&#39;m not sure how much he&#39;ll <br/>\nactually stick around for (we only live 15 mins from the hotel and I <br/>\ncouldn&#39;t convince him to stay there, he isn&#39;t willing to give up <br/>\nhis &quot;weekend&quot; off  sigh).   I&#39;m really looking forward to meeting <br/>\nso many that I&#39;ve come to know here and on other groups, and to be <br/>\nwith like minded folks!<br/>\n<br/>\nI sure could use some suggestions and/or words of wisdom.   He&#39;s not <br/>\na reader, so forget book suggestions, although I have sent him links <br/>\nto articles from time to time (do any come to mind from those of you <br/>\nwho have been doing this a lot longer than we have?!).<br/>\nThanks,<br/>\nJann</div>","specialLinks":[]}],"prevTopicId":13600,"nextTopicId":13659}}