{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":311108332,"authorName":"Eva","from":"&quot;Eva&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: De-fooding","postDate":"1367090847","msgId":49801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsaDhxditsZHA0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjY4MTYzMjkuOTI4OTcuWWFob29NYWlsTmVvQHdlYjE2NDAwMS5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49800,"nextInTopic":0,"prevInTime":49800,"nextInTime":49802,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"... I have personal experience with orthorexia type tendencies and understand that it can easily interfere with how you look at food and your children. My son","messageBody":"<div id=\"ygrps-yiv-2080514832\">--- ... and have such a broken relationship with food. If I make cookies/cakes/ whatever for the children, I am liberal with what they get of it, but I eat most of it- sneaking (!) throughout the day when I think they are not watching. So I don&#39;t make these things very often. I do keep chocolate in the house and I caught the 3 yr old sneaking it and I admit I yelled at him and felt like a horrible hypocrite afterward. ---<br/>\n<br/>\n--- I have a lot of issues with orthorexia and make a lot of rules for myself, and then of course I go crazy and binge when the rules become too rough. ---<br/>\n<br/>\nI have personal experience with orthorexia type tendencies and understand that it can easily interfere with how you look at food and your children. My son (8 yo) has lots of sensory issues, one of them being with food. So it hasn&#39;t been easy not to panic every now and then... Here&#39;s what has helped me:<br/>\n<br/>\n- The most important thing is that I have always believed that my thoughts about what constitutes a healthy diet Might Be Wrong! Knowledge about nutrition is constantly changing and nobody&#39;s agreeing anyway. And what&#39;s a healthy diet for one person might not be as healthy for someone else. I know that&#39;s what everyone&#39;s telling you, so it might sound like blahblahblah to you, but it&#39;s really important: you might be wrong too!<br/>\n<br/>\n- My main concern has always been to &#39;at least not make things worse&#39; for my son, so that meant no forcing, no arguing about food, not withholding the food he likes, no nagging him about trying new foods etc.<br/>\n<br/>\n- I think with the orthorexia people tend to look at food as &#39;healthy or unhealthy&#39; as the only important aspects of food, I try not to do that about my children&#39;s food. It&#39;s bad enough that I tend to do that with my own food ;-)<br/>\n<br/>\n- So what I do is: make food fun, make food beautiful, make food taste really good, make mealtimes nice for everyone. Some examples of what we do: we play with food, e.g. making things like oobleck. My 6 yo daughter absolutely loves nice patterns, so when I prepare her food, I always try to arrange it nicely and it never fails to delight her :-) My son doesn&#39;t eat vegetables, he eats meat and berries and smoothies and bread. So everyday before my husband leaves for work, he makes a big jug with a smoothie of fruit and homemade yogurt and raw eggs. We try to always have the foods he likes available. And whenever he wants to try something, we really try to make that happen. This week I was making bacon and scrambled eggs for my daughter and me, I accidentally dropped the jar of ghee so I used goose fat instead. My son never wanted to taste the bacon and eggs so I had made him something else that he likes, but this morning he said &quot;It smells nice!&quot;, I asked if he wanted to taste it, he said yes so I gave him a tiny bite. He said he liked it, so I asked him if he wanted another bite. He said &quot;No, I want my own bacon and eggs&quot;. I&#39;m always so happy to discover something he likes, so I immediately made him a plate too! What a happy mistake that I dropped the ghee so I used the goose fat instead, otherwise I would have not have discovered that he liked the goose fat!<br/>\n<br/>\n- Not looking at food with the healthy-unhealthy glasses on also means that when you start unschooling and start to let go of food control, you shouldn&#39;t automatically flip to the other extreme and only give them food you think is unhealthy. My children have lots of candy they have access to in our kitchen and they eat some of it every day. But I make sure to make three meals and two snacks during the day, with food I think they will like and I think is nutritious, or they have asked for. You wrote about baking cakes and cookies etc., there is no &#39;unschooling law&#39; saying you have to bake cakes and cookies that you think are unhealthy. We bake things that I know my children like or that we can try. For example, my daughter likes pumpkin pie, I often make a pumpkin pie for her full of very nutritious ingredients that she loves. So healthy food and cakes/cookies/pies don&#39;t have to be at opposite sides of the spectrum. I try to be my children&#39;s partners, I know what things they like and I know a lot of ways to make those things healthy. So that&#39;s actually a quite good combination! Meredith mentioned using healthy fats and nut butters when baking, you can make really nice food with those ingredients.<br/>\n<br/>\n- The way you eat is an important model for your children to see. So I try not to stress about food and whenever I notice that I&#39;m getting too strict with my diet and it isn&#39;t fun anymore, I actively work to relax about it. If you find yourself making too many rules for yourself, I would really try to relax again. It doesn&#39;t set a good example for your children. The way I try to relax is just like with everything else with unschooling, it helps to see things in terms of choices. I can choose to eat dairy or not eat it. Nobody is forcing me either way. As long as it&#39;s a conscious and calm choice to eat it or not eat it, I&#39;m fine with or without dairy!<br/>\n<br/>\nEva<br/>\nBerend (8) & Fiene (6)</div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1367072133","msgId":49800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjcwNzIxMzMuNzU2MzguWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDYzNEI4ODVCLUZDQjgtNDAxNy1CNTgyLTk0MjgyNzlDMERGQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+IDwxMzY2ODE2MzI5LjkyODk3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDEubWFpbC5ncTEueWFob28uY29tPiA8RUMzQTNCQjItOUJERi00NEVDLTg5MTEtQ0I4MDQ1NTBFRDZFQGF0dC5uZXQ+IDwxMzY2ODMxNjY4LjUxMDQ3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDQubWFpbC5ncTEueWFob28uY29tPiA8NjM0Qjg4NUItRkNCOC00MDE3LUI1ODItOTQyODI3OUMwREZBQHZlcml6b24ubmV0Pg=="},"prevInTopic":49799,"nextInTopic":49801,"prevInTime":49799,"nextInTime":49801,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Sorry, Joyce, I saw that word here somewhere and thought it apt. But I see what you re saying. Thank you for the very wise response. You re right, I am","messageBody":"<div id=\"ygrps-yiv-498835916\">Sorry, Joyce, I saw that word here somewhere and thought it apt. But I see what you&#39;re saying. Thank you for the very wise response. You&#39;re right, I am terrified- I will read the links.<br/>\nThank you!<br/>\n-Kari<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Friday, April 26, 2013 7:17 AM<br/>\nSubject: Re: [unschoolingbasics] De-fooding<br/>\n <br/>\n<br/>\n<br/>\n  <br/>\nFirst, EVERYONE, erase the word de-fooding from your thoughts.<br/>\n<br/>\nDe-fooding is a made up word.  Its definition will waffle and change in whatever though you put that word into. No one is fooding. So no one can de-food. It makes thinking clearly about a problem *much* easier if you&#39;re forming thoughts with words that are good and solid and clear.<br/>\n<br/>\nWhen you&#39;re hungry make choices. When you&#39;re shopping make choices. Sometimes you&#39;ll choose a hot fudge sundae. Sometimes you&#39;ll choose carrots.  &lt;snip&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: De-fooding","postDate":"1367071960","msgId":49799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjcwNzE5NjAuNjExODkuWWFob29NYWlsTmVvQHdlYjE2NDAwMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGtsZXAxMyt1cmNrQGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNjY5ODc5MDkuMjg3MzAuWWFob29NYWlsTmVvQHdlYjE2NDUwNC5tYWlsLmdxMS55YWhvby5jb20+IDxrbGVwMTMrdXJja0BlR3JvdXBzLmNvbT4="},"prevInTopic":49798,"nextInTopic":49800,"prevInTime":49798,"nextInTime":49800,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Agreed! And this definitely figures in my own relationship to food- I was a fat child whose parents constantly alternated between shaming and encouragement in","messageBody":"<div id=\"ygrps-yiv-1912099781\">Agreed! And this definitely figures in my own relationship to food- I was a fat child whose parents constantly alternated between shaming and encouragement in trying to get me to lose weight, as well as making it plain that there were parts of my personality that were totally unacceptable. So I hear you. I want to make sure my own children don&#39;t have to deal with this sort of thing.<br/>\n-Kari</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: De-fooding","postDate":"1367009123","msgId":49798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsZXAxMyt1cmNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjY5ODc5MDkuMjg3MzAuWWFob29NYWlsTmVvQHdlYjE2NDUwNC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49796,"nextInTopic":49799,"prevInTime":49797,"nextInTime":49799,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"This was so wonderful and pertinent, thank you!","messageBody":"<div id=\"ygrps-yiv-1142481038\">This was so wonderful and pertinent, thank you!<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, leticia penteado &lt;leticiapenteado@...&gt; wrote:<br/>\n&gt;&gt; Food is just food. It can&#39;t hurt you; as Joyce so beautifully put it, it just sits there passively. What really helped me was to look inside myself. Trying to see the little girl inside me and the feelings she was trying so hard not to feel because she&#39;s been taught from a very early age that they were &#39;inappropriate&#39;.<br/>\n&gt; In my case - and I believe in many cases - there is more to it than the scarcity we&#39;ve been brought up with. Sometimes was a whole bunch of stuff that had nothing to do with food, but, because they happened at a time when my diet and physical appearance were being controlled (with all the frustration and humiliation that caused me), I just linked my feelings of shame, impotence, inadequacy, sadness, anxiousness, etc. to the food issue. </span></blockquote></div>","specialLinks":[]},{"userId":204172700,"authorName":"leticia penteado","from":"leticia penteado &lt;leticiapenteado@...&gt;","profile":"leticiapenteado","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366987909","msgId":49796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjY5ODc5MDkuMjg3MzAuWWFob29NYWlsTmVvQHdlYjE2NDUwNC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDYzNEI4ODVCLUZDQjgtNDAxNy1CNTgyLTk0MjgyNzlDMERGQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+IDwxMzY2ODE2MzI5LjkyODk3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDEubWFpbC5ncTEueWFob28uY29tPiA8RUMzQTNCQjItOUJERi00NEVDLTg5MTEtQ0I4MDQ1NTBFRDZFQGF0dC5uZXQ+IDwxMzY2ODMxNjY4LjUxMDQ3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDQubWFpbC5ncTEueWFob28uY29tPiA8NjM0Qjg4NUItRkNCOC00MDE3LUI1ODItOTQyODI3OUMwREZBQHZlcml6b24ubmV0Pg=="},"prevInTopic":49794,"nextInTopic":49798,"prevInTime":49795,"nextInTime":49797,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Hi, I ve been around a while, but only reading. May I butt in? It is just that I have always had a very unhealthy relationship with food. I would compulsively","messageBody":"<div id=\"ygrps-yiv-1653096010\">Hi, I&#39;ve been around a while, but only reading. May I butt in?<br/>\nIt is just that I have always had a very unhealthy relationship with food. I would compulsively eat and then compulsively diet and exercise, then binge again...<br/>\nIt was only after I got pregnant (with all the introspection pregnancy brings) that I started to look past the food, past the fat, past the appearance for the real problem. I don&#39;t binge because I am hungry; I binge because I am trying to soothe something inside me by eating. I am trying to numb a pain, trying not to feel something, trying not to think about something. And as long as I keep doing that, I may even stop eating, but I will find another outlet - another vice, another instantaneous pleasure that will provide the same relief while never providing the actual cure. I even *exercised* compulsively when I wasn&#39;t eating compulsively!<br/>\nFood is just food. It can&#39;t hurt you; as Joyce so beautifully put it, it just sits there passively. What really helped me was to look inside myself. Trying to see the little girl inside me and the feelings she was trying so hard not to feel because she&#39;s been taught from a very early age that they were &#39;inappropriate&#39;.<br/>\nIn my case - and I believe in many cases - there is more to it than the scarcity we&#39;ve been brought up with. Sometimes was a whole bunch of stuff that had nothing to do with food, but, because they happened at a time when my diet and physical appearance were being controlled (with all the frustration and humiliation that caused me), I just linked my feelings of shame, impotence, inadequacy, sadness, anxiousness, etc. to the food issue.<br/>\n<br/>\nAnd I wasn&#39;t even fat! It was only after 25 that I really gained weight.<br/>\nAnyway, now that I am grown up, I can separate those things (although it is much harder and painful than it sounds). And it was really worth it for me. I am still overweight (and pregnant again), but I find myself first reaching for something to eat in an impulse, and then thinking &quot;nah, don&#39;t really want that&quot; and leaving it. NO SACRIFICE. No suffering. No yearning. I just really don&#39;t want it. Of course, it is harder to have that clarity when I am tired or stressed. But it is still way better than before. I finally feel like I have balance and I never even knew it was missing.<br/>\nHope this helps.<br/>\nGood luck!<br/>\nLeticia (nosy noob)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":476609039,"authorName":"Jill Finkenbine","from":"Jill Finkenbine &lt;peace.goodwill@...&gt;","profile":"jillinmaplewood","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366977057","msgId":49794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTnFyWD1wTDJpbWFyTHZyc3orMW1ZZEt2eGpOc2FCc1lCUDlpRGpBZkg0QUJiaTBwUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNjY4MTYzMjkuOTI4OTcuWWFob29NYWlsTmVvQHdlYjE2NDAwMS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+CTwxMzY2ODE2MzI5LjkyODk3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49792,"nextInTopic":49796,"prevInTime":49793,"nextInTime":49795,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Geneen Roth has written some good, enjoyable books on making peace with food. Jill ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-701766762\">Geneen Roth has written some good, enjoyable books on making peace with<br/>\nfood.<br/>\n<br/>\nJill<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Apr 24, 2013 at 8:12 AM, Kari Barber &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spiraldancer27@...\">spiraldancer27@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi folks- I would really appreciate some advice. I have an 7 yr old<br/>\n&gt; daughter who was born 4 months early and whose baby, toddler, and preschool<br/>\n&gt; life was full of food battles- really nasty ones. She was oral-avoidant, we<br/>\n&gt; had to go to a feeding clinic, and was always so skinny (and still is) that<br/>\n&gt; doctors pretty much said get it down her any way possible. I definitely<br/>\n&gt; force fed her- I feel utterly horrible about it now, but there was a lot of<br/>\n&gt; fear in those days. I have a 3 yr old with whom there have also been food<br/>\n&gt; struggles, though he is normal and healthy. Over the last year or so he has<br/>\n&gt; restricted his own food intake to an extremely narrow group so I am<br/>\n&gt; constantly switching back and forth between relaxing and freaking out about<br/>\n&gt; it.<br/>\n&gt;    I&#39;ve read a bunch of links about food freedom on Sandra&#39;s page and keep<br/>\n&gt; going back to them now and again, but I am having a lot of trouble with it<br/>\n&gt; because my husband and I are overweight and have such a broken relationship<br/>\n&gt; with food. If I make cookies/cakes/ whatever for the children, I am liberal<br/>\n&gt; with what they get of it, but I eat most of it- sneaking (!) throughout the<br/>\n&gt; day when I think they are not watching. So I don&#39;t make these things very<br/>\n&gt; often. I do keep chocolate in the house and I caught the 3 yr old sneaking<br/>\n&gt; it and I admit I yelled at him and felt like a horrible hypocrite afterward.<br/>\n&gt; I am very afraid that if I adopt the attitude of total freedom, of eating<br/>\n&gt; whatever we want whenever we want, well, I for one will be as big as a<br/>\n&gt; house. I haven&#39;t written this until now because I assumed your answer would<br/>\n&gt; be something along the lines of &quot;well do you care more about yourself or<br/>\n&gt; your children? Just because you&#39;re broken doesn&#39;t mean you should be<br/>\n&gt; allowed to break them too.&quot;<br/>\n&gt; But here I am, because I really don&#39;t want to break them (although I am<br/>\n&gt; pretty sure damage has already been done- the 3 yr old is mad for sugar<br/>\n&gt; whenever he can get it, grabbing it from others and sneaking it), and maybe<br/>\n&gt; alongside them developing their own freedom I can somehow help myself too.<br/>\n&gt; So my question is, can we discuss the de-fooding process for us as<br/>\n&gt; parents? Much like we need more de-schooling than the kids, some of us need<br/>\n&gt; a lot more de-fooding too. Does anyone else here have trouble with food<br/>\n&gt; like I do and how do you deal with it in the context of not restricting<br/>\n&gt; your children&#39;s freedom?<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Kari<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366975027","msgId":49792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNEI4ODVCLUZDQjgtNDAxNy1CNTgyLTk0MjgyNzlDMERGQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNjY4MzE2NjguNTEwNDcuWWFob29NYWlsTmVvQHdlYjE2NDAwNC5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+IDwxMzY2ODE2MzI5LjkyODk3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDEubWFpbC5ncTEueWFob28uY29tPiA8RUMzQTNCQjItOUJERi00NEVDLTg5MTEtQ0I4MDQ1NTBFRDZFQGF0dC5uZXQ+IDwxMzY2ODMxNjY4LjUxMDQ3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49788,"nextInTopic":49794,"prevInTime":49791,"nextInTime":49793,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"First, EVERYONE, erase the word de-fooding from your thoughts. De-fooding is a made up word.  Its definition will waffle and change in whatever though you put","messageBody":"<div id=\"ygrps-yiv-1030559160\">First, EVERYONE, erase the word de-fooding from your thoughts.<br/>\n<br/>\nDe-fooding is a made up word.  Its definition will waffle and change in whatever though you put that word into. No one is fooding. So no one can de-food. It makes thinking clearly about a problem *much* easier if you&#39;re forming thoughts with words that are good and solid and clear.<br/>\n<br/>\nWhen you&#39;re hungry make choices. When you&#39;re shopping make choices. Sometimes you&#39;ll choose a hot fudge sundae. Sometimes you&#39;ll choose carrots. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You&#39;re kidding, right? Gaining weight would be terrible<br/>\n<br/>\n </span></blockquote>The root of the word terrible is terror. You&#39;ve mentally categorized gaining weight along with other things generally seen as full of terror like losing a child in a store. Categorizing it that way will make it more difficult to have calm and rational thoughts about it, to make calm and rational choices.<br/>\n<br/>\nBeing heavier can be inconvenient. There are downsides to being heavier. But to see it as terrible will make it mentally more difficult to make calm decisions around food.<br/>\n<br/>\nI weigh more than I did in college. It&#39;s harder to do some things. But it&#39;s hugely helpful to not think of it as terrible. And it&#39;s easier to make healthier choices -- like doing yoga, like going for walks -- when my focus is on doing something healthy I enjoy rather than making choices out of terror of what might happen.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have been worse, ... But it&#39;s a constant struggle.<br/>\n<br/>\n </span></blockquote>You&#39;re at war with yourself and food.<br/>\n<br/>\nWhen I reread that sentence I thought it would be clearer to say &quot;You&#39;re at war with food.&quot; But that&#39;s not true. Food isn&#39;t at war at all. Food passively sits there. It will sit doing nothing until it&#39;s not food anymore and someone throws it out. <br/>\n<br/>\nYou&#39;re at war with yourself and blaming food for it. While you&#39;re surviving the battle you&#39;re getting pretty beaten up in the process.<br/>\n<br/>\nStop the battle. Stop the war. Be at peace with yourself and with food. (Food is a pacifist ;-)) Make thoughtful choices instead. *Not* the choices you &quot;should&quot; make. That would just recast the war and make it between your desires and the &quot;right eating&quot; scripts in your head. Make choices based on what your body is saying it needs. It *will* take time to hear what it&#39;s saying. It *will* take time for it to stop craving what you enjoy that has been scarce.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; the phrase &quot;healthy at any size&quot; is pretty repulsive to me  (just acknowledging my prejudice there)<br/>\n<br/>\n </span></blockquote>Do you see that you&#39;ve translated the phrase into &quot;healthy while being morbidly obese&quot;? <br/>\n<br/>\nIt&#39;s not prejudice (or bias actually) that caused that translation. That&#39;s terror.<br/>\n<br/>\nIf you resist reading the links people suggested, it&#39;s because you perceive it as surrendering to food and fat. But if you let go of the war altogether, you&#39;re not losing. There&#39;s nothing to lose! You&#39;re gaining some useful tools that will help you grow a better relationship with food and with yourself.<br/>\n<br/>\nSomeone posted this on a thread on Facebook:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://redefiningbodyimage.tumblr.com/post/17770763679/big-fat-list-of-myth-defying-health-resources\">http://redefiningbodyimage.tumblr.com/post/17770763679/big-fat-list-of-myth-defying-health-resources</a><br/>\n<br/>\nIt has lots of links and ideas.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am very intrigued by the notion that removing scarcity would solve<br/>\n&gt; the problem over time. Thanks for talking about it and helping me internalize it.<br/>\n<br/>\n<br/>\n </span></blockquote>The only people who fight over water are those who don&#39;t have enough.<br/>\n<br/>\nIf you fill your life with a feeling of abundance -- which is different than lots of stuff! -- there&#39;s no need to fight and struggle and battle for it.<br/>\n<br/>\nIf you&#39;ve eaten a dozen cookies and feel like crap, it&#39;s not an indication you have no self control. It means you like cookies but feel cookies are scarce and you need to scarf them down whenever they appear because they will shortly be gone and may never appear again. Instead, if you eat too many, make a dozen more. Make 10 dozen. Put them in the freezer. If you know you can have a cookie anytime you want, after that initial period of filling up the empty spot and your emotions knowing they won&#39;t disappear again, you *will* be calmer around cookies. (Or whatever it is you crave that you deprive yourself of.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am very intrigued by the notion that removing scarcity would solve<br/>\n&gt; the problem over time.<br/>\n<br/>\n </span></blockquote>What problem?<br/>\n<br/>\nGaining weight? Having cravings? Not eating &quot;right&#39;? <br/>\n<br/>\nIt will depend how you define the problem whether removing scarcity will solve it or not.<br/>\n<br/>\nRead at the Healthy at Any Size site to help you define the problem.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: De-fooding","postDate":"1366895439","msgId":49788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjY4OTU0MzkuNjg2NC5ZYWhvb01haWxOZW9Ad2ViMTY0MDA0Lm1haWwuZ3ExLnlhaG9vLmNvbT4=","inReplyToHeader":"PGtsOXBucCtyOWgzQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSlRpWi1hQWZua21OTlNFVDNRXz0zZlZyRkc5ME9MMHRBTUpZTEVOaDZKeTl3S1RnZ0BtYWlsLmdtYWlsLmNvbT4gPGtsOXBucCtyOWgzQGVHcm91cHMuY29tPg=="},"prevInTopic":49786,"nextInTopic":49792,"prevInTime":49787,"nextInTime":49789,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"The monkey platter has been an excellent thing for my little Minecraft fiends :) Stopping what you are trying to concentrate on to eat is a pain. Now if I","messageBody":"<div id=\"ygrps-yiv-1513484878\">The monkey platter has been an excellent thing for my little Minecraft fiends :) Stopping what you are trying to concentrate on to eat is a pain. Now if I could just put more variety on it and stop urging them to eat the &quot;good parts&quot; of the monkey platter too, and just let them choose without comment. Working on that.<br/>\n-Kari</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366876970","msgId":49786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4NzRFN0JBLTU4NDUtNDY5OC04ODQ1LTRBOEFGQ0VBMEIzMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBSlRpWi1hQWZua21OTlNFVDNRXz0zZlZyRkc5ME9MMHRBTUpZTEVOaDZKeTl3S1RnZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSlRpWi1hQWZua21OTlNFVDNRXz0zZlZyRkc5ME9MMHRBTUpZTEVOaDZKeTl3S1RnZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49784,"nextInTopic":49788,"prevInTime":49785,"nextInTime":49787,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"... They don t need help. It s instinct. But what they hear and how they respond to it, won t look like what you d choose for them. First, they re still","messageBody":"<div id=\"ygrps-yiv-1002653033\">On Apr 24, 2013, at 2:33 PM, Ted Sarvata wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do we help our boys<br/>\n&gt; listen to their bodies?<br/>\n<br/>\n </span></blockquote>They don&#39;t need help. It&#39;s instinct.<br/>\n<br/>\nBut what they hear and how they respond to it, won&#39;t look like what you&#39;d choose for them. First, they&#39;re still figuring out what works with what they&#39;re feeling. Variety and ability to choose are what&#39;s important in discovering what feels satisfying to their need. That&#39;s not something anyone else can choose for them! And as they grow and change, so will their nutritional needs so they&#39;ll go through spurts of changing their diet.<br/>\n<br/>\nSecond, their bodies aren&#39;t adult bodies. They have different nutritional needs. They have small stomachs and large energy needs so they&#39;re going to be more drawn to quick energy foods like sweet things and carbohydrates. And again, variety and the ability to choose will allow them to choose what works for their bodies. <br/>\n<br/>\nThird, kids are busy people :-) They often don&#39;t want to stop to do something boring like eating. ;-) So learn what the snack companies know: provide nutritionally dense food that easy to grab and eat and full of what their bodies need.<br/>\n<br/>\nListening to them and buying what they&#39;d like to have will help. Monkey platters can help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/monkeyplatters/\">http://sandradodd.com/monkeyplatters/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366861013","msgId":49784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2QkMxNzgwLTU3MDItNEE1Qi04OEJBLUI0NjYwODdDOTVEN0BhdHQubmV0Pg==","inReplyToHeader":"PENBSlRpWi1hQWZua21OTlNFVDNRXz0zZlZyRkc5ME9MMHRBTUpZTEVOaDZKeTl3S1RnZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSlRpWi1hQWZua21OTlNFVDNRXz0zZlZyRkc5ME9MMHRBTUpZTEVOaDZKeTl3S1RnZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49783,"nextInTopic":49786,"prevInTime":49783,"nextInTime":49785,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"The really cool thing is that you probably don t have to help your kids listen to their bodies.  They most likely already are.  It s parental and societal","messageBody":"<div id=\"ygrps-yiv-691297349\">The really cool thing is that you probably don&#39;t have to help your kids listen to their bodies.  They most likely already are.  It&#39;s parental and societal intervention that sidetracks their connection with their bodies....ie. being told when, what and how much to eat.  Depending on how much control they&#39;ve been exposed to...right down to how they were fed as babies (on cue vs. scheduled)...they may truly be the ones to lead you in this.  Seeing my own children&#39;s eating habits develop has influenced me a great deal.  My youngest and least food-controlled child eats the healthiest diet of us all and is generally interested in the subjects of food and health more than my others.  I think the more control a child has experienced, the more they will need to experiment and have some modeling.  I talk about how different foods make me feel.  I ask my kids about their bodies&#39; responses to food....and we talk about different possibilities when they&#39;re feeling off.  Have they had enough water?  Protein?  Too much of something?  I listen to their input, offer what I&#39;ve experienced or what various dietary theories offer as answers, and I&#39;ll mention some basic biology if they&#39;re interested and it applies.  I ask their perception of things and don&#39;t just expect that my experience, or even what a majority of people experience is what they are noticing.  Their bodies are their own and their perception always takes precedence.  <br/>\n<br/>\nSaying yes more is a good place to start but is not the whole story.  My kids don&#39;t really ask permission to eat anything these days (they&#39;re 18, 13 and 9) but if I were to see them getting a large snack right before dinner I&#39;ll let them know i&quot;m making dinner and that they might want to save room.  When they were younger and did ask, because I was the one who could get it for them, I&#39;d check in and offer things they might like that they might not have considered....particularly if they were eating a great deal of sugar I&#39;d make sure to offer protein foods, if they were eating nothing but meat and cheese I might suggest fruits or veggies and/or offer them in addition to what they asked for, or I&#39;d just throw on some fruit or veggie garnish (if they&#39;d objected to this I wouldn&#39;t have).  Yes or no would always be their choice....eating something I threw on the plate was up to them.  Monkey platters are great with younger kids....I used to use muffin pans and keep them reachable in the fridge.   A variety of foods freely available.  It&#39;s also a great way to experiment with new foods- just throw a taste on there with some other things.  <br/>\n<br/>\nNutrition and healthy eating may or may not become a priority for your children.  But I&#39;d guess most people like to both feel good and enjoy delicious food.  What that means specifically is different for all of us.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://euphorialifedesignstudio.com\">http://euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: De-fooding","postDate":"1366846127","msgId":49783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsOXByZitkNGRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjY4MzE2NjguNTEwNDcuWWFob29NYWlsTmVvQHdlYjE2NDAwNC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49782,"nextInTopic":49784,"prevInTime":49782,"nextInTime":49784,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"... No, she s not. If you re afraid of gaining weight, then you re trapped by a gigantic set of rules in your head - and so are your children. One of the risks","messageBody":"<div id=\"ygrps-yiv-473432630\">Kari Barber &lt;spiraldancer27@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  &quot;What would be so wrong with gaining weight?&quot;<br/>\n&gt; <br/>\n&gt; You&#39;re kidding, right?<br/>\n<br/>\n </span></blockquote>No, she&#39;s not. If you&#39;re afraid of gaining weight, then you&#39;re trapped by a gigantic set of rules in your head - and so are your children. <br/>\n<br/>\nOne of the risks you absolutely will run if you start to change your relationship with food is gaining some weight. Just like one of the risks you run with radical unschooling is that your kids will never learn their multiplication tables... or never go to college. One of the big hurdles of deschooling involves moving past the fears which start &quot;what if...&quot; and &quot;if I let...&quot; <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet\">http://sandradodd.com/ifilet</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I like being comfortable in a pair of jeans, tying my shoes with ease, wearing heels once in awhile, being able to hike and not exacerbate my knee arthritis, having the breath to dance!, and looking nice in my clothing.<br/>\n </span></blockquote>**************<br/>\n<br/>\nAll the middle things in that list have to do with exercise, not weight, per se. Even the arthritis. This is where looking into programs like Health at Every Size could be helpful. Or something like Fat Yoga. <br/>\n<br/>\nLooking and feeling good in your clothes comes from having clothes that fit on the one hand and liking yourself on the other. This is where getting involved in the fat positive movement can help in other ways - help you find resources if you&#39;re very large, and help you work through issues of self loathing with others who have had similar problems. <br/>\n<br/>\nOne of the hurdles of deschooling is that we have years - decades! - worth of old tapes running in our heads, reciting all our expectations and fears, all the things &quot;everyone knows&quot; only by dint of continual repetition (eg: children need rules). Some of your old tapes are about what will happen if you gain weight. To get past them, you need to challenge your own ideas, expectations and assumptions. Some of that will be hard! But there are more and more resources available for dealing with these issues and getting the old &quot;food school&quot; out of  your head.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: De-fooding","postDate":"1366846009","msgId":49782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsOXBucCtyOWgzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1hQWZua21OTlNFVDNRXz0zZlZyRkc5ME9MMHRBTUpZTEVOaDZKeTl3S1RnZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49781,"nextInTopic":49783,"prevInTime":49781,"nextInTime":49783,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"... To start with, it helps to go all the way down to the core principles of unschooling itself. Unschooling begins with the premise that learning is a central","messageBody":"<div id=\"ygrps-yiv-1742609776\">Ted Sarvata &lt;ted@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;d really like to know more about the listening and the early stages of<br/>\n&gt; starting to say &quot;yes&quot; more in the food area.  How do we help our boys<br/>\n&gt; listen to their bodies?  I&#39;m really looking for basic early steps.<br/>\n<br/>\n </span></blockquote>To start with, it helps to go all the way down to the core principles of unschooling itself. Unschooling begins with the premise that learning is a central human endeavor - we&#39;re wired to learn! and that learning is absolutely dependent on the perceptions and perspectives of the individual. That&#39;s really important! <br/>\n<br/>\nWhat you&#39;re asking is &quot;how do I help my kids learn?&quot; - and in a way it&#39;s the &quot;wrong&quot; question. That&#39;s okay! It&#39;s a normal wrong-question for someone new to unschooling ;) It&#39;s a question about teaching, not learning - how do get them to learn what you want them to learn. Woops. <br/>\n<br/>\nStart someplace else, start with observation: your children are learning about their bodies every day. They learn about food when they eat and poop and everything in between. They&#39;re In their bodies, feeling them all the time - and learning absolutely depends on those feelings. When they&#39;re all pumped up and race around the room, they&#39;re listening to their bodies. When they&#39;re drooping and do something slow and quiet for a little while, they&#39;re listening to their bodies. When they say &quot;I&#39;m not hungry&quot; or &quot;bleh, I don&#39;t want that&quot; they&#39;re listening to their bodies. So the first step for you, the parent, is to see how and when they are already listening to their bodies and learn to trust what you see. <br/>\n<br/>\nThat&#39;s hard. It&#39;s hard because the way kids eat when they&#39;re listening to their bodies often doesn&#39;t look like anything out of a textbook with regular balanced meals. I don&#39;t just mean it&#39;s normal for kids to graze, although that&#39;s part of it - little kids need a Lot of energy and have little bellies. That&#39;s part of why they often go for sweets and carbs - they need the calories and things which digest fast. It&#39;s also normal for kids to eat a lot of one particular thing for awhile so that, looking day to day their diets look really out of whack, but over the course of a month the picture smooths out and looks much more balanced. And it&#39;s hard because you&#39;ve been told a miiiiiillllllion times that children can&#39;t learn the right things on their own; they have to be taught - and every time you see a child make a &quot;bad&quot; choice in the moment it&#39;s easy to fall back on that assumption, rather than see learning in action. <br/>\n<br/>\nKids are learning in other ways, too - sometimes learning about things which, on the surface, don&#39;t seem to have anything to do with food... but the human mind is a marvel. It&#39;s built out of connections between ideas. So learning about plants and animals the natural world is, in part, learning about food and nutrition. Learning about what&#39;s inside their bodies is, in part, learning about food and nutrition. Learning about holidays and grandparents and festivals is, in part, learning about food and nutrition.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d really like to know more about the listening and the early stages of<br/>\n&gt; starting to say &quot;yes&quot; more in the food area.<br/>\n<br/>\n </span></blockquote>Have lots of food in the house you feel good saying &quot;yes&quot; to. Also have other foods, foods your kids pick out or food you think they&#39;d like to try - without making too harsh a judgement about the relative worthiness of that food. Offer variety.<br/>\n<br/>\nAt the same time, look for ways to level the playing field so that what kids are discovering about food is a little simpler. Make it Easy for busy, fast-moving little people to eat nutritious things - if the options are &quot;hold on, I&#39;ll make you something&quot; and &quot;unwrap and eat&quot; a fast moving, busy person will unwrap and eat. When you level the playing field, kids will make more varied choices - and they&#39;ll feel how their bodies feel afterwards and learn from that. Also, make sure the nutritionally dense food is just as attractive as the lighter foods - it&#39;s natural for people to want pretty things, including food (including boys!...er, natural for boys, I mean). <br/>\n<br/>\nThere has been a whole lot written on the subject of unschooling and food over the years. One of the most popular ideas has been that of the &quot;monkey platter&quot; - a plate of mixed foods, generally finger foods, for kids who are otherwise busy. The page for that is a great source of inspiration for putting together snacks and meals for kids of all ages:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/monkeyplatter\">http://sandradodd.com/eating/monkeyplatter</a><br/>\n<br/>\nI want to add, since it applies to my own life, that sometimes kids also have very, very dainty appetites! My daughter is one. When Mo was little, I would bring her little bitty plates - saucers and even child tea-set plates - with a few grapes, a cracker, a pinch of shredded cheese, and that was lunch. So if you have a dainty eater, too, take those big full plate pictures and scale them waaaaaay back! <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366843618","msgId":49781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNzRDRUU4LTMwQzMtNEZGRS1CMjVFLUM1RjNFMzJENzRFQkBhdHQubmV0Pg==","inReplyToHeader":"PDEzNjY4MzE2NjguNTEwNDcuWWFob29NYWlsTmVvQHdlYjE2NDAwNC5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+IDwxMzY2ODE2MzI5LjkyODk3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDEubWFpbC5ncTEueWFob28uY29tPiA8RUMzQTNCQjItOUJERi00NEVDLTg5MTEtQ0I4MDQ1NTBFRDZFQGF0dC5uZXQ+IDwxMzY2ODMxNjY4LjUxMDQ3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49780,"nextInTopic":49782,"prevInTime":49780,"nextInTime":49782,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"I wasn t kidding at all.  I m no small woman (by the stats I m well over obese) but I wear jeans comfortably (and did a few years ago when I was two sizes","messageBody":"<div id=\"ygrps-yiv-45260953\">I wasn&#39;t kidding at all.  I&#39;m no small woman (by the stats I&#39;m well over obese) but I wear jeans comfortably (and did a few years ago when I was two sizes larger), I can tie my shoes and paint my toenails, I can hike and dance. And do yoga. Yes, as I age I would also like to maintain my mobility, however it has SO much more to do with using the mobility you have than weight.  Meredith posted some good links and I also recommend the book The Obesity Myth.<br/>\n<br/>\nThat said, the question was meant to reveal to you your REAL concerns.  Which can be addressed in so many more ways than restriction.  Maybe you need to find better fitting jeans.  Perhaps you&#39;d be happier spending more of your time hiking and dancing (and less finishing off that ice cream cake in the freezer....oh, wait, that&#39;s me....and I&#39;m saving it for dessert).  Maybe in addition to staying active there are other things to prevent the progression of your arthritis.  Weight control can help, but its far from the whole picture.  And it can be managed with kindness to yourself.<br/>\n<br/>\nI&#39;m on my phone and can&#39;t refer back to the rest of your post, however I will when I&#39;m at my computer.  <br/>\n<br/>\nLesley</div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366831668","msgId":49779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjY4MzE2NjguNTEwNDcuWWFob29NYWlsTmVvQHdlYjE2NDAwNC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEVDM0EzQkIyLTlCREYtNDRFQy04OTExLUNCODA0NTUwRUQ2RUBhdHQubmV0Pg==","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+IDwxMzY2ODE2MzI5LjkyODk3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDEubWFpbC5ncTEueWFob28uY29tPiA8RUMzQTNCQjItOUJERi00NEVDLTg5MTEtQ0I4MDQ1NTBFRDZFQGF0dC5uZXQ+"},"prevInTopic":49778,"nextInTopic":49780,"prevInTime":49778,"nextInTime":49780,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Kari, first of all you are NOT broken. Thanks, but I didn t say I was broken- there are many areas of my life I am a healthy, creative person in. Food is","messageBody":"<div id=\"ygrps-yiv-2129043057\">&quot;Kari, first of all you are NOT broken.&quot;<br/>\n<br/>\nThanks, but I didn&#39;t say &quot;I&quot; was broken- there are many areas of my life I am a healthy, creative person in. Food is simply not one of them- it&#39;s my relationship that is broken, not me. <br/>\n<br/>\n&quot; If your therapists are recommending force feeding, I&#39;d find new ones.&quot;<br/>\n<br/>\n<br/>\nThe therapists are all long gone now- if I had discovered unschooling at the time things would have been different maybe, but I was a new parent of one child that did not survive the NICU and another that was very ill. There was a lot of fear and pain, and it echoed for many years afterward. Letting go even as much as I have has been healing, but there is a very long way to go.<br/>\n<br/>\n &quot;What would be so wrong with gaining weight?&quot;<br/>\n<br/>\n<br/>\nYou&#39;re kidding, right? Gaining weight would be terrible- I like being comfortable in a pair of jeans, tying my shoes with ease, wearing heels once in awhile, being able to hike and not exacerbate my knee arthritis, having the breath to dance!, and looking nice in my clothing. I am pretty much at my top weight for these things right now. I have been worse, and I will not go back there again.  I am not trying to be anyone else&#39;s idea of perfection. My goal weight is still probably crazy high for most people- but it&#39;s about enjoyment of life, not a number.<br/>\nBut it&#39;s a constant struggle. I am very intrigued by the notion that removing scarcity would solve the problem over time. Thanks for talking about it and helping me internalize it.<br/>\n<br/>\nThis-<br/>\n&quot;It&#39;s making the relationship the focus, not the results.&quot;<br/>\n<br/>\n<br/>\nIs priceless advice I have read somewhere on Sandra&#39;s site- I need to paint it on a sign and hang it in the kitchen. It is what I fall back on when everything else says to put my foot down.<br/>\n<br/>\nThanks,<br/>\nKari<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: De-fooding","postDate":"1366830494","msgId":49778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjY4MzA0OTQuNzM0MTYuWWFob29NYWlsTmVvQHdlYjE2NDAwNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGtsOTVlaStsMzVmQGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNjY4MTYzMjkuOTI4OTcuWWFob29NYWlsTmVvQHdlYjE2NDAwMS5tYWlsLmdxMS55YWhvby5jb20+IDxrbDk1ZWkrbDM1ZkBlR3JvdXBzLmNvbT4="},"prevInTopic":49777,"nextInTopic":49779,"prevInTime":49777,"nextInTime":49779,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Thanks for responding- to clarify my history of the past few years is Paleo/ real foods/ WAPF so I definitely don t fear fats (heh, I fear fruit juice, not","messageBody":"<div id=\"ygrps-yiv-1622783743\">Thanks for responding- to clarify my history of the past few years is Paleo/ real foods/ WAPF so I definitely don&#39;t fear fats (heh, I &quot;fear&quot; fruit juice, not butter, and we certainly don&#39;t make a habit of soda) and don&#39;t count calories- it&#39;s sugar and wheat I have a very bad relationship with.  But coming from that scene  (and before- always fat, first diet at 6 yrs of age)  I have a lot of issues with orthorexia and make a lot of rules for myself, and then of course I go crazy and binge when the rules become too rough. So I am trying to relax everything- I no longer require gluten free for my kids, even though I strongly believe they would benefit from it, the psychological strain from telling them they can&#39;t have what the other kids are having is rough on them- and I&#39;ve made that change because of reading unschooling lists! So thanks- I am very afraid to loosen restrictions on food, but I am going to work on it, and I will read the links you sent,<br/>\n although the phrase &quot;healthy at any size&quot; is pretty repulsive to me (just acknowledging my prejudice there).<br/>\nAnd as this is sounding too much about me and not enough about unschooling, I will stop there. Thank you for your help and suggestions. I am listening and I will read- clearly I have issues here.<br/>\n-Kari<br/>\n<br/>\n________________________________<br/>\n From: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Wednesday, April 24, 2013 1:40 PM<br/>\nSubject: [unschoolingbasics] Re: De-fooding<br/>\n <br/>\n<br/>\n<br/>\n  <br/>\nKari Barber &lt;spiraldancer27@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Over the last year or so he has restricted his own food intake to an extremely narrow group <br/>\n </span></blockquote>*************<br/>\n<br/>\nFirst of all, this is really normal. Around the time kids go from being &quot;toddlers&quot; to &quot;little kids&quot; many become very conservative in their food choices. Kids who would happily eat broccoli suddenly only want fine textures, mild flavors, and sweets. It helps to look for ways to provide nutritious options in those regard - but the key word is &quot;options&quot;. Sometimes kids really just need calories.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;can we discuss the de-fooding process for us as parents? Much like we need more de-schooling than the kids, some of us need a lot more de-fooding too.<br/>\n </span></blockquote>****************<br/>\n<br/>\nYes! There&#39;s a growing movement striving to heal their relationship with food and their bodies. I think of it as the &quot;fat positive&quot; movement, which includes the &quot;Health at Every Size&quot; program:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.haescommunity.org/\">http://www.haescommunity.org/</a><br/>\nas well as groups like &quot;The Body is Not an Apology&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thebodyisnotanapology.com/\">http://www.thebodyisnotanapology.com/</a><br/>\nand sites like &quot;The Fat Nutritionist&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fatnutritionist.com/\">http://www.fatnutritionist.com/</a><br/>\n<br/>\nAll of those (and others) have essentially gotten to the same point with adult eating and nutrition that radical unschoolers have been promoting for years wrt children, while also acknowledging that those of us who didn&#39;t have the luxury of growing up in radical unschooling homes often have massive issues around food and our bodies.<br/>\n<br/>\nThe Body is Not an Apology is a favorite of mine - very good for lots of messages of &quot;radical self love&quot;. If daily affirmations help you, subscribe to them on facebook. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If I make cookies/cakes/ whatever for the children, I am liberal with what they get of it, but I eat most of it- sneaking (!) throughout the day when I think they are not watching. So I don&#39;t make these things very often.<br/>\n </span></blockquote>***************<br/>\n<br/>\nMake them more often - and load them up with nutritional goodness. Baked goods are Easy to fill with good stuff and still have them taste wonderful - in fact, they often taste richer. Stop sneaking and give yourself permission to eat. I know it&#39;s not that easy ;) but I also know sneaking isn&#39;t doing you or your kids any good. It damages your sense of personal integrity and undermines your kids&#39; ability to trust your judgement. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am very afraid that if I adopt the attitude of total freedom, of eating whatever we want whenever we want, well, I for one will be as big as a house.<br/>\n </span></blockquote>*************<br/>\n<br/>\nGo do some reading on those sites. Weight is more than just calories in and calories out - it&#39;s complex and relates to the immune system, genetics, and mental health, as well as the equally-complex picture of which foods are best for your unique body. <br/>\n<br/>\nAt the same time read this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\nand substitute &quot;food&quot; for tv&quot;. It&#39;s the same principle: limits make things more valuable. <br/>\n<br/>\nBut!<br/>\nAnother very good piece of unschooling advice is &quot;don&#39;t drop all the rules at once: ease in&quot;. Make changes slowly. A good place to start is by experimenting with making foods - especially those baked goods! - as &quot;nutritionally dense&quot; as possible. Use good quality ingredients, especially (brace yourself) good quality fats. For me that&#39;s butter, nut butters, and nut meals. One of the advantages of adding good quality fats is that foods taste better, richer, so you can cut down ingredients like sugar without anyone noticing. Another advantage is you feel full sooner. <br/>\n<br/>\nStock your home with real fruit juices. If your family likes carbonated drinks, get some soda water and experiment with making your own! Have fun with that! Shift your thinking about food to be celebratory: food is the stuff of life! When you&#39;re flinching away from food, you&#39;re not nourishing your heart and soul as well as you could - and that matters to your physical health And to your relationship with your children. The more you love yourself and your life, the better you&#39;ll be at supporting your kids in their passions and endeavors. <br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":551756142,"authorName":"Ted Sarvata","from":"Ted Sarvata &lt;ted@...&gt;","profile":"humaniam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366828380","msgId":49780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSlRpWi1hQWZua21OTlNFVDNRXz0zZlZyRkc5ME9MMHRBTUpZTEVOaDZKeTl3S1RnZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49779,"nextInTopic":49781,"prevInTime":49779,"nextInTime":49781,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"... We re new to the unschooling world (my wife and I and our two boys, who will be 5 in August).  So far we ve been experimenting with saying yes when our","messageBody":"<div id=\"ygrps-yiv-1076473681\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; It&#39;s the same as the whole idea of unschooling. It&#39;s neither authoritarian<br/>\n&gt; (restrictive) or permissive (do whatever you want regardless of its<br/>\n&gt; effects).<br/>\n&gt; It&#39;s another paradigm. It&#39;s listening. To your children (or your body).<br/>\n&gt; It&#39;s<br/>\n&gt; responding kindly and respecting the information you have. It&#39;s seeing a<br/>\n&gt; whole<br/>\n&gt; range of choices and finding out the real effect of them, then making those<br/>\n&gt; choices based on your real experience vs. &quot;common knowledge&quot;. It&#39;s making<br/>\n&gt; the<br/>\n&gt; relationship the focus, not the results.<br/>\n<br/>\n<br/>\n </span></blockquote>We&#39;re new to the unschooling world (my wife and I and our two boys, who<br/>\nwill be 5 in August).  So far we&#39;ve been experimenting with saying &quot;yes&quot;<br/>\nwhen our default response would&#39;ve been &quot;no&quot; and not much more than that,<br/>\nand not yet really with food.<br/>\n<br/>\nI&#39;d really like to know more about the listening and the early stages of<br/>\nstarting to say &quot;yes&quot; more in the food area.  How do we help our boys<br/>\nlisten to their bodies?  I&#39;m really looking for basic early steps.<br/>\n<br/>\nThank you!<br/>\nTed<br/>\n<br/>\n-- <br/>\n<br/>\nBusiness Growth Advisor | Consultant to Fast-Growth Companies | Restoring<br/>\nYour Sanity &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://tedsarvata.com/\">http://tedsarvata.com/</a>&gt;<br/>\n503-877-9214 | 248 566-6166 | 312-371-6625 (cell)<br/>\n<br/>\nOne-Day Workshop for Growth Company Executive Teams<br/>\nRockefeller Habits / Four Decisions<br/>\nMay 22, 2013 in Portland, OR&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopportland-tedfoot.eventbrite.com/\">http://mrhworkshopportland-tedfoot.eventbrite.com/</a>&gt;<br/>\nJune 6, 2013 in Detroit&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eventbrite.com/event/5024434218/emailfooter\">http://www.eventbrite.com/event/5024434218/emailfooter</a>&gt;<br/>\n<br/>\n*&quot;I&#39;d say that there has been no other single management step that we have<br/>\ntaken that has moved us so quickly and in an exciting way as your retreat<br/>\ndid for us.**&quot;*<br/>\n<br/>\n -- Rob Sadowsky, Executive Director, Bicycle Transportation Alliance<br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://gicoaches.com/bio/?id=86\">http://gicoaches.com/bio/?id=86</a>&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-fooding","postDate":"1366825802","msgId":49777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDM0EzQkIyLTlCREYtNDRFQy04OTExLUNCODA0NTUwRUQ2RUBhdHQubmV0Pg==","inReplyToHeader":"PDEzNjY4MTYzMjkuOTI4OTcuWWFob29NYWlsTmVvQHdlYjE2NDAwMS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+IDwxMzY2ODE2MzI5LjkyODk3LllhaG9vTWFpbE5lb0B3ZWIxNjQwMDEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49776,"nextInTopic":49778,"prevInTime":49776,"nextInTime":49778,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Kari, first of all you are NOT broken.  Being overweight, even if you do have an unhealthy relationship with food, does not make you broken.  Your children are","messageBody":"<div id=\"ygrps-yiv-1864107325\">Kari, first of all you are NOT broken.  Being overweight, even if you do have an unhealthy relationship with food, does not make you broken.  Your children are not broken, but you may have created some challenges with their ability to self-regulate.  No worries, it comes back with time and trust.  Oral defensiveness is a real thing, something that can be worked with in terms of food freedom and with therapies that do not involve food.  In my experience with sensory therapies, the good ones almost always involve getting a child to slowing expand their range of willingness by allowing them as much as what they&#39;re able to handle of what works for them.  Trust and knowing that they are trusted and believed...that they&#39;re not just doing this to be difficult but because their processing is different, makes a huge difference.  If your therapists are recommending force feeding, I&#39;d find new ones.  (unless you&#39;re really at extremes where your child is truly starving....but even then, perhaps other forms of nutrition, iv?, would be less stressful than being forced to eat)<br/>\n<br/>\nObviously your children do not have overeating issues.  Maybe you don&#39;t either.....  Have you ever given yourself the freedom to eat as you like?  Have you ever paid attention to the effect what you eat has on how you feel?  ie. your body&#39;s response to food?  What would be so wrong with gaining weight?  (Weight itself and health actually have very little causal relationship... there is correlation, but causation is not established for many of what are called &quot;weight related&quot; health issues.)  We, children and adults, have an interesting tendency to crave what is limited.  This applies not only to food, but to all sorts of things....think about the tendency towards conspicuous consumption and how marketers create &quot;exclusive&quot; and &quot;limited edition&quot; products to spur demand.  People also have a tendency to hoard things that they&#39;ve felt a lack of....to get all they can and keep it stashed and hidden.  It&#39;s the limitation and lack that create the dynamic, not freedom and access.  <br/>\n<br/>\nI have an interesting dance with sugar.  I have a history of extreme dieting, where I restricted my food intake, what I&#39;d allow myself to eat, I&#39;ve counted calories, fat grams, carbs, number of chews, you name it.  The only times I&#39;ve been thin were when I was eating this way.  Being thin is not worth it.  Being healthy?  What I was doing was FAR from healthy.  But I do have a sweet tooth (oh, I loved the 80&#39;s when we were told we could have all the sugar we wanted as long as we didn&#39;t have fat....and omg I was probably SO malnourished!).  There was a time when I&#39;d restrict sugar.  And then break my rules.  And then make bigger, better rules.  And break them.  Until I began listening to my body.  Interestingly enough, I discovered that when I ate living foods...vegetables, fruits....I had a lot of energy.  When I ate sugar I felt like crap.  Interesting to note.  I still love sugary foods, but instead of telling myself I can&#39;t have them I consider how they will make me feel.  Sometimes I&#39;m willing to tolerate it....I find the whole &quot;dessert&quot; system of having sweets after dinner works well because I sleep off the &quot;hangover&quot;.  Sugary breakfast?  I know I won&#39;t be at my best and have lots of energy that day.  Others may have different experiences.  For the record, for the first 20 years of my adulthood I gained about 5lbs. per year, going back and forth between restriction and eat whatever I want, whenever I want.  Since I truly gave myself food freedom....not freedom to binge but listening to my body, giving it what it wants, recognizing that while I enjoy the flavor of some foods I need to consider how they will effect my body as far as comfort, energy, etc... since then I&#39;ve been losing about 5lbs per year.  <br/>\n<br/>\nIt&#39;s the same as the whole idea of unschooling.  It&#39;s neither authoritarian (restrictive) or permissive (do whatever you want regardless of its effects).  It&#39;s another paradigm.  It&#39;s listening.  To your children (or your body).  It&#39;s responding kindly and respecting the information you have.  It&#39;s seeing a whole range of choices and finding out the real effect of them, then making those choices based on your real experience vs. &quot;common knowledge&quot;.  It&#39;s making the relationship the focus, not the results.  <br/>\n<br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://euphorialifedesignstudio.com\">http://euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: De-fooding","postDate":"1366825234","msgId":49776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsOTVlaStsMzVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjY4MTYzMjkuOTI4OTcuWWFob29NYWlsTmVvQHdlYjE2NDAwMS5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49775,"nextInTopic":49777,"prevInTime":49775,"nextInTime":49777,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"... ************* First of all, this is really normal. Around the time kids go from being toddlers to little kids many become very conservative in their","messageBody":"<div id=\"ygrps-yiv-851791550\">Kari Barber &lt;spiraldancer27@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Over the last year or so he has restricted his own food intake to an extremely narrow group <br/>\n </span></blockquote>*************<br/>\n<br/>\nFirst of all, this is really normal. Around the time kids go from being &quot;toddlers&quot; to &quot;little kids&quot; many become very conservative in their food choices. Kids who would happily eat broccoli suddenly only want fine textures, mild flavors, and sweets. It helps to look for ways to provide nutritious options in those regard - but the key word is &quot;options&quot;. Sometimes kids really just need calories.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;can we discuss the de-fooding process for us as parents? Much like we need more de-schooling than the kids, some of us need a lot more de-fooding too.<br/>\n </span></blockquote>****************<br/>\n<br/>\nYes! There&#39;s a growing movement striving to heal their relationship with food and their bodies. I think of it as the &quot;fat positive&quot; movement, which includes the &quot;Health at Every Size&quot; program:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.haescommunity.org/\">http://www.haescommunity.org/</a><br/>\nas well as groups like &quot;The Body is Not an Apology&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thebodyisnotanapology.com/\">http://www.thebodyisnotanapology.com/</a><br/>\nand sites like &quot;The Fat Nutritionist&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fatnutritionist.com/\">http://www.fatnutritionist.com/</a><br/>\n<br/>\nAll of those (and others) have essentially gotten to the same point with adult eating and nutrition that radical unschoolers have been promoting for years wrt children, while also acknowledging that those of us who didn&#39;t have the luxury of growing up in radical unschooling homes often have massive issues around food and our bodies.<br/>\n<br/>\nThe Body is Not an Apology is a favorite of mine - very good for lots of messages of &quot;radical self love&quot;. If daily affirmations help you, subscribe to them on facebook. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If I make cookies/cakes/ whatever for the children, I am liberal with what they get of it, but I eat most of it- sneaking (!) throughout the day when I think they are not watching. So I don&#39;t make these things very often.<br/>\n </span></blockquote>***************<br/>\n<br/>\nMake them more often - and load them up with nutritional goodness. Baked goods are Easy to fill with good stuff and still have them taste wonderful - in fact, they often taste richer. Stop sneaking and give yourself permission to eat. I know it&#39;s not that easy ;) but I also know sneaking isn&#39;t doing you or your kids any good. It damages your sense of personal integrity and undermines your kids&#39; ability to trust your judgement. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am very afraid that if I adopt the attitude of total freedom, of eating whatever we want whenever we want, well, I for one will be as big as a house.<br/>\n </span></blockquote>*************<br/>\n<br/>\nGo do some reading on those sites. Weight is more than just calories in and calories out - it&#39;s complex and relates to the immune system, genetics, and mental health, as well as the equally-complex picture of which foods are best for your unique body. <br/>\n<br/>\nAt the same time read this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\nand substitute &quot;food&quot; for tv&quot;. It&#39;s the same principle: limits make things more valuable. <br/>\n<br/>\nBut!<br/>\nAnother very good piece of unschooling advice is &quot;don&#39;t drop all the rules at once: ease in&quot;. Make changes slowly. A good place to start is by experimenting with making foods - especially those baked goods! - as &quot;nutritionally dense&quot; as possible. Use good quality ingredients, especially (brace yourself) good quality fats. For me that&#39;s butter, nut butters, and nut meals. One of the advantages of adding good quality fats is that foods taste better, richer, so you can cut down ingredients like sugar without anyone noticing. Another advantage is you feel full sooner. <br/>\n<br/>\nStock your home with real fruit juices. If your family likes carbonated drinks, get some soda water and experiment with making your own! Have fun with that! Shift your thinking about food to be celebratory: food is the stuff of life! When you&#39;re flinching away from food, you&#39;re not nourishing your heart and soul as well as you could - and that matters to your physical health And to your relationship with your children. The more you love yourself and your life, the better you&#39;ll be at supporting your kids in their passions and endeavors. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"De-fooding","postDate":"1366816329","msgId":49775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjY4MTYzMjkuOTI4OTcuWWFob29NYWlsTmVvQHdlYjE2NDAwMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+","referencesHeader":"PDEzNjY3NDMwOTUuMzM3MzYuWWFob29NYWlsTmVvQHdlYjE4NjEwNC5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":49776,"prevInTime":49773,"nextInTime":49776,"topicId":49775,"numMessagesInTopic":0,"msgSnippet":"Hi folks- I would really appreciate some advice. I have an 7 yr old daughter who was born 4 months early and whose baby, toddler, and preschool life was full","messageBody":"<div id=\"ygrps-yiv-820857589\">Hi folks- I would really appreciate some advice. I have an 7 yr old daughter who was born 4 months early and whose baby, toddler, and preschool life was full of food battles- really nasty ones. She was oral-avoidant, we had to go to a feeding clinic, and was always so skinny (and still is) that doctors pretty much said get it down her any way possible. I definitely force fed her- I feel utterly horrible about it now, but there was a lot of fear in those days. I have a 3 yr old with whom there have also been food struggles, though he is normal and healthy. Over the last year or so he has restricted his own food intake to an extremely narrow group so I am constantly switching back and forth between relaxing and freaking out about it. <br/>\n   I&#39;ve read a bunch of links about food freedom on Sandra&#39;s page and keep going back to them now and again, but I am having a lot of trouble with it because my husband and I are overweight and have such a broken relationship with food. If I make cookies/cakes/ whatever for the children, I am liberal with what they get of it, but I eat most of it- sneaking (!) throughout the day when I think they are not watching. So I don&#39;t make these things very often. I do keep chocolate in the house and I caught the 3 yr old sneaking it and I admit I yelled at him and felt like a horrible hypocrite afterward.<br/>\nI am very afraid that if I adopt the attitude of total freedom, of eating whatever we want whenever we want, well, I for one will be as big as a house. I haven&#39;t written this until now because I assumed your answer would be something along the lines of &quot;well do you care more about yourself or your children? Just because you&#39;re broken doesn&#39;t mean you should be allowed to break them too.&quot;<br/>\nBut here I am, because I really don&#39;t want to break them (although I am pretty sure damage has already been done- the 3 yr old is mad for sugar whenever he can get it, grabbing it from others and sneaking it), and maybe alongside them developing their own freedom I can somehow help myself too.<br/>\nSo my question is, can we discuss the de-fooding process for us as parents? Much like we need more de-schooling than the kids, some of us need a lot more de-fooding too. Does anyone else here have trouble with food like I do and how do you deal with it in the context of not restricting your children&#39;s freedom?  <br/>\n<br/>\nThanks,<br/>\nKari<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49797,"nextTopicId":49813}}