{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":438157381,"authorName":"movingonout2009","from":"&quot;movingonout2009&quot; &lt;movingonout2009@...&gt;","profile":"movingonout2009","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another Behavior Problem - PLEASE HELP","postDate":"1285467418","msgId":44880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3bWFlcSttMTdjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3ZnUxZithOWhnQGVHcm91cHMuY29tPg=="},"prevInTopic":44878,"nextInTopic":0,"prevInTime":44879,"nextInTime":44881,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"I know that it is early for me to be seeing results from the suggestions that you all have made, but I wanted to say thank you to everyone who replied.  I have","messageBody":"<div id=\"ygrps-yiv-1129679439\">I know that it is early for me to be seeing results from the suggestions that you all have made, but I wanted to say thank you to everyone who replied.  I have taken a lot of what was said and have tried to see what fits with our family style.  <br/>\n<br/>\nMeredith - <br/>\n<br/>\nI have tried to slow things down a bit, get her more involved into what I am doing as I do my prep work for the day.  My son loves just going off on his own to play so it gives the two of us time to hang out as we get ready.  I am trying to remember about how a tantrum is about her being overwhelmed and unable to communicate in another manner to me.  One thing that was brought back up to me was something that I read a while ago about anger, although this was meant for adults is still applies to children.  It said that anger is a secondary emotion that is in response to another emotion.  So you are angry because you are sad about something, or you feel ashamed, or disappointed.  It could be any emotion really.   So if I move past the anger, what I really need to think about is what is CAUSING the anger.  Then I can get to the root of the problem and solve that, rather then aggravating the anger by punishing the behavior that it prompted.  So this was a fairly large breakthrough for me.  I have also ordered the two books you recommended fromt the library, and checked out the sandra dodd website you suggessted.  Thank you very much, it was VERY helpful.<br/>\n<br/>\nKelly - <br/>\n<br/>\nI love the idea of a Time-In.  I will start using that even if we just used it to spend some close contact, cuddle time.  I&#39;m going to call it &quot;Snuggle Time&quot;, that way my daughter does not associate it with time outs in any way.<br/>\n<br/>\nLyla - <br/>\n<br/>\nThank you for the information about time-outs.  It has made me look a bit more into it, and has made me rethink the whole idea of using them at all.  I had thought of them as a more humane and compassionate method of dealing with her meltdowns, but when I think about it in terms of shutting away someone who is hurting, leaving them angry, confused and feeling rejected by the people who are supposed to take care of them. Wow, it doesn&#39;t seem the more humane method now.  So thank you again.  Also, I wanted to let you know that I have already borrowed a copy of &quot;Parenting from the inside out&quot;, which looks amazing and very promising for me as I am sure that I could use it.  I am also trying to get a hold of &quot;Connection Parenting&quot; as it seems to be the style of book I have been looking for.  It is so hard to find a book about parenting that is not something that touts either punishments or rewards (ways to to control), and rather about working with the child.  I will definately be reading this in the near future.  <br/>\n<br/>\nSo thank you again to everyone for all your responses.  If I didn&#39;t make a note of your reply its because I am still processing what was said.<br/>\n<br/>\nToday my daughter had a BIG blowup with her Grandmother.  There was yelling, hitting and general defiance again.  I told my mom that I would take care of it as she was trying to put my daughter in a time out.  I simply sat down with my daughter and held her.  We talked for a few minutes and I used something that I picked up from the Sandra Dodd website.  I asked her &quot;Why did you hit your grandmother Gabby?  You must have been pretty angry to hit her like that, was your heart-sad about something?  Is there anything that I can do?&quot;, you could see her thinking about it for a minute.  I then asked her if she needed a hug.  She burst into tears, crawled into my arms, and told me everything.  Wow.  <br/>\n<br/>\nMuch better then hysterical tantrums that were so bad that I was bawling myself.<br/>\n<br/>\nI can&#39;t thank you all enough.<br/>\n<br/>\nJo-Anna</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another Behavior Problem - PLEASE HELP","postDate":"1285420605","msgId":44878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3a3NudCtrajY1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PERBRjc3NDlBLUQ2NjYtNDRFNi1CRTRFLTVGNDBDMzNDQUQ3RUB2ZXJpem9uLm5ldD4="},"prevInTopic":44871,"nextInTopic":44880,"prevInTime":44877,"nextInTime":44879,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"Thanks for your input, Joyce. We all have our own communication methods. And ideas we are trying to communicate. My idea, not always expressed in the same","messageBody":"<div id=\"ygrps-yiv-239876945\">Thanks for your input, Joyce. We all have our own communication methods. And ideas we are trying to communicate. <br/>\n<br/>\nMy idea, not always expressed in the same exact formulation, is that we are a family here and I don&#39;t hit him and others don&#39;t hit each other and that he should notice that in learning not to hit me or anyone else. <br/>\n<br/>\nHe is at an age, and level of understanding, where the immediate situation can be relatively simple -- screaming at the top of his lungs while I am driving (because he likes to and then proudly comments on how loud he was :) ) is not a good thing and he shouldn&#39;t do it -- but the conversation we have can be more in-depth.<br/>\n<br/>\nI will tell DN to stop screaming, that it is making it harder for me to drive. He answers: &quot;Why?&quot; Me: &quot;Because I need to think while I am driving and the loudness is distracting.&quot; Him: &quot;Why?&quot; It goes on from there. :)<br/>\n<br/>\nNow, he&#39;s not trying to be difficult. Much. He does have a great sense of humor and loves to trick everyone. :) He is four and experimenting. Fine. But I really am driving and I really don&#39;t want to be hit, I really do want to take a phone call or have a conversation and make myself heard, I really do have to go to the bank or this business office or that, etc. No, these things can&#39;t be postponed or left undone and, no, there is no one else to watch him. I am the fallback position in this case. :)<br/>\n<br/>\nAnd the point is not, in DN&#39;s case, anyway, whether or not he is doing something/going somewhere that is about him or that we might think he would particularly enjoy. Given the choice, as he is whenever possible, he almost always chooses to go everywhere. <br/>\n<br/>\nAnd he is in a period of finding out what that, and so much else, means. The older kids and I have talked about that -- that DN is not just learning this thing or that thing, he is learning the whole world, everything is new to him, he requires explanations.<br/>\n<br/>\nYesterday, he decided he wanted to take the ride to pick up DD after rehearsal. But then, on the way to the car, he had some sort of problem with the cat, and his way of protesting the cat&#39;s lack of interest was to take his pants off. Don&#39;t laugh. He&#39;s four and this gets a reaction usually and delays things and gets him attention and whatever. Pants are handy and he&#39;s experimenting. But, in this case, it didn&#39;t matter that he didn&#39;t have pants on. And I told him that. We weren&#39;t going anywhere where pants were required so he could keep them off and come along or not. Not the reaction he would get if we were going somewhere that required pants. End of episode. He got in the car, pantsless. <br/>\n<br/>\nThe day is full of little things like this that don&#39;t seem like much but get, from me anyway, a fuller-than-possibly-necessary explanation of what the deal is. <br/>\n<br/>\nNot hitting is not just about him not hurting me. It&#39;s about how he relates to all of us. And it&#39;s not just about being super clear that hitting itself is bad. It&#39;s all connected. And I would rather make that connection clearer over time than just solve the problem this one time. <br/>\n<br/>\nWe have long conversations about things. I know I am nuts from the looks I get from people. You really have not lived until you get the disdainful look from the 20-something at the Office Depot as you are explaining the Registered Trademark (R) to a 4-year-old. Who asks, &quot;What&#39;s this?&quot; all the time. <br/>\n<br/>\nBut somewhere in that jumble of words, he heard words new to him, that the thing he is asking about is important in the world and he deserves a full explanation. (Reality permitting.)<br/>\n<br/>\nCorrect unschooling speak is important too. I&#39;m sure I will get a reply here about making things basic so the new unschoolers get it. But there&#39;s more to living with a child than that.<br/>\n<br/>\nYesterday&#39;s other &quot;out with a small child in the real world&quot; incident. An old woman shushed DN at the Office Depot. He was being loud but I thought that was better than the alternative as I made the copies I needed. He was startled to be addressed by this woman and asked me, &quot;Why shhh?&quot; I told him not to worry about it, to just have fun, that she was just old and cranky. He relaxed and went back to playing -- and being fairly loud. <br/>\n<br/>\nI think it is more important than just about anything to do with decorum that this child know that I am there for him, that I will explain things, that his questions will be answered, that there is a reason for things, etc. Even if the entire explanation is way too much information for him right now, that sense of family and security is what I am after. Not &quot;I don&#39;t want to be hit&quot; or &quot;Any old woman can come up and tell you what to do&quot; but &quot;I am here for you,&quot; &quot;We are a family&quot; and &quot;We treat each other well.&quot;<br/>\n<br/>\nThat&#39;s a more subtle message but I think I will be living with this child for many years to come -- long, complicated, completely boring drug-related ugliness elsewhere that landed him here -- and that sense of real security is the important message I always want to give this boy. <br/>\n<br/>\nNothing more than any other parent here wants to communicate, I&#39;m sure.<br/>\n<br/>\nNance<br/>\n<br/>\nP.S. And having re-read your note -- I am found to be wrong regularly by my children. Not so much that I am a liar but that I am a human being and full of flaws. I am not opposed to whatever power that gives them.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Sep 24, 2010, at 12:48 PM, marbleface@... wrote:<br/>\n&gt; <br/>\n&gt; &gt; When I have been thrumped on the butt by my Dear Nephew, also 4, I  <br/>\n&gt; &gt; tell we don&#39;t hit here and to stop it.<br/>\n&gt; <br/>\n&gt; Saying &quot;Don&#39;t hit,&quot; is clearer. If a child has already hit, it&#39;s  <br/>\n&gt; pretty obvious there is hitting here ;-) And could be again. All he  <br/>\n&gt; has to do to make mom a liar is swing again! That&#39;s giving him some  <br/>\n&gt; power that it&#39;s best not to.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Another Behavior Problem - PLEASE HELP","postDate":"1285352315","msgId":44871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBRjc3NDlBLUQ2NjYtNDRFNi1CRTRFLTVGNDBDMzNDQUQ3RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGk3aWtwZCt1bDB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGk3aWtwZCt1bDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":44870,"nextInTopic":44878,"prevInTime":44870,"nextInTime":44872,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"... Saying Don t hit, is clearer. If a child has already hit, it s pretty obvious there is hitting here ;-) And could be again. All he has to do to make mom","messageBody":"<div id=\"ygrps-yiv-393213637\">On Sep 24, 2010, at 12:48 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I have been thrumped on the butt by my Dear Nephew, also 4, I  <br/>\n&gt; tell we don&#39;t hit here and to stop it.<br/>\n<br/>\n </span></blockquote>Saying &quot;Don&#39;t hit,&quot; is clearer. If a child has already hit, it&#39;s  <br/>\npretty obvious there is hitting here ;-) And could be again. All he  <br/>\nhas to do to make mom a liar is swing again! That&#39;s giving him some  <br/>\npower that it&#39;s best not to.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Another Behavior Problem - PLEASE HELP","postDate":"1285349057","msgId":44870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzMzgzMjM2MjE4NjQ5RjBCRjZEMDMxMkQ5M0FCMkY5QEx5bGFQQz4=","inReplyToHeader":"PGk3aWtwZCt1bDB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGk3aWtwZCt1bDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":44869,"nextInTopic":44871,"prevInTime":44869,"nextInTime":44871,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"time outs are no more respectful or conducive to growing into one s one person than any other punishment.    time out is just a euphemism for forced","messageBody":"<div id=\"ygrps-yiv-346594502\">time outs are no more respectful or conducive to &quot;growing into one&#39;s one person&quot; than any other punishment.    time out is just a euphemism for forced isolation and rejection.    and originally, it came from behavioral reinforcement with animals - &quot;time out from positive reinforcement&quot;<br/>\n<br/>\none doesn&#39;t &quot;try&quot; treating a child with respect - it&#39;s not something that has an instant payoff, or works vs. doesn&#39;t work - it&#39;s a lifelong relationship.  and it might be really helpful for you to learn more about developmental norms...<br/>\n<br/>\nremoving toys doesn&#39;t help develop problem solving skills either.    I really encourage you to read more...have you read &quot;connection parenting&quot; or &quot;parenting from the inside out&quot; or any articles  from www.naturalchild.org or &quot;how to talk so kids will listen and listen so kids will talk&quot;?   <br/>\n<br/>\n<br/>\nlyla <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another Behavior Problem - PLEASE HELP","postDate":"1285346925","msgId":44869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3aWtwZCt1bDB2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3ZnUxZithOWhnQGVHcm91cHMuY29tPg=="},"prevInTopic":44867,"nextInTopic":44870,"prevInTime":44868,"nextInTime":44870,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"It is far away. She s four, for goodness sake. When I have been thrumped on the butt by my Dear Nephew, also 4, I tell we don t hit here and to stop it. ","messageBody":"<div id=\"ygrps-yiv-118064058\">It is far away. She&#39;s four, for goodness sake.<br/>\n<br/>\nWhen I have been thrumped on the butt by my Dear Nephew, also 4, I tell we don&#39;t hit here and to stop it. <br/>\n<br/>\nEventually, that message will get through but I sure don&#39;t expect perfection, or even real understanding, yet. Especially when he&#39;s presented with such a large, inviting target, right at eye level for much of his day. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;movingonout2009&quot; &lt;movingonout2009@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;   We are trying to teach our four year old daughter by example how to behave, but at times is just is not working.  I have been trying to deal with her with respect, and treat her moods and opinions to be just a important to me us adults.  This is quite a change from the way I was raised and I am finding that I am having difficulty in knowing what I should do when temper tantrums start, or how to diffuse the situation peacefully.  An example would be today.  I was trying to pack up some snacks so that we could get out of the house for the morning when her and her brother started hitting each other.  I tried to intervein by simply seperating the two, and removing the toy of contention that they were fighting over.  Well, my daughter started hitting me, and then getting progressively more and more aggressive.  She was yelling at me, refusing to do anything that I asked, and hitting me wherever she could reach.  My instinctive response is to smack her hands back and tell her that it hurts when people hit.  This is not the parent that I want to be, so I refuse to do so.  I believe that when we smack our kids - in any form, we are essentially telling them that that it IS ok to hit, and that we can do so to those younger and weaker to us.  So, yeah, hitting is not cool for us in any shape.  Anyways, timeouts don&#39;t work with her as she simply smashes herself in to to door, or sits slamming her feet into it all the while screaming.  That is if she doesn&#39;t simply let herself out of her room.  I have tried holding her door shut before, but this behaviour goes on for so long that I just can&#39;t stay and do that.  I also have to take care of my son while she is having her melt down.  I have also tried simply ignoring her when her behavior is inappropiate, but this time when I tried she just amped it up and started hitting harder, kicking, and then she went after her brother.  <br/>\n&gt; <br/>\n&gt; I have tried treating her with respect, I have tried treating her fairly, I have tried to explain things to her.  I don&#39;t want her to base her decisions on how to behave on fear of rephrasial or rejection, but at this point I just don&#39;t know what to do.  I am hoping to raise her to be an independant thinker who decides her actions and behaviours upon her own principals of what is right and wrong, not what is expected of her from the view of authority.  But right now all that seems so far away, and I feel so losst<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Another Behavior Problem - PLEASE HELP","postDate":"1285319779","msgId":44867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGNDBBOTE5LUNBQzgtNDQ5OC1BODI3LUJCMUZDNTQ0NUVDNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ4MjAzNy41MzIyMy5xbUBzbXRwMTExLW1vYi5iaXoubWFpbC5uZTEueWFob28uY29tPg==","referencesHeader":"PDQ4MjAzNy41MzIyMy5xbUBzbXRwMTExLW1vYi5iaXoubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":44865,"nextInTopic":44869,"prevInTime":44866,"nextInTime":44868,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"... Scott sends out something brilliant everyday :-) His emails are also short, easy to read. They can help parents keep focused on what s important: relating","messageBody":"<div id=\"ygrps-yiv-1898828682\"><blockquote><span title=\"ireply\">&gt; I hadn&#39;t heard of a Time In before.. It&#39;s amazingly brilliant! Off  <br/>\n&gt; to check out Scotts page.<br/>\n<br/>\n </span></blockquote>Scott sends out something brilliant everyday :-)<br/>\n<br/>\nHis emails are also short, easy to read. They can help parents keep  <br/>\nfocused on what&#39;s important: relating to their kids.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.enjoyparenting.com/dailygroove\">http://www.enjoyparenting.com/dailygroove</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy Chester","from":"Amy Chester &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Another Behavior Problem - PLEASE HELP","postDate":"1285311887","msgId":44865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4MjAzNy41MzIyMy5xbUBzbXRwMTExLW1vYi5iaXoubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":44855,"nextInTopic":44867,"prevInTime":44864,"nextInTime":44866,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"Kelly, I hadn t heard of a Time In before.. It s amazingly brilliant! Off to check out Scotts page. Love and Laughter, Amy [Non-text portions of this message","messageBody":"<div id=\"ygrps-yiv-314628002\">Kelly,<br/>\nI hadn&#39;t heard of a Time In before.. It&#39;s amazingly brilliant! Off to check out Scotts page.<br/>\nLove and Laughter,<br/>\nAmy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":80776775,"authorName":"Kelly","from":"&quot;Kelly&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Another Behavior Problem - PLEASE HELP","postDate":"1285271124","msgId":44855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3Z2Fvays1N21jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3ZnUxZithOWhnQGVHcm91cHMuY29tPg=="},"prevInTopic":44853,"nextInTopic":44865,"prevInTime":44854,"nextInTime":44856,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"I absolutely have a lot of empathy for what you and your daughter are going through at this stage of your lives together.  My daughter was similar at that age","messageBody":"<div id=\"ygrps-yiv-179614356\">I absolutely have a lot of empathy for what you and your daughter are going through at this stage of your lives together.  My daughter was similar at that age and there were a lot of times I had no idea what would be the right thing to do and it is hard.  I agree with Merideth&#39;s suggestions and I have one thing to add.   I was introduced to the idea of a &quot;time in&quot; through Scott Noel&#39;s Daily Groove and really wished I had heard about it when my daughter was small.  The idea is to practice when the child is in a good place and invite them to sit with you while you hold them, take deep calming breaths and share a joyful loving moment with them.  By giving this moment a name you can practice inviting them to a time in when they start to get upset and they know it&#39;s a good thing.   Really you could name it anything that would appeal to your daughter but practice when she is happy and calm then it will give you both one more coping option when things start getting rough.   I have used this general technique to help adults with disabilities learn better ways to deal wth anxiety so I know it is very effective.  Introduce the technique, practice when things are good and suggest it when things start to get difficult.    It might not work every time and it might take a lot of practice but it&#39;s so much more peaceful and effective than punishment.   Play with the idea based on what you know about your daughter and see what works for her.  <br/>\nKelly</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Another Behavior Problem - PLEASE HELP","postDate":"1285264927","msgId":44853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3ZzRtditvcDk0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3ZnUxZithOWhnQGVHcm91cHMuY29tPg=="},"prevInTopic":44848,"nextInTopic":44855,"prevInTime":44852,"nextInTime":44854,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"... *************** There s a biiiiiiig expectation, there, that she has the *ability* to do exactly what you want when you want. That s something that isn t","messageBody":"<div id=\"ygrps-yiv-1102453735\">&quot;movingonout2009&quot; &lt;movingonout2009@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;   We are trying to teach our four year old daughter by example how to behave, but at times is just is not working.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThere&#39;s a biiiiiiig expectation, there, that she has the *ability* to do exactly what you want when you want. That&#39;s something that isn&#39;t in the cards for a lot of 4yos! <br/>\n<br/>\nIt will help to see her behavior as communication. She&#39;s not trying to drive you crazy or be a bad person, she&#39;s little and the world is a big, complex, difficult place for a little bitty person. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am having difficulty in knowing what I should do when temper tantrums start, or how to diffuse the situation peacefully.<br/>\n </span></blockquote>*************<br/>\n<br/>\nA tantrum communicates overwhelm - she&#39;s out of ideas, patience, skills and ability to communicate and is falling apart. The Best way to deal with tantrums is to work on preventing them, so your little one isn&#39;t stuck without any resources. <br/>\n<br/>\nIn the moment, look for what she needs. With young children, the most common need of all is attention - and in the example you gave you were busy getting ready to go. If lack of attention is a big issue for her, then find ways to give her more. Re-evaluate how you do things to make them more child-friendly - that may be something you do on a regular basis for awhile. When Mo was younger there were times when I&#39;d space out &quot;getting ready&quot; over an hour with lots of interruptions to do things with Mo. At another point I&#39;d make a list of alllllll the little details I needed to address and ask her to check things off the list for me. Other times I&#39;ve involved her in getting ready. The strategy keeps changing because my daughter keeps growing! Her needs and interests change, sometimes overnight. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I tried to intervein by simply seperating the two, and removing the toy of contention that they were fighting over. <br/>\n </span></blockquote>*************<br/>\n<br/>\nSibling quarrels over toys are another area where you may find there&#39;s no one, perfect strategy - the kids keep growing and changing, and the circumstances are different every time. It helps to think in terms of helping them build a problem solving tool kit - and depending on their needs in the moment that may include distracting one, offering something else (snacks), or doing a lot of talking. There are some more ideas here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n<br/>\nBut remember, your &quot;goal&quot; isn&#39;t to get them &quot;over it&quot; as soon as possible but to help them have more tools, better understanding. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Well, my daughter started hitting me, and then getting progressively more and more aggressive.  She was yelling at me, refusing to do anything that I asked, and hitting me wherever she could reach.<br/>\n </span></blockquote>***************<br/>\n<br/>\nProtect yourself as much as you can, protect your other child as needed - say &quot;Don&#39;t hit&quot; or something similar, for sure, but let your daughter know you&#39;re Sorry you weren&#39;t as attentive to her needs as she needed you to be. See her as having a big emotional reaction without any good tools to express herself. Saying something like &quot;Use words&quot; won&#39;t help in the moment! But helping her find better options when she&#39;s A Little frustrated, rather than melting down, will help her have more, better tools when things are rough - that&#39;s an important part of being more attentive! You need to be responding sooner, so you can help her find ways to express herself before she&#39;s at the hitting stage of frustration. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Anyways, timeouts don&#39;t work with her<br/>\n<br/>\n </span></blockquote>Yeah, I learned that one the hard way, too, back when I was moving away from spanking with my stepson. Timeouts *seem* non-violent when you have a compliant child, but the only thing that keeps a more intense child in a time out is violence. Yikes. More prevention. More attention. Step away from &quot;getting things done&quot; for awhile. Expect doing anything other than spend time with the kids to take much, much longer for awhile. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I have tried treating her with respect, I have tried treating her fairly, I have tried to explain things to her.<br/>\n </span></blockquote>**************<br/>\n<br/>\nYou&#39;ve done all those things and yet she&#39;s Still a 4yo! Maybe one who needs more attention or has a shorter fuse - have you read Raising your Spirited Child or The Explosive Child? There are good ideas in both of those in terms of Preventing melt-downs, and prevention really is what will save your sanity. It will seem like more work at first because itsa transition, and you&#39;re learning new skills, but once you&#39;ve got a new set of tools of your own, you&#39;ll find you don&#39;t spend any more time being proactive than you have been spending being reactive - and its much, much more pleasant and less stressful!<br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":438157381,"authorName":"movingonout2009","from":"&quot;movingonout2009&quot; &lt;movingonout2009@...&gt;","profile":"movingonout2009","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Another Behavior Problem - PLEASE HELP","postDate":"1285258095","msgId":44848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3ZnUxZithOWhnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44853,"prevInTime":44847,"nextInTime":44849,"topicId":44848,"numMessagesInTopic":0,"msgSnippet":"We are trying to teach our four year old daughter by example how to behave, but at times is just is not working.  I have been trying to deal with her with","messageBody":"<div id=\"ygrps-yiv-846178805\">We are trying to teach our four year old daughter by example how to behave, but at times is just is not working.  I have been trying to deal with her with respect, and treat her moods and opinions to be just a important to me us adults.  This is quite a change from the way I was raised and I am finding that I am having difficulty in knowing what I should do when temper tantrums start, or how to diffuse the situation peacefully.  An example would be today.  I was trying to pack up some snacks so that we could get out of the house for the morning when her and her brother started hitting each other.  I tried to intervein by simply seperating the two, and removing the toy of contention that they were fighting over.  Well, my daughter started hitting me, and then getting progressively more and more aggressive.  She was yelling at me, refusing to do anything that I asked, and hitting me wherever she could reach.  My instinctive response is to smack her hands back and tell her that it hurts when people hit.  This is not the parent that I want to be, so I refuse to do so.  I believe that when we smack our kids - in any form, we are essentially telling them that that it IS ok to hit, and that we can do so to those younger and weaker to us.  So, yeah, hitting is not cool for us in any shape.  Anyways, timeouts don&#39;t work with her as she simply smashes herself in to to door, or sits slamming her feet into it all the while screaming.  That is if she doesn&#39;t simply let herself out of her room.  I have tried holding her door shut before, but this behaviour goes on for so long that I just can&#39;t stay and do that.  I also have to take care of my son while she is having her melt down.  I have also tried simply ignoring her when her behavior is inappropiate, but this time when I tried she just amped it up and started hitting harder, kicking, and then she went after her brother.  <br/>\n<br/>\nI have tried treating her with respect, I have tried treating her fairly, I have tried to explain things to her.  I don&#39;t want her to base her decisions on how to behave on fear of rephrasial or rejection, but at this point I just don&#39;t know what to do.  I am hoping to raise her to be an independant thinker who decides her actions and behaviours upon her own principals of what is right and wrong, not what is expected of her from the view of authority.  But right now all that seems so far away, and I feel so losst</div>","specialLinks":[]}],"prevTopicId":44876,"nextTopicId":44881}}