{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New to this group and to unschooling","postDate":"1306844290","msgId":46780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRDNjE4QFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46779,"nextInTopic":0,"prevInTime":46779,"nextInTime":46781,"topicId":46776,"numMessagesInTopic":0,"msgSnippet":"... Uh, why in the world would school personnel need to touch ANY child, unless that child was creating a serious danger to themselves and others and needed to","messageBody":"<div id=\"ygrps-yiv-927954403\"><blockquote><span title=\"ireply\">&gt; she was also getting very upset in school when they would put their hands on her<br/>\n<br/>\n </span></blockquote>Uh, why in the world would school personnel need to touch ANY child, unless that child was creating a serious danger to themselves and others and needed to be removed from the situation? (And that would need to be pretty extreme a situation, and parents would likely be getting a call to get there ASAP at that point).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to this group and to unschooling","postDate":"1306688731","msgId":46779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlydHVjcit0ZGhnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyczBlcitqazJjQGVHcm91cHMuY29tPg=="},"prevInTopic":46778,"nextInTopic":46780,"prevInTime":46778,"nextInTime":46780,"topicId":46776,"numMessagesInTopic":0,"msgSnippet":"... ***************** That sounds a lot like my daughter - very physical, but also kind of a touch me not personality. Unschooling is especially good for","messageBody":"<div id=\"ygrps-yiv-505494719\">&quot;jen&quot; &lt;kyleighncoltonsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;1 of my children is a very hands on learner and has a very limited attention span. I felt like shed get more from helping me cook and clean and do crafts and helping on our lil farm. all things she enjoys and hold her attention longer then most other things. she was also getting very upset in school when they would put their hands on her.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat sounds a lot like my daughter - very physical, but also kind of a &quot;touch me not&quot; personality. Unschooling is especially good for kids who are atypical in any way because you really get to put your child&#39;s needs and wishes first. <br/>\n<br/>\nIt has been wonderful for me watching both my kids learn all sorts of things I&#39;ve been told they &quot;could only learn in school&quot; on their own terms. Don&#39;t believe people who tell you &quot;they&#39;ll need school to learn x&quot;! Most of the time school makes learning harder and duller and more inconvenient. Unschooling lets you live life and see learning blossom. It&#39;s pretty spectacular. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":205561349,"authorName":"jen","from":"&quot;jen&quot; &lt;kyleighncoltonsmom@...&gt;","profile":"kyleighncoltonsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New to this group and to unschooling","postDate":"1306625307","msgId":46778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyczBlcitqazJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlycnNrNStoZG1yQGVHcm91cHMuY29tPg=="},"prevInTopic":46777,"nextInTopic":46779,"prevInTime":46777,"nextInTime":46779,"topicId":46776,"numMessagesInTopic":0,"msgSnippet":"Thanx for the info.  I first started looking in to this type of schooling because my 1 of my children is a very hands on learner and has a very limited","messageBody":"<div id=\"ygrps-yiv-1052299260\">Thanx for the info.  I first started looking in to this type of schooling because my 1 of my children is a very hands on learner and has a very limited attention span. I felt like shed get more from helping me cook and clean and do crafts and helping on our lil farm. all things she enjoys and hold her attention longer then most other things. she was also getting very upset in school when they would put their hands on her. I feel they are causing her unneeded stress and fear. I feel like the kids will do better at home with less stress and being able to have more freedom to explore what they want.  In the last school year (thank god its over) I have spent so many stressful days at the school fighting with them to get my childs needs met. Im so ready for a change that will destress my children as well as myself.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New to this group and to unschooling","postDate":"1306621381","msgId":46777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlycnNrNStoZG1yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlycm5ocis3ZnEyQGVHcm91cHMuY29tPg=="},"prevInTopic":46776,"nextInTopic":46778,"prevInTime":46776,"nextInTime":46778,"topicId":46776,"numMessagesInTopic":0,"msgSnippet":"... **************** Unschooling is a fairly broad term, encompassing everying from academic unschooling which is simply getting away from curricula to","messageBody":"<div id=\"ygrps-yiv-1878580232\">&quot;jen&quot; &lt;kyleighncoltonsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Any way as I said I&#39;m new to this and have done a bit of research in to it, any advice or thoughts?<br/>\n </span></blockquote>****************<br/>\n<br/>\nUnschooling is a fairly broad term, encompassing everying from &quot;academic unschooling&quot; which is simply getting away from curricula to &quot;radical unschooling&quot; which involves seeing learning as intrinsic to living - and this list focuses on the latter, which can be a bit of a shock if you&#39;re not expecting that ;) A couple good websites to start with:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.whyunschool.info/?page=home\">http://www.whyunschool.info/?page=home</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nIt&#39;s often helpful to people who are starting to unschooling to &quot;take a vacation&quot; - not necessarily in the literal sense, but do the sorts of things you would do on a fun family vacation. Sightsee for the fun of it, or hang out for the enjoyment of one anothers company, or watch a gazillion movies together. Do light things that your kids won&#39;t fear have some kind of educational agenda - nothing that looks like a &quot;field trip&quot; unless all your kids absolutely adore the idea.<br/>\n<br/>\n Take time getting to know one another - school breaks down family bonds so it will take some time to rebuild and get used to being together more than you&#39;re used to. Learn how to communicate and live together - that can be the biggest challenge when transitioning to unschooling! You&#39;re used to &quot;getting&quot; the kids to do things and everyone in the family will need time and practice to figure out how to live without that kind of pressure. <br/>\n<br/>\nIf you like doing research, this is a good time to keep doing it! Read about learning, about personalities about communication. Don&#39;t read about teaching or education - if you decide to do something other than unschooling there will be plenty of time for that and the first curriculum you pick likely won&#39;t be one you stick with anyway. Most home educators change curricula at least once, because what you Think will work is generally different from what your kids really need. Unschooling or not, this is a time of learning for you, too!<br/>\n<br/>\nIt *can* help to read about &quot;gifted&quot; kids and eductation, regardless of whether or not you think your kids are gifted because those sites often say useful things about how people learn and grow. You don&#39;t read much about asynchronous development away from &quot;gifted&quot; sites, for instance, but nearly every child grows faster in some ways than others. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I feel like a trip to the zoo is just as much a learning experiance as sitting in scince class.<br/>\n </span></blockquote>********************<br/>\n<br/>\nLearning happens all the time! That&#39;s a sort of unschooling mantra ;) Kids learn watching tv and playing in the mud, building with legos and playing Barbies - and learn as much and as well as they would at the zoo or a museum... and certainly more than in a science class if they&#39;re not totally enthusiastic about being there. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;As well as I could name the things my children learned at school (from other children) That I&#39;d have much rather they learned at home when they were a bit older.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThere are plenty of things, mostly social skills, which kids learn in school that they could do without learning - a lot of schooly habits and skills need to be un-learned when kids leave school at whatever age, that&#39;s part of why college students and other young adults sometimes seem a bit crazy - they&#39;re entering the world without useful life skills. That being said, one of the humbling aspects of parenting, unschooling or not, is that parents aren&#39;t the only resource kids have. They Will learn from other sources. What parents can do, though, is become valued, trustworthy resources. We don&#39;t do that by hiding information but by helping our kids learn what interests them safely. <br/>\n<br/>\nHere&#39;s a link within one of those sites above which describes some of the principles which help learning to flourish:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pam/principles\">http://sandradodd.com/pam/principles</a><br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":205561349,"authorName":"jen","from":"&quot;jen&quot; &lt;kyleighncoltonsmom@...&gt;","profile":"kyleighncoltonsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New to this group and to unschooling","postDate":"1306616187","msgId":46776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlycm5ocis3ZnEyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46777,"prevInTime":46775,"nextInTime":46777,"topicId":46776,"numMessagesInTopic":0,"msgSnippet":"I am a married mother of 5 2girls and 3 boys, We live in the country and I have recently been looking in to this type of schooling. The school here thinks all","messageBody":"<div id=\"ygrps-yiv-1140808937\">I am a married mother of 5 2girls and 3 boys, We live in the country and I have recently been looking in to this type of schooling. The school here thinks all kids need to be medicated and I have a ADHD child as well as 1 we think might be Autistic but she has very bad anxioty at school. I also have 1 that has such a high IQ thats why they say he is so busy in class. <br/>\nAny way as I said I&#39;m new to this and have done a bit of research in to it, any advice or thoughts? I thought this would be a good way for my children to learn rather then being limited or in some cases forced past there comfort zone. I feel like a trip to the zoo is just as much a learning experiance as sitting in scince class. As well as I could name the things my children learned at school (from other children) That I&#39;d have much rather they learned at home when they were a bit older.</div>","specialLinks":[]}],"prevTopicId":46764,"nextTopicId":46781}}