{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":100494168,"authorName":"weikert_home","from":"&quot;weikert_home&quot; &lt;Weikert3@...&gt;","profile":"weikert_home","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Brand New!!!","postDate":"1140034809","msgId":10012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR0MDJkcCtraG82QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":10011,"nextInTime":10013,"topicId":10012,"numMessagesInTopic":0,"msgSnippet":"Hi, everyone!  My name is Faith and I am brand new to unschooling, in fact, so new that my son s first day of freedom will be at the close of the school day","messageBody":"<div id=\"ygrps-yiv-1834676493\">Hi, everyone!  My name is Faith and I am brand new to unschooling, <br/>\nin fact, so new that my son&#39;s first day of freedom will be at the <br/>\nclose of the school day this Friday.  He is 15 and a sophomore by <br/>\ntheir tracking methods.  <br/>\n<br/>\nMy only exposure thus far with unschooling is Teenage Liberation <br/>\nHandbook.  I am about 1/2 way through it.  <br/>\n<br/>\nI only wish I knew about unschooling YEARS ago...Here is the <br/>\nhistory.  I was a single mother since he was born.   He had been in <br/>\ndaycare from 3 months old.  I began working two jobs from when <br/>\nJustin was 4-7. When he entered kindergarten, he had trouble forming <br/>\nletters.  As the years progressed, the system slapped a few labels <br/>\non him.  ADHD a fine motor impairment and the like.  We struggled.  <br/>\nHe never liked school.  Never wanted to sit in his chair.  Would <br/>\nwalk around the room, and when his teacher called on him, he would <br/>\nanswer and usually correctly.<br/>\n<br/>\n(Just for the timeline, I got married when he was 7)  <br/>\n<br/>\nAs he entered high school, his desire to &#39;do as he was told&#39; <br/>\ndisappeared!  Most of our dissagreements and sruggles stemmed from <br/>\nhim not doing his homework or the &#39;chores&#39; I imposed. We had <br/>\npunishments (take away the things he likes: video <br/>\ngames/tv/ipod/etc.) and he would have to earn them back.  Based on <br/>\nhis conformity - is really what it boiled down to...(I know!!! <br/>\nAppalling - as it sounds now!!)<br/>\n<br/>\nI didn&#39;t know of any other way.  <br/>\n<br/>\nI found out about unschooling at the end of this summer through a  <br/>\nbusiness associate and immediately thought this would suit my son&#39;s <br/>\npersonality.  What I am discovering is it is not so much the absence <br/>\nof school but more a lifestyle.  A life of peace.  Living in the <br/>\nmoment.  Trusting your child.  Letting his life be his own.<br/>\n<br/>\nJustin&#39;s initial reaction was in favor.  Then as he thought about <br/>\nit, he became scared.  More afraid of losing his friends than <br/>\nleaving school.  We live directly across the street from his school <br/>\nand usually have a half a dozen kids here on most days.  I am <br/>\nencouraging him through that fear and confident he will soon see the <br/>\nlight!<br/>\n<br/>\nI suppose my intention in writing today is for all of your words of <br/>\nsupport.  This transition is going to require me to &#39;let go&#39; of the <br/>\nway I was raised in favor of a more holistic life.  It sounds like a <br/>\nno brainer!  But I am afraid old habits die hard.<br/>\n<br/>\nTo add to this challenge, my husband, Kurt, (Justin&#39;s stepfather) is <br/>\nunfamiliar with unschooling entirely.  I tell him that Justin and I <br/>\nwill be homeschooling.  He&#39;s okay with that concept.  I look forward <br/>\nto the &quot;list&quot; Sandy is compiling for her dh.  :-)  Kurt is very <br/>\ntraditional in his beliefs or maybe just his habits.  His family was <br/>\nvery much a dictatorship and he tends to think children are to <br/>\nfollow instructions without question.  You know, that &quot;respect for <br/>\nauthority&quot; bull... My advantage is my mother and I had a <br/>\nrelationship where there was more mutual respect.  I respected the <br/>\nrules because she valued me and respected me, too.  Any words of <br/>\nwisdom to get him in sync will be appreciated.  <br/>\n<br/>\nWell, that&#39;s all for now.  Looking forward to the support of this <br/>\ngroup as Justin and I and Kurt embark on our journey of finally <br/>\nliving a life!  By the way, I do also have a two year old and hoping <br/>\nthat she lives and unschooled life.  <br/>\n<br/>\nBlessings,<br/>\nFaith</div>","specialLinks":[]}],"prevTopicId":10008,"nextTopicId":9965}}