{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272986810","msgId":43848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhycGVicSt2am9iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhybXU3MitmNmZsQGVHcm91cHMuY29tPg=="},"prevInTopic":43842,"nextInTopic":0,"prevInTime":43847,"nextInTime":43849,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"Thanks Meridith!!! I do the juices too, but hadn t tried dried fruit--great idea thanks!  Sometimes the juice is gone reallllly fast and other times it","messageBody":"<div id=\"ygrps-yiv-1185189197\">Thanks Meridith!!!<br/>\nI do the juices too, but hadn&#39;t tried dried fruit--great idea thanks!  Sometimes the juice is gone reallllly fast and other times it ferments.  Yes, I have had OJ and Pineapple juice go bad in the fridge because they drank about 1/2 to 3/4 and then it sat there.  LOL<br/>\n<br/>\nI will have to look into a juicer though....We just have our poor over worked blender!<br/>\n<br/>\nHugs!<br/>\n<br/>\nMeredith<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272904738","msgId":43842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhybXU3MitmNmZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhybWpwcCtrbG92QGVHcm91cHMuY29tPg=="},"prevInTopic":43841,"nextInTopic":43848,"prevInTime":43841,"nextInTime":43843,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... ************ Do they like dried fruit at all? That and juices have been my solution to spoiling fruit. Its costly, but at least I don t have to worry about","messageBody":"<div id=\"ygrps-yiv-1546128358\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;amberlee_b&quot; &lt;amberlee16@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think the most difficult part about food is they give me a list, I get the items, and some food spoils.  Usually fruit.  I don&#39;t do big bags as I *know* it will spoil that way.<br/>\n </span></blockquote>************<br/>\n<br/>\nDo they like dried fruit at all? That and juices have been my solution to spoiling fruit. Its costly, but at least I don&#39;t have to worry about it going bad, even if no-one&#39;s in the mood for fruit for a whole week. Fancier fruit juices can be &quot;extended&quot; by mixing with apple juice - do you have a juicer? That&#39;s another option if your kids don&#39;t like dried fruits, run it through the juicer when it starts to look unappealing and make your own mixed drinks - even freeze some for smoothies. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272894073","msgId":43841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhybWpwcCtrbG92QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyazdtYitocmE5QGVHcm91cHMuY29tPg=="},"prevInTopic":43839,"nextInTopic":43842,"prevInTime":43840,"nextInTime":43842,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"Whew, my eldest is going through this too.  Somedays he eats like a bird....but lately he can t get enough so he eats all the leftovers too.  The only","messageBody":"<div id=\"ygrps-yiv-116760788\">Whew, my eldest is going through this too.  Somedays he eats like a bird....but lately he can&#39;t get enough so he eats all the leftovers too.  The only &quot;instant&quot; foods he likes are cereals and ravioli from a can.  Otherwise he prefers veggies (salads, broc, avocado) and some chicken....sometimes tortillas with cheese or dozens of eggs.  I never know for sure what he will want/need.  I try to plan, but it is near impossible!  LOL  I have another child on the verge of 12 who only eats &quot;white&quot; foods with a little green tossed in....that ought to be fun!  I foresee myself in the kitchen more... :)  Thankfully they like to cook for themselves a bit too, especially the eldest one.  <br/>\n<br/>\nI think the most difficult part about food is they give me a list, I get the items, and some food spoils.  Usually fruit.  I don&#39;t do big bags as I *know* it will spoil that way.  I am just surprised sometimes by what doesn&#39;t get eaten.  That is tougher when on a budget. :(</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272844492","msgId":43839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhybDNjYys3Y2dlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhya20wdStoYjBjQGVHcm91cHMuY29tPg=="},"prevInTopic":43835,"nextInTopic":43841,"prevInTime":43838,"nextInTime":43840,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... **************** Things can go in cycles, too - and that s as much the case with adults as kids. Its natural, to some extent, to revisit things, especially","messageBody":"<div id=\"ygrps-yiv-1726047225\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I feel so lame that I am back in this place again - the last time I posted about the exact same thing was 6 months ago and I really thought I had a handle on it. I guess I still do have a lot more deschooling to do.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThings can go in cycles, too - and that&#39;s as much the case with adults as kids. Its natural, to some extent, to revisit things, especially when the situation becomes stressful. Its also &quot;natural&quot; to have recurring issues with Exes - we have our fair share with George&#39;s Ex and that does play out in Ray&#39;s life as some cyclic issues that need to be deschooled repeatedly - on his part and Ours, too.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272830814","msgId":43835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhya20wdStoYjBjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyZzFxNys0ZGN0QGVHcm91cHMuY29tPg=="},"prevInTopic":43832,"nextInTopic":43839,"prevInTime":43834,"nextInTime":43836,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"Realized it is probably more useful to have the discussion on list in case there is anyone else struggling with similar things. Let me know if you d rather","messageBody":"<div id=\"ygrps-yiv-1551882609\">Realized it is probably more useful to have the discussion on list in case there is anyone else struggling with similar things. Let me know if you&#39;d rather have it offline, it is fine with me either way.<br/>\n<br/>\nAnyway, as to your question about disconnection/depression, yes, it seems like there may be some of that going on. He seems to be having a hard time with my attention going to his sister so much, since it was just me and him for so long before I met his stepdad and had the baby. Now that she is more than just a nursing appendage, I feel like I have so little time to focus on him and his needs and there is less connection with him. That is on top of his &quot;atypical&quot; stuff (yes I read that article) and high needs already. He says he is bored and asks me to do things with him, but he loses interest really quickly and wanders off to go back to his game or show of the moment most of the time. I sit with him and watch him play or watch his shows or TV with him when I can, but there is only so many times I can watch the same repeat of Wizards of Waverly Place without going batty, and most of the things I think of he isn&#39;t into. <br/>\n<br/>\nHe has made some good friends, schooled and unschooled (we have a really amazing unschooling community here, I am VERY lucky that way, Victoria BC Canada if anyone is looking for an unschooling friendly community), but has really high social needs, so I think he is still lonely. I think he misses his Dad even though he doesn&#39;t get along with him well and says he doesn&#39;t.  All things that make it harder for him to settle and feel safe and happy and my stressing and being worried and reactive is a big part of that. <br/>\n<br/>\nBut on to the good parts, because of course, there are LOTS of them, I just forget when I am feeling overwhelmed, which I have been lately. Just yesterday I took him to get the knife like I said I would. We went to the specialty shop he wanted, even though he might have gotten a better deal at walmart or another big store. He was really happy that it was still open, since it was quite late. He really wanted a straight knife in a sheath, but he agreed with me that a folding knife is safer and we picked one that was the most like the straight knife he wanted, then looked at some archery equipment and decided we&#39;d try archery first to see if he liked it before we bought any. We also went to pick up some materials for a craft we had planned (spartan armour) and then stopped at DQ for an ice cream. We sang Phineas and Ferb songs in the car the whole way and had a really nice time. It was so nice to connect with him and just hang out and see him happy and having fun with no struggle. <br/>\n<br/>\nWhat was different between this and what has been happening lately? I guess it was his agenda and I didn&#39;t try to control it. Also it was a surprise, he wasn&#39;t expecting it. That seems to be one of the sticky bits, if he gets an expectation about something, whether from something I say or something he has decided, he can&#39;t seem to accept any deviation, he just gets more and more worked up. I read some great stuff from Danielle Conger about her process with her son that helps, but sometimes even when I am a mountain, his volcano seems bigger than I can contain. <br/>\n<br/>\nAnyway, I am really grateful for the perspective from you and everyone else who has replied. I feel so lame that I am back in this place again - the last time I posted about the exact same thing was 6 months ago and I really thought I had a handle on it. I guess I still do have a lot more deschooling to do.</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272817873","msgId":43832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyazljaCtrNHNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PHMybTY1MThhOTM2MTAwNTAxMTIyNnA4YjEwZDM0OGxjYzJhZDg1Yzg4MmY5ZDg0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43830,"nextInTopic":43835,"prevInTime":43831,"nextInTime":43834,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... Wow, you are my hero. Rice pudding maybe, but the only croissant I think I ll be making comes in a pillsbury can :) ... I bought him a Costco case of ramen","messageBody":"<div id=\"ygrps-yiv-491373148\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, diana jenner &lt;hahamommy@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just made Croissant & Pain au Chocolat. <br/>\n<br/>\n </span></blockquote>Wow, you are my hero. Rice pudding maybe, but the only croissant I think I&#39;ll be making comes in a pillsbury can :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; There&#39;s an episode of Man vs Food, where he goes to a Ramen Restaurant! Yes,<br/>\n&gt; they charge $$$ for Ramen noodles with amazing sauces & additions. Fun<br/>\n&gt; episode, you should find it and watch it together ;) He&#39;d appreciate some<br/>\n&gt; Ramen Love :)  I bought my son a special bowl, just for eating hot Ramen.<br/>\n&gt; And we keep a case on the fridge.  It&#39;s been weeks without a ramen request<br/>\n&gt; and the perfect-for-ramen bowl has become a perfect-for-anything bowl.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I bought him a Costco case of ramen months ago and there is still some there. I am beginning to see the molehill. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hayden, now 11.5, was &quot;stuck&quot; at 4&#39;9&quot; for what seemed a very long time. And<br/>\n&gt; he grew rounder and rounder... Take pictures more often, so you can actually<br/>\n&gt; see the changes happening to him. That works for me! I can compare week to<br/>\n&gt; week, it&#39;s amazing.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I like the pictures idea. I have been checking his height often and seeing how much he is growing up as well as out, which is a lot. But pictures have been trouble because I am really inconsistent about them so I look at the last batch from the fall and get a shock at the huge difference. Taking them more often is a really good idea, I don&#39;t remember the last time he changed so rapidly and drastically as this last year.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And my advice on blocking (especially a block you are aware of BEing): STOP<br/>\n&gt; IT! Just Stop. Get out of the way if you can&#39;t be on the team. Ideally, get<br/>\n&gt; on the team. In a situation where an adult feels blocked by circumstance (be<br/>\n&gt; it lawyer, death of spouse, whatever), there is no favor done to the child<br/>\n&gt; who is blocked by an adult in turn.  In the face of ugliness, a unified,<br/>\n&gt; HAPPY, loving team is imperative.   It&#39;s Team Childhood, the kid only gets<br/>\n&gt; one and it&#39;s up to YOU first, as the present parent to provide him with a<br/>\n&gt; happy one. Also I call it up to you to enjoin the other biological parent to<br/>\n&gt; jump onboard, by showing him how wonderful and important it is to gift your<br/>\n&gt; child with the opportunity to actually BE a child. And not get caught up in<br/>\n&gt; emotional & legal bull$hit. The two of you together looking at the child you<br/>\n&gt; created. You and your child, looking together at the world, working together<br/>\n&gt; to navigate it&#39;s complexities.<br/>\n&gt; (Read that above paragraph again, this time with a cheerleader voice...<br/>\n&gt; that&#39;s what I was going for, inspiration!)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Diana - I ALWAYS read you with a cheerleader voice, in fact I think you are my unschooling muse, so thanks for responding, I know you don&#39;t do it often. <br/>\n<br/>\nAs for the other bio parent though, all cheerleading aside, I would love for him to get on board. I will really have to dig deep to see a way to approach that, my instinct is to say it isn&#39;t possible but who knows, anything can happen. About the only thing we have ever done right together is conceive. It is a different story with his stepdad though, he is wonderful and we are SO lucky to have him. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Parenting Peacefully is the recording I keep in my head when I need<br/>\n&gt; reminding ;) <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a> it&#39;s at the bottom of<br/>\n&gt; the page :D<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I will listen to that again. Thanks!</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272816139","msgId":43830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyazdtYitocmE5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5ODczNS4xOTU4NC5xbUB3ZWI2NTcwNC5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":43829,"nextInTopic":43832,"prevInTime":43829,"nextInTime":43831,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... ******************* A big deal for Ray was instant foods - ramen, mac-n-cheese in the box, canneds soups, frozen burritos.... some of that was that","messageBody":"<div id=\"ygrps-yiv-1018999031\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jenna Robertson &lt;mamamole@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I started buying crazy amounts of whatever they were really into at that time.  It wasn&#39;t just candy :)  Instant soup bowls from Trader Joe&#39;s, chips, ice cream, ice cream cones, whipped cream, strawberries,<br/>\n&gt;  chocolate.  Whatever I noticed they were really eating a lot of, I&#39;d buy even more.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nA big deal for Ray was &quot;instant&quot; foods - ramen, mac-n-cheese in the box, canneds soups, frozen burritos.... some of that was that convenience foods had been banned at his bio mom&#39;s house, but some of it, too, was that he liked the sheer independence of being able to &quot;cook&quot; something without it being a big deal. Making food didn&#39;t &quot;have to&quot; be some kind of agony of nutritional correctness, it could be about satisfying an urge right now. He moved past that to liking to cook from scratch, to enjoying the process of thinking about ingredients and nutritional value and giving a gift of tasty, healthy food to family and friends - but it took about two years from the time he left school to the time he started cooking from scratch, time with no pressure at all to eat or cook by any standard but his own. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272812225","msgId":43829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEQkI4NjY5NzJGMzQwMTY4QTMzMEU0NTFDNjVBOEY2QGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":43828,"nextInTopic":43830,"prevInTime":43828,"nextInTime":43830,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"***I seen him growing again.*** I didn t seen him.  I *see* him.  My fingers sometimes don t tell my brain what they re doing. The other day while we were in","messageBody":"<div id=\"ygrps-yiv-404533315\">***I seen him growing again.***<br/>\n<br/>\nI didn&#39;t seen him.  I *see* him.  My fingers sometimes don&#39;t tell my brain what they&#39;re doing. <br/>\n<br/>\nThe other day while we were in the car, I turned to look at him and he suddenly looked so mature and manly.   He has been very hungry lately, needing another meal in the late evening and eating a lot more for his breakfast.  I don&#39;t have leftovers anymore. &lt;g&gt; <br/>\n<br/>\nKids change.  Calorie requirements change. Parents should absolutely provide great,  nutritious foods for their kids but we don&#39;t have any special powers for determining  how another person should grow, what shape or size they ought to be,  or how many calories a growing body and brain needs.  <br/>\n<br/>\nOne certain way to make sure a person ends up with life long food and weight issues is to control food. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272744340","msgId":43828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5ODczNS4xOTU4NC5xbUB3ZWI2NTcwNC5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PHAyeTY1MThhOTM2MTAwNTAxMTI1MGpmNmU0YThmYmo2MmU4YmFhMjQxZjhjNzFjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43827,"nextInTopic":43829,"prevInTime":43827,"nextInTime":43829,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... Weight and food were huge control issues in my family growing up.  It s hard not to hear my father s voice in my head when I look at my girls.  When we","messageBody":"<div id=\"ygrps-yiv-1355920913\">:) My brother grew 6 inches in one summer!!  And my husband grew another inch in his early 20&#39;s (I&#39;ll credit my great cooking).  <br/>\n<br/>\nWeight and food were huge control issues in my family growing up.  It&#39;s hard not to hear my father&#39;s voice in my head when I look at my girls.  When we first started deschooling food my youngest (a small 8 yr old at the time) was eating a pound of candy a day - that was such a huge struggle for me!!!  My husband and this group helped a lot and I let go.  She still has times where she eats quite a bit of candy,  but it&#39;s really not that often.  The key was in me letting go.  When I let go she could find her balance.  Also, we have always had a tight budget and not bought a lot of extras or candy or chips up until this past fall.  To help my kids get past that feeling of &quot;we&#39;ll run out&quot; or &quot;I&#39;ll never get more&quot; or &quot;we don&#39;t have enough&quot; I started buying crazy amounts of whatever they were really into at that time.  It wasn&#39;t just candy :)  Instant soup bowls from Trader Joe&#39;s, chips, ice cream, ice cream cones, whipped cream, strawberries,<br/>\n chocolate.  Whatever I noticed they were really eating a lot of, I&#39;d buy even more.  Soon there was candy left in the pantry, nights (or mornings) where no one ate ice cream, doughnuts getting thrown out because they were no longer good (doughnuts are $2.50 a dozen at our grocery store if you buy them after 6:30 p.m. and seeing what&#39;s left at the end of the day became a fun adventure.)  <br/>\n<br/>\nWhen we get to a point of conflict it&#39;s always ME not the kids causing the stress.  There&#39;s something I&#39;m holding onto.<br/>\n<br/>\nWe didn&#39;t start unschooling until my daughter was almost 13.  If the kid wants to unschool and the parent can really let go I don&#39;t think it&#39;s ever too late. I&#39;m 42 and I think we parents are unschoolers too.  If it&#39;s not too late for me, how can it be too late for my kids? :)<br/>\n<br/>\nJenna<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272743406","msgId":43827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAyeTY1MThhOTM2MTAwNTAxMTI1MGpmNmU0YThmYmo2MmU4YmFhMjQxZjhjNzFjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGkybjY1MThhOTM2MTAwNTAxMTI0M3c1NWRiYjA3NmtlODVhNjk0NjM2NDFmM2YzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDgyMDAzOS4yMzc2LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4JIDxocmZxbjYrMm9rcEBlR3JvdXBzLmNvbT4JIDxpMm42NTE4YTkzNjEwMDUwMTEyNDN3NTVkYmIwNzZrZTg1YTY5NDYzNjQxZjNmM0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":43826,"nextInTopic":43828,"prevInTime":43826,"nextInTime":43828,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... That Only is not really fair. Too much is obviously a concept not foreign in our society, so it comes up in regular conversations. When I m baking too","messageBody":"<div id=\"ygrps-yiv-1461793761\">On Sat, May 1, 2010 at 12:43 PM, diana jenner &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hahamommy@...\">hahamommy@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I know what you all usually say about this, but the question is, isn&#39;t<br/>\n&gt; there ever &quot;too much?&quot; -=-<br/>\n&gt; Yes. And too much is in the experience of the beholder. Only.<br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>That &quot;Only&quot; is not really fair.<br/>\n&quot;Too much&quot; is obviously a concept not foreign in our society, so it comes up<br/>\nin regular conversations.<br/>\nWhen I&#39;m baking &quot;too much&quot; for Hayden it&#39;s not the same as baking &quot;too much&quot;<br/>\nfeels to me.<br/>\nSeeing &quot;too much&quot; blood splash the visor in COD4 is very different to me<br/>\nthan it is to Hayden.<br/>\nIt&#39;s easy to see the wide variance of the &quot;too much&quot; bar where we accept the<br/>\nvariance.<br/>\nIt&#39;s a matter of honoring the same variance when it comes to food, body<br/>\ndevelopment and caloric needs.<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272743037","msgId":43826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkybjY1MThhOTM2MTAwNTAxMTI0M3c1NWRiYjA3NmtlODVhNjk0NjM2NDFmM2YzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhyZnFuNisyb2twQGVHcm91cHMuY29tPg==","referencesHeader":"PDgyMDAzOS4yMzc2LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4JIDxocmZxbjYrMm9rcEBlR3JvdXBzLmNvbT4="},"prevInTopic":43825,"nextInTopic":43827,"prevInTime":43825,"nextInTime":43827,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"-=-I know what you all usually say about this, but the question is, isn t there ever too much? -=- Yes. And too much is in the experience of the beholder.","messageBody":"<div id=\"ygrps-yiv-738202554\">-=-I know what you all usually say about this, but the question is, isn&#39;t<br/>\nthere ever &quot;too much?&quot; -=-<br/>\nYes. And too much is in the experience of the beholder. Only.<br/>\n<br/>\n-=-Aren&#39;t there ever kids who this doesn&#39;t work for?-=-<br/>\nThere are lots of kids with parents for whom this doesn&#39;t work ;)<br/>\n<br/>\n-=- Isn&#39;t it ever too late (we had controls until last year, he was already<br/>\n8)? -=-<br/>\nCheck for a pulse on you both. I&#39;ll wait. Yes and Yes? Then No, it&#39;s not too<br/>\nlate.<br/>\n<br/>\n-=-Or is it really just my problem, not his at all? -=-<br/>\nYour problems are your problems until you make them his. Don&#39;t. Solve &#39;em<br/>\nand let &#39;em go is easiest.<br/>\n<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272741967","msgId":43825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHMybTY1MThhOTM2MTAwNTAxMTIyNnA4YjEwZDM0OGxjYzJhZDg1Yzg4MmY5ZDg0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDgyMDAzOS4yMzc2LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PGhyZmxzZSs1N3BiQGVHcm91cHMuY29tPgkgPDgyMDAzOS4yMzc2LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":43824,"nextInTopic":43826,"prevInTime":43824,"nextInTime":43826,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... I just made Croissant & Pain au Chocolat. The croissant cost a total of $4/dozen, butter the most expensive ingredient. The Chocolate cost $6, because I","messageBody":"<div id=\"ygrps-yiv-2128094551\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Rice pudding is incredibly easy to make. If budget is a true issue and not<br/>\n&gt; a kind of issue that has become convoluted with your concerns about his<br/>\n&gt; health, learn how to make rice pudding. I&#39;m sure you can find videos on how<br/>\n&gt; to make it. See if he&#39;d be willing to help you in getting the taste right.<br/>\n&gt; Rice pudding is pretty dang nutritious, too. Rice, eggs, milk, sugar, pretty<br/>\n&gt; good stuff.<br/>\n&gt;<br/>\n </span></blockquote>I just made Croissant & Pain au Chocolat. The croissant cost a total of<br/>\n$4/dozen, butter the most expensive ingredient. The Chocolate cost $6,<br/>\nbecause I got really good chocolate on sale ;) The most expensive part of<br/>\ncakes is the eggs. The most expensive part of cookies is the butter &<br/>\nchocolate (though cocoa is cheap). I bake. It&#39;s cheap and easy. And people<br/>\nare SO SO SO grateful -- you&#39;re a HERO! 2 Krazy Kake just cost me $.93<br/>\nbecause I had to get more cocoa, I had everything else on hand!<br/>\nAt a holiday party I heard a dad poo-pooing my amazing chocolate sheet cake,<br/>\nsteering his daughter towards the dry turkey.  I stepped in and asked her if<br/>\nshe knew what was in the cake. I went on to say &quot;all the same things as<br/>\nscrambled eggs and toast! with some chocolate added!&quot; Dad let her have some<br/>\n;) She put her turkey on it and ate them together ;)<br/>\n<br/>\nThere&#39;s an episode of Man vs Food, where he goes to a Ramen Restaurant! Yes,<br/>\nthey charge $$$ for Ramen noodles with amazing sauces & additions. Fun<br/>\nepisode, you should find it and watch it together ;) He&#39;d appreciate some<br/>\nRamen Love :)  I bought my son a special bowl, just for eating hot Ramen.<br/>\nAnd we keep a case on the fridge.  It&#39;s been weeks without a ramen request<br/>\nand the perfect-for-ramen bowl has become a perfect-for-anything bowl.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sounds like you are making mountains out of molehills to me. And increasing<br/>\n&gt; the marginal value of the food that he wants by limiting it. Pam Sorooshian<br/>\n&gt; has a very good and clear explanation of how limiting something can change<br/>\n&gt; it&#39;s value: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/t/economics.html.\">http://www.sandradodd.com/t/economics.html.</a> If you are making<br/>\n&gt; some food special occasion food or his money only food, well, that&#39;s<br/>\n&gt; completely moving it into the realm of &quot;special&quot; food. You&#39;ve absolutely<br/>\n&gt; increased the value of that food for him. Much better to make it easily<br/>\n&gt; available for as long as he wants it, and if you live right<br/>\n&gt; across the street from a corner store, it can always be pretty easily<br/>\n&gt; accessible. Given the choice between something that is nutritious and<br/>\n&gt; something that is fantastic and wonderful and a treat and good, well, which<br/>\n&gt; would you choose? Fortunately the two can combine most of the time.<br/>\n&gt;<br/>\n </span></blockquote>Hayden, now 11.5, was &quot;stuck&quot; at 4&#39;9&quot; for what seemed a very long time. And<br/>\nhe grew rounder and rounder.  I breathed and I breathed. And I served<br/>\njoyfully. I held onto the faith that his body knew what it was doing... In<br/>\nthe last two months, he&#39;s grown to just a smidge over his mama&#39;s 5&#39;1.5&quot; :)<br/>\nThe lack of food issues is far more important to me than a smaller waist<br/>\nsize.  Without food issues, the waist will/did/has/will again take care of<br/>\nitself. He&#39;s just beginning what will be a long process of major physical<br/>\ngrowth. Boys physically mature at a much slower rate than girls. I&#39;m the<br/>\nsame height since age 12; I had one up spurt between 11 & 12, that&#39;s it.<br/>\nHayden won&#39;t be done until his 20s, so how can any of his shape-shifting be<br/>\nanalyzed and judged? It can&#39;t. So I feed him. Some more. And I ask about a<br/>\nbelt once, then choose instead to help him out by keeping his hands free to<br/>\nhold his perpetually falling pants.  His rounded belly pushed his pants<br/>\ndown, literally. A belt didn&#39;t help. Old man jogging pants would have<br/>\nhelped, he wouldn&#39;t go there ::bg:: Keeping his hands free helped. And it<br/>\nwas a nice thing to do for him, without shaming him for the falling pants.<br/>\nNow he grew UP, so a belt works. There&#39;s a waistish again ;) And a boy who<br/>\ncan look right into my eyes. Take pictures more often, so you can actually<br/>\nsee the changes happening to him. That works for me! I can compare week to<br/>\nweek, it&#39;s amazing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And perceived block? Clearly there is a block, he wants something that you<br/>\n&gt; can get for him and you aren&#39;t getting it. That&#39;s a block. Even if it is<br/>\n&gt; within reason that you aren&#39;t getting it. I got irritated the other day<br/>\n&gt; &#39;cause I wanted tacos for dinner and I didn&#39;t get to the store to get the<br/>\n&gt; supplies. We had a perfectly good alternate meal, but I was really invested<br/>\n&gt; in the idea of tacos, so I was grouchy in the run up to dinner. I wanted<br/>\n&gt; what I wanted when I wanted it. The block was of my own devising.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>And my advice on blocking (especially a block you are aware of BEing): STOP<br/>\nIT! Just Stop. Get out of the way if you can&#39;t be on the team. Ideally, get<br/>\non the team. In a situation where an adult feels blocked by circumstance (be<br/>\nit lawyer, death of spouse, whatever), there is no favor done to the child<br/>\nwho is blocked by an adult in turn.  In the face of ugliness, a unified,<br/>\nHAPPY, loving team is imperative.   It&#39;s Team Childhood, the kid only gets<br/>\none and it&#39;s up to YOU first, as the present parent to provide him with a<br/>\nhappy one. Also I call it up to you to enjoin the other biological parent to<br/>\njump onboard, by showing him how wonderful and important it is to gift your<br/>\nchild with the opportunity to actually BE a child. And not get caught up in<br/>\nemotional & legal bull$hit. The two of you together looking at the child you<br/>\ncreated. You and your child, looking together at the world, working together<br/>\nto navigate it&#39;s complexities.<br/>\n(Read that above paragraph again, this time with a cheerleader voice...<br/>\nthat&#39;s what I was going for, inspiration!)<br/>\n<br/>\nParenting Peacefully is the recording I keep in my head when I need<br/>\nreminding ;) <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a> it&#39;s at the bottom of<br/>\nthe page :D<br/>\n<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272734133","msgId":43822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMjk3OTJFNDVCRTQ1NDNCODUzQzMzQzQ1RDNDMzBFQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGhyZnFuNisyb2twQGVHcm91cHMuY29tPg=="},"prevInTopic":43816,"nextInTopic":43824,"prevInTime":43821,"nextInTime":43823,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"***there ever kids who this doesn t work for? Isn t it ever too late (we had controls until last year, he was already 8)? Or is it really just my problem, not","messageBody":"<div id=\"ygrps-yiv-642771830\">***there ever kids who this doesn&#39;t work for? Isn&#39;t it ever too late (we had controls until last year, he was already 8)? Or is it really just my problem, not his at all? ***<br/>\n<br/>\nI think a few things have come together at once and you&#39;re seeing it as one huge problem instead of a couple normal things.  <br/>\n<br/>\nThe letter got you worried and now your worry is boiling over.   <br/>\n<br/>\nNine is the age my son gained weight.   Until then he&#39;d been this skinny, wispy kid but at nine it seemed he was always hungry.   He was active, went to Karate and Tae Kwon Do three times a week but he really needed a bunch of fuel.   His growth pattern then was to gain weight and look chunky and then at some point just shoot up and look slimmer.  Then he&#39;d gain again and look chunky and then all at once it seemed he be tall and slim again.   That was the pattern until he was thirteen when he just got taller (he&#39;s not tall, his dad and I are both shortish) and slimmer.   Now, at seventeen I seen him growing again.  He&#39;s not getting chunky he&#39;s growing, gaining size.  He&#39;s getting a little taller, he&#39;s bulking up some, looking  like a man now and not a boy. <br/>\n<br/>\nNine is a difficult age for some kids.  Little kid stuff is losing it&#39;s appeal but adult stuff is still not easily attainable and sometimes not interesting.  All that change requires fuel.  Some recent study suggested mental activity requires as much fuel as physical activity so even though it looks like he&#39;s not as active as his food choices would suggest, he must be needing that fuel.    <br/>\n<br/>\nDylan and I started walking together at night around the time he was nine.   It turned out to be much more than a way to wind down or use up calories.  It gave us time for private conversation, for silliness, for questioning and pondering.  We still walk together at night, though not every night like we used to.    There&#39;s something about the quiet and dark that really lets a person feel like they can talk.  I&#39;ve found it so valuable for staying connected with a kid whose day to day stuff does not always include his mom. &lt;g&gt;    <br/>\n<br/>\nI think people who are nine can feel discontented.since imaginary play isn&#39;t so much a part of their life as it used to be and adult things aren&#39;t very interesting yet.   They can find themselves without ideas about what to do, what seems fun.   Plus, he has a younger sibling who probably gets a lot of your time.   By your description I wouldn&#39;t think of him as bullying you, but as being needy.  He doesn&#39;t know what will fill this empty place.    It would be a good time for you to reconnect with him in whatever ways you can think he&#39;d enjoy.  Going out walking, just him and you, riding bikes, playing games, eating.     In my experience denying needy people never helps them stop feeling needy.   The only thing that helps is to fill the need.    You can do that by paying attention to his changing interests and feeding them, buy getting him out more places so that he can have more opportunity to find what&#39;s interesting.   I know when you have a younger kid it can seem like asking the older one to be the one who waits seems reasonable.  After all,  he&#39;s older, but it doesn&#39;t seem reasonable to him if he feels like he too often has to wait for you to take care of his sister first.   Not saying that&#39;s how things are going at your house, but just something you might look at, in case. <br/>\n<br/>\nSo, I think the letter scared you and now the really natural parts of being nine, growing and gaining weight, feeling discontent with kid things and not yet ready for adult things, and needing his mom to engage him more, look like one big issue to you and the easy culprit is food.    <br/>\n<br/>\nYou haven&#39;t been deschooling long.  Think of all the things your kids have learned.  Did learning to talk happen quickly, all at once, the first time they made a sound?   Did learning about going potty on the toilet happen all at once the first time they went?   Learning takes just as much time as the learner needs.   That&#39;s not always the same amount of time other people think it ought to take.   Learning about what our bodies need to feel good, what foods help us feel the best, that all takes time.  It&#39;s not helped by people making us feel guilty or ashamed of our choices or of ourselves for making those choices.  <br/>\n<br/>\nIf he&#39;s eating because he&#39;s bored or unhappy and doesn&#39;t know what else to do, that&#39;s not a food issue.  That&#39;s a mom issue.   Taking away his food choices or limiting his food won&#39;t solve the bigger problem.   If he&#39;s eating because he needs lots of calories, limiting his choices or his intake won&#39;t help him.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334729351,"authorName":"theburkemommy","from":"&quot;theburkemommy&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272687476","msgId":43824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZ2ExaytmajZvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyZmxzZSs1N3BiQGVHcm91cHMuY29tPg=="},"prevInTopic":43822,"nextInTopic":43825,"prevInTime":43823,"nextInTime":43825,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"That does make sense.","messageBody":"<div id=\"ygrps-yiv-1308576546\">That does make sense.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n&gt;  I guess I am somewhat guilty of exaggeration on that one. I don&#39;t buy endless supplies, they simply get eaten more quickly than I am comfortable with when they are here and he also has his own sources of money (allowance, selling things, occasional work, etc) and we live right across from a corner store and around the corner from all kinds of other shops - he has spent a lot of his own money on these things when we don&#39;t have them available. </span></blockquote></div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272679047","msgId":43816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZzFxNys0ZGN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJGQzU4MkQ1OThCMTQ4MDE4NzJFMjBDODM4MDFEMEFGQExZTEFMQVAyPg=="},"prevInTopic":43815,"nextInTopic":43822,"prevInTime":43815,"nextInTime":43817,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"No sorry required, in fact I appreciate the reminder, I had forgotten about that, and I do remember now. I would love to talk offlist and will message you as","messageBody":"<div id=\"ygrps-yiv-2050461358\">No sorry required, in fact I appreciate the reminder, I had forgotten about that, and I do remember now. <br/>\n<br/>\nI would love to talk offlist and will message you as soon as I can ( I am feeling sick and have some pressing reporting to do for our umbrella school)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; i just realized i responded to a similar post last fall, sharing how similar our kids sound!  sorry to have been repetative!<br/>\n&gt; <br/>\n&gt; lyla<br/>\n&gt;   MARKETPLACE<br/>\n&gt;   Stay on top of your group activity without leaving the page you&#39;re on - Get the Yahoo! Toolbar now.<br/>\n&gt; <br/>\n&gt;    <br/>\n&gt; <br/>\n&gt; ------------------------------------------------------------------------------<br/>\n&gt; <br/>\n&gt;   Get great advice about dogs and cats. Visit the Dog & Cat Answers Center.<br/>\n&gt; <br/>\n&gt;    <br/>\n&gt; <br/>\n&gt; ------------------------------------------------------------------------------<br/>\n&gt; <br/>\n&gt;   Hobbies & Activities Zone: Find others who share your passions! Explore new interests.<br/>\n&gt; <br/>\n&gt;     Switch to: Text-Only, Daily Digest . Unsubscribe . Terms of Use.<br/>\n&gt;    <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272675831","msgId":43815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQzU4MkQ1OThCMTQ4MDE4NzJFMjBDODM4MDFEMEFGQExZTEFMQVAyPg==","inReplyToHeader":"PDA3MEY1NUQ0OEMwQTQyRTZCREI1QTJGOTM1NkY3MUQwQExZTEFMQVAyPg==","referencesHeader":"PGhyZnFuNisyb2twQGVHcm91cHMuY29tPiA8MDcwRjU1RDQ4QzBBNDJFNkJEQjVBMkY5MzU2RjcxRDBATFlMQUxBUDI+"},"prevInTopic":43814,"nextInTopic":43816,"prevInTime":43814,"nextInTime":43816,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"i just realized i responded to a similar post last fall, sharing how similar our kids sound!  sorry to have been repetative! lyla MARKETPLACE Stay on top of","messageBody":"<div id=\"ygrps-yiv-886790642\">i just realized i responded to a similar post last fall, sharing how similar our kids sound!  sorry to have been repetative!<br/>\n<br/>\nlyla<br/>\n  MARKETPLACE<br/>\n  Stay on top of your group activity without leaving the page you&#39;re on - Get the Yahoo! Toolbar now.<br/>\n<br/>\n   <br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n  Get great advice about dogs and cats. Visit the Dog & Cat Answers Center.<br/>\n<br/>\n   <br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n  Hobbies & Activities Zone: Find others who share your passions! Explore new interests.<br/>\n<br/>\n    Switch to: Text-Only, Daily Digest . Unsubscribe . Terms of Use.<br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272674958","msgId":43814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3MEY1NUQ0OEMwQTQyRTZCREI1QTJGOTM1NkY3MUQwQExZTEFMQVAyPg==","inReplyToHeader":"PGhyZnFuNisyb2twQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyZnFuNisyb2twQGVHcm91cHMuY29tPg=="},"prevInTopic":43813,"nextInTopic":43815,"prevInTime":43813,"nextInTime":43815,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"i really understand how hard this is, especially when there s physical/visual evidence (weight gain, etc.) upon which others (and we ourselves) base","messageBody":"<div id=\"ygrps-yiv-531007292\">i really understand how hard this is, especially when there&#39;s physical/visual evidence (weight gain, etc.) upon which others (and we ourselves) base judgements.    i want to encourage you that a year (or less?)  is not enough time for him to have deschooled food, exercise, etc. - at least not in my experience.  my son is 11.5 now, we started unschooling a little over 2 years ago, he gained a bunch of weight as well (and decreased activity significantly) and was hyperfocused on sweets and chips, etc.  for a while, and even though that hypefocus/exclusivity phase was short lived, he didn&#39;t *really* get to a place of choosing food and food volume based on how he felt vs. emotional/reactive influences, until relatively recently, although it was a gradual process for sure.    he has not lost much weight, but looks much more fit now, due to his significantly increased activity level - he does jujitsu twice a week, pottery once week, and lots of running around, water gun fights, nerf dart games, and wrestling/roughhousing with his new friends - consequently he has more energy, and exerts more - it&#39;s cyclical. <br/>\n<br/>\nthat said, i can&#39;t help but wondering if your son might be battling depression/anxiety or some other emotional burdens?  (mine definitely did/does)   - is he lonely? bored?  having trouble connecting?<br/>\n<br/>\neverything you describe - his eating habits, his explosivity/&quot;mission mode&quot; about his needs/wants (like the knife), etc. sound very very familiar to me.  very familiar.    and given the push/pull messages from his dad, too, it seems like it might be  a real possibility?<br/>\n<br/>\nwhat i didn&#39;t gather from your post was whether he has joyful moments, days, experiences at all recently?  positive, meaningful interactions with you?  what about during the time when you felt you &quot;got it&quot;  - before the &quot;evil no mom&quot; came back?<br/>\n<br/>\nhave you read ren allen&#39;s atypical child article?<br/>\n<br/>\ni&#39;d be happy to talk with you more on or offlist too, if any of these questions seem relevant to you...<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272671782","msgId":43813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZnFuNisyb2twQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgyMDAzOS4yMzc2LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":43812,"nextInTopic":43814,"prevInTime":43812,"nextInTime":43814,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... I quite likely am, yet I seem to keep making them anyway, even with all the info I have, and that is alot. I read the economics bit, over and over in fact,","messageBody":"<div id=\"ygrps-yiv-1370709876\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Sounds like you are making mountains out of molehills to me. &lt;&lt;<br/>\n<br/>\n </span></blockquote>I quite likely am, yet I seem to keep making them anyway, even with all the info I have, and that is alot. I read the economics bit, over and over in fact, as well as the many, many threads about food and TV over the past year, here and elsewhere. I also read the book &quot;Preventing Childhood Eating Problems&quot; and watched the video about food limits and obesity, also over and over. I even recommend them and forward them to people. Its not that I don&#39;t understand or don&#39;t believe it, its just that I find it really, really hard to get my ideas of healthy and nutritious and too much to shut up when I see what seems like emotional or mindless eating of &quot;unhealthy&quot; foods combined with lack of energy, reluctance to exercise and weight gain. I am fine with the first cup, then the second, but by the time he gets to the 5th I am past my threshold and I start telling him he&#39;s had enough and save some for later, etc, or (this is embarrassing) actually trying to stop him physically once or twice, which didn&#39;t really work now that he is pretty much my size. But he clearly hasn&#39;t had &quot;enough&quot; for him and a power struggle ensues. Luckily, sometimes (probably more often than it sounds here, it just feels bad right now) I am in a better place and bite my tongue or sweetly offer him some other food and try to accept the &quot;no thanks&quot; if it comes. <br/>\n<br/>\nI know what you all usually say about this, but the question is, isn&#39;t there ever &quot;too much?&quot; Aren&#39;t there ever kids who this doesn&#39;t work for? Isn&#39;t it ever too late (we had controls until last year, he was already 8)?  Or is it really just my problem, not his at all?</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272668878","msgId":43812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMDAzOS4yMzc2LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGhyZmxzZSs1N3BiQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyZmxzZSs1N3BiQGVHcm91cHMuY29tPg=="},"prevInTopic":43811,"nextInTopic":43813,"prevInTime":43811,"nextInTime":43813,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"Rice pudding is incredibly easy to make. If budget is a true issue and not a kind of issue that has become convoluted with your concerns about his health,","messageBody":"<div id=\"ygrps-yiv-462240113\">Rice pudding is incredibly easy to make. If budget is a true issue and not a kind of issue that has become convoluted with your concerns about his health, learn how to make rice pudding. I&#39;m sure you can find videos on how to make it. See if he&#39;d be willing to help you in getting the taste right. Rice pudding is pretty dang nutritious, too. Rice, eggs, milk, sugar, pretty good stuff. Sounds like you are making mountains out of molehills to me. And increasing the marginal value of the food that he wants by limiting it. Pam Sorooshian has a very good and clear explanation of how limiting something can change it&#39;s value: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/t/economics.html.\">http://www.sandradodd.com/t/economics.html.</a> If you are making some food special occasion food or his money only food, well, that&#39;s completely moving it into the realm of &quot;special&quot; food. You&#39;ve absolutely increased the value of that food for him. Much better to make it easily available for as long as he wants it, and if you live right<br/>\n across the street from a corner store, it can always be pretty easily accessible. Given the choice between something that is nutritious and something that is fantastic and wonderful and a treat and good, well, which would you choose? Fortunately the two can combine most of the time. <br/>\n<br/>\nAnd perceived block? Clearly there is a block, he wants something that you can get for him and you aren&#39;t getting it. That&#39;s a block. Even if it is within reason that you aren&#39;t getting it. I got irritated the other day &#39;cause I wanted tacos for dinner and I didn&#39;t get to the store to get the supplies. We had a perfectly good alternate meal, but I was really invested in the idea of tacos, so I was grouchy in the run up to dinner. I wanted what I wanted when I wanted it. The block was of my own devising. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: meadowgirl11 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tamithameadow@...\">tamithameadow@...</a>&gt;<br/>\n<br/>\n<br/>\nGood question, but I guess I am somewhat guilty of exaggeration on that one. I don&#39;t buy endless supplies, they simply get eaten more quickly than I am comfortable with when they are here and he also has his own sources of money (allowance, selling things, occasional work, etc) and we live right across from a corner store and around the corner from all kinds of other shops - he has spent a lot of his own money on these things when we don&#39;t have them available. I try to keep a balance of saying yes when he wants things and other things like budget and health. But like I said, BIG reactions when there is a perceived block and he is very persistent about finding a way to get what he wants (an admirable quality though hard to appreciate when I am the thing in the way). <br/>\n<br/>\nThat doesn&#39;t seem to be clear - I can give an example. If I buy a box of rice pudding which he loves, it has 12 cups in it - he will eat the whole box in two or three days rather than have one or two a day. He will eat three of four cups in one sitting. It is like that with most things. I know it is also that he is growing so much, he has grown almost 2 inches since january, so realistically, he is probably actually hungry, but he often refuses meals and other more nutritious foods to eat big quantities of the thing he is excited about. Does that make sense?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272666830","msgId":43811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZmxzZSs1N3BiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyZHB1cis0NTE0QGVHcm91cHMuY29tPg=="},"prevInTopic":43810,"nextInTopic":43812,"prevInTime":43810,"nextInTime":43812,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... Good question, but I guess I am somewhat guilty of exaggeration on that one. I don t buy endless supplies, they simply get eaten more quickly than I am","messageBody":"<div id=\"ygrps-yiv-284820698\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;theburkemommy&quot; &lt;theburkemommy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I can relate to your struggles with being the mom you want to be with an ex that has different beliefs.  <br/>\n&gt; <br/>\n&gt; My biggest question is why are you providing your son with so much candy, chips, soda, etc?  Food restrictions can be removed without providing the kids with an endless supply of ice cream, candy, chips, and soda.  <br/>\n&gt; <br/>\n&gt; I buy those things in modest amounts on a regular basis...nobody feels deprived, but I don&#39;t have a never-ending supply of those things.<br/>\n<br/>\n </span></blockquote>Good question, but I guess I am somewhat guilty of exaggeration on that one. I don&#39;t buy endless supplies, they simply get eaten more quickly than I am comfortable with when they are here and he also has his own sources of money (allowance, selling things, occasional work, etc) and we live right across from a corner store and around the corner from all kinds of other shops - he has spent a lot of his own money on these things when we don&#39;t have them available. I try to keep a balance of saying yes when he wants things and other things like budget and health. But like I said, BIG reactions when there is a perceived block and he is very persistent about finding a way to get what he wants (an admirable quality though hard to appreciate when I am the thing in the way). <br/>\n<br/>\nThat doesn&#39;t seem to be clear - I can give an example. If I buy a box of rice pudding which he loves, it has 12 cups in it - he will eat the whole box in two or three days rather than have one or two a day. He will eat three of four cups in one sitting. It is like that with most things. I know it is also that he is growing so much, he has grown almost 2 inches since january, so realistically, he is probably actually hungry, but he often refuses meals and other more nutritious foods to eat big quantities of the thing he is excited about. Does that make sense?</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272663553","msgId":43810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZmltMSt0aXV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyZHB1cis0NTE0QGVHcm91cHMuY29tPg=="},"prevInTopic":43809,"nextInTopic":43811,"prevInTime":43809,"nextInTime":43811,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... ************** Sometimes that kind of solution can backfire - what seems like a modest amount to parents can seem like limits to kids. That s an issue","messageBody":"<div id=\"ygrps-yiv-1249860182\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;theburkemommy&quot; &lt;theburkemommy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I buy those things in modest amounts on a regular basis...nobody feels deprived, but I don&#39;t have a never-ending supply of those things.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSometimes that kind of &quot;solution&quot; can backfire - what seems like &quot;a modest amount&quot; to parents can seem like limits to kids. That&#39;s an issue of individual temperaments and perception, not &quot;good&quot; or &quot;bad&quot; parenting. The situation doesn&#39;t sound like one that requires more limits, even more perceived limits.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272646296","msgId":43808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZjFxbyt1bjVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExMDM2NS42MTI5OC5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":43807,"nextInTopic":43809,"prevInTime":43807,"nextInTime":43809,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... Yes, that makes sense, I want to enjoy being with him again. We were having such a nice time together for a while and that is what I am missing. And it is","messageBody":"<div id=\"ygrps-yiv-341961022\">Shuyler wrote: <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It sounds like the lawyer&#39;s letter made you question the value of what you are doing and of what your son is doing. So you&#39;ve got to refind that value. You&#39;ve got to sit with him while he&#39;s watching whatever it is he&#39;s watching, with your toddler girl nursing on your lap, and hang out with your son doing what he wants to do. The more you can find to enjoy with him the more you will enjoy being with him. &lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes, that makes sense, I want to enjoy being with him again. We were having such a nice time together for a while and that is what I am missing. And it is clear he is missing it too, he has asked directly for me to do things with him, but it is usually playing video games which I have a really hard time with. I don&#39;t mind him playing them and I will talk to him about them, but my brain hurts when I try to play, except for simple puzzle games, which I get so sucked into that he gets annoyed with me!<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;About the knife, there are times when you can&#39;t do what is wanted of you. Could you, though, have looked for ways to set up the excitement, keep the momentum going. &quot;Cool, a pocket knife, oh, what will you use it for?&quot; If for carving, you could have looked for sticks on the way home to gather and bring back for carving and talk about where he&#39;d want to carve and when you get home set up the stuff for it and make sure it&#39;s all ready and first thing the next day go get that dang pocket knife. Or if you have one, yours or your husband&#39;s or just a regular knife, start with that. &lt;&lt;<br/>\n<br/>\n </span></blockquote>I tried lots of that, but he just wasn&#39;t buying any of it. He tends to have really BIG responses to things and when he gets worked up like that, there is little that helps him get calmed down. I think you are right about him needing to feel a general sense that my &quot;yes, later&#39;s&quot; aren&#39;t no&#39;s in disguise, which they usually aren&#39;t, but probably have seemed that way lately. And in combination with me being more pushy and not respecting his no&#39;s has probably lowered his tolerance even more. <br/>\n<br/>\nThanks for the insights.</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272645565","msgId":43807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZjEzdCtydHFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExMDM2NS42MTI5OC5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":43806,"nextInTopic":43808,"prevInTime":43806,"nextInTime":43808,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"... I so know this is true - his father is giant, 6 7 , he is going to be a big man, and when he says negative things about his weight, that is what I tell","messageBody":"<div id=\"ygrps-yiv-1334711162\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; At the last Life is Good conference a friend asked David about the weight gain she saw her son doing. He was 13 at the time. David said look at the other boys his age, look at all the boys at the conference, look at Simon at 12, it is absolutely normal to put on weight in this prepubescent time. It will change. He will grow and stretch out again. It&#39;s a long way from 9 to being done growing up. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I so know this is true - his father is giant, 6&#39;7&quot;, he is going to be a big man, and when he says negative things about his weight, that is what I tell him, that he is going to grow and change so much over the next few years, he won&#39;t look anything at all like he does now. But then I see him not fitting clothes and being uncomfortable and not being able to do things with his body that he wants to do and I feel bad. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, rather than worrying about his weight offer him options that are within the range that he likes... Don&#39;t make him feel weird about food. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I KNOW!!! Why is it that I can know that and then still do it anyway? That seems to be the problem, there is some cognitive dissonance, to use the psych terminology, between what I am seeing and what I want to believe. And it seems easier for my brain to believe my eyes and what is right in front of me than to accept the years of wisdom and research and knowledge from everyone here. Even though I have seen skinny kids turn into fat adults and chubby kids turn into lanky teens. <br/>\n<br/>\nI have lots and lots of moments where I sit in trust, but it seems like those times when I am &quot;off&quot;, I just can&#39;t manage to keep my mouth shut and just ride it through lately, so I end up saying and doing things I regret.</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Return of the evil &quot;NO&quot; mom (long)","postDate":"1272622959","msgId":43806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMDM2NS42MTI5OC5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhyZDhsaitmZHNzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyZDhsaitmZHNzQGVHcm91cHMuY29tPg=="},"prevInTopic":43805,"nextInTopic":43807,"prevInTime":43805,"nextInTime":43807,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"So you ve gone back to the beginning. Restart. Begin with deschooling again. Look for ways to say yes. Don t pressure him to do what he doesn t want to do.","messageBody":"<div id=\"ygrps-yiv-1857217297\">So you&#39;ve gone back to the beginning. Restart. Begin with deschooling again. Look for ways to say yes. Don&#39;t pressure him to do what he doesn&#39;t want to do. Give him the space to do what he wants and the company to do it in. Keep notes on all that he does do. <br/>\n<br/>\nSimon and Linnaea got pedometers with the newest Pokemon game for the DS (or the remake of the one that first got Simon into pokemon games, really) and I looked up stuff on pedometers and walking on-line and found lots of recommendations to put on the pedometer and just go through a normal week or two to see how much you walk on average before trying to create your exercise program. The idea being that you need to know your baseline before upping it. I&#39;m not suggesting trying to up your son&#39;s baseline, but knowing what it is, knowing what he is gaining in a normal day may comfort you to no end. It will also help to see what his interests are and what things you might be able to offer that will be of interest to him. <br/>\n<br/>\nAt the last Life is Good conference a friend asked David about the weight gain she saw her son doing. He was 13 at the time. David said look at the other boys his age, look at all the boys at the conference, look at Simon at 12, it is absolutely normal to put on weight in this prepubescent time. It will change. He will grow and stretch out again. It&#39;s a long way from 9 to being done growing up. <br/>\n<br/>\nSo, rather than worrying about his weight offer him options that are within the range that he likes, homemade chips are really good, bagel chips are pretty easy to make, or croutons, yumm, croutons. Or try some of the yam chips and beetroot chips and do taste tests. Taste tests are fun, go to the store and buy a bunch of kinds of chips and see which ones you like best. Make up some yummy dips and do it all over again. Have fun with the foods he&#39;s comfortable with. And if he doesn&#39;t want to play, do it yourself, or don&#39;t do it at all, do something else. Don&#39;t make him feel weird about food. <br/>\n<br/>\nRamen is so good. David makes fantastic vegetable stocks, and my chicken stock is pretty good too, and noodles are so comfortable and tasty and good. And you can add so much to ramen. Do a google search for ramen images and look at the variety. Boiled egg is so nice in ramen, and a sprinkling of chives and mushrooms and corn and chicken. You could lay out a bunch of options, because with ramen the additives go on at the end, and he could add in what he wanted. Sliced pork is really nice in ramen. There is fantastic movie about a noodle restaurant in Japan, Tampopo. It&#39;s very tongue in cheek, noodle shops are almost the equivalent of a McDonald&#39;s, and the goal is to make the perfect ramen, and it is done almost like a martial arts movie where a young man is working to become the best warrior ever with his mentor leading him on. It is a wonderful exploration of all these different aspects of Japanese relationships with food. <br/>\n<br/>\nIt sounds like the lawyer&#39;s letter made you question the value of what you are doing and of what your son is doing. So you&#39;ve got to refind that value. You&#39;ve got to sit with him while he&#39;s watching whatever it is he&#39;s watching, with your toddler girl nursing on your lap, and hang out with your son doing what he wants to do. The more you can find to enjoy with him the more you will enjoy being with him. And the less he will feel he needs to defend his rights to getting something. Often a huge angry moment of &quot;give it to me now!&quot; is about feeling so needy about all the things that you don&#39;t get. He doesn&#39;t trust your &quot;wait &#39;til tomorrow&quot;. He doesn&#39;t want to be put off to be forgotten. Make sure that your &quot;not now&quot; is a card you pull out as rarely as you possibly can. I&#39;m terrible at forgetting an &quot;in a minute&quot; and have to be reminded quite frequently. It is so much more efficient if I get up and do what I am being asked to do when I&#39;m asked to do it.<br/>\n Fortunately Simon and Linnaea are pretty patient and are willing to remind me gently, and I&#39;m fairly willing to get up most times and do what is being asked of me. <br/>\n<br/>\nAbout the knife, there are times when you can&#39;t do what is wanted of you. Could you, though, have looked for ways to set up the excitement, keep the momentum going. &quot;Cool, a pocket knife, oh, what will you use it for?&quot; If for carving, you could have looked for sticks on the way home to gather and bring back for carving and talk about where he&#39;d want to carve and when you get home set up the stuff for it and make sure it&#39;s all ready and first thing the next day go get that dang pocket knife. Or if you have one, yours or your husband&#39;s or just a regular knife, start with that. Simon found a knife in a greenhouse and the bottom of the garden in the last house we lived in and he used that for carving so many things. It gets lost regularly, and whenever it is discovered in whichever drawer it&#39;s been jumbled around in he greets it with such joy. You could have gotten home and looked on-line at different sorts of pocket knives and talked about what kinds of<br/>\n tools he wanted in the pocket knife he was going to get. David just got a mini-leatherman that he loves. It&#39;s got pliers and a knife and a couple of screwdrivers and scissors. He could have gotten a saw, but the scissors seemed a better option, and the scissors are good, better than the scissors on my knife. But maybe a saw would be better if he wanted to cut down saplings and things. Linnaea&#39;s pocket knife has a lock blade, so it won&#39;t close on her hand. Those, though, are illegal to carry as pocket knives in the UK, a lock blade apparently being the equivalent of a fixed blade knife which one must prove greater need than a simple pocket knife if carried casually. <br/>\n<br/>\nIt is all about figuring out how to help him get what he wants out of life. That may look like enabling him to be lazy or spoiled, but it isn&#39;t. Simon and Linnaea aren&#39;t lazy and they aren&#39;t spoiled. They are so interested in what they are interested in, they are so engaged with the things that engage them, and it is really cool to get to share that with them.<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\nI know there is something I am missing, some way I can help turn this pattern around, but right now I feel totally stuck and like giving up the whole thing as a loss. But the alternative is not any more appealing since it just gives the illusion of control, not the real thing. So my question is (after all this) is how do I get back on track? How do I get back to a place of trust and connection from here? I so appreciate reading about other people&#39;s issues, but I think I need some direct feedback here. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike haupt","from":"&quot;Ulrike haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Return of the evil &quot;NO&quot; mom (long)","postDate":"1272608848","msgId":43805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGhyZDhsaitmZHNzQGVHcm91cHMuY29tPg=="},"prevInTopic":43804,"nextInTopic":43806,"prevInTime":43804,"nextInTime":43806,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"Oh Tammy What a not nice place to be in for so long already. And it all started with the letter from the ex saying that he, who has no hands on experience or ","messageBody":"<div id=\"ygrps-yiv-53505609\">Oh Tammy<br/>\n <br/>\nWhat a not nice place to be in for so long already. And it all started with<br/>\nthe letter from the ex saying that he, who has no hands on experience or<br/>\ninsight in your household does not think you are capable. Since then you<br/>\nseem to be in defense mode. And your son is acting it out for you, too.<br/>\nI don&#39;t exactly know how you can resolve this issue though I can think of a<br/>\nfew ways though I am sure that it is mainly an inner journey for you. If a<br/>\nletter can trigger such an avalanche of pain then it indicates to me that<br/>\nsome much needed healing wants to be done. But that is not to be handled on<br/>\nan open forum like this.<br/>\n<br/>\nMaybe you can find an EFT practitioner near you or who does online/telephone<br/>\ncounselling. <br/>\n<br/>\nThough the other wise people on this forum may know of other good ways to<br/>\nget this cleared in your life.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\nFrom Namibia - somewhere in Africa<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature<br/>\ndatabase 5073 (20100429) __________<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a></div>","specialLinks":[]},{"userId":334729351,"authorName":"theburkemommy","from":"&quot;theburkemommy&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Return of the evil &quot;NO&quot; mom (long)","postDate":"1272605466","msgId":43809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZHB1cis0NTE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyZDhsaitmZHNzQGVHcm91cHMuY29tPg=="},"prevInTopic":43808,"nextInTopic":43810,"prevInTime":43808,"nextInTime":43810,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"I can relate to your struggles with being the mom you want to be with an ex that has different beliefs. My biggest question is why are you providing your son","messageBody":"<div id=\"ygrps-yiv-1628723696\">I can relate to your struggles with being the mom you want to be with an ex that has different beliefs.  <br/>\n<br/>\nMy biggest question is why are you providing your son with so much candy, chips, soda, etc?  Food restrictions can be removed without providing the kids with an endless supply of ice cream, candy, chips, and soda.  <br/>\n<br/>\nI buy those things in modest amounts on a regular basis...nobody feels deprived, but I don&#39;t have a never-ending supply of those things.<br/>\n<br/>\n<br/>\nmeadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wow, this is a really hard post for me to write - I had thought things were going prett<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>y well, to the point where around Christmas I actually started responding to people&#39;s posts and feeling pretty self satisfied with where I had gotten in my unschooling journey over the last year. Then things basically fell apart when my son&#39;s father (my very distant ex) sent me a letter through an lawyer saying that he thought ds (he&#39;s almost 10)  was not &quot;living up to his potential&quot; and that he wanted to get a psych-ed assessment to prove he should be sent back to school. Ever since then I feel like all the deschooling I did just got sent right back to square one and I haven&#39;t been able to get back on track. Even though nothing has happened since I responded to his lawyer (a whole other story), I still find myself trying to push ds to &quot;do&quot; things - make sure he attends his group classes (he signed up for gymnastics by choice, and was taking swim lessons), stop watching so much TV, etc. I don&#39;t even know how to explain it, I just feel like I have turned back into the mean, bossy, controlling mom I was before I found unschooling, with a few moments of getting it right, instead of the opposite which is where I was before. As a result, our relationship seems to be worse all the time. I feel disconnected and we are fighting more often than not, which is not pretty since he has very big reactions.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; But here is the place I am stuck - the things I am pushing about or saying no to seem so important in the moment. He has gained a lot of weight over the past year, to the point of being near obese, and then he wants to eat a lot of food with low nutritional value (I try to avoid the junk label, but you know, chips, ramen noodles, soda, candy) and he wants to do it while sitting in front of the TV or computer totally tuned in to that world. And when I say a lot, I mean a lot, like whole large bags of candy or chips or 2 litres of pop or two or three bowls of ice cream at a time. It hasn&#39;t slowed down at all in the year that he has had access to that kind of thing. I thought it was for a bit, but it just comes in waves. I try to let him have the foods he is choosing, and also provide him with lots of nutritious options, but I sometimes feel like I need to convince him to eat &quot;better&quot;, at the very least not in front of the screen and something with some nutritional value.<br/>\n&gt; <br/>\n&gt; A related issue is that he doesn&#39;t want to get out of the house for any physical activity very often, which is hard because I have a toddler who needs to get out. I run out of things to do with her inside, which means she is on me nursing or watching TV often and I feel like I am not doing either of them any good. When we are out she is less on me so it is easier to be tuned into him. He says he hates to walk or bike, he always wants to drive anywhere we go, but I feel really guilty when I drive the car when I could walk (we live in a very central location to everything, it is usually only a 10 or 15 minute walk). He will have a huge meltdown if I try to insist on walking or if we don&#39;t have the car (my husband and I share the car) if we have to go somewhere and either I give in and drive or stay home or I push and deal with the ensuing meltdown.<br/>\n&gt; <br/>\n&gt;  Another problem is that when he decides he wants to have or do something (a toy or a meal at the drive inn for example), he has to have what he wants, RIGHT NOW, no matter if I can&#39;t afford it or if his sister is freaking out in the carseat because she is ready for a nap or any other reason if it goes against his desire. <br/>\n&gt; <br/>\n&gt; An example: yesterday he decided he needed to buy a pocket knife, which I agreed to, but the problem was, we had already been out and about for a few hours, we were on our way home and his sister and I were both done for the day. I tried to make an agreement with him to go the next day or even try to go later that day, but he kept going on and on, calling me names, trying to force me to take him. I was trying to be understanding, but it got to a point where I just wanted to yell at him. I started off by saying something to the effect of &quot;yes, of course we can get a knife, hopefully we can do it tomorrow&quot;, but it turned into me saying something along the lines of &quot;I said no and I mean no, it isn&#39;t going to happen right now, NO!&quot; with about 20 minutes of build up in between. I felt bad but I also felt like I was being bullied by my 9 year old, which has seemed to be happening more and more lately, leading to me saying no more and more. <br/>\n&gt; <br/>\n&gt; I know there is something I am missing, some way I can help turn this pattern around, but right now I feel totally stuck and like giving up the whole thing as a loss. But the alternative is not any more appealing since it just gives the illusion of control, not the real thing. So my question is (after all this) is how do I get back on track? How do I get back to a place of trust and connection from here? I so appreciate reading about other people&#39;s issues, but I think I need some direct feedback here. <br/>\n&gt; <br/>\n&gt; Thanks so much for reading, I know its long!<br/>\n&gt; Tammy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Return of the evil &quot;NO&quot; mom (long)","postDate":"1272587763","msgId":43804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyZDhsaitmZHNzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43805,"prevInTime":43803,"nextInTime":43805,"topicId":43804,"numMessagesInTopic":0,"msgSnippet":"Wow, this is a really hard post for me to write - I had thought things were going pretty well, to the point where around Christmas I actually started","messageBody":"<div id=\"ygrps-yiv-403021861\">Wow, this is a really hard post for me to write - I had thought things were going pretty well, to the point where around Christmas I actually started responding to people&#39;s posts and feeling pretty self satisfied with where I had gotten in my unschooling journey over the last year. Then things basically fell apart when my son&#39;s father (my very distant ex) sent me a letter through an lawyer saying that he thought ds (he&#39;s almost 10)  was not &quot;living up to his potential&quot; and that he wanted to get a psych-ed assessment to prove he should be sent back to school. Ever since then I feel like all the deschooling I did just got sent right back to square one and I haven&#39;t been able to get back on track. Even though nothing has happened since I responded to his lawyer (a whole other story), I still find myself trying to push ds to &quot;do&quot; things - make sure he attends his group classes (he signed up for gymnastics by choice, and was taking swim lessons), stop watching so much TV, etc. I don&#39;t even know how to explain it, I just feel like I have turned back into the mean, bossy, controlling mom I was before I found unschooling, with a few moments of getting it right, instead of the opposite which is where I was before. As a result, our relationship seems to be worse all the time. I feel disconnected and we are fighting more often than not, which is not pretty since he has very big reactions.<br/>\n<br/>\nBut here is the place I am stuck - the things I am pushing about or saying no to seem so important in the moment. He has gained a lot of weight over the past year, to the point of being near obese, and then he wants to eat a lot of food with low nutritional value (I try to avoid the junk label, but you know, chips, ramen noodles, soda, candy) and he wants to do it while sitting in front of the TV or computer totally tuned in to that world. And when I say a lot, I mean a lot, like whole large bags of candy or chips or 2 litres of pop or two or three bowls of ice cream at a time. It hasn&#39;t slowed down at all in the year that he has had access to that kind of thing. I thought it was for a bit, but it just comes in waves. I try to let him have the foods he is choosing, and also provide him with lots of nutritious options, but I sometimes feel like I need to convince him to eat &quot;better&quot;, at the very least not in front of the screen and something with some nutritional value.<br/>\n<br/>\nA related issue is that he doesn&#39;t want to get out of the house for any physical activity very often, which is hard because I have a toddler who needs to get out. I run out of things to do with her inside, which means she is on me nursing or watching TV often and I feel like I am not doing either of them any good. When we are out she is less on me so it is easier to be tuned into him. He says he hates to walk or bike, he always wants to drive anywhere we go, but I feel really guilty when I drive the car when I could walk (we live in a very central location to everything, it is usually only a 10 or 15 minute walk). He will have a huge meltdown if I try to insist on walking or if we don&#39;t have the car (my husband and I share the car) if we have to go somewhere and either I give in and drive or stay home or I push and deal with the ensuing meltdown.<br/>\n<br/>\n Another problem is that when he decides he wants to have or do something (a toy or a meal at the drive inn for example), he has to have what he wants, RIGHT NOW, no matter if I can&#39;t afford it or if his sister is freaking out in the carseat because she is ready for a nap or any other reason if it goes against his desire. <br/>\n<br/>\nAn example: yesterday he decided he needed to buy a pocket knife, which I agreed to, but the problem was, we had already been out and about for a few hours, we were on our way home and his sister and I were both done for the day. I tried to make an agreement with him to go the next day or even try to go later that day, but he kept going on and on, calling me names, trying to force me to take him. I was trying to be understanding, but it got to a point where I just wanted to yell at him. I started off by saying something to the effect of &quot;yes, of course we can get a knife, hopefully we can do it tomorrow&quot;, but it turned into me saying something along the lines of &quot;I said no and I mean no, it isn&#39;t going to happen right now, NO!&quot; with about 20 minutes of build up in between. I felt bad but I also felt like I was being bullied by my 9 year old, which has seemed to be happening more and more lately, leading to me saying no more and more. <br/>\n<br/>\nI know there is something I am missing, some way I can help turn this pattern around, but right now I feel totally stuck and like giving up the whole thing as a loss. But the alternative is not any more appealing since it just gives the illusion of control, not the real thing. So my question is (after all this) is how do I get back on track? How do I get back to a place of trust and connection from here? I so appreciate reading about other people&#39;s issues, but I think I need some direct feedback here. <br/>\n<br/>\nThanks so much for reading, I know its long!<br/>\nTammy</div>","specialLinks":[]}],"prevTopicId":43836,"nextTopicId":43817}}