{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":315240425,"authorName":"Shannon Bonafede","from":"&quot;Shannon Bonafede&quot; &lt;dragteine76@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Help with brothers...","postDate":"1210030209","msgId":32407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzYWIwMWM4YWYwNyRmNzg5MjAxMCQyZjAxYThjMEBsZWFybmluZz4=","inReplyToHeader":"PGZ2a2pqZCtmOGtpQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ2a2pqZCtmOGtpQGVHcm91cHMuY29tPg=="},"prevInTopic":32405,"nextInTopic":32409,"prevInTime":32406,"nextInTime":32408,"topicId":32381,"numMessagesInTopic":0,"msgSnippet":"I have a seven year old boy, a three year old girl and a three month old boy. My son has off limit toys and we clearly define who s toys is who s - that it","messageBody":"<div id=\"ygrps-yiv-1839205583\">I have a seven year old boy, a three year old girl and a three month old<br/>\nboy. My son has &quot;off limit toys&quot; and we clearly define who&#39;s toys is who&#39;s -<br/>\nthat it is great to share and acceptable to be selfish. I know this is not<br/>\nyour issue but to understand our method - you must understand our<br/>\nphilosophy. This also applies to ones time. As a mother when I am home I am<br/>\nalmost always available to share time with any or all children. It is not<br/>\nalways on their terms though. Such as...<br/>\n <br/>\nWhen I am cooking lunch in the kitchen. I am available in the kitchen where<br/>\nI will read, talk or anything else I can multi-task doing. If I am<br/>\nbreastfeeding the baby I am available to do sit down things such as cuddle,<br/>\ntalk or read stories (as long as they don&#39;t squish the baby).<br/>\n <br/>\nThere are times I am unaccessable like bathtime which usually happens after<br/>\nthe children go to bed or designated phone call times (appointments I make<br/>\nto call doctors, etc). When I am doing one on one time with one of the other<br/>\nchildren I won&#39;t even pick up the phone. It does result in upsets<br/>\nsometimes... my oldest is beginning to understand because he likes having<br/>\nalone time now too. He has to let me know, just like I tell them and/or my<br/>\nhubby that I am in need of some alone time and that I am going to go take<br/>\nit.<br/>\n <br/>\nMy three year old does not always understand and diverting her away from her<br/>\nbrother takes not only effort but consistancy. Older child is wants to be<br/>\nalone right now, is there something the younger child would like to go with<br/>\nyou. I did not do a lot of schooling or direction with my seven year old but<br/>\nmy daughter likes to do color worksheets and a couple educational sites<br/>\nstarfall.com and sillybooks.net both are free and directed towards young<br/>\nchildren - 2 - 10. She also has activities she perfers to do on her own.<br/>\n <br/>\nI am not saying there are no disagreements or that everything is quiet and<br/>\npeaceful all the time. It does help and they do find times that they enjoy<br/>\nbeing together. Today they just went outside together and had a lot of fun<br/>\noutside with no prompting from me.<br/>\n <br/>\nGood luck,<br/>\nShannon<br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of swissarmy_wife<br/>\nSent: Sunday, May 04, 2008 11:10 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Help with brothers...<br/>\n<br/>\n<br/>\n<br/>\nMy 9 year old has bunkbeds. He uses the top bunk as a &quot;sanctuary&quot;<br/>\naway from the 3 year old. Mostly for breakable things like Lego&#39;s and<br/>\nhis drawings that he does not want ruined. Recently the 3 year old<br/>\nhas figured out how to climb up WITHOUT the ladder. A few times he<br/>\nwas welcomed up there. But many times he is NOT. Usually an argument<br/>\nand tears begin and that&#39;s my cue. I&#39;m desperately trying to get the<br/>\nolder one to call for me FIRST. Which in fact he has become much<br/>\nbetter at. There used to be a lock on the door, but the little one<br/>\nhas resorted to charging the door over and over and over again until<br/>\nhe can get in. He&#39;s persistant. :-)<br/>\n<br/>\nWe&#39;ve been having some issues with the 9 year old lately. I really<br/>\nfeel, that being about 8 months pregnant has strained our<br/>\nrelationship, and I&#39;m really trying to reconnect with him, and honor<br/>\nhis wishes, and overall treat him with the same respect that we had<br/>\nbefore I got pregnant because I haven&#39;t been. So, I feel that he has<br/>\nevery right, to say that his little brother cannot play on his top<br/>\nbunk if he does not want him to. The problem is that there is no<br/>\nredirecting this child. Once he is dead set on getting on that top<br/>\nbunk, he wants nothing else in the world. Not trains, power rangers,<br/>\ncandy, hugs, singing, dancing, or anything else will make him happy. <br/>\nIt&#39;s gotten to the point where I&#39;ve resorted to prying him off the<br/>\nbed, and carrying him down the stairs and doing everything possible to<br/>\nprevent him from bothering his brother. But he isn&#39;t looking for a<br/>\nconnection with me. He&#39;s looking to connect with his brother. <br/>\n<br/>\nSo, I am meeting the needs of the older boy. But I&#39;m not helping to<br/>\nmeet any needs of the 3 year old. And I&#39;m feeling TERRIBLY guilty<br/>\nover the way the younger one is being treated. Hormones are<br/>\npreventing me from thinking so quickly, and after its all over, I<br/>\nusually end up in tears over my shotty parenting. (hormonal pregnant<br/>\ntears :-)<br/>\n<br/>\nAny ideas? This is getting REALLY tough.<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12742563,"authorName":"Heather","from":"&quot;Heather&quot; &lt;bnforgiven@...&gt;","profile":"bnforgiven","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with brothers...","postDate":"1210012473","msgId":32409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2bmp2cCtuZ2JkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ2a3JzNCtzbGswQGVHcm91cHMuY29tPg=="},"prevInTopic":32407,"nextInTopic":0,"prevInTime":32408,"nextInTime":32410,"topicId":32381,"numMessagesInTopic":0,"msgSnippet":"Boy can I relate, and unfortunately only commiserate too! My son is 4 Friday and his step-bro will be 10 Friday. And they have bunk beds too! The oldest has","messageBody":"<div id=\"ygrps-yiv-1339820616\">Boy can I relate, and unfortunately only commiserate too!<br/>\n<br/>\nMy son is 4 Friday and his step-bro will be 10 Friday. And they have <br/>\nbunk beds too! The oldest has never liked sleeping on the top bunk, <br/>\nbut was willing to try it at this new house. Maybe moving helped? <br/>\nMaybe cause the room is his favorite color? Maybe he has grown in a <br/>\nmonth since last asking? Who knows!<br/>\n<br/>\nBut I do know it is very, very hard for us to keep the peace at our <br/>\nhouse and it is the biggest thing I need help with. My step-son comes <br/>\nup every 2 weeks which equates for about 4 whole days each month! <br/>\nThat is not much time for anyone, so the last thing I want is for him <br/>\nto hate coming up here because of his little brother. He too can <br/>\nclimb with no ladder and has little fear of being up so high. He even <br/>\nhas his own legos and items just like his big brother so that he has <br/>\nless to bother his brother about, yet it is never ending. 80-90% of <br/>\nthe time someone is always going to be miserable. And unfortunately <br/>\nthe youngest one screams the loudest and makes life the worst for <br/>\neveryone when he is not happy... so he often gets alot of what he <br/>\nwants just out of sheer fatigue/desperation on everyone&#39;s part. <br/>\n<br/>\nI do know that I have made sure the oldest has his time alone in the <br/>\nlast 5 months. It has meant dealing with an out of control, <br/>\nunconsolable almost 4 yr old but it does seems to be what&#39;s best some <br/>\ntimes. Maybe this is what sparked the transition of the oldest to <br/>\nbeing able to sleep in the top bunk without complaining. I just know <br/>\nthe kids are spending more quiet and quality time together since <br/>\nmaking sure the oldest has his quiet time with friends/ or whatever. <br/>\n(yet i can only base this on 1 weekend at the new house. that&#39;s all <br/>\nthe oldest has been here) He is very reserved, shy, and often <br/>\ndepressed. He is use to a lonely, quiet house so coming to a house <br/>\nwith a WILD and loud child who has no concept of personal boundaries <br/>\nis a hard change. I personally think things are worse because the <br/>\nkids live in seperate houses but I have nothing to base this on <br/>\nexcept several 10-14 day visits during the summer by the oldest <br/>\nchild. We all fall into a little more of a routine then, but it is <br/>\nstill hard and I would love hearing solutions! (ones that can&#39;t <br/>\nrequire dealing with the other mother who won&#39;t cooperate)<br/>\n<br/>\n<br/>\nI have sometimes insisted the oldest play with the youngest but I <br/>\nhave also tried to find things they can do together, even if <br/>\nseperately and differently, just so the youngest feels less left out. <br/>\nWhether it helps or not I can&#39;t say but it seems to give some sort of <br/>\npeace. Some thigns are playing Gameboy at the same time. Playing with <br/>\nplaydough, riding bikes (can cause more problems than good), watching <br/>\nmovies, playing PS2 together. I can&#39;t think of anything else. I know <br/>\nwhen they were younger they both enjoyed tub time together sometimes. <br/>\nThe oldest thought it would suck yet he found it hilarious being able <br/>\nto put soap suds or something on the youngest withou thim knowing it. <br/>\nNow they are both too old. <br/>\n<br/>\nI do feel when no one wants to get along things are worse than b4! I <br/>\npersonally remember my sister locking me in my room and punishing us <br/>\nwhen my mother was away. She was 7.5 yrs older.</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with brothers...","postDate":"1210004413","msgId":32405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2bmMzdCtsdDMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ2a2pqZCtmOGtpQGVHcm91cHMuY29tPg=="},"prevInTopic":32388,"nextInTopic":32407,"prevInTime":32404,"nextInTime":32406,"topicId":32381,"numMessagesInTopic":0,"msgSnippet":"... rangers, ... happy. ... everything possible to ... I ve been having the same problem with my almost 11mo. When he wants something he wants only that and","messageBody":"<div id=\"ygrps-yiv-1544245139\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;swissarmy_wife&quot; <br/>\n&lt;heatherbean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The problem is that there is no<br/>\n&gt; redirecting this child.  Once he is dead set on getting on that top<br/>\n&gt; bunk, he wants nothing else in the world.  Not trains, power <br/>\n </span></blockquote>rangers,<br/>\n<blockquote><span title=\"ireply\"> &gt; candy, hugs, singing, dancing, or anything else will make him <br/>\n </span></blockquote>happy. <br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s gotten to the point where I&#39;ve resorted to &lt;snip&gt; doing <br/>\n </span></blockquote>everything possible to<br/>\n<blockquote><span title=\"ireply\"> &gt; prevent him from bothering his brother.  But he isn&#39;t looking for a<br/>\n&gt; connection with me.  He&#39;s looking to connect with his brother. <br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ve been having the same problem with my almost 11mo. When he wants <br/>\nsomething he wants only that and there&#39;s no redirecting, <br/>\ndistracting, whatever. The only thing that can be done is remove him <br/>\nentirely from the situation. My 4yo doesn&#39;t want to play with the <br/>\nbaby most of the time. He has his own thing he&#39;s doing and the baby <br/>\nmesses it up.<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; So, I am meeting the needs of the older boy.  But I&#39;m not helping <br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; meet any needs of the 3 year old.  And I&#39;m feeling TERRIBLY guilty<br/>\n&gt; over the way the younger one is being treated.  <br/>\n<br/>\n </span></blockquote>I feel this way, too, about the baby. I feel like I&#39;m saying No to <br/>\nhim a lot more than I did my 4yo for the simple fact that he bothers <br/>\nhis big brother. <br/>\n<br/>\nI don&#39;t have any suggestions, just commiseration. This, too, shall <br/>\npass (right?).<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with brothers...","postDate":"1209922244","msgId":32388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2a3JzNCtzbGswQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk4ODE2NC40MDc4Ny5xbUB3ZWI1MzIxMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":32387,"nextInTopic":32405,"prevInTime":32387,"nextInTime":32389,"topicId":32381,"numMessagesInTopic":0,"msgSnippet":"... I would sit down and build him Lego sets that for some time he just had interest in taking apart. Now at almost 4 he likes building more than taking apart","messageBody":"<div id=\"ygrps-yiv-581511101\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Mara &lt;mamadeluz@...&gt; wrote:<br/>\nI would sit down and build him Lego sets that for some time he just<br/>\nhad interest in taking apart. Now at almost 4 he likes building more<br/>\nthan taking apart and owns quite a few of his own Lego sets. <br/>\n<br/>\n--------------<br/>\n<br/>\nI&#39;ve thought of getting him his own Lego&#39;s.  But this isn&#39;t really<br/>\nwhere the problems occurs.  We practically have a Lego land in the<br/>\nbedrooms.  <br/>\n<br/>\n--------------<br/>\n<br/>\nIf it is the top bunk he likes so much, could you talk to your older<br/>\nbrother about maybe  moving his breakable things somewhere else for<br/>\nthe time being so that the younger one can explore the bunk at his<br/>\nleasure ? <br/>\n<br/>\n--------------<br/>\n<br/>\nNo one really seems willing to budge on the issue.  :-(  As he gets<br/>\nolder he is getting a little more territorial.  I feel that if I push<br/>\nhim too hard to share his space, he will resent sharing it at all.  <br/>\n<br/>\n--------------<br/>\n<br/>\nIf space and money are not an issue, can he get his own bunk (IKEA is<br/>\npretty cheap), or his own &#39;special&#39; place made up with chairs and<br/>\nblankets etc.? <br/>\n<br/>\n--------------<br/>\n<br/>\nHmmm....  not a bad idea, since there is a new baby on the way anyway.<br/>\n Thanks!<br/>\n<br/>\n--------------<br/>\n<br/>\nTalking to the 3 y.o. about what it is he really wants (brother? bunk?<br/>\nLegos&#39;s? Looking at the paintings?) and then seeing how that can<br/>\nsomehow be honored might help. <br/>\n<br/>\n--------------<br/>\n<br/>\nAnd here lies one of the problems.  He&#39;s not really in the mode to be<br/>\ncommunicating when this happens.  He just wants to be where his<br/>\nbrother is at all times!  :-)  <br/>\n<br/>\n--------------<br/>\n<br/>\nMy husband actually came up with the idea to ask the 9 y.o. to mention<br/>\nit to us BEFORE he goes up for &quot;alone time&quot;.  now obviously this isn&#39;t<br/>\na foolproof plan, but might help avoid the struggle on a few occasions.<br/>\n<br/>\nIt&#39;s really funny how when they shared a bedroom there seemed to be so<br/>\nmany less struggles.  But now that they are in different rooms, each<br/>\nis fighting for their territory.  <br/>\n<br/>\nThanks for the input.  :-) </span></blockquote></div>","specialLinks":[]},{"userId":133390932,"authorName":"Mara","from":"Mara &lt;mamadeluz@...&gt;","profile":"mamadeluz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with brothers...","postDate":"1209921093","msgId":32387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4ODE2NC40MDc4Ny5xbUB3ZWI1MzIxMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":32385,"nextInTopic":32388,"prevInTime":32386,"nextInTime":32388,"topicId":32381,"numMessagesInTopic":0,"msgSnippet":"We had some issues a while ago with my 3 y.o. braking my 6 y.o. s Lego sets and we made a shelf that he can reach and see but that we have told him these are","messageBody":"<div id=\"ygrps-yiv-580496430\">We had some issues a while ago with my 3 y.o. braking my 6 y.o.&#39;s Lego sets and we made a shelf that he can reach and see but that we have told him these are the things that his brother would not like to have broken. He understood as he has seen his brother sad about what he did. I would sit down and build him Lego sets that for some time he just had interest in taking apart. Now at almost 4 he likes building more than taking apart and owns quite a few of his own Lego sets. I do know how it gets that something his brother has seems so much more enticing than anything else in the whole world. If it is the top bunk he likes so much, could you talk to your older brother about maybe  moving his breakable things somewhere else for the time being so that the younger one can explore the bunk at his leasure ? Or if you go up with the little one for some time and make sure he looks and not breaks until he tires of the activity, maybe talking to your 9 y.o. that<br/>\n usually a 3 y.o.&#39;d attention span is not too long anyways ? - If space and money are not an issue, can he get his own bunk (IKEA is pretty cheap), or his own &#39;special&#39; place made up with chairs and blankets etc.? Talking to the 3 y.o. about what it is he really wants (brother? bunk? Legos&#39;s? Looking at the paintings?) and then seeing how that can somehow be honored might help. It takes time to learn how to come up with solutions outside the box, I am still struggling with it sometimes, but you will be surprised at what you might come up with. It helps to just breathe for a moment and asking yourself, &#39; what is it that is most needed in this very moment?&#39; And then be still to have the answer come to you. It works wonders for me.<br/>\nIf he wants for example &#39;brother&#39;s attention&#39; and the brother is not willing to give it, it might help to just talk about it: Your brother is very busy right now, is there something we can do that would make you feel better in the meantime?  Don&#39;t know if this helps -<br/>\nMara<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Sunday, May 4, 2008 11:09:33 AM<br/>\nSubject: [unschoolingbasics] Help with brothers...<br/>\n<br/>\n<br/>\nMy 9 year old has bunkbeds.  He uses the top bunk as a &quot;sanctuary&quot;<br/>\naway from the 3 year old.  Mostly for breakable things like Lego&#39;s and<br/>\nhis drawings that he does not want ruined.  Recently the 3 year old<br/>\nhas figured out how to climb up WITHOUT the ladder.  A few times he<br/>\nwas welcomed up there.  But many times he is NOT.  Usually an argument<br/>\nand tears begin and that&#39;s my cue.  I&#39;m desperately trying to get the<br/>\nolder one to call for me FIRST.  Which in fact he has become much<br/>\nbetter at.  There used to be a lock on the door, but the little one<br/>\nhas resorted to charging the door over and over and over again until<br/>\nhe can get in.  He&#39;s persistant.  :-)<br/>\n<br/>\nWe&#39;ve been having some issues with the 9 year old lately.  I really<br/>\nfeel, that being about 8 months pregnant has strained our<br/>\nrelationship, and I&#39;m really trying to reconnect with him, and honor<br/>\nhis wishes, and overall treat him with the same respect that we had<br/>\nbefore I got pregnant because I haven&#39;t been.  So, I feel that he has<br/>\nevery right, to say that his little brother cannot play on his top<br/>\nbunk if he does not want him to.  The problem is that there is no<br/>\nredirecting this child.  Once he is dead set on getting on that top<br/>\nbunk, he wants nothing else in the world.  Not trains, power rangers,<br/>\ncandy, hugs, singing, dancing, or anything else will make him happy. <br/>\nIt&#39;s gotten to the point where I&#39;ve resorted to prying him off the<br/>\nbed, and carrying him down the stairs and doing everything possible to<br/>\nprevent him from bothering his brother.  But he isn&#39;t looking for a<br/>\nconnection with me.  He&#39;s looking to connect with his brother. <br/>\n<br/>\nSo, I am meeting the needs of the older boy.  But I&#39;m not helping to<br/>\nmeet any needs of the 3 year old.  And I&#39;m feeling TERRIBLY guilty<br/>\nover the way the younger one is being treated.  Hormones are<br/>\npreventing me from thinking so quickly, and after its all over, I<br/>\nusually end up in tears over my shotty parenting.  (hormonal pregnant<br/>\ntears :-)<br/>\n<br/>\nAny ideas?  This is getting REALLY tough.<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      ____________________________________________________________________________________<br/>\nBe a better friend, newshound, and <br/>\nknow-it-all with Yahoo! Mobile.  Try it now.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\">http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with brothers...","postDate":"1209914419","msgId":32385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDgwNTA0MDgyMHk0ZWMxMmU3OGtjNjlmYWVkZGRiNTBmNDRlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZ2a2pqZCtmOGtpQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ2a2pqZCtmOGtpQGVHcm91cHMuY29tPg=="},"prevInTopic":32381,"nextInTopic":32387,"prevInTime":32384,"nextInTime":32386,"topicId":32381,"numMessagesInTopic":0,"msgSnippet":"oh gosh. I was there last year! I don t have any great advice but hang in there. We are working through the strains that came up through my pregnancy and","messageBody":"<div id=\"ygrps-yiv-1304490886\">oh gosh. I was there last year! I don&#39;t have any great advice but hang<br/>\nin there. We are working through the strains that came up through my<br/>\npregnancy and moving. I&#39;d love to hear what the wise women on here<br/>\nhave to say.<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, May 4, 2008 at 11:09 AM, swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My 9 year old has bunkbeds. He uses the top bunk as a &quot;sanctuary&quot;<br/>\n&gt;  away from the 3 year old. Mostly for breakable things like Lego&#39;s and<br/>\n&gt;  his drawings that he does not want ruined. Recently the 3 year old<br/>\n&gt;  has figured out how to climb up WITHOUT the ladder. A few times he<br/>\n&gt;  was welcomed up there. But many times he is NOT. Usually an argument<br/>\n&gt;  and tears begin and that&#39;s my cue. I&#39;m desperately trying to get the<br/>\n&gt;  older one to call for me FIRST. Which in fact he has become much<br/>\n&gt;  better at. There used to be a lock on the door, but the little one<br/>\n&gt;  has resorted to charging the door over and over and over again until<br/>\n&gt;  he can get in. He&#39;s persistant. :-)<br/>\n&gt;<br/>\n&gt;  We&#39;ve been having some issues with the 9 year old lately. I really<br/>\n&gt;  feel, that being about 8 months pregnant has strained our<br/>\n&gt;  relationship, and I&#39;m really trying to reconnect with him, and honor<br/>\n&gt;  his wishes, and overall treat him with the same respect that we had<br/>\n&gt;  before I got pregnant because I haven&#39;t been. So, I feel that he has<br/>\n&gt;  every right, to say that his little brother cannot play on his top<br/>\n&gt;  bunk if he does not want him to. The problem is that there is no<br/>\n&gt;  redirecting this child. Once he is dead set on getting on that top<br/>\n&gt;  bunk, he wants nothing else in the world. Not trains, power rangers,<br/>\n&gt;  candy, hugs, singing, dancing, or anything else will make him happy.<br/>\n&gt;  It&#39;s gotten to the point where I&#39;ve resorted to prying him off the<br/>\n&gt;  bed, and carrying him down the stairs and doing everything possible to<br/>\n&gt;  prevent him from bothering his brother. But he isn&#39;t looking for a<br/>\n&gt;  connection with me. He&#39;s looking to connect with his brother.<br/>\n&gt;<br/>\n&gt;  So, I am meeting the needs of the older boy. But I&#39;m not helping to<br/>\n&gt;  meet any needs of the 3 year old. And I&#39;m feeling TERRIBLY guilty<br/>\n&gt;  over the way the younger one is being treated. Hormones are<br/>\n&gt;  preventing me from thinking so quickly, and after its all over, I<br/>\n&gt;  usually end up in tears over my shotty parenting. (hormonal pregnant<br/>\n&gt;  tears :-)<br/>\n&gt;<br/>\n&gt;  Any ideas? This is getting REALLY tough.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nwww.bearthmama.com </span></blockquote></div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help with brothers...","postDate":"1209913773","msgId":32381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2a2pqZCtmOGtpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":32385,"prevInTime":32380,"nextInTime":32382,"topicId":32381,"numMessagesInTopic":0,"msgSnippet":"My 9 year old has bunkbeds.  He uses the top bunk as a sanctuary away from the 3 year old.  Mostly for breakable things like Lego s and his drawings that he","messageBody":"<div id=\"ygrps-yiv-974267296\">My 9 year old has bunkbeds.  He uses the top bunk as a &quot;sanctuary&quot;<br/>\naway from the 3 year old.  Mostly for breakable things like Lego&#39;s and<br/>\nhis drawings that he does not want ruined.  Recently the 3 year old<br/>\nhas figured out how to climb up WITHOUT the ladder.  A few times he<br/>\nwas welcomed up there.  But many times he is NOT.  Usually an argument<br/>\nand tears begin and that&#39;s my cue.  I&#39;m desperately trying to get the<br/>\nolder one to call for me FIRST.  Which in fact he has become much<br/>\nbetter at.  There used to be a lock on the door, but the little one<br/>\nhas resorted to charging the door over and over and over again until<br/>\nhe can get in.  He&#39;s persistant.  :-)<br/>\n<br/>\nWe&#39;ve been having some issues with the 9 year old lately.  I really<br/>\nfeel, that being about 8 months pregnant has strained our<br/>\nrelationship, and I&#39;m really trying to reconnect with him, and honor<br/>\nhis wishes, and overall treat him with the same respect that we had<br/>\nbefore I got pregnant because I haven&#39;t been.  So, I feel that he has<br/>\nevery right, to say that his little brother cannot play on his top<br/>\nbunk if he does not want him to.  The problem is that there is no<br/>\nredirecting this child.  Once he is dead set on getting on that top<br/>\nbunk, he wants nothing else in the world.  Not trains, power rangers,<br/>\ncandy, hugs, singing, dancing, or anything else will make him happy. <br/>\nIt&#39;s gotten to the point where I&#39;ve resorted to prying him off the<br/>\nbed, and carrying him down the stairs and doing everything possible to<br/>\nprevent him from bothering his brother.  But he isn&#39;t looking for a<br/>\nconnection with me.  He&#39;s looking to connect with his brother. <br/>\n<br/>\nSo, I am meeting the needs of the older boy.  But I&#39;m not helping to<br/>\nmeet any needs of the 3 year old.  And I&#39;m feeling TERRIBLY guilty<br/>\nover the way the younger one is being treated.  Hormones are<br/>\npreventing me from thinking so quickly, and after its all over, I<br/>\nusually end up in tears over my shotty parenting.  (hormonal pregnant<br/>\ntears :-)<br/>\n<br/>\nAny ideas?  This is getting REALLY tough.</div>","specialLinks":[]}],"prevTopicId":32323,"nextTopicId":32412}}