{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":456409919,"authorName":"Colienne de Walque","from":"Colienne de Walque &lt;colienne.dewalque@...&gt;","profile":"colienne.dewalque","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Peeing issues","postDate":"1368890261","msgId":49815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjg4OTAyNjEuNzkxMDUuWWFob29NYWlsTmVvQHdlYjEzMzEwNS5tYWlsLmlyMi55YWhvby5jb20+","inReplyToHeader":"PGtuN3U2Nis0cGc3QGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNjg4NzY2NTguNzk4NDUuWWFob29NYWlsTmVvQHdlYjEzMzEwMi5tYWlsLmlyMi55YWhvby5jb20+IDxrbjd1NjYrNHBnN0BlR3JvdXBzLmNvbT4="},"prevInTopic":49814,"nextInTopic":0,"prevInTime":49814,"nextInTime":49816,"topicId":49813,"numMessagesInTopic":0,"msgSnippet":"Meredith, thank you for answering ! Are you and he getting enough fluids? That s really the first response to any kind of urinary tract issue - more fluids. ","messageBody":"<div id=\"ygrps-yiv-736906666\">Meredith, thank you for answering !<br/>\n<br/>\n<br/>\nAre you and he getting enough fluids? That&#39;s really the first response to any kind of urinary tract issue - more fluids.<br/>\n******************<br/>\n<br/>\nI tend to forget to drink, and to give fluids to Gilles, when we&#39;re busy. It means most of the time he drinks during meals/snacks but not between. And he usually doesn&#39;t want to eat/drink outside the house so he sometimes stays a really long time without drinking. I&#39;ll offer him fluids regularly when we&#39;re at home (most of the time, he loves to stay here !) and see what could suit him for outings. If nothing changes, I&#39;ll check test-strips for infections. Thank you !<br/>\n<br/>\n<br/>\nColienne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Peeing issues","postDate":"1368882182","msgId":49814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtuN3U2Nis0cGc3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjg4NzY2NTguNzk4NDUuWWFob29NYWlsTmVvQHdlYjEzMzEwMi5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49813,"nextInTopic":49815,"prevInTime":49813,"nextInTime":49815,"topicId":49813,"numMessagesInTopic":0,"msgSnippet":"... **************** A feeling of needing to pee when the bladder is empty can be a sign of mild dehydration or even a mild bladder infection - there doesn t","messageBody":"<div id=\"ygrps-yiv-628391119\">Colienne de Walque &lt;colienne.dewalque@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;he gets angry because he feels it&#39;s not. Then he tries to pee again, few drops come out and he asks us again. Sometimes he starts crying, telling us he doesn&#39;t want to feel the pee in his bladder anymore<br/>\n </span></blockquote>****************<br/>\n<br/>\nA feeling of needing to pee when the bladder is empty can be a sign of mild dehydration or even a mild bladder infection - there doesn&#39;t need to be any pain or darkening of the urine if the infection is mild. It Is frustrating and annoying to have that &quot;not done&quot; feeling when you pee, especially if it lasts more than a few days or is recurrent. Usually when I feel it I assume I&#39;m getting a little dehydrated, but my mother had chronic cystitis and feeling like she needed to pee when she didn&#39;t was the first sign each round.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Or it&#39;s genetic ? I too have this feeling I need to empty my bladder and go several times to the bathroom, but only before leaving the house.<br/>\n </span></blockquote>*************<br/>\n<br/>\nIf it&#39;s something you experience regularly, regardless of the cause that&#39;s an important thing to communicate with your son. What do You do when you have that feeling? Personally, I reassure myself that I can always pee later, the kidneys are working all the time, I probably need to hydrate and then Distract Myself. <br/>\n<br/>\nAre you and he getting enough fluids? That&#39;s really the first response to any kind of urinary tract issue - more fluids.<br/>\n<br/>\nIf nothing else, upping the amount of liquid going through your son could change how often he pees - break up the dynamic by shifting the pattern. It could also help him feel like he&#39;s doing something - he&#39;s not helpless. I have no idea if I actually get mildly dehydrated or if there&#39;s some other cause, but I Do drink more fluids And the sensation goes away after awhile - it might be pure superstition that it works and something else is going on, but I feel like I have some control over the situation and that&#39;s important. <br/>\n <br/>\nIt could help to talk with him about the possibility of an infection, too - whether or not he has one, it could be helpful for him to know there&#39;s a Cause. What he&#39;s really feeling is inflammation or something putting pressure on his bladder. It&#39;s not some random sensation, he&#39;s not crazy, and there are things to try. Actually, flipping through links, there are test-strips for urinary tract infections - I don&#39;t know how well they work, but it&#39;s something to look into even just to rule out the possibility. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":456409919,"authorName":"Colienne de Walque","from":"Colienne de Walque &lt;colienne.dewalque@...&gt;","profile":"colienne.dewalque","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Peeing issues","postDate":"1368876658","msgId":49813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjg4NzY2NTguNzk4NDUuWWFob29NYWlsTmVvQHdlYjEzMzEwMi5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":49814,"prevInTime":49812,"nextInTime":49814,"topicId":49813,"numMessagesInTopic":0,"msgSnippet":"I need some advice. Our 5 years old son, Gilles, started having peeing issues about one month ago, especially before eating and sleeping. Here s what happens :","messageBody":"<div id=\"ygrps-yiv-2082191503\">I need some advice. <br/>\n<br/>\n<br/>\nOur 5 years old son, Gilles, started having peeing issues about one month ago, especially before eating and sleeping. Here&#39;s what happens : just before eating something (or when is ready to sleep) he needs to go to the bathroom. We (my husband or me) then go upstairs with him, he pees and asks us if there&#39;s still something in his bladder. If we say we don&#39;t know -because we are not in his body- he gets angry because he wants us to know for him, and if we say it&#39;s empty -because it seems it&#39;s what he wants to hear- he gets angry because he feels it&#39;s not. Then he tries to pee again, few drops come out and he asks us again. Sometimes he starts crying, telling us he doesn&#39;t want to feel the pee in his bladder anymore, and he tries peeing during more than 30 minutes. We try to soothe him but it&#39;s not always easy to stay relaxed...<br/>\n<br/>\n<br/>\nThings related to the bathroom weren&#39;t problematic before. He asked us to stop diapers (without any pressure) when he was 2,5 years old and never had an &quot;accident&quot; since that day. I asked him if he had any pain while peeing but he said no, it&#39;s just he wants to empty his bladder. Meals and nights doesn&#39;t seem problematic either : he only eats things he likes, and he&#39;s always happy to go to bed with us. But it&#39;s strange because when he needs to pee at other times during the day, he usually pees once and it&#39;s over.<br/>\n<br/>\n<br/>\nMaybe it&#39;s linked with my pregnancy ? I&#39;m definitely more tired and anxious than usual. Also, he stopped nursing during the first trimester and we don&#39;t roughhouse as much as before, so we are less close physically - even if we snuggle very often to read and he sleeps with me. Or it&#39;s a phase ? He told my husband he wanted to stay little, maybe he&#39;s anxious about growing up. Or it&#39;s genetic ? I too have this feeling I need to empty my bladder and go several times to the bathroom, but only before leaving the house.<br/>\n<br/>\nWhat do you think ? What can we do to help him ? <br/>\n<br/>\n<br/>\n(Sorry for my English)<br/>\n<br/>\n<br/>\nThank you in advance,<br/>\nColienne<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49775,"nextTopicId":49803}}