{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: OK, now what?","postDate":"1149277244","msgId":13946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MDIyMDA2MTk0MC43NjUwLjQ0ODA5NDNDMDAwNDdCQ0EwMDAwMURFMjIyMDcwMjA5NTMwMjBFMDMwNTBDMDcwODAwMDNAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13945,"nextInTime":13947,"topicId":13946,"numMessagesInTopic":0,"msgSnippet":"Hi, I am a mom with 1 in school, 1 who uses an independant homeschool program, and 1 who is unschooled. All these schoolish options really do get in the way of","messageBody":"<div id=\"ygrps-yiv-871102512\">Hi,<br/>\n<br/>\nI am a mom with 1 in school, 1 who uses an independant homeschool program, and 1 who is unschooled. All these schoolish options really do get in the way of my perception sometimes on what is really important, learning wise and I know it is picked up on by my kids. School compares kids and it seems your 11 year old is comparing himself to others who school. He has this as a model. He is stuck, I think, without a focus or current passion. And, since you and your other kids like the group learning, which sounds schoolish in that an adult leads the learning, he may be feeling less. Asking himself questions like why don&#39;t I like this, I&#39;m not into learning, blah blah. I&#39;m guessing here because my middle guy does not thrive in group learning environments which are academic in focus, yet he is constantly commended for being such an excellent listener and leader in his sports programs. <br/>\n<br/>\nI have stopped going to the coop here, primarily because my son did not thrive. My dd did, but the negative was outweighing the positive. It wasn&#39;t until I put the coop learning aside that I really and truly got into a flowing learning place with my family that I call life learning. I would question yourself in how much the coop means to you, personally. Is it something you do which you enjoy but actually the kids could do without? I have been there. I grieved leaving the coop, because it had become my community. My community is being replaced now with others in activities that my son thrives in. Swimming and soccer are his passions. It tooking being at home with little but living at home for us to find what he needed.<br/>\n<br/>\nNow some other ideas, take him to a place which has kits, like science kits, building kits, space stuff. See if anything sparks. Does he seem drawn to looking at the stars? Get a small telescope and star watch. Is he drawn to physical stuff, have him make a list if what he wants next, like a new scooter or a wave board. talk about the potential of living physics. Is he interested in building. Buy wood and get started with a bird house. Does he want to grow his own food, get digging. What about the music store? By all these ideas, I am suggesting go out and get to know your son a little bit better. What makes him sparkle? My 11 year old dd, it&#39;s fashion. My 9 year old son. it&#39;s sports. My 6 year old, its barbies.<br/>\n<br/>\nOne last thought. With my guy, when my dd wants to participate in her ISP workshops, I leave her with her buddies and do fun things with my son. We go on walks, we connect. I do not go and have fun with my dd in a place my son does not like to be. That just doesn&#39;t work for us, so my dd gets her structured learning and social interaction and my son gets to be with me 1 on 1. I stopped teaching units and such because I became way more concerned about my role and left my poor guy miserable. This is what works for us right now.<br/>\n<br/>\nMary (off to be the balloon tier for my 2 who are home)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":13856,"nextTopicId":13969}}