{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first taste of unschooling","postDate":"1111372986","msgId":5274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4LjZlYjMzYzg1LjJmNmY4ZWJhQGFvbC5jb20+"},"prevInTopic":5265,"nextInTopic":0,"prevInTime":5273,"nextInTime":5275,"topicId":5265,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/20/2005 11:22:37 A.M. Eastern Standard Time, starsuncloud@netzero.net writes: I don t  think there are very many people who actually need ","messageBody":"<div id=\"ygrps-yiv-284736519\">In a message dated 3/20/2005 11:22:37 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\nI don&#39;t  think there are very many people who actually need <br/>\nintervention for their  speech...and certainly NOT at two years old.<br/>\n<br/>\n<br/>\n<br/>\nI agree completely with this....and I&#39;m a speech pathologist.  My  private <br/>\npractice has really suffered these past two years since we have become  <br/>\nunschoolers...&gt;g&lt;<br/>\n <br/>\nUsually I get a call from a parent worried about their child not meeting  the <br/>\n&quot;norms&quot; according to some testing they did at a public school or they may  <br/>\nhave a relative who has commented on their minimal expressive  speech.  With <br/>\nyounger kids, I usually arrange to meet with the parents  (usually just the mom <br/>\nwill come) and with really young kids I give the  parent some suggestions of <br/>\nnatural language modeling that they can do with  their kids.<br/>\n <br/>\n Language and speech modeling is something most parent do without even  <br/>\nthinking about it.<br/>\nHowever, for some parents it helps them to have some examples of how to  talk <br/>\nto their kids and expand or even parallel their language.  An example  of an <br/>\nexpansion would be if your child says &quot;mo&quot; and points to his cup.   The parent <br/>\nwould say, &quot;You want more milk?  I&#39;ll pour you some.&quot; I strongly  discourage <br/>\nspeech therapy at this point and talk to the parent about<br/>\nevery child needing their own timetable for walking and talking. As a  <br/>\nresult, all the children I work with are 10 or older.<br/>\n <br/>\nWith older kids, I will only work with them if they are the ones wanting to  <br/>\ndo something about their speech patterns or reading.  Right now, I have a  few <br/>\nkids that are 10-13 who are frustrated with not being able to read the  <br/>\nthings they want to read and a couple who are not happy with their speech  because <br/>\nof articulation problems.  It is their choice rather than their  parents to <br/>\ncome to speech and I help them with the things they want help  with.<br/>\n <br/>\nI spend a lot of time talking with the parents of the children and recently  <br/>\nlent The Teenage Liberation Handbook to the mom of a 13 year old girl I&#39;m  <br/>\nhelping with reading. This girl really wants to read teen  magazines.  She has <br/>\nfetal alcohol syndrome and truly struggles with  reading.  Her goal is to be <br/>\nable to read articles in some of her favorite  magazines and to be able to <br/>\nunderstand them. It is her goal.  Not her mom&#39;s  or mine.  <br/>\n <br/>\nAnother girl I see has a very rare neurological disorder and was expecting  <br/>\nto only be using sign language by now.  She can read very simple sentences  and <br/>\nwords and every time I see her will tell me how she just wants to  read.  She <br/>\nhas the most amazingly beautiful heart and soul and is a gifted  ballet <br/>\ndancer.  She will be 14 soon but may  not live past  20. She wants so much to read.<br/>\nMy goal is to help her read because that is what she wants.<br/>\n <br/>\nI started out just wanting to say that usually children don&#39;t need speech  <br/>\ntherapy at 2 or 5 or 7.  Give them all the time they need as they speak and  <br/>\ntalk and grow and be the beautiful person they are.  Celebrate who they are  <br/>\nrather than worrying about another person&#39;s idea of what milestones they should  <br/>\nhave accomplished. Be a good language and speech model for your child and  <br/>\nrealize that may mean &quot;you&quot; learning how to do this rather than taking your  child <br/>\na speech therapist to be fixed.  Your child may just need more time  or maybe <br/>\nyou may need to learn how to provide more language stimulation at  home to <br/>\nhelp them.<br/>\n <br/>\nGail<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Our first taste of unschooling","postDate":"1111335457","msgId":5265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxazduMStjZ2U5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":5274,"prevInTime":5264,"nextInTime":5266,"topicId":5265,"numMessagesInTopic":0,"msgSnippet":"  My best friend told me that her little sister didn t utter a word until she was 3 years old. That would be my Jalen, now four. He said na-na (for","messageBody":"<div id=\"ygrps-yiv-160803632\">&quot;  My best friend told me that<br/>\nher little sister didn&#39;t utter a word until she was 3 years old.&quot;<br/>\n<br/>\nThat would be my Jalen, now four. He said &quot;na-na&quot; (for nursing) and <br/>\nmade this &quot;Ttttsssssss&quot; sound while pointing at anything of <br/>\ninterest.  I bet most of the folks here that attended the 2003 Live <br/>\nand Learn conference and met Jalen, will remember his &quot;Ttttsssss&quot; <br/>\nsound. <br/>\nThat was about all he did until close to three years old. Then he <br/>\nstarted saying a few words, within a few months he was into full <br/>\nsentences.<br/>\nHe&#39;s still not as verbal as some four year olds. Big deal. He knows <br/>\nhow to communicate and that&#39;s what matters.<br/>\n<br/>\nI am not a big fan of speech therapy. I think it&#39;s a way for people <br/>\nto make money, instill fear into parents and the children would <br/>\nfigure it out on their own anyway.<br/>\n<br/>\nI don&#39;t think there are very many people who actually need <br/>\nintervention for their speech...and certainly NOT at two years old.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":5261,"nextTopicId":5150}}