{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Just Sharing a Positive Unschooling Day...this is long","postDate":"1130264164","msgId":7212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2Ljc0NzdkMDAzLjMwOGZkMDY0QGFvbC5jb20+"},"prevInTopic":7211,"nextInTopic":0,"prevInTime":7211,"nextInTime":7213,"topicId":7209,"numMessagesInTopic":0,"msgSnippet":"Thanks for sharing, Sandy.  It makes you wonder why everyone doesn t  live this way. :) By the way, we have started getting the Weird and Wild Animal cards,","messageBody":"<div id=\"ygrps-yiv-1839015817\">Thanks for sharing, Sandy.  It makes you wonder why everyone doesn&#39;t  live <br/>\nthis way. :)<br/>\n <br/>\nBy the way, we have started getting the Weird and Wild Animal cards,  too.  <br/>\nMy son LOVES them.  <br/>\n <br/>\nHave another great day!<br/>\n <br/>\nLeslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Just Sharing a Positive Unschooling Day...this is long","postDate":"1130261348","msgId":7211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMjUyMDA1MTcyOS4xODQ5Ni40MzVFNkI2MzAwMEQzNjM2MDAwMDQ4NDAyMjAwNzUwNzg0MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":7209,"nextInTopic":7212,"prevInTime":7210,"nextInTime":7212,"topicId":7209,"numMessagesInTopic":0,"msgSnippet":"Thanks for sharing your wonderful day. It was such a great way to start *my* day by reading about someone else s gentle journey. ... self-loathing pretty much","messageBody":"<div id=\"ygrps-yiv-1508370318\">Thanks for sharing your wonderful day. It was such a great way to start *my* day by reading about someone else&#39;s gentle journey.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;What an awful parent,<br/>\n </span></blockquote>self-loathing pretty much describes how I feel about<br/>\nmyself back then, I wish I could take it back.&gt;&gt;<br/>\n<br/>\nDon&#39;t hold on to those feelings. That moment is gone. Isn&#39;t it wonderful that you have NOW to be the parent you wish you were then. <br/>\n<br/>\n--<br/>\n~Mary<br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":175529137,"authorName":"Donald and Sandra Winn","from":"Donald and Sandra Winn &lt;aplan4life@...&gt;","profile":"aplan4life","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Just Sharing a Positive Unschooling Day...this is long","postDate":"1130249057","msgId":7209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDI1MTQwNDE3Ljg4ODk1LnFtYWlsQHdlYjUzMDA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":7211,"prevInTime":7208,"nextInTime":7210,"topicId":7209,"numMessagesInTopic":0,"msgSnippet":"I want you all to know that I m taking everything that you ve said in and it means so much to me that you are offering such wonderful advice.  In time, I hope","messageBody":"<div id=\"ygrps-yiv-1339686345\">I want you all to know that I&#39;m taking everything that<br/>\nyou&#39;ve said in and it means so much to me that you are<br/>\noffering such wonderful advice.  In time, I hope to be<br/>\nable to offer encouragement and advice as well.  What<br/>\nyou all told me about my son and such, it really hit<br/>\nme hard because I know that I and my husband are the<br/>\nreason behind &quot;what WE see as a problem&quot;, considering<br/>\nour parenting of him for 11 years and being critical<br/>\nand stealing his joy, we shouldn&#39;t be surprised.  What<br/>\nkind of life is it for him to be concerned about<br/>\nmessing up because mom and dad may make a callous<br/>\nremark?  Is it any wonder that he involves himself in<br/>\ntv so much, when that is his only safe haven? <br/>\nAlthough video games have much learning, is it really<br/>\ngreat if the &quot;main&quot; reason he plays is because he can<br/>\ndo so without being scorned for a mistake?  Seeing<br/>\nthings through his eyes and through the eyes of<br/>\nunschoolers gives me a whole new outlook. <br/>\n<br/>\nI cried yesterday while we were playing our card game<br/>\nbecause he spoke about playing Poke&#39;mon over six years<br/>\nago.  I took those away from him because I THOUGHT, at<br/>\nthe time that they were bad and evil.  When he was<br/>\nteaching me the game described below, his eyes lit up<br/>\nwhen talking about how he knew how to do this because<br/>\nof Poke&#39;mon.  I told him how sorry I was for taking<br/>\nthose cards away and making him feel bad for playing<br/>\nthem.  He told me it was okay, I still feel so<br/>\nterrible about it.  What an awful parent,<br/>\nself-loathing pretty much describes how I feel about<br/>\nmyself back then, I wish I could take it back. <br/>\nAnyway, here is my journal entry for yesterday and me<br/>\nseeing things through his eyes and through the eyes of<br/>\nan unschooler...................<br/>\n______________________________________________________<br/>\n<br/>\nJoyful <br/>\nOctober 24, 2005<br/>\n<br/>\nToday was one of those days where you just wish for a<br/>\nsecond that it could be recorded and put on an<br/>\nunbreakable memory disc.  It was perfect; beautiful<br/>\nweather (sunny, cool, breezy) and although I LOVE<br/>\nclouds, there wasn&#39;t one in the sky, just blue as far<br/>\nas the eye could see.<br/>\n<br/>\nOur morning started off joyful, which is something I<br/>\ndesire for each and everyday.  We had a small but<br/>\nfilling breakfast and did some minor housework. <br/>\nBrooke was anxious to go to her friends Kasey&#39;s at 10<br/>\nam and I was looking forward to spending some quality<br/>\ntime getting to know my son.  Once we got one<br/>\nobstinate bird back into his cage, we were off to<br/>\nKasey&#39;s.  Brooke was so excited, she loves her friend<br/>\nso much.  On the way there she said that she would<br/>\nmiss us, I was like, &quot;Yeah, right!&quot;  HAHA  We dropped<br/>\nher off and then Zak and I stopped at the store to<br/>\npick up a few lunch items and went home.<br/>\n<br/>\nDonnie arrived for lunch just slightly after 11.  He,<br/>\nZak and I laid on the bed together and just talked. <br/>\nWe had the birds out so we had some laughs as they<br/>\njumped from one of us to the next, pecked around,<br/>\nbickered and sang.  Those birds, Melvin and Gloria,<br/>\nhave us in stitches on a DAILY BASIS!  After that, it<br/>\nwas time for Donnie to go back to work.  Now Zak and I<br/>\nhad several hours in which to just be.<br/>\n<br/>\nWe went outside and played with the basketball and<br/>\nplayed the games; h-o-r-s-e-s-h-o-e, around the World,<br/>\nand one on one.  Then we fiddled around while<br/>\ndribbling and we laughed together when we made an<br/>\namusing shot, did the big sport event music, it was<br/>\njust awesome.  <br/>\n<br/>\nAfter we got pooped out from basketball we came in for<br/>\nawhile and I did the lunch dishes and Zak watched some<br/>\ntelevision.  The mail came early today and boy did<br/>\nthat bring in some added joy.  Several weeks ago I had<br/>\nordered Weird &quot;n&quot; Wild Creatures .  It is a<br/>\nsubscription in which every 3 weeks, you receive<br/>\ntrading/game cards with animals under several<br/>\ndifferent titles such as &quot;Of the Deep&quot;, &quot;Small<br/>\nTerrors&quot;, &quot;Of the Mind (mythical creatures), etc. <br/>\nAlso included are these gorgeous, colorful, full cards<br/>\nto go in a nice index box that are packed with little<br/>\ntid-bits including; geography, characteristics,<br/>\ndangers, class, etc. of each animal.   On each trading<br/>\ncard there are points for Defense and Attack, Zachary<br/>\nthen taught me how to play, because over 5 years ago<br/>\nhe did the same type of thing with Poke&#39;mon cards. <br/>\nFor instance, T-Rex has an Attack:10 and Defense is 8.<br/>\n The Great White Shark has an Attack:8, Defense: 7. <br/>\nIf Zak laid down T-Rex, I would lose because his<br/>\nattack is stronger than my defense and my Great White<br/>\nwould not have any life left.  It get&#39;s more complex<br/>\nthan that and it took awhile for me to understand.  I<br/>\ndid not realize all the math and memorization that<br/>\ngoes into these games.  Anyway, we played and had more<br/>\nlaughs and more fun.<br/>\n<br/>\nIt was now about 3 and I had asked Zak earlier if he<br/>\nwanted to cook dinner, he said, &quot;Yes!&quot;  Zak has my<br/>\ncoordination but you have to learn sometime, right? <br/>\nHAHA  Dinner was to be Chicken &#39;n&#39; Dumplins, Zaks<br/>\nfavorite meal.  He did the whole meal on his own and<br/>\nit was the best that I&#39;d ever had.  I told him what<br/>\ngoes in, boiling techniques, and let him play with<br/>\nspices but only because he had never made it before,<br/>\nhe did all the cut-ups, dumping and even estimated how<br/>\nmuch water he&#39;d need to cover the vegetables.   Zak is<br/>\na visual learner and also learns best by doing, I have<br/>\nno doubt that he would be able to make this meal with<br/>\npaper direction and/or no directions next time because<br/>\nhis memory (when something is REAL to him) is like<br/>\nthat of an elephant.  Donnie loved this meal prepared<br/>\nby our son also.  We sat down together and gobbled up<br/>\nZak&#39;s delicious meal, while telling silly Mom and Dad<br/>\n&quot;love&quot; stories and also that of Grandpa Buster and<br/>\nGrandma Marian.... Those are the best kinds of<br/>\ndinners.  Afterwards, Zak went the Weird &#39;n&#39; Wild<br/>\nCreatures website and learned about Giant<br/>\nCaterpillars, I hope I never run into one of those<br/>\nthings!  Donnie fiddled around on his guitar.<br/>\n<br/>\nAfter I finished with dishes it was time to go and<br/>\nmeet for coffee with Betsy.  Kasey&#39;s art teacher said<br/>\nthat it was okay if Brooke stayed and so that is why I<br/>\nwas fortunate for this little &quot;Ladies Night Out&quot;<br/>\nLOL...  Betsy and I had a nice time together and also<br/>\nhad a great conversation.  We then went to the Art<br/>\nStudio to pick up the kids and part ways for the<br/>\nnight.  Miss Diane had let Brooke paint (for free) a<br/>\ncouple of things, that was an added treat for the day.<br/>\n On the way home Brooke went on and on and on about<br/>\nall the fun she had had at her friends house.  They<br/>\nplayed on bikes, the trampoline, dress up, play acting<br/>\nwith acts, drawing cards and taking them to the<br/>\nneighbors, visiting Kasey&#39;s Grandma, etc., etc. and<br/>\nshe pointed out that they didn&#39;t watch any TV.  She<br/>\nwore me out just talking about her day.  That she had<br/>\na joyful day, added to the overall happiness.  When<br/>\nDonnie asked Brooke later, &quot;So what did you do all<br/>\nday...&quot;  She happily but firmly, &quot;Dad, I had a great<br/>\ntime but I don&#39;t feel like repeating everything again<br/>\nand I can&#39;t remember everything because we did so<br/>\nmuch!&quot;   ROFLMBO...kids are something else!<br/>\n<br/>\nWhen we arrived home, Donnie and Zak were playing an<br/>\nintense game of the SpongeBob Squarepants version of<br/>\nLife.  As usual, Zak won another board game.  I don&#39;t<br/>\nknow what it is with this kid but he wins these things<br/>\nall the time.  While they finished that I showed<br/>\nBrooke that our Creature Cards had arrived, she was<br/>\ninto that in no time.  Then Brooke decided that she<br/>\nwanted to play the &quot;War&quot; version of the Creature Cards<br/>\nwith daddy so, they did.  After that, I had to play<br/>\nher and Zak taught us the super fun way to do it...<br/>\nRaise your card high in the air and in a big way<br/>\npronounce (for instance) &quot;T-Rex, attack!&quot; Slam the<br/>\ncard on the table and slide it over to the opponents,<br/>\nwho has done the same thing.   I must say that that<br/>\ntruly was a super fun version!<br/>\n<br/>\nThe day was winding down and I grabbed a snack and<br/>\nwent out to watch the Science channel with Donnie. <br/>\nThe kids played their creature cards and after that<br/>\nthey were glued to looking at the info cards.  Later<br/>\nthe kids brushed their teeth and went to bed.  What a<br/>\ngreat day, what great memories, I&#39;m looking forward to<br/>\ntomorrow.<br/>\n<br/>\n<br/>\nPeace and Joy,<br/>\n~Sandy<br/>\nwww.homelearningnaturally.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________ <br/>\nYahoo! FareChase: Search multiple travel sites in one click.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://farechase.yahoo.com\">http://farechase.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":7187,"nextTopicId":7176}}