{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":89238718,"authorName":"amazzingpet@aol.com","from":"amazzingpet@...","profile":"amazzingpet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Spelling Woes","postDate":"1149901667","msgId":14290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxNi42NTVmZjhhLjMxYmI3NTYzQGFvbC5jb20+"},"prevInTopic":14169,"nextInTopic":0,"prevInTime":14289,"nextInTime":14291,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"... using a curriculum","messageBody":"<div id=\"ygrps-yiv-492556828\"><blockquote><span title=\"ireply\">&gt;&gt;How do kids learn to spell if they aren&#39;t learning spelling words or <br/>\n </span></blockquote>using a curriculum&lt;&lt;<br/>\n<br/>\nBy reading.  I would also investigate &quot;invented spelling&quot; to ease some of <br/>\nyour worries.  If they are constantly corrected, it is going to make them feel <br/>\nlike they are a bad speller.  Then the angst, shame and fear of the subject will <br/>\nonly make them believe this and perpetuate the cycle.  Good luck!<br/>\n<br/>\nWarmly,<br/>\nCynthia Mazzola DVM <br/>\naMazzing Labradors<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Spelling Woes","postDate":"1149733834","msgId":14169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2ODI0YSs1ZGwwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGFlMjZhNTcxMDYwNjA3MTIyOHUyNWI2NjdlcWEzZmRmODc1NTk1N2UwNDJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":14166,"nextInTopic":14290,"prevInTime":14168,"nextInTime":14170,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"... ways. Instant messaging, email, Myspace....the older 3 have gotten to the point where they care if things are spelled correctly. My dd is 13, we ve only","messageBody":"<div id=\"ygrps-yiv-2108128572\"><blockquote><span title=\"ireply\">&gt; My kids learned and are learning how to spell in all kinds of <br/>\n </span></blockquote>ways. Instant messaging, email, Myspace....the older 3 have gotten <br/>\nto the point where they care if things are spelled correctly.&gt;&gt;<br/>\n<br/>\nMy dd is 13, we&#39;ve only be at this for about a year.  She has always <br/>\nhad trouble with spelling (even though she has a wonderful <br/>\nvocabulary, I love to hear some of the words she uses sometimes!).   <br/>\nShe&#39;s been mostly play on-line games which involves typing in <br/>\nmessages to other players.   She says the other players have been <br/>\nbugging her from time to time about her inventive or shortcut <br/>\nspelling (some of that is just quicker in a fast paced game, &quot;u&quot; for <br/>\nyou etc).   She didn&#39;t seem to care much at first but just lately <br/>\nshe said she&#39;s been spelling more words correctly, not switching <br/>\nletters (heck, *I* do that when I&#39;m typing fast!) etc.   We IM each <br/>\nother sometimes just to chat, and I HAVE noticed her spelling is <br/>\nmuch improved.   Real life experience, not doing spelling workbooks <br/>\nor writing words over and over in order to learn them.<br/>\n<br/>\nLearning how words are spelled phonetically does NOT work for her.  <br/>\nShe&#39;s a visual spatial learner and needs to see the entire word, <br/>\nmake a picture of it in her mind then store it.  Quick retrieval <br/>\ndoes not happen, which is one of the reasons she was &quot;falling <br/>\nbehind&quot; in school.   Speed is not important, but learning things <br/>\nthat are important to her ARE.<br/>\nJann</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Spelling Woes","postDate":"1149732044","msgId":14166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGOTRGMERCLTIwQTAtNEQ1NC1CN0ZBLTVDQTYzRjlGQTA4RkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":14139,"nextInTopic":14169,"prevInTime":14165,"nextInTime":14167,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"... I just sent this post to my state group (apologies to those who are on both). I think it might be useful for those people who have kids who are reading","messageBody":"<div id=\"ygrps-yiv-2066699881\">On Jun 7, 2006, at 11:27 AM, Beth Mouser wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do kids learn to spell if they aren&#39;t learning spelling words or<br/>\n&gt; using a curriculum?  I imagine you are all going to tell me by<br/>\n&gt; reading and writing.  My son has always been an avid reader, but his<br/>\n&gt; spelling is still really bad and he hardly ever writes.<br/>\n<br/>\n </span></blockquote>I just sent this post to my state group (apologies to those who are  <br/>\non both). I think it might be useful for those people who have kids  <br/>\nwho are reading later than they might feel comfortable with - but, if  <br/>\nyou read down farther, there is also a part about my 15 yo daughter  <br/>\nand her spelling journey.<br/>\n<br/>\n<br/>\nI have three daughters - the first read at four and a half years old<br/>\nand LOVED to read, play word games, started writing her own stories<br/>\nat five, etc. She still writes and even runs writing workshops and<br/>\npoetry marathons at camps and where she works, etc.<br/>\n<br/>\nThe second learned to read all on her own at three years old - spent<br/>\na few weeks driving her older sister crazy by constantly asking her,<br/>\n&#39;What&#39;s this word? What&#39;s this word?&quot; and then she had it figured<br/>\nout. &quot;I&quot; didn&#39;t even know she could read - I wasn&#39;t expecting it,<br/>\nwasn&#39;t looking for it, and it apparently happened so fast that I<br/>\nmissed it. My neighbor is the one who told me - she brought Roxana<br/>\nback from playing at her house and said, &quot;I can&#39;t believe she reads<br/>\nlike that.&quot; I said, &quot;Hmmm, like what?&quot; She said, &quot;Well, she was<br/>\nreading to the other kids.&quot; I had NO idea. So later I gave her some<br/>\nbooks, ones we&#39;d never read together, and she read them. She&#39;s still<br/>\nvery very into words - at 18 she loves literature, linguistics,<br/>\netymology, theater, and anything else that has to do with words and<br/>\nwriting and will probably major in literature, in college. It is her<br/>\npassion.<br/>\n<br/>\nMy third child didn&#39;t learn to read until she was well into being<br/>\neight years old. She has a very very different learning style than<br/>\nthe other two and her focus was on other things. She&#39;s very physical<br/>\n- loves sports (has been on a swim team, played soccer since she was<br/>\nfour, rides horses, and now is very into karate - and she&#39;s always<br/>\nloved puzzles and games - especially strategy games and playing cards<br/>\n(including figuring odds) and role-playing games. As the years went<br/>\nby, she loved to listen to books and, as she got older, she got a<br/>\nlittle frustrated that she couldn&#39;t read. I reminded her that<br/>\neverybody is different and that she was learning all kinds of other<br/>\nthings and that reading would come, not to worry. I gave her some<br/>\nhelp - we played a lot of word games, especially while driving in the<br/>\ncar, but, to be honest, she really wasn&#39;t &quot;getting&quot; the idea of<br/>\nphonics and too much trying to play games based on phonics just got<br/>\nher extremely frustrated and we&#39;d back off immediately. Slowly,<br/>\nhowever, she built up a set of memorized words that she could easily<br/>\nrecognize. And she started trying to read words by guessing based on<br/>\nthe first letter and, a bit later, based on first and last letters.<br/>\nWe joined a theater group and she played the little Indian boy in &quot;A<br/>\nMidsummer Night&#39;s Dream.&quot; She carried the script with her all<br/>\nthroughout the early rehearsals, just like everyone else, but &quot;I&quot;<br/>\nknew she couldn&#39;t really read it. Night after night, she &quot;pretended&quot;<br/>\nto be following the script. Then, one day, I walked in the front door<br/>\nof our house and there she was, upside down, head on the floor, legs<br/>\nup over the back of the couch &lt;G&gt;, reading out loud from the<br/>\nMidsummer script, with GREAT expression, and reading ALL the parts,<br/>\nnot just her own. I thought - &quot;WOW - she&#39;s got quite a memory!!&quot; But<br/>\nI had been fooled again - she was really reading (with a lot of help<br/>\nfrom her memory of the show, of course). Somehow those weeks of<br/>\n&quot;pretending&quot; to follow along in the script had allowed her to break<br/>\nthe code - she &quot;got&quot; the idea and she could suddenly read. That<br/>\nability transferred over to all reading material. That was it - she<br/>\nread everything she could get her hands on. There were LOTS of words<br/>\nshe couldn&#39;t read, at first, because she didn&#39;t recognize them and<br/>\nstill wasn&#39;t &quot;sounding out&quot; well. But her reading improved super fast<br/>\nand within a few months she was reading as well as my other kids had<br/>\nbeen at eight years old - which was VERY advanced for their age -<br/>\nhigh school, college level - as well as most adults.<br/>\n<br/>\nBut, there is more - she STILL couldn&#39;t write anything that others<br/>\ncould understand because her spelling was SO poor. She couldn&#39;t<br/>\nconsistently spell common three-letter words correctly. She usually<br/>\ngot the right letters in the word, but added letters and mixed up the<br/>\norder in odd ways. She spelled the word, &quot;dear,&quot; as &quot;derar,&quot; or<br/>\n&quot;drenar,&quot; for example. Very far off - unreadable. And she had a habit<br/>\nof sticking the letter &quot;n&quot; into words, seemingly randomly. Her<br/>\nspelling problems continued for years - she was 13 years old and<br/>\nstill having trouble writing well enough for others to understand.<br/>\nShe wanted to do better, but I knew from my research that regular<br/>\nspelling lessons were not likely to be helpful. I read a book called,<br/>\n&quot;My Kid Can&#39;t Spell: Understanding and Assisting Your Child&#39;s<br/>\nLiteracy Development,&quot; by Richard Gentry. In that book, he talked<br/>\nabout a spelling disorder as a very distinct and separate thing from<br/>\nother learning disorders, and he gave a lot of ways to cope with it<br/>\nand to help a child or adult who really just can&#39;t spell. So, rather<br/>\nthan focus on her inability to spell and rather than banging our<br/>\nheads against the wall with spelling lessons, etc.,  I helped my<br/>\ndaughter learn some of those coping skills. She liked that because it<br/>\nhelped her function better, immediately. Then she got AIM and started<br/>\ntalking, online, to friends. Her spelling was still so bad people<br/>\ncouldn&#39;t understand her, but one of her &quot;coping skills,&quot; was to just<br/>\ntry again with a different possible spelling. Turned out that if she<br/>\nwrote a word a whole bunch of different possible ways, she could<br/>\nusually recognize the correct spelling when she saw it, even though<br/>\nshe couldn&#39;t just write it down correctly, the first time. So, if<br/>\nsomeone didn&#39;t understand her, she&#39;d just try again with a bit<br/>\ndifferent spelling. AND, she started to write stories - fan fiction -<br/>\nonline, too. For those she used spell checkers (which, as we all<br/>\nknow, only help so much), but, again, it was interesting that she<br/>\ncould nearly always pick the correct spelling out of the suggestions<br/>\nmade by the spell checker. Very slowly, her spelling was clearly<br/>\nimproving. She signed up for NANOWRIMO (National Novel Writing Month)<br/>\nand wrote a 50,000 word novel in 30 days. Spelling wasn&#39;t great but<br/>\nnot NEARLY as bad as I&#39;d thought it would be. She continued to write<br/>\nand chat with friends, online, and to read a lot. She did NANOWRIMO<br/>\nagain the next year. And after it was done, she went back and edited<br/>\nit and painstakingly checked spelling until every word was correct<br/>\nand Lulu press, a self-publishing company, published one copy of each<br/>\nbook completed by NANOWRIMO writers. So she got a lovely bound<br/>\npublished copy of her book. That was last November. She&#39;s 15. In the<br/>\nmonths since then, she&#39;s become an outstanding speller - she spells<br/>\neasily, now. She still asks, once in a while, to make sure she&#39;s<br/>\nright, but she nearly always IS right. Last night she wasn&#39;t sure if<br/>\nit should be &quot;resistance&quot; or &quot;resistence&quot; - but as soon as she asked<br/>\nout loud she said, &quot;Oh, never mind, I know now.&quot;<br/>\n<br/>\nI am SO glad that I didn&#39;t push her or insist on reading or spelling<br/>\nlessons. I truly do not believe it would have helped her, I think it<br/>\nwould have created a power struggle between us and the main lessons<br/>\nshe would have learned would have been, &quot;Learning is hard,&quot; and &quot;I&#39;m<br/>\nnot smart.&quot; Instead, I repeatedly pointed out the ways she WAS smart,<br/>\nsupported her in doing the things she was good at, the things she<br/>\nloved, and put a high value on those things. I reassured her over and<br/>\nover again, that reading would happen for her and I pointed out to<br/>\nher how different people were different in so many ways. It helped<br/>\nTREMENDOUSLY to have other families around who were also relaxed and<br/>\ncomfortable about later reading and who had kids who were later<br/>\nreaders. My daughter did read at 8, with isn&#39;t all that &quot;late&quot; - but<br/>\nit was when she was showing no signs of learning to read at 5, 6, and<br/>\n7, that things might have gone very differently, if I hadn&#39;t made the<br/>\ndecision to accept later reading as natural and normal &quot;for her.&quot;<br/>\n<br/>\nOther kids I know well were still not reading at 8, 9, 10, 11, and<br/>\neven 12 or 13. They now read, read very very well, love books, love<br/>\nlearning. As older teens, they are well-educated, well-informed, and<br/>\nwell-read kids. If you want to hear more about later readers and how<br/>\nwonderful it can be to support them in developing in their own way,<br/>\ncome to the Live and Learn conference and don&#39;t miss Dan Vilter&#39;s  <br/>\ntalk - his son is turning 17 next week, didn&#39;t read until<br/>\nvery much later than the norm - and Dan has a LOT of insight to share<br/>\nwith those who are concerned about their later-reading children.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265647787,"authorName":"jnjstau@hughes.net","from":"&quot;jnjstau@...&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Spelling Woes","postDate":"1149712659","msgId":14135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Mjg2Mjc5LjExNDk3MTI2NTk1ODkuSmF2YU1haWwuP0BmaDA1Ni5kaWEuY3AubmV0Pg=="},"prevInTopic":14134,"nextInTopic":14136,"prevInTime":14134,"nextInTime":14136,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":" My now 15 yo was never much good at spelling until she hit around 12 and","messageBody":"<div id=\"ygrps-yiv-1583023074\">&lt;&lt;How do kids learn to spell if they never learn spelling words or use a curriculum?&gt;&gt;<br/>\n<br/>\nMy now 15 yo was never much good at spelling until she hit around 12 and started emailing friends.  She became self-conscious and wanted to improve.  I showed her spell check to point out words she was mis-spelling and over time, the correct way to spell those words started to stick.  She just finished a writing class with kids who have done curriculum all their lives.  She handled it just fine.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Spelling Woes","postDate":"1149711051","msgId":14133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFENjA2QTc1LTRBNzQtNEYyNS04Q0VDLTJEQjM4MDkzNkM2M0Bjb3gubmV0Pg==","inReplyToHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":14131,"nextInTopic":14134,"prevInTime":14132,"nextInTime":14134,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"My son has aspergers. He will pick up up, it s okay. I imagine that at this point he winces every time your dh looks his written word, because he knows that","messageBody":"<div id=\"ygrps-yiv-1039741414\">My son has aspergers. He will pick up up, it&#39;s okay. I imagine that  <br/>\nat this point he winces every time your dh looks his written word,  <br/>\nbecause he knows that criticism will come. Is that maybe why he  <br/>\ndoesn&#39;t like to write? That&#39;s not a healthy way to live! If they hate  <br/>\ndoing workbooks, then why do they need to do them? What will they  <br/>\nlearn? Are they actually learning what&#39;s in there, or is the bigger  <br/>\nlesson that mom can force them to do such and so? Or that dad&#39;s  <br/>\napproval is based on what they produce, rather than on the innately  <br/>\ngood things about them? What&#39;s wrong with only writing lists? Does  <br/>\nyour son have a career already planned on writing? Perhaps he won&#39;t  <br/>\never need to write more than lists!! That&#39;s what billionaire  <br/>\npresidents and CEO&#39;s of companies do, write lists so that others can  <br/>\nmake some sense out of it! I will say that my son hates writing.  <br/>\nPrimarily because his disability makes the coordination necessary  <br/>\nvery difficult, secondly the brain isn&#39;t wired for the kind of fluent  <br/>\ncommunication required in writing essays.<br/>\n<br/>\nAs your dh is a writer, I&#39;m surprised he never uses spellcheck. Mine  <br/>\ndoes ;-) Spelling isnt&#39; learn by writing words over and over. Some of  <br/>\nit can be learned by learning the rules. But over the long run, it&#39;s  <br/>\nall about reading. He&#39;s only 12...his job or livelihood does not  <br/>\ndepend on his spelling, so give him time!!! I&#39;m 32, and I&#39;ve never  <br/>\npracticed spelling. What I do know that as I&#39;m typing, words look  <br/>\nwrong. That comes from reading (and having Josh kick my butt at  <br/>\nscrabble). Then I utilize tools to help me figure out how to do it  <br/>\nright. Computer spellcheck, dictionary, webster.com. I would say that  <br/>\nis more important, teaching him the tools that he has available, and  <br/>\nthen letting him know that it&#39;s not that big of a deal. Then let him  <br/>\npractice. I like how someone said that once spelling became important  <br/>\nto their teenager, then they figured it out.<br/>\n<br/>\nI hope you take this the right way. No one is criticizing, just  <br/>\noffering opinions and suggestions.<br/>\n<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 7, 2006, at 1:27 PM, Beth Mouser wrote:<br/>\n&gt; How do kids learn to spell if they aren&#39;t learning spelling words or<br/>\n&gt; using a curriculum? I imagine you are all going to tell me by<br/>\n&gt; reading and writing. My son has always been an avid reader, but his<br/>\n&gt; spelling is still really bad and he hardly ever writes. He has<br/>\n&gt; Asperger&#39;s and he enjoys writing lists. He makes lists of anything<br/>\n&gt; he is interested in...right now it is baseball teams and players.<br/>\n&gt; Spelling is a big deal to my husband because he writes for a local<br/>\n&gt; column everyday and he used to be a sports reporter on the local<br/>\n&gt; news.<br/>\n&gt;<br/>\n&gt; My boys hate doing the workbooks, even though they are minimal and<br/>\n&gt; should take an hour. But I struggle with stopping math and grammar.<br/>\n&gt;<br/>\n&gt; Any advice would be appreciated.<br/>\n&gt;<br/>\n&gt; Beth<br/>\n&gt; mom to 12 YO and 10 YO<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269501916,"authorName":"s_fulkerson@verizon.net","from":"&lt;s_fulkerson@...&gt;","profile":"fulkerson_family","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [unschoolingbasics] Spelling Woes","postDate":"1149710164","msgId":14139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0Nzg2NTY3LjEyMjc1MTE0OTcxMDE2NDc2My5KYXZhTWFpbC5yb290QHZtczA2NC5tYWlsc3J2Y3MubmV0Pg=="},"prevInTopic":14136,"nextInTopic":14166,"prevInTime":14138,"nextInTime":14140,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"Subject: Re: [unschoolingbasics] Spelling Woes Great to hear from you April!  I love all the unschooling stories and as my son is 15 it helps a lot to hear","messageBody":"<div id=\"ygrps-yiv-1666798963\">Subject: Re: [unschoolingbasics] Spelling Woes<br/>\n<br/>\nGreat to hear from you April!  I love all the unschooling stories and as my son is 15 it helps a lot to hear from a Mom of teens successfully living life without the school system.<br/>\n<br/>\nSherlyn<br/>\nJacob&#39;s Mom!</div>","specialLinks":[]},{"userId":225587235,"authorName":"sunsaltnsand","from":"&quot;sunsaltnsand&quot; &lt;sunsaltnsand@...&gt;","profile":"sunsaltnsand","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Spelling Woes","postDate":"1149708858","msgId":14136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4N2QwMWM2OGE2OSQ2M2U5MjIyMCQwNDAwYThjMEBTUGllcmN5Pg==","inReplyToHeader":"PDY4NWIyZjIwNjA2MDcxMjIyazU3M2Y5MjBkeTlkYmU5MWIxNjRhNDEwODBAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":14135,"nextInTopic":14139,"prevInTime":14135,"nextInTime":14137,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"You pretty much said what I was scared to say, since I m so new to the group ... well-liked and respected in his field (he s in the military) and he can t even","messageBody":"<div id=\"ygrps-yiv-560984675\">You pretty much said what I was scared to say, since I&#39;m so new to the group<br/>\n:-).  My DH is currently pursuing his graduate degree, is extremely<br/>\nwell-liked and respected in his field (he&#39;s in the military) and he can&#39;t<br/>\neven spell all the words right on a grocery list.  We laugh about it all the<br/>\ntime, sure, but I certainly don&#39;t think it holds him back in the least,<br/>\nother than having to hit &quot;spell-check&quot; more than the average person.<br/>\n<br/>\nJust my $.02 - take it or leave it, that&#39;s all it&#39;s worth :-).<br/>\n<br/>\n*shari* <br/>\n<br/>\n<br/>\nQUOTE:<br/>\nI think the real problem is your dh&#39;s attitude towards you and your children<br/>\nrather than your son&#39;s lack of spelling comprehension.  For some people<br/>\nspelling just isn&#39;t the end all be all.  Ask yourself why your dh doesn&#39;t<br/>\ntrust you with your children&#39;s upbringing and education.  Better yet, ask<br/>\nyour dh why he doesn&#39;t trust you with your children&#39;s upbringing and<br/>\neducation.  Has he even read anything about unschooling?  Has he been to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com\">http://www.sandradodd.com</a> and read the articles that many unschooling<br/>\nfamilies have shared?  How it really can work for *all* kids?</div>","specialLinks":[]},{"userId":253937257,"authorName":"April Morris","from":"&quot;April Morris&quot; &lt;klkb624@...&gt;","profile":"klkb624","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Spelling Woes","postDate":"1149708537","msgId":14131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFlMjZhNTcxMDYwNjA3MTIyOHUyNWI2NjdlcWEzZmRmODc1NTk1N2UwNDJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":14130,"nextInTopic":14133,"prevInTime":14130,"nextInTime":14132,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"My kids learned and are learning how to spell in all kinds of ways. Instant messaging, email, Myspace....the older 3 have gotten to the point where they care","messageBody":"<div id=\"ygrps-yiv-272341423\">My kids learned and are learning how to spell in all kinds of ways. Instant<br/>\nmessaging, email, Myspace....the older 3 have gotten to the point where they<br/>\ncare if things are spelled correctly. They each have their own methods for<br/>\nchecking. They can always ask me (which may or may not help), they love<br/>\nm-w.com, and they&#39;ll type into word for automatic corrections.  On-line<br/>\ngames are another area. These are all things that they do as part of life<br/>\nand those are the ways they learn. Some of their 4-H projects for Fair<br/>\nrequire writing and there&#39;s another way they get experience. Artificial<br/>\nwriting does nothing.  I can tell you from personal experience that years of<br/>\nspelling words and spelling tests did nothing for my spelling skills. I read<br/>\nall the time as a kid and that didn&#39;t help either. Spelling is just not<br/>\nsomething that comes naturally to me. I&#39;ve managed to survive quite nicely.<br/>\nAnd I&#39;m quite proficient with spell-check! :)<br/>\n-- <br/>\n~April<br/>\nMom to Kate-19, Lisa-17, Karl-15, & Ben-10.<br/>\n*REACH Homeschool Grp, an inclusive group in Oakland County<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.reachhomeschool.com\">http://www.reachhomeschool.com</a><br/>\n* Michigan Unschoolers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/michigan_unschoolers/\">http://groups.yahoo.com/group/michigan_unschoolers/</a><br/>\n*Check out Chuck&#39;s art www.artkunst23.com<br/>\n&quot;All we have to decide is what to do with the time that is given to us.&quot;<br/>\n  Gandalf the Grey<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/7/06, Beth Mouser &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mouser4@...\">mouser4@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;    I am a newbie here but I have been homeschooling for 5 years. I<br/>\n&gt; have thought about unschooling alot but my husband is against it.<br/>\n&gt; He gets upset when my now 12-YO son makes a ton of misspellings<br/>\n&gt; whenever he writes. I haven&#39;t pushed spelling much with my children<br/>\n&gt; and I try to unschool as much as possible. However, I do make them<br/>\n&gt; do Horizons math, EZ Grammar, and Wordly Wise for vocabulary. But<br/>\n&gt; that is about it. Sometimes when I think of it, I tell them to do a<br/>\n&gt; Rosetta Stone spanish lesson. My 12 YO has a spelling workbook, but<br/>\n&gt; I like him to do it later in the afternoon and he is only about 1/3<br/>\n&gt; of the way through it. My husband thinks I need to be more<br/>\n&gt; scheduled about the spelling.<br/>\n&gt;<br/>\n&gt; How do kids learn to spell if they aren&#39;t learning spelling words or<br/>\n&gt; using a curriculum? I imagine you are all going to tell me by<br/>\n&gt; reading and writing. My son has always been an avid reader, but his<br/>\n&gt; spelling is still really bad and he hardly ever writes. He has<br/>\n&gt; Asperger&#39;s and he enjoys writing lists. He makes lists of anything<br/>\n&gt; he is interested in...right now it is baseball teams and players.<br/>\n&gt; Spelling is a big deal to my husband because he writes for a local<br/>\n&gt; column everyday and he used to be a sports reporter on the local<br/>\n&gt; news.<br/>\n&gt;<br/>\n&gt; My boys hate doing the workbooks, even though they are minimal and<br/>\n&gt; should take an hour. But I struggle with stopping math and grammar.<br/>\n&gt;<br/>\n&gt; Any advice would be appreciated.<br/>\n&gt;<br/>\n&gt; Beth<br/>\n&gt; mom to 12 YO and 10 YO<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Spelling Woes","postDate":"1149708184","msgId":14130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2NzkybyszOWt0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":14129,"nextInTopic":14131,"prevInTime":14129,"nextInTime":14131,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"How about show DH Time magazine, the New York Times, his own newspaper, just about any large novel (and almost all the labels under the paintings in the Cowboy","messageBody":"<div id=\"ygrps-yiv-534005456\">How about show DH Time magazine, the New York Times, his own <br/>\nnewspaper, just about any large novel (and almost all the labels <br/>\nunder the paintings in the Cowboy Hall of Fame in OKC) ...there are <br/>\ninvariably at least half a dozen misspellings and/or misuses of <br/>\nwords (DH found one last night in a book he&#39;s reading, they used an <br/>\nm in &quot;scenario&quot; instead of an n.) If all these publications produced <br/>\nby professionals and ostensibly proofread at least once or twice can <br/>\nstill have spelling errors, he needs to cut a 12 yr old some slack.<br/>\n<br/>\nNow, as to what to do *for* (not *to*) your kids - remove the <br/>\nphysical issues from the writing/spelling. That is, let them go at <br/>\nit with email, word processing, IMing, online games (even a safe <br/>\nplace like NeoPets allows people to send messages to each other), <br/>\netc and uncouple the writing from the physical act of setting pen to <br/>\npaper (after all, I doubt your hubby writes his final drafts by <br/>\nhand). Most email programs as well as word processors allow you to <br/>\nconfigure it to automatically underline or highlight in some fashion <br/>\nanything it sees as misspelled. Ditto for grammatical questions.<br/>\n<br/>\nAnd, too, while it may be important to your hubby in his work, it is <br/>\nNOT the be all end all of life as we know it to be able to spell <br/>\ncorrectly in order to &quot;Be Successful&quot; (in the current cultural <br/>\nunderstanding of that word). I work with folks, with college <br/>\ndegrees, who are in management making upwards of $75K per year who <br/>\ncan&#39;t spell for beans. I happen to be a word person (that&#39;s why I <br/>\nnotice typos in all sorts of things) but I know that not everyone <br/>\nis. I come by it genetically (lol) - my dad has an NYU journalism <br/>\ndegree. My sister, however, same parents, same public schools right <br/>\nthrough, college degree and everything, is a hesitant speller at <br/>\nbest - she has to stop and think about things if it&#39;s not something <br/>\nshe uses all the time. However, she is a marvelous artist while I <br/>\ncan&#39;t even really draw a straight line without help. When/if it <br/>\nbecomes important for your son to communicate in writing of some <br/>\nform with others and he needs to spell better in order to <br/>\ncommunicate clearly, then and only then will he work on improving <br/>\nhis spelling.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Spelling Woes","postDate":"1149708121","msgId":14129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MDcxMjIyazU3M2Y5MjBkeTlkYmU5MWIxNjRhNDEwODBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":14128,"nextInTopic":14130,"prevInTime":14128,"nextInTime":14130,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"... Yes; I am going to say that they learn to spell from reading and writing. We are surrounded by words.  There are words everywhere!  Words are glorious.","messageBody":"<div id=\"ygrps-yiv-1234554031\">On 6/7/06, Beth Mouser &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mouser4@...\">mouser4@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; How do kids learn to spell if they aren&#39;t learning spelling words or<br/>\n&gt; using a curriculum?  I imagine you are all going to tell me by<br/>\n&gt; reading and writing.  My son has always been an avid reader, but his<br/>\n&gt; spelling is still really bad and he hardly ever writes.  He has<br/>\n&gt; Asperger&#39;s and he enjoys writing lists.  He makes lists of anything<br/>\n&gt; he is interested in...right now it is baseball teams and players.<br/>\n&gt; Spelling is a big deal to my husband because he writes for a local<br/>\n&gt; column everyday and he used to be a sports reporter on the local<br/>\n&gt; news<br/>\n<br/>\n<br/>\n </span></blockquote>Yes; I am going to say that they learn to spell from reading and writing.<br/>\nWe are surrounded by words.  There are words everywhere!  Words are<br/>\nglorious.  One of the problems with English is that we are a &quot;hob gob&quot;<br/>\nlanguage with roots from Gaelic, German, Latin, French, Spanish, and Greek<br/>\n(to name a few).  While we have some basic rules about spelling, we have no<br/>\nhard and fast rules.  Look at i before e except after c or in words like<br/>\nsociety, beige, and heifer!  I have two tools that I use often in writing.<br/>\nA dictionary and spell check!  Dan, my co-parent, is a brilliant computer<br/>\nprogrammer and network engineer.  Has one of those minds that soaks up<br/>\neverything he reads or hears.  Stores stuff for years and is able to recall<br/>\nthem long after he has stored it.  Can&#39;t spell worth carp ;-)  As an<br/>\nunschooler I would tell you to not get hung up about it.<br/>\n<br/>\nI think the real problem is your dh&#39;s attitude towards you and your children<br/>\nrather than your son&#39;s lack of spelling comprehension.  For some people<br/>\nspelling just isn&#39;t the end all be all.  Ask yourself why your dh doesn&#39;t<br/>\ntrust you with your children&#39;s upbringing and education.  Better yet, ask<br/>\nyour dh why he doesn&#39;t trust you with your children&#39;s upbringing and<br/>\neducation.  Has he even read anything about unschooling?  Has he been to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com\">http://www.sandradodd.com</a> and read the articles that many unschooling<br/>\nfamilies have shared?  How it really can work for *all* kids?<br/>\n<br/>\nMy boys hate doing the workbooks, even though they are minimal and<br/>\n<blockquote><span title=\"ireply\"> &gt; should take an hour.  But I struggle with stopping math and grammar.<br/>\n<br/>\n<br/>\n </span></blockquote>Ask yourself if you got anything from all the classes you took in school<br/>\nthat you hated doing.  Your boys are going to learn math and grammar as they<br/>\nneed math and grammar.  I&#39;m not sure if LeeAnn is on this list or not, but<br/>\nI&#39;ll share this story anyway.  LeeAnn&#39;s son was 13 when he asked his mom<br/>\nwhat this symbol (hmmm, can&#39;t find it on my keyboard - the division sign<br/>\nlittle - with two dots.)  OMG a 13yo doesn&#39;t know what a division sign is?<br/>\nLeeAnn told him it was a division sign and showed him how it effected<br/>\nnumbers.  Within a short time (I think it was like 30 minutes) her son was<br/>\nable to do quite complicated division - maybe even &quot;grade level&quot;  (gasp!)<br/>\nIt was because he was ready and had an interest.<br/>\n<br/>\nBTW, I have a very dear friend who is a journalist and columnist for my<br/>\nnewspaper.   She admitted that she couldn&#39;t spell worth squat.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Spelling Woes","postDate":"1149707765","msgId":14134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDYwNzE0NTIxNi4wMWIxNzk3MEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":14133,"nextInTopic":14135,"prevInTime":14133,"nextInTime":14135,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"... It might help your husband to understand that some people are spellers and some are not, and it doesn t matter whether they ve unschooled all their lives","messageBody":"<div id=\"ygrps-yiv-413972984\">At 14:27 6/7/2006, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He gets upset when my now 12-YO son makes a ton of misspellings<br/>\n&gt;whenever he writes.<br/>\n<br/>\n </span></blockquote>It might help your husband to understand that some people are <br/>\nspellers and some are not, and it doesn&#39;t matter whether they&#39;ve <br/>\nunschooled all their lives or went through a full plate of primary, <br/>\nsecondary, and post-graduate education.  I am a medical <br/>\ntranscriptionist, and I can tell you for certain:  Doctors cannot <br/>\nspell.  Doctors go through a ton of schooling, more than most folks, <br/>\nI guess, and they&#39;re generally pretty smart people, but every <br/>\ntranscriptionist knows that doctors generally can&#39;t spell, and if <br/>\nthey start spelling a word for you, DON&#39;T TRUST IT! (It is pretty <br/>\nentertaining, though!)  :-)<br/>\n<br/>\nMy brother had a full school career, including four years of college, <br/>\nand he emerged from that experience with very lousy spelling <br/>\nskills.  So, he uses a dictionary and a spell checker.  He&#39;s a very <br/>\nsuccessful entrepreneur, my brother is, and his inability to spell <br/>\nhas not hurt him or interfered with him at all.  I&#39;m a great speller <br/>\nand I&#39;m poorer than dirt!  ;-)<br/>\n<br/>\nPerhaps your husband needs to understand unschooling a little <br/>\nbetter?  Shaming your son about spelling is not likely to help him <br/>\nmaster it (or even want to)!!  In fact, it could have the opposite <br/>\neffect, but more likely it could damage the relationship your son and <br/>\nhusband have, and is spelling really worth that?<br/>\n<br/>\nSpelling can be helpful in effective communication.  To that end, if <br/>\nyour son (like my brother) wants to know that he is being understood, <br/>\nit will behoove him to spell words correctly.  If he understands that <br/>\nimportance, he will want to spell words correctly, and he&#39;ll pull <br/>\nthat together.  But, it may not be so important to him.  He may not <br/>\nneed to be a good speller right now.  If you can help your husband to <br/>\nlet that go, I bet everyone will be happier, including your husband!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._<br/>\n<br/>\nMarji<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gaiawolf.org/\">http://www.gaiawolf.org/</a>&gt;GaiaWolf<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://launch.groups.yahoo.com/group/GaiaWolf/\">http://launch.groups.yahoo.com/group/GaiaWolf/</a>&gt;Join the GaiaWolf Mailing List<br/>\n<br/>\n<br/>\n&quot;The animals of this world exist for their own reasons.  They were <br/>\nnot made for humans any more than blacks were made for whites or <br/>\nwomen created for men.&quot;<br/>\n~Alice Walker<br/>\n_.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":75406115,"authorName":"Beth Mouser","from":"&quot;Beth Mouser&quot; &lt;mouser4@...&gt;","profile":"mouser4983703","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Spelling Woes","postDate":"1149704844","msgId":14128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2NzVxYytrdnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":14129,"prevInTime":14127,"nextInTime":14129,"topicId":14128,"numMessagesInTopic":0,"msgSnippet":"I am a newbie here but I have been homeschooling for 5 years.  I have thought about unschooling alot but my husband is against it. He gets upset when my now","messageBody":"<div id=\"ygrps-yiv-1971201076\">I am a newbie here but I have been homeschooling for 5 years.  I <br/>\nhave thought about unschooling alot but my husband is against it.  <br/>\nHe gets upset when my now 12-YO son makes a ton of misspellings <br/>\nwhenever he writes.  I haven&#39;t pushed spelling much with my children <br/>\nand I try to unschool as much as possible.  However, I do make them <br/>\ndo Horizons math, EZ Grammar, and Wordly Wise for vocabulary.  But <br/>\nthat is about it.  Sometimes when I think of it, I tell them to do a <br/>\nRosetta Stone spanish lesson.  My 12 YO has a spelling workbook, but <br/>\nI like him to do it later in the afternoon and he is only about 1/3 <br/>\nof the way through it.  My husband thinks I need to be more <br/>\nscheduled about the spelling.<br/>\n<br/>\nHow do kids learn to spell if they aren&#39;t learning spelling words or <br/>\nusing a curriculum?  I imagine you are all going to tell me by <br/>\nreading and writing.  My son has always been an avid reader, but his <br/>\nspelling is still really bad and he hardly ever writes.  He has <br/>\nAsperger&#39;s and he enjoys writing lists.  He makes lists of anything <br/>\nhe is interested in...right now it is baseball teams and players.  <br/>\nSpelling is a big deal to my husband because he writes for a local <br/>\ncolumn everyday and he used to be a sports reporter on the local <br/>\nnews.  <br/>\n<br/>\nMy boys hate doing the workbooks, even though they are minimal and <br/>\nshould take an hour.  But I struggle with stopping math and grammar.<br/>\n<br/>\nAny advice would be appreciated.<br/>\n<br/>\nBeth<br/>\nmom to 12 YO and 10 YO</div>","specialLinks":[]}],"prevTopicId":14181,"nextTopicId":14291}}