{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":71198295,"authorName":"ckasse","from":"&quot;ckasse&quot; &lt;ckasse@...&gt;","profile":"ckasse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: new member with food question - thanks","postDate":"1373417373","msgId":49857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyaWIydCtscjA5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNzI5OTQwMTYuMjE5MjEuWWFob29NYWlsTmVvQHdlYjEyNTAwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":49856,"nextInTopic":0,"prevInTime":49856,"nextInTime":49858,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"what amazing responses I got. the ones I am sitting with now are that eczema is not life threatening, that I have made up rules somewhat haphazardly, that the","messageBody":"<div id=\"ygrps-yiv-1678121494\">what amazing responses I got. the ones I am sitting with now are that eczema is not life threatening, that I have made up rules somewhat haphazardly, that the changing and compulsion has given my son reasons to trust us less, etc. those were the most shoulder-shaking responses. I like being kicked in the butt (when of course I have asked for it). thanks!  have gotten confidence to try out new foods for him, put out cookies when he asks and even sometimes when he doesn&#39;t (also explaining that its fair to leave some for his siblings and maybe for tomorrow). yesterday he said, &quot;woah, after 7 cookies, I&#39;m done!&quot; it was glorious. <br/>\nwe will see what most recent allergy testing reveals with new doctor and go from there. <br/>\nthx all. <br/>\n-Carmiya</div>","specialLinks":[]},{"userId":4185092,"authorName":"cyberbreadbowl","from":"&quot;cyberbreadbowl&quot; &lt;jredwine@...&gt;","profile":"cyberbreadbowl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: new member with food question - long post","postDate":"1373395698","msgId":49856,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyaGx0aStjZ2Z0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtyOWVlcys2Y2ttQGVHcm91cHMuY29tPg=="},"prevInTopic":49855,"nextInTopic":49857,"prevInTime":49855,"nextInTime":49857,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"Sugar cravings can be a sign that the body isn t getting enough carbohydrates, or that there is yeast overgrowth, or that there are heavy metals, such as","messageBody":"<div id=\"ygrps-yiv-449673068\">Sugar cravings can be a sign that the body isn&#39;t getting enough carbohydrates, or that there is yeast overgrowth, or that there are heavy metals, such as mercury, in the system causing a gut dysbiosis. I am guessing that he might need to eat more. Have you thought about finding him more foods that he likes to eat to have first, before he gets so hungry that he is craving cookies? Is he still nursing? Breast milk is sweet, too. :)</div>","specialLinks":[]},{"userId":4185092,"authorName":"cyberbreadbowl","from":"&quot;cyberbreadbowl&quot; &lt;jredwine@...&gt;","profile":"cyberbreadbowl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: new member with food question - long post","postDate":"1373395265","msgId":49855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyaGxnMitpdDNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNzI5OTQwMTYuMjE5MjEuWWFob29NYWlsTmVvQHdlYjEyNTAwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":49854,"nextInTopic":49856,"prevInTime":49854,"nextInTime":49856,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"My son has some of the same issues -- he has eczema, and is allergic to a number of environmental allergens (cats, dogs, dust, etc.), although he does not have","messageBody":"<div id=\"ygrps-yiv-1298446770\">My son has some of the same issues -- he has eczema, and is allergic to a number of environmental allergens (cats, dogs, dust, etc.), although he does not have asthma. We talked about eliminating dairy and gluten (I am sensitive to them and have eosinophilic esophagitis, which can send me to the ER with a blocked esophagus if I&#39;m not careful). However, I had also heard that classical homeopathy can help, and I gave him the choice (he was 8 at the time) of either doing an elimination diet or seeing a homeopath (we already ruled out a conventional allergist, who would have tried to do skin tests and prescribe creams, which he hated). He chose the homeopath. We saw her for several sessions, and he took a constitutional remedy, and his eczema, which had been weeping and bleeding and causing him a lot of discomfort, practically disappeared. He still has occasional flare-ups, and I give him the same remedy, and it seems to help. <br/>\n<br/>\nHe is also quite anxious, which I attribute to both genetics and his health issues (he has sensory processing issues, as well, which mean that things like the blender, or dogs barking or kids yelling, can send him into fight or flight mode). The homeopathy did not change the anxiety, or help with any of the sensory issues, which I had been hoping, but the eczema relief was a great relief all by itself. He still consumes dairy and wheat and they don&#39;t seem to trigger it. We also moved to a rental that does not have carpet, and got rid of our fabric blinds, and that seems to help some too.<br/>\n<br/>\nFor what it&#39;s worth, he never has been big into sugar, although he does like fruit and ice cream. :) He hates cookies, cakes, and most bready things except for sourdough bread. He did have thrush pretty much constantly for the first 5 months of his life, so he is probably pretty yeasty. Strangely, I had asthma-like symptoms for several years, but they went away after he was born.<br/>\n<br/>\nJennifer<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Carmiya Weinraub &lt;ckasse@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; i am a new member to this listserve. i have 3 kids, ages 5.5 (girl), 4 (boy), and almost 2 (boy). we have always been unschoolers (though not radical unschoolers). what i want feedback on right *now* is the food issue, which i am exploring and considering changing (changing to a more hands off approach). my 4 year old son has asthma, eczema, and countless allergies (food, environment, bees, smells, playdoh).  this is an asthmatic kid who has been in the hospital 5-6 times in the last 2 years (3-4 times admitted, once for 2 weeks w/ pneumonia). he&#39;s only 4. we are so on edge about him. and he is a fearful kid, which makes sense cuz i think he&#39;s internalized our fear for him. it&#39;s so sad. he&#39;s also a creative, energy-filled, easily-laughing, highly communicative, very stubborn, endearingly sweet boy. <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new member with food question - long post","postDate":"1373295873","msgId":49854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2RkZCM0Y5LUQ5OTgtNDY2QS05NzA0LUM1QkQzQ0YxNDE5NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDIyOEFGODM4LTlDRjEtNDhGQy1CQTNCLUU5OTZERDc0OUYxQUBnbWFpbC5jb20+","referencesHeader":"PDIyOEFGODM4LTlDRjEtNDhGQy1CQTNCLUU5OTZERDc0OUYxQUBnbWFpbC5jb20+"},"prevInTopic":49851,"nextInTopic":49855,"prevInTime":49853,"nextInTime":49855,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"... Eczema isn t life threatening. And no one said leave it up to the child to make the connection. Offer information and choice in a safe environment. ... No","messageBody":"<div id=\"ygrps-yiv-388417027\">On Jul 7, 2013, at 8:48 PM, Robin Kibby wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With eczema its not always easy to make the connection between skin flares and the food you ate 4 hours ago. <br/>\n<br/>\n </span></blockquote>Eczema isn&#39;t life threatening.<br/>\n<br/>\nAnd no one said leave it up to the child to make the connection. Offer information and choice in a safe environment.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; it seems like you are asking a lot of a 4 year old.<br/>\n<br/>\n </span></blockquote>No one&#39;s asking the 4 yo to do anything. What&#39;s being suggested is to offer support, partnership and what humans of all ages appreciate: being able to make their own choices.<br/>\n<br/>\nIf that makes you still say &quot;Yes, but ...&quot; then you&#39;re hearing, &quot;Let him figure it out,&quot; when that&#39;s not being said at all. If that&#39;s the case it would be better to read for a while until you understand what is being said than to offer suggestions. This list *isn&#39;t* for all possible ideas about allergies. It&#39;s *just* to hear radical unschooling approaches. *Not* to limit list members to radical unschooling approaches but to keep the list focused on radical unschooling approaches to issues.<br/>\n<br/>\nIt sounds like he&#39;s affected by so many things. So, first, the parents can&#39;t be sure what the problem is so saying &quot;Don&#39;t eat this,&quot; could be wrong and will undermine his trust that his parents have any idea what they&#39;re talking about. And second, his body keeps changing so even if something bothers him today it might not be true later. The parents could be causing his body more stress with their control and worry than anything he&#39;s coming in contact with. Or at least making the reaction of his body worse.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":315074728,"authorName":"Robin Kibby","from":"Robin Kibby &lt;robinkibby@...&gt;","profile":"robinkibby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new member with food question - long post","postDate":"1373222893","msgId":49851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyOEFGODM4LTlDRjEtNDhGQy1CQTNCLUU5OTZERDc0OUYxQUBnbWFpbC5jb20+"},"prevInTopic":49849,"nextInTopic":49854,"prevInTime":49850,"nextInTime":49852,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"With eczema its not always easy to make the connection between skin flares and the food you ate 4 hours ago. However, a skin flare can create discomfort for","messageBody":"<div id=\"ygrps-yiv-1652893022\">With eczema its not always easy to make the connection between skin flares and the food you ate 4 hours ago. However, a skin flare can create discomfort for 1-2 weeks or longer if there&#39;s an infection. And this can interrupt the child&#39;s real job of playing and learning.<br/>\n<br/>\nWhile I&#39;d expect an older child to be able make the correlation between food and a delayed rash, it seems like you are asking a lot of a 4 year old.<br/>\n<br/>\nThe original poster said her health care provider advised against all processed sugar, and she often observes a direct negative reaction after consuming sugar.<br/>\n<br/>\nHowever, if the original poster is not worried about sugar (it sounds like you are not). Try placing your son &quot;in control&quot; of his cookie input. could he keep a food log using stickers?  Round stickers can represent cookie. And then if he&#39;s itchy or having trouble breathing later in the day (or not) he could put a happy or sad face next to his cookie tally. <br/>\n<br/>\nI encourage you to ask your health care provider as well. Maybe they have some constructive suggestions that will work within the framework of his diet needs.<br/>\n<br/>\nAll the best.<br/>\n- Robin</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: new member with food question - long post","postDate":"1373176469","msgId":49849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwRDRCNkRGLUVEMzUtNDZBMi1CMDlGLTMwODNFREI4MjcwM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDFFQUZFN0MzLUMyODgtNDA2My05RkMzLUI2Qjc0MEQxN0RENkBnbWFpbC5jb20+","referencesHeader":"PDFFQUZFN0MzLUMyODgtNDA2My05RkMzLUI2Qjc0MEQxN0RENkBnbWFpbC5jb20+"},"prevInTopic":49848,"nextInTopic":49851,"prevInTime":49848,"nextInTime":49850,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"... But why would you offer the idea on a list people come to to find out if there are suggestions *other than* restrictions and other conventional parenting","messageBody":"<div id=\"ygrps-yiv-581256993\">On Jul 6, 2013, at 10:59 PM, Robin Kibby wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Please don&#39;t bite my head off folks for suggesting restrictions...<br/>\n<br/>\n </span></blockquote>But why would you offer the idea on a list people come to to find out if there are suggestions *other than* restrictions and other conventional parenting approaches?<br/>\n<br/>\nPeople already know how to restrict and control. It&#39;s instinctual to use power to stop someone from doing something you don&#39;t want them to do.<br/>\n<br/>\nIt takes thought and understanding of relationships to be a child&#39;s partner, to be the one the child trusts to help them navigate the world. Children don&#39;t want someone who will grab the steering wheel to take them where the mom thinks it&#39;s best the child go. Children *also* don&#39;t want someone who will let them struggle through on their own. <br/>\n<br/>\nThis list isn&#39;t for stepping back from the child nor from stepping in front of the child. It&#39;s about walking along next to them, lending them power and knowledge so they can discover what works for them in ways that are respectful, safe, and doable as they explore.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But on the health front, I think we have to set clear boundaries for kids... Especially when dealing with allergies.<br/>\n<br/>\n </span></blockquote>Most parents would agree with you. Most parents have relationships where the kids only trust them so far *because* the parents can&#39;t figure out what else to do other than seize control and &quot;do what&#39;s best for them&quot;. *Many* kids learn from that to do what they want when the parents aren&#39;t watching because they know they can&#39;t trust their parents to be a reliable resource.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For me, when a treat causes tantrums it&#39;s not worth it.<br/>\n<br/>\n </span></blockquote>A tantrum might we worth it to the child. Or it might seem so! <br/>\n<br/>\nIt&#39;s also instinctual for people to want to make their own choices and fight against being controlled. Rather than a parent throwing up her hands and letting the child sort it out, she can point out  connections she&#39;s noticed. *Not* as hard fact -- because she might be wrong! (It&#39;s healthy to remain skeptical of your own certainty.) And children grow and change so what was true one week might not be true the next. But as information for the child to turn over as he or she makes a choice each time. They *might* decide some other factor is more important this time. They want to discover &quot;What happens if ...?&quot;<br/>\n<br/>\nKids also don&#39;t want to die. If a child has a life threatening allergy, a parent can help them check labels before they eat something. A parent can be factual with information rather than frightening.<br/>\n<br/>\nA temper tantrum is not life threatening. It&#39;s also not pleasant. But what&#39;s *really* not pleasant is having someone you love and trust make decisions for you and erect barriers rather than finding ways to be a partner. *Sometimes* eating something and feeling yucky might be worth it. But the child can&#39;t make that decision each time unless they&#39;ve been supported in making choices.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new member with food question - long post","postDate":"1373171260","msgId":49848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyYXFucytuZWNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFQUZFN0MzLUMyODgtNDA2My05RkMzLUI2Qjc0MEQxN0RENkBnbWFpbC5jb20+"},"prevInTopic":49847,"nextInTopic":49849,"prevInTime":49847,"nextInTime":49849,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"... ********** Absolutely find foods you And your kids can feel good about... but don t get bogged down thinking that s The Solution. Unschooling isn t about","messageBody":"<div id=\"ygrps-yiv-1348092073\">Robin Kibby &lt;robinkibby@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you find some treats you are comfortable with and are less problematic on the volume?<br/>\n </span></blockquote>**********<br/>\n<br/>\nAbsolutely find foods you And your kids can feel good about... but don&#39;t get bogged down thinking that&#39;s The Solution. Unschooling isn&#39;t about Solutions in that sense, its about learning - and learning involves exploring options, building a toolbox of skills, asking questions, challenging your own certainty, and taking risks. Learning doesn&#39;t stop just because mom has a great idea - kids aren&#39;t often satisfied with mom&#39;s one great idea, they want to do the work of learning. That&#39;s the amazing thing about the way people learn - we Want to do the work of learning and aren&#39;t satisfied to have knowledge handed to us on a platter. <br/>\n<br/>\nSpeaking of platters... here&#39;s a page of different ideas for &quot;monkey platters&quot; - mixed plates of food. The idea started out as being finger food for busy kids - really good idea for kids who tend to forget to eat until they&#39;re too hungry to make any kind of decision - and has kind of taken off to be any kind of mixed plate, a way to offer kids options with no strings and see what they pick:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/monkeyplatter\">http://sandradodd.com/eating/monkeyplatter</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; For me, when a treat causes tantrums it&#39;s not worth it.<br/>\n<br/>\n </span></blockquote>Here&#39;s the catch, though - what about when saying No causes fights, tantrums from kids trying to get what they want, tantrums from adults trying to win the argument, ongoing stress which leads kids to be mean to siblings, be pissy with parents, and (as kids get older) deliberately engage in destructive behavior as a way of feeling in control or &quot;getting back&quot; at parents? <br/>\n<br/>\nHealth issues can be iffy... but stress is real, fighting is real, and it doesn&#39;t make kids better or families stronger. It doesn&#39;t help anything. It doesn&#39;t make kids healthier.<br/>\n<br/>\nOne of the fascinating things about unschooling is getting to watch kids when they aren&#39;t using up a ton of energy trying to get what they want. They&#39;re nicer to parents and other kids. They&#39;re more thoughtful. A lot of &quot;behavior problems&quot; Go Away when parents say Yes more and life gets easier, sweeter, and less stressful. <br/>\n<br/>\nOne way to think about whole life unschooling is to ask: how can I make my child&#39;s life easier? <br/>\n  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It&#39;s right to follow your naturopaths advice if its helping your son feel healthier.<br/>\n </span></blockquote>************<br/>\n<br/>\nKids want what makes them feel healthier. They&#39;re not alien creatures who want to feel crappy ;) The thing is, arguing doesn&#39;t feel healthy. Being told  you can&#39;t learn about the world, that you need to keep your life small to be &quot;safe&quot; doesn&#39;t feel healthy - it can feel like  a great weight pressing you down. What kids learn depends on how they feel about things. If they feel like parents are helping them get what they value (what the kids value), then that&#39;s one thing... but a lot of the time &quot;that&#39;s not good for you&quot; doesn&#39;t feel that way to the kid. It can feel like &quot;what you want isn&#39;t important, you&#39;re just a kid.&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I think you are smart to<br/>\n&gt; Have the whole family follow the same routine.<br/>\n<br/>\n </span></blockquote>It&#39;s only smart if it&#39;s helpful for everyone in the family. If it makes kids&#39; lives easier as well as mom&#39;s.<br/>\n<br/>\nEveryone in my family has different needs where food is concerned. We all have different sensitivities. My partner can&#39;t eat legumes. My stepson has candida issues. My daughter has sensory issues. I have migraine triggers. Half of us are vegetarian, the other half do better with meat in their diets. Having one way of doing things for the whole family wouldn&#39;t make any sense at all. <br/>\n<br/>\nDoing things the same for everyone is a leftover bit of school in your head - a bureaucratic solution to deal with large groups of people. Home gets to be better than that - that&#39;s one of the advantages of Keeping kids home, is that you can deal with each person as an individual with unique needs, interests, and feelings.<br/>\n<br/>\nDoing things the same wrt food can also be a setup for moms getting their feelings hurt - lots of moms put a lot of love and care into making good food... and it sucks to feel unappreciated for that outpouring of energy. Don&#39;t set yourself up to get hurt! Set yourself up to feel good about the time and care  you&#39;re giving by making sure you&#39;re giving the people you love what They want, what they&#39;ll appreciate. It&#39;s not more effort to cook differently for everyone in the family, but it&#39;s a different kind of logistical puzzle than what most moms are raised to. If you can think of it in those terms - a puzzle, rather than an attack on who you are as a mom - then it&#39;s easier to change your routines to meet your families needs. When you can meet your families needs better, your own needs As A Mom get met better - so you win and they win. Life gets sweeter. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But on the health front, I think we have to set clear boundaries for kids... Especially when dealing with allergies.<br/>\n </span></blockquote>***********<br/>\n<br/>\nLife has limits. The conventional parenting &quot;wisdom&quot; is to use limits as end-points. You have an allergy. You&#39;re too little. I said no.<br/>\n<br/>\nBut limits can be starting places for thoughtfulness and creativity. They can be challenges to work around, walls to knock down, mountains to climb, practices to question, chances to learn more, chances to grow. That&#39;s the magic of unschooling, and it starts by questioning every &quot;have to&quot; - why do you &quot;have to&quot;? Can you stretch and re-examine, create and explore and find another way? Far too often, parents fall back on Have Tos and Boundaries rather than thinking, wondering, and learning.    <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":315074728,"authorName":"Robin Kibby","from":"Robin Kibby &lt;robinkibby@...&gt;","profile":"robinkibby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new member with food question - long post","postDate":"1373144393","msgId":49847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFQUZFN0MzLUMyODgtNDA2My05RkMzLUI2Qjc0MEQxN0RENkBnbWFpbC5jb20+"},"prevInTopic":49845,"nextInTopic":49848,"prevInTime":49846,"nextInTime":49848,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"Hi. I don t usually post here, since I am just shopping around for schooling options (not an unschooler yet) , but we have a similar scenario re: the health","messageBody":"<div id=\"ygrps-yiv-1127235869\">Hi. <br/>\n<br/>\nI don&#39;t usually post here, since I am just shopping around for schooling options (not an unschooler yet) , but we have a similar scenario re: the health issues, eczema and food allergies.<br/>\n<br/>\nIt&#39;s right to follow your naturopaths advice if its helping your son feel healthier. It&#39;s so frustrating when there are varied triggers. But if there&#39;s one that you observe consistently (like sugar), it should be avoided.  You can at least keep him happy/comfortable on that front.<br/>\n<br/>\nCan you find some treats you are comfortable with and are less problematic on the volume?. Unsweetened Popsicles come to mind. We also get those clif bar fruit roll ups and save those for treats, as well as dried fruit, but maybe that would lead to quantity problems as well. I haven&#39;t made them, but applesauce sweetened muffins might fill the need as well. My son loves sunbutter (the kind with sugar added) so that is a treat as well.<br/>\n<br/>\nI think you are smart to<br/>\nHave the whole family follow the same routine.<br/>\n<br/>\nWe still have the occasional cupcake and cookie, or scoop of coconut ice cream but its not a daily routine. I often notice an eczema flare up with the chocolate and sugar.<br/>\n<br/>\nPlease don&#39;t bite my head off folks for suggesting restrictions... But on the health front, I think we have to set clear boundaries for kids... Especially when dealing with allergies.<br/>\n<br/>\nFor me, when a treat causes tantrums it&#39;s not worth it.<br/>\n<br/>\nBest<br/>\n- Robin</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new member with food question - long post","postDate":"1373125916","msgId":49845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyOWVlcys2Y2ttQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNzI5OTQwMTYuMjE5MjEuWWFob29NYWlsTmVvQHdlYjEyNTAwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":49843,"nextInTopic":49847,"prevInTime":49844,"nextInTime":49846,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"but when we have cookies around (we only buy the kind he can have, which are these enjoy life or trader joe s brands that are free of the 8 common","messageBody":"<div id=\"ygrps-yiv-605310087\">but when we have cookies around (we only buy the kind he can have, which are these &quot;enjoy life&quot; or trader joe&#39;s brands that are free of the 8 common allergens), i say he can have 3 a day. everyone is on the same rule. basically i just made it up, it&#39;s based on nothing, not even serving size, just on my worries about brown sugar and dried fruit, which are the sweeteners used in the cookies. for the REST of the day he asks for more cookies. more cookies. more cookies. when he&#39;s upset at me about something he says, &quot;i&#39;m going to get down the cookies and eat more!&quot; if we are out of cookies he tells me to &quot;get in the car right now and go get them!&quot; he sees it as a power<br/>\n<blockquote><span title=\"ireply\"> &gt;  thing, which it&#39;s hard to admit but it is. <br/>\n<br/>\n </span></blockquote>****Yes, it is. So stop doing it. You see what it is -- an arbitrary rule, based on nothing. <br/>\n<br/>\nMaybe try something like this since this has been built up into such a big issue: &quot;Here&#39;s a box of cookies. This is what we have. I am not going to the store again until 3 days from now. Let&#39;s figure out how to eat them so we can enjoy them.&quot; <br/>\n<br/>\nMaybe your son will eat ten cookies. Maybe he will eat one and save his share of the box. Maybe he won&#39;t want to share evenly. Maybe you can do without cookies. <br/>\n<br/>\nRinse and repeat and help him notice if he feels better when he eats one cookie or ten cookies. Make some cookies. See which taste better and feel better -- store bought or home-made. <br/>\n<br/>\nStop making up arbitrary rules about food. Catch yourself when you do. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nsee, i think i&#39;m watching out for his health. i am scared to just go free-for-all on the cookies, because of his inflammation/asthma. but it&#39;s also worry that the more sugar the children have, the more difficult my children are to be around. i know that i am more difficult to be around when i eat sugar, and i go through phases limiting my sugar to help improve my mood and relationships. it works wonders. so i also believe that my children are more well behaved when they are &quot;off&quot; sweets. that&#39;s the story my husband and i follow - other families don&#39;t know/see/believe/follow/agree w/ that story, but that&#39;s how we see the world. so thinking of going hands off for sweets (the ones he can have, like organic lollipops and these cookies and honey and dried fruits) makes me worry that i won&#39;t be able to handle his emotional outbursts. <br/>\n<br/>\n<br/>\n***If he&#39;s not having to fight to get a cookie, maybe he&#39;ll be more pleasant to be around. <br/>\n<br/>\nAnd maybe you and your husband need to rethink the whole sugar issue. Restricting it -- outside of real health issues -- may be creating more problems than is justified by the &quot;story.&quot; <br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new member with food question - long post","postDate":"1373046350","msgId":49843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyNzBvZSs5aGdAZUdyb3Vwcy5jb20+","inReplyToHeader":"PDEzNzI5OTQwMTYuMjE5MjEuWWFob29NYWlsTmVvQHdlYjEyNTAwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":49842,"nextInTopic":49845,"prevInTime":49842,"nextInTime":49844,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"... ************* It will certainly take some different skills on your part than the daily arguments over food. Sometimes that s the most daunting thing about","messageBody":"<div id=\"ygrps-yiv-770182088\">Carmiya Weinraub &lt;ckasse@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;really just one worry: will i be able to handle the unknown bad consequence.<br/>\n </span></blockquote>*************<br/>\n<br/>\nIt will certainly take some different skills on your part than the daily arguments over food. Sometimes that&#39;s the most daunting thing about whole life unschooling - you know what fighting with your kids looks and feels like, it&#39;s normal and you&#39;ll get lots of support from people around you. It&#39;s challenging to shift the dynamics so that adversity is no longer the center of the relationship. That&#39;s one of the reasons seasoned unschoolers advise Not dropping all your rules at once, but going more slowly, saying yes more and more, so you have time to learn new skills as you go. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;basically, we can&#39;t keep up with his changing reactions and we don&#39;t know all of the things that cause him to react. it makes life worrisome and anxiety-producing for all of us.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSaying yes more isn&#39;t really going to make that worse. It could even make things better because you&#39;ll have more &quot;data&quot; for comparison purposes. Your son doesn&#39;t want to feel bad, but when the information he has is so random then choices seem no more or less informed than superstition. So help him experiment and gain more information. The goal isn&#39;t to have a &quot;free for all&quot; it&#39;s to realize that kids Want to learn about the world and their own bodies, want to learn so much that their willing to take some risks. So help your son explore by helping with risk management - not Eliminating risks (which isn&#39;t possible anyway) but helping him analyze the choices he&#39;s made so he can use those experiences to inform future choices. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;i know that i am more difficult to be around when i eat sugar, and i go through phases limiting my sugar to help improve my mood and relationships. it works wonders.<br/>\n </span></blockquote>************<br/>\n<br/>\nYou go through phases - so there are times when you choose to have more sugar, right? My partner is like that with coffee. He knows how it affects him, but he goes through phases where he drinks a lot of it anyway. Adults do things like that - certainly adults who have had food controls in the past do. So controlling what your kids eat isn&#39;t going to set them up to have better habits. Will giving them more choices now help them have better habits? I don&#39;t know. I do know that it will give you And your kids the chance to learn a new set of skills: how to deal with the kind of roller-coaster feelings that run in your family. That&#39;s important. <br/>\n<br/>\nSaying yes more will help that by reducing a source of stress in your family. Saying yes more in general - figuring out how to support multiple interests and desires - will also help in that regard, by opening up more avenues for kids to explore. Kids are happier when they&#39;re busy learning! But it&#39;s not enough to go &quot;hands off&quot; - be an active partner as your kids explore the world. If you have a kid who loves cookies, make cookies with him! Explore food in ways that are very hands-on and personal, and have fun with it! Let food be something you play with together, rather than argue over. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":71198295,"authorName":"Carmiya Weinraub","from":"Carmiya Weinraub &lt;ckasse@...&gt;","profile":"ckasse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"new member with food question - long post","postDate":"1372994016","msgId":49842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzI5OTQwMTYuMjE5MjEuWWFob29NYWlsTmVvQHdlYjEyNTAwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":49843,"prevInTime":49841,"nextInTime":49843,"topicId":49842,"numMessagesInTopic":0,"msgSnippet":"i am a new member to this listserve. i have 3 kids, ages 5.5 (girl), 4 (boy), and almost 2 (boy). we have always been unschoolers (though not radical","messageBody":"<div id=\"ygrps-yiv-539381642\">i am a new member to this listserve. i have 3 kids, ages 5.5 (girl), 4 (boy), and almost 2 (boy). we have always been unschoolers (though not radical unschoolers). what i want feedback on right *now* is the food issue, which i am exploring and considering changing (changing to a more hands off approach). my 4 year old son has asthma, eczema, and countless allergies (food, environment, bees, smells, playdoh).  this is an asthmatic kid who has been in the hospital 5-6 times in the last 2 years (3-4 times admitted, once for 2 weeks w/ pneumonia). he&#39;s only 4. we are so on edge about him. and he is a fearful kid, which makes sense cuz i think he&#39;s internalized our fear for him. it&#39;s so sad. he&#39;s also a creative, energy-filled, easily-laughing, highly communicative, very stubborn, endearingly sweet boy. <br/>\n<br/>\nso, about food. i have learned, through our search for alternative medicine care for him, that sugar leads to inflammation. he is allergic to yeast (in his own body even)  and sugar/inflammation leads to yeast. his body responds to allergies with asthma attacks, but also in other ways (like just today his right eye swelled so much and we gave him drops and benadryl.) we have no idea what caused it. was it the watermelon, which used to make his face itch but then that went away? was it helping daddy vaccuum inside the radiator and all the dust? no clue. but he does love benadryl. he actually said, &quot;i wish i could have this even when my eye isn&#39;t swollen. basically, we can&#39;t keep up with his changing reactions and we don&#39;t know all of the things that cause him to react. it makes life worrisome and anxiety-producing for all of us. also he scratches so much. the other day i was interviewing a babysitter and she asked if my son had lice and i was like, &quot;oh<br/>\n you mean cuz he&#39;s scratching his head? no, if he had lice he&#39;d have had lice for 4 years. he&#39;s always been like that.&quot;<br/>\n<br/>\n<br/>\nour naturopath says that my son should have very limited sugar (like NONE of the white/brown kind and limited fruit and no dried fruit or freeze dried fruit). i gave up the fresh fruit issue which took a toll on my relationship with him, and immediately, my relationship with my son improved. but when we have cookies around (we only buy the kind he can have, which are these &quot;enjoy life&quot; or trader joe&#39;s brands that are free of the 8 common allergens), i say he can have 3 a day. everyone is on the same rule. basically i just made it up, it&#39;s based on nothing, not even serving size, just on my worries about brown sugar and dried fruit, which are the sweeteners used in the cookies. for the REST of the day he asks for more cookies. more cookies. more cookies. when he&#39;s upset at me about something he says, &quot;i&#39;m going to get down the cookies and eat more!&quot; if we are out of cookies he tells me to &quot;get in the car right now and go get them!&quot; he sees it as a power<br/>\n thing, which it&#39;s hard to admit but it is. see, i think i&#39;m watching out for his health. i am scared to just go free-for-all on the cookies, because of his inflammation/asthma. but it&#39;s also worry that the more sugar the children have, the more difficult my children are to be around. i know that i am more difficult to be around when i eat sugar, and i go through phases limiting my sugar to help improve my mood and relationships. it works wonders. so i also believe that my children are more well behaved when they are &quot;off&quot; sweets. that&#39;s the story my husband and i follow - other families don&#39;t know/see/believe/follow/agree w/ that story, but that&#39;s how we see the world. so thinking of going hands off for sweets (the ones he can have, like organic lollipops and these cookies and honey and dried fruits) makes me worry that i won&#39;t be able to handle his emotional outbursts. <br/>\n<br/>\nwhich means my worries are two fold: his asthmatic and other allergic reactions, and my ability to handle his rollercoaster sugar-induced emotions. which is really just one worry: will i be able to handle the unknown bad consequence.<br/>\n<br/>\nshake my shoulders and tell me what to do. but please be gentle and understanding that the diet leading to asthma thing is very worrisome for me...<br/>\n-carmiya<br/>\nbronx, ny<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49850,"nextTopicId":49858}}