{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fostering Kittens","postDate":"1170032508","msgId":21097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwamgxcys0dmhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDU5NkIwLTU3NTMtNEI2Ny05Qzc0LUFCMDI4MjcwNTBCMkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":21093,"nextInTopic":21125,"prevInTime":21096,"nextInTime":21098,"topicId":21048,"numMessagesInTopic":0,"msgSnippet":"... themselves at your legs. It s like having cactuses thrown at you several times a day. Here s a math question: If you have five kittens and they each throw","messageBody":"<div id=\"ygrps-yiv-538512248\">Joyce Fetteroll &lt;fetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; They have needle sharp claws and teeth and they will launch  <br/>\n </span></blockquote>themselves at your legs. It&#39;s like having cactuses thrown at you  <br/>\nseveral times a day. Here&#39;s a math question: If you have five kittens<br/>\nand they each throw themselves at you five times a day and the <br/>\nprocess keeps up for three weeks, how many cactuses have you been hit<br/>\nwith total? ;-)&gt;&gt;<br/>\n<br/>\nLOL!  I&#39;ve sat among many kittens before and know exactly what you&#39;re <br/>\ntalking about (not just on legs, also back, arms etc)!<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I thought it would be hard to let them go, but after all that <br/>\n </span></blockquote>you&#39;re ready to be cactus and poop free ;-)&gt;<br/>\n<br/>\nI keep thinking I&#39;d have a hard time letting them go (well, there are <br/>\nalways certain animals that you bond with more than others) but I can <br/>\nsee your point!<br/>\n <br/>\nThanks for sharing Joyce!   We&#39;re not in a rush, still exploring and <br/>\nwant to do it only if it&#39;s a good fit and the time is right!<br/>\nJann</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fostering Kittens","postDate":"1170003235","msgId":21093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwaWtmMys4NjhmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxZTkwMWM3NDIwYSQ1ZTNkYzBjMCQwMzY0YThjMEBBbGx5c29uPg=="},"prevInTopic":21065,"nextInTopic":21097,"prevInTime":21092,"nextInTime":21094,"topicId":21048,"numMessagesInTopic":0,"msgSnippet":"Allyson Carter  wrote: Allyson, Thank you for your very in depth response!  It was exactly the kind of detail I was looking for. Last year we","messageBody":"<div id=\"ygrps-yiv-81178937\">&quot;Allyson Carter&quot; &lt;acarter@...&gt; wrote:<br/>\n Allyson,<br/>\nThank you for your very in depth response!  It was exactly the kind <br/>\nof detail I was looking for.<br/>\n<br/>\nLast year we went a few times to the home of a man who fosters <br/>\nkittens (MANY of them, it&#39;s a bit out of control), working with the <br/>\nlocal shelter and recommended by a friend.  He was looking for other <br/>\npeople to help socialize the kittens.  It was a perfect way to start <br/>\nwithout all the responsibility and we got a taste of what it <br/>\nentails.  But for reasons unknown he doesn&#39;t want any more help and I <br/>\nhaven&#39;t pushed it.   He works with a local shelter (closer to him, <br/>\nit&#39;s about 25 mins from us).   I was thinking of talking to our vet <br/>\n(which is where we got our wonderful cat!) as they (not sure if they <br/>\nstill do this) have in the past had cats and kittens on &quot;display&quot; in <br/>\nthe waiting area for adoption (which is how we got ours).  It&#39;s <br/>\ncloser and we would have the support, if in fact they even do <br/>\nanything like this where they need people willing to foster.<br/>\n<br/>\nWe&#39;re still exploring - thanks again!  Your info helped a lot!<br/>\nJann</div>","specialLinks":[]},{"userId":186424106,"authorName":"Allyson Carter","from":"&quot;Allyson Carter&quot; &lt;acarter@...&gt;","profile":"allyvron33","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fostering Kittens","postDate":"1169899069","msgId":21065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZTkwMWM3NDIwYSQ1ZTNkYzBjMCQwMzY0YThjMEBBbGx5c29uPg==","referencesHeader":"PGVwYzBnNStxMGhuQGVHcm91cHMuY29tPg=="},"prevInTopic":21061,"nextInTopic":21093,"prevInTime":21064,"nextInTime":21066,"topicId":21048,"numMessagesInTopic":0,"msgSnippet":"Jann, We foster kittens at home, but my situation is slightly different than most foster homes, since I work at the shelter, too. Each shelter or rescue is","messageBody":"<div id=\"ygrps-yiv-261377360\">Jann,<br/>\nWe foster kittens at home, but my situation is slightly different than most foster homes, since I work at the shelter, too.<br/>\nEach shelter or rescue is different, so I would talk to a few of them before deciding who you want to work with first.  Find out what kinds of kittens they send into foster care - moms with litters? sick? injured? orphans you need to bottle raise (TONS of work IME)?  What are their policies on adoption?  How long does a cat stay at the shelter before they&#39;re adopted?  What is their return rate like? (unsatisfied adopters?)  What happens to those cats then?<br/>\n<br/>\nMy shelter usually only sends moms with litters or sick kittens into foster care - we have enough space in our building that we don&#39;t need to send healthy kittens out.  Some smaller shelters or rescues may not have enough space though, so they might foster for that reason as well.<br/>\nAnother thing to find out is what kind of support they&#39;ll give you - can you call them with questions?  Can you take a kitten to the vet if there&#39;s something wrong?  Will they provide food, litter, toys, medicine, formula?  <br/>\n<br/>\nAt home, little kittens need a smaller, confined space so you can keep track of them (and they can find their litter box!)  You don&#39;t want a kitten stuck behind a fridge or something.  They need lots of interaction with people (I&#39;m sure that won&#39;t be a problem!) and their health needs to be monitored closely.  It&#39;s very common for shelter kittens to come down with Upper Respiratory Infection - basically a cat cold - but it can become serious to a little one.  Keep track of all sneezing, sniffles, and such - and also appeitite, diarreah, change in activity, etc.<br/>\n<br/>\nAlso, please be aware that sometimes kittens become very ill and even die in foster care.  I&#39;ve only had one die at my house (unexpectedly - probably distemper), but it does sometimes happen, even to the best foster homes.  It&#39;s rare, but good to be aware of it... I think my dd would have a really hard time if one of our kittens died.  She was not born yet when the one I mentioned previously died.<br/>\n<br/>\nRight now, we&#39;ve got three crazy 7 week old kittens in Veronica&#39;s bedroom.  They climb everything, and have knocked things off shelves, brought down curtains, tipped over baskets, and stolen food off of dd&#39;s plate while she went to the bathroom!  All that said, though, my dd derives such joy from fostering.  It&#39;s truly a wonderful experience for all of us.  It&#39;s hard to send them back to the shelter... no matter how many times you say to yourself, &quot;they&#39;re not staying, they&#39;re not ours to keep, don&#39;t get attached,&quot; LOL of course you do.  And I have it easier than most people, because I can look over the applications and make sure my babies are going to a good home! <br/>\n<br/>\nThat&#39;s why its important to get to know the organization, and believe in what they&#39;re doing.  At the end, it will make the separation that much easier - you can trust that they will find wonderful forever homes. <br/>\nI hope that answered some of your questions.  If you have any more, let me know.<br/>\nMaybe someone else will chime in here, too - I&#39;m sure everyone&#39;s foster experiences are different.<br/>\n<br/>\nAllyson<br/>\nMom to Veronica, 6<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fostering Kittens","postDate":"1169898997","msgId":21061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDU5NkIwLTU3NTMtNEI2Ny05Qzc0LUFCMDI4MjcwNTBCMkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGVwYzBnNStxMGhuQGVHcm91cHMuY29tPg==","referencesHeader":"PGVwYzBnNStxMGhuQGVHcm91cHMuY29tPg=="},"prevInTopic":21048,"nextInTopic":21065,"prevInTime":21060,"nextInTime":21062,"topicId":21048,"numMessagesInTopic":0,"msgSnippet":"... If they re still with their mother, you ll find out that they aren t as clean as adult cats ;-) While they will use the litter box they aren t good at","messageBody":"<div id=\"ygrps-yiv-931025943\">On Jan 25, 2007, at 11:36 PM, jlh44music wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know I&#39;ve seen posts here about fostering kittens.   My dd is<br/>\n&gt; interested in possibly doing this and I&#39;m curious to hear of other&#39;s<br/>\n&gt; experiences, things we should know (or &quot;things I wish they&#39;d told me<br/>\n&gt; before I decided to do this!), books or websites that are helpful,  <br/>\n&gt; etc.<br/>\n&gt; Thanks!<br/>\n<br/>\n </span></blockquote>If they&#39;re still with their mother, you&#39;ll find out that they aren&#39;t  <br/>\nas clean as adult cats ;-) While they will use the litter box they  <br/>\naren&#39;t good at covering and will frequently step in it as they try  <br/>\nvarious techniques for covering and they&#39;ll track it out into the room.<br/>\n<br/>\nThey have needle sharp claws and teeth and they will launch  <br/>\nthemselves at your legs. It&#39;s like having cactuses thrown at you  <br/>\nseveral times a day. Here&#39;s a math question: If you have five kittens  <br/>\nand they each throw themselves at you five times a day and the  <br/>\nprocess keeps up for three weeks, how many cactuses have you been hit  <br/>\nwith total? ;-)<br/>\n<br/>\nI thought it would be hard to let them go, but after all that you&#39;re  <br/>\nready to be cactus and poop free ;-)<br/>\n<br/>\nThey need PLENTY of attention! We usually kept our kittens in a spare  <br/>\nbedroom, going in to see them several times per day for play time and  <br/>\nfeeding (essentially every time we went in there their plates were  <br/>\nempty!). Or if they&#39;re really small and have no mother, we&#39;d give  <br/>\nthem KMR (Kitten Milk Replacement) through eye-droppers. But when  <br/>\nthey were a few weeks old, they got too big for the room and we let  <br/>\nthem run around the house. They&#39;d fly around like they&#39;d been shot  <br/>\nfrom a cannon for ten, twenty minutes and then crash in one big  <br/>\nkitten blob anywhere soft. :-)<br/>\n<br/>\nJoyce and Kat</div>","specialLinks":[]},{"userId":220662483,"authorName":"Alice","from":"&quot;Alice&quot; &lt;thesackmans@...&gt;","profile":"alice_in_idaho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fostering Kittens","postDate":"1169830598","msgId":21125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwZGJzNitjajg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVwYzBnNStxMGhuQGVHcm91cHMuY29tPg=="},"prevInTopic":21097,"nextInTopic":0,"prevInTime":21124,"nextInTime":21126,"topicId":21048,"numMessagesInTopic":0,"msgSnippet":"... ***Jan, we have fostered several litters of kittens.  We have enjoyed all of them but we really love animals.  The worst problem we ever had was the last","messageBody":"<div id=\"ygrps-yiv-1154968420\">--- Jan wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I know I&#39;ve seen posts here about fostering kittens.   My dd is <br/>\n&gt; interested in possibly doing this and I&#39;m curious to hear of other&#39;s <br/>\n&gt; experiences, things we should know (or &quot;things I wish they&#39;d told me <br/>\n&gt; before I decided to do this!), books or websites that are helpful, etc.<br/>\n<br/>\n </span></blockquote>***Jan, we have fostered several litters of kittens.  We have enjoyed<br/>\nall of them but we really love animals.  The worst problem we ever had<br/>\nwas the last litter in which two kittens died at birth and the rest<br/>\ngot sick when they were 7 wks.  It was hard on us.  We kept wondering<br/>\nwhat we did wrong but the shelter kept reassuring us that it happens.<br/>\n The other litters went smoothly.<br/>\n<br/>\nI can&#39;t think of anything I wish they&#39;d told me before I decided to do<br/>\nit.  It was fun to have a bunch of kittens in the house.  It was<br/>\nwonderful to watch them be born and transform from &quot;little slobby<br/>\nthings&quot; (as my dd calls them) into cute little kittens with their own<br/>\npersonalities.  A lot of people warned me that we would have a hard<br/>\ntime sending them back, but that was never a problem.  I made sure<br/>\nthat the kids knew that it was only temporary and that it simply<br/>\nwasn&#39;t an option to keep them (the kittens officially belong to the<br/>\nshelter, they were never &quot;ours&quot;).  If anything, I was the one who was<br/>\nthe saddest to see them go just because I was the one who mothered<br/>\nthem the most and it was hard for me to let my babies go.<br/>\n<br/>\nA good set up is probably the most important part of the process. <br/>\nMama kitty will want to find a place that is quiet and secluded.  Old<br/>\nsheets and boxes help. The mamas we had were pretty self-sufficient<br/>\nand often picked their own place despite my &quot;perfect setup&quot; somewhere<br/>\nelse. Many litter boxes spread around the house are useful when the<br/>\nkittens get a little older and start roaming around.  Kittens do have<br/>\n&quot;accidents&quot;.  I wouldn&#39;t do it if you have rough children or other<br/>\nanimals that will threaten the kittens.  (we have lots of other<br/>\nanimals but none that cared about the kittens) The shelter made it<br/>\nclear that part of our job was to socialize the kittens so that they<br/>\nwouldn&#39;t be wild, so lots of gentle handling was encouraged.<br/>\n<br/>\nAnyway, for us, it has been a very positive experience.  And the<br/>\nshelter has just been thrilled that we do this for them, as if it is<br/>\nsome huge sacrifice.  For our part, we can&#39;t believe that we are so<br/>\nlucky to be able to experience the joy of kittens for 8 weeks without<br/>\nany vet bills, or worries about finding homes for them!  It has been a<br/>\nwin-win.<br/>\n-alice</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Fostering Kittens","postDate":"1169786181","msgId":21048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwYzBnNStxMGhuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":21061,"prevInTime":21047,"nextInTime":21049,"topicId":21048,"numMessagesInTopic":0,"msgSnippet":"I know I ve seen posts here about fostering kittens.   My dd is interested in possibly doing this and I m curious to hear of other s experiences, things we","messageBody":"<div id=\"ygrps-yiv-1263364510\">I know I&#39;ve seen posts here about fostering kittens.   My dd is <br/>\ninterested in possibly doing this and I&#39;m curious to hear of other&#39;s <br/>\nexperiences, things we should know (or &quot;things I wish they&#39;d told me <br/>\nbefore I decided to do this!), books or websites that are helpful, etc.<br/>\nThanks!   <br/>\nJann</div>","specialLinks":[]}],"prevTopicId":21022,"nextTopicId":21128}}