{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Transitioning from Rules to Principles with young kids","postDate":"1241996236","msgId":40012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1N200YytmdDgyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd0djJxYStvZ2xoQGVHcm91cHMuY29tPg=="},"prevInTopic":40010,"nextInTopic":0,"prevInTime":40011,"nextInTime":40013,"topicId":39969,"numMessagesInTopic":0,"msgSnippet":"... Begin by actively looking for ways to think ahead, plan ahead, be more proactive rather than reactive. Soooooo many of the what do I do when x happens?","messageBody":"<div id=\"ygrps-yiv-1247449305\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Angela Wolff&quot; &lt;argwolff@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So, with a 7YO, 4YO and 18MO, where do you begin?<br/>\n<br/>\n </span></blockquote>Begin by actively looking for ways to think ahead, plan ahead, be more proactive rather than reactive. Soooooo many of the &quot;what do I do when x happens?&quot; sorts of questions can be turned around: &quot;knowing that x is likely to happen, what can I do to make it less of a problem?&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;my 4YO from drawing on the walls/toys/books every time she finds a pen lying around and slips out of view with it<br/>\n<br/>\n </span></blockquote>Being proactive in this case involves having lots and lots of places where its Okay to write - get a roll of paper from an art or school supply store and paper the walls with it! Actively offer her toys and books that no-one minds seeing a little pen on. Throw a million opportunities a day to write and draw at her, so she&#39;s not in the position of sneaking off with a writing utensil. There&#39;s always something on hand that&#39;s okay - to the point that when she Starts to write on something else, you can say &quot;Oh do that here, instead&quot; - turn your &quot;no&quot; into a &quot;yes&quot;. Get the 7yo involved in this game - how many things can we think of for sissy to draw on today? Wanna join the fun?<br/>\n* Water based markers are fun on windows and wash off easily - make your own stained glass! Glass cookware can be fun with this, too.<br/>\n*Kids&#39; paints are fun around the house, too. Paint the bathtub and shower curtains. If you have linoleum, paint the floor. <br/>\n*Those laminated board books are great for drawing with crayons - the crayon rubs off with a rag. Other plastic surfaces are fun with crayon in the same way. <br/>\n*In addition to papering the walls and floors, consider getting some plain white fabric or even tshirts to decorate with markers. <br/>\n*Its a good time to buy sidewalk chalk! Then she can draw on almost anything any time. If you want something more elegant, consider chalkboard paint on a wall. It comes in all kinds of colors these days.<br/>\n*4yos often like cleaning as much as making the mess - if you make cleaning part of the fun, too. Make sure you have step stools and rags and safe cleaning products like soapy water or vinegar. <br/>\n<br/>\nPart of the process (a Big part) involves looking inside yourself and asking &quot;why do I have a problem with this?&quot; There are some things... eating in certain places and certain times, for instance, that are cultural expectations - things we can bend and change to suit the needs of the individuals and moments. Other things, expectations of certain kinds of behavior, frequently aren&#39;t developmentally appropriate. You can force-train some kids to do those things, but other kids insist on acting their age all the time - go figure! So it can be helpful to think and read and ask about *when* kids can be expected to do certain things consistently. Certain kinds of &quot;responsible behaviors&quot; come to mind. It can seem like &quot;responsibility&quot; is taught through repetition, but to a large degree, its developmental. Kids *seem* to learn it, when really they just mature, and suddenly &quot;get it&quot;. <br/>\n<br/>\nOther things, like hurting siblings, aren&#39;t really negotiable. Naturally, you want All your children to be safe. Those sorts of situations you look for ways to diffuse - ways to meet the Needs of the people involved as best you can in the moment. So the hitting child may need a snack, or some attention (and you make a mental note to look for the signs of that Sooner, next time - more proactivity) and the hurt child might need a cuddle or some verbal affirmation. If there&#39;s an issue with toys, is it possible to trade one toy for another to diffuse the situation? Do some toys need to be kept in a special area, away from younger children? Maybe its worth buying two or three of the same toy for the sake of less conflict.<br/>\n<br/>\nThe main idea with principles, is that you aren&#39;t so much &quot;applying&quot; them as trying to live by them. If you value generosity, for instance, look for ways to be more generous to your family and yourself, too. It sounds a little crazy to say &quot;when your kids are being obnoxious to each other, look for a way to be generous&quot; but really, when kids are at their worst, they are often at times of higher need (just like adults, we aren&#39;t at our best under stress, either). Being generous meets the underlying needs.<br/>\n<br/>\nIn the moment, some things that help are: taking deep, slow breaths, waiting a few seconds for your first &quot;reaction&quot; to pass (if things get physical, get Between fighting kids, but maybe don&#39;t say anything right away), and remembering that everyone is doing the best they can with what they have. <br/>\n<br/>\nAnd when &quot;the moment&quot; goes sour, know that you can always apologise.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Transitioning from Rules to Principles with young kids","postDate":"1241988987","msgId":40010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1N2YxcitnbTZAZUdyb3Vwcy5jb20+","inReplyToHeader":"PGd0djJxYStvZ2xoQGVHcm91cHMuY29tPg=="},"prevInTopic":39982,"nextInTopic":40012,"prevInTime":40009,"nextInTime":40011,"topicId":39969,"numMessagesInTopic":0,"msgSnippet":"... ******With yourself.    I don t think in my house we have any clearly defined principles.  But I do live by my own that I feel are important. -Heather ","messageBody":"<div id=\"ygrps-yiv-2147233660\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Angela Wolff&quot; &lt;argwolff@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, with a 7YO, 4YO and 18MO, where do you begin?<br/>\n<br/>\n </span></blockquote>******With yourself.  &lt;G&gt;  I don&#39;t think in my house we have any clearly defined principles.  But I do live by my own that I feel are important.  <br/>\n<br/>\n-Heather<br/>\n========================================================================</div>","specialLinks":[]},{"userId":280469198,"authorName":"Bethany","from":"&quot;Bethany&quot; &lt;coconutandbroccoli@...&gt;","profile":"greenbeanbanshee","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Transitioning from Rules to Principles with young kids","postDate":"1241794407","msgId":39982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MWgxNytibGdzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdGQ0YxNkE2LUVGREQtNEUzMi1BMjE5LTM4NTAyOUYzMDk0N0B2ZXJpem9uLm5ldD4="},"prevInTopic":39979,"nextInTopic":40010,"prevInTime":39981,"nextInTime":39983,"topicId":39969,"numMessagesInTopic":0,"msgSnippet":"One of my favorite books on this topic is called Connection Parenting, written by Pam Leo.  You might have already read it.  It s not unschooling-focused, but","messageBody":"<div id=\"ygrps-yiv-2138434214\">One of my favorite books on this topic is called Connection Parenting, written by Pam Leo.  You might have already read it.  It&#39;s not unschooling-focused, but it totally describes what you&#39;re talking about. I&#39;m taking a class on this right now and it is exactly what I&#39;ve needed.<br/>\n<br/>\n~Bethany</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Transitioning from Rules to Principles with young kids","postDate":"1241790669","msgId":39979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQ0YxNkE2LUVGREQtNEUzMi1BMjE5LTM4NTAyOUYzMDk0N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGd0djJxYStvZ2xoQGVHcm91cHMuY29tPg==","referencesHeader":"PGd0djJxYStvZ2xoQGVHcm91cHMuY29tPg=="},"prevInTopic":39969,"nextInTopic":39982,"prevInTime":39978,"nextInTime":39980,"topicId":39969,"numMessagesInTopic":0,"msgSnippet":"... Living by unschooling principles involves a mental shift. It s not about seeing how kids are broken and how they need fixed. It s about being grounded and","messageBody":"<div id=\"ygrps-yiv-1176145046\">On May 7, 2009, at 12:38 PM, Angela Wolff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The idea of principles instead of rules really resonates with me,  <br/>\n&gt; but I&#39;m not sure how to make the transition with my young kids.<br/>\n<br/>\n </span></blockquote>Living by unschooling principles involves a mental shift. It&#39;s not  <br/>\nabout seeing how kids are broken and how they need fixed. It&#39;s about  <br/>\nbeing grounded and whole in your principles and helping your children  <br/>\ndo what they&#39;re trying to do in ways that are safe and kind and  <br/>\nrespectful.<br/>\n<br/>\nYou&#39;re not trying to impose safety and kindness and respect on them.  <br/>\nThat&#39;s the big stumbling point for most people, I think. As in &quot;How  <br/>\ncan I get them to be kind?&quot; You&#39;re using those principles to help  <br/>\nyour kids meet their needs in ways that keep with your principles.  <br/>\nAssume they want the same thing. Assume they don&#39;t want to be unsafe  <br/>\nor hurtful. (We are biologically social creatures. We want to get  <br/>\nalong with others. But we also want our needs met. Kids just don&#39;t  <br/>\nhave a head full of solutions that allow them to meet their needs  <br/>\n*and* be safe and kind. So we help them. We give them ideas, we give  <br/>\nthem solutions, we brainstorm with them. Make them part of the  <br/>\nsolution rather than turning them into the problem.<br/>\n<br/>\nSandra has a good page on principles:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/principles/\">http://sandradodd.com/principles/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not that rules and punishments have solved the problems of siblings  <br/>\n&gt; being disrespectful of each other&#39;s feelings/bodies/belongings<br/>\n<br/>\n </span></blockquote>This might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n<br/>\nIt will help you find more principle based solutions if you see that  <br/>\nthey aren&#39;t being disrespectful. They have a need and they&#39;re trying  <br/>\nto meet it.<br/>\n<br/>\nIt could be they&#39;re not getting enough space. It could be they&#39;re not  <br/>\ngetting enough of your time one on one. It could be they&#39;re tired. Or  <br/>\nhungry.<br/>\n<br/>\nThe more you read, the more you&#39;ll help yourself see a bigger picture  <br/>\nof building relationships and helping them find ways to meet their  <br/>\nneeds, rather than focusing on fixing the ways they&#39;re being &quot;wrong&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; of have kept my 4YO from drawing on the walls/toys/books every time  <br/>\n&gt; she finds a pen lying around and slips out of view with it, of course<br/>\n<br/>\n<br/>\n </span></blockquote>See the following more as how principles look in action rather than  <br/>\nas specific solutions to this problem.<br/>\n<br/>\nSee that your daughter isn&#39;t wrong in her need. She has an  <br/>\noverwhelming desire to draw on all sorts of surfaces. You can&#39;t stop  <br/>\nthis desire. You can, though, ramp up her need by putting up barriers  <br/>\nbetween her and what she needs. Just as telling someone they can&#39;t  <br/>\neat doesn&#39;t make the hunger go away. It just makes them hungry *and*  <br/>\ndesperate.<br/>\n<br/>\nSee, also, that it&#39;s okay that you want to direct her away from  <br/>\ndrawing on some things and towards drawing on others. *She* doesn&#39;t  <br/>\nwant to be destructive. She just doesn&#39;t understand. (And it&#39;s  <br/>\npossible she can&#39;t yet understand or can&#39;t yet funnel the desire to  <br/>\nthings that are acceptable.)<br/>\n<br/>\nDo say no. She shouldn&#39;t be drawing on the flat screen TV with  <br/>\nmarker! ;-) But the fewer nos she hears, the more powerful they are.  <br/>\nGive her the clear message, no, not there and move on to meeting her  <br/>\nneeds. She needs to color. Help her find ways she *can* color rather  <br/>\nthan focus on ways she can&#39;t color. Help her find safe and acceptable  <br/>\noutlets. Be her partner.<br/>\n<br/>\nGive her access to places she can color. Lots of different kinds of  <br/>\nopportunities. Painting outside with washable paint. Painting with  <br/>\nwater with big brushes on the house and driveway. Sidewalk chalk.  <br/>\nPainting on big paper in the bathtub. Cover the walls with paper.  <br/>\n(There are loads of more ideas in the archives.) Feed her desire.<br/>\n<br/>\nSince it&#39;s important to you that she not draw on things, *one* way to  <br/>\naccomplish that is to be more present. She shouldn&#39;t be alone long  <br/>\nenough to be coloring on things. You should be aware of when she has  <br/>\nthe urge to color and help her find ways that are acceptable. (Being  <br/>\nmore present is pretty much the first answer to almost all parenting  <br/>\nproblems. It&#39;s not the only answer. Sometimes we have to go to the  <br/>\nbathroom! ;-) But the more that can be proactively avoided, the fewer  <br/>\nproblems you need to find solutions to! And the more peaceful life is  <br/>\nand the more relationships grow.)<br/>\n<br/>\nAlso, since it&#39;s important to you, be more diligent about keeping  <br/>\nmarkers that will damage things put away.<br/>\n<br/>\nAnother is to elicit help from the 7 yo. You are *not* handing over  <br/>\nthe responsibility to him. If he leaves a marker out, it&#39;s still your  <br/>\nresponsibility to put it away. He&#39;s not being conscripted into your  <br/>\ntask! But approach it as &quot;Let&#39;s get these put away so your sister  <br/>\ndoesn&#39;t use them on things we don&#39;t want  her to.&quot; Engage his help.  <br/>\nInvite him to be part of the solution. But it is freely given help,  <br/>\nnot a responsibility foisted onto him.<br/>\n<br/>\nYes, this is a lot of work! But it&#39;s so much more peaceful, so much  <br/>\nbetter at building relationships than being reactive to children&#39;s  <br/>\n&quot;faults&quot;.<br/>\n<br/>\nMuch of this is proactive, creating an environment where she isn&#39;t  <br/>\nset up to fail. This isn&#39;t about being perfect! Oopses do happen. But  <br/>\nsee the oopses as &quot;learning takes&quot; as Kelly calls them, or &quot;feedback&quot;  <br/>\nas Pam once said. They happen to help you figure out solutions that  <br/>\nmight prevent it for next time. And when feedback does happen, you&#39;ll  <br/>\nbe able to handle it more calmly -- and focus on the real immediate  <br/>\nproblem of getting it cleaned up rather than on how &quot;wrong&quot; the child  <br/>\nwas -- because the feedback&#39;s not happing 20 times a day.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela Wolff","from":"&quot;Angela Wolff&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Transitioning from Rules to Principles with young kids","postDate":"1241714314","msgId":39969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0djJxYStvZ2xoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39979,"prevInTime":39968,"nextInTime":39970,"topicId":39969,"numMessagesInTopic":0,"msgSnippet":"The idea of principles instead of rules really resonates with me, but I m not sure how to make the transition with my young kids. Not that rules and","messageBody":"<div id=\"ygrps-yiv-1342592396\">The idea of principles instead of rules really resonates with me, but I&#39;m not sure how to make the transition with my young kids. Not that rules and punishments have solved the problems of siblings being disrespectful of each other&#39;s feelings/bodies/belongings or have kept my 4YO from drawing on the walls/toys/books every time she finds a pen lying around and slips out of view with it, of course ... but with &quot;rules and punishments&quot; I know what to do *in the moment*.<br/>\n<br/>\nSo, with a 7YO, 4YO and 18MO, where do you begin?<br/>\n<br/>\nThanks,<br/>\nAngela</div>","specialLinks":[]}],"prevTopicId":39965,"nextTopicId":39937}}