{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":278713983,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sibling Conflict?","postDate":"1157943050","msgId":17162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlMml1YStxZ2FvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVkdXRvZCszajk2QGVHcm91cHMuY29tPg=="},"prevInTopic":17149,"nextInTopic":0,"prevInTime":17161,"nextInTime":17163,"topicId":17143,"numMessagesInTopic":0,"msgSnippet":"... bigger kids bickering in the car while I try to get 1 thing taken care of. Thanks for your input, Mary.  Don t worry too much.  Consider yourself blessed.","messageBody":"<div id=\"ygrps-yiv-693317357\"><blockquote><span title=\"ireply\">&gt; Good luck. You have me worried, I&#39;m goign to have those same <br/>\n </span></blockquote>bigger kids bickering in the car while I try to get 1 thing taken <br/>\ncare of.&gt;<br/>\n<br/>\nThanks for your input, Mary.  Don&#39;t worry too much.  Consider <br/>\nyourself blessed.  You have a leg up in this arena.  How wonderful <br/>\nfor your family that you have come to this while they are young.<br/>\n<br/>\nI was &quot;absent minded parented&quot; and had a rough way to go.  I made <br/>\nthe error in judgement thinking that where my single-mom <br/>\nwent &quot;wrong&quot; with me was not being strict enough and fell into the <br/>\ntraditional parenting trap.  Unfortunately, we raised the first four <br/>\nthat way...in public school to boot.<br/>\n<br/>\nNow we have the three youngest here at home and are trying to do <br/>\nthings differently.  We are learning from experience that control <br/>\nfed parenting backfires, and having a real relationship based on <br/>\ntrust and respect creates something totally different, desirable and <br/>\nmeaningful.  <br/>\n<br/>\nDH is a little behind me, but I am desperately trying to learn for <br/>\nall of us.  I&#39;m getting the mindful part in theory, and I couldn&#39;t <br/>\nagree more.  (Honestly, when I look back on my instincts mindful <br/>\nparenting came naturally to me.  I allowed it to get mucked up by <br/>\ngetting sucked into the &quot;need&quot; to traditionally parent.)  Now I just <br/>\nneed my mindful instincts to become natural reflex in practice.  <br/>\nWith no personal refernce point it can be very tricky at times.  The <br/>\nonly examples I had were toxic.  <br/>\n<br/>\nIt is my desire to create something totally different with my <br/>\nchildren at home and rebuild my relationship with the older ones as <br/>\nwell.  Maybe I can set a positive example and give my children <br/>\nsomething real to refer back on when it comes time for them to raise <br/>\nthe next generation.<br/>\n<br/>\nThanks to the others for the links.  I really appreciate the <br/>\nresources.<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":202023256,"authorName":"Mary Hickman","from":"&quot;Mary Hickman&quot; &lt;mfhickman@...&gt;","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sibling Conflict?","postDate":"1157823053","msgId":17149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVkdXRvZCszajk2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVkdHFkcit1c2YzQGVHcm91cHMuY29tPg=="},"prevInTopic":17145,"nextInTopic":17162,"prevInTime":17148,"nextInTime":17150,"topicId":17143,"numMessagesInTopic":0,"msgSnippet":"Hi Tina, I have children who also get into conflicts like this when tired, hungry, trapped, hot. Mine are younger, 12, 9 and 6...but I see a lot of similar","messageBody":"<div id=\"ygrps-yiv-511066937\">Hi Tina,<br/>\n<br/>\nI have children who also get into conflicts like this when tired, <br/>\nhungry, trapped, hot. Mine are younger, 12, 9 and 6...but I see a <br/>\nlot of similar patterns here in my home. I like how your kids <br/>\nspontaneously came and talked to you. That&#39;s a great sign that they <br/>\nwant to be heard. Even the older one saying the younger is crazy. <br/>\nThat is what she is feeling right then, so hearing her without <br/>\njudgement is important. I think you did a great thing not going back <br/>\nover the conflict in the moment. Mine just would get all hot and <br/>\nbothered again, it would escalate the situation.<br/>\n<br/>\nSome things I would suggest. Help your 12 year old feel in control. <br/>\nHave plans, like when you get so mad at DD 16, get out, no matter <br/>\nwhat and away. That might help with him not touching her. Let the <br/>\nother kids know your plan. When DS 12 is mad, he needs space and <br/>\nair. We are going to help him with that. Also, I just don&#39;t leave <br/>\nall 3 of mine in the car or anywhere really. 2 &#39;s work, 3&#39;s fight. I <br/>\ntake one. It doesn&#39;t seem to matter which one. DD 16 needs to own <br/>\nher part of the situation. Have you read the Explosive Child By Ross <br/>\nGreene. It&#39;s an eye openner for triggers to angry reactions. My <br/>\nolder dd is the primary trigger to her brothers angry outburst. <br/>\nWithout dwelling on her, I do let her know possible other paths <br/>\nwhich might result in less anger. Like you suggested, if she was <br/>\nsilent, then the boys might have been fine.<br/>\n<br/>\nWithout putting to much emphasis on what happened, I would stay <br/>\ntuned into your 3 and be present when the sibling conflicts begin. <br/>\nSee the dynamics, but also find a way to support all of them being <br/>\nheard. I find this the hardest, slowing everyone down to be heard, <br/>\nto listen to eachother and to move from problem to solution. One <br/>\nthing we are doing is trying not to be in situations where we need <br/>\nto ask someone else to do something for our comfort. For example, if <br/>\nsomeone sits down and blocks you, you can either scoot over yourself <br/>\nor ask. If asking gets you negative results, moving just might be a <br/>\nbetter solution.<br/>\n<br/>\nGood luck. You have me worried, I&#39;m goignt o have those same bigger <br/>\nkids bickering in the car while I try to get 1 thing taken care of.<br/>\n<br/>\nMary</div>","specialLinks":[]},{"userId":278713983,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sibling Conflict?","postDate":"1157809462","msgId":17145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVkdWdmbStsMTlvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVkdHFkcit1c2YzQGVHcm91cHMuY29tPg=="},"prevInTopic":17143,"nextInTopic":17149,"prevInTime":17144,"nextInTime":17146,"topicId":17143,"numMessagesInTopic":0,"msgSnippet":"Error Correction:  I got a little messed up along the way with the DS and DD aspects of my post.  The kids ARE as follows: DS12 DS14 DD16 Sorry if this caused","messageBody":"<div id=\"ygrps-yiv-994349060\">Error Correction:  I got a little messed up along the way with the DS <br/>\nand DD aspects of my post.  The kids ARE as follows:<br/>\n<br/>\nDS12<br/>\nDS14<br/>\nDD16<br/>\n<br/>\nSorry if this caused any confusion...<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":278713983,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sibling Conflict?","postDate":"1157786875","msgId":17143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVkdHFkcit1c2YzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":17145,"prevInTime":17142,"nextInTime":17144,"topicId":17143,"numMessagesInTopic":0,"msgSnippet":"Well, I was awoken by a sirened vehicle racing down my street.  A rare occurance.  With summer heat and windows open I am now awake in thought.  I sure wish","messageBody":"<div id=\"ygrps-yiv-209644475\">Well, I was awoken by a sirened vehicle racing down my street.  A <br/>\nrare occurance.  With summer heat and windows open I am now awake in <br/>\nthought.  I sure wish this would have come to me earlier, but I need <br/>\nto pose a question.<br/>\n<br/>\nToday I was out with DS12, DS14 and DD16.  We had a long day, and it <br/>\nwas a little warm.  I stopped at the library on our way home to <br/>\nreturn an overdue book and pick up some of my holds.  The kids opted <br/>\nto wait in the car.  <br/>\n<br/>\nWhile I was in the library, maybe 10 minutes, there was a pretty <br/>\nserious conflict between the kids.  DS14 came into the library and <br/>\nmade me aware of the conflict between DS12 and DD16.  I asked DS14 <br/>\nto go back out to ask them to simmer down before I came back out.  I <br/>\nwas seconds away from exiting the library myself.<br/>\n<br/>\nWhen I came out of the library DS14 and DD16 were standing outside <br/>\nthe vehicle talking with DS12 inside the car by himself.  What I <br/>\nknew at this point was that DS12 had supposedly grabbed DS16&#39;s face <br/>\nwith his hand, and DD16 had punched DS12.  Since there was no <br/>\nexchange of any kind going on upon my exiting the library and <br/>\ngetting in the car I decided not to say anything at that moment.  I <br/>\nhadn&#39;t witnessed the exchange, had no idea what really happened, and <br/>\nwe were minutes from home.<br/>\n<br/>\nWhen we got home DS14 rode his bike to visit Dad at work, DS12 was <br/>\nupstairs and DD16 proceeded to tell me her version of what had <br/>\nhappened without my prodding her.  From her perspective DS12 had <br/>\nasked DS14 to move up his seat a little so that he could be more <br/>\ncomfortable.  (this point is why I&#39;m awake kicking myself for not <br/>\nhaving asked questions right here)  For whatever reason DS14 had <br/>\nissue with this as is typical anytime DS12 asks anything like this <br/>\nof him.  (ie:  Could you please move a little so I can see the TV <br/>\nbetter?)  Such requests usually end up in a &quot;discussion&quot; of the why <br/>\ntype.  Why should I move?  Why am I even in your way?  Why wasn&#39;t <br/>\nhow much I moved good enough?  Why can&#39;t you see with me right <br/>\nhere?  ON and ON. <br/>\n<br/>\nThis is the point where I will usually point out that it&#39;s not an <br/>\nunreasonable request and ask him to please just move.  Sometimes <br/>\nhe&#39;ll want to get into the semantics with me.  He seriously sees the <br/>\nrequest as the issue and not his reluctance to honor something so <br/>\nsimple.  Well, with me not being there it turned into something <br/>\ntotally different.  Instead of DS14 moving up the seat, DD16 sided <br/>\nwith DS14 against DS12 insisting that DS12 would never do that for <br/>\nDS14 so why should he?  DS16 can be pretty bossy, for lack of better <br/>\nword, and DS12 got frustrated.  From DS16&#39;s perspective DS12 was <br/>\njust fine one minute and attacked her the next minute grabbing her <br/>\nface.  She proceeded to tell me that he was bipolar and needed <br/>\ncounseling.  A little dramatic in my opinion, but she seemed <br/>\nperfectly serious.<br/>\n<br/>\nTotally dropping the ball and not pointing out how DS12&#39;s request <br/>\nwas perfectly reasonable I fell into the &quot;wrong&quot; conversation in <br/>\ncertain aspects.  I pointed out that I have in fact seen DS12 honor <br/>\nDS14&#39;s requests on other occassions.  We discussed why it&#39;s not <br/>\nusually a good idea to impose yourself in a conflict between your <br/>\nsiblings, or anyone, that has nothing to do with you.  (and honestly <br/>\nwasn&#39;t a big deal between the two DS&#39;s until DD got involved)  I <br/>\nalso pointed out that it is not fair to suggest someone is crazy <br/>\nbecause they didn&#39;t know how to handle a conflict and got <br/>\nfrustrated.  We also discussed the age difference between her and <br/>\nDD12.  That was something she acknowledged and seemed to get her <br/>\nattention.  At times we tend to foget that DD12 really is a young <br/>\nkid.  He is the youngest of seven.  Our perspective can get a little <br/>\noff with the age thing at times.  He&#39;s almost three years younger <br/>\nthan DS14 and is four years younger than DD16.  It makes a big <br/>\ndifference in certain aspects and conflict resolution is one of <br/>\nthem.  How could he be expected to have the same skills and <br/>\nexperience, right?  It seemed to be an aha kind of moment for her.<br/>\n<br/>\nA little while later DD12 came into my room and talked to me about <br/>\nthe conflict.  His perspective is that he had made the request <br/>\nmentioned above and DD16 started in on him and wouldn&#39;t stop <br/>\nattacking him verbally.  He knew that he couldn&#39;t tell her to stop <br/>\nbecause it would make the situation worse.  He couldn&#39;t get out of <br/>\nthe vehicle because he felt trapped behind DD14 and DD16 was beside <br/>\nhim.  (it&#39;s a two door, very small, vehicle)  So, he put his hand <br/>\nover her mouth as his way to tell her to be quiet not thinking about <br/>\nthe fact that this would also make matters worse.  She freaked out <br/>\non him further and started punching him.  He defended himself.  His <br/>\nthought process exhibited very mature reasoning in many aspects, but <br/>\nhis feeling of being trapped is what paralyzed him.<br/>\n<br/>\nNeither child had any marks on their bodies.  Neither child was <br/>\nvisibly upset in any outward ways like tear stains or anything like <br/>\nthat.  The thing that&#39;s keeping me awake is that I feel like this <br/>\nshould be discussed further with DD14 and DD16, but I&#39;m not sure how <br/>\nto go about it.  I&#39;m not sure that DD12 should be present when we <br/>\ntalk about it.  For those of you that don&#39;t know DD14 and DD16 are <br/>\nnew to homeschooling and unschooling.  They have been in PS their <br/>\nentire lives until this past Easter Break and Christmas Break <br/>\nrespectively.  <br/>\n<br/>\nHow would you approach this if it were your children?  What, if <br/>\nanything, should I do differently with them not really having an <br/>\nunschooling mindset?  They are both gone until Sunday, so we won&#39;t <br/>\nbe able to talk until then.  I would really appreciate some input <br/>\nfrom all of you.<br/>\n<br/>\nThanks - Tina</div>","specialLinks":[]}],"prevTopicId":17154,"nextTopicId":17138}}