{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling but difficulties","postDate":"1273065169","msgId":43859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5OTAwLjU2MDExLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":43856,"nextInTopic":0,"prevInTime":43858,"nextInTime":43860,"topicId":43849,"numMessagesInTopic":0,"msgSnippet":"It sounds like you have an idea of what learning looks like and anything outside of that isn t actually learning. That s a pretty normal understanding of","messageBody":"<div id=\"ygrps-yiv-482712628\">It sounds like you have an idea of what learning looks like and anything outside of that isn&#39;t actually learning. That&#39;s a pretty normal understanding of learning, but it isn&#39;t a helpful understanding if you are unschooling. The underlying assumption with unschooling is that learning is a part of being human; we learn all the time. It happens best in an environment rich with engaging and interesting things to do, with happy and engaged individuals, but it happens without those things as well. <br/>\n<br/>\nMy son isn&#39;t an avid reader. He didn&#39;t read with much proficiency until he was about 12 and at 13 he is a competent reader, but he doesn&#39;t read for pleasure, just for information. He really enjoys books, though. When he was younger he and I would curl up and I would read to him. I would read for as long as my voice would hold out. We checked books on tape out from the library and those readers lasted longer than I did, so he would alternate between my reading and a taped reader, at some point he didn&#39;t want me to read to him anymore. He wanted to do things, to move around while he listened to the books. He walks around most of the time with an ipod listening to some book or another. We watched I, Robot the other night on television and I talked about Isaac Asimov and three laws and how much I really enjoyed his books. Simon wanted to hear one, so I bought it from Itunes and he&#39;s loved it. It&#39;s the first collection of short stories that he&#39;s listened to,<br/>\n he said it was much better than the movie, and completely different. I got the first book of Isaac Asimov&#39;s Robot Series yesterday for him. <br/>\n<br/>\nMy daughter, on the other hand, loves to read. There are books piled up next to the bed and by the toilet and scattered here and there all through the house. Because of her enjoyment of the Warrior Cat series she has begun to write fan fiction. She writes mostly on a Roblox forum, but yesterday created a new cat character in Word. She often will draw pictures of the cats she&#39;s writing about as a reference, I suppose. She likes the visual to accompany the written. <br/>\n<br/>\nNeither is more interested in learning than the other. Both have their own approaches and relationships with the world of books and stories. It&#39;s a bit harder for Simon because not everything is offered as a spoken word cd or mp3, but a lot is. They learn because they are living and interested and happy and engaged. The books Linnaea reads aren&#39;t books that appeal to me in the same way as the books that Simon reads. Does that mean that she is learning less? I don&#39;t think so. Simon isn&#39;t reading the books to himself, he isn&#39;t withdrawing from the rest of his day to become absorbed in a story, he does all that he would normally do accompanied by Stephen Fry or Jim Dale or Scott Brick or Green Day or Jonathon Coulton, or whoever else is coming through his headphones. Is he learning less? is he less engaged by what he is hearing than Linnaea is by what she is reading? I absolutely don&#39;t think so. <br/>\n<br/>\nI read a lot for a long, long time. It was where I went to hide from the rest of the world. I read on the school bus, my knees braced against the seat in front of mine, ignoring all the things going on around me. I read in class, sneaking the book on my lap, behind a text book, in my desk using any excuse to open it. Books were my hideaway place. And I was praised for using them. When Simon was born and then Linnaea my time to read shrunk. At first I was really frustrated and then I started to realise how much I didn&#39;t want to escape. I like being right here right now, I don&#39;t need to escape somewhere else to have a good time. I didn&#39;t stop learning because I wasn&#39;t reading. I&#39;ve learned a lot in the past 13 years. And when I do read, I&#39;m much more selective in my reading. And I can put down a book without feeling torn from it. <br/>\n<br/>\nLearning is a byproduct of living. And if your kids are having a good time they&#39;ll be learning far more from what they are doing and engaging with than if they are being pressed by someone else to engage with the world in the prescribed manner. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: redsrandigene2 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:redsrandigene2@...\">redsrandigene2@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, 4 May, 2010 11:15:52<br/>\nSubject: [unschoolingbasics] unschooling but difficulties<br/>\n<br/>\nI am noticing the interest in learning in 2 of my children but the other two show no interest. how do I get them motivated on anything besides tv or playing outside? my twothat are interested in learning were actually begging for book work the other night.but how do i get them all interested in reading? I have taken care of the writing part and grammer but signing them up with penpals so they have to use handwriting sentence structure conversations creativity etc..but they refuse to read a book.I have tried taking them to the library often, reading to them myselves etc.. but being such a visual world I fear they don&#39;t use their imaginations and get &quot;wrapped up&quot; in a book. Help!!<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:unschooling but difficulties","postDate":"1273055327","msgId":43856,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRGMTZEQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":43851,"nextInTopic":43859,"prevInTime":43855,"nextInTime":43857,"topicId":43849,"numMessagesInTopic":0,"msgSnippet":"Expand your seeing - reading is not confined to books. Look for magazines related to their interests. Recognize that most videogames involve reading. We often","messageBody":"<div id=\"ygrps-yiv-2081386229\">Expand your seeing - reading is not confined to books. Look for magazines related to their interests. Recognize that most videogames involve reading. We often use closed captioning so we don&#39;t have to crank up the TV volume when the windows are open in summer with fans going and cars driving by. That&#39;s reading. Realize that there are people who live successful lives who don&#39;t read for entertainment/enjoyment. There&#39;s a big difference between being able to read and choosing to read &quot;for fun&quot;. My DS was able to read pretty fluently by age 5 ½. Once he had mastered the skill, he moved on and wasn&#39;t interested in reading books for about 5 years (he&#39;s now approaching 12...less than a month to go...and he is enjoying books again). In the interim, reading was still there - closed captions, videogames, game guides and walkthroughs, etc. And, we made sure that he had other resources as well, mostly magazines that were related to his interests (did you know that there&#39;s an entire magazine devoted to Pokemon?!) If he asked, we&#39;d read something for him (I got really good at using the printed Pokedex we purchased lol). <br/>\n<br/>\n <br/>\n<br/>\nBTW he also learned to physically write and construct grammatical sentences/use punctuation/spell without us &#39;setting up&#39; penpals for him. He developed those skills/is developing those skills in his own time, his own way to meet his own goals and needs. If the kids wanted penpals, go for it. If that&#39;s a not-too-subtle &quot;lesson plan&quot;, maybe reconsider.<br/>\n<br/>\n <br/>\n<br/>\n--Deb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling but difficulties","postDate":"1273008315","msgId":43851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGMjBBRkFCLTQxRkQtNDUzOS04RjEzLTJCQTBBRERFMjlCRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhyb3M0bytuaTVxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyb3M0bytuaTVxQGVHcm91cHMuY29tPg=="},"prevInTopic":43849,"nextInTopic":43856,"prevInTime":43850,"nextInTime":43852,"topicId":43849,"numMessagesInTopic":0,"msgSnippet":"... The real question, the question relevant to unschooling is: How do you learn to see the learning in what they re doing? They *are* learning. Unschooling","messageBody":"<div id=\"ygrps-yiv-475473552\">On May 4, 2010, at 6:15 AM, redsrandigene2 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  how do I get them motivated on anything besides tv or playing  <br/>\n&gt; outside?<br/>\n<br/>\n </span></blockquote>The real question, the question relevant to unschooling is: How do you  <br/>\nlearn to see the learning in what they&#39;re doing?<br/>\n<br/>\nThey *are* learning. Unschooling rarely looks like school. It looks  <br/>\nlike play with parents who are connected: who run new things through  <br/>\ntheir kids lives, who are tuned in enough to their kids interests to  <br/>\nhave conversations and help them find related material if they&#39;d like,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my twothat are interested in learning were actually begging for book  <br/>\n&gt; work the other night.<br/>\n<br/>\n<br/>\n </span></blockquote>Why? You think the answer is obvious but it&#39;s not.<br/>\n<br/>\nWhile some kids do naturally enjoy the self-containedness of bookwork,  <br/>\nit&#39;s not the norm. Are your kids asking for bookwork because they  <br/>\ndon&#39;t feel like they&#39;re learning unless it resembles school? If so,  <br/>\nthey&#39;re still deschooling and it&#39;s you&#39;re other two who really get  <br/>\nunschooling! This might be helpful:<br/>\n<br/>\nsandradodd.com/deschooling<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how do i get them all interested in reading?<br/>\n<br/>\n<br/>\n </span></blockquote>By backing off any pressure to get them to do anything.<br/>\n<br/>\nBy creating a positive -- no-pressure! -- experience with the written  <br/>\nword.<br/>\n<br/>\nRead to them out loud because you enjoy doing it with them. Listen to  <br/>\nbooks on CD in the car. Watch movies related to books and talk about  <br/>\nthe differences. Get them any guides they might want for their video  <br/>\ngames.<br/>\n<br/>\nThey will read when they find it useful for their own purposes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have taken care of the writing part and grammer but signing them  <br/>\n&gt; up with penpals so they have to use handwriting sentence structure  <br/>\n&gt; conversations creativity etc.<br/>\n<br/>\n<br/>\n </span></blockquote>If they aren&#39;t enjoying it what you&#39;re really doing is making them  <br/>\ndread all of that and laying a layer of drudgery over it. Rather than  <br/>\nlooking at skills you want them to have, look at your children and see  <br/>\nwhat they&#39;re interested in. Help them explore. Writing and math and so  <br/>\non are a natural part of life. They don&#39;t need artificially brought in  <br/>\nto get kids to learn skills. By living life, kids will be using the  <br/>\nskills for real purposes and that&#39;s a far more efficient way to learn  <br/>\nthan because someone else thinks it&#39;s important.<br/>\n<br/>\nLittle kids master English by the time they&#39;re 5ish without a bit of  <br/>\ninstruction. But when Spanish instruction is forced on them in school,  <br/>\nit fails for most kids. Why is that if schools have a handle on how  <br/>\nkids learn?<br/>\n<br/>\nThis might help:<br/>\n<br/>\nWhy You Can&#39;t Let Go<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/talk\">http://sandradodd.com/joyce/talk</a><br/>\n<br/>\nProducts of Education<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/products\">http://sandradodd.com/joyce/products</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but they refuse to read a book.<br/>\n<br/>\n<br/>\n </span></blockquote>Surprising though it is, not everyone likes ice cream! From reports of  <br/>\nunschoolers, some kids don&#39;t like to read much. Some prefer nonfiction.<br/>\n<br/>\n*But* if your kids were in school or were forced to read, it&#39;s likely  <br/>\nthey&#39;re associating the force or any past humiliation at not being  <br/>\nable to read at the level they were &quot;supposed&quot; to with reading. It  <br/>\nwill take time for those associations to fade. What you can do is make  <br/>\nsure there&#39;s no pressure to ever read a book and their encounters with  <br/>\nprint are pleasant.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have tried taking them to the library often,<br/>\n<br/>\n </span></blockquote>Even my daughter who loved being read to and listening to books on CD  <br/>\ndidn&#39;t much like the library. The process of choosing was tedious and  <br/>\noverwhelming. She prefered for me to bring home a selection.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; reading to them myselves etc..<br/>\n<br/>\n </span></blockquote>If you&#39;re reading to them with the ulterior motive to get them to  <br/>\nread, it&#39;s likely they&#39;re picking that up. Read to them because you  <br/>\nenjoy the time with them :-)<br/>\n<br/>\nWhat if your husband wanted you to garden more and brought home potted  <br/>\nplants as gifts. At first they might feel like gifts but after a while  <br/>\nthey&#39;d start to feel like there were strings attached. And that he  <br/>\nwanted you to change to be more like the image in his head of the  <br/>\nperfect wife that gardened more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but being such a visual world I fear they don&#39;t use their  <br/>\n&gt; imaginations and get &quot;wrapped up&quot; in a book.<br/>\n<br/>\n<br/>\n </span></blockquote>As much as I love the printed word, it does a huge disservice to  <br/>\nvisual artists and learners to see what they love and are drawn to as  <br/>\nless than and not as good as.<br/>\n<br/>\nWhile reading is good for learning some things, it&#39;s not the be all  <br/>\nand end all of learning that society and school suggests it is.  <br/>\nSchools depend heavily on reading not because it&#39;s best but because it  <br/>\nallows them to use one teacher for 35 kids. If they were to all learn  <br/>\nhands on, or, horrors!, in ways that are unique to each child, they&#39;d  <br/>\nneed way more teachers. Like one for each student ;-)<br/>\n<br/>\nHere&#39;s some more:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/bookworship\">http://SandraDodd.com/bookworship</a><br/>\n<br/>\nLeonardo DaVinci didn&#39;t create great works of art by being limited to  <br/>\nseeing the world through the printed word. He needed images to build  <br/>\nfrom. He needed to see the world and what other artists did to build  <br/>\nfrom.<br/>\n<br/>\nThe two things writers can do to improve their writing is read a lot  <br/>\nand write. For visual artists and anyone who best builds an  <br/>\nunderstanding of the world through images, they need to see a lot.  <br/>\nThat means real life and what other artists have created, including  <br/>\ncartoons, video games and so on. And dancers and other athletes need  <br/>\nto move and see others move. Musicians and sound techs need to hear  <br/>\nand experience others making sounds. And food creators need to taste  <br/>\nand taste what others have created.<br/>\n<br/>\nThere isn&#39;t a master in this world who hasn&#39;t absorbed from  <br/>\nexperiencing the work of others. I don&#39;t want my meal made by someone  <br/>\nwho&#39;s never eaten others cooking and has only read books about it ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157246080,"authorName":"redsrandigene2","from":"&quot;redsrandigene2&quot; &lt;redsrandigene2@...&gt;","profile":"redsrandigene2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"unschooling but difficulties","postDate":"1272968152","msgId":43849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyb3M0bytuaTVxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43851,"prevInTime":43848,"nextInTime":43850,"topicId":43849,"numMessagesInTopic":0,"msgSnippet":"I am noticing the interest in learning in 2 of my children but the other two show no interest. how do I get them motivated on anything besides tv or playing","messageBody":"<div id=\"ygrps-yiv-446398900\">I am noticing the interest in learning in 2 of my children but the other two show no interest. how do I get them motivated on anything besides tv or playing outside? my twothat are interested in learning were actually begging for book work the other night.but how do i get them all interested in reading? I have taken care of the writing part and grammer but signing them up with penpals so they have to use handwriting sentence structure conversations creativity etc..but they refuse to read a book.I have tried taking them to the library often, reading to them myselves etc.. but being such a visual world I fear they don&#39;t use their imaginations and get &quot;wrapped up&quot; in a book. Help!!</div>","specialLinks":[]}],"prevTopicId":43817,"nextTopicId":43861}}