{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":214633431,"authorName":"patrick morris","from":"&quot;patrick morris&quot; &lt;katinandrea@...&gt;","profile":"pmorris1959","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Inner Struggle re:Teen","postDate":"1239721747","msgId":39531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzMjh1aitmYnBpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDkwNDEzMTUwN3Q3ZWMyYjQwZG9mZGJiODI4M2QyMDYzNDQyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39490,"nextInTopic":0,"prevInTime":39530,"nextInTime":39532,"topicId":39481,"numMessagesInTopic":0,"msgSnippet":"I felt especially helped by Faith s reply, which cut to the quick of what I need to hear. These are my further thoughts: 1) I do feel better when I try to stay","messageBody":"<div id=\"ygrps-yiv-1184113965\">I felt especially helped by Faith&#39;s reply, which cut to the quick of what I need to hear. These are my further thoughts:<br/>\n<br/>\n1) I do feel better when I try to stay connected. For example, last night I talked to my son about WOW and learned that a new dungeon is opening today which he has been awaiting several months and is very excited about. But maybe the need for a constant connection with a male is my issue and may harken to my relationship with my father which was pretty distant. Maybe I feel exaggeratedly rejected and turn that around into disparagement. <br/>\n<br/>\n2)I&#39;ll check out the Sandra Dodd site quotes. It is also correct that we could host our own teen unschooling gathering if we want to.<br/>\n<br/>\n3) The exploding is not something I generally do, but I didn&#39;t know how to bring these feelings forward in a productive way because I knew they were inappropriate, damaging to my son and about me. <br/>\n<br/>\n4) It is entirely right how imperative it is not to nag my son. I don&#39;t want this to be my relationship with him. I don&#39;t want him to have an internal voice (that comes from me) that damages his self-esteem or autonomy. And yet, I think I harbor the idea that one needs guilt or worry to be motivated about anything. Because these are such big factors with me.<br/>\n<br/>\n5) But the thoughts I need to continually explore are that the feelings I am having about my son dovetail with an emotional crisis  I am having: being 53, in the throes of perimenopause and facing the limits of my life. <br/>\n<br/>\nI feel that I have been straddling two worlds, the one I grew up with and the one I have with my unschooling son and untraditional,artist-husband. However, this straddling doesn&#39;t seem to be so successful or possible any more. I see the world I grew up with, and how I still identify with my mother, whom I found intrusively close, as a facsimile of living. I feel a loyalty to affirming that her approach to living is real when I know it is not. <br/>\n<br/>\nAfter years, of weeding out addictions, I now consider clothes-shopping as a compulsion. It tethers me to a false way of living and divides me from the introspective, more thoughtful work on myself and on my close relationships that bring meaning and direction. My son&#39;s path is not necessarily mine. I think that people drawn to psychotherapy are ones who need to be in this territory of understanding and working with inner pain and woundedness. Ideally, if I can take more seriously what unschooling my son at this stage is asking of me, he will live in genuineness without so much struggle. <br/>\n<br/>\nAndy</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Inner Struggle re:Teen","postDate":"1239666125","msgId":39490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzMGlrZCs3cHVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDkwNDEzLjE3MjYyOC4yODk0MS4wQHdlYm1haWwwMS52Z3MudW50ZC5jb20+"},"prevInTopic":39484,"nextInTopic":39531,"prevInTime":39489,"nextInTime":39491,"topicId":39481,"numMessagesInTopic":0,"msgSnippet":"... I have a 15yo, too. It helps me Not to think of The Future as this big looming thing. He is who he is Right Now. There s no rule that you have to shove him","messageBody":"<div id=\"ygrps-yiv-528189945\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Andrea Katin&quot; &lt;pinkydog@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I can&#39;t imagine him being motivated for college or even a job.<br/>\n<br/>\n </span></blockquote>I have a 15yo, too. It helps me Not to think of The Future as this big looming thing. He is who he is Right Now. There&#39;s no rule that you have to shove him out the door at 18 - and its still a ways away. A lot of things can happen in a year, let alone three.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he is more remote which seems developmentally normal but also unrewarding as a relationship<br/>\n </span></blockquote>****************<br/>\n<br/>\nTake a moment to think about what you wrote, there - it Is developmentally normal to be very inwardly focussed in the teen years. Ren calls it a cocooning stage. Yes, that means you see less of him for awhile, but you can still nurture and support him. He needs that right now. He needs his parents to still be parents - when you say &quot;unrewarding as a relationship&quot; you are implying he has a duty to take care of your emotional needs in some way. I suspect, from other things you wrote, that you don&#39;t really *think* that, but on some level you seem to be expecting it. That&#39;s something for you to think about.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Still, it is hard not to nag him, such as about showering or moving around or mixing up his activities.<br/>\n </span></blockquote>************************************<br/>\n<br/>\nOkay, I&#39;m not sure I understand you, but I&#39;m going to toss out a bunch of ideas anyway - hopefully they&#39;ll be useful to someone!<br/>\n<br/>\nBy showering, do you mean he has a strong body odor? Can you get some air fresheners? Maybe you can offer to do his laundry frequently if he doesn&#39;t want to shower often. Nagging doesn&#39;t often lead to people wanting to be gracious and thoughtful - instead look for ways to be actively more gracious and thoughtful, yourself. Is he embarrassed by his odor? If so, nagging is only going to make him more embarrassed.<br/>\n<br/>\nWhen you say &quot;moving around&quot; do you mean he&#39;s loud? Ray&#39;s often very loud when he moves - he has big feet and doesn&#39;t move very gently (although he&#39;s gotten better, he&#39;s also gotten Bigger). I know from unfortunate experience that nagging him doesn&#39;t make him one whit quieter, it just makes him self concious, which leads to him being clumsy, and even noisier. We&#39;ve done some rearranging so that the things he&#39;s most likely to bang around in the middle of the night (the computer chair, for example) aren&#39;t somewhere they&#39;ll disturb those of us who are trying to sleep.<br/>\n<br/>\nMixing up his activities - by this I assume you mean he doesn&#39;t have many activities and you&#39;d like him to do more? First, remember what I said about coccooning. He may Need to do less for a few years. Its okay to actively look for things you think he&#39;d like to do, though. What are his interests? Would he like to go to a &quot;ren fair&quot;? concert? music festival? poetry slam? I have no idea, obviously, so I&#39;m just tossing out ideas at random. Don&#39;t be attatched to the idea of him doing anything in particular, just be sure to &quot;strew&quot; his world with possibilities and see what he goes for.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Inner Struggle re:Teen","postDate":"1239660437","msgId":39484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDEzMTUwN3Q3ZWMyYjQwZG9mZGJiODI4M2QyMDYzNDQyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDIwMDkwNDEzLjE3MjYyOC4yODk0MS4wQHdlYm1haWwwMS52Z3MudW50ZC5jb20+","referencesHeader":"PDIwMDkwNDEzLjE3MjYyOC4yODk0MS4wQHdlYm1haWwwMS52Z3MudW50ZC5jb20+"},"prevInTopic":39481,"nextInTopic":39490,"prevInTime":39483,"nextInTime":39485,"topicId":39481,"numMessagesInTopic":0,"msgSnippet":"At 15, he is mostly into WOW and stays up quite late. There are times I feel connected to him and see what kind of emotionally healthy, warm and funny person","messageBody":"<div id=\"ygrps-yiv-2090977758\">At 15, he is mostly into WOW and stays up quite late. There are times I feel<br/>\nconnected to him and see what kind of emotionally healthy, warm and funny<br/>\nperson he is. But mostly, he keeps himself apart from me and my husband. And<br/>\nthough we ave been unschooling for several years, it seems more trying now.<br/>\nEither because &quot;the future&quot; looms or<br/>\nbecause he is more remote which seems developmentally normal but also<br/>\nunrewarding as a relationship.<br/>\n<br/>\n***That sounds like it is your issue. When you feel connected you can see<br/>\nhow awesome he is. Do you think he becomes less awesome when you feel<br/>\ndisconnected? I would try connecting more than instead of worrying about the<br/>\nfuture.<br/>\n<br/>\nI have been unschooling for ever (ok not really but a long time) and still<br/>\nissues keep coming up. I am constantly sorting out my own thoughts and<br/>\nissues.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-<br/>\n<br/>\nStill, it is hard not to nag him, such as about showering or moving around<br/>\nor mixing up his activities.<br/>\n<br/>\n***As hard as it may be it is important. Imperative even. Have you thought<br/>\nlong an hard about whether it is your issue or not? Is it worth the damage<br/>\nto his self image or autonomy?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nAlternatively, I restrain myself and then do some kind of general freak-out.<br/>\n<br/>\n<br/>\n***Does this help? I feel like it is better to talk about something before<br/>\nthe resent sinks in and seeps out (or explodes out). What are your fears?<br/>\nAre they truth, your truth or his?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-<br/>\n<br/>\nI wish I could approach this from a deeper perspective, manage my feelings<br/>\nbetter and offer him more faith and acceptance. It is hard on me to be<br/>\nfloundering and a beginner. It doesn&#39;t fit my image of myself, a<br/>\npsychoanalytic therapist and someone who feels she generally has insight<br/>\nabout emotional processes and relationships. But I am also coming from a<br/>\nfamily background that emphasizes education and traditional<br/>\nachievement. As ds gets older and the talk surrounding my extended family is<br/>\nmore about colleges, etc, that is hard.<br/>\n<br/>\n***Before you can accept your son where he is, you may need to accept where<br/>\nyou are. Something I read in Sandra Dodd&#39;s book, Moving a Puddle really<br/>\nresonated with me. I can&#39;t remember the exact quote nor find the book at the<br/>\nmoment...It was about how you are your child(ren)&#39;s mother not your mother&#39;s<br/>\nchild. It really heloped me to see that I can be my children&#39;s parent. I<br/>\ndon&#39;t have to follow the path laid before me.<br/>\nalso check out:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/quotes/\">http://sandradodd.com/quotes/</a><br/>\nthere are some real gems on there<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nWe are somewhat isolated as unschoolers in our community and I think that I<br/>\nam feeling rather alienated. Our experiences with going to conferences have<br/>\nbeen mixed. It seems that there has not been alot of emphasis on teens<br/>\nespecially for a shier child like our son who would need structure and help<br/>\nto make new acquaintances. And for whatever reason, perhaps having to do<br/>\nwith my own reserve or self image, it has been hard to get to know other<br/>\nunschooling parents, at least in a way that would be deep enough to feel<br/>\nsupportive<br/>\nor helpful.<br/>\n<br/>\n***Are there any local groups? There wasn&#39;t any in my area so I started one.<br/>\nI am working on a one day conference as well.<br/>\n<br/>\nI also look at my unschooling neighborhood to be about a 4 hour radius from<br/>\nmy house. I have recently driven to SC, NC, OH and TN (in the last 3 months)<br/>\nto be with unschooling friends. Some people are fortunate and have a closer<br/>\ncommunity but many of us travel. We travel a lot.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nHere is something I wrote a while back about my soon to be teen:<br/>\n<br/>\nI have an amazing and spirited 12 y/o dd as well. I try to hang on to<br/>\nthe memory of how hard it was to be within that transition. I think<br/>\nbeing unschooled helps with the roots and shoots of this change, it<br/>\ndoesn&#39;t mean that it won&#39;t be hard for them. My dd is cranky and moody<br/>\ntoo. I keep the same perspective that I have with her when she was<br/>\nyounger, she is exactly perfect right now, exactly how she is. It<br/>\nisn&#39;t always pleasant for me, but I try to remember how I felt as a<br/>\nchangling, who lost I felt and with no one to understand. I am just<br/>\nthere for her, completely.<br/>\n<br/>\nMy dd also has a bio-dad that isn&#39;t involved. One important things I<br/>\nread in your post is that he left her...I think that if you tweak your<br/>\nview it may be more clear. He left, it had nothing to do with her. I<br/>\ntell my dd whenever we talk about Gunar (bio-dad) that her loves her<br/>\nand cares about her but he doesn;t have the skills or personal power<br/>\nto be there for her. He is an alcoholic and a drug addict and is<br/>\nseverely depressed with PTSD (gulf war 1). He is totally incapable of<br/>\nbeing the father she needs. But she is assured of his love. She also<br/>\nhas a step-father who has been in her life since she was 5 1/2. He is<br/>\nthe father that she needs. It was  hard for them. Him coming into a<br/>\nfamily that lived so different. He didn&#39;t get unschooling for a long<br/>\ntime, especially the parenting part. He loves us and trusts so he<br/>\nlearned. They are close, although there is strain some times when she<br/>\nis having inner conflict.<br/>\n<br/>\nI think that the world does revolve around each of us. At least our<br/>\nown world. What I do when Max is in that space is give her an amazing<br/>\nworld to revolve around her :-) It is challenging, I have 1 1/2 y/odd<br/>\nand a 6 y/o ds (very similar to you) . We have had several talks about<br/>\nhow she can treat people (she likes to try out different things-some<br/>\ndon&#39;t work for our family). I found that it helped for us to write<br/>\ndown our principles. It was nice visual reminder of how our family<br/>\nlikes to live. Example, we speak and treat people with respect. That<br/>\nis why it is not ok to tell ds that she hates him. If she feels like<br/>\nshe hates him she can come to me. I will help that come to a resolve<br/>\nor separate them. That is why i don&#39;t allow the 6 y/o to hit her. Or<br/>\nthe baby to bite. Those things really hurt people.<br/>\n<br/>\nI find it helpful to focus on what she is doing right now. I focus on<br/>\nhow she is caring more about her space and her things, She is enjoying<br/>\ndecorating and maintaining her space. She is becoming more<br/>\nresponsible. She is trying out a lot before she finds the right fit.<br/>\nShe is seeing how others irl and on tv treat others. She tries it out<br/>\nand it works or it doesn&#39;t. If she was trying out a shirt that didn&#39;t<br/>\nwork you would tell her not be mad at her, right? It is basically the<br/>\nsame thing.<br/>\n<br/>\nI find that my dd has become less helpful but it makes sense to me.<br/>\nWhen she was little she followed me around and did what I did. When<br/>\nshe got a bit older she helped along side me. When she got a bit older<br/>\nshe did things on her own. Now she is at this precipice, she is about<br/>\nto take this huge leap of faith, is it worth it to be an adult? Are<br/>\nyou showing her to joy of grown up life? I notice that my dd has her<br/>\nown work right now. She is very busy taking videos, editting them and<br/>\nputting them on you-tube. She maintains her facebook account daily,<br/>\nand she is writing a novel.  Some times I don&#39;t see her for hours. I<br/>\ntake the time to remain connected, I bring her food or drink, I text<br/>\nmessage her (she loves that!) or I send her a email from our other<br/>\ncomputer. I just let her know I am there.<br/>\n<br/>\nI notice that she doesn&#39;t find the same things fun anymore. She<br/>\ndoesn&#39;t always want to go to the park when I take the little ones. She<br/>\ndoesn&#39;t grocery shop with me anymore. She has her own agenda. In a few<br/>\nshort years she will be off on some grand adventure, this is the<br/>\nstart. I am glad it is slow :-)<br/>\n<br/>\nOh I was coming a short point about cleaning. I just don&#39;t think it is<br/>\na priority right now for her, She enjoys the clean but it really just<br/>\ndoesn&#39;t matter. I didn&#39;t see dirty or mess until I was about 15. I<br/>\nremember it clearly. I never knew what my mother fussed about. Sure I<br/>\ndid what she asked and didn&#39;t really mind but I didn&#39;t get it. I know<br/>\nthat my dd is the same in that regard. I can ask her to do something<br/>\nand she generally will. Yet she rarely does something on her own. It<br/>\nis where she is right now. I can see this is changing a little bit<br/>\nalready. The other day she brought the trash cans back to our yard<br/>\nbecause the trash truck had come. She noticed them standing empty our<br/>\nfront.<br/>\n<br/>\nI think the most important thing to remember right  is that she is<br/>\ngoing through a huge flux or change. She is still herself but becoming<br/>\nas well.<br/>\nFaith<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":26151591,"authorName":"Andrea Katin","from":"&quot;Andrea Katin&quot; &lt;pinkydog@...&gt;","profile":"anisadancer1218","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Inner Struggle re:Teen","postDate":"1239657988","msgId":39481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDkwNDEzLjE3MjYyOC4yODk0MS4wQHdlYm1haWwwMS52Z3MudW50ZC5jb20+"},"prevInTopic":0,"nextInTopic":39484,"prevInTime":39480,"nextInTime":39482,"topicId":39481,"numMessagesInTopic":0,"msgSnippet":"I re-read Amy Child s article about her teengage son, (posted on Sandra Dodd s site). It fit the profile of my 15 yo son. I had read it before but was then","messageBody":"<div id=\"ygrps-yiv-736898855\">I re-read Amy Child&#39;s article about her teengage son, (posted on Sandra Dodd&#39;s site). It fit the profile of my 15 yo son. I had read it before but was then fixated on the outcome- that her son is going to college, the traditionally hoped for solution. At this point, while ds did well when he was in school (thru fourth grade) and is undoubtedly smart, I can&#39;t imagine him being motivated for college or even a job. Also, I am not sure that succumbing to the structure of college would be right for him.<br/>\n<br/>\nAt 15, he is mostly into WOW and stays up quite late. There are times I feel connected to him and see what kind of emotionally healthy, warm and funny person he is. But mostly, he keeps himself apart from me and my husband. And though we ave been unschooling for several years, it seems more trying now. Either because &quot;the future&quot; looms or <br/>\nbecause he is more remote which seems developmentally normal but also unrewarding as a relationship.<br/>\n<br/>\nStill, it is hard not to nag him, such as about showering or moving around or mixing up his activities. Alternatively, I restrain myself and then do some kind of general freak-out. I wish I could approach this from a deeper perspective, manage my feelings better and offer him more faith and acceptance. It is hard on me to be floundering and a beginner. It doesn&#39;t fit my image of myself, a psychoanalytic therapist and someone who feels she generally has insight about emotional processes and relationships. But I am also coming from a family background that emphasizes education and traditional <br/>\nachievement. As ds gets older and the talk surrounding my extended family is more about colleges, etc, that is hard.<br/>\n<br/>\nWe are somewhat isolated as unschoolers in our community and I think that I am feeling rather alienated. Our experiences with going to conferences have been mixed. It seems that there has not been alot of emphasis on teens especially for a shier child like our son who would need structure and help to make new acquaintances. And for whatever reason, perhaps having to do with my own reserve or self image, it has been hard to get to know other unschooling parents, at least in a way that would be deep enough to feel supportive <br/>\nor helpful.<br/>\n<br/>\nAny feedback of parents who have similar experiences or suggestions about getting more support or readings about how to handle the emotional or psychological end as a parent in this journey at the teenage years, would be helpful.<br/>\nThanks, Andy<br/>\n<br/>\n____________________________________________________________<br/>\nYou&#39;ll never forget how well you sleep on your new memory foam mattress. Click now!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thirdpartyoffers.juno.com/TGL2141/fc/BLSrjpTF6asp4Ez0XqrVUZc36CW862s6yzBpmXigWWLWOf\">http://thirdpartyoffers.juno.com/TGL2141/fc/BLSrjpTF6asp4Ez0XqrVUZc36CW862s6yzBpmXigWWLWOf</a><br/>\nwTSDpk2LCMM9q/</div>","specialLinks":[]}],"prevTopicId":39424,"nextTopicId":39543}}