{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":208642734,"authorName":"asmb65","from":"&quot;asmb65&quot; &lt;asmb65@...&gt;","profile":"asmb65","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:  Exhausted mommy -Was Transitioning","postDate":"1183799136","msgId":24884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2bmwxMCt1Y3I4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":24883,"nextInTime":24885,"topicId":24884,"numMessagesInTopic":0,"msgSnippet":"Oh Emilie, you sound truly exhausted. And you sound like an amazing mom. I often felt as you described in the first months with my second boy but I only had","messageBody":"<div id=\"ygrps-yiv-111390699\">Oh Emilie, you sound truly exhausted. And you sound like an amazing <br/>\nmom. I often felt as you described in the first months with my second <br/>\nboy but I only had two kids (although both nursing, co-sleeping) and we <br/>\nhad no traffic to deal with.<br/>\n<br/>\nLack of sleep is such a huge issue and it is so impossible to get any <br/>\nmore night time sleep when they are all so little with night times as <br/>\nthere are. So that leaves the day time. Does your three year old nap <br/>\nstill? Is there anyway you could have a quiet time during the <br/>\nyoungest&#39;s nap where you could at least rest if not actually sleep? I <br/>\nknow a friend who set up one room to be completely safe for her toddler <br/>\nso she could have a nap during the day. This may not work with your <br/>\nolder kids but perhaps something along these lines could.<br/>\n<br/>\nI know getting out the door must be almost impossible but I know for me <br/>\nmy kids are always calmer away from home if there are things to watch <br/>\netc. Would getting out for a walk make for a calmer time (and more <br/>\nrestful)? Or would it would too much keeping them together?<br/>\n<br/>\nIt would be amazing if you could somehow tie into some support groups <br/>\nor community programs so you&#39;d have more of a &quot;pool&quot; of other parents <br/>\nto help you out. It sounds like you are almost single parenting at the <br/>\nbusiest time (physically for mama) in your children&#39;s lives. Are there <br/>\ncommunity centers with free programs for parents and kids available <br/>\nlocally for you? Is there a local La Leche League group? Some LLL <br/>\ngroups have someone to watch the kids in an adjacent room while the <br/>\nmoms talk. This is what our group does - the kids come and go checking <br/>\nin with mom or staying completely with mom if that is their preference. <br/>\nI think you said you were in Canada - I don&#39;t know how it is in other <br/>\nprovinces but in BC there is a public health unit which knows of all <br/>\nlocal parent programs. Check the blue pages if you have public health <br/>\noffices in your province.<br/>\n<br/>\nI hope you can somehow get some more rest. Your goals and hopes will be <br/>\nso much easier when you are not so tired. Time will also make a huge <br/>\ndifference - I used to continually repeat &quot;this too shall pass&quot; in my <br/>\nhead over and over. Especially when it was 11 a.m., I was still in my <br/>\npajamas with ds2 in the sling, hadn&#39;t yet had breakfast let alone a cup <br/>\nof tea and ds1 was talking a mile a minute and intensely asking for <br/>\nhelp with project number 47 of the morning.<br/>\n<br/>\nWishing calm and energy for you.<br/>\nSusan<br/>\n<br/>\n&lt;snip&gt;<br/>\n<blockquote><span title=\"qreply\"> &gt; How do others with loads of tiny children manage RU? I want to make <br/>\n&gt; my life more difficult in order to gain a better relationship with my <br/>\n&gt; kids, but I start losing it at some undetermined point of difficulty. <br/>\n&gt; How do I give them this? I have given them the gift of each other, <br/>\n&gt; which they love and cherish. How do I give them RU too? I know there <br/>\n&gt; is a way. I just need a little more direction.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; <br/>\n&gt; Emilie </span></blockquote></div>","specialLinks":[]}],"prevTopicId":24867,"nextTopicId":24891}}