{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Friends for &quot;special needs&quot; children","postDate":"1340904568","msgId":48699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzaTQ5bys2c2RyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDA5MDA3NTcuNDgxOTcuWWFob29NYWlsTmVvQHdlYjE2MTAwNi5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":48698,"nextInTopic":0,"prevInTime":48698,"nextInTime":48700,"topicId":48698,"numMessagesInTopic":0,"msgSnippet":"... Rather than focusing on friends in a generalistic sort of way, it could help to look at the things your kids like to do and ways for them to meet others","messageBody":"<div id=\"ygrps-yiv-1267767002\"><blockquote><span title=\"ireply\">&gt;&gt;how I can help them meet people that would actually accept them?<br/>\n<br/>\n </span></blockquote>Rather than focusing on &quot;friends&quot; in a generalistic sort of way, it could help to look at the things your kids like to do and ways for them to meet others with the same interests. I wouldn&#39;t expect kids older than 6 or 7 to just &quot;make friends&quot; at random - they&#39;ll want to connect with people who are like them. When kids are in school, some of this is bridged by shared experience - same with kids who go to the same church or are members of the same minority group. Those sorts of relationships aren&#39;t necessarily durable, though - they&#39;re more like the kid version of a support group. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;there is strong discomfort because Ellie doesn&#39;t act &quot;normal&quot;.  She has that exuberant, joyful, no-inhibitions type personality (that I love) but other kids aren&#39;t used to.<br/>\n </span></blockquote>******************<br/>\n<br/>\nDo you let other people know that beforehand? Do you help the kids play so there&#39;s a minimum of confusion and misunderstanding? If not, that may be part of the problem - other kids are overwhelmed and frustrated. On top of that, if you daughter doesn&#39;t share their interests there&#39;s going to be a gap right away. There&#39;s Already a gap if she&#39;s homeschooled and they go to school.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Ellie is always very kind and cheerful to the other kids - she is physically affectionate, too....like to pat the friend gently on the back or give them a hug, etc.  It must bother them.  <br/>\n </span></blockquote>***************<br/>\n<br/>\nIf you&#39;re right there, helping her, you can see if it bothers them and let her know. Some kids don&#39;t like to be touched! My daughter doesn&#39;t - she&#39;d be out the door if another 10yo hugged her on the first meeting. If you can&#39;t be right there with her, it&#39;s important to let her know not to touch people who don&#39;t want to be touched - if she can&#39;t read body language well enough to know, then tell her to let other people initiate touching. But it&#39;s better if you can help her read situations. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;they see them outside playing with other children<br/>\n<br/>\n </span></blockquote>If they want to connect with the kids in the neighborhood, what about organizing something for a bunch of kids to do on a regular basis? Something based on your kids&#39; interests. Hold a movie marathon or video game fest, a day spa, or an art-n-crafts day. Group events take a bit of management to be sure everyone&#39;s having a good time, so get ready to be the super-duper hostess to facilitate the fun. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":222408004,"authorName":"Kristy","from":"Kristy &lt;once_twice_1111@...&gt;","profile":"once_twice_1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Friends for &quot;special needs&quot; children","postDate":"1340900757","msgId":48698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDA5MDA3NTcuNDgxOTcuWWFob29NYWlsTmVvQHdlYjE2MTAwNi5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":48699,"prevInTime":48697,"nextInTime":48699,"topicId":48698,"numMessagesInTopic":0,"msgSnippet":"My youngest two children were born with Sotos syndrome.  It is an overgrowth syndrome but it affects their milestones - so they are behind in everything.  My","messageBody":"<div id=\"ygrps-yiv-1881570144\">My youngest two children were born with Sotos syndrome.  It is an overgrowth syndrome but it affects their milestones - so they are behind in everything.  My ten year old is affected quite heavily, while the 7 year old is almost &quot;normal&quot;.  They are both girls.  Anyway, I can&#39;t seem to seem to find ways to bring friends into their lives.  When we get into a situation where they meet children, whether it&#39;s their age or younger/older, they play once and there is strong discomfort because Ellie doesn&#39;t act &quot;normal&quot;.  She has that exuberant, joyful, no-inhibitions type personality (that I love) but other kids aren&#39;t used to.  So if she was with a ten year old girl, she would seem like a four year old in actions.  Does this make sense?  I can feel that it makes the &quot;normal&quot; child uncomfortable.  (and believe me, I don&#39;t think my kids are abnormal - I&#39;m just explaining this as other people see her....which is not &#39;normal&#39;).  Okay, so after the first<br/>\n time playing, they never come over again, they never invite us over again, and poor little Ellie (AND Chloe, my youngest), are left asking questions and wanting SO much to go play again.  I never know what to say to them - I make excuses like they&#39;re busy, or whatever...but they see them outside playing with other children.  Ellie is always very kind and cheerful to the other kids - she is physically affectionate, too....like to pat the friend gently on the back or give them a hug, etc.  It must bother them.  My heart is just emotionally breaking - I feel like sobbing for them.  They want so much to be a part of some friendships but nobody will accept them.  They are beautiful physically, it&#39;s just Ellie&#39;s &quot;younger&quot; emotional age that seems to push people away.  Does anybody have any ideas whatsoever as to how I can help them meet people that would actually accept them?  I am at a  loss as to what to do.  I live in a small town of 6000 people<br/>\n but there is one a half hour away that has 20,000 in it.  Thank you... Love, Kristy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48657,"nextTopicId":47314}}