{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"NY Unschoolers - ALERT","postDate":"1119571381","msgId":5678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNi1EQVYyMjVCQzk3MkU1ODNEOTRBQjQyMjg0RDFFQTBAcGh4LmdibD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":5677,"nextInTime":5679,"topicId":5678,"numMessagesInTopic":0,"msgSnippet":"Hey Tempe from Columbia County. We travel your way frequently through the winter to ski at Jiminy Peak and other local bumps for my dd s ski team. AND speaking","messageBody":"<div id=\"ygrps-yiv-993375265\">Hey Tempe from Columbia County.<br/>\nWe travel your way frequently through the winter to ski at Jiminy Peak and other local bumps for my dd&#39;s ski team.<br/>\n<br/>\nAND speaking of NY....there is a bill being presented to the legislation that will eliminate the option of parents submitting year end assessments.  Tempe, please notify you&#39;re local h&#39;schooling families to catch up on this threat to our current rights, as restrictive as they may currently seem the new legislation could do major damage.<br/>\n<br/>\nAll NY homeschoolers should be aware of this situation and call their local representative indicating they oppose the bill.  Forward the information to you local homeschooling friends and groups.  See email below....<br/>\n<br/>\n--------------------------------------------------------------------------<br/>\nIn case any of you have not been following the discussions on NY-Alert we are once again being threatened with changes to our homeschooling regulations.  The current bill submitted removes the option for parents to submit year end assessments.  This is a major threat to our rights as homeschooing parents.  AND for those of you who thought LEAH was in support of the bill, look again.  LEAH has just issued a statement opposing the bill.  This bill was initially instigated by the HSLDA several years ago and as feared by the homeschoolers opposing the HSLDA&#39;s bill the government did exactly as expected...took the intention of HSLDA to reduce regulations and modified it to tighten and eliminate parental freedoms.<br/>\n<br/>\nCALL./WRITE/EMAIL/FAX your local representative NOW.  Start by saying &quot;I oppose bill S3641A.&quot;  Do not start by indicating you are a homeschooler, because their is an assumption that when homeschoolers call they are calling in support of the bill.  PLEASE READ BELOW for information telling how to contact your local representative..<br/>\n<br/>\nLisa<br/>\n--------------------------------<br/>\nThe following has been clipped from the NY-Alert list.<br/>\n<br/>\nHello fellow homeschoolers,<br/>\nBecause of the recent changes to S3641 (now S3641A), LEAH has issued a<br/>\nnotice opposing the bill in its current form.  I don&#39;t think they<br/>\nwould mind if I post an excerpt here.  So now if we all<br/>\ncall/write/fax, hopefully our legislators will get the message.  <br/>\n<br/>\nHere are the web sites where you can find your senator and assemblyman<br/>\nand call them.  It&#39;s a very quick call.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.senate.state.ny.us/senatehomepage.nsf/senators\">http://www.senate.state.ny.us/senatehomepage.nsf/senators</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.assembly.state.ny.us/mem/\">http://www.assembly.state.ny.us/mem/</a><br/>\nOR use the capwiz link in the note below.<br/>\n<br/>\n--------------------------------------------------<br/>\n<br/>\nDear Friends and Members of LEAH:<br/>\n<br/>\nIMPORTANT ALERT - CALL TO ACTION: State Senate Bill S3641 has been <br/>\namended - The amended version takes away the eligibility of the<br/>\nparents to <br/>\nbe the ones to provide the written narrative when the alternate form of <br/>\nevaluation is used for the annual assessment.  The leadership of LEAH <br/>\nconsiders this to be a significant change in the wrong direction.  We <br/>\nurge you to contact your State Senator and tell them that the amended <br/>\nversion, known as S3641-A, is no longer acceptable.  This bill should<br/>\nnow be opposed in its current form.  To find out who your State<br/>\nSenator is, you can go to capwiz.com/hslda/home/   You may also call<br/>\n518-455-3216 for more information on your State Senator.<br/>\n<br/>\nBACKGROUND:<br/>\nNew York has the dubious distinction of being one of the most<br/>\ndifficult states in which to homeschool because of its complex and<br/>\nstrict regulations. For many years, LEAH has been working to get them<br/>\nreduced.  After years of refused overtures to the SED, most recently<br/>\nin 2000, then-State Senator Randy Kuhl introduced legislation in 2001<br/>\nthat would significantly reduce the homeschooling requirements.  This<br/>\nbill passed the State Senate in 2003, and again in 2004.  It had been<br/>\nproceeding through the approval process for 2005. Unfortunately, for<br/>\nreasons unknown at this time, the bill was amended.  We are seeking<br/>\nclarification at this time as to the reasons why and will let you know<br/>\nwhat we find out.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":5668,"nextTopicId":5682}}