{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":296390071,"authorName":"adana","from":"&quot;adana&quot; &lt;adrianabogdan.a@...&gt;","profile":"adana19itis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"US moms from NY, Astoria/Ditmars","postDate":"1209401556","msgId":32196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2NHZjaytmNmZqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":32195,"nextInTime":32197,"topicId":32196,"numMessagesInTopic":0,"msgSnippet":"I m the US-interested mom, of a 2 years and a half DD (dear daughter), Delia Not yet convinced, but rather interested in US, I would like to met and conect","messageBody":"<div id=\"ygrps-yiv-1944007333\">I&#39;m the &quot;US-interested&quot; mom, of a 2 years and a half DD (dear<br/>\ndaughter), Delia<br/>\nNot yet convinced, but rather interested in US, I would like to met<br/>\nand conect with some of you, US people, living close to us. Please let<br/>\nus know, if we can met, if we can do together some of the things you<br/>\ndo with your kids.<br/>\n<br/>\nWish to here from you soon, Adana, mom to Delia<br/>\n<br/>\nP.S.I will add a presentation of mine that I sent to the group of moms<br/>\nin Astoria:<br/>\n<br/>\n&quot;Hi,<br/>\nMy name is Adriana (Adana), I&#39;m 33 and I have a daughter of 2 years<br/>\nand 8 months.<br/>\nI don&#39;t speak English well and I will not be able to write messages<br/>\nlike this without help from my friends. Thus, please don&#39;t be upset if<br/>\nI am not able to answer too quickly.<br/>\nI&#39;m looking for an English teacher, so if you know anyone who is good,<br/>\nplease recommend him/her to me.<br/>\n<br/>\nI don&#39;t know exactly what to tell you about us. We have been living<br/>\nhere for a year and a half and we will be staying for roughly another<br/>\nyear and a half after which we return to our native country, Romania.<br/>\n<br/>\nMy most ardent preoccupation lately has been to look for activities<br/>\nfor my little girl. This is because I&#39;m trying to find new ways to<br/>\nstimulate her, to entertain her and to give her the chance to discover<br/>\nwhat is more interesting for her in this world. I&#39;ve selected so far<br/>\nfrom what places like Steinway church, Children&#39;s Museum of The Arts,<br/>\nAppleseeds, MoonSoup and others have to offer. For the time being I&#39;ve<br/>\ndecided to sign her up at MoonSoup and at Children&#39;s Museum of The Arts.<br/>\n<br/>\nHowever, what I&#39;m most interested in is to find that kind of<br/>\nactivities that could suit best the HomeSchooling or the UnSchooling<br/>\nphilosophy. I&#39;m curious if there are other mothers in this group who<br/>\npractice homeschooling or are thinking of doing this and if they can<br/>\nrecommend some suitable activities that complement harmoniously the<br/>\nway they raise their children and that fit Delia&#39;s age as well.<br/>\nI&#39;d be very glad, in case they exist, if they allowed me to come among<br/>\nthem, to see what they do and how they do it. In what form this could<br/>\nhappen, it&#39;s not clear to me yet.<br/>\nI think that for me it would be very difficult to practice either of<br/>\nthese two forms of free education at the moment because I was raised<br/>\nmyself in a classical manner, based on punishments and rewards, and I<br/>\ncannot make out very clearly how things can be done differently.<br/>\nI mean, I don&#39;t behave like this with Delia, or, more specifically, I<br/>\ntry to be careful and not to do it. But I really believe that children<br/>\nare natively endowed with the learning ability and we just have to<br/>\nexpose them to information, just teach them to search and they will be<br/>\ncapable to do the rest. Hence, the activities that I&#39;m looking for now<br/>\nare rather amusing, interesting and less centered on necessarily<br/>\nobtaining some end products, or certain skills. I see them more as a<br/>\npresentation of some interesting things, some of which the child will<br/>\nfeel tempted to do andâ¦ surprise, someone will be there to help her,<br/>\nto guide her. And this comes above teaching her. Besides the arguments<br/>\nbrought by US and HS, I feel that at this stage in her life it is<br/>\nimportant to have around her several key persons of diverse ages â&quot;as<br/>\ndiverse as possible- whom she could meet constantly and from whom she<br/>\ncould learn. Because here, we are more or less isolated.<br/>\n<br/>\nAnd since I opened the discussion on education, I would like to add<br/>\nthat I am now reading Alfie Kohn and Donald Winnicott with great pleasure.<br/>\n<br/>\nI will end here for the moment, I no longer want to torture my friend<br/>\nwho helps me with the translation. I hope I have let you know me a<br/>\nlittle and I also<br/>\nhope that I will be able to get to know you gradually and that my<br/>\nEnglish will allow me to do so as much as possible.<br/>\nI think you will get to know Delia by justâ¦ seeing her in action. She<br/>\nis wonderful and radiant and beautiful &#61514;.<br/>\nUnfortunately I didn&#39;t manage to post pictures, I suppose they were<br/>\ntoo large and I don&#39;t know exactly how to make them smaller.<br/>\n<br/>\nBest,<br/>\nAdriana&quot;</div>","specialLinks":[]}],"prevTopicId":32149,"nextTopicId":32202}}