{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":59,"messages":[{"userId":193861946,"authorName":"Sheila","from":"&quot;Sheila&quot; &lt;luv2lrnhs@...&gt;","profile":"swtmntn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Opinions wanted on Unschooling","postDate":"1097758329","msgId":3602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrbHNwcCtpMzl2QGVHcm91cHMuY29tPg=="},"prevInTopic":3600,"nextInTopic":3603,"prevInTime":3601,"nextInTime":3603,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"... I got ... people who ... *do* know ... I m glad you have written about this.  We ve just moved this summer to a new area (actually my old home town).","messageBody":"<div id=\"ygrps-yiv-1344709568\"><blockquote><span title=\"ireply\">&gt; The point is I have become emotionally in miserable turmoil because <br/>\n </span></blockquote>I got<br/>\n<blockquote><span title=\"ireply\"> &gt; involved in not one but two &quot;how to school&quot; conversations with <br/>\n </span></blockquote>people who<br/>\n<blockquote><span title=\"ireply\"> &gt; are not interested in Unschooling. I should have known better. I <br/>\n </span></blockquote>*do* know<br/>\n<blockquote><span title=\"ireply\"> &gt; better.<br/>\n&gt; <br/>\n </span></blockquote>I&#39;m glad you have written about this.  We&#39;ve just moved this summer <br/>\nto a new area (actually my old home town).  Anyway, I&#39;ve been going <br/>\nto quite a few different support group meetings in the area.  I want <br/>\nto allow myself to get a feel of how each is run.  Since we&#39;ve <br/>\ndecided to unschool, I&#39;ve found many of the support groups do not <br/>\nhelp me in my endeavor.  I found one right in town that have a <br/>\nmixture of homeschooling philosophies, but quite a few unschoolers.  <br/>\nI also found myself leaning towards them and really listening when <br/>\nthey would share.  Recently I found out there is a branch of this <br/>\ngroup which is an unschooling group.  I plan on going to the first <br/>\nmeeting Monday night and am looking so forward to it.   With all that <br/>\nsaid, I have found that I need to hang with &quot;like-minded&quot; people.  <br/>\nUnschooling floats in my soul but does not come out naturally for <br/>\nme.  It does with my husband though.  Anytime we talk about what we <br/>\nwant for the kids, his approach is total natural learning.  Mine is <br/>\nschool baggage.  Hanging with like-minded people on-line or at groups <br/>\nallows me to grow more confident each day with this adventure, just <br/>\nas the actual choice to homeschool did in the beginning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; We can live our lives in fear of catastrophe, and keep looking to an<br/>\n&gt; imagined disastrous future. Or we can acknowledge that even with <br/>\n </span></blockquote>the best of<br/>\n<blockquote><span title=\"ireply\"> &gt; intentions our children *might* end up in PS because of some <br/>\n </span></blockquote>external force,<br/>\n<blockquote><span title=\"ireply\"> &gt; but in the mean time we can make the present as wonderful as <br/>\n </span></blockquote>possible. If we<br/>\n<blockquote><span title=\"ireply\"> &gt; live in fear we never leave the house and never cross the road. If <br/>\n </span></blockquote>we live<br/>\n<blockquote><span title=\"ireply\"> &gt; in the joyful present we need have no regrets should some horrible<br/>\n&gt; unforeseen event cloud the future.  <br/>\n&gt; <br/>\n </span></blockquote>Thank you for this too.  One woman share  the other night at a <br/>\nmeeting about a situation where her friend unschooled her children.  <br/>\nShe said &quot;I always wondered what they were learning and felt -not <br/>\nmuch because they appeared to be doing nothing all of the time.&quot; The <br/>\nfriend came upon financial difficulty and had to go back to work <br/>\ntherefore putting her children in PS.  This woman shared how the kids <br/>\nwere way behind in their grades and were having an awful time in PS <br/>\n(like an I told you so).  She shared she &quot;schools&quot; grade specific <br/>\nbecause if anything happened to her, she&#39;d want her children to be <br/>\nready for PS.  Well that put the fear of God in me.  So off I went <br/>\nfor the next two days ready to look into Sonlight curriculum, <br/>\nfiguring this just wasn&#39;t going to work.  Then my kids came down and <br/>\nsat with my mother and I to watch the debates.  12 1/2 and almost <br/>\n11!  I realized I didn&#39;t ask them to.  They wanted to watch the <br/>\ndebates!  I thought of my nieces in PS and told myself, I can <br/>\nguarantee they are not wanting to see what each candidate believes <br/>\nin.  It led into some discussion, etc. etc.  So I&#39;m holding on and <br/>\nwatching as my kids prove how learning is so natural.  They are <br/>\nteaching me!  ;)<br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097757653","msgId":3600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWM0YjFlYiQwZDA2OGFlMCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGNidW42ZitsaDVrQGVHcm91cHMuY29tPiA8TklCQkxER0hLTENFQkxBT0RGRktDRU1BQ01BQS52aXJnaW5pYUBhcG9sbG93ZWJ3b3Jrcy5jb20+IDxkMjU1MzZmMzA0MTAxMzE3MDU1YTdhZTMwYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":3599,"nextInTopic":3602,"prevInTime":3599,"nextInTime":3601,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":" Why?  I have a Master s of Science degree from the University of Houston and never","messageBody":"<div id=\"ygrps-yiv-168910039\">&lt;&lt;&lt;&lt;I do think an appreciation of algebra and calculus is a good<br/>\nthing,&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhy?  I have a Master&#39;s of Science degree from the University of Houston and never took calculus, don&#39;t even know what it is for particularly.  In my life, I am much more likely to need to know the attack points of a particular Yu-Gi-Oh monster than some type of math higher than division.<br/>\n<br/>\nSo of course, calculus is fine and dandy for those interested in it but certainly not necessarily a &quot;good thing&quot; for someone longing to do something else.<br/>\n<br/>\nAnd yes, I think the term eclectic describes what you are doing very well.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: dana tierney <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, October 13, 2004 7:05 PM<br/>\n  Subject: Re: [unschoolingbasics] Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n  well<br/>\n<br/>\n  I&#39;ve been told I am not &quot;really&quot; an unschooler, but here is some input<br/>\n  for what it is worth. Please note that I am not interested in<br/>\n  suggestions on how to unschool in a politically correct manner; what<br/>\n  we do works for us.<br/>\n<br/>\n  It is not clear to me who is ill at your house, but I have found that<br/>\n  the flexibility of unschooling accomodates itself admirably to<br/>\n  doctor&#39;s appointments, procedures, and hospital stays.<br/>\n<br/>\n  Certain members of the unschooling community seem to feel that college<br/>\n  is &quot;bad&quot; and this gives me pause; it may not be necessary or ideal for<br/>\n  every child but you know what? I loved college, personally. So I think<br/>\n  it is important to allow the child to chose, rather than specifically<br/>\n  discouraging academic or non-academic pursuits.<br/>\n<br/>\n  It troubles me somewhat when I see people proudly proclaiming<br/>\n  themselves to be radical unschoolers in posts full of misspellings and<br/>\n  sentence fragments. Fortunately these are a minority of unschooling<br/>\n  parents, and I tell myself that just as childen survive bab schools<br/>\n  their children will survive their unschooling parents.<br/>\n<br/>\n  I personally do think that childen, when left to themselves, often<br/>\n  choose pursuits that would confound the skeptics. I personally do feel<br/>\n  the need to intervene every so often and assign a specific book that I<br/>\n  know they can read though it might be a bit hard to start -- Kim by<br/>\n  Rudyard Kipling was the last one.<br/>\n<br/>\n  Our particular sticking point is math, where they are falling somewhat<br/>\n  behind.  I do think an appreciation of algebra and calculus is a good<br/>\n  thing, and it is one of those things like brushing your teeth where<br/>\n  the benefit is not immediately apparent.  Actually, if anyone has a<br/>\n  suggestion on *that* (besides don&#39;t worry about it cause they wll when<br/>\n  they are ready) then I might like to hear it.<br/>\n<br/>\n  Perhaps I should describe myself as a mixed or eclectic unschooler,<br/>\n  but I have been around the mulberry bush with the politically correct<br/>\n  on the various lists that I am not much interested in the labels<br/>\n  anymore. Some people take unschooling to the point that they think you<br/>\n  should allow the child to sleep as late as he/she likes and act as<br/>\n  he/she pleases. I don&#39;t go there. I may be a laissez-faire parent but<br/>\n  I feel it is my role to be a parent and be authoritative when the<br/>\n  situation requires it.<br/>\n<br/>\n  To answer your husband&#39;s concern about college; my own difficulties<br/>\n  along this line are that they tell me that my 14yo is too young and<br/>\n  they won&#39;t even consider him until he&#39;s 16. Otherwise I&#39;d say he&#39;s as<br/>\n  ready as your average community college freshman, math problems and<br/>\n  all.<br/>\n<br/>\n  Hope this frank appraisal of pros and cons as I see them helps you a little. <br/>\n<br/>\n  Dana<br/>\n<br/>\n  On Tue, 12 Oct 2004 20:14:32 -0500, Virginia Glasser<br/>\n  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a>&gt; wrote:<br/>\n  &gt; <br/>\n  &gt; I&#39;m for unschooling, my husband is not. I would like to gather as many<br/>\n  &gt; objective opinions(if that&#39;s possible) as I can,  regarding this approach to<br/>\n  &gt; homeschooling. I would love to hear from anyone who has given it a shot and<br/>\n  &gt; failed miserably, as well as from those who love it and are very successful,<br/>\n  &gt; or from those falling any where in between. I also want to hear from folks<br/>\n  &gt; who have teens, and hear from people who are grown who might have been<br/>\n  &gt; unschooled. I know this is a tall order but I&#39;m really needing all the input<br/>\n  &gt; I can get. Thanks!<br/>\n  &gt; <br/>\n  &gt; Virginia Glasser<br/>\n  &gt; StampinUp! Demonstrator<br/>\n  &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\n  &gt; I&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\n  &gt; Ask me how you can earn free stamping or scrapbooking supplies!<br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; Yahoo! Groups Links<br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt;<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Opinions wanted on Unschooling","postDate":"1097757565","msgId":3599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlZC4yY2M3NDFjMi4yZTlmY2Q3ZEBhb2wuY29tPg=="},"prevInTopic":3598,"nextInTopic":3600,"prevInTime":3598,"nextInTime":3600,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/14/2004 1:01:25 AM Eastern Daylight Time, jecaam28@yahoo.com writes: Well, I  *want* to get it. but just can t seem to. I can t let go of","messageBody":"<div id=\"ygrps-yiv-1699747281\">In a message dated 10/14/2004 1:01:25 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jecaam28@...\">jecaam28@...</a> writes:<br/>\n<br/>\nWell, I  *want* to get it. but just can&#39;t seem to. I can&#39;t let go of <br/>\nthe baggage  and jump in. I really like the idea but waver from family <br/>\npressure. I was  just about to decide to give up and homeschool after <br/>\ntalking to a school  teacher while getting my car fixed, talking to my <br/>\naunt who had talked to  her friend who was a shoolteacher who <br/>\nmentioned a homeschooled child who  had returned to school and was <br/>\n*behind* and she had to *catch* him up  (whew!...sorry), and trying to <br/>\ngive answers to &quot;how&#39;s the homeschooling  going&quot; from other friends <br/>\nand family members, and trying to integrate my  husbands comfort <br/>\nlevel, then I read this thread. I just feel like we are  doing nothing <br/>\nand my kids will be so far behind, and what if this doesn&#39;t  work out <br/>\nand we send them back to school, and what if..., and what if...  ugh!  <br/>\nI have to defend SO many of my positions to people because they  <br/>\naren&#39;t the *norm*. Do I really want to add another one? And one on  <br/>\nsuch a sensitive subject for _my family_ (mip://05d4a9a0/my%20family) ? <br/>\nCollege was not an option in  <br/>\nmy family it was just the next step. I come from a family of school  <br/>\nteachers from way back. I can see the point you make about doing what  <br/>\nyou are passionate about. I am 33 and have just now found mine. I  <br/>\nthink I knew when I was 20, I just didn&#39;t know what to do with it.  <br/>\nWould I if I had been unschooled? Would I have known sooner? I don&#39;t  <br/>\nknow. I&#39;m so very confused and frustrated and feel like I&#39;m doing no  <br/>\ngood by my children right now and maybe I should have just kept them  <br/>\nin school.  But if I can get past this, I can see how this could be  <br/>\nSO good! How do you let go of the baggage?  &lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nSorry you&#39;re struggling so much, Jennifer!<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I have to defend SO many of my positions to people because they  <br/>\n </span></blockquote>aren&#39;t the *norm*. Do I really want to add another one? &lt;&lt;&lt;<br/>\n <br/>\nWhat&#39;s one more? &lt;g&gt;<br/>\n <br/>\nIt takes a pretty thick skin to get through the first year or so of  <br/>\nunschooling.<br/>\n <br/>\nYou will hear a lot of negative comments from well-meaning family members,  <br/>\nfriends, and even strangers-----and they *are* well-meaning! They really think  <br/>\nyou are making a grave mistake and are trying to save you a ton of regret and <br/>\n pain. But what do *you* think----in your heart? Do you think that 12 to 14  <br/>\nyears of school will make a person worthy? That good grades make you more  <br/>\nworthy? That learning can only happen when it&#39;s taught? In a classroom? From  <br/>\n8:30-3:00? For 180 days a year? <br/>\n <br/>\nI thought a lot of that. Brainwashing at its finest! &lt;g&gt; Private  schools, <br/>\ngood grades, college. <br/>\n <br/>\nI spent my junior year of college in Vienna, Austria. I got to see a  <br/>\ndifferent world. It changed my views on a lot of things----especially what is  <br/>\nimportant to learn/know---for *me* anyway. And I STILL put my precious baby in  <br/>\nschool at four years old! The same private school I went to!<br/>\n <br/>\nI spent all day sometimes at the school helping out in the classroom or in  <br/>\nthe parent resource room. Room mom. Volunteer. Chaperone. Field trip planner.  <br/>\nParents&#39; Board. I did it all. I was incredibly involved with the school,  with <br/>\nthe classroom, and with Cameron&#39;s learning/grades/homework.<br/>\n <br/>\nBut I watched this child who was filled with wonder for everything, who  <br/>\nlooked for reasons to ask questions and see answers, who threw himself into  <br/>\nprojects and imaginative play, who LOVED to LEARN----I watched this sweet boy  <br/>\nslowly stop caring and stop learning and -----he had what I read in Stephen  <br/>\nKing&#39;s book _It_. Those dead lights. Staring eyes with no life in them? That&#39;s  <br/>\nwhat he&#39;d become. A twelve year old with dead lights.<br/>\n <br/>\nCameron mentioned to me one night (it was the eve of his birthday  night, in <br/>\nfact) that he would like to be homeschooled. I laughed and said  something not <br/>\nvery nice. Then I started thinking about it. I went to the library  and <br/>\nchecked out every book on homeschooling. I found John Holt among them and  was <br/>\nchanged overnight. (Well, I knew what I wanted; I just didn&#39;t know how to  get <br/>\nthere! &lt;g&gt;)<br/>\n <br/>\nMy mother and my in-laws thought I&#39;d lost my mind. How could a ROOM MOM  turn <br/>\nagainst schools? &lt;g&gt; Oddly, their biggest concerns seemed to be  <br/>\nsocial----and I don&#39;t mean that in the same way most people do. The grandmothers  were <br/>\nmost worried about football and the prom! LOL<br/>\n <br/>\nMy father put my mother in her place by saying that all the  homeschooling <br/>\nmothers he&#39;d met had been very smart and caring. The kids  seemed better off <br/>\nwith homeschooling than with school. My dad&#39;s an adolescent  psychiatrist! &lt;G&gt;<br/>\n <br/>\nCameron spent the first year getting algebra and history questions from the  <br/>\naunts and uncles (a nurse, a doctor, and a teacher! ugh!). I put a stop to <br/>\nthat  by asking *them* a few math and history questions (like which high school <br/>\ndid  Ben Franklin graduate? how many unschoolers did it take to sign a <br/>\nDeclaration of  Independence? &lt;g&gt;). But I always felt on the defensive--- and I didn&#39;t <br/>\n like it. I decided to change tactics: I asked them----no, I *told* them---to <br/>\nlay  off the boys. I don&#39;t drill their children. Don&#39;t drill mine!<br/>\n <br/>\nThat worked as far as the boys were concerned<br/>\n <br/>\nBut then *their* kids started noticing how much freedom our children had.  <br/>\nThat made for some *very* uncomfortable situations. &quot;Why can&#39;t...? How come...?  <br/>\nBut Cameron can...! Why not?&quot;<br/>\n <br/>\nIt&#39;s kind of like the stages of grief/ You know----denial, anger,  <br/>\nbargaining, acceptance? That&#39;s what it seemed like every time we got together!  <br/>\n---although there wasn&#39;t a whole lot of the acceptance part! &lt;g&gt;<br/>\n <br/>\nBeing comfortable with your decision is the first step---knowing in your  <br/>\nheart that you&#39;re dong the right thing. That unschooling is GOOD for you and  <br/>\nyour kids. Start writing here---you have a willing audience! Other  newbies <br/>\nlooking for ways to get over this hump too. The more you do it, the  better you get <br/>\n(kind of like learning, huh? &lt;g&gt;). If you can  defend/explain unschooling <br/>\nhere on this e-list to the &quot;newbi-ers&quot; coming in,  well, that&#39;s a good start in <br/>\nhelping you to find the words you need IRL. (You  can always delete here until <br/>\nyou get it right! &lt;G&gt;) I&#39;ve seen a lot of  folks here recently starting to <br/>\npaddle out to answer questions! Getting  their feet wet! <br/>\n <br/>\nYou can just avoid the in-laws and aunts by saying that you&#39;re gong to  try <br/>\nthis for a year and that, if it doesn&#39;t work out, you can always send  them <br/>\nback to school or purchase a curriculum. One year won&#39;t make that much  <br/>\ndifference. And you can say that every year! &lt;G&gt;<br/>\n<br/>\n <br/>\nYou can tell them to back off, they&#39;re your children, you&#39;ll make the  <br/>\ndecisions, thank you very much.<br/>\n <br/>\nYou can smile and say, &quot;Thanks for your opinion; I&#39;ll take it under  <br/>\nconsideration. Please pass the bean dip.&quot;<br/>\n <br/>\nYou can hand them a book list (John Holt, Frank Smith, Valerie  Fitzenreiter, <br/>\nMary Griffith) and give them an assignment: &quot;Read these and when  you&#39;re <br/>\ndone, I&#39;ll administer the test. If you fail, you don&#39;t get to make any  more <br/>\ncomments on the children&#39;s education.&quot;<br/>\n <br/>\nA huge smile and a &quot;Unschooling&#39;s GREAT! Wonderful! I can&#39;t believe how  <br/>\nhappy everyone is! How much we&#39;re learning! God, I wish we&#39;d done this sooner!&quot;  <br/>\ncan go a long way too! &lt;G&gt;<br/>\n <br/>\n-=-=-=-=-=-=-=-<br/>\n <br/>\nIt&#39;s simple, but it&#39;s hard.<br/>\n <br/>\nGetting to the paradigm shift takes a lot of thinking and doing. You know  <br/>\nit&#39;s the right thing, but you just can&#39;t get to that point where it&#39;s &quot;natural&quot;  <br/>\nor &quot;flowing&quot; or whatever. I made the commitment to unschool *months* before  <br/>\nactually being able to put it into practice. I understood it, but it just  <br/>\nwouldn&#39;t come. Then one day, it just seemed clear----and all this negativity  <br/>\njust disappeared. I had been doing what Sandra and Joyce and Anne and Mary and  <br/>\nPam had been telling me to do: play with the children, watch them, do for them, <br/>\n be with them---and it just clicked.<br/>\n <br/>\nWHEN it clicks, you&#39;re going to be doing that V-8 hand against the head  <br/>\nthing because it&#39;s *so simple*---it&#39;s just hard! &lt;G&gt;<br/>\n <br/>\nAvoid the peopple who don&#39;t understand---they&#39;re feeding you doubts. As  soon <br/>\nas you&#39;re comfortable with what you&#39;re doing, you can go back and explain  <br/>\nwith better words what it is you&#39;re doing and why. But letting them add stress  <br/>\nand raoadblocks to your life will only make it harder to get where you&#39;re  <br/>\ngoing.<br/>\n <br/>\nOh, Gawd---I sound like the cult brainwasher! &lt;G&gt; &quot;Cut off all  contact with <br/>\nthe outside world until you believe as I do!&quot;  Yikes! LOL I  guess that&#39;s how <br/>\nschool works so well at brainwashing sheeple!  &lt;G&gt;<br/>\n <br/>\nBuit seriously, the more unschoolers you can surround youself with IRL, the  <br/>\neasier it will be the emulate them and make the shift.<br/>\n <br/>\nLosing the baggage is very, very gradual----until one day, it&#39;s just GONE.  <br/>\nBut every day, if you can say yes just one extra time or see the learning that  <br/>\nhappens during a video game or watch the joy in your child&#39;s eyes when he  <br/>\nmasters something----if you can accept these things as unschooling, then the  <br/>\nbaggage will get lighter and lighter until it&#39;s gone.<br/>\n <br/>\nIf you have specific questions, ask away----there may be a newbie out here  <br/>\nwho wants to tell her story and explain it to you!<br/>\n<br/>\n~Kelly<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193861946,"authorName":"Sheila","from":"&quot;Sheila&quot; &lt;luv2lrnhs@...&gt;","profile":"swtmntn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Opinions wanted on Unschooling","postDate":"1097757439","msgId":3598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrbHJ0ditsbGpqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ0NjBBNjQ3LTFEMzEtMTFEOS1BNTVBLTAwMEE5NTdFRkU0NkBtYWMuY29tPg=="},"prevInTopic":3595,"nextInTopic":3599,"prevInTime":3597,"nextInTime":3599,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"... that ... added ... as ... Thank you Pam for that link.  I read it and it actually helped me as I start this adventure into unschooling.  We do that entire","messageBody":"<div id=\"ygrps-yiv-1221880663\"><blockquote><span title=\"ireply\">&gt; You might want to print out the &quot;Unschooling Course of Study&quot;  &lt;g&gt; <br/>\n </span></blockquote>that <br/>\n<blockquote><span title=\"ireply\"> &gt; I have adapted from one written originally by Carol Narigon and <br/>\n </span></blockquote>added <br/>\n<blockquote><span title=\"ireply\"> &gt; material from our state standards and some other stuff. Your father <br/>\n&gt; might be very calmed by it.<br/>\n&gt; <br/>\n&gt; You can get it here: <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://homepage.mac.com/pamsoroosh/iblog/unschooling/index.html\">http://homepage.mac.com/pamsoroosh/iblog/unschooling/index.html</a>&gt;.<br/>\n&gt; <br/>\n&gt; If you&#39;d like it as a word file, email me offlist and I&#39;ll send it <br/>\n </span></blockquote>as <br/>\n<blockquote><span title=\"ireply\"> &gt; an attachment.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Thank you Pam for that link.  I read it and it actually helped me as <br/>\nI start this adventure into unschooling.  We do that entire course of <br/>\nstudy!  (LOL)  If there are any other links or books you can suggest, <br/>\nplease feel free to suggest them.  I&#39;m just about to begin &quot;Teach <br/>\nYour Own&quot; by John Holt.<br/>\n<br/>\nThanks again.  <br/>\nSheila</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097739354","msgId":3595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGQyNTUzNmYzMDQxMDEzMTcwNTVhN2FlMzBiQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":3594,"nextInTopic":3598,"prevInTime":3594,"nextInTime":3596,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1250914732\">&lt;&lt;&lt;&lt;It troubles me somewhat when I see people proudly proclaiming<br/>\nthemselves to be radical unschoolers in posts full of misspellings and<br/>\nsentence fragments. Fortunately these are a minority of unschooling<br/>\nparents, and I tell myself that just as childen survive bab schools<br/>\ntheir children will survive their unschooling parents.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhat sort of schools did you say? &quot;bab&quot; schools? &quot;Surviving their parents&quot; -<br/>\nwhat an offensive concept to post here.<br/>\n<br/>\nEveryone makes typos. I usually only mention them when the meaning really is<br/>\nunclear, if I am trying to understand. Computerized spell checkers don&#39;t<br/>\nwork when the word is simply another real word - like &quot;lose&quot; and &quot;loose&quot;.<br/>\nMost of us are snatching at our emails between the needs of our children for<br/>\nattention, or hurrying late at night to get them done. Many of us write in a<br/>\ncolloquial style, reminiscent of our verbal communication. Some of us are<br/>\neven people for whom English is a second language, or like me come from an<br/>\nEnglish speaking country that yet has different spellings. And yes, some of<br/>\nus are lousy spellers. BTW the grammar checker on my computer gave me an<br/>\n&quot;alert&quot; - green underlining - for some of the prior paragraph.<br/>\n<br/>\n&lt;&lt;&lt;I personally do think that childen, when left to themselves, often<br/>\nchoose pursuits that would confound the skeptics. I personally do feel<br/>\nthe need to intervene every so often and assign a specific book that I<br/>\nknow they can read though it might be a bit hard to start -- Kim by<br/>\nRudyard Kipling was the last one.&gt;&gt;&gt;<br/>\n<br/>\nNo one is going to come to your house and force you to fully Unschool.<br/>\nHowever I will never assign a book in the way you mention, because I hope<br/>\nthat Jayn will enjoy reading, and not find me dividing books into easy<br/>\nversus &quot;a bit hard to start&quot;. My opinion on that issue may differ from hers.<br/>\nIf she does not enjoy reading despite choosing the material for herself, all<br/>\nthe assigning in the world would not make it more pleasurable for her, or<br/>\nmake the books themselves more memorable. Jayn&#39;s needs for self<br/>\ndetermination outweigh any residual need to control that I may have.<br/>\n<br/>\n&lt;&lt;&lt;Our particular sticking point is math, where they are falling somewhat<br/>\nbehind.  I do think an appreciation of algebra and calculus is a good<br/>\nthing, and it is one of those things like brushing your teeth where<br/>\nthe benefit is not immediately apparent.  Actually, if anyone has a<br/>\nsuggestion on *that* (besides don&#39;t worry about it cause they wll when<br/>\nthey are ready) then I might like to hear it.&gt;&gt;&gt;<br/>\n<br/>\nTrying to tell people what to reply or not reply to you is a bit of a &quot;red<br/>\nrag to a bull&quot;. It is likely to raise the devilish desire to post exactly<br/>\nwhat you are not interested in hearing in some of us. <br/>\n<br/>\nNor are you the only person on the list who may be struggling with the same<br/>\nissues at any time, so suggestions are really to anyone who can make use of<br/>\nthem. I find that just when I am about to post a question, someone else will<br/>\npost about the same concern.<br/>\n<br/>\nSo guess what - don&#39;t worry about it, they will do it when they are ready -<br/>\nunless the adults in their life make &quot;it&quot; (any &quot;it&quot;) into a power struggle<br/>\nand a pain - then they will fight doing it even if they would have been<br/>\nready.<br/>\n<br/>\n&lt;&lt;&lt;Perhaps I should describe myself as a mixed or eclectic unschooler,<br/>\nbut I have been around the mulberry bush with the politically correct<br/>\non the various lists that I am not much interested in the labels<br/>\nanymore. &gt;&gt;&gt;<br/>\n<br/>\nOne of the purposes of this list is to clarify the definition of Unschooling<br/>\nand describe how it works in people&#39;s lives. Labels are important for the<br/>\npurposes of the list, even if in practical life you choose to eschew them -<br/>\nexcept I notice when you refer to your kids as &quot;falling somewhat behind&quot;. <br/>\n<br/>\n&lt;&lt;&lt;Some people take unschooling to the point that they think you<br/>\nshould allow the child to sleep as late as he/she likes and act as<br/>\nhe/she pleases. I don&#39;t go there. &gt;&gt;&gt;&gt;<br/>\n<br/>\nThis list &quot;goes there&quot; cyclically. Check the archives.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;I may be a laissez-faire parent but<br/>\nI feel it is my role to be a parent and be authoritative when the<br/>\nsituation requires it.&gt;&gt;&gt;&gt;<br/>\n<br/>\nLet&#39;s hear about the situations. It could generate some great thought<br/>\nprovoking discussion.<br/>\n<br/>\n&lt;&lt;&lt;&lt;To answer your husband&#39;s concern about college; my own difficulties<br/>\nalong this line are that they tell me that my 14yo is too young and<br/>\nthey won&#39;t even consider him until he&#39;s 16. Otherwise I&#39;d say he&#39;s as<br/>\nready as your average community college freshman, math problems and<br/>\nall.&gt;&gt;&gt;<br/>\n<br/>\nCan he audit some classes to see if they are fun? At the least it might give<br/>\nhim a really good idea of which ones he would want to enroll in when the<br/>\ntime comes.<br/>\n<br/>\n&lt;&lt;&lt;&lt;Hope this frank appraisal of pros and cons as I see them helps you a<br/>\nlittle.&gt;&gt;&gt;&gt; <br/>\n<br/>\nThe only con I got from this is that some parents aren&#39;t good spellers. The<br/>\nrest is you not actually fully committing to Unschooling, as you say in your<br/>\nfirst paragraph.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.773 / Virus Database: 520 - Release Date: 10/5/2004</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Opinions wanted on Unschooling","postDate":"1097734871","msgId":3594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNrbDEycSs5dnVnQGVHcm91cHMuY29tPg=="},"prevInTopic":3593,"nextInTopic":3595,"prevInTime":3593,"nextInTime":3595,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1326348251\">&lt;&lt;&lt;&lt; I was just about to decide to give up and homeschool after <br/>\ntalking to a school teacher while getting my car fixed, talking to my <br/>\naunt who had talked to her friend who was a shoolteacher who <br/>\nmentioned a homeschooled child who had returned to school and was <br/>\n*behind* and she had to *catch* him up (whew!...sorry), and trying to <br/>\ngive answers to &quot;how&#39;s the homeschooling going&quot; from other friends <br/>\nand family members, and trying to integrate my husbands comfort <br/>\nlevel, then I read this thread.&gt;&gt;&gt;<br/>\n<br/>\nThis is why I try so hard not to do school or HOME school conversations. I<br/>\nhave an utterly committed husband and we are both absolutely Rad.<br/>\nUnschoolers, but even I get distressed on the rare occasions that I am<br/>\ninvolved in even listening to other people on the subject of how they &quot;have<br/>\nto&quot; force their child to do X.<br/>\n<br/>\nJust last Tuesday a woman was saying that she has a minimum number of<br/>\nsentences that she makes her 8 year old write (copy out in a penmanship<br/>\nbook) every day. She considers 3 sentences to be that number - but the poor<br/>\nlittle girl gets to choose what those sentences are. I couldn&#39;t get away. I<br/>\nhave actually been losing sleep and crying at home because I wasn&#39;t able to<br/>\nsay anything to convince her that fighting her dd as she is, is just so<br/>\nwrong - partly because all the smart eloquent sentences that I would have<br/>\nliked to orate simply didn&#39;t arrive in my brain - still haven&#39;t. <br/>\n<br/>\nAll I know is that this mother who is so loving and trusting of her infant,<br/>\nseems not to be able to extend that to her older dd&#39;s. She is considering<br/>\nthe purpose of handwriting to be demonstrating a developmental milestone<br/>\nthat her daughter is failing to meet - and so basically is telling her dd<br/>\nthat she is a failure on a daily basis.<br/>\n<br/>\nI consider the purpose of writing to be to make a record of my thoughts and<br/>\nsometimes to convey those thoughts to others. The thoughts can be as basic<br/>\nas a shopping list. If I couldn&#39;t hold a pen as some people can&#39;t maybe I<br/>\ncould still type or use a recording device of some sort, but I would still<br/>\nhave ideas. I wanted to ask that other mother if she considers the ideas of<br/>\nStephen Hawking to be valueless because he is unable to write them out for<br/>\nhimself.<br/>\n<br/>\nThis same mother &quot;tried Unschooling&quot; but since her daughter took that as an<br/>\nopportunity to &quot;do nothing&quot; she forgot how to form the letters she had<br/>\n&quot;learnt&quot; previously. Another person who thought erroneously that Unschooling<br/>\nmeant the parent sits back and waits for their child to spontaneously create<br/>\na six subject workday complete with book reports and pages of math problems.<br/>\n***Sigh***<br/>\n<br/>\nThis came on top of my very foolishly getting into a &quot;forcing history<br/>\nlessons and quizzing is not an Unschooling approach and not what John Holt<br/>\nrecommended&quot; conversation on my local list. The response has been a lot of<br/>\n&quot;let&#39;s all get along&quot; and people quoting definitions of Unschooling from<br/>\nsources hostile to Unschooling. A bit like sending someone interested in<br/>\nlearning about Wicca to Jerry Falwell for a definition.<br/>\n<br/>\nThe point is I have become emotionally in miserable turmoil because I got<br/>\ninvolved in not one but two &quot;how to school&quot; conversations with people who<br/>\nare not interested in Unschooling. I should have known better. I *do* know<br/>\nbetter.<br/>\n<br/>\n &lt;&lt;&lt;&lt;&lt;I just feel like we are doing nothing <br/>\nand my kids will be so far behind, and what if this doesn&#39;t work out <br/>\nand we send them back to school, and what if..., and what if... ugh!  <br/>\nI have to defend SO many of my positions to people because they <br/>\naren&#39;t the *norm*. Do I really want to add another one? And one on <br/>\nsuch a sensitive subject for my family? College was not an option in <br/>\nmy family it was just the next step. I come from a family of school <br/>\nteachers from way back. &gt;&gt;&gt;&gt;<br/>\n<br/>\nLimit (or eliminate for now) the conversations. They are making you crazy.<br/>\nLet your children be the proof of the pudding *in due course* - after all<br/>\nyou can&#39;t rush a masterpiece and if you keep opening the oven door you spoil<br/>\nthe baking (mixed yet I think appropriate metaphors).<br/>\n<br/>\nWe can live our lives in fear of catastrophe, and keep looking to an<br/>\nimagined disastrous future. Or we can acknowledge that even with the best of<br/>\nintentions our children *might* end up in PS because of some external force,<br/>\nbut in the mean time we can make the present as wonderful as possible. If we<br/>\nlive in fear we never leave the house and never cross the road. If we live<br/>\nin the joyful present we need have no regrets should some horrible<br/>\nunforeseen event cloud the future.  <br/>\n<br/>\nIt sounds macabre, but I sometimes think what if Jayn came down with some<br/>\ndisease, or was hurt or killed in an auto accident (the largest cause of<br/>\ndeath and injury for people between the ages of 1 and 18 - more than all<br/>\nothers combined according to govt. stats). Would I be wishing I had spent<br/>\nmore time going over the basics of addition and drilling her on the state<br/>\ncapitals? Or would I be wishing we could cuddle again and I could listen to<br/>\nher singing a song of her own devising as she plays with several of her<br/>\nlittle princess castles, as she is at this moment across the room?<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.773 / Virus Database: 520 - Release Date: 10/5/2004</div>","specialLinks":[]},{"userId":188974416,"authorName":"jecaam28","from":"&quot;jecaam28&quot; &lt;jecaam28@...&gt;","profile":"jecaam28","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Opinions wanted on Unschooling","postDate":"1097729946","msgId":3593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrbDEycSs5dnVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlkLjUwZDM4MGRlLjJlOWUxN2MzQGFvbC5jb20+"},"prevInTopic":3592,"nextInTopic":3594,"prevInTime":3592,"nextInTime":3594,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"... make ... Well, I *want* to get it. but just can t seem to. I can t let go of the baggage and jump in. I really like the idea but waver from family ","messageBody":"<div id=\"ygrps-yiv-73919402\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I like talking with folks who *want* to get it---who are looking to <br/>\n </span></blockquote>make  <br/>\n<blockquote><span title=\"ireply\"> &gt; that paradigm shift----who want to let go of the side and jump in.<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n </span></blockquote>Well, I *want* to get it. but just can&#39;t seem to. I can&#39;t let go of <br/>\nthe baggage and jump in. I really like the idea but waver from family <br/>\npressure. I was just about to decide to give up and homeschool after <br/>\ntalking to a school teacher while getting my car fixed, talking to my <br/>\naunt who had talked to her friend who was a shoolteacher who <br/>\nmentioned a homeschooled child who had returned to school and was <br/>\n*behind* and she had to *catch* him up (whew!...sorry), and trying to <br/>\ngive answers to &quot;how&#39;s the homeschooling going&quot; from other friends <br/>\nand family members, and trying to integrate my husbands comfort <br/>\nlevel, then I read this thread. I just feel like we are doing nothing <br/>\nand my kids will be so far behind, and what if this doesn&#39;t work out <br/>\nand we send them back to school, and what if..., and what if... ugh!  <br/>\nI have to defend SO many of my positions to people because they <br/>\naren&#39;t the *norm*. Do I really want to add another one? And one on <br/>\nsuch a sensitive subject for my family? College was not an option in <br/>\nmy family it was just the next step. I come from a family of school <br/>\nteachers from way back. I can see the point you make about doing what <br/>\nyou are passionate about. I am 33 and have just now found mine. I <br/>\nthink I knew when I was 20, I just didn&#39;t know what to do with it. <br/>\nWould I if I had been unschooled? Would I have known sooner? I don&#39;t <br/>\nknow. I&#39;m so very confused and frustrated and feel like I&#39;m doing no <br/>\ngood by my children right now and maybe I should have just kept them <br/>\nin school.  But if I can get past this, I can see how this could be <br/>\nSO good! How do you let go of the baggage?<br/>\n<br/>\nJennifer <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097725307","msgId":3592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhkLjE3N2I2OWJhLjJlOWY0ZjdiQGFvbC5jb20+"},"prevInTopic":3586,"nextInTopic":3593,"prevInTime":3591,"nextInTime":3593,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/13/2004 8:07:14 PM Eastern Daylight Time, dana.tierney@gmail.com writes: well I ve been told I am not really an unschooler, but here is","messageBody":"<div id=\"ygrps-yiv-3459394\">In a message dated 10/13/2004 8:07:14 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dana.tierney@...\">dana.tierney@...</a> writes:<br/>\n<br/>\nwell<br/>\n<br/>\nI&#39;ve been told I am not &quot;really&quot; an unschooler, but here is  some input<br/>\nfor what it is worth. Please note that I am not interested  in<br/>\nsuggestions on how to unschool in a politically correct manner;  what<br/>\nwe do works for us.&lt;&lt;&lt;&lt;<br/>\n <br/>\nAnd since Virginia asked for different people&#39;s experiences and opinions on  <br/>\nunschooling, I&#39;ll let it slide for the most part. But as a radical unschooler, <br/>\nI  *will* point out that trust is the foundation of unschooling. So not <br/>\ntrusting  that a child will read and do math isn&#39;t really unschooling. Assigning <br/>\nbooks and  math problems is not showing trust in the philosophy that children <br/>\n*will* do  these things when they&#39;re ready. Assuming that your children are <br/>\nfalling behind  in any &quot;subject&quot; isn&#39;t showing respect of where that child is in <br/>\nhis life&#39;s  journey.<br/>\n <br/>\nBut Dana *did* say she wasn&#39;t an unschooler, so....<br/>\n <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Certain members of the unschooling community seem  to feel that college<br/>\n </span></blockquote>is &quot;bad&quot; and this gives me pause; it may not be  necessary or ideal for<br/>\nevery child but you know what? I loved college,  personally. So I think<br/>\nit is important to allow the child to chose, rather  than specifically<br/>\ndiscouraging academic or non-academic  pursuits.&lt;&lt;&lt;&lt;<br/>\n <br/>\nI think *any* coerced education is bad. And coersion can come in the form  of <br/>\nsocietal expectations. Going to college just because it&#39;s what you&#39;re  <br/>\nsupposed to do isn&#39;t a goal of unschooling. <br/>\n<br/>\nI loved college too. Had a blast. And I didn&#39;t dislike grammar school,  <br/>\nmiddle school, or high school either. Of course, I had no other options. But I  had <br/>\ngood teachers (overall). I learned a lot. And I had fun. I look back  now and <br/>\nthink of so much more I *could* have done withOUT school, and it&#39;s  <br/>\nstaggering. Hindsight being what it is and all. <br/>\n <br/>\nI try to balance it out. Most folks think that college is a necessary step  <br/>\nfor success. It&#39;s important to understand (and not just as unschoolers; <br/>\neveryone  should understand this!) that college is not the be-all-end-all. It&#39;s not a <br/>\n guarantee of a happy, successful, joyful life. It&#39;s NOT. It *can* be a great <br/>\n place to spend a few years. It can be a great place to meet interesting <br/>\npeople.  It can be a great place to discover something new. It can be a great <br/>\nplace  to learn about life semi-on-your-own   But it&#39;s not the only  place or the <br/>\nonly way.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;It troubles me somewhat when I see people proudly  proclaiming<br/>\n </span></blockquote>themselves to be radical unschoolers in posts full of  misspellings and<br/>\nsentence fragments. Fortunately these are a minority of  unschooling<br/>\nparents, and I tell myself that just as childen survive bab  schools<br/>\ntheir children will survive their unschooling  parents.&lt;&lt;&lt;&lt;<br/>\n <br/>\nWho is this? On this board? On U-D? On A-L? I see much more of that with  the <br/>\ncrazed curriculum users. They&#39;re *teaching* improper grammar because they  <br/>\ndon&#39;t know better. The *most* articulate homeschoolers *I* see are the  <br/>\nunschoolers. Hands down.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I personally do think that childen, when left  to themselves, often<br/>\n </span></blockquote>choose pursuits that would confound the skeptics. I  personally do feel<br/>\nthe need to intervene every so often and assign a specific  book that I<br/>\nknow they can read though it might be a bit hard to start -- Kim  by<br/>\nRudyard Kipling was the last one.&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nI think the key phrase here is &quot;Children, when left to themselves, CHOOSE  <br/>\npursuits!&quot;<br/>\n <br/>\nIt&#39;s amazing, but children WILL choose to pursue different activities and  <br/>\npassions when they get to choose.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Our particular sticking point is math, where they  are falling somewhat<br/>\n </span></blockquote>behind.  I do think an appreciation of algebra and  calculus is a good<br/>\nthing,&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nUnschoolers appreciate algebra and calculus; we just don&#39;t try to cram it  <br/>\ndown our children&#39;s throats. We see it in our everyday lives and help point it  <br/>\nout or explain it. We also never feel our children are behind  themselves. <br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;and it is one of those things like brushing your teeth  where<br/>\n </span></blockquote>the benefit is not immediately apparent.  Actually, if anyone has  a<br/>\nsuggestion on *that* (besides don&#39;t worry about it cause they wll  when<br/>\nthey are ready) then I might like to hear it.&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nAnd teeth brushing is NOT an unschooling issue. (It can be a radical  <br/>\nunschooling issue.) But a parent who is willing to force-feed algebra or  Kipling <br/>\nshould have no problem forcing a toothbrush in a child&#39;s  mouth.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Perhaps I should describe myself as a mixed or eclectic  unschooler,<br/>\n </span></blockquote>but I have been around the mulberry bush with the politically  correct<br/>\non the various lists that I am not much interested in the  labels<br/>\nanymore.&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nEclectic HOMEschooler. UNschooling is a different critter altogether.<br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Some people take unschooling to the point that they think  you<br/>\n </span></blockquote>should allow the child to sleep as late as he/she likes and act  as<br/>\nhe/she pleases. &lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nRadical unschoolers. That would be the listowners and the list moderators,  <br/>\nfor sure. &lt;g&gt;<br/>\n <br/>\nMy boys sleep until they are finished sleeping. Why would I purposefully  <br/>\ndeprive them of sleep by waking them before they are well-rested? <br/>\n <br/>\nAct as they please? I just spent an hour (between starting and finishing  <br/>\nthis post) listening to my eight year old&#39;s crying over the fact that there are  <br/>\nmurderers in the world. And mean people. And guns. He behaves the absolute <br/>\nbest  that he can at all times. His best may not be good enough for some people, <br/>\nbut  he&#39;s kind and considerate and loving and wants to please. And he&#39;ll <br/>\ngather more  and more control over himself as he gets older---as we all do. He acts <br/>\nas he  pleases.<br/>\n <br/>\n <br/>\nI think it&#39;s important on an unschooling list to give out unschooling  <br/>\nadvice, but this post was in reference to a request for anti-unschooling  <br/>\nopinions----which is what she got. Lying on a float in the kiddie pool  isn&#39;t swimming. <br/>\n&lt;g&gt; I won&#39;t let non-unschooling advice/opinions  go unanswered on my list.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":190129650,"authorName":"dana tierney","from":"dana tierney &lt;dana.tierney@...&gt;","profile":"danaelyn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097712323","msgId":3586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyNTUzNmYzMDQxMDEzMTcwNTVhN2FlMzBiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLQ0VNQUNNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg==","referencesHeader":"PGNidW42ZitsaDVrQGVHcm91cHMuY29tPgkgPE5JQkJMREdIS0xDRUJMQU9ERkZLQ0VNQUNNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg=="},"prevInTopic":3583,"nextInTopic":3592,"prevInTime":3585,"nextInTime":3587,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"well I ve been told I am not really an unschooler, but here is some input for what it is worth. Please note that I am not interested in suggestions on how to","messageBody":"<div id=\"ygrps-yiv-1130174989\">well<br/>\n<br/>\nI&#39;ve been told I am not &quot;really&quot; an unschooler, but here is some input<br/>\nfor what it is worth. Please note that I am not interested in<br/>\nsuggestions on how to unschool in a politically correct manner; what<br/>\nwe do works for us.<br/>\n<br/>\nIt is not clear to me who is ill at your house, but I have found that<br/>\nthe flexibility of unschooling accomodates itself admirably to<br/>\ndoctor&#39;s appointments, procedures, and hospital stays.<br/>\n<br/>\nCertain members of the unschooling community seem to feel that college<br/>\nis &quot;bad&quot; and this gives me pause; it may not be necessary or ideal for<br/>\nevery child but you know what? I loved college, personally. So I think<br/>\nit is important to allow the child to chose, rather than specifically<br/>\ndiscouraging academic or non-academic pursuits.<br/>\n<br/>\nIt troubles me somewhat when I see people proudly proclaiming<br/>\nthemselves to be radical unschoolers in posts full of misspellings and<br/>\nsentence fragments. Fortunately these are a minority of unschooling<br/>\nparents, and I tell myself that just as childen survive bab schools<br/>\ntheir children will survive their unschooling parents.<br/>\n<br/>\nI personally do think that childen, when left to themselves, often<br/>\nchoose pursuits that would confound the skeptics. I personally do feel<br/>\nthe need to intervene every so often and assign a specific book that I<br/>\nknow they can read though it might be a bit hard to start -- Kim by<br/>\nRudyard Kipling was the last one.<br/>\n<br/>\nOur particular sticking point is math, where they are falling somewhat<br/>\nbehind.  I do think an appreciation of algebra and calculus is a good<br/>\nthing, and it is one of those things like brushing your teeth where<br/>\nthe benefit is not immediately apparent.  Actually, if anyone has a<br/>\nsuggestion on *that* (besides don&#39;t worry about it cause they wll when<br/>\nthey are ready) then I might like to hear it.<br/>\n<br/>\nPerhaps I should describe myself as a mixed or eclectic unschooler,<br/>\nbut I have been around the mulberry bush with the politically correct<br/>\non the various lists that I am not much interested in the labels<br/>\nanymore. Some people take unschooling to the point that they think you<br/>\nshould allow the child to sleep as late as he/she likes and act as<br/>\nhe/she pleases. I don&#39;t go there. I may be a laissez-faire parent but<br/>\nI feel it is my role to be a parent and be authoritative when the<br/>\nsituation requires it.<br/>\n<br/>\nTo answer your husband&#39;s concern about college; my own difficulties<br/>\nalong this line are that they tell me that my 14yo is too young and<br/>\nthey won&#39;t even consider him until he&#39;s 16. Otherwise I&#39;d say he&#39;s as<br/>\nready as your average community college freshman, math problems and<br/>\nall.<br/>\n<br/>\nHope this frank appraisal of pros and cons as I see them helps you a little. <br/>\n<br/>\nDana<br/>\n<br/>\nOn Tue, 12 Oct 2004 20:14:32 -0500, Virginia Glasser<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I&#39;m for unschooling, my husband is not. I would like to gather as many<br/>\n&gt; objective opinions(if that&#39;s possible) as I can,  regarding this approach to<br/>\n&gt; homeschooling. I would love to hear from anyone who has given it a shot and<br/>\n&gt; failed miserably, as well as from those who love it and are very successful,<br/>\n&gt; or from those falling any where in between. I also want to hear from folks<br/>\n&gt; who have teens, and hear from people who are grown who might have been<br/>\n&gt; unschooled. I know this is a tall order but I&#39;m really needing all the input<br/>\n&gt; I can get. Thanks!<br/>\n&gt; <br/>\n&gt; Virginia Glasser<br/>\n&gt; StampinUp! Demonstrator<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\n&gt; I&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\n&gt; Ask me how you can earn free stamping or scrapbooking supplies!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154349067,"authorName":"Rachel and Carson Milgroom","from":"&quot;Rachel and Carson Milgroom&quot; &lt;rachelcarson@...&gt;","profile":"nodipes4us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097709398","msgId":3583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2UwMWM0YjE3YSRiNTUxYTYxMCQ2NDAxYThjMEBSQUNIRUw+","referencesHeader":"PDFlNC4yY2I1YWMzOC4yZTllMTVjNEBhb2wuY29tPg=="},"prevInTopic":3582,"nextInTopic":3586,"prevInTime":3582,"nextInTime":3584,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"... When we were really starting to get the idea of an unschooling lifestyle - trusting our kids and ourselves and letting go of the safety rules and shoulds","messageBody":"<div id=\"ygrps-yiv-1947957811\"><blockquote><span title=\"ireply\">&gt; MAYBE he can give his daughter a joyful life----and the  shortest<br/>\n&gt; route to a joyful adulthood is a joyful childhood---so start now.<br/>\n&gt;<br/>\n&gt; ~Kelly<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>When we were really starting to get the idea of an unschooling lifestyle -<br/>\ntrusting our kids and ourselves and letting go of the &quot;safety&quot; rules and <br/>\nshoulds - I had this sort of epiphany.  It went something like &quot;What if my <br/>\nkids grow up and always remember they had a very happy childhood?&quot;  And then <br/>\nafter some time I realized that letting go of all those rules meant that in <br/>\nfact I was entitled to a very happy parenthood as well.<br/>\n<br/>\nStill learning to just let myself relax and enjoy my terrific life,<br/>\n<br/>\nRachel<br/>\n_________________________<br/>\nMy baby is a DiaperFreeBaby!!!<br/>\nwww.DiaperFreeBaby.org</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097698539","msgId":3582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMTUwMWM0YjEyNiQ2ZjIzNjI0MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":3580,"nextInTopic":3583,"prevInTime":3581,"nextInTime":3583,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1912637564\">&lt;&lt;&lt;Another thing to consider is that most people who go to college don&#39;t<br/>\nfinish. &gt;&gt;&gt;<br/>\n<br/>\nLike that well known layabout Bill Gates  ;)<br/>\n<br/>\nWhen I first went to college after finishing high school, it was to study<br/>\nscience under pressure to do something academically worthy. I lasted one<br/>\nunpleasant year. When I returned to college a number of years later to study<br/>\nwhat I really was passionate about, Theater Design, I could have brought my<br/>\ncredits across and basically skipped the first year. Then I would have<br/>\nmissed out on a bunch of fun, and had much worse grades incidentally. The<br/>\nfeeling and experience was so different on my return to college.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.773 / Virus Database: 520 - Release Date: 10/5/2004</div>","specialLinks":[]},{"userId":65428400,"authorName":"Virginia Glasser","from":"&quot;Virginia Glasser&quot; &lt;virginia@...&gt;","profile":"vlatheist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Opinions wanted on Unschooling","postDate":"1097689932","msgId":3579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLR0VOTUNNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg==","inReplyToHeader":"PDIwMDQxMDEzMTM1NzM2LlpTRksyNDQ0LmltZjE5YWVjLm1haWwuYmVsbHNvdXRoLm5ldEBtYWlsLmJlbGxzb3V0aC5uZXQ+"},"prevInTopic":3574,"nextInTopic":3580,"prevInTime":3578,"nextInTime":3580,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"Michelle, that is so cool how you handled your mom while your son and you were rolling pennies. :) Virginia Glasser StampinUp! Demonstrator ","messageBody":"<div id=\"ygrps-yiv-1052793785\">Michelle, that is so cool how you handled your mom while your son and you<br/>\nwere rolling pennies. :)<br/>\n<br/>\nVirginia Glasser<br/>\nStampinUp! Demonstrator<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\nI&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\nAsk me how you can earn free stamping or scrapbooking supplies!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  -----Original Message-----<br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wieldingwords@...\">wieldingwords@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wieldingwords@...\">wieldingwords@...</a>]<br/>\n  Sent: Wednesday, October 13, 2004 8:58 AM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: Re: [unschoolingbasics] Re: Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt; Now being in the center of outside family and not the freedom of my<br/>\n  &gt; own house, in the midst of illness, the pressure can get high at<br/>\n  &gt; times.  It&#39;s hard because there are not a lot of unschooling families<br/>\n  &gt; out there living with ill parents (or are there?)<br/>\n<br/>\n </span></blockquote>  I don&#39;t know about your particular situation, but there are those of us<br/>\nthat do get a lot of strife from our families.  My mother absolutely detests<br/>\nthat I am homeschooling (I don&#39;t even mention the word unschooling around<br/>\nher) We see each other often and things are fine as long as we don&#39;t talk<br/>\nabout homeschooling, religion, poilitics, gay rights, vegetarianism, me<br/>\nworking from home, or health care options.  (So we talk about knitting, home<br/>\nredecorating, and gardening - all safe subjects).  Just yesterday she was at<br/>\nmy house and Keon (6yo) and I were rolling change.  Mom asked Keon, &quot;So what<br/>\ndid you do for school today.&quot;  Keon answered (a tad indignantly), &quot;I&#39;m<br/>\n*home*schooled now!&quot;  Mom said, &quot;Yes; but what did you do for homeschool.&quot;<br/>\nHe just rolled his eyes.  So I looked up at her and said, &quot;Ssshhhh, we are<br/>\ndoing math.&quot;  (and rolled my eyes).  We then separated pennies into pre-1983<br/>\na nd post 1983 all while looking for older pennies (pre-1950 wheat pennies -<br/>\nwe actually found one).  So I looked at her and said, &quot;History.&quot;  Then Keon<br/>\nmentioned that we needed to shine the pennies (we are going on a Disney trip<br/>\nsoon and we collect pressed pennies)  I asked him how we could shine them<br/>\nand he said, &quot;If we put them in catsup or spaghetti sauce they will get<br/>\nclean.&quot;  I again looked at Mom and said, &quot;Science.&quot;   She shut up (for now).<br/>\nI know we will have many more conversations on how my children will be<br/>\nbehind their peers (NOT) or missing in social opportunities (oh like<br/>\nresource day, gymnastics, scouting, church) and unprepared for life after<br/>\ntheir teen years (sort of like their father who has a professional job and<br/>\nis essentially &quot;home-colleged.&quot;)<br/>\n<br/>\n  My mother has several friends who are educators or school administrators<br/>\nand they all are very nice people (I know them as well).  They keep telling<br/>\nmy mother about these wonderful programs taht are in their schools.  How my<br/>\nchildren could excel by being enrolled.  How much they would benefit from<br/>\nthe daily social environment at their particular schools.  My mother buys<br/>\ninto it.  She doesn&#39;t understand why I refused to submit an application for<br/>\nthe arts magnate for my two younger children.  She doesn&#39;t understand why I<br/>\nthink that magnate schools are wrong and that *all* schools should have the<br/>\nsame opportunities that the &quot;chosen few&quot; are given.<br/>\n<br/>\n  Of course I don&#39;t live with it on a daily basis.  It does come up often<br/>\nenough, though, to make it annoying.  I would probably do about the same I<br/>\nam doing now, but then I&#39;m pretty surly when it comes to people pushing at<br/>\nmy decisions.<br/>\n<br/>\n  Michelle<br/>\n<br/>\n  Michelle<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65428400,"authorName":"Virginia Glasser","from":"&quot;Virginia Glasser&quot; &lt;virginia@...&gt;","profile":"vlatheist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097689929","msgId":3580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLRUVOTUNNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg==","inReplyToHeader":"PDg2LjE4NjE0YmIxLjJlOWU5MzBjQGFvbC5jb20+"},"prevInTopic":3579,"nextInTopic":3582,"prevInTime":3579,"nextInTime":3581,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"That is very funny. You have to wonder if the genius who came up with that ad actually did the math themselves. Virginia Glasser StampinUp! Demonstrator ","messageBody":"<div id=\"ygrps-yiv-501596043\">That is very funny. You have to wonder if the &quot;genius&quot; who came up with that<br/>\nad actually did the math themselves.<br/>\nVirginia Glasser<br/>\nStampinUp! Demonstrator<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\nI&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\nAsk me how you can earn free stamping or scrapbooking supplies!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  -----Original Message-----<br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Leslie530@...\">Leslie530@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Leslie530@...\">Leslie530@...</a>]<br/>\n  Sent: Wednesday, October 13, 2004 9:18 AM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: Re: [unschoolingbasics] Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 10/13/2004 9:14:47 AM Eastern Daylight Time,<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> writes:<br/>\n<br/>\n  &lt;&lt;&lt;&lt;&lt;He<br/>\n  says statistically people who go to college  get better paying jobs, get<br/>\n  married, live happier more productive lives and  are more well rounded<br/>\nthan<br/>\n  people who  don&#39;t.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n****************************************************************************<br/>\n**<br/>\n  **************************<br/>\n<br/>\n  forgive me, because this is sort of unrelated, but my favorite commercial<br/>\n  these days is the one that says &quot;a high school graduate will make $200,000<br/>\nmore<br/>\n  in his lifetime than a non-grad&quot;.  Hmmm....$200,000 at say 45 years in the<br/>\n  work force is only $4444.44 more a year!<br/>\n<br/>\n  Leslie in SC<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Opinions wanted on Unschooling","postDate":"1097683583","msgId":3574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0NjBBNjQ3LTFEMzEtMTFEOS1BNTVBLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PGNrajJ2Zis2dDViQGVHcm91cHMuY29tPg==","referencesHeader":"PGNrajJ2Zis2dDViQGVHcm91cHMuY29tPg=="},"prevInTopic":3570,"nextInTopic":3579,"prevInTime":3573,"nextInTime":3575,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"... I can imagine, Sheila!! I hope you take plenty of time to get out of the house - spending time away from that kind of pressure would be necessary for your","messageBody":"<div id=\"ygrps-yiv-1809079656\">On Oct 13, 2004, at 4:19 AM, Sheila wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now being in the center of outside family and not the freedom of my<br/>\n&gt; own house, in the midst of illness, the pressure can get high at<br/>\n&gt; times.<br/>\n<br/>\n </span></blockquote>I can imagine, Sheila!! I hope you take plenty of time to get out of <br/>\nthe house - spending time away from that kind of pressure would be <br/>\nnecessary for your own mental health, I&#39;m sure!!<br/>\n<br/>\nYou might want to print out the &quot;Unschooling Course of Study&quot;  &lt;g&gt; that <br/>\nI have adapted from one written originally by Carol Narigon and added <br/>\nmaterial from our state standards and some other stuff. Your father <br/>\nmight be very calmed by it.<br/>\n<br/>\nYou can get it here: <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://homepage.mac.com/pamsoroosh/iblog/unschooling/index.html\">http://homepage.mac.com/pamsoroosh/iblog/unschooling/index.html</a>&gt;.<br/>\n<br/>\nIf you&#39;d like it as a word file, email me offlist and I&#39;ll send it as <br/>\nan attachment.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097678031","msgId":3570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMS4yYzg3OTEzNC4yZTllOTZjZkBhb2wuY29tPg=="},"prevInTopic":3569,"nextInTopic":3574,"prevInTime":3569,"nextInTime":3571,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/13/2004 10:19:27 AM Eastern Daylight Time, Leslie530@aol.com writes: forgive  me, because this is sort of unrelated, but my favorite","messageBody":"<div id=\"ygrps-yiv-1140053320\">In a message dated 10/13/2004 10:19:27 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Leslie530@...\">Leslie530@...</a> writes:<br/>\n<br/>\nforgive  me, because this is sort of unrelated, but my favorite commercial   <br/>\nthese days is the one that says &quot;a high school graduate will make $200,000  <br/>\nmore  <br/>\nin his lifetime than a non-grad&quot;.  Hmmm....$200,000 at say  45 years in the  <br/>\nwork force is only $4444.44 more a  year!&lt;&lt;&lt;&lt;<br/>\n <br/>\nAnd that doesn&#39;t include the four lost years of income, the college  tuition, <br/>\nor the repayment of student loans! &lt;G&gt;<br/>\n <br/>\nA college education ain&#39;t all it&#39;s cracked up to be! &lt;G&gt;<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Opinions wanted on Unschooling","postDate":"1097677895","msgId":3569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYy4yZGYyNmVjZC4yZTllOTY0N0Bhb2wuY29tPg=="},"prevInTopic":3568,"nextInTopic":3570,"prevInTime":3568,"nextInTime":3570,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/13/2004 7:21:41 AM Eastern Daylight Time, luv2lrnhs@optonline.net writes: (2)  I know it fits best for my dd, but am not sure about my","messageBody":"<div id=\"ygrps-yiv-1962930189\">In a message dated 10/13/2004 7:21:41 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luv2lrnhs@...\">luv2lrnhs@...</a> writes:<br/>\n<br/>\n(2)  I know it fits best for my dd, but <br/>\nam not sure about my  ds.  He likes some structure in his days.     <br/>\nI&#39;ve  been deschooling (them and me) for a couple of weeks now - which <br/>\nof course  we have to from the curriculum I&#39;ve chosen.  &lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nStructure can come in the form of a daytimer. Both my boys have one---well.  <br/>\nCameron has his own; Duncan shares mine. Cameron&#39;s more my dreamer----very  <br/>\nartistic and &quot;go-with-the-flow&quot;, but he&#39;s soooo busy lately, that he *needs* to  <br/>\nkeep a handle on what he&#39;s doing when.<br/>\n <br/>\nDuncan likes more structure. He likes knowing what we&#39;re doing tomorrow and  <br/>\nthe day after and the day after. He&#39;s constantly aware of what time it is.  He <br/>\nlikes a *plan*. (Makes it harder for me sometimes, &#39;cause I&#39;m a little  more <br/>\n&quot;take-it-as-it-comes&quot;!) Today we&#39;re going to mix up a bunch of stuff  in the <br/>\nkitchen. I think I need to go get some dry ice! &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Now being in the center of outside family and  not the freedom of my <br/>\n </span></blockquote>own house, in the midst of illness, the pressure can  get high at <br/>\ntimes. &lt;&lt;&lt;&lt;<br/>\n <br/>\nYou have my sympathy. I can only imagine!<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt; I know the <br/>\n </span></blockquote>curriculums allow us  to look like we are doing something.  I know <br/>\nunschooling looks like  they are doing nothing but I also know my kids <br/>\nare learning all day  long.  Hard to explain to some  folks!&lt;&lt;&lt;&lt;&lt;&lt; <br/>\n <br/>\nYou *could* just blow them off. &lt;g&gt;  That&#39;s my choice!  &lt;BWG&gt;<br/>\n <br/>\nBut one way would be to have them *see* you documenting the learning that  IS <br/>\nhappening every day. This would help in several ways: the extended family  <br/>\nwould see *you* taking an active role in the learning process (as the  <br/>\n&quot;teacher&quot;, you must &quot;know&quot;----we &quot;need&quot; to have standards and progress and  <br/>\ndocumentation and comparisons to make sure we&#39;re learning! &lt;G&gt;), you and  your husband <br/>\ncould put your fears to rest, and the foundation for that next  unschooling book <br/>\nwould be in the works! &lt;g&gt; <br/>\n <br/>\nUse a teacher&#39;s log, if that would make it easier----they&#39;re at all the  <br/>\nteacher supply stores. A journal. A diary. A daytimer could be  enough----I keep <br/>\nall our stuff in there---especially &quot;firsts&quot;---like Cameron&#39;s  first movie <br/>\nschedule and Duncan&#39;s first reading of a book. Things like  multiplication: &quot;Hey <br/>\nmom, did you know five fives are 25?&quot; Or  yesterday&#39;s discussion of molecules <br/>\n(here in our house). The poem Duncan  wrote. My &quot;NON-reading&quot; 16 year old&#39;s <br/>\npicking up Hesse&#39;s _Siddhartha_ to  read! &lt;BWG&gt; I have to document due to my <br/>\nstate laws (and &quot;keep attendance&quot;  :-P~~~*), so it&#39;s become habit. But it&#39;s fun to <br/>\nlook through the last few years  to see what we&#39;ve &quot;learned&quot;.<br/>\n <br/>\nThat way, if someone asks----AND you&#39;re in a generous mood!  &lt;g&gt;----you can <br/>\nreel off what&#39;s been discussed and thought through and  attempted and learned <br/>\nand mastered. All in a handy dandy notebook.  &lt;g&gt;<br/>\n <br/>\nIf you&#39;re NOT in a generous mood, you can tell them to take a hike. These  <br/>\nare *your* children, and *you* will make the decisions regarding their  <br/>\neducation. Thank you. End of discussion. &lt;g&gt;<br/>\n<br/>\n~Kelly<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097677068","msgId":3568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2LjE4NjE0YmIxLjJlOWU5MzBjQGFvbC5jb20+"},"prevInTopic":3567,"nextInTopic":3569,"prevInTime":3567,"nextInTime":3569,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/13/2004 9:14:47 AM Eastern Daylight Time, jnjstau@direcway.com writes: ","messageBody":"<div id=\"ygrps-yiv-962550361\">In a message dated 10/13/2004 9:14:47 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> writes:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;He<br/>\nsays statistically people who go to college  get better paying jobs, get<br/>\nmarried, live happier more productive lives and  are more well rounded than<br/>\npeople who  don&#39;t.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n******************************************************************************<br/>\n**************************<br/>\n <br/>\nforgive me, because this is sort of unrelated, but my favorite commercial  <br/>\nthese days is the one that says &quot;a high school graduate will make $200,000 more  <br/>\nin his lifetime than a non-grad&quot;.  Hmmm....$200,000 at say 45 years in the  <br/>\nwork force is only $4444.44 more a year!<br/>\n <br/>\nLeslie in SC<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195508922,"authorName":"wieldingwords@bellsouth.net","from":"&lt;wieldingwords@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Opinions wanted on Unschooling","postDate":"1097675855","msgId":3567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMDEzMTM1NzM2LlpTRksyNDQ0LmltZjE5YWVjLm1haWwuYmVsbHNvdXRoLm5ldEBtYWlsLmJlbGxzb3V0aC5uZXQ+"},"prevInTopic":3566,"nextInTopic":3568,"prevInTime":3566,"nextInTime":3568,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"... I don t know about your particular situation, but there are those of us that do get a lot of strife from our families.  My mother absolutely detests that I","messageBody":"<div id=\"ygrps-yiv-913764243\"><blockquote><span title=\"ireply\">&gt; Now being in the center of outside family and not the freedom of my <br/>\n&gt; own house, in the midst of illness, the pressure can get high at <br/>\n&gt; times.  It&#39;s hard because there are not a lot of unschooling families <br/>\n&gt; out there living with ill parents (or are there?)  <br/>\n<br/>\n </span></blockquote>I don&#39;t know about your particular situation, but there are those of us that do get a lot of strife from our families.  My mother absolutely detests that I am homeschooling (I don&#39;t even mention the word unschooling around her) We see each other often and things are fine as long as we don&#39;t talk about homeschooling, religion, poilitics, gay rights, vegetarianism, me working from home, or health care options.  (So we talk about knitting, home redecorating, and gardening - all safe subjects).  Just yesterday she was at my house and Keon (6yo) and I were rolling change.  Mom asked Keon, &quot;So what did you do for school today.&quot;  Keon answered (a tad indignantly), &quot;I&#39;m *home*schooled now!&quot;  Mom said, &quot;Yes; but what did you do for homeschool.&quot;  He just rolled his eyes.  So I looked up at her and said, &quot;Ssshhhh, we are doing math.&quot;  (and rolled my eyes).  We then separated pennies into pre-1983 and post 1983 all while looking for older pennies (pre-1950 wheat pennies - we actually found one).  So I looked at her and said, &quot;History.&quot;  Then Keon mentioned that we needed to shine the pennies (we are going on a Disney trip soon and we collect pressed pennies)  I asked him how we could shine them and he said, &quot;If we put them in catsup or spaghetti sauce they will get clean.&quot;  I again looked at Mom and said, &quot;Science.&quot;   She shut up (for now).  I know we will have many more conversations on how my children will be behind their peers (NOT) or missing in social opportunities (oh like resource day, gymnastics, scouting, church) and unprepared for life after their teen years (sort of like their father who has a professional job and is essentially &quot;home-colleged.&quot;)  <br/>\n<br/>\nMy mother has several friends who are educators or school administrators and they all are very nice people (I know them as well).  They keep telling my mother about these wonderful programs taht are in their schools.  How my children could excel by being enrolled.  How much they would benefit from the daily social environment at their particular schools.  My mother buys into it.  She doesn&#39;t understand why I refused to submit an application for the arts magnate for my two younger children.  She doesn&#39;t understand why I think that magnate schools are wrong and that *all* schools should have the same opportunities that the &quot;chosen few&quot; are given.  <br/>\n<br/>\nOf course I don&#39;t live with it on a daily basis.  It does come up often enough, though, to make it annoying.  I would probably do about the same I am doing now, but then I&#39;m pretty surly when it comes to people pushing at my decisions.<br/>\n<br/>\nMichelle<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Opinions wanted on Unschooling","postDate":"1097674569","msgId":3566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzcwMWM0YjEyOSQ5YjJiMDVjMCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGNrajJ2Zis2dDViQGVHcm91cHMuY29tPg=="},"prevInTopic":3564,"nextInTopic":3567,"prevInTime":3565,"nextInTime":3567,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-490221160\">&lt;&lt;&lt;I&#39;m not sure about my son.  He likes some structure.&gt;&gt;&gt;<br/>\n<br/>\nSo give him some structure....but it doesn&#39;t have to be in a workbook unless that is how he likes it.<br/>\n<br/>\nWhen we first started unschooling, dh wasn&#39;t exactly on board.  The kids kept asking when we were going to do school.  So I started projects.  We put in a garden, we built a shed, we raised animals, we baked, we played on the computer.  You know how kids are....you start something and they definitely want in to see what it is all about.<br/>\n<br/>\nThe kids had a bit of structure.  I had specific skills to talk to dh about when he got home.  After a bit, the kids would either continue the project with me or wander off.  Dh calmed down and realized that the kids were learning.<br/>\n<br/>\nNow I always have my projects going that sometimes the kids are interested in (Marsie, age 7, is helping me spin yarn).  But the kids have their projects.  Adriane is remodeling her bedroom, doing all the planning, painting, building herself.  Zach is practicing golf.<br/>\n<br/>\nMy mom used to send me all the articles on education and traditional homeschooling.  I would try to explain to her that we weren&#39;t doing that.  Then she spent a week with the kids.  She said &quot;I don&#39;t know how it works, but it obviously works.&quot;  She works in admissions at a state university.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Sheila <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, October 13, 2004 6:19 AM<br/>\n  Subject: [unschoolingbasics] Re: Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  &gt; You&#39;re welcome---and I&#39;m not writing *just* to you---there are over <br/>\n  two  <br/>\n  &gt; hundred people on this list! I may hit a home run with one or two! <br/>\n  &lt;G&gt; <br/>\n  &gt;  <br/>\n<br/>\n  Dear Dear Kelly:<br/>\n<br/>\n  Well you hit a home run with me!  Thank you so very much for the past <br/>\n  posts on this subject.  A few weeks ago, after burning out on a <br/>\n  curriculum we thought we liked after only two weeks of working with <br/>\n  it, I had taken the plunge.  Now after pressure from family members, <br/>\n  I am not sure if I want to swim back to the side and &quot;say I am <br/>\n  swimming&quot;.  I have the pressure of our family living with my parents <br/>\n  and my dad (who is very ill - which is why we are here) asking when <br/>\n  my dd is going to do English.  My husband and I just made the <br/>\n  decision to unschool after years of home&quot;schooling&quot; because (1) of <br/>\n  the situation we are in and wanting our kids to relax and enjoy as <br/>\n  much of life as they can; and (2)  The big question is... HOW??? I will have to work on that.<br/>\n  Anyone have any thoughts? Suggestions? I&#39;ve been deschooling (them and me) for a couple of weeks now - which <br/>\n  of course we have to from the curriculum I&#39;ve chosen. <br/>\n<br/>\n  Now being in the center of outside family and not the freedom of my <br/>\n  own house, in the midst of illness, the pressure can get high at <br/>\n  times.  It&#39;s hard because there are not a lot of unschooling families <br/>\n  out there living with ill parents (or are there?)  I&#39;ve met quite a <br/>\n  few homeschooling families living with parents but they are doing the <br/>\n  sit down strict curriculums that I just won&#39;t do.  I know the <br/>\n  curriculums allow us to look like we are doing something.  I know <br/>\n  unschooling looks like they are doing nothing but I also know my kids <br/>\n  are learning all day long.  Hard to explain to some folks!  Trust is <br/>\n  the BIG word, that&#39;s for sure. Oh well, I&#39;ll dangle on the side and <br/>\n  read, read, read some more!<br/>\n<br/>\n  Thanks again.<br/>\n  Sheila<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097673203","msgId":3564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWM0YjEyNiQ2ZjIzNjI0MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLQ0VNR0NNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg=="},"prevInTopic":3563,"nextInTopic":3566,"prevInTime":3563,"nextInTime":3565,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-70561221\">&lt;&lt;&lt;&lt;&lt;He<br/>\nsays statistically people who go to college get better paying jobs, get<br/>\nmarried, live happier more productive lives and are more well rounded than<br/>\npeople who don&#39;t.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nHere is the problem with that statistic.....Most of the people in the &quot;didn&#39;t go to college&quot; category are people that didn&#39;t do well in traditional school.  They don&#39;t believe in their ability to learn.  They have been told their entire lives that if they can&#39;t get good grades or whatever, they will be failures.  Self-fulfilling prophecies are very real.<br/>\n<br/>\nAnother thing to consider is that most people who go to college don&#39;t finish.  They don&#39;t have a clue who they are or what they want.  Suddenly, they are having to make all these decisions with very little experience in that skill.  It gets overwhelming for them.<br/>\n<br/>\nAdriane used to say she would never go to college and as a gymnastics coach hopeful it certainly isn&#39;t required to enter the field.  Now, after being on several college campuses for meets and realizing that she can continue competing through college, she wants to go and is already checking out programs.<br/>\n<br/>\nUnschoolers often go to college.  The difference is they are choosing to go for a reason, not just because it is the next thing they are supposed to do on the life list.<br/>\n<br/>\nJulie S. <br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Virginia Glasser <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, October 12, 2004 11:03 PM<br/>\n  Subject: RE: [unschoolingbasics] Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n  Hi Kelly,<br/>\n<br/>\n  You know I think I&#39;ve actually had an email from you before. I liked what<br/>\n  you said then, and I like what you say now. :)<br/>\n  Loved the swim analogy. I will present what you have had to say to him and<br/>\n  we&#39;ll go from there. His primary concern is that I&#39;ll be handicapping<br/>\n  Caitlin and possibly unschooling will sway her from a college education. He<br/>\n  says statistically people who go to college get better paying jobs, get<br/>\n  married, live happier more productive lives and are more well rounded than<br/>\n  people who don&#39;t. He recognizes that not all people who are happy and<br/>\n  productive, are well rounded, etc...went to college. He is just arguing that<br/>\n  the odds are better with a college education. There is no data to say that<br/>\n  unschooling has just as good as odds as a formal education and this bothers<br/>\n  him greatly. He is not one to take a leap of faith in anything. Faith is a<br/>\n  dirty word to him.<br/>\n  Virginia Glasser<br/>\n  StampinUp! Demonstrator<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\n  I&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\n  Ask me how you can earn free stamping or scrapbooking supplies!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    -----Original Message-----<br/>\n    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a>]<br/>\n    Sent: Tuesday, October 12, 2004 10:22 PM<br/>\n    To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n    Subject: Re: [unschoolingbasics] Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n    In a message dated 10/12/2004 9:12:23 PM Eastern Daylight Time,<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a> writes:<br/>\n<br/>\n    I&#39;m for  unschooling, my husband is not. I would like to gather as many<br/>\n    objective  opinions(if that&#39;s possible) as I can,  regarding this approach<br/>\n  to<br/>\n    homeschooling. I would love to hear from anyone who has given it a shot<br/>\n  and<br/>\n    failed miserably, as well as from those who love it and are very<br/>\n  successful,<br/>\n    or from those falling any where in between. I also want to hear  from<br/>\n  folks<br/>\n    who have teens, and hear from people who are grown who might  have been<br/>\n    unschooled. I know this is a tall order but I&#39;m really needing  all the<br/>\n  input<br/>\n    I can get. Thanks!&lt;&lt;&lt;&lt;<br/>\n<br/>\n    You won&#39;t find the ones who&#39;ve &quot;failed&quot; here, Virginia.<br/>\n<br/>\n    And to &quot;fail&quot; at unschooling is to plain NOT understand it. If you&#39;re<br/>\n  doing<br/>\n    it right, if you trust that your child will learn what he needs when he<br/>\n  needs<br/>\n    it  and that learning is everywhere----that we are surrounded by learning<br/>\n    experiences every single day, if you truly BELIEVE that, then unschooling<br/>\n  WILL<br/>\n    &quot;work&quot;.<br/>\n<br/>\n    What &quot;work&quot; means is debatable, I guess. In order for it to &quot;work&quot; you<br/>\n  have<br/>\n    to trust in the philosophy---that we are learning machines, that we are<br/>\n  driven<br/>\n    to learn from the minute we are born until we die----UNLESS that drive is<br/>\n    beaten  out of us (school does a damned good job of that---and so can<br/>\n  parents<br/>\n    who  &quot;school-at-home&quot;, if they&#39;re not really careful!).<br/>\n<br/>\n    Joyce has said that education is a by-product of a joyful unschooling<br/>\n  life;<br/>\n    it is not the goal.<br/>\n<br/>\n    We can make education the goal, but who&#39;s to say what&#39;s educational?  Me?<br/>\n    You? The state?<br/>\n<br/>\n    It will vary from individual to individual. And from age to age. What if<br/>\n    your child doesn&#39;t make it to adulthood? Would you prefer to say, &quot;Well,<br/>\n  at<br/>\n    least he learned what centrifugal force was!&quot; (I&#39;m on a physics kick.<br/>\n  Today was<br/>\n    physics day at the State Fair. Hundreds of high school students were there<br/>\n  with<br/>\n    their physics assignments----&quot;Be sure NOT to enjoy the fair while you&#39;re<br/>\n    here----you&#39;re here to WORK!&quot; BLEAH! Duncan (8) learned more than those<br/>\n  physics<br/>\n    students AND had fun!)<br/>\n<br/>\n    What&#39;s successful will also vary from person to person. I feel we are<br/>\n    extremely successful because we trust the boys. That&#39;s the first<br/>\n  hurdle---the  trust<br/>\n    issue, and I&#39;m guessing it&#39;s yours. Making that paradigm shift is  HARD.<br/>\n<br/>\n    You will find wildly &quot;successful&quot; unschoolers here. You will find<br/>\n  struggling<br/>\n    unschoolers. You will find people who haven&#39;t quite yet made the<br/>\n    commitment.You won&#39;t find unschoolers who &quot;failed miserably&quot;<br/>\n<br/>\n    You won&#39;t find unschoolers who &quot;failed miserably&quot; because they don&#39;t<br/>\n  exist.<br/>\n    If they *understood* unschooling, then they wouldn&#39;t have left it: they&#39;d<br/>\n    still  be unschooling. People who will tell you that they unschooled but<br/>\n  that it<br/>\n    didn&#39;t work, didn&#39;t REALLY unschool. They *may* have done nothing for a<br/>\n  while,<br/>\n    and when the kids &quot;never&quot; picked up a textbook, they abandoned unschooling<br/>\n    as a  waste of time. They never *got* it.<br/>\n<br/>\n    Swimming: there are those of us in the deep end, splashing,  floating,<br/>\n    diving, doing handstands underwater, telling you that the water&#39;s  fine.<br/>\n  There are<br/>\n    several treading water; sometimes reaching out for our hands,  sometimes<br/>\n    grabbing the ledge. There are more who are hanging onto the side of  the<br/>\n  pool,<br/>\n    thinking, &quot;boy, it sure looks like fun out there----how do you  float???&quot;<br/>\n  There&#39;s a<br/>\n    large number actually sitting on the side with their feet  dangling in the<br/>\n    water insisting that they&#39;re swimming (except for math and  reading!&lt;g&gt;).<br/>\n  And<br/>\n    there are those sitting in chairs under umbrellas who  have stuck a toe in<br/>\n  and<br/>\n    decided that that was swimming, that the water was just  too cold, and<br/>\n  that no<br/>\n    one can float in there.<br/>\n<br/>\n    No one can make you unschool, Virginia. You simply have to  trust.<br/>\n<br/>\n    I am a wildly &quot;successful&quot; unschooling mom. I have a teenager who is<br/>\n    absolutely amazing---and only gets more so each and every day. My best<br/>\n  friend  (44)<br/>\n    was unschooled and is an actress who runs her own production company.<br/>\n<br/>\n    There are websites devoted to blasting unschooling as neglectful. Google<br/>\n  it.<br/>\n    Read and read. Then go to unschooling.com and SandraDodd.com and read some<br/>\n    more. All the John Holt books, Alfie Kohn, Frank Smith, Valerie<br/>\n  Fitzenreiter,<br/>\n    Ned Vare/Luz Shosie (Valerie and Ned & Luz have unschoolers that went to<br/>\n    college and beyond). Tell your husband to get off his butt and do some of<br/>\n  his  OWN<br/>\n    research---or did school burn that desire out of him?<br/>\n<br/>\n    My family really gets into discovering new things and figuring things out<br/>\n    and asking questions. If your husband *doesn&#39;t*, then maybe he needs to<br/>\n  rethink<br/>\n    his own schooling----it obviously didn&#39;t do him as much good as<br/>\n  unschooling<br/>\n    is  doing for *my* family.<br/>\n<br/>\n    Unschooling is for every child. It&#39; not for every parent----too many can&#39;t<br/>\n    get past their school baggage. I&#39;m more than thrilled to help someone<br/>\n  learn to<br/>\n    swim. But I can&#39;t (and won&#39;t) drag someone, who hates to even get wet,<br/>\n    kicking and screaming into the pool.<br/>\n<br/>\n    If the husband is pooh-poohing the idea without even researching, then I<br/>\n    have nothing to say: he doesn&#39;t want to learn, and as an unschooler, I&#39;m<br/>\n  not<br/>\n    going to coerce him by teaching him---it goes against the philosophy!  &lt;g&gt;<br/>\n  One<br/>\n    tenant of unschooling is that you can&#39;t teach someone  who is unwilling to<br/>\n    learn!<br/>\n<br/>\n    If he has some questions, I&#39;m available for answers. What does he want to<br/>\n    know?<br/>\n<br/>\n    ~Kelly<br/>\n<br/>\n<br/>\n    [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n          Yahoo! Groups Sponsor<br/>\n                ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  ----------------------------------------------------------------------------<br/>\n  --<br/>\n    Yahoo! Groups Links<br/>\n<br/>\n      a.. To visit your group on the web, go to:<br/>\n      <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n      b.. To unsubscribe from this group, send an email to:<br/>\n      <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n      c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097672733","msgId":3563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWM0YjEyNSQ1NWMxZmY2MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDUzLjE4N2JmYmE4LjJlOWRmOTQwQGFvbC5jb20+"},"prevInTopic":3560,"nextInTopic":3564,"prevInTime":3562,"nextInTime":3564,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"I think successful unschoolers look differently, a lot of the time, than successful schoolers. Successful schoolers have learned how to do a lot of things","messageBody":"<div id=\"ygrps-yiv-2010002579\">I think successful unschoolers look differently, a lot of the time, than successful schoolers.<br/>\n<br/>\nSuccessful schoolers have learned how to do a lot of things superficially in an order that most school officials know how to predict.  If you are in 7th grade successfully, the school can predict that you know how to work fraction problems, how to carry in subtraction, etc. because those were taught at earlier grades.  It is an assembly line approach.<br/>\n<br/>\nSuccessful unschoolers have learned a lot of things superficially but in a completely unpredictable order.  They usually know a few topics that are near and dear to their hearts in great depth.  But a 13 year old unschooler may or may not know how to carry in subtraction but when they do come up against something they don&#39;t know, they know how to learn it quickly.  It is more of an artistic approach.<br/>\n<br/>\nWe have unschooled for about 7 years.  My three youngest wanted to try out school this year (2 in K, one in First).  The teachers initially wanted to put them all in special ed..  Michelle couldn&#39;t completely write her name.  Dan held his pencil funny.  Marsie wasn&#39;t reading at Level 3.  All of these things are arbitrary standards that the school has set up, not developmentally based at all, and all in one skill area.<br/>\n<br/>\nSo we went through the rigamarole of meetings, etc..  I had to be very clear with the teachers about my philosophy (unschooling) and that we wouldn&#39;t be enforcing homework and that I wasn&#39;t worried about the kids, etc..  I made sure the teachers knew that the kids were there by choice (which freaked them out) and that if their homework was done it was because the child chose to do it (which freaked them out because the kids usually like to do it).<br/>\n<br/>\nI just had my regular teacher conferences and the teachers have had time to get to know the kids.  Now they are described as the &quot;perfect&quot; students.  They are way above the arbitrary standards set for science and math skills.  In fact, the teacher was asking me how my kids learned math so well.  I told her it was from using the microwave and making sure nobody in our large family was taking more than their fair share of fish sticks at dinner.  I told her Danny learned his sight words by playing video games (freaked her out).  But the biggest thing is that the kids are truly interested in what is going on and I think that comes from knowing they are there by choice.<br/>\n<br/>\nNow Adriane (now almost 14) and Zach (11) went to school before we found unschooling.  They have zero desire  to return.  Adriane didn&#39;t pay any attention to spelling until last year when she began emailing friends.  She is awesome at math theory and learns math formulas as they come up in her life.  She has been able to live a life that would be impossible if she were tied to a curriculum.  She works out 15 hours per week and works part time at the gym teaching little kids gymnastics.  She hopes to be a gymnastics coach and has met Bella Karolyi and hopes to do an internship with him this summer.  She raises show animals which takes a couple of hours work each day and she travels the state doing that.<br/>\n<br/>\nZach is just learning to read but is doing it on his own and joyfully.  He comes to me asking to read to me.  When he was in school he simply wasn&#39;t ready developmentally to read and so was made to feel like something was wrong with him.  It took him many years of not even touching a book to get over it.  His biggest skills are spatial which aren&#39;t even addressed by curriculums.  He plays pool like a pro, he knows where the baseball is going after it is hit, he has been able to dribble a ball since he was two and this year was a member of the National Skeet and Trap Shooting championship team for his age group.  Again, traveling the state to do this.  The school says &quot;that&#39;s just extra-curricular&quot;.....I say its physics theory.<br/>\n<br/>\nAnyway, that is our story.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, October 12, 2004 10:21 PM<br/>\n  Subject: Re: [unschoolingbasics] Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n  In a message dated 10/12/2004 9:12:23 PM Eastern Daylight Time,  <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a> writes:<br/>\n<br/>\n  I&#39;m for  unschooling, my husband is not. I would like to gather as many<br/>\n  objective  opinions(if that&#39;s possible) as I can,  regarding this approach  to<br/>\n  homeschooling. I would love to hear from anyone who has given it a shot  and<br/>\n  failed miserably, as well as from those who love it and are very  successful,<br/>\n  or from those falling any where in between. I also want to hear  from folks<br/>\n  who have teens, and hear from people who are grown who might  have been<br/>\n  unschooled. I know this is a tall order but I&#39;m really needing  all the input<br/>\n  I can get. Thanks!&lt;&lt;&lt;&lt;<br/>\n<br/>\n  You won&#39;t find the ones who&#39;ve &quot;failed&quot; here, Virginia.<br/>\n<br/>\n  And to &quot;fail&quot; at unschooling is to plain NOT understand it. If you&#39;re doing  <br/>\n  it right, if you trust that your child will learn what he needs when he needs <br/>\n  it  and that learning is everywhere----that we are surrounded by learning  <br/>\n  experiences every single day, if you truly BELIEVE that, then unschooling WILL  <br/>\n  &quot;work&quot;.<br/>\n<br/>\n  What &quot;work&quot; means is debatable, I guess. In order for it to &quot;work&quot; you have  <br/>\n  to trust in the philosophy---that we are learning machines, that we are driven <br/>\n  to learn from the minute we are born until we die----UNLESS that drive is <br/>\n  beaten  out of us (school does a damned good job of that---and so can parents <br/>\n  who  &quot;school-at-home&quot;, if they&#39;re not really careful!).<br/>\n<br/>\n  Joyce has said that education is a by-product of a joyful unschooling life;  <br/>\n  it is not the goal. <br/>\n<br/>\n  We can make education the goal, but who&#39;s to say what&#39;s educational?  Me? <br/>\n  You? The state?<br/>\n<br/>\n  It will vary from individual to individual. And from age to age. What if  <br/>\n  your child doesn&#39;t make it to adulthood? Would you prefer to say, &quot;Well, at  <br/>\n  least he learned what centrifugal force was!&quot; (I&#39;m on a physics kick. Today was  <br/>\n  physics day at the State Fair. Hundreds of high school students were there with <br/>\n  their physics assignments----&quot;Be sure NOT to enjoy the fair while you&#39;re  <br/>\n  here----you&#39;re here to WORK!&quot; BLEAH! Duncan (8) learned more than those physics  <br/>\n  students AND had fun!)<br/>\n<br/>\n  What&#39;s successful will also vary from person to person. I feel we are  <br/>\n  extremely successful because we trust the boys. That&#39;s the first hurdle---the  trust <br/>\n  issue, and I&#39;m guessing it&#39;s yours. Making that paradigm shift is  HARD.<br/>\n<br/>\n  You will find wildly &quot;successful&quot; unschoolers here. You will find  struggling <br/>\n  unschoolers. You will find people who haven&#39;t quite yet made the  <br/>\n  commitment.You won&#39;t find unschoolers who &quot;failed miserably&quot;<br/>\n<br/>\n  You won&#39;t find unschoolers who &quot;failed miserably&quot; because they don&#39;t exist.  <br/>\n  If they *understood* unschooling, then they wouldn&#39;t have left it: they&#39;d <br/>\n  still  be unschooling. People who will tell you that they unschooled but that it  <br/>\n  didn&#39;t work, didn&#39;t REALLY unschool. They *may* have done nothing for a while, <br/>\n  and when the kids &quot;never&quot; picked up a textbook, they abandoned unschooling <br/>\n  as a  waste of time. They never *got* it.<br/>\n<br/>\n  Swimming: there are those of us in the deep end, splashing,  floating, <br/>\n  diving, doing handstands underwater, telling you that the water&#39;s  fine. There are <br/>\n  several treading water; sometimes reaching out for our hands,  sometimes <br/>\n  grabbing the ledge. There are more who are hanging onto the side of  the pool, <br/>\n  thinking, &quot;boy, it sure looks like fun out there----how do you  float???&quot; There&#39;s a <br/>\n  large number actually sitting on the side with their feet  dangling in the <br/>\n  water insisting that they&#39;re swimming (except for math and  reading!&lt;g&gt;). And <br/>\n  there are those sitting in chairs under umbrellas who  have stuck a toe in and <br/>\n  decided that that was swimming, that the water was just  too cold, and that no <br/>\n  one can float in there.<br/>\n<br/>\n  No one can make you unschool, Virginia. You simply have to  trust. <br/>\n<br/>\n  I am a wildly &quot;successful&quot; unschooling mom. I have a teenager who is  <br/>\n  absolutely amazing---and only gets more so each and every day. My best friend  (44) <br/>\n  was unschooled and is an actress who runs her own production company.<br/>\n<br/>\n  There are websites devoted to blasting unschooling as neglectful. Google  it. <br/>\n  Read and read. Then go to unschooling.com and SandraDodd.com and read some  <br/>\n  more. All the John Holt books, Alfie Kohn, Frank Smith, Valerie Fitzenreiter,  <br/>\n  Ned Vare/Luz Shosie (Valerie and Ned & Luz have unschoolers that went to  <br/>\n  college and beyond). Tell your husband to get off his butt and do some of his  OWN <br/>\n  research---or did school burn that desire out of him?<br/>\n<br/>\n  My family really gets into discovering new things and figuring things out  <br/>\n  and asking questions. If your husband *doesn&#39;t*, then maybe he needs to rethink  <br/>\n  his own schooling----it obviously didn&#39;t do him as much good as unschooling <br/>\n  is  doing for *my* family.<br/>\n<br/>\n  Unschooling is for every child. It&#39; not for every parent----too many can&#39;t  <br/>\n  get past their school baggage. I&#39;m more than thrilled to help someone learn to  <br/>\n  swim. But I can&#39;t (and won&#39;t) drag someone, who hates to even get wet,  <br/>\n  kicking and screaming into the pool.<br/>\n<br/>\n  If the husband is pooh-poohing the idea without even researching, then I  <br/>\n  have nothing to say: he doesn&#39;t want to learn, and as an unschooler, I&#39;m not  <br/>\n  going to coerce him by teaching him---it goes against the philosophy!  &lt;g&gt; One <br/>\n  tenant of unschooling is that you can&#39;t teach someone  who is unwilling to <br/>\n  learn!  <br/>\n<br/>\n  If he has some questions, I&#39;m available for answers. What does he want to  <br/>\n  know?<br/>\n<br/>\n  ~Kelly<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":193861946,"authorName":"Sheila","from":"&quot;Sheila&quot; &lt;luv2lrnhs@...&gt;","profile":"swtmntn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Opinions wanted on Unschooling","postDate":"1097666351","msgId":3560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrajJ2Zis2dDViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlkLjUwZDM4MGRlLjJlOWUxN2MzQGFvbC5jb20+"},"prevInTopic":3559,"nextInTopic":3563,"prevInTime":3559,"nextInTime":3561,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"... two ...  ... Dear Dear Kelly: Well you hit a home run with me!  Thank you so very much for the past posts on this subject.  A few weeks ago, after","messageBody":"<div id=\"ygrps-yiv-1118698573\"><blockquote><span title=\"ireply\">&gt; You&#39;re welcome---and I&#39;m not writing *just* to you---there are over <br/>\n </span></blockquote>two  <br/>\n<blockquote><span title=\"ireply\"> &gt; hundred people on this list! I may hit a home run with one or two! <br/>\n </span></blockquote>&lt;G&gt; <br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n<br/>\n </span></blockquote>Dear Dear Kelly:<br/>\n<br/>\nWell you hit a home run with me!  Thank you so very much for the past <br/>\nposts on this subject.  A few weeks ago, after burning out on a <br/>\ncurriculum we thought we liked after only two weeks of working with <br/>\nit, I had taken the plunge.  Now after pressure from family members, <br/>\nI am not sure if I want to swim back to the side and &quot;say I am <br/>\nswimming&quot;.  I have the pressure of our family living with my parents <br/>\nand my dad (who is very ill - which is why we are here) asking when <br/>\nmy dd is going to do English.  My husband and I just made the <br/>\ndecision to unschool after years of home&quot;schooling&quot; because (1) of <br/>\nthe situation we are in and wanting our kids to relax and enjoy as <br/>\nmuch of life as they can; and (2)  I know it fits best for my dd, but <br/>\nam not sure about my ds.  He likes some structure in his days.     <br/>\nI&#39;ve been deschooling (them and me) for a couple of weeks now - which <br/>\nof course we have to from the curriculum I&#39;ve chosen. <br/>\n<br/>\nNow being in the center of outside family and not the freedom of my <br/>\nown house, in the midst of illness, the pressure can get high at <br/>\ntimes.  It&#39;s hard because there are not a lot of unschooling families <br/>\nout there living with ill parents (or are there?)  I&#39;ve met quite a <br/>\nfew homeschooling families living with parents but they are doing the <br/>\nsit down strict curriculums that I just won&#39;t do.  I know the <br/>\ncurriculums allow us to look like we are doing something.  I know <br/>\nunschooling looks like they are doing nothing but I also know my kids <br/>\nare learning all day long.  Hard to explain to some folks!  Trust is <br/>\nthe BIG word, that&#39;s for sure. Oh well, I&#39;ll dangle on the side and <br/>\nread, read, read some more!<br/>\n<br/>\nThanks again.<br/>\nSheila</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097665511","msgId":3559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMDEzMTEwNTA3LkdJWE8yNDk3Lm10YTkuYWRlbHBoaWEubmV0QGxlaWdoPg==","inReplyToHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLQ0VNQUNNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg=="},"prevInTopic":3555,"nextInTopic":3560,"prevInTime":3558,"nextInTime":3560,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"Wow!  Kelly really summed it all up so very nicely that I don t feel like I have anything to add, but I just wanted to say that the unschooling way of life is","messageBody":"<div id=\"ygrps-yiv-154133229\">Wow!  Kelly really summed it all up so very nicely that I don&#39;t feel like I<br/>\nhave anything to add, but I just wanted to say that the unschooling way of<br/>\nlife is successful for my family.  My girls are 8 and 9.5 and have always<br/>\nbeen unschooled.  It gets easier to not worry the longer you&#39;ve been at it.<br/>\nOur lives are so joyful!  Learning happens all the time in too many ways to<br/>\ncount.  I am so very thankful that I&#39;ve discovered this way of life. <br/>\n<br/>\n <br/>\n<br/>\nAngela ~ Maine<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097645507","msgId":3555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkLjUwZDM4MGRlLjJlOWUxN2MzQGFvbC5jb20+"},"prevInTopic":3554,"nextInTopic":3559,"prevInTime":3554,"nextInTime":3556,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/13/2004 1:07:07 AM Eastern Daylight Time, virginia@apollowebworks.com writes: Wow you  are really good. :) You have me feeling much","messageBody":"<div id=\"ygrps-yiv-1243899696\">In a message dated 10/13/2004 1:07:07 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a> writes:<br/>\n<br/>\nWow you  are really good. :)<br/>\nYou have me feeling much better already in the doubts I  was starting to have<br/>\nmyself. Thank you for taking time to write to me.  :)&lt;&lt;&lt;&lt;<br/>\n <br/>\nYou&#39;re welcome---and I&#39;m not writing *just* to you---there are over two  <br/>\nhundred people on this list! I may hit a home run with one or two! &lt;G&gt; <br/>\n <br/>\nI like talking with folks who *want* to get it---who are looking to make  <br/>\nthat paradigm shift----who want to let go of the side and jump in.<br/>\n <br/>\nIt&#39;s something I&#39;m passionate about. And you know what? When you&#39;re  <br/>\n*passionate*, &lt;g&gt; you can get pretty good doing what you love! &lt;G&gt;  And that&#39;s why Ren <br/>\n& I started this list---to target new unschoolers and  unschooling-wannabees. <br/>\nWe LIKE to share our passions---another by-product of  doing what you love <br/>\nand believe in!<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097644996","msgId":3554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNC4yY2I1YWMzOC4yZTllMTVjNEBhb2wuY29tPg=="},"prevInTopic":3553,"nextInTopic":3555,"prevInTime":3553,"nextInTime":3555,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/13/2004 12:59:54 AM Eastern Daylight Time, ... the odds are  better  with a college education. There is no data to say  that unschooling","messageBody":"<div id=\"ygrps-yiv-93196842\">In a message dated 10/13/2004 12:59:54 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt; He is just arguing that<br/>\n </span></blockquote>the odds are  better  with a college education. There is no data to say  that<br/>\nunschooling has just  as good as odds as a formal education and  this bothers<br/>\nhim  greatly.&lt;&lt;&lt;&lt;&lt; <br/>\n <br/>\n <br/>\nAnd does he know how many college grads are unemployed?????  <br/>\nThousands---millions!<br/>\n <br/>\nBAD odds, if you ask me.<br/>\n <br/>\nPeople who see my car inevitably have a question or two. &lt;g&gt; I  usually smile <br/>\nand say, &quot;Yeah, I scare a lot of people.&quot;<br/>\n <br/>\nThis is so outside the average American&#39;s comfort level that it&#39;s not even  <br/>\nfunny (unless you&#39;re sitting on *this* side of the fence---we&#39;re laughing our  <br/>\nbutts off! &lt;G&gt;). But most folks can&#39;t wrap their heads around this one  little <br/>\nbit. And rather than think about it, just ignore it.<br/>\n <br/>\nBUT....<br/>\n <br/>\nIf they would, for a moment, step OUT of the box and look at it completely  <br/>\nobjectively. Seriously weigh the pros and cons. OBJECTIVELY. Actually compare  <br/>\nand contrast a life filled with passion to a life filled with classrooms. If  <br/>\nthey were to examine it critically, they would see, without a doubt, that a  <br/>\npassionate life beats a tradiational one. Hands down. Every time. When you <br/>\nstart  thinking creatively and imaginatively and with your passions in mind---when <br/>\nyou  realize that there&#39;s nothing that can stand in your way because *you* <br/>\nwill find  a way----THEN it makes so much sense. THEN you can see that a life of <br/>\nfreedom to  be and to become who you are is the only way that will work <br/>\nanyway.<br/>\n <br/>\nYour husband *may* be past that ability. Many people are. But if he&#39;s  <br/>\nwilling to step outside his comfort zone, open his mind, and examine his  thoughts <br/>\non this, MAYBE he can give his daughter a joyful life----and the  shortest <br/>\nroute to a joyful adulthood is a joyful childhood---so start now.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65428400,"authorName":"Virginia Glasser","from":"&quot;Virginia Glasser&quot; &lt;virginia@...&gt;","profile":"vlatheist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097644229","msgId":3553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLT0VNSUNNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg==","inReplyToHeader":"PDE1Ny40MTFiMjkzMC4yZTllMGZmMUBhb2wuY29tPg=="},"prevInTopic":3552,"nextInTopic":3554,"prevInTime":3552,"nextInTime":3554,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"Wow you are really good. :) You have me feeling much better already in the doubts I was starting to have myself. Thank you for taking time to write to me. :) ","messageBody":"<div id=\"ygrps-yiv-1212527216\">Wow you are really good. :)<br/>\nYou have me feeling much better already in the doubts I was starting to have<br/>\nmyself. Thank you for taking time to write to me. :)<br/>\n<br/>\nVirginia Glasser<br/>\nStampinUp! Demonstrator<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\nI&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\nAsk me how you can earn free stamping or scrapbooking supplies!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  -----Original Message-----<br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a>]<br/>\n  Sent: Tuesday, October 12, 2004 11:58 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: Re: [unschoolingbasics] Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n  In a message dated 10/13/2004 12:00:32 AM Eastern Daylight Time,<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a> writes:<br/>\n<br/>\n  You know  I think I&#39;ve actually had an email from you  before.&lt;&lt;&lt;<br/>\n<br/>\n  Yeah---one or two! &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt; I liked what you said then, and I like what you say now.  :)&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>  Thank you.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;Loved the swim analogy. I will present what you  have had to say to<br/>\n </span></blockquote>him<br/>\n  and<br/>\n  we&#39;ll go from there. His primary concern is that  I&#39;ll be handicapping<br/>\n  Caitlin and possibly unschooling will sway her from a  college education.<br/>\nHe<br/>\n  says statistically people who go to college get  better paying jobs, get<br/>\n  married, live happier more productive lives and are  more well rounded<br/>\nthan<br/>\n  people who don&#39;t. He recognizes that not all people  who are happy and<br/>\n  productive, are well rounded, etc...went to  college.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  Statistically unschoolers who chose college do EXTREMELY well there.<br/>\n  *Better* than extremely well there. Ask any college professor whom he&#39;d<br/>\nrather  have<br/>\n  in a class: an unschooler who is there because she&#39;s pursuing her passion<br/>\nor<br/>\n  a high school graduate who&#39;s just there because it&#39;s the next step to take<br/>\n  before starting to look for a job. Ask him which student adds more to his<br/>\n  classroom.<br/>\n<br/>\n  Statistically, a person who is unschooled will pursue her  passion, will<br/>\nget<br/>\n  a job doing what she loves, will make money while  &quot;playing&quot;, will not<br/>\n  &quot;settle&quot; for the first guy that asks her to marry him, will  have children<br/>\nbecause<br/>\n  she *wants* them, and will pursue a joyful life.<br/>\n<br/>\n  Thousands of college graduates EACH YEAR realize that their major was a<br/>\n  waste of time not to mention money!----for the $200,000 I would spend to<br/>\nsend<br/>\n  Cameron to a four year college, I could pay to open a business for<br/>\nhim---and he<br/>\n  wouldn&#39;t have to wait for a diploma (or for time to pursue a career: he&#39;d<br/>\n  already HAVE one) OR pay back student loans!<br/>\n<br/>\n  I think your husband hasn&#39;t done *any* research what-so-ever on the<br/>\nsubject.<br/>\n  I&#39;ll bet he&#39;s just regurgitating what he&#39;s heard all his life. And I<br/>\nheard<br/>\n  it too. My father used to say (and probably still does) that &quot;the  number<br/>\nof<br/>\n  years you spend in school is directly proportional to the amount of  money<br/>\n  you&#39;ll make.&quot; Bull-crap. For a while, I was making more grooming dogs<br/>\nthan my<br/>\n  husband was with his Masters Degree.<br/>\n<br/>\n  Has he read _The Billionaire Next Door_? Statistically, college grads make<br/>\n  less and are less happy and fulfilled than those who pursue their<br/>\n  passions....well...passionately.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt; He is just arguing that<br/>\n </span></blockquote>  the odds are better  with a college education. There is no data to say<br/>\nthat<br/>\n  unschooling has just  as good as odds as a formal education and this<br/>\nbothers<br/>\n  him  greatly.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  The odds are better if she&#39;s happy and passionate. His data is skewed.<br/>\nHe&#39;s<br/>\n  talking only about schooled children. Creative schooled children are<br/>\nburned<br/>\n  out  by fourth or fifth grade. They lose their passions----unless they are<br/>\n  stronger  than the pressure of school and society. A child who is free to<br/>\ndo and to<br/>\n  be and  to change is a horse of a different color---and he won&#39;t pull a<br/>\nplow.<br/>\n<br/>\n  I can&#39;t count the number of college graduates that I know who are unhappy<br/>\n  and unfulfilled in their jobs. What&#39;s your  husband&#39;s history? College<br/>\ngrad?<br/>\n  Degree(s)? What does he do for a  living? What does he do to make the<br/>\nliving<br/>\n  worthwhile? Does he look forward  to mornings? Why? Why not?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;He is not one to take a leap of faith in anything. Faith is  a<br/>\n </span></blockquote>  dirty word to him.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  He&#39;ll hear a lot of dirty words here. Dirty words like Trust, Respect,<br/>\n  Freedom, Laughter, Joy, Learning,----and Faith. Faith in your daughter to<br/>\nbe who<br/>\n  she is now---and who she will become.<br/>\n<br/>\n  ~Kelly<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097643505","msgId":3552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ny40MTFiMjkzMC4yZTllMGZmMUBhb2wuY29tPg=="},"prevInTopic":3551,"nextInTopic":3553,"prevInTime":3551,"nextInTime":3553,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/13/2004 12:00:32 AM Eastern Daylight Time, virginia@apollowebworks.com writes: You know  I think I ve actually had an email from you","messageBody":"<div id=\"ygrps-yiv-1372973110\">In a message dated 10/13/2004 12:00:32 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a> writes:<br/>\n<br/>\nYou know  I think I&#39;ve actually had an email from you  before.&lt;&lt;&lt;<br/>\n <br/>\nYeah---one or two! &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I liked what you said then, and I like what you say now.  :)&lt;&lt;&lt;<br/>\n <br/>\n </span></blockquote>Thank you.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Loved the swim analogy. I will present what you  have had to say to him <br/>\n </span></blockquote>and<br/>\nwe&#39;ll go from there. His primary concern is that  I&#39;ll be handicapping<br/>\nCaitlin and possibly unschooling will sway her from a  college education. He<br/>\nsays statistically people who go to college get  better paying jobs, get<br/>\nmarried, live happier more productive lives and are  more well rounded than<br/>\npeople who don&#39;t. He recognizes that not all people  who are happy and<br/>\nproductive, are well rounded, etc...went to  college.&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nStatistically unschoolers who chose college do EXTREMELY well there.  <br/>\n*Better* than extremely well there. Ask any college professor whom he&#39;d rather  have <br/>\nin a class: an unschooler who is there because she&#39;s pursuing her passion  or <br/>\na high school graduate who&#39;s just there because it&#39;s the next step to take  <br/>\nbefore starting to look for a job. Ask him which student adds more to his  <br/>\nclassroom.<br/>\n <br/>\nStatistically, a person who is unschooled will pursue her  passion, will get <br/>\na job doing what she loves, will make money while  &quot;playing&quot;, will not <br/>\n&quot;settle&quot; for the first guy that asks her to marry him, will  have children because <br/>\nshe *wants* them, and will pursue a joyful life. <br/>\n <br/>\nThousands of college graduates EACH YEAR realize that their major was a  <br/>\nwaste of time not to mention money!----for the $200,000 I would spend to send  <br/>\nCameron to a four year college, I could pay to open a business for him---and he  <br/>\nwouldn&#39;t have to wait for a diploma (or for time to pursue a career: he&#39;d  <br/>\nalready HAVE one) OR pay back student loans!<br/>\n <br/>\nI think your husband hasn&#39;t done *any* research what-so-ever on the  subject. <br/>\nI&#39;ll bet he&#39;s just regurgitating what he&#39;s heard all his life. And I  heard <br/>\nit too. My father used to say (and probably still does) that &quot;the  number of <br/>\nyears you spend in school is directly proportional to the amount of  money <br/>\nyou&#39;ll make.&quot; Bull-crap. For a while, I was making more grooming dogs  than my <br/>\nhusband was with his Masters Degree.<br/>\n <br/>\nHas he read _The Billionaire Next Door_? Statistically, college grads make  <br/>\nless and are less happy and fulfilled than those who pursue their  <br/>\npassions....well...passionately.<br/>\n <br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt; He is just arguing that<br/>\n </span></blockquote>the odds are better  with a college education. There is no data to say that<br/>\nunschooling has just  as good as odds as a formal education and this bothers<br/>\nhim  greatly.&lt;&lt;&lt;&lt;&lt; <br/>\n <br/>\nThe odds are better if she&#39;s happy and passionate. His data is skewed. He&#39;s  <br/>\ntalking only about schooled children. Creative schooled children are burned <br/>\nout  by fourth or fifth grade. They lose their passions----unless they are <br/>\nstronger  than the pressure of school and society. A child who is free to do and to <br/>\nbe and  to change is a horse of a different color---and he won&#39;t pull a plow.<br/>\n <br/>\nI can&#39;t count the number of college graduates that I know who are unhappy  <br/>\nand unfulfilled in their jobs. What&#39;s your  husband&#39;s history? College grad? <br/>\nDegree(s)? What does he do for a  living? What does he do to make the living <br/>\nworthwhile? Does he look forward  to mornings? Why? Why not? <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;He is not one to take a leap of faith in anything. Faith is  a<br/>\n </span></blockquote>dirty word to him.&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nHe&#39;ll hear a lot of dirty words here. Dirty words like Trust, Respect,  <br/>\nFreedom, Laughter, Joy, Learning,----and Faith. Faith in your daughter to be who  <br/>\nshe is now---and who she will become.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65428400,"authorName":"Virginia Glasser","from":"&quot;Virginia Glasser&quot; &lt;virginia@...&gt;","profile":"vlatheist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097640219","msgId":3551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLQ0VNR0NNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg==","inReplyToHeader":"PDUzLjE4N2JmYmE4LjJlOWRmOTQwQGFvbC5jb20+"},"prevInTopic":3549,"nextInTopic":3552,"prevInTime":3550,"nextInTime":3552,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"Hi Kelly, You know I think I ve actually had an email from you before. I liked what you said then, and I like what you say now. :) Loved the swim analogy. I","messageBody":"<div id=\"ygrps-yiv-735657070\">Hi Kelly,<br/>\n<br/>\nYou know I think I&#39;ve actually had an email from you before. I liked what<br/>\nyou said then, and I like what you say now. :)<br/>\nLoved the swim analogy. I will present what you have had to say to him and<br/>\nwe&#39;ll go from there. His primary concern is that I&#39;ll be handicapping<br/>\nCaitlin and possibly unschooling will sway her from a college education. He<br/>\nsays statistically people who go to college get better paying jobs, get<br/>\nmarried, live happier more productive lives and are more well rounded than<br/>\npeople who don&#39;t. He recognizes that not all people who are happy and<br/>\nproductive, are well rounded, etc...went to college. He is just arguing that<br/>\nthe odds are better with a college education. There is no data to say that<br/>\nunschooling has just as good as odds as a formal education and this bothers<br/>\nhim greatly. He is not one to take a leap of faith in anything. Faith is a<br/>\ndirty word to him.<br/>\nVirginia Glasser<br/>\nStampinUp! Demonstrator<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\nI&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\nAsk me how you can earn free stamping or scrapbooking supplies!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  -----Original Message-----<br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a>]<br/>\n  Sent: Tuesday, October 12, 2004 10:22 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: Re: [unschoolingbasics] Opinions wanted on Unschooling<br/>\n<br/>\n<br/>\n  In a message dated 10/12/2004 9:12:23 PM Eastern Daylight Time,<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a> writes:<br/>\n<br/>\n  I&#39;m for  unschooling, my husband is not. I would like to gather as many<br/>\n  objective  opinions(if that&#39;s possible) as I can,  regarding this approach<br/>\nto<br/>\n  homeschooling. I would love to hear from anyone who has given it a shot<br/>\nand<br/>\n  failed miserably, as well as from those who love it and are very<br/>\nsuccessful,<br/>\n  or from those falling any where in between. I also want to hear  from<br/>\nfolks<br/>\n  who have teens, and hear from people who are grown who might  have been<br/>\n  unschooled. I know this is a tall order but I&#39;m really needing  all the<br/>\ninput<br/>\n  I can get. Thanks!&lt;&lt;&lt;&lt;<br/>\n<br/>\n  You won&#39;t find the ones who&#39;ve &quot;failed&quot; here, Virginia.<br/>\n<br/>\n  And to &quot;fail&quot; at unschooling is to plain NOT understand it. If you&#39;re<br/>\ndoing<br/>\n  it right, if you trust that your child will learn what he needs when he<br/>\nneeds<br/>\n  it  and that learning is everywhere----that we are surrounded by learning<br/>\n  experiences every single day, if you truly BELIEVE that, then unschooling<br/>\nWILL<br/>\n  &quot;work&quot;.<br/>\n<br/>\n  What &quot;work&quot; means is debatable, I guess. In order for it to &quot;work&quot; you<br/>\nhave<br/>\n  to trust in the philosophy---that we are learning machines, that we are<br/>\ndriven<br/>\n  to learn from the minute we are born until we die----UNLESS that drive is<br/>\n  beaten  out of us (school does a damned good job of that---and so can<br/>\nparents<br/>\n  who  &quot;school-at-home&quot;, if they&#39;re not really careful!).<br/>\n<br/>\n  Joyce has said that education is a by-product of a joyful unschooling<br/>\nlife;<br/>\n  it is not the goal.<br/>\n<br/>\n  We can make education the goal, but who&#39;s to say what&#39;s educational?  Me?<br/>\n  You? The state?<br/>\n<br/>\n  It will vary from individual to individual. And from age to age. What if<br/>\n  your child doesn&#39;t make it to adulthood? Would you prefer to say, &quot;Well,<br/>\nat<br/>\n  least he learned what centrifugal force was!&quot; (I&#39;m on a physics kick.<br/>\nToday was<br/>\n  physics day at the State Fair. Hundreds of high school students were there<br/>\nwith<br/>\n  their physics assignments----&quot;Be sure NOT to enjoy the fair while you&#39;re<br/>\n  here----you&#39;re here to WORK!&quot; BLEAH! Duncan (8) learned more than those<br/>\nphysics<br/>\n  students AND had fun!)<br/>\n<br/>\n  What&#39;s successful will also vary from person to person. I feel we are<br/>\n  extremely successful because we trust the boys. That&#39;s the first<br/>\nhurdle---the  trust<br/>\n  issue, and I&#39;m guessing it&#39;s yours. Making that paradigm shift is  HARD.<br/>\n<br/>\n  You will find wildly &quot;successful&quot; unschoolers here. You will find<br/>\nstruggling<br/>\n  unschoolers. You will find people who haven&#39;t quite yet made the<br/>\n  commitment.You won&#39;t find unschoolers who &quot;failed miserably&quot;<br/>\n<br/>\n  You won&#39;t find unschoolers who &quot;failed miserably&quot; because they don&#39;t<br/>\nexist.<br/>\n  If they *understood* unschooling, then they wouldn&#39;t have left it: they&#39;d<br/>\n  still  be unschooling. People who will tell you that they unschooled but<br/>\nthat it<br/>\n  didn&#39;t work, didn&#39;t REALLY unschool. They *may* have done nothing for a<br/>\nwhile,<br/>\n  and when the kids &quot;never&quot; picked up a textbook, they abandoned unschooling<br/>\n  as a  waste of time. They never *got* it.<br/>\n<br/>\n  Swimming: there are those of us in the deep end, splashing,  floating,<br/>\n  diving, doing handstands underwater, telling you that the water&#39;s  fine.<br/>\nThere are<br/>\n  several treading water; sometimes reaching out for our hands,  sometimes<br/>\n  grabbing the ledge. There are more who are hanging onto the side of  the<br/>\npool,<br/>\n  thinking, &quot;boy, it sure looks like fun out there----how do you  float???&quot;<br/>\nThere&#39;s a<br/>\n  large number actually sitting on the side with their feet  dangling in the<br/>\n  water insisting that they&#39;re swimming (except for math and  reading!&lt;g&gt;).<br/>\nAnd<br/>\n  there are those sitting in chairs under umbrellas who  have stuck a toe in<br/>\nand<br/>\n  decided that that was swimming, that the water was just  too cold, and<br/>\nthat no<br/>\n  one can float in there.<br/>\n<br/>\n  No one can make you unschool, Virginia. You simply have to  trust.<br/>\n<br/>\n  I am a wildly &quot;successful&quot; unschooling mom. I have a teenager who is<br/>\n  absolutely amazing---and only gets more so each and every day. My best<br/>\nfriend  (44)<br/>\n  was unschooled and is an actress who runs her own production company.<br/>\n<br/>\n  There are websites devoted to blasting unschooling as neglectful. Google<br/>\nit.<br/>\n  Read and read. Then go to unschooling.com and SandraDodd.com and read some<br/>\n  more. All the John Holt books, Alfie Kohn, Frank Smith, Valerie<br/>\nFitzenreiter,<br/>\n  Ned Vare/Luz Shosie (Valerie and Ned & Luz have unschoolers that went to<br/>\n  college and beyond). Tell your husband to get off his butt and do some of<br/>\nhis  OWN<br/>\n  research---or did school burn that desire out of him?<br/>\n<br/>\n  My family really gets into discovering new things and figuring things out<br/>\n  and asking questions. If your husband *doesn&#39;t*, then maybe he needs to<br/>\nrethink<br/>\n  his own schooling----it obviously didn&#39;t do him as much good as<br/>\nunschooling<br/>\n  is  doing for *my* family.<br/>\n<br/>\n  Unschooling is for every child. It&#39; not for every parent----too many can&#39;t<br/>\n  get past their school baggage. I&#39;m more than thrilled to help someone<br/>\nlearn to<br/>\n  swim. But I can&#39;t (and won&#39;t) drag someone, who hates to even get wet,<br/>\n  kicking and screaming into the pool.<br/>\n<br/>\n  If the husband is pooh-poohing the idea without even researching, then I<br/>\n  have nothing to say: he doesn&#39;t want to learn, and as an unschooler, I&#39;m<br/>\nnot<br/>\n  going to coerce him by teaching him---it goes against the philosophy!  &lt;g&gt;<br/>\nOne<br/>\n  tenant of unschooling is that you can&#39;t teach someone  who is unwilling to<br/>\n  learn!<br/>\n<br/>\n  If he has some questions, I&#39;m available for answers. What does he want to<br/>\n  know?<br/>\n<br/>\n  ~Kelly<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Opinions wanted on Unschooling","postDate":"1097637696","msgId":3549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzLjE4N2JmYmE4LjJlOWRmOTQwQGFvbC5jb20+"},"prevInTopic":3547,"nextInTopic":3551,"prevInTime":3548,"nextInTime":3550,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/12/2004 9:12:23 PM Eastern Daylight Time, virginia@apollowebworks.com writes: I m for  unschooling, my husband is not. I would like to","messageBody":"<div id=\"ygrps-yiv-888183814\">In a message dated 10/12/2004 9:12:23 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:virginia@...\">virginia@...</a> writes:<br/>\n<br/>\nI&#39;m for  unschooling, my husband is not. I would like to gather as many<br/>\nobjective  opinions(if that&#39;s possible) as I can,  regarding this approach  to<br/>\nhomeschooling. I would love to hear from anyone who has given it a shot  and<br/>\nfailed miserably, as well as from those who love it and are very  successful,<br/>\nor from those falling any where in between. I also want to hear  from folks<br/>\nwho have teens, and hear from people who are grown who might  have been<br/>\nunschooled. I know this is a tall order but I&#39;m really needing  all the input<br/>\nI can get. Thanks!&lt;&lt;&lt;&lt;<br/>\n <br/>\nYou won&#39;t find the ones who&#39;ve &quot;failed&quot; here, Virginia.<br/>\n <br/>\nAnd to &quot;fail&quot; at unschooling is to plain NOT understand it. If you&#39;re doing  <br/>\nit right, if you trust that your child will learn what he needs when he needs <br/>\nit  and that learning is everywhere----that we are surrounded by learning  <br/>\nexperiences every single day, if you truly BELIEVE that, then unschooling WILL  <br/>\n&quot;work&quot;.<br/>\n <br/>\nWhat &quot;work&quot; means is debatable, I guess. In order for it to &quot;work&quot; you have  <br/>\nto trust in the philosophy---that we are learning machines, that we are driven <br/>\n to learn from the minute we are born until we die----UNLESS that drive is <br/>\nbeaten  out of us (school does a damned good job of that---and so can parents <br/>\nwho  &quot;school-at-home&quot;, if they&#39;re not really careful!).<br/>\n <br/>\nJoyce has said that education is a by-product of a joyful unschooling life;  <br/>\nit is not the goal. <br/>\n <br/>\nWe can make education the goal, but who&#39;s to say what&#39;s educational?  Me? <br/>\nYou? The state?<br/>\n <br/>\nIt will vary from individual to individual. And from age to age. What if  <br/>\nyour child doesn&#39;t make it to adulthood? Would you prefer to say, &quot;Well, at  <br/>\nleast he learned what centrifugal force was!&quot; (I&#39;m on a physics kick. Today was  <br/>\nphysics day at the State Fair. Hundreds of high school students were there with <br/>\n their physics assignments----&quot;Be sure NOT to enjoy the fair while you&#39;re  <br/>\nhere----you&#39;re here to WORK!&quot; BLEAH! Duncan (8) learned more than those physics  <br/>\nstudents AND had fun!)<br/>\n <br/>\nWhat&#39;s successful will also vary from person to person. I feel we are  <br/>\nextremely successful because we trust the boys. That&#39;s the first hurdle---the  trust <br/>\nissue, and I&#39;m guessing it&#39;s yours. Making that paradigm shift is  HARD.<br/>\n <br/>\nYou will find wildly &quot;successful&quot; unschoolers here. You will find  struggling <br/>\nunschoolers. You will find people who haven&#39;t quite yet made the  <br/>\ncommitment.You won&#39;t find unschoolers who &quot;failed miserably&quot;<br/>\n <br/>\nYou won&#39;t find unschoolers who &quot;failed miserably&quot; because they don&#39;t exist.  <br/>\nIf they *understood* unschooling, then they wouldn&#39;t have left it: they&#39;d <br/>\nstill  be unschooling. People who will tell you that they unschooled but that it  <br/>\ndidn&#39;t work, didn&#39;t REALLY unschool. They *may* have done nothing for a while, <br/>\n and when the kids &quot;never&quot; picked up a textbook, they abandoned unschooling <br/>\nas a  waste of time. They never *got* it.<br/>\n <br/>\nSwimming: there are those of us in the deep end, splashing,  floating, <br/>\ndiving, doing handstands underwater, telling you that the water&#39;s  fine. There are <br/>\nseveral treading water; sometimes reaching out for our hands,  sometimes <br/>\ngrabbing the ledge. There are more who are hanging onto the side of  the pool, <br/>\nthinking, &quot;boy, it sure looks like fun out there----how do you  float???&quot; There&#39;s a <br/>\nlarge number actually sitting on the side with their feet  dangling in the <br/>\nwater insisting that they&#39;re swimming (except for math and  reading!&lt;g&gt;). And <br/>\nthere are those sitting in chairs under umbrellas who  have stuck a toe in and <br/>\ndecided that that was swimming, that the water was just  too cold, and that no <br/>\none can float in there.<br/>\n <br/>\nNo one can make you unschool, Virginia. You simply have to  trust. <br/>\n <br/>\nI am a wildly &quot;successful&quot; unschooling mom. I have a teenager who is  <br/>\nabsolutely amazing---and only gets more so each and every day. My best friend  (44) <br/>\nwas unschooled and is an actress who runs her own production company.<br/>\n <br/>\nThere are websites devoted to blasting unschooling as neglectful. Google  it. <br/>\nRead and read. Then go to unschooling.com and SandraDodd.com and read some  <br/>\nmore. All the John Holt books, Alfie Kohn, Frank Smith, Valerie Fitzenreiter,  <br/>\nNed Vare/Luz Shosie (Valerie and Ned & Luz have unschoolers that went to  <br/>\ncollege and beyond). Tell your husband to get off his butt and do some of his  OWN <br/>\nresearch---or did school burn that desire out of him?<br/>\n <br/>\nMy family really gets into discovering new things and figuring things out  <br/>\nand asking questions. If your husband *doesn&#39;t*, then maybe he needs to rethink  <br/>\nhis own schooling----it obviously didn&#39;t do him as much good as unschooling <br/>\nis  doing for *my* family.<br/>\n <br/>\nUnschooling is for every child. It&#39; not for every parent----too many can&#39;t  <br/>\nget past their school baggage. I&#39;m more than thrilled to help someone learn to  <br/>\nswim. But I can&#39;t (and won&#39;t) drag someone, who hates to even get wet,  <br/>\nkicking and screaming into the pool.<br/>\n <br/>\nIf the husband is pooh-poohing the idea without even researching, then I  <br/>\nhave nothing to say: he doesn&#39;t want to learn, and as an unschooler, I&#39;m not  <br/>\ngoing to coerce him by teaching him---it goes against the philosophy!  &lt;g&gt; One <br/>\ntenant of unschooling is that you can&#39;t teach someone  who is unwilling to <br/>\nlearn!  <br/>\n <br/>\nIf he has some questions, I&#39;m available for answers. What does he want to  <br/>\nknow?<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65428400,"authorName":"Virginia Glasser","from":"&quot;Virginia Glasser&quot; &lt;virginia@...&gt;","profile":"vlatheist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Opinions wanted on Unschooling","postDate":"1097630072","msgId":3547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5JQkJMREdIS0xDRUJMQU9ERkZLQ0VNQUNNQUEudmlyZ2luaWFAYXBvbGxvd2Vid29ya3MuY29tPg==","inReplyToHeader":"PGNidW42ZitsaDVrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":3549,"prevInTime":3546,"nextInTime":3548,"topicId":3547,"numMessagesInTopic":0,"msgSnippet":"I m for unschooling, my husband is not. I would like to gather as many objective opinions(if that s possible) as I can,  regarding this approach to ","messageBody":"<div id=\"ygrps-yiv-1602934135\">I&#39;m for unschooling, my husband is not. I would like to gather as many<br/>\nobjective opinions(if that&#39;s possible) as I can,  regarding this approach to<br/>\nhomeschooling. I would love to hear from anyone who has given it a shot and<br/>\nfailed miserably, as well as from those who love it and are very successful,<br/>\nor from those falling any where in between. I also want to hear from folks<br/>\nwho have teens, and hear from people who are grown who might have been<br/>\nunschooled. I know this is a tall order but I&#39;m really needing all the input<br/>\nI can get. Thanks!<br/>\n<br/>\nVirginia Glasser<br/>\nStampinUp! Demonstrator<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.virginiaglasser.stampinup.net\">http://www.virginiaglasser.stampinup.net</a><br/>\nI&#39;m proud to be a Stampin&#39; Up demonstrator!<br/>\nAsk me how you can earn free stamping or scrapbooking supplies!</div>","specialLinks":[]}],"prevTopicId":3839,"nextTopicId":3878}}