{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] along the line of unsupportive family & comments made","postDate":"1137234998","msgId":9028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5OC40ZTViZGIyOC4zMGZhMmUzNkB3bWNvbm5lY3QuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":9027,"nextInTime":9029,"topicId":9028,"numMessagesInTopic":0,"msgSnippet":"=== I thought you would get a kick out of my husband s biggest objections to homeschooling -  how will he learn to raise his hand and line up?","messageBody":"<div id=\"ygrps-yiv-363415038\">===&gt;I thought you would get a kick out of my husband&#39;s biggest <br/>\nobjections to homeschooling -  &quot;how will he learn to raise his hand <br/>\nand line up?&quot;&lt;===<br/>\n<br/>\nSince I am fairly new to this group you may have all seen this list of &quot;The <br/>\nDumbest Things You Ever Heard About Homeschooling&quot; before but reading it again, <br/>\nit still gave me a chuckle, thought you all might enjoy it also. I remember <br/>\nonce my sil said something similar to me: &quot;I just don&#39;t know how you can stand <br/>\nbeing at home with your kids all day, it would drive me crazy!&quot; She is a <br/>\npublic school teacher.<br/>\n<br/>\nThe Dumbest Thing YOU Ever Heard, Part 1 By Mike Farris<br/>\n<br/>\nMy recent column requesting &quot;dumb statements&quot; people had made<br/>\nregarding homeschooling yielded a bumper crop of lols (laugh out<br/>\nloud) and a few rofls (rolling on the floor laughing). I got a<br/>\ngreat number of wonderful entries - far too many to publish. Today&#39;s<br/>\ncolumn is the first of two.<br/>\nHere are half of the top entries, this week&#39;s winners, and my<br/>\ncomments interspersed.<br/>\nHere come the comments.<br/>\n<br/>\nFrom Kara Becker:<br/>\nOur realtor learned we were home schooling. She commented about<br/>\nthe lack of social development that would result, but tried to still<br/>\nbe positive by adding, &quot;Even though they couldn&#39;t be realtors, thank<br/>\ngoodness that there are lot of jobs out there which don&#39;t require<br/>\npeople skills.&quot;<br/>\nMike: Thank you, Dale Carnegie (author of &quot;How to Win Friends and<br/>\nInfluence People&quot;).<br/>\n<br/>\nFrom the Austin family:<br/>\nA stranger said, &quot;Don&#39;t you think your children are being deprived<br/>\nof the thrill of buying school supplies at Wal-Mart when everyone<br/>\nelse does?&quot;<br/>\n<br/>\nFrom Angela Blackman:<br/>\nA friend who is a paralegal at a very busy law firm said, &quot;How can<br/>\nyou ever think you can keep up with having four kids at home?<br/>\nDon&#39;t they just run you off your feet? I&#39;d be exhausted by the end<br/>\nof the day.&quot;<br/>\nMike: It is a proven fact that assisting two lawyers is the<br/>\nequivalent of having six kids or else tending a dozen snakes --<br/>\ndepending on the age of the lawyer.<br/>\n<br/>\nFrom Pamela Minerd:<br/>\nMy father asked, &quot;Will I have to bail you out of jail for this?&quot;<br/>\n<br/>\nFrom MDT:<br/>\nMy neighbor was picking my brain about getting the public school to<br/>\nchallenge her first grader. She was concerned because my first<br/>\ngrader was already reading while her son of the same age was just<br/>\nlearning the sounds of letters. Nonetheless she challenged my home<br/>\nschooling saying my son would still miss out. &quot;It&#39;s important for<br/>\nhim socially too. He needs to be offered drugs so he can turn them<br/>\ndown.&quot;<br/>\n<br/>\nFrom Marci Zinn:<br/>\nA family member said, &quot;You are just doing this for yourself so you<br/>\nwon&#39;t have to buy the kids any school clothes.&quot;<br/>\nMike: Working 8+ hours a day for 12+ years just smacks of<br/>\nselfishness if you ask me.<br/>\n<br/>\nFrom MDT:<br/>\nA friend asked, &quot;Do you use books?&quot;<br/>\n<br/>\nFrom Rose Mary Coffey:<br/>\nWhen my husband told his mother that we were going to home school,<br/>\nshe replied, &quot;What makes Rose Mary think she has the right to teach<br/>\nmy grandchildren?&quot;<br/>\nMike: It&#39;s in the same clause of the Constitution which gives<br/>\ngrandmas the right to feed cookies and candy to the grandkids an<br/>\nhour before being sent home for dinner.<br/>\n<br/>\nFrom the Karoutsos Family:<br/>\nMy six year old son was very fidgety in the dentist&#39;s chair.<br/>\nAfterwards the dentist spoke to me and told me of his fidgetiness<br/>\nand said, &quot;Your son did not sit still. It is possibly due to the<br/>\nfact that you home school him.&quot;<br/>\nMike: I guess he thought that dentistry was so boring he would<br/>\nbranch out into child psychology.<br/>\n<br/>\nFrom Pam Hynes:<br/>\nI told an old friend from high school how my son was able to<br/>\nprogress in each subject at his own rate. She earnestly<br/>\nreplied, &quot;What if he learns it all before he finishes high school?&quot;<br/>\n<br/>\nFrom the Austin family:<br/>\nA female public school teacher said, &quot;Your son will turn out to be<br/>\nmuch too feminine or gay because you home school him. Being with<br/>\nhis mother so much is not good for boys.&quot;<br/>\nMike: I guess that spending ages 5 through 12 with female public<br/>\nschool teachers would be better.<br/>\n<br/>\nFrom Laurie Winkelmann:<br/>\nI took my daughter to a podiatrist who specialized in treating<br/>\nplantar warts. I asked how children contracted these warts. He<br/>\ntold me that they often come from locker rooms or swimming pools.<br/>\nWhen I told him that since we home school it wouldn&#39;t be a locker<br/>\nroom, but we do take a swimming class, he replied, &quot;Yup, home<br/>\nschooling, that certainly explains it.&quot;<br/>\nMike: Sounds like someone needs to breath a little fresh air<br/>\nbetween foot examinations.<br/>\n<br/>\nTHIS WEEK&#39;S WINNER<br/>\n<br/>\nFrom Dawn Howey:<br/>\nA Christian friend, &quot;God didn&#39;t homeschool Jesus, He sent Him away<br/>\nto school.&quot;<br/>\nMike: I think the friend needs to be sent away to Sunday School.<br/>\n<br/>\nThe Dumbest Thing YOU Ever Heard, Part 2<br/>\n<br/>\nFrom Susan Shay:<br/>\n&quot;Won&#39;t they miss out on learning a lot of important stuff? I<br/>\nmean, how will they ever learn to stand in line?&quot; (Similar<br/>\nstatements were made to Gita Schmitz and Kathi Kearney. All three<br/>\nget tapes.)<br/>\nMike: Thank goodness for the rigorous standards of Goals 2000.<br/>\n<br/>\nFrom Tracy Pina:<br/>\nAn acquaintance said, &quot;Every kid has to get beat up a few times in<br/>\npublic school or they won&#39;t be able to cope in the real world.&quot;<br/>\nMike: Sticks and stones will break my bones or else I won&#39;t be well<br/>\nrounded.<br/>\n<br/>\n<br/>\nFrom Clarence and Barbara Hawkins:<br/>\nA home school family in our town took their school days off in the<br/>\nmiddle of the week to match the father&#39;s job schedule. Some nosey<br/>\nneighbors had the family investigated for home schooling on Saturday!<br/>\nMike: Reminds me of the social services case I had in Alabama where<br/>\na mother was hotlined for allowing her children to read books in the<br/>\nback of the van while she drove around town.<br/>\n<br/>\nFrom MDT:<br/>\nA friend said, &quot;MY child is being a light in a dark place, but I<br/>\nguess SOME children are not able to do that.&quot;<br/>\nMike: With that much condescension that lady probably fogs up her<br/>\nown glasses.<br/>\n<br/>\nFrom Michelle Nichols:<br/>\nA woman asked a home school friend of mine, &quot;If you don&#39;t send your<br/>\nchildren to school, who is going to teach them their morals?&quot;<br/>\nMike: Yeah, like the moral necessity of beating up other kids on the<br/>\nplayground if we are to believe another comment we read.<br/>\n<br/>\nFrom Barb Palmer:<br/>\nOur girls&#39; friends from the neighborhood ask, &quot;If you are home<br/>\nschooled,who teaches you?&quot;<br/>\n<br/>\nFrom the Austin family:<br/>\nA friend said, &quot;Won&#39;t your children miss the experience of the<br/>\ngoods and bads of dating people from other cultural and religious<br/>\nbackgrounds?&quot;<br/>\n<br/>\nFrom Char Brady:<br/>\nA mother from my daughter&#39;s former public school class said, &quot;If<br/>\nyou were more involved in your child&#39;s education, then you wouldn&#39;t<br/>\nhave to home school.&quot;<br/>\n<br/>\nFrom MDT:<br/>\nAn acquaintance asked, &quot;How can you possibly give them enough one-<br/>\non-one time?&quot;<br/>\nMike (stolen from MDT): I guess the kids would get more one-on-one<br/>\ntime in a classroom of 30.<br/>\n<br/>\nFrom &quot;Ozchick&quot;:<br/>\nA friend asked me what we were going to do during a public school<br/>\nsnow day. I replied that we were going ahead with school. The friend<br/>\nreplied, &quot;That&#39;s silly. Why make your kids work since no one will be<br/>\naround to grade their papers?&quot;<br/>\nNot to be outdone, that same friend heard me describe how I was<br/>\nteaching my children baking from the Colonial period. A recent<br/>\nproject was making a cake from scratch. She replied, &quot;Where can I<br/>\nbuy a box of scratch, I&#39;ve never heard of it?&quot;<br/>\n<br/>\nFrom Nancy Persaud<br/>\n(although this comment is not within the rules of the contest as<br/>\nNancy recognized, it is too good to pass up): From a 5th grade<br/>\ngeography textbook, &quot;Maps are smaller than the areas they represent.&quot;<br/>\n<br/>\nFrom Dana Estes:<br/>\nA friend said, &quot;I could NEVER home school my children. I can&#39;t<br/>\nimagine spending that much time with them.&quot; She is a public school<br/>\nteacher.<br/>\n<br/>\nAND THIS WEEK&#39;S WINNER:<br/>\n<br/>\nFrom Cherie Oliver:<br/>\nMy daughter was born three months early and had severe brain<br/>\ndamage. We were told to put her in a home and forget about her.<br/>\nAt the age of three the state said that &quot;special&quot; children needed to<br/>\nbe sent to the public school system so that they could get the<br/>\nclasses they needed. When I told them I was going to home school my<br/>\ndaughter, the school worker came unglued.<br/>\nShe said, &quot;But the state can make her into a better, more dependent<br/>\nentity.&quot;<br/>\n<br/>\nMy daughter is now a first grader who reads, writes, and does all<br/>\nthe other first grader things. She is the most independent six<br/>\nyear-old I know.<br/>\nMike: Incredible. Truly incredible.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9026,"nextTopicId":9027}}