{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":184269211,"authorName":"Rebecca De Hate","from":"&quot;Rebecca De Hate&quot; &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling minded","postDate":"1198431467","msgId":28629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZrbTZkYiszYTE0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":28628,"nextInTime":28630,"topicId":28629,"numMessagesInTopic":0,"msgSnippet":"OK folks, it seems that I am getting this unschooling idea wrapped around my brain -- everywhere I go I find myself thinking hmm I bet if that parent just","messageBody":"<div id=\"ygrps-yiv-1524244293\">OK folks, it seems that I am getting this unschooling idea wrapped <br/>\naround my brain -- everywhere I go I find myself thinking &quot;hmm I bet <br/>\nif that parent just tried this....&quot; Does anyone else do that?  I&#39;m <br/>\nnot trying to be judgemental but I&#39;m seeing how people react to kids <br/>\nand I think -- &quot;geez, I&#39;ve done that but I bet if I just did this&quot; <br/>\nthe child would be much happier.  For instance, several times I see <br/>\nchildren that are pretty young and the parent just expects the child <br/>\nto sit in the high chair the whole time.  One day a little girl was <br/>\ncrying and crying and crying and I just knew that she only wanted <br/>\nher mom to hold her!  but she wouldn&#39;t she made her sit in the high <br/>\nchair.  now I understand that the mom&#39;s reaction was probably that <br/>\nI&#39;m not going to reward her by holding her she needs to learn to <br/>\nstop having a fit.  However!!???  I&#39;ve had the same thoughts so I <br/>\nunderstand,, but to see from an outside angle made me re-think that <br/>\nphilosophy.  It also amazes me how many people (including myself) <br/>\nhave excepted spanking.  The other day at the daycare my boy goes to <br/>\nthe one lady even said she thinks that is why made buts... Now I <br/>\nknow she didn&#39;t and won&#39;t spank these kids but... since I&#39;ve been <br/>\nresearching and de-schooling I&#39;ve been really staying away from it.  <br/>\n<br/>\nOh and then yesterday there was a gentlemen at the restaurant with a <br/>\nboy that was probably around 5 -- Now in other peoples eyes (and <br/>\neven mine a little, unfortunately) he seemed like an out right <br/>\nbrat.  First, he (the child) decided he wanted to change tables so <br/>\nhis dad let him (good dad -- let&#39;s avoid argument and why not?)  I <br/>\ntold that dad that sometimes we just have to do that.. I could tell <br/>\nhe was so relieved that someone understood why he let his child do <br/>\nit.  The boy also kept wanting to leave the dining room go to the <br/>\nrestroom, play with salt and sugars, etc.  Even at one point the dad <br/>\nwas trying to get him to just sit up -- which wouldn&#39;t have been a <br/>\nbig deal except that he his feet were sticking out and people were <br/>\ntrying to pass.  Not once did that father, threaten to spank, yell <br/>\nor anything.  I ended up talking with a bit and I could tell the dad <br/>\nwas glad to have someone that just understood.  BUt I could see <br/>\nother families looking and making judgement calls.  However, I hate <br/>\nit when parents gage how much there children should eat before they <br/>\nget dessert.  HOw does the parent know that child isn&#39;t close to <br/>\nfull and has just enough room to eat that ice cream?  Would the <br/>\nparent rather the child over eat (due to being pushed too) then eat <br/>\nhis dessert and eventually the child always overeats and may be over <br/>\nweight...???   <br/>\n<br/>\nAnyway I&#39;m babbling and I&#39;m  not even sure I&#39;m getting my thoughts <br/>\nout correctly.  I basically just find a rewarding that I can see my <br/>\nmind shifting from old ways to some unschooling thoughts.   <br/>\n<br/>\nNow if I can just always apply them to in my household more!! <br/>\n<br/>\nBy the way it has been happening more at home... when mommy let&#39;s go <br/>\nif that darn control and just lets the day flow... the day does just <br/>\nthat flows very nicely -- perfect.   when that happens i find myself <br/>\nso anxious to get to the point of truly unschooling my children and <br/>\nletting my life be content and joyful..  <br/>\n<br/>\nthanks to this group I&#39;m learning...</div>","specialLinks":[]}],"prevTopicId":28626,"nextTopicId":28636}}