{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Need ideas for coping with control-oriented friends","postDate":"1152707356","msgId":15660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODczQzVFRDIwMzJFRC1CNjAtMkNFOUBtYmxrLXIxNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGU4b2lxOCtzMm1hQGVHcm91cHMuY29tPg==","referencesHeader":"PGU4b2lxOCtzMm1hQGVHcm91cHMuY29tPg=="},"prevInTopic":15467,"nextInTopic":0,"prevInTime":15659,"nextInTime":15661,"topicId":15467,"numMessagesInTopic":0,"msgSnippet":"... From: fullmoonfarm_mn@yahoo.com My concern is that our culture is so control-oriented that my friends approach to raising their kids is accepted","messageBody":"<div id=\"ygrps-yiv-1097718756\">-----Original Message-----<br/>\n From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fullmoonfarm_mn@...\">fullmoonfarm_mn@...</a><br/>\n<br/>\n<br/>\n My concern is that our culture is so control-oriented that my<br/>\n friends&#39; approach to raising their kids is accepted unquestioningly<br/>\n by others and supported by everyone they know (so it must be<br/>\n right?), so they continue it and expect me to practice it.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n Yeah---same with school. It&#39;s all accepted as normal and right.<br/>\n<br/>\n -=-=-=-=<br/>\n<br/>\n The things my friends&#39; kids say to my dd&#39;s. One said she is not<br/>\n allowed to sleep over b/c the rabbit made her sick (huh? rabbit<br/>\n remained in his cage the entire time of her visit and she got sick<br/>\n the day after her visit, not the day of). Another girl told them<br/>\n that her mom said Cait and Clio are spoiled brats. ARRGH! I do my<br/>\n best not to flaunt our RUing, but you know it&#39;s visible.<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n Sure it is!<br/>\n<br/>\n And it can get worse!<br/>\n<br/>\n  Cameron got a lot of this when we first pulled him out of school. His <br/>\nfriends&#39; parents said some pretty mean things about Cam and us that got <br/>\nback to us through his friends.<br/>\n<br/>\n  But look at it from their point of view: they *need* to justify why <br/>\nthey think they *have* to do things the way they do. If *your* way is <br/>\njust as valid, there&#39;s *might* be wrong. By telling their kids that <br/>\nyours&#39;re spoiled or will be stupid or will never get into college, they <br/>\ncan justify their own choices in parenting. It makes them seem right. <br/>\n&#39;Cause who wants spoiled. stupid kids who can&#39;t get into college? &lt;bwg&gt;<br/>\n<br/>\n -==-=-<br/>\n<br/>\n I just feel like crying. These are supposed to be my friends,<br/>\n and are my friends, but parenting is getting in the way. If their<br/>\n kids can&#39;t be totally comfortable with us b/c of what their moms<br/>\n think, and I continue to hear these things from the kids, how can we<br/>\n have friendship?<br/>\n<br/>\n -==-=-=-<br/>\n<br/>\n  Well, you may choose to end the friendships. Many friendships end due <br/>\nto whom you marry and how you choose to rear your children. And ask <br/>\nyourself, are you getting more from the relationship in other ways?<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n I don&#39;t think the kids are making these things up,<br/>\n b/c the language and tone used fit the women. My dh is fully<br/>\n supportive of RU and is the reason why we RU in the first place, but<br/>\n has come out and said he doesn&#39;t understand these ladies either. I&#39;m<br/>\n not sure if I want to phase out the friendships, b/c I care about<br/>\n them and their kids. They are wonderful people and do some amazing<br/>\n things in their lives. I&#39;m just feeling icky right now about the<br/>\n control thing, and am looking for coping mechanisms for these times<br/>\n when it rears its ugly head.<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n  You could point blank ASK them. Ask them why they&#39;re choosing to <br/>\ndamage your relationship by making these comments.<br/>\n<br/>\n -=-=-=-=-=-<br/>\n<br/>\n I know this was long, but thanks for reading. We live in an<br/>\n extremely rural area and the nearest unschoolers are a couple hours&#39;<br/>\n drive away, so I feel pretty disconnected most of the time. I read<br/>\n the unschoolingbasics board daily to get my doses of reaffirmation,<br/>\n and appreciate you all being here!<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n  You bet! But you may find that those long distance meetups are more <br/>\nyour cup of tea. Or maybe those other folks will change their minds <br/>\nafter you talk with them. It&#39;s NOT easy to put up with <br/>\nconventional/traditional parenting once you&#39;ve gone the other way. It <br/>\nhurts to see those antagonistic relationships---and they really think <br/>\nthey are doing what&#39;s right TOO. Just like you do! &lt;g&gt;<br/>\n<br/>\n  All my really close friends locally are childless. &lt;G&gt; I have good <br/>\nrelationships with the local unschoolers, but I&#39;ve had to dump the hard <br/>\ncore schoolers and school-at-homers (doh!) because of how they treat <br/>\ntheir kids. But it&#39;s my choice, and I&#39;m OK with that. My virtual <br/>\nfriends (on this list and others)---well, I just try to see them <br/>\nwhenever I can. I plan a yearly party to do just that! &lt;bwg&gt;<br/>\n<br/>\n  OH! and I also wanted to say that you could talk with your daughters <br/>\nabout what&#39;s happening. Cameron was really hurt that people would think <br/>\nBen and I were so crazy---he wanted us to be &quot;normal&quot; again. And his <br/>\nfriends told him that he would be stupid. Patience. Patience. Patience! <br/>\nI told Cameron that they would see eventually. I was right. Even the <br/>\nin-laws are coming around! &lt;LOL&gt;<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  School&#39;s goal is to prepare them to be anything they want. But the <br/>\nprocess is so dullifying and kids haven&#39;t explored the possibilities of <br/>\nwhat they could be that many set their sites as low as possible. They <br/>\ngo to college to get a job to buy stuff. ~Joyce Fetteroll<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":241747552,"authorName":"fullmoonfarm_mn","from":"&quot;fullmoonfarm_mn&quot; &lt;fullmoonfarm_mn@...&gt;","profile":"fullmoonfarm_mn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Need ideas for coping with control-oriented friends","postDate":"1152372360","msgId":15467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4b2lxOCtzMm1hQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15660,"prevInTime":15466,"nextInTime":15468,"topicId":15467,"numMessagesInTopic":0,"msgSnippet":"Hi, I ve been a lurker for a few years under one yahoo profile or another; our computers die a horrible death and we forget passwords in the time it takes us","messageBody":"<div id=\"ygrps-yiv-1901858696\">Hi, I&#39;ve been a lurker for a few years under one yahoo profile or <br/>\nanother; our computers die a horrible death and we forget passwords <br/>\nin the time it takes us to get a new computer.  I&#39;m Dawn O., mom to <br/>\nCait (9) and Clio (7).  I&#39;ve been pursuing RU in that time, slowly <br/>\ngoing from school-at-homer to unschooling-but-the-math-and-reading, <br/>\nand finally we have let go of things including bedtimes and food.  I <br/>\ndon&#39;t change my ways very quickly, and as I&#39;m trying on new hats I <br/>\ngo back and forth between the new hat and the old one.  Eventually, <br/>\nthe old hat just doesn&#39;t feel right anymore and I&#39;m able to get rid <br/>\nof it!<br/>\n   Anyway, I decided to post today because the issue of controlling <br/>\nour children is coming up more in my life; friends of mine control <br/>\ntheir kids in ways I am uncomfortable with.  Their kids have to ask <br/>\nto play video games, to go outside, to watch tv, to use the <br/>\ncomputer, to eat, to call a friend, etc.  I was asked yesterday if I <br/>\nlet Cait and Clio watch whatever they want, and I said yes, pretty <br/>\nmuch, I just like to be with them or availavle in case they have <br/>\nquestions about what they see (this was sparked b/c I asked one of <br/>\nthe kids if they had seen a particular movie I thought he&#39;d be <br/>\ninterested in - Aeon Flux).  When I tell them that they can watch <br/>\nwhat they want, when they want, I felt like I was met with a silence <br/>\n(could have been imagined out of fear of judgement?).<br/>\n   My concern is that our culture is so control-oriented that my <br/>\nfriends&#39; approach to raising their kids is accepted unquestioningly <br/>\nby others and supported by everyone they know (so it must be <br/>\nright?), so they continue it and expect me to practice it. <br/>\nMeanwhile, their kids see how my kids are treated and don&#39;t <br/>\nunderstand why they are raised in a different way.  I understand <br/>\nthat the parents are only doing what they feel is right, but <br/>\nconsider my next concern...<br/>\n   The things my friends&#39; kids say to my dd&#39;s.  One said she is not <br/>\nallowed to sleep over b/c the rabbit made her sick (huh? rabbit <br/>\nremained in his cage the entire time of her visit and she got sick <br/>\nthe day after her visit, not the day of).  Another girl told them <br/>\nthat her mom said Cait and Clio are spoiled brats.  ARRGH!  I do my <br/>\nbest not to flaunt our RUing, but you know it&#39;s visible.  <br/>\n   I just feel like crying.  These are supposed to be my friends, <br/>\nand are my friends, but parenting is getting in the way.  If their <br/>\nkids can&#39;t be totally comfortable with us b/c of what their moms <br/>\nthink, and I continue to hear these things from the kids, how can we <br/>\nhave friendship?  I don&#39;t think the kids are making these things up, <br/>\nb/c the language and tone used fit the women.  My dh is fully <br/>\nsupportive of RU and is the reason why we RU in the first place, but <br/>\nhas come out and said he doesn&#39;t understand these ladies either. I&#39;m <br/>\nnot sure if I want to phase out the friendships, b/c I care about <br/>\nthem and their kids.  They are wonderful people and do some amazing <br/>\nthings in their lives.  I&#39;m just feeling icky right now about the <br/>\ncontrol thing, and am looking for coping mechanisms for these times <br/>\nwhen it rears its ugly head.<br/>\n<br/>\nI know this was long, but thanks for reading.  We live in an <br/>\nextremely rural area and the nearest unschoolers are a couple hours&#39; <br/>\ndrive away, so I feel pretty disconnected most of the time.  I read <br/>\nthe unschoolingbasics board daily to get my doses of reaffirmation, <br/>\nand appreciate you all being here!<br/>\n--Dawn O.</div>","specialLinks":[]}],"prevTopicId":15499,"nextTopicId":15663}}