{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":43,"messages":[{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259236785","msgId":42213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlbHFqaCs1YmxxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMzNUU3NEMyQTU1NTQxQkU4RDc3MUU3NzU0RjBFMEJCQExZTEFMQVAyPg=="},"prevInTopic":42208,"nextInTopic":42214,"prevInTime":42212,"nextInTime":42214,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"Thanks Lyla and Meredith for the real life deschooling picture. It really helps me to see what it has looked like for you. It would be great if more of that","messageBody":"<div id=\"ygrps-yiv-1878102985\">Thanks Lyla and Meredith for the real life deschooling picture. It really helps me to see what it has looked like for you. It would be great if more of that kind of discussion could be easily found because what I have read on deschooling isn&#39;t nearly as clear or realistic, especially with intense kids. It makes it sounds so simple, just say yes more. But with my son, anything that isn&#39;t a yes is heard as a big, huge NO! and he has never handled no well. Even if its &quot;sorry honey, we don&#39;t have any&quot; or &quot;how about some of this instead&quot;. <br/>\n<br/>\nBut I did want to say, after reading all this, I had an amazing day with him today. I made him a great breakfast this morning, and cut the crust of his toast instead of leaving it like I usually do for him to tear off. I really wanted his room cleaned because he couldn&#39;t even play with his lego it was so buried under stuff, so I asked him to help me. He mostly built things with lego while I cleaned, but I didn&#39;t get mad, just teased him a bit and kept cleaning when his friend came over and presented his clean room to him later with a big Tada! We ate a nice lunch, watched some TV and when his stepdad came home after dinner I played lego with him on his newly clean floor. I was feeling like something sweet and he suggested the last of the ice cream, which I offered to share. He said no thanks, he wanted me to have it, then took a small bowl when it turned out there was enough for both of us. I didn&#39;t even finish mine, it tasted weird after eating lovely fresh mandarin oranges all day. I told him so and offered him the rest of mine. He ate a bit and let the rest melt. <br/>\n<br/>\nThis is the same kid who yesterday was in a fit of tears because his stepdad had opened a bag of chips he&#39;d been saving and eaten a couple. When I asked him why he was so upset, there were lots of chips in the world, he sobbed &quot;but you won&#39;t buy me anymore&quot;. I was mortified and sent him across to the store for more chips and some milk, but he came home with a sausage roll instead, saying he wanted something more substantial. So it wasn&#39;t about the chips at all, just the fact that he could get them if he wanted them.  <br/>\n<br/>\nLyla wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; let those voices go. seriously.  every SINGLE time i allowed myself to feel,  think, or heaven forbid voice those conflicted and doubtful and judgemental feelings about electronics, food, sleep, you name it, it set us back.  big time.  and once i was really, truly able to let go and just trust, the progress was stupendous.  i know most often the advice is don&#39;t drop all rules all at once, but my experience was similar to yours - an intense kid who couldn&#39;t tolerate another SECOND of any hint of control.  i had to really let go - including letting go of the notion of what it meant to be a good mother - and just surrender to our reality for a while.  it was messy.  and hard.  and confusing.  but the payoff on the other side has been incredible.    i&#39;d be happy to answer more specifc questions, i am not sure how to answer general &quot;how did you do it&quot; questions...<br/>\n&gt; &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I would say you have answered a lot of what I was asking. But really I am asking how you got the voices out of your head? I read and read and read and read some more, every list, blog or discussion I can. I talk to my irl unschooling friends, luckily I have a couple. Yet I find it so hard to shut them off. I guess I just need to get better at observing them and not attaching to them, but if you or anyone else has any tips on how you did that, please let fly. I guess what I am doing is slowly replacing my image of what a good mother is with the ones you all are painting. Much more pleasant images. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;you ask how one trusts they are  not messing up their kid?  i feel i messed up my kid MUCH more pre unschooling than anything unschooling related could possibly mess up.  unschooling has been the healing salve.  seriously.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It has already started its magic here too, although as you say, it is still pretty messy. Thanks for the reminder of why I am doing this. Really I came to unschooling with no other reasonable choices left. Control just wasn&#39;t going to work with Terran, the harder I tried the more he fought back, it was just a constant battle. Even if he has to work through some hard stuff about his body image and food choices, it can&#39;t possibly be worse than what it was before. And if I am someone he can trust, then I can be there to support him through it.</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259203159","msgId":42208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzNUU3NEMyQTU1NTQxQkU4RDc3MUU3NzU0RjBFMEJCQExZTEFMQVAyPg==","inReplyToHeader":"PGhla25vait1cWoxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhla25vait1cWoxQGVHcm91cHMuY29tPg=="},"prevInTopic":42207,"nextInTopic":42213,"prevInTime":42207,"nextInTime":42209,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"Once that particular playing field is level, kids have an easier time choosing on the basis of other qualities, like taste and how they feel after eating.","messageBody":"<div id=\"ygrps-yiv-793405912\">Once that particular playing field is level, kids have an easier time choosing on the basis of other qualities, like taste and how they feel after eating. Better quality foods frequently have a richer taste, which is appealing. They also are more likely to leave one feeling good afterwards - I mean actually feeling good, not faked out temporarily by a single ingredient. Kids notice that and will make decisions based on those factors. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>yes, they really do. my son (11) just asked me, tonight, if he had had any sweets yet today, as he couldn&#39;t remember.  it wouldn&#39;t have mattered if he had already, but he wanted to know.  i thought about it and realized he hadn&#39;t, and he decided to have some ice cream.  but i asked him if i could give him an apple while he was deciding,  as we&#39;d just had burgers and fries that we&#39;d picked up on the way home and so he&#39;d had fewer fresh foods than he normally does.  he said sure and ate that while we chatted, and then had ice cream.  <br/>\n<br/>\nthis is a kid who needed a full 18 months of &quot;deschooling&quot; in the food department, even though it seemed shorter than that in the actual &quot;school&quot; department, once he came home.  the OP&#39;s son sounds a LOT like my son, very intense about everything, *very* attached to freedom of choice and resistant/reactive to anything that is even subtly perceived as control (my son told me once that my *opinion* sometimes feels like pressure or control because he feels things so deeply, he struggles with disappointing others vs. his own freedom.  <br/>\n<br/>\nnow, though, he will actively seek my opinion - even about food.  and sometimes he will follow my advice, and other times not, but his intake is much more balanced, and, even more importantly, much more hunger/body related rather than emotion related, than it used to be.  night and day really.<br/>\n<br/>\nand the  OP wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>It could easily be the case that he would have gained weight anyway, both his dad and I did at his age. But so much sitting still combined with not great food choices is not helping the situation. In fact that is what I told his dad when I got an email during their summer visit about how I was responsible for him gaining all this weight because he wasn&#39;t in school and being forced to do physical activity. (How&#39;s that for a voice in my head???)<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>yes, it&#39;s true, and my son has been through a very sedentary stage too - but that illusion of control is really just that - illusion.  there are plenty of overweight kids in school, who are, presumably, being &quot;forced&quot; to be active.  and i know that when it matters to my son that he be more fit or lean, if it does, he will make that happen.  my daughter, too, went through a chubby and sedentary phase at 10-12, and so did i.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>I am curious about the deschooling process with this. How long did it take? What did it look like? I have read about food freedom (and media freedom) mostly from people who had it all along, and when I read from people who are just starting it sounds pretty bad, lots of bingeing and lots of confusion. So I am really asking, for those of you who have been through it and out the other side, how do I trust that I am not totally messing my kid up? How did you do it? I really want to get this, but it just seems so antithetical to everything I think about being a &quot;good&quot; mother.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>let those voices go. seriously.  every SINGLE time i allowed myself to feel,  think, or heaven forbid voice those conflicted and doubtful and judgemental feelings about electronics, food, sleep, you name it, it set us back.  big time.  and once i was really, truly able to let go and just trust, the progress was stupendous.  i know most often the advice is don&#39;t drop all rules all at once, but my experience was similar to yours - an intense kid who couldn&#39;t tolerate another SECOND of any hint of control.  i had to really let go - including letting go of the notion of what it meant to be a good mother - and just surrender to our reality for a while.  it was messy.  and hard.  and confusing.  but the payoff on the other side has been incredible.  you ask how one trusts they are  not messing up their kid?  i feel i messed up my kid MUCH more pre unschooling than anything unschooling related could possibly mess up.  unschooling has been the healing salve.  seriously.  i&#39;d be happy to answer more specifc questions, i am not sure how to answer general &quot;how did you do it&quot; questions...<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259201107","msgId":42207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhla25vait1cWoxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmN2YzYTczMDkxMTI1MTE0MHE0MDQ3YWVmNGg5MDY1NzE4Njc1ZDRjZDc0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42206,"nextInTopic":42208,"prevInTime":42206,"nextInTime":42208,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... But the whole idea is to provide a variety of foods! Its not a matter of either-or, its and-both. Let them eat cake And salad. Something that can help a","messageBody":"<div id=\"ygrps-yiv-1362030578\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Beth Williams &lt;beth.s.williams@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; &gt; I agree completely, so my question is, if we are allowing our children to<br/>\n&gt; eat whatever they want, or rather, not providing a balance of foods that *<br/>\n&gt; aren&#39;t* nutritionally lacking, have vitamins, etc. how do we know they&#39;re<br/>\n&gt; not in the exact same position as the kids in this study?<br/>\n<br/>\n </span></blockquote>But the whole idea is to provide a variety of foods! Its not a matter of either-or, its and-both. Let them eat cake And salad. Something that can help a whole lot, however is presentation. Processed foods often have the advantage of convenience and fun packaging, so presenting more nutritious foods in ways that are attractive and convenient is an important part of the mix. That&#39;s part of the deal with &quot;monkey platters&quot; - they&#39;re not just easy to eat, they&#39;re cute. <br/>\n<br/>\nOnce that particular playing field is level, kids have an easier time choosing on the basis of other qualities, like taste and how they feel after eating. Better quality foods frequently have a richer taste, which is appealing. They also are more likely to leave one feeling good afterwards - I mean actually feeling good, not faked out temporarily by a single ingredient. Kids notice that and will make decisions based on those factors. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259200491","msgId":42206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhla241Yit2NWRvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlazExYys5dWYwQGVHcm91cHMuY29tPg=="},"prevInTopic":42205,"nextInTopic":42207,"prevInTime":42205,"nextInTime":42207,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... *************************** Ray left school and a six-year stay at his bio mom s house at the same time, so there were a Lot of limits that he lost all at","messageBody":"<div id=\"ygrps-yiv-989786707\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am curious about the deschooling process with this. How long did it take? What did it look like? I have read about food freedom (and media freedom) mostly from people who had it all along, and when I read from people who are just starting it sounds pretty bad, lots of bingeing and lots of confusion.<br/>\n </span></blockquote>***************************<br/>\n<br/>\nRay left school and a six-year stay at his bio mom&#39;s house at the same time, so there were a Lot of limits that he lost all at once. He ate a lot of processed foods for a couple years. Not Only processed foods, because there were always other things in the house, some of them just as easy and appealing. Easy and appealing can be really important in terms of helping kids choose more nutritious foods! But after a couple years he started cooking for the family and at that point he started to really notice things like nutrition. It was important to him to Cook nutritious food. It was a gift from him to the rest of the family. <br/>\n<br/>\nSo part of Ray learning to choose more nutritious foods was about Ray learning to give and receive love. It was about him feeling good enough about himself to do things actively that were &quot;good for him&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He IS a marvel. I don&#39;t think he gets to hear that enough, and especially with a cute little sister who of course can do no wrong (Did Ray go through that too?). <br/>\n </span></blockquote>****************************<br/>\n<br/>\nYes. With Ray it helped a lot the first couple years that we actively offered him many of the things he&#39;d been denied before. He&#39;d learned not to ask for the &quot;bad stuff&quot; but now and then he&#39;d drop a hint or comment and we&#39;d go get whatever he mentioned. Jello and soda were biggies - I still remember him saying &quot;wow&quot; over and over the first time we brought a case of soda home and told him it was all for him. <br/>\n<br/>\nIt also helped that we appologised to him whenever the subject came up, and admitted that we weren&#39;t as nice to him as we are to Morgan at the same age. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259199156","msgId":42205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhla2xyayttZjVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJFRkE2QTdBMzZFOTRDNTY5OUU3RkRDQzQyREY4NjNGQEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42204,"nextInTopic":42206,"prevInTime":42204,"nextInTime":42206,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... ******************** Which isn t the same as unschooling at all. What you re calling unwanted freedom is what I d call lack of support - its important","messageBody":"<div id=\"ygrps-yiv-1225979209\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;~*~Tracy Austin&quot; &lt;webinfusion@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When I was a kid I remember having lots of unwanted freedom because I was basically ignored outside of my whereabouts (usually) being known.<br/>\n </span></blockquote>********************<br/>\n<br/>\nWhich isn&#39;t the same as unschooling at all. What you&#39;re calling &quot;unwanted freedom&quot; is what I&#39;d call &quot;lack of support&quot; - its important that kids have the support of their parents! Unschooling won&#39;t work without it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But what I really wanted was someone to see ME and not just my actions. To really look at me, in the eye and see me; to feel known and valuable...I didn&#39;t get that (dad: alcohol, mom: prescription drugs and self-absorption on both their parts - but of course they &quot;loved&quot; me) and so looked for it in food.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nRight, you turned to food as a substitute or pallative for your unmet emotional needs. That&#39;s common - not just with food, it can be with exercise or spirituality just as easily as something deemed &quot;unhealthy&quot;. Would regular comments about your eating habits and limits on what you could eat in the home have helped you? Not likely, because the problem wasn&#39;t the food. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So is there any room in unschooling philosophy that some kids will need help controlling some of their choices? <br/>\n </span></blockquote>***********************<br/>\n<br/>\nWhat does that mean, though, &quot;need help controlling&quot;? That&#39;s the catch - what really is helpful for human beings in terms of figuring out our unique needs as individuals and making thoughtful decisions about how to deal with those needs? That&#39;s the crux of unschooling, right there, in terms of anything at all.<br/>\n<br/>\nWe can seem pretty clearly that controlling kids doesn&#39;t create kids or adults with the ability to make thoughtful decisions and parents throwing up their hands saying &quot;whatever!&quot; doesn&#39;t either. In fact, its been pretty clearly shown that both of those regularly lead to young adults who are prone to make very poorly thought-out decisions. That&#39;s considered the &quot;norm&quot; for teens, after all. <br/>\n<br/>\nHappily there&#39;s a whole world outside the realm of controlling-or-ignoring. Its possible to support kids to make thoughtful decisions, but part of that process includes being okay with the idea that sometimes kids will come up with solutions we don&#39;t like, or make decisions that aren&#39;t very good! That&#39;s not a cue to swoop in and take over. Depending on the kid, it may be time to offer more or different help, but it could also be time go offer commiseration, love, and silence. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Is the only answer to rapid weight gain that a parent is only giving pseudo-choices? <br/>\n </span></blockquote>***********************<br/>\n<br/>\nThe parent in the original post stated that she tends to lecture on the subject of what her son is eating - that&#39;s a &quot;pseudo choice&quot; since its a choice that come with punishment if you don&#39;t get it right. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;There are such things as addiction, and processed foods are full of addictive substances like MSG, sugar, white flour, ect...<br/>\n </span></blockquote>*************************<br/>\n<br/>\nWhat prevents addiction? That&#39;s a really important point. Limits don&#39;t prevent addiction. Emotional blackmail certainly doesn&#39;t prevent addiction! What does? A strong sense of self esteem helps enormously. A sense that one is powerful helps, too. What can we do to help our kids feel good about themselves and feel confident in their own abilities? In their own decision making? <br/>\n<br/>\nPeople learn about decision making by making decisions! But that&#39;s Hard for kids who have been in school, having most of their decisions made for them for years. Its challenging for older kids to learn to trust their own good judgement, and they take a lot of support along the way. Some of that support takes the form of letting kids experiment for awhile and finally have the chance to figure out what really works for them, what helps them feel good and what doesn&#39;t. That&#39;s not the same as standing back and doing nothing, but it can often mean parents biting their tongues on certain subjects for awhile, until/unless the kid in question is ready for some input. <br/>\n<br/>\nOne of the things that helps people experiment with thoughtful decision making is knowing there&#39;s a &quot;soft place to fall&quot; - that there&#39;s someone who&#39;s willing to help you pick up the pieces and go right on loving you without giving you grief for your mistakes. Being that person for our kids is a big part of unschooling! <br/>\n <br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259194425","msgId":42204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhla2g3cCt2MWd1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42203,"nextInTopic":42205,"prevInTime":42203,"nextInTime":42205,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... Whether or not its an addiction, its an emotional issue. Its not about the food per se. There are a variety of methods for healing from addictions - I","messageBody":"<div id=\"ygrps-yiv-2141877145\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Beth Williams &lt;beth.s.williams@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I have been taking a class w/ a<br/>\n&gt; psychologist that deals w/ eating disorders and she works w/ a center that<br/>\n&gt; does research on the brain and how food affects it, etc.  They feel that<br/>\n&gt; there are certain people (and I believe one of my daughters and I are two)<br/>\n&gt; that are carb. addicts.  That it&#39;s a physical addiction and no amount of<br/>\n&gt; letting it go on and on will ever get us to regulate. <br/>\n<br/>\n </span></blockquote>Whether or not its an addiction, its an emotional issue. Its not &quot;about&quot; the food per se. There are a variety of methods for healing from addictions - I mean other than something like 12 step programs which don&#39;t claim to heal addiction - that focus on meeting the underlying needs and emotional damage. <br/>\n<br/>\nIts true that &quot;just&quot; unlimiting food isn&#39;t the only thing to be done, there&#39;s emotional work and healing! But certainly imposing outside limits on someone with an addiction has never been shown to be particularly helpful. <br/>\n<br/>\nBut dealing with addictions and other serious emotional problems is well outside the scope of this list. <br/>\n<br/>\nIts important to keep in mind that unschooling isn&#39;t &quot;hands off&quot; parenting, its working in partnership with kids, to support them where they need support. A kid who needs emotional support isn&#39;t helped very well by rules and limits, but that&#39;s not the same as saying &quot;you&#39;re on your own&quot;. It does require that parents think outside the box a bit, look at alternatives to the standard &quot;wisdom&quot; about what motivates people because soooooo much of that revolves around controlling others&#39; behavior. Kids don&#39;t want or need us to control them! They need to have the space and support to discover how to be themselves. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259193677","msgId":42203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhla2dnZCs5bzlyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVESkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+"},"prevInTopic":42199,"nextInTopic":42204,"prevInTime":42202,"nextInTime":42204,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... This was true of Ray for awhile, too, when he was younger, although he couldn t articulate it quite like that. It makes sense if you think about kids","messageBody":"<div id=\"ygrps-yiv-1362409206\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;otherstar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;For the longest time, it seemed like we were constantly<br/>\n&gt; asking her to stop things that annoyed the rest of us (throwing a fit, being<br/>\n&gt; loud, or whatever). She has told us that her hobby is to annoy people. She<br/>\n&gt; does a mighty fine job of it. <br/>\n<br/>\n </span></blockquote>This was true of Ray for awhile, too, when he was younger, although he couldn&#39;t articulate it quite like that. It makes sense if you think about kids needing to feel competent. If the one thing a child feels capable of doing is annoy people, then he or she is going to put more energy into that, because its better to feel competent at something unpleasant than to feel helpless. <br/>\n<br/>\nOne of the things George and I did to actively change that dynamic was to notice - out loud - when Ray did something positive. It helped us to see him in a more positive light *and* it helped him feel better about himself and his abilities. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: weight gain","postDate":"1259187268","msgId":42199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPR0VFSURDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhlanRpdStkbGc1QGVHcm91cHMuY29tPg=="},"prevInTopic":42198,"nextInTopic":42203,"prevInTime":42198,"nextInTime":42200,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... yours. There were lots of limits though, especially when my parents got worried about something I was doing. The thing was, they almost always backfired","messageBody":"<div id=\"ygrps-yiv-739346194\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I was just remembering my childhood which sounds pretty similar to<br/>\n </span></blockquote>yours. There were lots of limits though, especially when my parents got<br/>\nworried about something I was doing. The thing was, they almost always<br/>\nbackfired and made me want the thing more, even if it was actually really<br/>\nbad for me. What would have helped was not limits but a warm, close caring<br/>\nrelationship where I felt like my parents were on my side and not trying to<br/>\nkeep me from having fun or make my own choices. If I could have gone to them<br/>\nwhen things were confusing or hard or just plain messed up and said hey,<br/>\nwhat do you think? How might you handle this? Can you help me? Instead I hid<br/>\nthings from them and snuck and lied and when that didn&#39;t work I openly<br/>\ndefied them and fought for my right to make my own choices. That is not what<br/>\nI want with my kids, I want to get to a place where they see me as a<br/>\nresource, not a barrier to getting what they want.  &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI think you should tell your son this! Whenever I get frustrated or feel<br/>\nlike I am at an impasse, I bring my kids into the discussion and talk to<br/>\nthem openly and honestly. It is so much easier for them to come to me and be<br/>\nhonest with me if I am open and honest with them.<br/>\n<br/>\nConnie<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: weight gain","postDate":"1259186683","msgId":42198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVFSERDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PEJFRkE2QTdBMzZFOTRDNTY5OUU3RkRDQzQyREY4NjNGQEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42197,"nextInTopic":42199,"prevInTime":42197,"nextInTime":42199,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... every child unlimited choices about food is a good thing? Isn t a big apart of unschooling that each person is an individual and has different needs? So is","messageBody":"<div id=\"ygrps-yiv-905826934\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I want to jump in here and say that I too am interested in how giving<br/>\n </span></blockquote>every child unlimited choices about food is a good thing? Isn&#39;t a big apart<br/>\nof unschooling that each person is an individual and has different needs? So<br/>\nis there any room in unschooling philosophy that some kids will need help<br/>\ncontrolling some of their choices? Is the only answer to rapid weight gain<br/>\nthat a parent is only giving pseudo-choices? There are such things as<br/>\naddiction, and processed foods are full of addictive substances like MSG,<br/>\nsugar, white flour, ect... &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nThere is a big difference between YOU controlling their choices versus them<br/>\nasking you to help them or you gently helping them. The point is to help<br/>\nyour children identify their own needs rather than being told by you what<br/>\nthey need. Letting them make their own food choices is a big part of helping<br/>\nthem listen to their own bodies. A lot of times we crave certain foods<br/>\nbecause our bodies are missing something that is in that food. Every person<br/>\nis an individual and has different needs. We do not live in our children&#39;s<br/>\nbodies and cannot say for certain that we are correct in assuming that their<br/>\nindividual bodies need certain foods to the exclusion of others. We are only<br/>\nguessing based on their external cues. One of the dangers of controlling and<br/>\nrestricting everything is that at some point they forget how to listen to<br/>\ntheir own cues and instead rely on external cues from parents (or others)<br/>\nregarding their own bodily issues. If a kid is having a bad reaction to<br/>\nsomething, I think it is perfectly valid to say, &quot;hey, I have noticed that<br/>\neating X thing seems to cause you to Y&quot; as long as you do it in a<br/>\nnonjudgmental way. If something really concerns you, tell your kid about it.<br/>\nDon&#39;t make choices for them without their consent. They are capable of<br/>\nunderstanding more than most adults would like to believe.<br/>\n<br/>\nWhy do they have to always get processed foods? Instead of snake cakes,<br/>\noffer to bake cookies together. Start reading the labels and include your<br/>\nkids in the process. If the kids want cookies and you don&#39;t feel like<br/>\nbaking, tell them you want to read the label and pick a brand that doesn&#39;t<br/>\nhave all the extra stuff in it. Really, a little junk isn&#39;t going to hurt in<br/>\nthe long run. What hurts is when that is all the kids eat day in and day out<br/>\nfor their entire lives. If you go to the grocery store and buy a variety of<br/>\nfood and it is all gone at the end of the week, then they have probably had<br/>\na balanced diet.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"RE: [unschoolingbasics] Re: weight gain","postDate":"1259185457","msgId":42197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPT0VFR0RDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42196,"nextInTopic":42198,"prevInTime":42196,"nextInTime":42198,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... I have issues w/ all of this for myself (and worry about it too w/ my children) and have TRIED no limitations and it never gets to the self regulating","messageBody":"<div id=\"ygrps-yiv-479394305\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; I&#39;m interested in knowing if anyone knows of research on this stuff.<br/>\n </span></blockquote>I have<br/>\nissues w/ all of this for myself (and worry about it too w/ my children) and<br/>\nhave TRIED no limitations and it never gets to the self regulating stage (it<br/>\njust gets exponentially worse). I have been taking a class w/ a<br/>\npsychologist that deals w/ eating disorders and she works w/ a center that<br/>\ndoes research on the brain and how food affects it, etc. They feel that<br/>\nthere are certain people (and I believe one of my daughters and I are two)<br/>\nthat are carb. addicts. That it&#39;s a physical addiction and no amount of<br/>\nletting it go on and on will ever get us to regulate. They site studies<br/>\nwhere nothing but food changes can completely change people&#39;s violent<br/>\nbehavior, etc. I think different people have different sensitivities in<br/>\ndifferent ways and I&#39;m not sure how I feel about discounting this idea.<br/>\nAnyway, I&#39;m curious because I always see this topic in books and it appears<br/>\nto be a theory w/ no apparent evidence, as far as I can tell. I&#39;d love to<br/>\nhave studies on both sides to compare myself, if there are any. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nI don&#39;t know about the studies but I have read quite a bit about addiction<br/>\nand eating disorders as both are rampant through out my family tree. Certain<br/>\npeople may be carb addicts just like there are people that become addicted<br/>\nto alcohol, cocaine, marijuana, sex, and a myriad of other things. Most<br/>\npeople become addicted because of some sort of unmet need. Drugs are illegal<br/>\nand are highly restricted but that does not stop people from getting<br/>\naddicted to them. I agree that no amount of letting it go on and on will<br/>\nhelp. On the flip side, no amount of restricting it will cure it. Look at an<br/>\nalcoholic, for example, you can restrict it all day long but at the end of<br/>\nthe day, that will make little or no difference. In order to conquer an<br/>\naddiction, a person must first be self aware. How can a person be self aware<br/>\nif somebody on the outside is constantly hounding them? If you are addicted<br/>\nto carbs and you think your daughter is too, then do some research together<br/>\non ways to help curb the addiction. Restricting food will be of little or no<br/>\nhelp. You might see short term success but long term repurcussions could<br/>\npotentially undo any of the good gained while you are in control of her<br/>\neating.<br/>\n<br/>\nCarbohydrate addiction triggers from<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.spiritofhealing.com/articles/html/carbohydrate_addiction.htm\">http://www.spiritofhealing.com/articles/html/carbohydrate_addiction.htm</a><br/>\n &quot;A number of factors can cause or intensify the desire to eat.  A wide<br/>\nvariety of emotional factors trigger carbohydrate addiction and include<br/>\nemotions such as anger, anxiety, loss of emotional control, depression,<br/>\nexcitement, frustration, guilt and self-blame.  But there are other factors<br/>\nwhich can trigger this addiction.  Relatively benign changes in your home<br/>\nlife or working conditions can cause changes in your eating habits which can<br/>\nlead to carbohydrate addiction.  Exercise, illnesses, pregnancies,<br/>\npremenstrual changes, smoking and quitting smoking and stress of any kind<br/>\ncan all affect carbohydrate consumption.<br/>\n<br/>\n   Dieting can also trigger carbohydrate addiction.  This is especially<br/>\ncommon in people that subject themselves to extreme dieting or fasting.<br/>\n<br/>\n   Of course, high carbohydrate foods can trigger the addiction process.<br/>\nThe best trigger foods are bread and grain products including bagels, rolls,<br/>\ndonuts, cookies, crackers, cereals (both man-made and natural), cakes, and<br/>\npastries of all types.<br/>\n<br/>\n   But foods we usually think of as very healthy are equally potent<br/>\ntriggers.  Fruits of all kinds including the dried varieties and their<br/>\njuices are potent triggers.  This is because all of the fruits are full of<br/>\nsugars which trigger the release of insulin.<br/>\n<br/>\n   Snack foods such as popcorn, potato chips, pretzels, cheese puffs, and<br/>\ncandies are potent triggers. &quot;<br/>\n<br/>\nI listed the above quote because it shows that even if you restrict food,<br/>\nthere may be other triggers for carb addiction. It is common knowledge that<br/>\nparents that completely limit alcohol and never drink still end up with kids<br/>\nthat are alcoholics.<br/>\n<br/>\n<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259182818","msgId":42196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5NDA4Ni45OTYxMS5xbUB3ZWIxMTMyMDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGZmN2YzYTczMDkxMTI1MTE0MHE0MDQ3YWVmNGg5MDY1NzE4Njc1ZDRjZDc0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42194,"nextInTopic":42197,"prevInTime":42195,"nextInTime":42197,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... eat whatever they want, or rather, not providing a balance of foods that * aren t* nutritionally lacking, have vitamins, etc. how do we know they re not in","messageBody":"<div id=\"ygrps-yiv-1091546873\"><blockquote><span title=\"ireply\">&gt; I agree completely, so my question is, if we are allowing our children to<br/>\n </span></blockquote>eat whatever they want, or rather, not providing a balance of foods that *<br/>\naren&#39;t* nutritionally lacking, have vitamins, etc. how do we know they&#39;re<br/>\nnot in the exact same position as the kids in this study?&gt;<br/>\n<br/>\nBecause our kids aren&#39;t growing up in neglected households where there is no discussion about foods, cravings, how one&#39;s body feels after eating such-and-such, etc.  My kids have been eating, with me beside them, their whole lives, have seen how *I* eat, have heard me say &quot;I don&#39;t really like bread--it makes me sleepy&quot; enough to think through for themselves whether or not bread makes THEM sleepy, they&#39;ve heard me say &quot;I feel better when I eat protein in the morning&quot; to try it out themselves and see if it makes *them* feel better, too...But I haven&#39;t said to them &quot;You need to eat protein in the morning because otherwise you&#39;ll be cranky&quot;, because, Guess what--I don&#39;t know if it will for them!  I just know it does for me..<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":309081207,"authorName":"Beth Williams","from":"Beth Williams &lt;beth.s.williams@...&gt;","profile":"mongoosewilliams","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259179682","msgId":42194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmN2YzYTczMDkxMTI1MTIwOHgxZDQ2ODE2Y3FjZGU4N2Q3YzE2ZGNkOTE1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhlanRpdStkbGc1QGVHcm91cHMuY29tPg==","referencesHeader":"PEJFRkE2QTdBMzZFOTRDNTY5OUU3RkRDQzQyREY4NjNGQEF1c3RpbkJ1c2luZXNzPiAJPGhlanRpdStkbGc1QGVHcm91cHMuY29tPg=="},"prevInTopic":42192,"nextInTopic":42196,"prevInTime":42193,"nextInTime":42195,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... It s sounds to me like this is exactly what you should do and what you want to do, it s just a matter of figuring out how.  Without good role models of ","messageBody":"<div id=\"ygrps-yiv-299056077\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I was just remembering my childhood which sounds pretty similar to yours.<br/>\n&gt; There were lots of limits though, especially when my parents got worried<br/>\n&gt; about something I was doing. The thing was, they almost always backfired and<br/>\n&gt; made me want the thing more, even if it was actually really bad for me. What<br/>\n&gt; would have helped was not limits but a warm, close caring relationship where<br/>\n&gt; I felt like my parents were on my side and not trying to keep me from having<br/>\n&gt; fun or make my own choices.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s sounds to me like this is exactly what you should do and what you want<br/>\nto do, it&#39;s just a matter of figuring out how.  Without good role models of<br/>\nhow, we&#39;re lost and we just end up continuing the chain. You are also<br/>\nworried now (as you say your parents were then).  My mom was angry all the<br/>\ntime and I got yelled at for things re: trying to understand my world and my<br/>\nbody, and how to navigate them...I realize now, it was how she expressed<br/>\nworry/concern!  Seems antithetical to showing it.  Could you honestly,<br/>\nwarmly, kindly and empathetically talk to him about this, how you felt as a<br/>\nchild and how you want to do this better with him than what was done with<br/>\nyou?  ....that you&#39;re concerned for his health? ....how would he like you to<br/>\nbe with him about it?, etc.   You have the awareness that this is how it<br/>\nshould be but I can completely relate that the follow through it difficult<br/>\nand takes time.  I think once you are aware of it, the trick is to take the<br/>\nemotion (on our part) out of it....I think that&#39;s where we get into trouble<br/>\n(at least *I* do....feeling it from our POV/the buttons that get pushed for<br/>\nus, instead of seeing it from their POV and being able to empathize and find<br/>\na solution with them that works.<br/>\nBeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":309081207,"authorName":"Beth Williams","from":"Beth Williams &lt;beth.s.williams@...&gt;","profile":"mongoosewilliams","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259178026","msgId":42192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmN2YzYTczMDkxMTI1MTE0MHE0MDQ3YWVmNGg5MDY1NzE4Njc1ZDRjZDc0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEY0RjBGMEE3LTQ5MzItNEY1RC1BMjA2LTNFN0YzMzlEOTFBMEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPiAJPGhlaWc3Yysyc202QGVHcm91cHMuY29tPiA8ZmY3ZjNhNzMwOTExMjUwNTMxZzY0ZTVlYzAzeDdiZDg0OGE5ZTFjNmNmMTlAbWFpbC5nbWFpbC5jb20+IAk8RjRGMEYwQTctNDkzMi00RjVELUEyMDYtM0U3RjMzOUQ5MUEwQHZlcml6b24ubmV0Pg=="},"prevInTopic":42191,"nextInTopic":42194,"prevInTime":42191,"nextInTime":42193,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... eat whatever they want, or rather, not providing a balance of foods that * aren t* nutritionally lacking, have vitamins, etc. how do we know they re not in","messageBody":"<div id=\"ygrps-yiv-2093531266\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I suspect their behavior is caused by what they *didn&#39;t* eat. I<br/>\n&gt; suspect they&#39;re all nutritionally depleted to begin with and being<br/>\n&gt; fed more food that&#39;s nutritionally lacking.<br/>\n&gt;<br/>\n&gt; So I bet they wouldn&#39;t get the same results from kids who were<br/>\n&gt; already getting enough vitamins, minerals and so forth.<br/>\n&gt;<br/>\n&gt; I agree completely, so my question is, if we are allowing our children to<br/>\n </span></blockquote>eat whatever they want, or rather, not providing a balance of foods that *<br/>\naren&#39;t* nutritionally lacking, have vitamins, etc. how do we know they&#39;re<br/>\nnot in the exact same position as the kids in this study?<br/>\n<br/>\nBeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259177836","msgId":42191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlazExYys5dWYwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg0Q0RDMkU5QjQ3RjQ5RkZBQjZFRkUyQzc2MTY1NUNBQExZTEFMQVAyPg=="},"prevInTopic":42190,"nextInTopic":42192,"prevInTime":42190,"nextInTime":42192,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... It could easily be the case that he would have gained weight anyway, both his dad and I did at his age. But so much sitting still combined with not great","messageBody":"<div id=\"ygrps-yiv-26557672\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt;   it&#39;s also very possible the weight gain is related to hormones and not food so much - my son put on at least that much weight between the ages of 9 and 10 - and that is when he also got throught the major deschooling and began eating MORE healthfully and well balanced than he ever had before.  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It could easily be the case that he would have gained weight anyway, both his dad and I did at his age. But so much sitting still combined with not great food choices is not helping the situation. In fact that is what I told his dad when I got an email during their summer visit about how I was responsible for him gaining all this weight because he wasn&#39;t in school and being forced to do physical activity. (How&#39;s that for a voice in my head???)<br/>\n<br/>\nI am curious about the deschooling process with this. How long did it take? What did it look like? I have read about food freedom (and media freedom) mostly from people who had it all along, and when I read from people who are just starting it sounds pretty bad, lots of bingeing and lots of confusion. So I am really asking, for those of you who have been through it and out the other side, how do I trust that I am not totally messing my kid up? How did you do it? I really want to get this, but it just seems so antithetical to everything I think about being a &quot;good&quot; mother. <br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt;   lyla<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":309081207,"authorName":"Beth Williams","from":"Beth Williams &lt;beth.s.williams@...&gt;","profile":"mongoosewilliams","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259177702","msgId":42190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmN2YzYTczMDkxMTI1MTEzNWo2YWZhN2NmY3M3YmQ0ZTY5NWViMzlmZDIyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ3Mjc0Ny43NDA0My5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPiAJPGhlaWc3Yysyc202QGVHcm91cHMuY29tPiA8ZmY3ZjNhNzMwOTExMjUwNTMxZzY0ZTVlYzAzeDdiZDg0OGE5ZTFjNmNmMTlAbWFpbC5nbWFpbC5jb20+IAk8NDcyNzQ3Ljc0MDQzLnFtQHdlYjg2MjAzLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":42189,"nextInTopic":42191,"prevInTime":42189,"nextInTime":42191,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... OK, I promise to check out all the links you ve sent, and really appreciate you sending them....I m getting overwhelmed w/ info. and it will take me a bit","messageBody":"<div id=\"ygrps-yiv-1108955924\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt; Then she&#39;s dismissed a huge amount of work in and out of her field.<br/>\n&gt;<br/>\n </span></blockquote>OK, I promise to check out all the links you&#39;ve sent, and really appreciate<br/>\nyou sending them....I&#39;m getting overwhelmed w/ info. and it will take me a<br/>\nbit to look through and process, but I do think that small studies make<br/>\nsense to some degree, but then maybe it needs to be a catalyst for more?!<br/>\n As I recall, the study that linked thimersasol in vaccines to autism was<br/>\nmade up of 12 kids and it made it hard for some &quot;experts&quot; to consider<br/>\nlegitimate but I do think it brought huge attn. to the possibility and got<br/>\nthat substance removed from most vaccines.  The only thing about it,<br/>\nis...has it stopped autism from occurring?  Is it the only factor?  Would a<br/>\nlarger group yield different results?  better?  more info.?  I think there&#39;s<br/>\nroom for both and you can&#39;t do one small study and give a blanket statement<br/>\nre: results and pin everything to it.  I do think my professor was<br/>\nopinionated and I think she meant more like she doesn&#39;t TRUST studies under<br/>\n100.  As in, maybe she wants more proof that what is true of 5 kids is true<br/>\nof the whole population in general.  If you KWIM.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; About the study, I&#39;m not sure how it is relevant. It isn&#39;t a well done<br/>\n&gt; study and the actions of food exclusion done based on the study aren&#39;t<br/>\n&gt; well-founded. The idea that giving people better nutrition isn&#39;t at all at<br/>\n&gt; odds with unschooling. Of course food makes you feel differently. I don&#39;t<br/>\n&gt; feel great if I&#39;m living on fats and sugars. So I eat a range of foods. I<br/>\n&gt; provide a range of choices for Simon and Linnaea.<br/>\n&gt;<br/>\n </span></blockquote>This is a good point that I think people (maybe new to Unschooling?  I know<br/>\nI&#39;ve gone through it myself) don&#39;t understand or always &quot;get&quot; and maybe this<br/>\nis what the original poster is wrestling with.  Maybe this is exactly the<br/>\npiece she&#39;s looking for?  That she CAN provide a variety of foods and not<br/>\njust everything her son requests.  That there can be a mix, together they<br/>\ncan reach consensus and they can look at (together) the idea you speak about<br/>\nabove of how &quot;bad&quot; sugars and fats (because there ARE &quot;good&quot; ones --meaning<br/>\nones w/ nutritional value that nourish your body as opposed to ones that<br/>\ndeplete you, and processed foods) make you feel.   I kind of think, in the<br/>\nend, that&#39;s what I took from this study...and the kids in it did too, a<br/>\nrecognition of how &quot;junk food day&quot; made them feel....had they never been<br/>\ninvolved in the study, how would they know that?<br/>\n<br/>\nBeth<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259176963","msgId":42189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlazA2MytwazliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlaHZhMyt0Ym4xQGVHcm91cHMuY29tPg=="},"prevInTopic":42188,"nextInTopic":42190,"prevInTime":42188,"nextInTime":42190,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... I KNOW, aargh, I know, stuff just seems to come out of my mouth and I know I am trying to help him make wise choices but I end up just nagging. Yuck! ... ","messageBody":"<div id=\"ygrps-yiv-39460603\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;meredith@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Ten months isn&#39;t a very long time to deschool. Lots of kids take longer than that. And really, every time you put some pressure on him about his choices, you undermine his deschooling process a little, set him back a bit. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I KNOW, aargh, I know, stuff just seems to come out of my mouth and I know I am trying to help him make wise choices but I end up just nagging. Yuck!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;Now he wants kraft dinner and processed foods, or fast food <br/>\n&gt; <br/>\n&gt; Ray was like that for more than a year - almost two, before he wanted more variety again, and more vegetables. It really wasn&#39;t until he started cooking, now that I think about it. Until then, he wanted all the foods he&#39;d been denied for thirteen years. That&#39;s a Lot of Mac n&#39; Cheese and Ramen noodles!<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>But he did get over it? That&#39;s what I wonder, if I am setting him up for obesity and health problems if I just let it go. That&#39;s what I want to hear, that kids like him who have been limited can get over it. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;will often eat ice cream, candy or other sweets first thing in the morning and continue throughout the day, even when I am really conscientious about providing him with other foods when he seems hungry. <br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; Just when he seems hungry? Have a variety of food available all the time. Make sure nutritious food is just as convenient and attractive to the eye as less nutrient dense foods and otherwise let him choose. If he tends to start the day with sweets, what about home made sweets? Start the day with cake! Add nuts or nut-meal to make the batter richer, or make a cream-cheese frosting. Those are the sorts of things that taste wonderful while also providing a bit of protein. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I do a lot of this, pancakes with peanut butter, real maple syrup and blueberries for breakfast, breakfast platters with fried potatoes, eggs, fruit, toast. Lunches are often snack trays with a good mix of fruit, veggies, olives, cheese, crackers. I am offering lots of great foods, and he actually does eat most of them. (Aha, realizing that I am doing that thing that Sandra Dodd talks about, &quot;he NEVER eats anything good&quot;) He still does eat lots of great food, just not as much as before and with a lot of new things and in bigger quantities than I am comfortable with. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;I don&#39;t want Terran to suffer either the health or social consequences of being overweight like I and his dad both did. <br/>\n&gt; ****************<br/>\n&gt; <br/>\n&gt; Then its all the more important you not give the impression that you&#39;re picking or nagging at him bc of his weight. Talk about your own health choices, but not obsessively. Talk about the way you&#39;ve felt and been treated, if you think he&#39;d be interested, but not as a &quot;why you don&#39;t want to be like me&quot; lecture. Do it in a moment when it seems like a good way to connect, to open up a little and share some of yourself with him. Those sorts of moments are more likely to come if you&#39;re not pressuring him about his choices. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Great point - I want him to trust me, to be able to support him and I can&#39;t do that if he sees me as an endless source of lectures. My mom was like that, always nagging, with that tone (Yuck, I can hear myself now, I sound just like her when I get in that mode). We do have some amazing conversations in those kinds of moments, and he has shared with me that he feels out of control with sweets sometimes, but I can&#39;t really trust it is his own thoughts, since he already has my nagging voice in his head. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;I try to encourage him to be active and to provide opportunities for that, but even the things he has chosen like gymnastics he often balks at when it is actually time to go.<br/>\n&gt; *********************<br/>\n&gt; <br/>\n&gt; When I was in school I hated the thought of doing things that were &quot;good for me&quot; - it seemed like the whole adult world was Telling me what was &quot;good for me&quot; and I resisted that thoroughly. I suspect your guy is still doing something similar. He&#39;s sick and tired of being told by someone else what&#39;s good for him. What he needs, most likely, is to feel good about himself, and being told he&#39;s doing something wrong isn&#39;t going to get him there. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Great point - I want him to be active because it feels great and its fun, not because its a should. That has never worked for me either, even though I know I &quot;should&quot; be doing more physical activity. I recently found an exercise class I love and can&#39;t wait to go to, the difference is amazing. I feel excited to go and so happy afterward. Actually I have noticed that, the word &quot;healthy&quot; seems like a dirty word around here these days. if something is healthy, to Terran it must be boring and taste terrible. Not exactly what I am trying to accomplish.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;Keep in mind that Terran is what you might call intense, everything is a big deal, big emotions, big focus when he is interested in something, big will when he doesn&#39;t want to do something.<br/>\n&gt; ********************<br/>\n&gt; <br/>\n&gt; This is really important. Kids with big emotions often struggle to feel good about themselves because their feelings can be so overwhelming. Shift your emphasis to supporting Terran - to celebrating him daily for Who He Is. He is a marvel! Does he know that about himself? Do you tell him, regularly, that he&#39;s wonderful? He may not believe you at first. Keep finding ways to tell him and show him he&#39;s a fantastic person. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Wow, Meredith, you always seem to nail it. That is what I want to do of course, but I keep getting caught up in the shoulds in my head. I should make sure he is active, I shouldn&#39;t let him get fat. I feel like a bad mom when I think like that. Like I am failing him. But I am really failing him if I try to take care of his body at the expense of his spirit. He IS a marvel. I don&#39;t think he gets to hear that enough, and especially with a cute little sister who of course can do no wrong (Did Ray go through that too?). I have been trying to make more time with just him, to have special mommy and terran time at least once a week. But I know I am hard on him, and everyone else even more, because of the intensity, the blow ups, etc. I am sure he feels that. Thank you for the reminder. My friend Helen said the same thing, but I guess I just need to keep hearing it until it is louder in my head than the other messages. <br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt; You probably already know that eating issues are deeply tied to emotional issues. So if you&#39;re concerned about your son having/developing issues around food, focusing on his emotional needs is vital!  <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259174302","msgId":42188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlanRpdStkbGc1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJFRkE2QTdBMzZFOTRDNTY5OUU3RkRDQzQyREY4NjNGQEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42187,"nextInTopic":42189,"prevInTime":42187,"nextInTime":42189,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... I just want to point out that I didn t say he was depressed, and although he is definitely not as active as I would like, he is hardly apathetic. He is","messageBody":"<div id=\"ygrps-yiv-146822407\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;~*~Tracy Austin&quot; &lt;webinfusion@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And his apathy. Why is the child depressed? Is that purely because the parents are not fully allowing him total control over every choice? What if, at 9 years old, this individual feels overwhelmed and doesn&#39;t want total control over his every choice? I sincerely want to know.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I just want to point out that I didn&#39;t say he was depressed, and although he is definitely not as active as I would like, he is hardly apathetic. He is passionate about the things he loves like lego, gaming, anime and the fantasy novels and characters he follows. I think he really does want to make his own choices, he certainly kicks up enough of a fuss when I try to take them away from him. My question is more about how to help him make them consciously than whether or not I should take them away. I really don&#39;t think going back to limiting is even an option, and it isn&#39;t what I want. I would really only have another year or two of that kind of power if I ever did anyway, so it makes sense to just figure out what I am not getting than to try to go back to controlling. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When I was a kid I remember having lots of unwanted freedom because I was basically ignored outside of my whereabouts (usually) being known. I was desperate for attention, and got lots of the negative kind. But what I really wanted was someone to see ME and not just my actions. To really look at me, in the eye and see me; to feel known and valuable...I didn&#39;t get that (dad: alcohol, mom: prescription drugs and self-absorption on both their parts - but of course they &quot;loved&quot; me) and so looked for it in food. &lt;&lt;<br/>\n<br/>\n </span></blockquote>I am sorry it was like this for you, but I don&#39;t think that is what is going on for Terran. I spend most of my waking hours with him and I have chosen unschooling because I want to honour him for Who He Is. My main focus in life is my kids. Granted my daughter is 17 months and takes a lot of my attention, which is hard for Terran. But I spend a lot of time with him focusing on what he loves, watching his shows (ask me a question about Dragon Ball Z, lol), talking to him about his games. I build lego ships. I take him swimming and make him halloween costumes and do science experiments and make messes with him. My partner (his stepdad) is a gamer too, they built Terran a gaming computer together and play games together often, although he is not very patient with the intensity so it doesn&#39;t always go well. He is definitely loved and honoured in many ways and what I am trying to do is get through those last blocks that are keeping us from the truly joyful life I know we are already heading toward. <br/>\n<br/>\nI was just remembering my childhood which sounds pretty similar to yours. There were lots of limits though, especially when my parents got worried about something I was doing. The thing was, they almost always backfired and made me want the thing more, even if it was actually really bad for me. What would have helped was not limits but a warm, close caring relationship where I felt like my parents were on my side and not trying to keep me from having fun or make my own choices. If I could have gone to them when things were confusing or hard or just plain messed up and said hey, what do you think? How might you handle this? Can you help me? Instead I hid things from them and snuck and lied and when that didn&#39;t work I openly defied them and fought for my right to make my own choices. That is not what I want with my kids, I want to get to a place where they see me as a resource, not a barrier to getting what they want. <br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259173390","msgId":42187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Mjc0Ny43NDA0My5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGZmN2YzYTczMDkxMTI1MDUzMWc2NGU1ZWMwM3g3YmQ4NDhhOWUxYzZjZjE5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPiAgPGhlaWc3Yysyc202QGVHcm91cHMuY29tPiA8ZmY3ZjNhNzMwOTExMjUwNTMxZzY0ZTVlYzAzeDdiZDg0OGE5ZTFjNmNmMTlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42186,"nextInTopic":42188,"prevInTime":42186,"nextInTime":42188,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"Then she s dismissed a huge amount of work in and out of her field. And she is being biased by studies that will find effects simply because of the size of the","messageBody":"<div id=\"ygrps-yiv-1379460804\">Then she&#39;s dismissed a huge amount of work in and out of her field. And she is being biased by studies that will find effects simply because of the size of the study. You can find so much going on in a large study that would fall out of significance in a smaller study. Leann Birch&#39;s work is stunning stuff. David (dh) says she&#39;s done a meta-analysis of food and children. It might be worth going and looking at her research instead of just relying on Alan Alda&#39;s old video. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hhdev.psu.edu/hdfs/faculty/birch.html\">http://www.hhdev.psu.edu/hdfs/faculty/birch.html</a> is her website. <br/>\n<br/>\nAbout the study, I&#39;m not sure how it is relevant. It isn&#39;t a well done study and the actions of food exclusion done based on the study aren&#39;t well-founded. The idea that giving people better nutrition isn&#39;t at all at odds with unschooling. Of course food makes you feel differently. I don&#39;t feel great if I&#39;m living on fats and sugars. So I eat a range of foods. I provide a range of choices for Simon and Linnaea. The only things that aren&#39;t in their choice set are things I can&#39;t get a hold of or that are too expensive, and, probably, things I don&#39;t know how to cook. That doesn&#39;t mean I&#39;m not willing to try. Simon really wants to have some of the food we saw on Gordan Ramsey&#39;s &quot;The F Word&quot; last night. I&#39;ll have to learn. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Beth Williams &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beth.s.williams@...\">beth.s.williams@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, 25 November, 2009 13:31:27<br/>\nSubject: Re: [unschoolingbasics] Re: weight gain<br/>\n<br/>\nthanks, interesting!  I&#39;d seen that posted before and could never actually<br/>\nget to it.  I clicked on the next one, wanting more and got this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=V8OI9HIjkl0&NR=1\">http://www.youtube.com/watch?v=V8OI9HIjkl0&NR=1</a>  from the same program!<br/>\n<br/>\nAlso, this doesn&#39;t account for the idea of whether or not sugar and carbs<br/>\nare addictive to some people or not (just as peanuts, wheat, etc. are a<br/>\nproblem for some and not others).  But I think someone may have sent me a<br/>\nstudy about that I&#39;ll check out.  The only other concern for me on the Alan<br/>\nAlda program is that I took a psychology class last year and the teacher<br/>\nsaid she never gives much weight to any study using less than 100<br/>\nparticipants.  She has a point.  What if there IS a link to sugar addiction<br/>\nw/ some and they used 5 kids or 13 that didn&#39;t fit that group?  It&#39;s<br/>\ndifficult to get accurate results on such a small group.<br/>\n<br/>\nThis is the study I had heard about (and mentioned previously --where food<br/>\nchanged behavior and feelings of well being) that also seems interesting.<br/>\nIt&#39;s kinda long, but the major points and most interesting stuff comes<br/>\nbefore pg. 9 if anyone is interested<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.michaelfieldsaginst.org/programs/food/case_study.pdf\">http://www.michaelfieldsaginst.org/programs/food/case_study.pdf</a><br/>\n<br/>\nthanks!<br/>\nbeth<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Nov 25, 2009 at 12:44 AM, Alan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alanlmarshall@...\">alanlmarshall@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ***I&#39;d love to<br/>\n&gt; &gt; have studies on both sides to compare myself, if there are any.***<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=CNA3zltptmk&feature=player_embedded\">http://www.youtube.com/watch?v=CNA3zltptmk&feature=player_embedded</a><br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[{"url":"http://www.youtube.com/embed/V8OI9HIjkl0?wmode=opaque","type":"VIDEO"}]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259172157","msgId":42186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0RjBGMEE3LTQ5MzItNEY1RC1BMjA2LTNFN0YzMzlEOTFBMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGZmN2YzYTczMDkxMTI1MDUzMWc2NGU1ZWMwM3g3YmQ4NDhhOWUxYzZjZjE5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPiA8aGVpZzdjKzJzbTZAZUdyb3Vwcy5jb20+IDxmZjdmM2E3MzA5MTEyNTA1MzFnNjRlNWVjMDN4N2JkODQ4YTllMWM2Y2YxOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":42185,"nextInTopic":42187,"prevInTime":42185,"nextInTime":42187,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... I didn t read it, but did glance through it. Since these are kids who aren t from nurturing homes, I m thinking their conclusion that the kids behavior","messageBody":"<div id=\"ygrps-yiv-289291015\">On Nov 25, 2009, at 8:31 AM, Beth Williams wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is the study I had heard about (and mentioned previously -- <br/>\n&gt; where food<br/>\n&gt; changed behavior and feelings of well being) that also seems  <br/>\n&gt; interesting.<br/>\n<br/>\n </span></blockquote>I didn&#39;t read it, but did glance through it. Since these are kids who  <br/>\naren&#39;t from nurturing homes, I&#39;m thinking their conclusion that the  <br/>\nkids&#39; behavior was brought on by what they ate might be off.<br/>\n<br/>\nI suspect their behavior is caused by what they *didn&#39;t* eat. I  <br/>\nsuspect they&#39;re all nutritionally depleted to begin with and being  <br/>\nfed more food that&#39;s nutritionally lacking.<br/>\n<br/>\nSo I bet they wouldn&#39;t get the same results from kids who were  <br/>\nalready getting enough vitamins, minerals and so forth.<br/>\n<br/>\nIn fact there was a study done in England that someone brought to  <br/>\nthis list a bit ago:<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.drbriffa.com/blog/2002/07/14/food-and-behaviourthought\">http://www.drbriffa.com/blog/2002/07/14/food-and-behaviourthought</a><br/>\n<br/>\n<br/>\nthat concluded daily candy was the cause of criminal behavior when  <br/>\nit&#39;s far more likely that criminal behavior is caused by a child  <br/>\ngrowing up in a family where no one cares to feed them and their  <br/>\neasiest access to food is candy.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153200361,"authorName":"~*~Tracy Austin","from":"&quot;~*~Tracy Austin&quot; &lt;webinfusion@...&gt;","profile":"tracyaustin30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259167588","msgId":42185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFRkE2QTdBMzZFOTRDNTY5OUU3RkRDQzQyREY4NjNGQEF1c3RpbkJ1c2luZXNzPg==","inReplyToHeader":"PGhlaHU4ZStxa2hvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlaHU4ZStxa2hvQGVHcm91cHMuY29tPg=="},"prevInTopic":42180,"nextInTopic":42186,"prevInTime":42184,"nextInTime":42186,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"I want to jump in here and say that I too am interested in how giving every child unlimited choices about food is a good thing? Isn t a big apart of","messageBody":"<div id=\"ygrps-yiv-1239336809\">I want to jump in here and say that I too am interested in how giving every child unlimited choices about food is a good thing? Isn&#39;t a big apart of unschooling that each person is an individual and has different needs? So is there any room in unschooling philosophy that some kids will need help controlling some of their choices? Is the only answer to rapid weight gain that a parent is only giving pseudo-choices? There are such things as addiction, and processed foods are full of addictive substances like MSG, sugar, white flour, ect...<br/>\n<br/>\nAnd his apathy. Why is the child depressed? Is that purely because the parents are not fully allowing him total control over every choice? What if, at 9 years old, this individual feels overwhelmed and doesn&#39;t want total control over his every choice? I sincerely want to know.<br/>\n<br/>\nWhen I was a kid I remember having lots of unwanted freedom because I was basically ignored outside of my whereabouts (usually) being known. I was desperate for attention, and got lots of the negative kind. But what I really wanted was someone to see ME and not just my actions. To really look at me, in the eye and see me; to feel known and valuable...I didn&#39;t get that (dad: alcohol, mom: prescription drugs and self-absorption on both their parts - but of course they &quot;loved&quot; me) and so looked for it in food. <br/>\n<br/>\nExcuse me while I go hug my kids.<br/>\n<br/>\nTracy<br/>\n<br/>\n    <br/>\n<blockquote><span title=\"qreply\">   --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;otherstar@...&gt; wrote:<br/>\n  &gt;My intense<br/>\n  &gt; child gets the most intense when she is not given choices or those choices<br/>\n  &gt; are actually pseudochoices. In other words, don&#39;t tell them they have a<br/>\n  &gt; choice if you are going to sit around and bug them about what they are doing<br/>\n  &gt; and try to constantly give them feedback.<br/>\n<br/>\n  This is so marvelous I just wanted to pull it out and repeat it! <br/>\n  Meredith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":309081207,"authorName":"Beth Williams","from":"Beth Williams &lt;beth.s.williams@...&gt;","profile":"mongoosewilliams","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259155887","msgId":42180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmN2YzYTczMDkxMTI1MDUzMWc2NGU1ZWMwM3g3YmQ4NDhhOWUxYzZjZjE5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhlaWc3Yysyc202QGVHcm91cHMuY29tPg==","referencesHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPiAJPGhlaWc3Yysyc202QGVHcm91cHMuY29tPg=="},"prevInTopic":42179,"nextInTopic":42185,"prevInTime":42179,"nextInTime":42181,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"thanks, interesting!  I d seen that posted before and could never actually get to it.  I clicked on the next one, wanting more and got this: ","messageBody":"<div id=\"ygrps-yiv-142771208\">thanks, interesting!  I&#39;d seen that posted before and could never actually<br/>\nget to it.  I clicked on the next one, wanting more and got this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=V8OI9HIjkl0&NR=1\">http://www.youtube.com/watch?v=V8OI9HIjkl0&NR=1</a>  from the same program!<br/>\n<br/>\nAlso, this doesn&#39;t account for the idea of whether or not sugar and carbs<br/>\nare addictive to some people or not (just as peanuts, wheat, etc. are a<br/>\nproblem for some and not others).  But I think someone may have sent me a<br/>\nstudy about that I&#39;ll check out.  The only other concern for me on the Alan<br/>\nAlda program is that I took a psychology class last year and the teacher<br/>\nsaid she never gives much weight to any study using less than 100<br/>\nparticipants.  She has a point.  What if there IS a link to sugar addiction<br/>\nw/ some and they used 5 kids or 13 that didn&#39;t fit that group?  It&#39;s<br/>\ndifficult to get accurate results on such a small group.<br/>\n<br/>\nThis is the study I had heard about (and mentioned previously --where food<br/>\nchanged behavior and feelings of well being) that also seems interesting.<br/>\n It&#39;s kinda long, but the major points and most interesting stuff comes<br/>\nbefore pg. 9 if anyone is interested<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.michaelfieldsaginst.org/programs/food/case_study.pdf\">http://www.michaelfieldsaginst.org/programs/food/case_study.pdf</a><br/>\n<br/>\nthanks!<br/>\nbeth<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Nov 25, 2009 at 12:44 AM, Alan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alanlmarshall@...\">alanlmarshall@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ***I&#39;d love to<br/>\n&gt; &gt; have studies on both sides to compare myself, if there are any.***<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=CNA3zltptmk&feature=player_embedded\">http://www.youtube.com/watch?v=CNA3zltptmk&feature=player_embedded</a><br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[{"url":"http://www.youtube.com/embed/V8OI9HIjkl0?wmode=opaque","type":"VIDEO"}]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"studies on addiction was Re: [unschoolingbasics] Re: weight gain","postDate":"1259141823","msgId":42179,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczNDIwLjQ3NjIwLnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhlZzRuOCtxYWVuQGVHcm91cHMuY29tPiA8aGVodmEzK3RibjFAZUdyb3Vwcy5jb20+IDxmZjdmM2E3MzA5MTEyNDE3MTdvNWQ1MjQxZjhqMjIyNTY0NDliZjE5MGEyMEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":42177,"nextInTopic":42180,"prevInTime":42178,"nextInTime":42180,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"My favorite addiction examination that I trot out as often as I can is Rat Park (http://en.wikipedia.org/wiki/Rat_Park and","messageBody":"<div id=\"ygrps-yiv-356622660\">My favorite addiction examination that I trot out as often as I can is Rat Park (<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Rat_Park\">http://en.wikipedia.org/wiki/Rat_Park</a> and <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/)\">http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/)</a>. Given what Bruce Alexander found with rats and opiates, it would seem to me that if carbs are addictive they should work much the same way. <br/>\n<br/>\nTo sum up, what Dr. Alexander found was that rats in a lovely habitat with engaging things to do would choose not to use narcotic laced water, they&#39;d try it, maybe share it with their den mates, and then go back to the straight water. When they were forced into a physical addiction by the researchers replacing all the water in the lovely and spacious habitat with only laced water, as soon as they were given a choice they would go back to the straight water, suffering the physical withdrawal as they did so. So even a known physically addictive substance could be overcome by a rats in a good environment.<br/>\n<br/>\nSo, why would you or your daughter carry on with a physical addiction given your situation? If it truly is an addictive substance, and I really have a hard time thinking of food as addictive, what makes your environment one in which you will seek out an addictive substance to soothe or engage you? It is possible to change the value of a food item, say, for example, that you argue that the food is special and dangerous and addictive and that you must be careful with it. That&#39;s a nice way to make it exciting and interesting and there you go riding the wild carbohydrate wave again. <br/>\n<br/>\nAddiction has been argued to be a genetic trait. Very few genetic traits are written in stone. That is very few have no environmental influence. So, if you are the child of two alchoholics you are not condemned to be an alcoholic, even with the genetic wiring being in place. You would need to live in an environment where alcoholism was encouraged. Maybe a highly stressed environment or a boring environment or one where drinking was common and part of the done thing. Once you moved down the alchoholic path you too would be an alcoholic, but that wouldn&#39;t mean that you couldn&#39;t change. If, as with the Rat Park residents, you were put back in an environment where alchoholism didn&#39;t make sense, then getting off that path wouldn&#39;t be as difficult as you anticipated. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Beth Williams &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beth.s.williams@...\">beth.s.williams@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, 25 November, 2009 1:17:37<br/>\nSubject: Re: [unschoolingbasics] Re: weight gain<br/>\n<br/>\nI&#39;m interested in knowing if anyone knows of research on this stuff.  I have<br/>\nissues w/ all of this for myself (and worry about it too w/ my children) and<br/>\nhave TRIED no limitations and it never gets to the self regulating stage (it<br/>\njust gets exponentially worse).  I have been taking a class w/ a<br/>\npsychologist that deals w/ eating disorders and she works w/ a center that<br/>\ndoes research on the brain and how food affects it, etc.  They feel that<br/>\nthere are certain people (and I believe one of my daughters and I are two)<br/>\nthat are carb. addicts.  That it&#39;s a physical addiction and no amount of<br/>\nletting it go on and on will ever get us to regulate.  They site studies<br/>\nwhere nothing but food changes can completely change people&#39;s violent<br/>\nbehavior, etc.  I think different people have different sensitivities in<br/>\ndifferent ways and I&#39;m not sure how I feel about discounting this idea.<br/>\nAnyway, I&#39;m curious because I always see this topic in books and it appears<br/>\nto be a theory w/ no apparent evidence, as far as I can tell.  I&#39;d love to<br/>\nhave studies on both sides to compare myself, if there are any.<br/>\nThanks.<br/>\nBeth<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":158915970,"authorName":"Alan","from":"&quot;Alan&quot; &lt;alanlmarshall@...&gt;","profile":"alanlmarshall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259127852","msgId":42177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlaWc3Yysyc202QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42176,"nextInTopic":42179,"prevInTime":42176,"nextInTime":42178,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... http://www.youtube.com/watch?v=CNA3zltptmk&feature=player_embedded","messageBody":"<div id=\"ygrps-yiv-353686709\">***I&#39;d love to<br/>\n<blockquote><span title=\"ireply\"> &gt; have studies on both sides to compare myself, if there are any.***<br/>\n<br/>\n<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=CNA3zltptmk&feature=player_embedded\">http://www.youtube.com/watch?v=CNA3zltptmk&feature=player_embedded</a></div>","specialLinks":[{"url":"http://www.youtube.com/embed/CNA3zltptmk?wmode=opaque","type":"VIDEO"}]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: weight gain","postDate":"1259112521","msgId":42174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVESkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhlaHZhMyt0Ym4xQGVHcm91cHMuY29tPg=="},"prevInTopic":42172,"nextInTopic":42176,"prevInTime":42173,"nextInTime":42175,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... good about themselves because their feelings can be so overwhelming. Shift your emphasis to supporting Terran - to celebrating him daily for Who He Is. He","messageBody":"<div id=\"ygrps-yiv-1677110723\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;This is really important. Kids with big emotions often struggle to feel<br/>\n </span></blockquote>good about themselves because their feelings can be so overwhelming. Shift<br/>\nyour emphasis to supporting Terran - to celebrating him daily for Who He Is.<br/>\nHe is a marvel! Does he know that about himself? Do you tell him, regularly,<br/>\nthat he&#39;s wonderful? He may not believe you at first. Keep finding ways to<br/>\ntell him and show him he&#39;s a fantastic person.  &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI just wanted to expand on this a bit because that has really helped my<br/>\nintense child. For the longest time, it seemed like we were constantly<br/>\nasking her to stop things that annoyed the rest of us (throwing a fit, being<br/>\nloud, or whatever). She has told us that her hobby is to annoy people. She<br/>\ndoes a mighty fine job of it. My husband and I realized that we were<br/>\nnitpicking her because she is different. We were not honoring her for who<br/>\nshe is but were trying to change her to meet our own expectations. It seemed<br/>\nlike the only thing that ever came out of our mouths when interacting with<br/>\nher was &quot;damn it Julia, please stop whatever it is you are doing that is<br/>\ndriving us nuts.&quot; Instead of trying to change her, we realized that we<br/>\nneeded to change ourselves and how we react to her. Now, when we find<br/>\nourselves saying &quot;Damn it Julia&quot; we finish the sentence with something<br/>\npositive rather than something negative. Usually, it is something like &quot;I<br/>\nlove you&quot;. It is funny because when we first started it, we could tell by<br/>\nthe look on her face that she expected us to say something negative. It<br/>\nworks nicely because she usually stops the annoying thing to hear what we<br/>\nhave to say. It is great because I can have an authentic reaction and still<br/>\nsay &quot;damn it Julia&quot; but I am not following through with something negative<br/>\nthat will alienate her. I read/heard somewhere that it takes something like<br/>\n20 positive statements/acts to undo 1 negative. The best part of all this is<br/>\nthat now she will out of the blue yell, &quot;hey mom&quot; and when I say &quot;what&quot;, she<br/>\nsays &quot;I love you&quot; or &quot;you are a great mom&quot;.  Changing that one little thing<br/>\nmade a ton of difference for us.<br/>\n<br/>\nConnie<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":309081207,"authorName":"Beth Williams","from":"Beth Williams &lt;beth.s.williams@...&gt;","profile":"mongoosewilliams","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259111857","msgId":42176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmN2YzYTczMDkxMTI0MTcxN281ZDUyNDFmOGoyMjI1NjQ0OWJmMTkwYTIwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhlaHZhMyt0Ym4xQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlZzRuOCtxYWVuQGVHcm91cHMuY29tPiA8aGVodmEzK3RibjFAZUdyb3Vwcy5jb20+"},"prevInTopic":42174,"nextInTopic":42177,"prevInTime":42175,"nextInTime":42177,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"I m interested in knowing if anyone knows of research on this stuff.  I have issues w/ all of this for myself (and worry about it too w/ my children) and have","messageBody":"<div id=\"ygrps-yiv-598623661\">I&#39;m interested in knowing if anyone knows of research on this stuff.  I have<br/>\nissues w/ all of this for myself (and worry about it too w/ my children) and<br/>\nhave TRIED no limitations and it never gets to the self regulating stage (it<br/>\njust gets exponentially worse).  I have been taking a class w/ a<br/>\npsychologist that deals w/ eating disorders and she works w/ a center that<br/>\ndoes research on the brain and how food affects it, etc.  They feel that<br/>\nthere are certain people (and I believe one of my daughters and I are two)<br/>\nthat are carb. addicts.  That it&#39;s a physical addiction and no amount of<br/>\nletting it go on and on will ever get us to regulate.  They site studies<br/>\nwhere nothing but food changes can completely change people&#39;s violent<br/>\nbehavior, etc.  I think different people have different sensitivities in<br/>\ndifferent ways and I&#39;m not sure how I feel about discounting this idea.<br/>\n Anyway, I&#39;m curious because I always see this topic in books and it appears<br/>\nto be a theory w/ no apparent evidence, as far as I can tell.  I&#39;d love to<br/>\nhave studies on both sides to compare myself, if there are any.<br/>\nThanks.<br/>\nBeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259110531","msgId":42172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlaHZhMyt0Ym4xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlZzRuOCtxYWVuQGVHcm91cHMuY29tPg=="},"prevInTopic":42171,"nextInTopic":42174,"prevInTime":42171,"nextInTime":42173,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"Ten months isn t a very long time to deschool. Lots of kids take longer than that. And really, every time you put some pressure on him about his choices, you","messageBody":"<div id=\"ygrps-yiv-1352684804\">Ten months isn&#39;t a very long time to deschool. Lots of kids take longer than that. And really, every time you put some pressure on him about his choices, you undermine his deschooling process a little, set him back a bit. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Now he wants kraft dinner and processed foods, or fast food <br/>\n<br/>\n </span></blockquote>Ray was like that for more than a year - almost two, before he wanted more variety again, and more vegetables. It really wasn&#39;t until he started cooking, now that I think about it. Until then, he wanted all the foods he&#39;d been denied for thirteen years. That&#39;s a Lot of Mac n&#39; Cheese and Ramen noodles!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;will often eat ice cream, candy or other sweets first thing in the morning and continue throughout the day, even when I am really conscientious about providing him with other foods when he seems hungry. <br/>\n </span></blockquote>***************<br/>\n<br/>\nJust when he seems hungry? Have a variety of food available all the time. Make sure nutritious food is just as convenient and attractive to the eye as less nutrient dense foods and otherwise let him choose. If he tends to start the day with sweets, what about home made sweets? Start the day with cake! Add nuts or nut-meal to make the batter richer, or make a cream-cheese frosting. Those are the sorts of things that taste wonderful while also providing a bit of protein. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t want Terran to suffer either the health or social consequences of being overweight like I and his dad both did. <br/>\n </span></blockquote>****************<br/>\n<br/>\nThen its all the more important you not give the impression that you&#39;re picking or nagging at him bc of his weight. Talk about your own health choices, but not obsessively. Talk about the way you&#39;ve felt and been treated, if you think he&#39;d be interested, but not as a &quot;why you don&#39;t want to be like me&quot; lecture. Do it in a moment when it seems like a good way to connect, to open up a little and share some of yourself with him. Those sorts of moments are more likely to come if you&#39;re not pressuring him about his choices. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I try to encourage him to be active and to provide opportunities for that, but even the things he has chosen like gymnastics he often balks at when it is actually time to go.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nWhen I was in school I hated the thought of doing things that were &quot;good for me&quot; - it seemed like the whole adult world was Telling me what was &quot;good for me&quot; and I resisted that thoroughly. I suspect your guy is still doing something similar. He&#39;s sick and tired of being told by someone else what&#39;s good for him. What he needs, most likely, is to feel good about himself, and being told he&#39;s doing something wrong isn&#39;t going to get him there. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Keep in mind that Terran is what you might call intense, everything is a big deal, big emotions, big focus when he is interested in something, big will when he doesn&#39;t want to do something.<br/>\n </span></blockquote>********************<br/>\n<br/>\nThis is really important. Kids with big emotions often struggle to feel good about themselves because their feelings can be so overwhelming. Shift your emphasis to supporting Terran - to celebrating him daily for Who He Is. He is a marvel! Does he know that about himself? Do you tell him, regularly, that he&#39;s wonderful? He may not believe you at first. Keep finding ways to tell him and show him he&#39;s a fantastic person. <br/>\n<br/>\nYou probably already know that eating issues are deeply tied to emotional issues. So if you&#39;re concerned about your son having/developing issues around food, focusing on his emotional needs is vital!  <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: weight gain","postDate":"1259109673","msgId":42171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0Q0RDMkU5QjQ3RjQ5RkZBQjZFRkUyQzc2MTY1NUNBQExZTEFMQVAyPg==","inReplyToHeader":"PGhlaHU4ZStxa2hvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlaHU4ZStxa2hvQGVHcm91cHMuY29tPg=="},"prevInTopic":42170,"nextInTopic":42172,"prevInTime":42170,"nextInTime":42172,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... From: plaidpanties666 To: unschoolingbasics@yahoogroups.com Sent: Tuesday, November 24, 2009 4:37 PM Subject: [unschoolingbasics] Re: weight gain ... This","messageBody":"<div id=\"ygrps-yiv-1000565714\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\n  From: plaidpanties666 <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, November 24, 2009 4:37 PM<br/>\n  Subject: [unschoolingbasics] Re: weight gain<br/>\n<br/>\n<br/>\n    <br/>\n  --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;otherstar@...&gt; wrote:<br/>\n  &gt;My intense<br/>\n  &gt; child gets the most intense when she is not given choices or those choices<br/>\n  &gt; are actually pseudochoices. In other words, don&#39;t tell them they have a<br/>\n  &gt; choice if you are going to sit around and bug them about what they are doing<br/>\n  &gt; and try to constantly give them feedback.<br/>\n<br/>\n  This is so marvelous I just wanted to pull it out and repeat it! <br/>\n  Meredith<br/>\n<br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  yes this is exactly what i was going to say.  that and:<br/>\n<br/>\n  it sounds like he really needs more time deschooling, and each time you &quot;lecture&quot; him about foods, or in any way convey your worry over his lifestyle choices, it does set you and him back in that process. <br/>\n<br/>\n  it&#39;s also very possible the weight gain is related to hormones and not food so much - my son put on at least that much weight between the ages of 9 and 10 - and that is when he also got throught the major deschooling and began eating MORE healthfully and well balanced than he ever had before.  <br/>\n<br/>\n  lyla<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: weight gain","postDate":"1259109454","msgId":42170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlaHU4ZStxa2hvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVER0RDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+"},"prevInTopic":42166,"nextInTopic":42171,"prevInTime":42169,"nextInTime":42171,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... This is so marvelous I just wanted to pull it out and repeat it! Meredith","messageBody":"<div id=\"ygrps-yiv-2107674775\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;otherstar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My intense<br/>\n&gt; child gets the most intense when she is not given choices or those choices<br/>\n&gt; are actually pseudochoices. In other words, don&#39;t tell them they have a<br/>\n&gt; choice if you are going to sit around and bug them about what they are doing<br/>\n&gt; and try to constantly give them feedback.<br/>\n<br/>\n </span></blockquote>This is so marvelous I just wanted to pull it out and repeat it! <br/>\nMeredith</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] weight gain","postDate":"1259097349","msgId":42166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVER0RDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhlZzRuOCtxYWVuQGVHcm91cHMuY29tPg=="},"prevInTopic":42163,"nextInTopic":42170,"prevInTime":42165,"nextInTime":42167,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"... is a lot of weight for him. I think it definitely has to do with the sudden freedom, but there really wasn t any option of easing into things, or didn t ","messageBody":"<div id=\"ygrps-yiv-866248965\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; He has gone up almost 30lbs in the last 10 months, at age 9 this<br/>\n </span></blockquote>is a lot of weight for him. I think it definitely has to do with the sudden<br/>\nfreedom, but there really wasn&#39;t any option of easing into things, or didn&#39;t<br/>\nseem to be at the time, with him throwing tantrums about any kind of<br/>\ncontrols.  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nDon&#39;t kids usually go through growth spurts around this age? My thinking is<br/>\nthat perhaps he could be gaining weight because he is getting ready to shoot<br/>\nup. It may just be a little extra because of the lifted food restrictions.<br/>\nTen months is not really that long when you look at the fact that he has had<br/>\n9 years of restrictions.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; He also used to be a diverse, healthy eater,even better than I<br/>\n </span></blockquote>was. He would eat lots of veggies, homemade soups and sauces, salad, whole<br/>\ngrains, ethnic foods. Now he wants kraft dinner and processed foods, or fast<br/>\nfood and will pretty much demand that he get it. He used to sneak sweets and<br/>\ntreats before, which were limited at home, which is why I pretty much felt I<br/>\nhad to just jump into no restrictions, I didn&#39;t want him to keep sneaking,<br/>\nwhich always felt terrible for me.  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nHe was a healthy eater because he didn&#39;t have a choice. It is clear that he<br/>\nwanted the sweets because he was sneaking them.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt; I have always been a bit overweight and an emotional eater, sweet<br/>\n </span></blockquote>tooth person and I know I am neither a great model nor very rational when it<br/>\ncomes to food, although I actually eat pretty well now for the most part and<br/>\nenjoy a lot of healthy whole foods and try to eat organic, mostly vegetarian<br/>\nhomemade food as much as possible. His dad (my ex) is also heavier, and<br/>\nstill controls Terran&#39;s food when he is there, which is thankfully not that<br/>\noften. I don&#39;t want Terran to suffer either the health or social<br/>\nconsequences of being overweight like I and his dad both did.  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nThe fact that his dad still restricts food is a big factor in all of this.<br/>\nEven if he doesn&#39;t see him very often, it is still in his head that he has<br/>\nto binge on what he wants before the next time he goes to dad&#39;s house.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt; My approach to all of this has probably not been very good. I try to<br/>\n </span></blockquote>give him factual information about the nutritional value, etc of his food<br/>\nchoices, but it ends up sounding like a lecture (he says I lecture a lot, I<br/>\nthink because it feels like I have no influence at all now that there aren&#39;t<br/>\nrules and restrictions). I try to encourage him to be active and to provide<br/>\nopportunities for that, but even the things he has chosen like gymnastics he<br/>\noften balks at when it is actually time to go. I feel like I have basically<br/>\ncreated a couch potato. Now if I even suggest he not eat something, he<br/>\npractically snarls at me to protect his food. He&#39;s never been deprived of<br/>\nfood and we still had treats and sweets often enough, more often than a lot<br/>\nof people really, so I don&#39;t understand his intensity about food at all. He<br/>\nnever wants to share and gets upset if I even suggest he let his sister have<br/>\na bit of what he&#39;s eating. I thought unschooling would make his world bigger<br/>\nand more interesting, but instead it seems to get smaller and smaller all<br/>\nthe time, his food choices, his activity choices, everything. &lt;&lt;&lt;&lt;<br/>\n<br/>\nHe has given you the answer. Shut up mom. :-) Seriously, if he feels like<br/>\nyou are lecturing him, then you need to stop talking to him about increasing<br/>\nhis activities and making different food choices. I have had people talk to<br/>\nme about food choices and concern about my weight. After my first daughter<br/>\nwas born, I had somebody tell me that I had better hurry up and lose that<br/>\nbaby weight or it would never come off. My MIL makes it a point of talking<br/>\nto my husband and I about his weight. She does it under the guise of loving<br/>\nus and caring about us but all we hear is &quot;You are fat and lazy and too<br/>\nstupid to think for yourself.&quot; She NEVER says that but that is what we hear.<br/>\nPerhaps your son is hearing the same thing. Her constant reminders have the<br/>\nopposite effect on us. It doesn&#39;t feel good and it makes us just want to go<br/>\nbury ourselves in a bucket of ice cream. So, instead of talking to my kids<br/>\nabout their food choices, I talk to them about MY food choices. How would<br/>\nyou feel if your son told you, &quot;Mom, you really don&#39;t need to be eating<br/>\nTHAT.&quot; when you went to get a sweet or a snack? We talk about food choices<br/>\nbut we do it at the grocery store or when we are putting groceries away. It<br/>\nis NEVER when we are actually getting ready to eat the food. If you are<br/>\nworried about the sweets issue because YOU are an emotional eater, then tell<br/>\nyour son that. Don&#39;t put your baggage on him. I tell my girls that I don&#39;t<br/>\nwant to buy certain things because *I* don&#39;t need to be eating them and *I*<br/>\ncan&#39;t resist them if they are in the cabinet. I have empowered my kids to<br/>\nhelp me be a better eater. In turn, they come to me and talk to me about<br/>\nfood choices and things like that.<br/>\n<br/>\nAlso, our sweets and junk tend to be limited because we cannot afford to go<br/>\nto the store every day. When we go to the store, the kids put in an order<br/>\nfor whatever they want. If all they want is *junk*, then that is what I buy<br/>\nfor them. However, I buy a variety of stuff for the family. When the junk is<br/>\ngone, it is gone until we get to go to the store again. No amount of fit<br/>\nthrowing or getting mad at me will change that because we are not made of<br/>\nmoney. I am perfectly content to explain that to them too. Being out of<br/>\nsnack cakes is no different than being out of bread or milk or any other<br/>\nstaple. No one food is given a higher priority. We just have to do without<br/>\nuntil we can make it to the store again. Usually, the junk food runs out<br/>\nfirst and we spend the rest of the week eating the other stuff.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt; I feel sad and confused and actually pretty guilty about where things<br/>\n </span></blockquote>are at with him right now. Is there anyone who has been through this kind of<br/>\nthing with some insight? Keep in mind that Terran is what you might call<br/>\nintense, everything is a big deal, big emotions, big focus when he is<br/>\ninterested in something, big will when he doesn&#39;t want to do something.<br/>\nSo what can I do to support him to make choices without leaving him to go<br/>\ncrazy and possibly cause real harm to himself?  &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI have a very intense kid and letting them make their own decisions without<br/>\nparental judgement actually helps decrease some of the intensity. My intense<br/>\nchild gets the most intense when she is not given choices or those choices<br/>\nare actually pseudochoices. In other words, don&#39;t tell them they have a<br/>\nchoice if you are going to sit around and bug them about what they are doing<br/>\nand try to constantly give them feedback. Feedback is good but too much of<br/>\nit can feel like nitpicking.  Also, we have to be real with her. If there is<br/>\nsomething bugging us, then we talk to our kids about it. Kids have a lot of<br/>\nwisdom and can often times give us pearls of wisdom that we wouldn&#39;t think<br/>\nof ourselves.<br/>\n<br/>\nWhat kind of harm do you think he will do to himself?<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"weight gain","postDate":"1259050536","msgId":42163,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlZzRuOCtxYWVuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42166,"prevInTime":42162,"nextInTime":42164,"topicId":42163,"numMessagesInTopic":0,"msgSnippet":"Okay, I have been stewing on this awhile and wanting to see if things would resolve on their own, but they don t seem to be so here I am. I haven t really","messageBody":"<div id=\"ygrps-yiv-1753684640\">Okay, I have been stewing on this awhile and wanting to see if things would resolve on their own, but they don&#39;t seem to be so here I am. I haven&#39;t really posted I don&#39;t think, but I have 2 kids, Terran, 9, who was in school until last year around this time, and Asha, 1. Terran has been much happier since we started unschooling, but has had a pretty intense response to lifting food and media restrictions. He has gone up almost 30lbs in the last 10 months, at age 9 this is a lot of weight for him. I think it definitely has to do with the sudden freedom, but there really wasn&#39;t any option of easing into things, or didn&#39;t seem to be at the time, with him throwing tantrums about any kind of controls. Anyway, whether or not I jumped too quickly, he now chooses to do very little physical activity. He quit karate, soccer and swimming lessons, doesn&#39;t like to walk or ride his bike, doesn&#39;t want to go play outdoors, etc. He characterizes himself as &quot;lazy&quot; and calls himself fat. He didn&#39;t get this from me, and when he says it I simply acknowledge the weight gain, assure him that I don&#39;t think he is fat, just a bit chubby and ask how he feels about it, to which he says he doesn&#39;t care. He ate all his halloween candy, a huge bag, in 6 days, and will often eat ice cream, candy or other sweets first thing in the morning and continue throughout the day, even when I am really conscientious about providing him with other foods when he seems hungry.  His favored activities are all sedentary, reading, watching anime, playing video games and building lego. He used to be active and energetic and now he complains about walking up stairs or having to walk pretty much anywhere. <br/>\n<br/>\nHe also used to be a diverse, healthy eater,even better than I was. He would eat lots of veggies, homemade soups and sauces, salad, whole grains, ethnic foods. Now he wants kraft dinner and processed foods, or fast food and will pretty much demand that he get it.  He used to sneak sweets and treats before, which were limited at home, which is why I pretty much felt I had to just jump into no restrictions, I didn&#39;t want him to keep sneaking, which always felt terrible for me. <br/>\n<br/>\nI have always been a bit overweight and an emotional eater, sweet tooth person and I know I am neither a great model nor very rational when it comes to food, although I actually eat pretty well now for the most part and enjoy a lot of healthy whole foods and try to eat organic, mostly vegetarian homemade food as much as possible. His dad (my ex) is also heavier, and still controls Terran&#39;s food when he is there, which is thankfully not that often. I don&#39;t want Terran to suffer either the health or social consequences of being overweight like I and his dad both did. <br/>\n<br/>\nMy approach to all of this has probably not been very good. I try to give him factual information about the nutritional value, etc of his food choices, but it ends up sounding like a lecture (he says I lecture a lot, I think because it feels like I have no influence at all now that there aren&#39;t rules and restrictions). I try to encourage him to be active and to provide opportunities for that, but even the things he has chosen like gymnastics he often balks at when it is actually time to go. I feel like I have basically created a couch potato. Now if I even suggest he not eat something, he practically snarls at me to protect his food. He&#39;s never been deprived of food and we still had treats and sweets often enough, more often than a lot of people really, so I don&#39;t understand his intensity about food at all. He never wants to share and gets upset if I even suggest he let his sister have a bit of what he&#39;s eating. I thought unschooling would make his world bigger and more interesting, but instead it seems to get smaller and smaller all the time, his food choices, his activity choices, everything.  <br/>\n<br/>\nI feel sad and confused and actually pretty guilty about where things are at with him right now. Is there anyone who has been through this kind of thing with some insight? Keep in mind that Terran is what you might call intense, everything is a big deal, big emotions, big focus when he is interested in something, big will when he doesn&#39;t want to do something.<br/>\nSo what can I do to support him to make choices without leaving him to go crazy and possibly cause real harm to himself? <br/>\n<br/>\nThanks for reading, sorry its so long. <br/>\n<br/>\nTammy</div>","specialLinks":[]}],"prevTopicId":42248,"nextTopicId":42320}}