{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":41,"messages":[{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238861866","msgId":39306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMzA5OS45NzMzMy5xbUB3ZWI0NTMxNi5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDJERTQxRkJCLTg3NjktNDNDRS05RDRDLUM2MzE0NzY1M0JGMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGdyNTV1dit2OXR1QGVHcm91cHMuY29tPiA8MkRFNDFGQkItODc2OS00M0NFLTlENEMtQzYzMTQ3NjUzQkYxQHZlcml6b24ubmV0Pg=="},"prevInTopic":39303,"nextInTopic":39308,"prevInTime":39305,"nextInTime":39307,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"I have been following this link and I can empathize with feeling overwhelmed by the chores and keeping up the house. There are two things that I am working on","messageBody":"<div id=\"ygrps-yiv-1452998411\">I have been following this link and I can empathize with feeling overwhelmed by the chores and keeping up the house. There are two things that I am working on for myself, being an admitted control freak who is trying to reform for the benefit of the whole family. The first thing is learning to ask for help and realizing that everyone has their own of doing things. I am learning to be happy for the help. The second thing is letting go of this notion that the house must be spotless. We had white glove inspections growing up and everything had to be &quot;ship shape&quot;. My dad felt that his training as a marine was how his house should be run.  Even now when he comes to visit one of the first things he does is grab cleaning stuff. I have learned that this is just him and I have to let that go as well and not take it as an insult to my house keeping abilities. <br/>\n<br/>\nOn the cleaning part my husband is helping me with that while I gently remind him that we don&#39;t need to raise our voice to the kids. His outlook on the house is that we live here it isn&#39;t a museum and while it would be nice to be on the cover of House and Garden it isn&#39;t necessary to anyone&#39;s happiness. As long as their are dishes to use, silverware available and glasses to drink from it is all cool. <br/>\n<br/>\nAs for asking for help, I simply state that I feel overwhelmed and that I would love to have someone help me. I have noticed that if I can control my emotions on this and not wait until I am overwhelmed and ready to go ballistic I get a much better response and we actually all work together as a team. This a large change for me as in the past I would make snide comments to the air, slam, bang and generally act like a crazy woman. Then one day after an outburst like that I noticed that my children were doing things but looking at me in fear. So not the way I wanted my children to feel. I know that feeling, I grew up with it. I am not going to place blame on my parents for my behavior it was my choice to continue in the same way. So I have chosen not to be that way to stop, think and walk away if need be so that I can get my emotions under control. I don&#39;t just simply walk away I will look at the kids, my husband, or my brother in law and simply state that<br/>\n I need a few moments to cool off. It is rubbing off on everyone else. If anyone feels like they are going to explode and need some time it is simply stated and they are given the room they need to calm down and be able to think clearly. <br/>\n<br/>\nWe have done family meetings, chore charts, punishments, etc. They honestly do not work. Well family meetings for us are more or less to talk out problems and find solutions and no topic is off limits. We would rather work at finding a solution together than for each of one of us to stew and feel alone and like they are fighting an uphill battle. Most of the time once there is a solution then we wall work together to put it in place. The adults have a lot of baggage from growing up and things we have had to go through in our lives. It is far from fair, respectful, and loving to burden our children with this baggage. So we are working together to drop it all off some where and move on with our lives. <br/>\n<br/>\nAs for cleaning the house I remember it being stated in one of the many posts on this but we have rubbermaid tubs available in the rooms for quick clean up that can be stashed away if we are having guests. We do allow food and drink by the computers however we request and make available drinking vessels that have lids. The 4 yr old still loves his sippy cups and the 10 yr old loves her sports bottles. Because we have gone to letting the kids choose what they eat we have a lot of finger foods. This is what they like, something that they can grab on the go and eat. At this point most of it is veggie, cheese, fruit, lunch meat, etc. Though they love their messy foods like chips and crackers. So we ask that they remember a bowl or a plate for messy things. I have a small dustpan and hand held broom on the floor by the kids&#39; desk. After watching mommy come in and sweep up the mess they simply get down and do it themselves. As for washing the dishes as long as<br/>\n they have been scraped and rinsed they can be placed in a rubbermaid tub full of soapy water that is under the sink until some one can get to them. An idea I happily stole from FlyLady. Laundry everyone has their own basket. If they don&#39;t remember to bring it into the washer and dryer it is easy for me to grab, wash, dry fold and put the basket back in their room. The kids&#39; rooms on their private space if they want to leave their things out that is their right to do so. Granted you cannot find the floor at any given time in either room, but then again my husband and I cannot say much, if you were to look in our bedroom there is little space on the floor any given day. <br/>\n<br/>\nBut we have a lived in look for our house. There are various projects going on at all times. And most of the time in the evenings you can find us in the middle of it all cuddled up watching a movie, listening to books on tape or wrestling in the middle of it all. I know people think that I am so organized and put together from the sound of things. It isn&#39;t always true while I would love for it to be that way. Hence the title I have taken on as &quot;Director of Chaos&quot;. The best of intentions and all that but really learning to take one day at a time and enjoy it is probably the best bit of organization I have ever had. When my daughter can look at me and say that she would rather be home than in PS and that she feels closer to me and her daddy than she has in a long time. Then I guess we are doing something very right. When she can acknowledge that her parents are learning to be kinder, gentler, and more caring and that it makes her feel safer, more loved and<br/>\n secure then I feel like we are moving in the right direction. But it does help tremendously when both parents are working together to make home a haven. We still have a long way to go and our kids are helping us find our way.<br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238851537","msgId":39310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyN240aCtpNXR1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyNXRxMysyOXJlQGVHcm91cHMuY29tPg=="},"prevInTopic":39309,"nextInTopic":39312,"prevInTime":39309,"nextInTime":39311,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... *** Ah Angela, if you knew me you would realise how hysterically funny (and incorrect) your guess is! I don t mean any offence and the other stuff in your","messageBody":"<div id=\"ygrps-yiv-1491480692\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Angela Wolff&quot; &lt;argwolff@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi Karen,<br/>\n&gt;<br/>\n&gt; I&#39;m wondering if by working so hard to model generosity and serving them, you&#39;ve given them the impressions that you WANT to do it all yourself. Or at the very least that you think it *should* be your sole domain, even if you don&#39;t really like it.<br/>\n&gt; <br/>\n&gt; -Angela<br/>\n<br/>\n </span></blockquote>*** Ah Angela, if you knew me you would realise how hysterically funny (and incorrect) your guess is! I don&#39;t mean any offence and the other stuff in your post was really helpful (taking our personality & lifestyle - all of us - into account in working out solutions etc), but I have to say there is no way on earth that my kids would think I &quot;WANT to do it all&quot; or that it &quot;should be my sole domain&quot;. The reality is that yeah, I want to serve and bless them, but I don&#39;t do a good job of actually DOING that! My life actually looks a lot more like each of us doing what we want to do, but me being the main one (other than DH, who&#39;s very helpful) who notices the resulting mess and feels like it &quot;should&quot; get cleaned up. And I&#39;ve usually spent too much time on the computer or doing other things, so that in the end it&#39;s quite a rush to get the household stuff done.  I really don&#39;t want to do it!!!  My house is usually VERY messy!  And when I *do* clean up, it&#39;s usually not with a good attitude (sadly), or it&#39;s done with stress and begging the kids to help because we&#39;ve got to get out the door and I&#39;ve left the tidying/cleaning up (VERY basic stuff like getting dishes into the dishwasher etc) until the last minute.<br/>\n<br/>\nJust figured I&#39;d be honest and clarify that LOL.  I ain&#39;t no Martha Stewart, that&#39;s for sure!<br/>\n<br/>\nKaryn</div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238851001","msgId":39308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyN21qcCt0YzY0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3OTkxLjY4MDY1LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39306,"nextInTopic":39309,"prevInTime":39307,"nextInTime":39309,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"WOW!  Thank you!  This whole post (below) is brilliant, but I particularly like the helpful reframing of the same situation seen more positively, of seeing","messageBody":"<div id=\"ygrps-yiv-955351502\">WOW!  Thank you!  This whole post (below) is brilliant, but I particularly like the helpful &quot;reframing&quot; of the same situation seen more positively, of seeing the mess as a &quot;story&quot;, as &quot;still lifes&quot;, as &quot;a part of a life well lived&quot;.  I&#39;ve always been able to see that when it comes to the kids toys or art/craft left lying around.  I see those bits as evidence of joy that&#39;s been experienced, a &quot;life well lived&quot;.  But I&#39;ve found it harder to see it when I see dirty plates or glasses, empty food packets, etc, from where the kids have been involved in &quot;screen&quot; activities.  Your post has helped me to see that I resent their mess more when it was created during &quot;passive screen activities&quot;, as compared to &quot;productive craft type activities or projects&quot;.  You&#39;ve helped me to see that I still have some prejudice left over towards screen activities!  I didn&#39;t realise I still had some residual judgment of those activities as &quot;less than&quot;. <br/>\n<br/>\nKaryn<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Asking for help is absolutely fine. Accepting no is part of any request. And sometimes that&#39;s the really hard part. Sometimes when I ask for help I am at my most flustered and most frustrated and what I really need is someone hopping to it and doing what was requested. It helps if I don&#39;t ask for help when I can&#39;t accept a no with grace and equanimity. It&#39;s like baiting myself if I do. <br/>\n&gt; <br/>\n&gt; Lots of what helps are doing things when you notice them and making things easier to do. Put baskets and bins and things around to toss things into. Bring groceries in and put them away. Two steps. Do it each time. When things get overwhelming to you be overwhelmed. Go outside and run around and ignore it for that moment. And then when you are ready clean a small bit. Clean the toilet (I did it today and read the ludicrous suggestion on the toilet cleaner that I should be using it 3 times a week, 3 times a year seems more plausible), clean off a table, clean a cabinet door, clean a small bit. Don&#39;t look at the whole thing at once. When you look at a mess try not to see it as a chore, see it as a story. See it as candy joyfully eaten while games where played with such focus that someone couldn&#39;t see the trashcan an arms length away. See the legos spread across the floor as a moment of huge engagement and thought in action. I&#39;ll look around my<br/>\n&gt;  house...there is a plastic parachute on the table that I made ages ago to attach to a missle head that lands on caps that Linnaea and I played with, there is powdered sherbet on the floor, a bunch of Family Guy DVD&#39;s next to me from when we were trying to figure out if we had the newest season or not, cat and dog fur everywhere, the Darren Brown book that David&#39;s students gave him as a thank you for being their tutor, exercise balls from when we were all trying to do push ups like Paris did on the Gilmore Girls, licorice packet that Simon got for Linnaea because he was so happy that she&#39;d liked the candy that he liked, a rope that we bought to hang the hammock with and had leftover from and it is just lying on the floor after having been used as a jump rope, and on and on. Seeing the messes as still lifes helps. Seeing it as a part of a life well lived helps a lot. And cleaning it knowing that it is only temporary, that clean doesn&#39;t stay helps a lot.<br/>\n&gt;  You are making a blank canvas for others to play in. That is such a wonderful idea (not mine); <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chore/intro\">http://sandradodd.com/chore/intro</a> about halfway down by Dawn of NS. <br/>\n&gt; <br/>\n&gt; Find ways to enjoy what you are doing and it won&#39;t feel so overwhelming. <br/>\n&gt; <br/>\n&gt; Schuyler<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; From: Karen &lt;gktbdm@...&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Sent: Thursday, 2 April, 2009 3:42:55 PM<br/>\n&gt; Subject: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;<br/>\n&gt; <br/>\n&gt; I&#39;m really struggling with feeling overwhelmed and &quot;taken advantage of&quot; in terms of household stuff.  I have 4 children ranging in age from 6-15 and we haven&#39;t done the &quot;chores&quot; thing for a long time.  I initially used the strategy of a lot of &quot;huffing and puffing&quot; to try to make sure they realised I was the poor person having to do all the work and it wasn&#39;t fair....... lol.  I&#39;ve fortunately moved on a lot since then and have been trying to embrace the fact that if I joyfully do the household tasks, and ask for their help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll evenutally have a good attitude to household jobs and willingly help out.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238850320","msgId":39309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyN2x1ZyszYnVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDkwNDAzMTExMHU2ODk2N2M0N2o2N2UxNGJiZTNkMTYzNDNlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39308,"nextInTopic":39310,"prevInTime":39308,"nextInTime":39310,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... *** Yeah, it helps a lot, thanks. I love the example of how you came to the family and expressed YOUR problem and asked for help in solving it . I can","messageBody":"<div id=\"ygrps-yiv-2028134091\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Faith Void &lt;littlemsvoid@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am happy to hear your willingness to change attitudes and garner &gt; a new perspective. It sounds like you are still working on that.<br/>\n&gt; <br/>\n </span></blockquote>*** Thanks for the encouragement, Faith. Yeah, I&#39;m constantly working on this, doing lots of reading, trying different approaches,and examining my own attitudes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I suspect that they are not happily leaving things around. You may &gt; want to decide whether this a thought that is helpful for you to <br/>\n&gt; keep. They are just living their life. They are exploring the world.<br/>\n&gt; <br/>\n </span></blockquote>*** Yeah, I realise they have full lives and I try to respect the importance to them of relaxing in front of seemingly endless &quot;Friends&quot; reruns, because they&#39;re tired after spending half a day body boarding at the beach.  I have to work hard at this, though, because I still find myself thinking, &quot;YOU&#39;RE tired?  You&#39;ve been off having fun, and sure it&#39;s physically tiring, but what about *my* desire to have fun, rather than be standing here cleaning everyone else&#39;s stuff, or at least feeling like I *should* be doing it!? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You don&#39;t have to clean up everything. There are many ways to  <br/>\n&gt; respectfully manage a household. Have you sat down with the kids  <br/>\n&gt; and let them know how overwhelmed you feel? In an informational  <br/>\n&gt; way. Then ask for their help in solving the problem. They may not <br/>\n&gt; know how you feel, other than bitchy and likely they would just <br/>\n&gt; stay away from that :-)<br/>\n<br/>\n </span></blockquote>*** So funny.  How true it is, that they&#39;re likely to stay away from me and resist helping when they see me being bitchy & grumpy!  Who can blame them, really?  And in a way, I think it&#39;s fantastic because it&#39;s showing that they have the maturity to remove themselves from that kind of emotional environment.  They are WAY more willing to help out if I calmly mention my need to them, rather than freaking out at them, or being passive aggressive.  I must, I must, I must remember this!!!  It does work (mostly) when I&#39;m rational and not too emotional.  Like someone else said, &quot;catching the resentment BEFORE it builds up&quot;.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; It isn&#39;t wrong to ask. In fact asking for help is a good way to get &gt; help. You can talk about what your needs are and work together to <br/>\n&gt; find ways for everyone to feel happy. Asking means accepting all <br/>\n&gt; answers. It also means that help may not always look like what you &gt; think. But generally it all works out.<br/>\n&gt; <br/>\n </span></blockquote>*** YES!!!  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The other day I wanted help with the kitchen and I asked my 12dd. I &gt; said, &quot;I am feeling overwhelmed by the kitchen and the baby is <br/>\n&gt; wanting me to hold her constantly right now. What would you be <br/>\n&gt; willing to do to help me?&quot; She came up with several solutions and <br/>\n&gt; we worked it out. We had dishes to eat off again!<br/>\n&gt; <br/>\n </span></blockquote>*** When I ask, it usually tends to be more like, &quot;Could someone POSSIBLY help tidy up the kitchen?  I just don&#39;t have time to do it all by myself.&quot;  Sometimes it&#39;s followed by more whining on my part than that about how unfair it is for me to do the work of 6 people.  Yeah, yeah, I know, not a really great unschooling thing to say. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is no reason that eating has to be done everywhere in the <br/>\n&gt; house. I find that when i am sick I ask for all eating to be done <br/>\n&gt; in the kitchen of dining room. This consolidates the mess.<br/>\n<br/>\n </span></blockquote>*** My oldest son really likes to lie on the sofa bed in our study area and watch DVDs on the computer, consuming food and drink while doing so.  It&#39;s a carpeted area and there are often LOTS of crumbs etc left on the floor, and mess all over the coffee table.  I really do prefer to have food kept in the kitchen/dining/lounge area that&#39;s one big room with wooden floors (and where we watch TV, play Xbox etc).  I&#39;ve suggested before that food be not eaten out on the carpeted area unless the kids are willing to vacuum regularly out there, but they continue to eat out there (mostly the 15yo) and don&#39;t help clean it up.  So the other day I asked him again if he could please make a point of cleaning up the food crumbs etc if he really wants to eat out there, to avoid attracting cockroaches, ants, etc.  I guess I&#39;m thinking that I don&#39;t want to make a &quot;rule&quot; about it, and yet it really would be ideal if food wasn&#39;t out there at all.  And yet they (he) really likes to eat/drink while he&#39;s watching his shows.  Any suggestions?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you need help after dinner ask for it.<br/>\n&gt; I generally cook and then either my partner cleans up after dinner &gt; or one of the kids. That gives me space to unwind after a busy day. &gt; This came out of a conversation I had with them about feeling <br/>\n&gt; stressed after dinner and trying different things. At first I just &gt; didn&#39;t clean up. BUt that didn&#39;t work any better because I felt <br/>\n&gt; overwhelmed in the morning. Then I tried to wait until after the <br/>\n&gt; kids went to bed but that didn&#39;t work. I likely tried a few more <br/>\n&gt; things that didn&#39;t work. Then I came tot he family and expressed my<br/>\n&gt; problem and asked for help solving it.<br/>\n&gt; <br/>\n&gt; I hope that helps a little,<br/>\n&gt; <br/>\n&gt; Faith<br/>\n<br/>\n </span></blockquote>*** Yeah, it helps a lot, thanks. I love the example of how you &quot;came to the family and expressed YOUR problem and asked for help in solving it&quot;. I can imagine that approaching it that way would inspire the family to really listen to you and help solve it, perhaps even being part of the solution! :)  I really am getting better at this kind of thing when I think about it, but I still have a long way to go!<br/>\n<br/>\nKaryn<br/>\nP.S.  My 15yo son has just headed off to bed after watching a movie with friends, then playing a bit of xbox (and lots of surfing today!). He&#39;s heading into the beach early again tomorrow (dads & other older blokes, plus the teens surfing together & having BBQ brekkie afterwards - awesome!).  Anyway, he said goodnight and headed for his room, then came back, grabbed the empty food packets and soda cans from the study and put them in the bin.  I almost didn&#39;t notice or respond, then suddenly realised what he&#39;d done so expressed a simple &quot;thank you, I really appreciate that&quot;.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238849851","msgId":39303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJERTQxRkJCLTg3NjktNDNDRS05RDRDLUM2MzE0NzY1M0JGMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdyNTV1dit2OXR1QGVHcm91cHMuY29tPg==","referencesHeader":"PGdyNTV1dit2OXR1QGVHcm91cHMuY29tPg=="},"prevInTopic":39293,"nextInTopic":39306,"prevInTime":39302,"nextInTime":39304,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... Attitude. Rules often have consequences if broken. Substitute courtesy or favor for policy if that helps make the idea clearer. ... Don t remind them so","messageBody":"<div id=\"ygrps-yiv-293805207\">On Apr 3, 2009, at 10:20 AM, Karen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; You could set a new policy of eating only in the kitchen unless<br/>\n&gt;&gt; people can remember to bring their dishes back. Do expect to remind<br/>\n&gt;&gt; them of the policy.<br/>\n&gt;&gt;<br/>\n&gt; *** In what way would this be different to a rule?<br/>\n<br/>\n </span></blockquote>Attitude.<br/>\n<br/>\nRules often have consequences if broken.<br/>\n<br/>\nSubstitute courtesy or favor for policy if that helps make the idea  <br/>\nclearer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m just worried that if I keep reminding them to bring their stuff  <br/>\n&gt; to the kitchen when they&#39;re done with it, they&#39;ll end up doing  <br/>\n&gt; &quot;their bit&quot; but certainly no one else&#39;s.  Does that make sense?<br/>\n<br/>\n </span></blockquote>Don&#39;t remind them so much as ask them to do you the favor of bringing  <br/>\nin some dishes. The same way you&#39;d ask your husband or a friend.<br/>\n<br/>\n&quot;Would you mind bringing those plate in? I&#39;d like to run the  <br/>\ndishwasher.&quot;<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238794000","msgId":39293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAzMTQyNnJjOTNiZDhkeGMwNzcyYzgyZWJlNGFmYTVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGdyNTVmdis4NDFuQGVHcm91cHMuY29tPg==","referencesHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRTMwQEJPWC5DTkNTT0ZUV0FSRS5DT00+CSA8Z3I1NWZ2Kzg0MW5AZUdyb3Vwcy5jb20+"},"prevInTopic":39292,"nextInTopic":39303,"prevInTime":39292,"nextInTime":39294,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"Ah, I m looking around me right now and I ll tell you what I see in our family room (everyone else is in bed): bags of groceries not unpacked, piles of junk","messageBody":"<div id=\"ygrps-yiv-1124873421\">Ah, I&#39;m looking around me right now and I&#39;ll tell you what I see in our<br/>\nfamily room (everyone else is in bed): bags of groceries not unpacked, piles<br/>\nof junk waiting to be sorted, piles of paperwork waiting to be sorted,<br/>\ndinner dishes everywhere which means all the kitchen benches are covered<br/>\nwith dirty dishes etc, leaving no room at all to make breakfast in the<br/>\nmorning, dirty dishes on the coffee table, the esky waiting to be unpacked<br/>\nfrom our trip to visit friends today, a few pairs of shoes lying around, a<br/>\nfew toys on the floor, a huge pile of clean unfolded washing, etc. I love<br/>\nthe idea of baskets in the living area for different people&#39;s stuff, or just<br/>\nstorage baskets for different bits & pieces (I do this) but I&#39;m finding the<br/>\nstuff left lying around is stuff waiting to be done (eg. groceries away,<br/>\ndishes washed, or rinsed/stacked in dishwasher etc. I just feel like it&#39;s a<br/>\nlot for me to do by myself, especially when I&#39;m wanting time to do things<br/>\nwith the kids, and time to do my own internet or book reading on unschooling<br/>\n(essential for getting my head around it!).<br/>\n<br/>\n***I like to think small. Like I am going to clean for 15 minutes (others<br/>\nmentioned that and I do it too) or to make a to-do list and break it down<br/>\ninto small parts. I am going to wash one load of dishes and clear off the<br/>\ncounter. Then I will do emails (or whatever) for 15 minutes. I use a timer.<br/>\nIt really helps. I have a photo essay on it on my blog<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/2008/11/cleaning-photo-essay.html\">http://faithvoid.blogspot.com/2008/11/cleaning-photo-essay.html</a><br/>\n<br/>\nI showed how I cleaned and redid a room in about an hour with a toddler :-)<br/>\nI played with her in between cleaning times.<br/>\n<br/>\nIf you can&#39;t afford to run out and get all the organizational stuff you need<br/>\nright away get liquor store boxes. They are free. Have one per person and<br/>\nthrow everything in there. Then take it where it belongs. I have several<br/>\nlaundry baskets as well and find that helpful. I fold on my dining room<br/>\ntable. And then bring it to the drawers right away. I no longer fold my<br/>\nlittle ones clothes. I just separate them into shirts/pants. undies etc.<br/>\nThey like to do it themselves. Sometimes my ds6 will choose to fold his<br/>\nclothes or ask me to.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-==-=--=<br/>\n<br/>\n  What about all the other things such as my own reading/research about<br/>\nunschooling etc, ringing a friend or family member, etc. I&#39;m sure everyone<br/>\nwishes the world could stop for an hour or so a day, while they caught up or<br/>\ngot a head start? I know I do LOL!<br/>\n<br/>\n***I will slip in in through the day. I take little mini-breaks. Some days I<br/>\nchoose to do less house maintenance. It is always waiting for me when I get<br/>\nto it.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=---=-=-=-=-=-=--=-=--=-=-=-=-=-=-=<br/>\n<br/>\nI think they take advantage of the fact that I&#39;ll clean up their mess, so<br/>\nthey don&#39;t have to bother, so why bother?<br/>\n<br/>\n***I think it is great that my kids take full advantage of our home. They<br/>\nlearn and explore and create and enjoy life. Life is messy. I figure that I<br/>\ncould have skipped child rearing and had all my space and time for myself<br/>\nbut I didn&#39;t. I chose to have kids. With that comes a little craziness. My<br/>\nkids leave messes because they are busy and it often doesn&#39;t occur to them<br/>\nto clean it. I find that as they get older they notice more and more. My son<br/>\ngrabs a rag and wipes the floor down if he sprays in the bathroom now! That<br/>\nis huge. Occasionally he will ask for help but now he generally cleans up<br/>\nafter himself. It is these samll things that we need to see. Also ds6 rarely<br/>\nputs anything where I would like it to go. I generally have to pick up aftet<br/>\nhim or help him in very specific ways. But he loves to wash windows and do<br/>\nlawn stuff. I try to see the help that the kids give freely. I try to<br/>\nremember to apperciate and focus on those things.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-==--==-=--==-=--=--=----===-=-==-=-<br/>\n<br/>\n I think it partly comes from that thought that a &quot;good housewife&quot; will have<br/>\na reasonably tidy, welcoming home, not one with clutter strewn from one end<br/>\nto the other! And also from my DH, who REALLY likes a tidy, clean living<br/>\nspace. He finds it hard to relax when there&#39;s lots of clutter lying around,<br/>\nor household jobs that need to be done. He tries hard to embrace the mess<br/>\nthat seems to come with our unschooling lifestyle, but we have on occasion<br/>\nhad MASSIVE conflict about the &quot;state of the house&quot;. So I guess I feel<br/>\ncaught between a rock and a hard place, so to speak. I feel like I &quot;should&quot;<br/>\nclean up so the house looks & functions better, and I don&#39;t think it&#39;s fair<br/>\nthat the kids rarely ever help, and yet I see them relaxing and enjoying<br/>\nthemselves, and I don&#39;t feel like I have the same freedom to do that.<br/>\n<br/>\n***Then perhaps Dh is the first person to talk to about this issues. Does he<br/>\nknow how you feel? Can you find out exactly what he needs? Can you two<br/>\nbrainstorm to come up with ideas that work for you both? You have a job<br/>\ncalled &quot;Mama&quot; you take care of kids needs and adventures all day. Housework<br/>\nis something you can split with your partner as well. It is OK to ask you<br/>\nkids to help. I let mine know when I need help.<br/>\n<br/>\nWhat helps me when I feel resentful is to step back and listen to myself.<br/>\nObserve what it going through my head. Where is it coming from? Who&#39;s issue<br/>\nis it really? If your dh wants a clean house that is his issue. If you are<br/>\nfeeling inadequate that is your issue, etc. It is helpful and then you can<br/>\nmove on from there.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nWow, this has really challenged me: how cool would it be for my kids to say<br/>\nto their friends, &quot;Yeah, Mum loves hanging out with us and playing the xbox<br/>\nwith us!&quot;<br/>\n<br/>\n*** It is awesome! You can get there.<br/>\n<br/>\nFaith<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":364752062,"authorName":"pnwmuddygirl","from":"&quot;pnwmuddygirl&quot; &lt;pnwmuddygirl@...&gt;","profile":"pnwmuddygirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238792897","msgId":39291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNXRzMStrZzdnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3OTkxLjY4MDY1LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39290,"nextInTopic":39292,"prevInTime":39290,"nextInTime":39292,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"I don t think I have ever posted but I am an avid reader of the list, love love love it. I especially love that as I read, it is always likely that someone","messageBody":"<div id=\"ygrps-yiv-922624373\">I don&#39;t think I have ever posted but I am an avid reader of the list, love love love it. I especially love that as I read, it is always likely that someone else asks a question on my burner o thought. Thanks for this thread, great helps all throughout it.<br/>\n<br/>\nSchuyler your quotes reminding to see it as a story and/or still life are wonderful, thanks for that:) <br/>\n<br/>\ncait<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Asking for help is absolutely fine. Accepting no is part of any request. And sometimes that&#39;s the really hard part. Sometimes when I ask for help I am at my most flustered and most frustrated and what I really need is someone hopping to it and doing what was requested. It helps if I don&#39;t ask for help when I can&#39;t accept a no with grace and equanimity. It&#39;s like baiting myself if I do. <br/>\n&gt; <br/>\n&gt; Lots of what helps are doing things when you notice them and making things easier to do. Put baskets and bins and things around to toss things into. Bring groceries in and put them away. Two steps. Do it each time. When things get overwhelming to you be overwhelmed. Go outside and run around and ignore it for that moment. And then when you are ready clean a small bit. Clean the toilet (I did it today and read the ludicrous suggestion on the toilet cleaner that I should be using it 3 times a week, 3 times a year seems more plausible), clean off a table, clean a cabinet door, clean a small bit. Don&#39;t look at the whole thing at once. When you look at a mess try not to see it as a chore, see it as a story. See it as candy joyfully eaten while games where played with such focus that someone couldn&#39;t see the trashcan an arms length away. See the legos spread across the floor as a moment of huge engagement and thought in action. I&#39;ll look around my<br/>\n&gt;  house...there is a plastic parachute on the table that I made ages ago to attach to a missle head that lands on caps that Linnaea and I played with, there is powdered sherbet on the floor, a bunch of Family Guy DVD&#39;s next to me from when we were trying to figure out if we had the newest season or not, cat and dog fur everywhere, the Darren Brown book that David&#39;s students gave him as a thank you for being their tutor, exercise balls from when we were all trying to do push ups like Paris did on the Gilmore Girls, licorice packet that Simon got for Linnaea because he was so happy that she&#39;d liked the candy that he liked, a rope that we bought to hang the hammock with and had leftover from and it is just lying on the floor after having been used as a jump rope, and on and on. Seeing the messes as still lifes helps. Seeing it as a part of a life well lived helps a lot. And cleaning it knowing that it is only temporary, that clean doesn&#39;t stay helps a lot.<br/>\n&gt;  You are making a blank canvas for others to play in. That is such a wonderful idea (not mine); <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chore/intro\">http://sandradodd.com/chore/intro</a> about halfway down by Dawn of NS. <br/>\n&gt; <br/>\n&gt; Find ways to enjoy what you are doing and it won&#39;t feel so overwhelming. <br/>\n&gt; <br/>\n&gt; Schuyler<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; From: Karen &lt;gktbdm@...&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Sent: Thursday, 2 April, 2009 3:42:55 PM<br/>\n&gt; Subject: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;<br/>\n&gt; <br/>\n&gt; I&#39;m really struggling with feeling overwhelmed and &quot;taken advantage of&quot; in terms of household stuff.  I have 4 children ranging in age from 6-15 and we haven&#39;t done the &quot;chores&quot; thing for a long time.  I initially used the strategy of a lot of &quot;huffing and puffing&quot; to try to make sure they realised I was the poor person having to do all the work and it wasn&#39;t fair....... lol.  I&#39;ve fortunately moved on a lot since then and have been trying to embrace the fact that if I joyfully do the household tasks, and ask for their help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll evenutally have a good attitude to household jobs and willingly help out.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela Wolff","from":"&quot;Angela Wolff&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238792835","msgId":39292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNXRxMysyOXJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39291,"nextInTopic":39293,"prevInTime":39291,"nextInTime":39293,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"Hi Karen, My head is spinning reading all these posts. It sounds like you ve gotten lots of little bits and pieces that you ve found helpful. So have I!!!","messageBody":"<div id=\"ygrps-yiv-981356497\">Hi Karen,<br/>\n<br/>\nMy head is spinning reading all these posts. It sounds like you&#39;ve gotten lots of little bits and pieces that you&#39;ve found helpful.<br/>\n<br/>\nSo have I!!! Cleaning is my nemesis, but it&#39;s something I&#39;m working on.<br/>\n<br/>\nThe part about making your feelings known to them and involving them in the solution is probably what rings the most true for me, and it&#39;s what I thought about when I read:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I WANT to model generosity and serving them,  <br/>\n<br/>\n </span></blockquote>I&#39;m wondering if by working so hard to model generosity and serving them, you&#39;ve given them the impressions that you WANT to do it all yourself. Or at the very least that you think it *should* be your sole domain, even if you don&#39;t really like it.<br/>\n<br/>\nMy kids are younger than yours. The oldest is almost 7. I *do* think it&#39;s important to teach kids how to clean up, which I think is different than that it is their responsibility, etc. What I mean is that my mother used to require me to clean up my room, but really she didn&#39;t care as long as it &quot;looked&quot; clean when she looked in. If I threw everything I owned into the closet or stuffed it under the bed, that was fine by her. But what it meant was that my room only stayed clean for about a second until I wanted to find something and then I had to pull it all right back out again. It was an ugly vicious cycle.<br/>\n<br/>\nAnd to this day it is a problem for me. I am organizationally challenged to say the least. I think it&#39;s something that comes very naturally for some kids, but it didn&#39;t for me. And I can already see that my oldest looks at a big pile of toys and feels overwhelmed the same way I used to (and, really, still do). <br/>\n<br/>\nSo, there are many times where I say &quot;It&#39;s time to clean up, will you join me in the sun room&quot; and then I plop myself on the floor with them and say &quot;J, can you pick up all the blocks and put them in the blocks basket, please?&quot; &quot;H, will you put all the books on the bookshelf?&quot; &quot;I&#39;m going to put all the dolls in the bed.&quot; And we keep doing it until everything is put away. I&#39;m hoping that by showing them how to do it in bites that I&#39;m teaching them a valuable skill.<br/>\n<br/>\nThere are also times when we tell them that we are going to vacuum after they go to bed, and that anything that is still on the floor will be put in a bag. It&#39;s not nearly so punitive as it sounds. It&#39;s not a garbage bag. The toys aren&#39;t gone forever. We just might have too much to do that night to be able to sit with them and do the step-by-step. Sometimes it&#39;s all put away. But if not, what usually happens is that the things they really care about are picked up and put away, and the things that are broken or that they are no longer interested in playing with get left out. We toss what&#39;s left out in a bag so we can vacuum, and then they can have them back when they ask for them. They almost never do, so it&#39;s become a good way of weeding out the toys that they have outgrown or grown bored with. Which leads to less clutter on the floor the next time and makes it easier for them to clean up on their own.<br/>\n<br/>\nYou&#39;ve also gotten some good advice about &quot;thinking out of the box.&quot; It&#39;s such a good point. Just remember that when you&#39;re coming up with cleaning and storage solutions for you and your kids, to think about how your brain works and ask them what might help them, too. My husband is a filer, so he has a file cabinet and a set of drawers. For me, outside of a recipe box or things like birth certificates and the deed to the house, if I were to put something in a file, I might as well toss it in the garbage. I&#39;ve had to come up with some attractive ways to keep things out in plain view where I can see them. <br/>\n<br/>\nI&#39;ve also had to (convince my husband to) give up on the idea that our dining room is just a dining room. We have a small house, so it really does double if not triple duty. Using the dining room table for art projects, but not actually allowing any storage space in the dining room for the needed supplies or to display the final creations just meant that we had a big mess we had to shuffle around from surface to surface every time we wanted to *gasp* eat at the table. Now we have storage for art supplies and I&#39;m making a big cloth-covered homasote board for one wall so that we can display artwork, keep the family calendar, etc.<br/>\n<br/>\nI guess that&#39;s my long and involved way of saying that when you are devising your cleaning and organizational strategies, really think about how you live and how your brain works, rather than thinking about &quot;Oh I really like those pretty things Beth got at the Container Store.&quot; And involve your kids in the solutions, too, because they may each have their own organizational preferences and will be more likely to want to/be able to help out if those preferences are taken into consideration.<br/>\n<br/>\nBest of luck, and thanks for asking the question in the first place. Some of the responses have been very helpful to me as I work on this challenge of my own.<br/>\n-Angela</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238791758","msgId":39290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAzMTM0OXczZWY4YTE2dGM2MjFiZWRkYTMxODNiNzlAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDAwOGEwMWM5YjQxZiQ1NjIzMjcyMCQ4MzAwYThjMEByZWR3aW5lPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPiA8MDA4YTAxYzliNDFmJDU2MjMyNzIwJDgzMDBhOGMwQHJlZHdpbmU+"},"prevInTopic":39289,"nextInTopic":39291,"prevInTime":39289,"nextInTime":39291,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"I would also feel that the situation would be unfair. ***To whom? It sounds frustrating but not unfair. ","messageBody":"<div id=\"ygrps-yiv-143135895\">I would also feel that the situation would be unfair.<br/>\n<br/>\n***To whom? It sounds frustrating but not unfair.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\n I have a level of expectations that my kids pick up after themselves and I<br/>\ndon&#39;t deny that I feel resentful when they obliviously leave the table after<br/>\ndinner and go back to their games while I spend two hours in the kitchen.<br/>\n<br/>\n***This might be so but it isn&#39;t an attitude conducive to unschooling or<br/>\nhelping other understand unschooling better.<br/>\n<br/>\nI think having a desire to be helped or needing help is different from an<br/>\nexpectation.<br/>\n-=-=----=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI feel resentful and unappreciated and overwhelmed. Changing my attitude and<br/>\nreframing things do not help. I&#39;ve tried and the happy feelings just don&#39;t<br/>\ncome! I feel resentful. Sorry, this is not a popular opinion on this list,<br/>\nbut I am authentic to what I feel.<br/>\n<br/>\n***On this list we talk about getting your needs met before you become<br/>\nresentful. And in re-framing your perspective so that you take<br/>\nresponsibility for your needs and feelings. Feeling resentful because you<br/>\naren&#39;t getting the help you need is mainstream thinking. It will be<br/>\nquestioned on here. Once you own that ther resent is yours and has nothing<br/>\nto do with your kids we can move on.<br/>\n<br/>\nI am authentic to how I feel as well. I feel overwhelmed I ask for help. I<br/>\nfeel angry I ask for space, etc. I don&#39;t feel resentful because I expect my<br/>\nkids to do something that meets my needs and they don&#39;t do it. Or if I do<br/>\nfeel resentful for a reason like that I spend time thinking about where that<br/>\nis coming from. It isn&#39;t coming from them. It is likely coming from my past.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-<br/>\n<br/>\nWhen I tell my family how I feel, the relationship is great enough that they<br/>\ndo their share.<br/>\n<br/>\n***I am hoping that you mean that you let them know how you feel in a<br/>\nrespectful informational way and ask for help. And then as a family look for<br/>\nways that met everyone&#39;s needs.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-==-=-=-=-=-=<br/>\n<br/>\n Not my work. Our work. Their share.<br/>\n<br/>\n***It is YOUR work. If you are the one deciding that it needs to be done<br/>\nthen it is yours. Own it.<br/>\n<br/>\nI want the kitchen clean, rarely does anyone else. It is my issue that the<br/>\nkitchen isn&#39;t up to my standards. If I need help I know that I can ask for<br/>\nit. I will ask though not expect. I typically get joyful help. My kids<br/>\nreally care that I am happy and feeling good.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-==-=-=-=-=-==-===-=-<br/>\n<br/>\nWe all have work to be done around the house and it&#39;s a long list. I printed<br/>\nout this list and laid it on the table and said that I would do a few<br/>\nthings. Who is doing the rest? We divied it up and no more grumbling. I<br/>\nthink the kids didn&#39;t truly realize how much work it takes to keep the<br/>\nhousehold running (the household, not my household).<br/>\nAs the saying goes, nobody walks over you unless you lie down first.<br/>\n<br/>\n***This is not an example of respectful parenting. If you want to live this<br/>\nway it is up to you but on an unschooling board it will be examined.<br/>\n<br/>\nWhat if your kid made a list of all the things s/he wanted to do this week<br/>\nand then laid it in front of you and said &quot;Mama here is my to-do list. I am<br/>\nwilling to pay for x, y, z. You and dad divide up the rest.&quot;<br/>\n<br/>\nI *choose* to run my  household. I *choose* to be with my kids. I *choose*<br/>\nto unschool. I am grateful that I have the space in my life to choose these<br/>\nthings. I am grateful to the women on this list that help me move forward on<br/>\nthis journey.<br/>\n<br/>\nI have no problems with my family walking all over me, we respect each<br/>\nother.<br/>\n<br/>\nOK I ma needed to help set up Guitar Hero.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238791707","msgId":39289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNXNtcis1Y2s4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyNWljditkZDJnQGVHcm91cHMuY29tPg=="},"prevInTopic":39286,"nextInTopic":39290,"prevInTime":39288,"nextInTime":39290,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"~~ ... I m not a big fan of democracy for families. It s a majority vote and there is often someone left unhappy with the results. Minority loses. I m more in","messageBody":"<div id=\"ygrps-yiv-727750981\">~~<br/>\n<blockquote><span title=\"ireply\"> &gt; We run our family in a democratic fashion.~~<br/>\n<br/>\n </span></blockquote>I&#39;m not a big fan of democracy for families. It&#39;s a majority vote and there is often someone left unhappy with the results. Minority loses.<br/>\n<br/>\nI&#39;m more in favor of finding solutions that work for everyone. When adults say &quot;it works for us&quot; it&#39;s usually more convenient for the adults, that&#39;s all.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238786901","msgId":39286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyQkRERjdBLUE4ODAtNDBDQS1CMDkwLTk0MDA5MzYyRTI0MkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDZlNzk0ZWQ2MDkwNDAyMjAyOXc1MDJiODQyY3ViYzg4OTQ1MzBlZWMwNjJlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPiA8NmU3OTRlZDYwOTA0MDIyMDI5dzUwMmI4NDJjdWJjODg5NDUzMGVlYzA2MmVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":39285,"nextInTopic":39289,"prevInTime":39285,"nextInTime":39287,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... Who does? All of you? Or you, the parents? ... Principles, not rules, are more central to unschooling. Read about  the difference:","messageBody":"<div id=\"ygrps-yiv-2026644280\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; We run our family in a democratic fashion.<br/>\n<br/>\n </span></blockquote>Who does? All of you? Or you, the parents?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have very few rules - ten<br/>\n&gt; rules, in fact.  One of which is when you make a mess,  you clean it  <br/>\n&gt; up.<br/>\n&gt; Another of which is not to disturb another family member&#39;s right to  <br/>\n&gt; exist<br/>\n&gt; peacefully.   All of the rules are rules that every family member  <br/>\n&gt; has had a<br/>\n&gt; chance to vote on and has agreed to.<br/>\n<br/>\n </span></blockquote>Principles, not rules, are more central to unschooling.<br/>\n<br/>\nRead about  the difference: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n(which includes an excellent description by Deb L, moderator here).<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; When someone does not clean up their own mess, any family member can  <br/>\n&gt; &quot;write&quot;<br/>\n&gt; them up and we have a family meeting over dinner to discuss the  <br/>\n&gt; offense.<br/>\n&gt; The rules apply to everyone, so if I leave a mess, someone can write  <br/>\n&gt; me up<br/>\n&gt; too.  Once we discuss the issue, take a plea, and vote guilty/not  <br/>\n&gt; guilty,<br/>\n&gt; then we discuss a sentence.  The sentence is usually just helping  <br/>\n&gt; out around<br/>\n&gt; the house or what not and almost always suggested by the individual  <br/>\n&gt; who was<br/>\n&gt; written up.   Again, everyone in the family discusses and votes on<br/>\n&gt; everything.   Most of the time, we don&#39;t even apply a sentence, we  <br/>\n&gt; just let<br/>\n&gt; the individual off with a warning.<br/>\n<br/>\n </span></blockquote>All I can say to this is &quot;ewww.&quot; Everyone gets to punish someone else  <br/>\nfor an infraction? That sounds like mob rule to me. Or worse, a police  <br/>\nstate. Not the noisy/peaceful, happy homes of unschoolers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; This system works great for us.  It allows all of us to respect each  <br/>\n&gt; other<br/>\n&gt; and treats us all as equal family partners.  Even I have been  <br/>\n&gt; written up and<br/>\n&gt; sentenced for extreme rudeness and drama. :p  More than once, even.<br/>\n<br/>\n </span></blockquote>But you&#39;re not &quot;equal family partners&quot; really, are you? Do the kids  <br/>\nget to vote on whether you spend money on clothes, or cosmetics or  <br/>\nrefrigerators? Can they say no to what you want if there are enough  <br/>\nvotes?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I don&#39;t know if this will help you at all or not.  Perhaps just  <br/>\n&gt; discussing<br/>\n&gt; your feelings with your family, in a non blaming - non woe is me  <br/>\n&gt; way, would<br/>\n&gt; be enough to remind them that you&#39;re all responsible for cleaning up.<br/>\n<br/>\n </span></blockquote>It&#39;s just not true. You, as a parent, take the responsibility on when  <br/>\nyou have children to take care of them, not for them to take care of  <br/>\nyou by requiring chores of them. What would happen if one kid decided  <br/>\nto rebel against &quot;democracy?&quot; More &quot;sentences&quot; and punishment?<br/>\n<br/>\nDiscussing feelings is good. Asking for help is good. Accepting a &quot;no&quot;  <br/>\nis good.<br/>\n<br/>\nYou might want to say &quot;no, not right now&quot; to someone&#39;s request to  <br/>\nclean up the house. Are you allowed to? Will you be punished?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Here are more unschooling writings about chores. Joyce says, &quot;The life  <br/>\nwe give them is our gift to them.&quot; I *love* that.<br/>\n<br/>\nMore on chores on her site, at the right.<br/>\n<br/>\nLots of collected stories from unschoolers, here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\nOnce upon a time, we had family meetings. It ended up being just a way  <br/>\nto force everyone to agree to the most opinionated person&#39;s wishes,  <br/>\nwhich left us all feeling disrespected. We stopped after two.  <br/>\nDemocracy in an unschooling family doesn&#39;t work. Partnerships do,  <br/>\nthough.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238782596","msgId":39285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAzMTExNm40Y2M0N2Q1Nms5MGE1ZjAxNmRhNDlmMjM4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDZlNzk0ZWQ2MDkwNDAyMjAyOXc1MDJiODQyY3ViYzg4OTQ1MzBlZWMwNjJlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPgkgPDZlNzk0ZWQ2MDkwNDAyMjAyOXc1MDJiODQyY3ViYzg4OTQ1MzBlZWMwNjJlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39284,"nextInTopic":39286,"prevInTime":39284,"nextInTime":39286,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"We run our family in a democratic fashion. We have very few rules - ten rules, in fact. One of which is when you make a mess, you clean it up. Another of which","messageBody":"<div id=\"ygrps-yiv-514604264\">We run our family in a democratic fashion. We have very few rules - ten<br/>\nrules, in fact. One of which is when you make a mess, you clean it up.<br/>\nAnother of which is not to disturb another family member&#39;s right to exist<br/>\npeacefully. All of the rules are rules that every family member has had a<br/>\nchance to vote on and has agreed to.<br/>\n<br/>\n***OK but how does that relate to unschooling or fostering a sense of trust<br/>\nand love?<br/>\n<br/>\nWhat does that mean &quot;is not to disturb another family member&#39;s right to<br/>\nexist<br/>\npeacefully&quot;? Would you write up the toddler for screaming during Heroes?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\nWhen someone does not clean up their own mess, any family member can &quot;write&quot;<br/>\nthem up and we have a family meeting over dinner to discuss the offense.<br/>\nThe rules apply to everyone, so if I leave a mess, someone can write me up<br/>\ntoo. Once we discuss the issue, take a plea, and vote guilty/not guilty,<br/>\nthen we discuss a sentence. The sentence is usually just helping out around<br/>\nthe house or what not and almost always suggested by the individual who was<br/>\nwritten up. Again, everyone in the family discusses and votes on<br/>\neverything. Most of the time, we don&#39;t even apply a sentence, we just let<br/>\nthe individual off with a warning.<br/>\n<br/>\n***Again I don&#39;t see how this creates a space of peace, joy or trust. I<br/>\ncan&#39;t image writing up someone in my family. I can&#39;t imagine thinking in<br/>\nwords like guilt and offenses and feeling like a loving guide. I don&#39;t see<br/>\nthis creating the atmosphere of trust and joy we all love here.<br/>\n<br/>\nApply a sentence? WOW! This seems very fear based and coercive to me.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-<br/>\n<br/>\nThis system works great for us. It allows all of us to respect each other<br/>\nand treats us all as equal family partners. Even I have been written up and<br/>\nsentenced for extreme rudeness and drama. :p More than once, even.<br/>\n<br/>\n***So it doesn&#39;t really solve what you consider problems then if people are<br/>\nhabitual &quot;offenders&quot;.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI don&#39;t know if this will help you at all or not. Perhaps just discussing<br/>\nyour feelings with your family, in a non blaming - non woe is me way, would<br/>\nbe enough to remind them that you&#39;re all responsible for cleaning up.<br/>\n<br/>\n***This is more how I view my life with my family, full of understanding and<br/>\nnon-judgment.<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238782224","msgId":39284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3OTkxLjY4MDY1LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39283,"nextInTopic":39285,"prevInTime":39283,"nextInTime":39285,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"Asking for help is absolutely fine. Accepting no is part of any request. And sometimes that s the really hard part. Sometimes when I ask for help I am at my","messageBody":"<div id=\"ygrps-yiv-906099497\">Asking for help is absolutely fine. Accepting no is part of any request. And sometimes that&#39;s the really hard part. Sometimes when I ask for help I am at my most flustered and most frustrated and what I really need is someone hopping to it and doing what was requested. It helps if I don&#39;t ask for help when I can&#39;t accept a no with grace and equanimity. It&#39;s like baiting myself if I do. <br/>\n<br/>\nLots of what helps are doing things when you notice them and making things easier to do. Put baskets and bins and things around to toss things into. Bring groceries in and put them away. Two steps. Do it each time. When things get overwhelming to you be overwhelmed. Go outside and run around and ignore it for that moment. And then when you are ready clean a small bit. Clean the toilet (I did it today and read the ludicrous suggestion on the toilet cleaner that I should be using it 3 times a week, 3 times a year seems more plausible), clean off a table, clean a cabinet door, clean a small bit. Don&#39;t look at the whole thing at once. When you look at a mess try not to see it as a chore, see it as a story. See it as candy joyfully eaten while games where played with such focus that someone couldn&#39;t see the trashcan an arms length away. See the legos spread across the floor as a moment of huge engagement and thought in action. I&#39;ll look around my<br/>\n house...there is a plastic parachute on the table that I made ages ago to attach to a missle head that lands on caps that Linnaea and I played with, there is powdered sherbet on the floor, a bunch of Family Guy DVD&#39;s next to me from when we were trying to figure out if we had the newest season or not, cat and dog fur everywhere, the Darren Brown book that David&#39;s students gave him as a thank you for being their tutor, exercise balls from when we were all trying to do push ups like Paris did on the Gilmore Girls, licorice packet that Simon got for Linnaea because he was so happy that she&#39;d liked the candy that he liked, a rope that we bought to hang the hammock with and had leftover from and it is just lying on the floor after having been used as a jump rope, and on and on. Seeing the messes as still lifes helps. Seeing it as a part of a life well lived helps a lot. And cleaning it knowing that it is only temporary, that clean doesn&#39;t stay helps a lot.<br/>\n You are making a blank canvas for others to play in. That is such a wonderful idea (not mine); <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chore/intro\">http://sandradodd.com/chore/intro</a> about halfway down by Dawn of NS. <br/>\n<br/>\nFind ways to enjoy what you are doing and it won&#39;t feel so overwhelming. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Karen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gktbdm@...\">gktbdm@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thursday, 2 April, 2009 3:42:55 PM<br/>\nSubject: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;<br/>\n<br/>\nI&#39;m really struggling with feeling overwhelmed and &quot;taken advantage of&quot; in terms of household stuff.  I have 4 children ranging in age from 6-15 and we haven&#39;t done the &quot;chores&quot; thing for a long time.  I initially used the strategy of a lot of &quot;huffing and puffing&quot; to try to make sure they realised I was the poor person having to do all the work and it wasn&#39;t fair....... lol.  I&#39;ve fortunately moved on a lot since then and have been trying to embrace the fact that if I joyfully do the household tasks, and ask for their help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll evenutally have a good attitude to household jobs and willingly help out.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238782202","msgId":39283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAzMTExMHU2ODk2N2M0N2o2N2UxNGJiZTNkMTYzNDNlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39282,"nextInTopic":39284,"prevInTime":39282,"nextInTime":39284,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"I m really struggling with feeling overwhelmed and taken advantage of in terms of household stuff. I have 4 children ranging in age from 6-15 and we haven t","messageBody":"<div id=\"ygrps-yiv-1045737475\">I&#39;m really struggling with feeling overwhelmed and &quot;taken advantage of&quot; in<br/>\nterms of household stuff. I have 4 children ranging in age from 6-15 and we<br/>\nhaven&#39;t done the &quot;chores&quot; thing for a long time. I initially used the<br/>\nstrategy of a lot of &quot;huffing and puffing&quot; to try to make sure they realised<br/>\nI was the poor person having to do all the work and it wasn&#39;t fair.......<br/>\nlol. I&#39;ve fortunately moved on a lot since then and have been trying to<br/>\nembrace the fact that if I joyfully do the household tasks, and ask for<br/>\ntheir help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll<br/>\nevenutally have a good attitude to household jobs and willingly help out.<br/>\n<br/>\n***I am happy to hear your willingness to change attitudes and garner a new<br/>\nperspective. It sounds like you are still working on that.<br/>\n<br/>\nI find it helpful to disattach from any expectations that my children will<br/>\neventually have any attitude. I try to remember to just be where we are and<br/>\nwho we are right now. They may never have a good attitude about cleaning,<br/>\nthey may choose to have a maid when they are older. who knows? What you are<br/>\nconcerned about it right now.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nBut! I feel quite resentful of the fact that they happily leave their dirty<br/>\nplates etc lying wherever they used them, leave empty food packets lying<br/>\naround the house, leave clothes all over the floor etc, and just don&#39;t seem<br/>\nto notice or care! I get the fact that kids often really don&#39;t care or<br/>\nnotice, but the reality is that I&#39;m doing the work of cleaning up EVERYONE&#39;S<br/>\nstuff and it&#39;s a lot of work! I&#39;m finding it hard to stay on top of it all<br/>\n(the house is a MESS!) and I&#39;m finding it hard to do it with a good<br/>\nattitude.<br/>\n<br/>\n***I suspect that they are not happily leaving things around. You may want<br/>\nto decide whether this a thought that is helpful for you to keep. They are<br/>\njust living their life. They are exploring the world.<br/>\n<br/>\nYou don&#39;t have to clean up everything. There are many ways to respectfully<br/>\nmanage a household. Have you sat down with the kids and let them know how<br/>\noverwhelmed you feel? In an informational way. Then ask for their help in<br/>\nsolving the problem. They may not know how you feel, other than bitchy and<br/>\nlikely they would just stay away from that :-)<br/>\n-=-=-=-=-=-=-=-=-=-=-=--=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI know some say that they didn&#39;t choose to be born or live in this house,<br/>\nbut they did make the mess!! Is it really so wrong for me to ask them to at<br/>\nleast pick up their dirty plates and carry them to the kitchen? Or to put<br/>\naway the bread and spreads when they&#39;ve finished making a sandwich?<br/>\n<br/>\n***It isn&#39;t wrong to ask. In fact asking for help is a good way to get help.<br/>\nYou can talk about what your needs are and work together to find ways for<br/>\neveryone to feel happy. Asking means accepting all answers. It also means<br/>\nthat help may not always look like what you think. But generally it all<br/>\nworks out.<br/>\n<br/>\nThe other day I wanted help with the kitchen and I asked my 12dd. I said,<br/>\n:&quot;I am feeling overwhelmed by the kitchen and the baby is wanting me to hold<br/>\nher constantly right now. What would you be willing to do to help me?&quot; She<br/>\ncame up with several solutions and we worked it out. We had dishes to eat<br/>\noff again!<br/>\n<br/>\nThere is no reason that eating has to be done everywhere in the house. I<br/>\nfind that when i am sick I ask for all eating to be done in the kitchen of<br/>\ndining room. This consolidates the mess.<br/>\n-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI WANT to model generosity and serving them, but right now I&#39;m beginning to<br/>\nthink the end result just might be kids who just sit back and expect others<br/>\nto do it all for them.<br/>\n<br/>\n***There is no &quot;end result&quot; people are a work in progress :-)<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-<br/>\n<br/>\nThey quite happily eat their snack or their dinner, then put headphones on<br/>\nand watch a movie straight afterwards, or whatever. It just feels really<br/>\nunfair to me, to be standing in the kitchen late at night, surrounded by<br/>\ncockroach-attracting mess, watching the kids play the xbox or watch TV,<br/>\nwhile I do all the cleaning up, having already cooked the meal etc.<br/>\n<br/>\nI&#39;m really keen to have people help me think this through. I&#39;m not feeling<br/>\nrespected or appreciated at all, and I&#39;m trying to continue to respect them,<br/>\nbut I don&#39;t want to model that it&#39;s ok to be treated badly.<br/>\n<br/>\n***It sounds like they live a rich and full life. They likely are feeling<br/>\nlike there is much to do and their priorities are different from yours.  If<br/>\nyou need help after dinner ask for it.<br/>\n I generally cook and then either my partner cleans up after dinner or one<br/>\nof the kids. That gives me space to unwind after a busy day. This came out<br/>\nof a conversation I had with them about feeling stressed after dinner and<br/>\ntrying different things. At first I just didn&#39;t clean up. BUt that didn&#39;t<br/>\nwork any better because I felt overwhelmed in the morning. Then I tried to<br/>\nwait until after the kids went to bed but that didn&#39;t work. I likely tried a<br/>\nfew more things that didn&#39;t work. Then I came tot he family and expressed my<br/>\nproblem and asked for help solving it.<br/>\n<br/>\nI hope that helps a little,<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ******<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238781668","msgId":39282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNWl0NCs3YW02QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwOGEwMWM5YjQxZiQ1NjIzMjcyMCQ4MzAwYThjMEByZWR3aW5lPg=="},"prevInTopic":39281,"nextInTopic":39283,"prevInTime":39281,"nextInTime":39283,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... Are you implying that if your children don t do these chores they are walking over you?  Could it be that they are busy doing other things that are","messageBody":"<div id=\"ygrps-yiv-1612506493\"><blockquote><span title=\"ireply\">&gt; As the saying goes, nobody walks over you unless you lie down first.<br/>\n&gt; :-)<br/>\n<br/>\n </span></blockquote>Are you implying that if your children don&#39;t do these chores they are walking over you?  Could it be that they are busy doing other things that are important to them?  In general it&#39;s not important to children that the house stay clean and the chores get done.  It&#39;s not the focus of their lives.  That tends to be the focus of an adult life.  However, I try not to make it the focus of mine either.  :-)</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238781151","msgId":39281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNWljditkZDJnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZlNzk0ZWQ2MDkwNDAyMjAyOXc1MDJiODQyY3ViYzg4OTQ1MzBlZWMwNjJlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39279,"nextInTopic":39282,"prevInTime":39280,"nextInTime":39282,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... ******So, each family member voted yes on every rule?  What happens if someone votes no?  How is declaring your mess your problem helpful in creating a","messageBody":"<div id=\"ygrps-yiv-1962113670\"><blockquote><span title=\"ireply\">&gt; We run our family in a democratic fashion.  We have very few rules - ten rules, in fact.  One of which is when you make a mess,  you clean it up. Another of which is not to disturb another family member&#39;s right to exist peacefully. All of the rules are rules that every family member has had a chance to vote on and has agreed to.<br/>\n<br/>\n </span></blockquote>******So, each family member voted yes on every rule?  What happens if someone votes no?  How is declaring &#39;your mess your problem&#39; helpful in creating a peaceful atmosphere?  When my family members make a mess and it bothers me, I pick it up.  I might ask them to pick it up, and they might pick it up, but more often than not I do it.  Without complaint or blame.  <br/>\n=====================================================================<br/>\n<br/>\n<br/>\n When someone does not clean up their own mess, any family member can &quot;write&quot; them up and we have a family meeting over dinner to discuss the offense. The rules apply to everyone, so if I leave a mess, someone can write me up too.  Once we discuss the issue, take a plea, and vote guilty/not guilty, then we discuss a sentence.  The sentence is usually just helping out around the house or what not and almost always suggested by the individual who was written up.   Again, everyone in the family discusses and votes on everything.   Most of the time, we don&#39;t even apply a sentence, we just let the individual off with a warning.<br/>\n<br/>\n******You have a family meeting at dinner when someone doesn&#39;t clean up after themselves?  Do they get to vote on the family meeting?  Can they skip the meeting or dinner?  I&#39;m just trying to get a sense of what this is like.  If I tried this in my home, my children would be terribly resentful of the person who didn&#39;t pick up, because then they would have to listen to another family meeting.  They would probably also come to resent dinner, because of the negative tone of the &quot;family meeting&quot; or write-ups.<br/>\n<br/>\nWhy is it an &quot;offense&quot; to not pick up your stuff?  I don&#39;t always pick up my stuff.  No one calls me out on an &quot;offense&quot;. <br/>\n<br/>\nA sentence is a punishment.  You should probably just call it what it is.  Punishments are damaging to healthy relationships.<br/>\n=====================================================================<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This system works great for us.  <br/>\n<br/>\n </span></blockquote>******Are you SURE about that?<br/>\n======================================================================<br/>\n<br/>\nIt allows all of us to respect each other and treats us all as equal family partners.  Even I have been written up and sentenced for extreme rudeness and drama. :p  More than once, even.<br/>\n<br/>\n******I can&#39;t see how this is respectful living at all.  Why do you write each other up?  Do you live in a public school or a police station?  Seems to me like the only equality here is that you all get your turn in being shamed at the dinner table.<br/>\n<br/>\nAnd speaking of equality.  Did it occur to you people are not all created equal?  For example, In my house my children enjoy different things.  Simple example, one does not enjoy feeding the animals so if I ask and he says no, either I or my other child will take care of them.  Neither child is expected to feed the animals, ever.  <br/>\n=====================================================================<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n&gt; I don&#39;t know if this will help you at all or not.  Perhaps just discussing<br/>\n&gt; your feelings with your family, in a non blaming <br/>\n<br/>\n </span></blockquote>*****you should take your own advice.  Write-ups and sentences are very blaming.  Blaming isn&#39;t helpful.  <br/>\n=====================================================================</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238779287","msgId":39279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNWdpbit1NHQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZlNzk0ZWQ2MDkwNDAyMjAyOXc1MDJiODQyY3ViYzg4OTQ1MzBlZWMwNjJlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39276,"nextInTopic":39281,"prevInTime":39278,"nextInTime":39280,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"~~One of which is when you make a mess, you clean it up.~~ This is a great way to foster cooperation? I think helping each other clean up messes brings about","messageBody":"<div id=\"ygrps-yiv-1569311826\">~~One of which is when you make a mess, you clean it up.~~<br/>\n<br/>\nThis is a great way to foster cooperation? I think helping each other clean up messes brings about MUCH gentler, kinder feelings towards each other. That whole &quot;make a mess, you clean it up&quot; only makes people place blame on each other and want to avoid helping anyone else.<br/>\n<br/>\nAs far as being &quot;written up&quot;, yikes. That&#39;s sure a lot like school. I don&#39;t want to be written up by anyone, for choosing to leave mess which is completely my right, in my own house. Same for everyone here. We all live here and not wanting to clean up right at the moment is not some punishable crime. I can&#39;t imagine having a meeting to discuss &quot;sentencing&quot;, rather than just spending my energy helping the person who might not feel like cleaning up.<br/>\n<br/>\nMy view is that I have X amount of energy. I can choose to use that energy for harm or for good. Choosing to clean up for someone or do a kindness actually takes a LOT less energy than finding the offender, calling a meeting and doling out punishments together. Wow! That must be exhausting. Much easier to just work together, fostering good feelings about our household tasks and being partners with our children.<br/>\n<br/>\nI highly recommend &quot;Punished by Rewards&quot; for an eye-opening look at the damage that punishments and rewards create. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238768415","msgId":39272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNTV1dit2OXR1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIwMTAwMDlFLTA2RkYtNDA2RC1CNzA1LUIzNkNDRkI1MUU0OEB2ZXJpem9uLm5ldD4="},"prevInTopic":39271,"nextInTopic":39274,"prevInTime":39271,"nextInTime":39273,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"Some really helpful things in this post.  thank you! ... *** One of the things I want to avoid is having the children end up with an attitude that says, I","messageBody":"<div id=\"ygrps-yiv-1770210669\">Some really helpful things in this post.  thank you!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<br/>\n&gt; Talk to them about it! Make them part of the solution rather than the  <br/>\n&gt; problem. Present the basic problem: that you&#39;re getting overwhelmed  <br/>\n&gt; by the task of keeping the house running. Look at several problem  <br/>\n&gt; areas, not just the parts they&#39;re contributing to. I think it&#39;s too  <br/>\n&gt; easy to focus on the burden they&#39;re adding so the only solution seems  <br/>\n&gt; for them to change. But they might have useful ideas for you, like a  <br/>\n&gt; pizza night so you don&#39;t have to cook, or a don&#39;t change clothes day  <br/>\n&gt; so it cuts don&#39;t laundry by 1/7 ;-) People like to feel useful :-)<br/>\n&gt; <br/>\n*** This is brilliant! I need to remember that it&#39;s more authentic and respectful of me to sit down and chat with them about the problem at hand, than to do it myself whilst huffing and puffing around hinting that they should come and help me!<br/>\n<br/>\n&gt; Let them know basic courtesy expectations. They aren&#39;t &quot;happily&quot;  <br/>\n&gt; leaving messes for you. They&#39;re blissfully ignorantly taking off when  <br/>\n&gt; they&#39;ve completed their task. Let them know it would be a big help if  <br/>\n&gt; they could clean up what they&#39;ve taken out to make snacks with.  <br/>\n&gt; Expect to remind them. They aren&#39;t looking at the mess and thinking  <br/>\n&gt; Mom will get that. They&#39;re thinking about what they&#39;re hurrying off to.<br/>\n&gt;<br/>\n*** I think you&#39;re right.  As I said, I do get the fact that they usually don&#39;t notice or care too much, but this helps me to understand (in part) &quot;why&quot;!  <br/>\n <br/>\n&gt; You could set a new policy of eating only in the kitchen unless  <br/>\n&gt; people can remember to bring their dishes back. Do expect to remind  <br/>\n&gt; them of the policy.<br/>\n&gt; <br/>\n*** In what way would this be different to a rule?<br/>\n<br/>\n&gt; In a family where the dynamic is &quot;everyone pitches in,&quot; you could  <br/>\n&gt; even turn their laundry over to them. If the kids aren&#39;t used to  <br/>\n&gt; seeing themselves as integral parts of the process, that probably  <br/>\n&gt; won&#39;t be greeted well. ;-) My mother never involved me in housework,  <br/>\n&gt; never invited me along to help. It was all hers. If she&#39;d suddenly  <br/>\n&gt; thrown up her arms and said I had to do my own laundry I would have  <br/>\n&gt; been &quot;What??&quot; ;-)<br/>\n&gt; <br/>\n*** One of the things I want to avoid is having the children end up with an attitude that says, &quot;I don&#39;t have to pick THAT up because so and so left it there, not me&quot;, because they&#39;re always been asked to pick up THEIR stuff.  I wonder if it can breed a feeling of, &quot;Well, I didn&#39;t use THAT teaspoon, so someone else has to come get THAT!&quot;  I want to model generosity and being a blessing.  I&#39;m just worried that if I keep reminding them to bring their stuff to the kitchen when they&#39;re done with it, they&#39;ll end up doing &quot;their bit&quot; but certainly no one else&#39;s.  Does that make sense?<br/>\n<br/>\nThanks to everyone for helping me think this through!<br/>\n<br/>\nKaryn </span></blockquote></div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238767935","msgId":39276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNTVmdis4NDFuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRTMwQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39275,"nextInTopic":39279,"prevInTime":39275,"nextInTime":39277,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... I like that idea.  Leaving dishes rinsing in the sink is a step ahead on the next day s clean-up.  My DH has made it clear to me that one thing he really","messageBody":"<div id=\"ygrps-yiv-762412708\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; &lt;debra.rossing@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; We&#39;ve<br/>\n&gt; also made for easy picking up as much as possible - can your kids toss<br/>\n&gt; toys into a bin in the living room or do they have to carry their stuff<br/>\n&gt; back to another room every time they want to switch playthings? Is there<br/>\n&gt; an accessible trash can in the play space that trash can go in without a<br/>\n&gt; big disruption on their activity? <br/>\n<br/>\n </span></blockquote>*** Ah, I&#39;m looking around me right now and I&#39;ll tell you what I see in our family room (everyone else is in bed): bags of groceries not unpacked, piles of junk waiting to be sorted, piles of paperwork waiting to be sorted, dinner dishes everywhere which means all the kitchen benches are covered with dirty dishes etc, leaving no room at all to make breakfast in the morning, dirty dishes on the coffee table, the esky waiting to be unpacked from our trip to visit friends today, a few pairs of shoes lying around, a few toys on the floor, a huge pile of clean unfolded washing, etc.  I love the idea of baskets in the living area for different people&#39;s stuff, or just storage baskets for different bits & pieces (I do this) but I&#39;m finding the stuff left lying around is stuff waiting to be done (eg. groceries away, dishes washed, or rinsed/stacked in dishwasher etc.  I just feel like it&#39;s a lot for me to do by myself, especially when I&#39;m wanting time to do things with the kids, and time to do my own internet or book reading on unschooling (essential for getting my head around it!).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you walk around the<br/>\n&gt; house once before you relax for the evening with a dishpan and pick up<br/>\n&gt; all the dishes and take them to soak in the sink overnight - they&#39;re<br/>\n&gt; collected, de-crusting, out of reach of icky things - then do them in<br/>\n&gt; the morning? <br/>\n<br/>\n </span></blockquote>I like that idea.  Leaving dishes rinsing in the sink is a step ahead on the next day&#39;s clean-up.  My DH has made it clear to me that one thing he really appreciates is the servery bench in the kitchen being kept clean, so he can make his breakfast or lunch, especially on the days he leaves for work early.  I do try to honour that request.<br/>\n<br/>\nThat&#39;s just an example of taking things in small pieces -<br/>\n<blockquote><span title=\"ireply\"> &gt; tidy in 15 minute increments - 15 minutes clearing the kitchen table, 45<br/>\n&gt; minutes connecting with the kids, 15 minutes organizing the counter<br/>\n&gt; tops, 45 minutes connecting with the kids. <br/>\n<br/>\n </span></blockquote>*** What about all the other things such as my own reading/research about unschooling etc, ringing a friend or family member, etc.  I&#39;m sure everyone wishes the world could stop for an hour or so a day, while they caught up or got a head start?  I know I do LOL!<br/>\n<br/>\nThe thing with that is that<br/>\n<blockquote><span title=\"ireply\"> &gt; if you&#39;ve just spent 45 minutes engaged with them while they&#39;re watching<br/>\n&gt; a favorite program and then you say &quot;Well, now that this show is over<br/>\n&gt; I&#39;m heading to the kitchen to wash dishes - want to come keep me<br/>\n&gt; company?&quot; you may get a yes (and you still may get a no - are you REALLY<br/>\n&gt; okay with that or is there still a lingering &quot;they should do this<br/>\n&gt; because I&#39;m the mom&quot;? just asking...) When you are connecting with them,<br/>\n&gt; they&#39;re more likely to want to connect with you. If all they see of you<br/>\n&gt; is madly racing around the house cleaning and grumping/sighing, who&#39;d<br/>\n&gt; want to do that? Not me. But, if they MOSTLY see you as interested in<br/>\n&gt; their daily lives, the more likely they&#39;ll be interested in your daily<br/>\n&gt; life.<br/>\n<br/>\n </span></blockquote>***  Oooh, this is interesting stuff!  I think my kids mostly see Mum sitting on the computer making occasional comments on what her kids are doing to try to &quot;connect&quot;, then racing around like an angry, frustrated crazy lady trying to get all the tidying up done (and very ineffectively at that!).  Not a good role model, hey.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As far as feeling &quot;taken advantage of&quot; - those are your feelings. Where<br/>\n&gt; are they coming from? Are you really being &quot;taken advantage of&quot; and what<br/>\n&gt; exactly does that mean? <br/>\n<br/>\n </span></blockquote>*** I think they take advantage of the fact that I&#39;ll clean up their mess, so they don&#39;t have to bother, so why bother?<br/>\n<br/>\nWhere does doing the dishes because you want<br/>\n<blockquote><span title=\"ireply\"> &gt; them clean end and &quot;taken advantage of&quot; begin? Is it even possible for<br/>\n&gt; someone to &quot;take advantage of&quot; you without you accepting it in some way?<br/>\n&gt; What level of &#39;clean&#39; is okay with you and where does that come from?<br/>\n&gt; Did you &#39;choose&#39; that you want the dishes done immediately after every<br/>\n&gt; meal or is that something handed down as &quot;that&#39;s what a GOOD mother<br/>\n&gt; does&quot;?<br/>\n<br/>\n </span></blockquote>*** I think it partly comes from that thought that a &quot;good housewife&quot; will have a reasonably tidy, welcoming home, not one with clutter strewn from one end to the other!  And also from my DH, who REALLY likes a tidy, clean living space.  He finds it hard to relax when there&#39;s lots of clutter lying around, or household jobs that need to be done.  He tries hard to embrace the mess that seems to come with our unschooling lifestyle, but we have on occasion had MASSIVE conflict about the &quot;state of the house&quot;.  So I guess I feel caught between a rock and a hard place, so to speak.  I feel like I &quot;should&quot; clean up so the house looks & functions better, and I don&#39;t think it&#39;s fair that the kids rarely ever help, and yet I see them relaxing and enjoying themselves, and I don&#39;t feel like I have the same freedom to do that.<br/>\n<br/>\nI do like the idea of engaging in what they&#39;re doing first, and then getting up to tidy or clean, and inviting them to join me.  I think it&#39;s in &quot;PLayful Parenting&quot; where the author says &quot;let&#39;s&quot; is one of the most powerful words in the parenting language.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what do you want your kids to talk about when they&#39;re<br/>\n&gt; telling stories to their kids about Grandma? Mom spent all her time<br/>\n&gt; cleaning the house? Mom was always grumpy because the house was messy?<br/>\n&gt; Mom spent most of her time playing videogames with us?  <br/>\n&gt; <br/>\n </span></blockquote>*** Wow, this has really challenged me:  how cool would it be for my kids to say to their friends, &quot;Yeah, Mum loves hanging out with us and playing the xbox with us!&quot;  <br/>\n<br/>\nThanks for all the advice so far!<br/>\nKaryn<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238767588","msgId":39269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAzMDcwNnU0NThmNjA1Nng2NTMxNjJlNTZjNTQ4NGU4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39268,"nextInTopic":39271,"prevInTime":39268,"nextInTime":39270,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"I m really struggling with feeling overwhelmed and taken advantage of in terms of household stuff. I have 4 children ranging in age from 6-15 and we haven t","messageBody":"<div id=\"ygrps-yiv-1385117466\">I&#39;m really struggling with feeling overwhelmed and &quot;taken advantage of&quot; in<br/>\nterms of household stuff. I have 4 children ranging in age from 6-15 and we<br/>\nhaven&#39;t done the &quot;chores&quot; thing for a long time. I initially used the<br/>\nstrategy of a lot of &quot;huffing and puffing&quot; to try to make sure they realised<br/>\nI was the poor person having to do all the work and it wasn&#39;t fair.......<br/>\nlol. I&#39;ve fortunately moved on a lot since then and have been trying to<br/>\nembrace the fact that if I joyfully do the household tasks, and ask for<br/>\ntheir help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll<br/>\nevenutally have a good attitude to household jobs and willingly help out.<br/>\n<br/>\n***I am happy to hear your willingness to change attitudes and garner a new<br/>\nperspective. It sounds like you are still working on that.<br/>\n<br/>\nI find it helpful to disattach from any expectations that my children will<br/>\neventually have any attitude. I try to remember to just be where we are and<br/>\nwho we are right now. They may never have a good attitude about cleaning,<br/>\nthey may choose to have a maid when they are older. who knows? What you are<br/>\nconcerned about it right now.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nBut! I feel quite resentful of the fact that they happily leave their dirty<br/>\nplates etc lying wherever they used them, leave empty food packets lying<br/>\naround the house, leave clothes all over the floor etc, and just don&#39;t seem<br/>\nto notice or care! I get the fact that kids often really don&#39;t care or<br/>\nnotice, but the reality is that I&#39;m doing the work of cleaning up EVERYONE&#39;S<br/>\nstuff and it&#39;s a lot of work! I&#39;m finding it hard to stay on top of it all<br/>\n(the house is a MESS!) and I&#39;m finding it hard to do it with a good<br/>\nattitude.<br/>\n<br/>\n***I suspect that they are not happily leaving things around. You may want<br/>\nto decide whether this a thought that is helpful for you to keep. They are<br/>\njust living their life. They are exploring the world.<br/>\n<br/>\nYou don&#39;t have to clean up everything. There are many ways to respectfully<br/>\nmanage a household. Have you sat down with the kids and let them know how<br/>\noverwhelmed you feel? In an informational way. Then ask for their help in<br/>\nsolving the problem. They may not know how you feel, other than bitchy and<br/>\nlikely they would just stay away from that :-)<br/>\n-=-=-=-=-=-=-=-=-=-=-=--=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI know some say that they didn&#39;t choose to be born or live in this house,<br/>\nbut they did make the mess!! Is it really so wrong for me to ask them to at<br/>\nleast pick up their dirty plates and carry them to the kitchen? Or to put<br/>\naway the bread and spreads when they&#39;ve finished making a sandwich?<br/>\n<br/>\n***It isn&#39;t wrong to ask. In fact asking for help is a good way to get help.<br/>\nYou can talk about what your needs are and work together to find ways for<br/>\neveryone to feel happy. Asking means accepting all answers. It also means<br/>\nthat help may not always look like what you think. But generally it all<br/>\nworks out.<br/>\n<br/>\nThe other day I wanted help with the kitchen and I asked my 12dd. I said,<br/>\n:&quot;I am feeling overwhelmed by the kitchen and the baby is wanting me to hold<br/>\nher constantly right now. What would you be willing to do to help me?&quot; She<br/>\ncame up with several solutions and we worked it out. We had dishes to eat<br/>\noff again!<br/>\n<br/>\nThere is no reason that eating has to be done everywhere in the house. I<br/>\nfind that when i am sick I ask for all eating to be done in the kitchen of<br/>\ndining room. This consolidates the mess.<br/>\n-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI WANT to model generosity and serving them, but right now I&#39;m beginning to<br/>\nthink the end result just might be kids who just sit back and expect others<br/>\nto do it all for them.<br/>\n<br/>\n***There is no &quot;end result&quot; people are a work in progress :-) I like to keep<br/>\nin mind that my children are their own person with their own lives to<br/>\nunfurl. I want to give them the tools to happily navigate the world and as<br/>\nlittle baggage as possible. I want to continue our close respectful<br/>\nrelationship and live with those thoughts in mind.<br/>\n<br/>\nWe almost lost our dog recent (we still might) and it really brought up some<br/>\nstuff for me. I am grateful to have him around making messes for me to clean<br/>\nup as long as he is healthy enough to keep living. I can apply that to my<br/>\nkids. I am grateful that they are healthy and alive and wanting to learn and<br/>\nexplore. In doing these things there is mess, life is messy. I LOVE that I<br/>\ncan clean up after their exploration. I might not always love the cleaning<br/>\nbut I can love creating a clean palate for them.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-<br/>\n<br/>\nThey quite happily eat their snack or their dinner, then put headphones on<br/>\nand watch a movie straight afterwards, or whatever. It just feels really<br/>\nunfair to me, to be standing in the kitchen late at night, surrounded by<br/>\ncockroach-attracting mess, watching the kids play the xbox or watch TV,<br/>\nwhile I do all the cleaning up, having already cooked the meal etc.<br/>\n<br/>\n***You can ask for help.<br/>\n<br/>\nHere is a sad story:<br/>\n<br/>\n1) People or life makes demands.<br/>\n2) Mother ignores her negative feelings and complies.<br/>\n3) resentment creeps in.<br/>\n4) resentment comes out (yuck)<br/>\n5) someone gets hurt.<br/>\n6) the whole family suffers.<br/>\n<br/>\nI don&#39;t want to suffer nor do I want my children or partner to suffer. I<br/>\ngrew up with no solid boundaries. This was my childhood. It was painful. I<br/>\nhave learned to talk about my feelings. I let people know *before* I feel<br/>\nresentful. You can get there too.<br/>\n<br/>\nAll your kids are old enough to listen to your needs and respond. I think<br/>\nthat they don&#39;t want you to feel miserable. I would think that they don&#39;t<br/>\nwant to suffer. I think they would want to help create a home where everyone<br/>\nfeels safe, comfortable;e and respected.<br/>\n<br/>\nI found it helpful to write out out principles. I am a very visual person. I<br/>\ncreated a list of principles and then brought them to my family. We had a<br/>\ngreat discussion and we added a few other principles that we felt we<br/>\nimportant. It helpd us when we feel resentful or confused and we aren&#39;t sure<br/>\nwhy.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI&#39;m really keen to have people help me think this through. I&#39;m not feeling<br/>\nrespected or appreciated at all, and I&#39;m trying to continue to respect them,<br/>\nbut I don&#39;t want to model that it&#39;s ok to be treated badly.<br/>\n<br/>\n***Own that it is *your* feelings. Your children might not even know that<br/>\nyou feel this way (and no bitching and grumpy doesn&#39;t really let people<br/>\nknow) :-)<br/>\n<br/>\nGive them the benefit or doubt that they are unaware that they are treating<br/>\nyou badly or that they are unskilled and knowing how to treat you in the way<br/>\nyou want. Guide them towards your family goal.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238767519","msgId":39275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNTUyditwbm1uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39274,"nextInTopic":39276,"prevInTime":39274,"nextInTime":39276,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"Karyn - I am new to un-schooling and so all of this is fresh for me too.  I have woven two strategies together for this issue. One - I clean when I want to.","messageBody":"<div id=\"ygrps-yiv-1358580993\">Karyn - <br/>\n<br/>\nI am new to un-schooling and so all of this is fresh for me too.  I have woven two strategies together for this issue.<br/>\n<br/>\nOne - I clean when I want to.  I&#39;ve gently dismissed the inner voice that scolds me when I don&#39;t clean or worries about bugs and mice or fears judgment from others.  If I am not feeling cheerful when I think about cleaning, I cheerfully do something else to entertain myself or be with the kids.  <br/>\n<br/>\nTwo - I ask for their help using the Non-Violent Communication model.  <br/>\n<br/>\nI recently read &quot;Non-Violent Communication&quot; by Marshall Rosenberg, recommended to me by a more experienced un-schooling parent.  <br/>\n<br/>\nWithout any expectations on my part, I share my observation, feelings, needs, and wants.  Using an example from the book, here&#39;s what I might say, &quot;Peter, I see two of your dirty socks next to the sofa and three over by the TV. (that&#39;s the observation part)  I feel agitated when I see dirty clothes in the living room (the feeling part) because I need for our common spaces to be clear of clutter (the need).  Would you be willing to put these socks into your bedroom or the hamper today? (the want).&quot;  <br/>\n<br/>\nI&#39;m okay with a &quot;no&quot; from him.  If he says &quot;no&quot; I do not respond with a growl or snarl or stomping over to the socks to pick them up myself with anger because that would be manipulative.  <br/>\n<br/>\nAnd, if I get a &quot;no&quot; it is okay for me to ask again at some point, open to any answer he offers.  And, it is okay for me to cheerfully pick up the socks when I want the common space clean. <br/>\n<br/>\nIt is actually fun to see him help, later on, when the time is right for him.  And, it is fun to model cleaning up cheerfully after sooooo many years of cleaning up in anger!!!  <br/>\n<br/>\nThose are my two cents!<br/>\n<br/>\nGood luck.<br/>\n<br/>\nLove,<br/>\n<br/>\nElli</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238763329","msgId":39268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRTMwQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39266,"nextInTopic":39269,"prevInTime":39267,"nextInTime":39269,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... dirty plates and carry them to the kitchen? Or to put away the bread and spreads when they ve finished making a sandwich? No it s not wrong to ask for","messageBody":"<div id=\"ygrps-yiv-62363624\"><blockquote><span title=\"ireply\">&gt; Is it &gt; really so wrong for me to ask them to at least pick up their&gt;\r<br/>\n </span></blockquote>dirty plates and carry them to the kitchen? Or to put away&gt; the bread\r<br/>\nand spreads when they&#39;ve finished making a&gt; sandwich?\r<br/>\n\r<br/>\nNo it&#39;s not &quot;wrong&quot; to ask for help when you need help. They may\r<br/>\n(probably, likely do) need a short reminder now and again - quick like\r<br/>\n&quot;mayo in fridge please&quot; Consider: when you&#39;ve got something specific and\r<br/>\nmaybe time sensitive coming up as the very next thing in your day,\r<br/>\naren&#39;t you less likely to remember to pick up after yourself? I know\r<br/>\nthat I do - if I&#39;ve got to get to the grocery store and then get the\r<br/>\nbills paid, I might likely not clear up my dinner dishes or put the\r<br/>\ncondiments away. Fortunately, my hubby often picks up the slack (Unless\r<br/>\nhe&#39;s got something on his agenda at the same time). We&#39;ve never done\r<br/>\n&#39;chores&#39; with our nearly 11 yr old DS but we do often ask for his\r<br/>\nassistance or provide a quick reminder - when he finishes with a bowl of\r<br/>\npopcorn &quot;sink please&quot; - with the understanding that that can wait until\r<br/>\na break in the action (whether that&#39;s a chapter end in a book, a\r<br/>\ncommercial, the end of a movie, a pause place in a videogame). We&#39;ve\r<br/>\nalso made for easy picking up as much as possible - can your kids toss\r<br/>\ntoys into a bin in the living room or do they have to carry their stuff\r<br/>\nback to another room every time they want to switch playthings? Is there\r<br/>\nan accessible trash can in the play space that trash can go in without a\r<br/>\nbig disruption on their activity? The closest we ever came to &#39;chores&#39;\r<br/>\nwas doing a quick tidy time a la Big Comfy Couch (they&#39;d speed up the\r<br/>\nfilm action so that all the toys and such got tidied really fast, looked\r<br/>\nsilly/funny - we&#39;d do the same, try to get the living room picked up\r<br/>\nreally fast/silly BUT that meant that we had to have easy access bins\r<br/>\nright there not in another part of the house). Can you walk around the\r<br/>\nhouse once before you relax for the evening with a dishpan and pick up\r<br/>\nall the dishes and take them to soak in the sink overnight - they&#39;re\r<br/>\ncollected, de-crusting, out of reach of icky things - then do them in\r<br/>\nthe morning? That&#39;s just an example of taking things in small pieces -\r<br/>\ntidy in 15 minute increments - 15 minutes clearing the kitchen table, 45\r<br/>\nminutes connecting with the kids, 15 minutes organizing the counter\r<br/>\ntops, 45 minutes connecting with the kids. The thing with that is that\r<br/>\nif you&#39;ve just spent 45 minutes engaged with them while they&#39;re watching\r<br/>\na favorite program and then you say &quot;Well, now that this show is over\r<br/>\nI&#39;m heading to the kitchen to wash dishes - want to come keep me\r<br/>\ncompany?&quot; you may get a yes (and you still may get a no - are you REALLY\r<br/>\nokay with that or is there still a lingering &quot;they should do this\r<br/>\nbecause I&#39;m the mom&quot;? just asking...) When you are connecting with them,\r<br/>\nthey&#39;re more likely to want to connect with you. If all they see of you\r<br/>\nis madly racing around the house cleaning and grumping/sighing, who&#39;d\r<br/>\nwant to do that? Not me. But, if they MOSTLY see you as interested in\r<br/>\ntheir daily lives, the more likely they&#39;ll be interested in your daily\r<br/>\nlife.\r<br/>\n\r<br/>\nAnother idea: the connections between A and B are not always as clear to\r<br/>\nkids as they might seem to you. That is, they might not recognize that\r<br/>\nthey can&#39;t find those teensie Barbie shoes today because they left them\r<br/>\nin the living room 3 days ago. So, verbalize as you pick up &quot;Let&#39;s get\r<br/>\nthese Barbie shoes back in the Barbie bin so that you can find them next\r<br/>\ntime&quot; Enlist their assistance BUT time it for commercials, etc natural\r<br/>\nbreaks in the action. We have a habit of doing &quot;commercial tidying&quot; - we\r<br/>\nwait for commercials, tidy for the length of the commercial break, then\r<br/>\nback to what we were doing. Little short bits, repeated enough, get\r<br/>\nthings done and even become habits. Also, somehow, in the process of\r<br/>\ntaking a commercial break to pick up the mugs from the cocoa that we all\r<br/>\nhad while watching a program, DS has picked up that habit - if it\r<br/>\nappears we&#39;re all done and he&#39;s getting up anyhow, he&#39;ll collect the\r<br/>\nmugs. And, we thank him - not effusively or as a &quot;reward&quot; or whatever,\r<br/>\nbut the same &quot;Thanks&quot; that I&#39;d give DH or a friend if they did the same.\r<br/>\n\r<br/>\n\r<br/>\nOh, that&#39;s something - is showing appreciation (real, specific, honest)\r<br/>\na habit in your household, even between adults? I&#39;ll thank DH for\r<br/>\ngetting the dishes done before I get home with the groceries so that the\r<br/>\ncounter space is clear. Yeah, he&#39;s a grown up and &quot;should&quot; do that, but\r<br/>\nit makes things easier for me, so I let him know that I appreciate it.\r<br/>\nLikewise, I might stop at the library while I&#39;m running errands to\r<br/>\nreturn his books and pick up one I know he&#39;s been meaning to get. He\r<br/>\n&quot;could&quot; do it himself, he&#39;s an adult, but he&#39;ll say Thanks because I\r<br/>\ntook care of it for him. When DS takes my tea mug to the kitchen, I&#39;ll\r<br/>\nsay Thanks just as I would if DH did it. Small bits of honest\r<br/>\nappreciation go a long way. In many households, I know that doing what&#39;s\r<br/>\n&quot;expected&quot; doesn&#39;t get any word of thanks or appreciation - &quot;s/he should\r<br/>\ndo that, s/he&#39;s a grownup/old enough, why should I thank someone for\r<br/>\ndoing what they should do?&quot;\r<br/>\n\r<br/>\nAs far as feeling &quot;taken advantage of&quot; - those are your feelings. Where\r<br/>\nare they coming from? Are you really being &quot;taken advantage of&quot; and what\r<br/>\nexactly does that mean? Where does doing the dishes because you want\r<br/>\nthem clean end and &quot;taken advantage of&quot; begin? Is it even possible for\r<br/>\nsomeone to &quot;take advantage of&quot; you without you accepting it in some way?\r<br/>\nWhat level of &#39;clean&#39; is okay with you and where does that come from?\r<br/>\nDid you &#39;choose&#39; that you want the dishes done immediately after every\r<br/>\nmeal or is that something handed down as &quot;that&#39;s what a GOOD mother\r<br/>\ndoes&quot;? My mom (a person who loves clean and orderly but who had 3 kids\r<br/>\nand a heart condition) &#39;borrowed&#39; an idea from Erma Bombeck: what do you\r<br/>\nwant as your epitaph &#39;she always had a clean house&#39; or &#39;she always had\r<br/>\ntime for family&#39;...what do you want your kids to talk about when they&#39;re\r<br/>\ntelling stories to their kids about Grandma? Mom spent all her time\r<br/>\ncleaning the house? Mom was always grumpy because the house was messy?\r<br/>\nMom spent most of her time playing videogames with us?  \r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238761850","msgId":39266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNHZocStiNjc3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyNHIxdCtoYXZhQGVHcm91cHMuY29tPg=="},"prevInTopic":39265,"nextInTopic":39268,"prevInTime":39265,"nextInTime":39267,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"Our latest addition is a basket for each bedroom that we keep in the living room. When cleaning up I throw things into them that belong in their rooms and the","messageBody":"<div id=\"ygrps-yiv-1408061818\">Our latest addition is a basket for each bedroom that we keep in the living room.  <br/>\nWhen cleaning up I throw things into them that belong in their rooms and the kids take them up and either dump them out or put them away.  Their choice.</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238761523","msgId":39265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNHY3aitscWo5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIwMTAwMDlFLTA2RkYtNDA2RC1CNzA1LUIzNkNDRkI1MUU0OEB2ZXJpem9uLm5ldD4="},"prevInTopic":39264,"nextInTopic":39266,"prevInTime":39264,"nextInTime":39266,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"or a don t change clothes day ... My 6 year old has done this.  Has helped me alot :) He changes when I can talk him into showering, which I manage about once","messageBody":"<div id=\"ygrps-yiv-1225723225\">or a don&#39;t change clothes day  <br/>\n<blockquote><span title=\"ireply\"> &gt; so it cuts don&#39;t laundry by 1/7 ;-)<br/>\n<br/>\n </span></blockquote>My 6 year old has done this.  Has helped me alot :) He changes when I can talk him into showering, which I manage about once a week.</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238757245","msgId":39264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNHIxdCtoYXZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39263,"nextInTopic":39265,"prevInTime":39263,"nextInTime":39265,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... I ve fortunately moved on a lot since then and have been trying to embrace the fact that if I joyfully do the household tasks, and ask for their help from","messageBody":"<div id=\"ygrps-yiv-331257823\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen&quot; &lt;gktbdm@...&gt; wrote:<br/>\n<br/>\n I&#39;ve fortunately moved on a lot since then and have been trying to embrace the fact that if I joyfully do the household tasks, and ask for their help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll evenutally have a good attitude to household jobs and willingly help out.<br/>\n<br/>\n******<br/>\nI used to remind myself of this too.  However, I quickly learned I need to drop that expectation that they will have good attitudes and willingly help out.  My 3 boys (OK one is 9 months old LOL) rarely help out.  I ask quite a bit and they say no an awful lot.  Here is how we have changed though.  When I ask, I ask in no different a way than I would ask them to play a game or go for a walk.  When they so no, it isn&#39;t about me or the &quot;chores&quot; its generally about what they are doing right then that they don&#39;t want to stop.  They are super active and busy children.  I wouldn&#39;t expect that they would drop what they are doing and help me clean.  I think they will as they grow.  Right now they are small and focused on other things. <br/>\n******<br/>\n<br/>\n<br/>\n<br/>\nBut!  I feel quite resentful of the fact that they happily leave their dirty plates etc lying wherever they used them, leave empty food packets lying around the house, leave clothes all over the floor etc, and just don&#39;t seem to notice or care!  <br/>\n<br/>\n******<br/>\nNope they don&#39;t!  LOL  Isn&#39;t it wonderful to watch such a carefree individual?  I can only wish I was able to experience that when I was a child.  I used to have a chores list so long that I rarely was able to complete them in one day.  Sometimes, I get a little overwhelmed by the mess.  But mostly, I see that mess and think &quot;Wow, my children must be having fun today!&quot;  <br/>\n<br/>\nI am a terribly unorganized person to begin with so the mess here can become daunting.  (Funny that I felt like a glorified slave as a child and now I&#39;m horribly messy.  LOL)  I am slowly learning to have a routine, dishes in the morning, laundry when I&#39;m in the bathroom, and I pick up toys as I walk around the house.<br/>\n******<br/>\n<br/>\n<br/>\nI get the fact that kids often really don&#39;t care or notice, but the reality is that I&#39;m doing the work of cleaning up EVERYONE&#39;S stuff and it&#39;s a lot of work!  I&#39;m finding it hard to stay on top of it all (the house is a MESS!) and I&#39;m finding it hard to do it with a good attitude.<br/>\n<br/>\n******<br/>\nWhat do you want you children to see you doing?  Cleaning joyfully or or cleaning while griping and complaining?  That&#39;s what I remind myself of when I start to feel overwhelmed.  I also clean faster if I&#39;m in a good mood!  There are lots of solutions to help your messy house.  My house is full full of bins.  Storage bins can be put anywhere and used for almost anything.  We have a lego bin, heroscape bin, power ranger bin, etc.  for smaller things we have a shelf with those shoe box size bins for blocks and markers and puzzles.  The shelf was built by my stepfather some years ago via free internet plans.  It&#39;s awesome.  Some people also throw clothes into bins to avoid folding.  I&#39;m seriously considering this one!<br/>\n<br/>\nMy two oldest kids also decided to share a bedroom and use the larger of the two as a playroom.  that has helped wonders!!!  Their bedroom is always clean and comfortable.  The playroom is a different story, but with all the toy bins, picking up is easy.  <br/>\n******<br/>\n<br/>\n<br/>\n<br/>\nThey quite happily eat their snack or their dinner, then put headphones on and watch a movie straight afterwards, or whatever.  It just feels really unfair to me, to be standing in the kitchen late at night, surrounded by cockroach-attracting mess, watching the kids play the xbox or watch TV, while I do all the cleaning up, having already cooked the meal etc.<br/>\n<br/>\n******<br/>\nThink of ways you can make this easier on yourself.  Can your husband help?  Can you use paper plates?  Can you move the trash closer to the children?  Can you cook larger meals and reheat?  <br/>\n******<br/>\n<br/>\n<br/>\nHope that helps.<br/>\n<br/>\n-Heather </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238754218","msgId":39263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMTAwMDlFLTA2RkYtNDA2RC1CNzA1LUIzNkNDRkI1MUU0OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39262,"nextInTopic":39264,"prevInTime":39262,"nextInTime":39264,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... Since you ve accepted the responsibility, you do get to set the parameters. Eating out of the kitchen isn t a right, it s a privilege. Since you re the one","messageBody":"<div id=\"ygrps-yiv-1368687791\">On Apr 2, 2009, at 10:42 AM, Karen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but the reality is that I&#39;m doing the work of cleaning up  <br/>\n&gt; EVERYONE&#39;S stuff and it&#39;s a lot of work!<br/>\n<br/>\n </span></blockquote>Since you&#39;ve accepted the responsibility, you do get to set the  <br/>\nparameters. Eating out of the kitchen isn&#39;t a right, it&#39;s a  <br/>\nprivilege. Since you&#39;re the one cleaning up you get to make life  <br/>\neasier on yourself! ;-)<br/>\n<br/>\nTalk to them about it! Make them part of the solution rather than the  <br/>\nproblem. Present the basic problem: that you&#39;re getting overwhelmed  <br/>\nby the task of keeping the house running. Look at several problem  <br/>\nareas, not just the parts they&#39;re contributing to. I think it&#39;s too  <br/>\neasy to focus on the burden they&#39;re adding so the only solution seems  <br/>\nfor them to change. But they might have useful ideas for you, like a  <br/>\npizza night so you don&#39;t have to cook, or a don&#39;t change clothes day  <br/>\nso it cuts don&#39;t laundry by 1/7 ;-) People like to feel useful :-)<br/>\n<br/>\nLet them know basic courtesy expectations. They aren&#39;t &quot;happily&quot;  <br/>\nleaving messes for you. They&#39;re blissfully ignorantly taking off when  <br/>\nthey&#39;ve completed their task. Let them know it would be a big help if  <br/>\nthey could clean up what they&#39;ve taken out to make snacks with.  <br/>\nExpect to remind them. They aren&#39;t looking at the mess and thinking  <br/>\nMom will get that. They&#39;re thinking about what they&#39;re hurrying off to.<br/>\n<br/>\nYou could set a new policy of eating only in the kitchen unless  <br/>\npeople can remember to bring their dishes back. Do expect to remind  <br/>\nthem of the policy.<br/>\n<br/>\nIn a family where the dynamic is &quot;everyone pitches in,&quot; you could  <br/>\neven turn their laundry over to them. If the kids aren&#39;t used to  <br/>\nseeing themselves as integral parts of the process, that probably  <br/>\nwon&#39;t be greeted well. ;-) My mother never involved me in housework,  <br/>\nnever invited me along to help. It was all hers. If she&#39;d suddenly  <br/>\nthrown up her arms and said I had to do my own laundry I would have  <br/>\nbeen &quot;What??&quot; ;-)<br/>\n<br/>\nSo, it will all depend on your family dynamic and personalities and  <br/>\nhow they perceive you might be able to turn their laundry over. Some  <br/>\n6 yos are perfectly capable of that type of think ahead planning.  <br/>\nSome are still working on remembering to go to the bathroom while  <br/>\nthey&#39;re playing video games. ;-) Maybe keep a basket next to the  <br/>\nlaundry for each child where their clothes can go after  the drier.  <br/>\nIf they want to leave them there, fine. If they want them put away,  <br/>\nthey can do that. Use some &quot;think outside the box&quot; solutions.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96745299,"authorName":"Professional Parenting","from":"&quot;Professional Parenting&quot; &lt;jarnall@...&gt;","profile":"oooffca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238737503","msgId":39274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOGEwMWM5YjQxZiQ1NjIzMjcyMCQ4MzAwYThjMEByZWR3aW5lPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39272,"nextInTopic":39275,"prevInTime":39273,"nextInTime":39275,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"I would also feel that the situation would be unfair.  I have a level of expectations that my kids pick up after themselves and I don t deny that I feel","messageBody":"<div id=\"ygrps-yiv-1263556894\">I would also feel that the situation would be unfair.  I have a level of expectations that my kids pick up after themselves and I don&#39;t deny that I feel resentful when they obliviously leave the table after dinner and go back to their games while I spend two hours in the kitchen.  I feel resentful and unappreciated and overwhelmed.  Changing my attitude and reframing things do not help. I&#39;ve tried and the happy feelings just don&#39;t come!  I feel resentful.  Sorry, this is not a popular opinion on this list, but I am authentic to what I feel.  When I tell my family how I feel, the relationship is great enough that they do their share.  Not my work.  Our work.  Their share.  We all have work to be done around the house and it&#39;s a long list.  I printed out this list and laid it on the table and said that I would do a few things.  Who is doing the rest?  We divied it up and no more grumbling.  I think the kids didn&#39;t truly realize how much work it takes to keep the household running (the household, not my household).  <br/>\nAs the saying goes, nobody walks over you unless you lie down first.<br/>\n:-)<br/>\nLake Erie HOUSE JOBS<br/>\n<br/>\nPay bills, balance checkbook, submit health forms <br/>\n<br/>\nCheck receipts to bills<br/>\n<br/>\nWater plants<br/>\n<br/>\nFill school paperwork<br/>\n<br/>\nMow grass<br/>\n<br/>\nShovel walk<br/>\n<br/>\nClean cars<br/>\n<br/>\nFix household items<br/>\n<br/>\nClean bathrooms - four<br/>\n<br/>\nGather garbage from around the house<br/>\n<br/>\nTake garbage out every Friday<br/>\n<br/>\nChange sheets, and pillowcases on 7 beds<br/>\n<br/>\nLaunder sheets and put away<br/>\n<br/>\nLaunder towels and put away<br/>\n<br/>\nPick up clutter in every room and put back into place<br/>\n<br/>\nVacuum kitchen and hall and bathroom floor<br/>\n<br/>\nScrub kitchen and hall and bathroom floor<br/>\n<br/>\nVacuum livingroom, family room and computer room<br/>\n<br/>\nVacuum computers, keyboards, and desks,<br/>\n<br/>\nWipe coffee tables and dust TVs<br/>\n<br/>\nClean bird cages and change water<br/>\n<br/>\nClean fish bowl<br/>\n<br/>\nClean cat litter box<br/>\n<br/>\nClean Skittles cage and change water<br/>\n<br/>\nVacuum bedroom rugs upstairs and hall<br/>\n<br/>\nPut videos back into cases and put in bookcases<br/>\n<br/>\nPut games back into cases<br/>\n<br/>\nPut recycling away daily<br/>\n<br/>\nBring in mail and sort<br/>\n<br/>\nTake in bottles<br/>\n<br/>\nGather recycling into car and take away<br/>\n<br/>\nShop for groceries<br/>\n<br/>\nPut away groceries<br/>\n<br/>\nCook dinner and lunches<br/>\n<br/>\nEmpty dishwasher<br/>\n<br/>\nLoad dishwasher with dishes and soap<br/>\n<br/>\nClean up food, pots and wipe counters<br/>\n<br/>\nShop for household necessities<br/>\n<br/>\nLaunder personal clothes<br/>\n<br/>\nVacuum basement<br/>\n<br/>\nPick up toys in the basement<br/>\n<br/>\nWash windows<br/>\n<br/>\nSweep sidewalks<br/>\n<br/>\nVacuum screens<br/>\n<br/>\nClean fans<br/>\n<br/>\nWash light fixtures of bugs<br/>\n<br/>\nChange light bulbs<br/>\n<br/>\nChange furnace filter<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nJudy Arnall, <br/>\nParenting Speaker, Trainer and Author of the Canadian Bestseller:<br/>\nDiscipline Without Distress: 135 tools for raising caring,<br/>\nResponsible children without time-out, spanking, punishment or bribery <br/>\nwww.professionalparenting.ca <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://bureau.espeakers.com/caps/speaker.php?sid=10763&showreturntoresults=true\">http://bureau.espeakers.com/caps/speaker.php?sid=10763&showreturntoresults=true</a><br/>\nTele: (403) 714-6766 <br/>\nEmail <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jarnall@...\">jarnall@...</a> <br/>\nPeace in the world begins in the home<br/>\nParenting is the best job in the world and the hardest!  If you would like a daily parenting tip/strategy/affirmation/support<br/>\nplease follow me on <a rel=\"nofollow\" target=\"_blank\" href=\"http://twitter.com/JudyArnall\">http://twitter.com/JudyArnall</a><br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Karen <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Thursday, April 02, 2009 8:42 AM<br/>\n  Subject: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;<br/>\n<br/>\n<br/>\n  I&#39;m really struggling with feeling overwhelmed and &quot;taken advantage of&quot; in terms of household stuff. I have 4 children ranging in age from 6-15 and we haven&#39;t done the &quot;chores&quot; thing for a long time. I initially used the strategy of a lot of &quot;huffing and puffing&quot; to try to make sure they realised I was the poor person having to do all the work and it wasn&#39;t fair....... lol. I&#39;ve fortunately moved on a lot since then and have been trying to embrace the fact that if I joyfully do the household tasks, and ask for their help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll evenutally have a good attitude to household jobs and willingly help out.<br/>\n<br/>\n  But! I feel quite resentful of the fact that they happily leave their dirty plates etc lying wherever they used them, leave empty food packets lying around the house, leave clothes all over the floor etc, and just don&#39;t seem to notice or care! I get the fact that kids often really don&#39;t care or notice, but the reality is that I&#39;m doing the work of cleaning up EVERYONE&#39;S stuff and it&#39;s a lot of work! I&#39;m finding it hard to stay on top of it all (the house is a MESS!) and I&#39;m finding it hard to do it with a good attitude.<br/>\n<br/>\n  I know some say that they didn&#39;t choose to be born or live in this house, but they did make the mess!! Is it really so wrong for me to ask them to at least pick up their dirty plates and carry them to the kitchen? Or to put away the bread and spreads when they&#39;ve finished making a sandwich?<br/>\n<br/>\n  I WANT to model generosity and serving them, but right now I&#39;m beginning to think the end result just might be kids who just sit back and expect others to do it all for them.<br/>\n<br/>\n  They quite happily eat their snack or their dinner, then put headphones on and watch a movie straight afterwards, or whatever. It just feels really unfair to me, to be standing in the kitchen late at night, surrounded by cockroach-attracting mess, watching the kids play the xbox or watch TV, while I do all the cleaning up, having already cooked the meal etc.<br/>\n<br/>\n  I&#39;m really keen to have people help me think this through. I&#39;m not feeling respected or appreciated at all, and I&#39;m trying to continue to respect them, but I don&#39;t want to model that it&#39;s ok to be treated badly.<br/>\n<br/>\n  Any ideas or helpful thoughts?<br/>\n<br/>\n  Karyn<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":197763094,"authorName":"Christy Brunker","from":"Christy Brunker &lt;cmbrunker@...&gt;","profile":"cmbrunker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238729376","msgId":39271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZlNzk0ZWQ2MDkwNDAyMjAyOXc1MDJiODQyY3ViYzg4OTQ1MzBlZWMwNjJlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg==","referencesHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":39269,"nextInTopic":39272,"prevInTime":39270,"nextInTime":39272,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"... We run our family in a democratic fashion.  We have very few rules - ten rules, in fact.  One of which is when you make a mess,  you clean it up. Another","messageBody":"<div id=\"ygrps-yiv-1227310812\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I&#39;m really keen to have people help me think this through. I&#39;m not feeling<br/>\n&gt; respected or appreciated at all, and I&#39;m trying to continue to respect them,<br/>\n&gt; but I don&#39;t want to model that it&#39;s ok to be treated badly.<br/>\n&gt;<br/>\n&gt; Any ideas or helpful thoughts?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi.  I&#39;m new to the group but wanted to throw my .02 in there.<br/>\n<br/>\n </span></blockquote>We run our family in a democratic fashion.  We have very few rules - ten<br/>\nrules, in fact.  One of which is when you make a mess,  you clean it up.<br/>\nAnother of which is not to disturb another family member&#39;s right to exist<br/>\npeacefully.   All of the rules are rules that every family member has had a<br/>\nchance to vote on and has agreed to.<br/>\n<br/>\nWhen someone does not clean up their own mess, any family member can &quot;write&quot;<br/>\nthem up and we have a family meeting over dinner to discuss the offense.<br/>\nThe rules apply to everyone, so if I leave a mess, someone can write me up<br/>\ntoo.  Once we discuss the issue, take a plea, and vote guilty/not guilty,<br/>\nthen we discuss a sentence.  The sentence is usually just helping out around<br/>\nthe house or what not and almost always suggested by the individual who was<br/>\nwritten up.   Again, everyone in the family discusses and votes on<br/>\neverything.   Most of the time, we don&#39;t even apply a sentence, we just let<br/>\nthe individual off with a warning.<br/>\n<br/>\nThis system works great for us.  It allows all of us to respect each other<br/>\nand treats us all as equal family partners.  Even I have been written up and<br/>\nsentenced for extreme rudeness and drama. :p  More than once, even.<br/>\n<br/>\nI don&#39;t know if this will help you at all or not.  Perhaps just discussing<br/>\nyour feelings with your family, in a non blaming - non woe is me way, would<br/>\nbe enough to remind them that you&#39;re all responsible for cleaning up.<br/>\n<br/>\nChristy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284534827,"authorName":"Jeff Sabo","from":"Jeff Sabo &lt;freeboysdad@...&gt;","profile":"freeboysdad","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238727805","msgId":39262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2OTkwMC45NTEwOS5xbUB3ZWI1NTgwNi5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":39259,"nextInTopic":39263,"prevInTime":39261,"nextInTime":39263,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"Great question; I m going to steal my thoughts from a post I wrote a few months ago on my blog. My take on this is kind of ironic for folks who ve known me a","messageBody":"<div id=\"ygrps-yiv-857988026\">Great question; I&#39;m going to steal my thoughts from a post I wrote a few months ago on my blog. <br/>\n<br/>\nMy take on this is kind of ironic for folks who&#39;ve known me a while. I&#39;ve never had the reputation of being a clean person per se; I was the kid who hid dishes in my closet (okay, I was also the adult who did that sometimes, too), I&#39;ve never truly enjoyed folding clothes, and I generally will only pull out the vacuum if it&#39;s blocking my access to the boogie boards. In fact, you could say that in my earlier days, I was a complete slob; now, in these more politically correct times, you&#39;d probably say that I&#39;ve &quot;de-prioritized daily household activities.&quot; But I know the truth; I&#39;d rather hang out and have fun than clean. Hell, I&#39;d rather sleep than clean. I&#39;d probably rather watch QVC than clean, truth be known. But I do have my limits on how much disorder and dirt I can handle. We&#39;re cool with it. <br/>\n<br/>\nThere are a number of underlying thoughts in the &quot;cleaning/shores&quot; question, in my mind. <br/>\n<br/>\n&quot;Don&#39;t you want your kids to be responsible when they grow up?&quot; Of course not; what parent could possibly want such a thing?:-) Yes, I hope that my kids will be responsible when they grow up, but I cannot just wave my magic wand, give them a list of chores to do, and let it take care of itself. Surely, the world is full of people who had to do chores as a child and yet are ridiculously irresponsible - and I&#39;m not talking about &quot;have a messy house&quot; irresponsible, I&#39;m talking &quot;don&#39;t pay bills, treat people like crap, litter in the streets, send troops into war without justification&quot; irresponsible. I would also imagine the world is full of people who didn&#39;t do chores in their youth yet have grown up to be extraordinarily responsible; in fact, I&#39;m living proof. What&#39;s the link between chores and learning to be responsible? There is none. Why? Because people who accept responsibility do so because it&#39;s important to them to do so; it makes them feel good, they<br/>\n like how it makes others feel, they want to take care of themselves and their things. Can you teach that? No; I think you can model it, but you can&#39;t teach it - and you certainly can&#39;t coerce it through rewards and punishments.<br/>\n<br/>\n&quot;Aren&#39;t you tired of being a slave . . .&quot; I&#39;m not a slave unless I choose to frame it that way. When I need something cleaned, I clean it. When someone else needs something cleaned, I make a decision as to whether or not I want to do it, and when. Does that mean some things don&#39;t get done &quot;on time&quot; - that we have sticky dishes or dirty pants hanging around? Of course. And when I get tired of having the sticky dishes, I clean them. Pretty simple, really. It&#39;s not about picking up after someone, it&#39;s about recognizing everyone&#39;s tolerance level for the mess, especially your own. Is it my kids&#39; fault that I can tolerate less mess than they can? Of course not. I&#39;m like three times as big as they are, so the house seems three times as big to them as it does to me. If the entire house if a mess in my eyes, only one third of it is messy to them. That&#39;s my problem, not theirs. My kids will pick up when it&#39;s important to them to do so. When they&#39;re looking for<br/>\n something but can&#39;t find it; when they want to be helpful; when they don&#39;t have anywhere to sit because the couch is covered in socks and toys; when they see it&#39;s important to us and they choose to connect with us that way. It wasn&#39;t always like that; we used to force them, or at least try to force them. Then we guilted them, then we yelled at them. The end result? A kid in a meltdown that was then physically and emotionally incapable of helping, and had no motivation to do so except to avoid confrontation. Not healthy for any of us, and definitely not the kind of environment we wanted to help create. We&#39;re not always perfect at it, but we now approach cleaning and tidying up as something personal for each of us: when the kitchen gets too nasty for me, I clean it; when Kai wants to pick up, he does; if he&#39;s okay with a mess and I&#39;m not, I&#39;ll clean it; and he wants to clean and I don&#39;t, I&#39;ll usually lend a hand. No fights, no crying - and as a result,<br/>\n sometimes no cleanliness either. So what?<br/>\n<br/>\n&quot;Shouldn&#39;t you teach them that we&#39;re all responsible for ourselves?&quot; I&#39;ve said it before, and it&#39;s still true - you tell me how to &quot;teach&quot; someone responsibility and I&#39;ll put you in touch with some people in DC to see if you can help out there. You can model it, but you can&#39;t teach it.<br/>\n<br/>\nIn the end, I think it&#39;s a matter of perspective. I still sometimes catch myself resenting it, and when that happens I do something radical - I stop cleaning and start interacting with my children so I can learn more about what they love and what is important to them. <br/>\n<br/>\nJeff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 4/2/09, Karen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gktbdm@...\">gktbdm@...</a>&gt; wrote:<br/>\n<br/>\n&gt; From: Karen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gktbdm@...\">gktbdm@...</a>&gt;<br/>\n&gt; Subject: [unschoolingbasics] I&#39;m feeling &quot;taken advantage of&quot;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Date: Thursday, April 2, 2009, 7:42 AM<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;     <br/>\n&gt;             I&#39;m really struggling with feeling<br/>\n&gt; overwhelmed and &quot;taken advantage of&quot; in terms of<br/>\n&gt; household stuff.  I have 4 children ranging in age from 6-15<br/>\n&gt; and we haven&#39;t done the &quot;chores&quot; thing for a<br/>\n&gt; long time.  I initially used the strategy of a lot of<br/>\n&gt; &quot;huffing and puffing&quot; to try to make sure they<br/>\n&gt; realised I was the poor person having to do all the work and<br/>\n&gt; it wasn&#39;t fair....... lol.  I&#39;ve fortunately moved<br/>\n&gt; on a lot since then and have been trying to embrace the fact<br/>\n&gt; that if I joyfully do the household tasks, and ask for their<br/>\n&gt; help from time to time (trying to be ok with a<br/>\n&gt; &quot;no&quot;), they&#39;ll evenutally have a good attitude<br/>\n&gt; to household jobs and willingly help out.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; But!  I feel quite resentful of the fact that they happily<br/>\n&gt; leave their dirty plates etc lying wherever they used them,<br/>\n&gt; leave empty food packets lying around the house, leave<br/>\n&gt; clothes all over the floor etc, and just don&#39;t seem to<br/>\n&gt; notice or care!  I get the fact that kids often really<br/>\n&gt; don&#39;t care or notice, but the reality is that I&#39;m<br/>\n&gt; doing the work of cleaning up EVERYONE&#39;S stuff and<br/>\n&gt; it&#39;s a lot of work!  I&#39;m finding it hard to stay on<br/>\n&gt; top of it all (the house is a MESS!) and I&#39;m finding it<br/>\n&gt; hard to do it with a good attitude.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I know some say that they didn&#39;t choose to be born or<br/>\n&gt; live in this house, but they did make the mess!!  Is it<br/>\n&gt; really so wrong for me to ask them to at least pick up their<br/>\n&gt; dirty plates and carry them to the kitchen?  Or to put away<br/>\n&gt; the bread and spreads when they&#39;ve finished making a<br/>\n&gt; sandwich?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I WANT to model generosity and serving them, but right now<br/>\n&gt; I&#39;m beginning to think the end result just might be kids<br/>\n&gt; who just sit back and expect others to do it all for them.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; They quite happily eat their snack or their dinner, then<br/>\n&gt; put headphones on and watch a movie straight afterwards, or<br/>\n&gt; whatever.  It just feels really unfair to me, to be standing<br/>\n&gt; in the kitchen late at night, surrounded by<br/>\n&gt; cockroach-attractin g mess, watching the kids play the xbox<br/>\n&gt; or watch TV, while I do all the cleaning up, having already<br/>\n&gt; cooked the meal etc.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I&#39;m really keen to have people help me think this<br/>\n&gt; through.  I&#39;m not feeling respected or appreciated at<br/>\n&gt; all, and I&#39;m trying to continue to respect them, but I<br/>\n&gt; don&#39;t want to model that it&#39;s ok to be treated<br/>\n&gt; badly.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Any ideas or helpful thoughts?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Karyn<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt;     <br/>\n&gt;     <br/>\n&gt; \t<br/>\n&gt; \t <br/>\n&gt; \t<br/>\n&gt; \t<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; \t<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; \t<br/>\n&gt; \t<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; \t<br/>\n&gt; \t<br/>\n&gt; \t<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I&#39;m feeling &quot;taken advantage of&quot;","postDate":"1238683375","msgId":39259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyMml0Zitic212QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39262,"prevInTime":39258,"nextInTime":39260,"topicId":39259,"numMessagesInTopic":0,"msgSnippet":"I m really struggling with feeling overwhelmed and taken advantage of in terms of household stuff.  I have 4 children ranging in age from 6-15 and we haven t","messageBody":"<div id=\"ygrps-yiv-834229325\">I&#39;m really struggling with feeling overwhelmed and &quot;taken advantage of&quot; in terms of household stuff.  I have 4 children ranging in age from 6-15 and we haven&#39;t done the &quot;chores&quot; thing for a long time.  I initially used the strategy of a lot of &quot;huffing and puffing&quot; to try to make sure they realised I was the poor person having to do all the work and it wasn&#39;t fair....... lol.  I&#39;ve fortunately moved on a lot since then and have been trying to embrace the fact that if I joyfully do the household tasks, and ask for their help from time to time (trying to be ok with a &quot;no&quot;), they&#39;ll evenutally have a good attitude to household jobs and willingly help out.<br/>\n<br/>\nBut!  I feel quite resentful of the fact that they happily leave their dirty plates etc lying wherever they used them, leave empty food packets lying around the house, leave clothes all over the floor etc, and just don&#39;t seem to notice or care!  I get the fact that kids often really don&#39;t care or notice, but the reality is that I&#39;m doing the work of cleaning up EVERYONE&#39;S stuff and it&#39;s a lot of work!  I&#39;m finding it hard to stay on top of it all (the house is a MESS!) and I&#39;m finding it hard to do it with a good attitude.<br/>\n<br/>\nI know some say that they didn&#39;t choose to be born or live in this house, but they did make the mess!!  Is it really so wrong for me to ask them to at least pick up their dirty plates and carry them to the kitchen?  Or to put away the bread and spreads when they&#39;ve finished making a sandwich?<br/>\n<br/>\nI WANT to model generosity and serving them, but right now I&#39;m beginning to think the end result just might be kids who just sit back and expect others to do it all for them.<br/>\n<br/>\nThey quite happily eat their snack or their dinner, then put headphones on and watch a movie straight afterwards, or whatever.  It just feels really unfair to me, to be standing in the kitchen late at night, surrounded by cockroach-attracting mess, watching the kids play the xbox or watch TV, while I do all the cleaning up, having already cooked the meal etc.<br/>\n<br/>\nI&#39;m really keen to have people help me think this through.  I&#39;m not feeling respected or appreciated at all, and I&#39;m trying to continue to respect them, but I don&#39;t want to model that it&#39;s ok to be treated badly.<br/>\n<br/>\nAny ideas or helpful thoughts?<br/>\n<br/>\nKaryn</div>","specialLinks":[]}],"prevTopicId":39217,"nextTopicId":39352}}