{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Intro, praise for the conference etc....","postDate":"1132089950","msgId":7746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDM0VBNzU2LTU4MjYtNENERS1BNzMxLUE4NDNFRjgxNDRBREBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRsY3NjMCtuMHQyQGVHcm91cHMuY29tPg==","referencesHeader":"PGRsY3NjMCtuMHQyQGVHcm91cHMuY29tPg=="},"prevInTopic":7741,"nextInTopic":0,"prevInTime":7745,"nextInTime":7747,"topicId":7740,"numMessagesInTopic":0,"msgSnippet":"... You say, Okay, I get it that you really don t want to come and I bet you understand that I want you to come, right? Him, Yeah, but I REALLY don t want","messageBody":"<div id=\"ygrps-yiv-2128780488\">On Nov 15, 2005, at 6:46 AM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot; But how do I handle times when I need him to come<br/>\n&gt; with us and if we stay home, 3 other kids miss out on what they want<br/>\n&gt; to do?&quot;<br/>\n<br/>\n </span></blockquote>You say, &quot;Okay, I get it that you really don&#39;t want to come and I bet  <br/>\nyou understand that I want you to come, right?&quot;<br/>\nHim, &quot;Yeah, but I REALLY don&#39;t want to.&quot;<br/>\n<br/>\nYou, &quot;I know you really don&#39;t want to. Are you willing to consider us  <br/>\nfinding something we can do to make it less of a pain for you? What  <br/>\nif we stopped for special ice cream on the way back?&quot; (OR, &quot;What if  <br/>\nyou could take my laptop, just this once, and play on that in the car  <br/>\nand while you&#39;re waiting?&quot; OR - whatever.....make it special because  <br/>\nit IS an imposition. Recognize that. Thank him for being willing to  <br/>\nwork it out.<br/>\n<br/>\nThen, don&#39;t take advantage of a kid&#39;s willingness to work it out. In  <br/>\nother words, make sure it works the other way sometimes, too.  <br/>\nSometimes he says, &quot;I really don&#39;t want to go,&quot; and you find someone  <br/>\nelse to take the other kids, you get them a ride, you put them off by  <br/>\noffering THEM something else to make up for it. OR you find someone  <br/>\nelse to stay home with him.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":229237531,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Intro, praise for the conference etc....","postDate":"1132067314","msgId":7741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNzlGOUYyLjYwOTA2MDJAZ21haWwuY29tPg==","inReplyToHeader":"PGRsY3NjMCtuMHQyQGVHcm91cHMuY29tPg==","referencesHeader":"PGRsY3NjMCtuMHQyQGVHcm91cHMuY29tPg=="},"prevInTopic":7740,"nextInTopic":7746,"prevInTime":7740,"nextInTime":7742,"topicId":7740,"numMessagesInTopic":0,"msgSnippet":"... Can I just say oh yeah to everything Ren just said?  I think she described quite well what it s like to live with multiple children and try to negotiate","messageBody":"<div id=\"ygrps-yiv-773350831\">Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Being present, being aware of needs and personalities, knowing what<br/>\n&gt; the triggers are and trying to remove them, feeding them snacks before<br/>\n&gt; they act hungry etc... these are some of the tools we&#39;ve used to<br/>\n&gt; encourage peaceful solutions.<br/>\n<br/>\n </span></blockquote>Can I just say &quot;oh yeah&quot; to everything Ren just said?  I think she <br/>\ndescribed quite well what it&#39;s like to live with multiple children and <br/>\ntry to negotiate everyone&#39;s needs, and how we try to work things here as <br/>\nwell. For anyone who didn&#39;t get to the conference, her talk on <br/>\nUnschooling a Tribe would be well worth ordering, imo.<br/>\n<br/>\nWhat I would add is that although there are times when one young child <br/>\ndoes get carted along because there aren&#39;t stay at home solutions to be <br/>\nfound, that&#39;s not the end of it or just the way it is (not that Ren was <br/>\nsaying that, just for explicit clarification). There&#39;s more to it than <br/>\nthat, for us anyway, and I suspect in Ren&#39;s family as well. As Ren <br/>\ntalked about, there&#39;s the validating and the attempt to find solutions <br/>\nthat may help even if staying at home isn&#39;t one of them.<br/>\n<br/>\nAlso, when Sam is carted along, I try to own that responsibility rather <br/>\nthan displacing it onto him or the other kids. I realize that in order <br/>\nto enable my other children to do something sometimes means that I&#39;ll be <br/>\nputting *all* of my energy into Sam while we are there, trying to help <br/>\nhim stay in a comfort zone. Sometimes this falls into place like Ren <br/>\ndescribed because the outing is fun and a good fit, but it just required <br/>\nan energy shift to get these spirited kids through the transition. <br/>\nSometimes, however, things do not fall into place, and Sam needs all my <br/>\nenergy to get through the situation gracefully, and I find that I need <br/>\nto be prepared to give him that energy without being resentful that <br/>\nthings aren&#39;t just falling into place.<br/>\n<br/>\nThat&#39;s where things get tricky, too, in making sure that this is not <br/>\nhappening too often. In other words, making sure that Sam isn&#39;t being <br/>\nput into situations that are difficult for him too often simply because <br/>\nthe other kids like to do something. I think it needs to be an exception <br/>\nrather than a rule, kwim. We&#39;ve given up some regular activities that <br/>\nthe girls really enjoyed because they took such a toll on Sam. We&#39;ve had <br/>\nto go back and renegotiate what everyone&#39;s needs really are, and <br/>\nsometimes going to that activity is not as important as everyone&#39;s <br/>\nwell-being nor is it necessarily the only way to meet the girls&#39; <br/>\nneeds--maybe just the most obvious or expedient way.<br/>\n<br/>\n-- <br/>\n~~Danielle<br/>\nEmily (8), Julia (6), Sam (5)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a><br/>\n<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*<br/>\n<br/>\n&quot;With our thoughts, we make the world.&quot; ~~Buddha</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Intro, praise for the conference etc....","postDate":"1132065984","msgId":7740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRsY3NjMCtuMHQyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":7741,"prevInTime":7739,"nextInTime":7741,"topicId":7740,"numMessagesInTopic":0,"msgSnippet":"He went from thinking that we were making a mistake with unschooling, to trusting me because I m passionate in my belief in it and have spent alot of time","messageBody":"<div id=\"ygrps-yiv-1702382070\">&quot;He went from thinking that we were making a mistake with<br/>\nunschooling, to trusting me because I&#39;m passionate in my belief in it<br/>\nand have spent alot of time reading about it, to understanding it and<br/>\nbelieving this would work for our family!&quot;<br/>\n<br/>\nI&#39;ve heard this over and over each year, it&#39;s SO cool. I&#39;m really glad<br/>\nhe had such a great experience there.<br/>\nI remember standing in Kelly&#39;s yard two years ago and having Kim<br/>\nConti&#39;s dh tell me &quot;when my wife explained unschooling I thought it<br/>\nsounded a bit nuts, but after being here this weekend and seeing all <br/>\nthese kids, I KNOW it&#39;s the only life for us.&quot;<br/>\nWow!<br/>\nI think the more Dads that come the better.:)<br/>\n<br/>\n&quot; I&#39;m so grateful that<br/>\nthe &quot;gurus&quot; of unschooling are such eloquent writers and speakers and<br/>\nshare your time and life with us.&quot;<br/>\n<br/>\nI think that was one of the sweetest reviews I&#39;ve ever read. Thank<br/>\nyou, you made my day!<br/>\n<br/>\n<br/>\n&quot; But how do I handle times when I need him to come<br/>\nwith us and if we stay home, 3 other kids miss out on what they want<br/>\nto do?&quot;<br/>\n<br/>\nYou bring him with you. I wouldn&#39;t give that advice if you weren&#39;t<br/>\nalready being so mindful and respectful of him...but everything you<br/>\njust wrote says you&#39;re doing your best to give him options. There ARE<br/>\ntimes that you run out of options and they have to come. It&#39;s not the<br/>\nsame in larger families as it is with an &quot;only&quot;.<br/>\nMy Jalen is very much like that.<br/>\nOn Sunday, we all had plans to visit the Bays Mountain park where we<br/>\ncould see wolves, otters and other critters. The kids were all<br/>\nexcited. He knew the plan, he&#39;d even helped bake cupcakes to take<br/>\nalong. But when it was time to leave he didn&#39;t want to go. I knew<br/>\nTrevor didn&#39;t want to watch him and it would absolutely break the<br/>\nother children&#39;s hearts to not go....plus dh and I had been looking<br/>\nforward to it and the weather was glorius.<br/>\nSo I explained that no one could stay and watch him, we were all going<br/>\nand he needed to come.<br/>\nSometimes that&#39;s how it is.<br/>\nThat doesn&#39;t mean I don&#39;t listen to his feelings deeply, offer up<br/>\ninformation that will help him transition etc... But I needed him to<br/>\nget in the car and come with.<br/>\nAfter listening to him, explaining things further and telling him<br/>\nthere were no other options today, he sighed and said &quot;Ok&quot;.<br/>\n<br/>\nWe all had a fabulous time, especially Jalen. It was a wonderful place<br/>\nfor him...I knew he&#39;d have a great time once we got him there. It&#39;s<br/>\nhard to be 4 sometimes.:)<br/>\n<br/>\nAs far as the fighting...I&#39;ve found that when I am really present with<br/>\nmy children, there is a much lower rate of disintigration. I can offer<br/>\nup peaceful solutions before things melt down. I&#39;m better at<br/>\ncommunicating solutions than an 8 and 4 y.o. (the two that have the<br/>\nhardest time) so I feel it is my duty to help them navigate this until<br/>\nthey gain these skills.<br/>\nOur big thing around here is that you try and solve issues without<br/>\nblame, without namecalling. When it happens I say &quot;that isn&#39;t a<br/>\nhelpful way to solve this problem,let&#39;s focus on how everyone can get<br/>\nwhat they need right now&quot;<br/>\nIf someone is being truly mean, I stop it and get the victim away from<br/>\nthe angry child quickly. Once I give them a hug or comfort, I talk to<br/>\nthe offender and let them know that if they want to harm another human<br/>\nbeing with words or physically, they need to be far away from that<br/>\nother human.<br/>\nWe don&#39;t have a lot of problems with fighting most of the time, if *I*<br/>\nam doing my job. That doesn&#39;t mean we don&#39;t have upset children, or<br/>\npossibilities for fighting..Jalen can really get everyone going. But<br/>\nif I&#39;m there with them, picking him up and hugging him when I see a<br/>\npotential problem, explaining that he can&#39;t scream at someone to get<br/>\nwhat he wants, it seems to avert most of the major fights.<br/>\n<br/>\nBeing present, being aware of needs and personalities, knowing what<br/>\nthe triggers are and trying to remove them, feeding them snacks before<br/>\nthey act hungry etc... these are some of the tools we&#39;ve used to<br/>\nencourage peaceful solutions.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":7745,"nextTopicId":7748}}