{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":179814481,"authorName":"puppyrat4750","from":"&quot;puppyrat4750&quot; &lt;puppyrat4750@...&gt;","profile":"puppyrat4750","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hi From NZ! - New to Unschooling","postDate":"1108236566","msgId":4913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1bGxlbSt0cDFuQGVHcm91cHMuY29tPg=="},"prevInTopic":4912,"nextInTopic":0,"prevInTime":4912,"nextInTime":4914,"topicId":4895,"numMessagesInTopic":0,"msgSnippet":"... prob be labelled with dysgraphia - very high reading level, but crappy speller), and so getting him to do anything in that vein is very very hard. It makes","messageBody":"<div id=\"ygrps-yiv-359585244\"><blockquote><span title=\"ireply\">&gt; Daniel has problems with handwriting (if he was labelled, he would <br/>\n </span></blockquote>prob be labelled with dysgraphia - very high reading level, but <br/>\ncrappy speller), and so getting him to do anything in that vein is <br/>\nvery very hard. It makes him feel bad - I think a hangover from <br/>\nschool, felt like a real failure in the writing dept.&gt;<br/>\n<br/>\nMy daughter hates to read, likes to be read to, loves the computer <br/>\n(toontownonline, neopets - her typing has improved doing this!), <br/>\nvideo games, animals, anime.  We will need to deschool.  Why worry <br/>\nabout handwriting when they can learn to type (and spellcheck).  If <br/>\nshe doesn&#39;t know how to spell a word, she asks me.  This way she <br/>\nlearns it correctly from the beginning, she has trouble figuring it <br/>\nout for herself (visual/spatial.....).   She has a wonderful <br/>\nvocabulary (alot because I utilize interesting words).  She&#39;s a lot <br/>\nlike my husband, I&#39;m very different in my learning style.  I&#39;ve <br/>\nlearned alot about them by reading, reasearching etc etc.<br/>\n<br/>\nThere a lots of other chat groups on yahoo, check out Sandra Dodd&#39;s <br/>\nsight often.  She has wonderful information.<br/>\nJann</div>","specialLinks":[]},{"userId":179814481,"authorName":"puppyrat4750","from":"&quot;puppyrat4750&quot; &lt;puppyrat4750@...&gt;","profile":"puppyrat4750","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hi From NZ! - New to Unschooling","postDate":"1108236019","msgId":4912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1bGt0aitndW1pQGVHcm91cHMuY29tPg=="},"prevInTopic":4902,"nextInTopic":4913,"prevInTime":4911,"nextInTime":4913,"topicId":4895,"numMessagesInTopic":0,"msgSnippet":"... feel so lost ... Hilary, I had a big long post and by the time I finished and hit the send button, they timed me out of yahoo, so I lost it!   So, quickly,","messageBody":"<div id=\"ygrps-yiv-110034268\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Hilary Jackson&quot; <br/>\n&lt;hilary@l...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I guess I need to learn more about how he learns best. I just <br/>\n </span></blockquote>feel so lost<br/>\n<blockquote><span title=\"ireply\"> &gt; right now.<br/>\n&gt; <br/>\n </span></blockquote>Hilary,<br/>\nI had a big long post and by the time I finished and hit the send <br/>\nbutton, they timed me out of yahoo, so I lost it!   So, quickly, <br/>\ncheck out &quot;Upside-down Brilliance:  The Visual spatial learner&quot; by <br/>\nLinda Silverman   www.gifteddevelopment.com<br/>\n<br/>\nMy daughter has been &quot;diagnosed&quot; as ADHD, but I think it&#39;s more the <br/>\nabove.  Her handwriting is illegible, spelling horrible, but learns <br/>\nwords well visually (forget phoenics).  We&#39;ll be starting <br/>\nhomeschooling/unschooling in the fall (she&#39;s in 6th grade, middle <br/>\nschool here is horrible).<br/>\n<br/>\nMore later, don&#39;t want to lose this a second time!<br/>\nJann (in Massachusetts)</div>","specialLinks":[]},{"userId":136227309,"authorName":"Deirdre Aycock","from":"&quot;Deirdre Aycock&quot; &lt;aycock@...&gt;","profile":"deirdreaycock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hi From NZ! - New to Unschooling","postDate":"1107980323","msgId":4902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM1MGVlNSRlZTNhNjA3MCQ2MTAxYThjMEBkZWlyZHJlcGozMTA4eT4=","referencesHeader":"PDExMDc5NjMxOTMuNjQ5Ni4yMzMzOC5tMTJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":4899,"nextInTopic":4912,"prevInTime":4901,"nextInTime":4903,"topicId":4895,"numMessagesInTopic":0,"msgSnippet":"Hilary - Hey and welcome to this list!  Our son is 12 and our dd is 10. George and Nola play a game on line called runescape. (www.runescape.com) I ll let the","messageBody":"<div id=\"ygrps-yiv-211315452\">Hilary - Hey and welcome to this list!  Our son is 12 and our dd is 10.<br/>\nGeorge and Nola play a game on line called runescape. (www.runescape.com)<br/>\nI&#39;ll let the two of you check it out on your own.   If that appeals to your<br/>\nson, tell him to add superman5606 and effie5413 to his friends list--those<br/>\nare my kids.  My kids are on there off and on all day, but if they keep<br/>\nmissing each other, email  us and tell us what time to &quot;meet&quot; him there.<br/>\nWe&#39;ve found websites that help us convert time zones!  I mention Runescape<br/>\nenthusiatically because my kids love it and they are learning so much from<br/>\nplaying.   I credit that game with the improvement in Nola&#39;s spelling, and<br/>\nboth kids type fast now, but that&#39;s just the start of what they are taking<br/>\naway from that game.   They have to type to be able to communicate with<br/>\nother players, but spelling correctly isn&#39;t necessary!  The other players<br/>\nwill get the idea.<br/>\n    Having said that, I also want to tell you that we stopped doing anything<br/>\n&quot;schooly&quot; about two years ago.   My kids don&#39;t do anything that looks<br/>\nremotely like school work.  I think it&#39;s fun when people tell me my kids are<br/>\n&quot;so smart!&quot;   Especially when it comes form someone that wouldn&#39;t approve of<br/>\nmy kids watching as much tv as they do.   LOL<br/>\n     I think you and your son need a summer vacation.  One that never ends!<br/>\nWho cares if he doesn&#39;t finish what he starts?  Neither do I, a lot of the<br/>\ntime.  If whatever he is trying gets boring, then he needs to quit doing it<br/>\nand find something else!   It&#39;s gonna take him some practice to decide how<br/>\nto spend his time and energy.  He&#39;s had so many decisions made for him by<br/>\nthe school!     What he needs now is lots of control, so he can get back in<br/>\ntouch with what he feels like doing, what he enjoys.  Don&#39;t make him go to<br/>\nhis classes if he doesn&#39;t feel like it that day.   And I would definitely<br/>\nstop working on his handwriting!!  His brain isn&#39;t ready for it, just leave<br/>\nit alone for a couple of years and see what things look like then.  I don&#39;t<br/>\nthink he needs to be able to write anything until he&#39;s old enough to sign<br/>\nchecks. LOL     I use my husband as an example:  even he can&#39;t read his own<br/>\nhandwriting, and he can&#39;t spell.   But he says that&#39;s what computers and<br/>\nspell-checker programs are for!   He practices law and runs 4 other<br/>\ncompanies, so I can honestly say it hasn&#39;t slowed him down.<br/>\n   I guess you&#39;ll have to find some other folks who unschool in NZ and ask<br/>\nabout how to handle the review.  You aren&#39;t the only ones there!  My only<br/>\nadvise about that review is that you need to take care of your son first and<br/>\nmake the paperwork follow you, not the other way around.  I hope you can<br/>\nminimize how much control that review has over your son.<br/>\n    As to your son&#39;s bad moods, and, well, everything about your son:  It&#39;s<br/>\nso hard for the rest of us to know why he&#39;s not cheerful, since we aren&#39;t<br/>\nright there.  I can sympathize with you having to be around someone in a<br/>\nblue funk, and I hope you can sympathize with your son.  Make sure he&#39;s<br/>\neating whenever he&#39;s hungry and getting plenty of sleep at night.  And try<br/>\nto help him get in touch with what he feels he wants or needs, then help him<br/>\nobtain it.  If I were him, I would need some space from the toddler--bet you<br/>\ncould use a break from Flynn occassionally as well.  Toddlers are so cool,<br/>\nbut they are also hard work.<br/>\n    Gee this is a long post.  Hope there&#39;s something here that&#39;s useful to<br/>\nyou!  Good luck!  Deirdre<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi everyone,<br/>\n&gt;<br/>\n&gt; I just joined this list today. I live in beautiful NZ, have Daniel (just<br/>\n&gt; turned 11yrs) and Flynn (2.5yrs).  We are 6 months into our trailblazing<br/>\n&gt; brand new life, and I am feeling some really uncomfy feelings coming up.<br/>\n&gt; I took Dan out of a Steiner School 6 months ago.<br/>\n<br/>\n </span></blockquote>Then he says that he is bored and why don&#39;t we do anything.<br/>\n<blockquote><span title=\"ireply\"> &gt; I suggest things, and he either loses steam just outside of the starting<br/>\n&gt; gates or never ever finishes them.<br/>\n&gt; Daniel has problems with handwriting<br/>\n<br/>\n&gt; I do have some tension in me about the whole ERO review<br/>\n<br/>\n&gt; He says he needs to move all the time, that he just can&#39;t stay still.<br/>\n<br/>\n&gt; I feel like I am doing a crappy job just now and often feel like I don&#39;t<br/>\n&gt; really know what to do.<br/>\n&gt;<br/>\n&gt; I asked him what he would really like to be doing. He says reading (he<br/>\n </span></blockquote>LOVES<br/>\n<blockquote><span title=\"ireply\"> &gt; reading fiction and reads voraciously) playing with his friends, playing<br/>\n&gt; computer games and bike riding. That&#39;s about all he wants to do. Oh, and<br/>\n </span></blockquote>he<br/>\n<blockquote><span title=\"ireply\"> &gt; occasionally does delve into writing science fantasy short stories a&#39; la&#39;<br/>\n&gt; Anne McCaffery Pern series kind of stuff.<br/>\n&gt;<br/>\n&gt; The thing I find most difficult is the moochingness that he displays. Like<br/>\n&gt; he is at this major loose end and I have to fix it. Its really<br/>\n </span></blockquote>challenging.<br/>\n<blockquote><span title=\"qreply\"> &gt; I have to work hard not to get pissed off with him sometimes. I hate<br/>\n&gt; moodiness and just find that kind of &quot;frozen&quot; mood he gets in hard. (guess<br/>\n&gt; he does too) Arrgghh!<br/>\n&gt;<br/>\n&gt; I have a very wilful 2.5yr old as well, and this does place limits on what<br/>\n&gt; we can and can&#39;t do. He interfere&#39;s with absolutely everything!! And, Dan<br/>\n&gt; goes crazy with that!<br/>\n&gt;<br/>\n&gt; I guess I need to learn more about how he learns best. I just feel so lost<br/>\n&gt; right now.<br/>\n&gt;<br/>\n&gt; What did you do with your kids?? And with yourself?<br/>\n&gt;<br/>\n&gt; Thanks for listening and look forward to hearing from you,<br/>\n&gt;<br/>\n&gt;  Hilary </span></blockquote></div>","specialLinks":[]},{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hi From NZ! - New to Unschooling","postDate":"1107969374","msgId":4899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1ZGdndSs0dGFvQGVHcm91cHMuY29tPg=="},"prevInTopic":4898,"nextInTopic":4902,"prevInTime":4898,"nextInTime":4900,"topicId":4895,"numMessagesInTopic":0,"msgSnippet":"Hi, Hilary!  Let me first say, Way to go for listening to Daniel s request to leave school!  It is so wonderful that you are in tune with him and willing to","messageBody":"<div id=\"ygrps-yiv-4879255\">Hi, Hilary!  Let me first say, &quot;Way to go for listening to Daniel&#39;s <br/>\nrequest to leave school!&quot;  It is so wonderful that you are in tune <br/>\nwith him and willing to listen to his needs.  That is SO difficult <br/>\nfor most parents to do.  Heck, we are brought up to give orders to <br/>\nour children and not think of them as young adults and fellow <br/>\nhumans.  Congrats on taking the first step!<br/>\n<br/>\nIt sounds like you are struggling with a lot of normal things.  Have <br/>\nyou thought about the fact that you will also need to deschool <br/>\nyourself?  I would suggest reading any unschooling books you can get <br/>\nyour hands on.  This is great for boosting your confidence in the <br/>\ndecision you have made for you and your family. I recommend, &quot;The <br/>\nTeenage Liberation Handbook&quot; for a real perspective of school.  <br/>\nAlso, read about the history of school.  It will make your hair <br/>\nstand on end!  It might also be a good idea to subscribe to an <br/>\nunschooling magazine.  Find something that you like to do, and do <br/>\nit.  One of the most difficult things for me in the beginning was <br/>\nrealizing that I lead by example, therefore I get to do what I want <br/>\nto do as well!  What a joyous revelation!  <br/>\n<br/>\nIt&#39;s okay if your son doesn&#39;t want to write.  My son has only <br/>\nwritten anything one time in the past year that I can think of.  He <br/>\nis 11 this month, and is ambedextrious.  He finds it frustrating and <br/>\ntoo time consuming to bother with.  Sometimes he expresses an <br/>\ninterest in typing, other times he doesn&#39;t.  He&#39;s a wonderful <br/>\nreader, and he reads WAY quicker than myself.  BUT, he doesn&#39;t <br/>\nactually like to read.  He does like to listen to a good story, <br/>\nthough.  So, we listen to books on CD, or I read to him.  He just <br/>\nloves it.  Try to remember that something is only important to us if <br/>\nwe need to know it and use it right now.  When we need and want to <br/>\nlearn something relevant to our life, you would be amazed at how <br/>\nfast it gets accomplished!<br/>\n<br/>\nI second Pam&#39;s suggestion of not paying attention to Daniel&#39;s <br/>\nweaknesses.  Unschooling is all about strengths and likes.  Go with <br/>\nthose.  It&#39;s okay if he wants to spend all day looking out the <br/>\nwindow, playing video games, watching television, playing on the <br/>\ncomuputer, or even sleeping.  Don&#39;t forget to join him sometimes.  <br/>\nLife is not broken up into educational and non-educational <br/>\nsegments.  We learn from everything.  Don&#39;t waste your time trying <br/>\nto find the educational benefit in something.  You&#39;ll be <br/>\ncontinuously amazed once you start figuring the process out and <br/>\nseeing your children blossom and become brilliant, confident, well-<br/>\nadjusted individuals.<br/>\n<br/>\nTry real hard not to fret over what Daniel spends his time doing.  <br/>\nAlso, find a coping strategy for yourself in dealing with his <br/>\nmoodiness.  This is something that I am still working on with <br/>\nAdrian.  He is VERY opinionated, outspoken, perfectionistic and what <br/>\nI consider highly-sensitive.  (You may benefit from reading, &quot;The <br/>\nHighly Sensitive Child&quot;)  This makes for a very moody child.  It <br/>\ndoesn&#39;t take much to get him irritated.  I work very hard at not <br/>\nletting this get to me, but I do let him know when I just can&#39;t <br/>\nhandle listening to his ranting and complaining, politely of <br/>\ncourse.  Once you start to understand Daniel&#39;s personality a little <br/>\ndeeper you will be able to communicate and live with him much more <br/>\neffectively.  Also, he will become more comfortable being himself <br/>\nand these negative bouts will decrease in occurance.  BTW - It&#39;s <br/>\nvery nice to know that I am not alone in the world dealing with this <br/>\none! :)<br/>\n<br/>\nAs far as record keeping goes there are bits of information out <br/>\nthere that help you to learn how to convert his daily activities <br/>\ninto &quot;school language&quot; for reporting and such.  You might like to <br/>\ntry keeping a daily journal on the computer.  I used to use a <br/>\nsoftware program specifically for keeping school records.  I lost <br/>\nover a year and a half&#39;s worth of information when my computer <br/>\ncrashed, so don&#39;t forget to save it to disc on a regular basis.  I <br/>\ncurrently have no records, save my first journal entry from <br/>\nyesterday.  I&#39;ve decided that journaling will be a much more <br/>\neffective way of &quot;record keeping&quot; if for no other reason to enjoy <br/>\nlooking back on my son&#39;s interests and explorations.<br/>\n<br/>\nIt might help you to have an example of my 11 year old son&#39;s day.  <br/>\nHe stays up until between midnight and 2am.  He sleeps until 11am.  <br/>\nSome have trouble with that, but yet another benefit of unschooling <br/>\nis listening to and meeting our personal needs.  He loves being up <br/>\nlate because it&#39;s quiet and his pets, one gecko and two hamsters, <br/>\nare nocturnal.  He likes to watch the gecko hunt.  During the day he <br/>\neither plays PS2, watches DVD&#39;s on Dinosaurs or just hangs out with <br/>\nme.  That&#39;s where he is right now.  He just joined a bowling <br/>\nleague.  I was totally shocked!  This child has NEVER had any <br/>\ninterest in anything resembling a sport.  We do go on outings by <br/>\nourselves and with local HS groups.  His favorite hangout with me is <br/>\nto go to lunch and a movie.  He&#39;s totally into computer graphics and <br/>\ncurrently wants to design video games for a living.  On occassion he <br/>\nexpresses a concern that he doesn&#39;t &quot;do&quot; math.  I tell him that we <br/>\nhave resources available if he&#39;s interested, but he never pursues <br/>\nthem.  Little does he know how much math he does in his daily <br/>\nactivities.  I&#39;m okay with that, more so than he is probably.<br/>\n<br/>\nHilary, please remember that you have made a wonderful decision for <br/>\nyour family.  You couldn&#39;t have chosen a more liberating lifestyle.  <br/>\nKeep &quot;educating&quot; yourself.  Keep searching.  Keep dreaming.  Keep <br/>\npursuing your interests, and mostly keep yourself available to your <br/>\nchildren, and relax.  You will see amazing things happen over the <br/>\nnext weeks, months and years to come.  If you ever want to chat <br/>\nabout 11 year old boys feel free to email me personally.  <br/>\n<br/>\nEnjoy your journey...<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":212934673,"authorName":"scrapgal","from":"&quot;scrapgal&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hi From NZ! - New to Unschooling","postDate":"1107963268","msgId":4897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1ZGFpNCsxdjl1QGVHcm91cHMuY29tPg=="},"prevInTopic":4895,"nextInTopic":4898,"prevInTime":4896,"nextInTime":4898,"topicId":4895,"numMessagesInTopic":0,"msgSnippet":"... moment, and ... What if you did an intense period of deschooling.  Take him out of all the classes altogether.  No French, no technology, nothing that ","messageBody":"<div id=\"ygrps-yiv-508423526\"><blockquote><span title=\"ireply\">&gt; I feel like I am hitting so many brick walls with Daniel at the <br/>\n </span></blockquote>moment, and<br/>\n<blockquote><span title=\"ireply\"> &gt; just wanted to ask for some advice, reflections, ways thru etc.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What if you did an &quot;intense&quot; period of deschooling.  Take him out of <br/>\nall the classes altogether.  No French, no technology, nothing that <br/>\nresembles school or coursework.  And then just play.  Play video <br/>\ngames, watch tv or videos, listen to music, go oustide and explore <br/>\nbugs crawling in the grass.  <br/>\n<br/>\nNot finishing projects is common in humans.  Some of us have a <br/>\nmillion half-finished projects.  I&#39;m one of those.  It isn&#39;t the <br/>\ncreating something it is the creating that I am interested in.  It&#39;s <br/>\nsort of like once I have figured out how to do something I am ready <br/>\nto move on.  I&#39;m a rubberstamp artist and I&#39;m never content unless I <br/>\nam learning a new technique or style or paper craft.  Once I&#39;ve <br/>\nlearned and fairly mastered something I&#39;m ready to move on.  Daniel <br/>\nmay be like that.  He&#39;s figured out how it is done and now he is <br/>\nready to move on.<br/>\n<br/>\nIf he enjoys the engineering aspect, does he have toys/tools that <br/>\nfacilitate that?  Does he have Legos, Lincoln Logs, Erector Sets, <br/>\nK&#39;nex, etc?  What about having him design and build a play house in <br/>\nyour yard?    Maybe for your younger child?  Just ideas.<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hi From NZ! - New to Unschooling","postDate":"1107963263","msgId":4898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMkRDOUVELTdBQjAtMTFEOS1CRkNGLTAwMEE5NTdFRkU0NkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDUwMjA5MDY0OS4xY1lUOVB2bjNOWkZwTzNAbXgtYTA2NWIxOS5wYXMuc2EuZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDIwMDUwMjA5MDY0OS4xY1lUOVB2bjNOWkZwTzNAbXgtYTA2NWIxOS5wYXMuc2EuZWFydGhsaW5rLm5ldD4="},"prevInTopic":4897,"nextInTopic":4899,"prevInTime":4897,"nextInTime":4899,"topicId":4895,"numMessagesInTopic":0,"msgSnippet":"Hi Hilary - We need a collection of stories about kids who can t spell, have horrible penmanship, and are still turn out fine. There are lots of them out","messageBody":"<div id=\"ygrps-yiv-540299039\">Hi Hilary -<br/>\n<br/>\nWe need a collection of stories about kids who can&#39;t spell, have <br/>\nhorrible penmanship, and are still &quot;turn out fine.&quot;<br/>\n<br/>\nThere are lots of them out there. Spelling and penmanship are about the <br/>\ntwo most unimportant aspects of &quot;schooling&quot; that there are and also the <br/>\ntwo that parents worry about far far far too much.<br/>\n<br/>\nSpelling and penmanship (printing or cursive) are simply not important <br/>\nenough to spend 5 minutes a year worrying about!<br/>\n<br/>\nStop thinking about school subjects. Just think about what Daniel DOES <br/>\nlike to do and support more of that, to the degree he is interested. Do <br/>\nnot &quot;get him to do&quot; anything at all. HELP him do anything fun for him. <br/>\nDoes he like sports? Then offer some more sports opportunities. Video <br/>\ngames? Get new ones.<br/>\n<br/>\nI wish with all my heart that he could meet and really get to know all <br/>\nthe wonderful people in the world who are poor spellers and writers but <br/>\nare out there pursuing their life&#39;s passions with gusto and love. If <br/>\nyou think those are somehow critical for all children to learn, you&#39;ve <br/>\nbeen fed a lie and you&#39;ve swallowed it.<br/>\n<br/>\nDon&#39;t pick the things he&#39;s NOT good at or interested in to pay <br/>\nattention to - you&#39;re looking in the wrong direction and that makes YOU <br/>\npart of his problem. You need to be looking, all the time, at what <br/>\nmight interest him NOW. And please, YOU need to stop seeing him as a <br/>\nfailure because he was a bad fit with his school.  He&#39;s not a bad fit <br/>\nwith LIFE - not if you let him live his OWN life - help him find it.<br/>\n<br/>\nSchool is nonsense. Schooling is nonsense. It is all a complete huge <br/>\ngigantic hoax played on parents. It is unnecessary - completely totally <br/>\nabsolutely unnecessary - for kids to learn what they claim to teach in <br/>\nschools.<br/>\n<br/>\nPlease help him - let him deschool in peace while you learn about <br/>\nlearning.<br/>\n<br/>\nRead Frank Smith&#39;s &quot;The Book of Learning and Forgetting.&quot; Read John <br/>\nHolt. Read these lists and the unschooling message boards. Watch him, <br/>\nlove him, help him do what he wants to do no matter what it is. Offer, <br/>\ngently, nonschoolish things that you think he might want to do - go <br/>\nsurfing, skateboarding, take a trip, rent movies, whatever....nothing <br/>\nschool-like and nothing intended to somehow &quot;get him to&quot; learn some <br/>\nschoolish thing. That&#39;s manipulation. Don&#39;t do it. Be totally authentic <br/>\nwith him.<br/>\n<br/>\nAlso read: &quot;The Parent/Teen Breakthrough: A Relationship Approach.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 9, 2005, at 1:06 AM, Hilary Jackson wrote:<br/>\n<br/>\n&gt; Daniel has problems with handwriting (if he was labelled, he would <br/>\n&gt; prob be<br/>\n&gt; labelled with dysgraphia - very high reading level, but crappy <br/>\n&gt; speller), and<br/>\n&gt; so getting him to do anything in that vein is very very hard. It makes <br/>\n&gt; him<br/>\n&gt; feel bad - I think a hangover from school, felt like a real failure in <br/>\n&gt; the<br/>\n&gt; writing dept. </span></blockquote></div>","specialLinks":[]},{"userId":127741792,"authorName":"Hilary Jackson","from":"&quot;Hilary Jackson&quot; &lt;hilary@...&gt;","profile":"hilarylouisejackson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hi From NZ! - New to Unschooling","postDate":"1107939977","msgId":4895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":4897,"prevInTime":4894,"nextInTime":4896,"topicId":4895,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I just joined this list today. I live in beautiful NZ, have Daniel (just turned 11yrs) and Flynn (2.5yrs).  We are 6 months into our trailblazing ","messageBody":"<div id=\"ygrps-yiv-167580581\">Hi everyone,<br/>\n<br/>\nI just joined this list today. I live in beautiful NZ, have Daniel (just<br/>\nturned 11yrs) and Flynn (2.5yrs).  We are 6 months into our trailblazing<br/>\nbrand new life, and I am feeling some really uncomfy feelings coming up.<br/>\nNeed a group like this to speak my anxieties into!  I did find the<br/>\nunschooling message board (sandra Dodd) and she recommended this list. I<br/>\ndon;t know if many people are on both lists, so I apologise if the below is<br/>\na repeat to anyone!<br/>\n<br/>\nI feel like I am hitting so many brick walls with Daniel at the moment, and<br/>\njust wanted to ask for some advice, reflections, ways thru etc.<br/>\n<br/>\nI took Dan out of a Steiner School 6 months ago.  He had been asking for a<br/>\nwhile.  I finally listened.  He is happy to be out, but does miss some<br/>\naspects of school - mainly social although god knows that could be a total<br/>\ndisaster alot of the time too!  Now, so often he says he doesn&#39;t really want<br/>\nto do anything. Then he says that he is bored and why don&#39;t we do anything.<br/>\nI suggest things, and he either loses steam just outside of the starting<br/>\ngates or never ever finishes them. He tells me what he is interested in<br/>\ndoing, gets half way thru and drops it. Bookwork leaves him cold. We haven&#39;t<br/>\ndone anything at all in that way in the last 6 months.  He does do a few<br/>\nclasses with other homeschoolers - all his choice - he does French (doesn&#39;t<br/>\ndo anything outside the class), Sport and Technology(not computers, more<br/>\nengineering stuff). he likes these.<br/>\n<br/>\nDaniel has problems with handwriting (if he was labelled, he would prob be<br/>\nlabelled with dysgraphia - very high reading level, but crappy speller), and<br/>\nso getting him to do anything in that vein is very very hard. It makes him<br/>\nfeel bad - I think a hangover from school, felt like a real failure in the<br/>\nwriting dept. He has hardly handwritten a thing in the past 6 months - he<br/>\nseemed to hold so much pain around it. I did take him to a kinesiologist (as<br/>\nI&#39;ve mentioned) and we saw some improvements in his writing in a short time,<br/>\nbut now he says he hates doing the exercises, and its always such a mission<br/>\nto get him to do them (I&#39;m only talking 5-7 mins here - not half an hour!)<br/>\n<br/>\nI do have some tension in me about the whole ERO review (whenever that may<br/>\ncome - here in NZ the education review office reviews you sometime in the<br/>\nfirst 3 years - you never know when its coming, you get 3 weeks notice...),<br/>\nand I think some of this has leaked out onto him (damn - I&#39;m not perfect). I<br/>\nhave said that I need to have some way to &quot;document&quot; what he is learning<br/>\nabout.... and that that doesn;t have to mean essays and reports - it might<br/>\nmean a website of stuff which records what he has been doing that week. <br/>\n<br/>\nHe says he needs to move all the time, that he just can&#39;t stay still.<br/>\nAnything that smacks of schoolwork / bookwork just turns him off. I can just<br/>\nsee his energy leaking out of him if we even get close to doing something<br/>\nlike this.<br/>\n<br/>\nI feel like I am doing a crappy job just now and often feel like I don&#39;t<br/>\nreally know what to do.<br/>\n<br/>\nI asked him what he would really like to be doing. He says reading (he LOVES<br/>\nreading fiction and reads voraciously) playing with his friends, playing<br/>\ncomputer games and bike riding. That&#39;s about all he wants to do. Oh, and he<br/>\noccasionally does delve into writing science fantasy short stories a&#39; la&#39;<br/>\nAnne McCaffery Pern series kind of stuff.<br/>\n<br/>\nThe thing I find most difficult is the moochingness that he displays. Like<br/>\nhe is at this major loose end and I have to fix it. Its really challenging.<br/>\nI have to work hard not to get pissed off with him sometimes. I hate<br/>\nmoodiness and just find that kind of &quot;frozen&quot; mood he gets in hard. (guess<br/>\nhe does too) Arrgghh!<br/>\n<br/>\nI have a very wilful 2.5yr old as well, and this does place limits on what<br/>\nwe can and can&#39;t do. He interfere&#39;s with absolutely everything!! And, Dan<br/>\ngoes crazy with that!<br/>\n<br/>\nI guess I need to learn more about how he learns best. I just feel so lost<br/>\nright now.<br/>\n<br/>\nWhat did you do with your kids?? And with yourself? <br/>\n<br/>\nThanks for listening and look forward to hearing from you,<br/>\n<br/>\n Hilary<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":3745,"nextTopicId":4915}}