{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":255297978,"authorName":"Dawn Bennink","from":"&quot;Dawn Bennink&quot; &lt;bennink4@...&gt;","profile":"mhbmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws","postDate":"1164072764","msgId":19138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMzEwMWM3MGQwYyRmNDMxNzhjMCRkOTgyNWYxOEBCTFNDPg==","referencesHeader":"PDAwNDEwMWM3MGMyOCRlYmFmMmUyMCRkOTgyNWYxOEBCTFNDPiA8QkFZMTE5LURBVjY0QUI1NTUwQ0I3OTM4RTg1NDZFQUQzRUQwQHBoeC5nYmw+"},"prevInTopic":19079,"nextInTopic":0,"prevInTime":19137,"nextInTime":19139,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"... From: Lesa  ... I have a feeling one of my kids did some deleting and then sending, as I was in the middle of the message and then it","messageBody":"<div id=\"ygrps-yiv-1661636498\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\nFrom: &quot;Lesa&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lesajm@...\">lesajm@...</a>&gt;<br/>\n<br/>\n&gt; Dawn,<br/>\n&gt;<br/>\n&gt; The rest of your story disappeared!  I was interested in what you had to <br/>\n&gt; say<br/>\n&gt; because my DD (who is 10) has been dealing with the same thing with my <br/>\n&gt; mom..<br/>\n&gt; only about math and spelling.<br/>\n<br/>\nI have a feeling one of my kids did some deleting and then sending, as I was <br/>\nin the middle of the message and then it was just gone from my desktop with <br/>\nmore than half of it gone when it showed up in the group.  Sorry!  I&#39;ll try <br/>\nto reconstruct what I said.<br/>\n<br/>\nThe rest of the story is that he didn&#39;t want to be with my mother at all, <br/>\ncreating a fairly big issue.  Their once very close relationship was <br/>\nsuffering.  It got the point, before resolved, where my son was made to feel <br/>\nashamed for asking her what something said in a magazine, newspaper, on <br/>\ntelevision or on a video game and he avoided all reading or situations where <br/>\nit might come up in her house for fear of starting up the whole <br/>\nconversation.<br/>\n<br/>\nI finally made her understand that by pushing her own agenda and respecting <br/>\nneither my choices nor my son&#39;s feelings, she was alienating him and <br/>\ninsuring that he&#39;d see reading as a &quot;have to&quot; rather than something <br/>\ndesirous.   I had to act as a mediator for a good long time before their <br/>\nrelationship got back to something reasonable.  It&#39;s still not totally <br/>\nright, and she still does not always remember to keep her mouth shut with <br/>\nhim, but it&#39;s better.  He&#39;s learning to laugh at her when she pretends not <br/>\nto be saying anything but says something.  They aren&#39;t all good yet, but <br/>\nthey are getting there.<br/>\n<br/>\nMy children&#39;s relationship, as well as mine and my husband&#39;s, is irreparably <br/>\ndamaged with most of my in-laws.  My boys have had to listen to my in-laws <br/>\nsay some wholly inappropriate and nasty things about them.  They get grilled <br/>\nwith math facts and such.  They even had to deal with CPS coming to our <br/>\nhouse because a &quot;well-meaning&quot; relative called them, concerned that our <br/>\nparenting and schooling style constituted emotional and educational neglect. <br/>\nApparently the relative thought that if they called I would be removed from <br/>\nthe home and all would be well with my husband coming to his senses and <br/>\nraising the boys &quot;right.&quot;  Sigh.  It all worked out fine, but it scared the <br/>\nbeejeebers out of the boys.<br/>\n<br/>\nI think in-laws have a very rocky path to tread when it comes to expressing <br/>\ntheir opinions about how their children and their children&#39;s spouses are <br/>\nraising their grandchildren.  While it seems on the face of it that even the <br/>\nmost concerned and well-meaning grandparents could only help with their <br/>\ncomments or suggestions, it really can damage not only their relationship <br/>\nwith the parents of the children but with the children themselves.  Nothing <br/>\nmy mother ever said or did was at all malicious.  But it made my son <br/>\nquestion things he didn&#39;t need to question and shook some of his security <br/>\nfor a while.  Kids are very in tune, I think, to getting mixed messages. <br/>\nThey and I have enough of that to contend with from my husband.  Having my <br/>\nmother either on-board or silent (except, of course, to me), is pretty <br/>\nimportant.<br/>\n<br/>\nFortunately, btw, my in-laws live hundreds and even thousands of miles from <br/>\nus.  I guess that&#39;s the interesting part.  All of their judgment and <br/>\nhostility are based on them seeing my children no more often than every <br/>\nother year, and the most offensive ones have seen no more than three times <br/>\nin their 6 & 10 years.<br/>\n<br/>\nDawn. </span></blockquote></div>","specialLinks":[]},{"userId":284798598,"authorName":"Alice Roddy","from":"Alice Roddy &lt;amar0514412000@...&gt;","profile":"amar0514412000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Overcoming Objections from Inlaws","postDate":"1164027689","msgId":19079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMTIwMTMwMTI5LjgxMjUxLnFtYWlsQHdlYjU4NTE0Lm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":19076,"nextInTopic":19138,"prevInTime":19078,"nextInTime":19080,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"Reading your stories about the wounded people who reared several of you or your spouses, I recall a someone of my generation telling me, My best friend and I","messageBody":"<div id=\"ygrps-yiv-1980059115\">Reading your stories about the wounded people who reared several of you<br/>\nor your spouses, I recall a someone of my generation telling me, &quot;My<br/>\nbest friend and I had a friendly competition to see who could be the<br/>\nbest mother. Now all of our children are angry with us.&quot; She is<br/>\nterribly hurt and has major difficulties dealing with her adult<br/>\nchildren who are as yet unable to extend to her the same understanding<br/>\nand forgiveness that they do to their friends of their own generation.<br/>\nI guess that children are not the only ones hurt by the dominate,<br/>\nmanipulate and control school of parenting. <br/>\n<br/>\nI believe that<br/>\nmost grandparents love their grandchildren and want the best for them<br/>\nand I can also see how some are so damaged that they don&#39;t know how to<br/>\ndo it. <br/>\n<br/>\nGramma Alice <br/>\n<br/>\nBreastfeeding is the<br/>\nbiological norm for infants. It is a relationship that provides food,<br/>\nconnection, protection from illness to the baby and stress reducing<br/>\nhormones to the mother.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa","from":"&quot;Lesa&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws","postDate":"1164010397","msgId":19076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExOS1EQVY2NEFCNTU1MENCNzkzOEU4NTQ2RUFEM0VEMEBwaHguZ2JsPg==","referencesHeader":"PDAwNDEwMWM3MGMyOCRlYmFmMmUyMCRkOTgyNWYxOEBCTFNDPg=="},"prevInTopic":19075,"nextInTopic":19079,"prevInTime":19075,"nextInTime":19077,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"Dawn, The rest of your story disappeared!  I was interested in what you had to say\nbecause my DD (who is 10) has been dealing with the same thing with my mom..","messageBody":"<div id=\"ygrps-yiv-1600413258\">Dawn,\r<br/>\n\r<br/>\nThe rest of your story disappeared!  I was interested in what you had to say<br/>\nbecause my DD (who is 10) has been dealing with the same thing with my mom..<br/>\n only about math and spelling.\r<br/>\n\r<br/>\n \r<br/>\nLesa M.\r<br/>\nMy Blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeacademy.homeschooljournal.net\">http://lifeacademy.homeschooljournal.net</a>\r<br/>\nMy eBay Store: <a rel=\"nofollow\" target=\"_blank\" href=\"http://store.auctiva.com/lesajm\">http://store.auctiva.com/lesajm</a>\r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: Dawn Bennink\r<br/>\nDate: 11/19/06 23:58:37\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws\r<br/>\n \r<br/>\nI&#39;ve thought of responding to a few of the emails on this subject, but \r<br/>\nwasn&#39;t sure what to say. I feel for Alice and for Sylvia, and for all of \r<br/>\nus, frankly.\r<br/>\n\r<br/>\nMy mother is great with the kids and gives them skills and experiences that \r<br/>\nare very important to them. She&#39;s a much better grandparent than she was \r<br/>\nparent. However, we&#39;ve only recently come to an understanding that she \r<br/>\nreally needs to back off in driving her own agenda with my children when it \r<br/>\nis in direct opposition to the decisions we&#39;ve made. For example, she was \r<br/>\nriding and riding my now 10 year old about his reading to the point where it<br/>\n\r<br/>\nwas a huge source of stress for him, one that he carried home from being \r<br/>\nwith her. Instead of motivating him, it was making him not want to read a \r<br/>\nthing and not want to spend any time with \r<br/>\n\r<br/>\n\r<br/>\n \r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":255297978,"authorName":"Dawn Bennink","from":"&quot;Dawn Bennink&quot; &lt;bennink4@...&gt;","profile":"mhbmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws","postDate":"1163974826","msgId":19075,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDEwMWM3MGMyOCRlYmFmMmUyMCRkOTgyNWYxOEBCTFNDPg==","referencesHeader":"PDIwMDYxMTE5MjAzMDI4LjY3NjI3LnFtYWlsQHdlYjMxNDAyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":19065,"nextInTopic":19076,"prevInTime":19074,"nextInTime":19076,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"I ve thought of responding to a few of the emails on this subject, but wasn t sure what to say.  I feel for Alice and for Sylvia, and for all of us, frankly. ","messageBody":"<div id=\"ygrps-yiv-1213122804\">I&#39;ve thought of responding to a few of the emails on this subject, but <br/>\nwasn&#39;t sure what to say.  I feel for Alice and for Sylvia, and for all of <br/>\nus, frankly.<br/>\n<br/>\nMy mother is great with the kids and gives them skills and experiences that <br/>\nare very important to them.  She&#39;s a much better grandparent than she was <br/>\nparent.  However, we&#39;ve only recently come to an understanding that she <br/>\nreally needs to back off in driving her own agenda with my children when it <br/>\nis in direct opposition to the decisions we&#39;ve made.  For example, she was <br/>\nriding and riding my now 10 year old about his reading to the point where it <br/>\nwas a huge source of stress for him, one that he carried home from being <br/>\nwith her.  Instead of motivating him, it was making him not want to read a <br/>\nthing and not want to spend any time with</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws","postDate":"1163973885","msgId":19065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjExMTkxNDA0dDI4Y2ZjYjQ3aGU5YWNiNWIxNDFjZjgzOTZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDIwMDYxMTE5MTUyNTQ2LjI2OTM0LnFtYWlsQHdlYjU4NTAxLm1haWwucmUzLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYxMTE5MTUyNTQ2LjI2OTM0LnFtYWlsQHdlYjU4NTAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":19064,"nextInTopic":19075,"prevInTime":19064,"nextInTime":19066,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"... Hmmm.  I m not sure I think of my relationship with other people in terms of this is how I treat this relative but more of a case of this is how I","messageBody":"<div id=\"ygrps-yiv-62776661\">On 11/19/06, Alice Roddy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amar0514412000@...\">amar0514412000@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You are likely to be someone&#39;s MIL someday and you are now teaching your children how you are to be dealt with.<br/>\n&gt;<br/>\n </span></blockquote> Hmmm.  I&#39;m not sure I think of my relationship with other people in<br/>\nterms of &quot;this is how I treat this relative&quot; but more of a case of<br/>\n&quot;this is how I expect to be treated and when there isn&#39;t a healthy<br/>\nrelationship I refuse to be party to its unhealthfulness.&quot;  I don&#39;t<br/>\nbelieve that I have to have a relationship with someone just because I<br/>\nam somehow related to them.  We chose several years ago to discontinue<br/>\na relationship with Dan&#39;s mom.  I don&#39;t see it as teaching our<br/>\nchildren to ignore and abandon abusive people, but as having the<br/>\nstrength to build healthy relationships and recognize when those<br/>\nrelationships are abusive, neglectful and co-dependent.  With my own<br/>\nmother we have had to firmly say, &quot;We will not discuss schooling,<br/>\nhome, public, un, or otherwise as you refuse to read the information<br/>\nwe have shared with you and you continue to belittle our decisions.&quot;<br/>\nIt&#39;s difficult when you have people in your lives that continue to<br/>\nthink that your decisions were wrong and remind you often of that.<br/>\n<br/>\nMichelle - with a beautiful created family!</div>","specialLinks":[]},{"userId":171724177,"authorName":"Kelly Weyd","from":"Kelly Weyd &lt;kellmar98@...&gt;","profile":"kellmar98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws","postDate":"1163968227","msgId":19064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMTE5MjAzMDI4LjY3NjI3LnFtYWlsQHdlYjMxNDAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDYxMTE5MTc1OTA0Ljc0MjM3LnFtYWlsQHdlYjUzODA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":19063,"nextInTopic":19065,"prevInTime":19063,"nextInTime":19065,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"Sylvia, I have a MIL that is a very Catholic.  She went to Catholic school and sees things like what you described A, B, and C till you reach the right","messageBody":"<div id=\"ygrps-yiv-1982555119\">Sylvia,<br/>\n  I have a MIL that is a &quot;very&quot; Catholic.  She went to Catholic school and sees things like what you described A, B, and C till you reach the right place.  Actually I&#39;m not sure what this has to do with being Catholic, but she very much sees life in a certain way.  Their is no &quot;out of the box&quot; thinking.  She HATES that we are Homeschooling.  If I presented the idea of &quot;Unschooling&quot; to her she would crap herself and then turn us into Social Services.  She and other family members will grill my kids in a &quot;catch you offguard&quot; way to see if my kids know anything.......because the world will fall apart if they don&#39;t know how to spell certain words and know certain math facts by a certain age.  My 8 year old does not like being put on the spot, and my 6 year old is good at ignoring or saying she does not want to talk right now.  So 6 year old is able to handle it, and my poor 8 year old has to be rescued every time.  I try to ignore my MIL (and my SIL for that matter, who hates<br/>\n homeschooling even more) and keep the peace, but I understand what you are saying.........it&#39;s not easy, and it&#39;s not easy figuring out how to handle it.  I have a feeling for us that the situation is going to become more and more uncomfortable as the girls get older, and express the things they are doing (or not doing).  My hubby has told his Mother, more than once, to butt out.......that the two of us are raising the girls the way we want to raise them.  So, I&#39;m sorry for your situation, but I&#39;m right there with you.<br/>\n  Kelly<br/>\n<br/>\n<br/>\n          Hi Alice, and thanks for choosing my situation -- I could really use some help in this one! I like the overall tone of your suggestion for how to answer the questions. There are some parts I&#39;d like to play with, so I&#39;ve excerpted from your post.<br/>\n<br/>\nTaking Sylvia&#39;s situation as an example, <br/>\nMIL wrote: &quot;Sylvia, how are the boys coming along with their homeschooling? Trips<br/>\nto the museum/zoo and activities with their fellow homeschoolers must<br/>\nkeep them busy. I was just thinking about a writing project for<br/>\nAndrew--how about he wrote letters to us? This way, he&#39;ll develop his<br/>\ncreative writing as well as handwriting skills, learn about the postal<br/>\nsystem, etc. We in turn could write regularly to him and encourage him.<br/>\nJust a thought.&quot;<br/>\n<br/>\nSylvia sees some pitfalls but there is also the possibility of a beneficial relationship. Sylvia could reshape the proposal a bit. She might express appreciation that grandma wants to know grandson better, then state that at this point penmanship and content are mutually exclusive but that email would allow Andrew to express himself while his penmanship develops by other means. <br/>\n<br/>\n**** <br/>\nI like the way you speak to his penmanship, without it feeling like we&#39;re apologizing for his lack of skill. And I&#39;d like to encourage real relationship between them and the boys. Heck, I&#39;d be happy if they could know Gary (dh) as he really is, and not &#39;their son&#39; as they think he is. Maybe they&#39;d come to appreciate how wonderful he is and stop blaming themselves for the parts of him that don&#39;t fit their expectations. It&#39;s not that they don&#39;t like him, it&#39;s that he&#39;s not what they expected and my mil has borne it as if she&#39;d failed him -- I see that in her when she confides to me her worries about Gary. She is so over-invested in how he didn&#39;t turn out the way she expected, she can&#39;t appreciate fully who he is. Like she ordered chocolate, got strawberry and likes it well enough, but it&#39;s still not chocolate and she can&#39;t let go of that.<br/>\n<br/>\nHowever, they really don&#39;t want to know Andy the person better -- they want to know &#39;their grandson&#39; better, within a very tiny box they allow as normal. We&#39;ve tried to share with them and define some of who Andy is (his &#39;differences&#39; from their perspective) -- their response to was to ask how we were going to &#39;fix&#39; those differences. Basically, how to make him &#39;normal&#39; because they just can&#39;t wrap their minds around why anyone would &#39;choose&#39; to be different. They do mean well, and they love him very much, but I&#39;m beginning to think they are truly incapable of understanding him -- for me, it&#39;s like trying to describe a particular shade of red to someone who is color-blind. <br/>\n<br/>\n*****<br/>\n<br/>\nIf she fears that Grandma will edit and correct Andrew, she can warn that such criticism is likely to dishearten Andy to the point where he won&#39;t want to write and suggest that Grandma can best teach by modeling correct spelling and grammar. <br/>\n<br/>\nThat is one of our concerns, and one that Gary will address. I won&#39;t be answering this particular request -- I just don&#39;t have what it takes to do that graciously at this point in time. <br/>\n<br/>\n******<br/>\nOne if the things a good relationship with the older generations might teach the younger is that you don&#39;t have to agree in order to get along. I doubt you want the kids to pick up the idea that it is OK to write someone out of your life because you disagree with them. <br/>\n<br/>\nI don&#39;t want them to learn that -- and I don&#39;t model that. I have relationship with both of my parents, with whom I do disagree about many things. The difference there is that my parents have learned that I&#39;m not open to being pushed to their side, and won&#39;t allow my kids to be pushed either. I&#39;ve never found a successful way of drawing this boundary with his parents, short of just not having conversation with them.<br/>\n<br/>\n******<br/>\nYou are likely to be someone&#39;s MIL someday and you are now teaching your children how you are to be dealt with.<br/>\n<br/>\nI know this and I want to model the highest behavior I can for them. I wonder how I&#39;ll respond someday if one of the boys brings home a woman who thinks it&#39;s perfectly okay to put her tiny newborn in daycare, with formula and a stranger, while she pursues a career. Really strongly hoping that never happens! &lt;g&gt;<br/>\n<br/>\n******<br/>\n<br/>\nAs for her motivation, ie, wanting to compare Andy with others in the family, it is important to be careful about the stories we tell ourselves about other&#39;s motivation, especially when we&#39;re making someone a villain. I learned to ask myself, &quot;Why would an otherwise decent, rational, reasonable person be doing this (other than to hurt me)?&quot; from the book Crucial Conversations, a book that changed my life. For one thing, it showed me how much trouble I made for myself by assuming the motivations of others.<br/>\n<br/>\nIt&#39;s not that she would do that for the purpose of showing off -- that&#39;s my Dad&#39;s game. It&#39;s that her world is one where all people porgress from A, to B, to C, and so on util they reach the &#39;right place&#39; -- no variance, no backsteps, no unique paths. Any detours from the normal pace is seen as a failure on someone&#39;s part. Without any of the waymarks everyone uses, she has nothing to assure herself that the boys are okay, and I have no useful (to her) waymarks to offer her. It feels very much like an impasse. <br/>\n<br/>\nAs usual, as I type this, I come across more insights about myself and the situation. I&#39;m looking forward to more insights on this topic -- Gary still hasn&#39;t written that email replying to her suggestion. &lt;g&gt;<br/>\n<br/>\nSylvia<br/>\n<br/>\n---------------------------------<br/>\nSponsored Link<br/>\n<br/>\nMortgage rates near 39yr lows. $420,000 Mortgage for $1,399/mo - Calculate new house payment<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nSponsored Link<br/>\n<br/>\nMortgage rates near 39yr lows. $510,000 Mortgage for $1,698/mo -   Calculate new house payment<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws","postDate":"1163959144","msgId":19063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMTE5MTc1OTA0Ljc0MjM3LnFtYWlsQHdlYjUzODA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDYxMTE5MTUyNTQ2LjI2OTM0LnFtYWlsQHdlYjU4NTAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":19059,"nextInTopic":19064,"prevInTime":19062,"nextInTime":19064,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"Hi Alice, and thanks for choosing my situation -- I could really use some help in this one!  I like the overall tone of your suggestion for how to answer the","messageBody":"<div id=\"ygrps-yiv-2135796395\">Hi Alice, and thanks for choosing my situation -- I could really use some help in this one!  I like the overall tone of your suggestion for how to answer the questions.  There are some parts I&#39;d like to play with, so I&#39;ve excerpted from your post.<br/>\n   <br/>\n  Taking Sylvia&#39;s situation as an example, <br/>\nMIL wrote: &quot;Sylvia, how are the boys coming along with their homeschooling? Trips<br/>\nto the museum/zoo and activities with their fellow homeschoolers must<br/>\nkeep them busy. I was just thinking about a writing project for<br/>\nAndrew--how about he wrote letters to us? This way, he&#39;ll develop his<br/>\ncreative writing as well as handwriting skills, learn about the postal<br/>\nsystem, etc. We in turn could write regularly to him and encourage him.<br/>\nJust a thought.&quot;<br/>\n<br/>\nSylvia sees some pitfalls but there is also the possibility of a beneficial relationship. Sylvia could reshape the proposal a bit. She might express appreciation that grandma wants to know grandson better, then state that at this point penmanship and content are mutually exclusive but that email would allow Andrew to express himself while his penmanship develops by other means. <br/>\n   <br/>\n  **** <br/>\n  I like the way you speak to his penmanship, without it feeling like we&#39;re apologizing for his lack of skill.  And I&#39;d like to encourage real relationship between them and the boys.  Heck, I&#39;d be happy if they could know Gary (dh) as he really is, and not &#39;their son&#39; as they think he is.  Maybe they&#39;d come to appreciate how wonderful he is and stop blaming themselves for the parts of him that don&#39;t fit their expectations.  It&#39;s not that they don&#39;t like him, it&#39;s that he&#39;s not what they expected and my mil has borne it as if she&#39;d failed him -- I see that in her when she confides to me her worries about Gary.  She is so over-invested in how he didn&#39;t turn out the way she expected, she can&#39;t appreciate fully who he is.  Like she ordered chocolate, got strawberry and likes it well enough, but it&#39;s still not chocolate and she can&#39;t let go of that.<br/>\n   <br/>\n  However, they really don&#39;t want to know Andy the person better -- they want to know &#39;their grandson&#39; better, within a very tiny box they allow as normal.  We&#39;ve tried to share with them and define some of who Andy is (his &#39;differences&#39; from their perspective) -- their response to was to ask how we were going to &#39;fix&#39; those differences.  Basically, how to make him &#39;normal&#39; because they just can&#39;t wrap their minds around why anyone  would &#39;choose&#39; to be different.  They do mean well, and they love him very much, but I&#39;m beginning to think they are truly incapable of understanding him -- for me, it&#39;s like trying to describe a particular shade of red to someone who is color-blind. <br/>\n   <br/>\n  *****<br/>\n   <br/>\n  If she fears that Grandma will edit and correct Andrew, she can warn that such criticism is likely to dishearten Andy to the point where he won&#39;t want to write and suggest that Grandma can best teach by modeling correct spelling and grammar. <br/>\n<br/>\n  That is one of our concerns, and one that Gary will address.  I won&#39;t be answering this particular request -- I just don&#39;t have what it takes to do that graciously at this point in time.  <br/>\n   <br/>\n  ******<br/>\n  One if the things a good relationship with the older generations might teach the younger is that you don&#39;t have to agree in order to get along. I doubt you want the kids to pick up the idea that it is OK to write someone out of your life because you disagree with them. <br/>\n<br/>\n  I don&#39;t want them to learn that -- and I don&#39;t model that.  I have relationship with both of my parents, with whom I do disagree about many things.  The difference there is that my parents have learned that I&#39;m not open to being pushed to their side, and won&#39;t allow my kids to be pushed either.  I&#39;ve never found a successful way of drawing this boundary with his parents, short of just not having conversation with them.<br/>\n   <br/>\n  ******<br/>\n  You are likely to be someone&#39;s MIL someday and you are now teaching your children how you are to be dealt with.<br/>\n<br/>\n  I know this and I want to model the highest behavior I can for them.  I wonder how I&#39;ll respond someday if one of the boys brings home a woman who thinks it&#39;s perfectly okay to put her tiny newborn in daycare, with formula and a stranger, while she pursues a career.  Really strongly hoping that never happens! &lt;g&gt;<br/>\n   <br/>\n  ******<br/>\n  <br/>\nAs for her motivation, ie, wanting to compare Andy with others in the family, it is important to be careful about the stories we tell ourselves about other&#39;s motivation, especially when we&#39;re making someone a villain. I learned to ask myself, &quot;Why would an otherwise decent, rational, reasonable person be doing this (other than to hurt me)?&quot; from the book Crucial Conversations, a book that changed my life. For one thing, it showed me how much trouble I made for myself by assuming the motivations of others.<br/>\n<br/>\n  It&#39;s not that she would do that for the purpose of showing off -- that&#39;s my Dad&#39;s game.  It&#39;s that her world is one where all people porgress from A, to B, to C, and so on util they reach the &#39;right place&#39; -- no variance, no backsteps, no unique paths.  Any detours from the normal pace is seen as a failure on someone&#39;s part.  Without any of the waymarks everyone uses, she has nothing to assure herself that the boys are okay, and I have no useful (to her) waymarks to offer her.  It feels very much like an impasse. <br/>\n<br/>\n  As usual, as I type this, I come across more insights about myself and the situation. I&#39;m looking forward to more insights on this topic -- Gary still hasn&#39;t written that email replying to her suggestion. &lt;g&gt;<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nSponsored Link<br/>\n<br/>\nMortgage rates near 39yr lows. $420,000 Mortgage for $1,399/mo - Calculate new house payment<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Overcoming Objections from Inlaws","postDate":"1163956255","msgId":19059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMTE5MTcxMDU2LjIwMDM1LnFtYWlsQHdlYjU0MTExLm1haWwueWFob28uY29tPg=="},"prevInTopic":19057,"nextInTopic":19063,"prevInTime":19058,"nextInTime":19060,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"Gramma Alice, I wish my kids had a grandparent like you. If you ever write a book on how to be a good grandparent, I ll buy the first two! My own mother, who","messageBody":"<div id=\"ygrps-yiv-1692093361\">Gramma Alice,<br/>\nI wish my kids had a grandparent like you.<br/>\nIf you ever write a book on how to be a good grandparent,<br/>\nI&#39;ll buy the first two!<br/>\nMy own mother, who lives only a mile down the road,<br/>\nrefuses to be a grandmother to any of her grand kids<br/>\nbut one. (She has nine)<br/>\nMy MIL who lives with us, sees grand kids as her personal<br/>\nservants or people whom should constantly be criticized or<br/>\nyelled at.<br/>\nNeither do I want to be like.  <br/>\nThank goodness that there are better examples out there to learn from.<br/>\n<br/>\nVicki <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284798598,"authorName":"Alice Roddy","from":"Alice Roddy &lt;amar0514412000@...&gt;","profile":"amar0514412000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Overcoming Objections from Inlaws","postDate":"1163949946","msgId":19057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMTE5MTUyNTQ2LjI2OTM0LnFtYWlsQHdlYjU4NTAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":19059,"prevInTime":19056,"nextInTime":19058,"topicId":19057,"numMessagesInTopic":0,"msgSnippet":"I m a grandmother educating my granddaughter at home so, obviously, I m somebody s Mother In Law (dreaded words) and I d like to offer a few words from my","messageBody":"<div id=\"ygrps-yiv-751296572\">I&#39;m a grandmother educating my granddaughter at home so, obviously, I&#39;m somebody&#39;s Mother In Law (dreaded words) and I&#39;d like to offer a few words from my perspective. Like most grandparents, I want to be very involved in my grandchildren&#39;s lives, which I want to be happy and that means not going to war with my DILs. I have been at a loss at times as to what the parents want of me. I&#39;ve had to say to them, &quot;Tell me what you want of me.&quot; But I remember vividly and painfully how I would watch my mother and MIL with my children and be quite critical of them. Once I jumped on my mother to prevent her from trying to &#39;teach&#39; my oldest to like a variety of foods. I was right about that but where I was wrong was in not identifying and encouraging all the great things she could have been doing with them. I was still acting like a child, expecting (and fearing) the older generation&#39;s initiative without realizing that I could take initiative too. I could have been much more proactive <br/>\n in the things that would have benefited both young and old.<br/>\n<br/>\nTaking Sylvia&#39;s situation as an example, <br/>\nMIL wrote: &quot;Sylvia, how are the boys coming along with their homeschooling? Trips<br/>\nto the museum/zoo and activities with their fellow homeschoolers must<br/>\nkeep them busy. I was just thinking about a writing project for<br/>\nAndrew--how about he wrote letters to us? This way, he&#39;ll develop his<br/>\ncreative writing as well as handwriting skills, learn about the postal<br/>\nsystem, etc. We in turn could write regularly to him and encourage him.<br/>\nJust a thought.&quot;<br/>\n<br/>\nSylvia sees some pitfalls but there is also the possibility of a beneficial relationship. Sylvia could reshape the proposal a bit. She might express appreciation that grandma wants to know grandson better, then state that at this point penmanship and content are mutually exclusive but that email would allow Andrew to express himself while his penmanship develops by other means. If she fears that Grandma will edit and correct Andrew, she can warn that such criticism is likely to dishearten Andy to the point where he won&#39;t want to write and suggest that Grandma can best teach by modeling correct spelling and grammar. <br/>\n<br/>\nOne if the things a good relationship with the older generations might teach the younger is that you don&#39;t have to agree in order to get along. I doubt you want the kids to pick up the idea that it is OK to write someone out of your life because you disagree with them. <br/>\n<br/>\nYou are likely to be someone&#39;s MIL someday and you are now teaching your children how you are to be dealt with.<br/>\n<br/>\nAs for her motivation, ie, wanting to compare Andy with others in the family, it is important to be careful about the stories we tell ourselves about other&#39;s motivation, especially when we&#39;re making someone a villain. I learned to ask myself, &quot;Why would an otherwise decent, rational, reasonable person be doing this (other than to hurt me)?&quot; from the book Crucial Conversations, a book that changed my life. For one thing, it showed me how much trouble I made for myself by assuming the motivations of others.<br/>\n<br/>\nNow, my problem is that while I get that it is education that is important, rather than schools, and that the goal is learning, rather than teaching, my DIL does not.  She expects her daughter to jump on her command. For instance, yesterday she demanded that her daughter turn off the TV and come to dinner in the middle of a show the child was watching. The daughter had a melt down, no surprise. She wants to send the girl to a private school. If the appropriate attitude is that &quot;grandma had her chance and now the mother and should do it her way&quot;, then I can&#39;t educate  the girl at home. (Background: I recently bought a home with my son and now live with them. I wouldn&#39;t dream of criticizing how my DIL mothers; she is a very good mother and she and my granddaughter love each other dearly; I do however model a different way of relating to the child. In as much as it works, I expect my DIL to see that. She can learn from live too.)<br/>\n <br/>\nGramma Alice<br/>\n<br/>\nBreastfeeding is the biological norm for infants. It is a relationship that provides food, connection, protection from illness to the baby and stress reducing hormones to the mother.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":19085,"nextTopicId":19136}}