{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":127741792,"authorName":"Hilary Jackson","from":"&quot;Hilary Jackson&quot; &lt;hilary@...&gt;","profile":"hilarylouisejackson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"FW:  Once Upon a Town -- Welcome to Allopath","postDate":"1119355351","msgId":5670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":5669,"nextInTime":5671,"topicId":5670,"numMessagesInTopic":0,"msgSnippet":"A rather brilliant commentary on health & healing....  bound to promote some interesting discussion with our kids... Warm thoughts Hilary Sunday, June 19, 2005","messageBody":"<div id=\"ygrps-yiv-1850379610\">A rather brilliant commentary on health & healing....  bound to promote some<br/>\ninteresting discussion with our kids... <br/>\n <br/>\n Warm thoughts<br/>\nHilary<br/>\n <br/>\n <br/>\n <br/>\nSunday, June 19, 2005      &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newstarget.com/008674.html\">http://www.newstarget.com/008674.html</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newstarget.com/008674.html\">http://www.newstarget.com/008674.html</a> <br/>\n<br/>\nWelcome to the town of Allopath<br/>\n<br/>\nThere once was a town called Allopath. It had many people, streets and cars,<br/>\nbut due to budget limitations, there were no stop signs or traffic lights<br/>\nanywhere in Allopath. <br/>\n<br/>\nNot surprisingly, traffic accidents were common. Cars would crash into each<br/>\nother at nearly every intersection. But business was booming for the auto<br/>\nrepair shops and local hospitals, which dominated the<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newstarget.com/002268.html\">http://www.newstarget.com/002268.html</a>&gt; economy of Allopath. <br/>\n<br/>\n<br/>\nAs the population of Allopath grew, traffic accidents increased to an<br/>\nalarming level. Out of desperation, the city council hired Doctor West, a<br/>\ndoctor of the Motor Division (M.D.) to find a solution. <br/>\n<br/>\n<br/>\nDr. West spent days examining traffic accidents. He carried an assortment of<br/>\ntechnical gear -- microscopes, chemical analysis equipment, lab gear -- and<br/>\nput them all to work as part of his investigation. The townspeople of<br/>\nAllopath watched on with great curiosity while Dr. West went about his work,<br/>\nmeticulously documenting and analyzing each traffic accident, and they<br/>\nawaited his final report with great interest. <br/>\n<br/>\n<br/>\nAfter weeks of investigation, Dr. West called the people of Allopath to a<br/>\ntown meeting for the release of his report. There, in front of the city<br/>\ncouncil and most of the residents of Allopath, he announced his findings:<br/>\n&quot;Traffic accidents are caused by skid marks.&quot; <br/>\n<br/>\n<br/>\nAs Dr. West explained, he found and documented a near-100% correlation<br/>\nbetween traffic accidents and skid marks. &quot;Wherever we find these cars<br/>\ncolliding,&quot; he explained, &quot;we also find these skid marks.&quot; <br/>\n<br/>\n<br/>\nThe town had &quot;Skid Marks Disease,&quot; the doctor explained, and the answer to<br/>\nthe town&#39;s epidemic of traffic accidents would, &quot;...require nothing more<br/>\nthan treating Skid Marks Disease by making the streets skid-proof,&quot; Dr. West<br/>\nexclaimed, to great applause from the townspeople. <br/>\n<br/>\n<br/>\nThe city paid Dr. West his consulting fee, then asked the good doctor to<br/>\npropose a method for treating this Skid Marks Disease. As chance would have<br/>\nit, Dr. West had recently been on a trip to Hawaii paid for by a chemical<br/>\ncompany that manufactured roadaceuticals: special chemicals used to treat<br/>\nroads for situations just like this one. He recommended a particular<br/>\nchemical coating to the city council: teflon. <br/>\n<br/>\n<br/>\n&quot;We can treat this Skid Marks Disease by coating the roads with teflon,&quot; Dr.<br/>\nWest explained. &quot;The streets will then be skid-proof, and all the traffic<br/>\naccidents will cease!&quot; He went on to describe the physical properties of<br/>\nteflon and how its near-frictionless coating would deter nearly all vehicle<br/>\nskids. <br/>\n<br/>\n<br/>\nThe city council heartily agreed with Dr. West, and they issued new public<br/>\nbonds to raise the money required to buy enough teflon to coat all the<br/>\ncity&#39;s streets. Within weeks, the streets were completely coated, and the<br/>\nskid marks all but disappeared. <br/>\n<br/>\n<br/>\nThe city council paid Dr. West another consulting fee and thanked him for<br/>\nhis expertise. The problem of traffic accidents in Allopath was solved, they<br/>\nthought. Although the cure was expensive, they were convinced it was worth<br/>\nit. <br/>\n<br/>\n<br/>\nBut things weren&#39;t well in Allopath. Traffic accidents quadrupled. Hospital<br/>\nbeds were overflowing with injured residents. Auto repair businesses were<br/>\nbooming so much that most of the city council members decided to either open<br/>\ntheir own car repair shops or invest in existing ones. <br/>\n<br/>\n<br/>\nWeek after week, more and more residents of Allopath were injured, and their<br/>\ncars were repeatedly damaged. Money piled into the pockets of the car repair<br/>\nshops, hospitals, tow truck companies and car parts retailers. <br/>\n<br/>\n<br/>\nThe town economic advisor, observing this sharp increase in economic<br/>\nactivity, announced that Allopath was booming. Its economy was healthier<br/>\nthan ever, and Allopath could look forward to a great year of economic<br/>\nprosperity! <br/>\n<br/>\n<br/>\nThere were jobs to be had at the car repair shops. There were more nurses<br/>\nneeded at the hospital. &quot;Help wanted&quot; signs appeared all over town at the<br/>\nparamedic station, the tow truck shops, and the auto glass businesses.<br/>\nUnemployment dropped to near zero. <br/>\n<br/>\n<br/>\nBut the traffic accidents continued to increase. And yet there were no skid<br/>\nmarks. <br/>\n<br/>\n<br/>\nThe city council was baffled. They thought they had solved this problem.<br/>\nSkid Marks Disease had been eradicated by the teflon treatment. Why were<br/>\ntraffic accidents still happening? <br/>\n<br/>\n<br/>\nThey called a town meeting to discuss the problem, and following a short<br/>\ndiscussion of the problem, an old hermit, who lived in the forest just<br/>\noutside of Allopath, addressed the townspeople. &quot;There is no such thing as<br/>\nSkid Marks Disease,&quot; he explained. &quot;This disease was invented by the<br/>\nroadaceuticals company to sell you teflon coatings.&quot; <br/>\n<br/>\n<br/>\nThe townspeople were horrified to hear such a statement. They knew Skid<br/>\nMarks Disease existed. The doctor had told them so. How could this hermit,<br/>\nwho had no Motor Division (M.D.) degree, dare tell them otherwise? How could<br/>\nhe question their collective town wisdom in such a way? <br/>\n<br/>\n<br/>\n&quot;This is a simple problem,&quot; the hermit continued. &quot;All we need to do is<br/>\nbuild stop signs and traffic lights. Then the traffic accidents will cease.&quot;<br/>\n<br/>\n<br/>\n<br/>\nWithout pause, one city council member remarked, &quot;But how can we afford stop<br/>\nsigns? We&#39;ve spent all our money on teflon treatments!&quot; <br/>\n<br/>\n<br/>\nThe townspeople agreed. They had no money to buy stop signs. <br/>\n<br/>\n<br/>\nAnother council member added, &quot;And how can we stop anyway? The streets are<br/>\nall coated with teflon. If we build stop signs, we&#39;ll waste all the money<br/>\nwe&#39;ve spent on teflon!&quot; <br/>\n<br/>\n<br/>\nThe townspeople agreed, again. What use were stop signs if they couldn&#39;t<br/>\nstop their cars anyway? <br/>\n<br/>\n<br/>\nThe hermit replied, &quot;But the stop signs will eliminate the need for teflon.<br/>\nPeople will be able to stop their cars, and accidents will cease. The<br/>\nsolution is simple.&quot; <br/>\n<br/>\n<br/>\nBut what might happen if stop signs actually worked, the townspeople<br/>\nwondered. How would it affect the booming economy of Allopath? Realizing the<br/>\nconsequences, a burly old man who owned a local repair shop jumped to his<br/>\nfeet and said, &quot;If we build these stop signs, and traffic accidents go down,<br/>\nI&#39;ll have to fire most of my workers!&quot; <br/>\n<br/>\n<br/>\nIt was at that moment that most of the townspeople realized there own jobs<br/>\nwere at stake. If stop signs were built, nearly everyone would be<br/>\nunemployed. They all had jobs in emergency response services, car repair<br/>\nshops, hospitals and teflon coating maintenance. Some were now sales<br/>\nrepresentatives of the roadaceuticals company. Others were importers of<br/>\nglass, tires, steel and other parts for cars. A few clever people were<br/>\nmaking a fortune selling wheelchairs and crutches to accident victims. <br/>\n<br/>\n<br/>\nOne enterprising young gentleman started a scientific journal that published<br/>\nresearch papers describing all the different kind of Skid Marks Diseases<br/>\nthat had been observed and documented. Another person, a<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newstarget.com/006746.html\">http://www.newstarget.com/006746.html</a>&gt; fitness enthusiast, organized an<br/>\nannual run to raise funds to find the cure for Skid Marks Disease. It was a<br/>\npopular event, and all the townspeople participated as best they could:<br/>\njogging, walking, or just pushing themselves along in their wheelchairs. <br/>\n<br/>\n<br/>\nOne way or another, nearly everyone in Allopath was economically tied to<br/>\nSkid Marks Disease. <br/>\n<br/>\n<br/>\nOut of fear of losing this economic prosperity, the townspeople voted to<br/>\ncreate a new public safety agency: the Frequent Drivers Association (FDA).<br/>\nThis FDA would be responsible for approving or rejecting all signage,<br/>\ntechnology and chemical coatings related to the town&#39;s roads. <br/>\n<br/>\n<br/>\nThe FDA&#39;s board members were chosen from among the business leaders of the<br/>\ncommunity: the owner of the car shop, the owner of the ambulance company,<br/>\nand of course, Dr. West. <br/>\n<br/>\n<br/>\nSoon after its inception, the FDA announced that Skid Marks Disease was,<br/>\nindeed, very real, as it had been carefully documented by a doctor and<br/>\nrecently published in the town Skid Marks Disease journal. Since there were<br/>\nno studies whatsoever showing stop signs to be effective for reducing<br/>\ntraffic accidents, the FDA announced that stop signs were to be outlawed,<br/>\nand that any person attempting to sell stop signs would be charged with<br/>\nfraud and locked up in the town jail. <br/>\n<br/>\n<br/>\nThis pleased the townspeople of Allopath. With the FDA, they knew their jobs<br/>\nwere safe. They could go on living their lives of economic prosperity, with<br/>\nsecure jobs, knowing that the FDA would outlaw any attempt to take away<br/>\ntheir livelihood. They still had a lot of traffic accidents, but at least<br/>\ntheir jobs were secure. <br/>\n<br/>\n<br/>\nAnd so life continued in Allopath. For a short while, at least. As traffic<br/>\naccidents continued at a devastating rate, more and more residents of<br/>\nAllopath were injured or killed. Many were left bed-ridden, unable to work,<br/>\ndue to their injuries. <br/>\n<br/>\n<br/>\nIn time, the population dwindled. The once-booming town of Allopath<br/>\neventually became little more than a ghost town. The hospital closed its<br/>\ndoors, the FDA was disbanded, and the Skid Marks Disease journal stopped<br/>\nprinting. <br/>\n<br/>\n<br/>\nThe few residents remaining eventually realized nothing good had come of<br/>\nSkid Marks Disease, the teflon coatings and the FDA. No one was any better<br/>\noff, as all the town&#39;s money had been spent on the disease: the teflon<br/>\ncoatings, car parts and emergency services. No one was any healthier, or<br/>\nhappier, or longer-lived. Most, in fact, had lost their entire families to<br/>\nSkid Marks Disease. <br/>\n<br/>\n<br/>\nAnd the hermit? He continued to live just outside of town, at the end of a<br/>\nwinding country road, where he lived a simple life with no cars, no roads,<br/>\nno teflon coatings and no FDA. <br/>\n<br/>\n<br/>\nHe outlived every single resident of Allopath. He gardened, took long walks<br/>\nthrough the forest, and gathered roots, leaves and berries to feed himself.<br/>\nIn his spare time, he constructed stop signs, waiting for the next<br/>\npopulation to come along, and hoping they might listen to an old hermit with<br/>\na crazy idea: <br/>\n<br/>\n<br/>\n...that prevention is the answer, not the treatment of symptoms. <br/>\n<br/>\n<br/>\nThis fable was authored by Mike Adams, the Health Ranger. You may reprint or<br/>\nrepost, as long as appropriate credit is given to Mike Adams at<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newstarget.com/\">http://www.newstarget.com/</a>&gt; www.NewsTarget.com <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":5669,"nextTopicId":5673}}