{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Post from anon member","postDate":"1154436426","msgId":16068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhbmlnYSs4MnI5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyNzYwMWM2YjRlYiRjYmVkYTA2MCQwMzAyYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":16067,"nextInTopic":16070,"prevInTime":16067,"nextInTime":16069,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... Yow! And he thinks it is okay to do this? And you think it s okay to accept his behaving this way toward you? (not even getting into what the kids are","messageBody":"<div id=\"ygrps-yiv-1102356091\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Rue Kream&quot; &lt;skreams@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; posted on behalf of anonymous member:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  And yes if I had been the one to leave it open he<br/>\n&gt; would definitely have yelled and cursed at me! <br/>\n </span></blockquote>Yow! And he thinks it is okay to do this? And you think it&#39;s okay to <br/>\naccept his behaving this way toward you? (not even getting into what <br/>\nthe kids are learning from this). Unfortunately, school wouldn&#39;t <br/>\nsolve it because he&#39;d still be there when they got home from school. <br/>\nAnd there&#39;d be yelling and cursing because they scraped a hole in a <br/>\npair of jeans when they were on the playground...<br/>\n<br/>\nThis is way bigger than simply figuring out what to do about the <br/>\nkids.<br/>\n<br/>\n(BTW I agree with other posts that it sounds like the bigger kids <br/>\nneed more running room that they aren&#39;t getting cause you&#39;ve got <br/>\nyour hands full with the little ones. Finding ways for them to burn <br/>\nenergy - at-home things like punching bags, mini trampolines, actual <br/>\nsafe mats for wrestling around on, whatever and/or ways to get them <br/>\nout to a park or something where they can run, even if that means <br/>\nspending $20/week to hire a teenager to run around with them for a <br/>\nfew hours)<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154431517","msgId":16070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBNTBDNUQwLTkxMDYtNDNEMC04MkQwLTQyRDIwNURBOUZCOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAyNzYwMWM2YjRlYiRjYmVkYTA2MCQwMzAyYThjMEBsaXZpbmdyb29tMT4=","referencesHeader":"PDAyNzYwMWM2YjRlYiRjYmVkYTA2MCQwMzAyYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":16068,"nextInTopic":0,"prevInTime":16069,"nextInTime":16071,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... They obviously have a need to get into the freezer. See your job as helping them get what they need. How can they get what they want *and* keep the door","messageBody":"<div id=\"ygrps-yiv-2053548390\">On Jul 31, 2006, at 5:53 PM, Rue Kream wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Oh they do know, I have told them many times.  Dh is the one that&#39;s  <br/>\n&gt; told<br/>\n&gt; them not to open<br/>\n<br/>\n </span></blockquote>They obviously have a need to get into the freezer. See your job as  <br/>\nhelping them get what they need. How can they get what they want  <br/>\n*and* keep the door closed?<br/>\n<br/>\nCan you move the food they keep looking for?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; yes accidents do happen, and unfortunately my boys are sneaky  <br/>\n&gt; liars, though<br/>\n&gt; I hate to call them that. so maybe this is the result of  <br/>\n&gt; punishment, or<br/>\n&gt; trying to apply consequences to their actions.<br/>\n<br/>\n </span></blockquote>Absolutely. Lying is a defense response. If someone know telling the  <br/>\ntruth will get them in trouble it&#39;s more reasonable to lie.<br/>\n<br/>\nIf a policeman asked you if you caused a mess and you knew you&#39;d be  <br/>\nfined and made to clean it up if you admitted it by telling the truth  <br/>\nbut could avoid both by lying, which would you choose?<br/>\n<br/>\nIt seems we need to punish, though. If kids do wrong we need to teach  <br/>\nthem it was wrong by associating something bad with it.<br/>\n<br/>\nBut despite our society&#39;s absolute conviction that that is necessary,  <br/>\nit isn&#39;t. My daughter has never been punished and yet at 14 she&#39;s  <br/>\nkind and thoughtful and doesn&#39;t leave the freezer door hanging open  <br/>\nmore than anyone else.<br/>\n<br/>\nAnd it isn&#39;t because she&#39;s a perfect kid. It&#39;s because I always  <br/>\nassumed she meant well and was trying to do her best and helped her  <br/>\nclean up the mess and figure out a better way when her decisions  <br/>\ndidn&#39;t turn out as she&#39;d planned.<br/>\n<br/>\n From *kids* point of view our punishments are unreasonable. It&#39;s not  <br/>\nthat they don&#39;t understand that what they did was wrong, but  <br/>\npunishment assumes that either:<br/>\n<br/>\n1)They did it accidently because they were unaware and that  <br/>\npunishment will make them think next time.<br/>\n<br/>\nIt makes them think parents are unreasonable and don&#39;t understand!  <br/>\nBut little kids are unaware of their environment. It&#39;s just the way  <br/>\ntheir brains are wired -- or not yet wired really. Pain won&#39;t make  <br/>\nthose connections form faster. But it will put images of their  <br/>\nparents as angry and hurtful in their heads. Is that how you want to  <br/>\nbe remembered? We can&#39;t control what they will remember of their  <br/>\nchildhood. We can&#39;t assume that one good time with them will replace  <br/>\none bad time.<br/>\n<br/>\n2) Or someone stood poised for a moment between a good decision and a  <br/>\nbad one and chose the bad one deliberately.<br/>\n<br/>\nWhen we punish, kids know that both aren&#39;t true so the punishment is  <br/>\nunreasonable. It shows we don&#39;t understand them and what&#39;s going on  <br/>\ninside. It doesn&#39;t make them think more about what their being  <br/>\npunished for. It makes them think less of their parents.<br/>\n<br/>\nAnd people who are treated unreasonably, who feel the world doesn&#39;t  <br/>\nunderstand them, can lash out at the world. They&#39;re angry at being  <br/>\ntreated unfairly so they turn the anger back on the world.<br/>\n<br/>\nKids who are treated as though they are doing their best have no  <br/>\nreason to punish the world.<br/>\n<br/>\nRather than viewing your relationship with them as teaching them to  <br/>\nact right, view it as being their partner and *helping* them get what  <br/>\nthey want in  the world. They&#39;re going to make mistakes. When they  <br/>\ndo, help them. Clean up the mess and help them find better ways.  <br/>\nRather than turning the kids into the problem, engage them in solving  <br/>\nthe problem. How can we keep the freezer door from being left open.  <br/>\n(They may echo back your rules and that may feel satisfying. But you  <br/>\nwant new ideas because obviously the rules aren&#39;t working.)<br/>\n<br/>\nThe thing about rules is they&#39;re a substitute for being there with  <br/>\nthem. Rules are a substitute for us being more mindful of what they  <br/>\ncould conceivably do. Rules are passing off our responsibilities onto  <br/>\na child -- without asking if they want responsibility! -- and then  <br/>\npunishing the child when the child can&#39;t handle the responsibility.  <br/>\nIf we have breakables down where small children could pick them up,  <br/>\nthe solution isn&#39;t a rule not to touch. The solution is to put them  <br/>\nup and be there to show them how to handle them gently. If a freezer  <br/>\ndoor won&#39;t close, the solution isn&#39;t a rule, but fixing the freezer  <br/>\ndoor, putting a lock on it, putting a gate around the freezer,  <br/>\nputting it up high where the kids can&#39;t reach it ;-) But ultimately  <br/>\nthe children aren&#39;t responsible for keeping the food from defrosting.  <br/>\nThat&#39;s the parents&#39; job.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I explained the details in a different post. I felt the need to punish<br/>\n&gt; because I didn&#39;t know what else to do!<br/>\n<br/>\n </span></blockquote>Kids who are treated as though they can&#39;t be trusted often become  <br/>\nkids who can&#39;t be trusted. The transition period from distrusting  <br/>\nthem to trusting them will be difficult! Do a lot of apologizing for  <br/>\npast treatment. Tell them you&#39;re sorry you didn&#39;t know better but  <br/>\nknow you do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know if they really understood, though I explained it numerous<br/>\n&gt; times.<br/>\n<br/>\n </span></blockquote>We do need to explain. We need information about how the world works  <br/>\nout there. But we can&#39;t *depend* on them understanding. We can&#39;t hand  <br/>\nthem the information and expect them to handle it. We need to hold  <br/>\nonto the responsibility over whatever we&#39;re explaining for ourselves.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was right there.  Talking to them, trying to get them to stop.  <br/>\n&gt; Trying not<br/>\n&gt; to yell or be punitive. They kept right on. and on. and on.<br/>\n<br/>\n </span></blockquote>I suspect they  hear no a lot. It&#39;s become a buzz in their ears.<br/>\n<br/>\nRather than saying no, figure out how to say yes. Don&#39;t assume they  <br/>\nwant to destroy. If they&#39;re full of energy, they need to run. They  <br/>\nmay need to run more than you could believe possible. And to forge a  <br/>\ngood relationship, they need to feel as though their needs are your  <br/>\nnumber one priority.<br/>\n<br/>\nThat&#39;s going to be difficult! They&#39;re already convinced that their  <br/>\nneeds are secondary and come when it&#39;s convenient for parents. As  <br/>\nmuch as parents *say* their kids are number one priority, more often  <br/>\nit means after all the &quot;necessary&quot; things are done. And there&#39;s a  <br/>\n*huge* list of necessary things: laundry, cleaning, dinner, shopping,  <br/>\nspouse tending ....<br/>\n<br/>\nWe can&#39;t always drop what we&#39;re doing but if we build up in them  <br/>\nconfidence that &quot;In a minute&quot; really means in a minute and not &quot;When  <br/>\nit&#39;s convenient,&quot; and &quot;We&#39;ll do that soon,&quot; means we&#39;ll do that  <br/>\nreally soon and not &quot;If I wait long enough you&#39;ll forget.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I hope they learned that as a result of their not obeying, we were<br/>\n&gt; consistent in doing what we said we&#39;d do, which was not staying all<br/>\n&gt; afternoon at the amusement park. are you saying we should have  <br/>\n&gt; given in and<br/>\n&gt; stayed even though we had said we would not? (I&#39;m confused!) my mother<br/>\n&gt; would say I am never consistent enough and that I should definitely  <br/>\n&gt; not<br/>\n&gt; have given in.<br/>\n<br/>\n </span></blockquote>I think following through on  what we promise is important.<br/>\n<br/>\nBut I don&#39;t promising punishment is something we should be promising!<br/>\n<br/>\nNo, I don&#39;t think you should have &quot;given in&quot;. I think it would have  <br/>\nbeen better for your relationship, better for them to not view  <br/>\nmistakes as needing punishment.<br/>\n<br/>\nIf you were volunteering somewhere and you made a mistake, which  <br/>\nperson would you rather return to help: The person who ranted and  <br/>\nraved and punished you for a mistake or the person who assumed you  <br/>\nwere doing your best and said &quot;Here, let me help you,&quot; and showed you  <br/>\nhow to do it again?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I should rephrase that.  I want them to be free to do what they  <br/>\n&gt; want. I<br/>\n&gt; don&#39;t want to control them. I want them to be able to make their own<br/>\n&gt; choices. Not at the expense of the peace of the household. Not if  <br/>\n&gt; it means<br/>\n&gt; damaging things or making huge messes for me to clean up. Not if  <br/>\n&gt; they can&#39;t<br/>\n&gt; respect the needs of others.<br/>\n<br/>\n </span></blockquote>Part of their destruction and disrespect is from hearing no and not  <br/>\nbeing treated with respect.<br/>\n<br/>\nPart is probably because their kids and they need to be able to move  <br/>\nenergetically. They may need more frequent trips to the park, a mini  <br/>\ntrampoline, boffer swords and a back yard.<br/>\n<br/>\nThe problem is that you can&#39;t switch to treating them respectfully  <br/>\nand then expect them to know that know you trust them. :-/ You have  <br/>\nto regain their trust.<br/>\n<br/>\nThat doesn&#39;t though, mean letting them treat you and the house  <br/>\nhowever they wish.  But rather than no, when they&#39;re being energetic,  <br/>\nacknowledge that they&#39;re full of energy and help channel that energy  <br/>\nin more positive directions until you can get them out.<br/>\n<br/>\nUnlike conventional parenting, mindful parenting doesn&#39;t have  <br/>\nsupposed magic bullets. There isn&#39;t solution Y for when kids are  <br/>\ndoing X. It&#39;s all about building up a trusting relationship with the  <br/>\nkids so they *know* that you&#39;re their advocate, trying to help them  <br/>\nget what they want and need.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I try to see it from their perspective.  You think 8 and 5 is really<br/>\n&gt; little?  I think it is old enough to know better, old enough to  <br/>\n&gt; understand<br/>\n&gt; and remember things.  Am I wrong?<br/>\n<br/>\n </span></blockquote>Their actions are showing you you&#39;re wrong! ;-)<br/>\n<br/>\nRather than looking at their age, look at *them*. No matter that most  <br/>\nkids can read by 8 (or so) that doesn&#39;t help the child who won&#39;t read  <br/>\nuntil 12 read sooner. It will only make them feel bad about  <br/>\nthemselves. They will read, be aware of their environment, be aware  <br/>\nof their emotions and act rather than react when they&#39;re able and no  <br/>\namount of punishment or disapproval will make it happen sooner.  <br/>\n(Though if may delay it! Or it may make it seem so unpleasant that  <br/>\nkids don&#39;t want to.)<br/>\n<br/>\nRegaining their trust won&#39;t happen immediately. They&#39;re going to test  <br/>\nyou. If your husband cheated on you and then said &quot;I&#39;m sorry. I  <br/>\npromise I&#39;m a changed person and it won&#39;t happen again,&quot; would you  <br/>\nimmediately trust him? What could he do to help you rebuild  <br/>\nconfidence in him? The more seriously he treats the wound in your  <br/>\nconfidence, the more responsibility he takes in proving that he&#39;s  <br/>\ntrustworthy, the more it will help.<br/>\n<br/>\nHave you read How To Talk So Kids Will Listen (and Listen So Kids  <br/>\nWill Talk)?<br/>\n<br/>\nand<br/>\n<br/>\nSiblings Without Rivalry?<br/>\n<br/>\nThere&#39;s a lot more about punishments and relationships at:<br/>\n<br/>\nJoyfully Rejoycing<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154416715","msgId":16067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBRkQ1MjgzLTFGQTItNDkwMC1CRDgzLTE4MkNBRThCNTFCRUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAyNzYwMWM2YjRlYiRjYmVkYTA2MCQwMzAyYThjMEBsaXZpbmdyb29tMT4=","referencesHeader":"PDAyNzYwMWM2YjRlYiRjYmVkYTA2MCQwMzAyYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":16065,"nextInTopic":16068,"prevInTime":16066,"nextInTime":16068,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... Don t worry about being consistent - worry about being kind, considerate, rational, logical, thoughtful, understanding, empathetic...and all kinds of other","messageBody":"<div id=\"ygrps-yiv-1170686817\"><blockquote><span title=\"ireply\">&gt; I hope they learned that as a result of their not obeying, we were<br/>\n&gt; consistent in doing what we said we&#39;d do, which was not staying all<br/>\n&gt; afternoon at the amusement park. are you saying we should have  <br/>\n&gt; given in and<br/>\n&gt; stayed even though we had said we would not? (I&#39;m confused!) my mother<br/>\n&gt; would say I am never consistent enough and that I should definitely  <br/>\n&gt; not<br/>\n&gt; have given in.<br/>\n<br/>\n </span></blockquote>Don&#39;t worry about being consistent - worry about being kind,  <br/>\nconsiderate, rational, logical, thoughtful, understanding,  <br/>\nempathetic...and all kinds of other things, but consistency is NOT a  <br/>\nvirtue in and of itself - remember, people can be consistently cruel  <br/>\nand evil.<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154401874","msgId":16065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA3MzEyMDExcDc1OTM0YjYzazk3OGYxYjJhZmY4ZDU1ODBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPg==","referencesHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPg=="},"prevInTopic":16059,"nextInTopic":16067,"prevInTime":16064,"nextInTime":16066,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... Do they want to sell some of their toys on ebay to make up for it? Otherwise you are just further distancing trust in your family.  How will they learn to","messageBody":"<div id=\"ygrps-yiv-843184856\">On 7/31/06, Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; More:<br/>\n<br/>\n&gt; we could sell some of their toys on ebay to make up for it....they<br/>\n&gt; have so many. but that might seem like a punishment.<br/>\n&gt;<br/>\n </span></blockquote>Do they want to sell some of their toys on ebay to make up for it?<br/>\nOtherwise you are just further distancing trust in your family.  How<br/>\nwill they learn to trust you if you say that you forgive them and then<br/>\ncontinue to punish them for something that most likely was an<br/>\naccident?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; the specific things they were doing saturday, not limited to: running<br/>\n&gt; through the house, making tons of noise, jumping off furniture,<br/>\n&gt; throwing things, wrestling, hurting each other, throwing an entire<br/>\n&gt; container of pompoms around the room, destroying things, and not<br/>\n&gt; stopping when told to stop. or stopping for 30 seconds then starting<br/>\n&gt; again.  wild, noisy, destructive behavior.  this went on for hours it<br/>\n&gt; seems like.<br/>\n<br/>\n </span></blockquote>Where were you when this was going on?  Were you with them?  Engaging<br/>\nthem in an activity?  Finding something for them to do so that they<br/>\ncould safely and less destructively use their energy?  A romp in the<br/>\npark, bouncing on a mattress on the floor, tumbling on said mattress,<br/>\na gymnastics class or dance class or just a run around the block on<br/>\ntheir bikes or scooters (with mom joining them).  When my kids seem to<br/>\nbe &quot;cluttery&quot; and restless I know that is a big signal to get out of<br/>\nthe house and go somewhere.  Sometimes the park.  Sometimes the<br/>\nbookstore.  Sometimes the backyard.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I try to talk to them and interest them in other things.<br/>\n&gt;  I guess I never suggest the right things. plus I have a 3 yo and the<br/>\n&gt; baby. and of course lots of things to do. and pets to take care of.<br/>\n&gt; the house is no where near clean and toys everywhere, and that gets<br/>\n&gt; dh&#39;s panties in a bunch.<br/>\n<br/>\n </span></blockquote>There&#39;s the problem.  Have you suggested boxers or at the very least<br/>\nloose fitting briefs?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;ve read on this list that it is ok to tell children to stop if they<br/>\n&gt; are engaging in behaviors that bother other people (not in those<br/>\n&gt; words).  I was trying so hard to do that.  They will not listen to me,<br/>\n&gt; obey me, whatever word you want to use.  I ask them over and over to<br/>\n&gt; stop.<br/>\n<br/>\n </span></blockquote>You need to build trust and respect with them before you can expect<br/>\nthe same back.  Yelling at them constantly to do things that annoy you<br/>\nis not the way to build trust.  What are your priorities when it comes<br/>\nto your children?  To your family?  How will the words you say bring<br/>\nyou to a point where your children trust you and respect is mutual and<br/>\nyou are joyfully living your lives?<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":57631825,"authorName":"jehmen","from":"&quot;jehmen&quot; &lt;jehmen@...&gt;","profile":"hsmom2luge","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154385556","msgId":16059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWM2YjRmMiQyNzhmZDIyMCQzNDlkNWMzZkBtYWluPg==","referencesHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPiA8Ny4wLjEuMC4wLjIwMDYwNzMxMTczMDI4LjAxYjlkYjcwQGdhaWF3b2xmLm9yZz4="},"prevInTopic":16058,"nextInTopic":16065,"prevInTime":16058,"nextInTime":16060,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... The husband might need to see peace and joyfulness being modelled first. One can t impose change on anyone, but one can example the desired change. ~","messageBody":"<div id=\"ygrps-yiv-2048055017\"><blockquote><span title=\"ireply\">&gt;I just don&#39;t know what to do to have a<br/>\n&gt;joyful household.<br/>\n<br/>\n&gt;I think the first step has to be educating your husband about his <br/>\n&gt;role in a joyful house. He has to change first; then, I believe the <br/>\n&gt;kids will be able to respond in kind. Your husband has to understand <br/>\n&gt;that he is the impediment to a joyful household!<br/>\n<br/>\n </span></blockquote> The husband might need to see peace and joyfulness being modelled first.<br/>\nOne can&#39;t impose change on anyone, but one can example the desired change.<br/>\n ~ Kristin<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152271008,"authorName":"Rue Kream","from":"&quot;Rue Kream&quot; &lt;skreams@...&gt;","profile":"ruekream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Post from anon member","postDate":"1154382824","msgId":16058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNzYwMWM2YjRlYiRjYmVkYTA2MCQwMzAyYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPg=="},"prevInTopic":16057,"nextInTopic":16059,"prevInTime":16057,"nextInTime":16059,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"posted on behalf of anonymous member: ... Oh they do know, I have told them many times.  Dh is the one that s told them not to open it. And yes if I had been","messageBody":"<div id=\"ygrps-yiv-771118689\">posted on behalf of anonymous member:<br/>\n<br/>\n At 02:42 PM 7/31/2006 -0400, you wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   What if you or your husband had been the culprit? Would *you* then<br/>\n&gt;have to go to school to learn something? Who would yell and curse at<br/>\n&gt;you? If they aren&#39;t allowed to even open the freezer, how should they<br/>\n&gt;know that it must be shut all the way?<br/>\n<br/>\n </span></blockquote>Oh they do know, I have told them many times.  Dh is the one that&#39;s told<br/>\nthem not to open it. And yes if I had been the one to leave it open he<br/>\nwould definitely have yelled and cursed at me! (and yes I totally agree,<br/>\ngoing to school is not the answer).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   You really need to look at it from the point of view of two little<br/>\n&gt;boys who are *ONLY* eight and five. Their goal wasn&#39;t to ruin $200<br/>\n&gt;worth of food. It was to get ice or a Popsicle.<br/>\n<br/>\n </span></blockquote>yes I agree.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Accidents HAPPEN. Punishing for accidents makes people sneaky liars.<br/>\n<br/>\n </span></blockquote>yes accidents do happen, and unfortunately my boys are sneaky liars, though<br/>\nI hate to call them that. so maybe this is the result of punishment, or<br/>\ntrying to apply consequences to their actions.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  -=-=-=-=-<br/>\n&gt;<br/>\n&gt;   What rule did they break the night before? How did it relate to the<br/>\n&gt;amusement park? Why did you feel the need to punish at all?<br/>\n<br/>\n </span></blockquote>I explained the details in a different post. I felt the need to punish<br/>\nbecause I didn&#39;t know what else to do!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   They&#39;re REALLY little. Do you think they really understood your<br/>\n&gt;arbitrary consequence? Why?<br/>\n<br/>\n </span></blockquote>I don&#39;t know if they really understood, though I explained it numerous<br/>\ntimes.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Where were you during this &quot;disobedience&quot; that &quot;caused&quot; the loss of<br/>\n&gt;amusement park privilege? Why weren&#39;t you right here? Could it have<br/>\n&gt;been caused by hunger? Exhaustion? Pain?<br/>\n<br/>\n </span></blockquote>I was right there.  Talking to them, trying to get them to stop. Trying not<br/>\nto yell or be punitive. They kept right on. and on. and on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   -=-=-=-<br/>\n&gt;<br/>\n&gt;   Do *you* quit when *they* say Stop or Don&#39;t? I&#39;m sure they asked<br/>\n&gt;repeatedly to stay at the amusement park. You refused to listen. What<br/>\n&gt;do you think they learned from that?<br/>\n&gt;<br/>\n&gt;  --=-=-<br/>\n<br/>\n </span></blockquote>I hope they learned that as a result of their not obeying, we were<br/>\nconsistent in doing what we said we&#39;d do, which was not staying all<br/>\nafternoon at the amusement park. are you saying we should have given in and<br/>\nstayed even though we had said we would not? (I&#39;m confused!) my mother<br/>\nwould say I am never consistent enough and that I should definitely not<br/>\nhave given in.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  -=-=-=-<br/>\n&gt;<br/>\n&gt;  Yes I want them to be free and do what they want, as long as it does<br/>\n&gt;  not conflict with what they have been told!<br/>\n<br/>\n </span></blockquote>I should rephrase that.  I want them to be free to do what they want. I<br/>\ndon&#39;t want to control them. I want them to be able to make their own<br/>\nchoices. Not at the expense of the peace of the household. Not if it means<br/>\ndamaging things or making huge messes for me to clean up. Not if they can&#39;t<br/>\nrespect the needs of others.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  -=-=-=-<br/>\n&gt;<br/>\n&gt;  They may feel safer in school. Home seems spiteful and unreasonable.<br/>\n<br/>\n </span></blockquote>A saddening thought.  But I have sometimes wondered if it was true.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Have you ever looked at it from *their* perspective? They are really,<br/>\n&gt;really little. They need *help* in navigating this path. You&#39;re so busy<br/>\n&gt;throwing up roadblocks that they can&#39;t even SEE the road!<br/>\n<br/>\n </span></blockquote>I try to see it from their perspective.  You think 8 and 5 is really<br/>\nlittle?  I think it is old enough to know better, old enough to understand<br/>\nand remember things.  Am I wrong? How do I help them? What are these<br/>\nroadblocks you refer to? I want so much to do better for them I just don&#39;t<br/>\nknow what to do or how.  Except for the *wisdom* of conventional parenting<br/>\nwhich never seems to work either.<br/>\n<br/>\nThanks.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154382817","msgId":16057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDczMTE3NTIyNS4wMWJhM2MyOEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PDZGMDUzQkIwLUZDMUMtNDE5My04NkNCLTAwNzk2Q0QwRDE5NUBjb3gubmV0Pg==","referencesHeader":"PDIwMDYwNzMxMjEyMTA0LjU1NTEwLnFtYWlsQHdlYjU0NDEwLm1haWwueWFob28uY29tPiA8NkYwNTNCQjAtRkMxQy00MTkzLTg2Q0ItMDA3OTZDRDBEMTk1QGNveC5uZXQ+"},"prevInTopic":16056,"nextInTopic":16058,"prevInTime":16056,"nextInTime":16058,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... Yikes!!  Talk about consequences!!  I m glad you re still here to tell the tale! ~Marji [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1376676304\">At 17:35 7/31/2006, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;...however, when Bre&#39;s<br/>\n&gt;bussed pulled up, we had to hurry and quick to get her out the door.<br/>\n&gt;I stepped on one, flew backwards, wrenched my back out of place.<br/>\n&gt;Pinching that nerve was enough to deactivate my mitral valve (i have<br/>\n&gt;a bad heart) and next thing you know, I&#39;m in cardiac arrest on the<br/>\n&gt;floor, unable to move because my back is out of alignment, and the<br/>\n&gt;bus was still honking its horn outside. Sigh.<br/>\n<br/>\n </span></blockquote>Yikes!!  Talk about consequences!!  I&#39;m glad you&#39;re still here to <br/>\ntell the tale!<br/>\n<br/>\n~Marji<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154382632","msgId":16056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDczMTE3MzAyOC4wMWI5ZGI3MEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPg==","referencesHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPg=="},"prevInTopic":16055,"nextInTopic":16057,"prevInTime":16055,"nextInTime":16057,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... Oh boy.  You and the kids have my sympathy.  I wouldn t feel safe in a situation like that if it were me.  Is there anyway to help your husband understand","messageBody":"<div id=\"ygrps-yiv-2136022732\">At 16:22 7/31/2006, anon wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;...i should have made it clear that dh is the<br/>\n&gt;one who was ranting and raving, not me. i was telling him to calm<br/>\n&gt;down and get control of himself. he was threatening to sling the stuff<br/>\n&gt;across the garage, at which point i told him he&#39;d better not!<br/>\n<br/>\n </span></blockquote>Oh boy.  You and the kids have my sympathy.  I wouldn&#39;t feel safe in <br/>\na situation like that if it were me.  Is there anyway to help your <br/>\nhusband understand that his temper tantrums are interfering with your <br/>\nkids&#39; ability to be themselves and respond to their environment in a <br/>\npositive way?  If he can possibly understand that, in the absence of <br/>\na safe and peaceful environment, everything they do is in response to <br/>\nsome adversarial input.  They&#39;re really not getting the chance to be <br/>\nthemselves!  And, he should understand that their responses are <br/>\nactually entirely appropriate!  They&#39;re just trying to do the best <br/>\nthey can in that situation.  They&#39;re not being willfully disobedient; <br/>\nthey&#39;re being seen that way and they know it, so they have to do <br/>\nthings to either prove it or disprove it, and because of that, <br/>\nthey&#39;re not able to just be Who They Are.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;he is very immature in his reactions. he<br/>\n&gt;has no parenting skills. his answer to things is punishment/violence.<br/>\n&gt;often i try to stop him from the things he says and does, other times<br/>\n&gt;i honestly don&#39;t know what to do.<br/>\n<br/>\n </span></blockquote>Is he on-board somewhat with unschooling?  How much does he <br/>\nunderstand about how it works and how much does he support it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;we could sell some of their toys on ebay to make up for it....they<br/>\n&gt;have so many. but that might seem like a punishment.<br/>\n<br/>\n </span></blockquote>That&#39;s punitive!! Why should they have to give up something permanent <br/>\n(like a toy) for something temporary (like food)?  Think of it this <br/>\nway:  Let&#39;s say a house guest didn&#39;t know about the freezer door and <br/>\ncaused the food to spoil.  Would you present that person with a bill <br/>\nor suggest that they sell their stuff to reimburse you for the <br/>\nfood.  Now, they might offer to do that for you, and that&#39;s <br/>\ndifferent.  In fact, your kids might offer to sell off some toys to <br/>\nhelp cover the cost of the food, and that&#39;s entirely different.  But <br/>\nyou would never ask that house guest to do that, right? That would be <br/>\nweird, no?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;the specific things they were doing saturday, not limited to: running<br/>\n&gt;through the house, making tons of noise, jumping off furniture,<br/>\n&gt;throwing things, wrestling, hurting each other, throwing an entire<br/>\n&gt;container of pompoms around the room, destroying things, and not<br/>\n&gt;stopping when told to stop.<br/>\n<br/>\n </span></blockquote>Two things come to my mind.  First, is that they&#39;re young kids who <br/>\nneed a safe place to be able to do big physical play run-around play <br/>\nlike that.  Second, though, is that point I brought up earlier.  I <br/>\nbelieve you don&#39;t have their support because they don&#39;t have your <br/>\nhusband&#39;s support.  If they could feel a partnership from him they <br/>\nwould be more likely to respond to reasonable requests you may <br/>\nhave.  Being told to stop, though, is not reasonable in and of <br/>\nitself, especially when they&#39;re feeling antsy and needing to move and <br/>\nrun and play!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;...the house is no where near clean and toys everywhere, and that gets<br/>\n&gt;dh&#39;s panties in a bunch.<br/>\n<br/>\n </span></blockquote>You&#39;ve got quite a full plate!  Perhaps you and he can work together <br/>\nto find ways that your he can help rather than just criticize?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I just don&#39;t know what to do to have a<br/>\n&gt;joyful household.<br/>\n<br/>\n </span></blockquote>I think the first step has to be educating your husband about his <br/>\nrole in a joyful house.  He has to change first; then, I believe the <br/>\nkids will be able to respond in kind.  Your husband has to understand <br/>\nthat he is the impediment to a joyful household!<br/>\n<br/>\nThat&#39;s my opinion, anyway, for what it&#39;s worth.<br/>\n<br/>\nMarji <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154381708","msgId":16055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGMDUzQkIwLUZDMUMtNDE5My04NkNCLTAwNzk2Q0QwRDE5NUBjb3gubmV0Pg==","inReplyToHeader":"PDIwMDYwNzMxMjEyMTA0LjU1NTEwLnFtYWlsQHdlYjU0NDEwLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDYwNzMxMjEyMTA0LjU1NTEwLnFtYWlsQHdlYjU0NDEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":16054,"nextInTopic":16056,"prevInTime":16054,"nextInTime":16056,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"I had to LOL! on this, because I m thinking about four years ago we had an incident with stepping on toys. Primarily that it was really fun to roll them down","messageBody":"<div id=\"ygrps-yiv-1522937272\">I had to LOL! on this, because I&#39;m thinking about four years ago we  <br/>\nhad an incident with stepping on toys. Primarily that it was really  <br/>\nfun to roll them down our front entry and slam them off the front  <br/>\ndoor. not a problem for me, it was lots of fun. however, when Bre&#39;s  <br/>\nbussed pulled up, we had to hurry and quick to get her out the door.  <br/>\nI stepped on one, flew backwards, wrenched my back out of place.  <br/>\nPinching that nerve was enough to deactivate my mitral valve (i have  <br/>\na bad heart) and next thing you know, I&#39;m in cardiac arrest on the  <br/>\nfloor, unable to move because my back is out of alignment, and the  <br/>\nbus was still honking its horn outside. Sigh.<br/>\n<br/>\nSo when I ask the kids to pick up, they know it&#39;s very seriously  <br/>\ndangerous ;-) We all learned a lesson. I only wish it hadn&#39;t hurt so  <br/>\nmuch on my end...<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (9), Emily (7), Rachel (6), Sam (5), Dan  <br/>\n(3), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 31, 2006, at 4:21 PM, Manisha Kher wrote:<br/>\n&gt; Or don&#39;t throw toys because they may break<br/>\n&gt; and it hurts when I step on them. (I discovered<br/>\n&gt; yesterday that legos can really poke. So this is fresh<br/>\n&gt; in my mind :)<br/>\n&gt;<br/>\n&gt;&gt; .<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Post from anon member","postDate":"1154380864","msgId":16054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzMxMjEyMTA0LjU1NTEwLnFtYWlsQHdlYjU0NDEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPg=="},"prevInTopic":16050,"nextInTopic":16055,"prevInTime":16053,"nextInTime":16055,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... I would do that only if money was really tight. ... I have only 2 energetic kids (7 & 5) and unless they re destroying things or hurting each other, we ","messageBody":"<div id=\"ygrps-yiv-1549495090\"><blockquote><span title=\"ireply\">&gt; we could sell some of their toys on ebay to make up<br/>\n&gt; for it....they<br/>\n&gt; have so many. but that might seem like a punishment.<br/>\n<br/>\n </span></blockquote>I would do that only if money was really tight.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; the specific things they were doing saturday, not<br/>\n&gt; limited to: running<br/>\n&gt; through the house, making tons of noise, jumping off<br/>\n&gt; furniture,<br/>\n&gt; throwing things, wrestling, hurting each other,<br/>\n&gt; throwing an entire<br/>\n&gt; container of pompoms around the room, destroying<br/>\n&gt; things, and not<br/>\n&gt; stopping when told to stop. or stopping for 30<br/>\n&gt; seconds then starting<br/>\n&gt; again.  wild, noisy, destructive behavior.  <br/>\n<br/>\n </span></blockquote>I have only 2 energetic kids (7 & 5) and unless<br/>\nthey&#39;re destroying things or hurting each other, we<br/>\ndon&#39;t interfere. So running around the house, jumping<br/>\nor doing somersaults on furniture are normal<br/>\nactivities in my house. I think that they listen to my<br/>\n&quot;No&quot;s and &quot;Stop&quot;s if there are fewer of them. Now I<br/>\ndon&#39;t have a toddler and a baby and you definitely<br/>\nneed to keep the little ones safe. But it sounds like<br/>\nthey need more outlets for their energy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve read on this list that it is ok to tell<br/>\n&gt; children to stop if they<br/>\n&gt; are engaging in behaviors that bother other people<br/>\n&gt; (not in those<br/>\n&gt; words).  I was trying so hard to do that. <br/>\n </span></blockquote>Have you tried to explain what it is that&#39;s bothering<br/>\nyou? Like don&#39;t be so loud because the baby is<br/>\nsleeping. Or don&#39;t throw toys because they may break<br/>\nand it hurts when I step on them. (I discovered<br/>\nyesterday that legos can really poke. So this is fresh<br/>\nin my mind :)<br/>\n<br/>\nAnother thing to keep in mind - this is a process. I<br/>\nhave to say the same things again and again. They<br/>\noften forget, but I&#39;m hoping it sticks over time.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Post from anon member","postDate":"1154377342","msgId":16050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhbG9wdSs0dWFnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":16054,"prevInTime":16049,"nextInTime":16051,"topicId":16050,"numMessagesInTopic":0,"msgSnippet":"... hah! no, i certainly don t. i should have made it clear that dh is the one who was ranting and raving, not me.  i was telling him to calm down and get","messageBody":"<div id=\"ygrps-yiv-1585123204\">More:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Do you (or dh) really think that they&#39;ll become better<br/>\n&gt;at closing the freezer door by going to school?<br/>\n<br/>\n </span></blockquote>hah! no, i certainly don&#39;t. i should have made it clear that dh is the<br/>\none who was ranting and raving, not me.  i was telling him to calm<br/>\ndown and get control of himself. he was threatening to sling the stuff<br/>\nacross the garage, at which point i told him he&#39;d better not! yes i<br/>\nknow what you are thinking. he is very immature in his reactions. he<br/>\nhas no parenting skills. his answer to things is punishment/violence.<br/>\noften i try to stop him from the things he says and does, other times<br/>\ni honestly don&#39;t know what to do. threatening to send them to school<br/>\nis one of his favorites.  i&#39;ve learned a lot on this list, and have<br/>\nbeen trying to see things differently....trying not to deliver<br/>\npunishments, or consequences for their actions. trying to<br/>\nlet them have the freedom to make choices...when and what to eat etc.<br/>\n<br/>\nback to the freezer incident, i don&#39;t know which boy did it, they are<br/>\n5 and 8. the older boy opened the freezer to put in a box of freezer<br/>\npops. the younger one may have opened it to check on them afterwards.<br/>\nthis was yesterday (sunday). no it doesn&#39;t matter who did it. i told<br/>\nthem and dh it was an accident and told my 8 yo i forgave him (hoping<br/>\nthat would help him feel better).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Could you involve them in salvaging the food? Could you<br/>\n&gt;involve them in your budget and in deciding what needs<br/>\n&gt;to be dropped because the money now needs to go for<br/>\n&gt;groceries. I don&#39;t mean this in a punishment sort of<br/>\n&gt;way, but the way you would deal with this if either<br/>\n&gt;you or dh left the door open by mistake.<br/>\n<br/>\n </span></blockquote>we could sell some of their toys on ebay to make up for it....they<br/>\nhave so many. but that might seem like a punishment.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;You didn&#39;t mention the age of your boys and how long<br/>\n&gt;have you been homeschooling/unschooling.<br/>\n<br/>\n </span></blockquote>they are 5 and 8, almost 6 and 9.  the oldest boy went to montessori<br/>\npreschool/k 3 mornings a week at age 4, 5, and 6. then i was doing<br/>\nFIAR with him. then last summer started sonlight with him...big<br/>\nmistake there! had a baby at the end of nov, tried to start school<br/>\nwork back up jan 1, met with more resistance than ever before. was so<br/>\nfrustrated i put him in public 2nd grade for march, april and may. i<br/>\nregretted it and still do! since then i have been investigating<br/>\nunschooling.  the 5 yo went to a little preschool 2 mornings a week<br/>\nthis last fall and winter. part of me wants to unschool because it<br/>\nseems so much easier, another part of me wants to do *some* work with<br/>\nthem. but nothing like we were doing with sonlight!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  You talk<br/>\n&gt;about them disbeying but don&#39;t mention any specifics.<br/>\n&gt;What behaviour is it that needs to be changed? I think<br/>\n&gt;you&#39;ll get more helpful replies if you give specific<br/>\n&gt;examples.<br/>\n<br/>\n </span></blockquote>the specific things they were doing saturday, not limited to: running<br/>\nthrough the house, making tons of noise, jumping off furniture,<br/>\nthrowing things, wrestling, hurting each other, throwing an entire<br/>\ncontainer of pompoms around the room, destroying things, and not<br/>\nstopping when told to stop. or stopping for 30 seconds then starting<br/>\nagain.  wild, noisy, destructive behavior.  this went on for hours it<br/>\nseems like.  I try to talk to them and interest them in other things.<br/>\n I guess I never suggest the right things. plus I have a 3 yo and the<br/>\nbaby. and of course lots of things to do. and pets to take care of. <br/>\nthe house is no where near clean and toys everywhere, and that gets<br/>\ndh&#39;s panties in a bunch.<br/>\n<br/>\nI&#39;ve read on this list that it is ok to tell children to stop if they<br/>\nare engaging in behaviors that bother other people (not in those<br/>\nwords).  I was trying so hard to do that.  They will not listen to me,<br/>\nobey me, whatever word you want to use.  I ask them over and over to<br/>\nstop.  the only thing that will stop them is when dh comes and yells<br/>\nat them. he is fond of issuing threats that i don&#39;t agree with or that<br/>\ncould never be followed up on.  I just don&#39;t know what to do to have a<br/>\njoyful household.<br/>\n<br/>\nI will write more later.<br/>\n<br/>\nThanks!</div>","specialLinks":[]}],"prevTopicId":16037,"nextTopicId":11439}}