{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":196090915,"authorName":"jnjstau@direcway.com","from":"jnjstau@...","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Detoxing","postDate":"1130593359","msgId":7229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5OTA5NDg1OThlMTAxLjU5OGUxMDE1OTkwOTQ4QGRpcmVjd2F5LmNvbT4="},"prevInTopic":7228,"nextInTopic":0,"prevInTime":7228,"nextInTime":7230,"topicId":7222,"numMessagesInTopic":0,"msgSnippet":"Joanne, It sounds like you have a young man on overload .  It can happen when people make a sudden, drastic switch to radical unschooling.  You had always","messageBody":"<div id=\"ygrps-yiv-1423492024\">Joanne,<br/>\n<br/>\nIt sounds like you have a young man on &quot;overload&quot;.  It can happen when people make a sudden, drastic switch to radical unschooling.  You had always been his safety net, making his decisions for him.  Now he is revelling in his freedom but at the same time, nervous about lack of a safety net while he is doing very new things.<br/>\n<br/>\nI would suggest rather than having &quot;no bedtime&quot; that you have a gradual transition to bedtime.  Something of a routine (brush teeth, put on pj&#39;s, read a book, cuddle and talk, etc.).  Not a rushed &quot;Oh my God, we HAVE to be in bed by 9).  But thinking that somewhere between 9 and 11 or so, he would usually be going to bed.  When your son gets used to flexibility, he will have a much easier transition to making all those decisions himself.<br/>\n<br/>\nAlso, sometimes you do need to set limits even with radically unschooled kids, just like you sometimes have to set limits with adults.  People don&#39;t get to stomp on other people&#39;s rights so that they can do what they want.  You might need to talk to your son about how you don&#39;t deserve him being mad and grumpy at you if he wants to stay up AND go to riding lessons.  You might need to talk to him about how somebody has to clean up the messes he makes at stores.  Empathy is important.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Joanne &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:oh.kneel@...\">oh.kneel@...</a>&gt;<br/>\nDate: Friday, October 28, 2005 6:44 pm<br/>\nSubject: [unschoolingbasics] Detoxing<br/>\n<br/>\n&gt; I just need to connect with the group.  We are new to unschooling <br/>\n&gt; and actually feel that the best match for our son and our family <br/>\n&gt; would be what is now loosely described as radical unschooling.  <br/>\n&gt; But <br/>\n&gt; my dh and I are really detoxing!  I will only speak for myself <br/>\n&gt; from <br/>\n&gt; this point on but I feel like I am on an emotional roller coaster. <br/>\n&gt; <br/>\n&gt; Ds (5) digss up all the shale from the back path to make a <br/>\n&gt; volcano.  <br/>\n&gt; DH and I both have strong feelings but work it through had allow <br/>\n&gt; him <br/>\n&gt; to proceed without dumping any further judgment on him.  He makes <br/>\n&gt; an <br/>\n&gt; awesome volcano which then the family fills with baking soda and <br/>\n&gt; vinegar and it erupts.  It was just great.  Another episode, DS is <br/>\n&gt; now choosing to stay up very late (way past us guessing 3:00 a.m. <br/>\n&gt; or <br/>\n&gt; so) and is sleeping past noon.  When we wake him for his horseback <br/>\n&gt; riding lesson he is angry that he has been woken.  Now dh and I <br/>\n&gt; are <br/>\n&gt; wondering if we are doing the wrong thing allowing him to choose <br/>\n&gt; when he is sleeping half the day and so cranky.  Another episode, <br/>\n&gt; ds <br/>\n&gt; goes to store and gets overstimulated (my fault ad choice for him) <br/>\n&gt; and climbs up the metal staircase for employees and won&#39;t get <br/>\n&gt; down.  <br/>\n&gt; Then when he does runs all over the store as I try to chase him <br/>\n&gt; (and <br/>\n&gt; catch him).  When I catch him his body almost seems to relax.  I <br/>\n&gt; then carry him out of the store.  I feel frazzled but glad I can <br/>\n&gt; talk with him calming not get angry.  Another on going challenge <br/>\n&gt; ds <br/>\n&gt; just takes something he does want and throws it on the floor.  (I <br/>\n&gt; have asked if he could put it in the garbage or give it to me or <br/>\n&gt; leave it on the table.....)  Another episode, after dinner Ds <br/>\n&gt; wants <br/>\n&gt; me to play tag (again) with he and his friend.  I say (which is <br/>\n&gt; consistent on my part) that after dinner mommy likes to wind down. <br/>\n&gt; <br/>\n&gt; I like to read and be quieter and get ready for bed.  I would be <br/>\n&gt; happy to watch a movie with him.  He then gets angry and tells me <br/>\n&gt; that Since I don&#39;t do his needs he is not listening to me.  This <br/>\n&gt; time I wait. He doesn&#39;t throw his food on the floor, he doesn&#39;t <br/>\n&gt; run <br/>\n&gt; out the door, he doesn&#39;t start knocking things over.  But he has <br/>\n&gt; done all of those things at others times this week.  So I guess I <br/>\n&gt; am <br/>\n&gt; saying that we are transitioning and like giving birth it is <br/>\n&gt; uncomfortable and hard work at times.  I am not someone who cries <br/>\n&gt; easily and yet I feel teary.  I am tired. I am sad for the time I <br/>\n&gt; had put him in school.  I am frustrated that I can&#39;t reach him <br/>\n&gt; better at times.  I am ashamed that I don&#39;t know more about what <br/>\n&gt; to <br/>\n&gt; do to diffuse the situation.  I offer to come close.  I offer to <br/>\n&gt; hold him.  I offer to give him space.  I just want someone to know <br/>\n&gt; that we are hurting.  When you drink too much and discover you are <br/>\n&gt; an alcoholic, one can chose to detox and then begin to recover one <br/>\n&gt; day at a time.  Well we lived a way that was unhelpful to ds and <br/>\n&gt; have discovered that we need to detox from not only school and <br/>\n&gt; expectations but our own upbringings.  We have a strong desire to <br/>\n&gt; find a new way for ds and us but it is really hard right now.  I <br/>\n&gt; just didn&#39;t want to be alone with all of these new feelings.  <br/>\n&gt; Sorry <br/>\n&gt; for the lengthy share.  I just needed to know someone out there <br/>\n&gt; might be able to offer me some hope.  Joanne<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------ Yahoo! Groups Sponsor --------------------<br/>\n&gt; ~--&gt; <br/>\n&gt; Get fast access to your favorite Yahoo! Groups. Make Yahoo! your <br/>\n&gt; home page<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/dpRU5A/wUILAA/yQLSAA/0xXolB/TM\">http://us.click.yahoo.com/dpRU5A/wUILAA/yQLSAA/0xXolB/TM</a><br/>\n&gt; -------------------------------------------------------------------<br/>\n&gt; -~-&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Detoxing","postDate":"1130557961","msgId":7228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRqdXJtOSsyN3FlQGVHcm91cHMuY29tPg=="},"prevInTopic":7222,"nextInTopic":7229,"prevInTime":7227,"nextInTime":7229,"topicId":7222,"numMessagesInTopic":0,"msgSnippet":"Ds (5) digss up all the shale from the back path to make a volcano. DH and I both have strong feelings but work it through had allow him to proceed without","messageBody":"<div id=\"ygrps-yiv-1585785\">&quot;Ds (5) digss up all the shale from the back path to make a volcano.<br/>\nDH and I both have strong feelings but work it through had allow him<br/>\nto proceed without dumping any further judgment on him.&quot;<br/>\n<br/>\nI think that&#39;s really COOl that you could stand back and watch his<br/>\ncreative genius at work! Very cool.<br/>\nI think I would offer to set up an area with his own rocks and<br/>\nmaterials for future use, so you can have your path too.<br/>\n<br/>\nSometimes, when things like this come up, I try to imagine a few years<br/>\ndown the road....looking back, a messed up path won&#39;t seem like such a<br/>\nbig deal. If I really liked my path and didn&#39;t want it messed up<br/>\nthough, I&#39;d let my children know it wasn&#39;t ok. I&#39;d load them into the<br/>\nvan and head to the nearest home improvement store to get them volcano<br/>\nmaterials!!<br/>\n<br/>\n<br/>\nI&#39;m having trouble cutting and pasting tonight..so I&#39;m going on memory<br/>\nfrom here on;<br/>\n<br/>\nAs far as running up a metal staircase and running all over the<br/>\nstore...If I knew my child was overstimulated, I would try to leave<br/>\nvery quickly. I get very firm when my children are heading into<br/>\nsomething that is either dangerous or off limits. By firm, that means<br/>\nI state very loudly &quot;STOP&quot; or something to that effect. By saving a<br/>\nfirm voice for important moments, they usually freeze and look at me.<br/>\nNot always.<br/>\nI have a four year old that is VERY high energy, VERY independent and<br/>\nVERY destructive at times.  It sometimes means a physical restraint of<br/>\nsome kind, which these days involves picking him up and holding him<br/>\nuntil I can be sure it is safe to put him down.<br/>\nWhen I&#39;m holding him and talking to him, he is more likely to really<br/>\nhear me. <br/>\n<br/>\nIf you have a child that is running from you, there could be many<br/>\nissues you need to explore. WHY is he running away from you? Is he<br/>\nfearful because of past experience? Or is he simply feeling he can<br/>\nignore you because you aren&#39;t trustworthy?<br/>\nIt sounds like he is really being hurtful at times, which in his world<br/>\nisn&#39;t intentional, but may be a method of finding out how you&#39;re going<br/>\n to react.<br/>\n<br/>\nIf he isn&#39;t sure what kind of response he&#39;ll get, he&#39;s lacking trust.<br/>\nSo this could be some transitional stuff, but you might need to set<br/>\nbetter personal boundaries.<br/>\nI don&#39;t let people hurt my stuff, I don&#39;t let people hurt me if I can<br/>\nhelp it. Children OR adult.<br/>\nSo if he&#39;s acting hurtful, that might be a sign that he&#39;s lacking<br/>\ntrust and needs you to say &quot;STOP, that isn&#39;t ok to do to me or my stuff&quot;.<br/>\n<br/>\nI really need more information about the sleep thing to be much help<br/>\nthere. If his natural bio-rhythm is to be up late and sleep in,<br/>\nfinding ways to accomodate his new schedule will be helpful.<br/>\nI have a feeling he&#39;s just testing out this new freedom and trying to<br/>\nsuck up every moment because he fears it might be taken away.<br/>\n<br/>\nIs he keeping anyone awake?<br/>\nIs he doing anything harmful?<br/>\n<br/>\nJalen (the aforementioned four year old) often stays up after everyone<br/>\nelse. If the house is dark and everyone asleep, he can be easily<br/>\ntrusted to turn off the tv, the lights and come crawl into bed with me<br/>\nwhen he&#39;s done.<br/>\nThis is a child that can do some amazingly crazy things in the waking<br/>\nhours!! So you never know.<br/>\n<br/>\nJust today, he exploded a fluorescent bulb (and I mean EXPLODED, my<br/>\nroom was covered in glass) and stood out on a busy street, explaining<br/>\nthat he was looking out for cars. Yikes.<br/>\n<br/>\nBut I don&#39;t worry about him at night, up alone. Go figure. You know<br/>\nyour child best that way, so if he&#39;s safe and happy, let him be.<br/>\n<br/>\nMy concern would be that he&#39;s trying to understand how you will react,<br/>\nand staying up alone might be a recipe for disaster. Jalen has never<br/>\nhad a bedtime, so he doesn&#39;t have those issues.<br/>\n<br/>\nAs far as throwing things down on the floor, I&#39;d say &quot;HEY, that<br/>\nbelongs in the garbage, not on my floor!!&quot; and make sure there was a<br/>\ngarbage somewhere nearby to facilitate easy clean up.<br/>\nJalen went through that for years. We mostly cleaned up after him and<br/>\npointed out that we wanted these items in the garbage.<br/>\nHe does pretty good now, better than his older brothers usually!:)<br/>\n<br/>\nI make sure to have a garbage in every room, kids of all ages will<br/>\ntoss wrappers in the darndest places if you don&#39;t.<br/>\n<br/>\nI think a lot of this is transitional. &quot;No&quot; isn&#39;t a bad word though.<br/>\nIt&#39;s just lame if you haven&#39;t thought through the options. If someone<br/>\nwants to break an item I love, &quot;NO&quot; is GOOD.<br/>\n<br/>\nRadical unschooling is a huge transition for a family to make. You<br/>\nmight be going through some rough stuff for a while, in the mean time,<br/>\nknow that it&#39;s ok to stop harmful things from happening. Respecting<br/>\nyourself is part of the package.<br/>\nSaying &quot;yes&quot; more and more is usually the recommended path for this<br/>\ntransition, rather than changing all behavior overnight.<br/>\n<br/>\nTell us more about how you eased into radical unschooling and whether<br/>\nor not you made some sort of announcement that there were no rules. <br/>\n<br/>\nHang in there...it will get better.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":209676473,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;oh.kneel@...&gt;","profile":"kc2ark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Detoxing","postDate":"1130543076","msgId":7222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRqdWQ1NCtsbGJiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":7228,"prevInTime":7221,"nextInTime":7223,"topicId":7222,"numMessagesInTopic":0,"msgSnippet":"I just need to connect with the group.  We are new to unschooling and actually feel that the best match for our son and our family would be what is now loosely","messageBody":"<div id=\"ygrps-yiv-154787086\">I just need to connect with the group.  We are new to unschooling <br/>\nand actually feel that the best match for our son and our family <br/>\nwould be what is now loosely described as radical unschooling.  But <br/>\nmy dh and I are really detoxing!  I will only speak for myself from <br/>\nthis point on but I feel like I am on an emotional roller coaster.  <br/>\nDs (5) digss up all the shale from the back path to make a volcano.  <br/>\nDH and I both have strong feelings but work it through had allow him <br/>\nto proceed without dumping any further judgment on him.  He makes an <br/>\nawesome volcano which then the family fills with baking soda and <br/>\nvinegar and it erupts.  It was just great.  Another episode, DS is <br/>\nnow choosing to stay up very late (way past us guessing 3:00 a.m. or <br/>\nso) and is sleeping past noon.  When we wake him for his horseback <br/>\nriding lesson he is angry that he has been woken.  Now dh and I are <br/>\nwondering if we are doing the wrong thing allowing him to choose <br/>\nwhen he is sleeping half the day and so cranky.  Another episode, ds <br/>\ngoes to store and gets overstimulated (my fault ad choice for him) <br/>\nand climbs up the metal staircase for employees and won&#39;t get down.  <br/>\nThen when he does runs all over the store as I try to chase him (and <br/>\ncatch him).  When I catch him his body almost seems to relax.  I <br/>\nthen carry him out of the store.  I feel frazzled but glad I can <br/>\ntalk with him calming not get angry.  Another on going challenge ds <br/>\njust takes something he does want and throws it on the floor.  (I <br/>\nhave asked if he could put it in the garbage or give it to me or <br/>\nleave it on the table.....)  Another episode, after dinner Ds wants <br/>\nme to play tag (again) with he and his friend.  I say (which is <br/>\nconsistent on my part) that after dinner mommy likes to wind down.  <br/>\nI like to read and be quieter and get ready for bed.  I would be <br/>\nhappy to watch a movie with him.  He then gets angry and tells me <br/>\nthat Since I don&#39;t do his needs he is not listening to me.  This <br/>\ntime I wait. He doesn&#39;t throw his food on the floor, he doesn&#39;t run <br/>\nout the door, he doesn&#39;t start knocking things over.  But he has <br/>\ndone all of those things at others times this week.  So I guess I am <br/>\nsaying that we are transitioning and like giving birth it is <br/>\nuncomfortable and hard work at times.  I am not someone who cries <br/>\neasily and yet I feel teary.  I am tired. I am sad for the time I <br/>\nhad put him in school.  I am frustrated that I can&#39;t reach him <br/>\nbetter at times.  I am ashamed that I don&#39;t know more about what to <br/>\ndo to diffuse the situation.  I offer to come close.  I offer to <br/>\nhold him.  I offer to give him space.  I just want someone to know <br/>\nthat we are hurting.  When you drink too much and discover you are <br/>\nan alcoholic, one can chose to detox and then begin to recover one <br/>\nday at a time.  Well we lived a way that was unhelpful to ds and <br/>\nhave discovered that we need to detox from not only school and <br/>\nexpectations but our own upbringings.  We have a strong desire to <br/>\nfind a new way for ds and us but it is really hard right now.  I <br/>\njust didn&#39;t want to be alone with all of these new feelings.  Sorry <br/>\nfor the lengthy share.  I just needed to know someone out there <br/>\nmight be able to offer me some hope.  Joanne</div>","specialLinks":[]}],"prevTopicId":7223,"nextTopicId":7256}}