{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":300649940,"authorName":"Michelle Thedaker","from":"&quot;Michelle Thedaker&quot; &lt;michelle@...&gt;","profile":"pamperedthed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] video games and addiction","postDate":"1238178171","msgId":39153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBMzhCQ0EyMTEzNTQ1MTk5RDg2MDhDMjgxMDE0Q0YzQHN1bnJvb20+","inReplyToHeader":"PDUwRTZDNDUxLUE4N0MtNDczOC05OUY1LTVGMDVDQ0Y2OTBGOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDk3MDAzLjY1NTQwLnFtQHdlYjQzNDEzLm1haWwuc3AxLnlhaG9vLmNvbT4gPDUwRTZDNDUxLUE4N0MtNDczOC05OUY1LTVGMDVDQ0Y2OTBGOUB2ZXJpem9uLm5ldD4="},"prevInTopic":39141,"nextInTopic":0,"prevInTime":39152,"nextInTime":39154,"topicId":39107,"numMessagesInTopic":0,"msgSnippet":"Joyce, Thank you, thank you for your clarity!  We go back and forth between unlimited gaming and putting controls on it, based purely on the emotional ","messageBody":"<div id=\"ygrps-yiv-850033178\">Joyce,<br/>\n <br/>\nThank you, thank you for your clarity!  We go back and forth between<br/>\nunlimited gaming and putting controls on it, based purely on the emotional<br/>\noutbursts that my older son has while gaming.  I honestly don&#39;t have a<br/>\nproblem with him being totally absorbed in a game (or anything else!), but<br/>\nwe all struggle with keeping an &quot;even keel&quot; during the days of heavy gaming.<br/>\nLately I&#39;m noticing that I&#39;m almost *always* on edge, feeling highly<br/>\nanxious, waiting for the next outburst.  Both of my boys are really intense<br/>\npersonalities to begin with, so we go from high energy to through-the-roof<br/>\nenergy and it&#39;s been so *hard* for me to stay connected and level-headed<br/>\n(i.e. not giving in to my anxiety and anger).  Your response reminded me of<br/>\nmany ideas that I had forgotten, lots of &quot;a ha!&quot; moments came while reading.<br/>\nThanks again!<br/>\n <br/>\nMichelle in SoCal<br/>\nMom to Drew, 9.5 and Josh, 5.5<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] video games and addiction","postDate":"1238148596","msgId":39141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwRTZDNDUxLUE4N0MtNDczOC05OUY1LTVGMDVDQ0Y2OTBGOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk3MDAzLjY1NTQwLnFtQHdlYjQzNDEzLm1haWwuc3AxLnlhaG9vLmNvbT4=","referencesHeader":"PDk3MDAzLjY1NTQwLnFtQHdlYjQzNDEzLm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":39107,"nextInTopic":39153,"prevInTime":39140,"nextInTime":39142,"topicId":39107,"numMessagesInTopic":0,"msgSnippet":"... I agree. When addiction is brought up, then decisions are based on fear rather than rational thought. The feared activity turns into a vampire, mesmerizing","messageBody":"<div id=\"ygrps-yiv-2089919871\">On Mar 25, 2009, at 11:23 AM, Aidan Tro wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As soon as the word comes into the conversation, it is generally  <br/>\n&gt; believed that the person with the &quot;addiction&quot; needs to be stripped  <br/>\n&gt; of their right to make a choice.<br/>\n<br/>\n </span></blockquote>I agree. When addiction is brought up, then decisions are based on  <br/>\nfear rather than rational thought. The feared activity turns into a  <br/>\nvampire, mesmerizing our kids and sucking away their will and lives.  <br/>\nSo we need to turn on the mama bear and fight the beast.<br/>\n<br/>\nWhat if it is addiction? What about the child&#39;s behavior described?  <br/>\nThe child is unhappy and the advice *seems* to be to just ignore it  <br/>\nbecause games are fun and it&#39;s normal. The advice *seems* to be:  <br/>\n&quot;There&#39;s nothing wrong with your child. It&#39;s your attitude toward  <br/>\ngames that&#39;s the problem.&quot; Or, worse, the advice seems to be a  <br/>\nblinkered, &quot;Don&#39;t be foolish. It can&#39;t be addiction.&quot;<br/>\n<br/>\nFirst, to get rid of fears so the situation can be seen more  <br/>\nrationally and objectively, read the Rat Park link Schuyler brought:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/\">http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/</a><br/>\n<br/>\nAddictions are not *caused* by substances or activities. The  <br/>\ngroundwork for addiction is set in the environment. Addictive  <br/>\nbehavior is an escape. If that environment isn&#39;t present -- which  <br/>\nunschooling parents should be attending to so it isn&#39;t  a factor --  <br/>\nall the video games in the world aren&#39;t going to cause addiction.<br/>\n<br/>\nIt&#39;s also very helpful not to mix the reactions of schooled children  <br/>\nin with unschooled children. Besides playing video games for fun,  <br/>\nschooled children are *also* using them as depressurizers from  <br/>\nschool. Schooled kids can escape from a world they have no control  <br/>\nover into a world where they have enormous control.<br/>\n<br/>\nUnschooled children -- barring some upsetness in their lives like  <br/>\nlooming divorce, a death -- play video games because they&#39;re fun.  <br/>\nBecause they&#39;re engaging. Because they&#39;re hugely challenging puzzles.  <br/>\n*And* sometimes to be competent and powerful and in control.<br/>\n<br/>\nBecause some kids can get so intensely into them, they can push  <br/>\nthemselves beyond their limits. And those kids can do that repeatedly  <br/>\nbecause the games are so incredibly challenging. And the consequences  <br/>\nare the kids going to be irritable. That&#39;s what happens to humans  <br/>\nwhen they keep pushing themselves beyond their limits.<br/>\n<br/>\nYes, there is unhappiness. *That* should be the focus. Help the kids  <br/>\nfind strategies to be happy.<br/>\n<br/>\nYes, unschooling advice is often to give them freedom to explore. But  <br/>\nthe advice is *also* to *be* with them. Be aware. If they&#39;re  <br/>\nstruggling with something: Help them! Problem solve with them. You&#39;re  <br/>\nin their unschooling lives to be their helpmate, not their  <br/>\ncontroller. No one should be &quot;left to unlimited use&quot;.<br/>\n<br/>\nThe easiest route is for parents to take away the games. As someone  <br/>\nsaid, her son was back after she did so. But for many (most?) kids  <br/>\nthat would result in even more distress. *And* it also sends the  <br/>\nmessage that the child is weaker than the activity, that they need a  <br/>\nstronger person to take over and rescue them.<br/>\n<br/>\nThink about how you would react if you&#39;d just discovered Harry Potter  <br/>\n(or something else you can imagine being hugely engaged in). And you  <br/>\nstarted reading and reading and reading. And you were grumpy and  <br/>\nneglecting other things. Let&#39;s say you don&#39;t have others depending on  <br/>\nyou (as kids don&#39;t) but do have others who enjoy spending time with  <br/>\nyou (as kids do).<br/>\n<br/>\nWould you feel good if someone decided to lock the books away and let  <br/>\nyou only have one chapter a day?<br/>\n<br/>\nTaking control away from someone is quick and (sometimes) effective,  <br/>\nbut it tears down relationships and makes people mad.<br/>\n<br/>\nDoes that mean there&#39;s nothing that can be done? If you can&#39;t take it  <br/>\naway, put up with it?<br/>\n<br/>\nNo, of course not. Here are some ideas that will help (most of which  <br/>\nhave been offered here). Not all will work all the time and be aware  <br/>\nthat the goal isn&#39;t to get them to stop playing. The goal is to help  <br/>\nthem be happy.<br/>\n<br/>\n1) Bring them food. Use the monkey platter idea so there&#39;s a variety  <br/>\nof things they like to munch on.<br/>\n<br/>\n2) Play with them. It&#39;s great if you can get as engaged in it as much  <br/>\nas they. (Pokemon and Animal Crossing and several other games have  <br/>\nbeen great bonding activities with my daughter that have expanded  <br/>\nbeyond the games themselves.) But, no, you don&#39;t have to love every  <br/>\ngame and you don&#39;t have to play all the time. Play enough that you  <br/>\nunderstand the draw of the game, so you can hold conversations about  <br/>\nit, so you can help them along (or help them find help).<br/>\n<br/>\nAs a side effect, you can notice when you&#39;re getting tired and hungry  <br/>\nand say &quot;Hey, I&#39;m getting hungry. Let&#39;s find a stopping place so I  <br/>\ncan get something to eat.&quot;<br/>\n<br/>\n3) Have even better things going on in their lives. Trying to get  <br/>\nthem away from a game to go grocery shopping is an exercise in  <br/>\nfrustration ;-) Do let them say no thanks!<br/>\n<br/>\n4) Build video game playing into the day. Don&#39;t treat it like an evil  <br/>\nto be tolerated but a legitimate activity. Let kids know the schedule  <br/>\nif you have other activities you&#39;d like to do.<br/>\n<br/>\n5) Talk to them about their feelings (and resultant behavior). Kids  <br/>\n*don&#39;t* want to be unhappy. But they *do* want to do the things that  <br/>\nthey enjoy. Say, &quot;I&#39;ve noticed you&#39;re upset after playing for a long  <br/>\ntime.&quot; And engage them into discussing their feelings. Don&#39;t jump  <br/>\nright to solutions. Don&#39;t try to steer them to solutions. Talk about  <br/>\nwhat&#39;s going on.<br/>\n<br/>\nAsk them if there are other things they&#39;d like to do that isn&#39;t  <br/>\ngetting done. (Playing around with time management strategies and  <br/>\ntransitioning are good life time skills.)<br/>\n<br/>\nLet him know that he&#39;s missed and Dad/his sister/you would love to  <br/>\nsee him (at dinner, at family game night, for an hour of playtime.)  <br/>\n(People can often find time for a specific activity, but if there&#39;s a  <br/>\nblanket desire for them to be away from their game, it can feel like  <br/>\na pull to change them rather than an invitation to be with them.)<br/>\n<br/>\n6) Be aware of your own biases and prejudices. If they were reading  <br/>\nShakespeare for hours on end, creating amazing clay sculptures,  <br/>\nwriting poetry ... would you be treating their pursuit exactly as  <br/>\nyou&#39;re treating their game playing? As is natural, we tend to avoid  <br/>\nnegative people and your negativity can make them turn away from you  <br/>\n(and retreat to games). It can also color the situation so that you  <br/>\nlook at engagement and see addiction.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":392642195,"authorName":"Aidan Tro","from":"Aidan Tro &lt;aidantro@...&gt;","profile":"aidantro","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"video games and addiction","postDate":"1237994593","msgId":39107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3MDAzLjY1NTQwLnFtQHdlYjQzNDEzLm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":39141,"prevInTime":39106,"nextInTime":39108,"topicId":39107,"numMessagesInTopic":0,"msgSnippet":"I have a problem with applying the term addiction to kids without lots of thoroughly applied critical thinking and investigation of all the facts. As soon as","messageBody":"<div id=\"ygrps-yiv-452325157\">I have a problem with applying the term addiction to kids without lots of thoroughly applied critical thinking and investigation of all the facts. As soon as the word comes into the conversation, it is generally believed that the person with the &quot;addiction&quot; needs to be stripped of their right to make a choice. The insinuation always follows that they don&#39;t know what&#39;s right for them, and others should now make choices for them- by force and over their protests if necessary. Basically, it becomes ok, even required to throw out the constitution where that person is concerned.<br/>\n<br/>\nI have seen the label of addiction used as a shortcut to thinking and problem solving with kids way too often. It&#39;s made me think more seriously about that term, about what assumptions I have and what prescriptions are being recommended. The trouble is, when the word comes into the conversation, prescriptions are far more often implied than openly suggested.<br/>\n<br/>\nThe crosswalk.com article wasn&#39;t authoritarian, it was inflammatory. Where is the critical thinking? Where is the evidence? Where is the scientific process? This article depends entirely on the cultural &quot;wisdom&quot; of Americans regarding the word addiction. It illustrates so perfectly my points about how the addiction label is problematic and should not be used lightly with kids. Take this quote:<br/>\n<br/>\n&quot;Be prepared for resistance. When you decide to reduce<br/>\nor eliminate the time your children spend playing video games, expect<br/>\nthem to fight your choice. They’ll go through withdrawal symptoms like<br/>\ndepression and agitation if they’ve been addicted.&quot;<br/>\n<br/>\nIf they argue about having their video games controlled or removed, why consider the reasons? It&#39;s simple: they&#39;re addicted! That&#39;s like the story of the woman who is committed to a mental institution though she is not insane.. When she protests, angry at her incarceration, they chalk it up to insanity and her fate is sealed. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39120,"nextTopicId":39070}}