{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Bed-time & puplic school!","postDate":"1272722220","msgId":43819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQ0I3NEQ0RTIxRDRGMC0xNDFDLTY3RkJAd2VibWFpbC1tMDEzLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":43818,"nextInTime":43820,"topicId":43819,"numMessagesInTopic":0,"msgSnippet":"Hi Erica, I wanted to comment on this, since my oldest (9) choose to attend school last winter and has been going for a year and a half now.  Public school is","messageBody":"<div id=\"ygrps-yiv-1893785455\">Hi Erica,<br/>\n<br/>\nI wanted to comment on this, since my oldest (9) choose to attend school last winter and has been going for a year and a half now.  Public school is not easier!  Especially when it comes to bed time!  My daughter&#39;s school starts at 8 a.m., which means she has to be on the bus at 7:15.  In order for her to get enough sleep, and because she gets bus sick from the hills, she has to eat breakfast at school.  Therefore, she has to be in bed with lights out by 8:30 p.m.  It seems to take a full hour to get pj&#39;s, potty, teeth, picking out cloths for the next day and wind down time accomplished, so we have to start the process at 7:30 p.m.  She does get home early, 2:45 p.m., which is nice, but it&#39;s not as much time as one would think, with homework, etc.  Then, if there are any evening activities, like girl scouts, things really get tight.  <br/>\n<br/>\nI am not a morning person, so if I make her lunch, I do it in my sleep;)  Therefore she buys most days.  I could drive her in, but then her younger sister (7), who needs more sleep than she does, would have to get up and come with us.  <br/>\n<br/>\nI have wondered if both were in, if it would be easier, but I don&#39;t think so.  One of the most frustrating things with having a child in ps, is having to be home for that bus.  When you are out shopping it is amazing how quickly 2 p.m. comes!  Also, you are totally at the mercy of the school schedule for vacations, etc.  We like to go to rabbit shows, which are on Saturdays.  We often stay at my parent&#39;s house because they are centrally located in our state, so closer to the shows.  It would be lovely to hang around on Sunday and not have to head back until Monday.  But to avoid illegal absents-es we have to leave Sunday. <br/>\n<br/>\nThen there are the emotional costs, which of course, are often covered in the unschooling literature!<br/>\n<br/>\nEither way, parenting is challenging.  Overall, I think unschooling is actually easier!<br/>\n<br/>\nAmy C.<br/>\n<br/>\n<br/>\n<br/>\nRe: Bedtime...again          <br/>\n    <br/>\nPosted by:      &quot;Erica Guthaus&quot;            <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eguthaus@...\">eguthaus@...</a>                                       jandegoot                   <br/>\n    <br/>\n      Tue Apr 27, 2010 2:09 pm        (PDT)    <br/>\n                      <br/>\n<br/>\n      Thank you so much for posting this.  I echo your emotions as this is  <br/>\nsomething that is *heavy* on my heart these days to the point that it  <br/>\nmakes me question the wisdom of keeping these children with me all  <br/>\nthe time (would it be more wise to send the oldest (and most intense)  <br/>\ndd to traditional school just to save some sanity.)!  I love them  <br/>\nall, but I also have yet to figure out how I can recharge enough to  <br/>\nkeep all this going without breaking myself (or a child! kidding of  <br/>\ncourse!) in the process!  So, you are not alone!  Anxiously awaiting  <br/>\nsome replies<br/>\n<br/>\nErica<br/>\ndd 4.5<br/>\ndd 2.5<br/>\nds 5mos<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43803,"nextTopicId":43836}}