{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":52,"messages":[{"userId":210833586,"authorName":"Trudy","from":"&quot;Trudy&quot; &lt;trudypowell@...&gt;","profile":"trudyhome99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Team Commitments (Pam - Answers To Your Questions)","postDate":"1150505459","msgId":14695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2dmpsaitqMWxtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCQzg2NkVGLUZDQ0UtNEY3RC1CMUNELTk4Q0M5ODc5MjVCQkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":14691,"nextInTopic":14701,"prevInTime":14694,"nextInTime":14696,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"Joyce, Here is a quote from your post to me: There are lots of people who will never take on all of what is suggested on the list. They will ask how to make","messageBody":"<div id=\"ygrps-yiv-1842362130\">Joyce,<br/>\n<br/>\nHere is a quote from your post to me:<br/>\n<br/>\n&quot;There are lots of people who will never take on all of what is  <br/>\nsuggested on the list. They will ask how to make something we&#39;ve  <br/>\ndiscussed work. They will pick and choose and go their merry way on  <br/>\nother parts.<br/>\n <br/>\nThe difference is that they won&#39;t feel they need to present what they <br/>\ndo as helpful to others trying to unschool and trying to parent more  <br/>\nmindfully.<br/>\n <br/>\nDo whatever you feel is best for your family. Pick and choose from  <br/>\nthis list and a dozen others and anyone whose parenting you admire.<br/>\n <br/>\nBut the list is for discussing how to move closer to unschooling (and <br/>\nmindful parenting which is essentially applying unschooling  <br/>\nprinciples to parenting) not for discussing whatever mish mosh of  <br/>\npractices someone uses.&quot;<br/>\n<br/>\n-------------<br/>\n<br/>\nI thought I was in the proces of discussing unschooling and what it <br/>\nentails.  In most each and every post I have been personally <br/>\nresponding to direct questions or comments which have been asked of <br/>\nme - people wanting me to clarify a point.  However, when I do it has <br/>\nmost times been countered with how &quot;unschooling&quot; it is because I&#39;m <br/>\nnot being &quot;mindful.&quot;  Because I know what I believe and why and am <br/>\nnot ashamed to state it.  This is wrong?   <br/>\n<br/>\nWhen you say the list is for discussing how to move closer to <br/>\nunschooling and mindful parenting do you mean that it&#39;s for anyone <br/>\nwho thinks all the mindful ways are awesome and wants your input on <br/>\nhow you go about it?  If someone disagrees then they&#39;re <br/>\ndiscussing &quot;mish mosh&quot;?<br/>\n<br/>\n<br/>\nTrudy Powell</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: Team Commitments (Pam - Answers To Your Questions)","postDate":"1150503954","msgId":14691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3NkU1QUFGLTBBNUQtNEQwMC05QjUwLTIxMEUzQjkzNEM3MkBjb3gubmV0Pg==","inReplyToHeader":"PGU2dmI3ZCtyN2NrQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2dmI3ZCtyN2NrQGVHcm91cHMuY29tPg=="},"prevInTopic":14683,"nextInTopic":14695,"prevInTime":14690,"nextInTime":14692,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"This reminds me of a story my husband s sister told me. Once when Zane (DH) was about four, he was running through the house and his dad told him to pick","messageBody":"<div id=\"ygrps-yiv-1794601597\">This reminds me of a story my husband&#39;s sister told me. Once when  <br/>\nZane (DH) was about four, he was running through the house and his  <br/>\ndad told him to pick something up. It was a small toy, not a big  <br/>\ndeal, and probably a toy he had picked up dozens of times. But Zane  <br/>\nkept running, and yelled &quot;No!&quot; as he went by. When his dad saw him  <br/>\nthe next time, he picked him up, swatted his butt three or four  <br/>\ntimes, and sent him to his room crying. Two swats for not doing what  <br/>\nhe was told, and two for telling his dad no.<br/>\nNo one ever thought to ask him why he said no. No one took into  <br/>\nconsideration that something he was doing was important. And it was!  <br/>\nHe had to go potty. He had been waiting because he was outside  <br/>\nweeding their garden, and waited til the last minute to go. If he  <br/>\nwould have stopped to explain, he probably would have wet his pants.<br/>\n<br/>\nThat&#39;s the story I think of whenever someone expects instant  <br/>\nobedience from anyone. I think of all the times that my child wanted  <br/>\nto tell me something very important, and I was inconsiderate enough  <br/>\nto want him to wait til my talking was finished. It was gone by then,  <br/>\nand they had no idea what they wanted to tell me. We used to joke  <br/>\nabout how if it was important enough it would come back, but now I&#39;m  <br/>\nhorrified to think of the wisdom and knowledge that they had been  <br/>\nwanting to share, and was put aside. If your son is playing, he&#39;s  <br/>\nlearning. What we say is &quot;Would you mind getting the bags for me?&quot;  <br/>\nand if they say no, I take the time to find out why. There&#39;s  <br/>\nsomething more important in their world at that moment, and it&#39;s  <br/>\nrespectful to acknowledge that. As they get older they automatically  <br/>\ndevelop the ability to put off their own desires to help others, I&#39;ve  <br/>\nseen that with my own.<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 16, 2006, at 5:26 PM, Trudy wrote:<br/>\n&gt;<br/>\n&gt; I think it&#39;s perfectly fine for me to be standing at the sink washing<br/>\n&gt; dishes and as my 5-year-old son runs by playing to say, &quot;Hey, Braden,<br/>\n&gt; I need you to get me a couple of trash bags out and bring them over<br/>\n&gt; here, please.&quot; I don&#39;t say, &quot;Braden, if it&#39;s okay with you and if<br/>\n&gt; you CHOOSE to do so, and if it won&#39;t hurt you to be REQUIRED to do<br/>\n&gt; this, could you please bring Mommy two trash bags?&quot; If I ask him to<br/>\n&gt; please get them for me and he continues on his merry way and does not<br/>\n&gt; CHOOSE to help me, he will be in trouble; not because he&#39;s a little<br/>\n&gt; brat but because he needs to know it was wrong to ignore someone who<br/>\n&gt; asked for help and that he should have been considerate of that. Why<br/>\n&gt; would he do this? He is a child and they are not always<br/>\n&gt; automatically considerate of others. They will learn it as the years<br/>\n&gt; go on, but when small need to be shown and told.<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Team Commitments (Pam - Answers To Your Questions)","postDate":"1150500939","msgId":14683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQzg2NkVGLUZDQ0UtNEY3RC1CMUNELTk4Q0M5ODc5MjVCQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2dmI3ZCtyN2NrQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2dmI3ZCtyN2NrQGVHcm91cHMuY29tPg=="},"prevInTopic":14678,"nextInTopic":14691,"prevInTime":14682,"nextInTime":14684,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... This is where we disagree. I *know* kids don t need to be told and shown (and made obviously from your example) because I haven t made my daughter do what","messageBody":"<div id=\"ygrps-yiv-1900766743\">On Jun 16, 2006, at 6:26 PM, Trudy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I ask him to<br/>\n&gt; please get them for me and he continues on his merry way and does not<br/>\n&gt; CHOOSE to help me, he will be in trouble; not because he&#39;s a little<br/>\n&gt; brat but because he needs to know it was wrong to ignore someone who<br/>\n&gt; asked for help and that he should have been considerate of that.  Why<br/>\n&gt; would he do this?  He is a child and they are not always<br/>\n&gt; automatically considerate of others.  They will learn it as the years<br/>\n&gt; go on, but when small need to be shown and told.<br/>\n<br/>\n </span></blockquote>This is where we disagree. I *know* kids don&#39;t need to be told and  <br/>\nshown (and made obviously from your example) because I haven&#39;t made  <br/>\nmy daughter do what I ask and she&#39;s very considerate of my feelings.  <br/>\nOthers have changed from the way you do it to mindful parenting and  <br/>\ntheir kids have become more considerate. Genuinely considerate rather  <br/>\nthan acting considerate.<br/>\n<br/>\nIf we treat their needs with respect they will come to treat our  <br/>\nneeds with respect.<br/>\n<br/>\nIf we treat what they&#39;re doing and their requests as important --  <br/>\neven  if *we* don&#39;t understand the importance-- they will treat our  <br/>\nrequests as important -- even the ones they don&#39;t understand the  <br/>\nimportance of.<br/>\n<br/>\nIt&#39;s unreasonable to expect a 5 yo to understand that it&#39;s important  <br/>\nto have clean dishes. From a 5 yo&#39;s point of view you&#39;re standing  <br/>\nthere doing what you want. And you&#39;re asking him to interrupt  <br/>\nsomething that&#39;s important to him to do something that is less  <br/>\nimportant.<br/>\n<br/>\nSo what you&#39;re modeling is, is that when he&#39;s laying on the couch he  <br/>\ncan ask you to get down from the ladder as you&#39;re painting the  <br/>\nceiling and get him a juice. And if you don&#39;t, you&#39;re in trouble.  <br/>\nYou&#39;re saying that just because someone asks someone to do something  <br/>\nthat it &#39;s automatically important and they need to do it.<br/>\n<br/>\nAnd  actually only asking for important things *is* important in  <br/>\nhelping them to learn to treat others respectfully. I *don&#39;t* ask my  <br/>\ndaughter to interrupt what she&#39;s doing unless I&#39;m really stuck. But  <br/>\nshe&#39;s 14. She understands because she&#39;s older. She understands  <br/>\nbecause I haven&#39;t made her do what I ask. She understands because  <br/>\nshe&#39;s seen me treat her requests with respect and she returns the favor.<br/>\n<br/>\nI didn&#39;t expect that at 5. At 5 I treated her with respect. If I  <br/>\n*asked* for something I didn&#39;t treat that as a pretend polite way of  <br/>\ncommanding. It was a real legitimate question and if she said No, I  <br/>\nrespected that what she was doing was more important.<br/>\n<br/>\nIf we treat them with respect, they learn in time to treat us with  <br/>\nrespect.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Whatever name one want to give to the behavior, it is<br/>\n&gt; not good manners and not a character trait I want to model or to see<br/>\n&gt; develop in our children.<br/>\n<br/>\n </span></blockquote>It&#39;s much more helpful to talk about our own kids and real scenarios.  <br/>\nWhat you&#39;ve talked about are adults who are trapped in jobs they  <br/>\ndon&#39;t enjoy or fictional scenarios that sound  plausible.<br/>\n<br/>\nLet&#39;s talk about unschooled kids and unschooling ideas. The concept  <br/>\nof an unschooled child being lazy isn&#39;t helpful. We can discuss  <br/>\nspecific real scenarios of one of your own children that you might  <br/>\nlabel lazy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But<br/>\n&gt; please realize, they are ages 8, 7, and 5, and because of their ages<br/>\n&gt; they do have be told/reminded/asked/encouraged and yes, sometimes<br/>\n&gt; required to do things that need to be done.<br/>\n<br/>\n </span></blockquote>And I didn&#39;t tell my daughter to do things and around 10 or 11 she  <br/>\ndid it spontaneously. She&#39;s very generous with her time.<br/>\n<br/>\nI did ask her to do things and respected when she said she couldn&#39;t.  <br/>\nI reminded her of things she wanted to do and she appreciated that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I carry up a couple of<br/>\n&gt; basketfuls of clean clothes and the girls are watching a movie or<br/>\n&gt; something and I say, &quot;Here, please get these folded,&quot; I don&#39;t believe<br/>\n&gt; their childhood world is going to come crashing down around them.<br/>\n&gt; Because we&#39;re a homeschooling family, our entire lives are centered<br/>\n&gt; around doing things together, learning together, and working<br/>\n&gt; together.<br/>\n<br/>\n </span></blockquote>Every time you make them do what they don&#39;t want to, regardless of  <br/>\nhow important you see it, you&#39;re whittling away at your relationship.<br/>\n<br/>\nIs it going to make their world crash down? Will they grow up to hate  <br/>\nyou? No. But it&#39;s helpful to be aware of what we do that whittles and  <br/>\nwhat we do that builds.<br/>\n<br/>\nYou can choose to whittle. The results may be worth it to you. But it  <br/>\nwon&#39;t help anyone unschool or parent more mindfully. There are other  <br/>\nways that *will* help someone parent more mindfully. You don&#39;t have  <br/>\nto accept them. You can pick and choose from the options that get  <br/>\npresented on the list.<br/>\n<br/>\nBut the list becomes less useful for those who are seeking ways to  <br/>\nmove towards unschooling and towards mindful parenting if the ideas  <br/>\nheld up as good practices are a mish mosh of what works for various  <br/>\npeople.<br/>\n<br/>\nI think it&#39;s very possible to foster an atmosphere of &quot;We&#39;re all in  <br/>\nthis together. We&#39;re a team,&quot; to encourage kids to help. *BUT* what  <br/>\nyou&#39;ve written above -- a child getting in trouble for not doing what  <br/>\nmom asks him to do (even if you only ask for things you are certain  <br/>\nare reasonable) -- is not something an unschooler can read about,  <br/>\ntake home and turn their household into a team. What you&#39;ve written  <br/>\nis fairly conventional parenting that has results that vary from  <br/>\nresentful kids to helpful kids.  Because the factor that creates  <br/>\nhelpful kids isn&#39;t making them.<br/>\n<br/>\nThere is some respect mixed in with the making that you&#39;re doing that  <br/>\nis probably responsible for your kids asking if they can help. (IT  <br/>\nmight also be personality. It might also be fear of God.) But you  <br/>\naren&#39;t seeing respect as the major factor. You think they need to be  <br/>\nforced to act respectful to become respectful.<br/>\n<br/>\nI *know* that&#39;s not true because I&#39;ve done the respect without the  <br/>\nforce and my daughter is respectful. Others here have had the same  <br/>\nresults.<br/>\n<br/>\nIf you can&#39;t explain why your kids ask if they can help -- and you  <br/>\ncan&#39;t because others have tried force and it rarely yields kids who  <br/>\nask if they can help -- then presenting it here doesn&#39;t help anyone  <br/>\nbe more mindful or move closer to unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know this will shock and horrify some<br/>\n<br/>\n </span></blockquote>It neither shocks nor horrifies me. It&#39;s pretty standard parenting  <br/>\npractice. Millions of parents want to do it and are certain they need  <br/>\nto do it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We REQUIRE these things because we<br/>\n&gt; love them, not to suppress their ability to choose and not to ruin<br/>\n&gt; their lives.<br/>\n<br/>\n </span></blockquote>So if your child REQUIRED you to do a particular level on a video  <br/>\ngame daily to get them to the next level, that would be because they  <br/>\nlove you?<br/>\n<br/>\nI don&#39;t REQUIRE my daughter to do anything and I love her and she  <br/>\nknows it.<br/>\n<br/>\nThat argument that REQUIRING equates to love doesn&#39;t hold water.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know I have not (and will not) arrive at the same level<br/>\n&gt; of &quot;unschooling consciousness&quot; as most on this board, but we&#39;re all<br/>\n&gt; doing what we think is best and learning in the process.<br/>\n<br/>\n </span></blockquote>There are lots of people who will never take on all of what is  <br/>\nsuggested on the list. They will ask how to make something we&#39;ve  <br/>\ndiscussed work. They will pick and choose and go their merry way on  <br/>\nother parts.<br/>\n<br/>\nThe difference is that they won&#39;t feel they need to present what they  <br/>\ndo as helpful to others trying to unschool and trying to parent more  <br/>\nmindfully.<br/>\n<br/>\nDo whatever you feel is best for your family. Pick and choose from  <br/>\nthis list and a dozen others and anyone whose parenting you admire.<br/>\n<br/>\nBut the list is for discussing how to move closer to unschooling (and  <br/>\nmindful parenting which is essentially applying unschooling  <br/>\nprinciples to parenting) not for discussing whatever mish mosh of  <br/>\npractices someone uses.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210833586,"authorName":"Trudy","from":"&quot;Trudy&quot; &lt;trudypowell@...&gt;","profile":"trudyhome99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Team Commitments (Pam - Answers To Your Questions)","postDate":"1150496813","msgId":14678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2dmI3ZCtyN2NrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFRjUyQkExLTc1ODYtNENEMy1CNDI1LTJBRkJGRjU3Qzg1MUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":14675,"nextInTopic":14683,"prevInTime":14677,"nextInTime":14679,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"Pam - Okay, here s the absolute truth of the matter... Our kids do not attend public school - never have.  The kids never set an alarm clock to get up, and","messageBody":"<div id=\"ygrps-yiv-1678440293\">Pam -<br/>\n<br/>\nOkay, here&#39;s the absolute truth of the matter...<br/>\n<br/>\nOur kids do not attend public school - never have.  The kids never <br/>\nset an alarm clock to get up, and they often stay up very late if <br/>\nwe&#39;re outside together in the garden or watching a good video <br/>\ntogether.  They are free to spend their days learning and exploring.  <br/>\nThey will sometimes collect rocks, hold chickens, ride their bikes, <br/>\nlisten to their bird call CD, take care of pets.  They ask me <br/>\nquestions, we research, we read, we learn, we have fun.  We don&#39;t <br/>\nschedule learning - it happens.  In this way, we are unschoolers.<br/>\n<br/>\nHere are where our paths diverge:<br/>\n<br/>\nI think it&#39;s perfectly fine for me to be standing at the sink washing <br/>\ndishes and as my 5-year-old son runs by playing to say, &quot;Hey, Braden, <br/>\nI need you to get me a couple of trash bags out and bring them over <br/>\nhere, please.&quot;    I don&#39;t say, &quot;Braden, if it&#39;s okay with you and if <br/>\nyou CHOOSE to do so, and if it won&#39;t hurt you to be REQUIRED to do <br/>\nthis, could you please bring Mommy two trash bags?&quot;  If I ask him to <br/>\nplease get them for me and he continues on his merry way and does not <br/>\nCHOOSE to help me, he will be in trouble; not because he&#39;s a little <br/>\nbrat but because he needs to know it was wrong to ignore someone who <br/>\nasked for help and that he should have been considerate of that.  Why <br/>\nwould he do this?  He is a child and they are not always <br/>\nautomatically considerate of others.  They will learn it as the years <br/>\ngo on, but when small need to be shown and told.<br/>\n<br/>\nAfter I told you how I perceive the concept of laziness, you <br/>\nsaid, &quot;The dictionary definition of lazy doesn&#39;t really include that <br/>\nkind of selfish implication,&quot; and then you listed what the definition <br/>\nof lazy was, which includes:<br/>\n<br/>\nResistant to work or exertion; disposed to idleness.<br/>\nSlow-moving; sluggish: a lazy river.<br/>\nConducive to idleness or indolence: a lazy summer day.<br/>\nDepicted as reclining or lying on its side. Used of a brand on  <br/>\nlivestock.<br/>\n<br/>\nDoesn&#39;t this fit with the scenarios I gave?  Being &quot;resistant to work <br/>\nor exertion&quot;?  In fact, the definition of the word &quot;indolent&quot; itself <br/>\nis &quot;disliking or avoiding work; idle; lazy; causing little or no <br/>\npain.&quot;  This can be selfish behavior if others are impacted and <br/>\nsuffer for it.  Whatever name one want to give to the behavior, it is <br/>\nnot good manners and not a character trait I want to model or to see <br/>\ndevelop in our children.<br/>\n <br/>\nYou said, &quot;You do seem to think that kids won&#39;t voluntarily and  <br/>\nspontaneously help around the house - you think they have to be  <br/>\nrequired to do so, right?&quot;    NO, NO, NO!  I never said that. My <br/>\nchildren daily come and ask if they can help with this or that. But <br/>\nplease realize, they are ages 8, 7, and 5, and because of their ages <br/>\nthey do have be told/reminded/asked/encouraged and yes, sometimes <br/>\nrequired to do things that need to be done. If I carry up a couple of <br/>\nbasketfuls of clean clothes and the girls are watching a movie or <br/>\nsomething and I say, &quot;Here, please get these folded,&quot; I don&#39;t believe <br/>\ntheir childhood world is going to come crashing down around them.  <br/>\nBecause we&#39;re a homeschooling family, our entire lives are centered <br/>\naround doing things together, learning together, and working <br/>\ntogether. <br/>\n<br/>\nI know this will shock and horrify some, but I will REQUIRE the kids <br/>\nto take a shower/bath tomorrow, I will REQUIRE they brush their teeth <br/>\nbefore bed tonight, I will REQUIRE they help clean off the table if <br/>\nthey forget and start to walk away, and I will REQUIRE that they <br/>\nperiodically clean their room.  We REQUIRE these things because we <br/>\nlove them, not to suppress their ability to choose and not to ruin <br/>\ntheir lives.<br/>\n<br/>\nI know I have not (and will not) arrive at the same level <br/>\nof &quot;unschooling consciousness&quot; as most on this board, but we&#39;re all <br/>\ndoing what we think is best and learning in the process.<br/>\n<br/>\n<br/>\n<br/>\nTrudy Powell</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150493332","msgId":14675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODVGQTJGRkU1NTcyRS03RTQtMUFGN0BtYmxrLWQxNy5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg=="},"prevInTopic":14665,"nextInTopic":14678,"prevInTime":14674,"nextInTime":14676,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... From: Trudy  However, I will teach them what it takes to consider others and to follow through on choices made which do have an","messageBody":"<div id=\"ygrps-yiv-1101965783\">-----Original Message-----<br/>\nFrom: Trudy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trudypowell@...\">trudypowell@...</a>&gt;<br/>\n<br/>\nHowever, I will teach them what it takes to consider others and to <br/>\nfollow through on<br/>\nchoices made which do have an impact on others.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nHow will you teach them that?<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot;  <br/>\n~Frank Smith<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Team Commitments (Pam - Answers To Your Questions)","postDate":"1150489529","msgId":14665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFRjUyQkExLTc1ODYtNENEMy1CNDI1LTJBRkJGRjU3Qzg1MUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2dXEydCtqYjQ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGU2dXEydCtqYjQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":14660,"nextInTopic":14675,"prevInTime":14664,"nextInTime":14666,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... Okay - that s why I asked, because I think most people do say, lazy, when people are goofing off, lying around, not doing something that the other","messageBody":"<div id=\"ygrps-yiv-896284207\">On Jun 16, 2006, at 10:34 AM, Trudy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Pam �<br/>\n&gt;<br/>\n&gt; Thanks for your questions.  I&#39;ll see if I can accurately explain what<br/>\n&gt; I mean (please bear with me).<br/>\n&gt;<br/>\n&gt; First let me describe what I would consider to be &quot;lazy&quot; behavior.<br/>\n&gt; Some earlier seemed to imply that I said (which I did not) that if<br/>\n&gt; one chose to sit around and read a book instead of doing dishes, then<br/>\n&gt; that&#39;s laziness or if someone stayed home from work and ran around in<br/>\n&gt; their underwear then that was laziness.<br/>\n<br/>\n </span></blockquote>Okay - that&#39;s why I asked, because I think most people do say,  <br/>\n&quot;lazy,&quot; when people are goofing off, lying around, not &quot;doing  <br/>\nsomething&quot; that the other person thinks they ought to be doing. So -  <br/>\nwe&#39;re clear that that is not what you mean, right?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s not what I meant.   I<br/>\n&gt; would say that laziness becomes a true state mostly when others are<br/>\n&gt; involved and that it  (laziness) can be a very close cousin to<br/>\n&gt; selfishness.   The way someone could be characterized as lazy, in my<br/>\n&gt; opinion, would be when one would choose to let others continually<br/>\n&gt; complete all tasks and do all the labor but benefit without ever<br/>\n&gt; offering help or assistance.<br/>\n<br/>\n </span></blockquote>The dictionary definition of lazy doesn&#39;t really include that kind of  <br/>\nselfish implication:<br/>\n<br/>\nResistant to work or exertion; disposed to idleness.<br/>\nSlow-moving; sluggish: a lazy river.<br/>\nConducive to idleness or indolence: a lazy summer day.<br/>\nDepicted as reclining or lying on its side. Used of a brand on  <br/>\nlivestock.<br/>\nBut my point here isn&#39;t to define the word - but to understand each  <br/>\nother better. And I think I do understand better, now, what you are  <br/>\nreferring to, although I think it is something beyond &quot;lazy.&quot;<br/>\n<br/>\nI don&#39;t see the problem aspect of this as being laziness, but as  <br/>\nbeing selfishness. In your first example that follows, I&#39;d say the  <br/>\nproblem might not be that the worker is lazy, he might be quite a  <br/>\nhigh-energy active person who does all kinds of things, outside of  <br/>\nwork. The problem is that he&#39;s dishonest - he&#39;s shirking work and  <br/>\ngetting paid for it. Do you see that &quot;lazy&quot; might be a misleading  <br/>\nlabel?   In your example in the later paragraph, for example, the  <br/>\nproblem isn&#39;t that the people are too &quot;lazy&quot; to mow their lawn, they  <br/>\nmight be VERY energetic and active people who are very (nonlazily)  <br/>\nworking hard on something else! The problem is that they aren&#39;t being  <br/>\nconsiderate of their neighbors.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Let me explain further with some PRETEND scenarios (others earlier<br/>\n&gt; seemed to think I was giving real scenarios during these<br/>\n&gt; discussions).  I had previously mentioned that there could be<br/>\n&gt; instances where a co-worker at a job situation consistently does not<br/>\n&gt; complete tasks, causing others to do more work than they would have<br/>\n&gt; otherwise.  In most instances such a person would eventually be<br/>\n&gt; fired.  There are often cases, however, where this is not true and<br/>\n&gt; the person continues to show up, not really contribute, but draw the<br/>\n&gt; same wages, benefits, etc. as others without being terminated.  I<br/>\n&gt; would consider this person lazy.  Are they and unhappy, dissatisfied,<br/>\n&gt; unfulfilled person?  Yes, probably.<br/>\n<br/>\n<br/>\n&gt; Does this make their actions (or lack of) justifiable?<br/>\n<br/>\n </span></blockquote>Big question - sometimes yes, sometimes no, I suppose. The problem  <br/>\nwith these scenarios is that we&#39;re talking about adults - not our own  <br/>\nchildren. If we&#39;re talking about our own children, the question is  <br/>\nnot one of their actions being &quot;justifiable&quot; or not - it is how can  <br/>\nwe help them become honest, caring, responsible people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not in my opinion.  Their actions have<br/>\n&gt; impacted others in a negative way and they are benefiting<br/>\n&gt; (selfishness).<br/>\n&gt;<br/>\n </span></blockquote>Agreed. And, most likely, I&#39;d judge them, as you are, as selfish and  <br/>\nthey aren&#39;t people I&#39;d choose to be around. (I&#39;m hedging a little  <br/>\nbecause I can think of times that I wouldn&#39;t judge them, I&#39;d work  <br/>\naround them and help them out - situations where the person is  <br/>\nclearly suffering from untreated mental illness, for example, or  <br/>\nsituations where person has had a terrible trauma and is suffering  <br/>\npost-traumatic stress and is getting better, but needs time. If  <br/>\nyou&#39;re saying we don&#39;t want our kids to grow up like them, then,  <br/>\nyeah, I think most of us probably agree on that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another PRETEND scenario.  It&#39;s summer and most folks have lawns that<br/>\n&gt; need to be mowed about once a week.  Most people choose to keep their<br/>\n&gt; yards looking well-groomed because they enjoy it and out of courtesy<br/>\n&gt; to their neighbors.  There could be a family, however, in a<br/>\n&gt; neighborhood that does not consider yard work a priority and it gets<br/>\n&gt; to the point that the grass is so high that you can barely see the<br/>\n&gt; house. Because a next-door neighbor has their own house on the<br/>\n&gt; market, they offer  - and are allowed � to mow the yard.  In fact,<br/>\n&gt; the residents are more than happy to let the neighbor do so as they<br/>\n&gt; don&#39;t like to do it (too hot, hard, would rather watch movies, etc.)<br/>\n&gt; Would I consider this lazy behavior?  Yes, because their actions have<br/>\n&gt; impacted others in a negative way.<br/>\n<br/>\n </span></blockquote>Yeah - that isn&#39;t really what &quot;lazy&quot; means, though. The &quot;lazy river&quot;  <br/>\nat the water park is a slow-moving, meandering river - not a selfish  <br/>\nriver. So - maybe this conversation would all make a little more  <br/>\nsense and be more enlightening if we agree that what you&#39;re talking  <br/>\nabout is self-centeredness, lack of empathy, lack of consideration,  <br/>\netc., something more than &quot;lazy.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You asked if I think once can make a kid less lazy by forcing them to<br/>\n&gt; do things against their will.  No.  I do think, however, that by<br/>\n&gt; sometimes requiring that certain things be done that kids can learn<br/>\n&gt; the satisfaction that comes from a task completed (i.e. cleaning a<br/>\n&gt; closet, folding laundry and seeing the nice pile of clean clothes,<br/>\n&gt; etc.)<br/>\n<br/>\n </span></blockquote>I VERY much do agree that doing jobs and getting that sense of  <br/>\nsatisfaction from a task well done IS really a wonderful thing. I  <br/>\ndon&#39;t think force/requirement is at all conducive to engendering that  <br/>\ngreat feeling though. Typically, required tasks are more likely to be  <br/>\ncompleted with as little enthusiasm and caring as possible. Typically  <br/>\npeople just &quot;get it done&quot; and take the easy way out. At worst, the  <br/>\ntasks are completed resentfully and the attitude is not at all what  <br/>\nwe&#39;re hoping to develop.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also think that they can be shown that as people work<br/>\n&gt; together to get work, chores, tasks (whatever one wishes to call it)<br/>\n&gt; done that they are a valuable part of that process and their input<br/>\n&gt; really made a difference, and we had a great time in the process.<br/>\n<br/>\n </span></blockquote>Yes. And this is FAR more likely to be how things work out when the  <br/>\ntasks are not coerced/required/forced, but when the family works  <br/>\ntogether voluntarily.  I wonder if you were thinking that our kids do  <br/>\nNOT help out, don&#39;t work together to get work done, are not a  <br/>\nvaluable part of the process, with input that makes a difference?  <br/>\nI&#39;ve spent a whole lot of time with a bunch of unschooling families -  <br/>\nthe kids are usually amazingly helpful. They JUMP up to help out.  <br/>\nTrue example - I was at Sandra Dodd&#39;s house - we were sitting around  <br/>\nhalf watching tv, half talking - her 14 yo was looking for a certain  <br/>\nshirt and Sandra suggested she look down in the basement, in the  <br/>\nlaundry area. She found it there AND she noticed a load of clean  <br/>\nlaundry in the dryer and she carried it upstairs to us and we all sat  <br/>\nthere and folded laundry, having a blast. It wasn&#39;t Holly&#39;s job. It  <br/>\nwasn&#39;t required. It was just something that she noticed needed to be  <br/>\ndone and she did it without giving it a whole lot of thought. In a  <br/>\nfamily with assigned chores, it would probably not have been Holly&#39;s  <br/>\nturn to do laundry and she&#39;d have left it sitting in the dryer,  <br/>\nwaiting for the assigned person to take care of it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You asked where I think laziness comes from.  I would suppose that it<br/>\n&gt; comes from one discovering that they are rewarded in some way,<br/>\n&gt; whether it be physically or emotionally whether they have taken part<br/>\n&gt; or not.<br/>\n<br/>\n </span></blockquote>This view of human nature is a little different than mine - i don&#39;t  <br/>\nthink of people as being &quot;conditioned&quot; by rewards and punishments, so  <br/>\nmuch as I used to, years ago. I think there is far more complexity in  <br/>\nthe problems/behaviors. For example, in the following examples you  <br/>\ngive, able-bodied people taking welfare, there is far more than  <br/>\n&quot;laziness&quot; involved - it is more likely to be a sense of  <br/>\nincompetence, inadequacy, lack of trust and sense of self, lack of  <br/>\npride and even self-loathing. (I&#39;m also excluding, as I am sure you  <br/>\nwere, people who simply have had a run of bad luck and are taking  <br/>\nneeded help to get themselves through.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think many people require, due to circumstances beyond<br/>\n&gt; their control, some kind of government assistance or help in the form<br/>\n&gt; of a welfare check or food stamps.  I also think there are many able-<br/>\n&gt; bodied people who choose to accept the help without putting forth the<br/>\n&gt; effort to work.  Again, not in all cases, but I think a lot of that<br/>\n&gt; goes on.  I would consider this laziness and these people are<br/>\n&gt; ultimately being rewarded for it.<br/>\n<br/>\n </span></blockquote>So - extending this - are you thinking that kids end up lazy because  <br/>\nthey are rewarded for it?<br/>\nI&#39;d like to have a separate conversation about this, perhaps, because  <br/>\nit is a view of human nature shared by MANY people - and I used to be  <br/>\namong them. But I&#39;ve come to think, over many years, that it is a too- <br/>\nnarrow view of human nature - makes humans seem not much more than  <br/>\nreally smart animals. But I don&#39;t think that is true - I think people  <br/>\nhave inborn traits that make us different - and we respond to far  <br/>\nmore than Pavlovian-style operant conditioning. We aren&#39;t nearly as  <br/>\n&quot;trainable&quot; as people like B.F.Skinner would have led us to believe.  <br/>\nA great book on this subject is Alfie Kohn&#39;s newest - &quot;Unconditional  <br/>\nParenting.&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Some have suggested that there is no such thing as laziness � that<br/>\n&gt; it&#39;s a &quot;myth&quot;.<br/>\n<br/>\n </span></blockquote>I don&#39;t think that &quot;laziness&quot; is a useful concept as applied to  <br/>\nchildren. Whether adults have learned to be lazy - in the selfish  <br/>\nnegative way you&#39;ve defined it? I&#39;m not really equipped to say much  <br/>\nabout that. But children are not lazy - they are born with an innate  <br/>\ndesire to do well, to contribute, to be productive, to be part of  <br/>\ntheir community, and so on. That only needs to be supported and  <br/>\nnurtured - they do not need to be &quot;trained&quot; not to be lazy through  <br/>\nrewards, praise, positive reinforcement, or punishment.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is unkindness, unhappiness, impatience,<br/>\n&gt; industriousness, helpfulness, kindness a myth?<br/>\n<br/>\n </span></blockquote>None of those are &quot;lazy.&quot; Maybe &lt;G&gt;. Unkindness is often not  <br/>\nintentional, especially in children. So although the result may seem  <br/>\nunkind, it is very often the case that the child is not an unkind  <br/>\nchild. Often the child simply hasn&#39;t yet developed enough empathetic  <br/>\nability, yet, to understand that their own behavior is unkind. They  <br/>\nlearn that, over time, by being supported in kindness, being treated  <br/>\nkindly, and by parents who talk with them about how other people are  <br/>\nlikely to be feeling. You don&#39;t create kindness in a child by forcing  <br/>\nthem to do kind things. Unhappiness is real, for sure. It is often  <br/>\nthe result of kids being treated as if they are &quot;lazy&quot; and the real  <br/>\nreasons for their behavior are discounted or ignored - often, in  <br/>\nschool, these are real learning differences and expectations that are  <br/>\nunrealistic. Industriousness - kids are born with temperaments and  <br/>\nthere are those who are more &quot;active&quot; and others more &quot;passive&quot; - so  <br/>\nmaybe industriousness comes under that? But, if you want a kid to  <br/>\nlearn to be less industrious, calling them lazy is probably going to  <br/>\nwork. Helpfulness - is real, of course, in concrete ways and in  <br/>\nattitude.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Again, I am NOT<br/>\n&gt; saying that procrastination is laziness.  However a continual<br/>\n&gt; practice of letting others do the work (whatever that may be) while<br/>\n&gt; still being rewarded for that behavior could result in laziness.<br/>\n<br/>\n </span></blockquote>So - again - it is being rewarded for shirking that you think leads  <br/>\nto laziness?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have gotten the impression over the past few days of these<br/>\n&gt; discussions that many here are somehow resentful of their own<br/>\n&gt; upbringings and feel that they were required to do too much or<br/>\n&gt; somehow resented their family (parents) for it.  I must say that I<br/>\n&gt; have very fond memories of my childhood.<br/>\n<br/>\n </span></blockquote>I had a wonderful childhood - not oppressive at all. I totally model  <br/>\nmy own parenting on my mother - she&#39;d have unschooled us if she&#39;d  <br/>\nknown about it, I&#39;m sure. She was a total supporter of it - thought  <br/>\nit was a natural extension of the way young children ought to be  <br/>\ntreated.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a twin sister, and<br/>\n&gt; she always shared a room (and a bed), and Dad would sometimes come in<br/>\n&gt; on a Saturday morning and wake us up and say, &quot;Come on, girls, we&#39;re<br/>\n&gt; going to help Mom and get some work done around here today.&quot;&quot; Did I<br/>\n&gt; want to get up?  No way  - I&#39;ve never been a morning person.  Do I<br/>\n&gt; resent it?  Not in the least.  Would I have chosen as a 9- or 10-year-<br/>\n&gt; old girl to get up early on a Saturday and start vacuuming and<br/>\n&gt; dusting?   I can&#39;t say I would have, but it helped my Mom, Dad said<br/>\n&gt; we were going to, and for some strange reason we&#39;re all very close<br/>\n&gt; and so far no ugly resentment monsters have reared their heads.  I<br/>\n&gt; think they&#39;re great!<br/>\n<br/>\n </span></blockquote>However, you do seem to think that kids won&#39;t voluntarily and  <br/>\nspontaneously help around the house - you think they have to be  <br/>\nrequired to do so, right? So - although you don&#39;t feel resentful over  <br/>\nbeing made to work, yourself, you are finding it hard to believe that  <br/>\nit isn&#39;t necessary. I can say to my kids, &quot;Hey, let&#39;s all get up  <br/>\nearly tomorrow and clean the house from top to bottom.&quot; They might,  <br/>\nand have, said, &quot;Yes, good idea.&quot; But they might also say, &quot;NAH - not  <br/>\ntomorrow morning - I want to stay up really late tonight. Can we do  <br/>\nit later?&quot; We&#39;ve had LOTS and lots of times that we all worked  <br/>\ntogether and cleaned for a few hours - and enjoyed the end result!  <br/>\nBut that is a lot more fun and valuable when they do it voluntarily -  <br/>\nbecause it DOES feel good to work together and because the<br/>\n<br/>\nI don&#39;t want my husband waking me up early on Saturday morning  <br/>\nbecause HE decided it was cleaning day and I would not do that to my  <br/>\nkids, either. I can only imagine how I&#39;d react if my husband tried it  <br/>\n&lt;G&gt;.  I think it is modeling rudeness and that might makes right.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; One last thing�a TRUE scenario this time.  Our two daughters have<br/>\n&gt; asked all week if we could go this afternoon to the library to a<br/>\n&gt; story time there, during which a local TV news personality will be<br/>\n&gt; reading.  I told them yes, we could go, and they&#39;re very excited.<br/>\n&gt; While we were discussing it a while ago, my 5-year-old son all of a<br/>\n&gt; sudden said, &quot;I don&#39;t want to go.  I don&#39;t like to do that&quot; (which<br/>\n&gt; was the first I&#39;d heard that).  I asked him what he would rather do.<br/>\n&gt; He said he&#39;d rather go explore in the woods or be outside.  I<br/>\n&gt; said, &quot;I was just in the woods this morning picking raspberries; why<br/>\n&gt; didn&#39;t you come out with me?&quot;  His response, &quot;I didn&#39;t want to pick<br/>\n&gt; raspberries.&quot;  He is 5.  I can&#39;t leave him here alone.  I have<br/>\n&gt; promised his sisters that we&#39;re going.  He is going to have to do<br/>\n&gt; something he does not want to do in the interest of others because he<br/>\n&gt; is part of our family.  Knowing him as I do, I think he will<br/>\n&gt; thoroughly enjoy himself once there; just as I often enjoy something<br/>\n&gt; that I initially have dreaded.<br/>\n<br/>\n </span></blockquote>So - we work things out. You drop them at the library and take him  <br/>\nover to a local park. Or you offer to get him ice cream on the way  <br/>\nhome. Or whatever.... That&#39;s family dynamics, people spending time,  <br/>\nmaking an effort, to find a mutually agreeable solution to a conflict  <br/>\nof interest. We don&#39;t just say, &quot;Well too bad, you have to go.&quot; EVEN  <br/>\nif it ends up that he goes reluctantly, you will have modeled being  <br/>\nextremely solution-oriented and being extremely willing to consider  <br/>\nhis interests. Those translate into things like industriousness and  <br/>\nkindness, as you mentioned up above.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Sorry this is so long.<br/>\n&gt;<br/>\n </span></blockquote>No - good details and the only way to really come to understand  <br/>\ndifference of opinion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Trudy Powell<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------ Yahoo! Groups Sponsor -------------------- <br/>\n&gt; ~--&gt;<br/>\n&gt; Something is new at Yahoo! Groups.  Check out the enhanced email  <br/>\n&gt; design.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/uSQhKB/gOaOAA/HwKMAA/0xXolB/TM\">http://us.click.yahoo.com/uSQhKB/gOaOAA/HwKMAA/0xXolB/TM</a><br/>\n&gt; -------------------------------------------------------------------- <br/>\n&gt; ~-&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Unschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150486430","msgId":14660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODVGOTJFRDhFMEMwMi03RTQtMTFCOEBtYmxrLWQxNy5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+"},"prevInTopic":14655,"nextInTopic":14665,"prevInTime":14659,"nextInTime":14661,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... From: Trudy  Our youngest child, our son who is 5 years old, is playing on his first baseball team this summer. He is really","messageBody":"<div id=\"ygrps-yiv-1099720517\">-----Original Message-----<br/>\n From: Trudy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trudypowell@...\">trudypowell@...</a>&gt;<br/>\n<br/>\n  Our youngest child, our son who is 5 years old, is playing on his <br/>\nfirst<br/>\n baseball team this summer. He is really enjoying it. I think if we<br/>\n  came up against a situation where he was wanting to quit, we would <br/>\nhave<br/>\n to determine if it was laziness on his part (a character flaw we want<br/>\n to avoid) or if there was some kind of detrimental activity going on<br/>\n within the group (i.e. unfit coach, bullying children, etc.). Before<br/>\n joining the team, we want the kids to know what they are committing to<br/>\n for that period of time. The definition of the word &quot;team&quot; is &quot;A group<br/>\n of people working together in a coordinated effort; to join in<br/>\n cooperative activity.&quot; In Philippians 2:4 it says, &quot;Everyone should<br/>\n look out not only for his own interests, but also for the interests of<br/>\n others,&quot; and in the case of a team sport, unless something was going<br/>\n terribly wrong, we would have them finish that particular group of<br/>\n games, meets, etc. and then quit when that season is over.<br/>\n<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n This advice is taking the sport more seriously than the child.<br/>\n<br/>\n  I hope none of you will accept this as unschooling/gentle parenting <br/>\nadvice.<br/>\n<br/>\n  Learning that you have no choice and must finish what you start can <br/>\nhinder participation in future sports/endeavors. Better to learn how to <br/>\ngracefully exist than to stay because you feel you *have* to.<br/>\n<br/>\n  I don&#39;t like that the parents are making the determinations. It should <br/>\nbe up to the child.<br/>\n<br/>\n  And the &quot;character flaw&quot; of &quot;laziness&quot; is just plain creepy. &quot;Terribly <br/>\nwrong&quot; should be as simple as the child not liking the sport or <br/>\nteammates or coach or heat.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot; <br/>\n~Frank Smith<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Team Commitments (Pam - Answers To Your Questions)","postDate":"1150482886","msgId":14655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjE2MTgzNDQ2LjgxNTYwLnFtYWlsQHdlYjU0NDA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGU2dXEydCtqYjQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":14647,"nextInTopic":14660,"prevInTime":14654,"nextInTime":14656,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... My kids have experienced the satisfaction from completing a task, that they chose themselves. I have not felt the need to require them to do a task for ","messageBody":"<div id=\"ygrps-yiv-1621415944\">--- Trudy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trudypowell@...\">trudypowell@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You asked if I think once can make a kid less lazy<br/>\n&gt; by forcing them to <br/>\n&gt; do things against their will.  No.  I do think,<br/>\n&gt; however, that by <br/>\n&gt; sometimes requiring that certain things be done that<br/>\n&gt; kids can learn <br/>\n&gt; the satisfaction that comes from a task completed<br/>\n&gt; (i.e. cleaning a <br/>\n&gt; closet, folding laundry and seeing the nice pile of<br/>\n&gt; clean clothes, <br/>\n&gt; etc.) <br/>\n </span></blockquote>My kids have experienced the satisfaction from<br/>\ncompleting a task, that they chose themselves. I have<br/>\nnot felt the need to require them to do a task for<br/>\nthem to experience the satisfaction.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also think that they can be shown that as<br/>\n&gt; people work <br/>\n&gt; together to get work, chores, tasks (whatever one<br/>\n&gt; wishes to call it) <br/>\n&gt; done that they are a valuable part of that process<br/>\n&gt; and their input <br/>\n&gt; really made a difference, and we had a great time in<br/>\n&gt; the process.<br/>\n </span></blockquote>I agree with what you say about working together. I do<br/>\ntry to involve my kids in working with me to fold<br/>\nlaundry, pick up the room or whatever. But most of the<br/>\ntime the word chore is used to mean a task that is<br/>\nassigned to the kid by the parent. The kid has no say<br/>\nin it. There is a big difference between saying &quot;let&#39;s<br/>\npick up these toys, so you&#39;ll have more room to play<br/>\nin&quot; versus &quot;Go clean your room&quot;.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":210833586,"authorName":"Trudy","from":"&quot;Trudy&quot; &lt;trudypowell@...&gt;","profile":"trudyhome99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Team Commitments (Pam - Answers To Your Questions)","postDate":"1150479261","msgId":14647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2dXEydCtqYjQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxNTBENTQ2LUU3NDQtNDc2Ny1CMkM3LTg1NkY1OTQwODQwNkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":14618,"nextInTopic":14655,"prevInTime":14646,"nextInTime":14648,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"Pam – Thanks for your questions.  I ll see if I can accurately explain what I mean (please bear with me). First let me describe what I would consider to be","messageBody":"<div id=\"ygrps-yiv-1718625542\">Pam <br/>\n<br/>\nThanks for your questions.  I&#39;ll see if I can accurately explain what <br/>\nI mean (please bear with me).<br/>\n<br/>\nFirst let me describe what I would consider to be &quot;lazy&quot; behavior.  <br/>\nSome earlier seemed to imply that I said (which I did not) that if <br/>\none chose to sit around and read a book instead of doing dishes, then <br/>\nthat&#39;s laziness or if someone stayed home from work and ran around in <br/>\ntheir underwear then that was laziness.  That&#39;s not what I meant.   I <br/>\nwould say that laziness becomes a true state mostly when others are <br/>\ninvolved and that it  (laziness) can be a very close cousin to <br/>\nselfishness.   The way someone could be characterized as lazy, in my <br/>\nopinion, would be when one would choose to let others continually <br/>\ncomplete all tasks and do all the labor but benefit without ever <br/>\noffering help or assistance.<br/>\n<br/>\nLet me explain further with some PRETEND scenarios (others earlier <br/>\nseemed to think I was giving real scenarios during these <br/>\ndiscussions).  I had previously mentioned that there could be <br/>\ninstances where a co-worker at a job situation consistently does not <br/>\ncomplete tasks, causing others to do more work than they would have <br/>\notherwise.  In most instances such a person would eventually be <br/>\nfired.  There are often cases, however, where this is not true and <br/>\nthe person continues to show up, not really contribute, but draw the <br/>\nsame wages, benefits, etc. as others without being terminated.  I <br/>\nwould consider this person lazy.  Are they and unhappy, dissatisfied, <br/>\nunfulfilled person?  Yes, probably.  Does this make their actions (or <br/>\nlack of) justifiable?  Not in my opinion.  Their actions have <br/>\nimpacted others in a negative way and they are benefiting <br/>\n(selfishness).<br/>\n<br/>\nAnother PRETEND scenario.  It&#39;s summer and most folks have lawns that <br/>\nneed to be mowed about once a week.  Most people choose to keep their <br/>\nyards looking well-groomed because they enjoy it and out of courtesy <br/>\nto their neighbors.  There could be a family, however, in a <br/>\nneighborhood that does not consider yard work a priority and it gets <br/>\nto the point that the grass is so high that you can barely see the <br/>\nhouse. Because a next-door neighbor has their own house on the <br/>\nmarket, they offer  - and are allowed  to mow the yard.  In fact, <br/>\nthe residents are more than happy to let the neighbor do so as they <br/>\ndon&#39;t like to do it (too hot, hard, would rather watch movies, etc.)  <br/>\nWould I consider this lazy behavior?  Yes, because their actions have <br/>\nimpacted others in a negative way.  <br/>\n<br/>\nYou asked if I think once can make a kid less lazy by forcing them to <br/>\ndo things against their will.  No.  I do think, however, that by <br/>\nsometimes requiring that certain things be done that kids can learn <br/>\nthe satisfaction that comes from a task completed (i.e. cleaning a <br/>\ncloset, folding laundry and seeing the nice pile of clean clothes, <br/>\netc.)  I also think that they can be shown that as people work <br/>\ntogether to get work, chores, tasks (whatever one wishes to call it) <br/>\ndone that they are a valuable part of that process and their input <br/>\nreally made a difference, and we had a great time in the process.<br/>\n<br/>\nYou asked where I think laziness comes from.  I would suppose that it <br/>\ncomes from one discovering that they are rewarded in some way, <br/>\nwhether it be physically or emotionally whether they have taken part <br/>\nor not.   I think many people require, due to circumstances beyond <br/>\ntheir control, some kind of government assistance or help in the form <br/>\nof a welfare check or food stamps.  I also think there are many able-<br/>\nbodied people who choose to accept the help without putting forth the <br/>\neffort to work.  Again, not in all cases, but I think a lot of that <br/>\ngoes on.  I would consider this laziness and these people are <br/>\nultimately being rewarded for it.<br/>\n<br/>\nSome have suggested that there is no such thing as laziness  that <br/>\nit&#39;s a &quot;myth&quot;.  Is unkindness, unhappiness, impatience, <br/>\nindustriousness, helpfulness, kindness a myth?   Again, I am NOT <br/>\nsaying that procrastination is laziness.  However a continual <br/>\npractice of letting others do the work (whatever that may be) while <br/>\nstill being rewarded for that behavior could result in laziness.<br/>\n<br/>\nI have gotten the impression over the past few days of these <br/>\ndiscussions that many here are somehow resentful of their own <br/>\nupbringings and feel that they were required to do too much or <br/>\nsomehow resented their family (parents) for it.  I must say that I <br/>\nhave very fond memories of my childhood.  I have a twin sister, and <br/>\nshe always shared a room (and a bed), and Dad would sometimes come in <br/>\non a Saturday morning and wake us up and say, &quot;Come on, girls, we&#39;re <br/>\ngoing to help Mom and get some work done around here today.&quot;&quot; Did I <br/>\nwant to get up?  No way  - I&#39;ve never been a morning person.  Do I <br/>\nresent it?  Not in the least.  Would I have chosen as a 9- or 10-year-<br/>\nold girl to get up early on a Saturday and start vacuuming and <br/>\ndusting?   I can&#39;t say I would have, but it helped my Mom, Dad said <br/>\nwe were going to, and for some strange reason we&#39;re all very close <br/>\nand so far no ugly resentment monsters have reared their heads.  I <br/>\nthink they&#39;re great!<br/>\n<br/>\nOne last thinga TRUE scenario this time.  Our two daughters have <br/>\nasked all week if we could go this afternoon to the library to a <br/>\nstory time there, during which a local TV news personality will be <br/>\nreading.  I told them yes, we could go, and they&#39;re very excited.  <br/>\nWhile we were discussing it a while ago, my 5-year-old son all of a <br/>\nsudden said, &quot;I don&#39;t want to go.  I don&#39;t like to do that&quot; (which <br/>\nwas the first I&#39;d heard that).  I asked him what he would rather do.  <br/>\nHe said he&#39;d rather go explore in the woods or be outside.  I <br/>\nsaid, &quot;I was just in the woods this morning picking raspberries; why <br/>\ndidn&#39;t you come out with me?&quot;  His response, &quot;I didn&#39;t want to pick <br/>\nraspberries.&quot;  He is 5.  I can&#39;t leave him here alone.  I have <br/>\npromised his sisters that we&#39;re going.  He is going to have to do <br/>\nsomething he does not want to do in the interest of others because he <br/>\nis part of our family.  Knowing him as I do, I think he will <br/>\nthoroughly enjoy himself once there; just as I often enjoy something <br/>\nthat I initially have dreaded.<br/>\n<br/>\nSorry this is so long.<br/>\n<br/>\n<br/>\nTrudy Powell</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150437254","msgId":14618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNTBENTQ2LUU3NDQtNDc2Ny1CMkM3LTg1NkY1OTQwODQwNkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg==","referencesHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg=="},"prevInTopic":14594,"nextInTopic":14647,"prevInTime":14617,"nextInTime":14619,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... I asked a couple of questions in response to your post. The questions are intended to get at the idea of lazy a bit more - in order to see whether or not","messageBody":"<div id=\"ygrps-yiv-2072609366\">On Jun 14, 2006, at 1:58 PM, Trudy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lest someone think I yell at the kids and tell them they&#39;re lazy, let<br/>\n&gt; me assure you I&#39;ve never done so and never will; However, I will<br/>\n&gt; teach them what it takes to consider others and to follow through on<br/>\n&gt; choices made which do have an impact on others.<br/>\n<br/>\n </span></blockquote>I asked a couple of questions in response to your post. The questions  <br/>\nare intended to get at the idea of &quot;lazy&quot; a bit more - in order to  <br/>\nsee whether or not we might really differ in our ideas of how kids  <br/>\nshould be treated, even though our goal seems the same. I&#39;m happy to  <br/>\nreport that my kids (21, 18, and 15) are really considerate people  <br/>\nand most definitely regularly consider the impact their choices might  <br/>\nhave on others. There are things I could say about how they have  <br/>\ngotten this way - but I kind of wanted to see if maybe our starting  <br/>\npoint - our underlying belief about human nature is really different  <br/>\nin these two areas (1)  how kids respond to being made to do things  <br/>\nand (2) where laziness comes from in the first place.<br/>\n<br/>\nHere they are again.<br/>\n<br/>\nDo you think you can make a kid less &quot;lazy&quot; by forcing them to do  <br/>\nthings against their will?<br/>\n<br/>\nWhere do you think &quot;laziness&quot; comes from?<br/>\n<br/>\n<br/>\n--pam<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150396287","msgId":14594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjE1MTgzMTI3LjM2OTM4LnFtYWlsQHdlYjU0NDA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDhEOTNGQkRCLUQ4QzgtNEU2RC05OEJELUYyOTM0NzQ3MUI0NUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":14592,"nextInTopic":14618,"prevInTime":14593,"nextInTime":14595,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... So that s the secret of my success and all this time I thought it was because I was smart ;-) Manisha, the lazy programmer :-) ","messageBody":"<div id=\"ygrps-yiv-1482326822\">--- Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They<br/>\n&gt; say lazy people  <br/>\n&gt; make the best programmers ;-) <br/>\n<br/>\n </span></blockquote>So that&#39;s the secret of my success and all this time I<br/>\nthought it was because I was smart ;-)<br/>\n<br/>\nManisha, the lazy programmer :-)<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150391232","msgId":14592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjE1MTcwNzEyLjQxNzQyLnFtYWlsQHdlYjU0NDExLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg=="},"prevInTopic":14588,"nextInTopic":14594,"prevInTime":14591,"nextInTime":14593,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... Yes, but only if that unpleasant thing that I have to do is a part of some bigger goal that _I_ have chosen and do want. I do laundry because I want to","messageBody":"<div id=\"ygrps-yiv-1160621168\">--- Trudy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trudypowell@...\">trudypowell@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Unschooling and all it entails doesn&#39;t mean never<br/>\n&gt; having to do <br/>\n&gt; something you don&#39;t want to do, in my opinion. <br/>\n </span></blockquote>Yes, but only if that unpleasant thing that I have to<br/>\ndo is a part of some bigger goal that _I_ have chosen<br/>\nand do want. I do laundry because I want to have clean<br/>\nclothes. I don&#39;t like to iron, so I don&#39;t. <br/>\n<br/>\nI can honestly say that after leaving school I haven&#39;t<br/>\ndone anything that I didn&#39;t want to do that didn&#39;t fit<br/>\nmy goals. And I&#39;ve been out of school for a long time<br/>\nand have what most would consider a successful career.<br/>\nThe same principle applies at work also. I do have to<br/>\ndo some boring stuff that I dislike, but it is part of<br/>\na bigger project. If more than a third of my work fell<br/>\ninto that category of things I have to do that I don&#39;t<br/>\nwant to, I will quit and find something I like better.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150373207","msgId":14588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MTUwNTA2dDdhYzhhYmJrOGFlOTE5NzY2ZTIwNDFlYUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg==","referencesHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+IDxlNnB0OTArY3VxOUBlR3JvdXBzLmNvbT4="},"prevInTopic":14587,"nextInTopic":14592,"prevInTime":14587,"nextInTime":14589,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... Laziness is still a perception from someone else s viewpoint.  Someone else may view that I am lazy because I didn t pick the scraps of fabric from my","messageBody":"<div id=\"ygrps-yiv-41674643\">On 6/14/06, Trudy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trudypowell@...\">trudypowell@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; Goodness, I didn&#39;t realize I would be offending so many by the use of<br/>\n&gt; the word &quot;lazy&quot;. The meaning of that word is &quot;unwilling to<br/>\n&gt; work.&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>Laziness is still a perception from someone else&#39;s viewpoint.  Someone<br/>\nelse may view that I am lazy because I didn&#39;t pick the scraps of<br/>\nfabric from my sewing project yesterday.  I view it as &quot;I&#39;m still<br/>\ngoing to have more scraps there today and I&#39;ll pick them up when I do<br/>\nan overall sweeping.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am lazy sometimes, putting off things that really need to be done,<br/>\n&gt; but I don&#39;t want it to be a regular part of my character day in and<br/>\n&gt; day out.<br/>\n<br/>\n </span></blockquote>Again it is perception.  Did you *really* *need* to do what you<br/>\ndidn&#39;t?  Obviously not because life continued without doing that<br/>\nthing.  You made a CHOICE about what you wanted to do - how you wanted<br/>\nto expend your energy.  How you CHOOSE to live your life and how YOU<br/>\nCHOOSE do describe yourself is all in your control.<br/>\n<br/>\n<br/>\nI think we&#39;ve all known or worked in the past with people<br/>\n<blockquote><span title=\"ireply\"> &gt; who are characterized in that way - willing to let others do all the<br/>\n&gt; laborious work, or those who jump ship when the going gets tough.<br/>\n<br/>\n </span></blockquote>We are talking about children here who have learned work ethics from<br/>\nexample not from being forced to do things.  And I would look at<br/>\n&quot;lazy&quot; people from the examples you provided and wonder why they were<br/>\nthere in the first place.  I don&#39;t worry about whether someone else is<br/>\npulling their own weight.  I worry only about whether I am making the<br/>\nright choices for me.  Someone who chooses not to work or pull through<br/>\nmay not have a job tomorrow.  For some people that is important.  For<br/>\nothers not so.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling and all it entails doesn&#39;t mean never having to do<br/>\n&gt; something you don&#39;t want to do, in my opinion. There are days where<br/>\n&gt; I might not want to fix breakfast, lunch, or supper, to do laundry,<br/>\n&gt; to clean up a child&#39;s vomit, the cat&#39;s poop mess after getting locked<br/>\n&gt; in the van, etc., but it&#39;s gotta be done and so I do it. Why?<br/>\n<br/>\n </span></blockquote>Because you made a choice to.  We don&#39;t clean up a child&#39;s vomit or a<br/>\ncat&#39;s poop because we HAVE to.  We do it because we CHOOSE to.  We<br/>\nCHOOSE to not smell vomit or poop.  We do laundry because we CHOOSE to<br/>\nhave clean clothes.  We fix meals because we CHOOSE to feed ourselves<br/>\nand our family.  And there are plenty of times that I have CHOSEN not<br/>\nto make meals and declared that tonight is a &quot;Whatever Night.&quot; (IOW -<br/>\nWhatever you choose to make you get to eat.)  It doesn&#39;t mean I am<br/>\nlazy, it means that I have CHOSEN to do other things.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because it&#39;s not just me around here - there are others to think of<br/>\n&gt; (we&#39;re a &quot;team&quot;, so to speak). We have the kids help with chores,<br/>\n&gt; too - whether they want to or not. Our motto is &quot;We&#39;re a family and<br/>\n&gt; we work together to get the jobs done.&quot;<br/>\n<br/>\n </span></blockquote>So you truly aren&#39;t unschooling.  Forcing a child to do something<br/>\nwhether they want to or not is a very schoolish philosophy.  Children<br/>\nin school have to do assignments or they are labeled, wow here it<br/>\ncomes, lazy!  My children help around the house because they CHOOSE<br/>\nto.  I&#39;ll ask someone to help me with something, but they have the<br/>\noption of saying no or not now.  They help because they desire to not<br/>\nbecause I made them.  There are very few &quot;have to&#39;s&quot; in an unschooling<br/>\nfamily.  I insist that they breathe and that their hearts continue to<br/>\npump.  :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; By the way, one of my daughters just laid around this afternoon<br/>\n&gt; watching a movie. Is she lazy? No. I&#39;ve been reading today instead<br/>\n&gt; of dusting or vacuuming, straightening my office. Am I lazy? No.<br/>\n<br/>\n </span></blockquote>See you made choices.<br/>\n<br/>\n I<br/>\n<blockquote><span title=\"ireply\"> &gt; made my son clean his room because we couldn&#39;t walk through it. He<br/>\n&gt; didn&#39;t choose to do it on his own and never would have, but I&#39;m his<br/>\n&gt; Mom,it really needed to be done, and I helped him some but had him<br/>\n&gt; stick with it until done (diligence). Sorry if that makes someone<br/>\n&gt; angry.<br/>\n<br/>\n </span></blockquote>And here you made a choice for someone else.  If it is your son&#39;s room<br/>\nisn&#39;t he the one who should choose how the room is?  You can&#39;t walk<br/>\naround in my son&#39;s room either.  It drives me up the wall.  You know<br/>\nwhat I do?  I close the door when company comes over.  He manages. He<br/>\nknows where things are (mostly) and it hasn&#39;t killed him.  If he runs<br/>\nout of clean clothes and wants help gathering some up I will help him.<br/>\n But the choice to clean his room is his.  That isn&#39;t to say that I<br/>\nwon&#39;t help him when he asks.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Lest someone think I yell at the kids and tell them they&#39;re lazy, let<br/>\n&gt; me assure you I&#39;ve never done so and never will; However, I will<br/>\n&gt; teach them what it takes to consider others and to follow through on<br/>\n&gt; choices made which do have an impact on others.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>And you can do that without forcing them to do chores or stay in<br/>\nsomething that is terribly uncomfortable for them.<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150372823","msgId":14587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEOTNGQkRCLUQ4QzgtNEU2RC05OEJELUYyOTM0NzQ3MUI0NUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg==","referencesHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg=="},"prevInTopic":14582,"nextInTopic":14588,"prevInTime":14586,"nextInTime":14588,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... No one s offended. It s discussion. It s stepping back and discussing the concept, the *idea*, of labeling someone lazy. If we use negative words in","messageBody":"<div id=\"ygrps-yiv-84900375\">On Jun 14, 2006, at 4:58 PM, Trudy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Goodness, I didn&#39;t realize I would be offending so many by the use of<br/>\n&gt; the word &quot;lazy&quot;.  The meaning of that word is &quot;unwilling to<br/>\n&gt; work.&quot;<br/>\n<br/>\n </span></blockquote>No one&#39;s offended. It&#39;s discussion. It&#39;s stepping back and discussing  <br/>\nthe concept, the *idea*, of labeling someone lazy.<br/>\n<br/>\nIf we use negative words in relation to our kids they internalize  <br/>\nthat and can live up to those words. They become the labels we put on  <br/>\nthem. Or they can decide we have no clue about who they are and  <br/>\ndecide not to listen to us.<br/>\n<br/>\nEven if we don&#39;t say the negative words to them, if the words are  <br/>\nthere in our heads we&#39;re acting in a way towards them as if we  <br/>\nbelieve the words.<br/>\n<br/>\nHow would you feel if your husband or mom or best friend called you  <br/>\nlazy? Picture them saying it often. Or what if they never said it and  <br/>\nyou overheard them talking to their friends and they described you as  <br/>\nlazy?<br/>\n<br/>\nA few times might be funny and you might even agree. But after a  <br/>\nwhile it would feel as though in their minds you had been branded  <br/>\nwith that label and they were seeing all of you through that word.<br/>\n<br/>\nPart of what the list does is step back and look at the principles  <br/>\nbehind what we do. Using labels and negative words for our kids will  <br/>\nnot only damage them but damage our relationship with them. It won&#39;t  <br/>\nturn them in to monsters, though it might turn them lazy ;-), but it  <br/>\nwon&#39;t enhance who they are or enhance our relationship. Thinking of a  <br/>\nchild as lazy is one little thing but each little thing is a whittle  <br/>\nin the relationship between us. Life does enough whittling naturally.  <br/>\nWe&#39;ll be doing enough whittling without realizing it. When we can  <br/>\nbecome aware of it, why whittle when we can build? :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think we&#39;ve all known or worked in the past with people<br/>\n&gt; who are characterized in that way - willing to let others do all the<br/>\n&gt; laborious work, or those who jump ship when the going gets tough.<br/>\n<br/>\n </span></blockquote>And most of the people we know have gone to school and been parenting  <br/>\nin conventional ways. In this society we&#39;re trained to get a job to  <br/>\nmake money to pay the bills so we can be, so called, &quot;successful&quot;.  <br/>\nHow many people have you known who put a lot of thought and action  <br/>\ninto exploring their interests to figure out their passions in life  <br/>\nbefore heading off to college or a job?<br/>\n<br/>\nKids will spend hours trying to beat a level on a game and yet will  <br/>\ndrag their feet on homework. Kids will spend hours practicing free  <br/>\nthrows and dribbling to get better at basketball and yet spend as  <br/>\nlittle time as possible studying. When I worked I would spend hours  <br/>\nwriting computer code to make a program do as much as possible so  <br/>\nthat I could avoid repetitious input.<br/>\n<br/>\nIs that lazy? Or is that recognizing what is a useful use of time for  <br/>\nwhat we want to accomplish and what is a waste? They say lazy people  <br/>\nmake the best programmers ;-) But is it lazy to have an aversion to  <br/>\nboring repetitious tedious work?<br/>\n<br/>\nWhen we have a passion for what we&#39;re doing, we&#39;ll do what needs to  <br/>\nbe done, even the tedious stuff because we see something better on  <br/>\nthe other side.<br/>\n<br/>\nIf we&#39;re trapped in a job we have to mentally and physically drag  <br/>\nourselves to, we&#39;re going to do as little as we can get away with.  <br/>\nAnd may in fact do even less in order *to get fired* because there&#39;s  <br/>\nthis script in our heads that tells us we aren&#39;t allowed to quit  <br/>\nsomething we&#39;ve started!<br/>\n<br/>\nSchools are really good at teaching kids to shove down and ignore  <br/>\ntheir feelings that something is pointless and just do as they&#39;re  <br/>\ntold. People carry that lesson into adulthood and end up in jobs they  <br/>\nfind unfulfilling because the goal has been to make money not to find  <br/>\nsomething that you love to do.<br/>\n<br/>\nIs that what you want for your kids? Then school might be better for  <br/>\nthem because school is good at training them for that way of life.<br/>\n<br/>\nBut if you ask, we can tell you about something we think is better.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling and all it entails doesn&#39;t mean never having to do<br/>\n&gt; something you don&#39;t want to do, in my opinion.<br/>\n<br/>\n </span></blockquote>*Life* means doing things we don&#39;t enjoy to get something better.  <br/>\nKids learn that just by living. We don&#39;t need to make them stick with  <br/>\nsomething they&#39;re not enjoying in order for them to learn that. Life  <br/>\ndoes that to them naturally.<br/>\n<br/>\nWe can, though, when they want to quit something, talk about what&#39;s  <br/>\nwrong. We can talk about the consequences of quitting and how others  <br/>\nwill feel and what&#39;s likely to happen. (Each situation will be  <br/>\ndifferent. There is no rule. Quitting a softball team after a few  <br/>\nattempts is different than quitting a play before opening night!) We  <br/>\ncan talk about the things we can change to make it better. But we  <br/>\ndon&#39;t help them learn to look at the bigger picture if we approach  <br/>\nthem with the attitude that quitting is only a last resort and that  <br/>\nquitting something is a permanent black mark in our books.<br/>\n<br/>\nIf we assume our children are doing the best they can with the  <br/>\ninformation and skills they have at the moment, they will hear what  <br/>\nwe have to say about a situation as information to help them make a  <br/>\ndecision. They will *trust* that we&#39;re on their side. *Knowing* that  <br/>\nquitting is an option will let them hear our ideas on what the  <br/>\nadvantages of sticking it out (and quitting!) are.  If we approach  <br/>\nthem with the attitude of making them stick with something because  <br/>\nthey are [lazy, irresponsible, self-centered, immature ... if they  <br/>\nquit] and we need to make them do what we believe is right in order  <br/>\nto make them better people what we say to them will just sound like  <br/>\nvariations of &quot;You&#39;re not perfect.&quot; and &quot;I won&#39;t let you quit.&quot;<br/>\n<br/>\nIf you were taking a class and after several sessions you realized it  <br/>\nwasn&#39;t anything like you imagined and it was draining you more than  <br/>\nit was filling you, which person would you rather have talk to you:  <br/>\nsomeone who was determined to find some way to make you continue  <br/>\nwhether that be persuasion or guilt or anger or shame ... , or  <br/>\nsomeone who was a willing listener who always had good ideas on how  <br/>\nto fix things but you knew would be fine whether you quit or kept  <br/>\ngoing and all they wanted  was for you to be happy? Which person do  <br/>\nyou want to be remembered as by your son?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There are days where<br/>\n&gt; I might not want to fix breakfast, lunch, or supper, to do laundry,<br/>\n&gt; to clean up a child&#39;s vomit, the cat&#39;s poop mess after getting locked<br/>\n&gt; in the van, etc., but it&#39;s gotta be done and so I do it.  Why?<br/>\n&gt; Because it&#39;s not just me around here - there are others to think of<br/>\n&gt; (we&#39;re a &quot;team&quot;, so to speak).<br/>\n<br/>\n </span></blockquote>That&#39;s the conventional way. It&#39;s not news to anyone here. Most of us  <br/>\nhave been there, done that or grown up with it.<br/>\n<br/>\nWe&#39;re talking about looking at life in a way that&#39;s beyond pushing  <br/>\nthrough the moment because you &quot;have to.&quot; We&#39;ve found what we are  <br/>\ncertain is a better way to be with our families. And if you ask,  <br/>\npeople will tell you about it. :-)<br/>\n<br/>\nBut if you came to tell us about conventional parenting, we already  <br/>\nknow!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; made my son clean his room because we couldn&#39;t walk through it.  He<br/>\n&gt; didn&#39;t choose to do it on his own and never would have, but I&#39;m his<br/>\n&gt; Mom,it really needed to be done, and I helped him some but had him<br/>\n&gt; stick with it until done (diligence).  Sorry if that makes someone<br/>\n&gt; angry.<br/>\n<br/>\n </span></blockquote>Disagreement isn&#39;t the same thing as anger. I&#39;m not angry at you for  <br/>\nmaking your son clean is room. But I bet your son felt some anger and  <br/>\nresentment towards you! And I am sad that society sees that as  <br/>\njustified and a good practice. And I am sad that you will either 1)  <br/>\nhave to do a lot of work to see beyond those ingrained ideas of what  <br/>\nis supposedly fact about how children must be related to or 2) leave  <br/>\nbecause you&#39;re certain we must be clueless parents of brats who can&#39;t  <br/>\nsee the obvious (wisdom of conventional parenting) and there&#39;s  <br/>\nnothing you can learn here.<br/>\n<br/>\nJust because I disagree with the conventional practice of making a  <br/>\nchild clean his room *doesn&#39;t* mean that the only two options are  <br/>\nmaking him or not making him. Ask and people will tell you.<br/>\n<br/>\nPicture *choosing* to make a child unhappy as a withdrawal from our  <br/>\nrelationship with our kids and *choosing* to make a child happy as a  <br/>\ndeposit. One day I realized that I was making permanent withdrawals  <br/>\nfor something temporary (a clean living room).<br/>\n<br/>\nNo matter how much my husband valued a clean garage floor, he  <br/>\ncouldn&#39;t make me value it too by making me clean it. We assume that  <br/>\njust because we&#39;re certain our values and ideas are right, that our  <br/>\nkids will see the error of their ways and realize we&#39;re right if we  <br/>\njust make them.<br/>\n<br/>\nThere *are* other choices!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lest someone think I yell at the kids and tell them they&#39;re lazy, let<br/>\n&gt; me assure you I&#39;ve never done so and never will;<br/>\n<br/>\n </span></blockquote>The discussion shouldn&#39;t be about you. It should be about ideas.<br/>\n<br/>\nDoes the *idea* of thinking about a child as being lazy help a parent  <br/>\nmove closer to unschooling? No, so when it comes up, that idea gets  <br/>\ndiscussed.<br/>\n<br/>\nWill the *idea* of making our children do chores enhance our  <br/>\nrelationship and build their trust in us? Again, no.<br/>\n<br/>\nBut just like most people imagine that if you drop school that means  <br/>\ndoing &quot;nothing&quot;, dropping making our kids do things isn&#39;t the same as  <br/>\ndoing nothing.<br/>\n<br/>\nHere&#39;s a bit from the list description:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Ask experienced unschoolers all those niggling questions, and find  <br/>\n&gt;&gt; out how unschooling works in real families.<br/>\n<br/>\n </span></blockquote>Ask! Ask us how we make it work rather than assuming we&#39;re totally  <br/>\nblind to our lazy irresponsible children&#39;s behavior because we&#39;re  <br/>\nstuck on some rule that says &quot;Let them do whatever they want.&quot;<br/>\n<br/>\nIn *all* new endeavors that we learn about it&#39;s always best to assume  <br/>\nthe people have the same values and to *ask* how they avoid what  <br/>\nconventional wisdom says should happen.<br/>\n<br/>\nHere&#39;s another bit:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  this is a place for you to discuss,question, ponder and become  <br/>\n&gt;&gt; deeply familiar with natural learning and how it affects our  <br/>\n&gt;&gt; entire lives.<br/>\n<br/>\n </span></blockquote>Question, yes! Ask us how it can work if we aren&#39;t doing what society  <br/>\ninsists we need to.<br/>\n<br/>\nPonder what we say and ask more questions.<br/>\n<br/>\nJust as we&#39;ve thrown out school for something better that works,  <br/>\nwe&#39;ve thrown out conventional parenting practice for something better  <br/>\nthan works! And just as throwing out school doesn&#39;t mean throwing out  <br/>\nlearning, throwing out conventional parenting doesn&#39;t mean throwing  <br/>\nout parenting. We&#39;re there *with* our kids, helping them, talking to  <br/>\nthem about life, helping them solve problems.<br/>\n<br/>\nAsk!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; come explore the issues that unschooling families have dealt with  <br/>\n&gt;&gt; in the past and how to get beyond &quot;school-think&quot; to a joyful  <br/>\n&gt;&gt; unschooling lifestyle!<br/>\n<br/>\n </span></blockquote>We all have the same issues as you do. Ask what we do instead.  <br/>\nUnschoolers will share.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, I will<br/>\n&gt; teach them what it takes to consider others and to follow through on<br/>\n&gt; choices made which do have an impact on others.<br/>\n<br/>\n </span></blockquote>To unschool it helps to drop the *idea* of having to teach them  <br/>\nanything. Unschoolers help them *learn*.<br/>\n<br/>\nUnschooling is more than substituting the word learn for teach,  <br/>\nthough. We don&#39;t see the need to pour information (or behavior) into  <br/>\nthem. We are their partners, helping them navigate the world, helping  <br/>\nthem get what they want. We do kids a disservice to assume they don&#39;t  <br/>\ncare about others feelings. They&#39;re kids. Their feelings and outlook  <br/>\n*will* be different. If we treat them as doing the best they can with  <br/>\nthe skills, outlook and information they have, they will see us as  <br/>\ntheir partners in helping them make better and better decisions. IF  <br/>\nwe treat them as less than adults, they&#39;ll see us as their molders  <br/>\nand trainers, and just as adults would, they&#39;ll do what they can to  <br/>\navoid the molding and training in order to try things out for  <br/>\nthemselves.<br/>\n<br/>\nAt 14 my daughter is polite and thoughtful. She thinks of other  <br/>\npeople when making decisions because that&#39;s how she&#39;s been treated:  <br/>\nI&#39;ve tried to think of her when making decisions.<br/>\n<br/>\nThere&#39;s more to unschooling than just not doing school. To make it  <br/>\nflourish we need to look at ourselves, our relationship, the way we  <br/>\nlook at the world in a new way to clear out the thinking that&#39;s  <br/>\nholding us back.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210833586,"authorName":"Trudy","from":"&quot;Trudy&quot; &lt;trudypowell@...&gt;","profile":"trudyhome99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: team commitments (looking into the future a bit...)","postDate":"1150318688","msgId":14582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2cHQ5MCtjdXE5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+"},"prevInTopic":14562,"nextInTopic":14587,"prevInTime":14580,"nextInTime":14583,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"Goodness, I didn t realize I would be offending so many by the use of the word lazy .  The meaning of that word is unwilling to work. I am lazy sometimes,","messageBody":"<div id=\"ygrps-yiv-648370716\">Goodness, I didn&#39;t realize I would be offending so many by the use of <br/>\nthe word &quot;lazy&quot;.  The meaning of that word is &quot;unwilling to <br/>\nwork.&quot;     <br/>\n<br/>\nI am lazy sometimes, putting off things that really need to be done, <br/>\nbut I don&#39;t want it to be a regular part of my character day in and <br/>\nday out.  I think we&#39;ve all known or worked in the past with people <br/>\nwho are characterized in that way - willing to let others do all the <br/>\nlaborious work, or those who jump ship when the going gets tough.  <br/>\nJust because we unschool doesn&#39;t mean we want our kids to think they <br/>\ndon&#39;t follow through with a commitment - a sport or some other <br/>\nactivity that they chose to be involved in in the first place and <br/>\nwhich affects others.  We&#39;re talking TEAM sports here; not an <br/>\nindividual thing someone decides to do which doesn&#39;t affect anyone <br/>\nelse.  <br/>\n<br/>\nUnschooling and all it entails doesn&#39;t mean never having to do <br/>\nsomething you don&#39;t want to do, in my opinion.  There are days where <br/>\nI might not want to fix breakfast, lunch, or supper, to do laundry, <br/>\nto clean up a child&#39;s vomit, the cat&#39;s poop mess after getting locked <br/>\nin the van, etc., but it&#39;s gotta be done and so I do it.  Why?  <br/>\nBecause it&#39;s not just me around here - there are others to think of <br/>\n(we&#39;re a &quot;team&quot;, so to speak).  We have the kids help with chores, <br/>\ntoo - whether they want to or not.  Our motto is &quot;We&#39;re a family and <br/>\nwe work together to get the jobs done.&quot; <br/>\n<br/>\nBy the way, one of my daughters just laid around this afternoon <br/>\nwatching a movie.  Is she lazy? No.  I&#39;ve been reading today instead <br/>\nof dusting or vacuuming, straightening my office.  Am I lazy?  No. I <br/>\nmade my son clean his room because we couldn&#39;t walk through it.  He <br/>\ndidn&#39;t choose to do it on his own and never would have, but I&#39;m his <br/>\nMom,it really needed to be done, and I helped him some but had him <br/>\nstick with it until done (diligence).  Sorry if that makes someone <br/>\nangry.<br/>\n<br/>\nLest someone think I yell at the kids and tell them they&#39;re lazy, let <br/>\nme assure you I&#39;ve never done so and never will; However, I will <br/>\nteach them what it takes to consider others and to follow through on <br/>\nchoices made which do have an impact on others.<br/>\n<br/>\n<br/>\nTrudy Powell<br/>\nIndependent Watkins Assoc. #357561<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.WatkinsOnline.com\">http://www.WatkinsOnline.com</a> (vanilla, spices, extracts, salves, <br/>\nliniments, etc.)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mo3bk.com\">http://www.mo3bk.com</a></div>","specialLinks":[]},{"userId":174410770,"authorName":"D Smith","from":"D Smith &lt;sandshuse@...&gt;","profile":"sandshuse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150310332","msgId":14562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjE0MTgzODUyLjMzNjc1LnFtYWlsQHdlYjUyOTA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA2MTQxMTA1eDc2M2Q5MWQwZzVmNWI2Y2JlNjFmNTRhNzFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":14560,"nextInTopic":14582,"prevInTime":14561,"nextInTime":14563,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"Dan and he got tired of undressing and redressing so he just decided it was easier to hang out in his skivvies. :-) my ds informed this morning, because he","messageBody":"<div id=\"ygrps-yiv-916046335\">&quot;Dan and he got tired of undressing and redressing so<br/>\nhe just decided<br/>\nit was easier to hang out in his &quot;skivvies.&quot; :-)&quot;<br/>\n<br/>\nmy ds informed this morning, because he recently took<br/>\nup sleeping naked, &#39;that no one wants to see my<br/>\nunderwear.&#39; i asked him where he heard that. &#39;daddy.&#39;<br/>\nwhat a funny boy! <br/>\n<br/>\ndanie<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150308346","msgId":14560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MTQxMTA1eDc2M2Q5MWQwZzVmNWI2Y2JlNjFmNTRhNzFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+","referencesHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPiA8ZTZwYzVsK2J1cEBlR3JvdXBzLmNvbT4="},"prevInTopic":14558,"nextInTopic":14562,"prevInTime":14559,"nextInTime":14561,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... Laziness is just another way of saying, You are not interested in doing what I think you should be doing.  Is my daughter lazy because she is laying on","messageBody":"<div id=\"ygrps-yiv-1994088523\">On 6/14/06, Trudy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trudypowell@...\">trudypowell@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Our youngest child, our son who is 5 years old, is playing on his first<br/>\n&gt; baseball team this summer. He is really enjoying it. I think if we<br/>\n&gt; came up against a situation where he was wanting to quit, we would have<br/>\n&gt; to determine if it was laziness on his part (a character flaw we want<br/>\n&gt; to avoid)<br/>\n<br/>\n </span></blockquote>Laziness is just another way of saying, &quot;You are not interested in<br/>\ndoing what I think you should be doing.&quot;  Is my daughter lazy because<br/>\nshe is laying on the couch watching tv instead of being outside hula<br/>\nhooping?  Am I lazy because I want to spend the afternoon in bed with<br/>\na book?  Is my co-parent lazy because he is working from home (in his<br/>\nunderwear I might add)?  No; we just all are making choices as to what<br/>\nto do with our time and energy.  And besides I&#39;m sewing something for<br/>\nDan and he got tired of undressing and redressing so he just decided<br/>\nit was easier to hang out in his &quot;skivvies.&quot;  :-)<br/>\n<br/>\nI think you may want to avoid such labels if you want to build trust<br/>\nwith your child.<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150307693","msgId":14558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFQUUzNjRFLUMzRDMtNDNENi1BQzA4LUJCM0RBMkVDQUFFN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+","referencesHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+"},"prevInTopic":14555,"nextInTopic":14560,"prevInTime":14557,"nextInTime":14559,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... Do you think you can make a kid less lazy by forcing them to do things against their will? Where do you think laziness comes from? You might be","messageBody":"<div id=\"ygrps-yiv-1133056095\">On Jun 14, 2006, at 9:06 AM, Trudy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I think if we<br/>\n&gt; came up against a situation where he was wanting to quit, we would  <br/>\n&gt; have<br/>\n&gt; to determine if it was laziness on his part (a character flaw we want<br/>\n&gt; to avoid)<br/>\n<br/>\n </span></blockquote>Do you think you can make a kid less &quot;lazy&quot; by forcing them to do  <br/>\nthings against their will?<br/>\nWhere do you think &quot;laziness&quot; comes from?<br/>\n<br/>\nYou might be interested in the book, &quot;The Myth of Laziness&quot; by Mel  <br/>\nLevine.<br/>\n<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248268539,"authorName":"Elissa Jill Cleaveland","from":"&quot;Elissa Jill Cleaveland&quot; &lt;MystikMomma@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150306664","msgId":14555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTMwMWM2OGZkOSQzZWFmMDMxMCQwMWZlYThjMEBzcXVpZD4=","referencesHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+"},"prevInTopic":14551,"nextInTopic":14558,"prevInTime":14554,"nextInTime":14556,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... to avoid) ******* Flaw? Blech. People aren t flawed, people are born perfect. I also don t believe that there is such a thing as Laziness . That is a very","messageBody":"<div id=\"ygrps-yiv-1711599612\"><blockquote><span title=\"ireply\">&gt;&gt;laziness on his part (a character flaw we want <br/>\n </span></blockquote>to avoid)<br/>\n*******<br/>\nFlaw? Blech. People aren&#39;t flawed, people are born perfect.<br/>\nI also don&#39;t believe that there is such a thing as &quot;Laziness&quot;. That is a very subjective word.<br/>\nEveryone has different energy levels. I didn&#39;t clean any part of my house today. Is that because I am Lazy? Or could it be because I preferred to (finally) read The Sunday Paper on my deck on a beautiful warm day?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;In Philippians 2:4 it says, &quot;Everyone should <br/>\n </span></blockquote>look out not only for his own interests, but also for the interests of <br/>\nothers,&quot; <br/>\nIt seems to me that the singular comes first for a reason. How can one take care of others&#39; interests if they can&#39;t even take care of their own?<br/>\nElissa Jill<br/>\nA Kindersher saychel iz oychet a saychel.<br/>\n&quot;A Child&#39;s wisdom is also wisdom.&quot; ~Yiddish Proverb<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210833586,"authorName":"Trudy","from":"&quot;Trudy&quot; &lt;trudypowell@...&gt;","profile":"trudyhome99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: team commitments (looking into the future a bit...)","postDate":"1150301173","msgId":14551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2cGM1bCtidXBAZUdyb3Vwcy5jb20+","inReplyToHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":14549,"nextInTopic":14555,"prevInTime":14550,"nextInTime":14552,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"Our youngest child, our son who is 5 years old, is playing on his first baseball team this summer. He is really enjoying it.  I think if we came up against a","messageBody":"<div id=\"ygrps-yiv-915238596\">Our youngest child, our son who is 5 years old, is playing on his first <br/>\nbaseball team this summer. He is really enjoying it.  I think if we <br/>\ncame up against a situation where he was wanting to quit, we would have <br/>\nto determine if it was laziness on his part (a character flaw we want <br/>\nto avoid) or if there was some kind of detrimental activity going on <br/>\nwithin the group (i.e. unfit coach, bullying children, etc.).  Before <br/>\njoining the team, we want the kids to know what they are committing to <br/>\nfor that period of time.  The definition of the word &quot;team&quot; is &quot;A group <br/>\nof people working together in a coordinated effort; to join in <br/>\ncooperative activity.&quot;  In Philippians 2:4 it says, &quot;Everyone should <br/>\nlook out not only for his own interests, but also for the interests of <br/>\nothers,&quot; and in the case of a team sport, unless something was going <br/>\nterribly wrong, we would have them finish that particular group of <br/>\ngames, meets, etc. and then quit when that season is over.<br/>\n<br/>\n<br/>\nTrudy Powell<br/>\nIndependent Watkins Assoc. #357561<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.WatkinsOnline.com\">http://www.WatkinsOnline.com</a> (vanilla, spices, extracts, salves, <br/>\nliniments, etc.)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mo3bk.com\">http://www.mo3bk.com</a></div>","specialLinks":[]},{"userId":84525154,"authorName":"aroundthemilkyway","from":"&quot;aroundthemilkyway&quot; &lt;petalpollen@...&gt;","profile":"aroundthemilkyway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: team commitments (looking into the future a bit...)","postDate":"1150300369","msgId":14549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2cGJjaCttMmxzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":14541,"nextInTopic":14551,"prevInTime":14548,"nextInTime":14550,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"thanks for the replies, now i have a bit more to throw around in that head of mine. sarah","messageBody":"<div id=\"ygrps-yiv-539194953\">thanks for the replies, now i have a bit more to throw around in that <br/>\nhead of mine. <br/>\nsarah</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] team commitments (looking into the future a bit...)","postDate":"1150290670","msgId":14540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFOUI3RDE4LTM5NkYtNEJBMS04ODM2LTc1REM5NkMzMUE4N0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":14536,"nextInTopic":14541,"prevInTime":14539,"nextInTime":14541,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... Here s some words: http://home.earthlink.net/~fetteroll/rejoycing/ Scroll down and check the menu on the right. Coaches of 7 yos expect many will quit.","messageBody":"<div id=\"ygrps-yiv-1902613267\">On Jun 13, 2006, at 4:42 PM, aroundthemilkyway wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  in the books i have read and websites i have checked out, i<br/>\n&gt; haven&#39;t really found an answer to making a commitment to others and<br/>\n&gt; then wanting to break that even though others are counting on them.<br/>\n&gt; kwim?<br/>\n<br/>\n </span></blockquote>Here&#39;s some words:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\n<br/>\nScroll down and check the menu on the right.<br/>\n<br/>\nCoaches of 7 yos expect many will quit. They know what size to make  <br/>\nthe teams knowing they won&#39;t have that many by the end of the season.  <br/>\nThe middle school softball team my daughter was on last year lost  <br/>\nmaybe half the kids that had signed up. Toward the end of the season  <br/>\nthey were borrowing kids from the other team to fill up spaces in the  <br/>\noutfield until they could get enough of their own team there. Her  <br/>\nhigh school cross country and winter track teams lost members too.<br/>\n<br/>\nThe time before adulthood should be for exploring, for finding out  <br/>\nwhat they like and what they don&#39;t like. (The time after reaching  <br/>\nadulthood too! :-) And that will mean trying lots of things out and  <br/>\ndropping lots of things. If we make them stick something out that  <br/>\nthey aren&#39;t enjoying they learn not to try things for fear of being  <br/>\nmade to stay with it. They learn not to trust their own feelings  <br/>\nabout something and instead learn that others know what&#39;s better for  <br/>\nthem. They learn that being little and weak sucks and being big and  <br/>\nstrong so you can do what you want and make others do what you want  <br/>\nis good. And sometimes they do learn to *act* as though they&#39;re  <br/>\ncommitted by sticking with something regardless of the bigger picture  <br/>\nto others and to themselves because the principle of sticking with  <br/>\nsomething overrides other more rational thought.<br/>\n<br/>\nBeing forced to stick something out isn&#39;t learning to commit to  <br/>\nsomething. It&#39;s just torture for no purpose that the child can  <br/>\nunderstand. But being in a family where the parents live the ideal of  <br/>\ncommitments being important to them gives the child the opportunity  <br/>\nto understand internally what commitment means: Promising something  <br/>\nto a child and then working to make that happen, telling a child you  <br/>\nneed to do &quot;x&quot; because you promised someone and they&#39;re counting on you,<br/>\n<br/>\nJoyce<br/>\nAnswers to common unschooling questions:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\nBlog of writing prompts for speculative fiction writers:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dragonwritingprompts.blogsome.com/\">http://dragonwritingprompts.blogsome.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":68754254,"authorName":"Mary Alice","from":"&quot;Mary Alice&quot; &lt;mapraelm@...&gt;","profile":"meri_aliss","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] team commitments (looking into the future a bit...)","postDate":"1150290031","msgId":14541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTAwMWM2OGZiMiQ4NDdjN2YyMCQwMjAyYThjMEBNYWluPg==","inReplyToHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":14540,"nextInTopic":14549,"prevInTime":14540,"nextInTime":14542,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"I have wondered about this as well. Because of my belief in commitment, I would have a hard time not attaching strings to a question; however I would want to","messageBody":"<div id=\"ygrps-yiv-1326535287\">I have wondered about this as well. Because of my belief in commitment, I<br/>\nwould have a hard time not attaching strings to a question; however I would<br/>\nwant to ask my child and myself a few questions. <br/>\n<br/>\nIs he/she honestly miserable or simply inconvenienced? <br/>\n<br/>\nWhat about the team is not enjoyable? <br/>\n<br/>\nIs this an attitude adjustment with which I could help, or is it something<br/>\nthat is only fixable by withdrawing altogether?<br/>\n<br/>\n <br/>\n<br/>\nBecause other people&#39;s goals or joys can sometimes be dependent upon our<br/>\ninvolvement in a particular team, I think a healthy look at motives and<br/>\nperspectives and priorities would not be an unreasonable request.<br/>\n<br/>\nThis is a difference between guilting them into it (which is what I would do<br/>\nto myself usually) but a matter of several other things that are worth<br/>\nconsidering (and I want to remember when I am discussing this with myself):<br/>\n<br/>\n <br/>\n<br/>\nThere is a great deal of difference between utter misery and trepidation.<br/>\nWhile I don&#39;t think it would be worthwhile to continue to do something that<br/>\ninspires suicidal tendencies, I could see the value in persevering with<br/>\nsomething that is perhaps different? scary? boring? out of respect for the<br/>\nteammates. But that must be weighed as well. Am I willing to sell my soul in<br/>\norder to give respect to people I don&#39;t know over something I don&#39;t are<br/>\nabout? Of course not.  But if it were something benign but not inspiring<br/>\nthat I had signed up for with my best friend, say, I would be more likely to<br/>\nvolunteer myself for that sort of boredom, reminding myself that it was a<br/>\nfinite commitment and that it was out of love. I would thing one would need<br/>\nto weigh the pros and cons and see where the priorities lie, and see whose<br/>\npriorities we are considering!<br/>\n<br/>\n <br/>\n<br/>\nBoy, I hope I can remember this the next time it comes up in my life!<br/>\n<br/>\nMary Alice<br/>\n<br/>\n <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of aroundthemilkyway<br/>\nSent: Tuesday, June 13, 2006 4:42 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] team commitments (looking into the future a<br/>\nbit...)<br/>\n<br/>\n <br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n <br/>\n<br/>\nhow do you unschooling oldies handle when your child joins a team and <br/>\ncommits to it but then after a while, weather they are just not <br/>\ninterested anymore or it is very challenging and in their opinions too <br/>\ndifficult to continue and they suddenly (or not so suddenly)want to <br/>\nquit? <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65986723,"authorName":"jane doe","from":"jane doe &lt;thebrucelisa1@...&gt;","profile":"thebrucelisa1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] team commitments (looking into the future a bit...)","postDate":"1150253774","msgId":14536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjE0MDI1NjE0LjIyMzM1LnFtYWlsQHdlYjUzODA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":14527,"nextInTopic":14540,"prevInTime":14535,"nextInTime":14537,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"Ahhh, swim team, a subject close to my heart... Steven has been on a team since he was six, his eighth season is coming up. All year round, all his choice. My ","messageBody":"<div id=\"ygrps-yiv-61009302\">Ahhh, swim team, a subject close to my heart... Steven<br/>\nhas been on a team since he was six, his eighth season<br/>\nis coming up. All year round, all his choice. My<br/>\nlittle Sarah, too. Here&#39;s what I tell people when they<br/>\nask me about swim team. It&#39;s a wonderful mix of<br/>\nindividuality and team sports. When they are racing,<br/>\nthey are doing it for themselves, responsible only to<br/>\nthemselves, But they are a team working together to<br/>\nwin a meet or in a relay. My kids love it, our world<br/>\nrises and sets on practice and meets. They have to<br/>\nlove it, I would be bored to tears doing laps for<br/>\nhours but they look forward to it and to being with<br/>\ntheir friends. They tell me it&#39;s fun. It&#39;s their<br/>\nthing. There is a huge difference in coaches and how<br/>\nkids react to them though. My kids don&#39;t swim at the Y<br/>\nwhere my dh teaches because they don&#39;t like the coach.<br/>\nThey say he is very rough and gruff and works them<br/>\nhard and yells at them.  Our coach has taught most of<br/>\n&quot;her&quot; kids how to swim and loves them all. She is much<br/>\nmore laid back. Some kids like our coach, some kids<br/>\nlike the other coach. The &quot;he&#39;s too strict, she&#39;s too<br/>\nlenient&quot; conversation is one we&#39;ve heard a million<br/>\ntimes because we go to both Y&#39;s. It comes down to your<br/>\ndaughter&#39;s personality and what she likes. <br/>\n<br/>\nOnly time will tell if your daughter likes it. If she<br/>\ndoesn&#39;t she can quit. Unlike a team sport no one will<br/>\nbe counting on her to fill a position. There&#39;s no<br/>\npoint in making her come to practice if she winds up<br/>\nmiserable doing laps for an hour (or more) every day.<br/>\nAnd if she is unhappy and you are dragging her there<br/>\nbecause she is &quot;committed&quot; I promise you all the other<br/>\nmothers will be silently wishing you would just let<br/>\nher quit. There is nothing worse than having to watch<br/>\na child who is so obviously unhappy. But she needs to<br/>\ngive it a try. Some kids, the first week or two have<br/>\nto really drag themselves out of the pool at the end<br/>\nof practice because they aren&#39;t used to it. If you are<br/>\nworried she won&#39;t follow through try asking the coach<br/>\nto let her come try it out first. And join a summer<br/>\nteam where the season is short (June, July, August)<br/>\nand more laid back instead of jumping in in the fall<br/>\nwhich runs Sept-March. She will win her first ribbon<br/>\nand be hooked! <br/>\nWish her good luck from me---ELISA<br/>\n<br/>\nWe have a collective responsibility to the least of us-Phil Ramone<br/>\n<br/>\nWe can do no great things; only small things with great love- Mother Teresa<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: team commitments (looking into the future a bit...)","postDate":"1150249982","msgId":14527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MTMxODUzcDI2MzU5ODc0czNiZDFlNDNmOTYzZjU5MTVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU2bm1vZCszNGM4QGVHcm91cHMuY29tPg==","referencesHeader":"PDY4NWIyZjIwNjA2MTMxNDIxZzNlMGVhODZmdmRmODFjOTVmMjVlZjNjZWVAbWFpbC5nbWFpbC5jb20+CSA8ZTZubW9kKzM0YzhAZUdyb3Vwcy5jb20+"},"prevInTopic":14526,"nextInTopic":14536,"prevInTime":14526,"nextInTime":14528,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... But that s you and not your child.  Making a child finish something that they have started is a very schoolish idea.  I like the sense of accomplishment,","messageBody":"<div id=\"ygrps-yiv-2020609248\">On 6/13/06, aroundthemilkyway &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:petalpollen@...\">petalpollen@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; actually, i finish rather than quit, that is just it. if i commit to<br/>\n&gt; something or say i will do something, i follow through til the end or<br/>\n&gt; until it is accomplished because i find value in a person&#39;s word and<br/>\n&gt; i think it is important stick with it, not forever, but what the<br/>\n&gt; commit was to....<br/>\n<br/>\n </span></blockquote>But that&#39;s you and not your child.  Making a child finish something<br/>\nthat they have started is a very schoolish idea.  I like the sense of<br/>\naccomplishment, but if I am miserable, not enjoying what I am doing,<br/>\nresentful about doing it, then how does that impact the other people<br/>\nwho may be involved in that activity?  Am I putting my whole heart<br/>\ninto it?  Am I doing this for *me* or for some ideal that I have to<br/>\nfinish it to be a &quot;good person?&quot;  A child continuing in a sport that<br/>\nthey don&#39;t enjoy isn&#39;t going to give it their all.  They are going to<br/>\nbe resentful and that resentment may get directed towards you for<br/>\nmaking them complete something that is miserable to them.  How does<br/>\nthat foster a good relationship with your child, build trust and<br/>\ncreate joy?<br/>\n<br/>\nI find that my children tend to &quot;flit&quot; from one activity or interest<br/>\nto another.  They get completely involved in something and then leave<br/>\nit to go pursue a different (or related) interest.  They&#39;ve tried<br/>\ntheir hands at all kinds of things and while they were doing them they<br/>\nenjoyed them.  Then they tired of them or (as I like to think) got<br/>\n&quot;fulled up&quot; of whatever it is and were ready for something different.<br/>\nMaybe that&#39;s because that is how I am.  I have so many different art<br/>\nforms that I have dabbled or flitted in.  I&#39;ve done stained glass,<br/>\nUkrainian Easter Eggs, sewing, quilting, knitting, embroidery, cross<br/>\nstitch, rubberstamping, scrapbooking, origami, the list just goes on<br/>\nand on.  I have books, magazines, website bookmarks, pictures, tools,<br/>\nsupplies, etc.  Some of those things I continue to pursue on a regular<br/>\nbasis (sewing, rubberstamping, embroidery, knitting) while others I&#39;ll<br/>\npick up when I get a spark of creativity or when requested to teach a<br/>\nclass.  And if the old addage of &quot;I can&#39;t die, I have too much left<br/>\nundone&quot; is true then I will be immortal!<br/>\n<br/>\nI have graciously backed out of activities that I said I wanted to do.<br/>\n I don&#39;t have a problem doing that if I am truly not being a positive<br/>\naspect to whatever I am doing.  I&#39;ve been in groups where one person<br/>\nwas miserable, but they stayed with it because they &quot;committed.&quot;  It<br/>\nalways brings the whole group down.  I can remember a lady who joined<br/>\nour stamping club.  She never felt &quot;artful&quot; and complained all the<br/>\ntime about how difficult everything was.  All I could think was, &quot;If<br/>\nyou are so miserable then don&#39;t come back!&quot;<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":84525154,"authorName":"aroundthemilkyway","from":"&quot;aroundthemilkyway&quot; &lt;petalpollen@...&gt;","profile":"aroundthemilkyway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: team commitments (looking into the future a bit...)","postDate":"1150246677","msgId":14526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2bm11bCtmZ2JwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA2MTMxNDIxZzNlMGVhODZmdmRmODFjOTVmMjVlZjNjZWVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":14525,"nextInTopic":14527,"prevInTime":14525,"nextInTime":14527,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... i do like how you wrote this back....it did make me think of all of it with a slightly different angle....a good angle,one that i hope i can really keep at","messageBody":"<div id=\"ygrps-yiv-2039451576\"><blockquote><span title=\"ireply\">&gt; What do ou do when you have joined something and committed to it,<br/>\n&gt; found it wasn&#39;t as interesting as you thought or very cahllenging and<br/>\n&gt; in your opinion too difficult to continue and you suddenly (or not so<br/>\n&gt; suddenly) want to quit?  You quit! <br/>\n<br/>\n </span></blockquote>i do like how you wrote this back....it did make me think of all of it <br/>\nwith a slightly different angle....a good angle,one that i hope i can <br/>\nreally keep at the front of my mind on this journey.<br/>\nsarah</div>","specialLinks":[]},{"userId":84525154,"authorName":"aroundthemilkyway","from":"&quot;aroundthemilkyway&quot; &lt;petalpollen@...&gt;","profile":"aroundthemilkyway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: team commitments (looking into the future a bit...)","postDate":"1150246477","msgId":14525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2bm1vZCszNGM4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA2MTMxNDIxZzNlMGVhODZmdmRmODFjOTVmMjVlZjNjZWVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":14524,"nextInTopic":14526,"prevInTime":14524,"nextInTime":14526,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... and ... so ... actually, i finish rather than quit, that is just it. if i commit to something or say i will do something, i follow through til the end or ","messageBody":"<div id=\"ygrps-yiv-1555059850\"><blockquote><span title=\"ireply\">&gt; What do ou do when you have joined something and committed to it,<br/>\n&gt; found it wasn&#39;t as interesting as you thought or very cahllenging <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; in your opinion too difficult to continue and you suddenly (or not <br/>\n </span></blockquote>so<br/>\n<blockquote><span title=\"ireply\"> &gt; suddenly) want to quit?  You quit!  <br/>\n<br/>\n </span></blockquote>actually, i finish rather than quit, that is just it. if i commit to <br/>\nsomething or say i will do something, i follow through til the end or <br/>\nuntil it is accomplished because i find value in a person&#39;s word and <br/>\ni think it is important stick with it, not forever, but what the <br/>\ncommit was to....i think if one says they will do it and someone is <br/>\ncounting on them it should be done. my dh and i both really find <br/>\nvalue in this area of social interaction and  i really want to learn <br/>\nwhat others, with this same value (i guess), are doing and have <br/>\ndone.  <br/>\n<br/>\n  Plus your dd hasn&#39;t even started the team<br/>\n<blockquote><span title=\"ireply\"> &gt; yet, has no basis to draw a conclusion from and already you are<br/>\n&gt; setting her up to quit! <br/>\n<br/>\n </span></blockquote>i am really just trying to figure out what unschoolers do in this <br/>\nsituation....her thinking of joining the team simply got *me* <br/>\nthinking. i believe my dd can do anything she sets her mind to and i <br/>\nalso believe she values others enough not to leave them hanging, but <br/>\nas i was kicking around the idea of teamwork that has commitments and <br/>\nunschooling, as i said, my brain is having a hard time finding the <br/>\nbalance in this particular situation.<br/>\n <br/>\nsarah</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] team commitments (looking into the future a bit...)","postDate":"1150233688","msgId":14524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MTMxNDIxZzNlMGVhODZmdmRmODFjOTVmMjVlZjNjZWVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg==","referencesHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":14523,"nextInTopic":14525,"prevInTime":14523,"nextInTime":14525,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"... What do ou do when you have joined something and committed to it, found it wasn t as interesting as you thought or very cahllenging and in your opinion too","messageBody":"<div id=\"ygrps-yiv-850154289\">On 6/13/06, aroundthemilkyway &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:petalpollen@...\">petalpollen@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how do you unschooling oldies handle when your child joins a team and<br/>\n&gt; commits to it but then after a while, weather they are just not<br/>\n&gt; interested anymore or it is very challenging and in their opinions too<br/>\n&gt; difficult to continue and they suddenly (or not so suddenly)want to<br/>\n&gt; quit?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>What do ou do when you have joined something and committed to it,<br/>\nfound it wasn&#39;t as interesting as you thought or very cahllenging and<br/>\nin your opinion too difficult to continue and you suddenly (or not so<br/>\nsuddenly) want to quit?  You quit!  This is a time for her to learn<br/>\nand stretch and grow and experience.  This is not the time for her to<br/>\nlearn a lesson in finishing things.  She will finish those things that<br/>\nshe finds an interest in.  Plus your dd hasn&#39;t even started the team<br/>\nyet, has no basis to draw a conclusion from and already you are<br/>\nsetting her up to quit!  Go with the flow and see where it takes you.<br/>\nYou might find that she loves it and can&#39;t get enough of it and you<br/>\nare at swim meets every weekend.  Or she may find that she enjoys<br/>\nswimming, but the competition doesn&#39;t do anything for her.<br/>\n<br/>\nMary Elayne (10yo) takes gymnastics.  I was concerned how she would<br/>\nhandle the meets.  Fortunately, they are all low competitive and<br/>\neveryone gets a medal and t-shirt and gets to stand on the podium.  I<br/>\nwas prepared for her to quit after she saw all the girls who were so<br/>\nmuch better than she is.  She surprised me in wanting to try harder<br/>\nrather than quit.  So I try not to second guess what my childrenn&#39;s<br/>\nreaction to something will be and am flexible enough to help them<br/>\ncontinue or quit as they need me to be.<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":248268539,"authorName":"Elissa Jill Cleaveland","from":"&quot;Elissa Jill Cleaveland&quot; &lt;MystikMomma@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] team commitments (looking into the future a bit...)","postDate":"1150233296","msgId":14523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmQwMWM2OGYyZSQ2YzM1YTM4MCQwMWZlYThjMEBzcXVpZD4=","referencesHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":14522,"nextInTopic":14524,"prevInTime":14522,"nextInTime":14524,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"One thing I ve found the few times we ve been involved in team sports is that they are very fluid entities. Many children start and don t finish. Elissa Jill","messageBody":"<div id=\"ygrps-yiv-203305595\">One thing I&#39;ve found the few times we&#39;ve been involved in &quot;team&quot; sports is that they are very fluid entities. Many children start and don&#39;t finish.<br/>\nElissa Jill<br/>\nA Kindersher saychel iz oychet a saychel.<br/>\n&quot;A Child&#39;s wisdom is also wisdom.&quot; ~Yiddish Proverb<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":84525154,"authorName":"aroundthemilkyway","from":"&quot;aroundthemilkyway&quot; &lt;petalpollen@...&gt;","profile":"aroundthemilkyway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"team commitments (looking into the future a bit...)","postDate":"1150231332","msgId":14522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2bjd2NCsxMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":14523,"prevInTime":14521,"nextInTime":14523,"topicId":14522,"numMessagesInTopic":0,"msgSnippet":"my 7 yodd loves swimming and does it everyday. recently she let me know she would like to join a swim team which got me thinking.... how do you unschooling","messageBody":"<div id=\"ygrps-yiv-908782464\">my 7 yodd loves swimming and does it everyday. recently she let me <br/>\nknow she would like to join a swim team which got me thinking....<br/>\n<br/>\nhow do you unschooling oldies handle when your child joins a team and <br/>\ncommits to it but then after a while, weather they are just not <br/>\ninterested anymore or it is very challenging and in their opinions too <br/>\ndifficult to continue and they suddenly (or not so suddenly)want to <br/>\nquit? <br/>\n<br/>\ni think that my dd would love it, but i want to be prepared just in <br/>\ncase.  in the books i have read and websites i have checked out, i <br/>\nhaven&#39;t really found an answer to making a commitment to others and <br/>\nthen wanting to break that even though others are counting on them. <br/>\nkwim? i am having a hard time (in my head) finding the balance between <br/>\nhonoring their opinions, thoughts and feelings and the value of <br/>\nintegrity in commitment.<br/>\n<br/>\nsarah</div>","specialLinks":[]}],"prevTopicId":14250,"nextTopicId":14854}}