{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":30,"messages":[{"userId":124256069,"authorName":"Laurie Wolfrum","from":"Laurie Wolfrum &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: the feminist in me","postDate":"1194117138","msgId":27530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MjQ1My41NTA5MS5xbUB3ZWI1MTkxMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":27487,"nextInTopic":0,"prevInTime":27529,"nextInTime":27531,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"Wow!!!  I just read your post aloud to my husband Kelly...and it almost brought me to tears!!  I am printing it out and posting it in my kitchen.  Thanks for","messageBody":"<div id=\"ygrps-yiv-1364443851\">Wow!!!  I just read your post aloud to my husband<br/>\nKelly...and it almost brought me to tears!!  I am<br/>\nprinting it out and posting it in my kitchen.  Thanks<br/>\nfor the powerful reminders!  I needed a powerful<br/>\nreminder myself!!!  Laurie Wolfrum<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] the feminist in me","postDate":"1194016449","msgId":27487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUVCN0EyNkZFNkMwMC0yNEMtOEQxQUB3ZWJtYWlsLW1mMDcuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDAwM2EwMWM4MTcxOCQwZWFiMjQxMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PGZmcTlpbCtpYzllQGVHcm91cHMuY29tPiA8MDAzYTAxYzgxNzE4JDBlYWIyNDEwJDAxMDAwMDBhQFN3ZWVuZXk+"},"prevInTopic":27408,"nextInTopic":27530,"prevInTime":27486,"nextInTime":27488,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... From: Nittany Lion  I m 100% unschooling when it comes to learning academics in its variety of forms in everyday life.   The","messageBody":"<div id=\"ygrps-yiv-1629747379\">-----Original Message-----<br/>\nFrom: Nittany Lion &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dsweeney@...\">dsweeney@...</a>&gt;<br/>\n<br/>\nI&#39;m 100% unschooling when it comes to learning &quot;academics&quot; in its <br/>\nvariety of<br/>\nforms in everyday life.   The feminist in me struggles with aspects of<br/>\nunschooling like chores.  My mom was the type who did everything for my <br/>\ndad<br/>\nand my brother and I.  As I got older I hated seeing her being treated <br/>\nas a<br/>\ntraditional housewife, who kept the house and catered to everyone in <br/>\nit,<br/>\nsimply bc she was a woman.<br/>\n<br/>\n-=-=-<br/>\n<br/>\nFeminism isn&#39;t about NOT cleaning the house because you&#39;re a woman. <br/>\nIt&#39;s about CHOICE. You can still be a feminist and care for your <br/>\nfamily. The deal is that you&#39;re free to CHOOSE to make other choices.<br/>\n<br/>\nYour mother may have *wanted* to be a mom! Her choice wasn&#39;t about <br/>\n*you* or what you hated. It was about what *she* wanted for *herself*.<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\n I don&#39;t want my girls to think they will be<br/>\nexpected to clean and cook and do all the chores for their household <br/>\nand I<br/>\ndon&#39;t want my son to expect that role from his wife should he decide to<br/>\nmarry.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nAnd what if the girls decided that that was the role they wanted? To <br/>\nhave a family and care for it? What if your son married a woman who <br/>\n*wanted* to stay home and cater to her family?<br/>\n<br/>\nI would rather my sons marry women who would want to be with their <br/>\nchildren. I would certainly hope my boys would choose women who would <br/>\nrather be home with their kids than out making million dollar deals <br/>\nwhile the kids were in school all day. (Unless the boys were the ones <br/>\nat home with the children! &lt;G&gt;)<br/>\n<br/>\nAs an unschooling mom, I *do* need to be with my children. That&#39;s how <br/>\nit works. I can certainly do other things (and I do a LOT of other <br/>\nthings) while I&#39;m home caring for them and cleaning and such. But it&#39;s <br/>\nwhat I *do*---care for them and clean the house.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<br/>\nFor me personally, I don&#39;t have the energy, desire or time to clean up <br/>\nafter<br/>\neveryone (I have 4 kids btw ages 8, 6, 4 and 17 months, so I am wiped <br/>\nout<br/>\nanyway!).  I get resentful when I clean a room only to have it get <br/>\nmessed up<br/>\nand left that way.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThen change your attitude. You have four under eight. You really <br/>\nshouldn&#39;t *expect* it to be clean. You *should* expect it to be messed <br/>\nup. That&#39;s the way it is with children. Children are messy. Understand <br/>\nthat. And lose the resentfulness. You&#39;re choosing to be resentful. <br/>\nCHOOSE to be appreciative of what you have: four beautiful children who <br/>\nare healthy and happy enough to be messy.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I&#39;m fine with the mess, but not with cleaning it up if I<br/>\ndidn&#39;t make it.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd small children should *care*?<br/>\n<br/>\nYou have four small children. Who else is going to clean their messes?<br/>\n<br/>\nYou&#39;re saying that a femininst shouldn&#39;t have to, but that small <br/>\nchildren *should*???<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n I don&#39;t expect anyone to pick up my dirty clothes, or my<br/>\nmess in the kitchen after cooking, why should I be expected to do all <br/>\nthe<br/>\nchores, especially their messes?<br/>\n<br/>\n-=-=-=--=<br/>\n<br/>\nBecause you&#39;re the mom. You took on that role when you decided to have <br/>\nchildren. It comes with the package---unless you can afford a maid <br/>\n(might want to look for a feminist maid though---one that will work <br/>\noutside the home &lt;g&gt;).<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n Shouldn&#39;t everyone chip in while in a<br/>\ncommunal environment (as all houses are)?<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nMay the children leave if the communal laws don&#39;t suit them?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I&#39;m not a neat freak, I don&#39;t<br/>\nmind clutter or dirty bathrooms - I just resent it when I am expected <br/>\nto do<br/>\nall the chores over and over.<br/>\n<br/>\n-=-=-=--<br/>\n<br/>\nI still feel that way sometimes. It&#39;s as if there are always dishes to <br/>\nbe washed and clothes to be folded. It&#39;s a never-ending job.<br/>\n<br/>\nThen I quickly kick myself in the butt and remember that I&#39;m so happy <br/>\nto have dishes to wash and a beautiful house to care for and wonderful <br/>\nchildren that I can still hug.<br/>\n<br/>\nI accept the responsibility of having a nice house (I could be living <br/>\nin a car) and having dishes to wash (I could be eating at a homeless <br/>\nshelter) and having fresh, clean clothes to fold (I could be down to my <br/>\nlast set of clothes and can&#39;t wash them because I&#39;d be standing naked <br/>\nat the laundromat---ugh!). I still have my children to pick up after <br/>\n(They are healthy and happy. But I still think of Jacob and Sam and <br/>\nHannah (all dead) every day when I need to remember to appreciatae what <br/>\nI have right NOW, right HERE!), so I&#39;m happy to pick up after them.<br/>\n<br/>\nThey&#39;ll be gone soon anyway---they grow up so fast. My older son is 19 <br/>\nand in Charleston this week, visiting the girlfriend. I miss him. I <br/>\nHATE when he&#39;s gone. Now that he&#39;s gone so much, I treasure the moments <br/>\nwe DO have together.<br/>\n<br/>\nYou can choose to be resentful or appreciative. I promise you that you <br/>\nwill be happier if you choose appreciation over resentfulness.<br/>\n<br/>\n-=-=-=-===-<br/>\n<br/>\n I once threw away 4 or 5 board games bc they<br/>\nwere left out for days, pieces all over the place - I didn&#39;t want to <br/>\nburden<br/>\nthe kids with cleaning . . . but got pissed and threw them out bc (as I <br/>\ntold<br/>\nthem) I am not their servant.<br/>\n<br/>\nYour thought or opinions?<br/>\n<br/>\n-=-=-====<br/>\n<br/>\nI hope your children don&#39;t treat you as thoughlessly and with such <br/>\ndisrepect if/when you are ever under their care.<br/>\n<br/>\nAnd hey---big news! You ARE their servant! They are incapable of caring <br/>\nfor themselves, so it falls upon YOU, their mother. The twist is that <br/>\nyou are the servant with the POWER. Scary scenario, huh? Someone who <br/>\ncares for their every need, but who can cut OFF all service and <br/>\nhappiness?<br/>\n<br/>\nIt really will pay off if you show how *important* and *fulfilling* and <br/>\n*joyful* all that cleaning and caring for others can be. Show them what <br/>\nan HONOR it is to serve. That&#39;s a &quot;lesson&quot; they will keep for always. <br/>\nModel it. BE the example you want to see.<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193647601","msgId":27408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwQzcyQkE3LTRFRjQtNEE2Ny05MTUyLUFDOTgzMzdENzdFRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAxMTIwMWM4MThjZSRiYjVmYjM4MCQwN2IwYjk0M0Boc2QxLndhLmNvbWNhc3QubmV0Pg==","referencesHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPiA8MDAyYzAxYzgxODdkJDY5OTc0OGMwJDAxMDAwMDBhQFN3ZWVuZXk+IDwyN2FhMmFlODA3MTAyNzAyNDd5N2M2NGZlN2JvNGQ2OWU1YWMzNTM5MmVhOUBtYWlsLmdtYWlsLmNvbT4gPDdlYTYzYWY1MDcxMDI3MDcxOWg2OTFlMGFlZnkzOTBmNTI3MjA4Y2M1NGQ2QG1haWwuZ21haWwuY29tPiA8MDExMjAxYzgxOGNlJGJiNWZiMzgwJDA3YjBiOTQzQGhzZDEud2EuY29tY2FzdC5uZXQ+"},"prevInTopic":27390,"nextInTopic":27487,"prevInTime":27407,"nextInTime":27409,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... How could someone get you to do something that you saw as pointless? How could they get you to do it repeatedly? Really. Truly. Honestly. If there were a","messageBody":"<div id=\"ygrps-yiv-212610603\">On Oct 27, 2007, at 3:22 PM, Jamie Murray wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wish there was a way to get him to pick up after himself and to  <br/>\n&gt; stay out of stuff that don&#39;t belong to him.<br/>\n<br/>\n </span></blockquote>How could someone get you to do something that you saw as pointless?  <br/>\nHow could they get you to do it repeatedly?<br/>\n<br/>\nReally. Truly. Honestly. If there were a way to make children into  <br/>\nobedient convenience parents would have figured it out long ago and  <br/>\nthere would be a single book out there that gave you the steps.<br/>\n<br/>\nUnless you wish to sacrifice your relationship with him, there isn&#39;t  <br/>\na way to make him.<br/>\n<br/>\nIf you become a person he&#39;d love to help, when he&#39;s developmentally  <br/>\nable he will help you.<br/>\n<br/>\nTreat clean up as something that you own, that&#39;s important to you and  <br/>\ninvite him along to help. As long as you don&#39;t expect his help --  <br/>\ndon&#39;t turn him into conscripted labor -- he&#39;s way more likely to help.<br/>\n<br/>\nI think what would probably help most in your situation is to keep on  <br/>\ntop of it. Treat it as something that *is* important to you, rather   <br/>\nthan waiting until you can&#39;t stand it any longer and turning into an  <br/>\nemotional beast about it. (Not saying that you do, only projecting  <br/>\nthat most of us have been there and done that!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can&#39;t physically pick up after him. I end up asking my sister for  <br/>\n&gt; help when it gets bad. But she won&#39;t be living close anymore, so  <br/>\n&gt; something else needs to be done. Any suggestions?<br/>\n<br/>\n </span></blockquote>How about asking your sister (and your son) for help in rethinking  <br/>\nthe problem? How about ways to prevent him from getting into your  <br/>\nstuff? Cabinets that lock, for instance. If he&#39;s very young, just the  <br/>\nsimple childproof locks might be enough.<br/>\n<br/>\nIf he plays with toys on the floor, if you can help him play on a big  <br/>\nplastic sheet, then it can be folded up and all the toys dumped into  <br/>\na bin when he&#39;s done.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My problem is I can&#39;t get on the floor or bend over to pick stuff  <br/>\n&gt; up. Even standing too long causes lots of pain and discomfort. I am  <br/>\n&gt; disabled.<br/>\n<br/>\n </span></blockquote>How do other disabled people who have difficulties reaching things on  <br/>\nthe floor handle it? There&#39;s a huge amount of brain power out there  <br/>\nworking on these problems! Tap into it :-) It&#39;s so much easier for  <br/>\npeople now that the internet reaches everywhere. Imagine what it was  <br/>\nlike for people trying to get information when their only resource  <br/>\nwas local people and local books.<br/>\n<br/>\nI know I&#39;ve seen those long grabber things for reaching things on  <br/>\nhigh shelves.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":315167313,"authorName":"guideforthree","from":"&quot;guideforthree&quot; &lt;guideforthree@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193542993","msgId":27390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnMTBnaCs3bjVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI3YWEyYWU4MDcxMDI3MDI0N3k3YzY0ZmU3Ym80ZDY5ZTVhYzM1MzkyZWE5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":27386,"nextInTopic":27408,"prevInTime":27389,"nextInTime":27391,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I ve been following this thread, and I think a lot of excellent points have been made.  I experiences this kind of resentment towards my husband early in our","messageBody":"<div id=\"ygrps-yiv-1256211540\">I&#39;ve been following this thread, and I think a lot of excellent <br/>\npoints have been made.  I experiences this kind of resentment towards <br/>\nmy husband early in our marriage, but have since gotten over it.  <br/>\nWe&#39;ve evolved into a system of whoever it bothers the most takes care <br/>\nof it (thereby making it a choice), and we&#39;ve carried that over to <br/>\nthe kids (who of course don&#39;t even see the mess).  I once read a <br/>\nquote: &quot;We&#39;re raising boys now.  We can raise grass later&quot;.  This <br/>\nkind of sums up my cleaning philosophy.  My house is sanitary, and <br/>\nyou won&#39;t break anything unless you walk into one of the kids&#39; rooms, <br/>\nbut cleaning is not a top priority.<br/>\n<br/>\nWith that said, I want to reitterate how important it is to model for <br/>\nyour children.  If cleaning looks important and fun, younger children <br/>\nwill get upset if you tell them they can&#39;t do it (One of my boys once <br/>\nhad a tantrum because I wouldn&#39;t let him help with the laundry - <br/>\nlesson learned). You also need to model helping.  This starts with <br/>\nthe adults in the house making a concious effort to be helpful <br/>\ntowards each other and towards the children.  As with any learning, <br/>\nit takes time to learn to be helpful, so don&#39;t expect instant <br/>\nhelpfulness.<br/>\n<br/>\nMy husband once provided an anology that helps clearify another <br/>\nrelated point.  He works, and I shop.  Thus, he expects me to keep <br/>\nmilk in the fridge.  If he looked in the fridge everyday and there <br/>\nwas no milk for a week, he could choose to get angry and resentful <br/>\nabout the lack of milk (and I would be clueless about this), or he <br/>\ncould choose to let me know that he would like me to get milk.  <br/>\nObviously, asking me to buy milk would be more productive.  Likewise, <br/>\nasking the kids to help is much more productive than getting mad when <br/>\nthey don&#39;t do something they don&#39;t even know you want them to do.<br/>\n<br/>\nWhich brings me to my next point -- When you ask a yes or no <br/>\nquestion, expect a yes or no answer (and accept it).  Once you learn <br/>\nhow to do this, kids do what you ask out of love rather than out of <br/>\nfear, and if they don&#39;t do it, they have a logical reason.<br/>\n<br/>\nAlso, when thinking about kids and cleaning, keep in mind that they <br/>\ndon&#39;t have the same planning skills as an adult.  They look at a <br/>\nmessy room and have no idea how to accomplish the task of cleaning <br/>\nthe room.  It is an overwhelming task, and they don&#39;t even know where <br/>\nto begin, so they don&#39;t start.  Rather than having children clean a <br/>\nroom, it is much more developmentally appropriate to start the job <br/>\nand ask them to help you, and if you&#39;ve done the work of positive <br/>\nmodeling and they know they really do have a choice, then most of the <br/>\ntime they will help.  If they don&#39;t, they don&#39;t -- Keep in mind who <br/>\nowns the problem (whoever is bothered by it).<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193514009","msgId":27379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZnMDQ2cCtuYTM4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdlYTYzYWY1MDcxMDI3MDcxOWg2OTFlMGFlZnkzOTBmNTI3MjA4Y2M1NGQ2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":27377,"nextInTopic":27386,"prevInTime":27378,"nextInTime":27380,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"Reminds me of when my son was young -- maybe 3 or so.  We had a playgroup that rotated houses.  One little girl was consistent when she came to our house --","messageBody":"<div id=\"ygrps-yiv-19216067\">Reminds me of when my son was young -- maybe 3 or so.  We had a<br/>\nplaygroup that rotated houses.  One little girl was consistent when<br/>\nshe came to our house -- she would whine, &quot;What can I do?&quot;  I would<br/>\npoint out that there was a room full of toys (we had them in the<br/>\nliving room) and she was free to pick out something to play with. <br/>\n&quot;But what can I dooooo?&quot;  (Her mom thought it was a &quot;cute&quot; little<br/>\ngame...)  I refused to play that game, and would offer her a dust<br/>\ncloth and she could dust.  &quot;I don&#39;t waaaant to.&quot;  But my son would<br/>\nalways pipe up, &quot;I do!&quot;  So, I would still have to get out a dust cloth.  <br/>\n<br/>\nLinda<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, MrsStranahan<br/>\n&lt;mrsstranahan@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; A couple of days ago my 8 yr old daughter came to me and said she<br/>\n </span></blockquote>wanted to<br/>\n<blockquote><span title=\"ireply\"> &gt; do a project. We were digging through our craft dresser and I kept<br/>\n </span></blockquote>offering<br/>\n<blockquote><span title=\"ireply\"> &gt; up ideas like painting or playing with the new moon sand. She didn&#39;t<br/>\n </span></blockquote>want to<br/>\n<blockquote><span title=\"ireply\"> &gt; do anything I suggested and had been picking out dust balls from the<br/>\n </span></blockquote>corners<br/>\n<blockquote><span title=\"ireply\"> &gt; of the drawers while we talked. I asked if she wanted to dust and<br/>\n </span></blockquote>her face<br/>\n<blockquote><span title=\"ireply\"> &gt; lit up as she ran out of the room to get an apron she likes to wear.<br/>\n&gt; <br/>\n&gt; So her project was dusting. I gave her the Swiffer dusters and let<br/>\n </span></blockquote>her have<br/>\n<blockquote><span title=\"ireply\"> &gt; at it. I didn&#39;t tell her where to dust or how to dust and she did an<br/>\n </span></blockquote>awesome<br/>\n<blockquote><span title=\"ireply\"> &gt; job. She dusted the craft dresser, she dusted the TV and fan and then<br/>\n&gt; started in on a bookcase and that turned into rearranging all the<br/>\n </span></blockquote>shelves.<br/>\n<blockquote><span title=\"ireply\"> &gt; Right now there are stacks of books on the floor waiting to be<br/>\n </span></blockquote>organized and<br/>\n<blockquote><span title=\"ireply\"> &gt; put away. I will probably do that part but she&#39;ll be right there<br/>\n </span></blockquote>doing it<br/>\n<blockquote><span title=\"ireply\"> &gt; too, if she wants. I&#39;m not going to tell her that she started it so she<br/>\n&gt; needs to finish it or any other dumb thing kids get told. That would<br/>\n </span></blockquote>suck<br/>\n<blockquote><span title=\"ireply\"> &gt; away her joy.<br/>\n&gt; <br/>\n&gt; If I&#39;d been stomping around like a martyr about the housework and if<br/>\n </span></blockquote>I had<br/>\n<blockquote><span title=\"ireply\"> &gt; decided having a dusty house was not acceptable she wouldn&#39;t have<br/>\n </span></blockquote>had the<br/>\n<blockquote><span title=\"ireply\"> &gt; opportunity to pick the project of dusting. She got a lot of joy and<br/>\n&gt; satisfaction out of her project, which in turn gave me a lot of joy and<br/>\n&gt; satisfaction.<br/>\n&gt; <br/>\n&gt; I think my point is .. when people are not being yelled at or shamed<br/>\n </span></blockquote>into<br/>\n<blockquote><span title=\"ireply\"> &gt; helping with housework it turns into just another thing to do that is a<br/>\n&gt; pleasant way to pass the time. My daughters dusting looked a lot<br/>\n </span></blockquote>like her<br/>\n<blockquote><span title=\"ireply\"> &gt; painting; joyfull. I hope it always stays that way. When my mother<br/>\n </span></blockquote>sees dust<br/>\n<blockquote><span title=\"ireply\"> &gt; her reaction is &quot;Oh shit, I have to dust.&quot; When I see dust my<br/>\n </span></blockquote>reaction is<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Ok it&#39;s dusty. It can be dusty. It&#39;s fine.&quot; My daughter&#39;s reaction<br/>\n </span></blockquote>is &quot;Woo<br/>\n<blockquote><span title=\"ireply\"> &gt; Hoo!! Let&#39;s dust!&quot;<br/>\n&gt; <br/>\n&gt; This unschooling stuff really does work and even if you don&#39;t &quot;get<br/>\n </span></blockquote>it&quot; (for<br/>\n<blockquote><span title=\"ireply\"> &gt; a very long time I didn&#39;t) you can fake it and even that works.<br/>\n&gt; <br/>\n&gt; Lauren<br/>\n&gt; (Steven 21, Shane 15, Olivia 8, Jack 6)<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On 10/27/07, Heather &lt;heather@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;   I&#39;m not Chris, but what I think she means by &quot;open-ended&quot; is<br/>\n </span></blockquote>that when<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; she<br/>\n&gt; &gt; asks for help, she is generally ASKING so the kids have a real choice.<br/>\n&gt; &gt; They<br/>\n&gt; &gt; can help or NOT help. Instead of what conventional parents do -<br/>\n </span></blockquote>they say<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; they ASK their kids for help. But then get mad if the kid says NO.<br/>\n </span></blockquote>Which<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; means it wasn&#39;t really a request for help in the first place. It<br/>\n </span></blockquote>was just<br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; another DEMAND disguised as a request...<br/>\n&gt; &gt;<br/>\n&gt; &gt; heather<br/>\n&gt; &gt;<br/>\n&gt; &gt; On 10/27/07, Nittany Lion &lt;dsweeney@... &lt;dsweeney%40dejazzd.com&gt;&gt;<br/>\n&gt; &gt; wrote:<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Chris,<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; In the last year or<br/>\n&gt; &gt; &gt; &gt; so I can now ask (always open-ended)<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; What do you mean by &quot;open-ended&quot; when you ask for help?<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;  <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":314099889,"authorName":"Jamie Murray","from":"&quot;Jamie Murray&quot; &lt;CAHOLO@...&gt;","profile":"calicomama2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193512955","msgId":27386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTIwMWM4MThjZSRiYjVmYjM4MCQwN2IwYjk0M0Boc2QxLndhLmNvbWNhc3QubmV0Pg==","referencesHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPiA8MDAyYzAxYzgxODdkJDY5OTc0OGMwJDAxMDAwMDBhQFN3ZWVuZXk+IDwyN2FhMmFlODA3MTAyNzAyNDd5N2M2NGZlN2JvNGQ2OWU1YWMzNTM5MmVhOUBtYWlsLmdtYWlsLmNvbT4gPDdlYTYzYWY1MDcxMDI3MDcxOWg2OTFlMGFlZnkzOTBmNTI3MjA4Y2M1NGQ2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":27379,"nextInTopic":27390,"prevInTime":27385,"nextInTime":27387,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"My son makes huge messes and even gets into my stuff.  I wish there was a way to get him to pick up after himself and to stay out of stuff that don t belong to","messageBody":"<div id=\"ygrps-yiv-1912789946\">My son makes huge messes and even gets into my stuff.  I wish there was a way to get him to pick up after himself and to stay out of stuff that don&#39;t belong to him.  I can&#39;t physically pick up after him.  I end up asking my sister for help when it gets bad.  But she won&#39;t be living close anymore, so something else needs to be done.  Any suggestions?  My problem is I can&#39;t get on the floor or bend over to pick stuff up.  Even standing too long causes lots of pain and discomfort.  I am disabled.  <br/>\n<br/>\nThanks,<br/>\nJamie<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: MrsStranahan <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Saturday, October 27, 2007 7:19 AM<br/>\n  Subject: Re: [unschoolingbasics] Re: the feminist in me<br/>\n<br/>\n<br/>\n  A couple of days ago my 8 yr old daughter came to me and said she wanted to<br/>\n  do a project. We were digging through our craft dresser and I kept offering<br/>\n  up ideas like painting or playing with the new moon sand. She didn&#39;t want to<br/>\n  do anything I suggested and had been picking out dust balls from the corners<br/>\n  of the drawers while we talked. I asked if she wanted to dust and her face<br/>\n  lit up as she ran out of the room to get an apron she likes to wear.<br/>\n<br/>\n  So her project was dusting. I gave her the Swiffer dusters and let her have<br/>\n  at it. I didn&#39;t tell her where to dust or how to dust and she did an awesome<br/>\n  job. She dusted the craft dresser, she dusted the TV and fan and then<br/>\n  started in on a bookcase and that turned into rearranging all the shelves.<br/>\n  Right now there are stacks of books on the floor waiting to be organized and<br/>\n  put away. I will probably do that part but she&#39;ll be right there doing it<br/>\n  too, if she wants. I&#39;m not going to tell her that she started it so she<br/>\n  needs to finish it or any other dumb thing kids get told. That would suck<br/>\n  away her joy.<br/>\n<br/>\n  If I&#39;d been stomping around like a martyr about the housework and if I had<br/>\n  decided having a dusty house was not acceptable she wouldn&#39;t have had the<br/>\n  opportunity to pick the project of dusting. She got a lot of joy and<br/>\n  satisfaction out of her project, which in turn gave me a lot of joy and<br/>\n  satisfaction.<br/>\n<br/>\n  I think my point is .. when people are not being yelled at or shamed into<br/>\n  helping with housework it turns into just another thing to do that is a<br/>\n  pleasant way to pass the time. My daughters dusting looked a lot like her<br/>\n  painting; joyfull. I hope it always stays that way. When my mother sees dust<br/>\n  her reaction is &quot;Oh shit, I have to dust.&quot; When I see dust my reaction is<br/>\n  &quot;Ok it&#39;s dusty. It can be dusty. It&#39;s fine.&quot; My daughter&#39;s reaction is &quot;Woo<br/>\n  Hoo!! Let&#39;s dust!&quot;<br/>\n<br/>\n  This unschooling stuff really does work and even if you don&#39;t &quot;get it&quot; (for<br/>\n  a very long time I didn&#39;t) you can fake it and even that works.<br/>\n<br/>\n  Lauren<br/>\n  (Steven 21, Shane 15, Olivia 8, Jack 6)<br/>\n<br/>\n  On 10/27/07, Heather &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt; wrote:<br/>\n  &gt;<br/>\n  &gt; I&#39;m not Chris, but what I think she means by &quot;open-ended&quot; is that when<br/>\n  &gt; she<br/>\n  &gt; asks for help, she is generally ASKING so the kids have a real choice.<br/>\n  &gt; They<br/>\n  &gt; can help or NOT help. Instead of what conventional parents do - they say<br/>\n  &gt; they ASK their kids for help. But then get mad if the kid says NO. Which<br/>\n  &gt; means it wasn&#39;t really a request for help in the first place. It was just<br/>\n  &gt; another DEMAND disguised as a request...<br/>\n  &gt;<br/>\n  &gt; heather<br/>\n  &gt;<br/>\n  &gt; On 10/27/07, Nittany Lion &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dsweeney@...\">dsweeney@...</a> &lt;dsweeney%40dejazzd.com&gt;&gt;<br/>\n  &gt; wrote:<br/>\n  &gt; &gt;<br/>\n  &gt; &gt; Chris,<br/>\n  &gt; &gt;<br/>\n  &gt; &gt; &gt; In the last year or<br/>\n  &gt; &gt; &gt; so I can now ask (always open-ended)<br/>\n  &gt; &gt;<br/>\n  &gt; &gt; What do you mean by &quot;open-ended&quot; when you ask for help?<br/>\n  &gt; &gt;<br/>\n  &gt;<br/>\n  &gt; [Non-text portions of this message have been removed]<br/>\n  &gt;<br/>\n  &gt; <br/>\n  &gt;<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":291006621,"authorName":"liberatedlrning","from":"&quot;liberatedlrning&quot; &lt;liberatedlearning@...&gt;","profile":"liberatedlrning","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193505284","msgId":27377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmdnJtNCtyYmtrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI3YWEyYWU4MDcxMDI3MDI0N3k3YzY0ZmU3Ym80ZDY5ZTVhYzM1MzkyZWE5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":27375,"nextInTopic":27379,"prevInTime":27376,"nextInTime":27378,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"Yes, Chris here. What Heather wrote is exactly what I meant.  I ask without any expectation that they ll say yes and if they say no, it s no skin off my back.","messageBody":"<div id=\"ygrps-yiv-352105699\">Yes, Chris here. What Heather wrote is exactly what I meant.  I ask<br/>\nwithout any expectation that they&#39;ll say yes and if they say no, it&#39;s no<br/>\nskin off my back.  I give them unconditional love all the time. They do<br/>\nnot need to worry that if they opt to not help me that it&#39;ll affect my<br/>\nmood or attitude toward them.  Once they realized that requests for help<br/>\nwere just that, requests and not manipulations, they helped more often<br/>\nand with positive attitudes.<br/>\n<br/>\nChris<br/>\nLearning in the Unzone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.zamunzo.blogspot.com\">http://www.zamunzo.blogspot.com</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Heather &lt;heather@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m not Chris, but what I think she means by &quot;open-ended&quot; is that when<br/>\nshe<br/>\n&gt; asks for help, she is generally ASKING so the kids have a real choice.<br/>\nThey<br/>\n&gt; can help or NOT help.  Instead of what conventional parents do - they<br/>\nsay<br/>\n&gt; they ASK their kids for help.  But then get mad if the kid says NO. <br/>\nWhich<br/>\n&gt; means it wasn&#39;t really a request for help in the first place.  It was<br/>\njust<br/>\n&gt; another DEMAND disguised as a request...<br/>\n&gt;<br/>\n&gt; heather<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On 10/27/07, Nittany Lion dsweeney@... wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Chris,<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; In the last year or<br/>\n&gt; &gt; &gt; so I can now ask (always open-ended)<br/>\n&gt; &gt;<br/>\n&gt; &gt; What do you mean by &quot;open-ended&quot; when you ask for help?<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":258070335,"authorName":"Nittany Lion","from":"Nittany Lion &lt;dsweeney@...&gt;","profile":"dawn_sweeney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193497679","msgId":27375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTkwMWM4MThhYiQyOWUyOWFkMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPiA8MDAyYzAxYzgxODdkJDY5OTc0OGMwJDAxMDAwMDBhQFN3ZWVuZXk+IDwyN2FhMmFlODA3MTAyNzAyNDd5N2M2NGZlN2JvNGQ2OWU1YWMzNTM5MmVhOUBtYWlsLmdtYWlsLmNvbT4gPDdlYTYzYWY1MDcxMDI3MDcxOWg2OTFlMGFlZnkzOTBmNTI3MjA4Y2M1NGQ2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":27373,"nextInTopic":27377,"prevInTime":27374,"nextInTime":27376,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... My problem isn t that I don t get it, I do get it.  I know what I should do, its just that wrt to cleaning I don t do.  After reading through everyone s ","messageBody":"<div id=\"ygrps-yiv-171472808\"><blockquote><span title=\"ireply\">&gt; This unschooling stuff really does work and even if you don&#39;t &quot;get it&quot; <br/>\n&gt; (for<br/>\n&gt; a very long time I didn&#39;t) you can fake it and even that works.<br/>\n<br/>\n </span></blockquote>My problem isn&#39;t that I don&#39;t get it, I do get it.  I know what I should do, <br/>\nits just that wrt to cleaning I don&#39;t do.  After reading through everyone&#39;s <br/>\nposts, which I found a bit overwhelming, but I think it showed me how <br/>\nuptight I am about cleaning - as if my time cleaning is more important, more <br/>\nvaluable than anyones elses time messing up and doing something else than <br/>\nclean up.<br/>\n<br/>\nThank you all for your thoughtfullness.<br/>\n<br/>\nDawn - who really, really needs to de-chore and have a glass of wine, or <br/>\nmaybe even the whole bottle, so I&#39;m not so uptight . . .<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;MrsStranahan&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mrsstranahan@...\">mrsstranahan@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, October 27, 2007 10:19 AM<br/>\nSubject: Re: [unschoolingbasics] Re: the feminist in me<br/>\n<br/>\n<br/>\n&gt;A couple of days ago my 8 yr old daughter came to me and said she wanted to<br/>\n&gt; do a project. We were digging through our craft dresser and I kept <br/>\n&gt; offering<br/>\n&gt; up ideas like painting or playing with the new moon sand. She didn&#39;t want <br/>\n&gt; to<br/>\n&gt; do anything I suggested and had been picking out dust balls from the <br/>\n&gt; corners<br/>\n&gt; of the drawers while we talked. I asked if she wanted to dust and her face<br/>\n&gt; lit up as she ran out of the room to get an apron she likes to wear.<br/>\n&gt;<br/>\n&gt; So her project was dusting. I gave her the Swiffer dusters and let her <br/>\n&gt; have<br/>\n&gt; at it. I didn&#39;t tell her where to dust or how to dust and she did an <br/>\n&gt; awesome<br/>\n&gt; job. She dusted the craft dresser, she dusted the TV and fan and then<br/>\n&gt; started in on a bookcase and that turned into rearranging all the shelves.<br/>\n&gt; Right now there are stacks of books on the floor waiting to be organized <br/>\n&gt; and<br/>\n&gt; put away. I will probably do that part but she&#39;ll be right there doing it<br/>\n&gt; too, if she wants. I&#39;m not going to tell her that she started it so she<br/>\n&gt; needs to finish it or any other dumb thing kids get told. That would suck<br/>\n&gt; away her joy.<br/>\n&gt;<br/>\n&gt; If I&#39;d been stomping around like a martyr about the housework and if I had<br/>\n&gt; decided having a dusty house was not acceptable she wouldn&#39;t have had the<br/>\n&gt; opportunity to pick the project of dusting. She got a lot of joy and<br/>\n&gt; satisfaction out of her project, which in turn gave me a lot of joy and<br/>\n&gt; satisfaction.<br/>\n&gt;<br/>\n&gt; I think my point is .. when people are not being yelled at or shamed into<br/>\n&gt; helping with housework it turns into just another thing to do that is a<br/>\n&gt; pleasant way to pass the time. My daughters dusting looked a lot like her<br/>\n&gt; painting; joyfull. I hope it always stays that way. When my mother sees <br/>\n&gt; dust<br/>\n&gt; her reaction is &quot;Oh shit, I have to dust.&quot; When I see dust my reaction is<br/>\n&gt; &quot;Ok it&#39;s dusty. It can be dusty. It&#39;s fine.&quot; My daughter&#39;s reaction is <br/>\n&gt; &quot;Woo<br/>\n&gt; Hoo!! Let&#39;s dust!&quot;<br/>\n&gt;<br/>\n&gt; This unschooling stuff really does work and even if you don&#39;t &quot;get it&quot; <br/>\n&gt; (for<br/>\n&gt; a very long time I didn&#39;t) you can fake it and even that works.<br/>\n&gt;<br/>\n&gt; Lauren<br/>\n&gt; (Steven 21, Shane 15, Olivia 8, Jack 6)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On 10/27/07, Heather &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt;   I&#39;m not Chris, but what I think she means by &quot;open-ended&quot; is that when<br/>\n&gt;&gt; she<br/>\n&gt;&gt; asks for help, she is generally ASKING so the kids have a real choice.<br/>\n&gt;&gt; They<br/>\n&gt;&gt; can help or NOT help. Instead of what conventional parents do - they say<br/>\n&gt;&gt; they ASK their kids for help. But then get mad if the kid says NO. Which<br/>\n&gt;&gt; means it wasn&#39;t really a request for help in the first place. It was just<br/>\n&gt;&gt; another DEMAND disguised as a request...<br/>\n&gt;&gt;<br/>\n&gt;&gt; heather<br/>\n&gt;&gt;<br/>\n&gt;&gt; On 10/27/07, Nittany Lion &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dsweeney@...\">dsweeney@...</a> &lt;dsweeney%40dejazzd.com&gt;&gt;<br/>\n&gt;&gt; wrote:<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Chris,<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; &gt; In the last year or<br/>\n&gt;&gt; &gt; &gt; so I can now ask (always open-ended)<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; What do you mean by &quot;open-ended&quot; when you ask for help?<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":284676289,"authorName":"MrsStranahan","from":"MrsStranahan &lt;mrsstranahan@...&gt;","profile":"laurenstranahan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193494767","msgId":27373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlYTYzYWY1MDcxMDI3MDcxOWg2OTFlMGFlZnkzOTBmNTI3MjA4Y2M1NGQ2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDI3YWEyYWU4MDcxMDI3MDI0N3k3YzY0ZmU3Ym80ZDY5ZTVhYzM1MzkyZWE5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPiA8MDAyYzAxYzgxODdkJDY5OTc0OGMwJDAxMDAwMDBhQFN3ZWVuZXk+CSA8MjdhYTJhZTgwNzEwMjcwMjQ3eTdjNjRmZTdibzRkNjllNWFjMzUzOTJlYTlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":27371,"nextInTopic":27375,"prevInTime":27372,"nextInTime":27374,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"A couple of days ago my 8 yr old daughter came to me and said she wanted to do a project. We were digging through our craft dresser and I kept offering up","messageBody":"<div id=\"ygrps-yiv-15278434\">A couple of days ago my 8 yr old daughter came to me and said she wanted to<br/>\ndo a project. We were digging through our craft dresser and I kept offering<br/>\nup ideas like painting or playing with the new moon sand. She didn&#39;t want to<br/>\ndo anything I suggested and had been picking out dust balls from the corners<br/>\nof the drawers while we talked. I asked if she wanted to dust and her face<br/>\nlit up as she ran out of the room to get an apron she likes to wear.<br/>\n<br/>\nSo her project was dusting. I gave her the Swiffer dusters and let her have<br/>\nat it. I didn&#39;t tell her where to dust or how to dust and she did an awesome<br/>\njob. She dusted the craft dresser, she dusted the TV and fan and then<br/>\nstarted in on a bookcase and that turned into rearranging all the shelves.<br/>\nRight now there are stacks of books on the floor waiting to be organized and<br/>\nput away. I will probably do that part but she&#39;ll be right there doing it<br/>\ntoo, if she wants. I&#39;m not going to tell her that she started it so she<br/>\nneeds to finish it or any other dumb thing kids get told. That would suck<br/>\naway her joy.<br/>\n<br/>\nIf I&#39;d been stomping around like a martyr about the housework and if I had<br/>\ndecided having a dusty house was not acceptable she wouldn&#39;t have had the<br/>\nopportunity to pick the project of dusting. She got a lot of joy and<br/>\nsatisfaction out of her project, which in turn gave me a lot of joy and<br/>\nsatisfaction.<br/>\n<br/>\nI think my point is .. when people are not being yelled at or shamed into<br/>\nhelping with housework it turns into just another thing to do that is a<br/>\npleasant way to pass the time. My daughters dusting looked a lot like her<br/>\npainting; joyfull. I hope it always stays that way. When my mother sees dust<br/>\nher reaction is &quot;Oh shit, I have to dust.&quot; When I see dust my reaction is<br/>\n&quot;Ok it&#39;s dusty. It can be dusty. It&#39;s fine.&quot; My daughter&#39;s reaction is &quot;Woo<br/>\nHoo!! Let&#39;s dust!&quot;<br/>\n<br/>\nThis unschooling stuff really does work and even if you don&#39;t &quot;get it&quot; (for<br/>\na very long time I didn&#39;t) you can fake it and even that works.<br/>\n<br/>\nLauren<br/>\n(Steven 21, Shane 15, Olivia 8, Jack 6)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/27/07, Heather &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   I&#39;m not Chris, but what I think she means by &quot;open-ended&quot; is that when<br/>\n&gt; she<br/>\n&gt; asks for help, she is generally ASKING so the kids have a real choice.<br/>\n&gt; They<br/>\n&gt; can help or NOT help. Instead of what conventional parents do - they say<br/>\n&gt; they ASK their kids for help. But then get mad if the kid says NO. Which<br/>\n&gt; means it wasn&#39;t really a request for help in the first place. It was just<br/>\n&gt; another DEMAND disguised as a request...<br/>\n&gt;<br/>\n&gt; heather<br/>\n&gt;<br/>\n&gt; On 10/27/07, Nittany Lion &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dsweeney@...\">dsweeney@...</a> &lt;dsweeney%40dejazzd.com&gt;&gt;<br/>\n&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Chris,<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; In the last year or<br/>\n&gt; &gt; &gt; so I can now ask (always open-ended)<br/>\n&gt; &gt;<br/>\n&gt; &gt; What do you mean by &quot;open-ended&quot; when you ask for help?<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":35875473,"authorName":"Heather","from":"Heather &lt;heather@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193478455","msgId":27371,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3YWEyYWU4MDcxMDI3MDI0N3k3YzY0ZmU3Ym80ZDY5ZTVhYzM1MzkyZWE5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAwMmMwMWM4MTg3ZCQ2OTk3NDhjMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPiA8MDAyYzAxYzgxODdkJDY5OTc0OGMwJDAxMDAwMDBhQFN3ZWVuZXk+"},"prevInTopic":27370,"nextInTopic":27373,"prevInTime":27370,"nextInTime":27372,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I m not Chris, but what I think she means by open-ended is that when she asks for help, she is generally ASKING so the kids have a real choice.  They can","messageBody":"<div id=\"ygrps-yiv-1882871123\">I&#39;m not Chris, but what I think she means by &quot;open-ended&quot; is that when she<br/>\nasks for help, she is generally ASKING so the kids have a real choice.  They<br/>\ncan help or NOT help.  Instead of what conventional parents do - they say<br/>\nthey ASK their kids for help.  But then get mad if the kid says NO.  Which<br/>\nmeans it wasn&#39;t really a request for help in the first place.  It was just<br/>\nanother DEMAND disguised as a request...<br/>\n<br/>\nheather<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/27/07, Nittany Lion &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dsweeney@...\">dsweeney@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Chris,<br/>\n&gt;<br/>\n&gt; &gt; In the last year or<br/>\n&gt; &gt; so I can now ask (always open-ended)<br/>\n&gt;<br/>\n&gt; What do you mean by &quot;open-ended&quot; when you ask for help?<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":258070335,"authorName":"Nittany Lion","from":"Nittany Lion &lt;dsweeney@...&gt;","profile":"dawn_sweeney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193478024","msgId":27370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmMwMWM4MTg3ZCQ2OTk3NDhjMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPg=="},"prevInTopic":27366,"nextInTopic":27371,"prevInTime":27369,"nextInTime":27371,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"Chris, ... What do you mean by open-ended when you ask for help? Dawn ... From: liberatedlrning  To:","messageBody":"<div id=\"ygrps-yiv-1022680123\">Chris,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In the last year or<br/>\n&gt; so I can now ask (always open-ended)<br/>\n<br/>\n </span></blockquote>What do you mean by &quot;open-ended&quot; when you ask for help?<br/>\n<br/>\nDawn<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;liberatedlrning&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liberatedlearning@...\">liberatedlearning@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, October 26, 2007 11:54 AM<br/>\nSubject: [unschoolingbasics] Re: the feminist in me<br/>\n<br/>\n<br/>\n&gt; Delurking for this one,<br/>\n&gt; <br/>\n&gt; Deb wrote pretty much what I was thinking.  When we transitioned to<br/>\n&gt; RUing the chore issue took a little longer to settle in my mind than the<br/>\n&gt; academics shift .<br/>\n&gt; <br/>\n&gt; What helped me was looking closely at and changing on my own attitude<br/>\n&gt; towards housework.  I decided that I needed to own my own standards.<br/>\n&gt; They were MY standards and I needed to take responsibility for them, not<br/>\n&gt; hoist them onto my family.  I stopped expecting. I stopped expecting my<br/>\n&gt; kids to have my same standards. I stopped expecting them to live up to<br/>\n&gt; my standards.  Letting go of expectations was the key to my shift in<br/>\n&gt; attitude.<br/>\n&gt; <br/>\n&gt; Looking back on it I think that there had to be a period of absolutely<br/>\n&gt; no expectations or even requests for help - a de-choring if you will -<br/>\n&gt; before my kids believed that any housework they did would be of their<br/>\n&gt; own free will.<br/>\n&gt; <br/>\n&gt; I&#39;m not sure if I&#39;m explaining this clearly. For me, I needed to release<br/>\n&gt; all expectations and hopes that my kids would voluntarily pitch-in with<br/>\n&gt; housework. I needed to do it cheerfully myself and let all resentment<br/>\n&gt; evaporate.  During that time I routinely and intentionally swept through<br/>\n&gt; the house, including their bedrooms, and picked-up dirty dishes, took<br/>\n&gt; out their trash, hauled out their dirty laundry etc. with a spirit of<br/>\n&gt; generosity and love for the awesome people I&#39;d chosen to bring into this<br/>\n&gt; world.<br/>\n&gt; <br/>\n&gt; It took some time but eventually my kids started to offer assistance or<br/>\n&gt; do little things here and there without my asking. In the last year or<br/>\n&gt; so I can now ask (always open-ended) for help and they usually oblige my<br/>\n&gt; requests. I am careful not to abuse their generosity because I know that<br/>\n&gt; my standards of clean are beyond theirs. Cleaning up can quickly go from<br/>\n&gt; mutually satisfying to trying to satisfy mom if I&#39;m not careful.<br/>\n&gt; <br/>\n&gt; I  try to always be respectful of their time and plans or activities and<br/>\n&gt; let them know that if they are busy and don&#39;t want to break away, that<br/>\n&gt; the task can either wait or I&#39;ll get to it soon enough.<br/>\n&gt; <br/>\n&gt; My 16yo routinely takes the trash and recycling out each week. His<br/>\n&gt; father will sometimes remind him, &quot;Remember, you HAVE to take the trash<br/>\n&gt; out tonight,&quot;  and I usually insert, &quot;if you&#39;re not busy or you don&#39;t<br/>\n&gt; mind.&quot;  Sometimes I take the trash out, just &#39;cause I think of it or I<br/>\n&gt; know he is busy.  DS also voluntarily does loads of laundry, loads and<br/>\n&gt; unloads the dishwasher, cleans his room and mows the lawn when it needs<br/>\n&gt; to be mowed (we pay him to do this but rarely need to ask him to do it.)<br/>\n&gt; <br/>\n&gt; My 9yo daughter likes best to help out by surprising me with cleaning<br/>\n&gt; her bedroom or the living room.  These surprises usually entail<br/>\n&gt; instructions to me like, &quot;DON&#39;T come in here until I say it&#39;s okay!&quot; She<br/>\n&gt; really loves the feeling of a surprise gift of cleaning.  I often pick<br/>\n&gt; up her room while I&#39;m hanging out with her, listening to her read to me<br/>\n&gt; or just chatting. She doesn&#39;t even  notice I&#39;m doing it at the time but<br/>\n&gt; afterwards she notices how clean her room is and she thanks me!<br/>\n&gt; <br/>\n&gt; When we&#39;re cleaning for guests my kids happily work off of my own list<br/>\n&gt; and will even continued to cross off tasks while I&#39;m out running<br/>\n&gt; errands.  There are times when they happily vaccuum, dust, mop etc. too<br/>\n&gt; <br/>\n&gt; In my opinion and experience, the attitude one takes towards<br/>\n&gt; housecleaning and their children&#39;s participation in housecleaning (or<br/>\n&gt; lack thereof) can make all the difference in the world as to how things<br/>\n&gt; work out.<br/>\n&gt; <br/>\n&gt; Chris<br/>\n&gt;  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/iaunschoolers\">http://groups.yahoo.com/iaunschoolers</a>&gt; <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/iaunschoolers\">http://groups.yahoo.com/group/iaunschoolers</a>&gt; Radically Unschooling in<br/>\n&gt; Iowa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/iaunschoolers\">http://groups.yahoo.com/iaunschoolers</a>&gt;<br/>\n&gt; Learning in the Unzone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.zamunzo.blogspot.com\">http://www.zamunzo.blogspot.com</a>&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot;<br/>\n&gt; &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sounds more like you resent their freedom because you feel burdened by<br/>\n&gt;&gt; the housework. Maybe don&#39;t &quot;let it go&quot; so long - it sounds as if<br/>\n&gt; you&#39;re<br/>\n&gt;&gt; waiting and waiting (picture folded arms and tapping foot) until they<br/>\n&gt;&gt; &quot;realize&quot; they &quot;should&quot; do something and it gets more and more out of<br/>\n&gt;&gt; hand until finally you go ahead and &quot;give in&quot; and take care of it. How<br/>\n&gt;&gt; about just doing what you see when you see it - a little here and<br/>\n&gt; there,<br/>\n&gt;&gt; 15 minutes in the kitchen then go do something else - watch TV, read,<br/>\n&gt;&gt; knit, whatever - then 15 minutes in the living room and so on - rather<br/>\n&gt;&gt; than waiting to see IF they are going to &quot;finally take responsibility<br/>\n&gt;&gt; for their own messes&quot;. As others said, maybe it&#39;s a change of those<br/>\n&gt; old<br/>\n&gt;&gt; tapes in your head that are still playing and seeing everything you do<br/>\n&gt;&gt; (or don&#39;t do) as YOUR choice. You can choose when and how and all to<br/>\n&gt; do<br/>\n&gt;&gt; something. You can choose to resent them not helping or choose to ask<br/>\n&gt;&gt; for assistance. The key to asking for assistance is making it a bit<br/>\n&gt; open<br/>\n&gt;&gt; ended - that is, if you ask for the socks to be picked up off the<br/>\n&gt; living<br/>\n&gt;&gt; room floor, do it with the expectation that it will get done<br/>\n&gt; *sometime*,<br/>\n&gt;&gt; but not *necessarily* the very minute you ask. I&#39;ve found it comes out<br/>\n&gt;&gt; way better if I ask DS (9 yrs) &quot;Hey, can you get the shoes rounded up<br/>\n&gt; at<br/>\n&gt;&gt; the next commercial break?&quot; (or when you finish this level or when<br/>\n&gt;&gt; you&#39;ve finished assembling that k&#39;nex invention...) rather than<br/>\n&gt; stating<br/>\n&gt;&gt; and/or expecting him to stop what he&#39;s doing *immediately* to do what<br/>\n&gt;&gt; I&#39;ve asked.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Deb<br/>\n&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":295439124,"authorName":"wisdomalways5","from":"&quot;wisdomalways5&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193420239","msgId":27357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmdDhrZitvMXVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYTEwMWM4MTdjYiQ1Zjc3MTllMCQwMTAwMDAwYUBTd2VlbmV5Pg=="},"prevInTopic":27356,"nextInTopic":27364,"prevInTime":27356,"nextInTime":27358,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... My dad would wake us up at ... woken up ... lol- oh the memories- we had sat cleaning day too and I hated it- we cleaned all day and could do nothing fun","messageBody":"<div id=\"ygrps-yiv-1690622438\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Nittany Lion <br/>\n&lt;dsweeney@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>  My dad would wake us up at <br/>\n<blockquote><span title=\"ireply\"> &gt; 8:00 AM on Saturdays to do chores.  I hated it, I hated just being <br/>\n </span></blockquote>woken up <br/>\n<blockquote><span title=\"ireply\"> &gt; and doing the chores even more.  <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>lol- oh the memories- we had sat cleaning day too and I hated it- we <br/>\ncleaned all day and could do nothing fun until the house was <br/>\nspotless-- I think it may be why I mostly avoid cleaning on the <br/>\nweekends--<br/>\n<br/>\nCleaning should be something you CHOOSE to do when you want to- or <br/>\nwhoever is bothered by the mess the most will usually clean it up<br/>\n<br/>\nmy teenager (14) who was not raised unschoolish but had chores which <br/>\nhe hated- did clean the bathroom toilet and mirror because <br/>\nhe &quot;wanted&quot; to and admitted that he &quot;would&quot; clean stuff if he did <br/>\nnot have too. <br/>\n<br/>\nI just keep telling myself that it is all a choice and I choose it <br/>\nand so does everyone eles. <br/>\n<br/>\nmy girls 4.5 and 3 keep getting candy out of the halloween party <br/>\nbucket and it was getting me irratated- so I got a big bowl for the <br/>\nparty candy and a slightly smaller bowl for the eating candy and we <br/>\nsplit it up. Now they have been eating candy and candy and candy and <br/>\njust when I wanted to scream &quot;eat some food&quot; the little one is <br/>\nholding still with chocolate milk- I am left with an assortment of <br/>\ntasted candy all over my keyboard because she did not like them.<br/>\n<br/>\nAfter they eat so much candy they open the fridge and say &quot;I need <br/>\nsome food&quot;<br/>\n<br/>\nI am thinking by the time halloween gets here they will be all <br/>\ncandied out from eating it all this week. Ahhhh we are going to have <br/>\ncandy forever</div>","specialLinks":[]},{"userId":133458510,"authorName":"Rachel","from":"&quot;Rachel&quot; &lt;radle12000@...&gt;","profile":"radle12000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193419149","msgId":27356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmdDdpZCt1a24yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPg=="},"prevInTopic":27354,"nextInTopic":27357,"prevInTime":27355,"nextInTime":27357,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... This has proven true in our house. We have been de-schooling for 10 months and I am still learning to really fully totally let go of my expectations of","messageBody":"<div id=\"ygrps-yiv-583903984\"><blockquote><span title=\"ireply\">&gt; In my opinion and experience, the attitude one takes towards<br/>\n&gt; housecleaning and their children&#39;s participation in housecleaning (or<br/>\n&gt; lack thereof) can make all the difference in the world as to how things<br/>\n&gt; work out.<br/>\n&gt; <br/>\n&gt; Chris<br/>\n<br/>\n </span></blockquote>This has proven true in our house. We have been de-schooling for 10<br/>\nmonths and I am still learning to really fully totally let go of my<br/>\nexpectations of others to help out. It&#39;s a real shift in perspective<br/>\nfrom &quot;can&#39;t you see what I do for you and don&#39;t you feel guilty and<br/>\nwant to help&quot; to me just doing because I chose to do things that help<br/>\neveryone in the house feel comfortable and loved. Until this list I<br/>\ndidn&#39;t know that it was possible to chose to do things out of love.<br/>\n<br/>\nI did make a chore chart but it works totally different than any chore<br/>\nchart I am aware of. It has pictures of the things to be done on index<br/>\ncards with a happy face on one side and a sad face on the other, like<br/>\nthe dogs food and water bowl empty with a sad face and on the other<br/>\nside is the bowls full and a smiley face, same with dishes and laundry<br/>\netc.. The concept is that the animals are happier and cared for when<br/>\nthese things are done, as are the people. I made it for myself because<br/>\nI get so side tracked just walking to another room that I need lots of<br/>\nvisual reminders. If someone feels like doing something they just flip<br/>\nover the card. No one *has* to do any of the chores (except me caring<br/>\nfor the animals).It also has eliminated the most asked question in the<br/>\nhouse of &quot;did you feed the...fill in the blank?&quot;<br/>\n<br/>\nMy standards have also changed. Before unschooling I considered<br/>\ncleaning the kitchen as all of the kitchen spic and span and wouldn&#39;t<br/>\ndo it till I could *do it right*. Now if there is enough room on the<br/>\ncounter to chop up stuff for dinner and the sink is empty enough to<br/>\nwash the dirty pot to cook the chopped up stuff in I consider that a<br/>\nsuccessful kitchen day. What about the plates and forks you ask?? Well<br/>\nthose are washed while the chopped up stuff is cooking.<br/>\n<br/>\nMy house is hardly clean and definatly not picked up but it does<br/>\nfunction most of the time on the basic level of meeting the needs of<br/>\nthose who live in it and everyone is a lot happier.<br/>\n<br/>\nPeace and Joy,<br/>\nRachel</div>","specialLinks":[]},{"userId":318079688,"authorName":"Heather","from":"&quot;Heather&quot; &lt;rupestur@...&gt;","profile":"rupestur","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193418910","msgId":27366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmdDdhdSthczE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2EwMWM4MTcxOCQwZWFiMjQxMCQwMTAwMDAwYUBTd2VlbmV5Pg=="},"prevInTopic":27365,"nextInTopic":27370,"prevInTime":27365,"nextInTime":27367,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"This is a HUGE issue for me. I want to come back and read all these responses, but I just have a minute-- My husband has actually said to me that because he","messageBody":"<div id=\"ygrps-yiv-1956327863\">This is a HUGE issue for me.<br/>\n<br/>\nI want to come back and read all these responses, but I just have a<br/>\nminute--<br/>\n<br/>\nMy husband has actually said to me that because he pays the bills, he<br/>\ndoesn&#39;t have to do HIS OWN LAUNDRY, dishes EVER, I pick up all his<br/>\nsoda cans and plates that he leaves laying around even in the<br/>\nbathroom.  The worst part?  He&#39;s unemployed.  He does eBay stuff, and<br/>\nthe occassional computer repair, but he has more time than I do.  It&#39;s<br/>\ncompletely crazy.  I think, Am I the only sane person alive?<br/>\n<br/>\nMy 4-year-old has just started helping me out with cleaning, she<br/>\ncleans her room and picks up all the toys in the living room.  I am so<br/>\nproud of her and tell her all the time.  I swear, if it weren&#39;t for my<br/>\ntiny little girl helping me I&#39;d go crazy.<br/>\n<br/>\nI don&#39;t know what made her start doing this in the first place, I wish<br/>\nI had some advice for you, but I thought you should know that you<br/>\naren&#39;t the only one!</div>","specialLinks":[]},{"userId":291006621,"authorName":"liberatedlrning","from":"&quot;liberatedlrning&quot; &lt;liberatedlearning@...&gt;","profile":"liberatedlrning","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: the feminist in me","postDate":"1193414081","msgId":27354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmdDJrMSs4dm9vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzY2QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27353,"nextInTopic":27356,"prevInTime":27353,"nextInTime":27355,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"Delurking for this one, Deb wrote pretty much what I was thinking.  When we transitioned to RUing the chore issue took a little longer to settle in my mind","messageBody":"<div id=\"ygrps-yiv-1249860063\">Delurking for this one,<br/>\n<br/>\nDeb wrote pretty much what I was thinking.  When we transitioned to<br/>\nRUing the chore issue took a little longer to settle in my mind than the<br/>\nacademics shift .<br/>\n<br/>\nWhat helped me was looking closely at and changing on my own attitude<br/>\ntowards housework.  I decided that I needed to own my own standards.<br/>\nThey were MY standards and I needed to take responsibility for them, not<br/>\nhoist them onto my family.  I stopped expecting. I stopped expecting my<br/>\nkids to have my same standards. I stopped expecting them to live up to<br/>\nmy standards.  Letting go of expectations was the key to my shift in<br/>\nattitude.<br/>\n<br/>\nLooking back on it I think that there had to be a period of absolutely<br/>\nno expectations or even requests for help - a de-choring if you will -<br/>\nbefore my kids believed that any housework they did would be of their<br/>\nown free will.<br/>\n<br/>\nI&#39;m not sure if I&#39;m explaining this clearly. For me, I needed to release<br/>\nall expectations and hopes that my kids would voluntarily pitch-in with<br/>\nhousework. I needed to do it cheerfully myself and let all resentment<br/>\nevaporate.  During that time I routinely and intentionally swept through<br/>\nthe house, including their bedrooms, and picked-up dirty dishes, took<br/>\nout their trash, hauled out their dirty laundry etc. with a spirit of<br/>\ngenerosity and love for the awesome people I&#39;d chosen to bring into this<br/>\nworld.<br/>\n<br/>\nIt took some time but eventually my kids started to offer assistance or<br/>\ndo little things here and there without my asking. In the last year or<br/>\nso I can now ask (always open-ended) for help and they usually oblige my<br/>\nrequests. I am careful not to abuse their generosity because I know that<br/>\nmy standards of clean are beyond theirs. Cleaning up can quickly go from<br/>\nmutually satisfying to trying to satisfy mom if I&#39;m not careful.<br/>\n<br/>\nI  try to always be respectful of their time and plans or activities and<br/>\nlet them know that if they are busy and don&#39;t want to break away, that<br/>\nthe task can either wait or I&#39;ll get to it soon enough.<br/>\n<br/>\nMy 16yo routinely takes the trash and recycling out each week. His<br/>\nfather will sometimes remind him, &quot;Remember, you HAVE to take the trash<br/>\nout tonight,&quot;  and I usually insert, &quot;if you&#39;re not busy or you don&#39;t<br/>\nmind.&quot;  Sometimes I take the trash out, just &#39;cause I think of it or I<br/>\nknow he is busy.  DS also voluntarily does loads of laundry, loads and<br/>\nunloads the dishwasher, cleans his room and mows the lawn when it needs<br/>\nto be mowed (we pay him to do this but rarely need to ask him to do it.)<br/>\n<br/>\nMy 9yo daughter likes best to help out by surprising me with cleaning<br/>\nher bedroom or the living room.  These surprises usually entail<br/>\ninstructions to me like, &quot;DON&#39;T come in here until I say it&#39;s okay!&quot; She<br/>\nreally loves the feeling of a surprise gift of cleaning.  I often pick<br/>\nup her room while I&#39;m hanging out with her, listening to her read to me<br/>\nor just chatting. She doesn&#39;t even  notice I&#39;m doing it at the time but<br/>\nafterwards she notices how clean her room is and she thanks me!<br/>\n<br/>\nWhen we&#39;re cleaning for guests my kids happily work off of my own list<br/>\nand will even continued to cross off tasks while I&#39;m out running<br/>\nerrands.  There are times when they happily vaccuum, dust, mop etc. too<br/>\n<br/>\nIn my opinion and experience, the attitude one takes towards<br/>\nhousecleaning and their children&#39;s participation in housecleaning (or<br/>\nlack thereof) can make all the difference in the world as to how things<br/>\nwork out.<br/>\n<br/>\nChris<br/>\n  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/iaunschoolers\">http://groups.yahoo.com/iaunschoolers</a>&gt; <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/iaunschoolers\">http://groups.yahoo.com/group/iaunschoolers</a>&gt; Radically Unschooling in<br/>\nIowa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/iaunschoolers\">http://groups.yahoo.com/iaunschoolers</a>&gt;<br/>\nLearning in the Unzone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.zamunzo.blogspot.com\">http://www.zamunzo.blogspot.com</a>&gt;<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot;<br/>\n&lt;debra.rossing@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Sounds more like you resent their freedom because you feel burdened by<br/>\n&gt; the housework. Maybe don&#39;t &quot;let it go&quot; so long - it sounds as if<br/>\n </span></blockquote>you&#39;re<br/>\n<blockquote><span title=\"ireply\"> &gt; waiting and waiting (picture folded arms and tapping foot) until they<br/>\n&gt; &quot;realize&quot; they &quot;should&quot; do something and it gets more and more out of<br/>\n&gt; hand until finally you go ahead and &quot;give in&quot; and take care of it. How<br/>\n&gt; about just doing what you see when you see it - a little here and<br/>\n </span></blockquote>there,<br/>\n<blockquote><span title=\"ireply\"> &gt; 15 minutes in the kitchen then go do something else - watch TV, read,<br/>\n&gt; knit, whatever - then 15 minutes in the living room and so on - rather<br/>\n&gt; than waiting to see IF they are going to &quot;finally take responsibility<br/>\n&gt; for their own messes&quot;. As others said, maybe it&#39;s a change of those<br/>\n </span></blockquote>old<br/>\n<blockquote><span title=\"ireply\"> &gt; tapes in your head that are still playing and seeing everything you do<br/>\n&gt; (or don&#39;t do) as YOUR choice. You can choose when and how and all to<br/>\n </span></blockquote>do<br/>\n<blockquote><span title=\"ireply\"> &gt; something. You can choose to resent them not helping or choose to ask<br/>\n&gt; for assistance. The key to asking for assistance is making it a bit<br/>\n </span></blockquote>open<br/>\n<blockquote><span title=\"ireply\"> &gt; ended - that is, if you ask for the socks to be picked up off the<br/>\n </span></blockquote>living<br/>\n<blockquote><span title=\"ireply\"> &gt; room floor, do it with the expectation that it will get done<br/>\n </span></blockquote>*sometime*,<br/>\n<blockquote><span title=\"ireply\"> &gt; but not *necessarily* the very minute you ask. I&#39;ve found it comes out<br/>\n&gt; way better if I ask DS (9 yrs) &quot;Hey, can you get the shoes rounded up<br/>\n </span></blockquote>at<br/>\n<blockquote><span title=\"ireply\"> &gt; the next commercial break?&quot; (or when you finish this level or when<br/>\n&gt; you&#39;ve finished assembling that k&#39;nex invention...) rather than<br/>\n </span></blockquote>stating<br/>\n<blockquote><span title=\"ireply\"> &gt; and/or expecting him to stop what he&#39;s doing *immediately* to do what<br/>\n&gt; I&#39;ve asked.<br/>\n&gt;<br/>\n&gt; Deb<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":119825694,"authorName":"sharilynn29@aol.com","from":"sharilynn29@...","profile":"sharilynn78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193413905","msgId":27365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkYy4xZjc0YWU1OC4zNDUzNjcxMUBhb2wuY29tPg=="},"prevInTopic":27364,"nextInTopic":27366,"prevInTime":27364,"nextInTime":27366,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/26/2007 6:45:24 A.M. Central Daylight Time, kim.johnstone@shaw.ca writes: How do  you suggest going about doing housework as a family in","messageBody":"<div id=\"ygrps-yiv-2118862368\">In a message dated 10/26/2007 6:45:24 A.M. Central Daylight Time,  <br/>\nkim.johnstone@... writes:<br/>\n<br/>\nHow do  you suggest going about doing housework as a family in some<br/>\nsort of  organized fashion? <br/>\n<br/>\n<br/>\nKim,<br/>\nYou could set up a schedule for yourself. Fill in the basics that need to  be <br/>\naccomplished. Your children are still relatively young and would not be a  <br/>\ngreat help at this age. Like I posted earlier, cheerfully do your scheduled  <br/>\nchores and ask for help. If your child(ren) says yes, than you can accomplish  <br/>\nyour task faster or you can get more done. If not, you still have the basics  <br/>\ndone. If your child sees the blessing of spending time with you and having fun  <br/>\nwith you, they will be more willing. This is a great time to teach your <br/>\nchildren  how to clean a toilet, or how to sweep the floor. Your child may <br/>\neventually be  more willing to work on their own, but if not, working together is still <br/>\na great  way to accomplish tasks. &quot;Many hands make light work.&quot;  <br/>\n<br/>\nShari<br/>\nWife  to Ken<br/>\nMom to Nathan (9 years)<br/>\nand Katie (3.5 years)<br/>\n_http://crosstrainingacademy.blogspot.com_ <br/>\n(http://crosstrainingacademy.blogspot.com/) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at http://www.aol.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":119825694,"authorName":"sharilynn29@aol.com","from":"sharilynn29@...","profile":"sharilynn78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] the feminist in me","postDate":"1193413538","msgId":27364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzYy4xNjc5MDUxOS4zNDUzNjVhMkBhb2wuY29tPg=="},"prevInTopic":27357,"nextInTopic":27365,"prevInTime":27363,"nextInTime":27365,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I haven t read all of the responses yet, but I ll tell you what I did. I used to do the chore charts, threats, punishments, bribes. You name it, I did it. Now,","messageBody":"<div id=\"ygrps-yiv-1569232406\">I haven&#39;t read all of the responses yet, but I&#39;ll tell you what I did. I  <br/>\nused to do the chore charts, threats, punishments, bribes. You name it, I did  <br/>\nit. <br/>\n <br/>\nNow, I ask for help. It&#39;s amazing how much my children want to spend time  <br/>\nwith me. They also love to make mommy happy. I&#39;m amazed daily at the amount of  <br/>\nlove these children feel for me. I typically just say, &quot;I&#39;m going to tidy the  <br/>\nupstairs and dust. Do you want to work with me?&quot; If they say no, I go to my  <br/>\nother child and ask them. If both children say no, I do the job myself. I act  <br/>\njoyful while cleaning (music on, dancing, singing, smiling). If a child <br/>\nchooses  to help, this child gets my full attention while helping me. It&#39;s not an  <br/>\nartificial bribe~just the nature of working with mom. This is often what  the <br/>\nchildren want from their parents. They want our time and attention. <br/>\n <br/>\nWhen I started doing this, they said no more often. They wanted to know  that <br/>\nthey could say no without my getting mad. Now that they know it really is <br/>\ntheir choice, they often say yes. It&#39;s more work in the beginning than  making a <br/>\nchore chart, but in the long run, it works much better. The children  also <br/>\nlearn to clean better by seeing your example. I don&#39;t have problems with  two <br/>\nchildren, but with four children, you may have to turn away help!  <br/>\n<br/>\nShari<br/>\nWife  to Ken<br/>\nMom to Nathan (9 years)<br/>\nand Katie (3.5 years)<br/>\n_http://crosstrainingacademy.blogspot.com_ <br/>\n(http://crosstrainingacademy.blogspot.com/) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at http://www.aol.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: the feminist in me","postDate":"1193409437","msgId":27353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzY2QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27349,"nextInTopic":27354,"prevInTime":27352,"nextInTime":27354,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... their freedom to do as they wish (at least until I lose my patience), I ... Sounds more like you resent their freedom because you feel burdened by the","messageBody":"<div id=\"ygrps-yiv-2103616780\"><blockquote><span title=\"ireply\">&gt;I also feel like since I&#39;m okay with my kids and my husband having<br/>\n </span></blockquote>their freedom to do as they wish (at least until I lose my patience), I<br/>\n<blockquote><span title=\"ireply\"> &gt;should get some respect for my efforts -<br/>\n <br/>\n </span></blockquote>Sounds more like you resent their freedom because you feel burdened by<br/>\nthe housework. Maybe don&#39;t &quot;let it go&quot; so long - it sounds as if you&#39;re<br/>\nwaiting and waiting (picture folded arms and tapping foot) until they<br/>\n&quot;realize&quot; they &quot;should&quot; do something and it gets more and more out of<br/>\nhand until finally you go ahead and &quot;give in&quot; and take care of it. How<br/>\nabout just doing what you see when you see it - a little here and there,<br/>\n15 minutes in the kitchen then go do something else - watch TV, read,<br/>\nknit, whatever - then 15 minutes in the living room and so on - rather<br/>\nthan waiting to see IF they are going to &quot;finally take responsibility<br/>\nfor their own messes&quot;. As others said, maybe it&#39;s a change of those old<br/>\ntapes in your head that are still playing and seeing everything you do<br/>\n(or don&#39;t do) as YOUR choice. You can choose when and how and all to do<br/>\nsomething. You can choose to resent them not helping or choose to ask<br/>\nfor assistance. The key to asking for assistance is making it a bit open<br/>\nended - that is, if you ask for the socks to be picked up off the living<br/>\nroom floor, do it with the expectation that it will get done *sometime*,<br/>\nbut not *necessarily* the very minute you ask. I&#39;ve found it comes out<br/>\nway better if I ask DS (9 yrs) &quot;Hey, can you get the shoes rounded up at<br/>\nthe next commercial break?&quot; (or when you finish this level or when<br/>\nyou&#39;ve finished assembling that k&#39;nex invention...) rather than stating<br/>\nand/or expecting him to stop what he&#39;s doing *immediately* to do what<br/>\nI&#39;ve asked.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":258070335,"authorName":"Nittany Lion","from":"Nittany Lion &lt;dsweeney@...&gt;","profile":"dawn_sweeney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: the feminist in me","postDate":"1193401562","msgId":27349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTEwMWM4MTdjYiQ1Zjc3MTllMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PGZmcnBmbytuaG9vQGVHcm91cHMuY29tPg=="},"prevInTopic":27348,"nextInTopic":27353,"prevInTime":27348,"nextInTime":27350,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... We got paid for doing chores, had assigned ones.  My dad would wake us up at 8:00 AM on Saturdays to do chores.  I hated it, I hated just being woken up ","messageBody":"<div id=\"ygrps-yiv-654761621\"><blockquote><span title=\"ireply\">&gt; Growing up why did you not &quot;help&quot; your mom? did you have ANY<br/>\n&gt; required chores? Did you want to help and she not let you or did you<br/>\n&gt; feel it was not your job<br/>\n<br/>\n </span></blockquote>We got paid for doing chores, had assigned ones.  My dad would wake us up at <br/>\n8:00 AM on Saturdays to do chores.  I hated it, I hated just being woken up <br/>\nand doing the chores even more.  The thing I enjoyed was doing a major <br/>\ncleaning every now and then.  And once I started driving, I did the grocery <br/>\nshopping which I really enjoyed.  My mom worked and I know she appreciated <br/>\nthat.  But laundry, ironing and keeping the house clean all the time was on <br/>\nmy mom.  We had a couch in the living room that no one was allowed to sit <br/>\non - it was to be kept nice.   I don&#39;t wish these things on my kids and try, <br/>\nsometimes really hard not to say anything.<br/>\n<br/>\nDawn<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;wisdomalways5&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wisdom1133@...\">wisdom1133@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, October 26, 2007 12:12 AM<br/>\nSubject: [unschoolingbasics] Re: the feminist in me<br/>\n<br/>\n<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Nittany Lion<br/>\n&gt; &lt;dsweeney@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; I&#39;m 100% unschooling when it comes to learning &quot;academics&quot; in its<br/>\n&gt; variety of<br/>\n&gt;&gt; forms in everyday life.   The feminist in me struggles with<br/>\n&gt; aspects of<br/>\n&gt;&gt; unschooling like chores.  My mom was the type who did everything<br/>\n&gt; for my dad<br/>\n&gt;&gt; and my brother and I.  As I got older I hated seeing her being<br/>\n&gt; treated as a<br/>\n&gt;&gt; traditional housewife, who kept the house and catered to everyone<br/>\n&gt; in it,<br/>\n&gt;&gt; simply bc she was a woman.<br/>\n&gt;<br/>\n&gt; Growing up why did you not &quot;help&quot; your mom? did you have ANY<br/>\n&gt; required chores? Did you want to help and she not let you or did you<br/>\n&gt; feel it was not your job<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  I don&#39;t want my girls to think they will be<br/>\n&gt;&gt; expected to clean and cook and do all the chores for their<br/>\n&gt; household and I<br/>\n&gt;&gt; don&#39;t want my son to expect that role from his wife should he<br/>\n&gt; decide to<br/>\n&gt;&gt; marry.<br/>\n&gt;<br/>\n&gt; I do not want my slef, husband, boy, or girls to grow up thinking<br/>\n&gt; they &quot;HAVE&quot; to do anything. I want them to do everything because<br/>\n&gt; they choose to not because someone says they &quot;should&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; For me personally, I don&#39;t have the energy, desire or time to<br/>\n&gt; clean up after<br/>\n&gt;&gt; everyone (I have 4 kids btw ages 8, 6, 4 and 17 months, so I am<br/>\n&gt; wiped out<br/>\n&gt;&gt; anyway!).  I get resentful when I clean a room only to have it get<br/>\n&gt; messed up<br/>\n&gt;&gt; and left that way.  I&#39;m fine with the mess, but not with cleaning<br/>\n&gt; it up if I<br/>\n&gt;&gt; didn&#39;t make it.  I don&#39;t expect anyone to pick up my dirty<br/>\n&gt; clothes, or my<br/>\n&gt;&gt; mess in the kitchen after cooking, why should I be expected to do<br/>\n&gt; all the<br/>\n&gt;&gt; chores, especially their messes?  Shouldn&#39;t everyone chip in while<br/>\n&gt; in a<br/>\n&gt;&gt; communal environment (as all houses are)?  I&#39;m not a neat freak, I<br/>\n&gt; don&#39;t<br/>\n&gt;&gt; mind clutter or dirty bathrooms - I just resent it when I am<br/>\n&gt; expected to do<br/>\n&gt;&gt; all the chores over and over.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I found that the more I took care of messes the more people in turn<br/>\n&gt; helped me..<br/>\n&gt;<br/>\n&gt; For instance my youngest is almost 3 and she was mad and tossed<br/>\n&gt; about 20 movies onthe floor. I took her in my arms and was tlaking<br/>\n&gt; about why hse was upset and my older daughter who is 4.5 said -you<br/>\n&gt; hold her mom I will pick them up&quot;--- <br/>\n&gt;<br/>\n&gt; another time we were walking out the door and the older one tripped<br/>\n&gt; over the lego bucket and they dumped- we were just going to leave it<br/>\n&gt; but the little one said she wanted to clean it up - so we did<br/>\n&gt;<br/>\n&gt; If you are not MADE to do &quot;your&quot; part and begrudge your &quot;part&quot; then<br/>\n&gt; everybody does what they want to instead of have to.<br/>\n&gt;<br/>\n&gt; I usually do all the surface cleaning but every so often my husband<br/>\n&gt; deep cleans the kitchen or bathrooms. We each do what we are willing<br/>\n&gt; to do.<br/>\n&gt;<br/>\n&gt; I used to &quot;expect&#39; my husband to help bring in the groceries but he<br/>\n&gt; did it snarling and acted put out. I realized that this was an<br/>\n&gt; expectation I had but he did not and so I told him that I would<br/>\n&gt; bring in the bags and if he felt like helping he could but it was<br/>\n&gt; not a have to. For a few months he did not help and I did not ask<br/>\n&gt; nor did I act like &quot;I&quot; was put out or pissed off that he was not<br/>\n&gt; helping. Then he started asking how many bags there were and I would<br/>\n&gt; say how many more trips I thought were left and then he &quot;ask&quot; if I<br/>\n&gt; wanted help and I said &quot;if you want to&quot;. now most of the time he<br/>\n&gt; just puts on his shoes and comes to help.<br/>\n&gt;<br/>\n&gt; I notice that before you give chores kids LOVE to help out and then<br/>\n&gt; with chores they only want to do the minimal amount of work and you<br/>\n&gt; have to fight to get it done. We call if &quot;age&quot; but maybe it is just<br/>\n&gt; because it is no longer a choice but a chore<br/>\n&gt;<br/>\n&gt; I was raised to NOT leave dishes in the sink- As an adult i leave<br/>\n&gt; the dishes for the day in the sink and on the counter and then MOST<br/>\n&gt; days I do a load but SOME days I wait till the next day. I noticed<br/>\n&gt; that I do not MIND doing dishes as long as I choose WHEN  I want to<br/>\n&gt; do them. I hate doing dishes right after a meal- I want to sit and<br/>\n&gt; settle and after a few hours do dishes.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I once threw away 4 or 5 board games bc they<br/>\n&gt;&gt; were left out for days, pieces all over the place - I didn&#39;t want<br/>\n&gt; to burden<br/>\n&gt;&gt; the kids with cleaning . . . but got pissed and threw them out bc<br/>\n&gt; (as I told<br/>\n&gt;&gt; them) I am not their servant.<br/>\n&gt;<br/>\n&gt; No you are not the servant but neither are they. If they see what a<br/>\n&gt; pain it is for you to clean up why would they want to do something<br/>\n&gt; that you obviously hate to do.<br/>\n&gt;<br/>\n&gt; You made a choice to NOT clean out the games and then punished them<br/>\n&gt; for your choice. I would have dumped them all in a bucket until<br/>\n&gt; somebody - maybe you- maybe them- maybe grandma- choose to sort<br/>\n&gt; them.<br/>\n&gt;<br/>\n&gt; You are thinking in terms of expectations but maybe it is about<br/>\n&gt; choosing- you choose to be mom, you choose where to clean and when<br/>\n&gt; to clean or even if you want to clean. At the moment my toliets are<br/>\n&gt; growing things in the bowl and I and starting to feel the need to<br/>\n&gt; clean them (for the record I hate to clean bathrooms) BUT my husband<br/>\n&gt; might get the urge sooner (which I am secretly hoping for) but I am<br/>\n&gt; home in the morning so I think it will get done then.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; can you see the difference between thinking you have to and choosing<br/>\n&gt; to. I clean up for my kids because the sometimes do not know where<br/>\n&gt; to start or what goes where but they like to sweep and vaccumm and<br/>\n&gt; dust when the urge hits and sometimes they jsut spontansously clean<br/>\n&gt; and organize<br/>\n&gt;<br/>\n&gt; JulieH<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":258070335,"authorName":"Nittany Lion","from":"Nittany Lion &lt;dsweeney@...&gt;","profile":"dawn_sweeney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] the feminist in me","postDate":"1193401102","msgId":27348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODAwMWM4MTdjYSQ0ZDNmMGVmMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PDMwMDYzLjMyNTEyLnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":27347,"nextInTopic":27349,"prevInTime":27347,"nextInTime":27349,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I would love to have someone come clean my house!  Yes, I do realize its a resentment issue.   More towards my parents than anything else (they were very","messageBody":"<div id=\"ygrps-yiv-1228447101\">I would love to have someone come clean my house!  Yes, I do realize its a <br/>\nresentment issue.   More towards my parents than anything else (they were <br/>\nvery structured, fundamentalist).  I also feel like since I&#39;m okay with my <br/>\nkids and my husband having their freedom to do as they wish (at least until <br/>\nI lose my patience), I should get some respect for my efforts - I do think <br/>\nthey should put their dishes in the sink and keep the common areas cleaner <br/>\nat some point during the day or week (the living room and half of the den, <br/>\nthey can do whatever to the other half).<br/>\n<br/>\nWe don&#39;t do chores - the only time I do anything to their rooms is when the <br/>\nfruit flies come.  I sweep out under their beds into the middle of the <br/>\nfloor - grab the half eaten apples and banana peels, tell them to take what <br/>\nthey want to keep and we throw away the rest.  We do it together, 2 or 3 <br/>\ntimes a year.  I don&#39;t ask them to clean the kitchen or the bathroom - just <br/>\nto take care of their part of what they mess up.<br/>\n<br/>\nDawn<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;ENSEMBLE S-WAYNFORTH&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, October 26, 2007 4:31 AM<br/>\nSubject: Re: [unschoolingbasics] the feminist in me<br/>\n<br/>\n<br/>\n&gt;I don&#39;t think this is a feminist issue. I think it is a resentment issue. <br/>\n&gt;It might feel better to phrase it as instructive to demonstrate to your own <br/>\n&gt;children how women aren&#39;t the servants in a household, but really what you <br/>\n&gt;are demonstrating is that cleaning up is a pain in the ass and can only be <br/>\n&gt;done under duress.<br/>\n&gt;<br/>\n&gt; At the minute, in my house, the kitchen is fairly clean (it usually is) <br/>\n&gt; the living room is filled with the ruins of youtube inspired domino <br/>\n&gt; projects and blocks and pocket pets and stuffed animals, one bedroom is <br/>\n&gt; completely occluded with toys and another is only partially occluded and <br/>\n&gt; the cat box probably needs cleaning. We have been incredibly busy lately <br/>\n&gt; and last night was the first night in 4 of not having someone sleeping <br/>\n&gt; over. There are costumes to plan and to put together for tomorrow&#39;s party <br/>\n&gt; and cookies to bake and bread to be made, I need to get world of warcraft <br/>\n&gt; to update on 2 computers so that people (myself included) can play. And <br/>\n&gt; all these more interesting, more important things conspire to keep <br/>\n&gt; cleaning the house lower down on the list of things to do. When cleaning <br/>\n&gt; the house gets to my breaking point, my I just can&#39;t take stepping on toys <br/>\n&gt; anymore point I will clean it. And often cleaning the living room happens <br/>\n&gt; when I&#39;m watching television,<br/>\n&gt; general picking up. Vacuuming is a bigger palaver.<br/>\n&gt;<br/>\n&gt; Anyhow, all of that is to say that I can fully sympathize with a messy <br/>\n&gt; house. And to set a scene. I can choose to respond to that scene in quite <br/>\n&gt; a few different ways. I can choose to ignore it and wait for others to <br/>\n&gt; feel the need to clean it, which would probably push me beyond my comfort <br/>\n&gt; level and into that itchy, irritable point where I just can&#39;t think quite <br/>\n&gt; straight and I feel more and more resentful about and aware of the mess. I <br/>\n&gt; can freak out and yell and/or lecture about how I didn&#39;t make the mess and <br/>\n&gt; can&#39;t people clean up after themselves, and why can&#39;t they at least use <br/>\n&gt; one of the many trash cans I put in a room. I can do what my mom used to <br/>\n&gt; do and make them go sit in a room until it is clean, which usually ended <br/>\n&gt; up with much of my stuff shoved under the bed. All of those might get the <br/>\n&gt; house clean, but are much more likely to make everyone feel angry and sad <br/>\n&gt; and hurt and feel like cleaning is a miserable experience that no one <br/>\n&gt; could possibly<br/>\n&gt; want to do. The option that leads to the best outcome, a cleaner house and <br/>\n&gt; happy folk all round, is where I start cleaning and ask for help. <br/>\n&gt; Sometimes I get help and sometimes I don&#39;t. I can get really into <br/>\n&gt; cleaning, setting up little toy dioramas for Simon and Linnaea to discover <br/>\n&gt; and explore, finding things I forgot existed, and so, probably, did they. <br/>\n&gt; I like seeing what they&#39;ve pulled out of all of their toys and see where <br/>\n&gt; they&#39;ve been (like your 4 board games that you threw away--I would rather <br/>\n&gt; save them knowing that they had enjoyed them that day, probably they would <br/>\n&gt; enjoy them again). And yes, invariable, all of the work I put in will be <br/>\n&gt; whittled away until we are back here with our time defined by the messes <br/>\n&gt; we&#39;ve made.<br/>\n&gt;<br/>\n&gt; I like to think of my cleaning up as a gift. I like to be able to clear <br/>\n&gt; the slate for future explorations in rube goldberg machines or artistic <br/>\n&gt; endeavors, or dancing without lego pieces getting stuck to the arch of a <br/>\n&gt; foot, or discovering long forgotten toys. Some moments I don&#39;t quite get <br/>\n&gt; there. Usually when I am feeling rushed or overwhelmed or tired or <br/>\n&gt; pre-menstrual. But it helps me if those moments become just a tidy and not <br/>\n&gt; a full involved clean. If I am cleaning for company, I can close bedroom <br/>\n&gt; doors and just make the public space as clean as my sense of hospitality <br/>\n&gt; requires.<br/>\n&gt;<br/>\n&gt; One of the other things you could do is hire someone to come in once a <br/>\n&gt; week or twice a month and clean. Surely the amount of money that you spend <br/>\n&gt; on a maid service would be worth the peace of mind that you have and worth <br/>\n&gt; your children&#39;s peace. You have young children, it seems really unfair to <br/>\n&gt; expect them to clean up after themselves. Much better to hire someone to <br/>\n&gt; do the work for all of you. And then you can focus on the things you find <br/>\n&gt; more joyful in life.<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n&gt; www.waynforth.blogspot.com<br/>\n&gt;<br/>\n&gt; -----------------<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m 100% unschooling when it comes to learning &quot;academics&quot; in its variety <br/>\n&gt; of<br/>\n&gt; forms in everyday life.   The feminist in me struggles with aspects of<br/>\n&gt; unschooling like chores.  My mom was the type who did everything for my <br/>\n&gt; dad<br/>\n&gt; and my brother and I.  As I got older I hated seeing her being treated as <br/>\n&gt; a<br/>\n&gt; traditional housewife, who kept the house and catered to everyone in it,<br/>\n&gt; simply bc she was a woman.   I don&#39;t want my girls to think they will be<br/>\n&gt; expected to clean and cook and do all the chores for their household and I<br/>\n&gt; don&#39;t want my son to expect that role from his wife should he decide to<br/>\n&gt; marry.<br/>\n&gt;<br/>\n&gt; For me personally, I don&#39;t have the energy, desire or time to clean up <br/>\n&gt; after<br/>\n&gt; everyone (I have 4 kids btw ages 8, 6, 4 and 17 months, so I am wiped out<br/>\n&gt; anyway!).  I get resentful when I clean a room only to have it get messed <br/>\n&gt; up<br/>\n&gt; and left that way.  I&#39;m fine with the mess, but not with cleaning it up if <br/>\n&gt; I<br/>\n&gt; didn&#39;t make it.  I don&#39;t expect anyone to pick up my dirty clothes, or my<br/>\n&gt; mess in the kitchen after cooking, why should I be expected to do all the<br/>\n&gt; chores, especially their messes?  Shouldn&#39;t everyone chip in while in a<br/>\n&gt; communal environment (as all houses are)?  I&#39;m not a neat freak, I don&#39;t<br/>\n&gt; mind clutter or dirty bathrooms - I just resent it when I am expected to <br/>\n&gt; do<br/>\n&gt; all the chores over and over.  I once threw away 4 or 5 board games bc <br/>\n&gt; they<br/>\n&gt; were left out for days, pieces all over the place - I didn&#39;t want to <br/>\n&gt; burden<br/>\n&gt; the kids with cleaning . . . but got pissed and threw them out bc (as I <br/>\n&gt; told<br/>\n&gt; them) I am not their servant.<br/>\n&gt;<br/>\n&gt; What are your thoughts or opinions?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":258070335,"authorName":"Nittany Lion","from":"Nittany Lion &lt;dsweeney@...&gt;","profile":"dawn_sweeney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] the feminist in me","postDate":"1193400466","msgId":27347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2IwMWM4MTdjOCRkMjczMDMzMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PDg4ODE5My45NTk4MC5xbUB3ZWI1MzgwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":27346,"nextInTopic":27348,"prevInTime":27346,"nextInTime":27348,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... No, they haven t told me that they expect me to be their servant - that is what I feel like when I m fustrated.  They don t leave all the housework to me -","messageBody":"<div id=\"ygrps-yiv-126044549\"><blockquote><span title=\"ireply\">&gt;Have they told you they expect you to be their servant, or is that a <br/>\n&gt;feeling you&#39;ve overlaid on the situation?  &gt;Do they really leave all the <br/>\n&gt;work to you, or does it just feel that way?  Do you ask for their help <br/>\n&gt;before &gt;you&#39;re angry about it?  Do they see any joy from you in doing the <br/>\n&gt;housework, even just joy in having it &gt;clean?  Or is it all made to look <br/>\n&gt;like so much drudgery?<br/>\n<br/>\n<br/>\n </span></blockquote>No, they haven&#39;t told me that they expect me to be their servant - that is <br/>\nwhat I feel like when I&#39;m fustrated.  They don&#39;t leave all the housework to <br/>\nme - it feels that way sometimes.  I let things go for days and weeks, in <br/>\nthe complete unschooling mode - then, when I&#39;m tired, fustrated and have <br/>\nlittle time, I get resentful and question the complete unschooling mode.<br/>\n<br/>\nDawn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Sylvia Toyama&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, October 26, 2007 2:16 AM<br/>\nSubject: Re: [unschoolingbasics] the feminist in me<br/>\n<br/>\n<br/>\n&gt;I don&#39;t expect anyone to pick up my dirty clothes, or my mess in the <br/>\n&gt;kitchen after cooking, why should I be expected to do all the chores, <br/>\n&gt;especially their messes?<br/>\n&gt;<br/>\n&gt;  *****<br/>\n&gt;  Do they expect you to clean up their messes, or is that it just doesn&#39;t <br/>\n&gt; occur to them to do it?  Would they care if the house was left messy all <br/>\n&gt; the time?<br/>\n&gt;<br/>\n&gt;  *****<br/>\n&gt;  Shouldn&#39;t everyone chip in while in a communal environment (as all houses <br/>\n&gt; are)? I&#39;m not a neat freak, I don&#39;t mind clutter or dirty bathrooms - I <br/>\n&gt; just resent it when I am expected to do all the chores over and over.<br/>\n&gt;<br/>\n&gt;  ****<br/>\n&gt;  It sounds to me like you&#39;re the one expecting that someone -- preferably <br/>\n&gt; those who make a mess -- should anticipate that it will need to be cleaned <br/>\n&gt; up.  If it&#39;s simply that you are the one who likes it clean, then of <br/>\n&gt; course you&#39;re the one motivated to do the cleaning.  At their ages, likely <br/>\n&gt; the mess doesn&#39;t bother them -- if they even see it.<br/>\n&gt;<br/>\n&gt;  *****<br/>\n&gt;  I once threw away 4 or 5 board games bc they were left out for days, <br/>\n&gt; pieces all over the place - I didn&#39;t want to burden the kids with cleaning <br/>\n&gt; . . . but got pissed and threw them out bc (as I told them) I am not their <br/>\n&gt; servant.<br/>\n&gt;<br/>\n&gt;  *****<br/>\n&gt;  Have they told you they expect you to be their servant, or is that a <br/>\n&gt; feeling you&#39;ve overlaid on the situation?  Do they really leave all the <br/>\n&gt; work to you, or does it just feel that way?  Do you ask for their help <br/>\n&gt; before you&#39;re angry about it?  Do they see any joy from you in doing the <br/>\n&gt; housework, even just joy in having it clean?  Or is it all made to look <br/>\n&gt; like so much drudgery?<br/>\n&gt;<br/>\n&gt;  I&#39;ve recently looked -- again -- at answers to the chores question, in <br/>\n&gt; the course of a discussion with my mil.  Here&#39;s what I come up with for <br/>\n&gt; myself -- I knew when I chose to have kids (I have three total, two still <br/>\n&gt; at home) that they&#39;d create messes, and dirty up dishes and clothes, and <br/>\n&gt; track in mud/sand and throw shoes about.  That&#39;s just part of what kids <br/>\n&gt; do.  It&#39;s part and parcel of having kids in my life.  I don&#39;t really mind <br/>\n&gt; the extra work -- most of the time.   Also, it helps to see that my kids <br/>\n&gt; do help out.  No, it seldom occurs to them to wash the dishes, tho Andy <br/>\n&gt; (11) always brings his dishes to the sink.  Andy will put his clothes away <br/>\n&gt; after I fold them, and always puts his clothes in the hamper.  Not because <br/>\n&gt; we ask him to, but because that level of organization is part of his <br/>\n&gt; personality.  So is having his legos scattered in a somewhat controlled <br/>\n&gt; pile on his bedroom floor.&lt;g&gt;<br/>\n&gt;<br/>\n&gt;  Dan (6) loves to dump his legos -- tho he does always ask first -- take <br/>\n&gt; the cushions off the couch, mess up my bed anytime I make it, and almost <br/>\n&gt; never returns dishes to the kitchen.  He also loves to scrub the bathtub <br/>\n&gt; and shower, mops the kitchen floor, and wash windows, mirrors and walls. <br/>\n&gt; Not necessarily as well as I&#39;d do them, but he loves to do it.  He insists <br/>\n&gt; on emptying the cooler on Thurs morning when milk, eggs, etc, are <br/>\n&gt; delivered to our house.  He lugs it all in, refusing all offers of help, <br/>\n&gt; and puts everything in the fridge.<br/>\n&gt;<br/>\n&gt;  Both boys will take out the trash if they&#39;re not already busy when asked, <br/>\n&gt; fight over who opens the carport gate for me, and who &#39;gets&#39; to drag the <br/>\n&gt; trashcan to the curb and back. Dan loves to help me bake, and Andy can <br/>\n&gt; make a variety of easy foods -- frozen pizza, toast, sandwiches.  Just a <br/>\n&gt; few days ago, he brought me a peanutbutter sandwich he&#39;d made just for me, <br/>\n&gt; because he was hungry and thought of me!  Both regularly get their own <br/>\n&gt; breakfast cereal or a glass of milk from the fridge.  Andy also helps Dan <br/>\n&gt; with reading things, figuring out new computer games, setting up shows to <br/>\n&gt; DVR, and so on.<br/>\n&gt;<br/>\n&gt;  My thoughts on it are that because we&#39;ve never required that they *do <br/>\n&gt; their part* they are more willing to help out.  They see that I/we do the <br/>\n&gt; housekeeping because we like things to be neat. I&#39;ve explained that the <br/>\n&gt; more help I get, the sooner it&#39;s done and the sooner I&#39;m free to do <br/>\n&gt; something with them. When I ask for help, I do make an effort to play to <br/>\n&gt; their preferences, to ask only when they&#39;re not busy with something else <br/>\n&gt; and to always be willing to hear &#39;no&#39; to a request to help out.<br/>\n&gt;<br/>\n&gt;  Sylvia<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; __________________________________________________<br/>\n&gt; Do You Yahoo!?<br/>\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a><br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193400039","msgId":27346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmc2t0Nys3bW5nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmc2tuNitvODJwQGVHcm91cHMuY29tPg=="},"prevInTopic":27344,"nextInTopic":27347,"prevInTime":27345,"nextInTime":27347,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"This was in my inbox this morning. I thought it was cute and related to the topic at hand so I wanted to share. It s from the storypeople.com site (I get their","messageBody":"<div id=\"ygrps-yiv-350402637\">This was in my inbox this morning. I thought it was cute and related<br/>\nto the topic at hand so I wanted to share. It&#39;s from the<br/>\nstorypeople.com site (I get their daily &quot;story&quot;):<br/>\n<br/>\n&quot;There are things you do because they feel right & they may make no<br/>\nsense & they may make no money & it may be the real reason we are<br/>\nhere: to love each other & to eat each other&#39;s cooking & say it was good.&quot;<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193399846","msgId":27344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmc2tuNitvODJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2EwMWM4MTcxOCQwZWFiMjQxMCQwMTAwMDAwYUBTd2VlbmV5Pg=="},"prevInTopic":27343,"nextInTopic":27346,"prevInTime":27343,"nextInTime":27345,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"~~. but got pissed and threw them out bc (as I told them) I am not their servant. What are your thoughts or opinions?~~ You asked.:) My first thought is that","messageBody":"<div id=\"ygrps-yiv-65309979\">~~. but got pissed and threw them out bc (as I told<br/>\nthem) I am not their servant.<br/>\n<br/>\nWhat are your thoughts or opinions?~~<br/>\n<br/>\nYou asked.:)<br/>\n<br/>\nMy first thought is that you should have thought about the extra mess<br/>\nand work before you had kids! ;) Having children means accepting a LOT<br/>\nof extra inconvenience, mess and chaos. Expecting them to understand<br/>\nan adult need for order is setting yourself up for some really<br/>\nnegative energy.<br/>\n<br/>\nThrowing out games seems pretty cruel to me. Maybe the kids would have<br/>\nbeen happy to sort them out at a later time. Maybe they wanted to play<br/>\nwith them in a different way, with all the pieces combined. Maybe it<br/>\ndidn&#39;t seem stressful or messy to them at all. Why shouldn&#39;t their way<br/>\nbe honored? Those games could have been thrown into a bin and a choice<br/>\nmade about it later. It could have led to some really fun sorting time<br/>\ntogether...laughter, talking etc...while everyone put them back.<br/>\n<br/>\nIt&#39;s about connections and if you&#39;re feeling like a servant, that will<br/>\nreally short circuit connection time.<br/>\n<br/>\nIn unschooling, the priority is healthy relationships. If that is the<br/>\ngoal, it changes every interaction, every choice. Choosing to make a<br/>\nhappy home, choosing to provide order for the sake of everyone in the<br/>\nfamily is not being a servant. It is service though. The difference is<br/>\nthat a servant has little choice in the matter. You have a choice. <br/>\n<br/>\nChoosing joy and service over resentment will probably lead to more<br/>\nhelp in the long run. It will definitely lead to less stressful<br/>\ninteractions.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193399467","msgId":27343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmc2tiYittcGNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmcnBmbytuaG9vQGVHcm91cHMuY29tPg=="},"prevInTopic":27342,"nextInTopic":27344,"prevInTime":27342,"nextInTime":27344,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"~~I used to expect my husband to help bring in the groceries but he did it snarling and acted put out. ~~ I used to expect it and when he didn t jump up as","messageBody":"<div id=\"ygrps-yiv-414845776\">~~I used to &quot;expect&#39; my husband to help bring in the groceries but he<br/>\ndid it snarling and acted put out. ~~<br/>\n<br/>\nI used to expect it and when he didn&#39;t jump up as soon as I walked in<br/>\nthe door I felt resentful. He didn&#39;t even realize that was a token of<br/>\ncaring in my mind. I thought he was really being a jerk letting me<br/>\ncarry all those groceries in myself.<br/>\n<br/>\nWhen I finally expressed how it felt, he was surprised. When I get<br/>\nhome with groceries now (if he or the kids aren&#39;t with me) I yell out<br/>\n&quot;hey, I could use some help with these groceries&quot; or &quot;Could everyone<br/>\ncome grab a couple bags please?&quot; and it&#39;s amazing how much help I get! <br/>\n<br/>\nI know we can make other choices than resentment. Expectations can get<br/>\nin the way of reality. I&#39;m learning repeatedly, that a joyful, kind<br/>\nperson gets more help than a resentful, grumpy person.:) Smart people<br/>\nthat they are, they learn to avoid a nasty grump.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":90144972,"authorName":"rpindc04","from":"&quot;rpindc04&quot; &lt;robbin_mp@...&gt;","profile":"rpindc04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193398931","msgId":27342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmc2pxaitmczdpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMwMDYzLjMyNTEyLnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":27341,"nextInTopic":27343,"prevInTime":27341,"nextInTime":27343,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I can sympathize, being new at unschooling (2 months). Here is my report, so far. By chance or grace or re-reading some postings, I suddenly *got* the notion","messageBody":"<div id=\"ygrps-yiv-1796815457\">I can sympathize, being new at unschooling (2 months). Here is my <br/>\nreport, so far. By chance or grace or re-reading some postings, I <br/>\nsuddenly *got* the notion of my 10-year old (and only) son needing <br/>\nTLC in this time of de-schooling. And maybe he needs TLC just because <br/>\nhe is my son, and 10 years old, and the world can be awesome for a <br/>\nkid. So, I found I was happy to bring him his lunch, and be with him <br/>\nmore. I am pretty ok with taking his plate to the dishwasher, <br/>\ncleaning his misses in the bathroom, picking up his toys. I still <br/>\nhave a side that says,&quot;Why are you doing this. What about his doing <br/>\nhis own chores?&quot; So, I tell myself, &quot;Let&#39;s see what will happen if I <br/>\ncare for him in this way.&quot;<br/>\n<br/>\nWhat is happening is that he is relaxing more and more, in ways I did <br/>\nnot even know he might need to. His smiles come easier. His <br/>\nappreciation for me and what I do just appear out of nowhere. He <br/>\noccassionally helps out.<br/>\n<br/>\nI think I am seeing a very real display here of how having required-<br/>\nchores makes one feel resentful, burdened, less joyful. I do not feel <br/>\nburdened because these chores I do are done out of my choice. He <br/>\nhelps with a smile on his face now.<br/>\n<br/>\nI was brought up to think that we had to have chores to learn how to <br/>\ndo them. And, we had to have them so we would learn to be responsible <br/>\nhuman beings. Neither of htose arguements is holding water for me now.<br/>\n<br/>\nRe:Feminism. I think the word has gotten a bad rap. In my definition, <br/>\nit is about being able to be a full person, and I happen to be a <br/>\nwoman, so that affects who I am, my fullness. Part of my fullness is <br/>\nthe great privelege of being a mother. I get to define that as I <br/>\ndefine myself. I used to define that, in part, as training my child <br/>\nto pick up, clean, etc. In my moments of wider vision, I came to see <br/>\nthat I was doing that because that is what others did, rather than <br/>\nout of my own clear thought. Now, I am experimenting with this new <br/>\nway, and finding it way preferable. I choose to love him and care for <br/>\nhim by cleaning, even cleaning his messes that I used to make him <br/>\nclean himself. It is an interesting time, feeling what that feels <br/>\nlike, seeing what impact it has on him. So far, so good.<br/>\n<br/>\nI know it must be different with multiple children. I wish you well.<br/>\n<br/>\n<br/>\nRobbin<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, ENSEMBLE S-WAYNFORTH <br/>\n&lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t think this is a feminist issue. I think it is a resentment <br/>\n </span></blockquote>issue. It might feel better to phrase it as instructive to <br/>\ndemonstrate to your own children how women aren&#39;t the servants in a <br/>\nhousehold, but really what you are demonstrating is that cleaning up <br/>\nis a pain in the ass and can only be done under duress. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; At the minute, in my house, the kitchen is fairly clean (it usually <br/>\n </span></blockquote>is) the living room is filled with the ruins of youtube inspired <br/>\ndomino projects and blocks and pocket pets and stuffed animals, one <br/>\nbedroom is completely occluded with toys and another is only <br/>\npartially occluded and the cat box probably needs cleaning. We have <br/>\nbeen incredibly busy lately and last night was the first night in 4 <br/>\nof not having someone sleeping over. There are costumes to plan and <br/>\nto put together for tomorrow&#39;s party and cookies to bake and bread to <br/>\nbe made, I need to get world of warcraft to update on 2 computers so <br/>\nthat people (myself included) can play. And all these more <br/>\ninteresting, more important things conspire to keep cleaning the <br/>\nhouse lower down on the list of things to do. When cleaning the house <br/>\ngets to my breaking point, my I just can&#39;t take stepping on toys <br/>\nanymore point I will clean it. And often cleaning the living room <br/>\nhappens when I&#39;m watching television,<br/>\n<blockquote><span title=\"ireply\"> &gt;  general picking up. Vacuuming is a bigger palaver. <br/>\n&gt; <br/>\n&gt; Anyhow, all of that is to say that I can fully sympathize with a <br/>\n </span></blockquote>messy house. And to set a scene. I can choose to respond to that <br/>\nscene in quite a few different ways. I can choose to ignore it and <br/>\nwait for others to feel the need to clean it, which would probably <br/>\npush me beyond my comfort level and into that itchy, irritable point <br/>\nwhere I just can&#39;t think quite straight and I feel more and more <br/>\nresentful about and aware of the mess. I can freak out and yell <br/>\nand/or lecture about how I didn&#39;t make the mess and can&#39;t people <br/>\nclean up after themselves, and why can&#39;t they at least use one of the <br/>\nmany trash cans I put in a room. I can do what my mom used to do and <br/>\nmake them go sit in a room until it is clean, which usually ended up <br/>\nwith much of my stuff shoved under the bed. All of those might get <br/>\nthe house clean, but are much more likely to make everyone feel angry <br/>\nand sad and hurt and feel like cleaning is a miserable experience <br/>\nthat no one could possibly<br/>\n<blockquote><span title=\"ireply\"> &gt;  want to do. The option that leads to the best outcome, a cleaner <br/>\n </span></blockquote>house and happy folk all round, is where I start cleaning and ask for <br/>\nhelp. Sometimes I get help and sometimes I don&#39;t. I can get really <br/>\ninto cleaning, setting up little toy dioramas for Simon and Linnaea <br/>\nto discover and explore, finding things I forgot existed, and so, <br/>\nprobably, did they. I like seeing what they&#39;ve pulled out of all of <br/>\ntheir toys and see where they&#39;ve been (like your 4 board games that <br/>\nyou threw away--I would rather save them knowing that they had <br/>\nenjoyed them that day, probably they would enjoy them again). And <br/>\nyes, invariable, all of the work I put in will be whittled away until <br/>\nwe are back here with our time defined by the messes we&#39;ve made. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I like to think of my cleaning up as a gift. I like to be able to <br/>\n </span></blockquote>clear the slate for future explorations in rube goldberg machines or <br/>\nartistic endeavors, or dancing without lego pieces getting stuck to <br/>\nthe arch of a foot, or discovering long forgotten toys. Some moments <br/>\nI don&#39;t quite get there. Usually when I am feeling rushed or <br/>\noverwhelmed or tired or pre-menstrual. But it helps me if those <br/>\nmoments become just a tidy and not a full involved clean. If I am <br/>\ncleaning for company, I can close bedroom doors and just make the <br/>\npublic space as clean as my sense of hospitality requires. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; One of the other things you could do is hire someone to come in <br/>\n </span></blockquote>once a week or twice a month and clean. Surely the amount of money <br/>\nthat you spend on a maid service would be worth the peace of mind <br/>\nthat you have and worth your children&#39;s peace. You have young <br/>\nchildren, it seems really unfair to expect them to clean up after <br/>\nthemselves. Much better to hire someone to do the work for all of <br/>\nyou. And then you can focus on the things you find more joyful in <br/>\nlife.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Schuyler<br/>\n&gt; www.waynforth.blogspot.com<br/>\n&gt; <br/>\n&gt; -----------------<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I&#39;m 100% unschooling when it comes to learning &quot;academics&quot; in its <br/>\n </span></blockquote>variety of <br/>\n<blockquote><span title=\"ireply\"> &gt; forms in everyday life.   The feminist in me struggles with aspects <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling like chores.  My mom was the type who did everything <br/>\n </span></blockquote>for my dad <br/>\n<blockquote><span title=\"ireply\"> &gt; and my brother and I.  As I got older I hated seeing her being <br/>\n </span></blockquote>treated as a <br/>\n<blockquote><span title=\"ireply\"> &gt; traditional housewife, who kept the house and catered to everyone <br/>\n </span></blockquote>in it, <br/>\n<blockquote><span title=\"ireply\"> &gt; simply bc she was a woman.   I don&#39;t want my girls to think they <br/>\n </span></blockquote>will be <br/>\n<blockquote><span title=\"ireply\"> &gt; expected to clean and cook and do all the chores for their <br/>\n </span></blockquote>household and I <br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t want my son to expect that role from his wife should he <br/>\n </span></blockquote>decide to <br/>\n<blockquote><span title=\"ireply\"> &gt; marry.<br/>\n&gt; <br/>\n&gt; For me personally, I don&#39;t have the energy, desire or time to clean <br/>\n </span></blockquote>up after <br/>\n<blockquote><span title=\"ireply\"> &gt; everyone (I have 4 kids btw ages 8, 6, 4 and 17 months, so I am <br/>\n </span></blockquote>wiped out <br/>\n<blockquote><span title=\"ireply\"> &gt; anyway!).  I get resentful when I clean a room only to have it get <br/>\n </span></blockquote>messed up <br/>\n<blockquote><span title=\"ireply\"> &gt; and left that way.  I&#39;m fine with the mess, but not with cleaning <br/>\n </span></blockquote>it up if I <br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t make it.  I don&#39;t expect anyone to pick up my dirty clothes, <br/>\n </span></blockquote>or my <br/>\n<blockquote><span title=\"ireply\"> &gt; mess in the kitchen after cooking, why should I be expected to do <br/>\n </span></blockquote>all the <br/>\n<blockquote><span title=\"ireply\"> &gt; chores, especially their messes?  Shouldn&#39;t everyone chip in while <br/>\n </span></blockquote>in a <br/>\n<blockquote><span title=\"ireply\"> &gt; communal environment (as all houses are)?  I&#39;m not a neat freak, I <br/>\n </span></blockquote>don&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; mind clutter or dirty bathrooms - I just resent it when I am <br/>\n </span></blockquote>expected to do <br/>\n<blockquote><span title=\"ireply\"> &gt; all the chores over and over.  I once threw away 4 or 5 board games <br/>\n </span></blockquote>bc they <br/>\n<blockquote><span title=\"ireply\"> &gt; were left out for days, pieces all over the place - I didn&#39;t want <br/>\n </span></blockquote>to burden <br/>\n<blockquote><span title=\"ireply\"> &gt; the kids with cleaning . . . but got pissed and threw them out bc <br/>\n </span></blockquote>(as I told <br/>\n<blockquote><span title=\"qreply\"> &gt; them) I am not their servant.<br/>\n&gt; <br/>\n&gt; What are your thoughts or opinions? <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] the feminist in me","postDate":"1193387506","msgId":27340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwMDYzLjMyNTEyLnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":27339,"nextInTopic":27341,"prevInTime":27339,"nextInTime":27341,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I don t think this is a feminist issue. I think it is a resentment issue. It might feel better to phrase it as instructive to demonstrate to your own children","messageBody":"<div id=\"ygrps-yiv-471575203\">I don&#39;t think this is a feminist issue. I think it is a resentment issue. It might feel better to phrase it as instructive to demonstrate to your own children how women aren&#39;t the servants in a household, but really what you are demonstrating is that cleaning up is a pain in the ass and can only be done under duress. <br/>\n<br/>\nAt the minute, in my house, the kitchen is fairly clean (it usually is) the living room is filled with the ruins of youtube inspired domino projects and blocks and pocket pets and stuffed animals, one bedroom is completely occluded with toys and another is only partially occluded and the cat box probably needs cleaning. We have been incredibly busy lately and last night was the first night in 4 of not having someone sleeping over. There are costumes to plan and to put together for tomorrow&#39;s party and cookies to bake and bread to be made, I need to get world of warcraft to update on 2 computers so that people (myself included) can play. And all these more interesting, more important things conspire to keep cleaning the house lower down on the list of things to do. When cleaning the house gets to my breaking point, my I just can&#39;t take stepping on toys anymore point I will clean it. And often cleaning the living room happens when I&#39;m watching television,<br/>\n general picking up. Vacuuming is a bigger palaver. <br/>\n<br/>\nAnyhow, all of that is to say that I can fully sympathize with a messy house. And to set a scene. I can choose to respond to that scene in quite a few different ways. I can choose to ignore it and wait for others to feel the need to clean it, which would probably push me beyond my comfort level and into that itchy, irritable point where I just can&#39;t think quite straight and I feel more and more resentful about and aware of the mess. I can freak out and yell and/or lecture about how I didn&#39;t make the mess and can&#39;t people clean up after themselves, and why can&#39;t they at least use one of the many trash cans I put in a room. I can do what my mom used to do and make them go sit in a room until it is clean, which usually ended up with much of my stuff shoved under the bed. All of those might get the house clean, but are much more likely to make everyone feel angry and sad and hurt and feel like cleaning is a miserable experience that no one could possibly<br/>\n want to do. The option that leads to the best outcome, a cleaner house and happy folk all round, is where I start cleaning and ask for help. Sometimes I get help and sometimes I don&#39;t. I can get really into cleaning, setting up little toy dioramas for Simon and Linnaea to discover and explore, finding things I forgot existed, and so, probably, did they. I like seeing what they&#39;ve pulled out of all of their toys and see where they&#39;ve been (like your 4 board games that you threw away--I would rather save them knowing that they had enjoyed them that day, probably they would enjoy them again). And yes, invariable, all of the work I put in will be whittled away until we are back here with our time defined by the messes we&#39;ve made. <br/>\n<br/>\nI like to think of my cleaning up as a gift. I like to be able to clear the slate for future explorations in rube goldberg machines or artistic endeavors, or dancing without lego pieces getting stuck to the arch of a foot, or discovering long forgotten toys. Some moments I don&#39;t quite get there. Usually when I am feeling rushed or overwhelmed or tired or pre-menstrual. But it helps me if those moments become just a tidy and not a full involved clean. If I am cleaning for company, I can close bedroom doors and just make the public space as clean as my sense of hospitality requires. <br/>\n<br/>\nOne of the other things you could do is hire someone to come in once a week or twice a month and clean. Surely the amount of money that you spend on a maid service would be worth the peace of mind that you have and worth your children&#39;s peace. You have young children, it seems really unfair to expect them to clean up after themselves. Much better to hire someone to do the work for all of you. And then you can focus on the things you find more joyful in life.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n-----------------<br/>\n<br/>\n<br/>\nI&#39;m 100% unschooling when it comes to learning &quot;academics&quot; in its variety of <br/>\nforms in everyday life.   The feminist in me struggles with aspects of <br/>\nunschooling like chores.  My mom was the type who did everything for my dad <br/>\nand my brother and I.  As I got older I hated seeing her being treated as a <br/>\ntraditional housewife, who kept the house and catered to everyone in it, <br/>\nsimply bc she was a woman.   I don&#39;t want my girls to think they will be <br/>\nexpected to clean and cook and do all the chores for their household and I <br/>\ndon&#39;t want my son to expect that role from his wife should he decide to <br/>\nmarry.<br/>\n<br/>\nFor me personally, I don&#39;t have the energy, desire or time to clean up after <br/>\neveryone (I have 4 kids btw ages 8, 6, 4 and 17 months, so I am wiped out <br/>\nanyway!).  I get resentful when I clean a room only to have it get messed up <br/>\nand left that way.  I&#39;m fine with the mess, but not with cleaning it up if I <br/>\ndidn&#39;t make it.  I don&#39;t expect anyone to pick up my dirty clothes, or my <br/>\nmess in the kitchen after cooking, why should I be expected to do all the <br/>\nchores, especially their messes?  Shouldn&#39;t everyone chip in while in a <br/>\ncommunal environment (as all houses are)?  I&#39;m not a neat freak, I don&#39;t <br/>\nmind clutter or dirty bathrooms - I just resent it when I am expected to do <br/>\nall the chores over and over.  I once threw away 4 or 5 board games bc they <br/>\nwere left out for days, pieces all over the place - I didn&#39;t want to burden <br/>\nthe kids with cleaning . . . but got pissed and threw them out bc (as I told <br/>\nthem) I am not their servant.<br/>\n<br/>\nWhat are your thoughts or opinions? <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] the feminist in me","postDate":"1193379400","msgId":27339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4ODE5My45NTk4MC5xbUB3ZWI1MzgwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDAwM2EwMWM4MTcxOCQwZWFiMjQxMCQwMTAwMDAwYUBTd2VlbmV5Pg=="},"prevInTopic":27338,"nextInTopic":27340,"prevInTime":27338,"nextInTime":27340,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I don t expect anyone to pick up my dirty clothes, or my mess in the kitchen after cooking, why should I be expected to do all the chores, especially their","messageBody":"<div id=\"ygrps-yiv-122381524\">I don&#39;t expect anyone to pick up my dirty clothes, or my mess in the kitchen after cooking, why should I be expected to do all the chores, especially their messes?<br/>\n   <br/>\n  *****<br/>\n  Do they expect you to clean up their messes, or is that it just doesn&#39;t occur to them to do it?  Would they care if the house was left messy all the time? <br/>\n   <br/>\n  *****<br/>\n  Shouldn&#39;t everyone chip in while in a communal environment (as all houses are)? I&#39;m not a neat freak, I don&#39;t mind clutter or dirty bathrooms - I just resent it when I am expected to do all the chores over and over.<br/>\n   <br/>\n  ****<br/>\n  It sounds to me like you&#39;re the one expecting that someone -- preferably those who make a mess -- should anticipate that it will need to be cleaned up.  If it&#39;s simply that you are the one who likes it clean, then of course you&#39;re the one motivated to do the cleaning.  At their ages, likely the mess doesn&#39;t bother them -- if they even see it.<br/>\n   <br/>\n  *****<br/>\n  I once threw away 4 or 5 board games bc they were left out for days, pieces all over the place - I didn&#39;t want to burden the kids with cleaning . . . but got pissed and threw them out bc (as I told them) I am not their servant.<br/>\n   <br/>\n  *****<br/>\n  Have they told you they expect you to be their servant, or is that a feeling you&#39;ve overlaid on the situation?  Do they really leave all the work to you, or does it just feel that way?  Do you ask for their help before you&#39;re angry about it?  Do they see any joy from you in doing the housework, even just joy in having it clean?  Or is it all made to look like so much drudgery?<br/>\n   <br/>\n  I&#39;ve recently looked -- again -- at answers to the chores question, in the course of a discussion with my mil.  Here&#39;s what I come up with for myself -- I knew when I chose to have kids (I have three total, two still at home) that they&#39;d create messes, and dirty up dishes and clothes, and track in mud/sand and throw shoes about.  That&#39;s just part of what kids do.  It&#39;s part and parcel of having kids in my life.  I don&#39;t really mind the extra work -- most of the time.   Also, it helps to see that my kids do help out.  No, it seldom occurs to them to wash the dishes, tho Andy (11) always brings his dishes to the sink.  Andy will put his clothes away after I fold them, and always puts his clothes in the hamper.  Not because we ask him to, but because that level of organization is part of his personality.  So is having his legos scattered in a somewhat controlled pile on his bedroom floor.&lt;g&gt;  <br/>\n   <br/>\n  Dan (6) loves to dump his legos -- tho he does always ask first -- take the cushions off the couch, mess up my bed anytime I make it, and almost never returns dishes to the kitchen.  He also loves to scrub the bathtub and shower, mops the kitchen floor, and wash windows, mirrors and walls.  Not necessarily as well as I&#39;d do them, but he loves to do it.  He insists on emptying the cooler on Thurs morning when milk, eggs, etc, are delivered to our house.  He lugs it all in, refusing all offers of help, and puts everything in the fridge. <br/>\n   <br/>\n  Both boys will take out the trash if they&#39;re not already busy when asked, fight over who opens the carport gate for me, and who &#39;gets&#39; to drag the trashcan to the curb and back. Dan loves to help me bake, and Andy can make a variety of easy foods -- frozen pizza, toast, sandwiches.  Just a few days ago, he brought me a peanutbutter sandwich he&#39;d made just for me, because he was hungry and thought of me!  Both regularly get their own breakfast cereal or a glass of milk from the fridge.  Andy also helps Dan with reading things, figuring out new computer games, setting up shows to DVR, and so on. <br/>\n   <br/>\n  My thoughts on it are that because we&#39;ve never required that they *do their part* they are more willing to help out.  They see that I/we do the housekeeping because we like things to be neat. I&#39;ve explained that the more help I get, the sooner it&#39;s done and the sooner I&#39;m free to do something with them. When I ask for help, I do make an effort to play to their preferences, to ask only when they&#39;re not busy with something else and to always be willing to hear &#39;no&#39; to a request to help out.  <br/>\n<br/>\n  Sylvia<br/>\n  <br/>\n <br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247991183,"authorName":"Kim Johnstone","from":"&quot;Kim Johnstone&quot; &lt;kim.johnstone@...&gt;","profile":"kimpr0bable","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193374307","msgId":27341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmcnJwMys0aGltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZmcnBmbytuaG9vQGVHcm91cHMuY29tPg=="},"prevInTopic":27340,"nextInTopic":27342,"prevInTime":27340,"nextInTime":27342,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... How do you suggest going about doing housework as a family in some sort of organized fashion? In September, when we began homeschooling in a","messageBody":"<div id=\"ygrps-yiv-1273104794\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;wisdomalways5&quot;<br/>\n&lt;wisdom1133@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I notice that before you give chores kids LOVE to help out and then <br/>\n&gt; with chores they only want to do the minimal amount of work and you <br/>\n&gt; have to fight to get it done. We call if &quot;age&quot; but maybe it is just <br/>\n&gt; because it is no longer a choice but a chore<br/>\n<br/>\n<br/>\n </span></blockquote>How do you suggest going about doing housework as a family in some<br/>\nsort of organized fashion? <br/>\n<br/>\nIn September, when we began homeschooling in a semi-structured<br/>\neclectic sort of way, we had a morning routine (eat breakfast, make<br/>\nbeds, do a rotating chore, reading time, etc.) but since we&#39;ve begun<br/>\nmaking the switch to unschooling we dropped the routine. The housework<br/>\nhas suffered incredibly. I don&#39;t have the standard of wanting<br/>\nsparkling floors but I would really enjoy it if our home was less of a<br/>\ndisaster zone so we could more freely do projects and make meals!<br/>\n<br/>\nSo, do I start up my own routines and wait for my kids (2 years and 7<br/>\nyears) to follow along as they&#39;re ready? Or do we set up job lists<br/>\nwith the older child&#39;s input? I feel we need some sort of system in<br/>\nplace just to make sure the daily things get done and work doesn&#39;t<br/>\npile up.<br/>\n<br/>\nKim (who really enjoys reading all the thought-provoking threads on<br/>\nthis list!)</div>","specialLinks":[]},{"userId":295439124,"authorName":"wisdomalways5","from":"&quot;wisdomalways5&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the feminist in me","postDate":"1193371960","msgId":27338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmcnBmbytuaG9vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2EwMWM4MTcxOCQwZWFiMjQxMCQwMTAwMDAwYUBTd2VlbmV5Pg=="},"prevInTopic":27337,"nextInTopic":27339,"prevInTime":27337,"nextInTime":27339,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"... variety of ... aspects of ... for my dad ... treated as a ... in it, ... Growing up why did you not help your mom? did you have ANY required chores? Did","messageBody":"<div id=\"ygrps-yiv-694986543\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Nittany Lion <br/>\n&lt;dsweeney@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m 100% unschooling when it comes to learning &quot;academics&quot; in its <br/>\n </span></blockquote>variety of <br/>\n<blockquote><span title=\"ireply\"> &gt; forms in everyday life.   The feminist in me struggles with <br/>\n </span></blockquote>aspects of <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling like chores.  My mom was the type who did everything <br/>\n </span></blockquote>for my dad <br/>\n<blockquote><span title=\"ireply\"> &gt; and my brother and I.  As I got older I hated seeing her being <br/>\n </span></blockquote>treated as a <br/>\n<blockquote><span title=\"ireply\"> &gt; traditional housewife, who kept the house and catered to everyone <br/>\n </span></blockquote>in it, <br/>\n<blockquote><span title=\"ireply\"> &gt; simply bc she was a woman. <br/>\n<br/>\n </span></blockquote>Growing up why did you not &quot;help&quot; your mom? did you have ANY <br/>\nrequired chores? Did you want to help and she not let you or did you <br/>\nfeel it was not your job<br/>\n<br/>\n<br/>\n<br/>\n  I don&#39;t want my girls to think they will be <br/>\n<blockquote><span title=\"ireply\"> &gt; expected to clean and cook and do all the chores for their <br/>\n </span></blockquote>household and I <br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t want my son to expect that role from his wife should he <br/>\n </span></blockquote>decide to <br/>\n<blockquote><span title=\"ireply\"> &gt; marry.<br/>\n<br/>\n </span></blockquote>I do not want my slef, husband, boy, or girls to grow up thinking <br/>\nthey &quot;HAVE&quot; to do anything. I want them to do everything because <br/>\nthey choose to not because someone says they &quot;should&quot; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; For me personally, I don&#39;t have the energy, desire or time to <br/>\n </span></blockquote>clean up after <br/>\n<blockquote><span title=\"ireply\"> &gt; everyone (I have 4 kids btw ages 8, 6, 4 and 17 months, so I am <br/>\n </span></blockquote>wiped out <br/>\n<blockquote><span title=\"ireply\"> &gt; anyway!).  I get resentful when I clean a room only to have it get <br/>\n </span></blockquote>messed up <br/>\n<blockquote><span title=\"ireply\"> &gt; and left that way.  I&#39;m fine with the mess, but not with cleaning <br/>\n </span></blockquote>it up if I <br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t make it.  I don&#39;t expect anyone to pick up my dirty <br/>\n </span></blockquote>clothes, or my <br/>\n<blockquote><span title=\"ireply\"> &gt; mess in the kitchen after cooking, why should I be expected to do <br/>\n </span></blockquote>all the <br/>\n<blockquote><span title=\"ireply\"> &gt; chores, especially their messes?  Shouldn&#39;t everyone chip in while <br/>\n </span></blockquote>in a <br/>\n<blockquote><span title=\"ireply\"> &gt; communal environment (as all houses are)?  I&#39;m not a neat freak, I <br/>\n </span></blockquote>don&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; mind clutter or dirty bathrooms - I just resent it when I am <br/>\n </span></blockquote>expected to do <br/>\n<blockquote><span title=\"ireply\"> &gt; all the chores over and over. <br/>\n<br/>\n<br/>\n </span></blockquote>I found that the more I took care of messes the more people in turn <br/>\nhelped me.. <br/>\n<br/>\nFor instance my youngest is almost 3 and she was mad and tossed <br/>\nabout 20 movies onthe floor. I took her in my arms and was tlaking <br/>\nabout why hse was upset and my older daughter who is 4.5 said -you <br/>\nhold her mom I will pick them up&quot;--- <br/>\n<br/>\nanother time we were walking out the door and the older one tripped <br/>\nover the lego bucket and they dumped- we were just going to leave it <br/>\nbut the little one said she wanted to clean it up - so we did<br/>\n<br/>\nIf you are not MADE to do &quot;your&quot; part and begrudge your &quot;part&quot; then <br/>\neverybody does what they want to instead of have to.<br/>\n<br/>\nI usually do all the surface cleaning but every so often my husband <br/>\ndeep cleans the kitchen or bathrooms. We each do what we are willing <br/>\nto do. <br/>\n<br/>\nI used to &quot;expect&#39; my husband to help bring in the groceries but he <br/>\ndid it snarling and acted put out. I realized that this was an <br/>\nexpectation I had but he did not and so I told him that I would <br/>\nbring in the bags and if he felt like helping he could but it was <br/>\nnot a have to. For a few months he did not help and I did not ask <br/>\nnor did I act like &quot;I&quot; was put out or pissed off that he was not <br/>\nhelping. Then he started asking how many bags there were and I would <br/>\nsay how many more trips I thought were left and then he &quot;ask&quot; if I <br/>\nwanted help and I said &quot;if you want to&quot;. now most of the time he <br/>\njust puts on his shoes and comes to help.<br/>\n<br/>\nI notice that before you give chores kids LOVE to help out and then <br/>\nwith chores they only want to do the minimal amount of work and you <br/>\nhave to fight to get it done. We call if &quot;age&quot; but maybe it is just <br/>\nbecause it is no longer a choice but a chore<br/>\n<br/>\nI was raised to NOT leave dishes in the sink- As an adult i leave <br/>\nthe dishes for the day in the sink and on the counter and then MOST <br/>\ndays I do a load but SOME days I wait till the next day. I noticed <br/>\nthat I do not MIND doing dishes as long as I choose WHEN  I want to <br/>\ndo them. I hate doing dishes right after a meal- I want to sit and <br/>\nsettle and after a few hours do dishes.  <br/>\n<br/>\n<br/>\n<br/>\n I once threw away 4 or 5 board games bc they <br/>\n<blockquote><span title=\"ireply\"> &gt; were left out for days, pieces all over the place - I didn&#39;t want <br/>\n </span></blockquote>to burden <br/>\n<blockquote><span title=\"ireply\"> &gt; the kids with cleaning . . . but got pissed and threw them out bc <br/>\n </span></blockquote>(as I told <br/>\n<blockquote><span title=\"ireply\"> &gt; them) I am not their servant.<br/>\n<br/>\n </span></blockquote>No you are not the servant but neither are they. If they see what a <br/>\npain it is for you to clean up why would they want to do something <br/>\nthat you obviously hate to do. <br/>\n<br/>\nYou made a choice to NOT clean out the games and then punished them <br/>\nfor your choice. I would have dumped them all in a bucket until <br/>\nsomebody - maybe you- maybe them- maybe grandma- choose to sort <br/>\nthem. <br/>\n<br/>\nYou are thinking in terms of expectations but maybe it is about <br/>\nchoosing- you choose to be mom, you choose where to clean and when <br/>\nto clean or even if you want to clean. At the moment my toliets are <br/>\ngrowing things in the bowl and I and starting to feel the need to <br/>\nclean them (for the record I hate to clean bathrooms) BUT my husband <br/>\nmight get the urge sooner (which I am secretly hoping for) but I am <br/>\nhome in the morning so I think it will get done then.<br/>\n<br/>\n<br/>\ncan you see the difference between thinking you have to and choosing <br/>\nto. I clean up for my kids because the sometimes do not know where <br/>\nto start or what goes where but they like to sweep and vaccumm and <br/>\ndust when the urge hits and sometimes they jsut spontansously clean <br/>\nand organize<br/>\n<br/>\nJulieH</div>","specialLinks":[]},{"userId":258070335,"authorName":"Nittany Lion","from":"Nittany Lion &lt;dsweeney@...&gt;","profile":"dawn_sweeney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"the feminist in me","postDate":"1193324546","msgId":27337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWM4MTcxOCQwZWFiMjQxMCQwMTAwMDAwYUBTd2VlbmV5Pg==","referencesHeader":"PGZmcTlpbCtpYzllQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":27338,"prevInTime":27336,"nextInTime":27338,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"I m 100% unschooling when it comes to learning academics in its variety of forms in everyday life.   The feminist in me struggles with aspects of unschooling","messageBody":"<div id=\"ygrps-yiv-549590004\">I&#39;m 100% unschooling when it comes to learning &quot;academics&quot; in its variety of <br/>\nforms in everyday life.   The feminist in me struggles with aspects of <br/>\nunschooling like chores.  My mom was the type who did everything for my dad <br/>\nand my brother and I.  As I got older I hated seeing her being treated as a <br/>\ntraditional housewife, who kept the house and catered to everyone in it, <br/>\nsimply bc she was a woman.   I don&#39;t want my girls to think they will be <br/>\nexpected to clean and cook and do all the chores for their household and I <br/>\ndon&#39;t want my son to expect that role from his wife should he decide to <br/>\nmarry.<br/>\n<br/>\nFor me personally, I don&#39;t have the energy, desire or time to clean up after <br/>\neveryone (I have 4 kids btw ages 8, 6, 4 and 17 months, so I am wiped out <br/>\nanyway!).  I get resentful when I clean a room only to have it get messed up <br/>\nand left that way.  I&#39;m fine with the mess, but not with cleaning it up if I <br/>\ndidn&#39;t make it.  I don&#39;t expect anyone to pick up my dirty clothes, or my <br/>\nmess in the kitchen after cooking, why should I be expected to do all the <br/>\nchores, especially their messes?  Shouldn&#39;t everyone chip in while in a <br/>\ncommunal environment (as all houses are)?  I&#39;m not a neat freak, I don&#39;t <br/>\nmind clutter or dirty bathrooms - I just resent it when I am expected to do <br/>\nall the chores over and over.  I once threw away 4 or 5 board games bc they <br/>\nwere left out for days, pieces all over the place - I didn&#39;t want to burden <br/>\nthe kids with cleaning . . . but got pissed and threw them out bc (as I told <br/>\nthem) I am not their servant.<br/>\n<br/>\nWhat are your thoughts or opinions?</div>","specialLinks":[]}],"prevTopicId":27520,"nextTopicId":27545}}