{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Bedtimes, Circadian Rhythms, etc","postDate":"1242162531","msgId":40044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDgwMWM5ZDM0NSRlMzkzMzc5MCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PGd1YzRwMys1NGIzQGVHcm91cHMuY29tPg=="},"prevInTopic":40039,"nextInTopic":0,"prevInTime":40043,"nextInTime":40045,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"Amberlee This is something that I have been thinking for a long time, too. Only my eldest daughter was born in the morning. The other four were noon time","messageBody":"<div id=\"ygrps-yiv-307359872\">Amberlee<br/>\n<br/>\nThis is something that I have been thinking for a long time, too. Only my eldest daughter was born in the morning. The other four were noon time children. And I was born in the evening and have been a night owl forever.<br/>\n<br/>\nFrom an astrologers experience I have hundreds of dates of birth and quite a number (very high percentage really) are &#39;morning&#39; births. If so many come together and &#39;agree&#39; on daytime living it is easy to make this the &#39;norm&#39;. <br/>\n<br/>\nThank you for voicing this.<br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa<br/>\nwhere the &#39;early bird&#39; is also considered to be the worm catching variety but the &#39;cats get the sleeping birds&#39; in our house at least. &lt;grin&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Bedtimes, Circadian Rhythms, etc","postDate":"1242143116","msgId":40039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4Mjk1Ni4zMzYwNC5xbUB3ZWI1NDEwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGd1YzRwMys1NGIzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1YzRwMys1NGIzQGVHcm91cHMuY29tPg=="},"prevInTopic":40038,"nextInTopic":40044,"prevInTime":40038,"nextInTime":40040,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"Amberlee, I so agree with you!  My kids have a natural sleep pattern that matches what mine was when I carried them and it matches up to their birth times,","messageBody":"<div id=\"ygrps-yiv-974803550\">Amberlee, I so agree with you!  <br/>\n<br/>\nMy kids have a natural sleep pattern that matches what mine was when I carried them and it matches up to their birth times, too.<br/>\n<br/>\nMy oldest who was born at 7am, has maintained that schedule her whole life until recently, when she accepted midnight shifts.  My 11yo was born at 12 noon by C-section, and that has been his preferred wake up time his whole life.  <br/>\n<br/>\nPeace and laughter!<br/>\nVicki<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: amberlee_b &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amberlee16@...\">amberlee16@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, May 12, 2009 8:31:47 AM<br/>\nSubject: [unschoolingbasics] Re: Bedtimes, Circadian Rhythms, etc<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-When were you born? Not just the date, what time did you finally decide to come into the world? My eldest join us at 3:30pm....my youngest at 4am... I wondered why I was always drawn into staying up till 2am till I recently looked at my birth certificate. I was born at 12:01 am. <br/>\n<br/>\nI really think that this makes a difference. Sure I was public schooled and had to get up at 5 or 6 am everyday.... .but I always hated it. I loved my weekends where I could sleep in and stay up late (or at least as late as allowed...which was 11pm on Saturdays). What about college? For me that meant no 8am classes and I would regularly be up til 2 or 3 am. <br/>\n<br/>\nMy eldest is 13 now and he normally sleeps in till 3ish and is up late. It is rare when he is up early (like today he was up with his father at 7am).<br/>\n<br/>\nI think we are born into a time frame. It is just a guess, but from what I have seen just in our own family it seems right. I have wondered about kids who have a date and time &quot;chosen&quot; for them for the convenience of their families or those who are C-section... ..maybe it evens out for them for when they would have come on their own. Who knows. Either way, I am thankful there are &quot;night people&quot;. Drs, nurses, police officers, people who are needed 24/7, it is nice to realize that they can use their inner body clock to their advantage. :) Not sure any of this helps--but it helped my hubby and I deal with the variety of time clocks under one roof.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Bedtimes, Circadian Rhythms, etc","postDate":"1242142307","msgId":40038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1YzRwMys1NGIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0Mjc5LjMzMjA2LnFtQHdlYjU2MTA3Lm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":40037,"nextInTopic":40039,"prevInTime":40037,"nextInTime":40039,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"-When were you born?  Not just the date, what time did you finally decide to come into the world?  My eldest join us at 3:30pm....my youngest at 4am...  I","messageBody":"<div id=\"ygrps-yiv-1868090027\">-When were you born?  Not just the date, what time did you finally decide to come into the world?  My eldest join us at 3:30pm....my youngest at 4am...  I wondered why I was always drawn into staying up till 2am till I recently looked at my birth certificate.  I was born at 12:01 am.  <br/>\n<br/>\nI really think that this makes a difference.  Sure I was public schooled and had to get up at 5 or 6 am everyday.....but I always hated it.  I loved my weekends where I could sleep in and stay up late (or at least as late as allowed...which was 11pm on Saturdays).  What about college?  For me that meant no 8am classes and I would regularly be up til 2 or 3 am.  <br/>\n<br/>\nMy eldest is 13 now and he normally sleeps in till 3ish and is up late.  It is rare when he is up early (like today he was up with his father at 7am).<br/>\n<br/>\nI think we are born into a time frame.  It is just a guess, but from what I have seen just in our own family it seems right.  I have wondered about kids who have a date and time &quot;chosen&quot; for them for the convenience of their families or those who are C-section.....maybe it evens out for them for when they would have come on their own.  Who knows.  Either way, I am thankful there are &quot;night people&quot;.  Drs, nurses, police officers, people who are needed 24/7, it is nice to realize that they can use their inner body clock to their advantage.  :)  Not sure any of this helps--but it helped my hubby and I deal with the variety of time clocks under one roof.</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Bedtimes, Circadian Rhythms, etc","postDate":"1242138466","msgId":40037,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0NjAyNC40NzYxNS5xbUB3ZWI1NDEwOS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGd1OThzZys1ZDA2QGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OThzZys1ZDA2QGVHcm91cHMuY29tPg=="},"prevInTopic":40020,"nextInTopic":40038,"prevInTime":40036,"nextInTime":40038,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"~~~~snip~~~ In the meantime though, he s still thoroughly convinced that it s healthier to go to bed earlier and we re doing the kids a disservice if we","messageBody":"<div id=\"ygrps-yiv-1827738521\">~~~~snip~~~<br/>\nIn the meantime though, he&#39;s still thoroughly convinced that it&#39;s &quot;healthier to go to bed earlier&quot; and we&#39;re doing the kids a disservice if we allow them to get such late nights. He&#39;s convinced that I&#39;ve &quot;altered their body clock by allowing them to stay up so late&quot; and his solution is to start waking them early, so they&#39;re &quot;tireder earlier at night time&quot;.<br/>\n~~~~snip~~~~<br/>\n<br/>\nThis sounds so much like my spouse&#39;s idea.   He is of the opinion that our 11yo son stays up late because he sleeps in late.  On the days my spouse is home, he makes our son get up when he gets up which can be all over the place, lol.  My spouse seems to forget that his natural rythm is to sleep in late and stay up late.  In fact, he still completely misses the fact that he still tries to live this pattern even though he knows he has to get up before 6am to head to work.  Many a night I will get woken up when my spouse comes to bed after midnight.  I&#39;m always amazed that he continues to do this since he isn&#39;t allowing for himself to get a decent night&#39;s sleep.  This habit causes him to suffer from sleep deprevation which has him falling asleep anytime he sits still for five minutes.  I just smile and gently suggest he relax.  As he&#39;s a firefighter, and they get called out of bed all the time,  his sleep cycles are all messed up.  As a<br/>\n family, we have just learned to accept that dad will fall asleep when he gets off shift and during movies unless he&#39;s just woken up.<br/>\n<br/>\nEveryone in the house knows I have suffered from sleep deprivation, too.  (Job related.)  Currently, I work dayshift, so I must get up in the morning.  As a family, everyone has decided to help me out by just calming the house down after 10pm so I can go to bed and sleep.  My 19yo is now working midnight shifts so her sleep schedule has her sleeping late everyday.  I take care of the dogs and parrots before I leave for work so they don&#39;t go off and disturb her sleep.  My 11yo, sleeps when he wants and gets up when he wants.  (So does grandma, too.)  He tends to get up around 11 or 12, then he reads for a bit.  By the time I get home from work, the house is in full swing activity and that&#39;s when we spend the majority of family time.  This crazy schedule is just where life is at and it works.<br/>\n<br/>\nI&#39;ve noticed that my son is so much healthier and well rested then he ever was for the few years I had to force him to wake up for school.  I&#39;ve known many parents who force a bedtime regardless of when the child actually will sleep and the only thing I&#39;ve seen come out of that is resentment.  My 10yo nephew was just telling me this past weekend, that he just lays in bed in the dark and waits till 10pm to come.  His dad makes him go to bed at 8pm with lights out.  No books, radio, or anything else is allowed.  What a waste of two hours! <br/>\n<br/>\nVicki<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Bedtimes, Circadian Rhythms, etc","postDate":"1242052504","msgId":40020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMDkwNTExMDczNW8xZDk5YjMzN3k2NDgwMTFmMTJkOGVlNDk4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGd1OThzZys1ZDA2QGVHcm91cHMuY29tPg==","referencesHeader":"PGd1N3E0dCttanQyQGVHcm91cHMuY29tPiA8Z3U5OHNnKzVkMDZAZUdyb3Vwcy5jb20+"},"prevInTopic":40018,"nextInTopic":40037,"prevInTime":40019,"nextInTime":40021,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"... Marina ... -- Life is always happening [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-208196512\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; natural &quot;rhythum&quot; or not...well, its what you have.  Unless your spouse is<br/>\n&gt; advocating a return to rural living and becoming luddites you need to live<br/>\n&gt; in the moment.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n&gt; Sounds as though spending time cuddling alone in bed just the two of you<br/>\n&gt; might change his perspective.  His need for reassurance that the kids<br/>\n&gt; won&#39;t implode or burn the house down or take a two am jog might also be<br/>\n&gt; something unspoken.  Can the kids themselves figure out how to discuss or<br/>\n&gt; defend &quot;their position&quot; on bedtime?  Might be the reassurance dad needs<br/>\n&gt; everything is okay.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Marina<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nLife is always happening<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtimes, Circadian Rhythms, etc","postDate":"1242049186","msgId":40017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0Mjc5LjMzMjA2LnFtQHdlYjU2MTA3Lm1haWwucmUzLnlhaG9vLmNvbT4=","inReplyToHeader":"PGd1Nmc0dStydWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":40014,"nextInTopic":40018,"prevInTime":40016,"nextInTime":40018,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"Karen,    I m going to speak frankly here!  I say bull_ _ _ _! no offense really.  I hear what your husband is saying and I understand the bio-rhythms. ","messageBody":"<div id=\"ygrps-yiv-1118078785\">Karen,<br/>\n   I&#39;m going to speak frankly here!  I say bull_ _ _ _! no offense really.  I hear what your husband is saying and I understand the bio-rhythms.  However, I personally feel like I am a night person.  I like getting up in the morning but I prefer my morning to be 8ish not 6 or earlier when I notice the sun coming up. Even though lately I have been going to bed by 11 and getting up mostly around 6:30 to get my son up for school (yeah yucky old school).  Anyway what I am hearing louder than anything is that your husband need some attention--period.  My suggestion (for what its&#39; worth). Is to allow the children the children their choice to go to bed.  Than take that time to listen really listen, talk, snuggle etc with your husband.  I don&#39;t think taking the laptop to bed is going to be a grand idea.  I think the more your husband feels &#39;neglected&#39; the more he will begin insisting on earlier bed times and it will become a daily fight and<br/>\n frustration for everyone.  I think even if you did this at least 3 times a week he would be much more peaceful about what you would like to implement. <br/>\nLast year when we were all home I allowed my kids to stay up with me and share my bed even.  Most night we would watch a movie or two and eventually fall asleep around 12 and get up around 9.  when Ian decided to go back to school I had to kind of enforce a bed time -- which consisted of all of settling down around 8 to 9 watch some tv and Ian normally falls asleep all by his self  about 9:30.  than my youngest son stays up til 10 or 11 ish with me or sometimes goes to bed all by his self.  ( he also gets a nap during the day  which I try to also do peacefully by just chillin&#39; out watching tv and he usually snoozes off within minutes -- trick is getting him to just sit down.  one day I needed a shower so asked him to come in and watch dora while I showered -- by the time I came out of shower he was zonked)  ...  My kids will also go to sleep on thier own , or sometimes I have to turn the tv off because it isn&#39;t help them fall asleep.  <br/>\n<br/>\nOkay so in short I think that everyone has their own circadian rhythem and perhaps in the past it would be with the sunrise and sunset -- but I feel most of us go to sleep and wake up by our own &#39;rhythem&#39; of habit or work.  there is my thoughts hope it helps if not disregard&gt; smiles_<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sun, 5/10/09, Karen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gktbdm@...\">gktbdm@...</a>&gt; wrote:<br/>\nFrom: Karen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gktbdm@...\">gktbdm@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Bedtimes, Circadian Rhythms, etc<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Sunday, May 10, 2009, 8:09 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            <br/>\n            <br/>\n<br/>\n<br/>\n      <br/>\n      I know, same old, same old.  This question gets raised time after time on here, and on other message boards.  It&#39;s obviously for good reason though - it&#39;s an issue that is an &quot;issue&quot; for many families!<br/>\n<br/>\n<br/>\n<br/>\nHere&#39;s where we&#39;re at with it at the moment:<br/>\n<br/>\nOur kids used to have bedtimes. For the older two, we dropped them a couple of years back (they&#39;re now 12 & 15), but the younger two are still told (when my husband&#39;s home - wicked grin) that it&#39;s &quot;bedtime&quot;.  It&#39;s not at an arbitrary time, persay, but rather when things are winding down (usually after a TV show is finished, or whatever).  They sometimes resist, and they sometimes just draaaaaag their feet, and they&#39;re sometimes OK. The general routine is to have a drink, do their teeth, then go to their room for storytime with me (which they love).  My DH does get upset with them if they come out of their room after that, but he&#39;s now able to accept that it&#39;s ok if they&#39;re doing something quiet in their room (so long as they stay there!!!).<br/>\n<br/>\n<br/>\n<br/>\nWe have many discussions about this. I guess my ideal would be to create (as best as possible) a calm, quiet-ish atmostphere that inspires sleep, offer myself to them (the younger two, aged 6 & 9) to read stories etc but then accept that on some nights they&#39;re going to want to get back up to do something, just because they want to, or because they&#39;re not tired.  I think that so long as they&#39;re quiet and respecting the fact that others (usually their Dad and/or their older brothers) it should be ok.<br/>\n<br/>\n<br/>\n<br/>\nBUT, the problem is: my husband is convinced (and is trying to convince me) that it&#39;s not NATURAL to stay up late; that our bodies are designed to sleep when it&#39;s dark, and that it&#39;s modern technology that interferes with that natural process (eg, staying up on computers etc stimulates our brain to artificially keep us awake).  He is convinced by the studies that indicate that the most important hours of sleep (for hormones, biorhythms, etc) are the two hours before midnight.  He&#39;s convinced that it&#39;s healthier to get up earlier (kind of with the sun) because our bodies are designed to be stimulated by sunshine; it releases hormones in our bodies etc.<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m probably not doing a very good job of explaining the rationale behind his views, but needless to say, we have some heated debate about it!  I can understand the general wisdom behind the idea of sleeping in accordance with nature (loosely), but the reality is that we do live in a modern society with electricity etc.  <br/>\n<br/>\n<br/>\n<br/>\nAnd I do want my kids to be free, so long as there&#39;s mutual respect.  I like the idea of them not being &quot;told&quot; it&#39;s &quot;time for bed&quot;, but rather helping them to learn to listen to their bodies and respond accordingly, rather than resisting bedtime just because no one likes to be told what to do!<br/>\n<br/>\n<br/>\n<br/>\nHow do we find a solution that respects both viewpoints?<br/>\n<br/>\n<br/>\n<br/>\nOh, another reason why he likes them to get to bed early enough so that we can have some time together at the end of the day (he&#39;s naturally an early to bed person, and often has to leave at 6am for work the next day) is so that we can hop in bed together, chat about the day, debrief about parenting stuff, etc.  The habit we&#39;ve developed, though, is that I spend time with the younger kids doing their nighttime routine, my husband vegges out in front of the TV then goes to bed, and I stay up late on the computer to do all my unschooling reading etc.  Not great for the marriage, hey.  (Oh, and the younger 2 are often the last kids to bed and the first ones up - they seem to get up earlier than is probably wise, perhaps because of the stimulation of the daylight?)<br/>\n<br/>\n<br/>\n<br/>\nWhat he&#39;s requesting is that the kids are in bed by about 9, we do some tidying up or TV etc, then we go to bed about 10.30, chat etc (he&#39;s even happy if I bring the laptop to bed to do my online reading). He just wants us to be together.  Personally, I think that can probably happen with the kids going to bed even at the same time as us! I can certainly change my part of the situation by taking the laptop to bed rather than being at the other end of the house, but I&#39;m still not fully convinced the kids should have to be in bed an hour or two before us.  I just can&#39;t get past the &quot;studies&quot; etc.<br/>\n<br/>\n<br/>\n<br/>\nKaryn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Bedtimes, Circadian Rhythms, etc","postDate":"1242048208","msgId":40018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OThzZys1ZDA2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1N3E0dCttanQyQGVHcm91cHMuY29tPg=="},"prevInTopic":40017,"nextInTopic":40020,"prevInTime":40017,"nextInTime":40019,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"... Thanks for all the advice so far.  My question, though, (one of many) remains: I find it hard to see how focussing on meeting DHs needs (as good as that","messageBody":"<div id=\"ygrps-yiv-2042529472\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;meredith@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My 7yo stays up later than George and I many nights. You can have your evening routine, read to the kids, then go to bed. Shut the door if you want some privacy, but make sure the kids are set up with whatever they might need first.<br/>\n&gt; <br/>\n&gt; &gt; How do we find a solution that respects both viewpoints?<br/>\n&gt; <br/>\n&gt; Look for other ways to help your husband meet his needs - need for time with you, quiet time, maybe a need for a little more orderliness around the house. The ideas about &quot;what the kids need&quot; are in conflict - and it may not be possible to resolve that ideological conflict directly. But you don&#39;t have to resolve *that* particular conflict, really. Eventually, time will do that for you. Right now what you&#39;re looking for is a way to help your family be a little more peaceful. Finding ways to meet your dh&#39;s needs will help that.<br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 7, Ray 15)<br/>\n&gt;<br/>\n </span></blockquote>Thanks for all the advice so far.  My question, though, (one of many) remains: I find it hard to see how focussing on meeting DHs needs (as good as that is) can be done in isolation, without also addressing the kid issue.  He&#39;s not comfortable leaving them up out of bed if we&#39;re in bed.  The best I think I can hope for right now is for us all to go to bed about a similar time.  I&#39;m willing to give up my late night alone time, and go to bed at the same time as DH, and I&#39;m hoping that he might be so delighted about that (long story LOL!) that he&#39;ll cope with the idea of the kids possibly staying up until we&#39;re ready for bed ourselves.  I know there&#39;s still a control element there, but I also know I have to be patient while my DH takes baby steps towards a &quot;better way&quot;.<br/>\n<br/>\nIn the meantime though, he&#39;s still thoroughly convinced that it&#39;s &quot;healthier to go to bed earlier&quot; and we&#39;re doing the kids a disservice if we allow them to get such late nights.  He&#39;s convinced that I&#39;ve &quot;altered their body clock by allowing them to stay up so late&quot; and his solution is to start waking them early, so they&#39;re &quot;tireder earlier at night time&quot;.<br/>\n<br/>\nI still feel uncomfortable with the idea of controlling their basic bodily functions and think that provided everyone is mutually respectful, they should be free to go to bed when they&#39;re tired, and get up when they&#39;re no longer tired.<br/>\n<br/>\nKaryn</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Bedtimes, Circadian Rhythms, etc","postDate":"1242000349","msgId":40014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1N3E0dCttanQyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1Nmc0dStydWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":40004,"nextInTopic":40017,"prevInTime":40013,"nextInTime":40015,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"... *********************** I ve lived in communes with minimal electricity in the middle of nowhere. Some people are night owls. Most people like to stay up","messageBody":"<div id=\"ygrps-yiv-1981092017\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen&quot; &lt;gktbdm@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; BUT, the problem is: my husband is convinced (and is trying to convince me) that it&#39;s not NATURAL to stay up late; that our bodies are designed to sleep when it&#39;s dark, and that it&#39;s modern technology that interferes with that natural process<br/>\n </span></blockquote>***********************<br/>\n<br/>\nI&#39;ve lived in communes with minimal electricity in the middle of nowhere. Some people are night owls. Most people like to stay up late at least once in awhile. If you had no lights (etc) at all, I bet there are times your kids would still be up later, just hanging out. I&#39;ve seen it happen with real people, kids and adults, sitting around watching the stars, talking and playing music, maybe by firelight, but sometimes just in the dark. Everyone in my family, even now, goes through phases of being up late in the night, and phases of going to bed early - and although we have tvs and computers, we live in the country with no streetlights, not even a &quot;security light&quot; for our house. We know the phase of the moon better than the day of the week, sometimes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He just wants us to be together.  Personally, I think that can probably happen with the kids going to bed even at the same time as us!<br/>\n </span></blockquote>**************************<br/>\n<br/>\nIt can even happen with them going to be Later than you. My 7yo stays up later than George and I many nights. You can have your evening routine, read to the kids, then go to bed. Shut the door if you want some privacy, but make sure the kids are set up with whatever they might need first.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do we find a solution that respects both viewpoints?<br/>\n<br/>\n </span></blockquote>Look for other ways to help your husband meet his needs - need for time with you, quiet time, maybe a need for a little more orderliness around the house. The ideas about &quot;what the kids need&quot; are in conflict - and it may not be possible to resolve that ideological conflict directly. But you don&#39;t have to resolve *that* particular conflict, really. Eventually, time will do that for you. Right now what you&#39;re looking for is a way to help your family be a little more peaceful. Finding ways to meet your dh&#39;s needs will help that.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Bedtimes, Circadian Rhythms, etc","postDate":"1241963125","msgId":40002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1NmxwbCttdHRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1Nmc0dStydWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":39999,"nextInTopic":40004,"prevInTime":40001,"nextInTime":40003,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"We have 4 kids as well.  My youngest is 4 and we have a 5, 6 and 7 year old.  I put the two youngest to bed kind of like you... when things are winding down","messageBody":"<div id=\"ygrps-yiv-1954223664\">We have 4 kids as well.  My youngest is 4 and we have a 5, 6 and 7 year old.  I put the two youngest to bed kind of like you... when things are winding down and they are getting tired.  Most of the time it all goes very smoothly and because they are tired they dont complain.  My 6 and 7 year olds usually tell me when they want to go to bed.  <br/>\nMost nights I put the younger two to bed.  Do a few things around the house and about 9 let my older two know I am going ot my room.  I ask if they want to go to bed before I do.  They like me to read to them, so often they will come up then and I read to them.  If they want to stay up later they are welcome to, but honestly, usually after that they go to bed.  Since, I dont tell them they have to, they are fine. <br/>\nThe only thing is, if I am in my room watching t.v. or on the computer, I will get back up and tuck them in. But if I am asleep they need to get their Dad too.  They are welcome to do quiet things as long as they want.  Usually, though, when i let them know I am going to bed, they head for bed too.  They like me to tuck them in for some reason.<br/>\nI am slowly moving to this pattern for my younger two as well.  But they are not quite independent enough at this point to be up after I am in bed.</div>","specialLinks":[]},{"userId":1191428,"authorName":"Robin Krest","from":"&quot;Robin Krest&quot; &lt;rlkrest@...&gt;","profile":"nibormij","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtimes, Circadian Rhythms, etc","postDate":"1241962138","msgId":40004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDkwNTEwLjA5Mjg1OC4xNTc0OC4wQHdlYm1haWwwNS5kY2EudW50ZC5jb20+"},"prevInTopic":40002,"nextInTopic":40014,"prevInTime":40003,"nextInTime":40005,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"Actually, check out info on the circadian rhythm and freerunning sleep; a good place to start is Wikipedia, then follow the links.  Individual cells hold to a","messageBody":"<div id=\"ygrps-yiv-678215860\">Actually, check out info on the circadian rhythm and freerunning sleep; a good place to start is Wikipedia, then follow the links.  Individual cells hold to a &quot;clock&quot; but the eyes can override that clock from light cues.  <br/>\n<br/>\nPersonally, I go through phases of needing less sleep and more sleep, as does my son.<br/>\n<br/>\nOverall, however, how is your husband&#39;s conviction affecting the relationships with the children?  Forcing them to go to bed is bringing on reluctance and conflict, as evidenced by foot dragging and coming out.<br/>\n<br/>\nObviously he wants to spend time with you.  As others have suggested here before, you need to work together to carve that time out.  It may be he needs to stay up later, or close the door off to kids for some private time while they watch a movie.<br/>\n<br/>\nOthers will offer more and more eloquently, but as a night owl required to be a lark I know not all sleep cycles are the same.<br/>\n<br/>\nRobin K<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n____________________________________________________________<br/>\nClick now for prescreened plumbing contractors.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thirdpartyoffers.juno.com/TGL2141/fc/BLSrjpTRHI745YfRmIQlB1lcLct8LNNsIxGpRheI7CurxeaBhjWsd9SCCFS/\">http://thirdpartyoffers.juno.com/TGL2141/fc/BLSrjpTRHI745YfRmIQlB1lcLct8LNNsIxGpRheI7CurxeaBhjWsd9SCCFS/</a></div>","specialLinks":[]},{"userId":161901986,"authorName":"Karen","from":"&quot;Karen&quot; &lt;gktbdm@...&gt;","profile":"gktbdm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Bedtimes, Circadian Rhythms, etc","postDate":"1241957342","msgId":39999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1Nmc0dStydWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40002,"prevInTime":39998,"nextInTime":40000,"topicId":39999,"numMessagesInTopic":0,"msgSnippet":"I know, same old, same old.  This question gets raised time after time on here, and on other message boards.  It s obviously for good reason though - it s an","messageBody":"<div id=\"ygrps-yiv-1777333685\">I know, same old, same old.  This question gets raised time after time on here, and on other message boards.  It&#39;s obviously for good reason though - it&#39;s an issue that is an &quot;issue&quot; for many families!<br/>\n<br/>\nHere&#39;s where we&#39;re at with it at the moment:<br/>\nOur kids used to have bedtimes. For the older two, we dropped them a couple of years back (they&#39;re now 12 & 15), but the younger two are still told (when my husband&#39;s home - wicked grin) that it&#39;s &quot;bedtime&quot;.  It&#39;s not at an arbitrary time, persay, but rather when things are winding down (usually after a TV show is finished, or whatever).  They sometimes resist, and they sometimes just draaaaaag their feet, and they&#39;re sometimes OK. The general routine is to have a drink, do their teeth, then go to their room for storytime with me (which they love).  My DH does get upset with them if they come out of their room after that, but he&#39;s now able to accept that it&#39;s ok if they&#39;re doing something quiet in their room (so long as they stay there!!!).<br/>\n<br/>\nWe have many discussions about this. I guess my ideal would be to create (as best as possible) a calm, quiet-ish atmostphere that inspires sleep, offer myself to them (the younger two, aged 6 & 9) to read stories etc but then accept that on some nights they&#39;re going to want to get back up to do something, just because they want to, or because they&#39;re not tired.  I think that so long as they&#39;re quiet and respecting the fact that others (usually their Dad and/or their older brothers) it should be ok.<br/>\n<br/>\nBUT, the problem is: my husband is convinced (and is trying to convince me) that it&#39;s not NATURAL to stay up late; that our bodies are designed to sleep when it&#39;s dark, and that it&#39;s modern technology that interferes with that natural process (eg, staying up on computers etc stimulates our brain to artificially keep us awake).  He is convinced by the studies that indicate that the most important hours of sleep (for hormones, biorhythms, etc) are the two hours before midnight.  He&#39;s convinced that it&#39;s healthier to get up earlier (kind of with the sun) because our bodies are designed to be stimulated by sunshine; it releases hormones in our bodies etc.<br/>\n<br/>\nI&#39;m probably not doing a very good job of explaining the rationale behind his views, but needless to say, we have some heated debate about it!  I can understand the general wisdom behind the idea of sleeping in accordance with nature (loosely), but the reality is that we do live in a modern society with electricity etc.  <br/>\n<br/>\nAnd I do want my kids to be free, so long as there&#39;s mutual respect.  I like the idea of them not being &quot;told&quot; it&#39;s &quot;time for bed&quot;, but rather helping them to learn to listen to their bodies and respond accordingly, rather than resisting bedtime just because no one likes to be told what to do!<br/>\n<br/>\nHow do we find a solution that respects both viewpoints?<br/>\n<br/>\nOh, another reason why he likes them to get to bed early enough so that we can have some time together at the end of the day (he&#39;s naturally an early to bed person, and often has to leave at 6am for work the next day) is so that we can hop in bed together, chat about the day, debrief about parenting stuff, etc.  The habit we&#39;ve developed, though, is that I spend time with the younger kids doing their nighttime routine, my husband vegges out in front of the TV then goes to bed, and I stay up late on the computer to do all my unschooling reading etc.  Not great for the marriage, hey.  (Oh, and the younger 2 are often the last kids to bed and the first ones up - they seem to get up earlier than is probably wise, perhaps because of the stimulation of the daylight?)<br/>\n<br/>\nWhat he&#39;s requesting is that the kids are in bed by about 9, we do some tidying up or TV etc, then we go to bed about 10.30, chat etc (he&#39;s even happy if I bring the laptop to bed to do my online reading). He just wants us to be together.  Personally, I think that can probably happen with the kids going to bed even at the same time as us! I can certainly change my part of the situation by taking the laptop to bed rather than being at the other end of the house, but I&#39;m still not fully convinced the kids should have to be in bed an hour or two before us.  I just can&#39;t get past the &quot;studies&quot; etc.<br/>\n<br/>\nKaryn</div>","specialLinks":[]}],"prevTopicId":39988,"nextTopicId":40034}}