{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":20,"messages":[{"userId":278087315,"authorName":"chis31@primusonline.com.au","from":"chis31@...","profile":"elendil722003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] I need Advice Please!","postDate":"1186532465","msgId":25589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OEZGNTdFMDAwMUY0MENAY3BtczAxLmludC5pcHJpbXVzLm5ldC5hdT4=","inReplyToHeader":"IDxDRjdGMTc5RC05MjhELTRBMjAtODVCQi03N0IwNDNFMDc1RjRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":25587,"nextInTopic":0,"prevInTime":25588,"nextInTime":25590,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"Vitamin B-12 can be a concern for vegans (who eat no animal products) but this will be in the multi-vitamin and added to so many non-animal products such as ","messageBody":"<div id=\"ygrps-yiv-1597193775\">Vitamin B-12 can <br/>\nbe a concern for vegans (who eat no animal products) but this will be <br/>\nin the multi-vitamin and added to so many non-animal products such as <br/>\nrice/soy milk.<br/>\n<br/>\nHey Kendrah and all,<br/>\n<br/>\nmushrooms are also a source of B12.<br/>\n<br/>\nCathy.</div>","specialLinks":[]},{"userId":278087315,"authorName":"chis31@primusonline.com.au","from":"chis31@...","profile":"elendil722003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] I need Advice Please!","postDate":"1186529569","msgId":25587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OEZGNTdFMDAwMUYyRUVAY3BtczAxLmludC5pcHJpbXVzLm5ldC5hdT4=","inReplyToHeader":"IDxmOTZjcTMrdTYzakBlR3JvdXBzLmNvbT4="},"prevInTopic":25584,"nextInTopic":25589,"prevInTime":25586,"nextInTime":25588,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"Hi Kelly, the only thing that comes immediately to mind is that the eggs we buy or hens lay without a rooster around CAN T become chickens, because they are ","messageBody":"<div id=\"ygrps-yiv-999063681\">Hi Kelly,<br/>\n<br/>\nthe only thing that comes immediately to mind is that the eggs we buy or<br/>\nhens lay without a rooster around CAN&#39;T become chickens, because they are<br/>\nNOT fertilised by a male/rooster. They are just the same as our ovulations,<br/>\nexcept the egg actually comes out and obviously, we don&#39;t ovulate every day,<br/>\nlike hens! (Has anyone seen the episode of Red Dwarf where they eat &#39;boiled<br/>\nchicken&#39;s ovulations&#39;?).<br/>\n<br/>\nAlso, protein can be derived from other sources, as you would know, it&#39;s<br/>\njust a bit harder than eating a hunk of cow. So, there are many nuts and<br/>\nlegumes that contain protein, as well as goat&#39;s milk (you can get it organic,<br/>\nhumanely produced, or have your own goat/know someone who has one). This<br/>\nwould go for any humanely produced cheese and eggs, I guess, so your daughter<br/>\nwould feel okay if she thought the animals were being treated okay in thr<br/>\nmilking or laying process. It could be a good thing that your daughter becomes<br/>\nreally informed about her own nutritional needs, as well as animal rights.<br/>\nDark leafy greens are a good source of iron and minerals and are easy to<br/>\ngrow at home. There are also ethical supplements you could look into.<br/>\n<br/>\nHope that helps,<br/>\n<br/>\nCathy.</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need Advice Please!","postDate":"1186524633","msgId":25584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5YXFrcCs5NTRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg=="},"prevInTopic":25568,"nextInTopic":25587,"prevInTime":25583,"nextInTime":25585,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"Protein requirements are probably different for different people but if she shoots for around fifty grams a day she d likely feel just fine.  I never feel","messageBody":"<div id=\"ygrps-yiv-792945497\">Protein requirements are probably different for different people but <br/>\nif she shoots for around fifty grams a day she&#39;d likely feel just <br/>\nfine.  I never feel tired if I&#39;m low on protein, I feel tired if I&#39;m <br/>\nlow on calories,  but everyone&#39;s different. <br/>\n<br/>\nIf there are some fruits she likes try a smoothie in the morning.  <br/>\nThey&#39;re filling and sweet.   If you make a fruit smoothie with soy <br/>\nmilk and add a little vegetarian protein powder, that&#39;s probably <br/>\neasily a third, or more, of the protein she&#39;d need in a day.  In the <br/>\nsummer I make a twelve ounce smoothie and have half for breakfast <br/>\nand the other half for a mid morning snack.   In winter I like a <br/>\nwarmer breakfast.&lt;g&gt;   <br/>\n<br/>\nTofu is high in protein.<br/>\nThere are meat analogues if she has no objection to the taste of <br/>\nmeat.   Most meat eaters wouldn&#39;t find meat substitutes to taste <br/>\nmuch like meat but as a vegan I find the taste so close I can&#39;t eat <br/>\nmany of them.  But if she likes them, and my son Dylan likes <br/>\nseveral, they&#39;re loaded with protein.  (Dylan has never eaten meat)  <br/>\nOf the meat-substitute-things he likes Celebration Roast and  Boca <br/>\nBurger (vegan) <br/>\n<br/>\nDylan likes falafel and a mix from Fantastic Foods called Natures <br/>\nBurger.<br/>\n<br/>\nLoma Linda and Worthington Foods make meat substitutes but you might <br/>\nhave to buy them online.  I don&#39;t use those so don&#39;t know what they <br/>\ntaste like.  <br/>\n<br/>\nDylan doesn&#39;t like carrots so sometimes getting a salad in a <br/>\nrestaurant is hard because lots of salad bars shred carrots into the <br/>\nlettuce.    But at home we make glorious salads. <br/>\n<br/>\nThere are different kinds of lettuce so if your daughter doesn&#39;t <br/>\nlike the slimy paper feel of leaf lettuce maybe she&#39;d like the <br/>\nwatery crunch of a head lettuce.  Does she like other greens?  We <br/>\nmake lovely salads from mixed greens and cabbages and other veggies.<br/>\n<br/>\nDylan also doesn&#39;t especially care for tomatoes, onions (raw or <br/>\ncooked, but onion powder in foods is ok, it&#39;s a texture thing) <br/>\navocado, beets or peppers.  Inspire of that long list we still have <br/>\nmany salad type  vegetables to choose from. <br/>\n<br/>\nSome of Dylan&#39;s favorite salad ingredients are lettuce, any kind, <br/>\ngreens (Swiss chard, spinach, etc.), cabbage, cucumber, black and <br/>\ngreen olives, raw mushrooms, raw broccoli and cauliflower, celery, <br/>\nwater chestnuts , garbanzo beans, fresh raw peas and zucchini.   <br/>\n<br/>\nOf cooked vegetables he&#39;ll eat corn on the cob (not now that he has <br/>\nbraces on his teeth) steamed or sautéed cauliflower and broccoli, <br/>\nsautéed zucchini or other summer squash, potatoes,any way, but not <br/>\ncrazy about mashed, sweet potatoes cut like French fries and baked <br/>\nin a hot oven with a drizzle of olive oil, green beans cooked any <br/>\nway but his favorite is blanched and then seared in a pan with <br/>\ngarlic, sesame oil, sesame seeds and soy sauce, yams, cabbage, <br/>\nespecially bok choy on the grill, jicama, kohlrabi and mushrooms. <br/>\n<br/>\nHe&#39;s not fond of turnips, rutabaga, Brussels sprouts or cooked peas, <br/>\nbut when I halve fresh Brussels sprouts and grill them with a little <br/>\nsesame oil he&#39;ll eat them dipped in course salt.   He&#39;ll eat cooked <br/>\n(but not mushy) peas with a little sesame ginger dressing. <br/>\n<br/>\nHe likes nuts of all kinds (he&#39;d have to, living here, &lt;snort&gt;) and <br/>\nthey&#39;re a good protein source.<br/>\nHe likes beans and we eat lots of beans and rice.<br/>\nHe likes hearty breads, rolls and muffins and whole grains have <br/>\nprotein. <br/>\n<br/>\nThere are lots of recipes online.  There&#39;s a charming, funky, hippy <br/>\ncookbook that might especially appeal to your daughter called &quot;The <br/>\nCookbook for People Who Love Animals.&quot;  My copy is just loose pages <br/>\nnow but when he was little Dylan would look through that book and <br/>\nread the little snippets and quotes and then tell me which recipe he <br/>\nthought we should try. &lt;g&gt;  Amazon has new and used copies starting <br/>\nat $3.90.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Cookbook-People-Who-Love-\">http://www.amazon.com/Cookbook-People-Who-Love-</a><br/>\nAnimals/dp/0929274180    The book might appeal to your daughter&#39;s <br/>\nethics and give you some ideas.   It&#39;s not the best vegetarian <br/>\ncookbook I have, but I&#39;m still fond of it. Buy a used copy. &lt;g&gt;<br/>\n<br/>\nTwo books I have used a lot are The American Vegetarian Cookbook, by <br/>\nMarilyn Diamond and The Shoshoni Cookbook: Vegetarian Recipes from <br/>\nthe Shoshoni Yoga Spa.<br/>\n<br/>\nIt&#39;s not hard to get enough protein.  At ten grams per serving (or <br/>\nmore) of tofu or meat substitute times (lets just say) three meals a <br/>\nday you already have thirty plus grams of protein.  Add a side dish <br/>\neach meal, a couple glasses of soy milk a day, some nuts for <br/>\nsnacking  and hearty breads and you would easily meet or exceed the <br/>\nrecommended amount of protein for a day.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need Advice Please!","postDate":"1186508700","msgId":25568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5YWIycys0MzJtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2QjcyRkIzLjMwNzA3MDlAa3VydHotZmVybmhvdXQuY29tPg=="},"prevInTopic":25563,"nextInTopic":25584,"prevInTime":25567,"nextInTime":25569,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"... based on ... I want to second this big time! We have some really different metabolisms in my house ;) And the darn things change over time! I ve found it","messageBody":"<div id=\"ygrps-yiv-2049504178\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Paul D. Fernhout&quot; <br/>\n&lt;pdfernhout@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; First, I think different people need somewhat different diets, <br/>\n </span></blockquote>based on<br/>\n<blockquote><span title=\"ireply\"> &gt; their metabolism type.<br/>\n<br/>\n </span></blockquote>I want to second this big time! We have some really different <br/>\nmetabolisms in my house ;) And the darn things change over time!<br/>\n<br/>\nI&#39;ve found it helpful to look at different theories of food/eating <br/>\nas related to metabolism and body type. There are quite a few <br/>\ndifferent ways of approaching the whole question of &quot;what does my <br/>\nbody need?&quot; and different approaches work better for different <br/>\npeople. Personally, I&#39;ve had good luck using ayurveda as a guide for <br/>\n*me* - doesn&#39;t necessarily work for my partner, though. <br/>\n<br/>\nOne of the differences in *our* metabolisms has to do with enzymes <br/>\nand the way we digest vegetables. He does well with lots of raw or <br/>\nlightly cooked greens, for example, and I can barely eat greens at <br/>\nall, unless they&#39;re well cooked or fermented. I&#39;m bringing this up <br/>\nin particular as a caveat to all the comments regarding veggies - <br/>\ndifferent bodies (even different vegetarian bodies) will handle <br/>\nvegetables in different ways. <br/>\n<br/>\nA lot of my own &quot;pickiness&quot; wrt food has been resolved by honoring <br/>\nmy own tastes and actively seeking more foods that taste yummy to <br/>\nme. That has helped broaden my diet far more than choking down <br/>\nservings of vegetables I dislike.<br/>\n<br/>\nOn that note, I&#39;ll recommend my current favorite food author, Sandor <br/>\nKatz, who writes about fermentation, the need to listen to our <br/>\nbodies and also the politics of food:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wildfermentation.com/\">http://www.wildfermentation.com/</a><br/>\n<br/>\n---Meredith (Mo 6, Ray 13)</div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need Advice Please!","postDate":"1186500131","msgId":25563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5YTJuMytuZDV0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENGN0YxNzlELTkyOEQtNEEyMC04NUJCLTc3QjA0M0UwNzVGNEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":25557,"nextInTopic":25568,"prevInTime":25562,"nextInTime":25564,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"Hello, I did not get a chance to read thru this entire thread, but I wanted to second the recommendation for Isa s cookbooks, I have both and they are","messageBody":"<div id=\"ygrps-yiv-1320139568\">Hello,<br/>\nI did not get a chance to read thru this entire thread, but I wanted<br/>\nto second the recommendation for Isa&#39;s cookbooks, I have both and they<br/>\nare wonderful, the cupcake one especially :)<br/>\nalso another good one is Vegetarian Family Cookbook by nava atlas, she<br/>\ngives vegan alternatives to each recipe.<br/>\n<br/>\nanother great book is Disease Proof your Child by Dr. Joel Fuhrman. <br/>\ngood luck!<br/>\nDiane<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kendrah Nilsestuen<br/>\n&lt;carebear-79@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Hi Kelly,<br/>\n&gt; <br/>\n&gt; My husband and I are both vegans. Currently we are raising our kids  <br/>\n&gt; ovo-lacto, but the majority of their diet is vegan. We give both  <br/>\n&gt; quality multi-vitamins, which btw are vegetarian. They are called  <br/>\n&gt; Animal Parade. Is she still planning to eat dairy? Vitamin B-12 can  <br/>\n&gt; be a concern for vegans (who eat no animal products) but this will be  <br/>\n&gt; in the multi-vitamin and added to so many non-animal products such as  <br/>\n&gt; rice/soy milk. It is also in nutritional yeast. I&#39;ve a attached a  <br/>\n&gt; link to Physician&#39;s Committee for Responsible Medicine (PCRM). They  <br/>\n&gt; advocate a vegetarian/vegan diet (yes even for kids!) and have  <br/>\n&gt; information that would probably answer any concerns you have like is  <br/>\n&gt; she getting enough protein, iron, calcium, etc. They also have  <br/>\n&gt; recipes to appeal to the kiddos! I would caution against just  <br/>\n&gt; replacing meat or dairy with the soy alternatives. Many people do  <br/>\n&gt; this when they first become vegetarian but those packaged soy  <br/>\n&gt; alternatives are highly processed and not that healthy. Occasionally  <br/>\n&gt; is fine, but everything in moderation. I know my vegetarian support  <br/>\n&gt; group was necessary for me in the beginning. Maybe you have a local  <br/>\n&gt; one that has potlucks and you can try new recipes. My favorite  <br/>\n&gt; cookbook is Vegan With A Vengeance by Isa Chandra Moskowitz. It is  <br/>\n&gt; awesome. Full of tasty, healthy recipes. If you have a sweet tooth  <br/>\n&gt; she also has a cookbook called Vegan Cupcakes Take Over the World  <br/>\n&gt; (not necessarily healthy!). No animal products in any of these. I  <br/>\n&gt; made some of her cupcakes for my son&#39;s birthday, and everyone told me  <br/>\n&gt; they were the best they&#39;d ever had vegan or not. Most the people at  <br/>\n&gt; the party weren&#39;t veggie. I could go on and on but my daughter is up  <br/>\n&gt; now. Hopefully this will get you started. I&#39;m pretty passionate about  <br/>\n&gt; a veggie lifestyle. It changed my life so much. I&#39;ve never felt  <br/>\n&gt; better, or looked better for that matter:) My kids are growing off  <br/>\n&gt; the charts as well.<br/>\n&gt; <br/>\n&gt; Earth Balance is a good butter alternative.<br/>\n&gt; Veganaise is a good mayo alternative.<br/>\n&gt; <br/>\n&gt; I should also make it clear that in line with the unschooling  <br/>\n&gt; philosophy if my children showed an interest in eating meat I would  <br/>\n&gt; not stop them. I would find a way to meet their curiosity about it. I  <br/>\n&gt; do it  for health, environment, ethics etc. But that is me. Since it  <br/>\n&gt; is me (and my husband) we do not cook meat. However, we have eaten  <br/>\n&gt; with people who do (and place NO judgement on them, so I&#39;m sure the  <br/>\n&gt; kids would feel comfortable telling us they wanted to) and at this  <br/>\n&gt; point they have no curiosity about it...<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pcrm.org/health/veginfo/veg_diets_for_children.html\">http://www.pcrm.org/health/veginfo/veg_diets_for_children.html</a><br/>\n&gt; <br/>\n&gt; Kendrah:)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I need Advice Please!","postDate":"1186464026","msgId":25557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwODA3MDUyMC5sNzc1S1FnWDAwMTM0MUBtcy1zbXRwLTAzLnNvY2FsLnJyLmNvbT4="},"prevInTopic":25556,"nextInTopic":25563,"prevInTime":25556,"nextInTime":25558,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"My dd 11 is a vegetarian (mostly) and dd7 likes to eat vegetarian if the option is available.  I recently started meal planning with a book called Saving","messageBody":"<div id=\"ygrps-yiv-263191963\">My dd 11 is a vegetarian (mostly) and dd7 likes to eat vegetarian if the<br/>\noption is available.  I recently started meal planning with a book called<br/>\n&quot;Saving Dinner the Vegetarian Way&quot;.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Saving-Dinner-Vegetarian-Way-Shopping/dp/0345485424\">http://www.amazon.com/Saving-Dinner-Vegetarian-Way-Shopping/dp/0345485424</a><br/>\n<br/>\nIt is organized by season and includes weekly shopping lists to go with each<br/>\ngroup of 6 dinner recipes.  I really like using it to plan meals and then I<br/>\nwill add a meat &quot;side dish&quot; like a piece of chicken or beef for my son and<br/>\nhusband.  I find it much easier to start by assuming everyone will eat the<br/>\nvegge meal then adding a bit of meat for the guys than the other way &#39;round.<br/>\nHope this helps,<br/>\nKrisula<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222220143,"authorName":"kaikade","from":"&quot;kaikade&quot; &lt;kaikade@...&gt;","profile":"kaikade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need Advice Please!","postDate":"1186461340","msgId":25556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5OHNxcytiZGVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg=="},"prevInTopic":25555,"nextInTopic":25557,"prevInTime":25555,"nextInTime":25557,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"Kelly, I just got this info from a daily subscription I m on...and wanted to share.  I know 2 families who are completely raw.  They have kids that are","messageBody":"<div id=\"ygrps-yiv-1017406180\">Kelly,<br/>\n<br/>\nI just got this info from a daily subscription I&#39;m on...and wanted <br/>\nto share.  I know 2 families who are completely raw.  They have kids <br/>\nthat are thriving.  Just a thought to add to what may work...<br/>\n<br/>\nIn peace,<br/>\nGinger<br/>\njust moved from TN<br/>\nmama to Kai(8) and Kade(5)<br/>\n<br/>\n<br/>\nRaw Recipe Resources....<br/>\n<br/>\nFree Raw Recipes Online - <a rel=\"nofollow\" target=\"_blank\" href=\"http://rawfoods.com/recipes/\">http://rawfoods.com/recipes/</a><br/>\nFree Raw Recipe Videos Online - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://gliving.tv/shows/category/greenchefs/\">http://gliving.tv/shows/category/greenchefs/</a><br/>\nRaw Recipe Books - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rawveganbooks.com\">http://www.rawveganbooks.com</a><br/>\nThe Raw Gourmet DVDs - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rawgourmet.com/\">http://www.rawgourmet.com/</a><br/>\nThe Garden Diet recipes - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.TheGardenDiet.com/abouttgd.html\">http://www.TheGardenDiet.com/abouttgd.html</a><br/>\nThe Raw Vegan Kitchen videos - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rawveganchannel.com/kitchen.html\">http://www.rawveganchannel.com/kitchen.html</a></div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I need Advice Please!","postDate":"1186455976","msgId":25555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJkYy4xODljZjBiZi4zM2U5M2JhOEBhb2wuY29tPg=="},"prevInTopic":25553,"nextInTopic":25556,"prevInTime":25554,"nextInTime":25556,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/6/2007 7:06:35 P.M. Pacific Daylight Time, starsuncloud@comcast.net writes: ~~Also  buying really *FRESH* fruits and vegies! REALLY,","messageBody":"<div id=\"ygrps-yiv-527816757\">In a message dated 8/6/2007 7:06:35 P.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\n~~Also  buying really *FRESH* fruits and<br/>\nvegies! REALLY, REALLY fresh! Like *she*  gets to pick them!~~<br/>\n<br/>\nI agree!!<br/>\nMy kids are MUCH more likely to eat  things they help grow. Besides, it<br/>\nall tastes SO much  better.<br/>\n<br/>\n<br/>\n<br/>\n____________________________________<br/>\n <br/>\nOooo, same here, even though it&#39;s a cement container garden, my kids are  <br/>\nthrilled with our miniature crop an are happy to sample the items :) <br/>\n <br/>\nKaren <br/>\n<br/>\n<br/>\n<br/>\n************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need Advice Please!","postDate":"1186452341","msgId":25553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5OGsxbCs3bG45QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOUE2NUVDODNGMzlGRi1GRTAtQzcyQE1CTEstTTM1LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":25547,"nextInTopic":25555,"prevInTime":25552,"nextInTime":25554,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"~~Also buying really *FRESH* fruits and vegies! REALLY, REALLY fresh! Like *she* gets to pick them!~~ I agree!! My kids are MUCH more likely to eat things they","messageBody":"<div id=\"ygrps-yiv-612214812\">~~Also buying really *FRESH* fruits and<br/>\nvegies! REALLY, REALLY fresh! Like *she* gets to pick them!~~<br/>\n<br/>\nI agree!!<br/>\nMy kids are MUCH more likely to eat things they help grow. Besides, it<br/>\nall tastes SO much better.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need Advice Please!","postDate":"1186434153","msgId":25547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ODI5OStncWozQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOUE2NUVDODNGMzlGRi1GRTAtQzcyQE1CTEstTTM1LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":25544,"nextInTopic":25553,"prevInTime":25546,"nextInTime":25548,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"... A couple of suggestions: check out The Vegetarian Grill cookbook - has maybe 3 or 6 different recipes for bean based burgers (like the bulgur and bean","messageBody":"<div id=\"ygrps-yiv-1306994254\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; BEANS are your friends! &lt;G&gt; I made minestrone soup last night---<br/>\n&gt;chocked <br/>\n&gt; full of beans (dark and light kidney and young green beans, cut up). <br/>\n&gt; He&#39;s trying to make the perfect vegie burger. We&#39;ve tried black bean <br/>\n&gt; and brown rice-based ones. Thyey were delicious, but not sturdy <br/>\n&gt;enough. <br/>\n&gt; He and Brenna made some last weekend that were great! Had nuts in <br/>\n&gt;them. <br/>\n&gt; Speaking of nuts---we always have a bowl of cashews or pecans or <br/>\n&gt; walnuts or sunflower seeds or peanuts---ALWAYS!<br/>\n&gt; <br/>\n </span></blockquote>A couple of suggestions: check out The Vegetarian Grill cookbook - has <br/>\nmaybe 3 or 6 different recipes for bean based burgers (like the bulgur <br/>\nand bean burger recipe I posted earlier). Also, they had a great <br/>\nsidebar about how you really need a good, hearty, whole grain type bun <br/>\nfor these type burgers because they&#39;re softer to begin with; standard <br/>\nsoft fluffy buns just mush up. And, do NOT use oats as a bulker-upper <br/>\n(is that a word? lol) many recipes include oats but that tends to make <br/>\nthings a bit gummy textured.<br/>\n<br/>\nDH makes an awesome veggie chili - black, white, pinto, and kidney <br/>\nbeans, tri-color bell peppers (red, yellow, green - our co-op sells <br/>\npacks of pre sliced frozen organic peppers, we&#39;ve always got a couple <br/>\npacks on hand for quick chilis and such), corn or mixed veggies, <br/>\ntomato sauce, seasonings - a combo of ancho chili powder and chipotle <br/>\nchili powder has turned out to be our favorite, just hot enough to be <br/>\nchili for DH and mild/smoky enough that DS and I can eat it (we don&#39;t <br/>\nlike the really spicy burn-your-mouth stuff plus my reflux issues <br/>\nwon&#39;t tolerate it well). Teamed with a loaf of still warm whole wheat <br/>\nor pumpernickel bread on a cold night - mmmmmm!<br/>\n<br/>\nAlso, another good hearty (and protein rich) summer meal is cold brown <br/>\nrice salad, we have two variants we like, sweet and savory: <br/>\nCold Rice Salad (sweet)<br/>\n<br/>\n5 C cooked brown basmati rice<br/>\n1 C chopped carrots<br/>\n½  sm. Onion, chopped<br/>\n½ C raisins<br/>\n½ C chopped pecans<br/>\nOptional: ½ C dried cranberries; ¼ C unsalted sunflower seeds<br/>\n¼ C balsamic vinegar (to taste)<br/>\n¼ C olive oil (to taste)<br/>\n2 tbl. maple syrup (to taste)<br/>\n<br/>\nCombine all ingredients, serve cold<br/>\n<br/>\nCold Rice Salad (savory)<br/>\n<br/>\n5 C cooked brown basmati rice<br/>\n1 large bell pepper, chopped<br/>\n1 C chopped carrots<br/>\n1 can diced tomato, drained (or fresh diced tomato)<br/>\n¼ C balsamic vinegar (to taste)<br/>\n¼ C olive oil (to taste)<br/>\n1 tsp minced garlic (to taste)<br/>\n1 tbl Italian seasoning (to taste)<br/>\n<br/>\nCombine all ingredients, serve cold<br/>\n*can also add cooked, cooled beans of any sort (chick peas, black <br/>\nbeans, whatever) to the savory one for added protein. Brown basmati <br/>\nrice itself has a nice serving of protein (12 grams per cup roughly). <br/>\nYou can also toss in some raw or lightly steamed broccoli as well. <br/>\n<br/>\nI love to toss a handful of broken up pecans onto my cereal in the <br/>\nmorning and we often have pecans and raisins tossed onto oatmeal in <br/>\nthe winter - adds a bit of protein and iron and texture (actually, <br/>\noatmeal at our house looks a lot like a make-your-own-sundae <br/>\nparty...we put out raisins, craisins if we have them, pecans, peanut <br/>\nbutter, honey, real maple syrup - DS won&#39;t touch the &#39;pancake syrup&#39; <br/>\nstuff, chocolate chips, cinnamon, sugar, butter, almond milk - we <br/>\nhaven&#39;t used cow milk since late winter/early spring, and any other <br/>\ntidbits we might have on hand that seem like they&#39;d be tasty).<br/>\n<br/>\nWe don&#39;t claim to be vegetarian since we love sushi, eat tuna, and <br/>\nlike an occasional bit of chicken now and again but we prefer to eat a <br/>\nplant-based diet. It&#39;s fun going out and re-arranging the menu to suit <br/>\nwhat I want to eat (they really will do just about anything if they <br/>\nhave the components on the menu)<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I need Advice Please!","postDate":"1186418063","msgId":25544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUE2NUVDODNGMzlGRi1GRTAtQzcyQE1CTEstTTM1LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg==","referencesHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg=="},"prevInTopic":25543,"nextInTopic":25547,"prevInTime":25543,"nextInTime":25545,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"... From: Kelly  I need ideas, advice, help, info.....lol....ANYTHING! Okay, my daughter has made the decision, and has been","messageBody":"<div id=\"ygrps-yiv-72702918\">-----Original Message-----<br/>\nFrom: Kelly &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:CraftyGardenerTN@...\">CraftyGardenerTN@...</a>&gt;<br/>\n<br/>\nI need ideas, advice, help, info.....lol....ANYTHING! Okay, my<br/>\ndaughter has made the decision, and has been pondering it for a<br/>\ncouple years actually, to not eat meat. No beef, poultry, fish and so<br/>\non. She said she just cannot stand the thought any longer of animals<br/>\nbeing killed for her food. While many I know do not have the same<br/>\nfeelings about this and many do, she does. She is 13 years old and is<br/>\nvery sweet. She is not doing this for any other reason than the one<br/>\nmentioned.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nCameron (19) has been an on&off vegetarian over his teen years. For the <br/>\nsame reasons.<br/>\n<br/>\n-=-===-<br/>\n<br/>\n<br/>\n She has also informed me that is the eggs we eat &quot;could&quot;<br/>\nbecome chickens if we did not eat them then she no longer wants to<br/>\neat those as well.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nNaw---just get unfertilized eggs---they can&#39;t become chicks no matter <br/>\nhow hard you sit on them! &lt;G&gt;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nShe actually tried this a couple years ago and we did not think much<br/>\nof it because we thought it would go a couple days, maybe even a week<br/>\nor so but would end. She went 6 months, but ate fish and eggs, and<br/>\nsaid she could not stand the feeling of being constantly hungry as<br/>\nwell as a sick feeling as well as tired all the time.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAlso why Cam has been on&off! He&#39;s gotten too tired as well as <br/>\n&quot;stupid&quot;---like his brain wasn&#39;t functioning well. He didn&#39;t feel good. <br/>\nThis time, we discussed how he could make it work. He went to our local <br/>\nhealth food store and talked a long tme about how it made him feel <br/>\nbefore and how he could prevent it. She suggested a multi-vitamin wih <br/>\nlots of &quot;B&quot;---which is lacking in many vegetarian diets.<br/>\n<br/>\nWe also discussed many other protein options. Apparantly he wasn&#39;t <br/>\ngetting NEARLY enough before (he needs a lot). He also needs more iron <br/>\nthan the average male. Combined (low protien & low iron)---no wonder he <br/>\nwas pooped!<br/>\n<br/>\nNow he fixes two fried eggs every morning---almost without fail---as <br/>\nwell as toast with peanut butter. We always have a large tub of hummus <br/>\n& flatbread or carrots to dip and plenty of yoghurt with granola for <br/>\nsnacks. I fix a lot of greens (I have low iron too). He&#39;s learning all <br/>\nabout soy substitutes (which I find repulsive), so I&#39;ll often make a <br/>\nsauce or something with a bit left over before I add the meat, so that <br/>\nhe can add the soy.<br/>\n<br/>\nBEANS are your friends! &lt;G&gt; I made minestrone soup last night---chocked <br/>\nfull of beans (dark and light kidney and young green beans, cut up). <br/>\nHe&#39;s trying to make the perfect vegie burger. We&#39;ve tried black bean <br/>\nand brown rice-based ones. Thyey were delicious, but not sturdy enough. <br/>\nHe and Brenna made some last weekend that were great! Had nuts in them. <br/>\nSpeaking of nuts---we always have a bowl of cashews or pecans or <br/>\nwalnuts or sunflower seeds or peanuts---ALWAYS!<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nNow I should also mention that she is a VERY picky eater which does<br/>\nnot make this any easier. She said she will try and learn to like<br/>\nfoods she does not currently like. She does not eat lettuce,<br/>\ntomatoes, cucumbers, apples, carrots, pears, radishes.....I am sure<br/>\ntheir is more.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nTHis is my pet peeve with vegetarians! &lt;BWG&gt; You guys really DO need to <br/>\neat VEGETABLES!<br/>\n<br/>\nOne of Duncan&#39;s friends has a small list of foods she eats, but insists <br/>\nthat she is a vegetarian. &lt;G&gt; The list includes (and is practically <br/>\nlimited to!) french fries, chicken nuggets, sauceless pasta, and cheese <br/>\npizza. I keep finding those chicken nuggets to be *partially* about <br/>\nmeat! &lt;G&gt; But she eats almost no vegies---I think she&#39;ll eat a carrot <br/>\nstick. It&#39;s really hard to feed her here!<br/>\n<br/>\nI think many adults prepare vegies to be unappealing to kids. Not on <br/>\npurpose, of course! But either too raw or cooked to death and smothered <br/>\nin stuff. Dips are GREAT!  *Lighly* steamed broccoli & asparagus with <br/>\njust a simple lemon-butter to dip in. Grape tomatoes dipped in coarse <br/>\nsalt. Carrots in hummus (if she doesn&#39;t like them raw or cooked, try <br/>\nlightly steaming to just get rid of the bitterness, but not so long <br/>\nthat it gets rid of the crunch). Also buying really *FRESH* fruits and <br/>\nvegies! REALLY, REALLY fresh! Like *she* gets to pick them!<br/>\n<br/>\nBut I would make sure she knows to keep the high-protein foods close <br/>\nby!<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":153118561,"authorName":"airokat@comcast.net","from":"airokat@...","profile":"dawakat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I need Advice Please!","postDate":"1186415912","msgId":25543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4MDYyMDA3MTU1OC45MDU1LjQ2Qjc0NTI4MDAwQjlDREQwMDAwMjM1RjIyMDcwMjA4NTM5QjBFMDUwMTlEMDcwRUBjb21jYXN0Lm5ldD4="},"prevInTopic":25540,"nextInTopic":25544,"prevInTime":25542,"nextInTime":25544,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"We have been vegetarians for 30 years and our kids have never eaten any kind of meat. We do eat cheese, milk and eggs. I work full time so its difficult","messageBody":"<div id=\"ygrps-yiv-798489485\">We have been vegetarians for 30 years and our kids have never eaten any kind of meat. We do eat cheese, milk and eggs. <br/>\nI work full time so its difficult sometimes to find the time to prepare meals, but I usually have a crockpot going with some kind of bean or lentil dish in it.<br/>\nI also have a book called &quot;Fast Vegetarian Feasts&quot; that includes recipes that can be made in about 15 minutes. I recommend picking up something similiar at the bookstore and having your daughter experiment with the recipes and discover what she likes. There are quite a few &quot;quick vegetarian recipe&quot; books out there, some with wonderful recipes from around the world. The recipes are easy enough for anyone to try.<br/>\nKathryn<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;Kelly&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:CraftyGardenerTN@...\">CraftyGardenerTN@...</a>&gt; <br/>\nI need ideas, advice, help, info.....lol....ANYTHING! Okay, my <br/>\ndaughter has made the decision, and has been pondering it for a <br/>\ncouple years actually, to not eat meat. No beef, poultry, fish and so <br/>\non. She said she just cannot stand the thought any longer of animals <br/>\nbeing killed for her food. While many I know do not have the same <br/>\nfeelings about this and many do, she does. She is 13 years old and is <br/>\nvery sweet. She is not doing this for any other reason than the one <br/>\nmentioned. She has also informed me that is the eggs we eat &quot;could&quot; <br/>\nbecome chickens if we did not eat them then she no longer wants to <br/>\neat those as well.<br/>\n<br/>\nShe actually tried this a couple years ago and we did not think much <br/>\nof it because we thought it would go a couple days, maybe even a week <br/>\nor so but would end. She went 6 months, but ate fish and eggs, and <br/>\nsaid she could not stand the feeling of being constantly hungry as <br/>\nwell as a sick feeling as well as tired all the time.<br/>\n<br/>\nNow I should also mention that she is a VERY picky eater which does <br/>\nnot make this any easier. She said she will try and learn to like <br/>\nfoods she does not currently like. She does not eat lettuce, <br/>\ntomatoes, cucumbers, apples, carrots, pears, radishes.....I am sure <br/>\ntheir is more.<br/>\n<br/>\nCan anyone offer any ideas on what I can feed her? What about <br/>\nsupplements? ANY info is greatly appreciated. It does not matter if <br/>\nit is a recipe, a way to eat, vitamin ideas, tips...anything. The <br/>\nmore the better as I know my daughter is mature enough to make this <br/>\ndecision and even if she is unable to keep with it I know she <br/>\ndesperately wants to and I want to do anything I can to help. I am <br/>\ncurrently on the path to a healthier me as it is so it would not hurt <br/>\nme either. Thank you soooo much for any info you can offer and I am <br/>\nsorry if you see this post on another group as I am just posting this <br/>\nto the ones I belong to to try and get as much advice as I can!<br/>\n<br/>\nThanks so much!<br/>\n<br/>\nKelly in TN<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I need Advice Please!","postDate":"1186411640","msgId":25537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzQTRDQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":25533,"nextInTopic":25538,"prevInTime":25535,"nextInTime":25538,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"... changed to some kind of soy substitute so I make most family recipes using that. I don t tolerate soy well so we ve found another option: Basic bean &","messageBody":"<div id=\"ygrps-yiv-1625492462\"><blockquote><span title=\"ireply\">&gt;I have found that most recipes using any kind of ground meat are easily<br/>\n </span></blockquote>changed to some kind of soy substitute so I make most family recipes<br/>\nusing that. <br/>\nI don&#39;t tolerate soy well so we&#39;ve found another option:<br/>\n<br/>\n <br/>\n<br/>\nBasic bean & grain burger (from The Vegetarian Grill, page 136) makes 8<br/>\nburgers/portions<br/>\n<br/>\n <br/>\n<br/>\n2/3 C uncooked bulgur<br/>\n<br/>\n1 1/3 C boiling water<br/>\n<br/>\n1/2 C bread crumbs - 4 slices stale or toasted whole wheat bread or<br/>\nabout 1 C of whole grain O cereal whirred through the food processor<br/>\n<br/>\n1 1/2 C cooked kidney, pinto, or black beans or one 15 oz can, rinsed<br/>\nand drained (we prefer pinto beans for this recipe)<br/>\n<br/>\n1/2 C chopped fresh parsley (we omitted this, didn&#39;t miss it)<br/>\n<br/>\n2 cloves garlic, minced (adjust to taste)<br/>\n<br/>\n1 large egg (or egg substitute - need something as a binding agent)<br/>\n<br/>\n2 tbl tomato paste (can use ketchup instead)<br/>\n<br/>\n1 tbl soy sauce (can use worcestershire instead)<br/>\n<br/>\n1 tbl chili powder (or omit this and use Italian seasoning instead, play<br/>\nwith the seasonings until you find what you like)<br/>\n<br/>\nsalt & pepper to taste (we omitted this entirely)<br/>\n<br/>\n <br/>\n<br/>\n1 - Combine bulgur and water in a bowl, cover, set it aside for 10<br/>\nminutes<br/>\n<br/>\n2 - Process the bread (or cereal) in a food processor to make 1/2 C<br/>\ncrumbs<br/>\n<br/>\n3 - Combine beans, parsley, garlic in the food processor and pulse until<br/>\nyou have a fairly smooth mixture<br/>\n<br/>\n4 - Drain excess liquid from bulgur and stir into bean mixture<br/>\n<br/>\n5 - Add bread crumbs, egg, tomato paste, soy sauce, chili powder, salt,<br/>\npepper<br/>\n<br/>\n6 - Set aside for 30 minutes - it will thicken as it stands<br/>\n<br/>\n7 - Prepare medium fire in grill with lightly oiled vegetable grill rack<br/>\nin place - we just used the pancake griddle over medium heat on the<br/>\nstove<br/>\n<br/>\n8 - Shape into 8 3&quot; patties or 8 &quot;sausages&quot;<br/>\n<br/>\n9 - Grill until crisp on the outside - about 5 minutes per side for<br/>\npatties; roll 1/4 turn approx every 2 minutes for &quot;sausages&quot; until it&#39;s<br/>\nbrowned all over<br/>\n<br/>\n10 - Serve on buns, bread, or tortilla wraps with ketchup, salsa,<br/>\ncheese, whatever<br/>\n<br/>\n <br/>\nThe basic mix, when using pintos, looks a lot like meatloaf. You can<br/>\nmake meatballs from it, burger patties, sausage shapes, etc. And, you<br/>\ncan cook it as &#39;crumbles&#39; as you would ground meat to use for<br/>\ntacos/nachos, meat sauces, etc. Can be made ahead and reheated (cook up<br/>\nall the meatballs or patties then microwave until warmed). The only<br/>\ncaveat I&#39;ve found so far is that once it&#39;s been mixed into a meat sauce<br/>\n(for pasta for example), it has to be used - the sauce adds extra<br/>\nmoisture and it gets a bit mushy if it sits overnight and gets reheated<br/>\nin this form. One big bonus is that it just needs to be warmed or<br/>\nbrowned, no worries about &quot;rare meat&quot;, it just needs to cook enough for<br/>\nthe egg to cook and that&#39;s pretty minimal. It will brown nicely as a<br/>\npatty and we love to brown up a bunch of meatballs then toss them with a<br/>\nbit of our favorite BBQ sauce.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4379372,"authorName":"Paul D. Fernhout","from":"&quot;Paul D. Fernhout&quot; &lt;pdfernhout@...&gt;","profile":"pdfernhout","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I need Advice Please!","postDate":"1186410419","msgId":25540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2QjcyRkIzLjMwNzA3MDlAa3VydHotZmVybmhvdXQuY29tPg==","inReplyToHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg==","referencesHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg=="},"prevInTopic":25539,"nextInTopic":25543,"prevInTime":25539,"nextInTime":25541,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"First, I think different people need somewhat different diets, based on their metabolism type. Might not help much, but our child (almost four) has pretty much","messageBody":"<div id=\"ygrps-yiv-970595358\">First, I think different people need somewhat different diets, based on<br/>\ntheir metabolism type.<br/>\n<br/>\nMight not help much, but our child (almost four) has pretty much always been<br/>\na vegetarian. People always remark how tall they are for their age. Organic<br/>\nmilk, eggs (unfertilized, we have our own hens and no rooster, and feed<br/>\norganic grain), cheese, and organic butter are eaten, as well as now those<br/>\nnew chocolate-flavored covered walnuts (for extra omega-3 fatty acids).<br/>\nFruit and and other veggies are eaten, mostly chosen on their own from<br/>\npre-washed in the fridge (though you say yours does not liek this -- maybe<br/>\nif they grew their own?). Blueberries are a big hit. Likes beans and peas --<br/>\nincluding from our garden.<br/>\n<br/>\nWe tried a kid&#39;s supplement with extra omega-3 but our kid did not like it.<br/>\nBut we use a regular kids chewable supplement.<br/>\n<br/>\nWas a period of about a week after reading _Shiloh_ when several organic<br/>\nnitrate-free hot dogs were eaten (they were fed to the dog in the book), but<br/>\nthat passed.<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.applegatefarms.com/\">http://www.applegatefarms.com/</a><br/>\nOccasionally a tiny piece of fish slips in. :-)<br/>\n<br/>\nMaybe time for your daughter to have some chickens of her own? A bunch of<br/>\nwork though -- not so much to keep up with the chickens as to build and<br/>\nmaintain a coop and yard, especially if, like us, you have dogs who would<br/>\nlike to get in there. Maybe she might help a neighbor who already has a coop<br/>\nand no rooster and get a few eggs a week in return? Also as chickens are<br/>\nsocial, you need several, and that would make too many eggs for one kid. We<br/>\nalso scramble the extras for our dogs.<br/>\n<br/>\nAlso, try stocking the freezer with &quot;Amy&#39;s&quot; frozen food.<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amyskitchen.com/\">http://www.amyskitchen.com/</a><br/>\nA little pricey, but well worth it -- usually organic stuff, and all<br/>\nvegetarian dishes. It is a little pricey relative to other frozen foods, but<br/>\nstill probably cheaper than almost anything you buy when eating out, and<br/>\ncheaper than dealing with health problems. Amy&#39;s might help your daughter<br/>\nmake a transition to more food variety, which she could then cook herself.<br/>\n<br/>\nLots of books out there on vegetarian cooking -- for example, try &quot;The<br/>\nStarving Student&#39;s Vegetarian Cookbook&quot; for example.<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Starving-Students-Vegetarian-Cookbook/dp/0446676756\">http://www.amazon.com/Starving-Students-Vegetarian-Cookbook/dp/0446676756</a><br/>\n<br/>\nAlso, try pasta and chili beans. I make the pasta in the microwave (about<br/>\ntwelve minutes in ours, adding a little salt and olive oil to the water),<br/>\nand I use a hand can opener which does not leave sharp edges -- that tool is<br/>\na miracle and I found it in a big grocery store. Similar to this:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Good-Grips-1049953-Smooth-Opener/dp/B000079XW2\">http://www.amazon.com/Good-Grips-1049953-Smooth-Opener/dp/B000079XW2</a><br/>\nSeems doable for a fourteen year old and fairly nutritious. I&#39;d stay away<br/>\nfrom soaking beans for a while -- too much planning. Used good canned beans<br/>\nor good canned chili, again, from Amy&#39;s (they do extra good on beans<br/>\ncompared with other brands). I&#39;ve also found you can dump an organic canned<br/>\nsoup over the pasta.<br/>\n<br/>\n--Paul Fernhout<br/>\n<br/>\nKelly wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; I need ideas, advice, help, info.....lol....ANYTHING! Okay, my <br/>\n&gt; daughter has made the decision, and has been pondering it for a <br/>\n&gt; couple years actually, to not eat meat. No beef, poultry, fish and so <br/>\n&gt; on. She said she just cannot stand the thought any longer of animals <br/>\n&gt; being killed for her food. While many I know do not have the same <br/>\n&gt; feelings about this and many do, she does. She is 13 years old and is <br/>\n&gt; very sweet. She is not doing this for any other reason than the one <br/>\n&gt; mentioned. She has also informed me that is the eggs we eat &quot;could&quot; <br/>\n&gt; become chickens if we did not eat them then she no longer wants to <br/>\n&gt; eat those as well.<br/>\n&gt; <br/>\n&gt; She actually tried this a couple years ago and we did not think much <br/>\n&gt; of it because we thought it would go a couple days, maybe even a week <br/>\n&gt; or so but would end. She went 6 months, but ate fish and eggs, and <br/>\n&gt; said she could not stand the feeling of being constantly hungry as <br/>\n&gt; well as a sick feeling as well as tired all the time.<br/>\n&gt; <br/>\n&gt; Now I should also mention that she is a VERY picky eater which does <br/>\n&gt; not make this any easier. She said she will try and learn to like <br/>\n&gt; foods she does not currently like. She does not eat lettuce, <br/>\n&gt; tomatoes, cucumbers, apples, carrots, pears, radishes.....I am sure <br/>\n&gt; their is more.<br/>\n&gt; <br/>\n&gt; Can anyone offer any ideas on what I can feed her? What about <br/>\n&gt; supplements? ANY info is greatly appreciated. It does not matter if <br/>\n&gt; it is a recipe, a way to eat, vitamin ideas, tips...anything. The <br/>\n&gt; more the better as I know my daughter is mature enough to make this <br/>\n&gt; decision and even if she is unable to keep with it I know she <br/>\n&gt; desperately wants to and I want to do anything I can to help. I am <br/>\n&gt; currently on the path to a healthier me as it is so it would not hurt <br/>\n&gt; me either. Thank you soooo much for any info you can offer and I am <br/>\n&gt; sorry if you see this post on another group as I am just posting this <br/>\n&gt; to the ones I belong to to try and get as much advice as I can!<br/>\n&gt; <br/>\n&gt; Thanks so much!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Kelly in TN<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":284676289,"authorName":"MrsStranahan","from":"MrsStranahan &lt;mrsstranahan@...&gt;","profile":"laurenstranahan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I need Advice Please!","postDate":"1186408769","msgId":25539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlYTYzYWY1MDcwODA2MDY1OWw1NGVmN2JkNHFmYjAxM2FhMWZkNmVkNTI5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGY5NzZqYitndGFyQGVHcm91cHMuY29tPg==","referencesHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPiA8Zjk3NmpiK2d0YXJAZUdyb3Vwcy5jb20+"},"prevInTopic":25538,"nextInTopic":25540,"prevInTime":25538,"nextInTime":25540,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"Pressing the excess liquid out of a block of firm or extra-firm tofu and then freezing it will give the texture of ground meat and can be used to make chili,","messageBody":"<div id=\"ygrps-yiv-1359109236\">Pressing the excess liquid out of a block of firm or extra-firm tofu and<br/>\nthen freezing it will give the texture of ground meat and can be used to<br/>\nmake chili, spaghetti, etc. Just treat it the same way you would meat ...<br/>\nbrown the thawed out crumbled tofu in a little oil and season it (maybe<br/>\nseason a little more than you would meat) and continue with your recipe.<br/>\nEpicurious.com has a Cincinnati chili recipe that worked well for me when I<br/>\nsubstituted tofu for the ground beef.<br/>\n<br/>\nSilken tofu blends up really nice in smoothies. I&#39;ve made a chocolate shake<br/>\nfor my kids with silken tofu and chocolate soy dream and a little flax seed<br/>\noil.<br/>\n<br/>\nIf your daughter was feeling hungry and sick she might have needed a little<br/>\nmore protein than she was taking in.<br/>\n<br/>\nVegsource.com has lots of tips and recipes.<br/>\n<br/>\nLauren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/6/07, Lisa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlblock01@...\">jlblock01@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   My 14 yr old recently became a vegetarian.... she is a good eater and<br/>\n&gt; likes most all vegetables etc so it&#39;s a bit easier for us. I already<br/>\n&gt; cook alot of vegetables along with whatever meat we eat so it&#39;s not<br/>\n&gt; been a huge transition for her. I make sure we always have hummus,<br/>\n&gt; yogurt (you didn&#39;t say if your daughter was going to continue to drink<br/>\n&gt; milk or drinks milk currently), fruit, vegetables for salads, pasta (I<br/>\n&gt; buy the Barilla Plus which is not completely whole wheat but less<br/>\n&gt; white flour) also peanut butter or other nut butters... whole wheat<br/>\n&gt; breads. Basically you have to raise the quality of what she does<br/>\n&gt; eat...if she eats pasta go more whole grain so it&#39;s a more hearty<br/>\n&gt; meal. My daughter makes smoothies each day with yogurt, frozen<br/>\n&gt; berries (I buy a frozen berry blend at Sam&#39;s...BJ&#39;s has a similar one<br/>\n&gt; that is organic) and a splash of orange juice... you could add soy<br/>\n&gt; protein powder or hemp protein powder to add some ump! I also buy<br/>\n&gt; those new steam bags .. I think ziploc and hefty make them now.... you<br/>\n&gt; can put whatever veggies she likes in there for a quick steam. My<br/>\n&gt; daughter has begun to cook more and experiment in the kitchen more<br/>\n&gt; now. If your daughter likes potatoes that could make a great hearty<br/>\n&gt; meal to have a baked potato with cheese or salsa if she likes that.<br/>\n&gt; I am not sure how you prepare your vegetables but I found with my<br/>\n&gt; picky kids if you lightly steam something with a little salt, pepper<br/>\n&gt; and butter they are more likely to eat it... overcooked veggies smell<br/>\n&gt; bad and don&#39;t look very appetizing to a child. I also buy lots of<br/>\n&gt; Clif Bars , granola bars, and other higher nutritional quality snacks.<br/>\n&gt; My daughter made her decision based on her own reading and<br/>\n&gt; researching and came to me and told me she didn&#39;t want to eat meat<br/>\n&gt; anymore. She wants to be a vet and reads alot of Temple Grandin&#39;s<br/>\n&gt; books... Temple Grandin in an amazing PhD who has autism that has done<br/>\n&gt; the bulk of her research in slaughter houses, fed lots etc... she&#39;s<br/>\n&gt; developed more humane slaughter and enclosure systems for all types of<br/>\n&gt; animals. Anyway that reading brought my daughter to more indepth<br/>\n&gt; reading and her decision not to eat meat. She is still eating a<br/>\n&gt; little fish and other seafood now and then. You will have to help<br/>\n&gt; your daughter figure out food quality so she will not be hungry... my<br/>\n&gt; daughter has learned so much about nutrition! She knows what foods<br/>\n&gt; are high in protein (which is typically what keeps them from being<br/>\n&gt; hungry!) and lots about how different foods are prepared (some<br/>\n&gt; processing for foods that don&#39;t contain meat necessarily are still<br/>\n&gt; prepared in ways that are unhealthy to animals and the environment!)<br/>\n&gt; Anyway I have found lots of great vegetarian recipes online ...<br/>\n&gt; great recipe for Spicy Black Bean burgers that we all enjoy and many<br/>\n&gt; others! Personally I think that making a decision like this that may<br/>\n&gt; not be in line with the family ...especially extended family ....is a<br/>\n&gt; great way for kids to learn to really listen to their internal compass<br/>\n&gt; and begin to know what they stand for! Amazingly my dad who is the<br/>\n&gt; biggest carnivore on the planet is very supportive of Anna&#39;s decision<br/>\n&gt; ... he asked her why she had decided not to eat meat, listened to her<br/>\n&gt; and agreed that for her it did make sense that she would follow what<br/>\n&gt; she felt was right.<br/>\n&gt; Good luck!<br/>\n&gt; Lisa Blocker<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need Advice Please!","postDate":"1186405802","msgId":25533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5NzZqYitndGFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg=="},"prevInTopic":25532,"nextInTopic":25537,"prevInTime":25532,"nextInTime":25534,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"My 14 yr old recently became a vegetarian.... she is a good eater and likes most all vegetables etc so it s a bit easier for us.  I already cook alot of","messageBody":"<div id=\"ygrps-yiv-768027797\">My 14 yr old recently became a vegetarian.... she is a good eater and<br/>\nlikes most all vegetables etc so it&#39;s a bit easier for us.  I already<br/>\ncook alot of vegetables along with whatever meat we eat so it&#39;s not<br/>\nbeen a huge transition for her.   I make sure we always have hummus,<br/>\nyogurt (you didn&#39;t say if your daughter was going to continue to drink<br/>\nmilk or drinks milk currently), fruit, vegetables for salads, pasta (I<br/>\nbuy the Barilla Plus which is not completely whole wheat but less<br/>\nwhite flour) also peanut butter or other nut butters... whole wheat<br/>\nbreads.  Basically you have to raise the quality of what she does<br/>\neat...if she eats pasta go more whole grain so it&#39;s a more hearty<br/>\nmeal.   My daughter makes smoothies each day with yogurt, frozen<br/>\nberries (I buy a frozen berry blend at Sam&#39;s...BJ&#39;s has a similar one<br/>\nthat is organic)  and a splash of orange juice... you could add soy<br/>\nprotein powder or hemp protein powder to add some ump!   I also buy<br/>\nthose new steam bags .. I think ziploc and hefty make them now.... you<br/>\ncan put whatever veggies she likes in there for a quick steam.   My<br/>\ndaughter has begun to cook more and experiment in the kitchen more<br/>\nnow.   If your daughter likes potatoes that could make a great hearty<br/>\nmeal to have a baked potato with cheese or salsa if she likes that.  <br/>\nI am not sure how you prepare your vegetables but I found with my<br/>\npicky kids if you lightly steam something with a little salt, pepper<br/>\nand butter they are more likely to eat it... overcooked veggies smell<br/>\nbad and don&#39;t look very appetizing to a child.  I also buy lots of<br/>\nClif Bars , granola bars, and other higher nutritional quality snacks.<br/>\n  My daughter made her decision based on her own reading and<br/>\nresearching and came to me and told me she didn&#39;t want to eat meat<br/>\nanymore.   She wants to be a vet and reads alot of Temple Grandin&#39;s<br/>\nbooks... Temple Grandin in an amazing PhD who has autism that has done<br/>\nthe bulk of her research in slaughter houses, fed lots etc... she&#39;s<br/>\ndeveloped more humane slaughter and enclosure systems for all types of<br/>\nanimals.  Anyway that reading brought my daughter to more indepth<br/>\nreading and her decision not to eat meat.   She is still eating a<br/>\nlittle fish and other seafood now and then.   You will have to help<br/>\nyour daughter figure out food quality so she will not be hungry... my<br/>\ndaughter has learned so much about nutrition!   She knows what foods<br/>\nare high in protein (which is typically what keeps them from being<br/>\nhungry!) and lots about how different foods are prepared (some<br/>\nprocessing for foods that don&#39;t contain meat necessarily are still<br/>\nprepared in ways that are unhealthy to animals and the environment!) <br/>\n  Anyway I have found lots of great vegetarian recipes online ...<br/>\ngreat recipe for Spicy Black Bean burgers that we all enjoy and many<br/>\nothers!  Personally I think that making a decision like this that may<br/>\nnot be in line with the family ...especially extended family ....is a<br/>\ngreat way for kids to learn to really listen to their internal compass<br/>\nand begin to know what they stand for!  Amazingly my dad who is the<br/>\nbiggest carnivore on the planet is very supportive of Anna&#39;s decision<br/>\n... he asked her why she had decided not to eat meat, listened to her<br/>\nand agreed that for her it did make sense that she would follow what<br/>\nshe felt was right.<br/>\nGood luck!<br/>\nLisa Blocker</div>","specialLinks":[]},{"userId":58132404,"authorName":"MarSi77@aol.com","from":"MarSi77@...","profile":"m6hschch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:I need Advice Please!","postDate":"1186404326","msgId":25532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzZC4xOThjZWVhMy4zM2U4NzFlNkBhb2wuY29tPg=="},"prevInTopic":25531,"nextInTopic":25533,"prevInTime":25531,"nextInTime":25533,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/6/2007 8:06:33 AM Eastern Daylight Time, CraftyGardenerTN@aol.com writes: She has also informed me that is the eggs we eat could become","messageBody":"<div id=\"ygrps-yiv-307342299\">In a message dated 8/6/2007 8:06:33 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:CraftyGardenerTN@...\">CraftyGardenerTN@...</a> writes:<br/>\n<br/>\nShe has also informed me that is the eggs we eat &quot;could&quot; <br/>\nbecome chickens if we did not eat them then she no longer wants to <br/>\neat those as well.<br/>\n<br/>\n*************************<br/>\nRemind her that *only* those hens that are with a rooster would ever get to <br/>\nbecome chickens. Hens lay eggs..it&#39;s only when a rooster *dances* with them <br/>\nthat the eggs are fertilized and *could* become chickens.<br/>\nMany people are unaware of this.<br/>\n <br/>\nWe are sooo with your daughter and we are gradually lessening the amount of <br/>\nmeat in our diets too, and even more so after reading the book, The China Study.<br/>\n <br/>\nI&#39;m trying to make more things with beans and also substituting the meat in <br/>\nrecipes with veggies instead, and am using whole grains.<br/>\nCheck out some books on the topic and cookbooks from the library..and on the <br/>\ninternet!<br/>\n <br/>\n~marcia<br/>\nHarmonyWoodsFarm <br/>\nmy blog:  _<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xanga.com/livefreeinharmony_\">http://www.xanga.com/livefreeinharmony_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xanga.com/livefreeinharmony)\">http://www.xanga.com/livefreeinharmony)</a> <br/>\n<br/>\n<br/>\n<br/>\n************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I need Advice Please!","postDate":"1186403897","msgId":25531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlNy4xNjIxMmQxZC4zM2U4NzAzOUBhb2wuY29tPg=="},"prevInTopic":25528,"nextInTopic":25532,"prevInTime":25530,"nextInTime":25532,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/6/2007 8:06:32 A.M. Eastern Daylight Time, CraftyGardenerTN@aol.com writes: Can  anyone offer any ideas on what I can feed her? What about","messageBody":"<div id=\"ygrps-yiv-801681180\">In a message dated 8/6/2007 8:06:32 A.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:CraftyGardenerTN@...\">CraftyGardenerTN@...</a> writes:<br/>\n<br/>\nCan  anyone offer any ideas on what I can feed her? What about <br/>\nsupplements? ANY  info is greatly appreciated. It does not matter if <br/>\nit is a recipe, a way  to eat, vitamin ideas, tips...anything. <br/>\n<br/>\n<br/>\n___<br/>\n <br/>\nMy daughter who is now almost 18 made the choice to become a vegetarian  when <br/>\nshe was 12 and is still a complete vegetarian.  We have never been big  meat <br/>\neaters and I have also gone through years when I chose to be vegetarian.  <br/>\nHowever, both my husband and son eat meat, chicken and fish.<br/>\n <br/>\nI have found that most recipes using any kind of ground meat are easily  <br/>\nchanged to some kind of soy substitute so I make most family recipes using  that.  <br/>\nSome examples are tacos, chili, spaghetti.  When we have  lasagne, I usually <br/>\nmake half with meat and half with spinach or other  vegies.  When we have <br/>\nhamburgers, we just make some of them vegie  burgers.<br/>\n <br/>\nSome other staples are pasta with various kinds of red or white sauces, a  <br/>\nvariety of cheeses, yogurts, hummus for dipping or just as a spread, peanut or  <br/>\nother nut butters as well as nuts in general provide protein. Beans are a  <br/>\ngreat source of protein and can also be used in most recipes. We also keep  <br/>\nprotein bars on hand and she will sometimes grab one on the way out the  door.<br/>\n <br/>\nI&#39;d suggest going to a natural food store in your area and just spend some  <br/>\ntime with her looking at all the options and try some new things each  week.  I <br/>\nthink you&#39;ll be surprised at how many options she has and how easy  it is to <br/>\nhave just part of your family vegetarian.<br/>\n <br/>\nGail<br/>\n<br/>\n<br/>\n<br/>\n************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":148983028,"authorName":"Lora Pek","from":"&quot;Lora Pek&quot; &lt;lcmpek@...&gt;","profile":"lcmpek","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"2"},"subject":"Re:I need Advice Please!","postDate":"1186403551","msgId":25538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMy1GMjlDRTk0MTlCMDk0N0M3ODUyN0RFMkQzRTUwQHBoeC5nYmw+"},"prevInTopic":25537,"nextInTopic":25539,"prevInTime":25537,"nextInTime":25539,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"I am new here, and this is my first post.  First off, my name is Lora and I have two boys, 7 and 4 and we are exploring unschooling and LOVE the idea of ","messageBody":"<div id=\"ygrps-yiv-1330964556\">I am new here, and this is my first post.  First off, my name is Lora and I <br/>\nhave two boys, 7 and 4 and we are exploring unschooling and LOVE the idea of <br/>\nincorporating this into our lives.<br/>\n<br/>\nAs far as your daughter, I would go to the library and let her explore some <br/>\nreceipe books on being basically a vegan.  There are a ton of receipe <br/>\nwebsites also.  I have eliminated meats, etc., from my diet and I feel great <br/>\nabout it.  It is actually easy once you get the hang of it.  My children are <br/>\nin the grocery store with me frequently saying, &quot;Mom, we are not eating meat <br/>\nanymore , right?  It is better to eat fruits and vegetables.&quot;  They are so <br/>\nsweet!  :-)  We enjoy exploring new tastes and foods.<br/>\n<br/>\nAs far as supplements go, there are a ton out of them.  We personally use <br/>\nJuice Plus.  You can go to their website at www.juiceplus.com and read up on <br/>\nit.  We love it.<br/>\n<br/>\nHope that helps.<br/>\n<br/>\nLora<br/>\n<br/>\n_________________________________________________________________<br/>\nA new home for Mom, no cleanup required. All starts here. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.reallivemoms.com?ocid=TXT_TAGHM&loc=us\">http://www.reallivemoms.com?ocid=TXT_TAGHM&loc=us</a></div>","specialLinks":[]},{"userId":188898029,"authorName":"Kelly","from":"&quot;Kelly&quot; &lt;CraftyGardenerTN@...&gt;","profile":"craftymommatn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I need Advice Please!","postDate":"1186379395","msgId":25528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5NmNxMyt1NjNqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25531,"prevInTime":25527,"nextInTime":25529,"topicId":25528,"numMessagesInTopic":0,"msgSnippet":"I need ideas, advice, help, info.....lol....ANYTHING! Okay, my daughter has made the decision, and has been pondering it for a couple years actually, to not","messageBody":"<div id=\"ygrps-yiv-1292916340\">I need ideas, advice, help, info.....lol....ANYTHING! Okay, my <br/>\ndaughter has made the decision, and has been pondering it for a <br/>\ncouple years actually, to not eat meat. No beef, poultry, fish and so <br/>\non. She said she just cannot stand the thought any longer of animals <br/>\nbeing killed for her food. While many I know do not have the same <br/>\nfeelings about this and many do, she does. She is 13 years old and is <br/>\nvery sweet. She is not doing this for any other reason than the one <br/>\nmentioned. She has also informed me that is the eggs we eat &quot;could&quot; <br/>\nbecome chickens if we did not eat them then she no longer wants to <br/>\neat those as well.<br/>\n<br/>\nShe actually tried this a couple years ago and we did not think much <br/>\nof it because we thought it would go a couple days, maybe even a week <br/>\nor so but would end. She went 6 months, but ate fish and eggs, and <br/>\nsaid she could not stand the feeling of being constantly hungry as <br/>\nwell as a sick feeling as well as tired all the time.<br/>\n<br/>\nNow I should also mention that she is a VERY picky eater which does <br/>\nnot make this any easier. She said she will try and learn to like <br/>\nfoods she does not currently like. She does not eat lettuce, <br/>\ntomatoes, cucumbers, apples, carrots, pears, radishes.....I am sure <br/>\ntheir is more.<br/>\n<br/>\nCan anyone offer any ideas on what I can feed her? What about <br/>\nsupplements? ANY info is greatly appreciated. It does not matter if <br/>\nit is a recipe, a way to eat, vitamin ideas, tips...anything. The <br/>\nmore the better as I know my daughter is mature enough to make this <br/>\ndecision and even if she is unable to keep with it I know she <br/>\ndesperately wants to and I want to do anything I can to help. I am <br/>\ncurrently on the path to a healthier me as it is so it would not hurt <br/>\nme either. Thank you soooo much for any info you can offer and I am <br/>\nsorry if you see this post on another group as I am just posting this <br/>\nto the ones I belong to to try and get as much advice as I can!<br/>\n<br/>\nThanks so much!<br/>\n<br/>\n<br/>\nKelly in TN</div>","specialLinks":[]}],"prevTopicId":25524,"nextTopicId":12524}}