{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":254628017,"authorName":"LR","from":"&quot;LR&quot; &lt;zanyzingzap@...&gt;","profile":"zanyzingzap","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I think I got something right ;) (long lead in)","postDate":"1191691942","msgId":26820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzkwMWM4MDgzZSRkYTlhMjliMCQ2NDAxYThjMEBTb3JjaGE+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":26819,"nextInTime":26821,"topicId":26820,"numMessagesInTopic":0,"msgSnippet":"Feeling pretty good today. DH just returned from a deployment. As happy a time as reconnecting is, it is not without stress of its own. Over the years we have","messageBody":"<div id=\"ygrps-yiv-2137714767\">Feeling pretty good today. DH just returned from a deployment. As happy a<br/>\ntime as reconnecting is, it is not without stress of its own. Over the years<br/>\nwe have worked hard are recognizing and identifying those times to be extra<br/>\nalert. I think we have done a pretty good job at that. I know this is a long<br/>\nlead in but please bear with me.I want to get the whole thing out because it<br/>\nhelps me deepen my understanding of the processes I am trying to work with. <br/>\n<br/>\n <br/>\n<br/>\nAnyway, ds has recently got into Pokemon in a major way. Thanks to all I<br/>\nhave learned here and from other sources, I found myself willing to support<br/>\nthat as much as I can find ways to do so. It is fun! I enjoy a lot of the<br/>\nPokemon stuff now that I have learned about it. (Much to the chagrin of many<br/>\npeople I know who think I am insane for encouraging his &quot;obsession&quot; when I<br/>\ntalk about his &quot;passion&quot; for all things Pokemon! And are now upset their<br/>\nkids want them to learn it too!) So sure there are times when the money to<br/>\nget the all the brand new stuff hasn&#39;t been equivalent to the amount of<br/>\nitems desired. We are keeping a list and keeping our eyes/minds open for<br/>\nother ways to get those things. We lucked out and found three Pokemon themed<br/>\nboard games for free in an unexpected place! We have traded some<br/>\nunneeded/unwanted items for Pokemon stuff, we bought a bunch of stuff right<br/>\nthen when the extra $$ was available rather than waiting for the b-day,<br/>\nChristmas etc. we have had lots of chats to find ways to get as much as he<br/>\nwants as we can. So I feel good. It hasn&#39;t been totally snafu free and I<br/>\nfeel good about how much different it has been than in the past. I like<br/>\nseeing this at work. <br/>\n<br/>\n <br/>\n<br/>\nOne of the issues this exuberance brought up is the amount of stuff spread<br/>\nout around the house. I know this topic has been covered in depth on various<br/>\nunschooling boards/sites so I keep going back and re-reading posts/articles<br/>\nwhen I feel myself getting overwhelmed. We have created a number of areas<br/>\nthat are ds &quot;zones&quot;. areas that he can do with as he wishes with no<br/>\ninterference from me (other than making holes in the wall bigger than small<br/>\nnails to hang stuff, that is a requirement of our lease and I don&#39;t want to<br/>\npay damages when we leave here.and it hasn&#39;t presented a problem because<br/>\nthere hasn&#39;t been any reason he wanted to make bigger holes there than<br/>\nthat.) These zones have been created thru discussion between ds and me. I<br/>\nexplained how I love that he has so many things related to Pokemon to enjoy<br/>\nand that I enjoy having them out where he can get to them easily any time he<br/>\nwants. And I explained that because I do best when I get up and exercise<br/>\nfirst thing in the morning I find myself really grumpy when I have to move<br/>\nso many things in order to clear the space I utilize for exercise. I asked<br/>\nhim if he is willing to help come up with a way we can both have what we<br/>\nwant in this area and not impede each other&#39;s use. Before I even mentioned<br/>\nany of my ideas, he asked if he could have one of the empty totes to put<br/>\neverything into at the end of the day (whenever he gets ready for bed) that<br/>\ncan be left downstairs so he can get them out when he gets up in the<br/>\nmorning. WOW! I readily agreed. It was even more simple than some of the<br/>\nideas I came up with. It has been working great! Mainly because as laid back<br/>\nas I am about so many things, and how I am about function over form when it<br/>\ncomes to the house, (I don&#39;t care about disorganization for the most part)<br/>\nthere are times when I just want to be able to come down the stairs and have<br/>\nthe area in front of the tv clear so I can use my videos. I have tried<br/>\nhaving it in other areas so we didn&#39;t need to go there and both ds and I<br/>\ndidn&#39;t like the way those tries worked out.  Really though, that is all<br/>\nstuff I feel I have a pretty good handle on already. <br/>\n<br/>\n <br/>\n<br/>\nDS also really likes to keep packaging that his stuff comes in. This has<br/>\nbeen a struggle for me for a long time (his whole life since he has almost<br/>\nalways liked the packages as much as the toys from a very early age.)<br/>\nbecause packaging could easily overtake our whole house if we kept all of<br/>\nthem (small housing with no real &quot;storage&quot;). So about a year ago I asked<br/>\nwhat it was about the packages he wants to hang on to. He explained it is<br/>\nthe pictures they put on the packages. I asked what he thinks about cutting<br/>\nthe packaging to keep just the pictures and recycling the rest. He thought<br/>\nthat a good idea so we have done that since with a few exceptions that were<br/>\nmutually agreed upon. <br/>\n<br/>\n <br/>\n<br/>\nYesterday, ds used some b-day money to buy two Pokemon toys we had been<br/>\nkeeping a lookout for. As usual he wanted to keep the packaging and I asked<br/>\nif he wanted the whole package (there are times when this is so and we have<br/>\ndone what we can to accommodate that) and he said it was just the pictures<br/>\non the back that he wanted. So we took those home with us (we open toys as<br/>\nsoon as we leave the store most times, especially when we have more stops to<br/>\nmake like yesterday) and cut out the part he wanted as soon as we got home.<br/>\nWhen he had everything out I asked if he is willing to keep those in the<br/>\ntote with everything else that goes in there so the area I need in the<br/>\nmornings could be clear. He said that was ok with him. So anyway, I went to<br/>\nbed before he and dh last night. When I came down this morning, everything<br/>\nwas left out. I hadn&#39;t slept well (ds woke up with the first &quot;bad&quot; dream he<br/>\nhas had in over a year) and am still wiped out from the way my last two<br/>\nweeks have gone (dealing with a friend&#39;s miscarriage, watching her 3yo, 2yo<br/>\nand 9mo kids which was a huge challenge for me, not knowing about dh for no<br/>\ncontact for a week. etc.) so I was thrown back into old stuff pretty easily<br/>\nthis morning when there was a bunch of stuff everywhere including DVD&#39;s, PS2<br/>\ngames/covers, books and pokemon stuff including the new packaging. I found<br/>\nmyself grumbling and pissed off and wanting to throw it all in the trash<br/>\ncan. And then I had an AH-HA moment. I realized I hit on something deep<br/>\nwithin myself, it had very little to do with what was in front of me and the<br/>\nbest I could do was to just move it aside, or put it away myself or just not<br/>\nworry about it and try exercising later after ds and dh were up. I chose to<br/>\nmove it aside though still feeling pretty put out about the whole thing.<br/>\n(now hours later I see how in the big picture, it was such a little thing<br/>\nand my reaction so exaggerated.) <br/>\n<br/>\n <br/>\n<br/>\nSo I called my Dad. Usually he is my biggest supporter for learning about<br/>\nthis stuff and generally agrees with the stuff I try to do to deepen my<br/>\nconnection with ds. So how shocked was I when he started telling me to throw<br/>\nit away or put it away and &quot;make&quot; ds &quot;buy it back&quot; and some other<br/>\nsuggestions just as harsh? I about hit the freaking floor, I felt nauseous<br/>\nand angry and dumbfounded. Now I realized how much of my uneasiness with all<br/>\nof the &quot;mess&quot; all along had to do with how it was handled when I was a kid.<br/>\nI remembered when I was as kid, keeping all my schoolwork in files and my<br/>\nmother pitching a git one day because she wanted me to get rid of them and<br/>\nclean my room and taking them all and throwing everything in my room onto<br/>\nthe floor and then beating me on the rear when I tried to stop her. <br/>\n<br/>\n <br/>\n<br/>\nI also realized that my dad is now projecting a lot of bullsh*t stuff he is<br/>\ndealing with related to this 86 year old woman he lives with and helps out<br/>\nonto ds. I wanted to scream. A whole bunch of stuff like that related to my<br/>\nchildhood came flooding back into my conscious memory. I cried and cried. I<br/>\nstill need to go back and talk to my Dad about how much that kind of stuff<br/>\nhurt. I didn&#39;t agree to do any of that with ds and I didn&#39;t directly oppose<br/>\nhim on it. I am actually doing a good job of not beating myself up over that<br/>\ntoo. I was shocked and it is ok that I didn&#39;t directly oppose it in that<br/>\nmoment. I know I will get to that place that I feel strong enough in my<br/>\nconvictions about unschooling to speak in the moment. For now at least my<br/>\nawareness is kicking in.  I am actually glad I called my Dad, dong so<br/>\npresented me with the opportunity to work through a whole bunch of that<br/>\nbefore ds got up. I ended up being able to just pick it all up and put it in<br/>\nthe tote, put the games and movies in their homes and create my workout<br/>\nspace. When ds came downstairs, he saw it was all different and immediately<br/>\nsaid he was sorry he forgot to put stuff away (not that I expected him to or<br/>\nasked him to, he did it before I even said good morning to him). I was able<br/>\nto genuinely say to him that it was no biggie, I just did it so I could work<br/>\nout and we had a great morning! <br/>\n<br/>\n <br/>\n<br/>\nEven now typing this out I feel more stuff coming up and I know I have more<br/>\nwork to do on myself. I just feel so grateful that I have come far enough<br/>\nalong on this path I was able to keep from passing that crap on in this<br/>\nmoment for another generation to deal with. I may end up passing a bunch of<br/>\nother stuff (hopefully not though!) on that I am yet to become aware of and<br/>\nit feels good to know for once I feel like I really got it about unschooling<br/>\nand deschooling and choosing the path of joy and genuine connection with ds<br/>\nrather than imposing my ideas on him. <br/>\n<br/>\n <br/>\n<br/>\nI just thought it might be nice to share that on here. I have a feeling this<br/>\nis the place other people are most likely to get &quot;it&quot; why it is so huge for<br/>\nme to notice the way today has gone. <br/>\n<br/>\n <br/>\n<br/>\nI hope you are all having a wonderful weekend.<br/>\n<br/>\n <br/>\n<br/>\nlisa<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26813,"nextTopicId":26824}}