{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":30,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Progression","postDate":"1260963098","msgId":42420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFOENBQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42419,"nextInTopic":0,"prevInTime":42419,"nextInTime":42421,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"Even for us, who started early (from birth), going from the educational unschooling model to expanding it to all of life was a progression. Things like","messageBody":"<div id=\"ygrps-yiv-1030564793\">Even for us, who started early (from birth), going from the<br/>\n&#39;educational&#39; unschooling model to expanding it to all of life was a<br/>\nprogression. Things like bedtimes, punishment (time out, removing toys,<br/>\netc), hygiene, etc still had a learning curve to them for us. But, since<br/>\nwe trusted that DS would learn and we never limited his food or media<br/>\n(trusted him to know when he was hungry, when he&#39;d had enough Big, Comfy<br/>\nCouch, etc) everything else is called into question. We&#39;d chew on ideas,<br/>\nplay &#39;devil&#39;s advocate&#39; scenarios between us, etc. We got most of it<br/>\n&#39;figured out&#39; by the time that DS was about 5 (so it took us 5 years).<br/>\nBut, there&#39;s always something new, some new developmental change, etc.<br/>\nthat pops up - for instance, right now DS is heading into puberty (he&#39;s<br/>\n11) so that&#39;s all new territory for us. The framework is there already<br/>\n(trust, discussion, openness, etc) but how it applies to new<br/>\nsituations/circumstances still takes time and work. It&#39;s a relationship<br/>\nand all relationships require work to keep them healthy and whole.<br/>\n<br/>\n--Deb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Progression","postDate":"1260914773","msgId":42419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhnOTE4bCtjZmkwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhnNjIxaythZ3VuQGVHcm91cHMuY29tPg=="},"prevInTopic":42417,"nextInTopic":42420,"prevInTime":42418,"nextInTime":42420,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... **************** I came to unschooling later in Ray s life but early in Mo s. There certainly was a logical progression, but in my case it was a","messageBody":"<div id=\"ygrps-yiv-1569191742\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;riverkatie&quot; &lt;riverkatie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;for those who have come to these ideas later, did you find a logical progression of ideas or did you arrive at radical unschooling all of a heap?<br/>\n </span></blockquote>****************<br/>\n<br/>\nI came to unschooling later in Ray&#39;s life but early in Mo&#39;s. There certainly was a logical progression, but in my case it was a progression of my ideas about adult relationships and learning and slowly coming to see that they could apply to relationships between parents and children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then he has asked me to stop the maths, so, with worry, I did. Then he asked me to teach him percentages. &quot;I know how to find 10% of something, but what if I wanted to know, say 8% of 4672?&quot; I asked him why he wanted to know, and he said he just did. So we are doing percentages right now (Key to Percentages). <br/>\n </span></blockquote>*******************<br/>\n<br/>\nSome kids find those kinds of puzzles fascinating (some adults, too)! Mo&#39;s currently fascinated with multiplication, squares and square roots, and really big numbers. She&#39;s also interested in dinosaurs and space right now, so she has lots of chances to play with really big numbers in those contexts - billions of miles and billions of years, what&#39;s the next biggest after billions, mom? Er... let me tell you about scientific notation...<br/>\n<br/>\nRay, otoh, is more practical in his interest in mathematics. He wants to know how to figure sales tax when he sells his wood and metal work, how to figure fractions of inches for some of his designs, that sort of thing. He wants real world math, the kind that revolves around tools and doing things, not math as a fantastic puzzle. In a way, that&#39;s a whole different kind of mathematics because its dependent on the tools themselves. Technical trades, and the maths they employ, tend to revolve around those tools.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Now I am wondering if the next step is radical unschooling, have people found this follows logically on from unschooling? <br/>\n </span></blockquote>******************<br/>\n<br/>\nSome people definitely do find that! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gettingit\">http://sandradodd.com/gettingit</a><br/>\n<br/>\nI&#39;d have to say that, for me personally, that both ideas of unschooling &quot;academics&quot; and unschooling &quot;life&quot; grew in ways that swirled together and overlapped. Some parts made sense before other parts - like I could trust my kids to learn but not always myself to be their partner without interfering. In a sense, until I really internalized the idea of living a life based on my own principles I didn&#39;t trust myself to be a good model (and therefore I &quot;had to&quot; teach). I think that&#39;s were a lot of the idea of &quot;teaching&quot; kids life lessons comes from. You know the saying: do as I say, not as I do. And I bet you know how well that works, too ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Already i can see that my son knows quite well how to live his own life, his own way, yet somehow I find it so hard to let go of my notions that somehow it is &#39;good&#39; for kids to do chores etc.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIn what way(s) is it good? Really think about that. Make a list if it helps. Break it down into bits, too. If &quot;responsibility&quot; is on that list, think about what you mean by the word - what is &quot;responsibility&quot; made of? Pulling things apart and getting to the heart of what I meant by my own ideas helped me to see where my thinking was very muddy. I realized I had a whole lot of stuff in my head that was there because I&#39;d heard certain truisms over and over and just assumed they were true! But when I started digging down into what I really thought and meant and knew to be true (in the sense of real causes-and-effects) it was easier to see where those truisms were fallacies - things &quot;everyone knows&quot; because &quot;everyone&quot; says them and Nothing else.<br/>\n<br/>\nThinking about my own principles, I&#39;ve moved away from overarching ideas like responsibility and even respect and freedom. Instead, I think about kindness and generosity, about joyfulness and warmth and bringing more of those into my life. Demanding another person do something (for me, for the group, for the sake of some higher ideal) doesn&#39;t add any of those things to my life, or that other person&#39;s life. My kids aren&#39;t happier for my demands. But when I give generously to my kids, they do nice things for me. The 16yo does nice, houseworky things. The 8yo makes me nice presents. They give kindness and warmth back to me. They smile and my house is full of joy. <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/newview\">http://sandradodd.com/peace/newview</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":256450034,"authorName":"riverkatie","from":"&quot;riverkatie&quot; &lt;riverkatie@...&gt;","profile":"riverkatie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Progression","postDate":"1260817268","msgId":42417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhnNjIxaythZ3VuQGVHcm91cHMuY29tPg=="},"prevInTopic":20947,"nextInTopic":42419,"prevInTime":42416,"nextInTime":42418,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"Another question! I know many of you experienced people started radical unschooling before your children were even born (I mean those ideas were part of your","messageBody":"<div id=\"ygrps-yiv-1788220318\">Another question!<br/>\n<br/>\nI know many of you experienced people started radical unschooling before your children were even born (I mean those ideas were part of your ideological makeup before you had kids)but for those who have come to these ideas later, did you find a logical progression of ideas or did you arrive at radical unschooling all of a heap?<br/>\n<br/>\nWe started looking at unschooling when my son said he didn&#39;t have time for school. This was startling to me as I had cheerfully assumed that he somehow needed me to fill his day for him (yes, I&#39;m sorry, I know....)Then we started relaxing a lot. I required maths, but that was all, he and I lived our days together. he makes stop motion movies, and i make bags to sell at the local market, and all goes well.<br/>\n<br/>\nThen he has asked me to stop the maths, so, with worry, I did. Then he asked me to teach him percentages. &quot;I know how to find 10% of something, but what if I wanted to know, say 8% of 4672?&quot; I asked him why he wanted to know, and he said he just did. So we are doing percentages right now (Key to Percentages). <br/>\n<br/>\nNow I am wondering if the next step is radical unschooling, have people found this follows logically on from unschooling? Already i can see that my son knows quite well how to live his own life, his own way, yet somehow I find it so hard to let go of my notions that somehow it is &#39;good&#39; for kids to do chores etc. <br/>\n<br/>\nKate</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sweets","postDate":"1169526276","msgId":20947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjIwMWM3M2VhNiQ2NDQ3ODM1MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20944,"nextInTopic":42417,"prevInTime":20946,"nextInTime":20948,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"***We take a few Tripp s a week to Super Wal-mart where we walk, or I ride on the electric cart while she walks around and around! But I just feel like it s","messageBody":"<div id=\"ygrps-yiv-757487371\">***We take a few Tripp&#39;s a week to Super Wal-mart where we walk, or I ride <br/>\non the electric cart<br/>\nwhile she walks around and around! But I just feel like it&#39;s not helping her <br/>\nto<br/>\nlose the weight. ***<br/>\n<br/>\nStop focusing on her weight and focus on her health.   Help her mental <br/>\nhealth, by getting out of the house and being with friends and doing <br/>\ninteresting things,  Liven up your home life.  Borrow some new or different <br/>\nmusic from the library.   Show her some of the dances that were popular when <br/>\nyou were her age.  Borrow dance videos and try some of the steps,  Check out <br/>\nmusicals and sing!  See if some friends can lend you some games you haven&#39;t <br/>\nplayed before.  Find some puzzles at the second hand store.<br/>\n<br/>\nDon&#39;t think of physical activity as exercise for her weight, think of it as <br/>\nnourishment for her emotional state.  People need to move in order to feel <br/>\nreally good.  You need to find ways for her to be active, not to make her <br/>\nlose weight but because being sedentary contributes to depression and moving <br/>\nhelps alleviate stress.<br/>\n<br/>\nHelp her physical health by *adding* protein foods and other nutritious <br/>\nfoods and maybe a vitamin supplement to your diet rather than pressing her <br/>\nto limit foods.<br/>\n<br/>\nThe thing she needs most is for you to be in a  good mental state and for <br/>\nyou to be a good example.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sweets","postDate":"1169524653","msgId":20944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWUwMWM3M2VhMiQ5Y2IzMmE0MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":14519,"nextInTopic":20947,"prevInTime":20942,"nextInTime":20945,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"***Any pointers, I would love to hear them. I seem to be stuck...*** Do you have friends who could come pick her up and take her swimming, or horseback riding,","messageBody":"<div id=\"ygrps-yiv-628800973\">***Any pointers, I would love to hear them. I seem to be stuck...***<br/>\n<br/>\nDo you have friends who could come pick her up and take her swimming, or <br/>\nhorseback riding, or skating, or to the park?<br/>\nDo you have friends over who are fun and lively?<br/>\nDo you get invited to dinner with friends or to parties?<br/>\nDo you have a yard where you could put up a tetherball or basketball hoop?<br/>\nDo you belong to a church that has a youth group with organized activities <br/>\nshe can participate in?<br/>\nCan you take her to the pool even if you don&#39;t feel like swimming?<br/>\nCould she play basketball at the Y?<br/>\nDo you have a car?<br/>\nDo you live near a bus line?<br/>\nWould your disability allow you to take in laundry or ironing from your <br/>\nneighbors for a little extra money for the bus maybe?<br/>\nCould you take her and a friend out to parks and fun places so that even if <br/>\nyou couldn&#39;t play she&#39;d have a companion?<br/>\nDoes she have a bike?<br/>\nAre you able to walk to near-by interesting places, Chinese food markets, <br/>\nherb shops, gift stores, junk stores?<br/>\nAre you close to or can you get to a library?<br/>\nWhat kinds of things does your daughter like to do?<br/>\nWhat do you do at home for fun?   Do you play board games?  Does she like <br/>\nthe computer?  Does she have favorite kinds of movies and music?<br/>\nDoes she like to cook, sew, sculpt, draw, dance?<br/>\nDoes she like to read?<br/>\nDo you read together?<br/>\n<br/>\nYour situation does sound stressful.   Have you considered that you might be <br/>\ndepressed?<br/>\nAs difficult as it is, your disabilities don&#39;t abdicate you from the <br/>\nresponsibility of giving your daughter an interesting life.  Was she opposed <br/>\nto school, did she hate it?   I ask because if you can&#39;t provide her with a <br/>\nway out of the house and activities maybe it would be better for her to go <br/>\nto school.<br/>\n<br/>\nUnschooling only works well when we can offer up a more interesting world <br/>\nthan the schools can.   While that&#39;s not hard to do it does require a lot of <br/>\ntime and energy on the parents part.   If her life at home is dull or <br/>\nstressful and there&#39;s no way to go do interesting things, and you don&#39;t have <br/>\na time frame for when that might change, then I really don&#39;t know how this <br/>\ncould be good for her.<br/>\n<br/>\nBut maybe we didn&#39;t get a really accurate idea about her life from your <br/>\npost, so I&#39;m asking those questions because I think you&#39;ll get more ideas <br/>\nhere if people know what she likes to do and what you are able to help her <br/>\ndo.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":227479134,"authorName":"susan throssell","from":"&quot;susan throssell&quot; &lt;susanthrossell@...&gt;","profile":"susanthrossell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Progression","postDate":"1150228291","msgId":14519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNi1GNDZCQUJDRDFFNjU3RTc1NjI0MjY2REI4QzBAcGh4LmdibD4=","inReplyToHeader":"PDhDODU1RjAzOTQ4QkEyMS05RTQtNDRGMUBtYmxrLXI0MS5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":14048,"nextInTopic":20944,"prevInTime":14518,"nextInTime":14520,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I joined this list preety recently and so i m not sure if there have always been posts about the way replies are written and the offence that some","messageBody":"<div id=\"ygrps-yiv-1819139027\">Hi everyone,<br/>\n<br/>\nI joined this list preety recently and so i&#39;m not sure if there have always <br/>\nbeen posts about the way replies are written and the offence that some <br/>\npeople take.<br/>\n<br/>\nOnce again I want to reiterate that I&#39;ve found this group immensely helpful <br/>\nin my learning curve.  I bought &#39;the unschooling handbook&#39; months ago and <br/>\nwhen I received it I read it and hated it........i didnt think i&#39;d ever &#39;get <br/>\nto that place&#39;.<br/>\n<br/>\nToday I found the book buried amongst my ds&#39; Simpsons magazines and have <br/>\nflicked through it---now I &#39;get it&#39;.<br/>\n<br/>\nI&#39;m happy right now and wanted to share that, because i&#39;ve come a long way <br/>\nwith the help of reading posts on this list.  We are getting to be soo cool <br/>\nin our house its great!!<br/>\n<br/>\nthanks again, again, again<br/>\n<br/>\nsusan</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Sweets","postDate":"1149426988","msgId":14048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODU1RjAzOTQ4QkEyMS05RTQtNDRGMUBtYmxrLXI0MS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PEJBWTEwNi1GOTk5N0NBMjY5ODM2OEEyOTRFMjEyREI5NjBAcGh4LmdibD4="},"prevInTopic":14045,"nextInTopic":14519,"prevInTime":14047,"nextInTime":14049,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... From: susan throssell ","messageBody":"<div id=\"ygrps-yiv-822510259\">-----Original Message-----<br/>\n From: susan throssell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susanthrossell@...\">susanthrossell@...</a><br/>\n<br/>\n  He says he doesnt really like the way he feels, (although i&#39;m not sure <br/>\nhow<br/>\n  much i have influenced this opinion), and has said he wont eat sweets <br/>\nafter<br/>\n  6 as they stop him from feeling tired. Today he wanted sweets after 6, <br/>\nI<br/>\n  reminded him of his decision and left it at that.......he had the <br/>\nsweets.<br/>\n<br/>\n  I&#39;m just wondering how I should react when he starts behaving <br/>\ndifferently.<br/>\n  SHould I mention the sweets? SHould I keep reminding him of his <br/>\ndecision,<br/>\n  (not sure if he made this to please me). I really dont like sweets and <br/>\nso<br/>\n dont want to particularly eat them with him, is that ok?<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n  It *could* very well be the additives and not the sugar, but either <br/>\nway:<br/>\n<br/>\n  If he IS noticing that he feels yucky after eating something, that&#39;s <br/>\ngood!<br/>\n<br/>\n  Learning what makes us feel bad, good, and better is the first step to <br/>\nknowing what&#39;s best for us as individuals.<br/>\n<br/>\n I&#39;ll insert the pot thang here! &lt;G&gt;<br/>\n<br/>\n  Cameron was smoking marijuana. I guess I could have reacted like all <br/>\nthe mainstream parents I know and forbade it. Could have. Instead we <br/>\ntalked about it. I gave my reasons why not. He did his own research <br/>\npersonally and online. He had some good reasons why it wasn&#39;t harmful. <br/>\nMy two main reasons against were that it was illegal (and if caught, it <br/>\ncould mean fines/prosecution/prison time not to mention it could <br/>\njeopardize our unschooling) and it could hinder driving abilities. The <br/>\ncompromise was that he wouldn&#39;t smoke and drive (I would pick him up if <br/>\nhe called, which I did several times).<br/>\n<br/>\n  The other day he told me it made him feel bad the next day. Really <br/>\nbad. I&#39;ve never smoked, so I guess he meant hungover-bad. I don&#39;t think <br/>\nthat will stop him from taking a toke every now and then, but I know he <br/>\nwon&#39;t be in a Ridgemont High Fog all the time! &lt;G&gt; Essentially, he&#39;s <br/>\nquit. The bad feeling outweighs the initial good feeling. *His* choice.<br/>\n<br/>\n  Keeping our kids from things *we* perceive as dangerous or bad for us <br/>\ndoesn&#39;t have the same power as things *they* decide aren&#39;t good for <br/>\nthem. They&#39;re rational, smart human beings who need to feel their way <br/>\nabout in the world. They *want* to feel happy and healthy and strong.<br/>\n<br/>\n  If a child decides that a diet high in sugar makes him feel yucky, <br/>\nhe&#39;ll probably eat less sugar. He will probably *still* eat sugar---but <br/>\nonly when *he* decides the benefits outweigh the consequences.<br/>\n<br/>\n  I&#39;d probably gently remind him how he felt the last time he ate too <br/>\nmuch. But accept that he might not care this time. Each time will make <br/>\nit easier and easier for him to make his own decisions. It&#39;s not <br/>\nlife-threatening, right?<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot; <br/>\n~Frank Smith</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Making amends...","postDate":"1149410598","msgId":14045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDYwNDA0MDI1Mi4wMWM0MTZiOEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PEVQRURJQktLS0RDTkNQSElMSUpEQUVBQUdIQUEubXdheW5lanJAYmVsbHNvdXRoLm5ldD4=","referencesHeader":"PDY4NWIyZjIwNjA2MDMwNzU5aDc2Y2FiMzk2dDQ0ODczZGU1YTIwYmJiZmNAbWFpbC5nbWFpbC5jb20+IDxFUEVESUJLS0tEQ05DUEhJTElKREFFQUFHSEFBLm13YXluZWpyQGJlbGxzb3V0aC5uZXQ+"},"prevInTopic":14044,"nextInTopic":14048,"prevInTime":14044,"nextInTime":14046,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... This is what *I* would like to hear if *I* had an apology coming to me (and not one word more!): I m so sorry to have hurt you; I made a mistake and I was","messageBody":"<div id=\"ygrps-yiv-221656910\">At 22:41 6/3/2006, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;~~~~~something along the lines from the adult saying &quot;Honey I&#39;m sorry I<br/>\n&gt;grabbed the toy from you like that.  Next time I will help you w/ respect<br/>\n&gt;for your feelings.&quot;  or maybe &quot;.....Next time we will try to work things out<br/>\n&gt;differently with the toys.&quot;<br/>\n&gt;I agree that the explanation should be short enough so a child of two<br/>\n&gt;doesn&#39;t tune out a long explanation, but just &quot;I&#39;m sorry&quot; w/o any follow up<br/>\n&gt;statement doesn&#39;t seem to wholly connect the sequence that led up to the<br/>\n&gt;events.<br/>\n<br/>\n </span></blockquote>This is what *I* would like to hear if *I* had an apology coming to <br/>\nme (and not one word more!):<br/>\n<br/>\n&quot;I&#39;m so sorry to have hurt you; I made a mistake and I was wrong.  Is <br/>\nthere anything I can do to make amends?&quot;<br/>\n<br/>\nIf there had to be other words, I would want the words to show <br/>\nempathy for my &quot;loss&quot; (i.e., &quot;that must have been frightening to you <br/>\nwhen I did that&quot; or &quot;it must have been confusing when I told you it <br/>\nwas wrong to do that and then did it myself!&quot;).<br/>\n<br/>\nHere&#39;s my thinking on the subject, and it may sound a tad harsh, but <br/>\nhere it is:  The moment I lost it and made a grab for the toy myself, <br/>\nI temporarily gave up the moral authority to tell my son what he <br/>\nshould morally do!  Now, I have to demonstrate to him (or anybody I <br/>\nhad wronged) what &quot;making amends&quot; really means!  It doesn&#39;t just mean <br/>\nsaying sorry; it&#39;s putting your money where your mouth is and proving <br/>\nyou&#39;re sorry.  According to the Onelook quick definition, it <br/>\nmeans:  &quot;something done or paid in expiation of a wrong&quot; or &quot;a sum of <br/>\nmoney paid in compensation for loss or injury.&quot;  I think that&#39;s <br/>\nimportant to note, especially since this thread&#39;s title contains that word!<br/>\n<br/>\nSo, if I have bullied my kid, which comes~~unfortunately~~naturally <br/>\nto us parent-folks who are probably having to feel our way through an <br/>\nentirely different model of parenting than we saw, I really have to <br/>\ndo the right thing now.  I have to create a new model for myself (and <br/>\nmy kid) and do a different thing than the knee-jerk reaction would have me do.<br/>\n<br/>\nTruth is, I do come a little unhinged sometimes and say things or act <br/>\nin a way that I recognize to be more like my folks than the way I <br/>\nwant to be.  I&#39;m not too hard on myself &#39;cause I can understand why I <br/>\ndo it, and I forgive myself.  But, that does not mean I shouldn&#39;t <br/>\naccept full responsibility for my words and actions.  I *always* <br/>\nsincerely apologize to my son when these little events happen and <br/>\noffer to make amends (which is whatever *he* decides, not me).  At <br/>\nthe very least, I make sure I demonstrate empathy for him!  I do not <br/>\nget all didactic and wordy (like I&#39;m being right now!) and use them <br/>\nas &quot;teaching moments,&quot; though.  (Truthfully, *every moment* is a <br/>\n*learning* moment; had I *not* apologized, my son would have come <br/>\naway from the experience having learned something that may not be so <br/>\ndesirable, like &quot;Mom is just a big ole bully who says one thing and <br/>\ndoes another!&quot;)<br/>\n<br/>\nI believe that it really isn&#39;t about not making mistakes.  It&#39;s <br/>\nentirely about how we handle our mistakes when we inevitably make <br/>\nthem.  Actually, if they don&#39;t kill me, I tend to learn from my <br/>\nmistakes, so I don&#39;t mind &#39;em too much (of course, the smaller, the <br/>\nbetter!).  But, I think making mistakes is one of those things we (as <br/>\nlearning machines) need to do, and for my part I want to make them as <br/>\ngracefully as I can, if I can.  I also see myself as more of a model <br/>\nfor my son than a teacher, and it&#39;s not what I *say* but what I *do* <br/>\nthat really matters.<br/>\n<br/>\nWell, there&#39;s my $2 worth (inflation, you know).  Aren&#39;t you sorry <br/>\nyou asked?  ;-)<br/>\n<br/>\n~Marji (up at this ungodly hour before even the birds to begin <br/>\nworking.  Oh wait!  I just heard the first bird!!)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>_.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._<br/>\n<br/>\nMarji<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gaiawolf.org/\">http://www.gaiawolf.org/</a>&gt;GaiaWolf<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://launch.groups.yahoo.com/group/GaiaWolf/\">http://launch.groups.yahoo.com/group/GaiaWolf/</a>&gt;Join the GaiaWolf Mailing List<br/>\n<br/>\n<br/>\n&quot;The animals of this world exist for their own reasons.  They were <br/>\nnot made for humans any more than blacks were made for whites or <br/>\nwomen created for men.&quot;<br/>\n~Alice Walker<br/>\n_.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Making amends...","postDate":"1149407000","msgId":14044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjA0LjAxNDMyMC4yOTYwLjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":14043,"nextInTopic":14045,"prevInTime":14043,"nextInTime":14045,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"***Responding by directly quoting me is singling me out. *** Please don t take these discussions personally.  If you can t stand to be quoted then don t post.","messageBody":"<div id=\"ygrps-yiv-1524347474\">***Responding by directly quoting me is singling me out. ***<br/>\n<br/>\nPlease don&#39;t take these discussions personally.  If you can&#39;t stand to be<br/>\nquoted then don&#39;t post.  If you post something here it&#39;s up for<br/>\ndiscussion.  That&#39;s how it works. <br/>\n<br/>\nI think if you go back in a couple of days and read this thread again<br/>\nyou&#39;ll have a different perspective.   If not, then a couple of days will<br/>\nhave passed the topic will have moved on.  &lt;g&gt; <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":205555026,"authorName":"Renee McGraw","from":"&quot;Renee McGraw&quot; &lt;mwaynejr@...&gt;","profile":"dazynay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Making amends...","postDate":"1149388866","msgId":14043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVQRURJQktLS0RDTkNQSElMSUpEQUVBQUdIQUEubXdheW5lanJAYmVsbHNvdXRoLm5ldD4=","inReplyToHeader":"PDY4NWIyZjIwNjA2MDMwNzU5aDc2Y2FiMzk2dDQ0ODczZGU1YTIwYmJiZmNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":14037,"nextInTopic":14044,"prevInTime":14042,"nextInTime":14044,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... From: unschoolingbasics@yahoogroups.com [mailto:unschoolingbasics@yahoogroups.com]On Behalf Of Michelle/Melbrigða Ah, but you have two things going on","messageBody":"<div id=\"ygrps-yiv-917159510\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>]On Behalf Of Michelle/Melbrigða<br/>\nAh, but you have two things going on here.  You have your apology which<br/>\ntruly is separate from the incident that began with how you came to hit your<br/>\nson with a toy.  To him (and to me) they *are* two separate incidents.  He<br/>\ngrabbed a toy from another child (first incident)  You grabbed the toy from<br/>\nhim and hit him in the head (second incident)  You apologized for the second<br/>\nincident, but linked it to the first one by talking about it.  Therefore in<br/>\nhis little mind he thinks that he got hit by the toy because he took the toy<br/>\nfrom another child.<br/>\n<br/>\n~~~~~something along the lines from the adult saying &quot;Honey I&#39;m sorry I<br/>\ngrabbed the toy from you like that.  Next time I will help you w/ respect<br/>\nfor your feelings.&quot;  or maybe &quot;.....Next time we will try to work things out<br/>\ndifferently with the toys.&quot;<br/>\nI agree that the explanation should be short enough so a child of two<br/>\ndoesn&#39;t tune out a long explanation, but just &quot;I&#39;m sorry&quot; w/o any follow up<br/>\nstatement doesn&#39;t seem to wholly connect the sequence that led up to the<br/>\nevents.<br/>\nWhat do you you all think?  Would the statement above validate that the<br/>\nadult was wrong w/o trying to justify those actions or lay blame on the<br/>\nchild?<br/>\nI ask because I am guilty of reacting the exact same way in those<br/>\nsituations.<br/>\nIt really is a knee jerk reaction on my part that I would like to examine.<br/>\nThanks,<br/>\nRenee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Making amends...","postDate":"1149384314","msgId":14037,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0RDExNzk2LTYwMTQtNDgxOC1CQTkzLTkxNEU5RDg0M0U3M0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU1dDdscStrYjBhQGVHcm91cHMuY29tPg==","referencesHeader":"PGU1dDdscStrYjBhQGVHcm91cHMuY29tPg=="},"prevInTopic":14035,"nextInTopic":14043,"prevInTime":14036,"nextInTime":14038,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... I agree that kids need help understanding what s acceptable and what isn t, help in figuring out better ways to act. I also agree it s good to apologize","messageBody":"<div id=\"ygrps-yiv-2109865952\">On Jun 3, 2006, at 7:57 PM, freepsgal wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I see it like this:  My son just caused<br/>\n&gt; another child bodily harm which is definitely not okay with me.<br/>\n<br/>\n </span></blockquote>I agree that kids need help understanding what&#39;s acceptable and what  <br/>\nisn&#39;t, help in figuring out better ways to act.<br/>\n<br/>\nI also agree it&#39;s good to apologize when we&#39;ve done something wrong  <br/>\nto our kids.<br/>\n<br/>\nBUT ;-) in this instance, you can&#39;t effectively do both. If you say  <br/>\n&quot;You were wrong&quot; after saying &quot;I was wrong&quot; he&#39;s not going to hear  <br/>\neither one because you&#39;re effectively saying you were justified in  <br/>\ntaking the toy. You may have said you were wrong but the &quot;but&quot; says  <br/>\nit was okay because he was even more wrong. At that point he&#39;ll shut  <br/>\ndown listening because he&#39;s focusing on how wronged he is and that  <br/>\npart isn&#39;t being set right.<br/>\n<br/>\nHe&#39;s still figuring out social skills. He needs *help* in figuring  <br/>\nout better choices far more than he needs his faults pointed out.<br/>\n<br/>\nBut what he does fully grasp is that it&#39;s wrong for you to grab a toy  <br/>\nfrom him. And he&#39;ll understand (in his own way) an apology.<br/>\n<br/>\nWhat you&#39;re modeling for him with &quot;I was wrong but you were wrong  <br/>\ntoo&quot; in effect is that it&#39;s okay for him to say:<br/>\n<br/>\n&quot;I&#39;m sorry I kicked you but you didn&#39;t get my milk fast enough.&quot;<br/>\n<br/>\n&quot;I&#39;m sorry I lied, but I knew you wouldn&#39;t let me.&quot;<br/>\n<br/>\n&quot;I&#39;m sorry I got that girl pregnant, but opportunity and hormones  <br/>\novercame me.&quot;<br/>\n<br/>\n&quot;I&#39;m was wrong, but I was justified in doing it anyway.&quot;<br/>\n<br/>\nHe&#39;s going to make the same mistake again grabbing a toy. (And if he  <br/>\ndoesn&#39;t, then he didn&#39;t need his mistake pointed out!) You can use  <br/>\nfuture incidents to *help him find a better way to react*. That  <br/>\ninstance should have been for apologizing for what you did wrong.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Making amends...","postDate":"1149381211","msgId":14035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODU1ODVBNDFCMzdDRS0xNjA4LTdGM0ZAbWJsay1yNDMuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGU1dDhpYittNzJpQGVHcm91cHMuY29tPg=="},"prevInTopic":14033,"nextInTopic":14037,"prevInTime":14034,"nextInTime":14036,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... From: freepsgal  My kids were talking in complete sentences and carrying on full conversations at the age of 2 which some adults did","messageBody":"<div id=\"ygrps-yiv-2136092068\">-----Original Message-----<br/>\n From: freepsgal &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freepsgal@...\">freepsgal@...</a>&gt;<br/>\n<br/>\n My kids were<br/>\n talking in complete sentences and carrying on full conversations at<br/>\n the age of 2 which some adults did find creepy<br/>\n<br/>\n -=-=-=-=<br/>\n<br/>\n  I don&#39;t find it creepy at all, but I think it&#39;s important to realize <br/>\nthat some children who are speaking very early may not necessarily <br/>\nunderstand all that&#39;s said to them---they hear what you *say*, but <br/>\ndon&#39;t always understand what you *mean*.<br/>\n<br/>\n  At the same time, children who are very late to speak may deeply <br/>\nunderstand almost everything you say to them even though they never say <br/>\na word in return.<br/>\n<br/>\n And then there&#39;s everything in between! &lt;g&gt;<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot; <br/>\n~Frank Smith</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Making amends...","postDate":"1149379979","msgId":14033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1dDhpYittNzJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxMzEwMWM2ODcxZCRjMjNhMjY3MCQwMWZlYThjMEBzcXVpZD4="},"prevInTopic":14032,"nextInTopic":14035,"prevInTime":14032,"nextInTime":14034,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... Responding by directly quoting me is singling me out.  Another way to approach it would have been to reply directly to the original poster s note.  We all","messageBody":"<div id=\"ygrps-yiv-754835810\"><blockquote><span title=\"ireply\">&gt; *************Again, I&#39;m not singling you out, I&#39;m discussing<br/>\n&gt; something that was put forth to the list. It touched a chord with<br/>\n&gt; me because I have been on the receiving end of an apology that went<br/>\n&gt; on to show that if *I* hadn&#39;t done &quot;x&quot; then the person apologizing<br/>\n&gt; wouldn&#39;t have done &quot;y&quot; that needed an apology.<br/>\n&gt; Elissa Jill<br/>\n<br/>\n </span></blockquote>Responding by directly quoting me is singling me out.  Another way <br/>\nto approach it would have been to reply directly to the original <br/>\nposter&#39;s note.  We all have our own baggage.  I was responding from <br/>\nthe mother of a child who has been hurt by someone else who didn&#39;t <br/>\ncare that my child was hurt in the process.  It left him feeling <br/>\nlike he was a stupid, bad person (his actual words) because the boy <br/>\nhad been mean and then the mother took him away from my son.  I also <br/>\ntotally understand that very young children have short attention <br/>\nspans.  However, not ALL 2 year old children lack the ability to <br/>\nunderstand deeper communication.  For all we know, the original <br/>\nposter has a child much like my children.  Yes, obviously a <br/>\ndiscussion with a 2 year old would be different from a discussion <br/>\nwith a 14 year old.  I didn&#39;t mean to imply that.  What I was trying <br/>\nto say was that each of my children, ages 8, 9 and 14, could be <br/>\nconsidered too young for any discussion because they might not <br/>\nunderstand.  I know parents who feel that way.  I, however, do not <br/>\nfeel that way.  <br/>\n<br/>\nI&#39;m truly sorry I even entered into the conversation.  My kids were <br/>\ntalking in complete sentences and carrying on full conversations at <br/>\nthe age of 2 which some adults did find creepy and I totally forgot <br/>\nabout that until I read the responses to my note.  <br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Making amends...","postDate":"1149379066","msgId":14032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1dDdscStrYjBhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA2MDMwNzU5aDc2Y2FiMzk2dDQ0ODczZGU1YTIwYmJiZmNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":14029,"nextInTopic":14033,"prevInTime":14031,"nextInTime":14033,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... Yes, in formal grammar, BUT not in my real life.  Something can happen but something else can happen too.  I had to sit here and think about the usage of","messageBody":"<div id=\"ygrps-yiv-925999680\"><blockquote><span title=\"ireply\">&gt; actually, anytime you say the word &quot;but&quot; it negates everything you<br/>\n&gt; said before but.<br/>\n<br/>\n </span></blockquote>Yes, in formal grammar, BUT not in my real life.  Something can <br/>\nhappen but something else can happen too.  I had to sit here and <br/>\nthink about the usage of this word for about 15 minutes before I <br/>\ncould reply.  I have finally determined that I&#39;m using the <br/>\nword &#39;but&#39; in a slang manner I guess.  To you, I used the word <br/>\nincorrectly.  I apologize for my bad grammar.  I wonder if a <br/>\ntraditional schooler would find that a good argument for making sure <br/>\nchildren learn proper grammar and why unschooling wouldn&#39;t work well <br/>\nin the &quot;real world&quot;.  :)<br/>\n<br/>\nI never realized just how many definitions the word &#39;but&#39; has.  I <br/>\ngoogled for it and found this:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thefreedictionary.com/but\">http://www.thefreedictionary.com/but</a><br/>\n<br/>\nIt&#39;s very interesting!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ah, but you have two things going on here.  <br/>\n<br/>\n </span></blockquote>I do see your point because you explained it so clearly, however <br/>\n(notice I didn&#39;t use but) I absolutely wouldn&#39;t have considered that <br/>\nin my mind.  I see the two things as very related.  It&#39;s <br/>\nconsequences of behavior.  I see it like this:  My son just caused <br/>\nanother child bodily harm which is definitely not okay with me.  In <br/>\nan effort to help the situation, my first reaction is an <br/>\noverreaction and I try to take the toy away.  My son gets hit with <br/>\nthe toy so now we have 2 children hurt and I&#39;m feeling guilty <br/>\nbecause I handled the situation wrong.  I immediately hold my son, <br/>\ngive him a hug and apologize for him being hurt when I tried to take <br/>\nthe toy away.  [Here is where I would comfort my child and wait for <br/>\nhis tears to go away so he can be in functioning mode.]  Also, I let <br/>\nhim know that when he grabbed the toy away from the other child and <br/>\npushed him down, that little boy got hurt too.  When we overreact, <br/>\nbad consequences can happen.  See?  Mom overreacted and you got hurt <br/>\non accident.  You overreacted and the other child got hurt.  He had <br/>\nthe toy first and it&#39;s only proper to give it back to him and it&#39;s <br/>\nalso important to make sure he is okay because hurting someone and <br/>\nnot showing empathy is not okay.  I&#39;m not suggesting one <br/>\nchild &#39;mother&#39; the other, but a direct look and an apology is just a <br/>\ngood thing as I modeled when I apologized for grabbing the toy and <br/>\nit hitting my son.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also talks like you had following the &quot;but&quot; of your apology are<br/>\n&gt; something that should be done one on one later when he is calm,<br/>\n&gt; not emotionally charged and you can do with his attention not<br/>\n&gt; being on his bonked head.<br/>\n<br/>\n </span></blockquote>Oh my.  *lol*  I never meant to imply to kick him when he&#39;s down.  <br/>\nWhen I responded to the original poster, I was simply providing some <br/>\nexample words because she asked specifically, to quote her, &quot;...<br/>\n(what kind of words do you use)?&quot;  I suppose I&#39;m in error here <br/>\nbecause I wasn&#39;t blatantly clear to wait until the child is no <br/>\nlonger crying before talking the issue over with him. [I&#39;m going to <br/>\nedit the paragraph above now that I feel I need to add in a pause <br/>\nhere.]  It didn&#39;t even cross my mind that I would need to mention <br/>\nthat.  I guess I just felt like all moms would feel the same way.  <br/>\nSee how easy it is to assume?  In that situation, I would have first <br/>\nheld my child while also making sure the other child was okay, and <br/>\nafter the tears stopped I would have talked.  But I wouldn&#39;t wait <br/>\nuntil much later like at home because by then the situation may have <br/>\nbeen totally forgotten and the explanation meaningless.  Or maybe <br/>\nthat&#39;s just my children.<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Sweets","postDate":"1149375269","msgId":14029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MDMxNTU0bmE4YzZkNTF0Y2E2ZmJlYWZjYjMxMGFiY0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDIwMDYwNjAzMjAwNDM5Ljk4MTIyLnFtYWlsQHdlYjM3MjA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PEJBWTEwNi1GOTk5N0NBMjY5ODM2OEEyOTRFMjEyREI5NjBAcGh4LmdibD4JIDwyMDA2MDYwMzIwMDQzOS45ODEyMi5xbWFpbEB3ZWIzNzIwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":14020,"nextInTopic":14032,"prevInTime":14028,"nextInTime":14030,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... I couldn t agree more with this statement.  I recently found out that natural and artificial flavors is a keyword for MSG!  It s all the dyes, ","messageBody":"<div id=\"ygrps-yiv-663028748\">On 6/3/06, Tina Layne &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tinalayne@...\">tinalayne@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; HI there,<br/>\n&gt;<br/>\n&gt; I belong to the Feingold Association (feingold.org) and we are all<br/>\n&gt; positive that sugar and &quot;sweets&quot; aren&#39;t the problem with bad behavior such<br/>\n&gt; as swearing, shouting, crankiness, etc.  It&#39;s the fake stuff in the<br/>\n&gt; foods.  My kids eat sugary things frequently, and love chocolate, but they<br/>\n&gt; only eat natural products with nothing artificial, or homemade goodies, and<br/>\n&gt; the worse that we get is a belly ache from eating a little too much at a<br/>\n&gt; time.  The fakes are what send them off.<br/>\n<br/>\n<br/>\n </span></blockquote>I couldn&#39;t agree more with this statement.  I recently found out that<br/>\n&quot;natural and artificial flavors&quot; is a keyword for MSG!  It&#39;s all the dyes,<br/>\nflavorings, and perservatives that are prevelant in mass produced<br/>\nconvenience foods that are a problem.<br/>\n<br/>\nBut to reply to the OP.  Your son may need a few experimentations with<br/>\nsweets to truly understand that he doesn&#39;t like the effects of certain<br/>\nproducts on his body.  And this is a fairly new concept for him (and you.)<br/>\nIt&#39;s those repeated tapes that Kelly mentioned this week.  We still hear<br/>\nthose things going through our heads and unfortunately, we can&#39;t just &quot;tape<br/>\nover them&quot; and forget what used to be there.  When I was in college I hung<br/>\nout with an, well, eclectic crowd.  It was the theatre people.  So we had a<br/>\nmix of real odd-balls including a few guys who worked as drag queens on the<br/>\nweekends to fund their way through college (hated those guys - it was not<br/>\nfair for them to look more like a woman that I did LOL!)  Anyway, many of<br/>\nthem were more than casual drug users.  So one night at one of the members&#39;<br/>\napartments someone brought out some pot.  I thought, &quot;Heck, why not?&quot; and<br/>\ntried it.  HATED the way I felt the next morning.  But a few weeks later I<br/>\nused it again.  Again I HATED the way I felt the next morning.  Took me<br/>\nabout 4 tries to really listen to my body and allow myself to say, &quot;I<br/>\ndislike the way that I feel the next morning more than I like the way I feel<br/>\nthe night of.&quot;  Fortunately, I internalized all this or I probably would<br/>\nhave been a drug addict had I shared this with friends.  &quot;Ah, but if you are<br/>\nhigh all the time, then you don&#39;t have to worry about being down.&quot;<br/>\n<br/>\nI think food is the same way.  We have to truly experience discomfort and<br/>\nmake a decision about whether we want to feel that badly again. Your son<br/>\nwill be able to do that if he is given the opportunity to work it out<br/>\nhimself and if he sees you working through it as well.  I think most people<br/>\nin today&#39;s society have an unheatlhy relationship with food.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":229237531,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Making amends...","postDate":"1149365153","msgId":14015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0ODFFQkExLjIwNTA1QGdtYWlsLmNvbT4=","inReplyToHeader":"PDY4NWIyZjIwNjA2MDMwNzU5aDc2Y2FiMzk2dDQ0ODczZGU1YTIwYmJiZmNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDAwYjIwMWM2ODcwOSRiMzMyZTNiMCQwMWZlYThjMEBzcXVpZD4gPGU1czY1ZCs1MDEwQGVHcm91cHMuY29tPiA8Njg1YjJmMjA2MDYwMzA3NTloNzZjYWIzOTZ0NDQ4NzNkZTVhMjBiYmJmY0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":14011,"nextInTopic":14020,"prevInTime":14014,"nextInTime":14016,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... Okay, I tried to let this one go, but it got under my skin. ;)  I was hoping Kelly the resident grammar nazi would jump on it. But is a coordinating","messageBody":"<div id=\"ygrps-yiv-2134094771\">Michelle/Melbrigða wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; actually, anytime you say the word &quot;but&quot; it negates everything you said<br/>\n&gt; before but.<br/>\n<br/>\n<br/>\n </span></blockquote>Okay, I tried to let this one go, but it got under my skin. ;)  I was <br/>\nhoping Kelly the resident grammar nazi would jump on it.<br/>\n<br/>\n&quot;But&quot; is a coordinating conjunction that indicates exception or <br/>\ncontrast; it doesn&#39;t negate. But, it could cause someone to feel as if <br/>\neverything that came before was overwhelmed or overshadowed by the <br/>\nexception or contrast, which I&#39;m guessing is the point being made.<br/>\n<br/>\nSorry, I just chafed at the &quot;anytime&quot; absolute of the phrasing above...<br/>\n<br/>\n-- <br/>\n~~Danielle<br/>\nEmily (8), Julia (7), Sam (6)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.organiclearning.blogspot.com\">http://www.organiclearning.blogspot.com</a><br/>\n<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*<br/>\n<br/>\nConnections: ezine of unschooling and mindful parenting<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://connections.organiclearning.org\">http://connections.organiclearning.org</a></div>","specialLinks":[]},{"userId":265202862,"authorName":"Tina Layne","from":"Tina Layne &lt;tinalayne@...&gt;","profile":"tinalayne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Sweets","postDate":"1149365079","msgId":14020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjAzMjAwNDM5Ljk4MTIyLnFtYWlsQHdlYjM3MjA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEJBWTEwNi1GOTk5N0NBMjY5ODM2OEEyOTRFMjEyREI5NjBAcGh4LmdibD4="},"prevInTopic":14015,"nextInTopic":14029,"prevInTime":14019,"nextInTime":14021,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"HI there, I belong to the Feingold Association (feingold.org) and we are all positive that sugar and sweets aren t the problem with bad behavior such as","messageBody":"<div id=\"ygrps-yiv-2145901410\">HI there,<br/>\n   <br/>\n  I belong to the Feingold Association (feingold.org) and we are all positive that sugar and &quot;sweets&quot; aren&#39;t the problem with bad behavior such as swearing, shouting, crankiness, etc.  It&#39;s the fake stuff in the foods.  My kids eat sugary things frequently, and love chocolate, but they only eat natural products with nothing artificial, or homemade goodies, and the worse that we get is a belly ache from eating a little too much at a time.  The fakes are what send them off.<br/>\n<br/>\n  Basically, we eliminate artificial colors and flavors as well as the preservatives BHA, BHT, and TBHQ.  (All of these preservatives, fake colors, and fake flavors are petroleum based.) I had many of the same concerns that you mentioned with my children when they ate certain things, and this program has really helped.<br/>\n   <br/>\n  Are the sweets homemade?  Do they have anything artificial (example: M&M&#39;s in choc chip cookies, or artifical vanilla or other flavored extracts?) Are the sweets storebought? Are they full of fake colors or use artificial flavorings and vanillin?  These things will be listed on the labels of the foods. Could it be corn syrup causing the problem? CS doesn&#39;t affect everyone but some folks it does cause an allergic reaction close to the behavior you are talking about.  <br/>\n   <br/>\n  HTH!<br/>\n  Tina<br/>\n  <br/>\nsusan throssell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susanthrossell@...\">susanthrossell@...</a>&gt; wrote:<br/>\n  <br/>\nHi,<br/>\n<br/>\njust could do with some new advice,<br/>\n<br/>\nwe&#39;ve just become relaxed about food and my 8 year old is enjoying eating <br/>\nsweets without restriction.<br/>\n<br/>\nI have noticed that after eating them he starts swearing/shouting/acting out <br/>\nALOT more than normal.  I had up until recently limited his intake of <br/>\ncertain ingredients in foods because of this, but of course now dont want <br/>\nto.<br/>\n<br/>\nHe says he doesnt really like the way he feels, (although i&#39;m not sure how <br/>\nmuch i have influenced this opinion), and has said he wont eat sweets after <br/>\n6 as they stop him from feeling tired.  Today he wanted sweets after 6, I <br/>\nreminded him of his decision and left it at that.......he had the sweets.<br/>\n<br/>\nI&#39;m just wondering how I should react when he starts behaving differently.  <br/>\nSHould I mention the sweets?  SHould I keep reminding him of his decision, <br/>\n(not sure if he made this to please me).  I really dont like sweets and so <br/>\ndont want to particularly eat them with him, is that ok?<br/>\n<br/>\nIm sure this is going to be a common question. and Im hoping for the usual <br/>\nfantastic suggestions I have received/read.<br/>\n<br/>\nSusan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Secondary school education   Graduate school education   Home school education     Graduate school education online   High school education   Chicago school education <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nRing&#39;em or ping&#39;em. Make  PC-to-phone calls as low as 1¢/min with Yahoo! Messenger with Voice.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227479134,"authorName":"susan throssell","from":"&quot;susan throssell&quot; &lt;susanthrossell@...&gt;","profile":"susanthrossell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sweets","postDate":"1149362142","msgId":14011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNi1GOTk5N0NBMjY5ODM2OEEyOTRFMjEyREI5NjBAcGh4LmdibD4=","inReplyToHeader":"PDhDODU1NTdBREVCRUYwRS01MTQtNENEM0BtYmxrLXIzMC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":14010,"nextInTopic":14015,"prevInTime":14010,"nextInTime":14012,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"Hi, just could do with some new advice, we ve just become relaxed about food and my 8 year old is enjoying eating sweets without restriction. I have noticed","messageBody":"<div id=\"ygrps-yiv-1906748309\">Hi,<br/>\n<br/>\njust could do with some new advice,<br/>\n<br/>\nwe&#39;ve just become relaxed about food and my 8 year old is enjoying eating <br/>\nsweets without restriction.<br/>\n<br/>\nI have noticed that after eating them he starts swearing/shouting/acting out <br/>\nALOT more than normal.  I had up until recently limited his intake of <br/>\ncertain ingredients in foods because of this, but of course now dont want <br/>\nto.<br/>\n<br/>\nHe says he doesnt really like the way he feels, (although i&#39;m not sure how <br/>\nmuch i have influenced this opinion), and has said he wont eat sweets after <br/>\n6 as they stop him from feeling tired.  Today he wanted sweets after 6, I <br/>\nreminded him of his decision and left it at that.......he had the sweets.<br/>\n<br/>\nI&#39;m just wondering how I should react when he starts behaving differently.  <br/>\nSHould I mention the sweets?  SHould I keep reminding him of his decision, <br/>\n(not sure if he made this to please me).  I really dont like sweets and so <br/>\ndont want to particularly eat them with him, is that ok?<br/>\n<br/>\nIm sure this is going to be a common question. and Im hoping for the usual <br/>\nfantastic suggestions I have received/read.<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Making amends...","postDate":"1149361471","msgId":14010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODU1NTdBREVCRUYwRS01MTQtNENEM0BtYmxrLXIzMC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGU1czY1ZCs1MDEwQGVHcm91cHMuY29tPg=="},"prevInTopic":14000,"nextInTopic":14011,"prevInTime":14009,"nextInTime":14011,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... From: freepsgal  I must respectfully disagree.  I do not consider that but to be invalidating my apology.  My apology would be for","messageBody":"<div id=\"ygrps-yiv-1217866670\">-----Original Message-----<br/>\nFrom: freepsgal &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freepsgal@...\">freepsgal@...</a>&gt;<br/>\n<br/>\nI must respectfully disagree.  I do not consider that &#39;but&#39; to be<br/>\ninvalidating my apology.  My apology would be for MY bad behavior<br/>\nnot apologizing for the child&#39;s behavior.  I believe if you don&#39;t<br/>\ntell a child what made the situation bad, they may not understand<br/>\nwhat the apology is about, or what even caused the whole incident in<br/>\nthe first place.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nPossibly what caused the whole incident in the first place was to not <br/>\nleave a little sooner!<br/>\n<br/>\n&quot;I&#39;m sorry I tried to wrench that toy from your hand. That was wrong,&quot; <br/>\nwould have been enough.<br/>\n<br/>\n--=-=-=-<br/>\n<br/>\n I don&#39;t like the method of glossing over just because they are young.<br/>\n<br/>\n-=-=-<br/>\n<br/>\nNot glossing over, just not going on & on & on & on. A simple apology <br/>\n from you might have made a HUGE difference. For a two year old, a nine <br/>\nyear old, or a 43 year old! You were wrong. Let him hear that without <br/>\nall the other fluff. If he knows even *you* make mistakes, he&#39;ll feel <br/>\nempowered to do better and be better too.<br/>\n<br/>\n*Later* you could talk about reading his cues better---or if he&#39;s <br/>\nfeeling overwhelmed that he can come to you to leave and that you&#39;d DO <br/>\nthat immediately.<br/>\n<br/>\n*Later* you can discuss *why* it&#39;s wrong to wrench things from others <br/>\nor to yell or ...<br/>\n<br/>\n*Later* you can brainstorm about other possible solutions.<br/>\n<br/>\nBut *at the time* just saying &quot;I&#39;m sorry&quot; should suffice.<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot;  <br/>\n~Frank Smith</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Making amends...","postDate":"1149346784","msgId":13999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MDMwNzU5aDc2Y2FiMzk2dDQ0ODczZGU1YTIwYmJiZmNAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU1czY1ZCs1MDEwQGVHcm91cHMuY29tPg==","referencesHeader":"PDAwYjIwMWM2ODcwOSRiMzMyZTNiMCQwMWZlYThjMEBzcXVpZD4gPGU1czY1ZCs1MDEwQGVHcm91cHMuY29tPg=="},"prevInTopic":13997,"nextInTopic":14000,"prevInTime":13998,"nextInTime":14000,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... actually, anytime you say the word but it negates everything you said before but. My apology would be for MY bad behavior ... Ah, but you have two things","messageBody":"<div id=\"ygrps-yiv-1789998294\">On 6/3/06, freepsgal &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freepsgal@...\">freepsgal@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I must respectfully disagree.  I do not consider that &#39;but&#39; to be<br/>\n&gt; invalidating my apology.<br/>\n<br/>\n<br/>\n </span></blockquote>actually, anytime you say the word &quot;but&quot; it negates everything you said<br/>\nbefore but.<br/>\n<br/>\n My apology would be for MY bad behavior<br/>\n<blockquote><span title=\"ireply\"> &gt; not apologizing for the child&#39;s behavior.  I believe if you don&#39;t<br/>\n&gt; tell a child what made the situation bad, they may not understand<br/>\n&gt; what the apology is about, or what even caused the whole incident in<br/>\n&gt; the first place.<br/>\n<br/>\n<br/>\n </span></blockquote>Ah, but you have two things going on here.  You have your apology which<br/>\ntruly is separate from the incident that began with how you came to hit your<br/>\nson with a toy.  To him (and to me) they *are* two separate incidents.  He<br/>\ngrabbed a toy from another child (first incident)  You grabbed the toy from<br/>\nhim and hit him in the head (second incident)  You apologized for the second<br/>\nincident, but linked it to the first one by talking about it.  Therefore in<br/>\nhis little mind he thinks that he got hit by the toy because he took the toy<br/>\nfrom another child.<br/>\n<br/>\nAlso talks like you had following the &quot;but&quot; of your apology are something<br/>\nthat should be done one on one later when he is calm, not emotionally<br/>\ncharged and you can do with his attention not being on his bonked head.  You<br/>\ncould even start the conversation with something like, &quot;Everyone sure liked<br/>\nthat one toy today didn&#39;t they?  I wonder if we could find a few more of<br/>\nthem to put in the LLL toybag so that more kids can play with them and there<br/>\nmaybe we can avert some struggles next time.&quot; and then go about with a talk<br/>\nabout taking turns and how when there is only one we have to share.  Then<br/>\ncall whoever is in charge of the LLL toybag and ask if they know where that<br/>\none toy came from.<br/>\n<br/>\nI&#39;m having my own issues with LLL this week and seriously considering<br/>\nretiring as a Leader.  It&#39;s the moms that are keeping me from just throwing<br/>\nmy hat in and saying, &quot;Die you wretched beast!&quot;  But one of the issues that<br/>\nI have had for a while now has been the shift from &quot;unschooly breastfeeding&quot;<br/>\nto &quot;schooly discipline.&quot;  If you think about how babies and toddlers are<br/>\nrespected in regards to breastfeeding - on cue, self weaning, no clocks,<br/>\nmeet needs, etc and then how suddenly there are all these rules about how<br/>\nthey are supposed to behave and act and learn.  I&#39;ve been looking at some of<br/>\nthe material lately for &quot;gentle discipline&quot; and it truly reads like a &quot;how<br/>\nto prepare your child so that they will fit into school&quot; program.  I&#39;ve<br/>\nreally seen unstructured breastfeeding as the first part of a natural step<br/>\ntowards unschooling!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248268539,"authorName":"Elissa Jill Cleaveland","from":"&quot;Elissa Jill Cleaveland&quot; &lt;MystikMomma@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Making amends...","postDate":"1149346530","msgId":14000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMzEwMWM2ODcxZCRjMjNhMjY3MCQwMWZlYThjMEBzcXVpZD4=","referencesHeader":"PGU1czY1ZCs1MDEwQGVHcm91cHMuY29tPg=="},"prevInTopic":13999,"nextInTopic":14010,"prevInTime":13999,"nextInTime":14001,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"...  *******I know, I wasn t picking on you. I was struck by the wording of something posted and wanted to give","messageBody":"<div id=\"ygrps-yiv-1508486704\"><blockquote><span title=\"ireply\">&gt; I would cut out 90% of the words here when talking to a 2 year<br/>\n&gt; old.  I like the idea of using less words related to their age.<br/>\n<br/>\n </span></blockquote>&lt;&lt;Well, I did say &#39;or something like that&#39;. &gt;&gt;<br/>\n*******I know, I wasn&#39;t picking on you. I was struck by the wording of something posted and wanted to give my opinion on it.<br/>\n &lt;&lt;That type of explanation <br/>\nworked with all 3 of my children as toddlers.  I didn&#39;t need to talk <br/>\ndown to them because they were 2. &gt;&gt;<br/>\n**********I&#39;m not advocating talking down. I am advocating communication based upon development. Very small children have a smaller attention span that older children and adults. I have noticed that when I give a long explanation, after a while they get distracted. Keeping things simple is not the same as dumbing down.<br/>\n &lt;&lt;But then again, all kids are <br/>\ndifferent so what works with mine doesn&#39;t work with others. &gt;&gt; <br/>\n*********Of course! That&#39;s why I was responding to the content of the post because I have experienced a different way.<br/>\n&lt;&lt;I think <br/>\nthat&#39;s a given on a list like this.&gt;&gt;<br/>\n**********There are people here on all parts of the journey, some may not yet know these &quot;givens&quot;.<br/>\nI, personally, don&#39;t think there are any &quot;givens&quot;, only words that are written.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I would definately not say this part during my apology:<br/>\n </span></blockquote>I must respectfully disagree. <br/>\n I do not consider that &#39;but&#39; to be <br/>\ninvalidating my apology.  My apology would be for MY bad behavior <br/>\nnot apologizing for the child&#39;s behavior. <br/>\n I believe if you don&#39;t <br/>\ntell a child what made the situation bad, they may not understand <br/>\nwhat the apology is about, or what even caused the whole incident in <br/>\nthe first place. &gt;&gt;<br/>\n<br/>\nTelling a child a reason a situation became difficult is completely different than apologizing for hurting a child. <br/>\nAccidentally hurting someone has NOTHING to do with what happened before. I apologized recently to my DH for yelling. Even if DH did something awful that does not give me free license to scream and yell. <br/>\nI can apologize for one thing without implying that the other person made me do it. That excuse is used for horrible justifications. If she hadn&#39;t been wearing a short skirt and high heels, she wouldn&#39;t have gotten assaulted. If she had just listened I wouldn&#39;t have had to hit her, If you had just put away the dishes I wouldn&#39;t have had to yell in the first place and crap like that. If the two seperate statements are put into one paragraph, then the but is implied because the child will then put them together into If I hadn&#39;t tried to take away the toy then Mom wouldn&#39;t have tried to give it back accidentally hurting me in the process.<br/>\n&lt;&lt; I don&#39;t like the method of glossing over just <br/>\nbecause they are young. &gt;&gt;<br/>\n***********How is keeping explanations on a developmental level glossing over? <br/>\n&lt;&lt;The same thing could be said of all of them <br/>\nnow at the ages of 8, 9 and 14.  &gt;&gt;<br/>\n***************An explanation on a subject would be drastically different to a 2 year old than to a 14 year old,right?<br/>\n&lt;&lt; Again, this type of parenting is just my way of doing <br/>\nthings.  You may disagree but that doesn&#39;t make my way wrong, just <br/>\ndifferent.  :)&gt;&gt;<br/>\n*************Again, I&#39;m not singling you out, I&#39;m discussing something that was put forth to the list. It touched a chord with me because I have been on the receiving end of an apology that went on to show that if *I* hadn&#39;t done &quot;x&quot; then the person apologizing wouldn&#39;t have done &quot;y&quot; that needed an apology.<br/>\nElissa Jill<br/>\nA Kindersher saychel iz oychet a saychel.<br/>\n&quot;A Child&#39;s wisdom is also wisdom.&quot; ~Yiddish Proverb<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Making amends...","postDate":"1149344749","msgId":13997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1czY1ZCs1MDEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYjIwMWM2ODcwOSRiMzMyZTNiMCQwMWZlYThjMEBzcXVpZD4="},"prevInTopic":13996,"nextInTopic":13999,"prevInTime":13996,"nextInTime":13998,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... Well, I did say or something like that .  That type of explanation worked with all 3 of my children as toddlers.  I didn t need to talk down to them","messageBody":"<div id=\"ygrps-yiv-362127690\"><blockquote><span title=\"ireply\">&gt; I would cut out 90% of the words here when talking to a 2 year<br/>\n&gt; old.  I like the idea of using less words related to their age.<br/>\n<br/>\n </span></blockquote>Well, I did say &#39;or something like that&#39;.  That type of explanation <br/>\nworked with all 3 of my children as toddlers.  I didn&#39;t need to talk <br/>\ndown to them because they were 2.  But then again, all kids are <br/>\ndifferent so what works with mine doesn&#39;t work with others.  I think <br/>\nthat&#39;s a given on a list like this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would definately not say this part during my apology:<br/>\n<br/>\n </span></blockquote>I must respectfully disagree.  I do not consider that &#39;but&#39; to be <br/>\ninvalidating my apology.  My apology would be for MY bad behavior <br/>\nnot apologizing for the child&#39;s behavior.  I believe if you don&#39;t <br/>\ntell a child what made the situation bad, they may not understand <br/>\nwhat the apology is about, or what even caused the whole incident in <br/>\nthe first place.  I don&#39;t like the method of glossing over just <br/>\nbecause they are young.  The same thing could be said of all of them <br/>\nnow at the ages of 8, 9 and 14.  They are people, regardless of <br/>\ntheir ages.  Again, this type of parenting is just my way of doing <br/>\nthings.  You may disagree but that doesn&#39;t make my way wrong, just <br/>\ndifferent.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":248268539,"authorName":"Elissa Jill Cleaveland","from":"&quot;Elissa Jill Cleaveland&quot; &lt;MystikMomma@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Making amends...","postDate":"1149337915","msgId":13996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjIwMWM2ODcwOSRiMzMyZTNiMCQwMWZlYThjMEBzcXVpZD4=","referencesHeader":"PGU1cjFvMys2ZHJpQGVHcm91cHMuY29tPg=="},"prevInTopic":13993,"nextInTopic":13997,"prevInTime":13995,"nextInTime":13997,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"I am so sorry you got hurt.  I made a mistake.  I shouldn t have tried to get the toy from you like that.  I should have asked you nicely for it.  I know you ","messageBody":"<div id=\"ygrps-yiv-453984472\">&#39;I am so sorry you got <br/>\nhurt.  I made a mistake.  I shouldn&#39;t have tried to get the toy from <br/>\nyou like that.  I should have asked you nicely for it.  I know you <br/>\nwant to play with the toy, but you cannot take something away from <br/>\nsomeone else and it&#39;s really unacceptable to hurt someone by pushing <br/>\nhim down.  Let&#39;s make sure this little boy is okay and then we can <br/>\nfind another toy that you can play with.&#39;  Or something like that.<br/>\n**********<br/>\nI would cut out 90% of the words here when talking to a 2 year old. I like the idea of using less words related to their age. A two year old may start to tune out after a while, So &quot;I&#39;m sorry&quot; is probably sufficient.<br/>\nI would definately not say this part during my apology:<br/>\nI know you <br/>\nwant to play with the toy, but you cannot take something away from <br/>\nsomeone else and it&#39;s really unacceptable to hurt someone by pushing <br/>\nhim down.  Let&#39;s make sure this little boy is okay and then we can <br/>\nfind another toy that you can play with.<br/>\nLater, when all is calm, I would talk briefly about grabbing. I&#39;ve had people apologize to me and then in the same breath almost, point out what *I* did wrong, which somehow diminishes the apology. &quot;I&#39;m sorry I did that but You...&quot;<br/>\n<br/>\n<br/>\nElissa Jill<br/>\nA Kindersher saychel iz oychet a saychel.<br/>\n&quot;A Child&#39;s wisdom is also wisdom.&quot; ~Yiddish Proverb<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":87710633,"authorName":"julie","from":"&quot;julie&quot; &lt;juillet727@...&gt;","profile":"juillet727","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Making amends...","postDate":"1149320797","msgId":13993,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1cmVvdCtodWNiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+"},"prevInTopic":13991,"nextInTopic":13996,"prevInTime":13992,"nextInTime":13994,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"This reminds me of a time when my boy was little and he was yelling at me and I yelled at him to not yell at me!! Aaak! I stopped myself in mid yell and said,","messageBody":"<div id=\"ygrps-yiv-614690091\">This reminds me of a time when my boy was little and he was yelling <br/>\nat me and I yelled at him to not yell at me!! Aaak! I stopped myself <br/>\nin mid yell and said, &quot;Oh no, look at mommy, I&#39;m yelling at you to <br/>\nnot yell at me! That&#39;s not right. That doesn&#39;t make sense! I made a <br/>\nmistake and I&#39;m sorry.&quot; and my boy looked at me with a lightbulb <br/>\ngoing off in his head and he said,&quot;yeah, mommy, don&#39;t yell at me.&quot; <br/>\nand it was like I put into words what he already knew about the <br/>\nsituation. I wasn&#39;t being respectful to him. It&#39;s not right to yell <br/>\nat another person to get them to not yell at you. He was just too <br/>\nlittle to put it into words. I felt like it was important to say <br/>\nsorry and admit my mistake, but also put into words what the mistake <br/>\nwas. It seemed to help him. And me. <br/>\n~~Julie.<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lesa ODaniel&quot; <br/>\n&lt;lesaodaniel@...&gt; wrote:<br/>\n&lt;snipped&gt; my son went over to the other boy and <br/>\nwrenched <br/>\n<blockquote><span title=\"ireply\"> &gt; a toy from his hand with some sort of super strength and gave him a <br/>\n </span></blockquote>push <br/>\n<blockquote><span title=\"ireply\"> &gt; backward (which I&#39;ve never seen him do before). I don&#39;t know why or <br/>\n </span></blockquote>where it <br/>\n<blockquote><span title=\"ireply\"> &gt; came from, but I went over to my son and wrenched the toy from his <br/>\n </span></blockquote>hand to <br/>\n<blockquote><span title=\"ireply\"> &gt; give back to the other boy and during our struggle, he hit himself <br/>\n </span></blockquote>in the <br/>\n<blockquote><span title=\"ireply\"> &gt; eye with it.<br/>\n&gt; <br/>\n&gt; I felt HORRIBLE. I felt icky and still kind of do. How do you make <br/>\n </span></blockquote>amends <br/>\n<blockquote><span title=\"ireply\"> &gt; with a child this age (what kind of words do you use)? How long do <br/>\n </span></blockquote>you wait <br/>\n<blockquote><span title=\"ireply\"> &gt; to talk about it after you&#39;ve had an &quot;incident&quot;? By the way, how do <br/>\n </span></blockquote>you <br/>\n<blockquote><span title=\"qreply\"> &gt; handle sharing issues when it requires stepping in? </span></blockquote></div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Making amends...","postDate":"1149307459","msgId":13987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1cjFvMys2ZHJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+"},"prevInTopic":13982,"nextInTopic":13991,"prevInTime":13986,"nextInTime":13988,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"I am honest with my children when I make a mistake.  I explain what I did, why it was wrong and apologize with the hope that I ll learn from the mistake. In","messageBody":"<div id=\"ygrps-yiv-1875780835\">I am honest with my children when I make a mistake.  I explain what I <br/>\ndid, why it was wrong and apologize with the hope that I&#39;ll learn from <br/>\nthe mistake.  <br/>\n<br/>\nIn your situation, I might say something like &#39;I am so sorry you got <br/>\nhurt.  I made a mistake.  I shouldn&#39;t have tried to get the toy from <br/>\nyou like that.  I should have asked you nicely for it.  I know you <br/>\nwant to play with the toy, but you cannot take something away from <br/>\nsomeone else and it&#39;s really unacceptable to hurt someone by pushing <br/>\nhim down.  Let&#39;s make sure this little boy is okay and then we can <br/>\nfind another toy that you can play with.&#39;  Or something like that.<br/>\n<br/>\nI apologize as soon as I realize I&#39;ve made a mistake.  It&#39;s usually <br/>\nhelpful for my children to see how my emotions and reactions are mixed <br/>\ntogether.  Plus, I&#39;ve found that when I begin apologizing, any <br/>\nnegative emotions are tossed aside.  I feel humbled and can act more <br/>\nrationally.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":205756159,"authorName":"Lesa ODaniel","from":"&quot;Lesa ODaniel&quot; &lt;lesaodaniel@...&gt;","profile":"lesao2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Making amends...","postDate":"1149303357","msgId":13991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwMi1GMjQ3RTJEQTkxQ0Q4RDc1NDk3Q0E3QkIwOTYwQHBoeC5nYmw+","inReplyToHeader":"PDcuMC4xLjAuMC4yMDA2MDYwMjIwNTIxNy4wMWIyZDQ4OEBnYWlhd29sZi5vcmc+"},"prevInTopic":13987,"nextInTopic":13993,"prevInTime":13990,"nextInTime":13992,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"Lesa O Daniel, AAHCC Instructor, Bradley Method® of Natural Childbirth 323-541-5515 http://www.bradleybirth.com/ndweb.asp?ID=O123&Count=N ... Yeah, I did","messageBody":"<div id=\"ygrps-yiv-1475043327\">Lesa O&#39;Daniel, AAHCC<br/>\nInstructor, Bradley Method� of Natural Childbirth<br/>\n323-541-5515<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bradleybirth.com/ndweb.asp?ID=O123&Count=N\">http://www.bradleybirth.com/ndweb.asp?ID=O123&Count=N</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: marji &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marji@...\">marji@...</a>&gt;<br/>\n<br/>\n&gt;I think I would apologize to my son after this. &gt;<br/>\n<br/>\n </span></blockquote>Yeah, I did apologize and kissed and hugged him and we went into another <br/>\nroom to look at the baby pictures on the wall, etc. I just don&#39;t know if he <br/>\n*got* it that I was sorry, but, no, he doesn&#39;t *seem* to be holding a <br/>\ngrudge.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But, no matter what a kid&#39;s age, we really need to meet him where<br/>\n&gt;he&#39;s at.  There is no such thing as &quot;sharing&quot; for a kid that age, and<br/>\n&gt;that&#39;s probably why he felt okay to hike over there and wrench that<br/>\n&gt;toy out of the other kid&#39;s hand.  What must have been very confusing<br/>\n&gt;for him, though, was you saying that it was wrong for him to do<br/>\n&gt;that...and then you went and did the exact, same thing!  &gt;<br/>\n<br/>\n </span></blockquote>In my mind I know that sharing is just not in his realm right now. He <br/>\nusually is very willing to share and offer things to other kids. I guess I <br/>\njust keep falling back into the trap of wanting him to look like a <br/>\n*well-behaved* child - something I&#39;m trying to stop caring about. I&#39;m <br/>\nreading Alfie Kohn&#39;s &quot;Unconditional Parenting&quot; right now and it&#39;s starting <br/>\nto sink in and open my eyes, but I need to slow down in social situations <br/>\nand focus on him, not the other parents.<br/>\n<br/>\nThanks for the tips.<br/>\n<br/>\n_________________________________________________________________<br/>\nFREE pop-up blocking with the new MSN Toolbar � get it now! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://toolbar.msn.click-url.com/go/onm00200415ave/direct/01/\">http://toolbar.msn.click-url.com/go/onm00200415ave/direct/01/</a></div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Making amends...","postDate":"1149300517","msgId":13982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDYwMjIyMDEwNi4wMWMyMmQ1OEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PDhDODU0QzUzN0FFQ0NCMC0xOTU0LTVGRkFAbWJsay1yMjguc3lzb3BzLmFvbC5jb20+","referencesHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+IDw4Qzg1NEM1MzdBRUNDQjAtMTk1NC01RkZBQG1ibGstcjI4LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":13977,"nextInTopic":13987,"prevInTime":13981,"nextInTime":13983,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... What you said just reminded me of something that happened when Liam was about a year and a half old.  We were at some mom/kid thing that we used to go to","messageBody":"<div id=\"ygrps-yiv-1112679535\">At 21:36 6/2/2006, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;That was two year old speak for: &quot;I&#39;m tired, hungry, or ready to<br/>\n&gt;go home.&quot; Until he has better communication skills, you need to learn<br/>\n&gt;to speak two-year-old! &lt;bwg&gt;<br/>\n<br/>\n </span></blockquote>What you said just reminded me of something that happened when Liam <br/>\nwas about a year and a half old.  We were at some mom/kid thing that <br/>\nwe used to go to about every week.  Liam really liked it &#39;cause they <br/>\nhad cool toys that we didn&#39;t have that he really dug playing <br/>\nwith.  We moms would all hang around and talk (well, I would mostly <br/>\ndisagree, but that&#39;s another story!).  Anyway, one time we had just <br/>\ngotten there and I had just set my butt down on some little chair, <br/>\nbut Liam had clearly decided he did *not* want to be there.  So, what <br/>\nhe did was he found my sling and my backpack (amongst all the other <br/>\nmoms&#39; things) and dragged them over to me.  He didn&#39;t say one <br/>\nword.  His message was loud and clear, though:  &quot;Let&#39;s GO!&quot;  He never <br/>\nwanted to go back again, either!  What a guy!<br/>\n<br/>\n~Marji (who&#39;s grateful at least one of us knows how to communicate!) &lt;bwg&gt; <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Making amends...","postDate":"1149298566","msgId":13977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODU0QzUzN0FFQ0NCMC0xOTU0LTVGRkFAbWJsay1yMjguc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+","referencesHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+"},"prevInTopic":13973,"nextInTopic":13982,"prevInTime":13976,"nextInTime":13978,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... From: Lesa ODaniel  I felt HORRIBLE. I felt icky and still kind of do. How do you make amends with a child this age (what kind of","messageBody":"<div id=\"ygrps-yiv-1754329794\">-----Original Message-----<br/>\n From: Lesa ODaniel &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lesaodaniel@...\">lesaodaniel@...</a>&gt;<br/>\n<br/>\n  I felt HORRIBLE. I felt icky and still kind of do. How do you make <br/>\namends<br/>\n  with a child this age (what kind of words do you use)? How long do you <br/>\nwait<br/>\n  to talk about it after you&#39;ve had an &quot;incident&quot;? By the way, how do <br/>\nyou<br/>\n  handle sharing issues when it requires stepping in? I&#39;m usually pretty <br/>\nokay<br/>\n with the RU ideas and parenting philosophies and have let go of many<br/>\n  controls I had before. However, sometimes the sharing thing confuses <br/>\nme -<br/>\n  and ESPECIALLY in a situation with traditional parents I&#39;m kind of at <br/>\na loss<br/>\n  regarding how to step in... Thanks in advance. I&#39;m also posting this <br/>\nat<br/>\n AlwaysUnschooled, by the way.<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n  A child will let you know when he&#39;s ready to share. He&#39;ll share! &lt;g&gt; <br/>\nUntil then, he&#39;s not ready. Don&#39;t force it. It&#39;ll work against you.<br/>\n<br/>\n I agree with Marji: apologize as soon as possible.<br/>\n<br/>\n  But in this particular situation, you both should probably have left <br/>\n20 minutes earlier. You might want to start looking for his signs <br/>\nshowing he&#39;s just about ready to melt down.<br/>\n<br/>\n  He was probably hungry or tired or just over all the mom-talk that <br/>\nday. That was two year old speak for: &quot;I&#39;m tired, hungry, or ready to <br/>\ngo home.&quot; Until he has better communication skills, you need to learn <br/>\nto speak two-year-old! &lt;bwg&gt;<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot; <br/>\n~Frank Smith</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Making amends...","postDate":"1149296816","msgId":13973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDYwMjIwNTIxNy4wMWIyZDQ4OEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+","referencesHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+"},"prevInTopic":13970,"nextInTopic":13977,"prevInTime":13972,"nextInTime":13974,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"... I think I would apologize to my son after this.  Because kids are so blissfully in the moment, it s not too likely he s going to hang onto a grudge against","messageBody":"<div id=\"ygrps-yiv-560168164\">At 20:08 6/2/2006, Lesa wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;....I felt icky and still kind of do. How do you make amends<br/>\n&gt;with a child this age (what kind of words do you use)? How long do you wait<br/>\n&gt;to talk about it after you&#39;ve had an &quot;incident&quot;? By the way, how do you<br/>\n&gt;handle sharing issues when it requires stepping in? I&#39;m usually pretty okay<br/>\n&gt;with the RU ideas and parenting philosophies and have let go of many<br/>\n&gt;controls I had before. However, sometimes the sharing thing confuses me -<br/>\n&gt;and ESPECIALLY in a situation with traditional parents I&#39;m kind of at a loss<br/>\n&gt;regarding how to step in...<br/>\n<br/>\n </span></blockquote>I think I would apologize to my son after this.  Because kids are so <br/>\nblissfully in the moment, it&#39;s not too likely he&#39;s going to hang onto <br/>\na grudge against you, but you know him way better than I do.  If he <br/>\nwere still angry with you, I would wholeheartedly apologize to him in <br/>\na way that he can understand.  I would tell him I made a mistake and <br/>\nthat I hope he can forgive me.  (I have a little practice with this <br/>\nsort of thing, can you tell?)  ;-)<br/>\n<br/>\nBut, no matter what a kid&#39;s age, we really need to meet him where <br/>\nhe&#39;s at.  There is no such thing as &quot;sharing&quot; for a kid that age, and <br/>\nthat&#39;s probably why he felt okay to hike over there and wrench that <br/>\ntoy out of the other kid&#39;s hand.  What must have been very confusing <br/>\nfor him, though, was you saying that it was wrong for him to do <br/>\nthat...and then you went and did the exact, same thing!  That&#39;d just <br/>\nabout blow my mind, that&#39;s for sure!  :-)<br/>\n<br/>\nWhen my son was wee and got real attached to things that didn&#39;t <br/>\nbelong to him, I did my best to work it out with whoever the thing <br/>\nbelonged to so that we could leave with it and then get it back to <br/>\nthem another time (maybe even in 5 minutes).  Distraction also works <br/>\nsometimes.  Whatever it takes to try to keep the peace.  Little kids <br/>\njust do not have the capacity to share, and we should not be forcing <br/>\nthem to do more than they can do!  Even &quot;traditional&quot; parents could <br/>\nunderstand and agree with that, I&#39;m sure!  I&#39;ve worked that very kind <br/>\nof thing out with my very mainstream SIL, and she didn&#39;t seem to <br/>\njudge me about it at all (well, not that I was aware of anyway).<br/>\n<br/>\nBut, even if she did, my ONLY concern is the well being and welfare <br/>\nof my kid and his joy and peace and serenity.  I really can let go of <br/>\nwhat other folks think of me when I remind myself that what they <br/>\nthink of me isn&#39;t nearly as important as how my son is <br/>\nfeeling.  Being a Libra, I use the scale to weigh the two.  There&#39;s no contest!<br/>\n<br/>\nAnyhooo, I hope that&#39;s a little helpful.<br/>\n<br/>\n<br/>\n_.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._<br/>\n<br/>\nMarji<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gaiawolf.org/\">http://www.gaiawolf.org/</a>&gt;GaiaWolf<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://launch.groups.yahoo.com/group/GaiaWolf/\">http://launch.groups.yahoo.com/group/GaiaWolf/</a>&gt;Join the GaiaWolf Mailing List<br/>\n<br/>\n<br/>\n&quot;The animals of this world exist for their own reasons.  They were <br/>\nnot made for humans any more than blacks were made for whites or <br/>\nwomen created for men.&quot;<br/>\n~Alice Walker<br/>\n_.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._.:~`^&#39;~:._<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205756159,"authorName":"Lesa ODaniel","from":"&quot;Lesa ODaniel&quot; &lt;lesaodaniel@...&gt;","profile":"lesao2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Making amends...","postDate":"1149293301","msgId":13970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwMi1GNDBGREFGRkVGOUM1NDYxNzRERDc5OUIwOTYwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":13973,"prevInTime":13969,"nextInTime":13971,"topicId":13970,"numMessagesInTopic":0,"msgSnippet":"How did you all handle crossing the bridge between traditional parenting and the mindful parenting that is a big part of unschooling? Specifically, here s my","messageBody":"<div id=\"ygrps-yiv-2039706130\">How did you all handle crossing the bridge between traditional parenting and <br/>\nthe mindful parenting that is a big part of unschooling?<br/>\n<br/>\nSpecifically, here&#39;s my issue. My 2 year old son and I were at a La Leche <br/>\nLeague meeting the other day and there was another 2 year old boy there. <br/>\nThey, of course, had their little back and forth periods of wanting a toy <br/>\nthat the other one had (community property, by the way, not either child&#39;s <br/>\ntoys) and they played out just fine. At one point, though (and this was <br/>\ntoward the end of the meeting, and likely the end of my son&#39;s threshold for <br/>\nboring meetings such as this) my son went over to the other boy and wrenched <br/>\na toy from his hand with some sort of super strength and gave him a push <br/>\nbackward (which I&#39;ve never seen him do before). I don&#39;t know why or where it <br/>\ncame from, but I went over to my son and wrenched the toy from his hand to <br/>\ngive back to the other boy and during our struggle, he hit himself in the <br/>\neye with it.<br/>\n<br/>\nI felt HORRIBLE. I felt icky and still kind of do. How do you make amends <br/>\nwith a child this age (what kind of words do you use)? How long do you wait <br/>\nto talk about it after you&#39;ve had an &quot;incident&quot;? By the way, how do you <br/>\nhandle sharing issues when it requires stepping in? I&#39;m usually pretty okay <br/>\nwith the RU ideas and parenting philosophies and have let go of many <br/>\ncontrols I had before. However, sometimes the sharing thing confuses me - <br/>\nand ESPECIALLY in a situation with traditional parents I&#39;m kind of at a loss <br/>\nregarding how to step in... Thanks in advance. I&#39;m also posting this at <br/>\nAlwaysUnschooled, by the way.<br/>\n<br/>\n<br/>\n<br/>\nLesa O&#39;Daniel, AAHCC<br/>\nInstructor, Bradley Method� of Natural Childbirth<br/>\n323-541-5515<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bradleybirth.com/ndweb.asp?ID=O123&Count=N\">http://www.bradleybirth.com/ndweb.asp?ID=O123&Count=N</a><br/>\n<br/>\n_________________________________________________________________<br/>\nDon�t just search. Find. Check out the new MSN Search! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://search.msn.click-url.com/go/onm00200636ave/direct/01/\">http://search.msn.click-url.com/go/onm00200636ave/direct/01/</a></div>","specialLinks":[]}],"prevTopicId":42408,"nextTopicId":42470}}