{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":285320662,"authorName":"Johanna","from":"Johanna &lt;dialog@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Children with power","postDate":"1162123168","msgId":18663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZERkNBNDQ2LUExODctNEZGMy1CMUJBLURCODVDQkMxOTI2Q0B1bmVyem9nZW4uZGU+","inReplyToHeader":"PEJBWTctRjIyOTc0OEYyRDQ2MkM3MEIyOTFFMzFDQUZCMEBwaHguZ2JsPg==","referencesHeader":"PEJBWTctRjIyOTc0OEYyRDQ2MkM3MEIyOTFFMzFDQUZCMEBwaHguZ2JsPg=="},"prevInTopic":18662,"nextInTopic":0,"prevInTime":18662,"nextInTime":18664,"topicId":18607,"numMessagesInTopic":0,"msgSnippet":"In the German show they only switched roles in the house. Apparently, the children still went to school and parents still went to work or had a week off. ","messageBody":"<div id=\"ygrps-yiv-758960148\">In the German show they only switched roles in the house. Apparently,  <br/>\nthe children still went to school and parents still went to work or  <br/>\nhad a week off.<br/>\n<br/>\nGreetings<br/>\nJohanna<br/>\n<br/>\n<br/>\nAm 29.10.2006 um 04:37 schrieb Wildflower Car:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; They have a show in the US called, &quot;Try My Life&quot;. It is where one  <br/>\n&gt; parent<br/>\n&gt; trades roles with one child. The child goes to work and the parent  <br/>\n&gt; goes to<br/>\n&gt; school.  It would be hard in my house because my husband and I are  <br/>\n&gt; both at<br/>\n&gt; home all day with the kids! And which child would be in charge? </span></blockquote></div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Children with power","postDate":"1162093061","msgId":18662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjIyOTc0OEYyRDQ2MkM3MEIyOTFFMzFDQUZCMEBwaHguZ2JsPg=="},"prevInTopic":18622,"nextInTopic":18663,"prevInTime":18661,"nextInTime":18663,"topicId":18607,"numMessagesInTopic":0,"msgSnippet":"They have a show in the US called, Try My Life . It is where one parent trades roles with one child. The child goes to work and the parent goes to school.  It","messageBody":"<div id=\"ygrps-yiv-1788970638\">They have a show in the US called, &quot;Try My Life&quot;. It is where one parent <br/>\ntrades roles with one child. The child goes to work and the parent goes to <br/>\nschool.  It would be hard in my house because my husband and I are both at <br/>\nhome all day with the kids! And which child would be in charge?<br/>\n<br/>\nI get the idea of using it as a launch for unschooling, it would be <br/>\ninteresting to see.<br/>\n<br/>\nWIldflower<br/>\n<br/>\n_________________________________________________________________<br/>\nGet today&#39;s hot entertainment gossip  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://movies.msn.com/movies/hotgossip?icid=T002MSN03A07001\">http://movies.msn.com/movies/hotgossip?icid=T002MSN03A07001</a></div>","specialLinks":[]},{"userId":285320662,"authorName":"Johanna","from":"Johanna &lt;dialog@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Children with power","postDate":"1161976649","msgId":18622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODEwMEI2LTBDNkUtNEE3MC1CNzExLTBCNzMyQkEwNkYxM0B1bmVyem9nZW4uZGU+","inReplyToHeader":"PDIwMDYxMDI3MTgwODU0LjI4MzkxLnFtYWlsQHdlYjU2MTAxLm1haWwucmUzLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYxMDI3MTgwODU0LjI4MzkxLnFtYWlsQHdlYjU2MTAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":18620,"nextInTopic":18662,"prevInTime":18621,"nextInTime":18623,"topicId":18607,"numMessagesInTopic":0,"msgSnippet":"Yay, I thought probably nobody would read that long ;-) I m glad it helped someone :-) I m also thinking about doing this. Another thing I thought about later","messageBody":"<div id=\"ygrps-yiv-153799298\">Yay, I thought probably nobody would read that long ;-) I&#39;m glad it  <br/>\nhelped someone :-) I&#39;m also thinking about doing this. Another thing  <br/>\nI thought about later was that it would also help for everyone to see  <br/>\nthat unschooling or gentle parenting is *not* about doing letting the  <br/>\nchild have all the &quot;power&quot;! (this was something my father foresaw for  <br/>\ninstance). It&#39;s not about parents &lt;----- kids. It would help the kids  <br/>\nsee that too! (I sometimes think my daughter thinks that ;-))<br/>\n<br/>\nGreetings<br/>\nJohanna<br/>\n<br/>\nAm 27.10.2006 um 20:08 schrieb rebecca de:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;         Johanna,<br/>\n&gt;<br/>\n&gt;     What an awesome idea?  I&#39;m the one that just wrote about my  <br/>\n&gt; pity party and power struggle with my child.  I think this would be  <br/>\n&gt; the best thing I could do to unschool myself and learn to let go of  <br/>\n&gt; the power/control.  I&#39;m willing to try it.  So  as soon as I do it  <br/>\n&gt; I will let everyone know how it&#39;s going and everything........<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Children with power","postDate":"1161972534","msgId":18620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMDI3MTgwODU0LjI4MzkxLnFtYWlsQHdlYjU2MTAxLm1haWwucmUzLnlhaG9vLmNvbT4=","inReplyToHeader":"PDQ4NzVEQjg3LUE4NTktNDNDMC1CNjRELUU5NjI2NDk2MDYwRUB1bmVyem9nZW4uZGU+"},"prevInTopic":18607,"nextInTopic":18622,"prevInTime":18619,"nextInTime":18621,"topicId":18607,"numMessagesInTopic":0,"msgSnippet":"Johanna, What an awesome idea?  I m the one that just wrote about my pity party and power struggle with my child.  I think this would be the best thing I could","messageBody":"<div id=\"ygrps-yiv-2038185005\">Johanna,<br/>\n   <br/>\n    What an awesome idea?  I&#39;m the one that just wrote about my pity party and power struggle with my child.  I think this would be the best thing I could do to unschool myself and learn to let go of the power/control.  I&#39;m willing to try it.  So  as soon as I do it I will let everyone know how it&#39;s going and everything........ <br/>\n      <br/>\n  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n \t\t<br/>\n---------------------------------<br/>\nHow low will we go? Check out Yahoo! Messengers low  PC-to-Phone call rates.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":285320662,"authorName":"Johanna","from":"Johanna &lt;dialog@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Children with power","postDate":"1161894039","msgId":18607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzVEQjg3LUE4NTktNDNDMC1CNjRELUU5NjI2NDk2MDYwRUB1bmVyem9nZW4uZGU+"},"prevInTopic":0,"nextInTopic":18620,"prevInTime":18606,"nextInTime":18608,"topicId":18607,"numMessagesInTopic":0,"msgSnippet":"Hello List, this may be helpful for people new to unschooling – but it would be nice if the experienced unschoolers around here would comment! Thanks! I","messageBody":"<div id=\"ygrps-yiv-2128599039\">Hello List,<br/>\n<br/>\nthis may be helpful for people new to unschooling – but it would be  <br/>\nnice if the experienced unschoolers around here would comment! Thanks!<br/>\n<br/>\nI wanted to report about a show that is being broadcasted here in  <br/>\nGermany (or was). Maybe it&#39;s a copy of a show that is already known  <br/>\nin US or elsewhere – this wouldn&#39;t be unusual, but if not, this is  <br/>\nreally interesting :-)<br/>\n<br/>\nSo it&#39;s a show where two families have been filmed for 8 days. The  <br/>\nroles have been switched, the children are the &quot;parents&quot;, the parents  <br/>\nare the &quot;children&quot;. It&#39;s all about switching roles and the children  <br/>\nare called &quot;the bosses&quot; throughout the show. The parents are to do  <br/>\nwhat the children say. They have a budget of € 400 for the week and  <br/>\nhave to use it wisely. They also have to manage all the household and  <br/>\ndecide what to do during free time. I didn&#39;t see all of it and I  <br/>\ndon&#39;t know if the children were still in school and if parents went  <br/>\nto their jobs, maybe they used a vacation week. Children could also  <br/>\norder their parents to drive somewhere (if they thought of it).<br/>\n<br/>\nToday was the last day of this experiment (they called it an  <br/>\nexperiment) and at the end, all were asked how they liked it and if  <br/>\nthey had learned something or if they had anything to comment. It was  <br/>\nwonderful:<br/>\n<br/>\nThe parents said that they were suprised to see how much children can  <br/>\ndo on their own, how much they understand about household and money  <br/>\nmanaging and how many problems are just solved all by themselves  <br/>\nwithout them intervening. They were also surpised to see how creative  <br/>\nthe children were in selecting family activities – one mother said  <br/>\nshe was happy that they did things they wouldn&#39;t have done before  <br/>\n(skiing or whatever it was). One parent was surprised to see that s/he <br/>\n(?) could count on the children. They were amazed how the children  <br/>\nwere able to really DO the stuff they were planning, no matter how  <br/>\nmany difficulties arose in the process. They were asked if they could  <br/>\nimagine to do this every half a year for like 4 days or so - switch  <br/>\nroles again. One family said yes, the other even said &quot;we could  <br/>\nalways do this&quot; (!) (half joking but still, he was very convinced!)<br/>\n<br/>\nThe children were very happy that they had had the chance to show  <br/>\ntheir parents their skills to manage on their own. I felt that some  <br/>\nof the children were very sad that the roles would be switched again.  <br/>\nThe symbol for returning the power to the parents was handing out the  <br/>\nkeys of the house. At this moment, one child whined: &quot;oh noooo, I  <br/>\ndon&#39;t want to give up the power! I want to be the boss for at least  <br/>\none more hour!&quot; But they were also happy that lasting changes had  <br/>\nbeen made in the house (they painted walls and made a &quot;chill out  <br/>\nzone&quot; and stuff.<br/>\n<br/>\nIt was a bit sad that the interviewers (after the experiment) kept  <br/>\nasking things like &quot;yeah well, but you realize how hard a job it was,  <br/>\ndidn&#39;t you? Isn&#39;t it hard to be a parent? common, it was hard, wasn&#39;t  <br/>\nit?&quot; (I guess the goal was that children learn that it is difficult  <br/>\nto be a parent and that they should respect parents more and help  <br/>\nmore). The children said it was hard the first 4 days but that  <br/>\nactually it was more fun than hard. Another good observation was,  <br/>\nthat the children tried to do all the housework themselves, and only  <br/>\nasked the parents to help when they really needed help or when &quot;a  <br/>\nhand would have been nice and they were around anyway&quot;. In one of the  <br/>\nfamilies, they required the parents to do chores, in the other, they  <br/>\njust didn&#39;t (I guess each family did it the way it was modeled by the  <br/>\nparents before).<br/>\n<br/>\nThe first 4 days, the parents had a hard time letting go of control.  <br/>\nOne mother said that it was obvious that a change from one extreme to  <br/>\nthe other would be difficult, but that when she &quot;got&quot; it, she really  <br/>\nenjoyed &quot;being a kid&quot;.<br/>\n<br/>\n<br/>\nI was watching the show today with a big wide grin. It&#39;s sad the show  <br/>\nhas only been shown in the kid&#39;s channel and surely very few parents  <br/>\nsaw the show. Another sad thing is that nobody concluded that it  <br/>\nwould be best giving everyone equal rights instead of flipping, but  <br/>\nit&#39;s a start! ;-)<br/>\n<br/>\nAnd so I got this intriguing idea:<br/>\n<br/>\nI was wondering what would happen if this experiment would have  <br/>\ncontinued for more weeks or months. I presume that the parents would  <br/>\nfeel it&#39;s &quot;unfair&quot; and they wouldn&#39;t like the coercive methods and  <br/>\nthe way the new &quot;bosses&quot; were talking to the parents who have no  <br/>\nrights (in the show the children sometimes used these methods, also  <br/>\nordered the smaller kids to &quot;Sit down and eat your toast&quot; and &quot;Don&#39;t  <br/>\ntalk to me like that&quot; blah, they had arguments about how the parents  <br/>\nwere disrespectful or not following the rules (i.e. not letting go of  <br/>\ncontrol). Since the children would know how it was before to be in  <br/>\nthat situation, they would be more likely to agree on &quot;equal rights&quot;  <br/>\nfor everybody - they would maybe talk it out and agree on making it  <br/>\nall equal. Of course, in real life it wouldn&#39;t work because parents  <br/>\nthink they have an inherent right to be on top of the hierarchy so at  <br/>\nsome point they would just loose temper and call off the experiment.<br/>\n<br/>\nBUT – I was wondering if this wouldn&#39;t be a good thing to start with  <br/>\nwhen people start unschooling/gentle parenting. While traditional  <br/>\nparenting places the parents on top of the kids (parent -----&gt; kid)  <br/>\nand switching does the same but the other way round (parent &lt;--------  <br/>\nkid) and what we want to reach with gentle parenting is parent  <br/>\n&lt;-------&gt; child - it would maybe be a good idea to first place the  <br/>\nkid on top for a while.<br/>\n<br/>\nThis way he could see how difficult it is (to be coercive, to be a  <br/>\nparent, to be responsible, to do chores alone). I imagine it would  <br/>\nhelp find balance. It&#39;s an easy experiment to do for a week or so to  <br/>\nswitch roles, but it&#39;s not easy to find balance right away (going  <br/>\nfrom one extreme to the other is a lot easier because parents have  <br/>\nshown us how to do it, while finding the ideal middle needs to be  <br/>\nworked on and both sides have to learn, this is why deschooling of  <br/>\nparents and children takes so long). I&#39;m not saying that with this  <br/>\nexperiment deschooling will be shorter or less work, but it might be  <br/>\nclearer for everybody why we are doing this.<br/>\n<br/>\nThis excercise could help parents and children understand each  <br/>\nother&#39;s roles, to value the responsibilities of each and to truely  <br/>\nunderstand why it is important to find that balance.<br/>\n<br/>\nAlso, as the experiment on tv showed, parents would find out that  <br/>\nchildren CAN do a lot and so it would be easier to build up that oh  <br/>\nso needed trust!<br/>\n<br/>\nAnd, the parents could see the world from a kid&#39;s perspective for a  <br/>\nwhile, which obviously brought joy to these families (doing fun stuff  <br/>\ntogether, living joyfully like a kid!)<br/>\n<br/>\nI also think that it would trigger creativity (ours and my  <br/>\ndaughter&#39;s) on what to do with our free time, especially because of  <br/>\nthe limited budget. After that, when the &quot;real&quot; experiment starts  <br/>\n(gentle parenting, finding that middle), one could continue to  <br/>\nintegrate the child in money managing (as many unschoolers do). I had  <br/>\nthe idea that letting the kid know how much money is available would  <br/>\ntrigger creativity on how to use that money wisely doing fun things.<br/>\n<br/>\nI was wondering if we should do this here at home. My daughter  <br/>\nwatched that show and I could feel that she was thinking &quot;we should  <br/>\ndo that too&quot;, instead of &quot;luckily we don&#39;t need to do that because WE  <br/>\nhave equal rights&quot; or something.<br/>\n<br/>\nWhat do you think?<br/>\n<br/>\nGreetings<br/>\nJohanna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nUnerzogen! | <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dialog@...\">dialog@...</a> | <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unerzogen.de\">http://www.unerzogen.de</a> |  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unerzogen-subscribe@...\">unerzogen-subscribe@...</a></div>","specialLinks":[]}],"prevTopicId":18661,"nextTopicId":18665}}