{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":44,"messages":[{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Relationships between spouses (was: The End of Unschooling?)","postDate":"1343719442","msgId":48836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2ODE2aSt0NGs3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFEQkRDRDM4LTAyMzMtNDBEMy1BNzM2LTU0QjhFMDMyMTkwREB2ZXJpem9uLm5ldD4="},"prevInTopic":48835,"nextInTopic":48837,"prevInTime":48835,"nextInTime":48837,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... It isn t a tool in *your* philosophy. Lying to facilitate unschooling can work perfectly well as a tool for making unschooling work well. Even when you","messageBody":"<div id=\"ygrps-yiv-329960768\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... So, based on my last post about the philosophy of unschooling,<br/>\n&gt; lying might be a tool a parent will choose to use, but it isn&#39;t a<br/>\n&gt; tool in the unschooling philosophy package deal.<br/>\n<br/>\n </span></blockquote>It isn&#39;t a &quot;tool&quot; in *your* philosophy. Lying to facilitate unschooling can work perfectly well as a &quot;tool&quot; for making unschooling work well. Even when you add the idea of bettering spouse-relationships into unschooling, as you have done, it is still only *your* opposition to lying that you&#39;re really talking about.<br/>\n<br/>\nIf you suddenly found out that your husband had lied to you years ago about what the kids had been doing, in order to make you happy or secure or to avoid a fight, and you have since realized that he lied about it because of something that you did that put him in the position of feeling like he had to deceive you about it in the first place, I imagine, from what you&#39;ve been saying, that you would, nevertheless, feel hurt or betrayed when you found out that he lied back then. <br/>\n<br/>\nNot everyone will react that way.<br/>\n<br/>\nSome spouses will have realized that they put the other one in a very difficult position, and will feel sorry for their own past behavior that put so much stress on the rest of the family.<br/>\n<br/>\nThe kids will have unschooled happily, and the parents&#39; relationship will have improved.<br/>\n<br/>\nA lie about unschooling, to give the dad time to come to terms with the situation, might be just what&#39;s needed, for both the kids&#39; unschooling AND the parents&#39; relationship.<br/>\n<br/>\nIt seems that the idea of being lied to by your spouse - even for the sake of creating a peaceful home and allowing the kids to continue unschooling - makes you so upset that you could never get past it, and you assume that&#39;s the way everyone feels. It&#39;s not.<br/>\n<br/>\nIf you want to think of ways of relating as &quot;tools&quot; that are compatible with unschooling, lying or being truthful can both be in that &quot;toolbox&quot;, depending on the circumstances and the people involved.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; People already know how to lie. They figure it out by the time<br/>\n&gt; they&#39;re 3. ;-) It doesn&#39;t need to be a tool offered as a choice.<br/>\n<br/>\n </span></blockquote>People also know how to tell the truth by the time they&#39;re 3. (Most people are truthful most of the time.) So I guess telling the truth also doesn&#39;t need to be tool offered as a choice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lying *does* damage relationships (when the lies are found out.)<br/>\n&gt; Damaged relationships make unschooling more difficult.<br/>\n<br/>\n </span></blockquote>Or lies help improve relationships, by keeping strife to a minimum, and when the more troubled, belligerent partner realizes that he was projecting all his fears and personal baggage onto the rest of the family, and starts getting much-needed therapy and medical care, and starts being a real partner in the relationship, he simply doesn&#39;t care anymore that you deceived him about what the kids spent the day doing 8 years ago.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; But please don&#39;t suggest that lying is part of the Radical<br/>\n&gt; Unschooling Philosophy.<br/>\n<br/>\n </span></blockquote>I would say &quot;Please don&#39;t suggest that either lying OR telling the truth have anything to do with the Radical Unschooling Philosophy.&quot;<br/>\n<br/>\nYou want to define &quot;radical unschooling&quot; as a philosophy that includes &quot;tools&quot; for enhancing relationships between married couples. OK, you can define the term &quot;radical unschooling&quot; that way, if you want. But your reactions to certain situations, and the ways of relating that work best for *you*, are not universal.<br/>\n<br/>\nAnd lies are not always bad, and they don&#39;t always have anything to do with the foundation of a relationship. <br/>\n<br/>\nThere is a reality-based reason that people came up with the term &quot;white lie&quot;. Some people really prefer to be lied to in some situations. They *don&#39;t* want the truth. They want reassurance or security or flattery. When a wife asks, &quot;Honey, does this dress make my butt look fat?&quot;, some wives want to hear, &quot;No, it really flatters your figure!&quot;, even if the dress *does* make their butt look fat! Other wives want to hear the truth.     <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Divorce (was: The End of Unschooling?)","postDate":"1343713705","msgId":48835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2N3JqOSszNGtpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDM2NTgyMTIuODE4NTcuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":48834,"nextInTopic":48836,"prevInTime":48834,"nextInTime":48836,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... LOTS of kids feel MUCH safer after a divorce! All the yelling and fighting and ranting and swearing that have been living with have finally stopped - or at","messageBody":"<div id=\"ygrps-yiv-587625188\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... No child feels safe during and after divorce. <br/>\n<br/>\n </span></blockquote>LOTS of kids feel MUCH safer after a divorce! All the yelling and fighting and ranting and swearing that have been living with have finally stopped - or at least drastically decreased - after the divorce!<br/>\n<br/>\nI was so relieved when my parents finally got divorced! <br/>\n<br/>\nThe kids I babysit are MUCH happier, calmer, and less stressed since their parents got divorced. In their case, the dad was abusive, but it was emotional abuse, not physical violence. <br/>\n<br/>\nThere was another family I used to babysit for. I didn&#39;t know them before they got divorced, but when I started babysitting for them, the kids alternated weeks at each parent&#39;s house. Each house was equally comfortable, and equally home to the children. Life in each household was peaceful and calm (except for the occasional fights between the dad and the older kid about homework and grades, because the kids were in public school, and the older child wasn&#39;t doing well in school), and the kids felt very safe!<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343712420","msgId":48834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2N3FiNCsxbWVpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMzMjk0ODUwLTc0RDgtNERDOC1CNDkyLUQ5QkVBMzU0NjgyQ0B2ZXJpem9uLm5ldD4="},"prevInTopic":48830,"nextInTopic":48835,"prevInTime":48833,"nextInTime":48835,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... Joyce, you and I seem to define the word unschooling differently. We probably encountered the idea from different sources in the first place. But since","messageBody":"<div id=\"ygrps-yiv-1398753860\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; ....<br/>\n&gt; &gt; the word itself still contains that core idea of not *forcing*<br/>\n&gt; &gt; kids to go to school or do school-ish things at home.<br/>\n <br/>\n&gt; Not forcing kids to school is a choice someone might make based on<br/>\n&gt; the ideas of unschooling. It&#39;s what unschooling might look like on<br/>\n&gt; the surface, but it&#39;s not a core idea.<br/>\n<br/>\n </span></blockquote>Joyce, you and I seem to define the word &quot;unschooling&quot; differently. We probably encountered the idea from different sources in the first place. But since &quot;unschool&quot; is a word that combines the prefix &quot;un&quot; with the word &quot;school&quot;, the definition must have something to do with not attending school or creating a school at home. I did add the word &quot;force&quot; because the concept/definition of school that the &quot;un&quot; is attached to is the American public school model, in which the very essence of school is compulsion, i.e., force. The term &quot;unschooling&quot; certainly wasn&#39;t coined with the Sudbury Valley School in mind as the definition of the word &quot;school&quot;!<br/>\n<br/>\nEveryone seems to agree that John Holt coined the word, so I looked just now to see how he defined it. I found this excerpt from &quot;Growing Without Schooling&quot;:<br/>\n&quot; What Is Unschooling?<br/>\nThis is also known as interest driven, child-led, natural, organic, eclectic, or self-directed learning. Lately, the term &quot;unschooling&quot; has come to be associated with the type of homeschooling that doesn&#39;t use a fixed curriculum. When pressed, I define unschooling as allowing children as much freedom to learn in the world, as their parents can comfortably bear.&quot;<br/>\n<br/>\nSo John Holt made &quot;freedom to learn&quot; part of the core definition of &quot;unschooling&quot;. Freedom is the absence of force/compulsion, slavery, and imprisonment, isn&#39;t it?<br/>\n<br/>\nSupporting the child, respecting the child, trusting the child, facilitating the child&#39;s learning, those all help to make unschooling into an optimal and joyful experience. <br/>\n<br/>\nBut I just suddenly thought of the movie &quot;Matilda&quot;, where her parents completely neglected her - the way some parents might do in real life if they are dysfunctionally depressed or addicted to drugs. Before they put her into Ms. Trunchbull&#39;s school, you couldn&#39;t say that her parents unschooled her, but she definitely unschooled herself. Given at least the freedom from compulsory school attendance, kids are free to learn what they can. Obviously, it helps if they live in walking distance of a library. Or if they at least have internet access.<br/>\n<br/>\nHave you ever read about Sugata Mitra&#39;s &quot;Hole In The Wall&quot; experiment, or heard his TED Talk about it? The kids in his experiment unschooled themselves!<br/>\n<br/>\nI used to write that I &quot;unschool with my kids&quot;, because unschooling isn&#39;t really something you do *to* children, it&#39;s something you do *with* them. Or not. Obviously the kids are better off if their parents unschool with them, but the freedom to learn is there even in cases of benign neglect, as long as the kids are free from unwanted compulsory school attendance.  <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343689102","msgId":48830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDM2ODkxMDIuMjAzMDYuWWFob29NYWlsTmVvQHdlYjg3OTAxLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PEI5NzYzNDFCLTBCRDctNDVGMy04NDFFLTNCQzRDRjQ0OTY2QkBhdHQubmV0Pg==","referencesHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPiA8anY1dW9iK3JzaTRAZUdyb3Vwcy5jb20+IDwxMzQzNjU3NTEzLjk5MjMwLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+IDw1NjhBOEE1Ni1DNjAwLTQzQjMtODYzNy05RUE5NTRGODExMjdAYXR0Lm5ldD4gPDZGRjgzMjY0LTIwRTYtNEExMi05OUVDLTFCM0M3MEI2ODlDREB2ZXJpem9uLm5ldD4gPEI5NzYzNDFCLTBCRDctNDVGMy04NDFFLTNCQzRDRjQ0OTY2QkBhdHQubmV0Pg=="},"prevInTopic":48829,"nextInTopic":48834,"prevInTime":48829,"nextInTime":48831,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"...   Biological parents are evolutionarily invested in their child, unrelated individuals are not. Unrelated individuals are more invested in getting rid of","messageBody":"<div id=\"ygrps-yiv-1102002750\"><blockquote><span title=\"ireply\">&gt;&gt;I&#39;d say there is a good argument for children biologically desiring a large extended family, or tribe, but the two parents with children as a separate unit model is pretty recent in evolutionary terms.&lt;&lt;<br/>\n </span></blockquote> <br/>\nBiological parents are evolutionarily invested in their child, unrelated individuals are not. Unrelated individuals are more invested in getting rid of the stranger child so that they can invest more in their own genetically related child. There is a fabulous book by Martin Daly and Margo Wilson called Homicide that talks about the relative risks to a chlid in a household with a step-parent versus one without. They are looking at data in Detroit and Toronto, maybe. In the data that Kim Hill and Magdalena Hurtado collected while living with the Ache, a hunter-gatherer population in Paraguay, my husband found clear evidence that children whose biological father wasn&#39;t around had higher mortality rates. K.G. Anderson has done a fair bit of research on the effects of step-parents <br/>\n <br/>\nAmong lions, when a new male or males take over a tribe they will kill off any cubs that are still young enough to be dependent on their mothers and aunts and grannies. Sarah Hrdy, as far as I know the first researcher to really explore infanticide as an evolutionarily adaptive response, found that in langur monkeys infanticide was most likely to occur by unrelated males on a still lactating infant. <br/>\n <br/>\nIt&#39;s not cultural, it&#39;s adaptive. It isn&#39;t pretty, but it makes biological sense, evolutionary sense, genetic sense. You are better off with biological parents. <br/>\n <br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: The End of Unschooling?","postDate":"1343687268","msgId":48829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDM2ODcyNjguMzYyMjkuWWFob29NYWlsTmVvQHdlYjg3OTA1Lm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDU2OEE4QTU2LUM2MDAtNDNCMy04NjM3LTlFQTk1NEY4MTEyN0BhdHQubmV0Pg==","referencesHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPiA8anY1dW9iK3JzaTRAZUdyb3Vwcy5jb20+IDwxMzQzNjU3NTEzLjk5MjMwLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+IDw1NjhBOEE1Ni1DNjAwLTQzQjMtODYzNy05RUE5NTRGODExMjdAYXR0Lm5ldD4="},"prevInTopic":48825,"nextInTopic":48830,"prevInTime":48828,"nextInTime":48830,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"There is an interesting book about the effects of divorce, The Legacy of Divorce. It s a series of anecdotes based on a long term study of children and the","messageBody":"<div id=\"ygrps-yiv-722002547\">There is an interesting book about the effects of divorce, The Legacy of Divorce. It&#39;s a series of anecdotes based on a long term study of children and the status of the parents marriage. It in no way presents a picture that all divorce is bad. But it does show the lasting effect parental marital stability or instability has on the life of a chld. <br/>\n <br/>\nThat said, one of the costs of divorce in any household, homeschooling, unschooling or otherwise is the decisions about how a child&#39;s education is to go may end up being up to the court. If the court decides that homeschooling is negligent or that the child or children involved need structure or that they just don&#39;t approve of homeschooling it may become that much more difficult to homeschool and thus to unschool a child post divorce. Figuring out how to avoid a divorce, how to reach out to your partner, how to communicate effectively and to help them to feel listened to and cared for will go a long way to making unschooling a much more likely thing than will deciding that divorce isn&#39;t always a bad thing. If you struggle to get along with your partner now, imagine how difficult it will be to work with him or her after the relationship has ended but the responsibility of educating their child remains. I don&#39;t know how that would play out with a<br/>\n step-parent post divorce. It would depend on the divorce and whether the step-parent was an adoptive parent, I imagine. <br/>\n <br/>\nSchuyler<br/>\n <br/>\n<br/>\n________________________________<br/>\n From: Lesley Cross &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lesleycross@...\">lesleycross@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; <br/>\nSent: Tuesday, 31 July 2012, 1:19<br/>\nSubject: Re: [unschoolingbasics] Re: The End of Unschooling?<br/>\n  <br/>\n<br/>\n <br/>\n   <br/>\n <br/>\nNot every child has a damaging experience of divorce, just as not every child has a damaging experience of school.  There does not need to be abuse to make a marriage unsuitable for either party.  I&#39;m exceptionally thankful my parents divorced- both are happier people for finding more suitable relationships and I think I&#39;d be truly damaged knowing my parents held together a crap marriage based on an assumption about my feelings or potential reaction.  Living with people who have vastly different expectations of one another, marriage, life is not pleasant.  Even if they&#39;re &quot;working on it&quot;. <br/>\n<br/>\nCertainly counseling is worth doing, as long as both parties are willing.  Certainly it&#39;s good to understand all the potential consequences- as much as one can.  Divorce isn&#39;t always the answer, but often it takes the pressure off of everyone- including the children.  Particularly with marriages/relationships that began for all the wrong reasons.<br/>\n<br/>\nLesley<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n   <br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343670843","msgId":48825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NzYzNDFCLTBCRDctNDVGMy04NDFFLTNCQzRDRjQ0OTY2QkBhdHQubmV0Pg==","inReplyToHeader":"PDZGRjgzMjY0LTIwRTYtNEExMi05OUVDLTFCM0M3MEI2ODlDREB2ZXJpem9uLm5ldD4=","referencesHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPiA8anY1dW9iK3JzaTRAZUdyb3Vwcy5jb20+IDwxMzQzNjU3NTEzLjk5MjMwLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+IDw1NjhBOEE1Ni1DNjAwLTQzQjMtODYzNy05RUE5NTRGODExMjdAYXR0Lm5ldD4gPDZGRjgzMjY0LTIwRTYtNEExMi05OUVDLTFCM0M3MEI2ODlDREB2ZXJpem9uLm5ldD4="},"prevInTopic":48824,"nextInTopic":48829,"prevInTime":48824,"nextInTime":48826,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"The intact family is a biological desire. References?  My studies seem to point to this being cultural.  It s an interesting topic... I d say there is a good","messageBody":"<div id=\"ygrps-yiv-722956111\">&quot;The intact family is a biological desire.&quot;<br/>\n<br/>\nReferences?  My studies seem to point to this being cultural.  It&#39;s an interesting topic... I&#39;d say there is a good argument for children biologically desiring a large extended family, or tribe, but the two parents with children as a separate unit model is pretty recent in evolutionary terms.  Perhaps having that extended family is why my parents&#39; divorce was such a non-issue for me.  Maybe not.  <br/>\n<br/>\nMy point in putting my pov out here, in particular, is not to convince parents that their kids will be okay if they choose a divorce.  They might.  They might not.  If you know your kids, have a deep connection with them, you probably know whether or not this would be a crushing blow, accepted as simply what is, or embraced.  My point is that parents in a hard situation may come here and get the impression that unschooling is about some conservative standard of &quot;keep the marriage together no matter what&quot; - and either dismiss unschooling because of this misunderstanding, or stay in a unhappy relationship, creating an unhappy household that isn&#39;t a great place for kids to thrive (regardless of school), just because the parent hasn&#39;t reached some arbitrary level of misery or can&#39;t decide if what s/he&#39;s enduring is abuse or not.  One person cannot save a relationship that the other person doesn&#39;t want to save.  <br/>\n<br/>\nUnschooling is not a reason to leave a relationship, in most cases, however the well-being of children can be just as much a reason to leave as to stay...even without outright abuse.  As parents, weighing ALL the factors is important- including the possibility that leaving is the best option available, for that family, at that time.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.euphorialifedesignstudio.com\">http://www.euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151505017,"authorName":"CarenKH","from":"&quot;CarenKH&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: The End of Unschooling?","postDate":"1343668972","msgId":48824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2NmZ0YytvbWJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZGRjgzMjY0LTIwRTYtNEExMi05OUVDLTFCM0M3MEI2ODlDREB2ZXJpem9uLm5ldD4="},"prevInTopic":48823,"nextInTopic":48825,"prevInTime":48823,"nextInTime":48825,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"For years, I believed that my parents divorce was not harmful to me. When it happened, it felt like a relief - the house was so much LESS tense, there was","messageBody":"<div id=\"ygrps-yiv-145323862\">For years, I believed that my parents&#39; divorce was not harmful to me. When it happened, it felt like a relief - the house was so much LESS tense, there was more laughter.<br/>\n<br/>\nI separated from my husband 9 years ago, still believing that I hadn&#39;t been harmed by divorce. <br/>\n<br/>\nIt&#39;s only been in the past couple of years that I&#39;ve been able to acknowledge how deeply painful and damaging my parents&#39; divorce was. Because of my obliviousness, I caused similar pain for my kids.<br/>\n<br/>\nThis hasn&#39;t been easy to feel.<br/>\n<br/>\nNot every child will be harmed in a car crash, but that doesn&#39;t mean if a crash is avoidable, it&#39;s OK to ram our car into someone else&#39;s.<br/>\n<br/>\nOne thing I failed to consider when I was in such denial/ignorance/oblivion was this: How much better would it have been if my parents had bucked up, done the work to get closer and happier, and stayed together? What would I have learned about relationships, and commitment?<br/>\n<br/>\nGiven a choice between a miserable marriage and unhappy family life or divorce, divorce seems the better choice. But there are other choices, choices that CAN and DO and HAVE made the difference in peoples&#39; relationships. There&#39;s the choice to grow your relationship and your marriage, and do what you can to make it as good as it can be.<br/>\n<br/>\nI don&#39;t spend time mired in the past, wishing I had done things differently, but if I had known what I&#39;ve learned after being on these unschooling lists - things about being generous, taking responsibility, helping create a peaceful home life, appreciating my husband - we would never have separated.<br/>\n<br/>\nIt is incredibly freakin&#39; difficult being a single unschooling parent - and this is WITH the support of the boys&#39; dads. <br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343666546","msgId":48823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGRjgzMjY0LTIwRTYtNEExMi05OUVDLTFCM0M3MEI2ODlDREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDU2OEE4QTU2LUM2MDAtNDNCMy04NjM3LTlFQTk1NEY4MTEyN0BhdHQubmV0Pg==","referencesHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPiA8anY1dW9iK3JzaTRAZUdyb3Vwcy5jb20+IDwxMzQzNjU3NTEzLjk5MjMwLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+IDw1NjhBOEE1Ni1DNjAwLTQzQjMtODYzNy05RUE5NTRGODExMjdAYXR0Lm5ldD4="},"prevInTopic":48821,"nextInTopic":48824,"prevInTime":48822,"nextInTime":48824,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... Breaking up a family is, in essence, damaging. There may, though, be mitigating factors that can lessen the damage. There may be other factors, like abuse,","messageBody":"<div id=\"ygrps-yiv-689356270\">On Jul 30, 2012, at 11:19 AM, Lesley Cross wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not every child has a damaging experience of divorce<br/>\n<br/>\n </span></blockquote>Breaking up a family is, in essence, damaging.<br/>\n<br/>\nThere may, though, be mitigating factors that can lessen the damage. There may be other factors, like abuse, that can make the divorce much less damaging than staying.<br/>\n<br/>\nEach person needs to weigh the unique factors in their family.<br/>\n<br/>\n*But* most divorce advice doesn&#39;t focus on what it does to the children. Most experts are hardly aware. Most friends and casual advice givers, people who may have divorced and felt so much better, have no idea. <br/>\n<br/>\nParents are eager to believe their kids are just fine or will be fine so they don&#39;t dig beneath what on the surface seems like expectable sadness or anger. Other parents will *say* the kids will be just fine. What they really mean is what the kids went through didn&#39;t cause the parent trouble.<br/>\n<br/>\nThe people who are far more likely to know are the adults whose parents divorced. Yours was a positive story. The negative stories are far more common. The negative stories don&#39;t get told as often because the (hopefully unspoken!) reaction is likely to be &quot;Geez, get over it already. That happened years ago. Grow up.&quot; Fortunately this list is a positive place for people to share the negative stories so others can get a more complete view of what divorce does.<br/>\n<br/>\nWhat is most helpful for children is to *begin* with the understanding that divorce is damaging to children. It shatters their sense of security and trust. The intact family is a biological desire. <br/>\n<br/>\nAnd then weigh the other factors to decide if staying is more damaging than some other choice.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":476609039,"authorName":"Jill Finkenbine","from":"Jill Finkenbine &lt;peace.goodwill@...&gt;","profile":"jillinmaplewood","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343663308","msgId":48821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTnFyWD1yaWtIbjdILWY9RD1LcHlrcmExdG5kczFOQXNwNkZjVnZhNWhYS29yTFdMUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg==","referencesHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg=="},"prevInTopic":48819,"nextInTopic":48823,"prevInTime":48820,"nextInTime":48822,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"Having experienced some of what you are going through, I would like to share what is working for us.  First, for an irritable man over 40, bioidentical","messageBody":"<div id=\"ygrps-yiv-727719204\">Having experienced some of what you are going through, I would like to<br/>\nshare what is working for us.  First, for an irritable man over 40,<br/>\nbioidentical testosterone is absolutely amazing!  My formerly irritable<br/>\nhusband has become the man I could only dream about before.  As for our<br/>\nchildren, I searched for the least forceful way I could find to get them to<br/>\nmemorize facts. We joined a Classical Conversations group.  CC has history,<br/>\nskip counting and English grammar memorization put to music for the<br/>\nchildren to memorize every week.  The meeting motivates the children keep<br/>\nup with the class by doing the work, though it could also be done on your<br/>\nown. YouTube has also been helpful for finding memorization put to music<br/>\nsuch as the presidents, the states and capitals and the countries of the<br/>\nworld.  It isn&#39;t unschooling, but it takes very little time each day and<br/>\nleaves plenty of time for the child to pursue other interests.<br/>\n<br/>\nJill<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jul 28, 2012 at 7:36 AM, Ann &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:auntannies2002@...\">auntannies2002@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This may not be appropriate for this board, but I don&#39;t know where else to<br/>\n&gt; go. No one else is going to understand the unschooling component of this<br/>\n&gt; issue.<br/>\n&gt;<br/>\n&gt; I have been radically unschooling my 11 yo son for 3 years. From the<br/>\n&gt; beginning we were eclectic, then merged into basic unschooling, then<br/>\n&gt; radical unschooling. It works for my son. He learns things so quickly with<br/>\n&gt; unschooling. Life is so much more peaceful for us. He helps around the<br/>\n&gt; house sometimes without even being asked (everything was forced before the<br/>\n&gt; radical unschooling). Until my husband comes home. My husband is against<br/>\n&gt; unschooling, at least when it comes to math and copious gaming (my son is a<br/>\n&gt; gamer--mindcraft, halo, world of warcraft, etc). After 3 years and many<br/>\n&gt; many conversations about all that my son is learning--I journal the things<br/>\n&gt; he learns during the day) and how unschooling works, he just isn&#39;t coming<br/>\n&gt; around. He&#39;ll go for a few weeks and be ok, then he blows up about it. Even<br/>\n&gt; when I show him the journal of everything my son is learning, he thinks<br/>\n&gt; he&#39;s not learning the &quot;right&quot; things. He wants to see math facts and<br/>\n&gt; worksheet, he wants my son to be able to spew out historical dates, he<br/>\n&gt; wants to be able to come home and quiz the boy like he&#39;s a robot. The<br/>\n&gt; thought of forcing my son to start learning certain things in certain ways<br/>\n&gt; breaks my heart. I know it won&#39;t work. I know what it will do to his<br/>\n&gt; learning process-he will start shutting down and/or rebelling. I&#39;m sure of<br/>\n&gt; it. What would you do? Would you stop unschooling if your husband one day<br/>\n&gt; tried to put an end it? A couple of additional notes--my husband and I have<br/>\n&gt; a rocky marriage; always have, he does not like most of how I live my life<br/>\n&gt; (I live a very organic life). Also, my husband is my son&#39;s stepfather, but<br/>\n&gt; my son&#39;s biological father is not involved.<br/>\n&gt;<br/>\n&gt; Ann<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":366861124,"authorName":"Melissa and Bryon","from":"Melissa and Bryon &lt;bryandmiss96@...&gt;","profile":"lvhomeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343661858","msgId":48819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5MjZCRDUyLUJGOUEtNDQzNC1BOTZELUY3RjgyNkU3RkU5NUBhb2wuY29tPg=="},"prevInTopic":48812,"nextInTopic":48821,"prevInTime":48818,"nextInTime":48820,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... certain ways breaks my heart. I know it won t work. I know what it will do to his learning process-he will start shutting down and/or rebelling. I m sure","messageBody":"<div id=\"ygrps-yiv-1346879614\"><blockquote><span title=\"ireply\">&gt;The thought of forcing my son to start learning certain things in  <br/>\n </span></blockquote>certain ways breaks my heart. I know it won&#39;t work. I know what it  <br/>\nwill do to his learning process-he will start shutting down and/or  <br/>\nrebelling. I&#39;m sure of it. What would you do? Would you stop  <br/>\nunschooling if your husband one day tried to put an end it? A couple  <br/>\nof additional notes--my husband and I have a rocky marriage; always  <br/>\nhave, he does not like most of how I live my life (I live a very  <br/>\norganic life). Also, my husband is my son&#39;s stepfather, but my son&#39;s  <br/>\nbiological father is not involved.<br/>\n<br/>\nAnn<br/>\n<br/>\n<br/>\nHi Ann:<br/>\nI think I&#39;d focus on working on the marriage. Maybe it&#39;s just your  <br/>\nhusband feels as if he has no say, or that things are out of control  <br/>\nor even that your house is divided and he is the odd man out and it  <br/>\nshows up in the way he feels about unschooling.<br/>\n<br/>\nMy husband is a police officer. So as you can imagine, having 4  <br/>\nchildren we unschool and where we practice gentle parenting, it&#39;s  <br/>\ncompletely different than what he encounters at work. Though he has  <br/>\nalways said the homeschooling is my domain and encouraged me to do  <br/>\nwhat I want. I wanted my husband on board with unschooling because  <br/>\nit&#39;s so much different from other homeschool methods we used before.  <br/>\nIt is really so family entwined it would feel off me unschooling and  <br/>\nhim not being on board. For him, hearing Sandra Dodd in Michelle  <br/>\nBarone&#39;s unschooling conference was very helpful. I know he had a huge  <br/>\nah-ha moment as we sat side by side listening. My husband doesn&#39;t like  <br/>\nto read but likes when I read to him, so I read unschooling books and  <br/>\nJoyce and Sandra&#39;s website to him in bits and pieces. I also used a  <br/>\nlot of what he has done in his own life as unschooling moments for him  <br/>\nto connect with. I share with him through the day things the kids do,  <br/>\nI make him feel included even when he&#39;s off at work, if that makes  <br/>\nsense.<br/>\n<br/>\nHe works swing shift so when he comes home the house is quiet and most  <br/>\nof us are sleeping. But that quiet time gives him time to decompress  <br/>\nfrom his day and ease back in to life that is different than what he  <br/>\ndeals with on duty at work.<br/>\n  When your husband comes home from work, make it a peaceful  <br/>\ntransition for him. If he likes time to quietly unwind let him do so.  <br/>\nIf he likes to come in and see the house somewhat tidy, try to make  <br/>\nsure you do that before he walks through the door. Greet him with a  <br/>\nhug and a kiss and welcome him home happily. Have dinner ready each  <br/>\nnight if he places a high priority on eating as soon as he comes home.  <br/>\nMake the effort to look attractive to him each time he sees you, be  <br/>\nthat in he has a favorite color or putting on make up everyday.<br/>\n<br/>\nI look at the marriage and connection that I have with my husband as a  <br/>\ngift we give our children as well as ourselves. I want them to see two  <br/>\nparents who love each other outrageously. I&#39;ve been with my husband 17  <br/>\nyears and I love him more today than the year before. So I make it a  <br/>\npoint to put as much energy into my marriage as I do on unschooling.   <br/>\nMy husband&#39;s love language is physical affection so that&#39;s something  <br/>\nhe places a very high value on, though he jokes and says all men place  <br/>\na high value on this : ).  I have asked him previously to tell me his  <br/>\nconcerns about unschooling. It used to be the concern of math and them  <br/>\nlearning enough about everything. : ) He doesn&#39;t have those concerns  <br/>\nanymore. Time, talking with me, hearing the books and websites, trust  <br/>\nin me, seeing our kids happy and hearing from them all they do know,  <br/>\nand having his own unschool examples in his life to draw from, has all  <br/>\nset his mind at ease over time.<br/>\n<br/>\nMaybe read to find out what your husband&#39;s love language is and see if  <br/>\nthat is something you can focus on. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.5lovelanguages.com/assessments/love/\">http://www.5lovelanguages.com/assessments/love/</a><br/>\n<br/>\nThere is a wonderful book called The Love Dare. Though it is written  <br/>\nfrom a Christian perspective, I do think any spouse regardless of  <br/>\nreligious or non religious beliefs can get a lot out of it to help  <br/>\nfocus on their marriage and improving it.<br/>\n<br/>\nPossibly counseling might be of help, Michelle Barone offers  <br/>\ncounseling and is an unschooling parent: <a rel=\"nofollow\" target=\"_blank\" href=\"http://michellebarone.com/\">http://michellebarone.com/</a><br/>\n<br/>\nWishing you much luck,<br/>\n~Melissa~<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: The End of Unschooling?","postDate":"1343661548","msgId":48812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2OEE4QTU2LUM2MDAtNDNCMy04NjM3LTlFQTk1NEY4MTEyN0BhdHQubmV0Pg==","inReplyToHeader":"PDEzNDM2NTc1MTMuOTkyMzAuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPiA8anY1dW9iK3JzaTRAZUdyb3Vwcy5jb20+IDwxMzQzNjU3NTEzLjk5MjMwLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":48811,"nextInTopic":48819,"prevInTime":48811,"nextInTime":48813,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"Not every child has a damaging experience of divorce, just as not every child has a damaging experience of school.  There does not need to be abuse to make a","messageBody":"<div id=\"ygrps-yiv-1854556859\">Not every child has a damaging experience of divorce, just as not every child has a damaging experience of school.  There does not need to be abuse to make a marriage unsuitable for either party.  I&#39;m exceptionally thankful my parents divorced- both are happier people for finding more suitable relationships and I think I&#39;d be truly damaged knowing my parents held together a crap marriage based on an assumption about my feelings or potential reaction.  Living with people who have vastly different expectations of one another, marriage, life is not pleasant.  Even if they&#39;re &quot;working on it&quot;. <br/>\n<br/>\nCertainly counseling is worth doing, as long as both parties are willing.  Certainly it&#39;s good to understand all the potential consequences- as much as one can.  Divorce isn&#39;t always the answer, but often it takes the pressure off of everyone- including the children.  Particularly with marriages/relationships that began for all the wrong reasons.<br/>\n<br/>\nLesley<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343660095","msgId":48811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFEQkRDRDM4LTAyMzMtNDBEMy1BNzM2LTU0QjhFMDMyMTkwREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp2NG52aittajY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGp2NG52aittajY0QGVHcm91cHMuY29tPg=="},"prevInTopic":48810,"nextInTopic":48812,"prevInTime":48810,"nextInTime":48812,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... So, based on my last post about the philosophy of unschooling, lying might be a tool a parent will choose to use, but it isn t a tool in the unschooling","messageBody":"<div id=\"ygrps-yiv-15853465\">On Jul 29, 2012, at 9:28 PM, lindaguitar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But in some cases it really does help. I&#39;m not suggesting that any<br/>\n&gt; relationship be built upon lies. But I am suggesting that lying, in some cases,<br/>\n&gt; for the sake of peace in the home or protecting children, is NOT always<br/>\n&gt; a bad thing. And my opinion about this is based on *my* experience and values.<br/>\n<br/>\n </span></blockquote>So, based on my last post about the philosophy of unschooling, lying might be a tool a parent will choose to use, but it isn&#39;t a tool in the unschooling philosophy package deal.<br/>\n<br/>\nA parent might decide they can&#39;t figure out how to use the tools of the unschooling philosophy to create a peaceful, joyful place to explore interests for their kids (or whatever their goal is). So they might reach outside of the unschooling philosophy for tools they know how to use.<br/>\n<br/>\nPeople already know how to lie. They figure it out by the time they&#39;re 3. ;-) It doesn&#39;t need to be a tool offered as a choice.<br/>\n<br/>\nAnd it definitely shouldn&#39;t be labeled as part of the unschooling philosophy package. This list helps people figure out how to make the unschooling philosophy tools work. They can, at any time, reach outside of the tool set offered here. But this list shouldn&#39;t be seen as a place to get help using tools outside of the philosophy set.<br/>\n<br/>\nLying *does* damage relationships (when the lies are found out.) Damaged relationships make unschooling more difficult.<br/>\n<br/>\nIf someone want to take the chance that they can create a better life for their children by lying to their spouse, they have freedom of choice to do that.<br/>\n<br/>\nBut please don&#39;t suggest that lying is part of the Radical Unschooling Philosophy.<br/>\n<br/>\nSomeone might get some plants, under some conditions to grow by &quot;watering&quot; them with vodka. But a plant care book shouldn&#39;t be offering vodka as a suggestion of how to water plants.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why do you believe that always being truthful is the only way to create a peaceful family?<br/>\n<br/>\n </span></blockquote>Not lying isn&#39;t the same as always being truthful. ;-)<br/>\n<br/>\nThough I&#39;m not advocating being cagey and skirty either.<br/>\n<br/>\nBetter is to dig deeper and find out what someone really needs. Meeting needs grows better relationships. Better relationships grows more peaceful families. <br/>\n<br/>\nBetter than lying about doing math to a Dad is finding out specifics of what will help the Dad feel more peaceful. (But that&#39;s not a rule. It&#39;s how the principles might look in action.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What if truth leads to strife and a worse relationship, rather than peace?<br/>\n&gt; Have you never seen this happen in a family?<br/>\n<br/>\n </span></blockquote>Then that person doesn&#39;t have the skills or the support to figure out how to  make the principles work in their situation.<br/>\n<br/>\nThat *doesn&#39;t* mean the philosophy should be expanded to include ideas that others who are successfully using the philosophy would find damaging.<br/>\n<br/>\nBetter for that person who is causing more damage by trying to make the philosophy work to reach outside the philosophy for something they know how to use.<br/>\n<br/>\nBut, again, the philosophy shouldn&#39;t be weakened with ideas that would harm others, in order to make that person feel better about their choices.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; The list is focused on values, ideas and practices that grow better<br/>\n&gt; &gt; relationships and healthy, joyful families.<br/>\n&gt; <br/>\n&gt; If that is really the focus of this list, then why is it called &quot;Unschooling Basics&quot;?<br/>\n&gt; Do you believe that families with members who are are too unhealthy or depressed<br/>\n&gt; to create an ideal relationship are incapable of unschooling?<br/>\n<br/>\n </span></blockquote>If a family can&#39;t figure out how to unschool from that, then they &quot;can&#39;t&quot;. <br/>\n<br/>\nEvery family with kids has the raw materials -- the kids :-) -- for unschooling. But the family is like a house. The house is the container for the unschooling environment. Some people&#39;s houses have rotten foundations, leaking roofs, broken windows. It will take a lot of work to make them suitable for unschooling. On the list we can offer lots of ideas that will move toward stronger foundations, tighter windows and sounder roofs. <br/>\n<br/>\nThere might be ideas out there that a mom might use to hold things together long enough to make things work. But that, as general principles, work against stronger foundations.<br/>\n<br/>\nLying is not a &quot;stronger foundation&quot; tool.<br/>\n<br/>\nYelling at a child is not a good unschooling tool. But an unschooling mother might yell to get a kid to stop running into the street. Better, though, than advocating yelling, is helping the mom avoid as much as she can situations where yelling might be the only option she can think of and helping the mom build up a set of *better* tools.<br/>\n<br/>\nYelling once is unlikely to cause any lasting damage. Lying, on the other hand, has the greater potential to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If rights are not put ahead of relationships, then the *people* in the relationship will suffer,<br/>\n&gt; and a relationship that is built on allowing (or forcing, in the case of children) the people in<br/>\n&gt; it to suffer can not possibly be a healthy relationship!<br/>\n<br/>\n </span></blockquote>Forcing someone to do something against their will will damage the person and damage the relationship. Bringing in rights just muddles the ideas.<br/>\n<br/>\nLong before anyone thought about human rights, people were being damaged by how others treated them. Rights have grown out of recognizing the effects of certain kinds of treatment and codifying it. The rights didn&#39;t come first -- despite the &quot;inalienable&quot; word in the Constitution suggesting so. The biological reaction to the treatment came first.<br/>\n<br/>\nSo it helps to skip that &quot;rights&quot; overlay and focus on what was always there: The need.<br/>\n<br/>\nThe view of seeing the world through protecting rights, naturally divides the world into those whose rights need protected and those who are attacking the rights. (It has to. Defining an idea as a right is meaningless unless someone at sometime has tried to take it away.)<br/>\n<br/>\nBut the view of seeing the world through needs and meeting those needs doesn&#39;t create adversaries. There are needs. The needs exist whether other people are helping or hindering. And when combined with unschooling principles, parents can find ways to meet their kids needs -- and their spouse&#39;s needs! -- in ways that are peaceful, kind, supportive, nurturing and so on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; it seems to me that you are saying that it&#39;s OK to force a child to do things<br/>\n&gt; that will make him/her miserable in order to maintain a peaceful relationship<br/>\n&gt; with one&#39;s spouse. <br/>\n<br/>\n </span></blockquote>Unschooling is about creating an environment for kids to explore their interests freely in and, therefore, learn.<br/>\n<br/>\nA peaceful, intact family with parents who are responsive to their children&#39;s needs creates a better learning environment.<br/>\n<br/>\nMiserable kids aren&#39;t peaceful. Neither are miserable parents.<br/>\n<br/>\nThere are no pat solutions that will work for everyone. There are *principles* though, that will help people make choices that move in a particular direction.<br/>\n<br/>\nThe unschooling principles are guides. They are based on how undamaged humans prefer to be treated. Using those principles will help families move towards stronger relationships which will create more peaceful, secure, happy homes, which will make learning easier.<br/>\n<br/>\nIn general, people don&#39;t like to be lied to. It damages relationships when they find out they&#39;ve been lied to.<br/>\n<br/>\nIs that a rule? No. It&#39;s an acknowledgement of fact. It&#39;s human biology.<br/>\n<br/>\nIf someone knows they might damage the relationship by lying, if someone can&#39;t figure out how to make the unschooling principles work in their family, might they decide the risk of damage was worth it to lie? Yes.<br/>\n<br/>\nBut don&#39;t suggest that lying is a good sound part of the unschooling philosophy. It&#39;s not. It&#39;s a tool an unschooler might reach for. But they&#39;r reaching outside the philosophy for it and the consequences are unpredictable, depending entirely on their uniques situation and too many other factors to suggest it as a good tool.<br/>\n<br/>\nThe Unschooling Philosophy is a set of tools for people to use or not. It just muddies the discussion to redefine the philosophy as &quot;anything an unschooler can make work for their family.&quot;<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: The End of Unschooling?","postDate":"1343658212","msgId":48810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDM2NTgyMTIuODE4NTcuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzNDM2NTc1MTMuOTkyMzAuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPiA8anY1dW9iK3JzaTRAZUdyb3Vwcy5jb20+IDwxMzQzNjU3NTEzLjk5MjMwLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":48809,"nextInTopic":48811,"prevInTime":48809,"nextInTime":48811,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"Sandra Dodd just wrote this in another list about something else:   In any case, don t blow off half of your parenting team.  If you do, what can happen in","messageBody":"<div id=\"ygrps-yiv-2045578276\">Sandra Dodd just wrote this in another list about something else:<br/>\n<br/>\n<br/>\n &quot;In any case, don&#39;t blow off half of your parenting team.  If you do, what can happen in very little time is that the &quot;parenting team&quot; becomes a battleground of you, your new partner, your ex, and his-or-her new partner, all arguing about your children, and having just about as much legal right over how they dress and act and where they go and what they do as you yourself have, so live sweetly and wisely and don&#39;t screw it up.  <br/>\nUnschooling can be fantastic, but if a parent fumbles awkwardly with it and ruins a marriage or a stable relationship, then it wasn&#39;t at all fantastic, it was awful.  And it wasn&#39;t the unschooling.  It was the awkward fumbling.&quot;<br/>\n<br/>\n<br/>\nHaving a lot of experience with Divorce ( parents, ex husband and more) I would say that , apart from abusive marriages, that being in a home where the parents are together and peacefully living is the base to a happy and full unschooling life.<br/>\nNo child feels safe during and after divorce. It very very hard and damaging to kids in so many ways.<br/>\nDo not think that a divorce will get rid of your nagging husband and that you will be able to do as you please with the kids. <br/>\nIT wont happen in most cases and usually when it does because dad becomes absent than it is very hurtful for the child. Hurts that will last a lifetime<br/>\n<br/>\n.<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: The End of Unschooling?","postDate":"1343657513","msgId":48809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDM2NTc1MTMuOTkyMzAuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGp2NXVvYityc2k0QGVHcm91cHMuY29tPg==","referencesHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPiA8anY1dW9iK3JzaTRAZUdyb3Vwcy5jb20+"},"prevInTopic":48808,"nextInTopic":48810,"prevInTime":48808,"nextInTime":48810,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... Are you saying that divorce was better than sending the kids to school or doing some school at home? I hope not. If the divorce was caused by mom","messageBody":"<div id=\"ygrps-yiv-354655189\"><blockquote><span title=\"ireply\">&gt; In a couple of those families, the parents ended up getting divorced; the kids were able to continue unschooling in one of those families, and ended up having to go to school in the other. The kids who continued unschooling seem a LOT happier than the ones who went to school! -<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Are you saying that divorce was better than sending the kids to school or doing some school at home?<br/>\n<br/>\nI hope not.<br/>\nIf the divorce was caused by mom insistence in unschooling against dad&#39;s wishes. If mom and dad could never work out a solution that made everyone happy and that caused the divorce I would say that there is way more damage to a child  in divorce than going to school in most cases~!<br/>\n<br/>\nDivorce sucks for kids. Even when you are 30 and your parents divorce it is really hard. Really hard. For kids it is  very very damaging ( unless there is abuse in the relationship and not for just parents disagreeing and not getting along).<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343653217","msgId":48808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzMjk0ODUwLTc0RDgtNERDOC1CNDkyLUQ5QkVBMzU0NjgyQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp2NG52aittajY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGp2NG52aittajY0QGVHcm91cHMuY29tPg=="},"prevInTopic":48807,"nextInTopic":48809,"prevInTime":48807,"nextInTime":48809,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... We each gather ideas we feel are right pulled from many philosophies. We cobble them together into our own personal philosophy. I m guessing a big part of","messageBody":"<div id=\"ygrps-yiv-1870054718\"><blockquote><span title=\"ireply\">&gt; Unschooling is about respecting the rights of our children,<br/>\n<br/>\n </span></blockquote>We each gather ideas we feel are right pulled from many philosophies. We cobble them together into our own personal philosophy.<br/>\n<br/>\nI&#39;m guessing a big part of your personal philosophy are ideas from the unschooling philosophy. You&#39;ve also added into the mix ideas about respecting the rights of children.<br/>\n<br/>\nWhat&#39;s confusing the discussion, though, is you&#39;re labeling your mix unschooling. You have that right ;-) But for clarity&#39;s sake, this list focuses on the core set of unschooling beliefs with just one add on: expanding the unschooling philosophy into parenting. (Thus the &quot;radical&quot; added to unschooling.)<br/>\n<br/>\nThe list focuses on that core set of beliefs + add on not to limit what members do in their homes, not to limit their personal philosophies, but for clarity. If it&#39;s stated here that x will move you closer to unschooling and y will move you away from unschooling, we&#39;re referring to the core set, not someone&#39;s personal set. Each person is then free to decide if what&#39;s discussed will help them move toward or away from where they want to go, be that unschooling or whatever they feel unschooling or parts of unschooling is helping them move toward.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is about respecting the rights of our children,<br/>\n<br/>\n </span></blockquote>Parents can unschool successfully without ever thinking about the rights of children. I did. I respected my daughter. If I &quot;respected her rights&quot; it was a side effect of respecting her. I didn&#39;t make choices based on whether or not I was respecting her rights. I made choices based on (among other things) whether or not I was respecting her.<br/>\n<br/>\nIf an idea can be dropped from a philosophy and still have the philosophy work, then it&#39;s not part of the core set of ideas.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is about respecting the rights of our children, as well as trusting, loving, supporting, and nurturing our children.<br/>\n<br/>\n </span></blockquote>Each thinking (self-reflective) person has a goal, a &quot;place&quot; we want to be, a person we want to be, a way we want to live our life.<br/>\n<br/>\nA philosophy is a set of ideas on how to navigate in a particular direction, toward a particular ideal, no matter where you start from. Figuring out how to use those tools is the tricky part. But the philosophy, when understood, shouldn&#39;t contain tools that lead away.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is about respecting the rights of our children, as well as trusting, loving, supporting, and nurturing our children.<br/>\n<br/>\n </span></blockquote>&quot;Is about&quot; is vague. Clearer -- and clarity of unschooling is what the list is about ;-) -- is what you listed are *tools* -- principles. The principles are like check lists to help parents decide if an idea will move towards where they want to go or away from it.<br/>\n<br/>\nSo a parent can ask themselves &quot;Is what I&#39;m about to do trusting?&quot; &quot;Is it loving?&quot; &quot;Is it supportive?&quot; If not, how can I use these principles to craft a solution that is?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; the word itself still contains that core idea of not *forcing* kids to<br/>\n&gt; go to school or do school-ish things at home.<br/>\n<br/>\n </span></blockquote>Not forcing kids to school is a choice someone might make based on the ideas of unschooling. It&#39;s what unschooling might look like on the surface, but it&#39;s not a core idea.<br/>\n<br/>\nTo test whether an idea is core or not, it helps to pull ideas out of context to examine what they connect to to see if the ideas on their own move toward where you want to go or not, or if they&#39;d need a whole support system to make work.<br/>\n <br/>\nParents who have a broken relationship with their kids can &quot;not force their kids to school&quot;, &quot;not force them to do schoolish-things at home&quot; and be no where near unschooling.<br/>\n<br/>\nDepressed parents who are struggling with their own issues, alcoholic or drug-addicted parents who aren&#39;t even trying to parent well, can easily &quot;not force their kids to school,&quot; but not be creating a supportive, nurturing environment for their kids to freely explore their interests in.<br/>\n<br/>\nSo, no, it&#39;s not a core idea of unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is, in part, about non-coercion in educating and raising our children.<br/>\n&gt; No matter what you add on to the concept, or how you redefine it, the word itself still<br/>\n&gt; contains that core idea of not *forcing* kids to go to school or do school-ish things at home.<br/>\n<br/>\n </span></blockquote>Those I&#39;d say are all ways the tools can get used.<br/>\n<br/>\nUnschooling is built around the core idea that children learn *best* in an atmosphere where they&#39;re supported in freely exploring what interests them.<br/>\n<br/>\nThat should not be seen as a set of rules. It should not be seen as a defined place to live in and protect. It&#39;s an idea. It&#39;s a beacon as well as a set of steering tools. Life is like a forest with many paths. <br/>\n<br/>\nThe tools help people analyze the paths they see before them. Once someone is skilled at the tools, the tools can help people create their own paths :-)<br/>\n<br/>\nIf life were simple, choices could be easily labeled good and bad. But most choices are a mix or pluses and minuses so the real task is figuring out if a path is better or not as good, warmer or cooler, steering towards or away from the hidden beacon. The tools -- the principles -- help someone make those decisions.<br/>\n<br/>\nAt first their better choice may not be all that great, e.g., yelling instead of hitting, basically heading towards &quot;expressing frustration&quot; instead of &quot;enforcing obedience&quot; when they&#39;re trying to go to &quot;supportive&quot;. But the more someone uses the principles, the better they get at feeling where &quot;supportive&quot; is. They&#39;ll know &quot;forcing obedience&quot; won&#39;t head that direction at all. The principles and the person&#39;s growing understanding of how the principles work and what they want looks like** will help them know the &quot;listen&quot; path, and &quot;let me think about that&quot; path are better than the &quot;yelling&quot; path.<br/>\n<br/>\n** It helps someone think more clearly if they *don&#39;t* define their destination as &quot;unschooling.&quot; Unschooling is too vague a concept. It&#39;s not a destination so much as it&#39;s a vehicle or a path or a beacon that gets you where you want to go. And where you want to go might be: whole, healthy, happy children. It might be independent children who got there on their own schedule. It might be undamaged children. It might be children who feel empowered to be whatever they want to be. And unschooling is the way someone might feel is the best way for their family to get to where they&#39;d like to go.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: The End of Unschooling?","postDate":"1343651403","msgId":48807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2NXVvYityc2k0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPg=="},"prevInTopic":48806,"nextInTopic":48808,"prevInTime":48806,"nextInTime":48808,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... **************** In one family they demanded it. Others... I feel like I m saying this a lot, but it s nowhere near so cut and dried. In a dysfunctional","messageBody":"<div id=\"ygrps-yiv-1346206925\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Just out of curiosity, did the kids you know, whose dysfunctional, neglectful parents eventually put them back in school, agree that school was better than staying home? Did they go willingly? <br/>\n </span></blockquote>****************<br/>\n<br/>\nIn one family they demanded it. Others... I feel like I&#39;m saying this a lot, but it&#39;s nowhere near so cut and dried. In a dysfunctional family &quot;willingness&quot; can be a screwy concept in and of itself, and dysfunctional or not, parents can exert a lot of pressure on kids to conform to parental values. That&#39;s one of the reason lists like this exist, to help parents who want to pick apart expectations and assumptions. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Those kids, who appreciate whatever benefits they derive by being in school, are not the kids for whom school is a jail sentence.<br/>\n </span></blockquote>***************<br/>\n<br/>\nFor most kids in school, whether or not they appreciate the benefits, it&#39;s not so much a jail sentence as doing what everyone does because everyone does it. It&#39;s no different than growing up in an isolated community where most people go alone with what&#39;s done - in fact schools function very like isolated communites in many ways. <br/>\n<br/>\nNot all families will succeed at unschooling - that doesn&#39;t make those parents evil jail wardens. There are a whole host of reasons much less extreme than family dysfunction which make home education or school a better option for a family for a year, or a few years, or longer. Unschooling takes resources! It can take different resources even for different kids within the same family.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Anyway, when it comes to unschooling in families where there is *some* strife and/or dysfunction, disability, or mental illness, but not any kind of neglect, I know of quite a few local families where the moms decided to unschool, and the mom and the kids have a really good relationship, the kids are happy and healthy, and engaged in all kinds of enriching activities, and have friends and a social group<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThe &quot;enriching activities, friends and social group&quot; part is a good example of what I mean by &quot;resources&quot;. People who don&#39;t have the staunchest internal resources can do a lot more with enough outside support - I&#39;ve seen that too, although the families I know generally do something more like eclectic homeschooling than unschooling - unschooling except for [fill in the blank]. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; In a couple of those families, the parents ended up getting divorced; the kids were able to continue unschooling in one of those families, and ended up having to go to school in the other. The kids who continued unschooling seem a LOT happier than the ones who went to school!<br/>\n </span></blockquote>*********************<br/>\n<br/>\nThere&#39;s a whole other issue conflating that of unschooling versus school, which is the fact that in one family the parents were able to work things out Enough to unschool. I&#39;ve been on both sides of that situation in a divorce - able to work things out enough to unschool is better and everyone&#39;s happier, definitely, but there is also a value to being able to work things out enough to agree on school. Divorce can make all decisions vastly more complex if there&#39;s antagonism between the &quot;sides&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; In the case of the mom who has been unschooling her son for 3 years, and the stepfather doesn&#39;t like it and keeps quizzing the boy, going to school or doing online school or daily workbook pages *could* be a solution - IF the *boy* agrees to it. But if he really hates the idea, then, of course, that is not the solution.<br/>\n </span></blockquote>***************<br/>\n<br/>\nYes! And whether he agrees to it will have a lot to do with how he feels about his stepdad. If he wants a better relationship with the man, he may very well agree to do something unpleasant in an attempt to smooth things over. It really depends on his needs and perspectives. That&#39;s why I&#39;m uncomfortable with folks say &quot;stepdad has no rights&quot; - to hell with that, how much does this kid love him and want his approval? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Marriage counseling still seems like a good idea.<br/>\n<br/>\n </span></blockquote>Some kind of work on the marriage is totally a good idea. A family can unschool even if dad isn&#39;t 100% sold on unschooling if there&#39;s enough trust and support going around. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343630704","msgId":48806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2NWFoZys3ZHMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2NHM0bis1NGRxQGVHcm91cHMuY29tPg=="},"prevInTopic":48805,"nextInTopic":48807,"prevInTime":48805,"nextInTime":48807,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... Just out of curiosity, did the kids you know, whose dysfunctional, neglectful parents eventually put them back in school, agree that school was better than","messageBody":"<div id=\"ygrps-yiv-786961811\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... I&#39;ve met families which were so dysfunctional that<br/>\n&gt; &quot;unschooling&quot; was neglectful and damaging to the kids. Those<br/>\n&gt; families eventually figured that out and put the kids in school,<br/>\n&gt; I&#39;m happy to say. Not every family can unschool; it takes some<br/>\n&gt; resources - different resources for different families for sure,<br/>\n&gt; but a certain base level of resiliency and adaptability are vital.<br/>\n<br/>\n </span></blockquote>Just out of curiosity, did the kids you know, whose dysfunctional, neglectful parents eventually put them back in school, agree that school was better than staying home? Did they go willingly? I know that there are lots of kids, all over the world, for whom going to school *is* a much better situation than not going to school. Those kids, who appreciate whatever benefits they derive by being in school, are not the kids for whom school is a jail sentence. If they go to school willingly, and if they don&#39;t have some kind of learning/developmental disability that renders them incapable of behaving as kids in school are required to behave, then they will probably be OK, probably won&#39;t start skipping school in high school and get arrested for truancy and drug use. And they probably won&#39;t be having nightly battles with their parents over homework, and morning battles over getting up and getting ready and out of the house on time.<br/>\n<br/>\nThere was a long debate on Dr. Peter Gray&#39;s blog, &quot;Freedom To Learn&quot;, a couple of years ago, about his article claiming that &quot;school is prison.&quot; Many people agreed with him, that school - specifically the American public school system - IS prison. Others disagreed. Ultimately, it comes down to student choice. <br/>\nEven if the student acknowledges that the choice to attend a public school is only the lesser of two evils, at least the kid feels like s/he has made a choice, and will not be fighting with his/her parents about it every day.<br/>\n<br/>\nAnyway, when it comes to unschooling in families where there is *some* strife and/or dysfunction, disability, or mental illness, but not any kind of neglect, I know of quite a few local families where the moms decided to unschool, and the mom and the kids have a really good relationship, the kids are happy and healthy, and engaged in all kinds of enriching activities, and have friends and a social group, but the dad is pretty much just the wage earner - by his own choice. And in some cases, the dad gradually came around, but it took a long time, because he chose to be less involved, and/or because he was too wrapped up in his own untreated illness. <br/>\nIn a couple of those families, the parents ended up getting divorced; the kids were able to continue unschooling in one of those families, and ended up having to go to school in the other. The kids who continued unschooling seem a LOT happier than the ones who went to school!<br/>\n<br/>\nIf the fathers in the families who stayed together had insisted that the kids go to public school, and the kids hated it and fought against it every day, it obviously wouldn&#39;t have improved the relationship between any of the family members.<br/>\n<br/>\nIn the case of the mom who has been unschooling her son for 3 years, and the stepfather doesn&#39;t like it and keeps quizzing the boy, going to school or doing online school or daily workbook pages *could* be a solution - IF the *boy* agrees to it. But if he really hates the idea, then, of course, that is not the solution.<br/>\n<br/>\nMarriage counseling still seems like a good idea. When I suggested that the mom try to find a counselor who is open to alternative educational ideas, it was because  - as we all know - the conventional approach to parenting in this country is very authoritarian, and the happiness of the kids is generally NOT a consideration to most adults. For a mom who has been unschooling, it would NOT be helpful to go to someone who tells her to &quot;suck it up and make those kids do their schoolwork&quot; in order to improve the marriage!<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343615959","msgId":48805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2NHM0bis1NGRxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2NG52aittajY0QGVHcm91cHMuY29tPg=="},"prevInTopic":48804,"nextInTopic":48806,"prevInTime":48804,"nextInTime":48806,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... **************** I ve met families which were so dysfunctional that unschooling was neglectful and damaging to the kids. Those families eventually","messageBody":"<div id=\"ygrps-yiv-2017778862\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Do you believe that families with members who are are too unhealthy or depressed to create an ideal relationship are incapable of unschooling?<br/>\n </span></blockquote>****************<br/>\n<br/>\nI&#39;ve met families which were so dysfunctional that &quot;unschooling&quot; was neglectful and damaging to the kids. Those families eventually figured that out and put the kids in school, I&#39;m happy to say. Not every family can unschool; it takes some resources - different resources for different families for sure, but a certain base level of resiliency and adaptability are vital. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;No matter what you add on to the concept, or how you redefine it, the word itself still contains that core idea of not *forcing* kids to go to school or do school-ish things at home.<br/>\n </span></blockquote>****************<br/>\n<br/>\nBut not all families can unschool - that&#39;s a big part of the question which started this thread. Sometimes it is better to step away from unschooling either a little bit or a whole lot, because it makes life better for everyone. It&#39;s rough being in that kind of situation!  Sometimes the best you can do is pick your way among less-than-perfect options for the relatively kinder, relatively more peaceful solution and work on creating better options from there. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If rights are not put ahead of relationships, then the *people* in the relationship will suffer<br/>\n </span></blockquote>*****************<br/>\n<br/>\nI find focusing on rights tends to bog things down by bringing up exactly these kinds of either-or arguements. It helps to step back from ideas about rights and look at the needs and feelings and perspectives of the people involved - all the people, kids and adults. When people have a sense that their needs, feelings and perspectives are being honored, it&#39;s much easier to come to a compromise - it&#39;s much easier for people to give things up for the sake of someone they care about. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;the fact is that if a mom and kids tell the dad that they did some reading, writing, studying, or math calculating when they didn&#39;t, and that makes the dad feel better about his family, and keeps him calm, then it has, in fact, helped create a peaceful household<br/>\n </span></blockquote>***************<br/>\n<br/>\nThat&#39;s a good example of what I mean - in a specific situation, it was more thoughtful of everyone&#39;s needs to lie. It made life easier and more peaceful all around. It wouldn&#39;t work in the sort of situation where dad would quiz the kids on what they learned - but that&#39;s not an ethical consideration so much as a practical one. <br/>\n<br/>\nOn an ethical level, one could say it violated the rights of the dad to know that his children were safe and well cared for, or violated the rights of the children themselves to be educated. That&#39;s another reason I don&#39;t like &quot;rights&quot; arguments - it&#39;s too easy to twist the ideas around in ways which aren&#39;t helpful for anyone. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343611699","msgId":48804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2NG52aittajY0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZCQkY0QzA2LTQ0QTYtNDlCRS1CMTlCLURBMTVEOUIxRkI2RUB2ZXJpem9uLm5ldD4="},"prevInTopic":48803,"nextInTopic":48805,"prevInTime":48803,"nextInTime":48805,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... I understand that you believe that, and I assume that your beliefs about relationships are based on your experiences and your personal values. But in some","messageBody":"<div id=\"ygrps-yiv-1959716372\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; ... Lying won&#39;t help families build better relationships and<br/>\n&gt; peaceful families.<br/>\n<br/>\n </span></blockquote>I understand that you believe that, and I assume that your beliefs about relationships are based on your experiences and your personal values. But in some cases it really does help. I&#39;m not suggesting that any relationship be built upon lies. But I am suggesting that lying, in some cases, for the sake of peace in the home or protecting children, is NOT always a bad thing. And my opinion about this is based on *my* experience and values.<br/>\n<br/>\nWhy do you believe that always being truthful is the only way to create a peaceful family? What if truth leads to strife and a worse relationship, rather than peace? Have you never seen this happen in a family?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The list is focused on values, ideas and practices that grow better<br/>\n&gt; relationships and healthy, joyful families.<br/>\n<br/>\n </span></blockquote>If that is really the focus of this list, then why is it called &quot;Unschooling Basics&quot;? Do you believe that families with members who are are too unhealthy or depressed to create an ideal relationship are incapable of unschooling?<br/>\n<br/>\nUnschooling is about respecting the rights of our children, as well as trusting, loving, supporting, and nurturing our children. Unschooling is, in part, about non-coercion in educating and raising our children. No matter what you add on to the concept, or how you redefine it, the word itself still contains that core idea of not *forcing* kids to go to school or do school-ish things at home.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If rights are valued ahead of relationships, the relationships will<br/>\n&gt; suffer.<br/>\n<br/>\n </span></blockquote>If rights are not put ahead of relationships, then the *people* in the relationship will suffer, and a relationship that is built on allowing (or forcing, in the case of children) the people in it to suffer can not possibly be a healthy relationship!<br/>\n<br/>\nI suppose I am misunderstanding what YOU believe about relationships, because it seems to me that you are saying that it&#39;s OK to force a child to do things that will make him/her miserable in order to maintain a peaceful relationship with one&#39;s spouse.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What you&#39;ve written sounds like you haven&#39;t&#39; built a peaceful<br/>\n&gt; family with your husband. It&#39;s not a solid ground to advise others<br/>\n&gt; to build healthy relationships from.<br/>\n<br/>\n </span></blockquote>Actually, we do have a peaceful family. Our family life became progressively more and more peaceful as my husband came to realize that all the school-related stress was gone, and that there was no need to force the kids to do things that made them unhappy.<br/>\n<br/>\nAs much as you like to think that lying can&#39;t be helpful in making a relationship or household more peaceful, the fact is that if a mom and kids tell the dad that they did some reading, writing, studying, or math calculating when they didn&#39;t, and that makes the dad feel better about his family, and keeps him calm, then it has, in fact, helped create a peaceful household, without having to violate the fundamental rights and needs of the children.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343602525","msgId":48803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCQkY0QzA2LTQ0QTYtNDlCRS1CMTlCLURBMTVEOUIxRkI2RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp2NDZlbStndnRiQGVHcm91cHMuY29tPg==","referencesHeader":"PGp2NDZlbStndnRiQGVHcm91cHMuY29tPg=="},"prevInTopic":48802,"nextInTopic":48804,"prevInTime":48802,"nextInTime":48804,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... It very definitely can be so for many families and you suggested it to over 3000 people on a list focused specifically on building healthy relationships,","messageBody":"<div id=\"ygrps-yiv-1304004416\">On Jul 29, 2012, at 4:29 PM, lindaguitar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can see why you might think that, but it isn&#39;t so<br/>\n<br/>\n </span></blockquote>It very definitely can be so for many families and you suggested it to over 3000 people on a list focused specifically on building healthy relationships, peaceful lives to support unschooling.<br/>\n<br/>\nNo one should see this list as a collection of the only ideas they&#39;re allowed to have. It&#39;s one small side corner of the universe where ideas that support healthy relationships and peaceful families and unschooling are gathered.<br/>\n<br/>\nLying won&#39;t help families build better relationships and peaceful families.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that sometimes (not as an overall basis for a relationship),<br/>\n&gt; peace in the household takes precedence over truthfulness. <br/>\n<br/>\n </span></blockquote>The list isn&#39;t for whatever personal values an unschooling family might have adopted.<br/>\n<br/>\nThe list is focused on values, ideas and practices that grow better relationships and healthy, joyful families.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not so long ago, people with dark skin also didn&#39;t have the legal rights to liberty or to pursue happiness <br/>\n<br/>\n<br/>\n </span></blockquote>And 150 years ago you could have been really nice to your slaves. Or set them free and paid them wages. <br/>\n<br/>\nBut in court your personal philosophy counts for diddly.<br/>\n<br/>\nThinking gets muddled if the two are mixed together and not seen two entirely different issues.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I believe is that neither parent has the right to *abuse* or harm <br/>\n&gt; children, or to send them to a place where they will be abused or harmed. <br/>\n<br/>\n </span></blockquote>If rights are valued ahead of relationships, the relationships will suffer.<br/>\n<br/>\nWhat you&#39;ve written sounds like you haven&#39;t&#39; built a peaceful family with your husband. It&#39;s not a solid ground to advise others to build healthy relationships from.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343593750","msgId":48802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2NDZlbStndnRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRFMUJBMjAzLTA5NDItNDlCNC05MDU2LTk4ODc1MjVDMDYzQkB2ZXJpem9uLm5ldD4="},"prevInTopic":48800,"nextInTopic":48803,"prevInTime":48801,"nextInTime":48803,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... I can see why you might think that, but it isn t so. Seeing that their mom would lie about one thing, to keep the peace and to protect the kids from","messageBody":"<div id=\"ygrps-yiv-1616055711\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Jul 28, 2012, at 11:37 PM, lindaguitar wrote:<br/>\n&gt; <br/>\n&gt; ...<br/>\n&gt; &gt; The kids and I ended up having to lie to him at times, about what<br/>\n&gt; &gt; we had done during the day. ...<br/>\n<br/>\n&gt; ... now, when your kids are in a pickle in a job or a relationship,<br/>\n&gt; the tool they&#39;ll be familiar with -- which comes with a Mom stamp<br/>\n&gt; of approval -- is lying.<br/>\n<br/>\n </span></blockquote>I can see why you might think that, but it isn&#39;t so. Seeing that their mom would lie about one thing, to keep the peace and to protect the kids from emotional abuse, did not teach my kids to lie all the time, or as a general rule, in jobs or relationships.<br/>\n<br/>\nI think that sometimes (not as an overall basis for a relationship), peace in the household takes precedence over truthfulness. I think that protecting children from abuse (even non-physical abuse) trumps truthfulness in even more situations. But it really depends on the circumstances. And I do understand that a lot of people would disagree, and I recognize that we do not all agree about what constitutes abuse.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I believe very strongly that civil rights and basic human rights,<br/>\n&gt; &gt; including the rights to liberty and the pursuit of happiness,<br/>\n&gt; &gt; apply to children just as much as to adults.<br/>\n<br/>\n&gt; It&#39;s good to work towards what you want the world to be, but also<br/>\n&gt; good to keep reality firmly in sight. <br/>\n&gt; Children don&#39;t have a legal right to pursue happiness.<br/>\n<br/>\n </span></blockquote>Not so long ago, people with dark skin also didn&#39;t have the legal rights to liberty or to pursue happiness (or even to life, for that matter), in many states. As you said, it&#39;s good to work towards what we want the world to be. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But your children have two parents. And your husband has half<br/>\n&gt; interest. Apparently you don&#39;t believe he has equal rights to the<br/>\n&gt; kids.<br/>\n<br/>\n </span></blockquote>What I believe is that neither parent has the right to *abuse* or harm children, or to send them to a place where they will be abused or harmed. <br/>\n<br/>\nI know that parents and teachers and cops have a lot of legal rights to abuse and harm children in this country - but that doesn&#39;t make it &quot;right&quot; or OK. In Saudi Arabia, a husband has the legal right to kill his wife or daughter, for any reason. He also has the legal right to lock her in a room and never let her out. What would you say in a situation where one of the other wives in a multi-wife household smuggles an imprisoned co-wife or daughter out of the house and out of the country, to save her from being locked in a room for the rest of her life? Or maybe just for a period of a few years. Would you ask, &quot;but what about the husband&#39;s rights to his wife or daughter?&quot; The Saudi courts would uphold the right of the husband/father.<br/>\n<br/>\nObviously the degree to which imprisonment in school OR forced schoolwork at home is &quot;abusive&quot; varies from school to school and person to person. And the effects on a child of a parent yelling and ranting and swearing will vary too. But what I think we all agree on is that children are more vulnerable than adults, and they need to be protected from abusive adults. <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343568695","msgId":48799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2M2R2bis1bGhtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2MmI1YytnOGxqQGVHcm91cHMuY29tPg=="},"prevInTopic":48798,"nextInTopic":48800,"prevInTime":48798,"nextInTime":48800,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... *************** Conventional parenting pits parents against kids. Unfortunately when moms choose to unschool and dads aren t convinced, that can turn to","messageBody":"<div id=\"ygrps-yiv-1508137467\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Everyone has to figure out for herself what to put up with in a troubled marriage. I am the type of person who would put my kids&#39; needs and rights before holding a marriage together for its own sake<br/>\n </span></blockquote>***************<br/>\n<br/>\nConventional parenting pits parents against kids. Unfortunately when moms choose to unschool and dads aren&#39;t convinced, that can turn to another kind of antagonism - mom and kids versus the dad. That&#39;s not good for anyone in the family.<br/>\n<br/>\nThe kids needs and rights generally include both parents - this particular case is muddier because one parent is a step, but since we don&#39;t have the background, it could be a stepparent who&#39;s been part of this kid&#39;s life from infancy - father in all but biology. There&#39;s no easy line between &quot;kid&#39;s needs&quot; and &quot;dad&#39;s needs&quot; when one of the things a child needs is a loving relationship with parents. <br/>\n<br/>\nA dad freaking out about education is being a loving parent! He&#39;s doing what he&#39;s Supposed to do, according to everyone around him. From his perspective, his wife is the crazy one, joining some oddball anti-educational cult and using it to wreck their marriage and ruin a perfectly good kid. It&#39;s a crisis and it&#39;s his job to fix things and get the family back on track. There&#39;s a huge amount of pressure on dads to be providers and protectors, especially if the other parent is a homemaker - every bit as much pressure to be the perfect dad as there is on moms to be the perfect mom.<br/>\n<br/>\nMaybe his life feels out of control in other ways - it certainly does sound like things have been on the fritz for awhile. But consciously or not, mom could very well be creating a &quot;us versus him&quot; environment where she and her son are the &quot;good guys&quot; faced off against the evil stepdad. Those kinds of situations develop even without the &quot;step&quot; element when all the peace and freedom of unschooling seems purchased with the bondage of the husband, slaving away so they can be happy. <br/>\n<br/>\nIt&#39;s really important to extend the benefits of unschooling to the provider in the family - the same care and support, the same assumption of positive intent. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  them being free from school and me being single.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIt&#39;s not always that cut and dried, not by a long shot. Parenting across a divorce is complex - it&#39;s nowhere near as simple as &quot;being single&quot; unless the other parent agrees to stay away completely, and that&#39;s rare. You&#39;re bound to that other person for life by virtue of your children. <br/>\n<br/>\nThere are times when divorce is a better option - when divorce with the kids in school is a better option than ongoing conflict in the kids&#39; lives in and between their two homes. When Ray was first living with his bio mom and in school, school was an enemy we could all agree upon. It made things easier. Eventually school was worse and we could all agree to pull him out. <br/>\n<br/>\nThe hardest thing about parenting across a divorce is learning to be a team with &quot;the other parent&quot;. That sounds bonkers when divorce is looking like a good option, when you can list all the ills of the Other faster than you can make a shopping list. I&#39;ve been there. It helps to focus on your kid&#39;s relationship with that other person, of seeing that as something important to your child. That&#39;s a solid, unschooling principle: valuing those things which are important to your child. It&#39;s something that makes life better for everyone involved. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":235012193,"authorName":"mayajourney@yahoo.com","from":"mayajourney@...","profile":"mayajourney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343567167","msgId":48800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNkQ5QzRCLUVEMkYtNDIzQy1CMzJCLTMwOUZGQzc4QUZCNkB5YWhvby5jb20+"},"prevInTopic":48799,"nextInTopic":48802,"prevInTime":48799,"nextInTime":48801,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"I was in the same situation last year. It is very difficult to follow the path of unschooling, yet alone radical. Not many understand this way of educating our","messageBody":"<div id=\"ygrps-yiv-52916599\">I was in the same situation last year. It is very difficult to follow the path of unschooling, yet alone radical. Not many understand this way of educating our kids. They are programmed that literacy means you learn only one way. <br/>\n<br/>\nI&#39;ve had a lot of people, mostly all extended family and in-laws pushing me to put the kids in school. So I tried after being so tired of fighting. I think I didn&#39;t trust my intuition. Needless to say my kids barely made it through 2 weeks of school. Behavior problems and emotional issues abounded after the first day. I was told they are manipulating me (by the school). My son and daughter began getting stress headaches. The only thing they were learning was a militant and pressured approach to learning. <br/>\n<br/>\nThis is where I stood my ground and am just not speaking as much about their education to people who don&#39;t agree or understand. This is where I practice not caring about others beliefs system. <br/>\n<br/>\nAbraham Hicks states, &quot;A belief is a thought you keep thinking!&quot; Once you change your thoughts, your reality and beliefs change. Sometimes it takes a while but things do shift. <br/>\n<br/>\nRegardless of marital issue, it will help of you can focus on what it is you want to create. Then start creating it! Life is a blank canvas that we can change at anytime. I love that we can paint over and create something new. It isn&#39;t always easy to see the full picture, yet the beauty arises in the process. <br/>\n<br/>\nSince your husband is not your son&#39;s father, he really has no say in how you educate your son. What you do need is support!  Without it, the fighting is exhausting. Maybe you can include your son in the family discussion of how he learns and have him teach your husband about his process. Instead of defending your son, help give him a voice. I&#39;m sure some compromise can be made and everyone can be happy!<br/>\n<br/>\nAs far as unstable relationships and marriage. This is where people learn their biggest growth about true relationship.  It is hard, it takes compromise, and you never agree on everything. Sometimes you go in different directions and don&#39;t carry true same spark as you originally did. I suggest you evaluate whether you want to continue in your marriage and make it work. If this is your intention it will work (with a lot of challenges)! <br/>\n<br/>\nGood luck and know things will change! They have for me! My husband is a ps teacher and winning him over to this side wasn&#39;t easy. He finally sees how technology stimulates incredible amounts of learning. <br/>\n<br/>\nWhat helped me was listening to The Vortex by Abraham hicks as much as I could. It really helped shift myself, thus everything else has shifted too!<br/>\n<br/>\nMany blessings,<br/>\nMaya<br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343564454","msgId":48798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFMUJBMjAzLTA5NDItNDlCNC05MDU2LTk4ODc1MjVDMDYzQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp2MmI1YytnOGxqQGVHcm91cHMuY29tPg==","referencesHeader":"PGp2MmI1YytnOGxqQGVHcm91cHMuY29tPg=="},"prevInTopic":48797,"nextInTopic":48799,"prevInTime":48797,"nextInTime":48799,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... There are other and better relationship-building choices when husbands disagree with unschooling besides those two. Choosing sides means making an","messageBody":"<div id=\"ygrps-yiv-1185896951\">On Jul 28, 2012, at 11:37 PM, lindaguitar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am the type of person who would put my kids&#39; needs and rights<br/>\n&gt; before holding a marriage together for its own sake.<br/>\n<br/>\n </span></blockquote>There are other and better relationship-building choices when husbands disagree with unschooling besides those two.<br/>\n<br/>\nChoosing sides means making an adversary of the other side. Adversaries don&#39;t make good partners. Being adversaries isn&#39;t a way to build stronger relationships.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The kids and I ended up having to lie to him at times, about what we had done during the day.<br/>\n<br/>\n<br/>\n </span></blockquote>Be honest about your lying. You *chose* to lie.<br/>\n<br/>\nYou had the opportunity to show your kids how to handle a situation when two peoples&#39; needs clash. You showed them the best way to handle that is to lie. Most relationship tools *are* complex to use. They take a lot of seeing in action and practice. But, now, when your kids are in a pickle in a job or a relationship, the tool they&#39;ll be familiar with -- which comes with a Mom stamp of approval -- is lying.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe very strongly that civil rights and basic human rights, including <br/>\n&gt; the rights to liberty and the pursuit of happiness, apply to children just as much as to adults.<br/>\n<br/>\n </span></blockquote>It&#39;s good to work towards what you want the world to be, but also good to keep reality firmly in sight. <br/>\n<br/>\nChildren don&#39;t have a legal right to pursue happiness. Parents, though, have power and can share it with the kids. Parents can create a life where their pursuit of happiness is supported. It will be, as far as the kids will feel, indistinguishable.<br/>\n<br/>\nBut your children have two parents. And your husband has half interest. Apparently you don&#39;t believe he has equal rights to the kids.<br/>\n<br/>\nIt seems when faced with two conflicting points of view you have a hard time digging beneath the surface to find the core issues to seek solutions so both people can coexist in peace. Your&#39;e seeing those points of view as rocks, not as made up of underlying needs, wants, desires and goals.<br/>\n<br/>\nIf you were treating your children as you treat your husband, do you think you would get support for that here? Why do you think it wouldn&#39;t be pulled apart and analyzed when done to a husband here?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I thought that sending my kids to school would make my husband happy but the kids miserable<br/>\n<br/>\n </span></blockquote>Did you stop with only two choices? <br/>\n<br/>\nSandra has a page on School Choice:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\nThere&#39;s the book Guerrilla Learning by Grace Llewellyn.<br/>\n<br/>\nWhat about other kinds of schools? What about a curriculum that could have eased the transition to unschooling? There were probably a dozen easily imagined options besides those 2.<br/>\n<br/>\nWould it have made the marriage better if he had ignored your wishes and enrolled the kids in school and made sure they went every day?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; then try to convince my husband to go to marriage counseling with me about this issue.<br/>\n<br/>\n<br/>\n </span></blockquote>In other words, finding a like-minded teammate to be on your team against him.<br/>\n<br/>\nWould it have sounded like a good idea if he found a marriage counselor who was a strong advocate for school and then tried to convince you to go with him?<br/>\n<br/>\nHave you read Sandra&#39;s page on Divorce:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<br/>\nThat page and its links is not a lengthy way of saying &quot;Don&#39;t ever.&quot; There are lots of links that can help grow stronger relationships.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  or them being free from school and me being single<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s pie in the sky thinking.<br/>\n<br/>\nOnce someone divorces, they loose a huge amount of power to control the situation. The choice to unschool will no longer be yours. It will be the court&#39;s decision which parent wins that conflict. And courts generally back the more conservative side. Unless the *court* sees one of you as unfit, it&#39;s very likely they&#39;ll side with whoever wants what&#39;s most mainstream. (Considering the whack job some parents are, I think that *is* best for the current system. Courts shouldn&#39;t be put in the position of figuring out if some off-the-wall parenting theory is sound, and then figuring out if a parent is capable of making it work.)<br/>\n<br/>\nWhile there are amicable divorces, they don&#39;t come out of marriages where spouses problem solved by locking horns and winning by being the strongest. Divorce will only make the conflicts worse.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343533036","msgId":48797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2MmI1YytnOGxqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg=="},"prevInTopic":48795,"nextInTopic":48798,"prevInTime":48796,"nextInTime":48798,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"My husband was not interested in or accepting of unschooling for the first several years that we did it. We had some terrible fights about the idea of","messageBody":"<div id=\"ygrps-yiv-538529864\">My husband was not interested in or accepting of unschooling for the first several years that we did it. We had some terrible fights about the idea of homeschooling before I pulled the kids out of school in the first place. The kids and I ended up having to lie to him at times, about what we had done during the day. But at least he wasn&#39;t trying to quiz the kids on school-ish factoids. And he did, eventually, start accepting the idea of unschooling.<br/>\n<br/>\nEveryone has to figure out for herself what to put up with in a troubled marriage. I am the type of person who would put my kids&#39; needs and rights before holding a marriage together for its own sake.<br/>\n<br/>\nI believe very strongly that civil rights and basic human rights, including the rights to liberty and the pursuit of happiness, apply to children just as much as to adults.<br/>\n<br/>\nIf I thought that sending my kids to school would make my husband happy but the kids miserable (which was the case during the year before we started homeschooling - but, in fact, my husband was NOT happy anyway, because of all the homework-related stress), I would not be able to (and wasn&#39;t able to) tolerate being forced to do something that made my kids miserable for very long. In our case, I finally got to the point where I just said, &quot;I can NOT tolerate that infernal place anymore, and I will NOT force our kids to go there again! My husband said, &quot;Fine! Do what you want!&quot; And I did.    <br/>\n<br/>\nI think that if I were married to a man who was not my children&#39;s father, and he tried to force us to stop unschooling, I would first look for a marriage counselor who is supportive of out-of-the-box lifestyles and alternative education models ( a daunting challenge in itself - finding an open-minded marriage counselor like that), then try to convince my husband to go to marriage counseling with me about this issue.<br/>\n<br/>\nIf counseling didn&#39;t help, I might consider divorce. It would depend on the circumstances - i.e., whether the kids and my lives would be overall better off with them in school (or doing some kind of school-at-home homeschooling) and the marriage lasting, or them being free from school and me being single. Financial considerations would be part of it, in my case. How the kids would feel about the situation would be another consideration. And, of course, all the other aspects of the relationship with my husband. <br/>\n<br/>\nWhat does your son think? Would he rather you stay with your husband and would he be willing to do more formal homeschooling or go to a traditional school to please his stepfather? Do they get along at all?<br/>\n<br/>\nWhat would your husband choose if you said that you could not stay with him if he didn&#39;t back off about the unschooling issue?<br/>\n<br/>\nLinda  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ann&quot; &lt;auntannies2002@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; This may not be appropriate for this board, but I don&#39;t know where else to go.  No one else is going to understand the unschooling component of this issue.<br/>\n&gt; <br/>\n&gt; I have been radically unschooling my 11 yo son for 3 years.  From the beginning we were eclectic, then merged into basic unschooling, then radical unschooling.  It works for my son.  He learns things so quickly with unschooling.  Life is so much more peaceful for us.  He helps around the house sometimes without even being asked (everything was forced before the radical unschooling).  Until my husband comes home.  My husband is against unschooling, at least when it comes to math and copious gaming (my son is a gamer--mindcraft, halo, world of warcraft, etc).  After 3 years and many many conversations about all that my son is learning--I journal the things he learns during the day) and how unschooling works, he just isn&#39;t coming around.  He&#39;ll go for a few weeks and be ok, then he blows up about it. Even when I show him the journal of everything my son is learning, he thinks he&#39;s not learning the &quot;right&quot; things.  He wants to see math facts and worksheet, he wants my son to be able to spew out historical dates, he wants to be able to come home and quiz the boy like he&#39;s a robot. The thought of forcing my son to start learning certain things in certain ways breaks my heart.  I know it won&#39;t work.  I know what it will do to his learning process-he will start shutting down and/or rebelling.  I&#39;m sure of it.  What would you do?  Would you stop unschooling if your husband one day tried to put an end it?  A couple of additional notes--my husband and I have a rocky marriage; always have, he does not like most of how I live my life (I live a very organic life).  Also, my husband is my son&#39;s stepfather, but my son&#39;s biological father is not involved.<br/>\n&gt; <br/>\n&gt; Ann<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343502198","msgId":48795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2N0JGNzM3LUIyQzktNDA1Ni1BNUQ0LTFEQkEzNjU3QjU3Q0BhdHQubmV0Pg==","inReplyToHeader":"PEY5MzgwN0E0LUI0QzctNDFBOC1CMkI1LUI3RERCNTE4MUI5OEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPiA8RjkzODA3QTQtQjRDNy00MUE4LUIyQjUtQjdEREI1MTgxQjk4QHZlcml6b24ubmV0Pg=="},"prevInTopic":48794,"nextInTopic":48797,"prevInTime":48794,"nextInTime":48796,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"Except in this case, the husband is the step-father.  I don t believe he has any parental rights here if the relationship were dissolved (but I m not a","messageBody":"<div id=\"ygrps-yiv-52338525\">Except in this case, the husband is the step-father.  I don&#39;t believe he has any parental rights here if the relationship were dissolved (but I&#39;m not a family/divorce attorney).  In this case a hostile ex may be nothing more than a hostile ex....not a hostile co-parent.  <br/>\n<br/>\nThat said, I agree that this is a marriage issue, not an unschooling one.  Is the OP willing to compromise her values and the quality of her child&#39;s life to save the marriage? (assuming the above, as this is not the child&#39;s father)  I&#39;m not even saying that&#39;s the case, but I think it&#39;s good to know where one&#39;s personal boundaries lie.  It&#39;s highly likely this isn&#39;t about unschooling at all.  My hunch is that it&#39;s more about the husband feeling in control of some part of his life- when he feels out of control elsewhere, he turns to things he thinks he can control.  Kids are easy picking, from a cultural standpoint.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.euphorialifedesignstudio.com\">http://www.euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The End of Unschooling?","postDate":"1343501076","msgId":48794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2MWJ1ayttcDM0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg=="},"prevInTopic":48792,"nextInTopic":48795,"prevInTime":48793,"nextInTime":48795,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... *************** It seems like the sort of situation where school might be a good compromise. Your son Still won t be able to answer whatever questions you","messageBody":"<div id=\"ygrps-yiv-1683140220\">&quot;Ann&quot; &lt;auntannies2002@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; He wants to see math facts and worksheet, he wants my son to be able to spew out historical dates, he wants to be able to come home and quiz the boy like he&#39;s a robot. The thought of forcing my son to start learning certain things in certain ways breaks my heart. <br/>\n </span></blockquote>***************<br/>\n<br/>\nIt seems like the sort of situation where school might be a good compromise. Your son Still won&#39;t be able to answer whatever questions you husband asks - chances are he&#39;ll default to school kid answers like &quot;I dunno&quot; - but the fact that he&#39;s in school might stop the quizzing entirely. It&#39;s something to talk about with your son, anyway - would it be better to be in school and have a better relationship with his stepdad? Or better to put up with stepdad for the sake of being home, and maybe making a different compromise, like some kind of online curriculum. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343493041","msgId":48791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5MzgwN0E0LUI0QzctNDFBOC1CMkI1LUI3RERCNTE4MUI5OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg==","referencesHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg=="},"prevInTopic":48790,"nextInTopic":48792,"prevInTime":48790,"nextInTime":48792,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"... It could be he s blowing up about other things in your marriage. Stress causes irritation. Another added irritation can tip someone over the edge when","messageBody":"<div id=\"ygrps-yiv-222894627\">On Jul 28, 2012, at 10:36 AM, Ann wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;ll go for a few weeks and be ok, then he blows up about it<br/>\n<br/>\n </span></blockquote>It could be he&#39;s blowing up about other things in your marriage. Stress causes irritation. Another added irritation can tip someone over the edge when normally they&#39;d be okay.<br/>\n<br/>\nAlso people -- men especially -- tend to let things build up until they can&#39;t take it any longer then they blow up. So his &quot;okay&quot; may not really be okay. It may be a reset and everything starts building once again. What he reveals when he blows up may be a hugely magnified view of what&#39;s really bothering him.<br/>\n<br/>\nIt sounds like you&#39;re not answering *his* concerns. What he&#39;s suggesting you do -- the worksheets and so on -- is his solution to his concerns, not necessarily the concerns themselves, if you see what I mean. Maybe one worksheet a week would make him feel okay but since he&#39;s had no worksheets for as long as you&#39;ve been doing this, the worksheets have become a much desired commodity. It&#39;s like going from no TV to unlimited TV. Kids will often glut because TV was so wanted and so rare and precious.<br/>\n<br/>\nHe wants something concrete. And his worry (or irritation) builds up so much to the point where he asks for way more than what might satisfy him normally.<br/>\n<br/>\nIf your child kept asking for ice cream and each time you told him why other things were better, wouldn&#39;t you expect him to eventually go ballistic?<br/>\n<br/>\nYou don&#39;t need to glut him on worksheets. (Nor your son! ;-) But focus on his comfort being your priority. Make small steps. Then more small steps. When he&#39;s comfortable that his comfort is your priority, then he won&#39;t be so needy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my husband and I have a rocky marriage<br/>\n<br/>\n<br/>\n </span></blockquote>Read this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<br/>\nRead the links. Read the discussions of Retrouville.<br/>\n<br/>\nAn unhappy husband is much easier to work with than a hostile ex-spouse. Once you&#39;re divorced his preferences are no longer just preferences but may come with enforcement by law behind them. And ex-spouses can ask for hoops to be jumped through just because they&#39;re hurt.<br/>\n<br/>\nDon&#39;t look at how you can fix your husband. Look at how you can fix yourself so you can make the choices that help you, your husband and your son live more peaceful lives.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235156828,"authorName":"Claire Mesa","from":"Claire Mesa &lt;roselady4@...&gt;","profile":"cmesa4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The End of Unschooling?","postDate":"1343492653","msgId":48792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS2hkYndKXzkrRjhFQis2dXZuM2VqZGotSHhGWisxcE8zLWMwX2Vfd1c9ZURXaDdQZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg==","referencesHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg=="},"prevInTopic":48791,"nextInTopic":48794,"prevInTime":48791,"nextInTime":48793,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"I m new to this group and I m not an unschooling expert. This seems more like a marital problem. I have been married for 30 years and have 4 children. I would","messageBody":"<div id=\"ygrps-yiv-895494634\">I&#39;m new to this group and I&#39;m not an unschooling expert. This seems more<br/>\nlike a marital problem.<br/>\nI have been married for 30 years and have 4 children.<br/>\nI would say handle your rocky marriage. In my experience, when love and<br/>\ngood communication exist between a husband and wife, arguments over raising<br/>\nthe children vanish or they are usually easily resolved.<br/>\nI&#39;m just saying maybe you should start by making the relationship better<br/>\nany way you can and invite your husband to do the same, do some things you<br/>\nlike together to start or something. In other words make the prospect of<br/>\nimproving the marriage pleasant not an argument.<br/>\nI&#39;m not really trying to give a bunch of advice about your marriage. I<br/>\ndon&#39;t know you, just really trying to mention you should probably work on<br/>\nit, if dont want to have disagreements about your child.<br/>\n<br/>\nClaire<br/>\n<blockquote><span title=\"qreply\"> On Jul 28, 2012 11:27 AM, &quot;Ann&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:auntannies2002@...\">auntannies2002@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This may not be appropriate for this board, but I don&#39;t know where else to<br/>\n&gt; go. No one else is going to understand the unschooling component of this<br/>\n&gt; issue.<br/>\n&gt;<br/>\n&gt; I have been radically unschooling my 11 yo son for 3 years. From the<br/>\n&gt; beginning we were eclectic, then merged into basic unschooling, then<br/>\n&gt; radical unschooling. It works for my son. He learns things so quickly with<br/>\n&gt; unschooling. Life is so much more peaceful for us. He helps around the<br/>\n&gt; house sometimes without even being asked (everything was forced before the<br/>\n&gt; radical unschooling). Until my husband comes home. My husband is against<br/>\n&gt; unschooling, at least when it comes to math and copious gaming (my son is a<br/>\n&gt; gamer--mindcraft, halo, world of warcraft, etc). After 3 years and many<br/>\n&gt; many conversations about all that my son is learning--I journal the things<br/>\n&gt; he learns during the day) and how unschooling works, he just isn&#39;t coming<br/>\n&gt; around. He&#39;ll go for a few weeks and be ok, then he blows up about it. Even<br/>\n&gt; when I show him the journal of everything my son is learning, he thinks<br/>\n&gt; he&#39;s not learning the &quot;right&quot; things. He wants to see math facts and<br/>\n&gt; worksheet, he wants my son to be able to spew out historical dates, he<br/>\n&gt; wants to be able to come home and quiz the boy like he&#39;s a robot. The<br/>\n&gt; thought of forcing my son to start learning certain things in certain ways<br/>\n&gt; breaks my heart. I know it won&#39;t work. I know what it will do to his<br/>\n&gt; learning process-he will start shutting down and/or rebelling. I&#39;m sure of<br/>\n&gt; it. What would you do? Would you stop unschooling if your husband one day<br/>\n&gt; tried to put an end it? A couple of additional notes--my husband and I have<br/>\n&gt; a rocky marriage; always have, he does not like most of how I live my life<br/>\n&gt; (I live a very organic life). Also, my husband is my son&#39;s stepfather, but<br/>\n&gt; my son&#39;s biological father is not involved.<br/>\n&gt;<br/>\n&gt; Ann<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":334892198,"authorName":"Ann","from":"&quot;Ann&quot; &lt;auntannies2002@...&gt;","profile":"auntannies2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"The End of Unschooling?","postDate":"1343486190","msgId":48790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2MHRkZSthY2llQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48791,"prevInTime":48789,"nextInTime":48791,"topicId":48790,"numMessagesInTopic":0,"msgSnippet":"This may not be appropriate for this board, but I don t know where else to go.  No one else is going to understand the unschooling component of this issue. I","messageBody":"<div id=\"ygrps-yiv-969903987\">This may not be appropriate for this board, but I don&#39;t know where else to go.  No one else is going to understand the unschooling component of this issue.<br/>\n<br/>\nI have been radically unschooling my 11 yo son for 3 years.  From the beginning we were eclectic, then merged into basic unschooling, then radical unschooling.  It works for my son.  He learns things so quickly with unschooling.  Life is so much more peaceful for us.  He helps around the house sometimes without even being asked (everything was forced before the radical unschooling).  Until my husband comes home.  My husband is against unschooling, at least when it comes to math and copious gaming (my son is a gamer--mindcraft, halo, world of warcraft, etc).  After 3 years and many many conversations about all that my son is learning--I journal the things he learns during the day) and how unschooling works, he just isn&#39;t coming around.  He&#39;ll go for a few weeks and be ok, then he blows up about it. Even when I show him the journal of everything my son is learning, he thinks he&#39;s not learning the &quot;right&quot; things.  He wants to see math facts and worksheet, he wants my son to be able to spew out historical dates, he wants to be able to come home and quiz the boy like he&#39;s a robot. The thought of forcing my son to start learning certain things in certain ways breaks my heart.  I know it won&#39;t work.  I know what it will do to his learning process-he will start shutting down and/or rebelling.  I&#39;m sure of it.  What would you do?  Would you stop unschooling if your husband one day tried to put an end it?  A couple of additional notes--my husband and I have a rocky marriage; always have, he does not like most of how I live my life (I live a very organic life).  Also, my husband is my son&#39;s stepfather, but my son&#39;s biological father is not involved.<br/>\n<br/>\nAnn</div>","specialLinks":[]}],"prevTopicId":48639,"nextTopicId":48780}}