{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"need ideas/insight","postDate":"1153324130","msgId":15866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5bGs5MituNHViQGVHcm91cHMuY29tPg=="},"prevInTopic":15851,"nextInTopic":0,"prevInTime":15865,"nextInTime":15867,"topicId":15847,"numMessagesInTopic":0,"msgSnippet":"Eventually, I got so tired, I couldnt stay up even the two nights a week & am  tired all the time, all week, all day Um...how about saying I m tired now,","messageBody":"<div id=\"ygrps-yiv-625493478\">&quot;Eventually, I got so tired, I couldnt stay up even the two nights a<br/>\nweek & am  tired all the time, all week, all day&quot;<br/>\n<br/>\nUm...how about saying &quot;I&#39;m tired now, I&#39;m going to bed&quot;?<br/>\n<br/>\nI have NO problem letting someone know how *I* feel and what MY needs<br/>\nare also. My children&#39;s needs are important, but so are my own!! Yeah,<br/>\nwe often put our own needs off to help our children, but as they get<br/>\nolder, they can understand what &quot;I&#39;m REALLY tired&quot; means.<br/>\n<br/>\nI don&#39;t think it&#39;s beneficial to hurt yourself just to stay up<br/>\nwatching movies. You can explain to him that he can stay up if he<br/>\nchooses, but YOU choose to sleep now. I&#39;d let him know you&#39;re happy to<br/>\nwatch the movies with him when you&#39;re rested.<br/>\n<br/>\nIt&#39;s obvious you&#39;re trying to give him that time whenever you can. I&#39;m<br/>\nsure he can understand when you truly can&#39;t anymore because your body<br/>\nneeds something.<br/>\n<br/>\nThat&#39;s a personal boundaries thing again. I don&#39;t think it&#39;s<br/>\nparticularly helpful for a child to see a parent doing things for<br/>\nsomeone else to the point that they aren&#39;t feeling well!! If you need<br/>\nsleep, you need sleep.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need ideas/insight","postDate":"1153257437","msgId":15851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5amo0dCthbmU1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNzE4MTg1NzQ3LjcwMTY5LnFtYWlsQHdlYjMzMTEwLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":15847,"nextInTopic":15866,"prevInTime":15850,"nextInTime":15852,"topicId":15847,"numMessagesInTopic":0,"msgSnippet":"Hmmm my first instinct is that he s wanting time alone with you. Though you re there all day too, you re also doing other stuff during the day, whether","messageBody":"<div id=\"ygrps-yiv-1723298583\">Hmmm my first &quot;instinct&quot; is that he&#39;s wanting time alone with you. <br/>\nThough you&#39;re there all day too, you&#39;re also doing &quot;other stuff&quot; <br/>\nduring the day, whether it&#39;s going places he likes, keeping some <br/>\nsemblance of sanitary in the house (lol - I just took a broom to the <br/>\nliving room floor the other day when I got tired of watching fluffs <br/>\nof dog hair swirl away every time I walked), whatever. At night, <br/>\nthere&#39;s no phone calls, no Internet/email, no postman ringing (once <br/>\nI hope, twice seems to cause problems to borrow from a movie LOL), <br/>\nno errands to do, no meals to prepare, etc. Just you and him. <br/>\nBecause it really seems from your description that it&#39;s not so much <br/>\nthe movies (since he&#39;s also wanting food, wanting toys, etc) as it <br/>\nis having YOU there providing focused attention. I remember a bit <br/>\nago when DS (now 8) was consistently requesting food-that-required-<br/>\nassistance right as I was getting into bed/falling asleep. Since I&#39;m <br/>\nthe one who gets up for work, it finally got to where I just <br/>\nsaid &quot;Daddy can get it for you&quot;. That *wouldn&#39;t* work - he only <br/>\nwanted &lt;whatever&gt; the way *I* made it. Ding! Then, once I was <br/>\ndownstairs having prepared whatever, he wanted &quot;someone&quot; to stay <br/>\nwith him while he ate (and usually he watched TV or a video at the <br/>\nsame time). DING!(duh!) He wanted ME. Yes, he was probably hungry <br/>\ntoo at that point, knowing him, but he also wanted the interaction. <br/>\nHe was &quot;hungry&quot; for more mommy time. Now I make sure to focus on him <br/>\nfirst thing when I get home from work, we have a once a week mom & <br/>\nson night out (also gives DH some quiet since he&#39;s home with DS all <br/>\nday and he needs down time), and sometimes I will stay nearby while <br/>\nhe eats or he will pick something that he can carry upstairs (we&#39;ve <br/>\nworked out what and where and all regarding food in our bedroom) so <br/>\nI can fall asleep while he eats. I&#39;m one of those fortunate ones who <br/>\ncan fall asleep in just about any circumstance - TV, music, lights, <br/>\nwhatever, as need be (I think it comes from sharing a bedroom with a <br/>\n5 yrs younger sister who (a) needed the light on when she was young <br/>\n(b) woke up and watched cartoons way way earlier than I would have <br/>\nliked) so if DH and/or DS want to stay up and watch TV while I&#39;m <br/>\nfalling asleep, that&#39;s fine. <br/>\n<br/>\nIt almost sounds like maybe he&#39;s nervous somehow about falling <br/>\nasleep too. Maybe a casual discussion (mom & son time) about <br/>\nsleeping in general - why we sleep, what happens when we sleep, etc. <br/>\nand see what pops out. He might have had a bad dream or something <br/>\nthat makes it hard for him to want to go to sleep - he thinks it&#39;ll <br/>\nhappen again. Could even be something like toileting - it&#39;s not <br/>\nuncommon for boys especially to not be totally dry at night for well <br/>\npast 6 yrs old - and if he&#39;s gotten your common sleeping space damp <br/>\non occasion he may be concerned about doing that again (especially <br/>\nif he got grumping or complaining from DH or you about it - doesn&#39;t <br/>\nsound like something you&#39;d do, though, from the gentle tone of your <br/>\npost).<br/>\n<br/>\nAnd too he might just be a night owl personality. Which is a problem <br/>\nwhen he&#39;s got early bird parents (or is your DH a night owl <br/>\npersonality who has conformed his sleep to a daytime job?)<br/>\n<br/>\nI&#39;d suggest taking time with your DH when you can get it - <br/>\nseriously. If your DS conks out at 3 am WAKE your DH up and have <br/>\nsome nookie time. Look for other &#39;creative&#39; ways to get that time - <br/>\njoin him in the shower in the morning after DS has fallen asleep and <br/>\nbefore you join DS in bed and DH heads to work. Whatever. <br/>\n<br/>\nAll of this is just scattershot ideas to see if anything <br/>\ngoers &quot;Ping! That might be worth a try!&quot;<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":204429098,"authorName":"neha","from":"neha &lt;nishaysmom@...&gt;","profile":"nishaysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"need ideas/insight","postDate":"1153249067","msgId":15847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzE4MTg1NzQ3LjcwMTY5LnFtYWlsQHdlYjMzMTEwLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":15851,"prevInTime":15846,"nextInTime":15848,"topicId":15847,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, My name is Neha - I ve been on this list for quite sometime, but haven t posted much. I read a lot of everyone s back & forth, and some posts have","messageBody":"<div id=\"ygrps-yiv-598250007\">Hi Everyone,<br/>\n   <br/>\n  My name is Neha - I&#39;ve been on this list for quite sometime, but haven&#39;t posted much. I read a lot of everyone&#39;s back & forth, and some posts have been immensely helpful. Thanks!<br/>\n   <br/>\n  Briefly, I have a soon to be 6yo son, that I have been unschooling pretty much the whole time. We have a great time & a wonderful relationship - but there is one thing that I have been trying very hard to figure out that would work for both of us & am running out of ideas. I thought maybe there is something I am just not seeing - that someone on the &#39;outside&#39; may be able to see - so, here I am, presenting my dilema to all of you... thoughts, ideas, insight needed....<br/>\n   <br/>\n  Nishay (my son) LOVES movies. & he loves watching them at night - ALL night, til the sun comes out in the morning - literally (or he conks out, whichever comes first)... Now here is where my problem comes in.... he wants me (or his dad, but that is impossible since he has to go to work), to stay up with him for these movie marathons. For a while, I tried adjusting my daily cycle to accomodate him - but, it&#39;s been over a year now that I have been trying, & am still not &#39;adjusted&#39;. He is really unhappy to have to do these movie nights alone - & i don&#39;t like it either - I want to be with him if he wants me to be there - but I am having a tough time. I am running low on energy, I can&#39;t get things done during the day, I get very little time with my husband... etc etc.<br/>\n   <br/>\n  The things we have tried so far....<br/>\n   <br/>\n  1) He watches the movies & I just sleep there with him. In theory - great - except he is constantly waking me up to ask me questions, get him food (apart from the stash that we got before we start the night), and, it is mighty uncomfortable sleeping on the couch every night. He insists on doing the movies in the TV room, as he wants the bigger TV and all his toys are there - which he is playing with the whole time the movies are running.<br/>\n   <br/>\n  2) Watch the movies in our bed on the computer (we co-sleep), with headsets on so it wont disturb me & his dad. Some of the same problems - questions all the time, asking for more food that we didnt think of before we got to bed... etc, plus other problems like - the headsets aren&#39;t comfortable (we&#39;ve tried 3 different sets so far), can&#39;t watch movies on video, can&#39;t play with his toys.... (the only upside is the bed is more comfortable). <br/>\n   <br/>\n  3) We put a little TV & video in the next room, I equipped it with all his favorite night time foods and toys.... still - the same problems of questions & more food, ....<br/>\n   <br/>\n  4) We (nishay, me & his dad) worked out a weekly schedule - 2 nights a week, I would stay up with him, two nights a week he&#39;d come sleep with us and the rest of the nights were upto him - if he wanted to do movie nights, he needed to do them on his own - in his room or in our bed or in the TV room - but without disturbing me at all. (lasted a week -- always one last question....)<br/>\n   <br/>\n  Eventually, I got so tired, I couldnt stay up even the two nights a week & am tired all the time, all week, all day. Nishay asks me why I am always tired!! I told him, we talked, I explained, he says he understands... but, at night - he still wants me to do the movie nights with him....<br/>\n   <br/>\n  what am i missing? what else can i do? i understand he enjoys these nights & i really wish i could participate in them & enjoy them & well, still be able to function ..... but I can&#39;t. i&#39;ve tried.<br/>\n   <br/>\n  Thanks in advance for all the anticipated insight/advice.<br/>\n  neha<br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n<br/>\n \t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Everyone is raving about the  all-new Yahoo! Mail Beta.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15858,"nextTopicId":15804}}