{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":208642734,"authorName":"asmb65","from":"&quot;asmb65&quot; &lt;asmb65@...&gt;","profile":"asmb65","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on sister visit","postDate":"1184914936","msgId":25063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3cG1sbytiYTRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25029,"nextInTopic":0,"prevInTime":25062,"nextInTime":25064,"topicId":25006,"numMessagesInTopic":0,"msgSnippet":"... He may not be testing you. He may want to play in the empty laundry basket, he may want to see how the clothes will fly through the air. Or he may have","messageBody":"<div id=\"ygrps-yiv-1651780775\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; My nephew has a lot of behaviors that are difficult<br/>\n&gt; for me to deal with.  Most of them are what I think of<br/>\n&gt; as the typical &quot;terrible two&quot;--or in this case,<br/>\n&gt; &quot;terrible three&quot;--behaviors: whining when he doesn&#39;t<br/>\n&gt; get what he wants, temper tantrums, throwing things,<br/>\n&gt; etc.  He often does things that almost feel like he is<br/>\n&gt; testing me: throwing all of my clean, folded laundry<br/>\n&gt; onto a pile on the floor was the one that got my goat<br/>\n&gt; today.<br/>\n<br/>\n </span></blockquote>He may not be&quot;testing&quot; you. He may want to play in the empty laundry <br/>\nbasket, he may want to see how the clothes will fly through the air. <br/>\nOr he may have done this before with his parents and gotten a HUGE <br/>\nresponse and he wants to see that adult big emotion again. Even if it <br/>\nwas scary.<br/>\n<br/>\nMy older boy is an observer, he hardly ever did anything &quot;naughty&quot; <br/>\nwhen he was little, he was too busy watching everything (as I <br/>\nunderstand now). My younger boy is a do-er and an imp. He is so sweet <br/>\nand he loves getting reactions. He likes pinching me to see my <br/>\nreaction. He&#39;ll be smiling when he does it. If it doesn&#39;t really hurt <br/>\nI&#39;ll make a game of it and chase him around the house with us <br/>\npinching each other. If it does hurt I&#39;ll tell him it hurts and ask <br/>\nhim to please stop. But then I&#39;ll immediately distract him with <br/>\nsomething new since at a few months under three he can&#39;t possibly <br/>\nstop himself much of the time. He went through a stage of temper <br/>\ntantrums and so did my older boy at more like age 4 than 2. They have <br/>\nso little control of their emotions and life can be very frustrating <br/>\nfor little ones at times. Even just being little gets frustrating <br/>\nsometimes. I feel its important to validate their feelings and try to <br/>\ngive them words for them - &quot;You seem frustrated (disappointed, <br/>\nannoyed...) to me&quot; or &quot;That&#39;s upsetting when ... happens, isn&#39;t it?&quot;<br/>\n<br/>\nClean laundry thrown around? I hate to say it but get used to it! I <br/>\nhave changed my cleanliness, messiness and even personal hygiene <br/>\nstandards tremendously since having kids. If something like this <br/>\nhappens again with him try humor - put a pair of the shorts on your <br/>\nhead or something. Accept that he&#39;ll make a mess of the pile but <br/>\nhe&#39;ll also learn that he can trust you to be playful and not lecture <br/>\nor time-out him for being playful and childish.<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":138896698,"authorName":"amshotwell","from":"&quot;amshotwell&quot; &lt;amshot@...&gt;","profile":"amshotwell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on sister visit","postDate":"1184788334","msgId":25029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3bHIxZStwNDBmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25022,"nextInTopic":25063,"prevInTime":25028,"nextInTime":25030,"topicId":25006,"numMessagesInTopic":0,"msgSnippet":"... camp to see her final project. Afterward, she wanted to come home with me and the baby. Her mother (my sister) reminded her that she had swim team practice","messageBody":"<div id=\"ygrps-yiv-951955109\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Our first day here, my niece invited us to her last day of<br/>\n </span></blockquote>camp to see her final project. Afterward, she wanted to come home with<br/>\nme and the baby. Her mother (my sister) reminded her that she had swim<br/>\nteam practice which she had already missed earlier in the week. My<br/>\nniece became very upset, crying and insisting that she wanted to spend<br/>\ntime with her baby cousin. At which point my sister dragged her<br/>\nkicking and screaming away to her own car&lt;&lt;&lt;&lt;<br/>\n<br/>\nWhat I would take from watching this exchange is that it that there<br/>\nshould always be opportunity to discuss options and consequences of<br/>\nthose choices before a decision could be made. Taking the opportunity<br/>\nto validate the child wanting to see her cousin but gentle reminders<br/>\nto make sure the child is seeing the whole picture. Children&#39;s<br/>\nemotions are so in the moment that they can&#39;t always see the whole<br/>\npicture. I think we have to always be prepared to discuss and change<br/>\ngears if need be. As was stated in other posts this is not always<br/>\npossible to find the win win in every situation but participating in<br/>\nthe process will give the tools and foster trust and respect.<br/>\n<br/>\ne.g  Mom, I want to go with aunt and baby. ...well sweetie, I know how<br/>\nmuch you enjoy seeing your cousin and it is very exciting they are<br/>\nvisiting , before you make this decision you may want to remember you<br/>\nhave already missed your swim practice earlier this week and I know<br/>\nhow much seeing your friends and swimming means to you.  I want to<br/>\nremind you that your Aunt and cousin are going to be here for x amount<br/>\nof time. It is important to keep our commitment to the team but if you<br/>\nfeel that strongly about it, I am sure your team will understand that<br/>\nyou have family visiting.<br/>\n<br/>\nI think this would help the child make an informed decision rather<br/>\nthan a rash emotional one-<br/>\n<br/>\nAnother option could have been to invite Aunt and baby to swim<br/>\npractice as well.<br/>\n<br/>\nI just think this is a good example of trying to get win-win<br/>\nsituations and using the process that was talked about earlier in the<br/>\nweek. Obviously your sister does not parent that way and in a quiet<br/>\nmoment where you and your sister are connecting perhaps you could<br/>\nshare your budding philosophy with her. She could be completely<br/>\nfrustrated and wanting a different perspective as I up until recently<br/>\ntotally parented as she does. (at least with this example) I also find<br/>\nthat observing how parents interact are great learning tools of how I<br/>\nwould do the same or differently.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Later, I asked how swim team practice had gone. My niece said that<br/>\n </span></blockquote>it had been great, that she had spent a lot of time afterward playing<br/>\nin the pool, and that she hadn&#39;t realized how much she needed the time<br/>\nin the pool.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI could be way off but this comment sounds to me like she is repeating<br/>\nsomething your sister must have said to her after practice was over to<br/>\nprove herself right in forcing her to go.( again because I have<br/>\nparented this way and still am learning not too) Not to say that she<br/>\ndid not have a good time and did not benefit from the swimming.:) <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;My nephew has a lot of behaviors that are difficult for me to<br/>\n </span></blockquote>deal with. Most of them are what I think of<br/>\nas the typical &quot;terrible two&quot;--or in this case, &quot;terrible<br/>\nthree&quot;--behaviors: whining when he doesn&#39;t get what he wants, temper<br/>\ntantrums, throwing things, etc. He often does things that almost feel<br/>\nlike he is testing me: throwing all of my clean, folded laundry onto a<br/>\npile on the floor was the one that got my goat today.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nWelcome to my world! My 3.5ds is the child who is teaching me to<br/>\nmindful parent. He is very physical and emotional and when he is not<br/>\ngetting his needs served he hits he punches, he dumps things and does<br/>\nthis really annoying whine pant.The slightest sense that he is being<br/>\nrestricted in anyway makes him rebellious.What scares me is his<br/>\nrebellion against safety issues as I really try not to restrict<br/>\nhim-e.g. he sneaks in the street. He can be very physical even when he<br/>\nis not mad too. As i now really look hard at his behavior to try and<br/>\nunderstand him I have discovered that he gets very physical with his<br/>\nbrother when he is bored ( I have ds9 and ds6) This is when I have to<br/>\nchange his surroundings get him outside try and engage him in<br/>\nsomething but he does not always transition well depending how far<br/>\ngone he is in his emotional state.  Tantrums: I stay near ..I ask him<br/>\nwhat he needs, sometimes he says sometimes he just rages. I quietly<br/>\noffer him solutions which  may or may not be accepted. Mostly I ask<br/>\nhim if he wants me to hold him and if he says no I say that I am here<br/>\nwhen you are ready for me. I repeat after a minute or so and he<br/>\nusually comes to me. I tell him how sorry I am that he is upset and I<br/>\nwant to help him make it better. This process can take anywhere from 5<br/>\nminutes to an hour depending on the severity of the tantrum and the<br/>\ncause and or his state of mind going into it: tired/hungry/sugar buzz.<br/>\n---I try not to restrict what he eats and he does get a lot of treats,<br/>\n but recently I am trying to see if there is a trend in his behavior<br/>\nregarding his sugar intake. I have not seen anything conclusive but he<br/>\npicked out on his own sugar free icepops last week. He ate them for a<br/>\nfew days and now won&#39;t touch them. I wonder if he is unconsciously<br/>\naware that the are not giving him the sugar rush he is used to and<br/>\nthat is why he does not like them anymore Hmmm?.<br/>\n<br/>\nIt is way too early to worry about how your baby will be at this age.<br/>\nEnjoy him where he is... it goes so fast! So many times I had to catch<br/>\nmyself to stop and just enjoy, the dishes would eventually get done<br/>\nbut my beautiful boys are this big for a millisecond:). . By all means<br/>\nthough practice and formulate you ideas about parenting and use it on<br/>\nyour niece and nephew. You are lucky to get an early start as I am<br/>\njust getting here, a little late but still my kids are young enough to<br/>\nreap the benefit.<br/>\n<br/>\nI mostly lurk here and glean from these wise and wonderful people. It<br/>\nhas helped me so much, I can&#39;t even begin to share how grateful I am<br/>\nthat I found this board.<br/>\n<br/>\nI also recommend the NoMoreSpanking yahoo group, I have learned a<br/>\ngreat deal there too.<br/>\n<br/>\nAnne Marie</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on sister visit","postDate":"1184775011","msgId":25020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3bGUxMys4YnZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25008,"nextInTopic":25022,"prevInTime":25019,"nextInTime":25021,"topicId":25006,"numMessagesInTopic":0,"msgSnippet":"... Rather than seeing them as naughty, see them as a request for more engagement. He s looking for things to do *and* some company. If you can help him get","messageBody":"<div id=\"ygrps-yiv-30737308\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Elenita Santaballa <br/>\n&lt;esantaballa@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But I don&#39;t know how to deal with him.  I don&#39;t know<br/>\n&gt; how to react when he throws all of my clean laundry on<br/>\n&gt; the floor--or the many other &quot;naughty&quot; things that he<br/>\n&gt; does all day long. <br/>\n<br/>\n </span></blockquote>Rather than seeing them as naughty, see them as a request for more <br/>\nengagement. He&#39;s looking for things to do *and* some company. If you <br/>\ncan help him get what he needs, you won&#39;t be spending so much energy <br/>\nreacting. <br/>\n<br/>\nActually, this may well be how his mom got into the trap of <br/>\nscheduling a zillion things for her kids in the first place - these <br/>\nkids may well need a lot of things to do. They don&#39;t necessarily <br/>\nneed to be classes and outings all the time, but some kids do have <br/>\nhigher energy needs than others. <br/>\n<br/>\nWhen incidents like the laundry thing happens you have a chance to <br/>\nlook at his behavior as an opportunity to connect and engage with <br/>\nhim. What if you were to grab a tshirt out of the laundry (you can <br/>\nfold it later) and start dancing around waving it in the air like a <br/>\nflag or scarf? That&#39;d be fun. Let him have one, too. Put some music <br/>\non. I bet the baby would love it, too - you could even do a sort of <br/>\npeek-a-boo game with it if you wanted. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To be honest, what goes on for me is that I look at my<br/>\n&gt; sweet but devilish little nephew and I wonder if my<br/>\n&gt; own son will be devilish like him.  And if he is, how<br/>\n&gt; will that be for me as a parent?  I want to &quot;do&quot;<br/>\n&gt; things differently so that my own son will be<br/>\n&gt; &quot;better.&quot;<br/>\n<br/>\n </span></blockquote>Well, there&#39;s no guarantee that your little one will be anything <br/>\nlike your nephew. That being said, you have a lovely opportunity to <br/>\ndo some thinking now and discovering some strategies. The first is: <br/>\ndon&#39;t expect to get anything done for a few years. Energetic kids <br/>\nneed parenting more than clean sheets ;) The next is: start looking <br/>\nfor ways to arrange your home with energetic play in mind. Look for <br/>\nways to open up floor space. Get rid of lamps and things that tip. <br/>\nThink in terms of minimizing the need to say &quot;no&quot;.<br/>\n<br/>\n  Its also good to look for toys and indoor play options that use <br/>\nlots of big muscle groups. You let the kids jump on the furniture, <br/>\nright? Maybe think about an air-mattress or extra cushions so they <br/>\ncan jump from the furniture to the floor and back. Really big balls, <br/>\nlike exercise balls or the bouncy things with the handle on top, can <br/>\nbe great fun. A small slide. Skateboards to use as scooters. Sit-n-<br/>\nspin. Any weird thing to put on feet and make walking exciting. With <br/>\nthe baby, you may not want to get a bunch of balloons, but that&#39;s a <br/>\nblast with slightly older kids. See if you can get some of the foil <br/>\nkind at a dollar store. Scarves, or just big, flimsy pieces of <br/>\nfabric. Streamers. Badminton raquets and birdies. Tunnels. A tent. <br/>\nIf the space is big enough, a swing or trapeze. Look at your <br/>\nbasement and attic, too, if you have either of those, with an eye to <br/>\nmaking more indoor play areas. <br/>\n<br/>\nObviously you don&#39;t need all this right now! But its something to <br/>\nkeep in mind when you&#39;re out and about just in case you run across <br/>\nsomething really neat or on sale.<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":187841659,"authorName":"Janet","from":"Janet &lt;janeteg@...&gt;","profile":"janeteg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] More on sister visit","postDate":"1184769174","msgId":25022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMjUxNjgxMTU3QHJydi5uZXQ+","inReplyToHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25020,"nextInTopic":25029,"prevInTime":25021,"nextInTime":25023,"topicId":25006,"numMessagesInTopic":0,"msgSnippet":"I m a long time unschooler and a very (most people call it) laid back mother. I never ever had a child who was a terrible two or a child who tested my","messageBody":"<div id=\"ygrps-yiv-509559790\">I&#39;m a long time unschooler and a very (most people call it) laid back <br/>\nmother. I never ever had a child who was a &quot;terrible two&quot; or a child <br/>\nwho tested my limits... I was firm and unyielding when necessary <br/>\n(&quot;can I go play in the street?&quot; or &quot;Can I pour this hot wax on the <br/>\ncarpet?&quot;) and rarely said &quot;no&quot; to them (maybe when they were sticking <br/>\nsomething into the electrical outlet...)  But we have had very &quot;well <br/>\nbehaved&quot; (in the opinions of others) children! I never over scheduled <br/>\nthem, or me (we rarely scheduled anything LOL) and I have always done <br/>\nthe &quot;follow them around and see what they are learning&quot; type of <br/>\nhomeschooling. Our homes were always and still are, child friendly. <br/>\nThere is very little they can get into that I don&#39;t want them in. <br/>\n(Hm, except that now the 10yo has been climbing on the counter and <br/>\nplaying with matches and candles and making wax sculptures... <br/>\nsometimes that annoys me!)<br/>\n<br/>\nI honestly don&#39;t think *every* child develops into a little devilish <br/>\ndervish. Of course mine did things that many would consider <br/>\nnaughty.... I remember being on the phone helping a mom with a new <br/>\nbaby and my little son, about 2 I think, was gleefully running around <br/>\nthe living room spreading cereal, some flake, all over the room.... I <br/>\nignored him and when we got off the phone we vacuumed it up. Things <br/>\nlike that happen with kids! I (usually) have been able to take it all <br/>\nin stride and realize they are not out to get me, they are just learning!<br/>\n<br/>\nWas the 3yo vying for your attention? Could he help fold the laundry? <br/>\nMy kids loved to &quot;help&quot; do anything I did...  was he mad about <br/>\nsomething?  I very rarely gave (or give) my kids orders... I <br/>\nsometimes make suggestions, ask for help or whatever, but their days <br/>\nare really their own. With the younger ones of course, I was way more <br/>\nactively engaged; as they get old, they want to do it without me <br/>\nhelping or hanging around. My guess is that the 3yo needs someone to <br/>\nplay with him - you! (since mom isn&#39;t willing or able.)  3yos do need <br/>\nquite a bit of hm... where&#39;s a good word... not &quot;direction&quot; or <br/>\n&quot;supervision&quot; ... but loving guidance. And patience LOL, tons of that.<br/>\n<br/>\nThings 3yos like:<br/>\n-playdoh (homemade is easy if you don&#39;t have any)<br/>\n-marbles and chutes (toilet paper tubes, cardboard)<br/>\n-ping pong balls if marble are too small - my little ones loved ping <br/>\npong balls!<br/>\n-water play - on towels on the floor - bubbles and spoons and bowls, seives...<br/>\n-sand - we bring in snow in the winter, a sand table - or sand in a <br/>\nbaking dish - with cars and water and little people...<br/>\n-card games - they make up the rules - very entertaining.....<br/>\n-finger paint<br/>\n-being read to<br/>\n-writing a story book<br/>\n-sliding down the stairs on sleeping bags<br/>\n-big boxes to play in and decorate<br/>\n-forts made out of blankets<br/>\n<br/>\nJanet in MN unschooler to 6 now ages 26, 23, 20, 17, 13, 10<br/>\n<br/>\n<br/>\nAt 10:19 PM 7/17/2007, you wrote:<br/>\n<br/>\n                        (snipped in various places)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;My nephew is 3. He has been spending a lot of time<br/>\n&gt;with me and my son (as has my niece). My<br/>\n&gt;overscheduled sister loves it when I am here because<br/>\n&gt;it gives her some relief from her hectic life.<br/>\n&gt;<br/>\n&gt;In the case of my niece and nephew, their parents tend<br/>\n&gt;to give them a lot of orders (do this, don&#39;t do that,<br/>\n&gt;stop that, etc.) and a lot of time-outs. My devilish<br/>\n&gt;little nephew gets a lot of time-outs.<br/>\n&gt;<br/>\n&gt;So it doesn&#39;t surprise me that he tests me. He has<br/>\n&gt;come to know what to expect in reaction to his &quot;bad&quot;<br/>\n&gt;behavior from his parents. He already senses that my<br/>\n&gt;reaction is going to be different.<br/>\n&gt;<br/>\n&gt;But I don&#39;t know how to deal with him. I don&#39;t know<br/>\n&gt;how to react when he throws all of my clean laundry on<br/>\n&gt;the floor--or the many other &quot;naughty&quot; things that he<br/>\n&gt;does all day long. I love this little boy. Yesterday<br/>\n&gt;we had some other kids over that were close to his age<br/>\n&gt;to play with some sprinklers and wading pools that I<br/>\n&gt;had set up out back. He was so filled with joy and<br/>\n&gt;freedom as he played.<br/>\n&gt;<br/>\n&gt;Maybe he is just bored from being cooped up with me<br/>\n&gt;and my 7 mo. old. It is too oppressively hot outside<br/>\n&gt;to play out there much. And my sister has asked that I<br/>\n&gt;not allow her kids to watch TV, play video games, or<br/>\n&gt;use the computer, but hasn&#39;t given me much to keep<br/>\n&gt;them entertained with. And my baby gets very tired if<br/>\n&gt;I drag him all over town.<br/>\n&gt;<br/>\n&gt;To be honest, what goes on for me is that I look at my<br/>\n&gt;sweet but devilish little nephew and I wonder if my<br/>\n&gt;own son will be devilish like him. And if he is, how<br/>\n&gt;will that be for me as a parent? I want to &quot;do&quot;<br/>\n&gt;things differently so that my own son will be<br/>\n&gt;&quot;better.&quot; All the while knowing that I can&#39;t control<br/>\n&gt;him. Will I be up to the task? Will my own son push<br/>\n&gt;my buttons in the way my nephew does? Will I be<br/>\n&gt;constantly tempted to take the easy way out<br/>\n&gt;(punishment, bribes, threats)?<br/>\n&gt;<br/>\n&gt;I suspect the answers to these questions are &quot;yes.&quot;<br/>\n&gt;And so begins my task of learning how to parent in a<br/>\n&gt;non-violent and respectful way.<br/>\n&gt;<br/>\n&gt;Thanks for &quot;listening&quot; if you&#39;ve made it this far.<br/>\n&gt;Would appreciate your feedback and comments.<br/>\n&gt;<br/>\n&gt;Elena </span></blockquote></div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] More on sister visit","postDate":"1184735186","msgId":25008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcwNzE3MjIwNnUxMjk0NmYwZWg5ZjRlMjVkZGZkODQ3OTQwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25006,"nextInTopic":25020,"prevInTime":25007,"nextInTime":25009,"topicId":25006,"numMessagesInTopic":0,"msgSnippet":"Elena, Being a guy, I have some suggestions for the frustrating behavior.  Hope I won t bore you with stuff you already are doing. Suggestions: 1a. Do some","messageBody":"<div id=\"ygrps-yiv-88935280\">Elena,<br/>\n<br/>\nBeing a guy, I have some suggestions for the frustrating behavior.  Hope I<br/>\nwon&#39;t bore you with stuff you already are doing.<br/>\n<br/>\nSuggestions:<br/>\n1a. Do some re-winding and pre-planning.  Imagine how you would like to<br/>\nrespond to that situation.  Play that out in your mind several times.<br/>\n1b. For the dumped laundry:  Stop.  Breathe.  Breathe again.  Do it again if<br/>\nnecessary.  Then act out how you planned in the previous step.<br/>\n2. Begin modifying your own environment to accommodate his &quot;devilish&quot; side,<br/>\nif he&#39;s going to be over a lot.<br/>\n3. If his mother is not going to allow TV/computer games/etc., then ask her<br/>\nto please provide some things for him to do.<br/>\n4. If possible, figure out why he&#39;s doing those devilish things.<br/>\n<br/>\nMy dd2 (4.25) is very challenging.  I wouldn&#39;t call her devilish, as to me<br/>\nthat sounds playful and mischievous.  But some of the behaviors are<br/>\nsimliar.  She will dump all the clothes onto the floor that were just hung<br/>\nnot 5 minutes previous.  She hits.  She gets into throwing things, and as<br/>\nyou&#39;re trying to fix/repair/keep it from falling, she&#39;s onto something else<br/>\nto knock off a table or throw across the room.<br/>\n<br/>\nWhen she does this, more often than not she is in desperate need of a<br/>\nconnection from us.  She has lost her &quot;power&quot; and is striking out.  It has<br/>\ntaken great effort for us to stop, breathe, breathe again, and then attempt<br/>\nto engage her as much as she&#39;s willing to let us.  Sometimes it&#39;s direct<br/>\ncontact (hugging, stroking, telling her we love her), sometimes it&#39;s just<br/>\nmentioning that she looks really angry.  If she&#39;s taken something from her<br/>\nsister, we do not take it back from her, and we have to reassure her that<br/>\nwe&#39;re NOT going to take it from her (we did enough of that already --<br/>\nyuck!).<br/>\n<br/>\nBottom line is that we stopped &quot;treating&quot; her behavior and watched to see<br/>\nwhat it was that she needed.  She&#39;s scared that we will stop loving her<br/>\nand/or will abandon her (wish we&#39;d known when she was an infant what we know<br/>\nnow).  That is her issue.  And sad to say, she&#39;s afraid of that because we<br/>\nDID for a while take back things from her that she took from others.  We<br/>\ngave her time-outs (i.e. separation).  When we ran out of ideas, we yelled<br/>\nat her and spanked her.  Guess what?  made it worse.  We figured out what we<br/>\nwere doing wrong and and what she needed.  And she has really blossomed.<br/>\n<br/>\nHave I babbled enough?<br/>\n<br/>\n--Rob Saxon<br/>\nDH to Seana for 10 years<br/>\n&quot;Daddy!&quot; to Seana (5.8) and Elissa (4.25)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/17/07, Elenita Santaballa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:esantaballa@...\">esantaballa@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   --- Nance Confer&quot; &lt;marbleface@...&gt; wrote:<br/>\n&gt; &gt; Judging by your sister&#39;s physical ability to drag<br/>\n&gt; this child against her will, I&#39;ll guess she&#39;s young.<br/>\n&gt; &gt;<br/>\n&gt; &gt; And maybe overscheduled. She has camp in the morning<br/>\n&gt; and swim team after that? And company visiting. Sounds<br/>\n&gt; like a lot to me.<br/>\n&gt;<br/>\n&gt; Yup, she&#39;s 7(!), and like her mother, her life is<br/>\n&gt; overscheduled. I think that my sister has fallen into<br/>\n&gt; the trap of, &quot;If I don&#39;t have my children signed up<br/>\n&gt; for a million activities, I am not a good mother.&quot; My<br/>\n&gt; sister and I were raised by our own parents to be<br/>\n&gt; &quot;human doings,&quot; not &quot;human beings.&quot;<br/>\n&gt;<br/>\n&gt; Wow, I will need to unschool myself from this for the<br/>\n&gt; sake of my own DS.<br/>\n&gt;<br/>\n&gt; More challenges for me:<br/>\n&gt;<br/>\n&gt; My nephew is 3. He has been spending a lot of time<br/>\n&gt; with me and my son (as has my niece). My<br/>\n&gt; overscheduled sister loves it when I am here because<br/>\n&gt; it gives her some relief from her hectic life.<br/>\n&gt;<br/>\n&gt; My nephew has a lot of behaviors that are difficult<br/>\n&gt; for me to deal with. Most of them are what I think of<br/>\n&gt; as the typical &quot;terrible two&quot;--or in this case,<br/>\n&gt; &quot;terrible three&quot;--behaviors: whining when he doesn&#39;t<br/>\n&gt; get what he wants, temper tantrums, throwing things,<br/>\n&gt; etc. He often does things that almost feel like he is<br/>\n&gt; testing me: throwing all of my clean, folded laundry<br/>\n&gt; onto a pile on the floor was the one that got my goat<br/>\n&gt; today.<br/>\n&gt;<br/>\n&gt; Like I said before, I am a new parent, so I am<br/>\n&gt; learning about child behaviors. Maybe this is<br/>\n&gt; something that children do: they test the adults<br/>\n&gt; around them to get a sense of what they can expect?<br/>\n&gt;<br/>\n&gt; In the case of my niece and nephew, their parents tend<br/>\n&gt; to give them a lot of orders (do this, don&#39;t do that,<br/>\n&gt; stop that, etc.) and a lot of time-outs. My devilish<br/>\n&gt; little nephew gets a lot of time-outs.<br/>\n&gt;<br/>\n&gt; So it doesn&#39;t surprise me that he tests me. He has<br/>\n&gt; come to know what to expect in reaction to his &quot;bad&quot;<br/>\n&gt; behavior from his parents. He already senses that my<br/>\n&gt; reaction is going to be different.<br/>\n&gt;<br/>\n&gt; But I don&#39;t know how to deal with him. I don&#39;t know<br/>\n&gt; how to react when he throws all of my clean laundry on<br/>\n&gt; the floor--or the many other &quot;naughty&quot; things that he<br/>\n&gt; does all day long. I love this little boy. Yesterday<br/>\n&gt; we had some other kids over that were close to his age<br/>\n&gt; to play with some sprinklers and wading pools that I<br/>\n&gt; had set up out back. He was so filled with joy and<br/>\n&gt; freedom as he played.<br/>\n&gt;<br/>\n&gt; Maybe he is just bored from being cooped up with me<br/>\n&gt; and my 7 mo. old. It is too oppressively hot outside<br/>\n&gt; to play out there much. And my sister has asked that I<br/>\n&gt; not allow her kids to watch TV, play video games, or<br/>\n&gt; use the computer, but hasn&#39;t given me much to keep<br/>\n&gt; them entertained with. And my baby gets very tired if<br/>\n&gt; I drag him all over town.<br/>\n&gt;<br/>\n&gt; To be honest, what goes on for me is that I look at my<br/>\n&gt; sweet but devilish little nephew and I wonder if my<br/>\n&gt; own son will be devilish like him. And if he is, how<br/>\n&gt; will that be for me as a parent? I want to &quot;do&quot;<br/>\n&gt; things differently so that my own son will be<br/>\n&gt; &quot;better.&quot; All the while knowing that I can&#39;t control<br/>\n&gt; him. Will I be up to the task? Will my own son push<br/>\n&gt; my buttons in the way my nephew does? Will I be<br/>\n&gt; constantly tempted to take the easy way out<br/>\n&gt; (punishment, bribes, threats)?<br/>\n&gt;<br/>\n&gt; I suspect the answers to these questions are &quot;yes.&quot;<br/>\n&gt; And so begins my task of learning how to parent in a<br/>\n&gt; non-violent and respectful way.<br/>\n&gt;<br/>\n&gt; Thanks for &quot;listening&quot; if you&#39;ve made it this far.<br/>\n&gt; Would appreciate your feedback and comments.<br/>\n&gt;<br/>\n&gt; Elena<br/>\n&gt;<br/>\n&gt; __________________________________________________________<br/>\n&gt; Get the free Yahoo! toolbar and rest assured with the added security of<br/>\n&gt; spyware protection.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://new.toolbar.yahoo.com/toolbar/features/norton/index.php\">http://new.toolbar.yahoo.com/toolbar/features/norton/index.php</a><br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":40730984,"authorName":"Elenita Santaballa","from":"Elenita Santaballa &lt;esantaballa@...&gt;","profile":"esantaballa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"More on sister visit","postDate":"1184728788","msgId":25006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MDQ4OS43MDI3My5xbUB3ZWIzOTYxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":25008,"prevInTime":25005,"nextInTime":25007,"topicId":25006,"numMessagesInTopic":0,"msgSnippet":"... this child against her will, I ll guess she s young. ... and swim team after that? And company visiting. Sounds like a lot to me. Yup, she s 7(!), and like","messageBody":"<div id=\"ygrps-yiv-306614085\">--- Nance Confer&quot; &lt;marbleface@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Judging by your sister&#39;s physical ability to drag<br/>\n </span></blockquote>this child against her will, I&#39;ll guess she&#39;s young. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And maybe overscheduled. She has camp in the morning<br/>\n </span></blockquote>and swim team after that? And company visiting. Sounds<br/>\nlike a lot to me.<br/>\n<br/>\nYup, she&#39;s 7(!), and like her mother, her life is<br/>\noverscheduled.  I think that my sister has fallen into<br/>\nthe trap of, &quot;If I don&#39;t have my children signed up<br/>\nfor a million activities, I am not a good mother.&quot;  My<br/>\nsister and I were raised by our own parents to be<br/>\n&quot;human doings,&quot; not &quot;human beings.&quot;<br/>\n<br/>\nWow, I will need to unschool myself from this for the<br/>\nsake of my own DS.<br/>\n<br/>\nMore challenges for me:<br/>\n<br/>\nMy nephew is 3.  He has been spending a lot of time<br/>\nwith me and my son (as has my niece).  My<br/>\noverscheduled sister loves it when I am here because<br/>\nit gives her some relief from her hectic life.<br/>\n<br/>\nMy nephew has a lot of behaviors that are difficult<br/>\nfor me to deal with.  Most of them are what I think of<br/>\nas the typical &quot;terrible two&quot;--or in this case,<br/>\n&quot;terrible three&quot;--behaviors: whining when he doesn&#39;t<br/>\nget what he wants, temper tantrums, throwing things,<br/>\netc.  He often does things that almost feel like he is<br/>\ntesting me: throwing all of my clean, folded laundry<br/>\nonto a pile on the floor was the one that got my goat<br/>\ntoday.<br/>\n<br/>\nLike I said before, I am a new parent, so I am<br/>\nlearning about child behaviors.  Maybe this is<br/>\nsomething that children do: they test the adults<br/>\naround them to get a sense of what they can expect?<br/>\n<br/>\nIn the case of my niece and nephew, their parents tend<br/>\nto give them a lot of orders (do this, don&#39;t do that,<br/>\nstop that, etc.) and a lot of time-outs.  My devilish<br/>\nlittle nephew gets a lot of time-outs.<br/>\n<br/>\nSo it doesn&#39;t surprise me that he tests me.  He has<br/>\ncome to know what to expect in reaction to his &quot;bad&quot;<br/>\nbehavior from his parents.  He already senses that my<br/>\nreaction is going to be different.<br/>\n<br/>\nBut I don&#39;t know how to deal with him.  I don&#39;t know<br/>\nhow to react when he throws all of my clean laundry on<br/>\nthe floor--or the many other &quot;naughty&quot; things that he<br/>\ndoes all day long.  I love this little boy.  Yesterday<br/>\nwe had some other kids over that were close to his age<br/>\nto play with some sprinklers and wading pools that I<br/>\nhad set up out back.  He was so filled with joy and<br/>\nfreedom as he played.<br/>\n<br/>\nMaybe he is just bored from being cooped up with me<br/>\nand my 7 mo. old.  It is too oppressively hot outside<br/>\nto play out there much. And my sister has asked that I<br/>\nnot allow her kids to watch TV, play video games, or<br/>\nuse the computer, but hasn&#39;t given me much to keep<br/>\nthem entertained with.  And my baby gets very tired if<br/>\nI drag him all over town.<br/>\n<br/>\nTo be honest, what goes on for me is that I look at my<br/>\nsweet but devilish little nephew and I wonder if my<br/>\nown son will be devilish like him.  And if he is, how<br/>\nwill that be for me as a parent?  I want to &quot;do&quot;<br/>\nthings differently so that my own son will be<br/>\n&quot;better.&quot;  All the while knowing that I can&#39;t control<br/>\nhim.  Will I be up to the task?  Will my own son push<br/>\nmy buttons in the way my nephew does?  Will I be<br/>\nconstantly tempted to take the easy way out<br/>\n(punishment, bribes, threats)?<br/>\n<br/>\nI suspect the answers to these questions are &quot;yes.&quot; <br/>\nAnd so begins my task of learning how to parent in a<br/>\nnon-violent and respectful way.<br/>\n<br/>\nThanks for &quot;listening&quot; if you&#39;ve made it this far. <br/>\nWould appreciate your feedback and comments.<br/>\n<br/>\nElena<br/>\n<br/>\n<br/>\n       <br/>\n____________________________________________________________________________________<br/>\nGet the free Yahoo! toolbar and rest assured with the added security of spyware protection.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://new.toolbar.yahoo.com/toolbar/features/norton/index.php\">http://new.toolbar.yahoo.com/toolbar/features/norton/index.php</a></div>","specialLinks":[]}],"prevTopicId":25062,"nextTopicId":24998}}