{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Violent emotions, dangerous communication zones","postDate":"1286044609","msgId":44915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4N3U0MStnamZrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4N2tuZis4cTNzQGVHcm91cHMuY29tPg=="},"prevInTopic":44914,"nextInTopic":0,"prevInTime":44914,"nextInTime":44916,"topicId":44906,"numMessagesInTopic":0,"msgSnippet":"... ****************** It might be better to talk about what you want, what you like, but not put things in terms of I need X. That s the sort of language","messageBody":"<div id=\"ygrps-yiv-2104214655\">&quot;Lisa B&quot; &lt;jlblock01@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Perhaps if you could have a conversation with your husband away from the kids at a time when he&#39;s feeling relaxed and just frame it in a way that you are asking him for things that you need for you... I need our family time to be joyful, I don&#39;t feel joyful when arguments happen so frequently.   Can you help me with some ideas for how you think we could not have as many arguments in our home?<br/>\n </span></blockquote>******************<br/>\n<br/>\nIt might be better to talk about what you want, what you like, but not put things in terms of &quot;I need X.&quot; That&#39;s the sort of language that can come across as really pushy and manipulative, especially if someone is used to being pushed and manipulated. This is one of the places where sticking to the *language* of Non Violent Communication can bog down the *purpose* of the strategy, which is to open up communication itself. Before ever having a conversation about what you &quot;need&quot; - or want or wish or hope for - ask first. What does He want and wish and hope for? Try to get a sense of what He needs. That&#39;s where communication starts, with asking and listening. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Violent emotions, dangerous communication zones","postDate":"1286039556","msgId":44914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDMwNkMyNEI3MjM1Ri0xQUI0LUQ5RjJAd2VibWFpbC1tMDExLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGk4N2tuZis4cTNzQGVHcm91cHMuY29tPg=="},"prevInTopic":44913,"nextInTopic":44915,"prevInTime":44913,"nextInTime":44915,"topicId":44906,"numMessagesInTopic":0,"msgSnippet":"... From: Lisa B  Perhaps if you could have a conversation with your husband away from the kids at a time when he s feeling relaxed and","messageBody":"<div id=\"ygrps-yiv-1172934984\">-----Original Message-----<br/>\nFrom: Lisa B &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlblock01@...\">jlblock01@...</a>&gt;<br/>\n<br/>\nPerhaps if you could have a conversation with your husband away from the kids at <br/>\na time when he&#39;s feeling relaxed and just frame it in a way that you are asking <br/>\nhim for things that you need for you... I need our family time to be joyful, I <br/>\ndon&#39;t feel joyful when arguments happen so frequently.   Can you help me with <br/>\nsome ideas for how you think we could not have as many arguments in our home?  <br/>\nMy husband yells or raises his voice when he is stressed .. his parents yelled <br/>\nALOT and it took him a long time to understand that when he did that even if he <br/>\nwasn&#39;t angry but just felt stressed that it FELT like anger and yelling to ME <br/>\nand that I could not live in an environment where I felt like I was walking on <br/>\neggshells or on red alert all the time!  Now I look at him and very quietly say <br/>\n&quot; you are yelling and I don&#39;t like it&quot;    <br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\nIf talking doesn&#39;t work, try writing a long, detailed letter for him to read. Sometimes it&#39;s hard to get your point across if the other person interrupts, redirects, or negates everything you say. The letter can help take care of that.<br/>\n<br/>\n<br/>\nAfter he reads the letter, then maybe you can choose a time to talk calmly. Or maybe he would feel better heard if HE writes a return letter. <br/>\n<br/>\n<br/>\nMaybe he needs an outlet to examine his own childhood. The written word might help.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa B","from":"&quot;Lisa B&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Violent emotions, dangerous communication zones","postDate":"1286034991","msgId":44913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4N2tuZis4cTNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluNC1OQU53cVZPYkttSlgxenNGb3MyVjIzNmRqNGNuZm4xSHk4WUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44910,"nextInTopic":44914,"prevInTime":44912,"nextInTime":44914,"topicId":44906,"numMessagesInTopic":0,"msgSnippet":"Deb, First of all let me say my heart aches for you! It s hard to want a different way of life for your family and feel that your partner in that very","messageBody":"<div id=\"ygrps-yiv-1584678992\">Deb, <br/>\n<br/>\nFirst of all let me say my heart aches for you! It&#39;s hard to want a different way of life for your family and feel that your partner in that very important task isn&#39;t on the same page.  Most of us have gone through similar things to different degrees... rarely are both parents on the same schedule for coming to an unschooling type mindset in our lives in every area.  My husband was quick to understand the child led life learning aspect but in the parenting aspect it came more slowly and still is a process 12 years later.   <br/>\n<br/>\nAlso let me say it doesn&#39;t sound like your husband was traditionally parented... it sounds like he was parented by dysfunctional parents ... I was traditionally parented and my parents never used shame, blame or other tactics like that to get me to tow the line!   There were arbitrary rules that they used because they thought it was their job as parents to make us do certain things on certain schedules, there was punishment in the form of being grounded or having things taken away.  My parents were always open to hearing my side of things and open to hearing why I thought they were wrong.... they may not have changed their thinking but they did validate my need to have my side heard.  The way I was parented did make me very independent in the way of not wanting others to tell me what to do.  I even am irked by automatic soap dispensers and paper towel dispensers because how dare some machine arbitrarily decide how much soap or paper I need! LOL    I didn&#39;t like rules that made no sense but I did have a huge sense of security and I knew I was loved.    <br/>\n<br/>\nOn the other side my husband was parented similarly it sounds to your husband.  At his house someone was ALWAYS to BLAME about EVERYTHING!  ANything that happened had to have a culprit who was then made to feel less than!   Fortunately for the most part he has left that behind and used the horrible way it made him feel to avoid doing it to our kids.   There are times when he is stressed that some of those things come out.   I usually remind him by just saying &quot;you know sometimes things just happen and there really isn&#39;t any one at fault... is your relationship with your child worth knowing who left the milk on the counter?  Something that costs $4 a gallon isn&#39;t worth your child thinking you&#39;re an ass&quot;    <br/>\n<br/>\nPerhaps if you could have a conversation with your husband away from the kids at a time when he&#39;s feeling relaxed and just frame it in a way that you are asking him for things that you need for you... I need our family time to be joyful, I don&#39;t feel joyful when arguments happen so frequently.   Can you help me with some ideas for how you think we could not have as many arguments in our home?  My husband yells or raises his voice when he is stressed .. his parents yelled ALOT and it took him a long time to understand that when he did that even if he wasn&#39;t angry but just felt stressed that it FELT like anger and yelling to ME and that I could not live in an environment where I felt like I was walking on eggshells or on red alert all the time!  Now I look at him and very quietly say &quot; you are yelling and I don&#39;t like it&quot;    <br/>\n<br/>\nAlso validating that he is stressed and that he is resentful of his ex injecting more stress and obligations by signing the children up for activities that he has to provide the transportation for may be helpful.   Tell him you don&#39;t want the children to feel that stress and feel that they are responsible for things that adults do.  Children often have a heavy load of activities and as long as the child likes it and wants it and we can provide it we should do so joyfully.   I never want my kids to feel like they &quot;owe&quot; me something for all the hours of driving to scouts, dance, clubs, horse barns etc etc   I consider it an honor to be their mom and to have the health and resources to provide the things they are interested in.   AS Neill in his book Summerhill talks about how children should have a vote within the democratic school model and that adults are not more important but at the same time children shouldn&#39;t have to worry about where the food comes from, or the bills etc they shouldn&#39;t have adult worries.     <br/>\n<br/>\nI have a friend who was in a really bad marriage and had one child... she constantly talked really bad about her husband to her child.  I told her that I thought she was doing alot of damage because one of two things were going to happen... 1 her child was going to believe that her father was really that awful and how sad that would be for their relationship or 2 that her child would discover that her mom was a liar and that their relationship would be destroyed.   I underestimated my friend because her child is now 17 and the mother has managed to destroy the relationship between the herself and the child and the child and the father!!  <br/>\n<br/>\nOne thing I try to keep in mind when I interact with my children is that I want to be the FIRST person they think to call when they are in trouble.   If they are somewhere that things aren&#39;t going well, if they have had too much to drink, if they made a bad choice and need to be rescued etc etc etc   there isn&#39;t ANOTHER person on the PLANET I want to come to mind before ME !   Kids can&#39;t trust parents who are taking shots at them at every turn... your husband likely knows that because he lives it with his parents.   Ask him how he feels about their relationship and talk frankly about where you see him headed with his girls.   <br/>\n<br/>\nAnyway hopefully something I have said here will be helpful... most of all know you aren&#39;t alone and that this whole thing is a process.  <br/>\n<br/>\nBest wishes!<br/>\nLisa B<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Deborah McKee Kelly &lt;dlmckee@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My DH and I are treading on some pretty rocky territory.  I wanted to run<br/>\n&gt; some examples and concerns by you guys and see if you could offer some<br/>\n&gt; help.  This is affecting the unschooling environment, and my overall peace<br/>\n&gt; and sanity.<br/>\n&gt; <br/>\n&gt; Just to start, I&#39;ve been reading several books for the past year or so, on<br/>\n&gt; unschooling and compassionate parenting.  I&#39;ve read several John Holt books,<br/>\n&gt; and I&#39;ve also gotten into the work of Marshall Rosenberg on non-violent<br/>\n&gt; communication.  I&#39;ve also been on the unschooling groups like this one,<br/>\n&gt; worked through a lot of Sandra Dodd&#39;s stuff, and have been trying to<br/>\n&gt; implement a lot of these ideas in my own interactions with the kids -- less<br/>\n&gt; so with my DH, but I realize that could be helpful (empathy for him,<br/>\n&gt; listening without judging, etc.)<br/>\n&gt; <br/>\n&gt; The more I work on my unschooling  and peaceful parenting, the more aware I<br/>\n&gt; become of how far away my DH is on these same matters.<br/>\n&gt; <br/>\n&gt; I had hoped that reading all these things and looking for help would make it<br/>\n&gt; easier, but in many ways, I feel like I&#39;m becoming more frustrated.<br/>\n&gt; <br/>\n&gt; I&#39;ve been reading all these books and forums, and finding all these new ways<br/>\n&gt; of thinking and being aware of my parenting, and it&#39;s making me more angry<br/>\n&gt; than ever about the ways DH is interacting with me and with our babies.  I&#39;m<br/>\n&gt; not saying I&#39;ve got it all figured out; and I think if there&#39;s any *answer,*<br/>\n&gt; it&#39;s that I need to treat DH with the same empathy and respect and love and<br/>\n&gt; kindness that I&#39;m wanting to use with the kids.  I think he&#39;s coming from a<br/>\n&gt; place of many years of hurt.  But I feel very alone, here.  I feel like I&#39;m<br/>\n&gt; doing so much work on my own, without any support from DH, and in fact,<br/>\n&gt; trying to undo some of the stuff he inflicts on the kids and me.<br/>\n&gt; <br/>\n&gt; We have DH&#39;s two older kids (15 yo girl and 10 yo boy) and our two babies,<br/>\n&gt; an 18 month old girl and a 4 month old girl.  I homeschool the 10 yo; the 15<br/>\n&gt; yo goes to public school.<br/>\n&gt; <br/>\n&gt; Like most of us, DH was raised with traditional parenting, except in his<br/>\n&gt; case, I think it was something like permissive neglect, almost, with heavy<br/>\n&gt; doses of guilt, shame, blame, and manipulation thrown in.  There was very<br/>\n&gt; little to no affection in his family.  His mom, who is still pretty heavily<br/>\n&gt; involved in our lives, uses a mixture of avoidance, sarcasm, blame, shame,<br/>\n&gt; and promised material rewards to get other people, mostly her grandchildren<br/>\n&gt; and us, to do what she wants.<br/>\n&gt; <br/>\n&gt; I was making some notes the other day while reading one of Marshall<br/>\n&gt; Rosenberg&#39;s books on compassionate parenting, and I realized I&#39;m afraid to<br/>\n&gt; talk with DH about some of the things I&#39;m reading and learning.  I even<br/>\n&gt; wrote out a possible script for how a conversation might go, with me being<br/>\n&gt; really empathetic to DH&#39;s potential comments.<br/>\n&gt; <br/>\n&gt; I realized while I was doing it that I am afraid of communicating with him<br/>\n&gt; about anything of substance.  I started to realize that our conversations<br/>\n&gt; typically follow some pretty violent paths, and that I don&#39;t know how to<br/>\n&gt; speak with him without fearing a blow-up.  I tend to avoid conflict, and<br/>\n&gt; back down.  He tends to lob verbal bombs that hurt pretty bad, or he *jokes*<br/>\n&gt; in a harsh, put-down way; I feel our conversations have become a war-zone.<br/>\n&gt; That&#39;s one analogy I can think of.  I was thinking, as I wrote out that<br/>\n&gt; script of possible conversation *moves,* it was like playing a really<br/>\n&gt; stressful game of chess, trying to anticipate counter-moves and danger<br/>\n&gt; zones, and hidden traps.<br/>\n&gt; <br/>\n&gt; And sadly, I notice the same conversational style in his children, my two<br/>\n&gt; step-children, who are 15 (girl) and 10 (boy).  The 15 yo attends public<br/>\n&gt; school.  She and her dad barely speak, and when they do, it is painful to<br/>\n&gt; listen to.<br/>\n&gt; <br/>\n&gt; Example:<br/>\n&gt; The other night, all of us were in the van, taking her to her dance<br/>\n&gt; classes.  We live in a rural area, and she takes four classes, on three<br/>\n&gt; different nights, in a town about 30 minutes away.  On this particular night<br/>\n&gt; of the week, we go to town and spend 3.5 hours or so while she dances.<br/>\n&gt; <br/>\n&gt; He started: &quot;Caitlin, do you have anything you want to say to me?&quot;<br/>\n&gt; I immediately tensed up.  I could feel her do the same.<br/>\n&gt; She said, hesitantly, and with a little edge to her voice, &quot;Like....what?&quot;<br/>\n&gt; <br/>\n&gt; &quot;Well,&quot; he said, &quot;I&#39;m about to spend three hours of my life so you can go<br/>\n&gt; dance.&quot; (In a certain way, he was jokey, but in another way, he was<br/>\n&gt; dead-serious.  I don&#39;t know how to describe the tone.)<br/>\n&gt; <br/>\n&gt; &quot;What do you want me to say?&quot; she said.  (This is a constant point of<br/>\n&gt; contention -- her mom signed her up for a bunch of different dance classes,<br/>\n&gt; and DH won&#39;t confront his ex about it; so he takes it out on Caitlin, that<br/>\n&gt; he has to be *inconvenienced*.)<br/>\n&gt; <br/>\n&gt; Then there was an interruption; I think our 10 yo asked what we&#39;re having<br/>\n&gt; for dinner.  We were going out to eat while she danced.<br/>\n&gt; <br/>\n&gt; Caitlin asked if we could get her a sub from Subway.<br/>\n&gt; <br/>\n&gt; DH said, &quot;You want me to bring it to you between your classes, I suppose?&quot;<br/>\n&gt; &quot;That&#39;d be nice,&quot; she said, kind of sounding annoyed (imagine the tone<br/>\n&gt; someone might use saying, &quot;Well, duh!&quot;)<br/>\n&gt; <br/>\n&gt; Then she asked if she could have a foot-long because she was really hungry.<br/>\n&gt; <br/>\n&gt; He said no.  She could have a six-inch.<br/>\n&gt; <br/>\n&gt; So then she launched into an argument about how it wasn&#39;t that much more<br/>\n&gt; expensive, and she was really hungry, etc.<br/>\n&gt; <br/>\n&gt; He said, &quot;I don&#39;t even get myself a foot-long, and I&#39;m not going to buy one<br/>\n&gt; for a 5-foot-nothing girl.&quot;<br/>\n&gt; <br/>\n&gt; &quot;Five-foot-one,&quot; she said, testy.<br/>\n&gt; <br/>\n&gt; Then there was silence for a second.<br/>\n&gt; <br/>\n&gt; He said, &quot;I&#39;ll get you a foot-long if you want to pay me the difference with<br/>\n&gt; your own money.&quot;  I tensed up again; this is another point of contention.<br/>\n&gt; Her money and earning.  It was like he threw that out there to start a<br/>\n&gt; fight.<br/>\n&gt; <br/>\n&gt; &quot;Yeah, like I have money.  You know I don&#39;t have extra money,&quot; she said.<br/>\n&gt; &quot;And payment for my trip is due this week.&quot; (She&#39;s working for her dad to<br/>\n&gt; earn a trip to D.C. with her class.)<br/>\n&gt; <br/>\n&gt; &quot;Do you have the money for it?&quot; he said (knowing full well she doesn&#39;t.)<br/>\n&gt; &quot;Nope.  It&#39;s not like I have the time to earn it,&quot; she said.<br/>\n&gt; <br/>\n&gt; This started off a whole long angry exchange.  He said she could have earned<br/>\n&gt; it if she had wanted to; she said she had a ton of dance activities and<br/>\n&gt; other school activities that interfered, etc.<br/>\n&gt; <br/>\n&gt; I was sitting in the front seat just wanting to die, escape, run away, tell<br/>\n&gt; them to shut up, something.<br/>\n&gt; <br/>\n&gt; She finally interrupted that whole earning conversation with, &quot;You know<br/>\n&gt; what, don&#39;t get me anything to eat.  I don&#39;t want anything.&quot;<br/>\n&gt; <br/>\n&gt; &quot;Oh, now you&#39;re going to do THAT,&quot; he said.<br/>\n&gt; <br/>\n&gt; &quot;What?&quot;  She said.  &quot;I&#39;m not hungry.  I had a lot to eat.&quot;<br/>\n&gt; <br/>\n&gt; &quot;Now you&#39;re gonna play Grandma,&quot; he said.  &quot;That&#39;s just what she does when<br/>\n&gt; she&#39;s mad.&quot;  (He meant his mom, who, as I said, is heavily involved in our<br/>\n&gt; lives, and they often have similar exchanges.)<br/>\n&gt; <br/>\n&gt; I finally jumped in and said, &quot;Caitlin, I have money, I&#39;ll get you a sub or<br/>\n&gt; whatever.  What do you want?&quot;<br/>\n&gt; <br/>\n&gt; I know I was undermining DH, but at that point I didn&#39;t care.<br/>\n&gt; <br/>\n&gt; He didn&#39;t say anything.<br/>\n&gt; <br/>\n&gt; She said, &quot;It&#39;s okay, don&#39;t worry about it.  Just get me a burger from<br/>\n&gt; McDonald&#39;s or something if you want.&quot;<br/>\n&gt; <br/>\n&gt; DH sighed heavily at this point, and said, &quot;Jeez, this was supposed to be a<br/>\n&gt; break, a nice time together.&quot;  (We had left the babies with his mom so he<br/>\n&gt; and I and the 10 yo could go out to eat while Caitlin was dancing.)<br/>\n&gt; <br/>\n&gt; I said, &quot;Well, it&#39;s not a nice time.  It&#39;s not peaceful, it&#39;s not relaxing.&quot;<br/>\n&gt; <br/>\n&gt; And DH, I&#39;m sure, was blaming Caitlin for *making* it not nice; and she was<br/>\n&gt; silently blaming him, and I just wanted to get away from all of it.<br/>\n&gt; <br/>\n&gt; He sighed again heavily, and it was all dropped.<br/>\n&gt; <br/>\n&gt; We ended up getting her a meal from McD&#39;s and dropped it back at her dance<br/>\n&gt; studio so she could eat between classes.  I wrote a bunch of sweet notes on<br/>\n&gt; the bag, like &quot;your dad loves you!&quot;  and &quot;Deb loves you!&quot; etc.<br/>\n&gt; <br/>\n&gt; Afterward, it was like nothing had happened: for them, this is a normal<br/>\n&gt; episode.  For me, it&#39;s horrific.  It destroys relationships.  It&#39;s awful.<br/>\n&gt; <br/>\n&gt; Sadly, I notice some pretty ugly interactions between the kids, toward us,<br/>\n&gt; toward each other, toward their baby siblings.  One of the most insidious is<br/>\n&gt; blaming, and then finding a way to *punish* the responsible party.<br/>\n&gt; <br/>\n&gt; It&#39;s pretty traditional, fairly common thinking, I think, to look for Who<br/>\n&gt; Done It, because that&#39;s the way our culture works.  We have to figure out<br/>\n&gt; the culprit so we can punish and shame them.  Maybe we don&#39;t think much of<br/>\n&gt; it, until we start becoming aware of how useless and relationship-destroying<br/>\n&gt; it is.  It doesn&#39;t usually help fix any problem; just allows one person to<br/>\n&gt; feel superior and powerful, usually at the cost of the other person&#39;s<br/>\n&gt; feelings.<br/>\n&gt; <br/>\n&gt; I&#39;ve become aware of in my own thinking is how often it is easy to assign<br/>\n&gt; blame.  I might get annoyed at the way the dishwasher was loaded (or<br/>\n&gt; something equally petty), and my first thought is, &quot;Who did this?&quot;<br/>\n&gt; <br/>\n&gt; Why do we want to assign blame?  So we can punish, whether with our words or<br/>\n&gt; actions or subtle body language (eye rolling, sighing, etc.).  I&#39;ve been<br/>\n&gt; working on it in myself.  But now that I&#39;m aware of my own issue with it,<br/>\n&gt; it&#39;s PAINFULLY obvious how often DH, his mother, and the kids do it.<br/>\n&gt; <br/>\n&gt; &quot;Who put this diaper on?&quot; (accusatory) &quot;It&#39;s falling off!&quot;<br/>\n&gt; <br/>\n&gt; &quot;Who was the last person in the bathroom?&quot;  &quot;The toilet paper roll is<br/>\n&gt; empty!&quot;<br/>\n&gt; <br/>\n&gt; &quot;Who forgot to lock the door?  It stayed unlocked all night!&quot;<br/>\n&gt; <br/>\n&gt; &quot;Who took my candy?  It&#39;s missing, so sissy must have taken it!&quot; (Later,<br/>\n&gt; turns out he just misplaced it.)<br/>\n&gt; <br/>\n&gt; It&#39;s one thing to want to change these types of things in oneself; and I do<br/>\n&gt; believe in being an example, but I just really wish we could all be in it<br/>\n&gt; together, in trying to repair relationships, build relationships, make<br/>\n&gt; kindness and safety the prevailing feelings in our house.  I really don&#39;t<br/>\n&gt; want the older kids absorbing any more of the toxicity; I want my husband&#39;s<br/>\n&gt; hurts to be repaired so he can feel better and stop bullying everyone; and I<br/>\n&gt; want my babies to grow up in a kind, safe environment.<br/>\n&gt; <br/>\n&gt; I am feeling pretty hopeless about repairing things.  Gotta go right now.<br/>\n&gt; Holding a baby and I need to tend to the other one.<br/>\n&gt; <br/>\n&gt; Can you guys help me?<br/>\n&gt; <br/>\n&gt; Oh, and I forgot to mention, my husband is self-employed; he runs a farmers<br/>\n&gt; market and restaurant business, growing things on our farm.  We are all here<br/>\n&gt; together, all the time, except the 15 yo who goes to school.  The business<br/>\n&gt; is pretty stressful for him; a lot of pressure to earn to let us have this<br/>\n&gt; lifestyle.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Deb<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Violent emotions, dangerous communication zones","postDate":"1285966705","msgId":44910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDJGQzI4NjczRTYyRi0xRDE4LTM4MTZAd2VibWFpbC1kMDQxLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PEFBTkxrVGluNC1OQU53cVZPYkttSlgxenNGb3MyVjIzNmRqNGNuZm4xSHk4WUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGluNC1OQU53cVZPYkttSlgxenNGb3MyVjIzNmRqNGNuZm4xSHk4WUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44909,"nextInTopic":44913,"prevInTime":44909,"nextInTime":44911,"topicId":44906,"numMessagesInTopic":0,"msgSnippet":"Where are you, Deb? ~Kelly Kelly Lovejoy There is no single effort more radical in its potential for saving the world than a transformation of the way we","messageBody":"<div id=\"ygrps-yiv-1546105515\">Where are you, Deb?<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Deborah McKee Kelly &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dlmckee@...\">dlmckee@...</a>&gt;<br/>\n<br/>\nMy DH and I are treading on some pretty rocky territory.  I wanted to run<br/>\nsome examples and concerns by you guys and see if you could offer some<br/>\nhelp.  This is affecting the unschooling environment, and my overall peace<br/>\nand sanity.<br/>\n<br/>\nI am feeling pretty hopeless about repairing things.  Gotta go right now.<br/>\nHolding a baby and I need to tend to the other one.<br/>\n<br/>\nCan you guys help me?<br/>\n<br/>\nOh, and I forgot to mention, my husband is self-employed; he runs a farmers<br/>\nmarket and restaurant business, growing things on our farm.  We are all here<br/>\ntogether, all the time, except the 15 yo who goes to school.  The business<br/>\nis pretty stressful for him; a lot of pressure to earn to let us have this<br/>\nlifestyle.<br/>\n<br/>\nThanks,<br/>\nDeb<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Violent emotions, dangerous communication zones","postDate":"1285959379","msgId":44909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NWFzaitla2o3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluNC1OQU53cVZPYkttSlgxenNGb3MyVjIzNmRqNGNuZm4xSHk4WUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44907,"nextInTopic":44910,"prevInTime":44908,"nextInTime":44910,"topicId":44906,"numMessagesInTopic":0,"msgSnippet":"... I think you re right on the money with all of that, including the part about feeling alone - you can only change you, not your husband or kids and that can","messageBody":"<div id=\"ygrps-yiv-1696629166\">Deborah McKee Kelly &lt;dlmckee@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I think if there&#39;s any *answer,*<br/>\n&gt; it&#39;s that I need to treat DH with the same empathy and respect and love and<br/>\n&gt; kindness that I&#39;m wanting to use with the kids.  I think he&#39;s coming from a<br/>\n&gt; place of many years of hurt.  But I feel very alone, here.<br/>\n<br/>\n </span></blockquote>I think you&#39;re right on the money with all of that, including the part about feeling alone - you can only change you, not your husband or kids and that can be pretty frustrating sometimes. It might also help you to look into this group, if you haven&#39;t yet, for &quot;unschooling&quot; one&#39;s adult partnerships (the list is pretty quiet, so jump in!):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://uk.groups.yahoo.com/group/unschoolingpartnerships/\">http://uk.groups.yahoo.com/group/unschoolingpartnerships/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; trying to undo some of the stuff he inflicts on the kids and me<br/>\n<br/>\n </span></blockquote>Something that goes hand in hand with empathy is stepping away from language like the above - rather than &quot;inflicting&quot; see him expressing his own pain and unhappiness in unskillful ways. He can&#39;t learn Better skills in the face of disapproval any more than kids can. <br/>\n<br/>\nWhen Ray (my stepson, George&#39;s son) was younger George had a lot of baggage that played out in their relationship together -mostly in terms of George being very bitter towards Ray and projecting a lot of his issues with his ex-wife onto his son. Ugly stuff. But getting between them didn&#39;t help very much, especially at first. At first, what George needed was a lot of reassurance that *I* knew he loved his son and was trying to be a good dad. There&#39;s a whole lot of cultural baggage tied up into ideas of the &quot;good dad&quot; - as many as there are with the &quot;good mom&quot;. George needed to know that he was appreciated - is it possible for you to find more ways to show appreciation to your husband? Even for things like &quot;being a good provider&quot; - that&#39;s part of the good dad baggage that effects a whooooole lot of men, so its well worth thanking your hard working man for all he does for the family. Its a lot!<br/>\n<br/>\nIt also helped to talk in a general way with George about what kind of person he liked to be and what kind of relationship he wanted with his son. That helped me find ways to be supportive that worked better for George. He didn&#39;t want to be &quot;the asshole&quot; as he put it, so I&#39;d let him know when I saw him doing things that were kind and thoughtful and gentle and patient - more appreciation. That helped him have confidence in his own ability as a parent, too - the worst for George was fearing to be &quot;the asshole&quot; but not knowing how to avoid it, so pointing out when he Wasn&#39;t an ass was doubly helpful - he could see what To do, rather than just what Not to do. <br/>\n<br/>\nBut none of that involved me saying &quot;this is how to do it&quot; (okay, maybe a little, but those attempts crashed and burned every time and I learned quickly not to do that!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Why do we want to assign blame?  So we can punish<br/>\n<br/>\n </span></blockquote>Here&#39;s a tool you might know already: assume positive intent. What if that&#39;s Not the core reason for assigning blame? What Else could it be? Assuming positive intent doesn&#39;t necessarily mean towards others, it could be egocentric. So assigning blame can be a defense mechanism  a way to diffuse a negative feeling. So there&#39;s a mess and maybe the first impulse is &quot;nobody loves me&quot; (old baggage)  that&#39;s too uncomfortable so it&#39;s displaced with anger and resentment. Defense mechanisms aren&#39;t necessarily the most skillful ways of handling situations, they&#39;re pretty primitive, but that&#39;s also what makes them hard to move past. You&#39;ve got to dig past anger to hurt and fear and powerlessness  Yikes!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I finally jumped in and said, &quot;Caitlin, I have money, I&#39;ll get you a sub or<br/>\n&gt; whatever.  What do you want?&quot;<br/>\n&gt; <br/>\n&gt; I know I was undermining DH, but at that point I didn&#39;t care.<br/>\n<br/>\n </span></blockquote>Heather&#39;s suggestion was a good one  to find a sweet way to make the offer of buying the sandwich yourself and make it sooner in the conversation. That&#39;s not to blame you! At first, this sort of process can leave you feeling blindsided in the moment, not knowing what to say until later. With practice, you&#39;ll get better, come up with ideas and options sooner, and gentler ways to present them. It&#39;s a learning process  let that be your mantra! You&#39;re learning  and they are too. The more ways you can find to be graceful and kind in tense moments the more options they&#39;ll have too, even if they can&#39;t &quot;access&quot; that right away. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; DH sighed heavily at this point, and said, &quot;Jeez, this was supposed to be a<br/>\n&gt; break, a nice time together.&quot;  (We had left the babies with his mom so he<br/>\n&gt; and I and the 10 yo could go out to eat while Caitlin was dancing.)<br/>\n&gt; <br/>\n&gt; I said, &quot;Well, it&#39;s not a nice time.  It&#39;s not peaceful, it&#39;s not relaxing.&quot;<br/>\n<br/>\n </span></blockquote>Next time try for &quot;We can still make it nice and have a good time.&quot; Depending on the situation you could add &quot;I love you&quot; or even just slide your hand up your husband&#39;s thigh  really, flirting is sometimes exactly the right thing to &quot;say&quot; to a man. Especially in a situation where you think he&#39;s feeling undercut by his ex-wife  validating his masculinity can help more than you&#39;d think. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I am feeling pretty hopeless about repairing things.<br/>\n<br/>\n </span></blockquote>You can&#39;t fix your husband and you can&#39;t repair His relationships with his children. The temptation to try is hard, but that&#39;s crazy-making. The best you can do is work on you, on your reactions and responses, so that you&#39;re providing another set of options. Its hard work! Something that might help is reading about the mechanics of dysfunction  part of dysfunction is trying to fix others! Happily, you can work on that.<br/>\n<br/>\nMaybe it would be good to grieve, too. That&#39;s something I&#39;ve done periodically, grieved for the loss of my &quot;ideal&quot; family. I can paint a pretty glamorous picture for myself of the perfect life but its just a story in my mind. When I can grieve and move on, I do better at handling the real challenges of my real life gracefully instead of resentfully. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":448267849,"authorName":"Heather B.","from":"&quot;Heather B.&quot; &lt;heather@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Violent emotions, dangerous communication zones","postDate":"1285946086","msgId":44907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NHR0Nis3dmR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluNC1OQU53cVZPYkttSlgxenNGb3MyVjIzNmRqNGNuZm4xSHk4WUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44906,"nextInTopic":44909,"prevInTime":44906,"nextInTime":44908,"topicId":44906,"numMessagesInTopic":0,"msgSnippet":"Deb, I haven t posted here in a long, long time.  But your story is a familiar one that I ve seen several times in my lifetime. You ve set the bar pretty high","messageBody":"<div id=\"ygrps-yiv-1226527600\">Deb,<br/>\n<br/>\nI haven&#39;t posted here in a long, long time.  But your story is a familiar one that I&#39;ve seen several times in my lifetime.<br/>\n<br/>\nYou&#39;ve set the bar pretty high for yourself and that&#39;s probably OK, but you&#39;ve set the bar even higher for the people around you and that&#39;s not OK.  You cannot expect the people around you to change just because you&#39;ve discovered something peaceful and wonderful and decided to change your own interactions with people.  It seems you&#39;ve have a vision and you want it *now*.  I know that feeling.  :-)  Unfortunately, things take time, sometimes a long time.  <br/>\n<br/>\nYou&#39;re right about blame, it doesn&#39;t solve anything at all.  Finding the person who &quot;did it&quot; doesn&#39;t make anyone feel any better.  For me, I realize that  it&#39;s &quot;my issue&quot;.  No one else cares how the dishwasher is loaded, just me.  If it&#39;s enough to bother me I might rearrange a bit in order to fit more dishes.  If the toilet paper roll is empty, I replace the toilet paper.  If the door stays unlocked at night several times, I might start adding that to my bedtime routine.  These are my issues if I am the only one that cares.  <br/>\n<br/>\nThe same goes for your interactions with people.  It&#39;s your issue.  You be the change you want to see.  It isn&#39;t helping to expect the same out of everyone else.  In my home I treat my husband no differently then my children.  I give him the same trust, respect, and space to be who he is.  He is not me.<br/>\n<br/>\nThe snarky car conversation could have been different too.  Maybe upon realizing he was irritated for driving, I would have said, &quot;thanks for driving us and don&#39;t sweat it I&#39;ve got a few bucks&quot;, kissed him on the cheek and hopped out of the car.  Possibly interrupting the whole hostile conversation.  Kindness is catchy, and I think the very best way to inspire kindness is to be kind to the people around you.  <br/>\n<br/>\nI&#39;m sure you will get lots of other wonderful answers here but I hope this helps with a different perspective.  :-)<br/>\n<br/>\nHeather<br/>\nwww.swissarmywife.net<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Deborah McKee Kelly &lt;dlmckee@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My DH and I are treading on some pretty rocky territory.  I wanted to run some examples and concerns by you guys and see if you could offer some help.  This is affecting the unschooling environment, and my overall peace and sanity.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":240838916,"authorName":"Deborah McKee Kelly","from":"Deborah McKee Kelly &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Violent emotions, dangerous communication zones","postDate":"1285340434","msgId":44906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluNC1OQU53cVZPYkttSlgxenNGb3MyVjIzNmRqNGNuZm4xSHk4WUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":44907,"prevInTime":44905,"nextInTime":44907,"topicId":44906,"numMessagesInTopic":0,"msgSnippet":"My DH and I are treading on some pretty rocky territory.  I wanted to run some examples and concerns by you guys and see if you could offer some help.  This is","messageBody":"<div id=\"ygrps-yiv-723136657\">My DH and I are treading on some pretty rocky territory.  I wanted to run<br/>\nsome examples and concerns by you guys and see if you could offer some<br/>\nhelp.  This is affecting the unschooling environment, and my overall peace<br/>\nand sanity.<br/>\n<br/>\nJust to start, I&#39;ve been reading several books for the past year or so, on<br/>\nunschooling and compassionate parenting.  I&#39;ve read several John Holt books,<br/>\nand I&#39;ve also gotten into the work of Marshall Rosenberg on non-violent<br/>\ncommunication.  I&#39;ve also been on the unschooling groups like this one,<br/>\nworked through a lot of Sandra Dodd&#39;s stuff, and have been trying to<br/>\nimplement a lot of these ideas in my own interactions with the kids -- less<br/>\nso with my DH, but I realize that could be helpful (empathy for him,<br/>\nlistening without judging, etc.)<br/>\n<br/>\nThe more I work on my unschooling  and peaceful parenting, the more aware I<br/>\nbecome of how far away my DH is on these same matters.<br/>\n<br/>\nI had hoped that reading all these things and looking for help would make it<br/>\neasier, but in many ways, I feel like I&#39;m becoming more frustrated.<br/>\n<br/>\nI&#39;ve been reading all these books and forums, and finding all these new ways<br/>\nof thinking and being aware of my parenting, and it&#39;s making me more angry<br/>\nthan ever about the ways DH is interacting with me and with our babies.  I&#39;m<br/>\nnot saying I&#39;ve got it all figured out; and I think if there&#39;s any *answer,*<br/>\nit&#39;s that I need to treat DH with the same empathy and respect and love and<br/>\nkindness that I&#39;m wanting to use with the kids.  I think he&#39;s coming from a<br/>\nplace of many years of hurt.  But I feel very alone, here.  I feel like I&#39;m<br/>\ndoing so much work on my own, without any support from DH, and in fact,<br/>\ntrying to undo some of the stuff he inflicts on the kids and me.<br/>\n<br/>\nWe have DH&#39;s two older kids (15 yo girl and 10 yo boy) and our two babies,<br/>\nan 18 month old girl and a 4 month old girl.  I homeschool the 10 yo; the 15<br/>\nyo goes to public school.<br/>\n<br/>\nLike most of us, DH was raised with traditional parenting, except in his<br/>\ncase, I think it was something like permissive neglect, almost, with heavy<br/>\ndoses of guilt, shame, blame, and manipulation thrown in.  There was very<br/>\nlittle to no affection in his family.  His mom, who is still pretty heavily<br/>\ninvolved in our lives, uses a mixture of avoidance, sarcasm, blame, shame,<br/>\nand promised material rewards to get other people, mostly her grandchildren<br/>\nand us, to do what she wants.<br/>\n<br/>\nI was making some notes the other day while reading one of Marshall<br/>\nRosenberg&#39;s books on compassionate parenting, and I realized I&#39;m afraid to<br/>\ntalk with DH about some of the things I&#39;m reading and learning.  I even<br/>\nwrote out a possible script for how a conversation might go, with me being<br/>\nreally empathetic to DH&#39;s potential comments.<br/>\n<br/>\nI realized while I was doing it that I am afraid of communicating with him<br/>\nabout anything of substance.  I started to realize that our conversations<br/>\ntypically follow some pretty violent paths, and that I don&#39;t know how to<br/>\nspeak with him without fearing a blow-up.  I tend to avoid conflict, and<br/>\nback down.  He tends to lob verbal bombs that hurt pretty bad, or he *jokes*<br/>\nin a harsh, put-down way; I feel our conversations have become a war-zone.<br/>\nThat&#39;s one analogy I can think of.  I was thinking, as I wrote out that<br/>\nscript of possible conversation *moves,* it was like playing a really<br/>\nstressful game of chess, trying to anticipate counter-moves and danger<br/>\nzones, and hidden traps.<br/>\n<br/>\nAnd sadly, I notice the same conversational style in his children, my two<br/>\nstep-children, who are 15 (girl) and 10 (boy).  The 15 yo attends public<br/>\nschool.  She and her dad barely speak, and when they do, it is painful to<br/>\nlisten to.<br/>\n<br/>\nExample:<br/>\nThe other night, all of us were in the van, taking her to her dance<br/>\nclasses.  We live in a rural area, and she takes four classes, on three<br/>\ndifferent nights, in a town about 30 minutes away.  On this particular night<br/>\nof the week, we go to town and spend 3.5 hours or so while she dances.<br/>\n<br/>\nHe started: &quot;Caitlin, do you have anything you want to say to me?&quot;<br/>\nI immediately tensed up.  I could feel her do the same.<br/>\nShe said, hesitantly, and with a little edge to her voice, &quot;Like....what?&quot;<br/>\n<br/>\n&quot;Well,&quot; he said, &quot;I&#39;m about to spend three hours of my life so you can go<br/>\ndance.&quot; (In a certain way, he was jokey, but in another way, he was<br/>\ndead-serious.  I don&#39;t know how to describe the tone.)<br/>\n<br/>\n&quot;What do you want me to say?&quot; she said.  (This is a constant point of<br/>\ncontention -- her mom signed her up for a bunch of different dance classes,<br/>\nand DH won&#39;t confront his ex about it; so he takes it out on Caitlin, that<br/>\nhe has to be *inconvenienced*.)<br/>\n<br/>\nThen there was an interruption; I think our 10 yo asked what we&#39;re having<br/>\nfor dinner.  We were going out to eat while she danced.<br/>\n<br/>\nCaitlin asked if we could get her a sub from Subway.<br/>\n<br/>\nDH said, &quot;You want me to bring it to you between your classes, I suppose?&quot;<br/>\n&quot;That&#39;d be nice,&quot; she said, kind of sounding annoyed (imagine the tone<br/>\nsomeone might use saying, &quot;Well, duh!&quot;)<br/>\n<br/>\nThen she asked if she could have a foot-long because she was really hungry.<br/>\n<br/>\nHe said no.  She could have a six-inch.<br/>\n<br/>\nSo then she launched into an argument about how it wasn&#39;t that much more<br/>\nexpensive, and she was really hungry, etc.<br/>\n<br/>\nHe said, &quot;I don&#39;t even get myself a foot-long, and I&#39;m not going to buy one<br/>\nfor a 5-foot-nothing girl.&quot;<br/>\n<br/>\n&quot;Five-foot-one,&quot; she said, testy.<br/>\n<br/>\nThen there was silence for a second.<br/>\n<br/>\nHe said, &quot;I&#39;ll get you a foot-long if you want to pay me the difference with<br/>\nyour own money.&quot;  I tensed up again; this is another point of contention.<br/>\nHer money and earning.  It was like he threw that out there to start a<br/>\nfight.<br/>\n<br/>\n&quot;Yeah, like I have money.  You know I don&#39;t have extra money,&quot; she said.<br/>\n&quot;And payment for my trip is due this week.&quot; (She&#39;s working for her dad to<br/>\nearn a trip to D.C. with her class.)<br/>\n<br/>\n&quot;Do you have the money for it?&quot; he said (knowing full well she doesn&#39;t.)<br/>\n&quot;Nope.  It&#39;s not like I have the time to earn it,&quot; she said.<br/>\n<br/>\nThis started off a whole long angry exchange.  He said she could have earned<br/>\nit if she had wanted to; she said she had a ton of dance activities and<br/>\nother school activities that interfered, etc.<br/>\n<br/>\nI was sitting in the front seat just wanting to die, escape, run away, tell<br/>\nthem to shut up, something.<br/>\n<br/>\nShe finally interrupted that whole earning conversation with, &quot;You know<br/>\nwhat, don&#39;t get me anything to eat.  I don&#39;t want anything.&quot;<br/>\n<br/>\n&quot;Oh, now you&#39;re going to do THAT,&quot; he said.<br/>\n<br/>\n&quot;What?&quot;  She said.  &quot;I&#39;m not hungry.  I had a lot to eat.&quot;<br/>\n<br/>\n&quot;Now you&#39;re gonna play Grandma,&quot; he said.  &quot;That&#39;s just what she does when<br/>\nshe&#39;s mad.&quot;  (He meant his mom, who, as I said, is heavily involved in our<br/>\nlives, and they often have similar exchanges.)<br/>\n<br/>\nI finally jumped in and said, &quot;Caitlin, I have money, I&#39;ll get you a sub or<br/>\nwhatever.  What do you want?&quot;<br/>\n<br/>\nI know I was undermining DH, but at that point I didn&#39;t care.<br/>\n<br/>\nHe didn&#39;t say anything.<br/>\n<br/>\nShe said, &quot;It&#39;s okay, don&#39;t worry about it.  Just get me a burger from<br/>\nMcDonald&#39;s or something if you want.&quot;<br/>\n<br/>\nDH sighed heavily at this point, and said, &quot;Jeez, this was supposed to be a<br/>\nbreak, a nice time together.&quot;  (We had left the babies with his mom so he<br/>\nand I and the 10 yo could go out to eat while Caitlin was dancing.)<br/>\n<br/>\nI said, &quot;Well, it&#39;s not a nice time.  It&#39;s not peaceful, it&#39;s not relaxing.&quot;<br/>\n<br/>\nAnd DH, I&#39;m sure, was blaming Caitlin for *making* it not nice; and she was<br/>\nsilently blaming him, and I just wanted to get away from all of it.<br/>\n<br/>\nHe sighed again heavily, and it was all dropped.<br/>\n<br/>\nWe ended up getting her a meal from McD&#39;s and dropped it back at her dance<br/>\nstudio so she could eat between classes.  I wrote a bunch of sweet notes on<br/>\nthe bag, like &quot;your dad loves you!&quot;  and &quot;Deb loves you!&quot; etc.<br/>\n<br/>\nAfterward, it was like nothing had happened: for them, this is a normal<br/>\nepisode.  For me, it&#39;s horrific.  It destroys relationships.  It&#39;s awful.<br/>\n<br/>\nSadly, I notice some pretty ugly interactions between the kids, toward us,<br/>\ntoward each other, toward their baby siblings.  One of the most insidious is<br/>\nblaming, and then finding a way to *punish* the responsible party.<br/>\n<br/>\nIt&#39;s pretty traditional, fairly common thinking, I think, to look for Who<br/>\nDone It, because that&#39;s the way our culture works.  We have to figure out<br/>\nthe culprit so we can punish and shame them.  Maybe we don&#39;t think much of<br/>\nit, until we start becoming aware of how useless and relationship-destroying<br/>\nit is.  It doesn&#39;t usually help fix any problem; just allows one person to<br/>\nfeel superior and powerful, usually at the cost of the other person&#39;s<br/>\nfeelings.<br/>\n<br/>\nI&#39;ve become aware of in my own thinking is how often it is easy to assign<br/>\nblame.  I might get annoyed at the way the dishwasher was loaded (or<br/>\nsomething equally petty), and my first thought is, &quot;Who did this?&quot;<br/>\n<br/>\nWhy do we want to assign blame?  So we can punish, whether with our words or<br/>\nactions or subtle body language (eye rolling, sighing, etc.).  I&#39;ve been<br/>\nworking on it in myself.  But now that I&#39;m aware of my own issue with it,<br/>\nit&#39;s PAINFULLY obvious how often DH, his mother, and the kids do it.<br/>\n<br/>\n&quot;Who put this diaper on?&quot; (accusatory) &quot;It&#39;s falling off!&quot;<br/>\n<br/>\n&quot;Who was the last person in the bathroom?&quot;  &quot;The toilet paper roll is<br/>\nempty!&quot;<br/>\n<br/>\n&quot;Who forgot to lock the door?  It stayed unlocked all night!&quot;<br/>\n<br/>\n&quot;Who took my candy?  It&#39;s missing, so sissy must have taken it!&quot; (Later,<br/>\nturns out he just misplaced it.)<br/>\n<br/>\nIt&#39;s one thing to want to change these types of things in oneself; and I do<br/>\nbelieve in being an example, but I just really wish we could all be in it<br/>\ntogether, in trying to repair relationships, build relationships, make<br/>\nkindness and safety the prevailing feelings in our house.  I really don&#39;t<br/>\nwant the older kids absorbing any more of the toxicity; I want my husband&#39;s<br/>\nhurts to be repaired so he can feel better and stop bullying everyone; and I<br/>\nwant my babies to grow up in a kind, safe environment.<br/>\n<br/>\nI am feeling pretty hopeless about repairing things.  Gotta go right now.<br/>\nHolding a baby and I need to tend to the other one.<br/>\n<br/>\nCan you guys help me?<br/>\n<br/>\nOh, and I forgot to mention, my husband is self-employed; he runs a farmers<br/>\nmarket and restaurant business, growing things on our farm.  We are all here<br/>\ntogether, all the time, except the 15 yo who goes to school.  The business<br/>\nis pretty stressful for him; a lot of pressure to earn to let us have this<br/>\nlifestyle.<br/>\n<br/>\nThanks,<br/>\nDeb<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44898,"nextTopicId":44843}}