{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":183015595,"authorName":"Mother Earth (Tyra)","from":"&quot;Mother Earth &#92;(Tyra&#92;)&quot; &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtimes & Meal Times","postDate":"1132427681","msgId":7811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzYwMWM1ZWQzZCQ3ZWYxZjAyMCQ2YTAwYThjMEBjb21wdXRlcj4=","referencesHeader":"PEJBWTE4LUYyMjU4MkQxMkY1NkZDRkE1QUU1QkY2RDA1RTBAcGh4LmdibD4="},"prevInTopic":7807,"nextInTopic":0,"prevInTime":7810,"nextInTime":7812,"topicId":7798,"numMessagesInTopic":0,"msgSnippet":"Hello Ellen, As my children are young, 5 and 2 yrs respectively, I don t insist that my children go to sleep but I do tell them when it is getting late that it","messageBody":"<div id=\"ygrps-yiv-17618072\">Hello Ellen,<br/>\n<br/>\nAs my children are young, 5 and 2 yrs respectively, I don&#39;t insist that my children go to sleep but I do tell them when it is getting late that it is quiet time and that they need to do quiet things.  After a certain point, my boys loud and rowdy play is too much for me and I need quiet time and time for myself.  So while I don&#39;t have a bedtime, there is a quiet time that usually starts around 8:30 am.  They usually pass out pretty quickly, though.<br/>\n<br/>\nAs for meal times we are pretty loose. Actually, I have always been that way with them because they have never wanted to eat when I am ready.  Sometimes I prepare what I eat and put some out for them and they may or may not eat it then or later.  Sometimes I ask what my older son wants since he is most selective in his tastes.  One regular meal time is when my husband gets home but that is a ritual that was started by the children not me.  During that time I steal away and happily spend time with myself.<br/>\n<br/>\nFor me all of this has evolved not because I don&#39;t like routines, because I do, but because it is the path of least resistance and everyone seems happier.<br/>\n<br/>\nBest wishes to you and yours!<br/>\n<br/>\nTyra<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Ellen Oberlin <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> ; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Unschooling@yahoogroups.com\">HEM-Unschooling@yahoogroups.com</a> <br/>\n  Sent: Friday, November 18, 2005 9:28 AM<br/>\n  Subject: [unschoolingbasics] Bedtimes & Meal Times<br/>\n<br/>\n<br/>\n  Hi All,<br/>\n<br/>\n    How do you work it with meal times and bed <br/>\n  times?  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Bedtimes & Meal Times","postDate":"1132417129","msgId":7807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRsbmo5OStmZmg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTE4LUYyMjU4MkQxMkY1NkZDRkE1QUU1QkY2RDA1RTBAcGh4LmdibD4="},"prevInTopic":7801,"nextInTopic":7811,"prevInTime":7806,"nextInTime":7808,"topicId":7798,"numMessagesInTopic":0,"msgSnippet":"How did we go from bedtimes when DS was littler to no set bedtimes when he was about 5? I started to head up to bed one evening and DS said But I want to","messageBody":"<div id=\"ygrps-yiv-1445531322\">How did we go from bedtimes when DS was littler to no set bedtimes <br/>\nwhen he was about 5? I started to head up to bed one evening and DS <br/>\nsaid &quot;But I want to watch...It&#39;s two episodes back to back tonight&quot; <br/>\nAnd I said OK, just turn off the TV and lights when you come up. <br/>\nThat night and a couple nights thereafter he stayed up late. Now we <br/>\nall generally head upstairs at the same time - but we don&#39;t all <br/>\nnecessarily go to sleep right away - we may read, watch a movie or <br/>\nTV, Dh and DS might play a game on their laptops, etc. Eventually we <br/>\nall go to sleep - me first typically because I need to get up in the <br/>\nmorning (I head out to work). DS may snuggle a bit then go back to <br/>\nplaying or whatever or he may just fall asleep. <br/>\n<br/>\nAs far as food, if there is a food we know DS likes, we keep lots of <br/>\nit around so that it need not be &#39;off limits&#39; because we want it for <br/>\na meal plan. And too if we&#39;re grating cheese for tacos (for example) <br/>\nand he starts nibbling the cheese, fine - consider it an appetizer <br/>\ncourse. Lots of mix and match meals - cook the pasta then put the <br/>\nsauce, cheeses, etc separately for each person to choose how to top <br/>\ntheir pasta. If there is something that just needs to be used for a <br/>\nmeal (for example, if we have mozzarella specifically for DH&#39;s <br/>\nwonderful lasagna) we&#39;ll try to (a) have plenty so taking a handful <br/>\nor a couple slices is no big deal (b) we provide an alternative - <br/>\nsay, cheddar and crackers, while the lasagna is being prepared and <br/>\ncooked.<br/>\n<br/>\nOne big thing to consider is that the &#39;family dinnertime&#39; is touted <br/>\nas critical because in most families, they haven&#39;t seen each other <br/>\nsince the crack of dawn - they grab a quick breakfast (or not) and <br/>\nhead out the door to school and work. They get home mid to late <br/>\nafternoon and then -dinner-. It&#39;s a big deal to reconnect. For an <br/>\nunschooling family, there&#39;s less of that disconnect - most of the <br/>\nfamily is gathered most of the day, weaving in and out of each <br/>\nother&#39;s activities. DH generally has dinner about ready when I get <br/>\nhome (he&#39;s the at home parent). DS and I and DH will finish prep and <br/>\nset the table and all together and chat a bit. Then when dinner is <br/>\nready we eat. Sometimes DS sits at the table with us, sometimes he <br/>\ntakes it to a stack table in the living room to finish watching <br/>\nsomething he was in the middle of - in which case, DH and I get a <br/>\nnice quiet dinner for two. It&#39;s not an either/or situation - those <br/>\nwho want to be at the table can be and those who prefer to eat <br/>\nlater, eat something different, eat elsewhere, can do that. Making <br/>\nit a cozy family time is more important than where everyone eats or <br/>\neven whether anyone eats - some nights DS isn&#39;t hungry, some nights <br/>\nI&#39;m not all that hungry so I just nibble a bit and sit and talk with <br/>\nDH and DS.<br/>\n<br/>\nI&#39;m not sure what you mean &quot;prepare meals as such&quot; - we prepare <br/>\nmeals but that doesn&#39;t mean that no one can eat this or that - it <br/>\njust means we might need to find alternatives - maybe having cheese <br/>\nand crackers for dinner with assorted fruits and nuts and what not <br/>\n(very light, casual) supercedes having tacos with grated cheddar or <br/>\nit may mean that instead of pizza with mozzarella we use ricotta and <br/>\ncheddar and parmesan and eat the mozzarella some other time. It may <br/>\nmean setting crudite on the table to munch at will rather than <br/>\ntossing ALL the carrots and celery into the soup.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":196090915,"authorName":"jnjstau@direcway.com","from":"jnjstau@...","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtimes & Meal Times","postDate":"1132409000","msgId":7801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMTg3ZTgxNDllMS44MTQ5ZTE4MTE4N2VAZGlyZWN3YXkuY29tPg=="},"prevInTopic":7800,"nextInTopic":7807,"prevInTime":7800,"nextInTime":7802,"topicId":7798,"numMessagesInTopic":0,"msgSnippet":" I would just keep doing what you are doing but also keep in mind to say yes to the kids as much as you","messageBody":"<div id=\"ygrps-yiv-1519396768\">&lt;&lt;How do you work it with meals and bedtimes?&gt;&gt;<br/>\n<br/>\nI would just keep doing what you are doing but also keep in mind to say &quot;yes&quot; to the kids as much as you possibly can.  When a kid asks if they can stay up because they want to finish a chapter they are reading, say &quot;no problem&quot;.  When a kid asks to eat in the living room so they can watch a tv show, try to figure out a way so that you will be comfortable with the possibility of spilled chili on your sofa and say &quot;sure&quot;.  When someone says they aren&#39;t hungry at mealtime, let them know the leftovers will be in the fridge if they get hungry.<br/>\n<br/>\nEase into it.  Don&#39;t make a big deal out of it.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Ellen Oberlin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ellenoberlin@...\">ellenoberlin@...</a>&gt;<br/>\nDate: Friday, November 18, 2005 9:28 am<br/>\nSubject: [unschoolingbasics] Bedtimes & Meal Times<br/>\n<br/>\n&gt; Hi All,<br/>\n&gt; <br/>\n&gt; I am starting to unschool again after about 1-1/2 years of too <br/>\n&gt; much <br/>\n&gt; structure.  I guess I got scared for a while there.  It occured to <br/>\n&gt; me <br/>\n&gt; yesterday that since we weren&#39;t starting &quot;lessons&quot; at a certaine <br/>\n&gt; time in the <br/>\n&gt; morning I didn&#39;t really see a point to a certain bedtime.  <br/>\n&gt; Wouldn&#39;t it be <br/>\n&gt; better to let the children learn to go to bed when they were <br/>\n&gt; tired?  I have <br/>\n&gt; decided to try this as I want them to be able to honor their own <br/>\n&gt; needs and <br/>\n&gt; so by over-riding them I certainly wasn&#39;t teaching that.  Funny <br/>\n&gt; how I have <br/>\n&gt; had to learn to honor mine to a greater degree first huh?  Well, <br/>\n&gt; then I <br/>\n&gt; thought about meal times too.  How do you work it with meal times <br/>\n&gt; and bed <br/>\n&gt; times?  I would like to be able to be flexible so that people in <br/>\n&gt; our family <br/>\n&gt; can eat and sleep when they feel the need.  But, I also enjoy <br/>\n&gt; eating as a <br/>\n&gt; family.  In addition what about the nitty gritty about eating out <br/>\n&gt; of stuff I <br/>\n&gt; have prepared for certain meals?  Do you just not prepare meals as <br/>\n&gt; such?<br/>\n&gt; How do you work this?  I haven&#39;t worked these questions out and am <br/>\n&gt; seeking <br/>\n&gt; counsel from those who have been there, done that.<br/>\n&gt; <br/>\n&gt; Looking forward to your ideas,<br/>\n&gt; Ellen<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------ Yahoo! Groups Sponsor --------------------<br/>\n&gt; ~--&gt; <br/>\n&gt; AIDS in India: A &quot;lurking bomb.&quot; Click and help stop AIDS now.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/VpTY2A/lzNLAA/yQLSAA/0xXolB/TM\">http://us.click.yahoo.com/VpTY2A/lzNLAA/yQLSAA/0xXolB/TM</a><br/>\n&gt; -------------------------------------------------------------------<br/>\n&gt; -~-&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Bedtimes & Meal Times","postDate":"1132381800","msgId":7800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEJBWTE4LUYyMjU4MkQxMkY1NkZDRkE1QUU1QkY2RDA1RTBAcGh4LmdibD4="},"prevInTopic":7799,"nextInTopic":7801,"prevInTime":7799,"nextInTime":7801,"topicId":7798,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-133695487\">&lt;&lt;&lt;&lt; How do you work it with meal times and bed <br/>\ntimes?  I would like to be able to be flexible so that people in our family <br/>\ncan eat and sleep when they feel the need.  But, I also enjoy eating as a <br/>\nfamily.  In addition what about the nitty gritty about eating out of stuff I<br/>\n<br/>\nhave prepared for certain meals?  Do you just not prepare meals as such?<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>With our sleep schedule, and dh&#39;s continually changing work schedule (at<br/>\nwhich jobs he is generally also fed) we have evolved to a place where we<br/>\ndon&#39;t sit down together as often as we used to. One thing that has meant is<br/>\nthat every time we do sit down at the table for a meal it is special and<br/>\nwonderful. These relatively formal meals also tend to occur on days when dh<br/>\nis *not* working, since we can make a more definite plan to eat at a<br/>\nparticular time. When he is at work we have no surety that he will be home<br/>\nat any hour. We still spend a lot time eating at the same times, but<br/>\nsometimes in different rooms. We eat when we are hungry, and in relation to<br/>\nwhen we got out of bed, rather than the clock. <br/>\n<br/>\nWe seem to be finding that breakfast, on the days that dh is not leaving<br/>\nearly, are working out as good together meals. TBH my dh usually has his<br/>\nbreakfast in bed, and Jayn and I eat with him and have giggles and fun.<br/>\n<br/>\nPart of it is architecture. Our table that should be for dining is generally<br/>\ncovered with ongoing stuff, and we only have two rooms. I think if we had a<br/>\nmore traditional dining room or kitchen nook allocated mostly to the eating<br/>\nfunction it would be easier to all eat together. As things stand it is more<br/>\nwork to clear the table (including finding somewhere to put the works in<br/>\nprogress that are situated there) than it is to cook!<br/>\n<br/>\nSo we end up being very casual on the sofa (and floor) with our folding<br/>\nmulti-task tables (As Seen on TV and really very sturdy). James tends to<br/>\nhang in the bedroom mostly because it is more comfortable for him and he<br/>\ngets to avoid Jayn&#39;s tv shows and watch his own preferences.<br/>\n<br/>\nI feel like I am constantly preparing small snacks these days, which I don&#39;t<br/>\nmind at all. Jayn is a person who likes to eat a lot of one food at each<br/>\nmeal or snack time, but her caloric intake varies widely day by day or<br/>\ndepending on growth spurts. Last night at 1am Jayn asked for broccoflower<br/>\n(green cauliflower) so I quickly steamed the head I had and she ate at least<br/>\nhalf of it, dipped in soy sauce. This was her pre-sleep snack.<br/>\n<br/>\nI almost always have sandwich fixings ready to go; Jayn will want a grilled<br/>\ncheese or ham, whilst dh will like something more fancy like a BLT or<br/>\nleftover steak with pickles and lettuce. I usually have cooked pasta ready<br/>\nto be sauced also for quick meals for Jayn and myself. I often have cooked<br/>\nrice in the fridge ready to be made into fried rice.<br/>\n<br/>\nI may be in the process of cooking a meal and Jayn is walking around with<br/>\nthe bag of jerky or cookies. I have just let go of any ideas about &quot;spoiled<br/>\nappetites&quot; or the idea that my &quot;work&quot; of cooking is being wasted or<br/>\nunappreciated. I get plenty of appreciation for getting all the baking stuff<br/>\ntogether and helping Jayn make cookies or cupcakes. <br/>\n<br/>\nTonight I cooked a steak for dh and Jayn to share, with mashed potatoes,<br/>\nsautéed green beans and the leftover broccoflower. We ate at about 8.30 pm.<br/>\nI was just not hungry so a little bit of potatoes and beans was plenty for<br/>\nme sitting at my computer at the table in the living room. Dh ate a full<br/>\nmeal in the bedroom at his computer, and Jayn had a tiny bit of meat and<br/>\ngreens and a lot of mashed potato sitting at her own table watching a tv<br/>\nshow in the living room. But that was the closest to a full meal for three<br/>\nat once that I have cooked in three days due to various other commitments<br/>\nand time schisms. <br/>\n<br/>\nProbably we will all eat something else light shortly before sleeping. That<br/>\nwill probably include a popsicle for dh. Jayn is having some yoghurt even as<br/>\nI write at 10pm, and will probably ask for a corn dog or mac and cheese<br/>\nlater. She also fills up on milk in the evenings. I will probably have an<br/>\napple, or some strawberries and whipped topping or some crackers if I feel<br/>\nhungry again. <br/>\n<br/>\nWe all seem to thrive reasonably well in this fluid manner, which is also<br/>\ncyclic. It may not suit every family. However one of the joys of Unschooling<br/>\nis that we are free to create our own rituals and family customs, without<br/>\nfeeling obligated to convention or external time schedules or fearing the<br/>\nreprobation of society for living in an odd manner. <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.362 / Virus Database: 267.13.4/175 - Release Date: 11/18/2005</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtimes & Meal Times","postDate":"1132379386","msgId":7799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFDMzc1QUE0LTk5RDQtNDQ3OC1BN0M3LUNDQzRBN0FFRjM1REBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PEJBWTE4LUYyMjU4MkQxMkY1NkZDRkE1QUU1QkY2RDA1RTBAcGh4LmdibD4=","referencesHeader":"PEJBWTE4LUYyMjU4MkQxMkY1NkZDRkE1QUU1QkY2RDA1RTBAcGh4LmdibD4="},"prevInTopic":7798,"nextInTopic":7800,"prevInTime":7798,"nextInTime":7800,"topicId":7798,"numMessagesInTopic":0,"msgSnippet":"... Do others also enjoy eating as a family? If so, they ll come and sit and talk, whether they eat or not. One of my kids gets so hungry she s shaky and","messageBody":"<div id=\"ygrps-yiv-1246816718\">On Nov 18, 2005, at 7:28 AM, Ellen Oberlin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But, I also enjoy eating as a<br/>\n&gt; family.  In addition what about the nitty gritty about eating out  <br/>\n&gt; of stuff I<br/>\n&gt; have prepared for certain meals?  Do you just not prepare meals as  <br/>\n&gt; such?<br/>\n<br/>\n </span></blockquote>Do others also enjoy eating as a family? If so, they&#39;ll come and sit  <br/>\nand talk, whether they eat or not.<br/>\n<br/>\nOne of my kids gets so hungry she&#39;s shaky and sometimes even feels  <br/>\nfaint. When she needs to eat she needs to eat right NOW. I think the  <br/>\nsmell of food being prepared brings this on, too, so very often I&#39;ll  <br/>\nbe making dinner and she&#39;ll come into the kitchen and need to eat. So  <br/>\n- here we are, 20 minutes from a nice meal on the table, and she&#39;s  <br/>\nmicrowaving a hot pocket or French bread pizza. Its okay - she&#39;ll eat  <br/>\nnow and when we sit down to eat together, she might just have some  <br/>\nsalad or maybe even not having anything. But she&#39;ll be fed and happy  <br/>\n- not weak and cranky.<br/>\n<br/>\nWe eat as a family a time or two per week. Used to be more often, but  <br/>\nmy kids are busy with sports, theater, college, jobs, etc. Still - it  <br/>\nIS nice when it happens. I don&#39;t cook often, anymore, either. We eat  <br/>\nout a lot - Subway is our home away from home. Today we all ate  <br/>\ntogether at Subway after seeing Harry Potter movie. And when I do  <br/>\ncook, we divide up the leftovers into serving-size containers and use  <br/>\nthe microwave to heat them up later.<br/>\n<br/>\nJust make it okay for people to eat whatever they want to eat. Make  <br/>\nit your goal to provide enough good food choices that they&#39;re happily  <br/>\neating when hungry. Sometimes they&#39;ll eat together at the table -  <br/>\nsometimes not. You won&#39;t know if THEY like family meals unless they  <br/>\nhave the freedom to NOT participate.<br/>\n<br/>\nBedtimes? When the kids were little I could tell when they were  <br/>\nlikely to be ready to fall asleep. I&#39;d call them into the bedroom  <br/>\n(the big waterbed in our room) and we&#39;d lower the lights and put on a  <br/>\ntape (Jim Weiss, often) and we&#39;d snuggle up and half the time we&#39;d  <br/>\nall fall asleep &lt;G&gt;. Sometimes I&#39;d just lower the lights in the  <br/>\nliving room and put a video on that the kids had watched many times  <br/>\nbefore - something soothing. They&#39;d just fall asleep all over the  <br/>\nplace and we&#39;d put them in bed later or just cover them up where  <br/>\nthey&#39;d fallen asleep.<br/>\n<br/>\nSo - no saying, &quot;It is bedtime,&quot; but lots of times saying, &quot;Let&#39;s get  <br/>\nsome sleep.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":98173825,"authorName":"Ellen Oberlin","from":"&quot;Ellen Oberlin&quot; &lt;ellenoberlin@...&gt;","profile":"ellenoberlin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Bedtimes & Meal Times","postDate":"1132327700","msgId":7798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTE4LUYyMjU4MkQxMkY1NkZDRkE1QUU1QkY2RDA1RTBAcGh4LmdibD4="},"prevInTopic":0,"nextInTopic":7799,"prevInTime":7797,"nextInTime":7799,"topicId":7798,"numMessagesInTopic":0,"msgSnippet":"Hi All, I am starting to unschool again after about 1-1/2 years of too much structure.  I guess I got scared for a while there.  It occured to me yesterday","messageBody":"<div id=\"ygrps-yiv-1043448689\">Hi All,<br/>\n<br/>\nI am starting to unschool again after about 1-1/2 years of too much <br/>\nstructure.  I guess I got scared for a while there.  It occured to me <br/>\nyesterday that since we weren&#39;t starting &quot;lessons&quot; at a certaine time in the <br/>\nmorning I didn&#39;t really see a point to a certain bedtime.  Wouldn&#39;t it be <br/>\nbetter to let the children learn to go to bed when they were tired?  I have <br/>\ndecided to try this as I want them to be able to honor their own needs and <br/>\nso by over-riding them I certainly wasn&#39;t teaching that.  Funny how I have <br/>\nhad to learn to honor mine to a greater degree first huh?  Well, then I <br/>\nthought about meal times too.  How do you work it with meal times and bed <br/>\ntimes?  I would like to be able to be flexible so that people in our family <br/>\ncan eat and sleep when they feel the need.  But, I also enjoy eating as a <br/>\nfamily.  In addition what about the nitty gritty about eating out of stuff I <br/>\nhave prepared for certain meals?  Do you just not prepare meals as such?<br/>\n<br/>\nHow do you work this?  I haven&#39;t worked these questions out and am seeking <br/>\ncounsel from those who have been there, done that.<br/>\n<br/>\nLooking forward to your ideas,<br/>\nEllen</div>","specialLinks":[]}],"prevTopicId":7603,"nextTopicId":7804}}