{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help with Food Limits","postDate":"1182177590","msgId":24516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzODU3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":24515,"nextInTopic":0,"prevInTime":24515,"nextInTime":24517,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"Can you include in the planning/budgeting once a month trips to wherever for staples (rice flour, gfcf pastas and mixes and so on) and include in maybe some","messageBody":"<div id=\"ygrps-yiv-2015542349\">Can you include in the planning/budgeting once a month trips to wherever<br/>\nfor staples (rice flour, gfcf pastas and mixes and so on) and include in<br/>\nmaybe some other fun stuff (whatever is available in that town that you<br/>\ndon&#39;t often get to see or do - like maybe a matinee movie or something)<br/>\nand make a day of it once a month to stock up on the good stuff at<br/>\nbetter prices?<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help with Food Limits","postDate":"1182176671","msgId":24515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzODUxQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":24513,"nextInTopic":24516,"prevInTime":24514,"nextInTime":24516,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"Gee - I just realized how little bread (loaf type stuff) we ve actually been eating lately. We ve chosen to just make our own and we ve got the ingredients","messageBody":"<div id=\"ygrps-yiv-1975672605\">Gee - I just realized how little &quot;bread&quot; (loaf type stuff) we&#39;ve<br/>\nactually been eating lately. We&#39;ve chosen to just make our own and we&#39;ve<br/>\ngot the ingredients (all sorts of flours) and even a bread machine to<br/>\nmake it easier (and cooler in the summer). But, we often just don&#39;t<br/>\nbother with it. We do eat LOTS of brown rice and tortillas (bought at<br/>\nour vegetarian co-op or homemade) and sometimes corn tortilla chips. One<br/>\nof the big changes is minimizing our potato usage because, much to my<br/>\npotato-loving chagrin, it really did a number on my blood glucose<br/>\nreadings to eat a basic baked potato. So, that whole balance is<br/>\ndifferent now.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Help with Food Limits","postDate":"1182176280","msgId":24513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzODUwQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":24444,"nextInTopic":24515,"prevInTime":24510,"nextInTime":24514,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"Is there any way you can buy *ingredients* so you can make things? For example, buy the rice flour (or whatever else you ve found that s safe) and what all to","messageBody":"<div id=\"ygrps-yiv-263620197\">Is there any way you can buy *ingredients* so you can make things? For<br/>\nexample, buy the rice flour (or whatever else you&#39;ve found that&#39;s safe)<br/>\nand what all to *make* cookies whenever throughout the week, and/or buy<br/>\nsafe mixes (I know our co-op and most places like Whole Foods and Trader<br/>\nJoe&#39;s have lots of options in this regard). Also, fruits and veggies are<br/>\nFULL of carbs - how about adding potatoes of all sorts (russet, gold,<br/>\nsweet, &#39;gem&#39;, etc) to meals for one. Beans/lentils are also another<br/>\n&quot;fill me up&quot; type food. As are oats (if you can find &#39;safe&#39; oats that<br/>\naren&#39;t cross contaminated with wheat - I think McCann&#39;s &lt;sp&gt; brand is a<br/>\nfairly safe brand of oats for gluten free folks). It&#39;s possible to make<br/>\ntortillas and pizza doughs with rice flour. A &quot;shepherd&#39;s pie&quot; of<br/>\npotatoes, beans or lentils, and peas (or other safe veggie) is quite the<br/>\nstick to the ribs meal. And, be sure to stock up on the rice-based pasta<br/>\nwhenever you can. For &#39;staple&#39; items, I rotate what I stock up on - one<br/>\nweek I&#39;ll buy lots of pasta, another week lots of beans, and so on. That<br/>\nway, the bottom line stays the same but I&#39;ve got pasta for a month,<br/>\nbeans for a month, and so on. By the time the pasta runs low, it&#39;s the<br/>\npasta&#39;s turn to be stocked.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help with Food Limits","postDate":"1181756018","msgId":24444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzAwMWM3YWRlMCRmYTQ2OWUwMCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":24414,"nextInTopic":24513,"prevInTime":24443,"nextInTime":24445,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"***I would never let them walk around the house starving!*** Yeah, I didn t think you were letting them starve,  but hunger can be about more than a","messageBody":"<div id=\"ygrps-yiv-1250323515\">***I would never let them walk around the house starving!***<br/>\n<br/>\nYeah, I didn&#39;t think you were letting them starve,&lt;g&gt;  but hunger can be <br/>\nabout more than a physically empty stomach.   We can be needy for things we <br/>\nthink we&#39;re not getting enough of.  That&#39;s a problem with limits.<br/>\n<br/>\n***so it may not be a carb issue as I originally thought.***<br/>\n<br/>\nIt seems very likely an issue with allowed foods and their availability.<br/>\n<br/>\n***I hope you&#39;re not saying that families with kids that must be on<br/>\nspecial diets cannot also be unschoolers. :)***<br/>\n<br/>\nAnytime one person is limiting the choices for another person it can <br/>\ninterfere with unschooling.   That doesn&#39;t mean a parent will never limit a <br/>\nchild&#39;s choice, it means that parent might deal with issues other <br/>\nunschooling parents don&#39;t have.   If you&#39;re in that situation it may not <br/>\nalways be easy to reconcile a particular decision with unschooling.<br/>\n<br/>\nIf I had a child with a severe allergy to some food I would definitely have <br/>\nkept that food out of the house.  I would have socialized with people who <br/>\ncould easily and happily accommodate us and avoided going into the homes of <br/>\nthose who couldn&#39;t, until my kid was old enough to understand and avoid <br/>\nthose foods on his own.  I have some experience with a child who chose a <br/>\ndiet different from anyone else we knew when he was very young, and I know a <br/>\nvery young person is capable of choosing and deciding.<br/>\n<br/>\nAn immediate life threatening allergy is different from an ethical choice <br/>\nand even different from a general health maintenance diet.   We know enough <br/>\nabout human psychology to know that even people who&#39;ve had quadruple bypass <br/>\nsurgery and have been told that they should change their diet if they want <br/>\nto continue to live well can have a difficult time or even find it <br/>\nimpossible to stick to a diet prescribed by someone else.<br/>\n<br/>\nAnd like the bypass patient, who can feel resentful toward his doctor about <br/>\nthe diet limits even though the clogged arteries were not the doctors fault, <br/>\nkids on restrictive diets can feel resentful toward the person who enforced <br/>\nthe diet.   That&#39;s a potential problem that can interfere with unschooling. <br/>\nIf you&#39;re creative and thoughtful you might be able to make a difficult <br/>\nsituation work but it&#39;s not an ideal situation and that&#39;s what I meant.<br/>\n<br/>\n***Calling a diet that<br/>\neliminates those substances &quot;restrictive&quot; is like calling an<br/>\nenvironment that limits or excludes radon, strychnine and arsenic<br/>\n&quot;restrictive&quot;.***<br/>\n<br/>\nThere&#39;s a difference. &lt;g&gt;   Your kids will probably never look at arsenic <br/>\nlaced river sediment and want to eat a big plate full.  They might very much <br/>\nwant to try some chocolate cake.  The difference is in their desire. The <br/>\ndifference is in their psyche. That&#39;s the difference that matters to <br/>\nunschooling.   When a person wants something they can&#39;t have they feel <br/>\nrestricted.   I&#39;ve never met a kid who was longing for radon but maybe I&#39;m <br/>\njust hanging with a different crowd. &lt;g&gt;<br/>\n<br/>\nIf your kids haven&#39;t made the association between certain foods and how <br/>\nthose foods leave them feeling then not getting the chocolate cake leaves a <br/>\nbig hole of need.   The hole is the problem with regards to unschooling. <br/>\nAs their mom you should avoid the holes as much as possible.   I don&#39;t think <br/>\nyou can do that by limiting the foods their allowed to have.  And I think <br/>\nthat was your original question, why are they so needy and what can you do <br/>\nabout it.  They&#39;re needy because they already feel limited, they already <br/>\nhave a hole.  What can you do about it?  Fill them up.<br/>\n<br/>\nEven when adults can make an association between an activity or food and the <br/>\nway that activity or food makes them feel, they often choose the activity or <br/>\nfood because they believe the pleasure of the thing is worth feeling <br/>\nuncomfortable later.     Emotionally healthy people can make those choices <br/>\nand still give consideration to their physical health and maintain a <br/>\nbalance.    Emotionally needy people just keep trying to fill the hole <br/>\ninside them, sometimes at the expense of their physical health. <br/>\nUnschooling won&#39;t work where people are emotionally unbalanced, where their <br/>\nunfulfilled need is driving them.   You&#39;re unschooling mission, if you <br/>\nchoose to accept it, is to eliminate neediness. &lt;g&gt;<br/>\n<br/>\n***We cannot buy just any rice flour/noodles we find cheaply<br/>\nbecause there is a lot of cross-contamination when flours are<br/>\nrun/ground/processed on the same equipment.***<br/>\n<br/>\nMaybe you can find a used flour mill on ebay or on a swap board and grind <br/>\nyour own.  Advertise in your local paper that you want a free flour grinder. <br/>\nSome old lady might have one in her basement.<br/>\n<br/>\nIf you have friends and family members who buy birthday and Christmas gifts <br/>\nfor your family, maybe you could suggest gift certificates at the health <br/>\nfood store so the kids can by a bunch of their favorite things.<br/>\n<br/>\nWe live ninety one miles from the best health food store.  There&#39;s a small <br/>\none thirty six miles away but they don&#39;t have everything we like, and <br/>\nthere&#39;s another one about sixty miles away, also short on some things we <br/>\ntypically buy.    They will mail some items to us and in the winter or with <br/>\ngas prices as high as they are, this is sometimes an economical and <br/>\nconvenient option.   So if you live a distance from your health food store <br/>\nask about getting some items shipped to you.   What a nice surprise for your <br/>\nkids to get their favorite cookies in the mail some week you didn&#39;t have <br/>\ntime to get to the health food store!<br/>\n<br/>\nRice puddings are easy treats if your kids like sweets.  Chocolate rice <br/>\npudding is one of my favorite foods. &lt;g&gt;<br/>\n<br/>\nMy brother makes peanut butter cookies without flour.    He says his kids <br/>\nlove them.  I haven&#39;t tried them, but the recipe is:<br/>\n<br/>\n2 c. peanut butter<br/>\n2/3 c. brown sugar<br/>\n6 TBS. fructose<br/>\n2 large eggs<br/>\n<br/>\nMix, roll into balls, flatten with a fork dipped in sugar, bake 10-12 <br/>\nminutes at 350.  Let cookies cool on cookie sheet before removing.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Help with Food Limits","postDate":"1181683650","msgId":24414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwNjEyMTQyN203OGFiNDNiYXllZGJkOTVmZGIwM2Q4M2U2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAwM2IwMWM3YWQwMCQwYmUwNjhkMCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4=","referencesHeader":"PDAwM2IwMWM3YWQwMCQwYmUwNjhkMCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":24407,"nextInTopic":24444,"prevInTime":24413,"nextInTime":24415,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"Hi Deb, Thanks for your reply. It s given me lots of food for thought .  ... I total agree with that point. It s *my* responsibility to make sure they have","messageBody":"<div id=\"ygrps-yiv-1259171542\">Hi Deb,<br/>\n<br/>\nThanks for your reply. It&#39;s given me lots of &quot;food for thought&quot;. &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you think this diet is good for them then it&#39;s your responsibility to<br/>\n&gt; make the diet you chose for them available.  Our kids don&#39;t have a<br/>\n&gt; responsibility to be only as hungry as we want them or can afford for them<br/>\n&gt; to be.  &lt;g&gt;<br/>\n<br/>\n </span></blockquote>I total agree with that point. It&#39;s *my* responsibility to make sure<br/>\nthey have what they need and of course I would never let them walk<br/>\naround the house starving! I want to emphasize that week to week they<br/>\n*are* getting enough to eat nutritionally and they&#39;re in excellent<br/>\nphysical health. As someone else pointed out, there are carbs in<br/>\nvegetables and fruits and they eat lots of those, so it may not be a<br/>\ncarb issue as I originally thought.<br/>\n<br/>\nMaybe they&#39;re grazers and need to eat smaller portions more frequently<br/>\nthroughout the day. They may need more fats since we tend to avoid<br/>\nbutter substitutes because of trans fats and fish/seafood because of<br/>\nmercury levels. I&#39;m going to try to find alternate sources of<br/>\nomega-3/6 oils and other beneficial fats. I really like the monkey<br/>\nplatter idea I read about on Sandra&#39;s site. I realize it is my<br/>\nresponsibility to help them figure out what their needs are and I&#39;ve<br/>\nbeen thinking a lot about this stuff. The main issue at hand is<br/>\nfinding a way to provide them with enough of the *specific* foods they<br/>\ndesire to eat.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are you willing to rethink the diet issue? Are typically reported benefits<br/>\n&gt; of this diet going to help your kids to a degree that will make the<br/>\n&gt; potential emotional food related issues worth the risk?<br/>\n<br/>\n </span></blockquote>It has *very* greatly improved their quality of life and resolved<br/>\nseveral dozen health issues. I realize this diet doesn&#39;t work for<br/>\neveryone and that some people see little, if any, improvement. We&#39;re<br/>\nfortunate in that regard because it&#39;s worked amazingly well for our<br/>\nkids. Being free of gluten & casein has made dramatic differences in<br/>\ntheir lives. Their improvements have absolutely floored their doctors<br/>\nand even prompted a research study. The diet isn&#39;t something we&#39;ve<br/>\nrandomly and mindlessly decided to force upon them. They both have<br/>\nceliac disease and *must* be gluten free. They also have a milk<br/>\nallergy as well, so being both gf and cf is working well for them.<br/>\nIt&#39;s the way they will eat for life, it&#39;s what they will have to live<br/>\nwith always.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do your kids<br/>\n&gt; feel about being on the diet?<br/>\n<br/>\n </span></blockquote>They have been on this diet for most of their lives so it is what<br/>\nthey&#39;re used to and they really enjoy their foods. It is as normal to<br/>\nthem as it is for my mom to avoid chocolate because she is allergic.<br/>\nIt&#39;s just a fact of life for them, like people who need to avoid<br/>\npeanuts or strawberries or any other food that seriously affects a<br/>\nperson&#39;s health and well being. The diet itself is not an area of<br/>\ncontention or disagreement with the kids. However, I know they would<br/>\nbe happier with having more of certain foods they really like and tend<br/>\nto crave, and I am trying to find a way to give them that.<br/>\n<br/>\n97% of the time the kids don&#39;t mind their diet. The other 3% are those<br/>\ntimes when they see something they can&#39;t have, like if we are at<br/>\nsomeone&#39;s house and someone (unexpectedly) pulls a big delicious<br/>\nlooking chocolate cake out of the fridge and the kids wish they could<br/>\nhave some. We try to prepare for most situations by making sure we<br/>\nhave their gfcf equivalent on hand for them, but there are times when<br/>\nwe&#39;re taken by surprise. But there are also (and increasingly more<br/>\noften) times when they barely notice a plate of regular cookies and<br/>\ndon&#39;t give a second glance to someone eating a cheesy pizza.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The difference is<br/>\n&gt; unschooling is not about restricting and limiting kids but about creating a<br/>\n&gt; life of abundance and the diet is restrictive and limiting.<br/>\n<br/>\n </span></blockquote>I hope you&#39;re not saying that families with kids that must be on<br/>\nspecial diets cannot also be unschoolers.  :)    It would be so much<br/>\neasier if they did not have these special dietary needs. It would be<br/>\nconsiderably less difficult (and less expensive) to shop for food, we<br/>\nwouldn&#39;t have to worry about them getting exposed to<br/>\ncross-contamination, we wouldn&#39;t have to pack up their foods every<br/>\ntime we leave the house, etc. Although I do see everything we do as a<br/>\nchoice, even if all the available options are difficult, and despite<br/>\nall these challenges, knowing what we know now, I feel it would be<br/>\nirresponsible and dangerous to give them gluten & dairy foods.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s my belief (unproven by scientific<br/>\n&gt; study &lt;g&gt;) that my support of Dylan&#39;s choices has been more beneficial to<br/>\n&gt; his overall health than a diet would have been and especially if the diet<br/>\n&gt; was not something he chose for himself.<br/>\n<br/>\n </span></blockquote>I totally understand that reasoning and under different circumstances<br/>\nwe might do the same thing! My kids were very young when they went<br/>\ngfcf, but they &quot;spoke out&quot; about their needs the only way they could.<br/>\nMy son was miserable and cried nearly all the time, didn&#39;t want to be<br/>\ntouched (his skin was extremely sensitive) and he threw up a lot. He<br/>\nhad to be treated for pneumonia repeatedly. He was diagnosed with<br/>\nsevere asthma and GERD (among other things) which required 6 different<br/>\ndaily medications that he did not like to take. My daughter complained<br/>\nof nearly constant stomach pains, had bowel problems, couldn&#39;t sleep<br/>\nwell at night, had poor speech and was very clumsy. We took her to the<br/>\nER several times for serious head bumps.<br/>\n<br/>\nGoing gfcf cleared most of these issues up within a week and DS was<br/>\nable to go off all his meds. He no longer has asthma or throws up and<br/>\nhe enjoys being held. DD no longer has stomach pains or bowel problems<br/>\nand her speech & agility improved tremendously and very rapidly.<br/>\nThat&#39;s just a *very* brief overview - there are so many more things<br/>\nthat improved, including numerous developmental issues.<br/>\n<br/>\nWhile they didn&#39;t really choose this diet in the sense of actively<br/>\ndeciding to do it voluntarily because they were so young, within a<br/>\nweek we could see it was clearly beneficial in many ways. We have<br/>\ntalked to them about it over the years and they know why they are<br/>\ngfcf. There has (unfortunately) been a few times when they<br/>\naccidentally ate non-gfcf foods and they ended up pretty sick and many<br/>\nof the old problems reappeared with a bang. DD in particular has a<br/>\n&quot;physical memory&quot; of eating non-gfcf foods and she takes great care to<br/>\navoid feeling like that again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you make a deal with your supplier to buy case loads of favorite foods<br/>\n&gt; at a better price?<br/>\n<br/>\n </span></blockquote>So far this hasn&#39;t been an option but we&#39;re looking into a natural<br/>\nfoods co-op a few towns away to see if that will give us more buying<br/>\npower. In the past few days I&#39;ve been brainstorming about ways to find<br/>\ntheir foods at better prices. I found several really good coupons<br/>\nonline which will help out. I didn&#39;t even know there were coupons for<br/>\nthese foods until I searched - the only thing I ever see in my local<br/>\npaper are coupons for cleaning supplies, pet food, canned veggies and<br/>\ndeodorant. I&#39;m very happy about this discovery!<br/>\n<br/>\nI&#39;ve spent some time fine-tuning our grocery budget and making more $$<br/>\navailable for their specialty products. I&#39;m also going to take<br/>\nadvantage of every sale I can find. This past Saturday I was grocery<br/>\nshopping and came across a display of close-out products. I about<br/>\njumped for joy when I saw a whole shelf of gluten-free pastas & cereal<br/>\nbars on sale for *half off*. Whohoo! I went over my shopping list and<br/>\neliminated a few things so that I could afford to buy everything they<br/>\nhad at that price. The kids are tickled about this find. I think if I<br/>\nsearch better and comparison shop, I can find good deals.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Fifteen dollars isn&#39;t that much (but I&#39;ve also lived through<br/>\n&gt; times when fifteen dollars was nearly impossible to come by)<br/>\n<br/>\n </span></blockquote>Ahh - this is our situation right now, but there is a good reason for<br/>\nit and I know things will improve in the future. We&#39;re all doing<br/>\nwithout/sacrificing to a certain extent, but we&#39;ve been trying to<br/>\nlessen the impact of this on the kids as much as possible. This period<br/>\nof tight finances will not last forever. It too shall pass...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Can you buy bulk amounts at the best price of the ingredients to make their<br/>\n&gt; favorite things? &lt;snip&gt; or your local Asian market<br/>\n<br/>\n </span></blockquote>Someone else suggested going to an Asian market and buying in bulk.<br/>\nThere is one about an hour from us and we&#39;re going to check on their<br/>\nprices. We cannot buy just any rice flour/noodles we find cheaply<br/>\nbecause there is a lot of cross-contamination when flours are<br/>\nrun/ground/processed on the same equipment. The products we buy at<br/>\nlocal specialty stores are more expensive but have been tested for the<br/>\npresence of gluten & are processed on dedicated lines. We&#39;ll<br/>\ndefinitely investigate the Asian food market option though! It would<br/>\nbe great if we can find what we need at a good price.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you trade out for services?  (an example might be cleaning<br/>\n&gt; the Karate Dojo in exchange for kid&#39;s lessons.)<br/>\n<br/>\n </span></blockquote>That&#39;s a heck of an idea! I&#39;ll have to keep that in mind for when they<br/>\nwant to pursue these activities.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; you may not be able to reconcile it with the unschooling philosophy.<br/>\n&gt; It&#39;s not always easy, but it&#39;s always worth thinking about. &lt;g&gt;<br/>\n<br/>\n </span></blockquote>I think we can find a way! There are unchangeable, unavoidable<br/>\n&quot;restrictions&quot; people have to live with every day - lots of kids are<br/>\nborn with physical & mental challenges. For my kids a gfcf diet isn&#39;t<br/>\nrestrictive in a traditional sense of the word because there is no<br/>\nviable alternative for them - it&#39;s just another aspect of their lives.<br/>\nFor them, gluten & dairy are akin to poisons. Calling a diet that<br/>\neliminates those substances &quot;restrictive&quot; is like calling an<br/>\nenvironment that limits or excludes radon, strychnine and arsenic<br/>\n&quot;restrictive&quot;.<br/>\n<br/>\nIt&#39;s really part of trying to provide them with the best possible care<br/>\nand no matter what their diet is labeled as - &quot;restrictive&quot; or &quot;safe &<br/>\nhealthy&quot; - it doesn&#39;t change their dietary needs and they&#39;ll have to<br/>\ngo forward with these same needs their whole life no matter how<br/>\nwe/they/others choose to view them. So we might as well not choose to<br/>\nlook at the diet from a negative light, but instead to look at how it<br/>\nhas a positive impact.<br/>\n<br/>\nThe true limiting issue comes from them not having as much desired<br/>\nfood items as they would like, which is why I asked for advice &<br/>\nideas, because I want to remedy that. There have been lots of great<br/>\nsuggestions and I&#39;m in full problem-solving mode now, so I think we&#39;ll<br/>\nfind a way to meet their needs for these foods and continue down our<br/>\nunschooling path!<br/>\n<br/>\nThanks again for your reply! Your comments have helped me re-examine<br/>\nthe benefits of their diet and reaffirm that, regardless of cost, it<br/>\nis a blessing it is to be able to provide them with something that<br/>\ngives them a better quality of life.<br/>\n<br/>\n-- Susan</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help with Food Limits","postDate":"1181659411","msgId":24407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2IwMWM3YWQwMCQwYmUwNjhkMCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":24399,"nextInTopic":24414,"prevInTime":24406,"nextInTime":24408,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"***What to do? While I don t want to set restrictions or limits, I m seeing that it might be necessary to plan a certain allotment for each day and make that","messageBody":"<div id=\"ygrps-yiv-1315869649\">***What to do? While I don&#39;t want to set restrictions or limits, I&#39;m<br/>\nseeing that it might be necessary to plan a certain allotment for each<br/>\nday and make that available each morning and then not set restrictions<br/>\nor limits on when/where/how they eat it. But this is still restricting<br/>\nin a sense, but they don&#39;t have access to the whole supply in the<br/>\nhouse, so I&#39;m just not sure how to make peace with this.***<br/>\n<br/>\nYou&#39;ve already set limits by restricting their diets and now you&#39;re asking<br/>\nabout ideas for restricting allowed foods.<br/>\n<br/>\nIf you think this diet is good for them then it&#39;s your responsibility to<br/>\nmake the diet you chose for them available.  Our kids don&#39;t have a<br/>\nresponsibility to be only as hungry as we want them or can afford for them<br/>\nto be.  &lt;g&gt;<br/>\n<br/>\nAre you willing to rethink the diet issue?   Are typically reported benefits<br/>\nof this diet going to help your kids to a degree that will make the<br/>\npotential emotional food related issues worth the risk?   How do your kids<br/>\nfeel about being on the diet?   If your kids are willingly on the diet they<br/>\nmight have ideas about making things stretch.   If your kids don&#39;t have the <br/>\noption of quitting the diet then<br/>\nit wouldn&#39;t be right to ask them for ideas about further limiting their <br/>\nfoods.   (You don&#39;t have to share more information<br/>\nwith us than you want... I&#39;m just saying getting the kids to agree to <br/>\nlimiting foods if they really don&#39;t have a choice about being<br/>\non the diet is not really agreement or choice.)<br/>\n<br/>\nI only read briefly about this diet and it seems there is one study that <br/>\nshowed some<br/>\nbenefit to kids and that study isn&#39;t widely supported.  I don&#39;t believe <br/>\nthere has to be scientific proof a<br/>\nthing is beneficial for it to be so.   The benefits of unschooling are not<br/>\nscientifically proven and the reports of benefits come from parents relating<br/>\ntheir experiences.  (much like the gfcf diet, it seems)    The difference is<br/>\nunschooling is not about restricting and limiting kids but about creating a<br/>\nlife of abundance and the diet is restrictive and limiting.<br/>\n<br/>\nWhen Dylan was first diagnosed with psoriatic arthritis we looked at the<br/>\ninformation about diet.  The benefits of a restricted diet were not<br/>\nconclusive and Dylan decided it wasn&#39;t worth it to him to give up some of<br/>\nthe things he loved for a &quot;possible&quot; benefit.    Dylan had already chosen a<br/>\nprimarily vegan diet (he occasionally eats honey) for himself, for<br/>\nethical reasons but was not willing to further limit his diet for<br/>\nunproven potential health benefits.   It&#39;s my belief (unproven by scientific<br/>\nstudy &lt;g&gt;) that my support of Dylan&#39;s choices has been more beneficial to<br/>\nhis overall health than a diet would have been and especially if the diet<br/>\nwas not something he chose for himself.<br/>\n<br/>\nIf the diet stays:<br/>\nCan you make a deal with your supplier to buy case loads of favorite foods <br/>\nat a better price?<br/>\nCan you buy bulk amounts at the best price of the ingredients to make their<br/>\nfavorite things?<br/>\nA quick search showed a fifty pound bag of rice flour at Amazon ($4.50<br/>\nshipping) for  $56.00.    That&#39;s about fifteen dollars more than a fifty<br/>\npound bag of organic wheat flour.   Fifteen dollars isn&#39;t that much (but <br/>\nI&#39;ve also lived through<br/>\ntimes when fifteen dollars was nearly impossible to come by)   Start a coop <br/>\nand buy two hundred pounds<br/>\nat a time and see what kind of deal your health food store or your local<br/>\nAsian market can make you.   Can you grind your own rice flour?<br/>\n<br/>\nWhere in your budget can you make changes to increase money available for<br/>\nfood?   Can you drop magazine subscriptions?  Can you cut out services you<br/>\nnow pay for?  Can you trade out for services?  (an example might be cleaning<br/>\nthe Karate Dojo in exchange for kid&#39;s lessons.)   Can you get a part time<br/>\njob?   Handyman or clean or mow lawns for extra cash?<br/>\n<br/>\nFood is already an issue for them.    You&#39;ve linked food to behavior and<br/>\nyou&#39;ve restricted some foods.  They likely already feel needy.  Any further<br/>\nrestricting you do could create more need.  You can either let them decide<br/>\nwhether it&#39;s worth it or decide for them.   If you decide for them and if<br/>\nyou choose to limit the amounts of their favorite allowed foods for budget<br/>\nsake you may not be able to reconcile it with the unschooling philosophy.<br/>\nIt&#39;s not always easy, but it&#39;s always worth thinking about. &lt;g&gt;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Help with Food Limits","postDate":"1181577559","msgId":24399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwNjExMTU1OS5sNUJGeENYNzAxNjIzNEBtcy1zbXRwLTAxLnNvY2FsLnJyLmNvbT4="},"prevInTopic":24379,"nextInTopic":24407,"prevInTime":24398,"nextInTime":24400,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"I wonder if it would be a cheap option to bake some gfcf treats for them on a weekly basis.  Not to say you ought to stop buying their favorites but maybe some","messageBody":"<div id=\"ygrps-yiv-1875670490\">I wonder if it would be a cheap option to bake some gfcf treats for them on<br/>\na weekly basis.  Not to say you ought to stop buying their favorites but<br/>\nmaybe some home made things could help stretch the grocery budget (and the<br/>\ncarb rich foods) to last the whole week.  I found this cookbook on line -<br/>\nit&#39;s pretty expensive but maybe you already have some resources?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://stewartdehart.stores.yahoo.net/cookbook.html\">http://stewartdehart.stores.yahoo.net/cookbook.html</a><br/>\ngood luck,<br/>\nKrisula<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with Food Limits","postDate":"1181575253","msgId":24379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0anA4bCt1bTBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0aDI3bSt2YWZiQGVHcm91cHMuY29tPg=="},"prevInTopic":24362,"nextInTopic":24399,"prevInTime":24378,"nextInTime":24380,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"-I am really glad that this topic has come up!   I have been a little concerned/disturbed (?) by my kids writing their names on things in the refrigerator...","messageBody":"<div id=\"ygrps-yiv-480450976\">-I am really glad that this topic has come up!   I have been a little<br/>\nconcerned/disturbed (?) by my kids writing their names on things in<br/>\nthe refrigerator... mostly soft drinks lately.   We rarely buy it and<br/>\nwhat led to them writing their names on it was that they would put one<br/>\nin the fridge to chill then come back and someone else has taken it<br/>\nnot realizing someone had put it in for themselves!   We did make a<br/>\n&quot;rule of consideration&quot; (our own little coined phrase for when rules<br/>\nare necessary for harmony)  that if they take out a bottled water they<br/>\nshould make sure to put in a few more for others to have a cold one<br/>\nwhen they need it.     At any rate my husband bought a large variety<br/>\nbox of Jone&#39;s Sodas at Sam&#39;s ...because the kids each wanted to try<br/>\nseveral flavors they wrote their names on the bottles in the fridge. <br/>\nAt first it struck me as somewhat selfish.  Later I saw my 5 yr old<br/>\ngladly give his 12 yr old sister one he had already claimed that she<br/>\ndecided she might like to try but found there were no more of that<br/>\nflavor.  They have been gladly giving each other a taste of ones they<br/>\nfound especially yummy that their siblings didn&#39;t think they would<br/>\nlike but wanted to have a taste later.    <br/>\nWe also have food allergies (our 5 yr old) so I do buy specific things<br/>\nfor him that can be expensive.   So far I haven&#39;t had to limit<br/>\nanything because the others are rarely interested in his Rice Dream<br/>\nice cream or his Rice Dream rice milk.     They do occasionally have a<br/>\nfew of his cookies or other things.   In our case I have managed to<br/>\nfind recipes for most things so that I can make them more cheaply and<br/>\nhave them readily available in whatever amounts we need them.     A<br/>\nfew times I have come across a teen happily munching on the<br/>\ndairy/wheat free cookies and had a moment of panic (because of the<br/>\nexpense and thinking of the 5 yr olds face when others are having<br/>\nregular cookies and his are gone!)  usually I just remind them that<br/>\nthose are the dairy/wheat free ones and ask that they make sure they<br/>\nleave some for their brother.   Most of the time they hadn&#39;t realized<br/>\nthey were the special cookies and immediately switch to regular ones.<br/>\n  Sometimes they remark that they like those better and I make sure I<br/>\nbuy a larger amount the next time!    <br/>\nThanks for all the great reassuring discussion on this topic!   I<br/>\nespecially feel better about the writing names on things!<br/>\nLisa Blocker</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with Food Limits","postDate":"1181486134","msgId":24362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0aDI3bSt2YWZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk0OTQzMS41NTM3MS5xbUB3ZWI1OTIxMS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24361,"nextInTopic":24379,"prevInTime":24361,"nextInTime":24363,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"~~Buying more may sometimes be possible but the same thing happens again. Also, I sometimes don t have the time (for a few days) or the $$ to immediately buy","messageBody":"<div id=\"ygrps-yiv-666895176\">~~Buying more may sometimes be possible but the same thing happens<br/>\nagain. Also, I sometimes don&#39;t have the time (for a few days) or the<br/>\n$$ to immediately buy more. ~~<br/>\n<br/>\nI&#39;ve run into this also, with four kids and a sometimes limited<br/>\nbudget, it just happens!:)  What I&#39;ve found over time, is that the<br/>\nmore those items are available, the less any one child hordes or<br/>\noverconsumes. I ended up buying entire BOXES of Twix bars at one<br/>\npoint, to try and fulfill my oldest child&#39;s desire for them. Two (36<br/>\ncount, no less) boxes into it, he decided he didn&#39;t want Twix bars<br/>\nvery often. Funny thing.<br/>\n<br/>\nI don&#39;t always have the money for tons of snacky stuff. Last night at<br/>\nthe store, Jalen and Sierra were making many requests.....I finally<br/>\nreminded them that I needed to buy meal items for everyone and they<br/>\nwere like &quot;OH yeah, that&#39;s fine&quot;. They trust I will buy them the foods<br/>\nthey want, so when we need to watch the money it makes sense to them.<br/>\nThe older they get, the easier that part is. Small children just can&#39;t<br/>\nunderstand budget needs very well.<br/>\n<br/>\nCan you buy the 13 year old some items just for him? I found that if<br/>\none child is really consuming a lot, and has a higher need for certain<br/>\nitems, it helps to provide them with some of their own foods they can<br/>\nstash somewhere away from communal areas. Jared absolutely LOVES<br/>\ntapioca pudding and likes to have his own tub.<br/>\n<br/>\nWe give him space in the mini-fridge in the basement (dh&#39;s little<br/>\nstash) so nobody gets into his tapioca.:)  Once a child knows they&#39;ll<br/>\nhave access to the foods they really want, it tends to smooth out some<br/>\nof the intense desire.<br/>\n<br/>\nHis needs are just different than the other kids, so maybe providing<br/>\nhim with his own stash will help?  It will probably be a short lived<br/>\nthing. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with Food Limits","postDate":"1181485928","msgId":24361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0aDIxOCttdXFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk0OTQzMS41NTM3MS5xbUB3ZWI1OTIxMS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24352,"nextInTopic":24362,"prevInTime":24360,"nextInTime":24362,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"... What about individuals claiming specific foods either by writing names on foods or storing them on separate shelves? In our house Mo has a shelf in the","messageBody":"<div id=\"ygrps-yiv-1980904378\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Cameron Parham <br/>\n&lt;acsp2205@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We do cook together when we can, but these are specially requested <br/>\n&gt;items.  Any ideas how to balance this while recognizing everybody&#39;s <br/>\n&gt;needs? <br/>\n<br/>\n </span></blockquote>What about individuals &quot;claiming&quot; specific foods either by writing <br/>\nnames on foods or storing them on separate shelves? In our house Mo <br/>\nhas a shelf in the pantry where she sometimes stores foods and Ray <br/>\nkeeps some snacks in his room. They are both willing to share their <br/>\ntreats when asked. <br/>\n<br/>\nSharing consumables can be really challenging - there&#39;s something <br/>\nunsettling about having an expectation of eating or using something <br/>\nonly to find *someone else* has eaten or used the last of whatever-<br/>\nit-is. George and Mo both tend to binge on cookies when they think <br/>\nthe other is going to &quot;get&quot; the last - I call it &quot;competitive <br/>\neating&quot;. Ray&#39;s less likely to do this, and I don&#39;t do it at all, so <br/>\nits not *just* a matter of un/deschooling. There&#39;s some personality <br/>\nissues involved. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181455122","msgId":24352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0OTQzMS41NTM3MS5xbUB3ZWI1OTIxMS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24346,"nextInTopic":24361,"prevInTime":24351,"nextInTime":24353,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"Re: budgeting food. A related problem that we have is this: I buy some treats that one of 3 kids requested.  Recently it has been twinkies, Hi-C juice boxes,","messageBody":"<div id=\"ygrps-yiv-1684783286\">Re: budgeting food. A related problem that we have is this: I buy some treats that one of 3 kids requested.  Recently it has been twinkies, Hi-C juice boxes, etc.  And the 13 yo consumes all of it in 1-2 days, distressing the other kids.  Buying more may sometimes be possible but the same thing happens again.  Also, I sometimes don&#39;t have the time (for a few days) or the $$ to immediately buy more.  The 13yo has so far been immune to discussions regarding the fairness of this. I did mention once an amount of ginger ale that seemed fair for him to have but he had all of it.  We are still deschooling...maybe it&#39;s just that.  I have planned a family meeting to allow all of us to discuss these and other concerns.  But so far the only thing I&#39;ve really found it makes me want to do is not buy the stuff (although mostly I still do).  We do cook together when we can, but these are specially requested items.  Any ideas how to balance this while recognizing everybody&#39;s needs? And not<br/>\n making the 13yo seem selfish.  He really isn&#39;t. Cameron<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138896698,"authorName":"Anne Marie Shotwell","from":"Anne Marie Shotwell &lt;amshot@...&gt;","profile":"amshotwell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help with Food Limits","postDate":"1181439030","msgId":24346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NkI1NDM2LjEwNzA0MDdAdmVyaXpvbi5uZXQ+"},"prevInTopic":24343,"nextInTopic":24352,"prevInTime":24345,"nextInTime":24347,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"... buying them? I just started doing this with my sons. Not because of a special diet per se but to save money, make things last longer as well as be more ","messageBody":"<div id=\"ygrps-yiv-321237361\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;can you bake things instead of<br/>\n </span></blockquote>buying them?<br/>\n<br/>\nI just started doing this with my sons. Not because of a special diet <br/>\nper se but to save money, make things last longer as well as be more <br/>\nnutritious than the snacks we were buying. They have all had a great <br/>\ntime and it has inspired my  sons to learn more about the kitchen, <br/>\nmeasuring, what different ingredients they can use etc. He likes to bake <br/>\nonce or twice a week now. I will be stocking up on bread ingredients now <br/>\nbecause he wants to try the bread machine that has been collecting dust <br/>\nfor 5 years.<br/>\n<br/>\nAnne Marie</div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181421354","msgId":24343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2NC5hYTQxMGMwLjMzOWM2OTJhQGFvbC5jb20+"},"prevInTopic":24331,"nextInTopic":24346,"prevInTime":24342,"nextInTime":24344,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/9/2007 12:44:44 P.M. Pacific Daylight Time, SusanYvonne@gmail.com writes: Thanks! -- Susan You re welcome...I often wish *I* lived in a","messageBody":"<div id=\"ygrps-yiv-811439137\">In a message dated 6/9/2007 12:44:44 P.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SusanYvonne@...\">SusanYvonne@...</a> writes:<br/>\n<br/>\nThanks!<br/>\n-- Susan<br/>\n<br/>\n<br/>\nYou&#39;re welcome...I often wish *I* lived in a rural area! :) <br/>\n <br/>\nLove,<br/>\nKaren <br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181418247","msgId":24331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwNjA5MTI0NG4xZWVhMmQ0Nmw4NjVjZDAzNDJlNWVjYjQ2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGM4Ni4xMzdhNTQ1YS4zMzljNTI3OEBhb2wuY29tPg==","referencesHeader":"PGM4Ni4xMzdhNTQ1YS4zMzljNTI3OEBhb2wuY29tPg=="},"prevInTopic":24326,"nextInTopic":24343,"prevInTime":24330,"nextInTime":24332,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"... You touched on one of the downfalls of living in a rural area - we don t have stores like Trader Joe s or Whole Foods Market (which I love to shop at when","messageBody":"<div id=\"ygrps-yiv-56784397\"><blockquote><span title=\"ireply\">&gt; hi, Susan! could you budget their items *with* them, and menu plan too,  with<br/>\n&gt; them? Possibly cook/bake/make some items, rather than purchasing them<br/>\n&gt; pre-made? Also, do you have a Trader Joe&#39;s near you? The costs there are a  pretty<br/>\n&gt; good and have a fair amount of both gf and cf items _www.traderjoes.com_<br/>\n&gt; (http://www.traderjoes.com)  just in case. I am just  thinking that the added<br/>\n&gt; participation might help slow the binge cycle you&#39;re  concerned about. and forgive<br/>\n&gt; me please if I said anything that has been said or  that is useless, I&#39;m too<br/>\n&gt; new to know many here, yet :)<br/>\n<br/>\n </span></blockquote>You touched on one of the downfalls of living in a rural area - we<br/>\ndon&#39;t have stores like Trader Joe&#39;s or Whole Foods Market (which I<br/>\nlove to shop at when I&#39;m visiting other areas). The nearest is about 2<br/>\nhrs away. We are fortunate to have *any* specialty stores here, so for<br/>\nthat I&#39;m thankful, but they are very pricey. I might start shopping<br/>\nonline again.<br/>\n<br/>\nI have been giving this food issue a lot of thought and I think I&#39;m<br/>\ngoing to be able to work it out. Involving the kids in the budgeting &<br/>\nmenu planning is a great idea (I don&#39;t know why this it never occurred<br/>\nto me).<br/>\n<br/>\nThanks!<br/>\n-- Susan</div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181415544","msgId":24326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4Ni4xMzdhNTQ1YS4zMzljNTI3OEBhb2wuY29tPg=="},"prevInTopic":24303,"nextInTopic":24331,"prevInTime":24325,"nextInTime":24327,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/8/2007 2:01:10 P.M. Pacific Daylight Time, SusanYvonne@gmail.com writes: What to  do? While I don t want to set restrictions or limits,","messageBody":"<div id=\"ygrps-yiv-595727042\">In a message dated 6/8/2007 2:01:10 P.M. Pacific Daylight Time,  <br/>\nSusanYvonne@... writes:<br/>\n<br/>\nWhat to  do? While I don&#39;t want to set restrictions or limits, I&#39;m<br/>\nseeing that it  might be necessary to plan a certain allotment for each<br/>\nday and make that  available each morning and then not set restrictions<br/>\nor limits on  when/where/how they eat it. But this is still restricting<br/>\nin a sense, but  they don&#39;t have access to the whole supply in the<br/>\nhouse, so I&#39;m just not  sure how to make peace with this.<br/>\n<br/>\n-- Susan<br/>\n<br/>\n<br/>\n<br/>\nhi, Susan! could you budget their items *with* them, and menu plan too,  with <br/>\nthem? Possibly cook/bake/make some items, rather than purchasing them  <br/>\npre-made? Also, do you have a Trader Joe&#39;s near you? The costs there are a  pretty <br/>\ngood and have a fair amount of both gf and cf items _www.traderjoes.com_ <br/>\n(http://www.traderjoes.com)  just in case. I am just  thinking that the added <br/>\nparticipation might help slow the binge cycle you&#39;re  concerned about. and forgive <br/>\nme please if I said anything that has been said or  that is useless, I&#39;m too <br/>\nnew to know many here, yet :) <br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at http://www.aol.com.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with Food Limits","postDate":"1181350778","msgId":24303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0Y3UxcStzcmgyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTM1N2kxNjg0N2YwZm8zYTBmNDhmNDFlNzNkOTdhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":24300,"nextInTopic":24326,"prevInTime":24302,"nextInTime":24304,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"We have a GF kid, a CF kid and a corn-free kid. We don t buy the specialty stuff except for one or two packages. One, they go bad quite quickly, two, they","messageBody":"<div id=\"ygrps-yiv-431451763\">We have a GF kid, a CF kid and a corn-free kid. We don&#39;t buy the specialty stuff except for <br/>\none or two packages. One, they go bad quite quickly, two, they usually taste funny and <br/>\nthree, they are very expensive. We also do not buy the ingredients at the health food store, <br/>\nwhere rice flour is $5 a pound. We buy it at a Chinese supermarket,(its an hour drive from <br/>\nhere but worth it), where it&#39;s 50 for two pounds. We also buy rice noodles there,  they are <br/>\nusually 75 a pound. For the most part, we don&#39;t eat breads. We usually don&#39;t eat pasta <br/>\neither, but have a lot of rice, mashed potatoes or sweet potato cubes under our sauces.  <br/>\nSandwiches are just as good separated on the plate, or wrapped in a warm corn tortilla, <br/>\nand usually taste better than the rice bread.<br/>\nBecause we buy rice flour, tapioca starch and whatever else we need there, we save a lot of <br/>\nmoney and make our own muffins, cookies, etc. We also save a fortune on not buying <br/>\nregular snack foods, that are not safe. So I feel pretty good about buying snacks that are <br/>\nsafe because of all the money we have saved in not buying Oreo&#39;s, doritos, etc. You can <br/>\nbuy a lot of chips, a LOT of frito lays stuff is GFCF. that&#39;s about as carby as it gets. There&#39;s <br/>\na website that&#39;s good for what you can buy, alot of it is specialty, but alot not. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.tacanow.com/foodlist.htm\">http://www.tacanow.com/foodlist.htm</a><br/>\n<br/>\nanyway, kids get a lot of carbs from fruits and veggies, my kids do seek snack foods <br/>\nbecause they fulfill a niche, their sweet tooth and salty tongue etc etc. :-) That regular <br/>\nfood just does NOT hit. <br/>\n<br/>\nMelissa<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Susan &lt;SusanYvonne@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Does anyone have kids with special dietary needs? My two kiddos are on<br/>\n&gt; a gfcf diet and I&#39;m struggling with how to handle their access to the<br/>\n&gt; special foods we buy each week because they are *so* darn expensive<br/>\n&gt; that we can&#39;t afford to buy all that they would prefer to eat each<br/>\n&gt; week.<br/>\n&gt; <br/>\n&gt; So... should I just buy whatever we can afford, not limit it at all<br/>\n&gt; and then when it&#39;s gone it&#39;s gone? </span></blockquote></div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181349436","msgId":24300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTczN242YWEzZTRkNGhlOTUzNTZmZWY1NWNmMzNmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDg5MDg0My43ODc4Ni5xbUB3ZWIzMTkwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTM1N2kxNjg0N2YwZm8zYTBmNDhmNDFlNzNkOTdhQG1haWwuZ21haWwuY29tPgkgPDg5MDg0My43ODc4Ni5xbUB3ZWIzMTkwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":24295,"nextInTopic":24303,"prevInTime":24299,"nextInTime":24301,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"... Thank you Nicole, I ll look up that site. I used to order online but the prices weren t phenomenal. It s been a few years so I ll check it out again. Yes,","messageBody":"<div id=\"ygrps-yiv-2075091598\"><blockquote><span title=\"ireply\">&gt;  baked potatoes toped with a variety of things , hash browns and french fries. You can get a jar of loose popcorn for like $2 and a microwave popping bowl..then use ghee or a bit of the fleshmans light instead of butter...most mcormic seasonings are gfcf so a good way to experiment with different flavorings for the popcorn.<br/>\n&gt;   www.allergygrocer.com  may have better prices than those charged at local health food stores if you havent tried it before.<br/>\n<br/>\n<br/>\n </span></blockquote>Thank you Nicole, I&#39;ll look up that site. I used to order online but<br/>\nthe prices weren&#39;t phenomenal. It&#39;s been a few years so I&#39;ll check it<br/>\nout again. Yes, I suppose we could find other sources of (cheaper)<br/>\ncarbs for them. They love baked sweet potatoes and speaking of<br/>\npopcorn, I made a bunch today at the suggestion of the kids  :)<br/>\n<br/>\n-- Susan</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181341878","msgId":24292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTUzMW0zZjMxZmU2Ym5lMTg4NDc5NTM1NzBkOWViQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAwNTMwMWM3YWExYSRiNzkyYTBhMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTM1N2kxNjg0N2YwZm8zYTBmNDhmNDFlNzNkOTdhQG1haWwuZ21haWwuY29tPgkgPDAwNTMwMWM3YWExYSRiNzkyYTBhMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":24289,"nextInTopic":24295,"prevInTime":24291,"nextInTime":24293,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"... Hi Schuyler, That s a great site. We actually do bake quite a bit to keep costs down. Buying a pack of 5 cookies in the specialty food store is $3.99 ","messageBody":"<div id=\"ygrps-yiv-1406039456\"><blockquote><span title=\"ireply\">&gt; I don&#39;t know anything about gfcf diets, I just googled so I know a few more<br/>\n&gt; things than I did a few minutes ago, but could you bake things instead of<br/>\n&gt; buying them? Here&#39;s a site with recipes: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gfcfrecipes.com/\">http://www.gfcfrecipes.com/</a> Maybe<br/>\n&gt; if you baked things you could afford to have more of the foods they love<br/>\n&gt; around.<br/>\n<br/>\n </span></blockquote>Hi Schuyler,<br/>\n<br/>\nThat&#39;s a great site. We actually do bake quite a bit to keep costs<br/>\ndown. Buying a pack of 5 cookies in the specialty food store is $3.99<br/>\n(ridiculous). It IS cheaper to make certain things at home but<br/>\nunfortunately, even the alternative flour and other ingredients needed<br/>\nare still about 3-5 times more expensive than their regular<br/>\ncounterparts, mostly because they are uncommon and not purchased by<br/>\nlots of people.<br/>\n<br/>\nI don&#39;t think anyone needs to have experience with this specific diet<br/>\nto offer their thoughts on this (although I appreciate you going to<br/>\nthe trouble to look it up). I know there are families dealing with<br/>\nmany types of diets that require expensive foods. Just wondering how<br/>\nto meet their needs within our budget. Traditional thinking says to<br/>\nlimit and restrict. Right now they have free access to their special<br/>\nfoods but that&#39;s not working well because the supply runs out pretty<br/>\nfast and it&#39;s set up an unhealthy pattern.<br/>\n<br/>\n-- Susan</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181341009","msgId":24289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTMwMWM3YWExYSRiNzkyYTBhMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTM1N2kxNjg0N2YwZm8zYTBmNDhmNDFlNzNkOTdhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":24286,"nextInTopic":24292,"prevInTime":24288,"nextInTime":24290,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"I don t know anything about gfcf diets, I just googled so I know a few more things than I did a few minutes ago, but could you bake things instead of buying","messageBody":"<div id=\"ygrps-yiv-1160173531\">I don&#39;t know anything about gfcf diets, I just googled so I know a few more <br/>\nthings than I did a few minutes ago, but could you bake things instead of <br/>\nbuying them? Here&#39;s a site with recipes: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gfcfrecipes.com/\">http://www.gfcfrecipes.com/</a> Maybe <br/>\nif you baked things you could afford to have more of the foods they love <br/>\naround.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Susan&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SusanYvonne@...\">SusanYvonne@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, June 08, 2007 9:57 PM<br/>\nSubject: [unschoolingbasics] Help with Food Limits<br/>\n<br/>\n<br/>\n&gt; Does anyone have kids with special dietary needs? My two kiddos are on<br/>\n&gt; a gfcf diet and I&#39;m struggling with how to handle their access to the<br/>\n&gt; special foods we buy each week because they are *so* darn expensive<br/>\n&gt; that we can&#39;t afford to buy all that they would prefer to eat each<br/>\n&gt; week.<br/>\n&gt;<br/>\n&gt; So... should I just buy whatever we can afford, not limit it at all<br/>\n&gt; and then when it&#39;s gone it&#39;s gone? My concern (the hump I haven&#39;t been<br/>\n&gt; able to get over) is that it means this specialty food is usually<br/>\n&gt; consumed within the first 2-3 days which leaves no bread (or other<br/>\n&gt; grain items like muffins, pancakes, cookies, etc) for the rest of the<br/>\n&gt; week. This leaves them eating protein, veggies, and fruit for the<br/>\n&gt; remaining 4-5 days and while I realize that sounds like a strange<br/>\n&gt; thing to be concerned about, lol, both kids need lots of carbs in<br/>\n&gt; their diet or they get irritable pretty quickly and tend to &quot;search&quot;<br/>\n&gt; for food all day as if they aren&#39;t satisfied, even after eating (which<br/>\n&gt; they might not be if the meal was lacking in carbs).<br/>\n&gt;<br/>\n&gt; I also think this has set up a cycle of binging and then doing without<br/>\n&gt; which leads to binging again the next time the food&#39;s available and<br/>\n&gt; then doing without again for many days. I have a feeling that if we<br/>\n&gt; could afford to fill the house with an abundant supply, they would<br/>\n&gt; eventually relax and not feel the urge to eat it all up in 2 days<br/>\n&gt; flat. I see that this is the hording thing that happens when kids (and<br/>\n&gt; adults) feel like they might not get more. Unfortunately, we can&#39;t<br/>\n&gt; afford to buy this much. I&#39;m thinking that if, day after day, there<br/>\n&gt; was some available they might realize there will always be more<br/>\n&gt; tomorrow and this would help them relax. Right now it&#39;s binge,<br/>\n&gt; nothing, binge, nothing. This is the only food they do this with btw,<br/>\n&gt; but of course they are not limited in quantity on any other items,<br/>\n&gt; either.<br/>\n&gt;<br/>\n&gt; What to do? While I don&#39;t want to set restrictions or limits, I&#39;m<br/>\n&gt; seeing that it might be necessary to plan a certain allotment for each<br/>\n&gt; day and make that available each morning and then not set restrictions<br/>\n&gt; or limits on when/where/how they eat it. But this is still restricting<br/>\n&gt; in a sense, but they don&#39;t have access to the whole supply in the<br/>\n&gt; house, so I&#39;m just not sure how to make peace with this.<br/>\n&gt;<br/>\n&gt; -- Susan<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":305982612,"authorName":"luana","from":"&quot;luana&quot; &lt;luana@...&gt;","profile":"smilingbutterfly2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Help with Food Limits","postDate":"1181340194","msgId":24286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDIwMWM3YWExOCRkNmM5NmI5MCQ1NWI5Mjk0NkBHTEVOTj4=","inReplyToHeader":"PGY0Y2luZCt1c2JrQGVHcm91cHMuY29tPg=="},"prevInTopic":24285,"nextInTopic":24289,"prevInTime":24285,"nextInTime":24287,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"They might need more fats in their diet like butter and coconut oil. These fats help keep you full for a long time.  I was diagnosed with hypoglycemia when I","messageBody":"<div id=\"ygrps-yiv-1885770013\">They might need more fats in their diet like butter and coconut oil.<br/>\nThese fats help keep you full for a long time.  I was diagnosed with<br/>\nhypoglycemia when I was a kid.  I was starving all the time and very<br/>\ngrumpy when hungry.  I no longer have sugar crashes because I always eat<br/>\nfat with my meals.  I&#39;m 36, have three kids and feel better than I ever<br/>\ndid in my teens and twenties.  Thanks, Luana<br/>\n<br/>\n <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Susan<br/>\nSent: Friday, June 08, 2007 5:46 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Re: Help with Food Limits<br/>\n<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; they get irritable pretty quickly and tend to &quot;search&quot;<br/>\n&gt; for food all day as if they aren&#39;t satisfied, even after eating (which<br/>\n&gt; they might not be if the meal was lacking in carbs).<br/>\n<br/>\n </span></blockquote>Oops! I meant to write &quot;which they *might be* (unsatisfied) if the<br/>\nmeal was lacking in carbs.&quot;<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"&quot;Susan&quot; &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with Food Limits","postDate":"1181339181","msgId":24285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0Y2luZCt1c2JrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTM1N2kxNjg0N2YwZm8zYTBmNDhmNDFlNzNkOTdhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":24283,"nextInTopic":24286,"prevInTime":24284,"nextInTime":24286,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"... Oops! I meant to write which they *might be* (unsatisfied) if the meal was lacking in carbs.","messageBody":"<div id=\"ygrps-yiv-1866317612\"><blockquote><span title=\"ireply\">&gt; they get irritable pretty quickly and tend to &quot;search&quot;<br/>\n&gt; for food all day as if they aren&#39;t satisfied, even after eating (which<br/>\n&gt; they might not be if the meal was lacking in carbs).<br/>\n<br/>\n </span></blockquote>Oops! I meant to write &quot;which they *might be* (unsatisfied) if the<br/>\nmeal was lacking in carbs.&quot;</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help with Food Limits","postDate":"1181338664","msgId":24295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MDg0My43ODc4Ni5xbUB3ZWIzMTkwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTM1N2kxNjg0N2YwZm8zYTBmNDhmNDFlNzNkOTdhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":24292,"nextInTopic":24300,"prevInTime":24294,"nextInTime":24296,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"we did gfcf for a little while but it just wasnt seeming to help my son and you are right it is soooo expensive. Do you buy premade stuff and mixes ? If so","messageBody":"<div id=\"ygrps-yiv-1857603361\">we did gfcf for a little while but it just wasnt seeming to help my son and you are right it is soooo expensive. <br/>\n   <br/>\n  Do you buy premade stuff and mixes ? If so buying bulf flours ...rice, buckwheat, etc and making your own things could be an option to get more food for a lower cost. <br/>\n   <br/>\n  Also not saying cut out all of say the tapioca, brown rice ect bread but you can get 2-3 packages of plain rice cakes for the cost of 1 loaf of pre-made bread. The rice spaghetti is high but cheap compared to a lot of other things ..and a good source of carbs. Potato chips, baked potatoes toped with a variety of things , hash browns and french fries. You can get a jar of loose popcorn for like $2 and a microwave popping bowl..then use ghee or a bit of the fleshmans light instead of butter...most mcormic seasonings are gfcf so a good way to experiemnt with different flavorings for the popcorn. <br/>\n   <br/>\n  www.allergygrocer.com  may have better prices than those charged at local health food stores if you havent tried it before.<br/>\n   <br/>\n  Nicole <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nBored stiff? Loosen up...<br/>\nDownload and play hundreds of games for free on Yahoo! Games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Help with Food Limits","postDate":"1181336247","msgId":24283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwNjA4MTM1N2kxNjg0N2YwZm8zYTBmNDhmNDFlNzNkOTdhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":24285,"prevInTime":24282,"nextInTime":24284,"topicId":24283,"numMessagesInTopic":0,"msgSnippet":"Does anyone have kids with special dietary needs? My two kiddos are on a gfcf diet and I m struggling with how to handle their access to the special foods we","messageBody":"<div id=\"ygrps-yiv-171117326\">Does anyone have kids with special dietary needs? My two kiddos are on<br/>\na gfcf diet and I&#39;m struggling with how to handle their access to the<br/>\nspecial foods we buy each week because they are *so* darn expensive<br/>\nthat we can&#39;t afford to buy all that they would prefer to eat each<br/>\nweek.<br/>\n<br/>\nSo... should I just buy whatever we can afford, not limit it at all<br/>\nand then when it&#39;s gone it&#39;s gone? My concern (the hump I haven&#39;t been<br/>\nable to get over) is that it means this specialty food is usually<br/>\nconsumed within the first 2-3 days which leaves no bread (or other<br/>\ngrain items like muffins, pancakes, cookies, etc) for the rest of the<br/>\nweek. This leaves them eating protein, veggies, and fruit for the<br/>\nremaining 4-5 days and while I realize that sounds like a strange<br/>\nthing to be concerned about, lol, both kids need lots of carbs in<br/>\ntheir diet or they get irritable pretty quickly and tend to &quot;search&quot;<br/>\nfor food all day as if they aren&#39;t satisfied, even after eating (which<br/>\nthey might not be if the meal was lacking in carbs).<br/>\n<br/>\nI also think this has set up a cycle of binging and then doing without<br/>\nwhich leads to binging again the next time the food&#39;s available and<br/>\nthen doing without again for many days. I have a feeling that if we<br/>\ncould afford to fill the house with an abundant supply, they would<br/>\neventually relax and not feel the urge to eat it all up in 2 days<br/>\nflat. I see that this is the hording thing that happens when kids (and<br/>\nadults) feel like they might not get more. Unfortunately, we can&#39;t<br/>\nafford to buy this much. I&#39;m thinking that if, day after day, there<br/>\nwas some available they might realize there will always be more<br/>\ntomorrow and this would help them relax. Right now it&#39;s binge,<br/>\nnothing, binge, nothing. This is the only food they do this with btw,<br/>\nbut of course they are not limited in quantity on any other items,<br/>\neither.<br/>\n<br/>\nWhat to do? While I don&#39;t want to set restrictions or limits, I&#39;m<br/>\nseeing that it might be necessary to plan a certain allotment for each<br/>\nday and make that available each morning and then not set restrictions<br/>\nor limits on when/where/how they eat it. But this is still restricting<br/>\nin a sense, but they don&#39;t have access to the whole supply in the<br/>\nhouse, so I&#39;m just not sure how to make peace with this.<br/>\n<br/>\n-- Susan</div>","specialLinks":[]}],"prevTopicId":24509,"nextTopicId":24322}}