{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":121,"messages":[{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and limits - my 2 cents","postDate":"1264032126","msgId":42907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqODVodSs5cGRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2MjkxMy45NDY3Ni5xbUB3ZWIxMTIzMTkubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42906,"nextInTopic":42908,"prevInTime":42906,"nextInTime":42908,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... ****************** Ahhhh! Yes, you ve misunderstood something important. Helping kids see the reasons for things doesn t guarantee they ll agree with those","messageBody":"<div id=\"ygrps-yiv-1676750642\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Justice Riccardi &lt;j_riccardi@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;what i&#39;ve heard from unschoolers is that by explaining the reasoning behind the &quot;rules&quot; is what makes the children follow them on their own, without having to nag them or tell them no. maybe i&#39;m missing something? <br/>\n </span></blockquote>******************<br/>\n<br/>\nAhhhh! Yes, you&#39;ve misunderstood something important. Helping kids see the reasons for things doesn&#39;t guarantee they&#39;ll agree with those reasons, what it does is give them more to work with. They get to Think about reasons and weigh some reasons against other reasons. They get to Choose. <br/>\n<br/>\nRules don&#39;t guarantee that kids will follow rules. Rules very very frequently result in people finding ways to break, bend and shimmy around the rules. <br/>\n<br/>\nAs I said in another post, &quot;explaining&quot; isn&#39;t often a very good strategy for getting someone to change his or her behavior. Its generally better to have something else to offer, more options, better ideas. Its better still to be aware of needs and desires on a more general level so that you can Anticipate and offer those options and idea proactively. That way you don&#39;t set yourself up for conflict. <br/>\n<br/>\nA whooooole lot of the nuts and bolts of radical unschooling has to do with proactivity. When you&#39;re proactive regularly, kids come to know they can trust you to help them get their needs and desires met. Knowing they can trust you, they&#39;re waaaaaaaay more likely to listen to your reasons and give them more weight in their decision making, and they&#39;re also more likely to listen to the occasional explanation. <br/>\n<br/>\nThe important thing is that its not good to Start with trying to explain. Start by thinking ahead, do more planning, more advance problem solving. If you know that your kids &quot;always&quot; does xyz then find a new set of options to change the situation and make xyz a non-issue. The more of that you do, the less you&#39;ll find you &quot;need&quot; rules and limits. Try it! You can start being proactive without changing any other part of your parenting. And even if you come to decide that you want to stick with some rules, being proactive is an extremely valuable parenting tool, one that you&#39;ll be glad to have in your &quot;tool box&quot;.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264031965","msgId":42906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MTAwMTIwMTU1OW4xMTI2NzAwOXNmZjBjZTE0ZTY2YjBmMjIxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDU3NzQ3My4xMTUyMS5xbUB3ZWIxMTIzMDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDVERkVGMTQyLTg5OEYtNEUwOS05QkYwLUIzNkNDOUFFQTcwM0B2ZXJpem9uLm5ldD4JIDw1Nzc0NzMuMTE1MjEucW1Ad2ViMTEyMzA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":42905,"nextInTopic":42907,"prevInTime":42905,"nextInTime":42907,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Q-TIP, my favorite mantra: Quit Taking It Personally. YOU are not being attacked or rejected - your statements are, your beliefs are being challenged. You","messageBody":"<div id=\"ygrps-yiv-1530644898\">On Wed, Jan 20, 2010 at 1:57 PM, Justice Riccardi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:j_riccardi@...\">j_riccardi@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Wow! how I am supposed to read these responses and not be a little<br/>\n&gt; offended? I&#39;ve never been on a forum or listserv or support group and felt<br/>\n&gt; so attacked. sorry i don&#39;t fit into your strategies. sorry i gave the wrong<br/>\n&gt; advice. sorry i do things a little different. sorry i&#39;m &quot;shopping&quot; in your<br/>\n&gt; mom and pop shop. i found this group because i want to unschool my child as<br/>\n&gt; a homeschooling technique. i don&#39;t intend on doing radical unschooling in<br/>\n&gt; every way. i agree it works for education because it caters to my son&#39;s<br/>\n&gt; strengths and weaknesses. but it doesn&#39;t fit us for everything. it&#39;s my<br/>\n&gt; child, my family, so i can pick and choose what i want to use for what and<br/>\n&gt; from where.<br/>\n&gt;<br/>\n </span></blockquote>Q-TIP, my favorite mantra: Quit Taking It Personally. YOU are not being<br/>\nattacked or rejected - your statements are, your beliefs are being<br/>\nchallenged. You brought  them here, to an unschooling discussion board, and<br/>\nthey&#39;re being discussed indeed!<br/>\nI told folks for years and years and YEARS that single parenting was in no<br/>\nway, shape or form going to be a part of my future. Didn&#39;t work for me, was<br/>\noutside of the tenets of parenting I carried in my Soul. Yep, then Mitch<br/>\ndied and I became a single mama. That which I was NEVER, EVER gonna be. And<br/>\nhere, I&#39;ve blossomed. This path has led me more places than I could have<br/>\nimagined on the less-rocky, well-paved path I had laid out for myself.<br/>\nWhat I mean to say is, what you hold in your heart as True about the Radical<br/>\nUnschooling Life and it&#39;s impossibilities, those of us who have done the<br/>\nwork (on ourselves and in our daily lives) know *because we live it* that<br/>\nyour Truths are false.<br/>\nComing here with False Truths about a Life you have yet to see as possible,<br/>\nis insulting to the work done by the contributors here. It&#39;s a lot of work<br/>\nto be present with our kids; it&#39;s a blessing to have the opportunity to<br/>\nshare our gifts with folks who want to know what this life can be like.<br/>\nEveryday I live with unschooling principles in our Whole Life, our Whole<br/>\nAtypical Unplanned Joyful Life.  Quite possible, quite Real.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; why do moms keep judging and criticizing each other when we should be<br/>\n&gt; praising and encouraging one another instead?  i hold my ground that there<br/>\n&gt; isn&#39;t a one size fits all for parenting. what makes some people unschooling<br/>\n&gt; experts that can say the right and wrong way of doing things? i thought<br/>\n&gt; unschooling was all about there not being a right or wrong way. for being<br/>\n&gt; so non-conventional, you certainly aren&#39;t very accepting.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Status quo and hand patting reassurances, don&#39;t change lives in the way<br/>\nexamining principles and limits and beliefs and truths will.<br/>\nThere are lots of places, as Joyce has said, where support and reassurance<br/>\nfor doing the same ol&#39; thing, all over teh interwebs; one need not look<br/>\nfar.<br/>\nIf you want to be challenged to think about the roots of the Truths you<br/>\nhold, these gold mines are few and far between, you&#39;re already here &lt;3<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; on the topic of limits, do you have a child with bipolar disorder? or any<br/>\n&gt; mental illness for that matter? how about a child who&#39;s experienced severe<br/>\n&gt; trauma, loss, and grief?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I do. My son, Hayden, now 11, lost his father at 2 and his older sister at<br/>\n7.5. Living with me as his unlabeled mama who mucks her own way through<br/>\ngrief and depression has had a HUGE impact on our life and the daily choices<br/>\nwe make.<br/>\nAnd yes, unschooling - Whole Life Unschooling - saved our sanity and our<br/>\nrelationship.<br/>\nHannahbearski.wordpress.com began as the blog to update folks on my<br/>\ndaughter&#39;s illness and is now our family&#39;s journey blog.<br/>\nHannahsashes.blogspot.com is the blog I keep to share the stories of her<br/>\ncontinued impact on the world.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i&#39;m not saying i&#39;m parent of the year, or that i do all the right things,<br/>\n&gt; but i am saying that to judge my parenting style without walking in my shoes<br/>\n&gt; discredits you automatically in my eyes. i&#39;m here because i want to learn<br/>\n&gt; more about how unschooling fits into my life, but maybe i&#39;m in the wrong<br/>\n&gt; place.<br/>\n&gt;<br/>\n </span></blockquote>We can only know what you choose to share with *an unschooling discussion<br/>\nlist* - I, too, expect the advice given and the Truths shared to be those in<br/>\nline with how unschooling *works* in real life, not support for excuses<br/>\nwe&#39;ve all overcome to make it work.<br/>\nYou&#39;re here for a reason, it&#39;s the right place. Hang out and read, you&#39;ll<br/>\nsee we&#39;re all pretty normal - more tenacious maybe, than you&#39;re used to -<br/>\ncertainly folks you&#39;d like to know &lt;3<br/>\n<br/>\n<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and limits - my 2 cents","postDate":"1264030964","msgId":42905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqODRkaytocW9iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42904,"nextInTopic":42906,"prevInTime":42904,"nextInTime":42906,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... ***************** Arguably, its not even possible to teach self-control. At best, you can teach adherence to dogma. Self control is intrinsic (hence the","messageBody":"<div id=\"ygrps-yiv-2045819123\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Justice Riccardi &lt;j_riccardi@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;my son has special needs and major impulse control issues. i need to teach him self-control because he doesn&#39;t learn it on his own.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nArguably, its not even possible to teach self-control. At best, you can teach adherence to dogma. Self control is intrinsic (hence the name). You can Help kids move forward in developing self control, but some of that is also heavily dependent on temperament and physiological development. A child (person) with special needs, Needs more help, sometimes different kinds of help than typical kids, often for longer than typical kids. Needing help isn&#39;t the same as needing teaching. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;even if i explain why ...<br/>\n<br/>\n </span></blockquote>Explaining isn&#39;t a great solution even with typical kids. With young children and higer needs kids, its virtually useless. Instead of explaining, look for other solutions, other ways to meet the same needs, preferably proactively. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;even if i explain why jumping on the baby is not a good idea because it hurts her, blah blah blah. he still does it. there has to be a limit for that.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThinking in terms of limits is faulty thinking. There needs to be a better Solution for that, one that doesn&#39;t endanger other people. Maybe it means your son needs a helper presesnt all the time when he&#39;s around other people - that was the case with Ray for awhile, he needed someone at his side in any social situation to help him understand what was going on and help him get his needs met or else he would attack people. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;routines and schedules are important for young children. that&#39;s how they learn balance.<br/>\n </span></blockquote>********************<br/>\n<br/>\nIf a routine is important to a child, that child will develop a routine - that&#39;s not something you have to impose, although many parents find they have to Adapt to it. A child&#39;s natural routine doesn&#39;t always look like banker&#39;s hours. <br/>\n<br/>\nMy 8yo has a routine where she has a solid chunk of focused play/work time twice a day, she has a couple chunks of time where she does more relaxed play or watches tv, she has a chunk of time in the evening where she&#39;s very active. This isn&#39;t something she&#39;s been given, its something my partner and I have watched develop. Its not a &quot;schedule&quot; in the sense that you can set your watch by it (okay, the evening burst of energy was for awhile...6:30-8:30 every night for a couple years) but its a regular routine that we know about and can plan other activities around. <br/>\n<br/>\nMy 16yo has a more fluid schedule these days, one that revolves around his various work and classes. Since he&#39;s so very social, his routines have always been subject to other people, and when he was little that meant it helped him a whole lot for *me* to have a regular routine. If I was all over the place, so was he, and that stressed him out (and he&#39;d attack people or detroy things). He also needed a good bit of order around the house - a place for everything and everything in its place. Otherwise he wasn&#39;t able to find things, and that would stress him out. So, in order to meet his needs, *I* became more organized and developed a routine. I didn&#39;t do it to teach him a lesson about balance, I saw what helped him Be more balanced and changed my own behavior to create that. Now he&#39;s well able to adapt to changing schedules - without hurting people or destroying things. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;  balance is essential for all life. you can go overboard with any parenting technique.<br/>\n<br/>\n </span></blockquote>A certain amount of balance is a good thing, but its possible to have a &quot;tyranny of balance&quot; where you prevent yourself, or your kids from doing things for which you are passionate. Its Good to be passionate. There&#39;s a difference between being passionate, and being extreme. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and limits (sorry it is long)","postDate":"1264029627","msgId":42904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqODMzcitqOTlnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFQTczQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42903,"nextInTopic":42905,"prevInTime":42903,"nextInTime":42905,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Have to is probably the biggest limit unschoolers let go of. **The** conventional wisdom about parenting revolves around have to in the sense of you","messageBody":"<div id=\"ygrps-yiv-1949121648\"><blockquote><span title=\"ireply\">&gt; Think about &quot;have to&quot; anything -<br/>\n<br/>\n </span></blockquote>&quot;Have to&quot; is probably the biggest limit unschoolers let go of. **The** conventional wisdom about parenting revolves around &quot;have to&quot; in the sense of &quot;you Have to teach your kids certain things or they will suffer for it.&quot; But its not true. Kids can (and unschooling kids do) learn what they need to know without being taught - that&#39;s as true for &quot;life lessons&quot; as it is for reading. It isn&#39;t that you &quot;have to&quot; parent a certain way to unschool, its that by stepping away from the idea of &quot;have to&quot; entirely, you get a whole new perspective on life and relationships, one that happens to be called radical unschooling. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":271643104,"authorName":"Justice Riccardi","from":"Justice Riccardi &lt;j_riccardi@...&gt;","profile":"j_riccardi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264026452","msgId":42903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwODM0NC43OTc5My5xbUB3ZWIxMTIzMDEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDVERkVGMTQyLTg5OEYtNEUwOS05QkYwLUIzNkNDOUFFQTcwM0B2ZXJpem9uLm5ldD4="},"prevInTopic":42902,"nextInTopic":42904,"prevInTime":42902,"nextInTime":42904,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"going with your shopping analogy, i like eating organic produce from the mom and pop shop and twinkies from walmart in the same meal :) and it didn t sound","messageBody":"<div id=\"ygrps-yiv-1794145103\">going with your shopping analogy, i like eating organic produce from the mom and pop shop and twinkies from walmart in the same meal :)<br/>\n<br/>\nand it didn&#39;t sound like that person writing in was &quot;shopping&quot; in the mom and pop shop, it sounded like they were standing in the street deciding which way to go.<br/>\n<br/>\nJustice</div>","specialLinks":[]},{"userId":271643104,"authorName":"Justice Riccardi","from":"Justice Riccardi &lt;j_riccardi@...&gt;","profile":"j_riccardi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264026080","msgId":42902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MjkxMy45NDY3Ni5xbUB3ZWIxMTIzMTkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDlERjIwN0YzOUJCNTQzMjc5QkVFMjUxMUM5RjNGRjgwQExZTEFMQVAyPg=="},"prevInTopic":42901,"nextInTopic":42903,"prevInTime":42901,"nextInTime":42903,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"I never said that typical kids don t do those things. what i ve heard from unschoolers is that by explaining the reasoning behind the rules is what makes the","messageBody":"<div id=\"ygrps-yiv-1570162660\">I never said that typical kids don&#39;t do those things. what i&#39;ve heard from unschoolers is that by explaining the reasoning behind the &quot;rules&quot; is what makes the children follow them on their own, without having to nag them or tell them no. maybe i&#39;m missing something? and i never said my child or any child is ahuman (whatever that means). just that there&#39;s no one size fits all in parenting, and i stand by that statement.<br/>\n<br/>\nJustice</div>","specialLinks":[]},{"userId":271643104,"authorName":"Justice Riccardi","from":"Justice Riccardi &lt;j_riccardi@...&gt;","profile":"j_riccardi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264024678","msgId":42901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NzQ3My4xMTUyMS5xbUB3ZWIxMTIzMDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDVERkVGMTQyLTg5OEYtNEUwOS05QkYwLUIzNkNDOUFFQTcwM0B2ZXJpem9uLm5ldD4="},"prevInTopic":42900,"nextInTopic":42902,"prevInTime":42900,"nextInTime":42902,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"Wow! how I am supposed to read these responses and not be a little offended? I ve never been on a forum or listserv or support group and felt so attacked.","messageBody":"<div id=\"ygrps-yiv-521248019\">Wow! how I am supposed to read these responses and not be a little offended? I&#39;ve never been on a forum or listserv or support group and felt so attacked. sorry i don&#39;t fit into your strategies. sorry i gave the wrong advice. sorry i do things a little different. sorry i&#39;m &quot;shopping&quot; in your mom and pop shop. i found this group because i want to unschool my child as a homeschooling technique. i don&#39;t intend on doing radical unschooling in every way. i agree it works for education because it caters to my son&#39;s strengths and weaknesses. but it doesn&#39;t fit us for everything. it&#39;s my child, my family, so i can pick and choose what i want to use for what and from where. why do moms keep judging and criticizing each other when we should be praising and encouraging one another instead?  i hold my ground that there isn&#39;t a one size fits all for parenting. what makes some people unschooling experts that can say the right and wrong way of doing things? i thought<br/>\n unschooling was all about there not being a right or wrong way. for being so non-conventional, you certainly aren&#39;t very accepting.<br/>\n<br/>\non the topic of limits, do you have a child with bipolar disorder? or any mental illness for that matter? how about a child who&#39;s experienced severe trauma, loss, and grief? i&#39;m not saying i&#39;m parent of the year, or that i do all the right things, but i am saying that to judge my parenting style without walking in my shoes discredits you automatically in my eyes. i&#39;m here because i want to learn more about how unschooling fits into my life, but maybe i&#39;m in the wrong place.<br/>\n<br/>\nJustice</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264022440","msgId":42900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVERkVGMTQyLTg5OEYtNEUwOS05QkYwLUIzNkNDOUFFQTcwM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42899,"nextInTopic":42901,"prevInTime":42899,"nextInTime":42901,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Ya, know, this attitude pops up every once in a while to advise people against accepting unschooling information lock stock and barrel. And I don t get it.","messageBody":"<div id=\"ygrps-yiv-1503718626\"><blockquote><span title=\"ireply\">&gt; you can go overboard with any parenting technique. just find the  <br/>\n&gt; groove that works for you instead of trying to fit all the way into  <br/>\n&gt; one box.<br/>\n<br/>\n </span></blockquote>Ya, know, this attitude pops up every once in a while to advise  <br/>\npeople against accepting unschooling information lock stock and barrel.<br/>\n<br/>\nAnd I don&#39;t get it. This is a tiny niche off in a corner of the  <br/>\nworld. People can&#39;t stumble across this list first thing when they&#39;re  <br/>\nlooking for conventional parenting advice. They have to already be  <br/>\nlooking for something other than conventional ways and specifically  <br/>\nlooking for unschooling to find this place.<br/>\n<br/>\nPeople can get conventional parenting advice anywhere. When people  <br/>\ncome  here they should be expecting to hear a different approach. Why  <br/>\n*would* they want the same information they can get at Parenting.com?<br/>\n<br/>\nIn fact, this list is sort of like a little mom and pop natural food  <br/>\nstore off on a side street that someone practically needs to know is  <br/>\nthere to find it. The person shopping there isn&#39;t there because they  <br/>\ndon&#39;t know the Super Duper Food Mart doesn&#39;t exist. That&#39;s not  <br/>\npossible! They&#39;re there specifically for something different. If they  <br/>\nwanted same old, same old, they&#39;d be at the Super Duper. If they  <br/>\ndon&#39;t like what mom and pop have, they know the Super Duper will  <br/>\nstill be there. For someone to stand in the mom and pop store and  <br/>\ntell shoppers they don&#39;t have to only buy from the mom and pop store  <br/>\ndoesn&#39;t make sense. And is a tad insulting of the shoppers&#39;  <br/>\nintelligence. How could they possibly have gotten here without  <br/>\nknowing that?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264022325","msgId":42899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNjQ4N0I3NjYxQzQwMzY4QjU0MTUzMTZDREQ5ODMyQENvbm5pZVBDPg==","inReplyToHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42898,"nextInTopic":42900,"prevInTime":42898,"nextInTime":42900,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Routines and schedules do not equal balance. Routines and schedules create predictability. Routines and schedules create a narrow box. Sometimes, routines","messageBody":"<div id=\"ygrps-yiv-1477632050\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; routines and schedules are important for young children. that&#39;s how they learn balance.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Routines and schedules do not equal balance. Routines and schedules create predictability. Routines and schedules create a narrow box. Sometimes, routines and schedules limit creativity as well as spontaneity. How do you teach a child to handle the unexpected if everything is part of a routine or schedule? Life is full of unexpected events that cannot be scheduled or cannot be anticipated in a daily routine.  <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264021015","msgId":42898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlERjIwN0YzOUJCNTQzMjc5QkVFMjUxMUM5RjNGRjgwQExZTEFMQVAyPg==","inReplyToHeader":"PDNFNTA1N0E1LUE5MUYtNEJDNC04QkQ4LUUxNEQ0NzUzQTYxRUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPiA8M0U1MDU3QTUtQTkxRi00QkM0LThCRDgtRTE0RDQ3NTNBNjFFQHZlcml6b24ubmV0Pg=="},"prevInTopic":42897,"nextInTopic":42899,"prevInTime":42897,"nextInTime":42899,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"Do you think that typical kids don t injure animals or destroy property or do things that are unsafe? Do you think that telling them that something is hurtful,","messageBody":"<div id=\"ygrps-yiv-1916831574\">Do you think that typical kids don&#39;t injure animals or destroy <br/>\nproperty or do things that are unsafe?<br/>\n<br/>\nDo you think that telling them that something is hurtful, destructive <br/>\nor unsafe makes them stop?<br/>\n<br/>\nYes, typical kids do do unsocial things before they can understand <br/>\n*and* stop themselves from doing it. And, no, telling them before <br/>\nthey&#39;re ready to control their impulses doesn&#39;t help at all.<br/>\n**********************<br/>\n<br/>\nexactly.  one phrase/concept i&#39;ve encountered wrt &quot;atypical&quot; children, that i think applies to ANY child is the notion that we as parents, with mature frontal lobes (hopefully) have the responsibility of being our children&#39;s &quot;surrogate frontal lobe&quot;  until/while their own is developing it&#39;s abilities in areas such as impulse control, predictive skills, etc.  <br/>\n<br/>\nyoung kids&#39; frontal lobes are not mature.  the research seems to show that the frontal lobe does not mature fully until sometime between age 14 annd 31!!  at age 5, it&#39;s about 25% of it&#39;s full maturity (this is of course an average - i&#39;d be willing to bet that kids whose parents take their role as surrogate frontal lobe seriously and are skilled at it, might mature faster than *that same child* would have (not than other children!) had their parent tried to &quot;teach them&quot; cognitive/brain skills for which their exisiting brain was not ready.<br/>\n<br/>\n<br/>\n********************************<br/>\nAtypical children may have more intense reactions. Their <br/>\nunderstanding may not develop at the same pace. They may have more <br/>\nquirks than typical children. But they aren&#39;t ahuman. They&#39;re going <br/>\nto react to being told what to do just like typical children -- and <br/>\nadults. Perhaps more intensely!<br/>\n************************<br/>\n<br/>\nexactly!  and those reactions put them and their brains in a state that makes it even *harder* to absorb the &quot;lesson&quot; or develop new skills!<br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1264019932","msgId":42897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNTA1N0E1LUE5MUYtNEJDNC04QkQ4LUUxNEQ0NzUzQTYxRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42896,"nextInTopic":42898,"prevInTime":42896,"nextInTime":42898,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Do you think that works with typical children? I bet the He doesn t listen to me comes up on the unschooling forums more than She doesn t read yet. But","messageBody":"<div id=\"ygrps-yiv-1141243776\">On Jan 19, 2010, at 1:44 PM, Justice Riccardi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; even if i explain why jumping on the baby is not a good idea  <br/>\n&gt; because it hurts her, blah blah blah.<br/>\n<br/>\n </span></blockquote>Do you think that works with typical children?<br/>\n<br/>\nI bet the &quot;He doesn&#39;t listen to me&quot; comes up on the unschooling  <br/>\nforums more than &quot;She doesn&#39;t read yet.&quot;<br/>\n<br/>\nBut the advice isn&#39;t to teach them self control. The advice is to be  <br/>\nwith them, redirecting them, help them with better ways of being.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; there has to be a limit for that. for injuring people/animals, for  <br/>\n&gt; destroying property, for being safe.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Do you think that typical kids don&#39;t injure animals or destroy  <br/>\nproperty or do things that are unsafe?<br/>\n<br/>\nDo you think that telling them that something is hurtful, destructive  <br/>\nor unsafe makes them stop?<br/>\n<br/>\nYes, typical kids do do unsocial things before they can understand  <br/>\n*and* stop themselves from doing it. And, no, telling them before  <br/>\nthey&#39;re ready to control their impulses doesn&#39;t help at all.<br/>\n<br/>\nAtypical children may have more intense reactions. Their  <br/>\nunderstanding may not develop at the same pace. They may have more  <br/>\nquirks than typical children. But they aren&#39;t ahuman. They&#39;re going  <br/>\nto react to being told what to do just like typical children -- and  <br/>\nadults. Perhaps more intensely!<br/>\n<br/>\nI&#39;m not dismissing what it&#39;s like to raise an atypical child. But  <br/>\nthere are many here who *did* trust that what their atypical children  <br/>\nneeded was support, trust and help, who didn&#39;t resort to teaching,  <br/>\nwhose children are flourishing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i also have to tailor it for my family, for my kids, and for my  <br/>\n&gt; values and comfort level.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>If this list were about how people tailor unschooling to make their  <br/>\ncomfortable, it wouldn&#39;t be about unschooling. It would be about  <br/>\nwhatever.<br/>\n<br/>\nWhile not everyone here needs to be a radical unschooler, the  <br/>\ndiscussion is about radical unschooling approaches to problems. There  <br/>\nmay be dozens of approaches to every problem a parent can face. There  <br/>\nmay be many that will make a parent uncomfortable so she&#39;ll dismiss  <br/>\nthem. There are only a few places on the planet where people can  <br/>\npresent a problem and have a handful to dozens of answers that help  <br/>\nthem build relationships while they approach the problem.<br/>\n<br/>\nIt doesn&#39;t help to water the information down with conventional  <br/>\nteaching and control ideas that can be found anywhere. If you  <br/>\ncouldn&#39;t figure out how to do it, couldn&#39;t make it work, don&#39;t trust  <br/>\nthat it could work, that doesn&#39;t negate the experiences of the  <br/>\nunschoolers who did find ways to make it work.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; limits are necessary, especially for younger children. that&#39;s where  <br/>\n&gt; you build the basis of self-control. routines and schedules are  <br/>\n&gt; important for young children. that&#39;s how they learn balance.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This is pretty much standard party line straight from the  <br/>\nconventional parenting handbook.<br/>\n<br/>\nThe problem is that the majority of people have experience with two  <br/>\nkinds of kids: controlled kids and permissively parented kids. They  <br/>\nhave *zero* experience with kids who are raised with &quot;Let&#39;s figure  <br/>\nout how to do that,&quot; rather than limits. Who have rhythms to their  <br/>\ndays rather than routines and schedules. Who find that joy is better  <br/>\nthan balance.<br/>\n<br/>\nThere are people here who began unschooling over 15 years ago who  <br/>\nhave grown children and not a bit of the above is necessary to raise  <br/>\ncaring, thoughtful adults.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and limits (sorry it is long)","postDate":"1263994233","msgId":42895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFQTczQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42893,"nextInTopic":42896,"prevInTime":42894,"nextInTime":42896,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Yes, life is full of REAL limits...most of the limits on kids are arbitrary parent-imposed limits. For instance, you must go to bed at 8 pm ...but then","messageBody":"<div id=\"ygrps-yiv-36091153\"><blockquote><span title=\"ireply\">&gt;Life is full of limits<br/>\n<br/>\n </span></blockquote>Yes, life is full of REAL limits...most of the limits on kids are<br/>\narbitrary parent-imposed limits. For instance, &quot;you must go to bed at 8<br/>\npm&quot;...but then once they reach a certain age, that moves to 9 or 10 or<br/>\nwhatever, and sometimes it&#39;s okay to stay up late (like when us parents<br/>\nare visiting at a friend&#39;s house and the kids &quot;get to&quot; stay up) even if<br/>\nyou&#39;re only 7. How confusing is that? <br/>\n<br/>\n <br/>\n<br/>\nThink about real limits - can&#39;t have a snowball fight in the Sahara<br/>\n(unless you have a snow making machine and lots of water shipped in);<br/>\ncan&#39;t have chocolate chip cookies without chocolate chips; have to eat<br/>\nsomething, drink water, sleep, poop on something of a routine schedule<br/>\nor you risk death - though some CHOOSE to not eat or drink as a form of<br/>\nprotest for example knowing they risk death - it&#39;s a choice. <br/>\n<br/>\n <br/>\n<br/>\nThink about &quot;have to&quot; anything -<br/>\n<br/>\nDon&#39;t have to wash dishes...can eat out, use disposables, eat right from<br/>\nthe packages, discard and buy more plates, eat off the encrusted plates<br/>\n(sounds yuck but hey, it is an option).<br/>\n<br/>\nDon&#39;t have to go to work...yeah, you&#39;ll lose the job but that&#39;s a<br/>\nchoice; but what about money for food, house, etc? Ah, those are choices<br/>\n- you could camp on public land, scavenge dumpsters for food, etc. Okay<br/>\nso maybe that&#39;s not appetizing so you CHOOSE to find a way to make<br/>\nmoney. See? Going to work is a choice.<br/>\n<br/>\nDon&#39;t have to make meals for the family...can order from restaurants,<br/>\nbuy premade meals at the market, turn them loose in the kitchen on their<br/>\nown, and so on. Choosing to gift your family with a meal is your Choice.<br/>\n<br/>\nOnce your life is freed from a &#39;have to&#39; mindset to an &quot;I choose&quot;<br/>\nmindset, things change.<br/>\n<br/>\n <br/>\n<br/>\n--Deb R<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and limits (sorry it is long)","postDate":"1263945398","msgId":42893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqNWdybSsxMGdsNkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":42892,"nextInTopic":42895,"prevInTime":42892,"nextInTime":42894,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... ***************** Think about what you wrote there, for a second - if kids *do* know what they want and don t want then they aren t looking for whatever,","messageBody":"<div id=\"ygrps-yiv-1945337014\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Monica Van Stelton &lt;tatyland_usa@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What I don&#39;t understand is about not having any limits...I really like some of the unschooling ideas or principles, and I understand that children are not dumb and they know what they want or not... but I can&#39;t understand the no limit idea. I can&#39;t understand that letting your child do whatever, whenever is good.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThink about what you wrote there, for a second - if kids *do* know what they want and don&#39;t want then they aren&#39;t looking for &quot;whatever, whenever&quot; they&#39;re looking to have their needs and desires met. That&#39;s something that we parents can stand in the way of, or we can find ways to help. Sometimes it&#39;s not possible for a person (of any age) to get exactly what she wants in exactly the way she wants it right this very minute - and unschoolers aren&#39;t trying to pretend otherwise. Rather, parents get to be a source of ideas and options. Instead of saying &quot;no&quot; we can say &quot;lets figure this out&quot;. That&#39;s valuable! It sets us up as trustworthy advocates for our kids, the people they Want to talk to, want to ask for help and advice. <br/>\n<br/>\nKids don&#39;t want to be hurt, but when asking parents for help doesn&#39;t get them anywhere, they&#39;re more likely to risk getting hurt to get what they want. That&#39;s natural human behavior - we&#39;re determined! We persevere! When kids have a lot of &quot;extra&quot; limits and rules then they&#39;ll persevere in getting around those things to get what they want. When kids don&#39;t have those extra limits, they get to persevere in doing what they really want to do. They get to be exciting, passionate people!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;because it sounds to me if this is the case that unschooling goes hand in hand with permissive parenting...and that is proven to be unhealthy for children in a way.<br/>\n </span></blockquote>***************<br/>\n<br/>\n&quot;Whatever, whenever&quot; Is unhealthy - because its not about helping kids fill their needs and desires. Its dis-engaged parenting, whereas unschooling is More engaged parenting. Instead of &quot;whatever&quot; its &quot;let me help&quot;. Instead of &quot;whenever&quot; its &quot;let me get these clothes in the dryer and I&#39;ll be happy to...&quot; or &quot;it will take a few weeks to save up for that, shall we put it on the wish list?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So of one day my son turns 13 and he wants to have sex then I can&#39;t say no, same with drugs and alcohol...If he wants to go party and comeback the next day is ok too...IS this right?<br/>\n </span></blockquote>******************<br/>\n<br/>\nI have a 16yo who is &quot;allowed&quot; to do those things if he wants to. He&#39;s not some kind of terrible delinquent. He has friends in their late teens/early twenties who have the sorts of typical parties of kids that age - lots of over-the-top drinking - and Ray chooses not to go to those, or stay very long once the drinking gets going. He finds that all kind of dull and silly. <br/>\n<br/>\nSince Ray is &quot;allowed&quot; to do what he wants, he doesn&#39;t have the need to &quot;prove himself&quot; that a lot of teenageers experience. That takes some of the pressure off him where sex is concerned. He doesn&#39;t have to prove he&#39;s a man by getting laid, so he can think about feelings and relationships - his own and those of any potential partner - that&#39;s not a luxury that a lot of teens have. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I can&#39;t tell my baby I am tired you can fix your own breakfast...<br/>\n<br/>\n </span></blockquote>When he gets older, though, you can have snacks on low shelves that are all ready to go, so that you&#39;re not having to cook if you&#39;re too tired *and* he can still have breakfast. That&#39;s a quick and dirty example of a way to work around a natural limit. Moms get tired! But that doesn&#39;t always have to be a reason to say &quot;no&quot; if we&#39;re creative and do some thinking ahead of time. A surprising number of limits can fall by the wayside with some pre-planning - that&#39;s why, in families with several kids there tend to be less rules on the youngest than there were for the oldest: parents learn what to expect and can think ahead more. Happily, you don&#39;t have to wait until you have three kids to do that, though - you can learn to do it Right Now! You can learn to be more proactive. One of the things this list is for is to help parents figure out how to do that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t have to have any limit for my son, so he calls asleep when he wants to even if he is in his highchair<br/>\n </span></blockquote>**************<br/>\n<br/>\nSo, one example of being proactive might be noticing that your guy tends to get drowsy when he&#39;s in his high-chair and rearrange how you&#39;re doing things so that he&#39;s not falling asleep in an uncomfortable position. It might mean trying out some slings so you can carry him while he&#39;s falling asleep. It might mean changing when and how you do dinner, if he&#39;s falling asleep in the meal.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Will we still be unschoolers...","postDate":"1263940918","msgId":42892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqNWNmbSsxZXRxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqMzI5ais4dXZpQGVHcm91cHMuY29tPg=="},"prevInTopic":42891,"nextInTopic":42893,"prevInTime":42891,"nextInTime":42893,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Well, but if awesomeness is something you value - one of your principles - and you re striving to live more by that principle, to be more awesome and","messageBody":"<div id=\"ygrps-yiv-614619007\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My new goal is not to be radical as much as awesome.<br/>\n<br/>\n </span></blockquote>Well, but if &quot;awesomeness&quot; is something you value - one of your principles - and you&#39;re striving to live more by that principle, to be more awesome and invite more awesomeness into your life, then you could very well be moving closer to radical unschooling in the process. To some extent it depends on what you mean by &quot;awesome&quot;. If you mean that you&#39;re working on being more positive, more energetic, more thoughtful, more open to possibilities.... gosh that&#39;s sounding a lot like radical unschooling. If &quot;awesome&quot; comes with a list of dos and don&#39;ts, a set of rules defining &quot;awesomeness&quot; then not so much. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits (sorry it is long)","postDate":"1263936783","msgId":42891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4RTgyM0YxNTEzRTREQjA5RTFCMDcxQzc1QjdDQzU0QENvbm5pZVBDPg==","inReplyToHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg==","referencesHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":42890,"nextInTopic":42892,"prevInTime":42890,"nextInTime":42892,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... I am not as seasoned as those that have already responded so I might be able to offer a slightly different perspective. It is not that there are no limits.","messageBody":"<div id=\"ygrps-yiv-1543647841\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;What I don&#39;t understand is about not having any limits...I really like some of the unschooling ideas or principles, and I understand that children are not dumb and they know what they want or not... but I can&#39;t understand the no limit idea. I can&#39;t understand that letting your child do whatever, whenever is good.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I am not as seasoned as those that have already responded so I might be able to offer a slightly different perspective. It is not that there are no limits. The world we live in is full of limits. What I try to do is remove the arbitrary limits and help my kids understand the natural limits. I encourage them to ask questions. The traditional phrase &quot;because I said so&quot; is a phrase I try to avoid. I am constantly trying to build up the relationship that I have with my kids. If they trust me and know that I don&#39;t go around saying no just for the fun of it, they are more likely to trust me when there is a limit that arises. When I do have to set a limit, I try to make sure that it is not completely arbitrary and I try to make sure that my kids have a voice in the decision making process. I am thinking of things like being loud and waking up their dad in the middle of the night. We have had to impose a limit on the amount of noise that can be made in the middle of the night because their dad needs his sleep so that he can get up and go to work in the morning. I take the time to explain to them why their dad needs sleep and why it is important for their dad to work. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; Anyway, to be an unschooling family let say, I don&#39;t have to have any limit for my son, so he calls asleep when he wants to even if he is in his highchair, I shouldn&#39;t childproof the house because that limits where he can go or explore, no cribs, no  no&#39;s, TV all day any day, etc.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I don&#39;t think about it in terms of limits. I think of it more in terms of treating my kids how I would like to be treated or how I would treat my spouse or any other adult. If my spouse were to fall asleep in an uncomfortable position, I would likely wake him up so he could go lay down somewhere more comfortable. If my child falls asleep in an uncomfortable position, I will gently move them to a place that is more comfortable. My house isn&#39;t childproofed per se but I have made sure that it is safe. There are no knives or other sharp objects. I try to make sure that choking hazards are removed. I also make sure that I have put up anything that is super important to me. I also try to have realistic expectations. I don&#39;t expect my 1 year old to be able to keep herself safe from potential hazards so I stay close so that I can catch her if I need to. I try to create an environment where I don&#39;t have to say no. We tend to have the TV on pretty much all day when we are home. It is interesting to note that my 1 year old ignores and my almost 3 year old only watches it in small doses. I am sure that the links the others have provided are full of useful stuff. My 8 year old and 5 year old don&#39;t care about the TV most of the time. It is just there for background noise.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;So of one day my son turns 13 and he wants to have sex then I can&#39;t say no, same with drugs and alcohol...If he wants to go party and comeback the next day is ok too...IS this right? I am asking this because I really want to understand how it works, because it sounds to me if this is the case that unschooling goes hand in hand with permissive parenting...and that is proven to be unhealthy for children in a way.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It is not about never saying no. It is about explaining and helping them navigate the world. It&#39;s about giving kids a voice. I say no to my kids from time to time but they are given the opportunity to challenge that. My 8 year old wanted me to buy her a Nintendo DS. We didn&#39;t have the money so I had to say no. I could have chosen to buy the DS rather than buying groceries but that wouldn&#39;t have made sense. Her desire for a DS did not trump the families need to eat. It would have been ridiculous for me to say yes. I took the time to explain why I was saying no. She took it to heart and found a way to save up her own money and get it anyway. I am always explaining things to my children. <br/>\n<br/>\nIf the average child is 13 and wants to have sex, there is a good chance that you will never know about it. Most parents have made sex into a taboo topic. If a kid starts asking about sex, most parents shut down. I think about the things that I did as a teen. If I had asked my parents permission, they would have definitely said no. So, I didn&#39;t ask them. I just did it. Most of the time, they never found out so there was never a need to have a discussion with them. My goal is to create a relationship where no is not the default answer. My goal is to get my child to come to me so that we can discuss things in a sensible manner. If my 13 year old comes to me with questions about sex, I am going to answer them and be up front about them. My 8 year old has been asking a lot of questions about sex because she hears about it in the world around her. I also try not to think about everything in terms of yes or no. There are a lot of gray areas between yes and no. Instead of saying yes or no, my family tries to explore the areas in between. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Maybe some of you that have homeschool for long time and have children that had grown can help me understand how all of this works. I don&#39;t see how letting a child watch tv all day or do whatever they want is good. While saying no all the time and holding them back from being who they are and want to be is not good, throwing them in the jungle without a guide is not good either.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I would never ever throw my children out into the world without some kind of guidance. I do not think that the goal of unschooling is to throw your children to the wolves. The way I understand it is that you help your children find their own natural limits in a respectful environment. My children are given the same respect and voice that the adults in the house have. If my children want to do something, we talk about it and we do it together. My kids are all 8 and under so I still do a lot of hand holding. I don&#39;t know what unschooling will look like with the older kids but with the younger ones it is great because I can slowly see them gaining confidence in themselves and their own abilities. Instead of telling them no, I tell them sure, go ahead. If you need anything, I am here to help. My understanding is that the basis of unschooling is honesty and communication. More important is knowing when to talk and when to shut up. : -)<br/>\n<br/>\nConnie (mom of 4)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits (sorry it is long)","postDate":"1263935144","msgId":42890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MTE0Ny41Nzc5OC5xbUB3ZWIxMTMyMDcubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg==","referencesHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":42889,"nextInTopic":42891,"prevInTime":42889,"nextInTime":42891,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... I ve been unschooling for 17 years....but I also have a 19 month old--so I can speak to this as a mom with a little one, AND a long-time unschooler. My","messageBody":"<div id=\"ygrps-yiv-355320751\"><blockquote><span title=\"ireply\">&gt;&gt;Anyway, to be an unschooling family let say, I don&#39;t have to have any limit for my son, so he calls asleep when he wants to even if he is in his highchair, I shouldn&#39;t childproof the house because that limits where he can go or explore, no cribs, no  no&#39;s, TV all day any day, etc.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ve been unschooling for 17 years....but I also have a 19 month old--so I can speak to this as a mom with a little one, AND a long-time unschooler.<br/>\n<br/>\nMy little one likes to get into the kitchen drawers....so I put the knives in a knife block on the counter, where she can&#39;t reach.  That doesn&#39;t put a stop to her exploring, it doesn&#39;t mean I have to tell her &quot;no&quot;, it means that she can explore safely.  That&#39;s not having &quot;no limits&quot;--letting baby juggle knives--it&#39;s making her environment safe and fun for her. That&#39;s just one example--but shows how *I* change rather than expecting my baby to. It means we don&#39;t keep breakables out where baby can reach, it means we keep the lowest bookshelves filled with her books and toys, it means that if she wants to play on the computer, someone sits with her and helps her do it safely, helps her figure out the mouse, shows her slideshows of herself, helps her find elmo on netflix and shows her how to find what she wants to watch next.  If she wants to jump on the couch or the bed, her dad or I stands next to the edge to catch her.  If she wants to go down the stairs,<br/>\n we stay with her early and often, and soon she knows how to well and doesn&#39;t have to be gated out of them.  It means she&#39;s able to try any foods that the rest of the family is eating, but we might chew it up for her first, or cut it in half, or blow on it for her.  We are there to help make the world accessible to her.  I imagine typical parents would do something more like--You can&#39;t jump on the bed because it&#39;s not safe.  You can&#39;t eat hot dogs or grapes because you could choke.  You can&#39;t go down the stairs because you might fall.  You can&#39;t touch the computer because it&#39;s expensive.  You can&#39;t play in the kitchen because you might get cut.  <br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;So of one day my son turns 13 and he wants to have sex then I can&#39;t say no, same with drugs and alcohol...If he wants to go party and comeback the next day is ok too...IS this right? I am asking this because I really want to understand how it works, because it sounds to me if this is the case that unschooling goes hand in hand with permissive parenting...and that is proven to be unhealthy for children in a way.&gt;&gt;<br/>\n<br/>\n </span></blockquote>My other two children are teenagers--my eldest will be 18 this year!  I am fully and completely involved in my kids&#39; lives, and their friends, and their interests.  My kids are &quot;allowed&quot; to have sex, drink, do drugs, etc--as I don&#39;t limit them--but do they?  No.  They drink with us sometimes, if we make something yummy, but usually just sips, as they are not interested in drinking until they can &quot;feel it&quot;.  They&#39;ve also been exposed to drugs and haven&#39;t had any interest in trying, despite it being completely acceptable in our area and social circles.  My eldest went away for more than a month with other teens, and didn&#39;t come back pregnant or in jail ;)  My kids know what responsible drinking means, what responsible sex means, and how to say &quot;no&quot; if they aren&#39;t interested.  We all trust each other fully to talk about our needs and help each other achieve them.  Being the parent of an unschooled teen is NOTHING like being the parent of a &quot;normal&quot; teen. <br/>\n (Or at least what I hear--I&#39;ve never done it!)<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits (sorry it is long)","postDate":"1263928868","msgId":42889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MTQzNy45Mzc5NS5xbUB3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg==","referencesHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":42888,"nextInTopic":42890,"prevInTime":42888,"nextInTime":42890,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1930018572\">&lt;&lt;&lt;I am sitting here trying to understand what is unschooling. ..I was watching some videos of  Dayna Martin explaining what is unschooling and she says that is based on the belief that children learn from self motivation or inner drive and it totally make sense...I even learned that went I was going to college to be a teacher. &gt;&gt;&gt;&gt;<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nThere is mouch more to unschooling than that I highly suggest reading at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;What I don&#39;t understand is about not having any limits...&gt;&gt;&gt;&gt;<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/limits\">http://sandradodd.com/limits</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/freedom\">http://sandradodd.com/freedom</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/logic\">http://sandradodd.com/joyce/logic</a><br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;I really like some of the unschooling ideas or principles, and I understand that children are not dumb and they know what they want or not... but I can&#39;t understand the no limit idea. I can&#39;t understand that letting your child do whatever, whenever is good. And even though I was raised the &quot;common&quot; way I don&#39;t fallow it totally at all.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nHere some more to add to above:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\n &lt;&lt;&lt;&lt;&lt;&lt;&lt;Anyway, to be an unschooling family let say, I don&#39;t have to have any limit for my son, so he calls asleep when he wants to even if he is in his highchair, I shouldn&#39;t childproof the house because that limits where he can go or explore, no cribs, no  no&#39;s, TV all day any day, etc. &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\nIs that all you are hearing? Don&#39;t do this or don&#39;t do that ?<br/>\nUnschooling is much more about doing than NOT doing.<br/>\nWhy would you let your child fall asleep in a high chair if you know the child is tired and needs a nap?<br/>\nWHy would you not make your home safe for a toddler or infant to explore?<br/>\nDo you think a child that has freedom to watch TV will do it all day long and nothing else?<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;So of one day my son turns 13 and he wants to have sex then I can&#39;t say no, same with drugs and alcohol...If he wants to go party and comeback the next day is ok too...IS this right? &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\nDo you think that when your child is a teen that telling them :&quot;no you cannot have sex&quot; will actually stop him from having sex?<br/>\nDo you think that all the teenagers that are having sex are doing so because their parents did not tell them no( same for drugs)?<br/>\nNot saying that because I think you shoud tell them to go ahead and do it anyways.<br/>\nLets say alchohol for example. My parenst did not say no to alcohol when we were kids. I remember they even gaves a glass of wine to drink starting as early as probably 10, if we wanted to.<br/>\nI drink very little as an adult. I only got drunk twice in my twenties from not eating while drinking with a boyfriend I had. And even then I did not drink a lot. I was just petit and had not eaten so a little alcohol got me  drunk.<br/>\nWe never had to sneak acohol because it as not taboo. Neither we wanted to. We did not want to get drunk either.<br/>\nMy parents drak little and socially. We all ( my siblings and I) have a very healthy relationship with alcohol.<br/>\nMy parents did give us pointers about not driving, staying at friends house if needed or calling for them to pick us up. How not to get drunk by eating and drinking water in between id you felt yourself getting high.<br/>\nBeing drunk and wasted is also not glamourized where I grew up like it is here in the US where young adulst go out to get wasted.<br/>\nWhere I grew up it was  not attractive to be drunk. It was also not taboo for teens to drink.<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;I am asking this because I really want to understand how it works, because it sounds to me if this is the case that unschooling goes hand in hand with permissive parenting... and that is proven to be unhealthy for children in a way.&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nUnschooling is NOT umparenting. I am sorry you got that idea. Unschooling is acutally being more present than in mainstream parenting. <br/>\nhere some more reading that may help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/attentiveparenting\">http://sandradodd.com/attentiveparenting</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet%c2%a0\">http://sandradodd.com/ifilet%c2%a0</a> ( If I let them.... they will......)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/mindfulparenting\">http://sandradodd.com/mindfulparenting</a><br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;Maybe some of you that have homeschool for long time and have children that had grown can help me understand how all of this works. I don&#39;t see how letting a child watch tv all day or do whatever they want is good. While saying no all the time and holding them back from being who they are and want to be is not good, throwing them in the jungle without a guide is not good either. Life is full of limits and it starts with us as persons, we can jump as high as a tall man can, or run as fast as a panther..our body has a limit...we can&#39;t live where we want to, I can&#39;t have a big house or fancy car....I can&#39;t tell my baby I am tired you can fix your own breakfast... My husband can&#39;t tell his boss he feels like staying home..etc. I see that having limits is part of humanity as much as I like it or dislike it there is nothing we can do about it. It is part of life  and if you didn&#39;t have your body to limit you or a floor that stops you from going lower we<br/>\n would<br/>\nbe lost in space.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI hope the links above will help you. Please read them ( I know there is a lot to read!) <br/>\nI leave you with a couple more great links:<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice%c2%a0%c2%a0%c2%a0\">http://sandradodd.com/choice%c2%a0%c2%a0%c2%a0</a> ( the Value of Choice)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv%c2%a0%c2%a0%c2%a0\">http://sandradodd.com/tv%c2%a0%c2%a0%c2%a0</a> ( TV and Unschooling)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/yes.htmlsaying%c2%a0%c2%a0%c2%a0\">http://sandradodd.com/yes.htmlsaying%c2%a0%c2%a0%c2%a0</a> (Yes to children)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/no%c2%a0%c2%a0%c2%a0\">http://sandradodd.com/no%c2%a0%c2%a0%c2%a0</a> ( saying No to children)<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits (sorry it is long)","postDate":"1263927255","msgId":42888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMjJGMUE2LTgzN0EtNDBEQi05MzBCLTdDRjI4RTg4MkNGQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg==","referencesHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":42887,"nextInTopic":42889,"prevInTime":42887,"nextInTime":42889,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... No one lives without limits. Physics limits us. Society limits us. The desire to get along with other people limits us. Life limits and parent chosen","messageBody":"<div id=\"ygrps-yiv-1640637878\">On Jan 19, 2010, at 3:29 AM, Monica Van Stelton wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; What I don&#39;t understand is about not having any limits<br/>\n<br/>\n<br/>\n </span></blockquote>No one lives without limits. Physics limits us. Society limits us.  <br/>\nThe desire to get along with other people limits us.<br/>\n<br/>\nLife limits and parent chosen limits aren&#39;t the same. If you put them  <br/>\nin the same box and treat them as though they were the same, that  <br/>\nwon&#39;t help you think clearly about the important differences.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway, to be an unschooling family let say, I don&#39;t have to have  <br/>\n&gt; any limit for my son, so he calls asleep when he wants to even if  <br/>\n&gt; he is in his highchair,<br/>\n<br/>\n<br/>\n </span></blockquote>If that&#39;s where he&#39;s comfortable, why not?<br/>\n<br/>\n*But* a sleepy baby in a high chair doesn&#39;t have a lot of options! If  <br/>\nhe&#39;s easy going, he may put up with a just okay situation while he  <br/>\nwaits for the next good thing to come along.<br/>\n<br/>\nThat&#39;s where being attuned to your child comes in. You be your  <br/>\nchildren&#39;s partner to help them get what they want.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I shouldn&#39;t childproof the house because that limits where he can  <br/>\n&gt; go or explore, no cribs, no  no&#39;s,<br/>\n<br/>\n<br/>\n </span></blockquote>Your child trusts that the environment you put him in is relatively  <br/>\nsafe. So you do what you can to make it safe.<br/>\n<br/>\nBut I think it&#39;s not  helpful to think in terms of limits and no  <br/>\nlimits. Much better and clearer to think in terms of giving a child  <br/>\nchoices, opening up their world as much as you can for them to explore.<br/>\n<br/>\nWhere most parents get turned around is that 1) they impose limits  <br/>\nfor their own convenience and 2) their fears of the world go beyond  <br/>\nthe obvious.<br/>\n<br/>\nConvenience isn&#39;t bad! But parents tend to try to make raising kids  <br/>\nless inconvenient when raising kids *is* inconvenient. Kids should  <br/>\nhave the freedom to explore, but they don&#39;t need to be dumping wall  <br/>\npaint on the living room rug. In those cases, it helps to look toward  <br/>\nwhat the child needs to do then find safe and respectful  <br/>\nalternatives. (Maybe it&#39;s pouring. Maybe it&#39;s a need for tactile  <br/>\nplay. Maybe it&#39;s a need to paint that could be met in the bath tub or  <br/>\non an outside wall with tempra paint. Or something else. (There&#39;s  <br/>\n*loads* of options between a thoughtless &quot;Yes&quot; and a thoughtless &quot;No.&quot;)<br/>\n<br/>\nIf you have things that are dangerous, could make a big mess, are  <br/>\nfragile lock them up, put them out of sight.<br/>\n<br/>\nNo rules doesn&#39;t mean everything&#39;s an option. When a conventionally  <br/>\nparented child hears &quot;No,&quot; it&#39;s usually a roadblock dumped in front  <br/>\nof them with a parent guarding passage around it.<br/>\n<br/>\nWhen a mindfully parented child hears &quot;No,&quot; it means &quot;Wait, let me  <br/>\nhelp you do that in a safer (less messy, respectful) way.&quot; When no is  <br/>\nfollowed by help to do what the child wants (which sometimes means  <br/>\nsome alternative like a trampoline to jump on rather than the couch,  <br/>\nhelp finding an alternative sweet when a trip to the grocery store is  <br/>\nbetter tomorrow), then nos don&#39;t mean the same thing as they do to a  <br/>\nconventionally parented child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; TV all day any day, etc.<br/>\n<br/>\n </span></blockquote>While my daughter *could* have watched TV all day, she never did. In  <br/>\nthe prepubescent years (when it&#39;s apparently common) she watched  <br/>\nseveral hours a day but once she reached teens it was hard to get her  <br/>\nto watch enough to keep the DVR at a useable level ;-)<br/>\n<br/>\nIs that because she&#39;s exemplary or because there&#39;s something else  <br/>\ngoing on?<br/>\n<br/>\nThe problem with your thought experiment is that you&#39;re projecting  <br/>\nconventionally parented kids as though they were natural kids. But if  <br/>\nconventional parenting has no adverse effect on kids, then there&#39;s no  <br/>\nreason to be doing the extra work involved to be mindful!<br/>\n<br/>\nConventional parenting sets up an adversarial relationship between  <br/>\nchild and parent. For the child to get what he wants, he either needs  <br/>\ngranted permission or to fight against the parents&#39; roadblock.<br/>\n<br/>\nFor a mindfully parented child, TV is just one of many options. It&#39;s  <br/>\nup to the parent to funnel lots of things through the kids lives so  <br/>\nwhen they&#39;re choosing TV it&#39;s because TV is the best option. (And  <br/>\nsometimes it is!)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/t/economics\">http://www.sandradodd.com/t/economics</a><br/>\n<br/>\nAlso:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a> -- down the left side are quite a few  <br/>\npages about TV, all the common worries addressed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So of one day my son turns 13 and he wants to have sex then I can&#39;t  <br/>\n&gt; say no, same with drugs and alcohol...<br/>\n<br/>\n<br/>\n </span></blockquote>Do you have a 13 yo always unschooled child who wants to have sex,  <br/>\ndrugs and alcohol?<br/>\n<br/>\nJust because a scenario can be imagined doesn&#39;t mean it happens in  <br/>\nreal life.<br/>\n<br/>\nThat *doesn&#39;t* mean unschooled kids are paragons! What it means is  <br/>\nthat there are real reasons why 13 yos want sex, drugs and alcohol.  <br/>\nThe biggest factor is that their parents aren&#39;t on their team. It&#39;s  <br/>\neither be on their parents team or go it alone. Control will drive  <br/>\nthem to pull away and want what is forbidden.<br/>\n<br/>\nWhen kids know their parents are on *their* team, they aren&#39;t pushing  <br/>\nthose kinds of envelopes. It wouldn&#39;t make sense! It would be like  <br/>\nshooting the guide you&#39;ve hired to help you through the jungle ;-)<br/>\n<br/>\nConventional parents *think* they&#39;re helping their child through the  <br/>\njungle, but they&#39;re leading the child on the path the parents have  <br/>\nchosen for them. And the kids see all sorts of different paths they&#39;d  <br/>\nlike to explore. If the parent says no too often (too often according  <br/>\nto the child) the child will really really want to explore those  <br/>\npaths and try to find any way they can to ditch the so-called guide.<br/>\n<br/>\nBut when the child is the one directing, the parent can help them  <br/>\nexplore safely. When the child sets their own comfort limits, they  <br/>\naren&#39;t charging into dangerous areas without a guide. They&#39;re going a  <br/>\nbit beyond their comfort zone to test their own expanding limitations.<br/>\n<br/>\nKelly Lovejoy&#39;s son did experiment with some drugs. (He was not  <br/>\nalways unschooled.) Here&#39;s how she handled it:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/alwayssayyes.html\">http://joyfullyrejoycing.com/changing%20parenting/alwayssayyes.html</a><br/>\n(It&#39;s below the chunk of indented red about halfway down the page.)<br/>\n<br/>\nAnd I think alcohol is treated with way too much fear as though there  <br/>\nwere something inherently dangerous in it. What&#39;s most dangerous is  <br/>\nmaking it forbidden fruit that kids can&#39;t have until they&#39;re 21 and  <br/>\nthen they don&#39;t have any healthy examples except their excessive  <br/>\nfriends. When kids aren&#39;t under pressure to perform and are looking  <br/>\nfor release, when kids don&#39;t see alcohol as some rite of passage or  <br/>\nfreedom, then alcohol loses a *lot* of its danger.<br/>\n<br/>\nHere&#39;s something that Schuyler posts when discussions of addiction  <br/>\ncome up that&#39;s well worth reading:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There was a fantastic study on addiction done at Simon Fraser  <br/>\n&gt; University in the 70&#39;s by a psychologist, Bruce K. Alexander. There  <br/>\n&gt; is a synopsis of the study, called the Rat Pack, at Wikipedia  <br/>\n&gt; (which so trumps the encyclopedia of my childhood): http:// <br/>\n&gt; en.wikipedia.org/wiki/Rat_Park. In that synopsis it says:<br/>\n&gt;<br/>\n&gt; &quot;Alexander&#39;s hypothesis was that drugs do not cause addiction, and  <br/>\n&gt; that the apparent addiction to morphine commonly observed in  <br/>\n&gt; laboratory rats exposed to it is attributable to<br/>\n&gt; their living conditions, and not to any addictive property of the drug<br/>\n&gt; itself. [1] He told the Canadian Senate in 2001 that experiments in  <br/>\n&gt; which laboratory rats are kept isolated in<br/>\n&gt; cramped metal cages, tethered to self-injection apparatus, show only<br/>\n&gt; that &quot;severely distressed animals, like severely distressed people,<br/>\n&gt; will relieve their distress pharmacologically if they can.&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>I was raised being allowed to have sips of alcohol. It was  <br/>\ninteresting but I preferred more standard kid drinks. (In fact for  <br/>\nSunday dinner my aunt would give everyone, including us kids, either  <br/>\na new mixed drink she was trying or some wine. I don&#39;t ever remember  <br/>\nfinishing one but I could have and they were there every week. As an  <br/>\nadult I could drink as much as I want but it&#39;s never had that  <br/>\nspecialness tied to it. I did the same for my daughter (except for  <br/>\nthe weekly mix drink) and at 18 she thinks alcohol &quot;worship&quot; is  <br/>\nreally dumb.<br/>\n<br/>\nWhile addiction is more complex than &quot;just don&#39;t control it&quot; the  <br/>\nattitude of &quot;don&#39;t touch it until you&#39;re 21&quot; is creating a greater  <br/>\nproblem than if parents would approach it more sensibly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If he wants to go party and comeback the next day is ok too...IS  <br/>\n&gt; this right?<br/>\n<br/>\n<br/>\n </span></blockquote>It depends.<br/>\n<br/>\nA 13 always controlled kids who has shown he&#39;s fighting against his  <br/>\nparents control, it could be a disaster in the making.<br/>\n<br/>\nBut a child who trust her parents, who knows they will help her get  <br/>\nwhat she wants, isn&#39;t out to prove anything or fight against  <br/>\nanything. Asking the child to call when she gets there or if she  <br/>\ndecides to go somewhere else she won&#39;t feel as control. She&#39;ll  <br/>\nunderstand it as just common sense. (Because her parents have done  <br/>\nthe same thing for her, or forgot a time or two and worried the child  <br/>\nand had to apologize profusely! ;-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t see how letting a child watch tv all day or do whatever  <br/>\n&gt; they want is good.<br/>\n<br/>\n<br/>\n </span></blockquote>They aren&#39;t the same thing.<br/>\n<br/>\nWhat if -- in some fantasy land ;-) -- you had a week totally free of  <br/>\nresponsibilities and your husband said &quot;I don&#39;t see how letting her  <br/>\nread books all day is good.&quot; What&#39;s up with that? Isn&#39;t that up to you?<br/>\n<br/>\nThe problem is that we assume we limit ourselves because we know  <br/>\nbetter. We *assume* that we&#39;d do all the wrong and bad and excessive  <br/>\nthings unless we had someone telling us to stop, or scripts in our  <br/>\nhead that &quot;mature&quot; people have that tell us when to stop.<br/>\n<br/>\nThe truth is very few people have ever experienced what it&#39;s like to  <br/>\nexplore their limits since they were kids and find what&#39;s right for  <br/>\nthem. They only imagine the consequences based on people who&#39;ve been  <br/>\ncontrolled.<br/>\n<br/>\nThat&#39;s where unschooling conferences come in handy. If you see the  <br/>\nchildren of long time unschoolers, you&#39;ll never find a better group  <br/>\nof young people. They aren&#39;t zombies. They aren&#39;t subsisting on Coke  <br/>\nand Cheetos. They&#39;re thoughtful and helpful. Even when they&#39;re out of  <br/>\ntheir parents&#39; sight (which is telling! ;-) Again, they aren&#39;t  <br/>\nparagons. And they aren&#39;t putting on a face. They don&#39;t have a need  <br/>\nto take on the self preservationistic behaviors that schooled,  <br/>\nconventionally parented kids do because they know their parents are  <br/>\non their team.<br/>\n<br/>\nOne big plus to what we discuss about unschooling is that it&#39;s not  <br/>\njust pie in the sky theory like the hippies spouted. Many of us now  <br/>\nhave grown kids who&#39;ve turned out just as we trusted all along that  <br/>\nthey would :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While saying no all the time and holding them back from being who  <br/>\n&gt; they are and want to be is not good, throwing them in the jungle  <br/>\n&gt; without a guide is not good either.<br/>\n<br/>\n<br/>\n </span></blockquote>What gives you the idea unschooled kids are thrown into the jungle  <br/>\nwithout a guide?<br/>\n<br/>\nWe&#39;re there with them, acting as their partners. We don&#39;t tell them  <br/>\nhow they should be seeing the world -- eg, &quot;You need to eat organic  <br/>\nwhole wheat baked goods because white flour is nutritionless glue,&quot;  <br/>\n-- but we do pull them back from Mack trucks and offer our  <br/>\nunderstanding without strings attached, eg, &quot;It just seems to make  <br/>\nsense to me to eat whole grains that have nutrients already in them  <br/>\nand lots of micronutrients science might not yet realize are  <br/>\nimportant.&quot; When it&#39;s presented as information, especially  <br/>\ninformation on why I make choices for me, it doesn&#39;t feel like control.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; we can&#39;t live where we want to, I can&#39;t have a big house or fancy  <br/>\n&gt; car....<br/>\n<br/>\n<br/>\n </span></blockquote>You could. You could make big sacrifices and have a big house or  <br/>\nfancy car. You choose not to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can&#39;t tell my baby I am tired you can fix your own breakfast...<br/>\n<br/>\n<br/>\n </span></blockquote>You could. You choose not to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My husband can&#39;t tell his boss he feels like staying home..etc.<br/>\n<br/>\n<br/>\n </span></blockquote>He can do that too. He chooses not to.<br/>\n<br/>\nAnd that&#39;s important! If you see &quot;no choice&quot; and &quot;no choice that I  <br/>\nwant&quot; as the same, it can make you feel trapped. When you see that  <br/>\nyou every day choose to get up, to not take off for Bermuda on your  <br/>\nown, choose to make meals for your family, all those things are much  <br/>\neasier! They aren&#39;t have tos. They&#39;re conscious choices you&#39;re making  <br/>\nbecause there are benefits.<br/>\n<br/>\nThese are very helpful:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":271643104,"authorName":"Justice Riccardi","from":"Justice Riccardi &lt;j_riccardi@...&gt;","profile":"j_riccardi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and limits - my 2 cents","postDate":"1263926647","msgId":42896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNTY3Ni4yNzIyMC5xbUB3ZWIxMTIzMTAubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":42895,"nextInTopic":42897,"prevInTime":42895,"nextInTime":42897,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"I have the same concerns. I follow the unschooling approach for homeschooling but not discipline or parenting. while i agree with respecting your child, giving","messageBody":"<div id=\"ygrps-yiv-1940379168\">I have the same concerns. I follow the unschooling approach for homeschooling but not discipline or parenting. while i agree with respecting your child, giving them lots of choices and letting them learn on their own, that doesn&#39;t work for every child or every situation. my son has special needs and major impulse control issues. i need to teach him self-control because he doesn&#39;t learn it on his own. even if i explain why jumping on the baby is not a good idea because it hurts her, blah blah blah. he still does it. there has to be a limit for that. for injuring people/animals, for destroying property, for being safe. so while i use the unschooling approach for many things, i also have to tailor it for my family, for my kids, and for my values and comfort level. limits are necessary, especially for younger children. that&#39;s where you build the basis of self-control. routines and schedules are important for young children. that&#39;s how they learn balance.<br/>\n balance is essential for all life. you can go overboard with any parenting technique. just find the groove that works for you instead of trying to fit all the way into one box. we don&#39;t all fit in boxes. i know i don&#39;t.<br/>\n<br/>\nJustice <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Tue, 1/19/10, Monica Van Stelton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tatyland_usa@...\">tatyland_usa@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Monica Van Stelton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tatyland_usa@...\">tatyland_usa@...</a>&gt;<br/>\nSubject: [unschoolingbasics] unschooling and limits (sorry it is long)<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Tuesday, January 19, 2010, 3:29 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      Hello<br/>\n<br/>\nI am sitting here trying to understand what is unschooling. ..I was watching some videos of  Dayna Martin explaining what is unschooling and she says that is based on the belief that children learn from self motivation or inner drive and it totally make sense...I even learned that went I was going to college to be a teacher. <br/>\n<br/>\nWhat I don&#39;t understand is about not having any limits...I really like some of the unschooling ideas or principles, and I understand that children are not dumb and they know what they want or not... but I can&#39;t understand the no limit idea. I can&#39;t understand that letting your child do whatever, whenever is good. And even though I was raised the &quot;common&quot; way I don&#39;t fallow it totally at all.<br/>\n<br/>\n Anyway, to be an unschooling family let say, I don&#39;t have to have any limit for my son, so he calls asleep when he wants to even if he is in his highchair, I shouldn&#39;t childproof the house because that limits where he can go or explore, no cribs, no  no&#39;s, TV all day any day, etc. So of one day my son turns 13 and he wants to have sex then I can&#39;t say no, same with drugs and alcohol...If he wants to go party and comeback the next day is ok too...IS this right? I am asking this because I really want to understand how it works, because it sounds to me if this is the case that unschooling goes hand in hand with permissive parenting... and that is proven to be unhealthy for children in a way.<br/>\n<br/>\nMaybe some of you that have homeschool for long time and have children that had grown can help me understand how all of this works. I don&#39;t see how letting a child watch tv all day or do whatever they want is good. While saying no all the time and holding them back from being who they are and want to be is not good, throwing them in the jungle without a guide is not good either. Life is full of limits and it starts with us as persons, we can jump as high as a tall man can, or run as fast as a panther..our body has a limit...we can&#39;t live where we want to, I can&#39;t have a big house or fancy car....I can&#39;t tell my baby I am tired you can fix your own breakfast... My husband can&#39;t tell his boss he feels like staying home..etc. I see that having limits is part of humanity as much as I like it or dislike it there is nothing we can do about it. It is part of life  and if you didn&#39;t have your body to limit you or a floor that stops you from going lower we would<br/>\n<br/>\n be lost in space.<br/>\n<br/>\nSorry for the long e mail....<br/>\n<br/>\nThank you for taking the time to read it and answer!!!<br/>\n<br/>\nThanks againMonica<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":301676677,"authorName":"Monica Van Stelton","from":"Monica Van Stelton &lt;tatyland_usa@...&gt;","profile":"tatyland_usa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"unschooling and limits (sorry it is long)","postDate":"1263889769","msgId":42887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MTQ0LjI1NjIucW1Ad2ViNTYxMDMubWFpbC5yZTMueWFob28uY29tPg==","inReplyToHeader":"PGhqM2RxaiszMjFtQGVHcm91cHMuY29tPg=="},"prevInTopic":42886,"nextInTopic":42888,"prevInTime":42886,"nextInTime":42888,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"Hello I am sitting here trying to understand what is unschooling...I was watching some videos of  Dayna Martin explaining what is unschooling and she says","messageBody":"<div id=\"ygrps-yiv-2008918507\">Hello<br/>\nI am sitting here trying to understand what is unschooling...I was watching some videos of  Dayna Martin explaining what is unschooling and she says that is based on the belief that children learn from self motivation or inner drive and it totally make sense...I even learned that went I was going to college to be a teacher. <br/>\nWhat I don&#39;t understand is about not having any limits...I really like some of the unschooling ideas or principles, and I understand that children are not dumb and they know what they want or not... but I can&#39;t understand the no limit idea. I can&#39;t understand that letting your child do whatever, whenever is good. And even though I was raised the &quot;common&quot; way I don&#39;t fallow it totally at all.<br/>\n Anyway, to be an unschooling family let say, I don&#39;t have to have any limit for my son, so he calls asleep when he wants to even if he is in his highchair, I shouldn&#39;t childproof the house because that limits where he can go or explore, no cribs, no  no&#39;s, TV all day any day, etc. So of one day my son turns 13 and he wants to have sex then I can&#39;t say no, same with drugs and alcohol...If he wants to go party and comeback the next day is ok too...IS this right? I am asking this because I really want to understand how it works, because it sounds to me if this is the case that unschooling goes hand in hand with permissive parenting...and that is proven to be unhealthy for children in a way.<br/>\nMaybe some of you that have homeschool for long time and have children that had grown can help me understand how all of this works. I don&#39;t see how letting a child watch tv all day or do whatever they want is good. While saying no all the time and holding them back from being who they are and want to be is not good, throwing them in the jungle without a guide is not good either. Life is full of limits and it starts with us as persons, we can jump as high as a tall man can, or run as fast as a panther..our body has a limit...we can&#39;t live where we want to, I can&#39;t have a big house or fancy car....I can&#39;t tell my baby I am tired you can fix your own breakfast...My husband can&#39;t tell his boss he feels like staying home..etc. I see that having limits is part of humanity as much as I like it or dislike it there is nothing we can do about it. It is part of life  and if you didn&#39;t have your body to limit you or a floor that stops you from going lower we would<br/>\n be lost in space.<br/>\nSorry for the long e mail....<br/>\nThank you for taking the time to read it and answer!!!<br/>\nThanks againMonica<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Will we still be unschoolers...","postDate":"1263876755","msgId":42886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqM2RxaiszMjFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqMzI5ais4dXZpQGVHcm91cHMuY29tPg=="},"prevInTopic":42885,"nextInTopic":42887,"prevInTime":42885,"nextInTime":42887,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"~~ A mom at a local park day pointed me towards this blog post, which is about letting go of being a textbook anything to the point of ignoring what feels","messageBody":"<div id=\"ygrps-yiv-362849715\">~~ A mom at a local park day pointed me towards this blog post, which is about letting go of being a textbook anything to the point of ignoring what feels right, particularly &quot;unschooler.&quot;~~<br/>\n<br/>\n<br/>\nOften what feels &quot;right&quot; are ingrained things from our childhood that are not particularly helpful. It&#39;s good to examine our own baggage and ideas.<br/>\n<br/>\nI personally found that post disrespectful of radical unschoolers and touting a lot of ideas that show people see unschooling and radical unschooling as some sort of &quot;club&quot; rather than ideas that get discussed.<br/>\n<br/>\nI don&#39;t go posting about how lame homeschooling lists and parents are, I guess their definition of &quot;respect&quot; IS far different from my own...but I&#39;m not surprised.<br/>\n<br/>\nThe idea that unschooling has to be done a certain way is silly....but I think that&#39;s a notion that surfaces from discussion lists and the inability to see that discussion is just that. The whole post was so negative, I&#39;m sorry to see a great topic turn so ugly towards people who ARE passionate unschoolers. It doesn&#39;t engender the diversity they claim they cherish.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Will we still be unschoolers...","postDate":"1263876013","msgId":42885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqM2QzZCsyYnZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42884,"nextInTopic":42886,"prevInTime":42884,"nextInTime":42886,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"~~If at some point we encounter situations where we don t want to change, where we are flexible, but to a limit... if my husband and I, at some point, decide","messageBody":"<div id=\"ygrps-yiv-2064995619\">~~If at some point we encounter situations where we don&#39;t want to change, where we are flexible, but to a limit... if my husband and I, at some point, decide that we do want to place some limit, somewhere, not all the time, not about everything, but if there are some things, would that make us not unschoolers?~~<br/>\n<br/>\nOf course not. But is the goal to be an unschooler, at the cost of all else or is the goal to be happy and to foster great relationships? If my children decide to go to school, I won&#39;t be an unschooler. If I&#39;m more hung up on fitting some label then it would be a lot harder to support them. <br/>\n<br/>\nThe goal should always be happy, healthy relationships. Unschooling is less important than all the esoteric stuff, but also a big part of the reason we want to do all the other stuff better. :)<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":118247794,"authorName":"missalexmissalex","from":"&quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Will we still be unschoolers...","postDate":"1263864947","msgId":42884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqMzI5ais4dXZpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42883,"nextInTopic":42885,"prevInTime":42883,"nextInTime":42885,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"A mom at a local park day pointed me towards this blog post, which is about letting go of being a textbook anything to the point of ignoring what feels right,","messageBody":"<div id=\"ygrps-yiv-1177560448\">A mom at a local park day pointed me towards this blog post, which is about letting go of being a textbook anything to the point of ignoring what feels right, particularly &quot;unschooler.&quot; I love this list and others, and am deeply grateful for everyone who is very open about their unschooled life. This is not a condemnation of that, but about freeing yourself from a bunch of rules you are imposing on yourself as a parent and not stressing yourself about being perfect. My new goal is not to be radical as much as awesome. :)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.justenoughblog.com/?p=1631\">http://www.justenoughblog.com/?p=1631</a><br/>\n<br/>\nAlex<br/>\nmama to Katya, 2 1/2<br/>\n<br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; If at some point we encounter situations where we don&#39;t want to change, <br/>\n&gt; where we are flexible, but to a limit... if my husband and I, at some <br/>\n&gt; point, decide that we do want to place some limit, somewhere, not all <br/>\n&gt; the time, not about everything, but if there are some things, would that <br/>\n&gt; make us not unschoolers? </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Will we still be unschoolers...","postDate":"1263847551","msgId":42883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1M0U2MzE3LTVDNEMtNEEzMC05NjA4LTQ1RkMwQTg4MjNGQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+","referencesHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42882,"nextInTopic":42884,"prevInTime":42882,"nextInTime":42884,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... If you stretch the definition of unschooling broad enough so that you re comfortable, do you think it will give the same benefits that others get who don t","messageBody":"<div id=\"ygrps-yiv-1865368982\">On Jan 18, 2010, at 10:54 AM, Shira Rocklin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If at some point we encounter situations where we don&#39;t want to  <br/>\n&gt; change,<br/>\n&gt; where we are flexible, but to a limit... if my husband and I, at some<br/>\n&gt; point, decide that we do want to place some limit, somewhere, not all<br/>\n&gt; the time, not about everything, but if there are some things, would  <br/>\n&gt; that<br/>\n&gt; make us not unschoolers? If we were trying the best we could?<br/>\n<br/>\n </span></blockquote>If you stretch the definition of unschooling broad enough so that  <br/>\nyou&#39;re comfortable, do you think it will give the same benefits that  <br/>\nothers get who don&#39;t stretch it?<br/>\n<br/>\nDon&#39;t look to wear a badge. The badge doesn&#39;t provide the benefits.  <br/>\nPracticing the principles is what provides the benefits. The more you  <br/>\ntrust your children, the more you are trusted by them, the better  <br/>\nyour relationship.<br/>\n<br/>\nIf you one time say no, does that destroy everything? Relationship  <br/>\nbuilding is not a spell that must be done perfectly down to each  <br/>\ninflection. It&#39;s a childhood long process. There are choices that you  <br/>\ncan make that move closer to great relationship and learning  <br/>\nnaturally and choices you can make the move you further away. Each  <br/>\nstep closer is a step closer. Each step further away is a step  <br/>\nfurther away. But it&#39;s not like chutes and ladders where you get  <br/>\ntransported back to the beginning by taking on wrong step.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because<br/>\n&gt; its always a process, so none of us must be making the right choice  <br/>\n&gt; all<br/>\n&gt; the time in terms of unschooling our children. And, whenever I do<br/>\n&gt; something not unschooly, I don&#39;t want to feel guilty, like I&#39;ve just<br/>\n&gt; failed at unschooling. But what if I have those things happen for the<br/>\n&gt; rest of our lives, what if I never reach a place where everything  <br/>\n&gt; is the<br/>\n&gt; unschooled way?<br/>\n<br/>\n </span></blockquote>Then you won&#39;t, but will it be better than putting them in school?<br/>\n<br/>\nI doubt anyone has ever reached a place where everything is  <br/>\nunschooling! We&#39;ve all got flaws. So it&#39;s not helpful to think of  <br/>\nunschooling as a destination. Think of it as making better choices  <br/>\neach time. Ask yourself how you can be a better partner to your  <br/>\nchild. Each time, give yourself two choices. And choose the better,  <br/>\nmore relationship building choice.<br/>\n<br/>\nIf we know what choices move toward better relationships and what  <br/>\nchoices move away, that makes it easier to choose.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Will we still be unschoolers...","postDate":"1263846546","msgId":42882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqMmdhaSttbGdlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42881,"nextInTopic":42883,"prevInTime":42881,"nextInTime":42883,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Why do you want to set that limit? What s the rationale behind it? Can you explain the rationale to your kids instead of making a rule about it? That would","messageBody":"<div id=\"ygrps-yiv-1228577363\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If at some point we encounter situations where we don&#39;t want to change, <br/>\n&gt; where we are flexible, but to a limit... if my husband and I, at some <br/>\n&gt; point, decide that we do want to place some limit, somewhere, not all <br/>\n&gt; the time, not about everything<br/>\n<br/>\n </span></blockquote>Why do you want to set that limit? What&#39;s the rationale behind it? Can you explain the rationale to your kids instead of making a rule about it? That would be better than just drawing a line in the sand bc at least your kids could have a chance to see your reasoning - even if you aren&#39;t allowing them to disagree with it right now. Its not the Ideal, but none of us live ideal lives. Ideals are something to work toward, but don&#39;t beat yourself up if you don&#39;t get an A+ every time - this isn&#39;t school, after all ;)<br/>\n<br/>\nAre you worried that if you go to an unschooling conference and bring a case of Knudsen&#39;s for your kids as an alternative to the coke machine that you&#39;ll be ostracised? In person, unschoolers aren&#39;t Nearly as heavy on theory, I promise. In group settings most of us are trying to figure out how to balance hanging out with our kids and getting to meet some real-live Other Unschoolers. <br/>\n<br/>\nWhen I was newer to unschooling I worried more about the Other Unschoolers - what will they think of me? Am I too weird? too conventional? too dull? Normal will-I-fit-in sorts of worries in a way, but complicated by the fact that I was still trying to wrap my mind around the whole concept of unschooling. The more unschoolers I met, the more I relaxed about that. There are definite differences between a group of unschooling families and a group of school or homeschooling families, but none of us are perfect. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Will we still be unschoolers...","postDate":"1263840452","msgId":42881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5ODk4Ni4xMzE4LnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+","referencesHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42880,"nextInTopic":42882,"prevInTime":42880,"nextInTime":42882,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"Does it really matter ? I mean , the lable of unschooling, why do you need to know if others would consider you an unschooler? There are no rules in","messageBody":"<div id=\"ygrps-yiv-479449644\">Does it really matter ? I mean , the lable of unschooling, why do you need to know if others would consider you an unschooler?<br/>\nThere are no rules in unschooling. There are priciples. Unschooling will look different in every family.<br/>\nThere is no unschooling police or test to check if you are doing it right.<br/>\nYou have a young child right?<br/>\nSo many things parents are saying here may not yet apply to you and your family.<br/>\nWhen my oldest son was young me and my husband used to say that we would not let him play video games all day.<br/>\nWhen he started playing we embraced it and we saw the joy  he had playing them. Not only that but how much he learned and challenged himself doing so.<br/>\nNow I even like video games, and I used not like them.<br/>\nAs for limits, as someone said, life is full or real limits.<br/>\nImposing arbritary limits will not help your path to a joyful unschooling life.<br/>\nI suggest you keep reading. keep asking questions.<br/>\n<br/>\nWould you like to talk about what limits you feel you may need to impose on your child?<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\nSwitch to: Text-Only, Daily Digest • Unsubscribe • Terms of Use<br/>\n. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Will we still be unschoolers...","postDate":"1263836684","msgId":42879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGRTBENkZDLTAyQkEtNEIzMC1CRDgxLTNFRUFGODBCODEzOEBnbWFpbC5jb20+","inReplyToHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+","referencesHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42878,"nextInTopic":42880,"prevInTime":42878,"nextInTime":42880,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"... Why are you unschooling?  So that you can call yourself an unschooler? Belong to a club? Or is it because you want to provide for your children a life","messageBody":"<div id=\"ygrps-yiv-750236171\"><blockquote><span title=\"ireply\">&gt;  And, whenever I do<br/>\n&gt; something not unschooly, I don&#39;t want to feel guilty, like I&#39;ve just<br/>\n&gt; failed at unschooling. But what if I have those things happen for the<br/>\n&gt; rest of our lives, what if I never reach a place where everything is  <br/>\n&gt; the<br/>\n&gt; unschooled way?<br/>\n<br/>\n </span></blockquote>Why are you unschooling?  So that you can call yourself an unschooler?  <br/>\nBelong to a club?<br/>\n<br/>\nOr is it because you want to provide for your children a life where  <br/>\ntheir interests and desires are honored and respected? Do you want to  <br/>\nhave a partnering relationship with your children and help and  <br/>\nencourage them to live a rich and interesting life doing what makes  <br/>\nthem happy and fulfilled?  I don&#39;t know what a life where *everything  <br/>\nis the unschooled way* would look like but I know what kind of  <br/>\nnurturing, attentive, kind and respectful parent I want to be.  Guilt  <br/>\nisn&#39;t a feeling that others cause you to feel -- treat your children  <br/>\nthe best you know how, strive to do better and learn more about giving  <br/>\nthem the best unschooled life you can - and you&#39;ll have no reason to  <br/>\nfeel guilty.<br/>\n<br/>\nChris in IA<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Will we still be unschoolers...","postDate":"1263836606","msgId":42880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4QkYwNDM5M0YwMTQ1MTlCMEM5MUYzNkI4NzdENzg3QENvbm5pZVBDPg==","inReplyToHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+","referencesHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42879,"nextInTopic":42881,"prevInTime":42879,"nextInTime":42881,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"Don t get caught up in always saying yes or removing all limits. There are some things that I cannot change because in order to change those things, I would","messageBody":"<div id=\"ygrps-yiv-1375468011\">Don&#39;t get caught up in always saying yes or removing all limits. There are some things that I cannot change because in order to change those things, I would have to be somebody else entirely. I have baggage and I have issues. If there is something that I cannot or will not change, then I own it. <br/>\n<br/>\nWhether we like it or not, there are limits in this world. There is a limit to how much money we have. There is a limit to how many hours are in the day. There is a limit to how much I can physically do. I don&#39;t think the goal is to never set any limits. The goal is to try to remove as many arbitrary limits as possible. Try not to confine yourself to always worrying about living an unschooly life. Just try to focus on living a rich life that is full of fun and adventure. If you and your kids are having fun and enjoying yourselves, there is a good chance that you won&#39;t have time to feel guilty. : -) I always look to my kids for the answer. If something isn&#39;t working for your family and you need to change it, then don&#39;t feel guilty. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\nFrom: Shira Rocklin <br/>\nSent: Monday, January 18, 2010 9:54 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Will we still be unschoolers...<br/>\n<br/>\n<br/>\n  <br/>\nIf at some point we encounter situations where we don&#39;t want to change, <br/>\nwhere we are flexible, but to a limit... if my husband and I, at some <br/>\npoint, decide that we do want to place some limit, somewhere, not all <br/>\nthe time, not about everything, but if there are some things, would that <br/>\nmake us not unschoolers? If we were trying the best we could? Because <br/>\nits always a process, so none of us must be making the right choice all <br/>\nthe time in terms of unschooling our children. And, whenever I do <br/>\nsomething not unschooly, I don&#39;t want to feel guilty, like I&#39;ve just <br/>\nfailed at unschooling. But what if I have those things happen for the <br/>\nrest of our lives, what if I never reach a place where everything is the <br/>\nunschooled way? <br/>\n<br/>\nShira<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com <br/>\nVersion: 9.0.725 / Virus Database: 270.14.148/2629 - Release Date: 01/17/10 13:35:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Will we still be unschoolers...","postDate":"1263832049","msgId":42878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWNhOTg1YiQyMmU4ODRiMCRkMWEzZmVhOUB1bHJpa2VjNjUwZmMxYj4=","referencesHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":42876,"nextInTopic":42879,"prevInTime":42877,"nextInTime":42879,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"Hi Shira You wrote If at some point we encounter situations where we don t want to change, where we are flexible, but to a limit... if my husband and I, at","messageBody":"<div id=\"ygrps-yiv-383761137\">Hi Shira<br/>\nYou wrote<br/>\n&quot;If at some point we encounter situations where we don&#39;t want to change,<br/>\nwhere we are flexible, but to a limit... if my husband and I, at some<br/>\npoint, decide that we do want to place some limit, somewhere, not all<br/>\nthe time, not about everything, but if there are some things, would that<br/>\nmake us not unschoolers? If we were trying the best we could? Because<br/>\nits always a process, so none of us must be making the right choice all<br/>\nthe time in terms of unschooling our children. And, whenever I do<br/>\nsomething not unschooly, I don&#39;t want to feel guilty, like I&#39;ve just<br/>\nfailed at unschooling. But what if I have those things happen for the<br/>\nrest of our lives, what if I never reach a place where everything is the<br/>\nunschooled way? &quot;<br/>\n<br/>\nJust the last couple of days I&#39;ve been reading up on &quot;Field Training&quot; which <br/>\nis an awesome (in my opinion) way to look at how we live and &#39;create&#39; our <br/>\nlife experiences. And I know that &#39;unschooling&#39; is a part of what is <br/>\nhappening to us and thus - according to this system - of &#39;who we are&#39;. The <br/>\nbasic premise of this system is &quot;Identity creates experience&quot; So if  and <br/>\nwhen you identify with BEING AN UNSCHOOLER with whatever you believe the <br/>\ntruth of what an unschooler would be - you would experience an &#39;unschooling <br/>\nlife&#39; accordingly. In the end it boils down to what is the inner truth for <br/>\nyou. Do you believe that it is true that every child has full rights to be <br/>\nrespected in every way all the time? Or is it true that children are only <br/>\nfully human and to be respected in their wishes, unique beingness and needs <br/>\nwhen they reach a certain age or measure of accomplishment until shich time <br/>\nthey have to be &#39;pushed and pulled and co-erced&#39; into the mould that is <br/>\nright for them? Or whatever else is your experienced truth? Maybe your truth <br/>\nis &quot;I believe in children but others don&#39;t and I am at the mercy of the <br/>\nauthority of these others.&quot; Or any other &#39;truth&#39; hides within you. I cannot <br/>\nsay. But I know that for myself I am on a constant quest to uncover what I <br/>\nperceive as &#39;truth about reality&#39; and where I am not in total agreement with <br/>\nwhat I see as apparent truth and what I want to be true I take some time off <br/>\nto make internal peace.<br/>\n<br/>\nWhen I &#39;fail&#39; at my ideal it is just a wake-up call for me to look within <br/>\nand see where I was willing to settle for less than I am.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Will we still be unschoolers...","postDate":"1263830069","msgId":42876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNTQ4NDM1LjMwNjA2MDBAeWFob28uY2E+"},"prevInTopic":0,"nextInTopic":42878,"prevInTime":42875,"nextInTime":42877,"topicId":42876,"numMessagesInTopic":0,"msgSnippet":"If at some point we encounter situations where we don t want to change, where we are flexible, but to a limit... if my husband and I, at some point, decide","messageBody":"<div id=\"ygrps-yiv-916352344\">If at some point we encounter situations where we don&#39;t want to change, <br/>\nwhere we are flexible, but to a limit... if my husband and I, at some <br/>\npoint, decide that we do want to place some limit, somewhere, not all <br/>\nthe time, not about everything, but if there are some things, would that <br/>\nmake us not unschoolers?  If we were trying the best we could?  Because <br/>\nits always a process, so none of us must be making the right choice all <br/>\nthe time in terms of unschooling our children.  And, whenever I do <br/>\nsomething not unschooly, I don&#39;t want to feel guilty, like I&#39;ve just <br/>\nfailed at unschooling.  But what if I have those things happen for the <br/>\nrest of our lives, what if I never reach a place where everything is the <br/>\nunschooled way? <br/>\n<br/>\nShira</div>","specialLinks":[]}],"prevTopicId":43005,"nextTopicId":42999}}