{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":307938888,"authorName":"Amanda Horein","from":"&quot;Amanda Horein&quot; &lt;horein@...&gt;","profile":"michmdmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: help me to see it differently...(long)","postDate":"1203943608","msgId":30239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMzJkZjUwMDgwMjI1MDQ0NnQ2YmQ2NzJiY241YmI1YjQzNWNhZmM2NzM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":30209,"nextInTopic":0,"prevInTime":30238,"nextInTime":30240,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"-=-=-=-=-=-=- About a month ago I was in a similar place. Always looking for a quiet place (even if only mentally). Thoughts like Leave me alone and Why","messageBody":"<div id=\"ygrps-yiv-566914344\">-=-=-=-=-=-=-<br/>\nAbout a month ago I was in a similar place. Always looking for a<br/>\nquiet place (even if only mentally). Thoughts like &quot;Leave me alone&quot;<br/>\nand &quot;Why can&#39;t I just have a moments peace&quot; came to mind. That was<br/>\nnot the place I wanted to be in. Intellectually, I knew what I needed<br/>\nto do, where I wanted to be. I just couldn&#39;t seem to get there.<br/>\nI would have a good dose of undivided time and connection with my<br/>\nchildren, then would once again feel depleted, and off in search of<br/>\nthe quiet place. It was the opposite direction of where I needed to<br/>\nbe going though. I knew that. But, how could I start connecting with<br/>\nthe kids in a way that didn&#39;t feel obligatory?<br/>\n<br/>\nThen I remembered this song from a few years ago. I got up and<br/>\nwatched the YouTube video repeatedly one night. I cried and cried<br/>\nknowing I could be giving so much more than I was. I woke up the next<br/>\nmorning with such a sense of renewal. I&#39;ve kept it ever since. If I<br/>\nthought I felt it start slipping away, I would listen to the song<br/>\nagain, or sing it to myself. It would remind me again of where the<br/>\nanswers are. It always takes me back to what is important. Maybe you<br/>\ncould listen to it on your way home from work. Maybe this isn&#39;t the<br/>\nsong for you, but some other song, or perhaps a poem will touch you<br/>\nin the same way.<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nI recently found something similar to this. I was laying alone in my bed<br/>\nafter having told my dh to &quot;go away&quot; because I was upset with him. I really<br/>\ndidn&#39;t want him to &quot;go away&quot;, but he did ask I asked, not as I thought. Go<br/>\nfigure, lol! Anyway, I got to thinking about how I needed alone time. Except<br/>\nI knew that really wasn&#39;t the case. I like alone time, but it doesn&#39;t always<br/>\nmake me feel better.<br/>\n<br/>\nMy &quot;song&quot; is actually a character in a series of books by Peirs Anthony. The<br/>\nMode Series &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.piers-anthony.com/mode.html\">http://www.piers-anthony.com/mode.html</a>&gt;, it is called. There is<br/>\na character, from a different universe who can &quot;draw in&quot; emotion from<br/>\nothers, multiply it, and send it out to the multitudes. So, I am working on<br/>\nbecoming something like that. &quot;Drawing in&quot; the chaos (or whatever), like<br/>\ndrinking it up, letting it fuel me and fill me up (after all, my kids will<br/>\nonly be this age for this moment) so that I will be able to give more to my<br/>\nfamily. My goal is that eventually, nothing will &quot;deplete&quot; me. That is not<br/>\nto say that I will never want time by myself and I don&#39;t know that I will<br/>\never get to &quot;Nothing can deplete me&quot;, but it is helping so far.<br/>\n<br/>\n-- <br/>\nAmanda<br/>\nWife to Roger (together 10 years)<br/>\nMum to Marti (7.5) and Lilly (4)<br/>\nBabysitter to Stella (3.5)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://whatmykidstaughtme.blogspot.com/\">http://whatmykidstaughtme.blogspot.com/</a><br/>\n<br/>\n&quot;What you give to your children enriches them. What you withhold from them<br/>\nimpoverishes them.&quot;<br/>\n<br/>\nMy love to Uncle Jesse&#39;s family.  Know that I love and miss him.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221315529,"authorName":"hmsdragonfly","from":"&quot;hmsdragonfly&quot; &lt;hmsdragonfly@...&gt;","profile":"hmsdragonfly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: help me to see it differently...(long)","postDate":"1203792472","msgId":30209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwcHBvbyttOWhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzUwYTJjMDgwMjIyMTA1OWg2OGM2ZmVlYnliM2U4OGJkOTlkNWRmN2Y1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":30200,"nextInTopic":30239,"prevInTime":30208,"nextInTime":30210,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"... Bravo. ... This is definitely true in my case. I tend to come home from work in one of two frames of mind. Neither is especially conducive to sliding back","messageBody":"<div id=\"ygrps-yiv-1790543117\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robert Saxon&quot; <br/>\n&lt;TheSaxons@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Children are more than their behavior. The behavior they display is <br/>\n&gt; done for a reason, an understandable one. Sometims we must play <br/>\n&gt; detective to try to find it out, and sometimes<br/>\n&gt; we have to just trust that the reason is valid, even if we don&#39;t <br/>\n&gt; know what it is (and never will).<br/>\n<br/>\n </span></blockquote>Bravo.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I think half of the chaos is really in my own mind and the chaos of <br/>\n&gt; the house just exacerbates it.<br/>\n<br/>\n </span></blockquote>This is definitely true in my case. I tend to come home from work in <br/>\none of two frames of mind. Neither is especially conducive to sliding <br/>\nback into family life.<br/>\n<br/>\n1. Revved up. If I&#39;ve had a productive day, the high of that can <br/>\ncarry me home. I have so much energy that I get psyched up to <br/>\ncontinue to be productive at home. &quot;I can do X, and I can do Y, <br/>\nand...&quot; The part of that I don&#39;t &quot;think out loud&quot; is a certain <br/>\nexpectation that my energy will be both contagious and retroactive, <br/>\nlike I can infuse my family&#39;s entire day with the same &quot;Getting <br/>\nThings Done&quot; mentality. And then I walk in the house and see the <br/>\nhappy remains (&quot;MESS!&quot; my brain screams) of a day spent in a whole <br/>\nother, much more important kind of productivity. And the family is <br/>\nwinding *down*, starting to think about quieter times or their <br/>\nfavorite TV shows. Slowing myself down, even long enough for a little <br/>\nsnuggly catchup time, is a challenge.<br/>\n<br/>\n2. Tired and discouraged. I didn&#39;t get enough done. There were too <br/>\nmany piddly details or large obstacles or extra-large egos thrown in <br/>\nmy way. I&#39;ve been slogging uphill through molasses all day. And I <br/>\nwalk in the door and it all seems MORE OF THE SAME. Nobody helps me. <br/>\nEverybody makes my life more difficult than it needs to be. Blah blah <br/>\nblah. Whine whine whine.<br/>\n<br/>\nYou&#39;ll notice that both of these have their feet in *my high <br/>\nexpectations for myself*. And the thing that calms me most is <br/>\nreassuring myself that I did *enough*. If I can walk through the <br/>\nfront door with some acceptance of my self, it&#39;s much easier to <br/>\naccept -- and appreciate -- what I find inside.<br/>\n<br/>\nI once read a little anecdote, either in Mothering or Reader&#39;s <br/>\nDigest -- how&#39;s that for variety, lol -- about a man who would come <br/>\nhome and mime hanging his work day (or maybe his work self) on the <br/>\ntree outside. I often think of that as I&#39;m walking up the front walk.<br/>\n<br/>\nRonnie<br/>\n<br/>\nP.S. I second the suggestion to call ahead, especially if your <br/>\narrival time varies from day to day. My family *understands* that <br/>\ncoming home to mess is hard, and some days they give me the gift of <br/>\ntidying up. Even if this only happens once in a while, the warmth of <br/>\nthe gift can carry me through more difficult days.</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: help me to see it differently...(long)","postDate":"1203770310","msgId":30200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwcDQ0NitpbmN2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEVENkIwOTgxLTczOTctNDJERC1CQTVFLUQwQzE2N0Q2OUM5Q0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":30182,"nextInTopic":30209,"prevInTime":30198,"nextInTime":30201,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"*sob*  And I haven t even listened to the song, yet. What a beautiful response, Kendrah. I m glad you re here! Caren","messageBody":"<div id=\"ygrps-yiv-1020999455\">*sob*  And I haven&#39;t even listened to the song, yet. What a beautiful<br/>\nresponse, Kendrah. I&#39;m glad you&#39;re here!<br/>\n<br/>\nCaren<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kendrah Nilsestuen <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I just wanted to share this song with you... </span></blockquote></div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] help me to see it differently...(long)","postDate":"1203706790","msgId":30182,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDgwMjIyMTA1OWg2OGM2ZmVlYnliM2U4OGJkOTlkNWRmN2Y1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAxODkwMWM4NzRmZCQ5NWU0OGFmMCRjMWFkYTBkMCRAbmV0Pg==","referencesHeader":"PDAxODkwMWM4NzRmZCQ5NWU0OGFmMCRjMWFkYTBkMCRAbmV0Pg=="},"prevInTopic":30179,"nextInTopic":30200,"prevInTime":30181,"nextInTime":30183,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"Maisha, We ve done two broad categories of stuff;  external and internal (I guess I should clarify  ;-) ). Externally, it s much like what s been suggested --","messageBody":"<div id=\"ygrps-yiv-605908759\">Maisha,<br/>\n<br/>\nWe&#39;ve done two broad categories of stuff;  external and internal (I guess I<br/>\nshould clarify  ;-) ).<br/>\n<br/>\nExternally, it&#39;s much like what&#39;s been suggested -- some pre-planning, like<br/>\nthe snacks for kids to munch on, pre-preparing meals, or other of what I<br/>\ncall &quot;guerrilla love-fare&quot;.  Being sneaky on behalf of your family, you<br/>\nmight say.  Unconventional tactics used to keep the peace and further mutual<br/>\nrespect and harmony.<br/>\n<br/>\nExample:  I&#39;ve found that simply announcing &quot;SUPPER!&quot; can be a great way to<br/>\nkeep everyone away from the supper table.  Walking in with a bowl of egg<br/>\nsalad and crackers, sitting down and just eating, well, they look over and<br/>\nsee what I&#39;m doing and join in.<br/>\nExample:  We had a sleepover last Tuesday, and two of our visitors got into<br/>\na tug-of-war match over a toy.  I could hear them getting more and more<br/>\nupset from the other room.  Finally, I just ran into the room stomping my<br/>\nfeet on the floor all the way (pier-and-beam house), and yelled,<br/>\n&quot;SASQUATCH!&quot;  They just looked up at me like I was crazy (DW says I am) and<br/>\nstarted laughing.  (NOTE:  Normally, I&#39;d try to work it out between them,<br/>\nbut they weren&#39;t in a mental space for it as they were tired and hungry and<br/>\nDW was getting food as quickly as possible.)  For us it&#39;s a combination of<br/>\nstrategic pre-planning combined with a playful attitude and a slightly<br/>\noff-center viewpoint.<br/>\n<br/>\nOn the finding the meat smeared all over the couch, well,...that&#39;s where the<br/>\ninternal stuff comes in a lot more.  For us, this involves how we respond to<br/>\nthe big surprise unknowns.  For example, DW walked in to find sugar all over<br/>\nour living room.  ALL OVER the room, the furniture, etc. (GOOD NEWS:<br/>\nhardwood floors.)  I think there was some spilled water in there, too, but<br/>\nit&#39;s hard to recall b/c my memories are a bit red-tinted.  Needless to say,<br/>\nwe didn&#39;t do too well that day as parents.  But what it brought out is that<br/>\nour default reaction to many &quot;unpleasant surprises&quot; was one of anger and<br/>\npersonal offense.  As if they deliberately did something to try to make us<br/>\nfeel bad.<br/>\n<br/>\nThat had to change, that initial  reaction.  We&#39;ve tried to supplant it with<br/>\nsincerely asking questions, like, &quot;Remember, they are more than their<br/>\nbehavior, so:  why would they do something like this? Are they angry?  Are<br/>\nthey simply being curious and experimenting?  What&#39;s the motivation behind<br/>\nthis action?  And further, if it needs helping, what can I do to help it?&quot;<br/>\nThis is a change we wanted to see in ourselves, but we also had to justify<br/>\nit to our reptile brains.  The following helped us with that:  Children are<br/>\ninnately curious.  They bond with their parents naturally and WANT to bond<br/>\nwith us.  They&#39;re not mean or malicious.  Children are more than their<br/>\nbehavior.  The behavior they display is done for a reason, an understandable<br/>\none.  Sometims we must play detective to try to find it out, and sometimes<br/>\nwe have to just trust that the reason is valid, even if we don&#39;t know what<br/>\nit is (and never will).  The things that matter to them (e.g. having the<br/>\npink sippy cup with the purple lid) are just as important to them as paying<br/>\nthe bills on time are to me.  Respect that.<br/>\n<br/>\nWell, that convinces me when I&#39;m calm and here at work away from the kids.<br/>\nBut what got us (and still helps get us) there emotionally?  What dampens<br/>\nthat spike of strong emotion?  As they say, there is no substitute for<br/>\nexperience...<br/>\n<br/>\nSometimes it takes forcing myself to ask those questions listed above<br/>\ninstead of being Captain Justice.  Example:  My dd2 hit a friend in our<br/>\nhouse.  Instead of going ballistic on her (&quot;I AM THE LAW!&quot;), I started<br/>\nasking her questions.  I tried being as non-confrontational as possible, and<br/>\nas caring as I could.  Turns out that the friend had hit dd2&#39;s sister, dd1,<br/>\nand dd2 was protecting her.  dd1 said they were just playing, but dd2 didn&#39;t<br/>\nsee it that way.<br/>\n<br/>\nNow here&#39;s the good bit:  I got a peek into her psyche that I otherwise<br/>\nwouldn&#39;t have gotten.  This is when I realized how loyal dd2 is.  This added<br/>\nhuge amounts of motivation for me to keep asking questions and being<br/>\nrespectful.  Not only does it treat them respectfully and provide them with<br/>\na safer environment, and help them grow emotionally, but we now have even<br/>\nmore knowledge about her so that our future responses are even MORE<br/>\nappropriate and respectful.  And what parent doesn&#39;t want to know their<br/>\nchildren?<br/>\n<br/>\nAt the end of the day, sometimes we re-live the day&#39;s tough situations the<br/>\nway we wished we had done it, rather than how we actually did. Some days we<br/>\ndon&#39;t know how we wanted to do it and we have to puzzle it out.  A bit of<br/>\nmental practicing and re-living.  And more often lately we&#39;ve also been<br/>\nsharing our successes with each other.  Proof for each other from the front<br/>\nlines that we&#39;re getting better.<br/>\n<br/>\nI guess to summarize, that &quot;quiet spot&quot; in the middle of the chaos you&#39;re<br/>\nasking about we seem to have found a bit of a quiet spot (sometimes) within<br/>\nthe maelstrom by changing ourselves.  I think half of the chaos is really in<br/>\nmy own mind and the chaos of the house just exacerbates it.  If I can stop<br/>\ntaking offense and realize that when my kids pester me constantly, or<br/>\n&quot;experiment&quot; with the markers on the computer screen, they&#39;re being Natural<br/>\nKids.  They love me, and they want to explore their world.  (&quot;Hey, who wants<br/>\nto spray with the spray bottle?&quot; &quot;MEEEE!&quot;  &quot;MEEEE!&quot;  &quot;Can I wipe with the<br/>\ntowels?&quot;)  I think they start with so much love to give.  I just have to<br/>\nremember that.<br/>\n<br/>\n&lt;/SOAPBOX_RAMBLE&gt;<br/>\n<br/>\n--Rob Saxon<br/>\nDH to Seana for 11 years!<br/>\n&quot;Daddy!&quot; to Genevieve (6) and Elissa (4 10.5/12)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:help me to see it differently...(long)","postDate":"1203702609","msgId":30179,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwbjIwaCs2YXEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1MkVFQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":30178,"nextInTopic":30182,"prevInTime":30178,"nextInTime":30180,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"This reminded me of something someone I know introduced to me. Personally, I don t like to do it, most of the time we have time to cook each night.  But in","messageBody":"<div id=\"ygrps-yiv-2036077055\">This reminded me of something someone I know introduced to me. <br/>\nPersonally, I don&#39;t like to do it, most of the time we have time to<br/>\ncook each night.  But in your specific situation it might be a<br/>\nlifesaver and a fun family activity???<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.frugalmom.net/once_a_month_cooking.htm\">http://www.frugalmom.net/once_a_month_cooking.htm</a><br/>\n<br/>\nThere are lots of other resources.  This was just the first one I<br/>\nchose when I googled &quot;freezer cooking&quot;<br/>\n<br/>\n-Heather<br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt; Also, I might even consider if I was in your situation, going ahead and<br/>\n&gt; doing once a week type cooking on the weekend and then making dinner<br/>\n&gt; would consist of reheating the lasagna, soup, whatever - basically,<br/>\n&gt; reduce the amount of your time required to get dinner prepared so that<br/>\n&gt; you have more space to spend with the family during the week. And/or get<br/>\n&gt; a slow cooker that you can set up in the morning and leave until you get<br/>\n&gt; home, again minimizing the dinner hour crush.<br/>\n&gt; <br/>\n&gt; Deb <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; CNC Software, Inc.<br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":332347767,"authorName":"lspswr","from":"&quot;lspswr&quot; &lt;lspswr@...&gt;","profile":"lspswr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:help me to see it differently...(long)","postDate":"1203702385","msgId":30178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZwbjFwaCtobTR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1MkVFQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":30174,"nextInTopic":30179,"prevInTime":30177,"nextInTime":30179,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"... out from work.","messageBody":"<div id=\"ygrps-yiv-1811354974\"><blockquote><span title=\"ireply\">&gt; Maybe even consider a quick phone call &quot;Hi guys, I&#39;m about to head <br/>\n </span></blockquote>out from work.&lt;<br/>\n<br/>\nAs the at-home-parent I can say that this is SO helpful for us!  If <br/>\nwe know that dh is on his way home we can &quot;get ready&quot; and make <br/>\nadjustments as needed so as to be ready to welcome him when he comes <br/>\nin.  Dh works very long hours and we never know when he might be <br/>\ncoming so it&#39;s really helpful if he lets us know.  We usually <br/>\nscramble around a bit to pick up things we&#39;re finished with, I might <br/>\nmake him some dinner, etc....  Mostly it&#39;s just a heads up that we <br/>\nare going to be transitioning into including him -- sort of like <br/>\ntelling a kid that we&#39;ll be leaving in 10 minutes instead of <br/>\nspringing it on him all of a sudden and then wondering why he is <br/>\nresistant.  When dh does not give us a heads up it can be really <br/>\ntough to make the transition into including him and making him feel <br/>\nwelcome.  We usually DO need some time to finish up doing what we&#39;re <br/>\ndoing and transition our expectations before we can give him our <br/>\nattention.<br/>\n<br/>\nHighly recommend and appreciate the &quot;heads up&quot; phone call!<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:help me to see it differently...(long)","postDate":"1203699512","msgId":30174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1MkVFQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":30158,"nextInTopic":30178,"prevInTime":30173,"nextInTime":30175,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"First {{HUGS}} I know the feeling somewhat, there s just DH and one DS, but there have been times when I don t even have my jacket off and I m hit with Daddy","messageBody":"<div id=\"ygrps-yiv-1968757622\">First {{HUGS}} I know the feeling somewhat, there&#39;s just DH and one DS,<br/>\nbut there have been times when I don&#39;t even have my jacket off and I&#39;m<br/>\nhit with &quot;Daddy did...&quot; &quot;Yeah, but he did...&quot; and there&#39;s still lunch<br/>\nstuff on the table and dinner&#39;s not started and ... <br/>\n<br/>\nOne of my &quot;best&quot; tactics for those moments when I feel that relaxing<br/>\nbreath just draining away is &quot;I&#39;ve gotta go to the bathroom - in<br/>\nprivate&quot; and I go sit in the bathroom for 2 minutes (my guys are used to<br/>\nMommy needing to go potty as soon as she gets home now cause I usually<br/>\nDO have to go at that point). I can regroup and breathe again. I can let<br/>\nall the &quot;why didn&#39;t he ...!?&quot; and &quot;why doesn&#39;t he...?&quot; thought swirl<br/>\naround and then down the toilet with the rest of the &#39;stuff&#39;. Then I go<br/>\nout, start quietly clearing the table, and so on. By then, usually, DH<br/>\nhas started dinner (often his sense of the timing of when things need to<br/>\nget started is different than mine, not wrong just different, and since<br/>\nhe&#39;s the chief chef... Often he waits until I pull in so that whatever<br/>\nit is will be fresh and hot for me instead of sitting on the stove).<br/>\nAnd, by then, DS is wanting a hug and asking how my day was. THEN we can<br/>\ndeal with whatever else is needed.<br/>\n<br/>\nOne of the things that might be important in what you&#39;ve described is<br/>\nthat the kids might be needing to eat sooner than when you get home. Are<br/>\nthere things they can get themselves that will give them a little boost<br/>\nin the late afternoon? Stuff like trail mix (we make our own with nuts,<br/>\ndried fruit, chocolate bits, etc) or pre-sliced chunks of cheese or<br/>\nwhatever can really help that pre-dinner low and keep everyone stable.<br/>\nMaybe even consider a quick phone call &quot;Hi guys, I&#39;m about to head out<br/>\nfrom work. I left some cheese in the blue container in the fridge for<br/>\nyou guys to snack on until dinner. And, Hon, can you fill the big pot on<br/>\nthe stove with water and set it to boil? That way I can toss in the<br/>\npasta when I get home and it&#39;ll be quick. Thanks&quot; Depending on your<br/>\nfamily, maybe prepare &quot;lunch boxes&quot; (snack packs) for each child before<br/>\nleaving for work and toss in a little personal note or something for<br/>\neach. That way each of them has their own access to foods for the day<br/>\nplus a little reminder of Mommy to hold onto. <br/>\n<br/>\nAnd, something that&#39;s easier for me (since I&#39;ve only got one kid and one<br/>\nof me) is to spend 5 minutes right off focused on that one person. I&#39;m<br/>\nnot sure how you&#39;d arrange it with a bunch of kids - maybe give each one<br/>\na &#39;day&#39; (with 4 kids that means that hubby gets a day to himself too)<br/>\nand the first 5 minutes you&#39;re home &#39;belong&#39; to that one, then the<br/>\nothers in some order (height, age, alphabetically, by birth month, day,<br/>\nwhatever works) each get 5 minutes. Knowing that they&#39;ll each get a<br/>\nchunk of your undivided attention might (or might not) help with the<br/>\nimmediate clamor of all of them at once looking for some face time with<br/>\nMom. That&#39;d be something to sit and discuss - &quot;Hey guys, when I get home<br/>\nfrom work I want to talk to ALL of you but I can&#39;t talk to all of you at<br/>\nthe same time. How do you propose we arrange things so that you all get<br/>\nto talk to me without us all getting tangled up?&quot; (okay that&#39;s kind of a<br/>\nverbose way to say it but it gives the sense of it). I know that when I<br/>\nwas a kid (my parents didn&#39;t unschool or gently parent in the sense of<br/>\nthings nowadays but it was pretty close), we knew that when Daddy got<br/>\nhome, #1 was he&#39;d go find mom and give her a kiss. Then he&#39;d go up and<br/>\nget out of his suit and tie and get comfortable. While he was changing,<br/>\nanyone who wanted/needed to chat could go up and chat with him. Or, we<br/>\ncould wait (if there was nothing earth shattering going on) until he<br/>\ncame back down (there were 3 of us kids, when I was 10, my brother was 8<br/>\nand my sister was 5 to give you an idea of age ranges). Just knowing<br/>\nthat we&#39;d have a space to be heard if/when we needed it took some of the<br/>\nurgency out of having to get it in right away. There was space and we<br/>\nknew that even when we were fairly little.<br/>\n<br/>\nAlso, I might even consider if I was in your situation, going ahead and<br/>\ndoing once a week type cooking on the weekend and then making dinner<br/>\nwould consist of reheating the lasagna, soup, whatever - basically,<br/>\nreduce the amount of your time required to get dinner prepared so that<br/>\nyou have more space to spend with the family during the week. And/or get<br/>\na slow cooker that you can set up in the morning and leave until you get<br/>\nhome, again minimizing the dinner hour crush.<br/>\n<br/>\nDeb <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":319648094,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;maitai373@...&gt;","profile":"maitai373","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"help me to see it differently...(long)","postDate":"1203648586","msgId":30158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxODkwMWM4NzRmZCQ5NWU0OGFmMCRjMWFkYTBkMCRAbmV0Pg=="},"prevInTopic":0,"nextInTopic":30174,"prevInTime":30157,"nextInTime":30159,"topicId":30158,"numMessagesInTopic":0,"msgSnippet":"This evening I came home.  I took a breath in the car and made the intention to be peaceful.  And then I walked in the door..and I had to fight to hold on to","messageBody":"<div id=\"ygrps-yiv-556063985\">This evening I came home.  I took a breath in the car and made the intention<br/>\nto be peaceful.  And then I walked in the door..and I had to fight to hold<br/>\non to the peace (right there is an oxymoron, huh?).  I was met with glee by<br/>\nmy children who missed me during the day.  My husband was playing a computer<br/>\ngame. I changed my clothes and proceeded to finish cleaning up the living<br/>\nroom (Khalid and Khidar had decided to &quot;cook&quot; and got raw meat and<br/>\ncondiments out of the refrigerator and smeared it on our sofa and carpet).<br/>\nThen there were choruses of &quot;what&#39;s for dinner?&quot;  And that overwhelmed<br/>\nfeeling started to come over me.  Khalid and Khidar started arguing over<br/>\ntoys, there was crying involved and hitting.  I tried to comfort one and the<br/>\nother would come over which would agitate the &quot;victim&quot;.  There was &quot;I want<br/>\nsomething to drink&quot; &quot;can I help cook?&quot;  Just voices everywhere.  Dakari did<br/>\nhelp me cook, as did Safiya - I&#39;m working on saying &quot;yes&quot; more often.<br/>\n<br/>\n <br/>\n<br/>\nI just want to be able to stay centered and not get swept away in the<br/>\nnatural chaos that comes along with having young children.  I want to stop<br/>\ngritting my teeth and wishing for a quiet spot away from everyone.  I want<br/>\nto see the world and my children differently - even if my husband does not.<br/>\n<br/>\n <br/>\n<br/>\nWhat can/should I do?<br/>\n<br/>\n <br/>\n<br/>\nbe at peace,<br/>\n<br/>\nMaisha<br/>\n<br/>\nKhalfani Family Adventures &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://khalfanifamilyadventures.blogspot.com/\">http://khalfanifamilyadventures.blogspot.com/</a>&gt; <br/>\n<br/>\nEarthSpirit Journeys &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://earthspiritjourneys.blogspot.com/\">http://earthspiritjourneys.blogspot.com/</a>&gt; <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":30225,"nextTopicId":30240}}