{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"what to do instead of punishing","postDate":"1204983402","msgId":30600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTRGMzg5NDJBMUVCNi05NzQtMzM1MkB3ZWJtYWlsLWRkMDUuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":30599,"nextInTime":30601,"topicId":30600,"numMessagesInTopic":0,"msgSnippet":"This post is from AlwaysLearning by Pam Sorooshian. I thought it needed to be shared *here* too. ~Kelly Kelly Lovejoy Conference Coordinator Live and Learn","messageBody":"<div id=\"ygrps-yiv-217537238\">This post is from AlwaysLearning by Pam Sorooshian. I thought it needed <br/>\nto be shared *here* too.<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n-=-=-=-=-=-<br/>\n    Posted by: &quot;Pamela Sorooshian&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> psoroosh<br/>\n    Date: Fri Mar 7, 2008 9:19 am ((PST))<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-&gt; I think we need more discussion about HOW to intervene- for<br/>\n&gt; &gt; instance if you are not spanking or sending to time out or their<br/>\n&gt; &gt; room or yelling at them WHAT are you doing ins<br/>\n<br/>\n </span></blockquote>Yes - I think people are at a loss because we can so much more easily<br/>\ntalk about what we don&#39;t do than what we do instead of spanking,<br/>\nyelling, time-outs, taking-away things, etc.<br/>\n<br/>\nWhat we do instead is more complicated and more specific to the child/<br/>\nsituation. It is easier to talk about it in &quot;case study&quot; format - so<br/>\nif people give real examples, we can come up with possible actions. It<br/>\ntakes a lot more explaining than saying things like, &quot;Put them in time-<br/>\nout, one minute per year of age.&quot;<br/>\n<br/>\nWe don&#39;t just ignore the problem behaviors, though. If there is a<br/>\nserious problem behavior going on - hitting, kicking, screaming in<br/>\nsomeone&#39;s face, throwing things, breaking things, slamming a door so<br/>\nhard it breaks the door jam, and so on, then we stop and respond to<br/>\nthat, we don&#39;t just continue sweetly and patiently talking to the<br/>\nchild about what they want, as if that stuff is not going on.<br/>\n<br/>\nHere is an example that is probably pretty clear to most parents. We<br/>\nextend this example up for older children, basing our behavior on the<br/>\nsame principles.<br/>\n<br/>\n   You are with a group of people in a restaurant. You brought some<br/>\nthings for your toddler to do while waiting, you got some crackers<br/>\nfrom the waitress so he doesn&#39;t have to sit and wait for food. But,<br/>\nhe&#39;s not happy and you see he is getting a little agitated, you<br/>\nanticipate he&#39;s about to be very unhappy. You head off problems by<br/>\nturning to him and paying attention to him by playing a finger game -<br/>\nItsy Bitsy Spider, for example. That helps for a few minutes, but he<br/>\nwants OUT of his chair. So you get him out and he sits on your lap for<br/>\na minute, but that isn&#39;t working for him. He wants down to run around.<br/>\nIt isn&#39;t going to be okay in that busy restaurant - lots of waiters<br/>\ncarrying large trays of food, lots of elderly people, crowded, narrow<br/>\nspace between tables, etc. He starts squirming, fussing, and demanding<br/>\nto be put down. He stretches out and his feet are kicking the person<br/>\nnext to you. He&#39;s whining, getting louder, you know he&#39;s about to<br/>\nburst into a loud crying complaint.<br/>\n<br/>\nWhat do you do?  Take him out of the restaurant. Go outside, let him<br/>\nrun up and down the sidewalk. If it is too cold, get into the car and<br/>\nlet him climb around in there - listen to music, sing together.<br/>\n<br/>\nYou don&#39;t punish him, right? But you don&#39;t just keep sitting in the<br/>\nrestaurant while he gets more and more and more unhappy and more and<br/>\nmore disruptive to other diners. You don&#39;t just keep talking patiently<br/>\nand sweetly to him, explaining, &quot;The food will come in a a few<br/>\nminutes.&quot; And you don&#39;t sit there and keep asking him, &quot;What would<br/>\nwork for you? Is there something Mommy can do for you?&quot; That last is<br/>\nlikely to really push him over the edge - asking a kid who is close to<br/>\na meltdown already what you can do for them is often pulling the<br/>\ntrigger for them to freak out. Too much frustration and now you want<br/>\nthem to tell YOU how to solve it? You&#39;re the adult with the experience<br/>\nand wisdom, you need to help them solve it - figure out what will help<br/>\nthem, don&#39;t just sit there and ask and don&#39;t even sit there and offer<br/>\na list of possibilities if they don&#39;t accept the first one or two<br/>\noffers, then they&#39;re beyond being able to think about solutions.<br/>\n<br/>\nYou take them out - EVEN if they scream, &quot;NO I DON&#39;T WANT TO GO.&quot; You<br/>\nsay, calmly, &quot;We can&#39;t stay inside and be disruptive,&quot; and you take<br/>\nhim outside. Outside, you don&#39;t punish, you are clear in the message -<br/>\n&quot;If you want to be inside, you have to sit quietly - that&#39;s how<br/>\nrestaurants are.&quot; But we can hang out here for a while and then go<br/>\nback in when the food comes - that will be easier for you.&quot;<br/>\n<br/>\nYOU, the adult, know what the problem is and what the child needs - it<br/>\nis just too much sitting still, he needs to move. You help him get<br/>\nwhat he needs and you give him TRUE information - inside restaurants<br/>\nis not usually a place where a person should run around, climb, or<br/>\nscream.<br/>\n<br/>\nAnd next time you want to go to a nice restaurant with friends, you<br/>\nplan ahead better, if at all possible. YOU can learn, too. &lt;G&gt;<br/>\n<br/>\nSo -what did we do?<br/>\n<br/>\nA child is behaving inappropriately -<br/>\n<br/>\n1. We assume there is a good reason for it. They have needs not being<br/>\nmet. And we try to think of what those needs are. We make our best<br/>\nguess, we&#39;re usually right. We head off the problem as we see it<br/>\ncoming, meet their needs if we can.<br/>\n<br/>\n2. We do not just ignore the behavior. Especially if it is attacking<br/>\nor obstructing or disrupting other people, then we are clear in our<br/>\nmessage - &quot;You don&#39;t want to sit here anymore, but you can&#39;t run<br/>\naround or scream inside here.&quot;<br/>\n<br/>\n3. You follow through on that clear statement - usually that means you<br/>\nget up and take the child out of wherever you are. Yes, even if they<br/>\nare screaming that they don&#39;t want to go. You are not punishing them -<br/>\ndon&#39;t confuse this with punishment even if they aren&#39;t happy about it.<br/>\n(Punishment would be when you get them outside, you spank them or you<br/>\ntell them, &quot;Just for that display, you don&#39;t get dessert today,&quot; or<br/>\n&quot;You&#39;re in time out and you&#39;re going to sit on that bench until you&#39;ve<br/>\nbeen quiet for 5 full minutes.&quot;)<br/>\n<br/>\n4. You help them recover. You&#39;re attentive, kind, patient and willing<br/>\nto let the whole thing drop and move on to happiness. (But, if they&#39;re<br/>\nstill swinging at you, screaming in your face, etc., you&#39;re still in<br/>\nthe above three steps.)<br/>\n<br/>\n-pam</div>","specialLinks":[]}],"prevTopicId":30591,"nextTopicId":30601}}