{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":279647515,"authorName":"d.lewis","from":"&quot;d.lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268838919","msgId":43386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1MjY2QjBGRDUwMDQ4OThBNzFEMDc2NEY0N0Y0REFGQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+IDw2QTY4NEY5MS0xRkRDLTQxMzctQkMwQi0zRThFOUEzREY2MzNAdmVyaXpvbi5uZXQ+IDxCRTNBNzlFOTMwQzI0MUMzQTVCRTE4NzEzNDExNThBMEBPd25lclBDPiA8QzVDM0UwNjAxQ0MwNDM4NkFFMkM3NTIwNkM0RkJFRkFAZGVib3JhaDc2YTc5aHY+IDxCQUZDRTBENjJGRjQ0MDBCOTZCOTVDQTk1NDkxNEE3Q0BPd25lclBDPg=="},"prevInTopic":43384,"nextInTopic":0,"prevInTime":43385,"nextInTime":43387,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"*** I clearly see how spending more alone time directly with him can help, but how does that carry over into manners?*** When you wrote that his grandmother","messageBody":"<div id=\"ygrps-yiv-77833652\">*** I clearly see how spending more alone time directly with him can help, <br/>\nbut<br/>\nhow does that carry over into manners?***<br/>\n<br/>\nWhen you wrote that his grandmother was concerned and that he wasn&#39;t polite <br/>\ndid you mean he doesn&#39;t say &quot;please&quot; and &quot;thank you&quot; or did you mean he&#39;s <br/>\nrude?<br/>\n<br/>\nBy spending more time with him, you&#39;ll able to talk with him more, in <br/>\nregular conversation, about what other people expect.   If you&#39;re with him <br/>\nand he brings up grandma, you can tell him grandma likes to hear please and <br/>\nthank you, it makes her feel like people appreciate what she does for them. <br/>\nIf you&#39;re with him you&#39;ll be able to tell what he&#39;s doing that seems <br/>\nimpolite to others and you&#39;ll be able to coach him more about that stuff. <br/>\nLots of times families have their own way of being with each other at home <br/>\nthat just is not acceptable when you&#39;re at someone else&#39;s house.<br/>\n<br/>\nDylan and David used to do this thing, they&#39;d deliberately crash into each <br/>\nother and shove each other, all the time saying, &quot;excuse me, pardon me.&quot; <br/>\nWe have a really narrow little galley kitchen and it probably started in <br/>\nthere.&lt;g&gt;   But it would not have been cool for Dylan to play that game with <br/>\nother people in other houses.   Our kids need our help to learn what&#39;s <br/>\nexpected of them socially.<br/>\n<br/>\nIf you&#39;re with him more, he&#39;ll see and hear you and the way you are with <br/>\nother people, that you are polite, and he&#39;ll come to know that&#39;s how people <br/>\nought to be with each other.<br/>\n<br/>\n***With his older sister, she just copied what dh and I say to each other. <br/>\nWe<br/>\nnever gave her something and asked &quot;what do you say?&quot; or asked what&#39;s<br/>\nthe magic word, so she could have something.***<br/>\n<br/>\nRight.  I don&#39;t mean lessons.  That&#39;s creepy.&lt;g&gt;   When Dylan&#39;s uncle once <br/>\nasked, &quot;What&#39;s the magic word?&quot; Dylan answered, &quot;Abracadabra!&quot;  &lt;g&gt;<br/>\n<br/>\nBut if you notice him doing something you know will disturb his grandma, <br/>\ntell him about it. Don&#39;t lecture, just provide information.   He deserves to <br/>\nhave the benefit of your greater powers of observation.    And if you&#39;re <br/>\nwith grandma and he forgets to say &quot;thank you,&quot; *you* say it!  Let her know <br/>\nyou appreciate the nice thing she did for him.  &quot;Oh thank you!  He really <br/>\nloves peanut butter cookies, that was so thoughtful of you!&quot;   Your <br/>\nappreciation of her will go a long way toward helping her be more patient <br/>\nwith your son.<br/>\n<br/>\n***I&#39;m even starting to doubt that I&#39;m fully capable of getting done the <br/>\nthings that need<br/>\ndoing, while giving my son enough attention, let alone having both<br/>\nof my children home all day.***<br/>\n<br/>\nYes, it&#39;s hard.  I had one child and I seldom if ever got everything done. <br/>\nStill today, (he&#39;s seventeen) I don&#39;t always get everything done.<br/>\n<br/>\nI stayed up later than Dylan to get some things done.  I got up earlier.   I <br/>\nlet things wait until he was doing something with friends or with his dad. <br/>\nMy standards were never really high but I lowered them some.   I made <br/>\npicking up easier.  I left waste baskets in every room and those <br/>\npremoistened cleaning wipes.  I&#39;d wipe off the sinks and toilets every day <br/>\nbecause it only takes a minute if they&#39;re not really dirty.  You don&#39;t spend <br/>\ntime scrubbing.   I&#39;d fill the kitchen sink with hot water and do a few <br/>\ndishes as I was able.  It sometimes took all day to get them all done but <br/>\nI&#39;d just add more hot water and do a few more when I had the chance.  A <br/>\nrubber glove on your hand will roll cat and dog hair off furniture fast and <br/>\nyou don&#39;t have to get out the vacuum cleaner.  Having toy bins in each room <br/>\nlets you get toys picked up without making trips all over the house.   Do <br/>\nthe little things that will make it easier on  you.<br/>\n<br/>\n***Why is doing something like reading the first thing I think of, instead <br/>\nof<br/>\nplanning an outing with my son?***<br/>\n<br/>\nWith a four year old you might not even need to plan.  Just step out the <br/>\ndoor and see where the day takes you.<br/>\nAnd you don&#39;t have to read *instead* of doing things with your son.  You can <br/>\ndo things with him AND read -when you have the chance. &lt;g&gt;<br/>\n<br/>\n***Is there really a cure for this brainwashing that<br/>\nI have undergone for so many years?***<br/>\n<br/>\nIt&#39;s not unique to you.  Most people unschooling their kids today were <br/>\nraised more conventionally and most went to school.   If other people can do <br/>\nit, you can too.<br/>\nLots here with links:   <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n***wanting the approval of his family, and to be<br/>\n&quot;in control&quot; (Ha, Ha, Ha) so we are often not on the same page these days.<br/>\nIt&#39;s so easy to forget what really matters in the face of day to day <br/>\n&quot;situations.&quot;<br/>\nAnd it&#39;s how we were raised, and so comes up as the first response when <br/>\nanything<br/>\n&quot;unwanted&quot; rears its head. &quot;Fix the kid, control the kid, it&#39;s a problem <br/>\nwith<br/>\nthe kid.&quot;***<br/>\n<br/>\nThe expectation of others can be a positive thing.  You don&#39;t have to live <br/>\nyour life according to the standards of other people, but considering those <br/>\nstandards can help you see where you could do better.   If people are <br/>\ntelling you your kid needs something, don&#39;t just brush it off.   Look at <br/>\nyour child.  Be with him more and see what his life might need so that he <br/>\ncan be happier.    You don&#39;t have to be angry about the opinions of other <br/>\npeople and you don&#39;t have to jump to some typical &quot;solution&quot; to a problem, <br/>\nbut if you see their concern has merit, you can use your own principles to <br/>\nfind a solution.<br/>\n<br/>\nI&#39;ve seen it and I&#39;ve experienced it.  Getting angry at what other people <br/>\nthink of us very often means we ourselves know their observation has (at <br/>\nleast some) merit.   Ouch.<br/>\n<br/>\nUnderstanding you don&#39;t have to choose traditional &quot;fixes&quot; or traditional <br/>\nparenting to get to more harmonious family relations can help you feel <br/>\ncalmer.  You don&#39;t have to &quot;fix&quot; your son right now for all time.  You can <br/>\nspend the next minute with him in a happy way.    You don&#39;t have to make him <br/>\nperfect for the next visit to grandma&#39;s you can play today, talk and laugh <br/>\nand be with him.   Make the next moment better for your son and the stuff of <br/>\nthe bigger picture will improve with time.<br/>\n<br/>\nSo much will be helped by you just being with your son.  You&#39;ll feel better <br/>\nabout the kind of mom you are.  Your son will be happier.  You&#39;ll both be <br/>\nlearning more.   Your in-laws will see that you&#39;re a devoted mom and worry <br/>\nless.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":153200361,"authorName":"Tracy Austin","from":"&quot;Tracy Austin&quot; &lt;webinfusion@...&gt;","profile":"tracyaustin30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268825971","msgId":43382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBRkNFMEQ2MkZGNDQwMEI5NkI5NUNBOTU0OTE0QTdDQE93bmVyUEM+","inReplyToHeader":"PEM1QzNFMDYwMUNDMDQzODZBRTJDNzUyMDZDNEZCRUZBQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+IDw2QTY4NEY5MS0xRkRDLTQxMzctQkMwQi0zRThFOUEzREY2MzNAdmVyaXpvbi5uZXQ+IDxCRTNBNzlFOTMwQzI0MUMzQTVCRTE4NzEzNDExNThBMEBPd25lclBDPiA8QzVDM0UwNjAxQ0MwNDM4NkFFMkM3NTIwNkM0RkJFRkFAZGVib3JhaDc2YTc5aHY+"},"prevInTopic":43376,"nextInTopic":43384,"prevInTime":43381,"nextInTime":43383,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"Thanks for your thoughts, Deb. You wrote: You ve said he s not polite, he s destructive and he s hurting his sister, you should be with him all the time. If","messageBody":"<div id=\"ygrps-yiv-597731808\">Thanks for your thoughts, Deb. You wrote:<br/>\n<br/>\n&quot;You&#39;ve said he&#39;s not polite, he&#39;s destructive and he&#39;s hurting his sister, <br/>\nyou should be with him all the time. If that means leaving housework until <br/>\nyour partner gets home, or waiting to get on the computer until he&#39;s asleep, <br/>\nthen that&#39;s what it means right now. He&#39;s growing and changing and won&#39;t be <br/>\nfour forever.&quot;<br/>\n<br/>\nIt&#39;s true I have been otherwise occupied alot lately! To clarify, he would be <br/>\npolite if I spent more time with him? Between your reply and the others, I<br/>\nclearly see how spending more alone time directly with him can help, but<br/>\nhow does that carry over into manners?<br/>\n<br/>\nWith his older sister, she just copied what dh and I say to each other. We<br/>\nnever gave her something and asked &quot;what do you say?&quot; or asked what&#39;s<br/>\nthe magic word, so she could have something.<br/>\n<br/>\nBut as I write this I&#39;m answering my own question - the years went by<br/>\nand these days those phrases have cropped up many a time, with relatives<br/>\nand friends, and even at home...<br/>\n<br/>\nSo I guess that is more &quot;proof&quot; that you don&#39;t have to &quot;teach&quot; manners and<br/>\nrespect. They are a by-product of being polite and respectful of others. <br/>\n<br/>\nWe have strayed a lot lately from the unschooling philosophy...I&#39;m even<br/>\nstarting to doubt that I&#39;m fully capable of getting done the things that need<br/>\ndoing, while giving my son enough attention, let alone having both <br/>\nof my children home all day. Yet the last thing I want is for them to be &quot;schooled.&quot; <br/>\n<br/>\nHow did this happen?! As if you, dear reader, would know:-/ Crap! It&#39;s <br/>\ncentered around finances and dh wanting the approval of his family, and to be <br/>\n&quot;in control&quot; (Ha, Ha, Ha) so we are often not on the same page these days. <br/>\n<br/>\nIt&#39;s so easy to forget what really matters in the face of day to day &quot;situations.&quot; <br/>\nAnd it&#39;s how we were raised, and so comes up as the first response when anything<br/>\n&quot;unwanted&quot; rears its head. &quot;Fix the kid, control the kid, it&#39;s a problem with<br/>\nthe kid.&quot;<br/>\n<br/>\nSo now I&#39;m left with the thought that I need to refresh my memory on<br/>\nhow to live this lifestyle, which - ha, ha, ha! has me looking for my <br/>\ncopy of Raising Our Children, Raising Ourselves, so I can read it again.<br/>\n<br/>\nWhy is doing something like reading the first thing I think of, instead of<br/>\nplanning an outing with my son????????????????? I&#39;m feeling totally<br/>\nf&#39;ed-up at this moment! Is there really a cure for this brainwashing that<br/>\nI have undergone for so many years? Sorry to babble on...it&#39;s frustrating<br/>\nto feel like you have someone else&#39;s values in your own head...but<br/>\nI do know I&#39;m the only one who can evict them.... <br/>\n<br/>\nTracy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268825535","msgId":43384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5MTA2My45MTUyNi5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PEJBRkNFMEQ2MkZGNDQwMEI5NkI5NUNBOTU0OTE0QTdDQE93bmVyUEM+","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+IDw2QTY4NEY5MS0xRkRDLTQxMzctQkMwQi0zRThFOUEzREY2MzNAdmVyaXpvbi5uZXQ+IDxCRTNBNzlFOTMwQzI0MUMzQTVCRTE4NzEzNDExNThBMEBPd25lclBDPiA8QzVDM0UwNjAxQ0MwNDM4NkFFMkM3NTIwNkM0RkJFRkFAZGVib3JhaDc2YTc5aHY+IDxCQUZDRTBENjJGRjQ0MDBCOTZCOTVDQTk1NDkxNEE3Q0BPd25lclBDPg=="},"prevInTopic":43382,"nextInTopic":43386,"prevInTime":43383,"nextInTime":43385,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"... polite if I spent more time with him? Between your reply and the others, I clearly see how spending more alone time directly with him can help, but how","messageBody":"<div id=\"ygrps-yiv-1252412325\"><blockquote><span title=\"ireply\">&gt;----&lt; It&#39;s true I have been otherwise occupied alot lately! To clarify, he would be <br/>\n </span></blockquote>polite if I spent more time with him? Between your reply and the others, I<br/>\nclearly see how spending more alone time directly with him can help, but<br/>\nhow does that carry over into manners? &gt;----&lt;<br/>\n<br/>\nYes, he would be more polite if you spent more time with him. He would be more sensitive to the feelings of others if he was feeling loved and cared for and supported. Absolutely. Time in makes a huge difference. The more full Simon and Linnaea are with good feelings, with love and kindness and caring, the more it flows over into their relationships with others. At 4 it takes a lot to fill up to overflow. Actually, probably, if you are starting from zero, it takes a lot at any age, but if you&#39;ve been doing it for a long time, you don&#39;t usually get to zero. If there is a history of kindness and affection and love and a generousity flow from parent to child of time and care and engagement, than it can take less time to go from needy to full.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;----&lt; With his older sister, she just copied what dh and I say to each other. We<br/>\n </span></blockquote>never gave her something and asked &quot;what do you say?&quot; or asked what&#39;s<br/>\nthe magic word, so she could have something. &gt;----&lt;<br/>\n<br/>\nIt will probably help all of y&#39;all if you don&#39;t compare one to the other. It&#39;s easy to forget the hard bits of a childhood when you&#39;ve moved into another phase of that childhood. And it will help a lot if you look at your son as who he is instead of as someone who isn&#39;t as whatever as his sibling. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;----&lt; We have strayed a lot lately from the unschooling philosophy...I&#39;m even<br/>\n </span></blockquote>starting to doubt that I&#39;m fully capable of getting done the things that need<br/>\ndoing, while giving my son enough attention, let alone having both <br/>\nof my children home all day. Yet the last thing I want is for them to be &quot;schooled.&quot; &gt;----&lt;<br/>\n<br/>\nMaybe quit thinking about all that you need to do and start doing it. The more time you spend making lists, even if they are only mental, or feeling frustrated or irritated or angsty about what needs doing, all of that takes away from the time that you could be doing stuff. Fly lady some of the stuff. Do 15 minutes of a thing, instead of spending 15  minutes figuring out how to do it, just do it. 15 minutes can achieve quite a lot. The less you feel capable the less capable you may be. The bigger you make the molehill the more difficult it is to climb. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;----&lt; How did this happen?! As if you, dear reader, would know:-/ Crap! It&#39;s <br/>\n </span></blockquote>centered around finances and dh wanting the approval of his family, and to be <br/>\n&quot;in control&quot; (Ha, Ha, Ha) so we are often not on the same page these days. &gt;----&lt;<br/>\n<br/>\nYou can&#39;t change his side of it, but you can change yours. So be there more with your son, help him to fulfill his needs and he will seem less the kid you need to fix and more the kid who you get to hang out. It&#39;s so amazing when it turns from a duty to a privilege. Don&#39;t worry about what page your husband is on and how many pages out the two of you are from seeing the same perspective. Do what you can to at least understand that his page has value. His perspective is still about loving his children and worrying about their well-being and isn&#39;t about tripping you up or making your life more difficult. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;----&lt; It&#39;s so easy to forget what really matters in the face of day to day &quot;situations.&quot; <br/>\n </span></blockquote>And it&#39;s how we were raised, and so comes up as the first response when anything<br/>\n&quot;unwanted&quot; rears its head. &quot;Fix the kid, control the kid, it&#39;s a problem with<br/>\nthe kid.&quot; &gt;----&lt;<br/>\n<br/>\nI&#39;ve been slowly going through and deleting my e-mails, my box is seriously full, and I read in one e-mail the idea of giving a new dog owner a rolled up newspaper and when the dog did something wrong the new dog owner should whack themselves on the head with the newspaper. I think the idea of fix the other isn&#39;t ever the solution (its the precipitate -- haha) it takes so much more to change someone else than it does to change how you respond to them. Rather than working to fix your son, work to engage him. See his destruction of property and rude behavior as a desperate need for entertainment and engagement and connection. The more you work to keep him at a distance, to &quot;fix&quot; him the less you are hanging out with him and exploring the world together. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;----&lt; Why is doing something like reading the first thing I think of, instead of<br/>\n </span></blockquote>planning an outing with my son????????????????? I&#39;m feeling totally<br/>\nf&#39;ed-up at this moment! Is there really a cure for this brainwashing that<br/>\nI have undergone for so many years? Sorry to babble on...it&#39;s frustrating<br/>\nto feel like you have someone else&#39;s values in your own head...but<br/>\nI do know I&#39;m the only one who can evict them.... &gt;----&lt;<br/>\n<br/>\nGo out and do. Don&#39;t chastize, don&#39;t write, don&#39;t look for cures, just go out to a park, to a movie, to a ball room, to a zoo, to a child-friendly museum, and play and wander and run and laugh and do!<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268763550","msgId":43376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1NDczNi44NzgzLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEJFM0E3OUU5MzBDMjQxQzNBNUJFMTg3MTM0MTE1OEEwQE93bmVyUEM+","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+IDw2QTY4NEY5MS0xRkRDLTQxMzctQkMwQi0zRThFOUEzREY2MzNAdmVyaXpvbi5uZXQ+IDxCRTNBNzlFOTMwQzI0MUMzQTVCRTE4NzEzNDExNThBMEBPd25lclBDPg=="},"prevInTopic":43375,"nextInTopic":43382,"prevInTime":43375,"nextInTime":43377,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"It sounds like your son needs more attention. I don t think a rule would help nearly as much as hanging out with him more. A child who has time to take toys","messageBody":"<div id=\"ygrps-yiv-164040770\">It sounds like your son needs more attention. I don&#39;t think a rule would help nearly as much as hanging out with him more. A child who has time to take toys and knives and dig and gouge into the living room needs more time being watched and engaged and less time gravitating towards a wall or windowsill where he can carve. Help him to play without his sister. Make his time at home fantastic and cool so that when she gets home he feels less like she is the exciting moment in the day. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"d.lewis","from":"&quot;d.lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268763175","msgId":43375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1QzNFMDYwMUNDMDQzODZBRTJDNzUyMDZDNEZCRUZBQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+IDw2QTY4NEY5MS0xRkRDLTQxMzctQkMwQi0zRThFOUEzREY2MzNAdmVyaXpvbi5uZXQ+IDxCRTNBNzlFOTMwQzI0MUMzQTVCRTE4NzEzNDExNThBMEBPd25lclBDPg=="},"prevInTopic":43373,"nextInTopic":43376,"prevInTime":43374,"nextInTime":43376,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"***My ds is 4 and he takes tools (real, toy, knives, whatever he can find that he can alter something with) and digs, cuts, scrapes into one of the windowsills","messageBody":"<div id=\"ygrps-yiv-147144171\">***My ds is 4 and he takes tools (real, toy, knives, whatever he can find <br/>\nthat he can alter<br/>\nsomething with) and digs, cuts, scrapes into one of the windowsills and one <br/>\nparticular<br/>\npart of the living room wall.***<br/>\n<br/>\nWhere are you when he digs the windowsills or walls?<br/>\nIf you know he&#39;s likely to do it (because he&#39;s done it before) you should be <br/>\nwith him.<br/>\n<br/>\n ***For the most part he&#39;ll stop when redirected, or told<br/>\nwhy it&#39;s not ok. ***<br/>\n<br/>\nBut he does it again? After you told him why it&#39;s not ok?<br/>\nHe needs you with him more, then.<br/>\n<br/>\n***he will hit or throw things at his sister when she doesn&#39;t want to play <br/>\nwith<br/>\nhim. He won&#39;t be dissuaded by our attempts to get him focused on something<br/>\nelse, playing with dh or me, helping us with something***<br/>\n<br/>\nIt seems like he needs more direct attention from you so that he&#39;s not left <br/>\nto dig walls or depend on his sister to be his play mate.<br/>\n<br/>\nBusy moms sometimes forget how much four year olds still need attention. <br/>\nThey can seem so mature about so many things - able to get snacks and <br/>\ndrinks, able to work the TV and DVR and computer.  But they really need mom <br/>\nattention.   If you are doing housework or on the computer while he&#39;s doing <br/>\nhis own thing, he&#39;s on his own too much.    Play with him a lot while his <br/>\nsister is in school.   Get out and do things together, even if that&#39;s just <br/>\ndigging a big hole in the garden.  Be right with him, be his companion. <br/>\nHelping him find appropriate things to bang up and destroy is fine but it <br/>\nhas to come with the attention and companionship he&#39;s craving or it won&#39;t be <br/>\nenough.<br/>\n<br/>\nIf being destructive is his outlet for feelings of frustration or loneliness <br/>\nyou can change that.  If he has opportunity to destroy appropriate things <br/>\nbut still feels frustrated or lonely, he might find other, possibly more <br/>\ndestructive outlets.  Don&#39;t expect the act of destruction to fulfill him. <br/>\n*You* are the only thing that can fulfill him.   Your time, your attention.<br/>\n<br/>\nYou&#39;ve said he&#39;s not polite, he&#39;s destructive and he&#39;s hurting his sister, <br/>\nyou should be with him all the time.  If that means leaving housework until <br/>\nyour partner gets home, or waiting to get on the computer until he&#39;s asleep, <br/>\nthen that&#39;s what it means right now.  He&#39;s growing and changing and won&#39;t be <br/>\nfour forever.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":153200361,"authorName":"Tracy Austin","from":"&quot;Tracy Austin&quot; &lt;webinfusion@...&gt;","profile":"tracyaustin30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;I will not allow you...&quot;","postDate":"1268761234","msgId":43369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxQjZCREFGMzNCMDQ0MEVBOTkwRjg0ODBFNUFFNzJGQE93bmVyUEM+","inReplyToHeader":"PGhubzhpYytrM2w3QGVHcm91cHMuY29tPg==","referencesHeader":"PGhubzhpYytrM2w3QGVHcm91cHMuY29tPg=="},"prevInTopic":43367,"nextInTopic":43370,"prevInTime":43368,"nextInTime":43370,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"... For clarity s sake, please don t quote this as being my words. They aren t. Find the source here: http://sandradodd.com/rules I forgot to put the quotes","messageBody":"<div id=\"ygrps-yiv-1983412907\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Tracy Austin&quot; &lt;webinfusion@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I ended up defining rules as &quot;I will not allow you...&quot; statements, and only came up with two: I will not allow you to hurt anyone and I will not allow you to destroy things (like walls, people&#39;s hard work, etc.). <br/>\n<br/>\n </span></blockquote>For clarity&#39;s sake, please don&#39;t quote this as being my words. They aren&#39;t.<br/>\n<br/>\nFind the source here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a> I forgot to put the quotes around it<br/>\nwhen I copied it from the above page.<br/>\n<br/>\nThanks<br/>\nTracy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153200361,"authorName":"Tracy Austin","from":"&quot;Tracy Austin&quot; &lt;webinfusion@...&gt;","profile":"tracyaustin30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268761005","msgId":43367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFM0E3OUU5MzBDMjQxQzNBNUJFMTg3MTM0MTE1OEEwQE93bmVyUEM+","inReplyToHeader":"PDZBNjg0RjkxLTFGREMtNDEzNy1CQzBCLTNFOEU5QTNERjYzM0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+IDw2QTY4NEY5MS0xRkRDLTQxMzctQkMwQi0zRThFOUEzREY2MzNAdmVyaXpvbi5uZXQ+"},"prevInTopic":43365,"nextInTopic":43369,"prevInTime":43366,"nextInTime":43368,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"Ooops! I forgot to put quotes around the quote, so it looks like that was what I came up with from reading that page!  http://sandradodd.com/rules I ended up","messageBody":"<div id=\"ygrps-yiv-2107361881\">Ooops! I forgot to put quotes around the quote, so it looks like that was what I came up with<br/>\nfrom reading that page!  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\n&quot;I ended up defining rules as &quot;I will not allow you...&quot; statements, and only came up with two: I will not allow you to hurt anyone and I will not allow you to destroy things (like walls, people&#39;s hard work, etc.). &quot;<br/>\n<br/>\nBut that isn&#39;t my statement, it&#39;s one of a person in the thread, 3/4 of the way<br/>\ndown the page, and it wasn&#39;t specifically contradicted by anything else, hence my question.<br/>\n<br/>\nI selected it for 2 reasons. It didn&#39;t seem like unschooling, but it&#39;s on the site, and I<br/>\ndo have a child who destroys things and hurts others.<br/>\n<br/>\nJoyce wrote:<br/>\n<br/>\nWhy do you think you would need to tell your kids not to hurt or destroy? <br/>\n<br/>\nMy ds is 4 and he takes tools (real, toy, knives, whatever he can find that he can alter<br/>\nsomething with) and digs, cuts, scrapes into one of the windowsills and one particular<br/>\npart of the living room wall.<br/>\n<br/>\nWe give him things to hammer, cut, pound with real and toy tools, and still<br/>\nhe prefers the other activities that damage things we prefer not be. <br/>\n<br/>\nI care more about him than our stuff, but it does require <br/>\nrepair for when we want to sell the house, or just not have to explain it to<br/>\npeople who come over. For the most part he&#39;ll stop when redirected, or told<br/>\nwhy it&#39;s not ok. <br/>\n<br/>\nAs for the hurting others, he will hit or throw things at his sister when she doens&#39;t want to play with <br/>\nhim. He won&#39;t be dissuaded by our attempts to get him focused on something<br/>\nelse, playing with dh or me, helping us with something...she chose school<br/>\nand he misses her during the day, but she wants to decompress for awhile before playing.<br/>\n<br/>\nSo I suggested he and I make it our objective to help her do that when we get her home. Get her a cup<br/>\nof cocoa and a snack while she watches TV for awhile, then they can play. That worked for one day:-)<br/>\nBut I will keep trying and if anyone has any other suggestions?<br/>\n<br/>\nI don&#39;t think he is a little monster or has a black heart. He actually does<br/>\n thsese things (hitting, throwing,) because he loves her and wants to play with her.<br/>\nBut she doesn&#39;t want that sometimes and that is a problem...how to help them each<br/>\nget their needs met?<br/>\n<br/>\nTracy<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Joyce Fetteroll <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, March 16, 2010 6:34 AM<br/>\n  Subject: Re: [unschoolingbasics] &quot;I will not allow you...&quot;<br/>\n<br/>\n<br/>\n    <br/>\n<br/>\n  On Mar 15, 2010, at 9:26 PM, Tracy Austin wrote:<br/>\n<br/>\n  &gt; I ended up defining rules as &quot;I will not allow you...&quot; statements, <br/>\n  &gt; and only came up with two: I will not allow you to hurt anyone and <br/>\n  &gt; I will not allow you to destroy things (like walls, people&#39;s hard <br/>\n  &gt; work, etc.).<br/>\n<br/>\n  A big huge part of getting radical unschooling is moving to a new <br/>\n  land where relationships with kids and learning looks, feels and <br/>\n  works differently than in conventional-parenting land. Even thinking <br/>\n  of retaining a rule or two keeps a parent with one foot rooted in the <br/>\n  old land. That will make it harder to shift to the way the new land <br/>\n  works.<br/>\n<br/>\n  That is NOT NOT NOT a recommendation for people to drop all their <br/>\n  rules at once! Absolutely go slow. Say yes more. What I&#39;m saying is <br/>\n  don&#39;t work toward a land of only 2 rules. Work toward a land of no <br/>\n  rules. Work toward a land where parents find solutions to meet kids <br/>\n  needs that are based on their principles.<br/>\n<br/>\n  First, think about the above statements. Why do you think you would <br/>\n  need to tell your kids not to hurt or destroy? Do you think they want <br/>\n  to? Are they little monsters with black hearts that want to hurt and <br/>\n  destroy? And your continued reminders is the only thing that will <br/>\n  remove that sin from their hearts?<br/>\n<br/>\n  If they aren&#39;t monsters, do you think insinuating that they are will <br/>\n  remind them you&#39;re a team and you&#39;re there to help them? If someone <br/>\n  accuses me of being a thief I do *not* feel instantly enlightened and <br/>\n  happy to work with them! I am angry that anyone would assume that of <br/>\n  me and defensive of who I really am.<br/>\n<br/>\n  Kids aren&#39;t aliens! (Or monsters ;-) They have the same feelings when <br/>\n  they&#39;re treated like that. Making someone angry and defensive as a <br/>\n  first step to problem solving isn&#39;t on the list of even the most <br/>\n  outlandish problem solving program ;-)<br/>\n<br/>\n  Sometimes kids actions *do* suggest they want to hurt and <br/>\n  destroy! ;-) Help yourself move to the new land by letting go of that <br/>\n  interpretation. When kids feel their needs will be met and they do <br/>\n  end up hurting and breaking things, it&#39;s because they want something <br/>\n  and they just can&#39;t figure out a complex roundabout route through the <br/>\n  lands of safe, kind, healthy, respectful ... They see what they want <br/>\n  across the chasm right before them so they leap. They need help <br/>\n  traveling those complex routes not reprimands for not using them. <br/>\n  They need help until the complex routes become easy and second <br/>\n  nature. (Respectful social routes are *especially* hard. Loads of <br/>\n  adults never mastered them.)<br/>\n<br/>\n  It&#39;s also helpful to see that they *want* to be safe, kind, healthy, <br/>\n  respectful and so forth. We&#39;re born social animals. It&#39;s part of <br/>\n  human nature. That nature is overlaid on ancient fend-for-ourselves <br/>\n  instincts, but the need to be a part of a greater whole -- as opposed <br/>\n  to one against the world -- is an innate part of human nature (even <br/>\n  for introverts ;-). *Trust* that they don&#39;t want to hurt and destroy.<br/>\n<br/>\n  (Two caveats: I think it was Meredith who said Ray had a great need <br/>\n  to destroy things. But he didn&#39;t want to hurt people&#39;s feelings by <br/>\n  breaking things they cared about. He just had huge physical needs. So <br/>\n  she found things for him to break up. (If I&#39;m remembering right some <br/>\n  of it was old pieces of furniture people were throwing away.) Rather <br/>\n  than changing him, she found ways to channel that need into ways that <br/>\n  were safe and respectful.<br/>\n<br/>\n  And the second caveat, sometimes kids want something they can&#39;t have. <br/>\n  Like wanting for their little sister never to have been born ;-) And <br/>\n  they will act out in anger, but, again, they aren&#39;t monsters. <br/>\n  Undoubtedly they have legitimate reasons for wishing she weren&#39;t <br/>\n  there! A rule about not hurting doesn&#39;t make the problems go away. <br/>\n  Kids need empathy about what they lost when the sister was born (out <br/>\n  of ear shot of the sister!) and help in finding solutions to the <br/>\n  problems the little sister creates.<br/>\n<br/>\n  As a side note, if kids *are* deliberately hurting and destroying, <br/>\n  that&#39;s a sign there&#39;s some deeper hurt going on elsewhere in their <br/>\n  lives. Stopping the expression doesn&#39;t make what&#39;s hurting them go <br/>\n  away. It just drives it in deeper to fester.)<br/>\n<br/>\n  I think somewhere on her site Sandra mentions that she would say <br/>\n  something like &quot;I need home to be a safe place for Marty,&quot; maybe even <br/>\n  followed by, &quot;I wouldn&#39;t let a stranger hit him.&quot; That wasn&#39;t a rule. <br/>\n  It was more of a &quot;Whoa, wait, step back and look what&#39;s happening.&quot;<br/>\n<br/>\n  If a conventional parent said that, kids would hear &quot;I need to be a <br/>\n  roadblock because you&#39;re incapable of making good choices.&quot; The focus <br/>\n  would be on the wrongness of the child. But because her kids know -- <br/>\n  through years of actions --- that she&#39;s there to help them find a <br/>\n  *better* solution, not strand in their way, they were willing to stop.<br/>\n<br/>\n  It will help build a trusting relationship with them to be their <br/>\n  partner with ideas on how to accomplish what they&#39;re trying to do <br/>\n  that are safe and respectful rather than be keeper of the rules, even <br/>\n  if there are only 2.<br/>\n<br/>\n  Joyce<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n  Visit Your Group <br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;I will not allow you...&quot;","postDate":"1268760902","msgId":43373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhub2ZnNis1MThsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJFM0E3OUU5MzBDMjQxQzNBNUJFMTg3MTM0MTE1OEEwQE93bmVyUEM+"},"prevInTopic":43370,"nextInTopic":43375,"prevInTime":43372,"nextInTime":43374,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"... Destruction is so fascinating! Are you giving him the same kinds of materials as are in the house? Wood and drywall and tile and linoleum and","messageBody":"<div id=\"ygrps-yiv-418193558\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Tracy Austin&quot; &lt;webinfusion@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We give him things to hammer, cut, pound with real and toy tools, and still<br/>\n&gt; he prefers the other activities that damage things we prefer not be. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Destruction is so fascinating! Are you giving him the same kinds of materials as are in the house? Wood and drywall and tile and linoleum and what-have-you? It can be hard to fill up that kind of curiosity - and really that&#39;s the &quot;problem&quot; - he&#39;s curious! What about making a trip to salvation arm or someplace similar and buying some furniture for him to carve up and smash? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; So I suggested he and I make it our objective to help her do that when we get her home. Get her a cup<br/>\n&gt; of cocoa and a snack while she watches TV for awhile, then they can play. That worked for one day:-)<br/>\n&gt; But I will keep trying and if anyone has any other suggestions?<br/>\n<br/>\n </span></blockquote>It may be the sort of thing that requires multiple &quot;solutions&quot; depending on his mood. Some days you might be able to get him out of the house for awhile so she has a hour of quiet and privacy. Other days you may be able to do what you did above, in different ways. Some days you might be able to have a friend over for him in the afternoon. And some days you&#39;ll likely have to take lots of deep breaths ;) <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268757843","msgId":43370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxNDQxMi4zNzc4MS5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PEJFM0E3OUU5MzBDMjQxQzNBNUJFMTg3MTM0MTE1OEEwQE93bmVyUEM+","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+IDw2QTY4NEY5MS0xRkRDLTQxMzctQkMwQi0zRThFOUEzREY2MzNAdmVyaXpvbi5uZXQ+IDxCRTNBNzlFOTMwQzI0MUMzQTVCRTE4NzEzNDExNThBMEBPd25lclBDPg=="},"prevInTopic":43369,"nextInTopic":43373,"prevInTime":43369,"nextInTime":43371,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"That s Danielle Conger and the whole quote is: I ve been thinking a lot more about the rules vs. principles thread that Sandra brought up a little while back.","messageBody":"<div id=\"ygrps-yiv-1052594742\">That&#39;s Danielle Conger and the whole quote is: <br/>\n<br/>\nI&#39;ve been thinking a lot more about the rules vs. principles thread that Sandra brought up a little while back. I went and bought The <br/>\nSpirited Child,  which Joyce recommended, and one of the things it <br/>\ntalks about is clarifying your rules and enforcing them consistently. <br/>\nSo, I tried to reflect on what the rules around our house really are and how I would define a rule rather than a principle.<br/>\n<br/>\n<br/>\nI ended up defining rules as &quot;I will not allow you...&quot; statements, and <br/>\nonly came up with two: I will not allow you to hurt anyone and I will <br/>\nnot allow you to destroy things (like walls, people&#39;s hard work, etc.). <br/>\nSo, I decided to ask Emily, my oldest (6), what our rules around the <br/>\nhouse were. She just stared at me blankly, so I asked her what she <br/>\nthought &quot;rules&quot; were. She thought a minute and said, &quot;I think they have <br/>\nto do with slaves and slavery.&quot; What a profound statement I thought that was!&quot;<br/>\n<br/>\nShe was trying to figure out what rules they had in their house from a theoretical, post-hoc perspective. Not coming up with rules to apply to her home as it stands, instead coming up the rules that might be derived from the life they lead by an outsider. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Tracy Austin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:webinfusion@...\">webinfusion@...</a>&gt;<br/>\n<br/>\n<br/>\nOoops! I forgot to put quotes around the quote, so it looks like that was what I came up with<br/>\nfrom reading that page!  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\n&quot;I ended up defining rules as &quot;I will not allow you...&quot; statements, and only came up with two: I will not allow you to hurt anyone and I will not allow you to destroy things (like walls, people&#39;s hard work, etc.). &quot;<br/>\n<br/>\nBut that isn&#39;t my statement, it&#39;s one of a person in the thread, 3/4 of the way<br/>\ndown the page, and it wasn&#39;t specifically contradicted by anything else, hence my question.<br/>\n<br/>\nI selected it for 2 reasons. It didn&#39;t seem like unschooling, but it&#39;s on the site, and I<br/>\ndo have a child who destroys things and hurts others.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;I will not allow you...&quot;","postDate":"1268753804","msgId":43365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhubzhpYytrM2w3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+"},"prevInTopic":43363,"nextInTopic":43367,"prevInTime":43364,"nextInTime":43366,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"... ******************* It can help to start with a different set of assumptions - assume kids want to get along with other people in general. Hurting people","messageBody":"<div id=\"ygrps-yiv-1144013738\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Tracy Austin&quot; &lt;webinfusion@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I ended up defining rules as &quot;I will not allow you...&quot; statements, and only came up with two: I will not allow you to hurt anyone and I will not allow you to destroy things (like walls, people&#39;s hard work, etc.). <br/>\n </span></blockquote>*******************<br/>\n<br/>\nIt can help to start with a different set of assumptions - assume kids want to get along with other people in general. Hurting people and destroying things doesn&#39;t help one get along, so its an act of kindness on your part to help smooth the way, facilitate problem solving when that seems helpful, and come up with other ways for people to get their needs met. Why does someone want to hurt? Because he or she is frustrated? Is there a way to diffuse that frustration? to channel is into something else? To negotiate a compromise? Can you re-arrange the environment to mitigate that kind of frustration in the future? There&#39;s no need for a rule for all that to happen. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268739265","msgId":43363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBNjg0RjkxLTFGREMtNDEzNy1CQzBCLTNFOEU5QTNERjYzM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+"},"prevInTopic":43361,"nextInTopic":43365,"prevInTime":43362,"nextInTime":43364,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"... A big huge part of getting radical unschooling is moving to a new land where relationships with kids and learning looks, feels and works differently than","messageBody":"<div id=\"ygrps-yiv-462394878\">On Mar 15, 2010, at 9:26 PM, Tracy Austin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I ended up defining rules as &quot;I will not allow you...&quot; statements,  <br/>\n&gt; and only came up with two: I will not allow you to hurt anyone and  <br/>\n&gt; I will not allow you to destroy things (like walls, people&#39;s hard  <br/>\n&gt; work, etc.).<br/>\n<br/>\n<br/>\n </span></blockquote>A big huge part of getting radical unschooling is moving to a new  <br/>\nland where relationships with kids and learning looks, feels and  <br/>\nworks differently than in conventional-parenting land. Even thinking  <br/>\nof retaining a rule or two keeps a parent with one foot rooted in the  <br/>\nold land. That will make it harder to shift to the way the new land  <br/>\nworks.<br/>\n<br/>\nThat is NOT NOT NOT a recommendation for people to drop all their  <br/>\nrules at once! Absolutely go slow. Say yes more. What I&#39;m saying is  <br/>\ndon&#39;t work toward a land of only 2 rules. Work toward a land of no  <br/>\nrules. Work toward a land where parents find solutions to meet kids  <br/>\nneeds that are based on their principles.<br/>\n<br/>\nFirst, think about the above statements. Why do you think you would  <br/>\nneed to tell your kids not to hurt or destroy? Do you think they want  <br/>\nto? Are they little monsters with black hearts that want to hurt and  <br/>\ndestroy? And your continued reminders is the only thing that will  <br/>\nremove that  sin from their hearts?<br/>\n<br/>\nIf they aren&#39;t monsters, do you think insinuating that they are will  <br/>\nremind them you&#39;re a team and you&#39;re there to help them? If someone  <br/>\naccuses me of being a thief I do *not* feel instantly enlightened and  <br/>\nhappy to work with them! I am angry that anyone would assume that of  <br/>\nme and defensive of who I really am.<br/>\n<br/>\nKids aren&#39;t aliens! (Or monsters ;-) They have the same feelings when  <br/>\nthey&#39;re treated like that. Making someone angry and defensive as a  <br/>\nfirst step to problem solving isn&#39;t on the list of even the most  <br/>\noutlandish problem solving program ;-)<br/>\n<br/>\nSometimes kids actions *do* suggest they want to hurt and  <br/>\ndestroy! ;-) Help yourself move to the new land by letting go of that  <br/>\ninterpretation. When kids feel their needs will be met and they do  <br/>\nend up hurting and breaking things, it&#39;s because they want something  <br/>\nand they just can&#39;t figure out a complex roundabout route through the  <br/>\nlands of safe, kind, healthy, respectful ... They see what they want  <br/>\nacross the chasm right before them so they leap. They need help  <br/>\ntraveling those complex routes not reprimands for not using them.  <br/>\nThey need help until the complex routes become easy and second  <br/>\nnature. (Respectful social routes are *especially* hard. Loads of  <br/>\nadults never mastered them.)<br/>\n<br/>\nIt&#39;s also helpful to see that they *want* to be safe, kind, healthy,  <br/>\nrespectful and so forth. We&#39;re born social animals. It&#39;s part of  <br/>\nhuman nature. That nature is overlaid on ancient fend-for-ourselves  <br/>\ninstincts, but the need to be a part of a greater whole -- as opposed  <br/>\nto one against the world -- is an innate part of human nature (even  <br/>\nfor introverts ;-). *Trust* that they don&#39;t want to hurt and destroy.<br/>\n<br/>\n(Two caveats: I think it was Meredith who said Ray had a great need  <br/>\nto destroy things. But he didn&#39;t want to hurt people&#39;s feelings by  <br/>\nbreaking things they cared about. He just had huge physical needs. So  <br/>\nshe found things for him to break up. (If I&#39;m remembering right some  <br/>\nof it was old pieces of furniture people were throwing away.) Rather  <br/>\nthan changing him, she found ways to channel that need into ways that  <br/>\nwere safe and respectful.<br/>\n<br/>\nAnd the second caveat, sometimes kids want something they can&#39;t have.  <br/>\nLike wanting for their little sister never to have been born ;-) And  <br/>\nthey will act out in anger, but, again, they aren&#39;t monsters.  <br/>\nUndoubtedly they have legitimate reasons for wishing she weren&#39;t  <br/>\nthere! A rule about not hurting doesn&#39;t make the problems go away.  <br/>\nKids need empathy about what they lost when the sister was born (out  <br/>\nof ear shot of the sister!) and help in finding solutions to the  <br/>\nproblems the little sister creates.<br/>\n<br/>\nAs a side note, if kids *are* deliberately hurting and destroying,  <br/>\nthat&#39;s a sign there&#39;s some deeper hurt going on elsewhere in their  <br/>\nlives. Stopping the expression doesn&#39;t make what&#39;s hurting them go  <br/>\naway. It just drives it in deeper to fester.)<br/>\n<br/>\nI think somewhere on her site Sandra mentions that she would say  <br/>\nsomething like &quot;I need home to be a safe place for Marty,&quot; maybe even  <br/>\nfollowed by, &quot;I wouldn&#39;t let a stranger hit him.&quot; That wasn&#39;t a rule.  <br/>\nIt was more of a &quot;Whoa, wait, step back and look what&#39;s happening.&quot;<br/>\n<br/>\nIf a conventional parent said that, kids would hear &quot;I need to be a  <br/>\nroadblock because you&#39;re incapable of making good choices.&quot; The focus  <br/>\nwould be on the wrongness of the child. But because her kids know --  <br/>\nthrough years of actions --- that she&#39;s there to help them find a  <br/>\n*better* solution, not strand in their way, they were willing to stop.<br/>\n<br/>\nIt will help build a trusting relationship with them to be their  <br/>\npartner with ideas on how to accomplish what they&#39;re trying to do  <br/>\nthat are safe and respectful rather than be keeper of the rules, even  <br/>\nif there are only 2.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;I will not allow you...&quot;","postDate":"1268730499","msgId":43361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4MzY0Ny43NjM3MC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+","referencesHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+"},"prevInTopic":43357,"nextInTopic":43363,"prevInTime":43360,"nextInTime":43362,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"I will not allow you means that you are there all the time. My parents would not allow me to talk to strangers. When they weren t there I talked to","messageBody":"<div id=\"ygrps-yiv-258591889\">&quot;I will not allow you&quot; means that you are there all the time. My parents would not allow me to talk to strangers. When they weren&#39;t there I talked to strangers. Because they wouldn&#39;t allow me, I didn&#39;t tell them. &quot;I will not allow&quot; becomes a situation where if something happens there is a hurdle between you and your child, something to be overcome for communication to happen. I couldn&#39;t call my parents if I was too drunk or too stoned to drive. Because I wasn&#39;t allowed to drink or smoke pot. So, the discussion wasn&#39;t about safety, it was about drug use. It wasn&#39;t about how willing they were to support me if I was in a difficult situation, but how I needed to accomodate their need for me to not be doing the things they didn&#39;t want me to do. <br/>\n<br/>\n&quot;I will not allow you to hurt anyone&quot;, emotionally? physically? spiritually? My mom kicked me out of the house when I was 17 because she wouldn&#39;t allow me to hurt her anymore. That doesn&#39;t mean that it didn&#39;t hurt me, but that was allowed. With Simon and Linnaea it has worked much better to help them to be kind. To be there, to give them all the tools they need to feel good enough to be able to overflow with that good feeling. Good food, good and fun things to do, no real stumbling blocks to comfort to trip them up when they are with each other or with their friends. Hurting other people becomes less of a tool used in frustration when there are fewer things to frustate them. <br/>\n<br/>\n&quot;I will not allow you to destroy things&quot; sounds like a good limit. But it starts with the same point of power. It starts with the belief that you are in a position to allow or disallow something. What will you do if something is destroyed? Linnaea and a friend broke a window one day. And Linnaea came to me, against her friend&#39;s advice, and told me. I went and looked and asked them not to do their flint-knapping, their rock throwing, against the house, near windows. I was unhappy that the window was broken, but I was pleased that she was willing to face the unknown of my response to tell me. I didn&#39;t punish her, I didn&#39;t make her pay for it. The destroying the window was an accident and I treated it as such. <br/>\n<br/>\nWe have a puppy, he destroys things almost as if it were a hobby. So, there is an expectation that if you want something not to be destroyed it needs to not be in the puppy&#39;s reach. The puppy isn&#39;t punished for destroying things, he wouldn&#39;t get it, it wouldn&#39;t help. He&#39;s little and he&#39;s learning. If he&#39;s caught with something that isn&#39;t his to destroy it&#39;s swapped out for something he can destroy. And Simon and Linnaea and David and myself aren&#39;t punished if we leave something in his reach. Whomever notices, rescues it, moves it, makes it safe. The other night Linnaea was working on some drawings and when she came to bed I asked if she&#39;d put them up out of his reach. Not because of a rule, but because I wanted her stuff to be safe and I&#39;d have been happy to go and get it. She&#39;d put it up. <br/>\n<br/>\nI was looking for something that Rue and Jon Kream had said about not having control over another person, not real control. And I found this from Parenting a Free Child: An Unschooled Life: <br/>\n<br/>\n&quot;Rules can make a family look as if it operating very smoothly, but looks can be deceiving. In reality rules can make a child feel resentful and can cause him to find any possible opportunity to break the rules when out of his parents&#39; sight. Rules, like punishment, affect only outward behavior -- not the inner needs of a child. Demanding obedience from a child leaves little room for honesty in your relationship. Without that honesty the chances of having a connected relationship with your child are greatly diminished.&quot;<br/>\n<br/>\n<br/>\n&quot;I will not allow&quot; isn&#39;t nearly as good as helping someone to deal with the feelings that make them want to hurt someone and helping them to find things they can destroy, if that&#39;s what they are looking to do. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Tracy Austin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:webinfusion@...\">webinfusion@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, 16 March, 2010 1:26:51<br/>\nSubject: [unschoolingbasics] &quot;I will not allow you...&quot;<br/>\n<br/>\nOn this page I read this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nI ended up defining rules as &quot;I will not allow you...&quot; statements, and only came up with two: I will not allow you to hurt anyone and I will not allow you to destroy things (like walls, people&#39;s hard work, etc.). <br/>\n<br/>\nI would love to know how others handle this in an unschooling way, <br/>\nwhere hurting and damaging are happening?<br/>\n<br/>\nTracy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153200361,"authorName":"Tracy Austin","from":"&quot;Tracy Austin&quot; &lt;webinfusion@...&gt;","profile":"tracyaustin30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;I will not allow you...&quot;","postDate":"1268702811","msgId":43357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGQjQ0RDMwNkNFOTQ4NTg5OUE3NTc1MUMwOEVDNDIzQE93bmVyUEM+"},"prevInTopic":0,"nextInTopic":43361,"prevInTime":43356,"nextInTime":43358,"topicId":43357,"numMessagesInTopic":0,"msgSnippet":"On this page I read this: http://sandradodd.com/rules I ended up defining rules as I will not allow you... statements, and only came up with two: I will not","messageBody":"<div id=\"ygrps-yiv-828393749\">On this page I read this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nI ended up defining rules as &quot;I will not allow you...&quot; statements, and only came up with two: I will not allow you to hurt anyone and I will not allow you to destroy things (like walls, people&#39;s hard work, etc.). <br/>\n<br/>\nI would love to know how others handle this in an unschooling way, <br/>\nwhere hurting and damaging are happening?<br/>\n<br/>\nTracy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43329,"nextTopicId":43387}}