{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2nd time - thanks Ren! Fwd: ok, update on my teens (LONG!!!)","postDate":"1185889378","msgId":25338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4bmU5MitvbHJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4bW9lYis2Y2FiQGVHcm91cHMuY29tPg=="},"prevInTopic":25326,"nextInTopic":0,"prevInTime":25337,"nextInTime":25339,"topicId":25323,"numMessagesInTopic":0,"msgSnippet":"I only pop in here periodically, so didn t see the original post.  But one thought came to me -- could your oldest be using drugs?  Her behavior has some","messageBody":"<div id=\"ygrps-yiv-652579256\">I only pop in here periodically, so didn&#39;t see the original post.  But<br/>\none thought came to me -- could your oldest be using drugs?  Her<br/>\nbehavior has some definite hallmarks of drug users (I have a brother<br/>\nwho used, so they are familiar) or of mental illness.  (And the line<br/>\ncan be blurry sometimes, btw.)  <br/>\n<br/>\nI&#39;m still not sure what to advise you to do, though -- but perhaps<br/>\nidentifying the problem would be helpful.<br/>\n<br/>\nAnother thought is she might still be working through your divorce (or<br/>\nnot being together with their father -- I don&#39;t know the details, and<br/>\nit doesn&#39;t matter; what matters is what is going on in her mind.)  No<br/>\nfirst hand experience with that.<br/>\n<br/>\nYou are right not to continue enabling her -- she will definitely be<br/>\nresentful right now, and not see why you did what you did.  Hopefully,<br/>\ndown the road, she will look back at it differently.  The stealing,<br/>\nbtw, combined with being unable to hold a job (though that could have<br/>\nmultiple causes) is what made me think addiction.<br/>\n<br/>\nI wish I could be more helpful, but send all my best for you in<br/>\ndealing with this.<br/>\n<br/>\n(And for your other teens -- well, I have a very cool teen who is<br/>\npartially homeschooled, partially charter schooled.  He loves not<br/>\nbeing a traditional student!)<br/>\n<br/>\nLinda<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;mauratracy&quot; &lt;Maura@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Karen, your re-post didn&#39;t seem to work, so I found it and copied it<br/>\nbelow.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Laura. She graduated from high school, the old independent study program<br/>\n&gt; they had here that I did - she got a 4.0, did well, did it a<br/>\nsemester early<br/>\n&gt; after failing horribly (they failed HER *I* feel, but that&#39;s a<br/>\ndifferent post)<br/>\n&gt; in<br/>\n&gt; a private school with her Dad. She came home, we got her going with the<br/>\n&gt; alternative program, she did so well, and that seemed to be it. She<br/>\nbegan<br/>\n&gt; college, didn&#39;t take to it as she thought she would and flunked all<br/>\nof he <br/>\n&gt; classes.<br/>\n&gt; She then moved out and was living with friends, paying a nominal<br/>\nrent and<br/>\n&gt; working. She then moved home, after telling me that she and her best<br/>\nfriend, <br/>\n&gt; her<br/>\n&gt; roommate, were fighting al the time. I didn&#39;t want her to come back<br/>\n- I knew<br/>\n&gt; it was a bad idea, but I let her move back in. It was supposed to be<br/>\na hand<br/>\n&gt; up, to help her get ready to move, but then she got fired and the<br/>\nshort time<br/>\n&gt; here turned into 13 months, that increased in misery as the weeks<br/>\nticked by.<br/>\n&gt; She lost that job, after having had it for years, tried a few other<br/>\npositions,<br/>\n&gt; but either stopped showing up, or would quit. She went through jobs<br/>\nlike me<br/>\n&gt; and a good bake of chocolate chip cookies. She stopped helping<br/>\nfinancially<br/>\n&gt; here due to the job loss, and we supported her 100%. She wouldn&#39;t do<br/>\na bit of<br/>\n&gt; any family chore or anything like that w/o serious coercion or constant<br/>\n&gt; reminders. She was rude to Julian, the 4 year old and super sweet to<br/>\nJulia. She<br/>\n&gt; left<br/>\n&gt; a mess all over the place, including food to old in her room and in the<br/>\n&gt; bathroom (which she shared with others). She then was caught<br/>\nstealing from my<br/>\n&gt; mom<br/>\n&gt; - used her credit card to run up nearly $600 in gas to se her<br/>\nboyfriend, got<br/>\n&gt; caught at my mom&#39;s house 2 times for sure, possibly 3, stole the<br/>\nmoney out<br/>\n&gt; of Julian&#39;s piggy ban (nearly $80) in slow increments, lied to us<br/>\nabout so<br/>\n&gt; many things, all the time, no one knew what was the truth. I<br/>\nsupported her as<br/>\n&gt; best as I could, couldn&#39;t believe that she was doing all of this...I<br/>\nknow put<br/>\n&gt; on blinders and tried to forget about each thing as it happened,<br/>\nlike trying<br/>\n&gt; to give her a clean slate each time an event occurred, but the<br/>\ntension in the<br/>\n&gt; household was awful. Then Grace moved back, she stole money from<br/>\n&gt; Grace...there&#39;s more, but I&#39;m hoping I&#39;m painting a clear picture<br/>\nhere. anyway,<br/>\n&gt; after<br/>\n&gt; lots of discussions and warnings and what-not, she said she was<br/>\nmoving out by<br/>\n&gt; July 1. We stretched it to the 15th, since she still had no job,<br/>\nhadn&#39;t really<br/>\n&gt; done anything, and tensions were building. We love her, but e can&#39;t<br/>\ntrust<br/>\n&gt; her. Finally, after all this time, I...I kicked her out. She knew it was<br/>\n&gt; coming.<br/>\n&gt; It was out in the open that she was going to have to leave (my former dh<br/>\n&gt; never changed child support when Grace left, which was how I was able to<br/>\n&gt; continue to support her living here) and she did nothing. We tried.<br/>\nWe tried to<br/>\n&gt; find<br/>\n&gt; her jobs, we hid our money and credit cards, we talked about being<br/>\nrude to<br/>\n&gt; Julian and to all of us (&quot;When are you going shopping? There&#39;s no<br/>\nfood here,&quot;<br/>\n&gt; that kind of thing and more) and we gave notice upon notice....well,<br/>\n4 weeks<br/>\n&gt; ago today, I had it and that was it. She&#39;s now not speaking to me, her<br/>\n&gt; paternal grandmother is now taking care of her...and it&#39;s awful. I<br/>\nfeel like I<br/>\n&gt; went<br/>\n&gt; against my heart, but I know I can&#39;t see ANYTHNG clearly about this<br/>\n&gt; situation. I tried, I do try! I love this girl with all my<br/>\nheart...but I don&#39;t<br/>\n&gt; love<br/>\n&gt; her actions or what she has chosen. They have hurt others and that&#39;s<br/>\nthe issue<br/>\n&gt; I have. I don&#39;t know what to think, how to feel or what to do. So I am<br/>\n&gt; writing here because I have never heard such excellent advice and<br/>\ndiscussions<br/>\n&gt; in<br/>\n&gt; my life as the ones I&#39;ve gotten here.<br/>\n&gt; <br/>\n&gt; My flow has been interrupted and I need to go...so sorry for the<br/>\nnovel here,<br/>\n&gt; and thank you if you got through this. It&#39;s been excruciating for me<br/>\nand for<br/>\n&gt; her and for the rest of us living here. I admit, some tranquility<br/>\nhas indeed<br/>\n&gt; returned since she&#39;s been gone, but the pain of not seeing her and the s<br/>\n&gt; ituation surrounding it is still just as bad. But at least I&#39;m not<br/>\ncovered in<br/>\n&gt; eczema anymore and I can sleep again.<br/>\n&gt; <br/>\n&gt; I&#39;m almost in tears, so I&#39;m gonna go, take the little ones to my<br/>\ndad&#39;s to<br/>\n&gt; swim and have a nice dinner he made for us, have a bit of wine and<br/>\nbe done with<br/>\n&gt; the day.<br/>\n&gt; <br/>\n&gt; Thanks again....<br/>\n&gt; Karen<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":99672907,"authorName":"mauratracy","from":"&quot;mauratracy&quot; &lt;Maura@...&gt;","profile":"mauratracy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2nd time - thanks Ren! Fwd: ok, update on my teens (LONG!!!)","postDate":"1185867019","msgId":25326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4bW9lYis2Y2FiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGMzOS4xYTM4ODVmNi4zM2RmZGZjY0Bhb2wuY29tPg=="},"prevInTopic":25323,"nextInTopic":25338,"prevInTime":25325,"nextInTime":25327,"topicId":25323,"numMessagesInTopic":0,"msgSnippet":"Karen, your re-post didn t seem to work, so I found it and copied it below. ... I ve been wanting to discuss this...Quickly: We are unschooling my 2 little ","messageBody":"<div id=\"ygrps-yiv-1399820443\">Karen, your re-post didn&#39;t seem to work, so I found it and copied it below.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kidgie@... wrote:<br/>\n<br/>\nI&#39;ve been wanting to discuss this...Quickly: We are unschooling my 2 little<br/>\nones, Julian age 4, almost 5 and Julia, freshly 2. My first 3 were from a<br/>\ndifferent relationship and a different era in my life and were, for the most<br/>\npart, conventionally schooled. Laura is 19, James is 17 and Grace is 15.<br/>\n<br/>\nOK. I have wanted to unschool James and Grace. James has been doing<br/>\nalternative high school, from a STUPID program at the local continuation high, <br/>\nto a<br/>\nGREAT program online at Global Village High School for Peace and Freedom. LOVE<br/>\nit there, but it was too funky for James, who feels safer within convention,<br/>\nbut is not conventional. Grace will be a sophomore and is not doing well in<br/>\nschool, falling behind in credits and what-not. I have offered her<br/>\nalternatives, but she too is uninterested. I have tried to sort of deschool with<br/>\nthem,<br/>\nand to some extent, I see them beginning to understand the process of what<br/>\nlearning is in actuality, not in a school-like-way, but they don&#39;t trust<br/>\nthemselves or me or that idea...not really. James is coming along, lol...I see <br/>\nhim<br/>\nnow looking things up online that interest him, he has returned to self<br/>\nteaching guitar and is going to an off-shoot of the burning man festival this<br/>\nweekend :) I am attempting comfort with that, lol and he and I have had some <br/>\nnice<br/>\ntalks about trust and using the end of the teen years to experiment in many<br/>\nparts of life and all that good stuff. He has decided that if he did not pass<br/>\nthe Ca High School Proficiency Exam, that he wants to go to the local Adult<br/>\nSchool and get his GED because he isn&#39;t interested in college and doesn&#39;t know<br/>\nwhat he wants to do. He feels this will help him get a job..I am not so<br/>\nsure, myself, and have told him I&#39;ll back him as best I can on anything he<br/>\nwants<br/>\nor needs. Our issues are complicated by financial issues, because if he is<br/>\nnot in high school at 18, no more child support. If we weren&#39;t pay-check to<br/>\npaycheck, there would be less of a rush, but sadly, we are. We are really very<br/>\nfinancially strapped, and once child support stops, we can&#39;t afford him<br/>\nanymore :( He knows this, understands it and we all hate it. I&#39;m hoping he<br/>\nstays<br/>\n&quot;in school&quot; (my CA &quot;private school&quot; I&#39;ve got set up is my ideal, so he can<br/>\nunschool his last year for this kind of thing, in the safety net of being<br/>\nfinancially cared for for the most part, you know?) He recently called me &quot;punk<br/>\nrock&quot; which is a high compliment indeed (in regard to my alternative medicine<br/>\nchoices, homebirth, vax stuff, all that - because I take the time to educate<br/>\nmyself and he calls that punk rock - I loved it!) and has made other mention to<br/>\nme that he really sees me as self educating and never really recognized that<br/>\nbefore. That feels so good, you know?<br/>\n<br/>\nGrace is attempting conventional education again this fall - she was living<br/>\nwith her father last year, and is no back and enjoying the trust we are<br/>\nacquiring between us and is thinking...she was willing to go to the convention<br/>\nwith me that is in Sacramento in August, but we didn&#39;t have the funds, but at<br/>\nleast she was willing! And she said she&#39;d go to the beach meet up this week<br/>\nwhich is with teens that are at least homeschooled (both she and James have that<br/>\nhorrid idea that homeschoolers are losers...they&#39;ll learn, in time, I know)<br/>\nif not unschooled, so that&#39;s something too. I wrote up a list of basic options<br/>\nfor the teens years and told her she can change from one to the next as she<br/>\nsees necessary and we&#39;d reevaluate as time passes.<br/>\n<br/>\nSo there&#39;s that. Sigh. Here&#39;s the hard one.<br/>\n<br/>\nLaura. She graduated from high school, the old independent study program<br/>\nthey had here that I did - she got a 4.0, did well, did it a semester early<br/>\nafter failing horribly (they failed HER *I* feel, but that&#39;s a different post)<br/>\nin<br/>\na private school with her Dad. She came home, we got her going with the<br/>\nalternative program, she did so well, and that seemed to be it. She began<br/>\ncollege, didn&#39;t take to it as she thought she would and flunked all of he <br/>\nclasses.<br/>\nShe then moved out and was living with friends, paying a nominal rent and<br/>\nworking. She then moved home, after telling me that she and her best friend, <br/>\nher<br/>\nroommate, were fighting al the time. I didn&#39;t want her to come back - I knew<br/>\nit was a bad idea, but I let her move back in. It was supposed to be a hand<br/>\nup, to help her get ready to move, but then she got fired and the short time<br/>\nhere turned into 13 months, that increased in misery as the weeks ticked by.<br/>\nShe lost that job, after having had it for years, tried a few other positions,<br/>\nbut either stopped showing up, or would quit. She went through jobs like me<br/>\nand a good bake of chocolate chip cookies. She stopped helping financially<br/>\nhere due to the job loss, and we supported her 100%. She wouldn&#39;t do a bit of<br/>\nany family chore or anything like that w/o serious coercion or constant<br/>\nreminders. She was rude to Julian, the 4 year old and super sweet to Julia. She<br/>\nleft<br/>\na mess all over the place, including food to old in her room and in the<br/>\nbathroom (which she shared with others). She then was caught stealing from my<br/>\nmom<br/>\n- used her credit card to run up nearly $600 in gas to se her boyfriend, got<br/>\ncaught at my mom&#39;s house 2 times for sure, possibly 3, stole the money out<br/>\nof Julian&#39;s piggy ban (nearly $80) in slow increments, lied to us about so<br/>\nmany things, all the time, no one knew what was the truth. I supported her as<br/>\nbest as I could, couldn&#39;t believe that she was doing all of this...I know put<br/>\non blinders and tried to forget about each thing as it happened, like trying<br/>\nto give her a clean slate each time an event occurred, but the tension in the<br/>\nhousehold was awful. Then Grace moved back, she stole money from<br/>\nGrace...there&#39;s more, but I&#39;m hoping I&#39;m painting a clear picture here. anyway,<br/>\nafter<br/>\nlots of discussions and warnings and what-not, she said she was moving out by<br/>\nJuly 1. We stretched it to the 15th, since she still had no job, hadn&#39;t really<br/>\ndone anything, and tensions were building. We love her, but e can&#39;t trust<br/>\nher. Finally, after all this time, I...I kicked her out. She knew it was<br/>\ncoming.<br/>\nIt was out in the open that she was going to have to leave (my former dh<br/>\nnever changed child support when Grace left, which was how I was able to<br/>\ncontinue to support her living here) and she did nothing. We tried. We tried to<br/>\nfind<br/>\nher jobs, we hid our money and credit cards, we talked about being rude to<br/>\nJulian and to all of us (&quot;When are you going shopping? There&#39;s no food here,&quot;<br/>\nthat kind of thing and more) and we gave notice upon notice....well, 4 weeks<br/>\nago today, I had it and that was it. She&#39;s now not speaking to me, her<br/>\npaternal grandmother is now taking care of her...and it&#39;s awful. I feel like I<br/>\nwent<br/>\nagainst my heart, but I know I can&#39;t see ANYTHNG clearly about this<br/>\nsituation. I tried, I do try! I love this girl with all my heart...but I don&#39;t<br/>\nlove<br/>\nher actions or what she has chosen. They have hurt others and that&#39;s the issue<br/>\nI have. I don&#39;t know what to think, how to feel or what to do. So I am<br/>\nwriting here because I have never heard such excellent advice and discussions<br/>\nin<br/>\nmy life as the ones I&#39;ve gotten here.<br/>\n<br/>\nMy flow has been interrupted and I need to go...so sorry for the novel here,<br/>\nand thank you if you got through this. It&#39;s been excruciating for me and for<br/>\nher and for the rest of us living here. I admit, some tranquility has indeed<br/>\nreturned since she&#39;s been gone, but the pain of not seeing her and the s<br/>\nituation surrounding it is still just as bad. But at least I&#39;m not covered in<br/>\neczema anymore and I can sleep again.<br/>\n<br/>\nI&#39;m almost in tears, so I&#39;m gonna go, take the little ones to my dad&#39;s to<br/>\nswim and have a nice dinner he made for us, have a bit of wine and be done with<br/>\nthe day.<br/>\n<br/>\nThanks again....<br/>\nKaren </span></blockquote></div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"2nd time - thanks Ren! Fwd: ok, update on my teens (LONG!!!)","postDate":"1185842636","msgId":25323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzOS4xYTM4ODVmNi4zM2RmZGZjY0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":25326,"prevInTime":25322,"nextInTime":25324,"topicId":25323,"numMessagesInTopic":0,"msgSnippet":"************************************** Get a sneak peek of the all-new AOL at http://discover.aol.com/memed/aolcom30tour [Non-text portions of this message","messageBody":"<div id=\"ygrps-yiv-1681641798\">************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25251,"nextTopicId":25259}}