{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to deal with violence","postDate":"1273728137","msgId":44021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1OEFCOUJCNTZGMTQ1MDg4RUY0NTVFMTc0NkFFNEQxQExZTEFMQVAyPg==","inReplyToHeader":"PGhzZnI4OSsxMDZqakBlR3JvdXBzLmNvbT4=","referencesHeader":"PGhzZnI4OSsxMDZqakBlR3JvdXBzLmNvbT4="},"prevInTopic":44020,"nextInTopic":0,"prevInTime":44020,"nextInTime":44022,"topicId":44020,"numMessagesInTopic":0,"msgSnippet":"i didn t write that post, but i do have a lot of empathy and some personal experience with a child who sounds a lot like the OPs - i am happy to share","messageBody":"<div id=\"ygrps-yiv-859813950\">i didn&#39;t write that post, but i do have a lot of empathy and some personal experience with a child who sounds a lot like the OPs - i am happy to share info/resources off list if the OP is interested.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Lylaw@...\">Lylaw@...</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: gruvystarchild <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, May 12, 2010 8:21 PM<br/>\n  Subject: [unschoolingbasics] How to deal with violence<br/>\n<br/>\n<br/>\n    <br/>\n  I am posting this anonymously for someone who had requested I do so. Again, this is NOT from Ren, this is being passed forward by request.<br/>\n<br/>\n  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\n  I sympathize with your situation and I am sure there are a lot of options for handling your sons outbursts. Some of those solution will fall in with the unschooling style of parenting some wont. <br/>\n  The only wrong solutions are those that truely violate your child s rights. Sometimes we can find solutions in our own style of parenting and some needs require us to look to outside methods for<br/>\n  the solution. What you do is totally up to you but I would like to tell youwhat I hear from your email and then share a story with you.<br/>\n<br/>\n  From your email I hear that you have a son that has always been sensitive and prone to meltdowns. <br/>\n  You love him and do your best to give him choices in his part of the world. You try to limit your no answers but he cannot handle even one no answer after a day of yeses. Your sons meltdowns have now become rages that are endangering you and your daughter. Your daughter is afraid of her brother and has taken to<br/>\n  cowering in fear.<br/>\n<br/>\n  She is now showing behaviors and coping strategies similar to battered children or children in homes where the parent is battered. Your son is no longer confining his rage to home and you are now answerable to your ex because your son went into a rage when denied a treat d due to bad behavior. (Sometimes it<br/>\n  helps to see your problem more clearly when heard from an outsiders<br/>\n  perspective).<br/>\n<br/>\n  I knew a family several years ago that had three children. Mom did her best to see to it that the children were raised in a mannor that they felt secure and loved. Dad agreed with her beliefs to a point. Their middle son was different and sometimes difficult from toddlerhood. They read books and listened to friends advice but would not consider that anything was wrong<br/>\n  with heir little boy. Fast forward several years and colton was eight. Mom and dad were divorced and sharing custody. Colton didn t handle the divorce well and his fits escalated. He knocked a TV<br/>\n  off on his 6 year old brother because he became enraged when his game system wouldn t work. Trevor required 13 stitches to fix the gash his brother caused. Their oldest daughter was 11 she was afraid of her brother and had little respect for her parets because they wouldn t/couldn t protect her from her brothers anger. Mom felt he had the right to express his feelings. Dad decided enough was enough and started using a belt to teach him better. His behavior<br/>\n  with dad improved but not with mom. When colton was 10 dad sued for custody of the other 2 children after another episode where younger brother once again required medical care. This time 2 days in the hospital. Dad won full custody of both the oldest and youngest children because mom failed to set reasonable<br/>\n  boundaries for colton and thereby endangered her other children. Mom was court ordered to have colton psyciatrically evaluated and was put under the supervision of a social worker.<br/>\n<br/>\n  Colton was diagnosed with several disorders and required to go to therapy one of which was anger management another was behavior modification. Colton will be 14 in a few months. We dont see them much anymore but last I heard his behavior has improved although he still has outbursts sometimes. Dad moved the other two<br/>\n  children out of state and mom and colton see them once a year at most. The other two slowly stopped being so fearful but the older sister who is now dating age has a strong fear and distrust of males. For your sons sake and your daughters I urge you to try teaching your son how to hear no and to explore<br/>\n  whtether or not their could be any underlying problems.<br/>\n<br/>\n  On Tue May 11th, 2010 11:12 PM CDT Stephanie Kimball wrote:<br/>\n<br/>\n  &gt;Hello wonderful Unschoolers,<br/>\n  &gt;<br/>\n  &gt;I have been lurking on this list for a while now, and have benefitted<br/>\n  &gt;tremendously from other people&#39;s questions and answers. A hearty<br/>\n  &gt;thank you to all for the very thoughtful responses you write -- I<br/>\n  &gt;don&#39;t know how you find the time, let alone the clarity, but I&#39;m<br/>\n  &gt;extremely grateful that you do. :)<br/>\n  &gt;<br/>\n  &gt;The problem I need help with right now is my 10 year old son&#39;s violent<br/>\n  &gt;behavior. He has always been a sensitive kid -- as in, if he spilled<br/>\n  &gt;his milk he&#39;d go ballistic, screaming at everyone over the &quot;waste,&quot;<br/>\n  &gt;threatening to lick it up off the floor, completely unable to let it<br/>\n  &gt;go. (He was NEVER yelled at or punished in any way for spilling milk<br/>\n  &gt;or other accidents; even if the glass broke I would just calmly clean<br/>\n  &gt;it up -- sometimes I&#39;d even humor him by saving the shards of glass in<br/>\n  &gt;a paper bag since he&#39;d be insistent that we could glue it back<br/>\n  &gt;together again.....) He seems to explode almost any time things do<br/>\n  &gt;not go his way, though the rest of the time he is a sweet,<br/>\n  &gt;affectionate, incredibly smart kid. Over the years, as he&#39;s gotten<br/>\n  &gt;bigger, his outbursts have become more physical -- hitting, kicking,<br/>\n  &gt;even biting, and often throwing large/dangerous objects (i.e.<br/>\n  &gt;chairs). It&#39;s to the point now where his 7yo sister is developing<br/>\n  &gt;coping strategies for dealing with her brother&#39;s tantrums, and is<br/>\n  &gt;careful to avoid situations that might set him off. Sometimes she is<br/>\n  &gt;very frustrated by having to compromise so much, and I worry about her<br/>\n  &gt;not feeling safe in her own home.<br/>\n  &gt;<br/>\n  &gt;A couple years ago I read the book Explosive Child, and from that<br/>\n  &gt;started to look for ways to decrease the frustration level for my<br/>\n  &gt;son. However, he often explodes over things I cannot control (like<br/>\n  &gt;the weather), making that strategy seem rather limited. Since joining<br/>\n  &gt;this List I have been more conscious of trying to say &quot;yes,&quot; and<br/>\n  &gt;letting it sound like &quot;yes&quot; (I&#39;d gotten in the habit of saying<br/>\n  &gt;&quot;maybe,&quot; for fear of setting him up for disappointment and tantrums<br/>\n  &gt;if I said yes and then couldn&#39;t make it so -- but he hears &quot;maybe&quot;<br/>\n  &gt;as &quot;no,&quot; or at least as &quot;only if more important things get done<br/>\n  &gt;first&quot;, that sort of thing.) I&#39;ve also been trying to recognize his<br/>\n  &gt;needs better and respect his desires more. I&#39;ve given up the power<br/>\n  &gt;struggles over candy and bedtime, I make efforts to be physical with<br/>\n  &gt;him in positive ways (hugs, playful wrestling, etc.) and so on. I try<br/>\n  &gt;to think of special projects we can work on together. I try to find<br/>\n  &gt;ways to support his desires and dreams. I try to be more gentle,<br/>\n  &gt;over all.<br/>\n  &gt;<br/>\n  &gt;But it seems it&#39;s never enough. On a given day he might make 5<br/>\n  &gt;requests that I say yes to, but the 6th one is something I can&#39;t do<br/>\n  &gt;and he goes nuts -- sometimes even screaming things like, &quot;you don&#39;t<br/>\n  &gt;even care about me, you don&#39;t even WANT me to be able to do _______.&quot;<br/>\n  &gt;Sometimes I gently point out the 5 things I said yes to, but that<br/>\n  &gt;feels icky and doesn&#39;t seem to do much good.<br/>\n  &gt;<br/>\n  &gt;My kids spent last weekend at their dad&#39;s house. I got a call from my<br/>\n  &gt;ex around 8pm on Friday, desperate to know what to do as DS was<br/>\n  &gt;screaming and throwing things. Apparently he&#39;d promised them ice<br/>\n  &gt;cream, but they were obnoxious in the store, and didn&#39;t quit when he<br/>\n  &gt;said they&#39;d better or no ice cream...... so, no ice cream. In the car<br/>\n  &gt;on the way home DS kicked and screamed, and once home he punched and<br/>\n  &gt;threw things....... Their dad threatened to cancel the next day&#39;s<br/>\n  &gt;activities if DS didn&#39;t stop, which he didn&#39;t. The first thing I<br/>\n  &gt;suggested was to quit making ultimatums, as DS is not capable of<br/>\n  &gt;responding to them in that state. While we were talking DS slipped a<br/>\n  &gt;note under his door apologizing -- and I said, get off the phone now,<br/>\n  &gt;there&#39;s your opening. I then got a call from DD, who was clearly<br/>\n  &gt;cowering in her room, calling me and talking a mile a minute to shut<br/>\n  &gt;out the conflict around her. Eventually they went back for ice cream.<br/>\n  &gt;<br/>\n  &gt;I expect my kids&#39; dad will be confronting me soon on how to deal with<br/>\n  &gt;DS. He (their dad) has never been a hands-on parent, aside from<br/>\n  &gt;taking them on occasional fun outings on weekends. He has always<br/>\n  &gt;looked to me to figure things out and deal with them, and advise him<br/>\n  &gt;how to proceed -- except he doesn&#39;t catch on well to the gist of<br/>\n  &gt;things, instead taking whatever I might say as a script. It&#39;s<br/>\n  &gt;annoying (and lonely) for me, but that&#39;s not the issue right now. I<br/>\n  &gt;worry that he&#39;s going to suggest or even insist upon counseling and/or<br/>\n  &gt;drugs, and even though I sometimes wonder if that&#39;s where we&#39;re<br/>\n  &gt;headed, I really think there&#39;s some other unmet need here, and would<br/>\n  &gt;strongly prefer to figure that out and deal with it directly.<br/>\n  &gt;However, I have no idea what that &quot;unmet need&quot; could be, even though<br/>\n  &gt;I&#39;ve been dealing with this for 7-8 years now, so I&#39;m not sure I could<br/>\n  &gt;make much of a case for avoiding the drugs/therapy approach.<br/>\n  &gt;<br/>\n  &gt;So I guess I have 3 questions. 1) Can you shed any light on DS&#39;s<br/>\n  &gt;tantrums and violence (in the process of writing this, I have resolved<br/>\n  &gt;to keep finding more ways to shower him with YES and love and<br/>\n  &gt;kindness, to be a &quot;bottomless well&quot; to his seemingly &quot;bottomless<br/>\n  &gt;pit&quot; of need); 2) How would you suggest I handle the violent<br/>\n  &gt;outbursts when they do occur? (I&#39;ve tried and quit the &quot;loss of<br/>\n  &gt;privileges&quot; strategy, and &quot;time out&quot; never worked, but it&#39;s not<br/>\n  &gt;acceptable for my daughter to get hurt or for things to get<br/>\n  &gt;broken....... and honestly, being hit and kicked myself doesn&#39;t do<br/>\n  &gt;much for my relationship with my son either!); and 3) any<br/>\n  &gt;suggestions for what I might say to his dad when he turns to me for<br/>\n  &gt;answers on how to deal with all this? That&#39;s a lot to ask. #2 is<br/>\n  &gt;my biggest priority.<br/>\n  &gt;<br/>\n  &gt;Thanks in advance for your thoughts!<br/>\n  &gt;<br/>\n  &gt;stephanie<br/>\n  &gt;<br/>\n  &gt;<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How to deal with violence","postDate":"1273720905","msgId":44020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhzZnI4OSsxMDZqakBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":44021,"prevInTime":44019,"nextInTime":44021,"topicId":44020,"numMessagesInTopic":0,"msgSnippet":"I am posting this anonymously for someone who had requested I do so. Again, this is NOT from Ren, this is being passed forward by request. ","messageBody":"<div id=\"ygrps-yiv-849600620\">I am posting this anonymously for someone who had requested I do so. Again, this is NOT from Ren, this is being passed forward by request.<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\n<br/>\nI sympathize with your situation and I am sure there are a lot of options for handling your sons outbursts.  Some of those solution will fall in with the unschooling style of parenting some wont. <br/>\nThe only wrong solutions are those that truely violate your child s rights.  Sometimes we can find solutions in our own style of parenting and some needs require us to look to outside methods for<br/>\nthe solution.  What you do is totally up to you but I would like to tell youwhat I hear from your email and then share a story with you.<br/>\n<br/>\nFrom your email I hear that you have a son that has always been sensitive and prone to meltdowns. <br/>\nYou love him and do your best to give him choices in his part of the world.  You try to limit your no answers but he cannot handle even one no answer after a day of yeses.  Your sons meltdowns have now become rages that are endangering you and your daughter.  Your daughter is afraid of her brother and has taken to<br/>\ncowering in fear.<br/>\n<br/>\nShe is now showing behaviors and coping strategies similar to battered children or children in homes where the parent is battered. Your son is no longer confining his rage to home and you are now answerable to your ex because your son went into a rage when denied a treat d due to bad behavior.  (Sometimes it<br/>\nhelps to see your problem more clearly when heard from an outsiders<br/>\nperspective).<br/>\n<br/>\n I knew a family several years ago that had three children.  Mom did her best to see to it that the children were raised in a mannor that they felt secure and loved.  Dad agreed with her beliefs to a point.  Their middle son was different and sometimes difficult from toddlerhood.   They read books and listened to friends advice but would not consider that anything was wrong<br/>\nwith heir little boy.  Fast forward several years and colton was eight.  Mom and dad were divorced and sharing custody.  Colton didn t handle the divorce well and his fits escalated.  He knocked a TV<br/>\noff on his 6 year old brother because he became enraged when his game system wouldn t work.  Trevor required 13 stitches to fix the gash his brother caused. Their oldest daughter was 11 she was afraid of her brother and had little respect for her parets because they wouldn t/couldn t protect her from her brothers anger.  Mom felt he had the right to express his feelings.  Dad decided enough was enough and started using a belt to teach him better.  His behavior<br/>\nwith dad improved but not with mom.  When colton was 10 dad sued for custody of the other 2 children after another episode where younger brother once again required medical care.  This time 2 days in the hospital.   Dad won full custody of both the oldest and youngest children because mom failed to set reasonable<br/>\nboundaries for colton and thereby endangered her other children.  Mom was court ordered to have colton psyciatrically evaluated and was put under the supervision of a social worker.<br/>\n<br/>\nColton was diagnosed with several disorders and required to go to therapy one of which was anger management another was behavior modification.  Colton will be 14 in a few months.  We dont see them much anymore but last I heard his behavior has improved although he still has outbursts sometimes.  Dad moved the other two<br/>\nchildren out of state and mom and colton see them once a year at most.  The other two slowly stopped being so fearful but the older sister who is now dating age has a strong fear and distrust of males.  For your sons sake and your daughters I urge you to try teaching your son how to hear no and to explore<br/>\nwhtether or not their could be any underlying problems.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue May 11th, 2010 11:12 PM CDT Stephanie Kimball wrote:<br/>\n<br/>\n&gt;Hello wonderful Unschoolers,<br/>\n&gt;<br/>\n&gt;I have been lurking on this list for a while now, and have benefitted<br/>\n&gt;tremendously from other people&#39;s questions and answers.  A hearty<br/>\n&gt;thank you to all for the very thoughtful responses you write -- I<br/>\n&gt;don&#39;t know how you find the time, let alone the clarity, but I&#39;m<br/>\n&gt;extremely grateful that you do.  :)<br/>\n&gt;<br/>\n&gt;The problem I need help with right now is my 10 year old son&#39;s violent<br/>\n&gt;behavior.   He has always been a sensitive kid -- as in, if he spilled<br/>\n&gt;his milk he&#39;d go ballistic, screaming at everyone over the  &quot;waste,&quot;<br/>\n&gt;threatening to lick it up off the floor, completely unable to let it<br/>\n&gt;go.  (He was NEVER yelled at or punished in any way for spilling milk<br/>\n&gt;or other accidents; even if the glass broke I would just calmly clean<br/>\n&gt;it up -- sometimes I&#39;d even humor him by saving the shards of glass in<br/>\n&gt;a paper bag since he&#39;d be insistent that we could glue it back<br/>\n&gt;together again.....)  He seems to explode almost any time things do<br/>\n&gt;not go his way, though the rest of the time he is a sweet,<br/>\n&gt;affectionate, incredibly smart kid.  Over the years, as he&#39;s gotten<br/>\n&gt;bigger, his outbursts have become more physical -- hitting, kicking,<br/>\n&gt;even biting, and often throwing large/dangerous objects (i.e.<br/>\n&gt;chairs).  It&#39;s to the point now where his 7yo sister is developing<br/>\n&gt;coping strategies for dealing with her brother&#39;s tantrums, and is<br/>\n&gt;careful to avoid situations that might set him off.  Sometimes she is<br/>\n&gt;very frustrated by having to compromise so much, and I worry about her<br/>\n&gt;not feeling safe in her own home.<br/>\n&gt;<br/>\n&gt;A couple years ago I read the book Explosive Child, and from that<br/>\n&gt;started to look for ways to decrease the frustration level for my<br/>\n&gt;son.  However, he often explodes over things I cannot control (like<br/>\n&gt;the weather), making that strategy seem rather limited.  Since joining<br/>\n&gt;this List I have been more conscious of trying to say  &quot;yes,&quot;  and<br/>\n&gt;letting it sound like  &quot;yes&quot;  (I&#39;d gotten in the habit of saying<br/>\n&gt;&quot;maybe,&quot;  for fear of setting him up for disappointment and tantrums<br/>\n&gt;if I said yes and then couldn&#39;t make it so -- but he hears  &quot;maybe&quot;<br/>\n&gt;as  &quot;no,&quot;  or at least as  &quot;only if more important things get done<br/>\n&gt;first&quot;, that sort of thing.)  I&#39;ve also been trying to recognize his<br/>\n&gt;needs better and respect his desires more.  I&#39;ve given up the power<br/>\n&gt;struggles over candy and bedtime, I make efforts to be physical with<br/>\n&gt;him in positive ways (hugs, playful wrestling, etc.) and so on.  I try<br/>\n&gt;to think of special projects we can work on together.  I try to find<br/>\n&gt;ways to support his desires and dreams.   I try to be more gentle,<br/>\n&gt;over all.<br/>\n&gt;<br/>\n&gt;But it seems it&#39;s never enough.  On a given day he might make 5<br/>\n&gt;requests that I say yes to, but the 6th one is something I can&#39;t do<br/>\n&gt;and he goes nuts -- sometimes even screaming things like,  &quot;you don&#39;t<br/>\n&gt;even care about me, you don&#39;t even WANT me to be able to do _______.&quot;<br/>\n&gt;Sometimes I gently point out the 5 things I said yes to, but that<br/>\n&gt;feels icky and doesn&#39;t seem to do much good.<br/>\n&gt;<br/>\n&gt;My kids spent last weekend at their dad&#39;s house.  I got a call from my<br/>\n&gt;ex around 8pm on Friday, desperate to know what to do as DS was<br/>\n&gt;screaming and throwing things.  Apparently he&#39;d promised them ice<br/>\n&gt;cream, but they were obnoxious in the store, and didn&#39;t quit when he<br/>\n&gt;said they&#39;d better or no ice cream...... so, no ice cream.  In the car<br/>\n&gt;on the way home DS kicked and screamed, and once home he punched and<br/>\n&gt;threw things.......   Their dad threatened to cancel the next day&#39;s<br/>\n&gt;activities if DS didn&#39;t stop, which he didn&#39;t.  The first thing I<br/>\n&gt;suggested was to quit making ultimatums, as DS is not capable of<br/>\n&gt;responding to them in that state.  While we were talking DS slipped a<br/>\n&gt;note under his door apologizing  -- and I said, get off the phone now,<br/>\n&gt;there&#39;s your opening.   I then got a call from DD, who was clearly<br/>\n&gt;cowering in her room, calling me and talking a mile a minute to shut<br/>\n&gt;out the conflict around her.  Eventually they went back for ice cream.<br/>\n&gt;<br/>\n&gt;I expect my kids&#39; dad will be confronting me soon on how to deal with<br/>\n&gt;DS.  He (their dad) has never been a hands-on parent, aside from<br/>\n&gt;taking them on occasional fun outings on weekends.  He has always<br/>\n&gt;looked to me to figure things out and deal with them, and advise him<br/>\n&gt;how to proceed -- except he doesn&#39;t catch on well to the gist of<br/>\n&gt;things, instead taking whatever I might say as a script.   It&#39;s<br/>\n&gt;annoying (and lonely) for me, but that&#39;s not the issue right now.  I<br/>\n&gt;worry that he&#39;s going to suggest or even insist upon counseling and/or<br/>\n&gt;drugs, and even though I sometimes wonder if that&#39;s where we&#39;re<br/>\n&gt;headed, I really think there&#39;s some other unmet need here, and would<br/>\n&gt;strongly prefer to figure that out and deal with it directly.<br/>\n&gt;However, I have no idea what that  &quot;unmet need&quot;  could be, even though<br/>\n&gt;I&#39;ve been dealing with this for 7-8 years now, so I&#39;m not sure I could<br/>\n&gt;make much of a case for avoiding the drugs/therapy approach.<br/>\n&gt;<br/>\n&gt;So I guess I have 3 questions.    1) Can you shed any light on DS&#39;s<br/>\n&gt;tantrums and violence (in the process of writing this, I have resolved<br/>\n&gt;to keep finding more ways to shower him with YES and love and<br/>\n&gt;kindness,  to be a   &quot;bottomless well&quot;   to his seemingly  &quot;bottomless<br/>\n&gt;pit&quot; of need);   2) How would you suggest I handle the violent<br/>\n&gt;outbursts when they do occur?  (I&#39;ve tried and quit the   &quot;loss of<br/>\n&gt;privileges&quot;  strategy, and  &quot;time out&quot;  never worked, but it&#39;s not<br/>\n&gt;acceptable for my daughter to get hurt or for things to get<br/>\n&gt;broken....... and honestly, being hit and kicked myself doesn&#39;t do<br/>\n&gt;much for my relationship with my son either!);    and 3) any<br/>\n&gt;suggestions for what I might say to his dad when he turns to me for<br/>\n&gt;answers on how to deal with all this?    That&#39;s a lot to ask.  #2 is<br/>\n&gt;my biggest priority.<br/>\n&gt;<br/>\n&gt;Thanks in advance for your thoughts!<br/>\n&gt;<br/>\n&gt;stephanie<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":43893,"nextTopicId":43992}}