{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Inflicting opinions was: tv, video games, etc.","postDate":"1222028186","msgId":36117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4OUVCQjA1LTgxQzItNDc5RS1CMEJBLTBFNjVFMUYyQTBCOUBjb21jYXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":36116,"nextInTime":36118,"topicId":36117,"numMessagesInTopic":0,"msgSnippet":"... So, you would have preferred advice, warnings and opinions? Do you think you would have done things differently if she d only inflicted an opinion on","messageBody":"<div id=\"ygrps-yiv-1530982212\"><blockquote><span title=\"ireply\">&gt; The idea of &quot;inflicting an opinion&quot; is pretty deep.  Forcing someone  <br/>\n&gt; to (live by?  think?) your thoughts- would that be an accurate  <br/>\n&gt; representation of your intended meaning?<br/>\n&gt;<br/>\n&gt; It&#39;s a concept I hadn&#39;t thought of before.  My mom let us make a lot  <br/>\n&gt; of stupid mistakes as we were growing up. I always resented that she  <br/>\n&gt; never gave us advice or her opinions on any matter.<br/>\n<br/>\n </span></blockquote>So, you would have preferred advice, warnings and opinions? Do you  <br/>\nthink you would have done things differently if she&#39;d only &quot;inflicted  <br/>\nan opinion&quot; on you?<br/>\n<br/>\nI don&#39;t think anyone here would say not to give your kids the benefit  <br/>\nof your opinion or even advice. But, your kids will make their own  <br/>\ndecisions. And they might be different choices than the ones you&#39;ve  <br/>\nmade or would hope they&#39;d make. But, if they feel respected and  <br/>\ntrusted by you, they will take your opinions/advice into consideration.<br/>\n<br/>\nSpouses do, too :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s been a challenge in my parenting, because I think it&#39;s good to  <br/>\n&gt; share our opinions, I would have loved to have known that my mother  <br/>\n&gt; even cared.  The way she said &quot;do what you want&quot; always made me feel  <br/>\n&gt; abandoned, as if she didn&#39;t care.  With my girls, I try to engage in  <br/>\n&gt; a conversation when they want advice.  I ask several questions until  <br/>\n&gt; it looks like they&#39;ve expressed all their thoughts and feelings,  <br/>\n&gt; then I ask more questions, to make sure I am undersanding their  <br/>\n&gt; perspectives.  I ask them how THEY would like to handle it, and  <br/>\n&gt; Instead of giving advice, I hope to be teaching them that I do care,  <br/>\n&gt; and helping them make decisions based upon their own thoughts and  <br/>\n&gt; opinions.  I wonder, how do other people handle such a thing.<br/>\n<br/>\n </span></blockquote>I think that&#39;s not so different from what many parents would do here.  <br/>\nIt varies, though, because some kids don&#39;t want a lot of questions and  <br/>\ndiscussion. My daughter, for instance, hates to talk for long about  <br/>\nanything she&#39;s thinking about. She needs plenty of time on her own to  <br/>\nmull things over. She will ask my opinion, though often she&#39;s already  <br/>\ncome to her own conclusion. When there are &quot;issues&quot; I might consider  <br/>\nworthy of discussion, I don&#39;t approach her head-on. I come at things  <br/>\nsideways. We&#39;ll sometimes discuss things in the car - she in the back  <br/>\nwhile I&#39;m driving. But she&#39;ll tell me when she doesn&#39;t want to talk or  <br/>\nwhen she&#39;s done.<br/>\n<br/>\nWhat has worked best for us lately is for me to write my thoughts down  <br/>\nin a letter to her. She can read it at her leisure, think about it,  <br/>\nthen make her own decisions. Based on the relationship we have, the  <br/>\nfact that she feels she can trust my opinions or advice (and that took  <br/>\nsome time for me to build, as I was not good at this when she was  <br/>\nyounger) she&#39;ll make decisions that usually make sense to both of us.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I do care, but I wouldn&#39;t dream of forcing them to make social  <br/>\n&gt; decisions based upon my feelings on the matter.<br/>\n<br/>\n </span></blockquote>Are there other kinds of decisions that you would force them to make,  <br/>\nones that are not social decisions?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I listen and if they can&#39;t think of a solution, I try to offer up  <br/>\n&gt; a few different ways they can handle it, based upon their stated  <br/>\n&gt; perspectives and we also discuss possible outcomes and ways the  <br/>\n&gt; other people might react, and we try to hash out how SHE would like  <br/>\n&gt; to handle it.  I try to bring them back to their desired outcome.<br/>\n<br/>\n </span></blockquote>Fair enough.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I get the feeling that some people here had parents who &quot;inflicted  <br/>\n&gt; opinions&quot; and they&#39;re trying not to do that.  Does the same thing  <br/>\n&gt; apply to teenage social and emotional issues?  What do you do to  <br/>\n&gt; show kids that you care about their dilemma, and how do you help  <br/>\n&gt; them try to find their own answers without &quot;abandoning&quot; them?<br/>\n<br/>\n </span></blockquote>Listen. With focused attention. Without minimizing her worries. Many  <br/>\ntimes without advice or opinions. For my daughter, those can get in  <br/>\nthe way of processing what&#39;s going on in her heart and mind.  <br/>\nSometimes, if I feel she&#39;s open to it, I will ask if she wants help.  <br/>\nI&#39;ll accept &quot;yes,&quot; &quot;no,&quot; &quot;I don&#39;t know,&quot; and sometimes, &quot;leave me  <br/>\nalone.&quot; I know, for sure, that listening is enough when she&#39;s gotten  <br/>\nto that point!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Are the endless conversations we have in my house typical?<br/>\n<br/>\n </span></blockquote>Not in my house &lt;BWG&gt;. But, maybe in others.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My mother would have listened, and then not commented, not delved  <br/>\n&gt; any deeper than our initial request, asked any questions or given  <br/>\n&gt; any advice at all.  By the time I was 12, I had learned that I  <br/>\n&gt; couldn&#39;t expect any kind of validation, advice or opinions from her  <br/>\n&gt; and I stopped talking to her about everything.  I would have LOVED  <br/>\n&gt; if she had ever even offered up her advice, and I can definitely say  <br/>\n&gt; I&#39;ve never had it &quot;inflicted&quot; upon me.  She was horribly abused when  <br/>\n&gt; she was a kid, and I think she always minimized our dilemmas because  <br/>\n&gt; she really had it worse.  She also didn&#39;t<br/>\n&gt; trust her judgement, and I never knew that until I was an adult.<br/>\n<br/>\n </span></blockquote>It seems to me there is a lot of baggage you are carrying with you in  <br/>\nyour parenting (and you&#39;ve identified your husband&#39;s baggage, too).   <br/>\nJust as you suggested that people don&#39;t want to &quot;inflict opinions&quot; on  <br/>\ntheir kids because their parents did, you also seem to be doing just  <br/>\nthe opposite of what your mother did.<br/>\n<br/>\nLooking at your children for who *they* are and what *they* need is  <br/>\nmore important in unschooling than trying to undo the damage from your  <br/>\nown childhood by doing the opposite of what was done to you. By  <br/>\nlooking at what your kids want and need and doing that, you *do* re- <br/>\nparent yourself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Robin B.</div>","specialLinks":[]}],"prevTopicId":36100,"nextTopicId":36104}}