{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":226477113,"authorName":"mamavegg","from":"&quot;mamavegg&quot; &lt;pstujo@...&gt;","profile":"mamavegg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: video games ratings","postDate":"1142176094","msgId":10673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR2MWRndStpc2cwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGR1djVhaytvcnVhQGVHcm91cHMuY29tPg=="},"prevInTopic":10672,"nextInTopic":0,"prevInTime":10672,"nextInTime":10674,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"... was ... challenging. ... ****************************** Kay, you got me thinking about the tendency I and my family have for looking for age appropriate","messageBody":"<div id=\"ygrps-yiv-2033994973\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;nrskay&quot; &lt;k_bird@...&gt; wrote:<br/>\n <br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Before I became a rad unschooler I did control her games and she <br/>\n </span></blockquote>was <br/>\n<blockquote><span title=\"ireply\"> &gt; very bored with the younger games because they were not as <br/>\n </span></blockquote>challenging.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Kay<br/>\n<br/>\n </span></blockquote>                ******************************<br/>\n<br/>\nKay, you got me thinking about the tendency I and my family have for <br/>\nlooking for &quot;age appropriate&quot; items for my son......it can be so <br/>\nlimiting.  I never thought of it in this way before.  My mom is very <br/>\nanal, and won&#39;t even consider anything for older kids in terms of <br/>\nbooks, movies, games, etc.  Yet I have seen my son enjoy messing <br/>\naround with a toy marketed for younger kids as well as video games <br/>\nfor much older kids.  <br/>\n<br/>\nDeanna</div>","specialLinks":[]},{"userId":226477113,"authorName":"mamavegg","from":"&quot;mamavegg&quot; &lt;pstujo@...&gt;","profile":"mamavegg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: video games ratings","postDate":"1142175626","msgId":10672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR2MWQyYSt1bGltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAzMTEyMDA2MTcxNS4yNzQyMC40NDEzMDVDMjAwMDZFODY2MDAwMDZCMUMyMjAwNzM1ODM0MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":10669,"nextInTopic":10673,"prevInTime":10671,"nextInTime":10673,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"... I have always talked with him about it and felt comfortable that he understood that the violence was not real and not appropriate in real life. I used","messageBody":"<div id=\"ygrps-yiv-2060364596\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, zenmomma@... wrote:<br/>\n<br/>\n<br/>\n I have always talked with him about it and felt comfortable that he <br/>\nunderstood that the violence was not real and not appropriate in real <br/>\nlife. I used those ratings as a rough guideline for which games I <br/>\nneeded to look at and talk with him about. <br/>\n<br/>\n<br/>\n              **************************<br/>\n<br/>\nI feel this is such an important aspect of parenting and partnering a <br/>\nchild, especially in these areas where we have discomfort or concerns <br/>\nourselves.  It certainly helps me to feel like I can just take a deep <br/>\nbreath and release all of my &quot;what if&#39;s&quot; when I am able to openly talk <br/>\nwith both my DH and DS about it.<br/>\n<br/>\nSo, you know what I found my son likes to do the most on his Republic <br/>\nCommando game?  Checks out his troopers to make sure the have adequate <br/>\nhealth, and if not, he starts a healing and orders them to the health <br/>\ntanks......I thanked my DH with a big smooch for sharing that little <br/>\ntidbit with me, yup!<br/>\n<br/>\nDeanna </span></blockquote></div>","specialLinks":[]},{"userId":226477113,"authorName":"mamavegg","from":"&quot;mamavegg&quot; &lt;pstujo@...&gt;","profile":"mamavegg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: video games ratings","postDate":"1142174975","msgId":10669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR2MWNkdis2MjZpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGR1dWwyait1bGlxQGVHcm91cHMuY29tPg=="},"prevInTopic":10647,"nextInTopic":10672,"prevInTime":10668,"nextInTime":10670,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"... real ... ********************************* This is what I have to keep telling myself.  We are a peaceful family, my son has not experienced any kind of","messageBody":"<div id=\"ygrps-yiv-1941117835\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But, what I have learned over the years, is video game violence is a<br/>\n&gt; fantasy world. It&#39;s pretend and doesn&#39;t have anything to do with <br/>\n </span></blockquote>real<br/>\n<blockquote><span title=\"ireply\"> &gt; violence.<br/>\n&gt; Real violence is encouraged and fostered by violence, neglect and<br/>\n&gt; abuse. Those are things my children have never been around, so they<br/>\n&gt; aren&#39;t actually drawn to violence, just pretending with it.<br/>\n<br/>\n<br/>\n </span></blockquote>              *********************************<br/>\n<br/>\nThis is what I have to keep telling myself.  We are a peaceful <br/>\nfamily, my son has not experienced any kind of violence or abuse and <br/>\nis troubled when he sees it in &quot;real life&quot;, such as on the news.  He <br/>\nis just sooooo sweet, that to see him blasting the heck out of droid <br/>\narmies is a bit unsettling.<br/>\n<br/>\nThanks for the helpful responses, everyone.<br/>\n<br/>\nDeanna</div>","specialLinks":[]},{"userId":205425680,"authorName":"robinstempo@aol.com","from":"robinstempo@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] video games ratings","postDate":"1142109663","msgId":10647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5Ny43MDZlZmExLjMxNDQ4ZmRmQGFvbC5jb20+"},"prevInTopic":10644,"nextInTopic":10669,"prevInTime":10646,"nextInTime":10648,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"My son plays video and computer games over ten hours every day.  Most of the time he is at home, and sometimes he goes to a local cyber cafe or the gamers ","messageBody":"<div id=\"ygrps-yiv-412634310\">My son plays video and computer games over ten hours every day.  Most of the <br/>\ntime he is at home, and sometimes he goes to a local cyber cafe or the gamers <br/>\nlounge.  Over the years, we&#39;ve talked about the violence and I&#39;ve found an <br/>\nuneasy peace with his take on it all.  The problem that bothers me more, is the <br/>\nsexist attitude found in many of the games.  Years ago the females with the S & <br/>\nM outfits were so cartoony looking, that it was easier to dismiss, but the <br/>\ntechnological advances have made many of these games very realistic.  And the <br/>\nmarketeers know that the predominant audience for these games are 14 to 34 year <br/>\nold males.<br/>\nThey&#39;ve enhanced the heavy breathing and glistening skin on the barely clad <br/>\nevil temptress who has to be annihilated before you can get to the next level.  <br/>\nMy son said that on several games there are &#39;secret&#39; codes you can enter to <br/>\nview or participate in various sexual activities.  Who knew? And all the while <br/>\nthere are all the derogatory gay comments and jokes.  Those really bother me. <br/>\nWho are the geeks making these games?<br/>\nWhen the computer and game consoles were in the family room, he self <br/>\nregulated his games based on what he didn&#39;t want the rest of the family to see him <br/>\ndoing!<br/>\nIn our current situation he is behind a locked door a lot.  He comes out for <br/>\nfood and to talk about his latest battle.<br/>\nMy son doesn&#39;t really want to stop playing long enough to get into a <br/>\nphilosophical conversation about any of it.  But I REALLY listen to him, whenever he <br/>\nis away from a console.<br/>\n<br/>\nRobin</div>","specialLinks":[]},{"userId":179628783,"authorName":"Malinda Mills","from":"&quot;Malinda Mills&quot; &lt;saprswife@...&gt;","profile":"saprswife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] video games ratings","postDate":"1142107890","msgId":10644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYmIwMWM2NDU0NyRmZWU4NzZjMCQwOGJkZmVhOUBNQUxJTkRBPg==","referencesHeader":"PGR1dDlnOSsyZzhlQGVHcm91cHMuY29tPg=="},"prevInTopic":10640,"nextInTopic":10647,"prevInTime":10643,"nextInTime":10645,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-489633632\">&lt;&lt;Now, I am the mom that wanted no guns or violent toys in the house <br/>\n(long before unschooling days!), and I&#39;m really sensitive to violent <br/>\nmovies.&gt;&gt;<br/>\n<br/>\nThis has probably been my biggest obstacle, Deanna.  Tristan has several friends that I felt got way too into their gunplay (to the point I had to walk away, but the images greatly disturbed me), and for the longest time I never allowed toy guns in the house.  When I was younger, I could watch violent movies without a problem.  Over the past few years, however, I can no longer stomach them....and this has overflowed to video games and some of the more violent imaginary games the kids will play as well (the violence just hits too close to home in our family, with DH in the military).  <br/>\n<br/>\nAfter reading a ton about unschooling, I relented one day at Blockbuster and allowed Tristan to rent one of the Star Wars games.  You would have thought this kid had won the lottery! LOL  He&#39;s your son&#39;s age and has outgrown Spyro, Sly, and the like.  He now has several Star Wars games that he enjoys so much. <br/>\n<br/>\nLast night we were out looking at games and a few war games caught his eye.  The worried look I had in my eyes didn&#39;t escape him, and he said he knew I didn&#39;t like those games since Dad was fighting in a war so he wouldn&#39;t get it.  He always wants to know WHY something is rated like it is.  He refuses to choose games with gore or language - those are two things he just does not care for at all.<br/>\n<br/>\nTristan is an active kid, who will play &quot;lightsabers&quot; outside all day with his friends.  This is the same kid who takes care of any wayward bugs that wander into the house, insists on checking on friends who he knows are staying alone in their homes, and wants to attend a future anti-war rally in the area.<br/>\n<br/>\nI&#39;ll sit for a bit to watch Tristan play but don&#39;t tend to hang around for long if I start to feel uncomfortable.  It&#39;s great that your DH and son enjoy playing together! :o)<br/>\n<br/>\nMalinda<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248175779,"authorName":"nrskay","from":"&quot;nrskay&quot; &lt;k_bird@...&gt;","profile":"nrskay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: video games ratings","postDate":"1142102164","msgId":10640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR1djVhaytvcnVhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGR1dDlnOSsyZzhlQGVHcm91cHMuY29tPg=="},"prevInTopic":10639,"nextInTopic":10644,"prevInTime":10639,"nextInTime":10641,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"... Hi:  My 11 yo dd is a major gamer on her PS2 and computer.  For us we don t limit games.  She has everyone to adult ratings.  We do discuss the violence,","messageBody":"<div id=\"ygrps-yiv-156176892\"><blockquote><span title=\"ireply\">&gt; My question is in regards to video game ratings.  <br/>\n<br/>\n<br/>\n </span></blockquote>Hi:  My 11 yo dd is a major gamer on her PS2 and computer.  For us we <br/>\ndon&#39;t limit games.  She has &quot;everyone to adult ratings.&quot;  We do <br/>\ndiscuss the violence, bad language, etc on the adult games.  <br/>\n<br/>\nShe has told me it&#39;s not the violence or bad language the excites her, <br/>\nshe just wants to get to the next level or challenge.  She often turns <br/>\ndown the volume so she doesn&#39;t hear the language.<br/>\n<br/>\nBefore I became a rad unschooler I did control her games and she was <br/>\nvery bored with the younger games because they were not as challenging.<br/>\n<br/>\nKay</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] video games ratings","postDate":"1142097346","msgId":10639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMTEyMDA2MTcxNS4yNzQyMC40NDEzMDVDMjAwMDZFODY2MDAwMDZCMUMyMjAwNzM1ODM0MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":10620,"nextInTopic":10640,"prevInTime":10638,"nextInTime":10640,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"... is a very peaceful kind of person (even takes care of flies in the house, feeds them, and won t put them outside if it s too cold.....) But I struggle with","messageBody":"<div id=\"ygrps-yiv-1341117307\"><blockquote><span title=\"ireply\">&gt;&gt;And my son<br/>\n </span></blockquote>is a very peaceful kind of person (even takes care of flies in the<br/>\nhouse, feeds them, and won&#39;t put them outside if it&#39;s too cold.....) <br/>\nBut I struggle with this issue lately.<br/>\n<br/>\nWhat do other families do with regards to ratings on games?&gt;&gt;<br/>\n<br/>\nYour son sounds a lot like mine. He has a catch and release program for spiders. &lt;g&gt; <br/>\n<br/>\nConor is almost 17 now and still a basically peaceful soul. He has his teen moments but has a deeply spiritual side and is a total pacifist who openly stands up for gay rights. However he LOVES to play Halo2 online with his friends. He likes any kind of first person shooter in fact, even those (especially those?) with the lovely blood and gore. I have always talked with him about it and felt comfortable that he understood that the violence was not real and not appropriate in real life. I used those ratings as a rough guideline for which games I needed to look at and talk with him about. <br/>\n<br/>\nOnly once did I freak out about a game. It was Grand Theft Auto 2 and his dad and I had bought it and given it to him without realizing the content when he turned 13. After I saw it and heard the hype I panicked and took it back in trade for another game. (It had a small part with hookers that upset me.)  Even though I explained to him my conerns and told him it was *my* issue not his, I wasn&#39;t sure I was doing the right thing. He was bummed but I didn&#39;t do this kind of thing often, if at all. So he agreed to go with my comfort level and return the game. Later on I thought more about it and watched what was in the game rather than just relying on the rumor. Looking back, I don&#39;t think I was giving Conor enough credit. But our relationship was strong and he valued my opinion. I wasn&#39;t wrong to take it back but it probably would have been fine for him to keep it.<br/>\n<br/>\nHe has a saying about violence only belonging in the virtual world and that&#39;s how he lives. So I haven&#39;t seen any effect of his shooting up pixilated bad guys flowing into his real life activities. But as with any parenting issue, I&#39;ve been involved the whole way, talking and watching and sharing.<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: &quot;mamavegg&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pstujo@...\">pstujo@...</a>&gt;</div>","specialLinks":[]},{"userId":253937257,"authorName":"April Morris","from":"&quot;April Morris&quot; &lt;klkb624@...&gt;","profile":"klkb624","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] video games ratings","postDate":"1142088847","msgId":10620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFlMjZhNTcxMDYwMzExMDY1NGwzZmExNzUwNGlkMjc1MjhjOWMyZTdlOGRmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGR1dDlnOSsyZzhlQGVHcm91cHMuY29tPg==","referencesHeader":"PGR1dDlnOSsyZzhlQGVHcm91cHMuY29tPg=="},"prevInTopic":10616,"nextInTopic":10639,"prevInTime":10619,"nextInTime":10621,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"We ignore them, just as we do movie ratings. I m more interested in why it s rated a certain way, but even then, it s just information.  When we first got a","messageBody":"<div id=\"ygrps-yiv-1040912495\">We ignore them, just as we do movie ratings. I&#39;m more interested in why it&#39;s<br/>\nrated a certain way, but even then, it&#39;s just information.  When we first<br/>\ngot a game cube, then an x-box (after years of saying, &#39;we&#39;ll never have one<br/>\nof those in my house&#39;....) I was concerned about what kind of games my son<br/>\nwanted to play. I heard and read all the hullabaloo around the halo games a<br/>\nwhile back and was concerned, but he really, really wanted to play them. So<br/>\nwe rented it and I watched him play. And I watched and watched and watched<br/>\nand for the life of me, I couldn&#39;t figure out what all the fuss was about.<br/>\nWe decide what movies to watch, what games to play, what books to read based<br/>\non interest, content, comfort level of different family members, our values<br/>\nand beliefs.....but we totally ignore the arbitrary ratings on these things.<br/>\nWe talk about the games they play and we live a life that reflects our<br/>\nattitude on respecting and caring about people and I&#39;ve yet to see my kids<br/>\nor any of their friends want to act out what they play.  Last week there was<br/>\na lot in the news regarding some new game coming out, &quot;25 years to Life&quot; I<br/>\nthink. The local police and schools are up in arms about, telling parents to<br/>\nban it, it will cause kids to do terrible things, etc. My kids don&#39;t tend to<br/>\nlike those kind of games, but I wouldn&#39;t disallow it. Karl was dumbfounded<br/>\nthat people would be so upset, he just couldn&#39;t believe people thought video<br/>\ngames caused violence. He asked if they didn&#39;t realize that the kids who act<br/>\nout those games are seeing real life violence, not video game violence? He<br/>\nthough they were focusing on the wrong problem, as though getting rid of<br/>\nviolent games would get rid of juvenile violence.<br/>\n<br/>\nIt goes right along with all the fuss about Myspace lately. Every single day<br/>\nthere are news reports and newspaper articles about the evils of Myspace and<br/>\nhow parents should make their kids take down their sites. As soon as our<br/>\nkids were on the computer we talked about safe computer use. They&#39;ve know<br/>\nhow to do these things safely from an early age. They&#39;ve never tried to hide<br/>\nwhat they do and in fact, they made me a Myspace page so I could be their<br/>\n&quot;Friend&quot; and read their stuff.  I&#39;ve never asked them to do this. And many<br/>\nof their friends &#39;added&#39; me and they love to send me messages.  My husband<br/>\nworks at a school and ended up in a dialog about all this. A teacher asked<br/>\nhim if he had ever heard of my space and was shocked at his reply of &quot;yes, I<br/>\nhave a page there&quot;. These were teachers that were going to make their kids<br/>\nstop using Myspace if they were using it (they often are never sure,  they<br/>\ndon&#39;t know what their kids are doing). Chuck asked them if they had ever<br/>\ngone to Myspace and looked around. Not one of them had done so. Most of the<br/>\nworries and concerns the media discusses are what I think are just common<br/>\nsense issues that parents and kids should discuss together right from the<br/>\nstart. It&#39;s a different world and I want my kids to be able to safely<br/>\nnavigate the cyber world, not be banned from it until they are &#39;free&#39;.  And<br/>\nI know without a doubt that many of these kids in the paper and on the news<br/>\nwho have been forced to take down their myspace page, have another one they<br/>\nset up at a friends house or the library or somewhere and now they aren&#39;t<br/>\ngoing to breathe a word of it to their parents. And no way would they ask<br/>\nfor advice or express concern about something, because as soon as they do,<br/>\ndown goes the page again. How are they going to learn to exist in this world<br/>\ntoday?<br/>\n<br/>\n~April<br/>\nMom to Kate-19, Lisa-17, Karl-14, & Ben-10.<br/>\n*REACH Homeschool Grp, an inclusive group in Oakland County<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.reachhomeschool.com\">http://www.reachhomeschool.com</a><br/>\n* Michigan Unschoolers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/michigan_unschoolers/\">http://groups.yahoo.com/group/michigan_unschoolers/</a><br/>\n*Check out Chuck&#39;s art www.artkunst23.com<br/>\n&quot;All we have to decide is what to do with the time that is given to us.&quot;<br/>\n  Gandalf the Grey<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 3/10/06, mamavegg &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pstujo@...\">pstujo@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; I don&#39;t think I&#39;ve posted here yet, but I&#39;ve been lurking about for a<br/>\n&gt; couple of months.  You guys are great.<br/>\n&gt;<br/>\n&gt; My question is in regards to video game ratings.  My son is eight and<br/>\n&gt; a half, and an avid Star Wars fan.  He&#39;s seen all the movies many<br/>\n&gt; times each, and pores through the visual dictionaries and books he&#39;s<br/>\n&gt; gotten on a daily basis.  He&#39;s had a Gameboy for about a year, and we<br/>\n&gt; got an Xbox last fall.  And he is an AVID computer guy!  He&#39;s at that<br/>\n&gt; age where the Sonic and Spyro etc. type games don&#39;t hold his interest<br/>\n&gt; anymore - high action kind of guy.  So his dad bought him some Star<br/>\n&gt; Wars games for Xbox that are rated for teens.  He loves them and<br/>\n&gt; plays them a lot.<br/>\n&gt;<br/>\n&gt; Now, I am the mom that wanted no guns or violent toys in the house<br/>\n&gt; (long before unschooling days!), and I&#39;m really sensitive to violent<br/>\n&gt; movies.  I have eased up on forcing any of my *stuff* on him long<br/>\n&gt; ago, my husband is great on talking with me about this.  And my son<br/>\n&gt; is a very peaceful kind of person (even takes care of flies in the<br/>\n&gt; house, feeds them, and won&#39;t put them outside if it&#39;s too cold.....)<br/>\n&gt; But I struggle with this issue lately.<br/>\n&gt;<br/>\n&gt; What do other families do with regards to ratings on games?  He<br/>\n&gt; doesnt really want any other games than the Star Wars in the teen<br/>\n&gt; range, still likes some of his Gameboy Scooby-Doo and Metroid and<br/>\n&gt; AstroBoy.  We talk about my concerns as a family.  But sometimes I<br/>\n&gt; get wiggy about the whole deal.<br/>\n&gt;<br/>\n&gt; Is this simply my *stuff*?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Deanna     (who is listening to my DS and DH playing and enjoying<br/>\n&gt; themselves immensely right this minute!)<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"video games ratings","postDate":"1142085523","msgId":10616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR1dWwyait1bGlxQGVHcm91cHMuY29tPg=="},"prevInTopic":10614,"nextInTopic":10620,"prevInTime":10615,"nextInTime":10617,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"What do other families do with regards to ratings on games? We ignore them.:) Ok, not totally....I warn the younger ones about certain features of a game if","messageBody":"<div id=\"ygrps-yiv-931469108\">&quot;What do other families do with regards to ratings on games?&quot;<br/>\n<br/>\nWe ignore them.:) Ok, not totally....I warn the younger ones about<br/>\ncertain features of a game if I think it will bother them. At this<br/>\npoint, all four children LOVE GTA, which would have horrified me a few<br/>\nyears ago. Ok, I still cringe when the guy yells &quot;shit&quot; while my 5y.o.<br/>\nis playing. ack...<br/>\n<br/>\nBut, what I have learned over the years, is video game violence is a<br/>\nfantasy world. It&#39;s pretend and doesn&#39;t have anything to do with real<br/>\nviolence.<br/>\nReal violence is encouraged and fostered by violence, neglect and<br/>\nabuse. Those are things my children have never been around, so they<br/>\naren&#39;t actually drawn to violence, just pretending with it.<br/>\n<br/>\nI was talking to my boys about that whole &quot;desensitization&quot; issue a<br/>\ncouple months ago. The conversation was triggered by a comment by dh,<br/>\nwhich I was argueing.:)<br/>\nThey said &quot;but Mom, we ARE desensitized&quot;. I said &quot;yeah, you&#39;re<br/>\ndesensitized to pretend violence. But what if you saw someone hurting<br/>\nanother human being in real life, or someone getting hurt in another<br/>\nway, are you desensitized to THAT?&quot;<br/>\nWell, they immediately agreed that it would bother them deeply. <br/>\n<br/>\nTrevor was in downtown Pensacola before the war started, waving<br/>\nprotest signs and standing up for his belief in a peaceful solution.<br/>\nHe can&#39;t stand the Bush admin. and is deeply bothered by war and other<br/>\nhuman issues that are harmful.<br/>\nHe&#39;s my biggest video gamer. I think he&#39;ll probably be making money at<br/>\nit one day.....but if not, he&#39;s having a lot of fun and learning all<br/>\nsorts of cool things now.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":226477113,"authorName":"mamavegg","from":"&quot;mamavegg&quot; &lt;pstujo@...&gt;","profile":"mamavegg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"video games ratings","postDate":"1142040905","msgId":10614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR1dDlnOSsyZzhlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":10616,"prevInTime":10613,"nextInTime":10615,"topicId":10614,"numMessagesInTopic":0,"msgSnippet":"I don t think I ve posted here yet, but I ve been lurking about for a couple of months.  You guys are great. My question is in regards to video game ratings.","messageBody":"<div id=\"ygrps-yiv-285340557\">I don&#39;t think I&#39;ve posted here yet, but I&#39;ve been lurking about for a <br/>\ncouple of months.  You guys are great.<br/>\n<br/>\nMy question is in regards to video game ratings.  My son is eight and <br/>\na half, and an avid Star Wars fan.  He&#39;s seen all the movies many <br/>\ntimes each, and pores through the visual dictionaries and books he&#39;s <br/>\ngotten on a daily basis.  He&#39;s had a Gameboy for about a year, and we <br/>\ngot an Xbox last fall.  And he is an AVID computer guy!  He&#39;s at that <br/>\nage where the Sonic and Spyro etc. type games don&#39;t hold his interest <br/>\nanymore - high action kind of guy.  So his dad bought him some Star <br/>\nWars games for Xbox that are rated for teens.  He loves them and <br/>\nplays them a lot.<br/>\n<br/>\nNow, I am the mom that wanted no guns or violent toys in the house <br/>\n(long before unschooling days!), and I&#39;m really sensitive to violent <br/>\nmovies.  I have eased up on forcing any of my *stuff* on him long <br/>\nago, my husband is great on talking with me about this.  And my son <br/>\nis a very peaceful kind of person (even takes care of flies in the <br/>\nhouse, feeds them, and won&#39;t put them outside if it&#39;s too cold.....)  <br/>\nBut I struggle with this issue lately.<br/>\n<br/>\nWhat do other families do with regards to ratings on games?  He <br/>\ndoesnt really want any other games than the Star Wars in the teen <br/>\nrange, still likes some of his Gameboy Scooby-Doo and Metroid and <br/>\nAstroBoy.  We talk about my concerns as a family.  But sometimes I <br/>\nget wiggy about the whole deal.<br/>\n<br/>\nIs this simply my *stuff*?  <br/>\n<br/>\n<br/>\nDeanna     (who is listening to my DS and DH playing and enjoying <br/>\nthemselves immensely right this minute!)</div>","specialLinks":[]}],"prevTopicId":10649,"nextTopicId":10659}}