{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":29,"messages":[{"userId":383288097,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;7freespirits@...&gt;","profile":"maitai373","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] snakes?","postDate":"1275016773","msgId":44315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMzQwMWNhZmUxNCQ5OGQxNjA2MCRjYTc0MjEyMCRAY29tPg==","inReplyToHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44263,"nextInTopic":0,"prevInTime":44314,"nextInTime":44316,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"My husband has a phobia of anything arachnid.  As does Safiya.  During Halloween time we can t go into stores like Party City with the two of them without","messageBody":"<div id=\"ygrps-yiv-1609878706\">My husband has a phobia of anything arachnid.  As does Safiya.  During<br/>\nHalloween time we can&#39;t go into stores like Party City with the two of them<br/>\nwithout circumventing through the store somehow.<br/>\n<br/>\n <br/>\n<br/>\nIf you are afraid of snakes Crystal, that&#39;s perfectly fine.  That&#39;s a bond<br/>\nthat you and your daughter may not have, and that&#39;s okay.  Someone else<br/>\nsuggested this, I think: find someone else who will help her learn about<br/>\nsnakes.  Unschooling doesn&#39;t mean we have to &quot;teach&quot; our children everything<br/>\nourselves.  It means we facilitate their learning.  Find a pet store like<br/>\nPet Smart she can go to.  They love talking about all of the animals in<br/>\nthere.  Or what about a museum nearby that has some type of snake exhibit.<br/>\nMaybe dad or a friend can take her.<br/>\n<br/>\n <br/>\n<br/>\nPhobias are real and nothing to play with.  Until you feel ready (and that<br/>\nmay never happen) to deal with your phobias, find others who will help your<br/>\ndaughter with her snake interest.<br/>\n<br/>\n <br/>\n<br/>\nMaisha Khalfani<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://earthspirittarot.blogspot.com/\">http://earthspirittarot.blogspot.com/</a>&gt; EarthSpirit Tarot Readings<br/>\nCome and gain clarity and insight<br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://earthspiritbooksandgifts.blogspot.com/\">http://earthspiritbooksandgifts.blogspot.com/</a>&gt; EarthSpirit Books and Gifts<br/>\nA bookstore for the Open Minded<br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://7freespirits.blogspot.com/\">http://7freespirits.blogspot.com/</a>&gt; 7 Free Spirits<br/>\n<br/>\nFollow our adventures through life<br/>\n<br/>\n <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of crystal rid  <br/>\n<br/>\nTHANK YOU! My fear of snakes may not be rational but having no fear of them<br/>\nisn t either. I have tried real hard to make sure my children know to be<br/>\nvery cautious around snakes or areas prone to snakes while at the same time<br/>\nletting my oldest daughter study them from a safe distance. We have already<br/>\nfound five in our yard this year. I let her study them but made her stay<br/>\nback a ways. I insisted my other two look at them enough to know what they<br/>\nlook like in case they find one. Sure enough my then six year old found one<br/>\njust inches from her fingers when digging in the dirt. As of yet none of my<br/>\nchildren are afraid of snakes now bugs are a whole other story: -)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: snakes?","postDate":"1274452968","msgId":44263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0NjY1OCtkaGthQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4ODE5NC44NTU4NC5xbUB3ZWIxMTMzMTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44260,"nextInTopic":44315,"prevInTime":44262,"nextInTime":44264,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"See what happens when you ask kids directly ;)","messageBody":"<div id=\"ygrps-yiv-823660553\">See what happens when you ask kids directly ;)<br/>\n<br/>\n---Mer</div>","specialLinks":[]},{"userId":154781355,"authorName":"crystal rid","from":"crystal rid &lt;cryway2@...&gt;","profile":"cryway2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274407177","msgId":44260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4ODE5NC44NTU4NC5xbUB3ZWIxMTMzMTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44257,"nextInTopic":44263,"prevInTime":44259,"nextInTime":44261,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Thank you all for all the advice.  I talked to her today and asked her how interested in snakes she was.  Her answer was not much so I asked her if she wanted","messageBody":"<div id=\"ygrps-yiv-854084027\">Thank you all for all the advice.  I talked to her today and asked her how interested in snakes she was.  Her answer was not much so I asked her if she wanted to touch one and she shuddered and said no.  I asked her if she wanted me to help her find books about them and she said not really .  So I asked her what makes her so fascinated with them at the zoo and pet stores and such and she said she just enjoys looking at them and seeing the differences.  So I guess I m off the hook for now.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu May 20th, 2010 4:09 AM CDT Joyce Fetteroll wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;On May 19, 2010, at 7:59 PM, crystal rid wrote:<br/>\n&gt;<br/>\n&gt;&gt; The thing is question says she isn t afraid of them. Fine but she  <br/>\n&gt;&gt; should have a healthy respect for them.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Your need to impose a &quot;healthy&quot; fear on her is just creating a barrier  <br/>\n&gt;between her and what she&#39;s curious about. You&#39;re saying they&#39;re  <br/>\n&gt;dangerous and she&#39;s not competent to handle them. You don&#39;t trust her  <br/>\n&gt;because she doesn&#39;t have the knowledge and/or fear you think she  <br/>\n&gt;needs. But she&#39;s *also* learning she can&#39;t trust you. She can&#39;t trust  <br/>\n&gt;you to help. She can&#39;t trust your &quot;information&quot; (vague warnings  <br/>\n&gt;wrapped in fear). She knows people do handle snakes. There is a way to  <br/>\n&gt;do it and if you won&#39;t help, if you won&#39;t find her someone who can  <br/>\n&gt;help, she&#39;ll do it on her own because she knows you&#39;ll just interfere.  <br/>\n&gt;Her lack of trust in you is *far* more dangerous than snakes.<br/>\n&gt;<br/>\n&gt;Information and knowledge is what she needs, not vague fears. There  <br/>\n&gt;may be poisonous snakes but there are *also* far more numerous  <br/>\n&gt;nonpoisonous ones. Find out how to identify the safe ones.<br/>\n&gt;<br/>\n&gt;As hard as this is, it&#39;s way way easier than the dangers of sex,  <br/>\n&gt;alcohol and cars! See this as building a foundation so she trusts you  <br/>\n&gt;want to help her get what she wants in safe and respectful ways.<br/>\n&gt;<br/>\n&gt;*Trust* that she doesn&#39;t want to get hurt! She *wants* to be safe. But  <br/>\n&gt;your idea of safe is stay away. *Her* idea of safe is a way to explore  <br/>\n&gt;them without getting hurt. Give her what she wants and needs, not what  <br/>\n&gt;you want her to have otherwise she&#39;ll just ignore you and tackle it  <br/>\n&gt;herself when she knows you&#39;re not watching.<br/>\n&gt;<br/>\n&gt;Joyce<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: snakes?","postDate":"1274399718","msgId":44257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0NGk1Nit2bTBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3ODg1Ny41Njg3Ny5xbUB3ZWIxMTMzMDkubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44252,"nextInTopic":44260,"prevInTime":44256,"nextInTime":44258,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"... Its challenging to have a kid with different interests than yours. Ray s very different from me, he likes things that challenge my comfort zones on a","messageBody":"<div id=\"ygrps-yiv-1137468070\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, crystal rid &lt;cryway2@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I dont want to know anything about snakes<br/>\n<br/>\n </span></blockquote>Its challenging to have a kid with different interests than yours. Ray&#39;s very different from me, he likes things that challenge my comfort zones on a regular basis. At first I resented that a little - why couldn&#39;t he like trees or rock-n-roll? Why did he have to like skateboarding and fire-spinning and death metal? But its important to me to have as good a relationship as possible with him, so I stretched a little. I did some research into the sorts of things he likes so that I could understand him when he talked about them and ask meaningful questions. I&#39;d watch him skate and spin fire, try out a few tricks myself, do more research. <br/>\n<br/>\nI checked in with friends who like various kinds of metal music and found types I could listen to (I can&#39;t &quot;hear&quot; a lot of metal... something in my hearing or processing turns it all to white noise) and when Ray found out I was doing that, He did some research and found music we both liked - he was eager to share his world with me. He found classical ensembles who do covers of popular metal artists and different varieties of metal neither of us had ever heard of (Epic Folk Metal, who knew?). <br/>\n<br/>\nIts common to think of parenting and homeschooling in terms of parents bringing the world to children, and children to the world, but so very often its my kids who bring the world to me. They expand my world and my mind when I least expect it. That used to intimidate me, but now I can see it as one of the marvels of my life - my kids are so marvelous! They make my world spectacular just by being a part of it. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: snakes?","postDate":"1274384329","msgId":44252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0NDM0OStua2llQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44251,"nextInTopic":44257,"prevInTime":44251,"nextInTime":44253,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"I haven t read any of the replies, yet, so excuse me if this has been said already. If your sister is okay with snakes, does she know how to handle them","messageBody":"<div id=\"ygrps-yiv-2054862980\">I haven&#39;t read any of the replies, yet, so excuse me if this has been said already. <br/>\n<br/>\nIf your sister is okay with snakes, does she know how to handle them safely? Identify them? Catch them? Even if she&#39;s willing to learn those things it would be a good, handy resource for your dd, a mentor. <br/>\n<br/>\nWe live in a place with poisonous snakes, so I can totally relate to your concern and caution, at the same time, I&#39;m not afraid of snakes and neither is my partner or my dd (my stepson is, though). Not being afraid is an important part of approaching and handling snakes safely! Fear isn&#39;t the same as &quot;healthy respect&quot; - the body language of fear will communicate itself to a wild animal, like a snake, and make it more nervous, too. Nervous snakes bite! Mellow snakes don&#39;t bite. So see your dds lack of fear as an asset in that regard. <br/>\n<br/>\nHelp her find resources. If your sister isn&#39;t interested in facilitating your dd&#39;s exploration, check with area zoos and science centers and see if there are any classes or workshops where she can handle snakes. Call some pet stores, too, while you&#39;re at it. Find you dd people who can help her know how to be safe with snakes. At the same time, get books and movies about snakes - do you have a field guide? Very handy. A book on pet-care for snakes would also be a good buy, even if you don&#39;t plan to get one as a pet. Lots of good info, there. Think of this as helping her do some research - an investment in her safety. The more she knows, the less likely she is to do something foolish, like try to grab a snake by the tail. <br/>\n<br/>\nDo y&#39;all have garter snakes or grass snakes in your area? I forget where you live, sorry! If so, and you can bear it at all, you can challenge her to catch those and bring them to you to show off. Those are good starter snakes! They will bite if you grab them the wrong way, but they aren&#39;t venomous and don&#39;t look like anything venomous, so they make good, safe practice. If you can&#39;t - can your sister? Again solicit her help or that of a friend as much as possible. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274375546","msgId":44251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4Mzc5Mi41NDMzOC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44248,"nextInTopic":44252,"prevInTime":44250,"nextInTime":44252,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Snakes have bones, they have cool skeletons, all spinal looking. I can spend ages fascinated by snakes. I ve had rattlesnakes within striking distance of me,","messageBody":"<div id=\"ygrps-yiv-371974956\">Snakes have bones, they have cool skeletons, all spinal looking. I can spend ages fascinated by snakes. I&#39;ve had rattlesnakes within striking distance of me, I&#39;ve held a fair number of garter snakes as well as constrictors of many types. When we were in Belize an herpetologist reached behind where Simon and I were sitting and pulled out a parrot snake who was in a bush behind us, we were in no danger before we were made aware of the snake and continued to be in no danger as we stroked his amazing skin. <br/>\n<br/>\nReally explore snakes, they aren&#39;t that scary and are very rarely dangerous. Most will run long before you come on the scene. I&#39;ve been around snakes all of my life and I think I&#39;ve only been bitten once, by a garter snake, even though they used to breed in the bushes next to my house. How awful it would be for you to share your fear with your daughter. Don&#39;t work to make her world smaller and scarier, work to make it bigger and brighter and filled with the most amazing creatures and moments of engagement. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thursday, 20 May, 2010 0:59:40<br/>\nSubject: [unschoolingbasics] snakes?<br/>\n<br/>\nOK, so here s my first step out of my comfort zone to allow my daughter to explore her interests.  My 11 year old finds snakes fascinating.  She is amazed that something with no bones can move in such ways.  Always before I ve told her to stay away from them.  She knows we have poisonous snakes here.  I do let my sister take her in the snake house at the zoo and wildlife refuge.  I would prefer she give even caged snakes a wide birth.  However I can considering let her explore her interest in more depth if she wants.  The thing is question says she isn t afraid of them.  Fine but she should have a healthy respect for them.  I tried explcining it to her by telling her I m not afraid of cars but I know they could kill me so I m not going to go out in get in front of a moving vehicle.  I explained snakes are the same way.  Some can kill you most can bite.  You dont have to be afraid of them but you should be cautious and stay well away from one unless you<br/>\nknow for certain it isn t poisonous.   Here s my delema how do I let her explore her interest and still stay comfortable with it myself.  Seeing her hand go to the glass in front of a snakes head makes me want to pull her away from the cage.  I know it can t hurt her but I just prefer she stay far away from them.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274373664","msgId":44248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluYUZHUVFfWUJndmFDTnI3WlVDcGdUQ2NxT0I2S0p2X1FIS2gtekBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDkwMUU2RTQyLURBMjYtNEJCQS04MUY5LTdGNjVBNDdCQTc3RUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPiAJPDkwMUU2RTQyLURBMjYtNEJCQS04MUY5LTdGNjVBNDdCQTc3RUB2ZXJpem9uLm5ldD4="},"prevInTopic":44247,"nextInTopic":44251,"prevInTime":44247,"nextInTime":44249,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"OK now that I m back on my computer... 1) I was, before I was a mommy, an exotic animal veterinary technician and I did all the handling of the exotic critters","messageBody":"<div id=\"ygrps-yiv-1463496572\">OK now that I&#39;m back on my computer...<br/>\n<br/>\n1) I was, before I was a mommy, an exotic animal veterinary technician and I<br/>\ndid all the handling of the exotic critters both at the clinic and when I<br/>\nworked at the zoo.  I&#39;ve had PLENTY of experience with snakes and with<br/>\npeople, women mostly, who freak out over the mention of the word.  It&#39;s very<br/>\nfrustrating to listen to this kind of hysteria because it&#39;s so stupid.  I<br/>\nhave phobias too.  I don&#39;t like heights.  But if someone said &quot;LADDER&quot; to me<br/>\nI wouldn&#39;t start screaming and sweating.  For some reason people with fears<br/>\nof animals think it&#39;s their duty to pass those along to their children.<br/>\n(Mostly.)  There isn&#39;t any reason not to say &quot;Gee, snakes give me the<br/>\nwillies, but let&#39;s help you find out more about them from someone who likes<br/>\nthem!&quot;<br/>\n<br/>\n2.) This kid has expressed an interest in something and her mother let her<br/>\nown agenda take precedence over what her kid wants.  And that agenda is full<br/>\nof lies and misinformation which is caused by the panic.  Do snakes bite?<br/>\nSure.  Does it hurt?  You betcha.  Deadly?  Sometime.  But you know what?<br/>\nMore kids are killed on trampolines than by snakes each day.  The leading<br/>\nkiller of children in the US is THEIR PARENTS.  Think about that.<br/>\n<br/>\n3.) It&#39;s important to realize as has been said at this point, this mother<br/>\ndoesn&#39;t have to move her thinking forward, just find someone to help the kid<br/>\ninvestigate her passion.  She shouldn&#39;t be putting fear and misinformation<br/>\nin front of her kid so she can pass on the phobia.  It&#39;s not doing the kid<br/>\nany favors.  Snakes are NOT deadly killers those with phobias make them out<br/>\nto be.  They do a lot of good in the world, even the poisonous ones.  Bug<br/>\nand rodent control without any chemical residue being chief among them.<br/>\nTurning them into hunters of humans is just fear running wild.<br/>\n<br/>\n4.) ANY animal with a mouth can bite.  Including humans and human bites are<br/>\nthe most likely to get seriously infected.  So there is a lot of<br/>\nmisinformation here.  I didn&#39;t have time to word smith this yesterday nor<br/>\nthe patience today (I just had major surgery on Monday) so if it sounds<br/>\nharsh I apologize I&#39;m just trying to respond because I&#39;ve handled snakes for<br/>\ndecades a love them and I just hate to see this girl being thwarted by a<br/>\nmother&#39;s fear rather than the facts.  There are other people who can teach<br/>\nher about snakes safely and she can handle (and I recommend this) captive<br/>\nsnakes not wild ones which are more apt to carry salmonella.  Herpetologists<br/>\nthat will tell her all about them and fill her up with the knowledge she is<br/>\nseeking.  (MAKE SURE ANY REPTILE HANDLING IS FOLLOWED BY A GOOD HAND<br/>\nWASHING!!!!!!!!!!!)<br/>\n<br/>\n<br/>\nKaren<br/>\n&quot;Correlation does not imply causation.&quot;<br/>\n<br/>\n&quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\nnail.&quot; Abraham Maslow<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, May 20, 2010 at 9:22 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; Cut Crystal some slack.<br/>\n&gt;<br/>\n&gt; Support for putting self before children is easy to find. Friends will<br/>\n&gt; give it. Counselors will give it. Lists for mothers will give it.<br/>\n&gt;<br/>\n&gt; Support for mom sucking it up and being a martyr is also findable (but<br/>\n&gt; that&#39;s not what&#39;s offered here, even if sometimes advice gets<br/>\n&gt; interpreted that way.)<br/>\n&gt;<br/>\n&gt; The support is for something else entirely.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: snakes?","postDate":"1274367817","msgId":44247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2owOStxMTR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkwMUU2RTQyLURBMjYtNEJCQS04MUY5LTdGNjVBNDdCQTc3RUB2ZXJpem9uLm5ldD4="},"prevInTopic":44242,"nextInTopic":44248,"prevInTime":44246,"nextInTime":44248,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"http://sandradodd.com/pam/howto 11. Don t pass on your own fears and hates about learning anything. If you hate or fear math, keep it to yourself. Act like it","messageBody":"<div id=\"ygrps-yiv-1530090771\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pam/howto\">http://sandradodd.com/pam/howto</a><br/>\n<br/>\n11. Don&#39;t pass on your own fears and hates about learning anything.<br/>\nIf you hate or fear math, keep it to yourself. Act like it is the most fun thing in the world. Cuddle up and do math in the same way you cuddle up and read together. Play games, make it fun. If you can&#39;t keep your own negativity at bay, at least try to do no harm by staying out of it.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; A central principle of unschooling is helping kids explore their  <br/>\n&gt; interests. <br/>\n. . .The goal is for the child to know the  <br/>\n&gt; parent is one who will help them, not be an obstacle. </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274365333","msgId":44242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwMUU2RTQyLURBMjYtNEJCQS04MUY5LTdGNjVBNDdCQTc3RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44238,"nextInTopic":44247,"prevInTime":44241,"nextInTime":44243,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"... Support for putting self before children is easy to find. Friends will give it. Counselors will give it. Lists for mothers will give it. Support for mom","messageBody":"<div id=\"ygrps-yiv-1246942711\"><blockquote><span title=\"ireply\">&gt; Cut Crystal some slack.<br/>\n<br/>\n </span></blockquote>Support for putting self before children is easy to find. Friends will  <br/>\ngive it. Counselors will give it. Lists for mothers will give it.<br/>\n<br/>\nSupport for mom sucking it up and being a martyr is also findable (but  <br/>\nthat&#39;s not what&#39;s offered here, even if sometimes advice gets  <br/>\ninterpreted that way.)<br/>\n<br/>\nThe support is for something else entirely.<br/>\n<br/>\nNot all suggestions will be useful. You&#39;re right, a phobia isn&#39;t a  <br/>\nsimple fear and not everyone is aware of that. So, as is often stated,  <br/>\ntake what is useful and leave the rest.<br/>\n<br/>\nSpecific suggestions shouldn&#39;t be seen as rules to be followed but as  <br/>\nexamples of what unschooling principles can look like in other  <br/>\nfamilies. What the principles look like in practice depends on  <br/>\npersonalities, interests, needs and so on. The principles, though, are  <br/>\nthe same.<br/>\n<br/>\nA central principle of unschooling is helping kids explore their  <br/>\ninterests. If a mom&#39;s phobia is getting in the way, the answer isn&#39;t  <br/>\nto put the mom&#39;s phobia above the child&#39;s interest. Nor is it for mom  <br/>\nto try to pretend she doesn&#39;t have a phobia. The answer is to find the  <br/>\nways both needs can be met. The goal is for the child to know the  <br/>\nparent is one who will help them, not be an obstacle.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: snakes?","postDate":"1274362110","msgId":44238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5QTY3NThFLTU0REEtNDE0MC05NjcwLTA2NkE2MTU3MTVFREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDMyNjkzNS42NjY1NS5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMyNjkzNS42NjY1NS5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44237,"nextInTopic":44242,"prevInTime":44237,"nextInTime":44239,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"... Get books from the library so she can find what works and doesn t work for her. Take her to the bookstore or a nature center with a good book store and let","messageBody":"<div id=\"ygrps-yiv-1451383516\">On May 20, 2010, at 8:59 AM, crystal rid wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have a couple of field guides that DD uses on a regular basis. I  <br/>\n&gt; have been considering investing in more.<br/>\n<br/>\n </span></blockquote>Get books from the library so she can find what works and doesn&#39;t work  <br/>\nfor her.<br/>\n<br/>\nTake her to the bookstore or a nature center with a good book store  <br/>\nand let her pick so she can find what meets her needs.<br/>\n<br/>\nFind people who know about snakes, people whose &quot;No, don&#39;t touch,&quot; she  <br/>\ncan trust.<br/>\n<br/>\nDraw in as many resources as you can for her to choose from and dabble  <br/>\nin.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154781355,"authorName":"crystal rid","from":"crystal rid &lt;cryway2@...&gt;","profile":"cryway2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: snakes?","postDate":"1274360367","msgId":44237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNjkzNS42NjY1NS5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44236,"nextInTopic":44238,"prevInTime":44236,"nextInTime":44238,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"We have a couple of field guides that DD uses on a regular basis.  I have been considering investing in more.","messageBody":"<div id=\"ygrps-yiv-1888785127\">We have a couple of field guides that DD uses on a regular basis.  I have been considering investing in more.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu May 20th, 2010 7:31 AM CDT Debra Rossing wrote:<br/>\n<br/>\n&gt;We&#39;ve found two kinds of snakes on our property. DH checked out what<br/>\n&gt;kinds they were in our field guides (now there&#39;s a great investment and<br/>\n&gt;use of educator discounts at bookstores!) before getting too close to<br/>\n&gt;them, even though he knew that there are only two poisonous critters in<br/>\n&gt;this area and it wasn&#39;t either of them (very obviously). Thus we know<br/>\n&gt;that one was the typical garter snake and the other was an eastern ring<br/>\n&gt;necked snake (these guys are kinda pretty). Neither of them hazardous to<br/>\n&gt;humans - their fangs aren&#39;t even long enough to get all the way through<br/>\n&gt;the skin of an average human. But, they do LOVE to eat things like<br/>\n&gt;mosquitoes. Once we determined they were not harmful to people, DH<br/>\n&gt;caught them as opportunity arose and let DS see them. Pointed out<br/>\n&gt;coloring, pointed out head shape, and so on. We do go hiking/walking on<br/>\n&gt;local trails so we keep alert for signs of snakes in the area, because<br/>\n&gt;of the potential of hazardous ones. BUT that doesn&#39;t keep us from<br/>\n&gt;hiking.<br/>\n&gt;<br/>\n&gt;We&#39;ve got edible wild plants in and around the yard - as well as some<br/>\n&gt;that aren&#39;t. Again, we get out the field guides and figure out which is<br/>\n&gt;which. If we can&#39;t make a clear ID, we stay clear. For example, we&#39;ve<br/>\n&gt;got Queen Anne&#39;s lace in the back yard. We&#39;ve also got false Queen<br/>\n&gt;Anne&#39;s lace. Queen Anne&#39;s lace is aka wild carrot. The false kind is not<br/>\n&gt;edible. DH sorted out the identifier(s) to tell the difference. We don&#39;t<br/>\n&gt;encourage DS to just go out and munch on stuff in the yard but if<br/>\n&gt;there&#39;s something we do know is okay, we&#39;ll give him enough detail to<br/>\n&gt;sort it out from other things. We&#39;ve got wood sorrel which looks like<br/>\n&gt;clover leaves but is more heart shaped and tastes slightly lemony.<br/>\n&gt;Edible but you don&#39;t want to eat too much of it either. DH has pulled up<br/>\n&gt;some of the wild carrot to let us nibble - a bit astringent, not really<br/>\n&gt;tasty but in a pinch it would suffice. <br/>\n&gt;<br/>\n&gt;Bottom line, we&#39;ve given DS information as appropriate and encouraged<br/>\n&gt;him to come get us if he&#39;s not sure about something.<br/>\n&gt;<br/>\n&gt;(BTW it helps that FIL was a forestry major in college and passed that<br/>\n&gt;love of the outdoors to DH. Whenever we go on more than a known short<br/>\n&gt;hike on a trail or even down to the beach, we always have a backpack<br/>\n&gt;with field guides for the area AND a small first aid kit. DH and I are<br/>\n&gt;both CPR/first aid certified as well.)<br/>\n&gt;<br/>\n&gt;Deb R<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;**********************************************************************<br/>\n&gt;This email and any files transmitted with it are confidential and<br/>\n&gt;intended solely for the use of the individual or entity to whom they<br/>\n&gt;are addressed. If you have received this email in error please notify<br/>\n&gt;the system manager.<br/>\n&gt;<br/>\n&gt;This footnote also confirms that this email message has been swept by<br/>\n&gt;MIMEsweeper for the presence of computer viruses.<br/>\n&gt;<br/>\n&gt;www.mastercam.com<br/>\n&gt;**********************************************************************<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: snakes?","postDate":"1274358717","msgId":44236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRGMjY3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":44235,"nextInTopic":44237,"prevInTime":44235,"nextInTime":44237,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"We ve found two kinds of snakes on our property. DH checked out what kinds they were in our field guides (now there s a great investment and use of educator","messageBody":"<div id=\"ygrps-yiv-347077100\">We&#39;ve found two kinds of snakes on our property. DH checked out what<br/>\nkinds they were in our field guides (now there&#39;s a great investment and<br/>\nuse of educator discounts at bookstores!) before getting too close to<br/>\nthem, even though he knew that there are only two poisonous critters in<br/>\nthis area and it wasn&#39;t either of them (very obviously). Thus we know<br/>\nthat one was the typical garter snake and the other was an eastern ring<br/>\nnecked snake (these guys are kinda pretty). Neither of them hazardous to<br/>\nhumans - their fangs aren&#39;t even long enough to get all the way through<br/>\nthe skin of an average human. But, they do LOVE to eat things like<br/>\nmosquitoes. Once we determined they were not harmful to people, DH<br/>\ncaught them as opportunity arose and let DS see them. Pointed out<br/>\ncoloring, pointed out head shape, and so on. We do go hiking/walking on<br/>\nlocal trails so we keep alert for signs of snakes in the area, because<br/>\nof the potential of hazardous ones. BUT that doesn&#39;t keep us from<br/>\nhiking.<br/>\n<br/>\nWe&#39;ve got edible wild plants in and around the yard - as well as some<br/>\nthat aren&#39;t. Again, we get out the field guides and figure out which is<br/>\nwhich. If we can&#39;t make a clear ID, we stay clear. For example, we&#39;ve<br/>\ngot Queen Anne&#39;s lace in the back yard. We&#39;ve also got false Queen<br/>\nAnne&#39;s lace. Queen Anne&#39;s lace is aka wild carrot. The false kind is not<br/>\nedible. DH sorted out the identifier(s) to tell the difference. We don&#39;t<br/>\nencourage DS to just go out and munch on stuff in the yard but if<br/>\nthere&#39;s something we do know is okay, we&#39;ll give him enough detail to<br/>\nsort it out from other things. We&#39;ve got wood sorrel which looks like<br/>\nclover leaves but is more heart shaped and tastes slightly lemony.<br/>\nEdible but you don&#39;t want to eat too much of it either. DH has pulled up<br/>\nsome of the wild carrot to let us nibble - a bit astringent, not really<br/>\ntasty but in a pinch it would suffice. <br/>\n<br/>\nBottom line, we&#39;ve given DS information as appropriate and encouraged<br/>\nhim to come get us if he&#39;s not sure about something.<br/>\n<br/>\n(BTW it helps that FIL was a forestry major in college and passed that<br/>\nlove of the outdoors to DH. Whenever we go on more than a known short<br/>\nhike on a trail or even down to the beach, we always have a backpack<br/>\nwith field guides for the area AND a small first aid kit. DH and I are<br/>\nboth CPR/first aid certified as well.)<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274357666","msgId":44235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxNEUwRkQ3LTYzNDktNDM4MS05QUNDLUE3NTY4QzNGMTQ1OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44233,"nextInTopic":44236,"prevInTime":44234,"nextInTime":44236,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"... No, it isn t. Phobias often aren t rational and they don t just go away. You shouldn t need to pretend you don t have feelings. But there are ways to share","messageBody":"<div id=\"ygrps-yiv-1978385146\">On May 19, 2010, at 11:15 PM, crystal rid wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My fear of snakes may not be rational but having no fear of them isn  <br/>\n&gt; t either.<br/>\n<br/>\n </span></blockquote>No, it isn&#39;t. Phobias often aren&#39;t rational and they don&#39;t just go  <br/>\naway. You shouldn&#39;t need to pretend you don&#39;t have feelings. But there  <br/>\nare ways to share personal preferences that are relationship building  <br/>\nand ways that tear at relationships. The less you say no and the more  <br/>\nyou say &quot;Let&#39;s figure out how to<br/>\n<br/>\nFor normal fears and dislikes, it helps unschooling to flourish, helps  <br/>\nthe relationships if parents work to set those aside. While it&#39;s not  <br/>\nnecessary to love everything that kids love, if parents find enjoyment  <br/>\nin their kids enjoyment, learn enough to have conversations then  <br/>\nparents and kids will be more connected. Often an enjoyment of their  <br/>\nenjoyment spills over onto the the thing the kids like and the parent  <br/>\ngrows to appreciate it. Not always but the connection is much better  <br/>\nthan the so called &quot;authentic&quot; sharing of feelings.<br/>\n<br/>\nFor phobias you can be her partner by treating your fears as an  <br/>\nobstacle to be worked around and with. Rather than a no, share your  <br/>\nlimitations with her -- make it about you and not about her desires --  <br/>\nand help her find ways to get what she wants around them. State your  <br/>\nlimitations as a fact rather than why something can&#39;t be done. Rather  <br/>\nthan &quot;No, we can&#39;t have snakes in the house,&quot; share that it would make  <br/>\nyou uncomfortable and you&#39;d like to find ways for her to explore  <br/>\nsnakes *and* you be comfortable. That way it becomes a challenge  <br/>\nrather than a limitation. :-)<br/>\n<br/>\nThink in terms of what you can do to help her rather than what you  <br/>\ncan&#39;t do. No one has all the possibilities in the world. Money,  <br/>\nlocation, time, sight will all limit people. But people accomplish  <br/>\nthings not by focusing on their limitations but on what they can do  <br/>\nand alternative paths around the limitations.<br/>\n<br/>\nHere&#39;s something that might help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=Gc4HGQHgeFE&playnext_from=TL&videos=0Fft7Z9jw4U\">http://www.youtube.com/watch?v=Gc4HGQHgeFE&playnext_from=TL&videos=0Fft7Z9jw4U</a><br/>\n<br/>\nThis guy isn&#39;t who he is, hasn&#39;t accomplished what he has because of  <br/>\nhis limitations but because he&#39;s found ways to do what he wants to get  <br/>\naround his limitations.<br/>\n<br/>\nAn unschooling parent&#39;s job is to help kids find ways they *can* do  <br/>\nwhat they want.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/Gc4HGQHgeFE?wmode=opaque","type":"VIDEO"}]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274346598","msgId":44233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NEU3RkRDLUY3MzgtNDIyRC1CNkFFLTY0MkY2QjBCNDFFQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44231,"nextInTopic":44235,"prevInTime":44232,"nextInTime":44234,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"... Your need to impose a healthy fear on her is just creating a barrier between her and what she s curious about. You re saying they re dangerous and she s","messageBody":"<div id=\"ygrps-yiv-2123099618\">On May 19, 2010, at 7:59 PM, crystal rid wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The thing is question says she isn t afraid of them. Fine but she  <br/>\n&gt; should have a healthy respect for them.<br/>\n<br/>\n<br/>\n </span></blockquote>Your need to impose a &quot;healthy&quot; fear on her is just creating a barrier  <br/>\nbetween her and what she&#39;s curious about. You&#39;re saying they&#39;re  <br/>\ndangerous and she&#39;s not competent to handle them. You don&#39;t trust her  <br/>\nbecause she doesn&#39;t have the knowledge and/or fear you think she  <br/>\nneeds. But she&#39;s *also* learning she can&#39;t trust you. She can&#39;t trust  <br/>\nyou to help. She can&#39;t trust your &quot;information&quot; (vague warnings  <br/>\nwrapped in fear). She knows people do handle snakes. There is a way to  <br/>\ndo it and if you won&#39;t help, if you won&#39;t find her someone who can  <br/>\nhelp, she&#39;ll do it on her own because she knows you&#39;ll just interfere.  <br/>\nHer lack of trust in you is *far* more dangerous than snakes.<br/>\n<br/>\nInformation and knowledge is what she needs, not vague fears. There  <br/>\nmay be poisonous snakes but there are *also* far more numerous  <br/>\nnonpoisonous ones. Find out how to identify the safe ones.<br/>\n<br/>\nAs hard as this is, it&#39;s way way easier than the dangers of sex,  <br/>\nalcohol and cars! See this as building a foundation so she trusts you  <br/>\nwant to help her get what she wants in safe and respectful ways.<br/>\n<br/>\n*Trust* that she doesn&#39;t want to get hurt! She *wants* to be safe. But  <br/>\nyour idea of safe is stay away. *Her* idea of safe is a way to explore  <br/>\nthem without getting hurt. Give her what she wants and needs, not what  <br/>\nyou want her to have otherwise she&#39;ll just ignore you and tackle it  <br/>\nherself when she knows you&#39;re not watching.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274327797","msgId":44230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyNERCMjI5LUNCQTgtNEFEOS1CNjdDLUY1Q0UxNTYzMTVEOUBnbWFpbC5jb20+","inReplyToHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44229,"nextInTopic":44231,"prevInTime":44229,"nextInTime":44231,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"I understand irrational fears, phobias, and anxiety in general. I deal with them both. However, I am committed to doing eerything possible to not let them","messageBody":"<div id=\"ygrps-yiv-1482263166\">I understand irrational fears, phobias, and anxiety in general. I deal  <br/>\nwith them both. However, I am committed to doing eerything possible to  <br/>\nnot let them effect my children. I find ways to stretch my comfort  <br/>\nzone as much as possible. I find resources that I can handle for them.  <br/>\nI find others that can help them explore when I feel unable. I  <br/>\nactively work towards NOT passing on my phobias/fears/hang ups/issues.  <br/>\nThe whole giving my children less baggage to carry around thing.<br/>\n<br/>\nKnowing my limitations is not the same as embracing them. I don&#39;t  <br/>\nallow my phobias to take over my life and certainly not my childrens.  <br/>\nWe look for solutions.<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 19, 2010, at 11:15 PM, crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt; wrote:<br/>\n<br/>\n&gt; THANK YOU! My fear of snakes may not be rational but having no fear  <br/>\n&gt; of them isn t either. I have tried real hard to make sure my  <br/>\n&gt; children know to be very cautious around snakes or areas prone to  <br/>\n&gt; snakes while at the same time letting my oldest daughter study them  <br/>\n&gt; from a safe distance. We have already found five in our yard this  <br/>\n&gt; year. I let her study them but made her stay back a ways. I insisted  <br/>\n&gt; my other two look at them enough to know what they look like in case  <br/>\n&gt; they find one. Sure enough my then six year old found one just  <br/>\n&gt; inches from her fingers when digging in the dirt. As of yet none of  <br/>\n&gt; my children are afraid of snakes now bugs are a whole other story: -)<br/>\n&gt;<br/>\n&gt; On Wed May 19th, 2010 9:26 PM CDT Sabrina Boone wrote:<br/>\n&gt;<br/>\n&gt; &gt;Cut Crystal some slack. I have an irrational, paralyzing fear of<br/>\n&gt; &gt;snakes. This includes an aversion to photos of snakes, videos of<br/>\n&gt; &gt;snakes, rubber snakes, even stuffed snakes. My mind realizes it&#39;s<br/>\n&gt; &gt;ridiculous, but whenever any sort of snake image is near, my body  <br/>\n&gt; goes<br/>\n&gt; &gt;into panic mode. That&#39;s just the way it is for some people.<br/>\n&gt; &gt;<br/>\n&gt; &gt;Am I creating a phobia in my children? Heck no. My husband caught a<br/>\n&gt; &gt;little snake in our back yard a few weeks ago. As usual, I didn&#39;t  <br/>\n&gt; need<br/>\n&gt; &gt;to even see the snake, just knowing that it was out there was  <br/>\n&gt; enough to<br/>\n&gt; &gt;cause a full-blown panic in me. Our children, however, were intrigued<br/>\n&gt; &gt;by the little garter snake and kept looking at it in the bucket my<br/>\n&gt; &gt;husband put it in. They even helped their Dad take it away from our<br/>\n&gt; &gt;home to release it.<br/>\n&gt; &gt;<br/>\n&gt; &gt;Your argument that snakes are handled safely every day is valid. You<br/>\n&gt; &gt;neglect to mention there&#39;s an average of 123 reported bites in the US<br/>\n&gt; &gt;alone every single day, with an average of 22 a day being poisonous.<br/>\n&gt; &gt;Again, this is US statistics only.<br/>\n&gt; &gt;<br/>\n&gt; &gt;And the fact is, they can be and are deadly killers. There may only  <br/>\n&gt; be<br/>\n&gt; &gt;5 or 6 deaths a year in the US, but those are people who didn&#39;t  <br/>\n&gt; make it<br/>\n&gt; &gt;to the hospital in time or the victims were very young or elderly and<br/>\n&gt; &gt;suffered more extensive damage from the toxins.<br/>\n&gt; &gt;<br/>\n&gt; &gt;Sure, there&#39;s a place for snakes in the world, or else they would  <br/>\n&gt; not be<br/>\n&gt; &gt;here. Is that place close to me? Absolutely not! If my children want<br/>\n&gt; &gt;to learn more about snakes, it&#39;s a subject my husband can help  <br/>\n&gt; with, or<br/>\n&gt; &gt;they may turn to the internet. If Crystal is uncomfortable with the<br/>\n&gt; &gt;idea of snakes, why can&#39;t she just be uncomfortable without being  <br/>\n&gt; beaten<br/>\n&gt; &gt;up over it?<br/>\n&gt; &gt;<br/>\n&gt; &gt;Just my 2 cents...<br/>\n&gt; &gt;<br/>\n&gt; &gt;Sabrina<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;On 5/19/2010 9:22 PM, Karen Swanay wrote:<br/>\n&gt; &gt;&gt; Try research. You don&#39;t know anything about snakes.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; They DO have bones. And any animal with a mouth can bite.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; No animal inside a cage can bite through the glass. The way you  <br/>\n&gt; are acting<br/>\n&gt; &gt;&gt; about snakes is perfect for breeding a phobia in your child.  <br/>\n&gt; Snakes can and<br/>\n&gt; &gt;&gt; are handled safely every day by a lot of people. But until you  <br/>\n&gt; can stop<br/>\n&gt; &gt;&gt; acting as though they are all deadly killers, you can&#39;t help your  <br/>\n&gt; daughter<br/>\n&gt; &gt;&gt; see them as marvels of nature.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; Karen<br/>\n&gt; &gt;&gt; &quot;Correlation does not imply causation.&quot;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; &quot;If the only tool you have is a hammer, you tend to see every  <br/>\n&gt; problem as a<br/>\n&gt; &gt;&gt; nail.&quot; Abraham Maslow<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; On Wed, May 19, 2010 at 6:59 PM, crystal rid&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt;  <br/>\n&gt; wrote:<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt; OK, so here s my first step out of my comfort zone to allow my  <br/>\n&gt; daughter to<br/>\n&gt; &gt;&gt;&gt; explore her interests. My 11 year old finds snakes fascinating.  <br/>\n&gt; She is<br/>\n&gt; &gt;&gt;&gt; amazed that something with no bones can move in such ways.  <br/>\n&gt; Always before I<br/>\n&gt; &gt;&gt;&gt; ve told her to stay away from them. She knows we have poisonous  <br/>\n&gt; snakes here.<br/>\n&gt; &gt;&gt;&gt; I do let my sister take her in the snake house at the zoo and  <br/>\n&gt; wildlife<br/>\n&gt; &gt;&gt;&gt; refuge. I would prefer she give even caged snakes a wide birth.  <br/>\n&gt; However I<br/>\n&gt; &gt;&gt;&gt; can considering let her explore her interest in more depth if  <br/>\n&gt; she wants. The<br/>\n&gt; &gt;&gt;&gt; thing is question says she isn t afraid of them. Fine but she  <br/>\n&gt; should have a<br/>\n&gt; &gt;&gt;&gt; healthy respect for them. I tried explcining it to her by  <br/>\n&gt; telling her I m<br/>\n&gt; &gt;&gt;&gt; not afraid of cars but I know they could kill me so I m not  <br/>\n&gt; going to go out<br/>\n&gt; &gt;&gt;&gt; in get in front of a moving vehicle. I explained snakes are the  <br/>\n&gt; same way.<br/>\n&gt; &gt;&gt;&gt; Some can kill you most can bite. You dont have to be afraid of  <br/>\n&gt; them but you<br/>\n&gt; &gt;&gt;&gt; should be cautious and stay well away from one unless you<br/>\n&gt; &gt;&gt;&gt; know for certain it isn t poisonous. Here s my delema how do I  <br/>\n&gt; let her<br/>\n&gt; &gt;&gt;&gt; explore her interest and still stay comfortable with it myself.  <br/>\n&gt; Seeing her<br/>\n&gt; &gt;&gt;&gt; hand go to the glass in front of a snakes head makes me want to  <br/>\n&gt; pull her<br/>\n&gt; &gt;&gt;&gt; away from the cage. I know it can t hurt her but I just prefer  <br/>\n&gt; she stay far<br/>\n&gt; &gt;&gt;&gt; away from them.<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; ------------------------------------<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; Yahoo! Groups Links<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154781355,"authorName":"crystal rid","from":"crystal rid &lt;cryway2@...&gt;","profile":"cryway2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274327085","msgId":44229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3ODQ5Ni41NjcwNS5xbUB3ZWIxMTMzMTgubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44227,"nextInTopic":44230,"prevInTime":44228,"nextInTime":44230,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"That would definatly be way to far out of my comfort zone.","messageBody":"<div id=\"ygrps-yiv-871864385\">That would definatly be way to far out of my comfort zone.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed May 19th, 2010 8:31 PM CDT Elizabeth Simon wrote:<br/>\n<br/>\n&gt;It could be a great family learning experience.<br/>\n&gt;First researching, learning, exploring and deciding if the family wants <br/>\n&gt;to include<br/>\n&gt;one in the household and then the creation of a habitat based on the <br/>\n&gt;type of<br/>\n&gt;snake that would work best for your family.<br/>\n&gt;Thank you<br/>\n&gt;Elizabeth<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Karen Swanay wrote:<br/>\n&gt;&gt; Try research.  You don&#39;t know anything about snakes.<br/>\n&gt;&gt; <br/>\n&gt;&gt; They DO have bones.  And any animal with a mouth can bite.<br/>\n&gt;&gt; <br/>\n&gt;&gt; No animal inside a cage can bite through the glass.  The way you are acting<br/>\n&gt;&gt; about snakes is perfect for breeding a phobia in your child.  Snakes can and<br/>\n&gt;&gt; are handled safely every day by a lot of people.  But until you can stop<br/>\n&gt;&gt; acting as though they are all deadly killers, you can&#39;t help your daughter<br/>\n&gt;&gt; see them as marvels of nature.<br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; Karen<br/>\n&gt;&gt; &quot;Correlation does not imply causation.&quot;<br/>\n&gt;&gt; <br/>\n&gt;&gt; &quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\n&gt;&gt; nail.&quot; Abraham Maslow<br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; On Wed, May 19, 2010 at 6:59 PM, crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt; wrote:<br/>\n&gt;&gt; <br/>\n&gt;&gt;&gt;<br/>\n&gt;&gt;&gt; OK, so here s my first step out of my comfort zone to allow my daughter to<br/>\n&gt;&gt;&gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt;&gt;&gt; amazed that something with no bones can move in such ways. Always before I<br/>\n&gt;&gt;&gt; ve told her to stay away from them. She knows we have poisonous snakes here.<br/>\n&gt;&gt;&gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt;&gt;&gt; refuge. I would prefer she give even caged snakes a wide birth. However I<br/>\n&gt;&gt;&gt; can considering let her explore her interest in more depth if she wants. The<br/>\n&gt;&gt;&gt; thing is question says she isn t afraid of them. Fine but she should have a<br/>\n&gt;&gt;&gt; healthy respect for them. I tried explcining it to her by telling her I m<br/>\n&gt;&gt;&gt; not afraid of cars but I know they could kill me so I m not going to go out<br/>\n&gt;&gt;&gt; in get in front of a moving vehicle. I explained snakes are the same way.<br/>\n&gt;&gt;&gt; Some can kill you most can bite. You dont have to be afraid of them but you<br/>\n&gt;&gt;&gt; should be cautious and stay well away from one unless you<br/>\n&gt;&gt;&gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt;&gt;&gt; explore her interest and still stay comfortable with it myself. Seeing her<br/>\n&gt;&gt;&gt; hand go to the glass in front of a snakes head makes me want to pull her<br/>\n&gt;&gt;&gt; away from the cage. I know it can t hurt her but I just prefer she stay far<br/>\n&gt;&gt;&gt; away from them.<br/>\n&gt;&gt;&gt;<br/>\n&gt;&gt;&gt;  <br/>\n&gt;&gt;&gt;<br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; ------------------------------------<br/>\n&gt;&gt; <br/>\n&gt;&gt; Yahoo! Groups Links<br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":411185478,"authorName":"Karen","from":"Karen &lt;karen@...&gt;","profile":"karenmomp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274326996","msgId":44231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluaWZZbkJMMG51UXNMV2xPUlhKMDVwbTJNcnEyTjRtZ1JTZDBwLUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44230,"nextInTopic":44233,"prevInTime":44230,"nextInTime":44232,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Crystal, The first thing I would suggest would be to find out what venomous snakes actually live in your area and research their habits and habitats. Then I d","messageBody":"<div id=\"ygrps-yiv-1535310857\">Crystal,<br/>\n<br/>\nThe first thing I would suggest would be to find out what venomous snakes<br/>\nactually live in your area and research their habits and habitats.<br/>\n<br/>\nThen I&#39;d find out what other snakes live in your area.  Figure out which<br/>\nones look nothing like the venomous ones and which ones might be confused.<br/>\nFigure out which ones are more &quot;bitey&quot; than others.  This knowledge would<br/>\ngive your daughter the ability to be safe.<br/>\n<br/>\nIn our area of NC, the only venomous snakes are Copperheads and they&#39;re<br/>\npretty easy to distinguish from the non-venomous black rat/racer snakes,<br/>\ngarter snakes, etc that live here.  My boys love snakes and since they&#39;re<br/>\naware of what the &quot;dangerous&quot; ones are they can avoid catching those.<br/>\nThey&#39;ve found one that looked similar and avoided it, until we were able to<br/>\ncheck into it and see that it was OK.<br/>\n<br/>\nAlso note that non-venomous snakes can bite, but they&#39;re not really<br/>\ndangerous to be bitten by-- it might hurt, bleed like a cut or small<br/>\npuncture wound (which it is), but a little neosporin and band-aid will fix<br/>\nit.  (They&#39;re not mammals, so you don&#39;t have to worry about rabies which<br/>\nwouldn&#39;t be the case if it was a dog, mouse, etc.)  My sons have been bitten<br/>\nmany times by non-venomous snakes, but with experience they&#39;ve learned how<br/>\nto reduce the chance of being bitten.<br/>\n<br/>\nGood luck!<br/>\nKaren<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, May 19, 2010 at 11:15 PM, crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; THANK YOU! My fear of snakes may not be rational but having no fear of them<br/>\n&gt; isn t either. I have tried real hard to make sure my children know to be<br/>\n&gt; very cautious around snakes or areas prone to snakes while at the same time<br/>\n&gt; letting my oldest daughter study them from a safe distance. We have already<br/>\n&gt; found five in our yard this year. I let her study them but made her stay<br/>\n&gt; back a ways. I insisted my other two look at them enough to know what they<br/>\n&gt; look like in case they find one. Sure enough my then six year old found one<br/>\n&gt; just inches from her fingers when digging in the dirt. As of yet none of my<br/>\n&gt; children are afraid of snakes now bugs are a whole other story: -)<br/>\n&gt;<br/>\n&gt; On Wed May 19th, 2010 9:26 PM CDT Sabrina Boone wrote:<br/>\n&gt;<br/>\n&gt; &gt;Cut Crystal some slack. I have an irrational, paralyzing fear of<br/>\n&gt; &gt;snakes. This includes an aversion to photos of snakes, videos of<br/>\n&gt; &gt;snakes, rubber snakes, even stuffed snakes. My mind realizes it&#39;s<br/>\n&gt; &gt;ridiculous, but whenever any sort of snake image is near, my body goes<br/>\n&gt; &gt;into panic mode. That&#39;s just the way it is for some people.<br/>\n&gt; &gt;<br/>\n&gt; &gt;Am I creating a phobia in my children? Heck no. My husband caught a<br/>\n&gt; &gt;little snake in our back yard a few weeks ago. As usual, I didn&#39;t need<br/>\n&gt; &gt;to even see the snake, just knowing that it was out there was enough to<br/>\n&gt; &gt;cause a full-blown panic in me. Our children, however, were intrigued<br/>\n&gt; &gt;by the little garter snake and kept looking at it in the bucket my<br/>\n&gt; &gt;husband put it in. They even helped their Dad take it away from our<br/>\n&gt; &gt;home to release it.<br/>\n&gt; &gt;<br/>\n&gt; &gt;Your argument that snakes are handled safely every day is valid. You<br/>\n&gt; &gt;neglect to mention there&#39;s an average of 123 reported bites in the US<br/>\n&gt; &gt;alone every single day, with an average of 22 a day being poisonous.<br/>\n&gt; &gt;Again, this is US statistics only.<br/>\n&gt; &gt;<br/>\n&gt; &gt;And the fact is, they can be and are deadly killers. There may only be<br/>\n&gt; &gt;5 or 6 deaths a year in the US, but those are people who didn&#39;t make it<br/>\n&gt; &gt;to the hospital in time or the victims were very young or elderly and<br/>\n&gt; &gt;suffered more extensive damage from the toxins.<br/>\n&gt; &gt;<br/>\n&gt; &gt;Sure, there&#39;s a place for snakes in the world, or else they would not be<br/>\n&gt; &gt;here. Is that place close to me? Absolutely not! If my children want<br/>\n&gt; &gt;to learn more about snakes, it&#39;s a subject my husband can help with, or<br/>\n&gt; &gt;they may turn to the internet. If Crystal is uncomfortable with the<br/>\n&gt; &gt;idea of snakes, why can&#39;t she just be uncomfortable without being beaten<br/>\n&gt; &gt;up over it?<br/>\n&gt; &gt;<br/>\n&gt; &gt;Just my 2 cents...<br/>\n&gt; &gt;<br/>\n&gt; &gt;Sabrina<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;On 5/19/2010 9:22 PM, Karen Swanay wrote:<br/>\n&gt; &gt;&gt; Try research. You don&#39;t know anything about snakes.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; They DO have bones. And any animal with a mouth can bite.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; No animal inside a cage can bite through the glass. The way you are<br/>\n&gt; acting<br/>\n&gt; &gt;&gt; about snakes is perfect for breeding a phobia in your child. Snakes can<br/>\n&gt; and<br/>\n&gt; &gt;&gt; are handled safely every day by a lot of people. But until you can stop<br/>\n&gt; &gt;&gt; acting as though they are all deadly killers, you can&#39;t help your<br/>\n&gt; daughter<br/>\n&gt; &gt;&gt; see them as marvels of nature.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; Karen<br/>\n&gt; &gt;&gt; &quot;Correlation does not imply causation.&quot;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; &quot;If the only tool you have is a hammer, you tend to see every problem as<br/>\n&gt; a<br/>\n&gt; &gt;&gt; nail.&quot; Abraham Maslow<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; On Wed, May 19, 2010 at 6:59 PM, crystal rid&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&lt;cryway2%40yahoo.com&gt;&gt;<br/>\n&gt; wrote:<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt; OK, so here s my first step out of my comfort zone to allow my daughter<br/>\n&gt; to<br/>\n&gt; &gt;&gt;&gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt; &gt;&gt;&gt; amazed that something with no bones can move in such ways. Always<br/>\n&gt; before I<br/>\n&gt; &gt;&gt;&gt; ve told her to stay away from them. She knows we have poisonous snakes<br/>\n&gt; here.<br/>\n&gt; &gt;&gt;&gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt; &gt;&gt;&gt; refuge. I would prefer she give even caged snakes a wide birth. However<br/>\n&gt; I<br/>\n&gt; &gt;&gt;&gt; can considering let her explore her interest in more depth if she<br/>\n&gt; wants. The<br/>\n&gt; &gt;&gt;&gt; thing is question says she isn t afraid of them. Fine but she should<br/>\n&gt; have a<br/>\n&gt; &gt;&gt;&gt; healthy respect for them. I tried explcining it to her by telling her I<br/>\n&gt; m<br/>\n&gt; &gt;&gt;&gt; not afraid of cars but I know they could kill me so I m not going to go<br/>\n&gt; out<br/>\n&gt; &gt;&gt;&gt; in get in front of a moving vehicle. I explained snakes are the same<br/>\n&gt; way.<br/>\n&gt; &gt;&gt;&gt; Some can kill you most can bite. You dont have to be afraid of them but<br/>\n&gt; you<br/>\n&gt; &gt;&gt;&gt; should be cautious and stay well away from one unless you<br/>\n&gt; &gt;&gt;&gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt; &gt;&gt;&gt; explore her interest and still stay comfortable with it myself. Seeing<br/>\n&gt; her<br/>\n&gt; &gt;&gt;&gt; hand go to the glass in front of a snakes head makes me want to pull<br/>\n&gt; her<br/>\n&gt; &gt;&gt;&gt; away from the cage. I know it can t hurt her but I just prefer she stay<br/>\n&gt; far<br/>\n&gt; &gt;&gt;&gt; away from them.<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; ------------------------------------<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; Yahoo! Groups Links<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274325607","msgId":44227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MjkzOS41MzcyOC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44226,"nextInTopic":44229,"prevInTime":44226,"nextInTime":44228,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Find ways to support her interrest in snakes, get videos, book, visit zoo, find snake breeders, snake sellingpet stores. Does she want to go out in the","messageBody":"<div id=\"ygrps-yiv-447500298\">Find ways to support her interrest in snakes, get videos, book, visit zoo, find snake breeders, snake sellingpet stores.<br/>\nDoes she want to go out in the woods and try to find snakes?If that iswhat she wants a camera, the right gear ( boots),<br/>\nbinoculars, etc so she can find snakes and take a picture of them and try to find out what kind of snake they are.<br/>\nNo touching involved.<br/>\nWhy is that you think that support her on her interrestin snakes means she is going ot go out and try to touch them?<br/>\nThere are many other ways to support her that does not involve risks until she (if she ever) is ready to handle wild snakes.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154781355,"authorName":"crystal rid","from":"crystal rid &lt;cryway2@...&gt;","profile":"cryway2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274325320","msgId":44226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MDcxOC44NTE5MC5xbUB3ZWIxMTMzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44225,"nextInTopic":44227,"prevInTime":44225,"nextInTime":44227,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"THANK YOU!  My fear of snakes may not be rational but having no fear of them isn t either.  I have tried real hard to make sure my children know to be very","messageBody":"<div id=\"ygrps-yiv-1529152562\">THANK YOU!  My fear of snakes may not be rational but having no fear of them isn t either.  I have tried real hard to make sure my children know to be very cautious around snakes or areas prone to snakes while at the same time letting my oldest daughter study them from a safe distance.  We have already found five in our yard this year.  I let her study them but made her stay back a ways.  I insisted my other two look at them enough to know what they look like in case they find one.  Sure enough my then six year old found one just inches from her fingers when digging in the dirt.  As of yet none of my children are afraid of snakes now bugs are a whole other story: -)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed May 19th, 2010 9:26 PM CDT Sabrina Boone wrote:<br/>\n<br/>\n&gt;Cut Crystal some slack.  I have an irrational, paralyzing fear of <br/>\n&gt;snakes.  This includes an aversion to photos of snakes, videos of <br/>\n&gt;snakes, rubber snakes, even stuffed snakes.  My mind realizes it&#39;s <br/>\n&gt;ridiculous, but whenever any sort of snake image is near, my body goes <br/>\n&gt;into panic mode.  That&#39;s just the way it is for some people.<br/>\n&gt;<br/>\n&gt;Am I creating a phobia in my children?  Heck no.  My husband caught a <br/>\n&gt;little snake in our back yard a few weeks ago.  As usual, I didn&#39;t need <br/>\n&gt;to even see the snake, just knowing that it was out there was enough to <br/>\n&gt;cause a full-blown panic in me.  Our children, however, were intrigued <br/>\n&gt;by the little garter snake and kept looking at it in the bucket my <br/>\n&gt;husband put it in.  They even helped their Dad take it away from our <br/>\n&gt;home to release it.<br/>\n&gt;<br/>\n&gt;Your argument that snakes are handled safely every day is valid.  You <br/>\n&gt;neglect to mention there&#39;s an average of 123 reported bites in the US <br/>\n&gt;alone every single day, with an average of 22 a day being poisonous.  <br/>\n&gt;Again, this is US statistics only.<br/>\n&gt;<br/>\n&gt;And the fact is, they can be and are deadly killers.  There may only be <br/>\n&gt;5 or 6 deaths a year in the US, but those are people who didn&#39;t make it <br/>\n&gt;to the hospital in time or the victims were very young or elderly and <br/>\n&gt;suffered more extensive damage from the toxins.<br/>\n&gt;<br/>\n&gt;Sure, there&#39;s a place for snakes in the world, or else they would not be <br/>\n&gt;here.  Is that place close to me?  Absolutely not!  If my children want <br/>\n&gt;to learn more about snakes, it&#39;s a subject my husband can help with, or <br/>\n&gt;they may turn to the internet.  If Crystal is uncomfortable with the <br/>\n&gt;idea of snakes, why can&#39;t she just be uncomfortable without being beaten <br/>\n&gt;up over it?<br/>\n&gt;<br/>\n&gt;Just my 2 cents...<br/>\n&gt;<br/>\n&gt;Sabrina<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;On 5/19/2010 9:22 PM, Karen Swanay wrote:<br/>\n&gt;&gt; Try research.  You don&#39;t know anything about snakes.<br/>\n&gt;&gt;<br/>\n&gt;&gt; They DO have bones.  And any animal with a mouth can bite.<br/>\n&gt;&gt;<br/>\n&gt;&gt; No animal inside a cage can bite through the glass.  The way you are acting<br/>\n&gt;&gt; about snakes is perfect for breeding a phobia in your child.  Snakes can and<br/>\n&gt;&gt; are handled safely every day by a lot of people.  But until you can stop<br/>\n&gt;&gt; acting as though they are all deadly killers, you can&#39;t help your daughter<br/>\n&gt;&gt; see them as marvels of nature.<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; Karen<br/>\n&gt;&gt; &quot;Correlation does not imply causation.&quot;<br/>\n&gt;&gt;<br/>\n&gt;&gt; &quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\n&gt;&gt; nail.&quot; Abraham Maslow<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; On Wed, May 19, 2010 at 6:59 PM, crystal rid&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt;  wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt;    <br/>\n&gt;&gt;&gt;<br/>\n&gt;&gt;&gt; OK, so here s my first step out of my comfort zone to allow my daughter to<br/>\n&gt;&gt;&gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt;&gt;&gt; amazed that something with no bones can move in such ways. Always before I<br/>\n&gt;&gt;&gt; ve told her to stay away from them. She knows we have poisonous snakes here.<br/>\n&gt;&gt;&gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt;&gt;&gt; refuge. I would prefer she give even caged snakes a wide birth. However I<br/>\n&gt;&gt;&gt; can considering let her explore her interest in more depth if she wants. The<br/>\n&gt;&gt;&gt; thing is question says she isn t afraid of them. Fine but she should have a<br/>\n&gt;&gt;&gt; healthy respect for them. I tried explcining it to her by telling her I m<br/>\n&gt;&gt;&gt; not afraid of cars but I know they could kill me so I m not going to go out<br/>\n&gt;&gt;&gt; in get in front of a moving vehicle. I explained snakes are the same way.<br/>\n&gt;&gt;&gt; Some can kill you most can bite. You dont have to be afraid of them but you<br/>\n&gt;&gt;&gt; should be cautious and stay well away from one unless you<br/>\n&gt;&gt;&gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt;&gt;&gt; explore her interest and still stay comfortable with it myself. Seeing her<br/>\n&gt;&gt;&gt; hand go to the glass in front of a snakes head makes me want to pull her<br/>\n&gt;&gt;&gt; away from the cage. I know it can t hurt her but I just prefer she stay far<br/>\n&gt;&gt;&gt; away from them.<br/>\n&gt;&gt;&gt;<br/>\n&gt;&gt;&gt;<br/>\n&gt;&gt;&gt;<br/>\n&gt;&gt;&gt;      <br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; ------------------------------------<br/>\n&gt;&gt;<br/>\n&gt;&gt; Yahoo! Groups Links<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: snakes?","postDate":"1274324662","msgId":44225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0MjhybStnOWMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCRjQ5REQ1LjkwNzA4MDdAZ21haWwuY29tPg=="},"prevInTopic":44224,"nextInTopic":44226,"prevInTime":44224,"nextInTime":44226,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Nobody is being beaten up. And a great deal of slack already has been cut. ... .. .If Crystal is uncomfortable with the","messageBody":"<div id=\"ygrps-yiv-56611688\">Nobody is being beaten up. And a great deal of slack already has been cut.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Sabrina Boone &lt;sboone622@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Cut Crystal some slack.  I have an irrational, paralyzing fear of <br/>\n&gt; snakes.   <br/>\n<br/>\n.. .If Crystal is uncomfortable with the <br/>\n&gt; idea of snakes, why can&#39;t she just be uncomfortable without being beaten <br/>\n&gt; up over it?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":228546675,"authorName":"Deena Seckinger","from":"Deena Seckinger &lt;seckingerfamily@...&gt;","profile":"seckingerfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274323691","msgId":44224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NjA3MS42OTk2NC5xbUB3ZWIzODQwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44223,"nextInTopic":44225,"prevInTime":44223,"nextInTime":44225,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"I m not one to jump in on these lists very often, but I LOVE that your daughter is interested in snakes and that you re *trying* to find a way of being","messageBody":"<div id=\"ygrps-yiv-1237168035\">I&#39;m not one to jump in on these lists very often, but I LOVE that your daughter is interested in snakes and that you&#39;re *trying* to find a way of being comfortable with that. However, what I&#39;m hearing you talk about isn&#39;t really snakes as much as it is fear. It&#39;s understandable to not want your child to get hurt and often times we discuss wonderful, happy, positive ways our children learn. It can be a hinderance to not also acknowledge how much we learn from negative experiences, too.<br/>\nWhen your child was learning to walk did you bubble wrap her and not ever let her fall? If she fell, did she get hurt? Did she learn about the dangers of walking and the risks involved with walking? YES!<br/>\nHave you or your child ever been burned at the stove or by hot water? I bet you learned from that, too. Does it mean you never touch water again because it might be hot enough to burn you?<br/>\nYou mention having a healthy respect for cars and snakes, but you don&#39;t talk about a healthy respect, you talk about fear and abject avoidance. If this were occurring in my house, I&#39;d have two choices (maybe more)...learn about which snakes we have access to and whether they&#39;re poisonous and whether that poison is fatal OR trust that my child (having been raised to understand that there ARE dangers in life and we must learn to mitigate and navigate through life despite those dangers) will seek out that information FIRST before holding every available species. I might even go the extra mile and strew some books, movies, websites regarding them. I might, if I had fear, also take the opportunity to discuss Steve Irwin (did I get the name right?) and that he died doing what he loved AND knowing the dangers. However, I can almost guarantee that there would be at least one conversation that goes something like: &quot;I&#39;m curious about you and how you can<br/>\n be so fearless when I&#39;m terrified of snakes. You are an amazing young woman and I learn more from you everyday. I don&#39;t want to stop you from following your joy, but I AM scared when it comes to snakes. Who knows, maybe I&#39;ll learn a bit of your bravery and you&#39;ll learn a bit of my caution and one day we can meet in the middle on this whole snake thing. Until then, I&#39;m glad that you have (person X) to share it with. I know you&#39;re growing up and that probably frightens me a little, too. I love you. Now why don&#39;t I make &quot;Snakes on a Plate&quot; (spaghetti) to celebrate your passion?&quot;<br/>\nTwo questions I keep asking myself when my kids illicit fear in me:1) So what if they get hurt? (Again, not that I want them abused, but getting hurt is NOT the end of the world and it&#39;s not always desirable to avoid it.)2) If I don&#39;t let my children LIVE, then does it matter how safe they are? Is it any kind of life to be SAFE all the time and miss out on riding your bike because you might skin your knee?<br/>\nProbably more than two cents, but I&#39;m not known for being succinct.<br/>\nJoyfully,Deena in Georgia (USA)<br/>\nP.S. My husband won&#39;t let me get a snake as a pet. Pythons can be tempermental about their diet and have been known to starve themselves to death. He doesn&#39;t want me to get sad if we get a moody one, so it&#39;s on my Bucket List.<br/>\n<br/>\n<br/>\n<br/>\nKnowledge which is acquired under compulsion obtains no hold on the mind.<br/>\n<br/>\n~ Plato (427 BC-347 BC)<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: snakes?","postDate":"1274322468","msgId":44220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0MjZuNCs1cmFrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlsazNIUzYxWVJNUWpzVnlNWHp4RExMWmpZRTNUNnI0UmM0Q2VzUEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44219,"nextInTopic":44221,"prevInTime":44219,"nextInTime":44221,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Or come at it a different way, as not really about snakes at all (yet). Same with computers and phonics, with exposure to beliefs you don t approve of, seeking","messageBody":"<div id=\"ygrps-yiv-113521111\">Or come at it a different way, as not really about snakes at all (yet). Same with computers and phonics, with exposure to beliefs you don&#39;t approve of, seeking an itemized shopping list of educational materials, etc.  <br/>\n<br/>\nYou could help yourself and your kids explore reading and snakes and computers and religion and a thousand things, learn a lot about anything and everything, if you can stop focusing on the specifics of each situation on an endless list of problems and issues.  Unschooling is no list of rules and recipes that can be collected for every situation.<br/>\n<br/>\nA CS Lewis quote comes to mind, I forget which book. He said if you tried to explain heaven (or sex) to a child, the child wouldn&#39;t think it sounded very nice without chocolate. There would be no way to &quot;explain&quot; until the child became developed enough and experienced enough, by which time you wouldn&#39;t need to explain anyway.  :)<br/>\n<br/>\nA conventional parent may need more development and experience  before she can conceive of how unschooling can be heavenly without  controls and rules and restrictions.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Karen Swanay &lt;luvbullbreeds@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Try research.  You don&#39;t know anything about snakes.<br/>\n&gt; <br/>\n&gt; They DO have bones.  And any animal with a mouth can bite.<br/>\n&gt; <br/>\n&gt; No animal inside a cage can bite through the glass.  The way you are acting<br/>\n&gt; about snakes is perfect for breeding a phobia in your child.  Snakes can and<br/>\n&gt; are handled safely every day by a lot of people.  But until you can stop<br/>\n&gt; acting as though they are all deadly killers, you can&#39;t help your daughter<br/>\n&gt; see them as marvels of nature.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Karen<br/>\n&gt; &quot;Correlation does not imply causation.&quot;<br/>\n&gt; <br/>\n&gt; &quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\n&gt; nail.&quot; Abraham Maslow<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Wed, May 19, 2010 at 6:59 PM, crystal rid &lt;cryway2@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; OK, so here s my first step out of my comfort zone to allow my daughter to<br/>\n&gt; &gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt; &gt; amazed that something with no bones can move in such ways. Always before I<br/>\n&gt; &gt; ve told her to stay away from them. She knows we have poisonous snakes here.<br/>\n&gt; &gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt; &gt; refuge. I would prefer she give even caged snakes a wide birth. However I<br/>\n&gt; &gt; can considering let her explore her interest in more depth if she wants. The<br/>\n&gt; &gt; thing is question says she isn t afraid of them. Fine but she should have a<br/>\n&gt; &gt; healthy respect for them. I tried explcining it to her by telling her I m<br/>\n&gt; &gt; not afraid of cars but I know they could kill me so I m not going to go out<br/>\n&gt; &gt; in get in front of a moving vehicle. I explained snakes are the same way.<br/>\n&gt; &gt; Some can kill you most can bite. You dont have to be afraid of them but you<br/>\n&gt; &gt; should be cautious and stay well away from one unless you<br/>\n&gt; &gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt; &gt; explore her interest and still stay comfortable with it myself. Seeing her<br/>\n&gt; &gt; hand go to the glass in front of a snakes head makes me want to pull her<br/>\n&gt; &gt; away from the cage. I know it can t hurt her but I just prefer she stay far<br/>\n&gt; &gt; away from them.<br/>\n&gt; &gt;<br/>\n&gt; &gt;  <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":407171935,"authorName":"Sabrina Boone","from":"Sabrina Boone &lt;sboone622@...&gt;","profile":"sboone622","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274322389","msgId":44223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRjQ5REQ1LjkwNzA4MDdAZ21haWwuY29tPg==","inReplyToHeader":"PEFBTkxrVGlsazNIUzYxWVJNUWpzVnlNWHp4RExMWmpZRTNUNnI0UmM0Q2VzUEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPiA8QUFOTGtUaWxrM0hTNjFZUk1RanNWeU1YenhETExaallFM1Q2cjRSYzRDZXNQQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":44222,"nextInTopic":44224,"prevInTime":44222,"nextInTime":44224,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Cut Crystal some slack.  I have an irrational, paralyzing fear of snakes.  This includes an aversion to photos of snakes, videos of snakes, rubber snakes, even","messageBody":"<div id=\"ygrps-yiv-101155855\">Cut Crystal some slack.  I have an irrational, paralyzing fear of <br/>\nsnakes.  This includes an aversion to photos of snakes, videos of <br/>\nsnakes, rubber snakes, even stuffed snakes.  My mind realizes it&#39;s <br/>\nridiculous, but whenever any sort of snake image is near, my body goes <br/>\ninto panic mode.  That&#39;s just the way it is for some people.<br/>\n<br/>\nAm I creating a phobia in my children?  Heck no.  My husband caught a <br/>\nlittle snake in our back yard a few weeks ago.  As usual, I didn&#39;t need <br/>\nto even see the snake, just knowing that it was out there was enough to <br/>\ncause a full-blown panic in me.  Our children, however, were intrigued <br/>\nby the little garter snake and kept looking at it in the bucket my <br/>\nhusband put it in.  They even helped their Dad take it away from our <br/>\nhome to release it.<br/>\n<br/>\nYour argument that snakes are handled safely every day is valid.  You <br/>\nneglect to mention there&#39;s an average of 123 reported bites in the US <br/>\nalone every single day, with an average of 22 a day being poisonous.  <br/>\nAgain, this is US statistics only.<br/>\n<br/>\nAnd the fact is, they can be and are deadly killers.  There may only be <br/>\n5 or 6 deaths a year in the US, but those are people who didn&#39;t make it <br/>\nto the hospital in time or the victims were very young or elderly and <br/>\nsuffered more extensive damage from the toxins.<br/>\n<br/>\nSure, there&#39;s a place for snakes in the world, or else they would not be <br/>\nhere.  Is that place close to me?  Absolutely not!  If my children want <br/>\nto learn more about snakes, it&#39;s a subject my husband can help with, or <br/>\nthey may turn to the internet.  If Crystal is uncomfortable with the <br/>\nidea of snakes, why can&#39;t she just be uncomfortable without being beaten <br/>\nup over it?<br/>\n<br/>\nJust my 2 cents...<br/>\n<br/>\nSabrina<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 5/19/2010 9:22 PM, Karen Swanay wrote:<br/>\n&gt; Try research.  You don&#39;t know anything about snakes.<br/>\n&gt;<br/>\n&gt; They DO have bones.  And any animal with a mouth can bite.<br/>\n&gt;<br/>\n&gt; No animal inside a cage can bite through the glass.  The way you are acting<br/>\n&gt; about snakes is perfect for breeding a phobia in your child.  Snakes can and<br/>\n&gt; are handled safely every day by a lot of people.  But until you can stop<br/>\n&gt; acting as though they are all deadly killers, you can&#39;t help your daughter<br/>\n&gt; see them as marvels of nature.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt; &quot;Correlation does not imply causation.&quot;<br/>\n&gt;<br/>\n&gt; &quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\n&gt; nail.&quot; Abraham Maslow<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Wed, May 19, 2010 at 6:59 PM, crystal rid&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt;  wrote:<br/>\n&gt;<br/>\n&gt;    <br/>\n&gt;&gt;<br/>\n&gt;&gt; OK, so here s my first step out of my comfort zone to allow my daughter to<br/>\n&gt;&gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt;&gt; amazed that something with no bones can move in such ways. Always before I<br/>\n&gt;&gt; ve told her to stay away from them. She knows we have poisonous snakes here.<br/>\n&gt;&gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt;&gt; refuge. I would prefer she give even caged snakes a wide birth. However I<br/>\n&gt;&gt; can considering let her explore her interest in more depth if she wants. The<br/>\n&gt;&gt; thing is question says she isn t afraid of them. Fine but she should have a<br/>\n&gt;&gt; healthy respect for them. I tried explcining it to her by telling her I m<br/>\n&gt;&gt; not afraid of cars but I know they could kill me so I m not going to go out<br/>\n&gt;&gt; in get in front of a moving vehicle. I explained snakes are the same way.<br/>\n&gt;&gt; Some can kill you most can bite. You dont have to be afraid of them but you<br/>\n&gt;&gt; should be cautious and stay well away from one unless you<br/>\n&gt;&gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt;&gt; explore her interest and still stay comfortable with it myself. Seeing her<br/>\n&gt;&gt; hand go to the glass in front of a snakes head makes me want to pull her<br/>\n&gt;&gt; away from the cage. I know it can t hurt her but I just prefer she stay far<br/>\n&gt;&gt; away from them.<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;      <br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274321465","msgId":44219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyRDEzQjAwQkVCNzQzMTk4RjlGMEFBQUJDQzAzQTE0QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44218,"nextInTopic":44220,"prevInTime":44218,"nextInTime":44220,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"***My 11 year old finds snakes fascinating. She is amazed that something with no bones can move in such ways.*** Hey, hey!  Snakes have bones!  What made you","messageBody":"<div id=\"ygrps-yiv-835994974\">***My 11 year old finds snakes fascinating. She is amazed that something with no bones can move in such ways.***<br/>\n<br/>\nHey, hey!  Snakes have bones!  What made you think they don&#39;t have bones?    You can find cool pictures of snake skeletons online. <br/>\n<br/>\n***. Fine but she should have a healthy respect for them.***<br/>\n<br/>\nSee if there&#39;s a herpetologist at a university near you and make arrangements to visit.   See if there&#39;s a herpetology club in your area and go to meetings.  Go look at snakes in pet stores.   Talk with people who work with snakes.   Find as many opportunities for her to be around people who know snakes and for her to handle snakes safely.(safe for her and the snakes)   Help her get experience in a safe way, help her find knowledgeable people to visit with about snakes. <br/>\n<br/>\nIt seems you&#39;d be more comfortable if she was afraid of all snakes because that will help you feel sure she&#39;ll be afraid of the venomous ones.   But fear is dangerous too.  Fear is more likely to make a person do something foolish.   Help her get good information and experience and she will develop the skills she needs to stay as safe as possible around venomous snakes.  <br/>\n<br/>\nTry to keep your fear in perspective.  There are few fatal snakebites per year in the US.  There are many fatal car accidents.  Your daughter probably rides in a car at least every week?  When you have skill and knowledge, risk is reduced.  <br/>\n<br/>\n***I dont want to know anything about snakes... &lt;snip&gt;...I have no interest in them whatsoever.***<br/>\n<br/>\nIt would be better if you got interested!&lt;g&gt;  If you can&#39;t enjoy snakes, focus on enjoying your daughter&#39;s enthusiasm for snakes.  Watch her, listen to her, think about what she likes about them.  You may find them more interesting.  But even if you never love snakes, getting interested in them, finding a way for your daughter to get as much experience with snakes as she wants, will be great for your daughter and for your relationship with her. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299860577,"authorName":"Mary Whited","from":"Mary Whited &lt;indywhited@...&gt;","profile":"indywhited","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274320710","msgId":44222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltNFpxUDdEMHlXcWJoQUpjSkM1dkgwVXhEWS0wNTRieDR4b1NlVEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDY3ODg1Ny41Njg3Ny5xbUB3ZWIxMTMzMDkubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDY3ODg1Ny41Njg3Ny5xbUB3ZWIxMTMzMDkubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44221,"nextInTopic":44223,"prevInTime":44221,"nextInTime":44223,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"I had no interest whatsoever in dinosaurs. And then my eldest child turned 2 and he was obsessed. So I learned right along with him. I learned the names of all","messageBody":"<div id=\"ygrps-yiv-1164769857\">I had no interest whatsoever in dinosaurs. And then my eldest child turned 2<br/>\nand he was obsessed. So I learned right along with him. I learned the names<br/>\nof all the different types and what they ate and what habitats they lived in<br/>\nand why. And I learned alot of latin in the process just in learning the<br/>\nnames.<br/>\n<br/>\nI realize that dinosaurs aren&#39;t dangerous. I&#39;ve never heard of a<br/>\ndinosaur-phobia. But had my child not led me on this journey I would have<br/>\nmissed out on so much.<br/>\n<br/>\nWhile it might be prudent to give snakes a wide berth, it may not be wise,<br/>\nor helpful, to convey negativity about them to your child.<br/>\n<br/>\nThere are many ways to learn about snakes without being near life one. Maybe<br/>\nyou could participate by obtaining books and videos and web addresses for<br/>\nher. Let her delve in and really immerse herself in all of it. The more she<br/>\nlearns the more she will, undoubtedly, come to respect them.<br/>\n<br/>\nAlso maybe she could speak with area naturalists. Just having someone to<br/>\ntalk with about local species, someone who could tell her about safety might<br/>\nhelp put your mind at ease. I believe that these things would mean more<br/>\ncoming from someone for whom snakes are an interest or a job function.<br/>\n<br/>\nAnd like my son, she&#39;ll learn a lot about ecosystems and food chains and<br/>\nlife in general.<br/>\n<br/>\npeace,<br/>\nMary<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, May 19, 2010 at 9:44 PM, crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I dont want to know anything about snakes and it was my daughter that said<br/>\n&gt; they dont have bones. Personally I give snakes a very wide birth. I have no<br/>\n&gt; interest in them whatsoever.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154781355,"authorName":"crystal rid","from":"crystal rid &lt;cryway2@...&gt;","profile":"cryway2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274319869","msgId":44218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3ODg1Ny41Njg3Ny5xbUB3ZWIxMTMzMDkubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44217,"nextInTopic":44219,"prevInTime":44217,"nextInTime":44219,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"I dont want to know anything about snakes and it was my daughter that said they dont have bones.  Personally I give snakes a very wide birth.  I have no","messageBody":"<div id=\"ygrps-yiv-1629685144\">I dont want to know anything about snakes and it was my daughter that said they dont have bones.  Personally I give snakes a very wide birth.  I have no interest in them whatsoever.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed May 19th, 2010 8:22 PM CDT Karen Swanay wrote:<br/>\n<br/>\n&gt;Try research.  You don&#39;t know anything about snakes.<br/>\n&gt;<br/>\n&gt;They DO have bones.  And any animal with a mouth can bite.<br/>\n&gt;<br/>\n&gt;No animal inside a cage can bite through the glass.  The way you are acting<br/>\n&gt;about snakes is perfect for breeding a phobia in your child.  Snakes can and<br/>\n&gt;are handled safely every day by a lot of people.  But until you can stop<br/>\n&gt;acting as though they are all deadly killers, you can&#39;t help your daughter<br/>\n&gt;see them as marvels of nature.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Karen<br/>\n&gt;&quot;Correlation does not imply causation.&quot;<br/>\n&gt;<br/>\n&gt;&quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\n&gt;nail.&quot; Abraham Maslow<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;On Wed, May 19, 2010 at 6:59 PM, crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; OK, so here s my first step out of my comfort zone to allow my daughter to<br/>\n&gt;&gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt;&gt; amazed that something with no bones can move in such ways. Always before I<br/>\n&gt;&gt; ve told her to stay away from them. She knows we have poisonous snakes here.<br/>\n&gt;&gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt;&gt; refuge. I would prefer she give even caged snakes a wide birth. However I<br/>\n&gt;&gt; can considering let her explore her interest in more depth if she wants. The<br/>\n&gt;&gt; thing is question says she isn t afraid of them. Fine but she should have a<br/>\n&gt;&gt; healthy respect for them. I tried explcining it to her by telling her I m<br/>\n&gt;&gt; not afraid of cars but I know they could kill me so I m not going to go out<br/>\n&gt;&gt; in get in front of a moving vehicle. I explained snakes are the same way.<br/>\n&gt;&gt; Some can kill you most can bite. You dont have to be afraid of them but you<br/>\n&gt;&gt; should be cautious and stay well away from one unless you<br/>\n&gt;&gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt;&gt; explore her interest and still stay comfortable with it myself. Seeing her<br/>\n&gt;&gt; hand go to the glass in front of a snakes head makes me want to pull her<br/>\n&gt;&gt; away from the cage. I know it can t hurt her but I just prefer she stay far<br/>\n&gt;&gt; away from them.<br/>\n&gt;&gt;<br/>\n&gt;&gt;  <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;------------------------------------<br/>\n&gt;<br/>\n&gt;Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":104291387,"authorName":"Elizabeth Simon","from":"Elizabeth Simon &lt;elizabeth.simon@...&gt;","profile":"elizabethgsimon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274319085","msgId":44221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRjQ5MEVELjEwNzA3MDhAY294Lm5ldD4=","inReplyToHeader":"PEFBTkxrVGlsazNIUzYxWVJNUWpzVnlNWHp4RExMWmpZRTNUNnI0UmM0Q2VzUEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPiA8QUFOTGtUaWxrM0hTNjFZUk1RanNWeU1YenhETExaallFM1Q2cjRSYzRDZXNQQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":44220,"nextInTopic":44222,"prevInTime":44220,"nextInTime":44222,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"It could be a great family learning experience. First researching, learning, exploring and deciding if the family wants to include one in the household and","messageBody":"<div id=\"ygrps-yiv-1738979259\">It could be a great family learning experience.<br/>\nFirst researching, learning, exploring and deciding if the family wants <br/>\nto include<br/>\none in the household and then the creation of a habitat based on the <br/>\ntype of<br/>\nsnake that would work best for your family.<br/>\nThank you<br/>\nElizabeth<br/>\n<br/>\n<br/>\nKaren Swanay wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; Try research.  You don&#39;t know anything about snakes.<br/>\n&gt; <br/>\n&gt; They DO have bones.  And any animal with a mouth can bite.<br/>\n&gt; <br/>\n&gt; No animal inside a cage can bite through the glass.  The way you are acting<br/>\n&gt; about snakes is perfect for breeding a phobia in your child.  Snakes can and<br/>\n&gt; are handled safely every day by a lot of people.  But until you can stop<br/>\n&gt; acting as though they are all deadly killers, you can&#39;t help your daughter<br/>\n&gt; see them as marvels of nature.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Karen<br/>\n&gt; &quot;Correlation does not imply causation.&quot;<br/>\n&gt; <br/>\n&gt; &quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\n&gt; nail.&quot; Abraham Maslow<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Wed, May 19, 2010 at 6:59 PM, crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt; wrote:<br/>\n&gt; <br/>\n&gt;&gt;<br/>\n&gt;&gt; OK, so here s my first step out of my comfort zone to allow my daughter to<br/>\n&gt;&gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt;&gt; amazed that something with no bones can move in such ways. Always before I<br/>\n&gt;&gt; ve told her to stay away from them. She knows we have poisonous snakes here.<br/>\n&gt;&gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt;&gt; refuge. I would prefer she give even caged snakes a wide birth. However I<br/>\n&gt;&gt; can considering let her explore her interest in more depth if she wants. The<br/>\n&gt;&gt; thing is question says she isn t afraid of them. Fine but she should have a<br/>\n&gt;&gt; healthy respect for them. I tried explcining it to her by telling her I m<br/>\n&gt;&gt; not afraid of cars but I know they could kill me so I m not going to go out<br/>\n&gt;&gt; in get in front of a moving vehicle. I explained snakes are the same way.<br/>\n&gt;&gt; Some can kill you most can bite. You dont have to be afraid of them but you<br/>\n&gt;&gt; should be cautious and stay well away from one unless you<br/>\n&gt;&gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt;&gt; explore her interest and still stay comfortable with it myself. Seeing her<br/>\n&gt;&gt; hand go to the glass in front of a snakes head makes me want to pull her<br/>\n&gt;&gt; away from the cage. I know it can t hurt her but I just prefer she stay far<br/>\n&gt;&gt; away from them.<br/>\n&gt;&gt;<br/>\n&gt;&gt;  <br/>\n&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] snakes?","postDate":"1274318566","msgId":44217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsazNIUzYxWVJNUWpzVnlNWHp4RExMWmpZRTNUNnI0UmM0Q2VzUEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44216,"nextInTopic":44218,"prevInTime":44216,"nextInTime":44218,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"Try research.  You don t know anything about snakes. They DO have bones.  And any animal with a mouth can bite. No animal inside a cage can bite through the","messageBody":"<div id=\"ygrps-yiv-238696744\">Try research.  You don&#39;t know anything about snakes.<br/>\n<br/>\nThey DO have bones.  And any animal with a mouth can bite.<br/>\n<br/>\nNo animal inside a cage can bite through the glass.  The way you are acting<br/>\nabout snakes is perfect for breeding a phobia in your child.  Snakes can and<br/>\nare handled safely every day by a lot of people.  But until you can stop<br/>\nacting as though they are all deadly killers, you can&#39;t help your daughter<br/>\nsee them as marvels of nature.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nKaren<br/>\n&quot;Correlation does not imply causation.&quot;<br/>\n<br/>\n&quot;If the only tool you have is a hammer, you tend to see every problem as a<br/>\nnail.&quot; Abraham Maslow<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, May 19, 2010 at 6:59 PM, crystal rid &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cryway2@...\">cryway2@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; OK, so here s my first step out of my comfort zone to allow my daughter to<br/>\n&gt; explore her interests. My 11 year old finds snakes fascinating. She is<br/>\n&gt; amazed that something with no bones can move in such ways. Always before I<br/>\n&gt; ve told her to stay away from them. She knows we have poisonous snakes here.<br/>\n&gt; I do let my sister take her in the snake house at the zoo and wildlife<br/>\n&gt; refuge. I would prefer she give even caged snakes a wide birth. However I<br/>\n&gt; can considering let her explore her interest in more depth if she wants. The<br/>\n&gt; thing is question says she isn t afraid of them. Fine but she should have a<br/>\n&gt; healthy respect for them. I tried explcining it to her by telling her I m<br/>\n&gt; not afraid of cars but I know they could kill me so I m not going to go out<br/>\n&gt; in get in front of a moving vehicle. I explained snakes are the same way.<br/>\n&gt; Some can kill you most can bite. You dont have to be afraid of them but you<br/>\n&gt; should be cautious and stay well away from one unless you<br/>\n&gt; know for certain it isn t poisonous. Here s my delema how do I let her<br/>\n&gt; explore her interest and still stay comfortable with it myself. Seeing her<br/>\n&gt; hand go to the glass in front of a snakes head makes me want to pull her<br/>\n&gt; away from the cage. I know it can t hurt her but I just prefer she stay far<br/>\n&gt; away from them.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154781355,"authorName":"crystal rid","from":"crystal rid &lt;cryway2@...&gt;","profile":"cryway2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"snakes?","postDate":"1274313580","msgId":44216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzODgzNy4xMzIyMC5xbUB3ZWIxMTMzMDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":44217,"prevInTime":44215,"nextInTime":44217,"topicId":44216,"numMessagesInTopic":0,"msgSnippet":"OK, so here s my first step out of my comfort zone to allow my daughter to explore her interests.  My 11 year old finds snakes fascinating.  She is amazed that","messageBody":"<div id=\"ygrps-yiv-1137178333\">OK, so here s my first step out of my comfort zone to allow my daughter to explore her interests.  My 11 year old finds snakes fascinating.  She is amazed that something with no bones can move in such ways.  Always before I ve told her to stay away from them.  She knows we have poisonous snakes here.  I do let my sister take her in the snake house at the zoo and wildlife refuge.  I would prefer she give even caged snakes a wide birth.  However I can considering let her explore her interest in more depth if she wants.  The thing is question says she isn t afraid of them.  Fine but she should have a healthy respect for them.  I tried explcining it to her by telling her I m not afraid of cars but I know they could kill me so I m not going to go out in get in front of a moving vehicle.  I explained snakes are the same way.  Some can kill you most can bite.  You dont have to be afraid of them but you should be cautious and stay well away from one unless you<br/>\n know for certain it isn t poisonous.   Here s my delema how do I let her explore her interest and still stay comfortable with it myself.  Seeing her hand go to the glass in front of a snakes head makes me want to pull her away from the cage.  I know it can t hurt her but I just prefer she stay far away from them.</div>","specialLinks":[]}],"prevTopicId":44205,"nextTopicId":44041}}