{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help - unschooling and woh?","postDate":"1106011563","msgId":4717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNzaG9qYitvbm81QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDAwMWM0ZmMzZiRkNTJjYWFiMCQ2ODAxYThjMEBDQVZBTEFQVE9QPg=="},"prevInTopic":4713,"nextInTopic":0,"prevInTime":4716,"nextInTime":4718,"topicId":4708,"numMessagesInTopic":0,"msgSnippet":"... I don t know...how much worse could it be? If you could find one or two homeschooling families or even someone doing home daycare who d like a helper, it","messageBody":"<div id=\"ygrps-yiv-2090946757\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Queana&quot; &lt;queana7@c...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Even if there was an unschooling family nearby, I<br/>\n&gt; wouldn&#39;t leave him with them, because I don&#39;t know them.<br/>\n<br/>\n </span></blockquote>I don&#39;t know...how much worse could it be? If you could find one or <br/>\ntwo homeschooling families or even someone doing home daycare who&#39;d <br/>\nlike a helper, it seems like there&#39;s a very good chance it would be <br/>\nbetter for him!<br/>\n<br/>\nI do understand your concern about leaving him with strangers, <br/>\ncertainly. But I think it might be worth exploring, esp. if it&#39;s a <br/>\nfamily that has watched other kids and therefore has references.<br/>\n<br/>\n--aj</div>","specialLinks":[]},{"userId":201330991,"authorName":"Queana","from":"&quot;Queana&quot; &lt;queana7@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] help - unschooling and woh?","postDate":"1105981597","msgId":4713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDQwMWM0ZmNiNiRlYjNkNTg1MCQ2ODAxYThjMEBDQVZBTEFQVE9QPg==","inReplyToHeader":"PDkyLjFlNTJhYjMwLjJmMWNhMzVjQGFvbC5jb20+"},"prevInTopic":4711,"nextInTopic":4717,"prevInTime":4712,"nextInTime":4714,"topicId":4708,"numMessagesInTopic":0,"msgSnippet":"Thanks to everyone who has responded.  I really appreciate it!  I did want to clarify a couple things.  We have been planning and preparing for me to be able","messageBody":"<div id=\"ygrps-yiv-425268761\">Thanks to everyone who has responded.  I really appreciate it!  I did<br/>\nwant to clarify a couple things.  We have been planning and preparing<br/>\nfor me to be able to homeschool after this year.  We can afford<br/>\neverything we need to afford (including the house) without me teaching<br/>\nat this private school (which pays peanuts anyway).  But, for the next<br/>\ncouple months while we are moving, preparing the old house to rent,<br/>\npaying for inspections, etc., we actually do need the extra peanuts, not<br/>\nto mention the teachers 93% tuition discount to keep the other two in<br/>\nschool where they want to be.  At this point we could not pull out of<br/>\nescrow without losing thousands.  <br/>\nI realize it sounded like I was trying to decide between our house and<br/>\nour son, but that is SO not it in our family.  It just was phenomenally<br/>\nbad timing the way everything happened.  A couple months ago I could<br/>\nhave quit no problem.  In a couple months I could quit no problem.  It&#39;s<br/>\njust THESE couple months that are very difficult.  We are so not the<br/>\npeople with two car payments, huge house payments, hair and nail appts,<br/>\ngolf memberships, etc. who &quot;can&#39;t afford&quot; to have one income.<br/>\nMy son&#39;s well being is obviously my priority, otherwise I wouldn&#39;t be<br/>\ntrying to solve this problem.  I am going to talk with the teachers and<br/>\nadministrators tomorrow.  Thanks again for giving your input Ren,<br/>\nCheryl, Brandie, and Deirdre.<br/>\n <br/>\nQ<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.834 / Virus Database: 568 - Release Date: 1/14/2005<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":188356966,"authorName":"Brandie in TN","from":"Brandie in TN &lt;scrapdiva73@...&gt;","profile":"scrapdiva73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] help - unschooling and woh?","postDate":"1105973217","msgId":4711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTE3MTQ0NjU4LjgyMDc3LnFtYWlsQHdlYjUxODA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMDAwMWM0ZmMzZiRkNTJjYWFiMCQ2ODAxYThjMEBDQVZBTEFQVE9QPg=="},"prevInTopic":4710,"nextInTopic":4713,"prevInTime":4710,"nextInTime":4712,"topicId":4708,"numMessagesInTopic":0,"msgSnippet":"I don t see that there is any perfect fix.  When my daughter was miserable in school (she was always below grade level as they would say and bullied because","messageBody":"<div id=\"ygrps-yiv-608532247\">I don&#39;t see that there is any perfect fix.  When my daughter was miserable in school (she was always &quot;below grade level&quot; as they would say and bullied because of her size), we took her out.  It wasn&#39;t a hard decision, because her needs come first.  I can&#39;t really related to buying the new home, because we have purposely always lived in a very modest home...one that hubby could afford on his salary.  I guess I think you might just need to take a serious look at your wants (new house) and your income and find a way to make it work.  It won&#39;t be easy in the beginning, but I think it will be worth it in the long run.<br/>\n<br/>\n<br/>\nBrandie <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scrapbookingwithbrandie.com\">http://www.scrapbookingwithbrandie.com</a><br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Yahoo! Mail - now with 250MB free storage. Learn more.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145604420,"authorName":"Luckiebyrd@aol.com","from":"Luckiebyrd@...","profile":"luckiebyrd2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] help - unschooling and woh?","postDate":"1105938780","msgId":4710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyLjFlNTJhYjMwLjJmMWNhMzVjQGFvbC5jb20+"},"prevInTopic":4708,"nextInTopic":4711,"prevInTime":4709,"nextInTime":4711,"topicId":4708,"numMessagesInTopic":0,"msgSnippet":"Hi Q I don t have any big idea for you.  Reading about your son reminded me  soo much of my own son.  He had increasing problems as he got further up in  elem ","messageBody":"<div id=\"ygrps-yiv-1353172395\">Hi Q <br/>\n <br/>\nI don&#39;t have any big idea for you.  Reading about your son reminded me  soo <br/>\nmuch of my own son.  He had increasing problems as he got further up in  elem <br/>\nschool.  He was bullied to a point where it was a problem starting in  4th <br/>\ngrade.  His fourth grade teacher was a first year teacher or I think it  would <br/>\nhave been much worse that year.  But she was still young and  idealistic, and she <br/>\nprotected him alot.  But the next year he had a  teacher who seemed to <br/>\nindentify more with popular kids and kids who wore the  latest fashion than she did <br/>\nwith the rest of the class.  I swear she seemed  to flirt all the time.  <br/>\n <br/>\nAnyway, the best thing in the WORLD that we have ever done for him is to  <br/>\ntake him out of school and let him become his own person.  There is a  social <br/>\nsystem in school that in itself should be the answer to the  &quot;socialization <br/>\nquestion&quot;  that every one asks when they hear that your  children don&#39;t go to <br/>\nschool.  There is a ranking of individuals that  doesn&#39;t play out in the adult <br/>\nworld and many young children are targeted for  ridicule by people who don&#39;t even <br/>\nknow them.  At a very young and  impressionable age.<br/>\n <br/>\nWe have unschooled for the last year (almost- end of January).  I have  seen <br/>\nmy son interact with people of all ages and stages of life.  He is  caring and <br/>\nconsiderate, he has a good sense of humor,  and he has made  friends with <br/>\npeople throughout our community.  I used to feel a physical  ache in my chest <br/>\nwhen my son went to school.  Now I have a happy, healthy,  well adjusted 12 year <br/>\nold son, who talks to me and tells me things.  <br/>\n <br/>\nI swear that I can&#39;t imagine having to go through all the &quot;teen angst&quot; you  <br/>\nhear so much about.  Maybe I&#39;m blind and can&#39;t see it coming.  Maybe  some <br/>\nlifelong unschoolers will contradict me and tell me that it is a normal  stage and <br/>\nI need to be on the look out.  But right now it seems so far out  of the <br/>\nrealm of the possible.<br/>\n <br/>\nI work 12 hour night shifts in a hospital.  And I know that you don&#39;t  have <br/>\nthat option as a teacher,  but I hope you can figure out a solution  because I <br/>\ncan identify with your situation and unschooling has made my life and  my sons <br/>\nlife, hey, my whole family&#39;s life, 100% better.  :-)<br/>\n <br/>\nGood luck and keep reading,  these people have great ideas.<br/>\n <br/>\nCheryl in FL<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":201330991,"authorName":"Queana","from":"&quot;Queana&quot; &lt;queana7@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"help - unschooling and woh?","postDate":"1105930450","msgId":4708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0ZmMzZiRkNTJjYWFiMCQ2ODAxYThjMEBDQVZBTEFQVE9QPg=="},"prevInTopic":0,"nextInTopic":4710,"prevInTime":4707,"nextInTime":4709,"topicId":4708,"numMessagesInTopic":0,"msgSnippet":"I m not sure if I ve even introduced myself here or not; I ll save that for another post because this one may be long enough as it is.  I need some","messageBody":"<div id=\"ygrps-yiv-1215858567\">I&#39;m not sure if I&#39;ve even introduced myself here or not; I&#39;ll save that<br/>\nfor another post because this one may be long enough as it is.  I need<br/>\nsome brainstorming help, and since this is a &quot;beginners&quot; list I figured<br/>\nI could ask here.  Although not new to the concept of unschooling, I<br/>\nhaven&#39;t actually done it yet.  I&#39;ve wanted to for a few years now but<br/>\nhave been teaching full time at a private school in order for my oldest<br/>\nto be able to continue attending there (our public schools are horrible<br/>\nand he emphatically did *not* want to homeschool).  My middle son has<br/>\nwanted to hs, but has gone along with whatever everyone else was doing.<br/>\nMy youngest was very interested in starting kindergarten in school this<br/>\nyear.  Next year my oldest will be graduating from this school and going<br/>\nto high school.  We are financially in a different place, and I have a<br/>\nperfect job as an internet charter school teacher already lined up for<br/>\nnext year.  We just bought a new house that we will be moving in to next<br/>\nmonth so that we will have enough room to actually enjoy being home.<br/>\nEverything looked like it will fall into place perfectly.<br/>\nNow there&#39;s a problem.  My middle son (9 y.o., 4th grade) is unhappy at<br/>\nschool this year.  His best friend is playing some game with another kid<br/>\nall the time that my son doesn&#39;t enjoy.  He does enjoy playing soccer<br/>\nand football with the other boys, but they never pass him the ball (his<br/>\nfriend told him it&#39;s because they think he&#39;s no good).  He is not an<br/>\nathlete, definitely, but he is in tae kwon do, and is doing very well in<br/>\nthat.  Another boy, who he was good buddies with, is now picking on him.<br/>\nFirst he was poking him in the belly and saying, &quot;Big belly&quot;.  I talked<br/>\nto the teacher, and she said that the problem seemed to have resolved<br/>\nitself.  Then he was pinching him every time they were in line.  I found<br/>\nout about this during Christmas break, but it never resumed when school<br/>\nstarted back (I was ready to make a stink).  This weekend my son told me<br/>\nthat every time he goes near this boy, the boy starts talking loudly to<br/>\nwhoever he is with about how &quot;stupid and annoying&quot; my son is.  My son<br/>\nwants me to do something so the kid will stop (and get in trouble) and<br/>\nis dying to get out of school.  I want to ring the kid&#39;s neck and take<br/>\ndown his mother (she is also a teacher at my school; she also has<br/>\nattitude problems, even with her employer).  Obviously not the best<br/>\nsolution.<br/>\nBesides all this, my son is becoming less and less enamored with<br/>\nlearning as we speak.  He had always fared pretty well and was pretty<br/>\nresilient.  We&#39;ve never been pushy about grades or anything.  He&#39;s<br/>\nstarting to really actually hate school work now.  <br/>\nI&#39;m so sick about this right now.  What to do:<br/>\n <br/>\n - my husband suggested switching classes for the rest of the year;<br/>\nhowever, the problem is at recess time, and the two classes are together<br/>\nthen<br/>\n <br/>\n - if I quit to bring him home, I will not be able to afford my 8th<br/>\ngrader graduating with his class.  We will not be able to afford our new<br/>\nhouse.  My husband would be very unsupportive of this idea (and he just<br/>\nrecently became finally supportive of homeschooling).<br/>\n <br/>\n - if I keep him in, and talk to the teacher, administrator, other<br/>\nparent, whatever it takes to make it stop... I don&#39;t know if it will<br/>\nactually stop.  Maybe the name calling will.  But he is still being not<br/>\nincluded by other boys.  There are 4 boys in the 4th grade that he says<br/>\nare nice, so he is not without any friends.<br/>\n <br/>\n - I&#39;ve thought about trying to get admin approval to have him with me<br/>\nduring the day (I teach jr. high).  He would be able to read, use the<br/>\ncomputers, help in the computer lab (which the teacher would love and he<br/>\nis more than capable of), play his gameboy, etc.  Negatives - not much<br/>\nphysical activity time, may get boring for him after awhile, and I don&#39;t<br/>\nthink the administrators would go for it.  Although I am well-respected<br/>\nand appreciated, and usually get my way, this seems like something they<br/>\nwould perceive as not looking good for the school, and therefore not<br/>\nworkable.  I don&#39;t want to pull an ultimatum at this point (I would have<br/>\na few weeks ago before we bought a new freaking house).<br/>\n <br/>\n- I can&#39;t think of anyone who could watch him during the day.  Although<br/>\nboth grandparents are semi-nearby, they wouldn&#39;t be willing to watch him<br/>\nevery day, and it would add 30 - 40 minutes to our commute to and from<br/>\nschool each day.  Even if there was an unschooling family nearby, I<br/>\nwouldn&#39;t leave him with them, because I don&#39;t know them.<br/>\n <br/>\nIs there anything I haven&#39;t thought of?  Has anybody had a similar<br/>\ndilemma?  What would you do?  <br/>\n <br/>\nIf you read this far, thanks!<br/>\n <br/>\nQ<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.834 / Virus Database: 568 - Release Date: 1/14/2005<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":4714,"nextTopicId":4721}}