{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our current struggles","postDate":"1263069634","msgId":42828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZDOTkyNTUyM0MzMjQ2MjFBRUFCNzJFOUI2OEE2MjlDQENvbm5pZVBDPg==","inReplyToHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg=="},"prevInTopic":42827,"nextInTopic":0,"prevInTime":42827,"nextInTime":42829,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... I know that I stated you need to identify the need that is causing the kids to jump on the furniture in the first place. How you meet those needs and","messageBody":"<div id=\"ygrps-yiv-277311301\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;Not wanting one&#39;s children to jump on furniture is not necessarily putting one&#39;s pretty things before one&#39;s children. I do not want my 1, 3, and 5 year old sons colliding with one another and then landing on or against the windows, brick hearth, the woodwork that is so old and petrified that it is sometimes impossible to get a nail through it.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I know that I stated you need to identify the need that is causing the kids to jump on the furniture in the first place. How you meet those needs and remove the fear is up to you as long as it is respectful towards your kids. If you can&#39;t let them jump on the couch, you can go to a local park. There are tons of solutions that you can find that don&#39;t involve letting the kids jump on the furniture. I can&#39;t speak to your unique situation. I can only speak to what I have done in my house. Ultimately, it came down to what is more important, my kids or my sofa. I had to find a way to balance those things in my head. Instead of finding ways to further fear, I had to find ways of removing fear. I know that it is hard to get past that fear. I still struggle with getting past that fear. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;If we know that they will have to be thrown in the landfill in a (random guess) month from the jumping then it is selfish to have a month of fun and then cause that much waste isn&#39;t it?&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>That is a hypothetical. You don&#39;t know for certain that the couch will have to be thrown in the landfill. What if the couch was rescued from a landfill to begin with? I always buy second hand stuff or get hand-me-downs. The time I have it is just extra time that it wouldn&#39;t be in the landfill. That is how crappy the stuff I have is. : -)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;I am ABSOLUTELY all for having a good time and treating children as the equals they are but they do have less experience then adults.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Once I let go of that idea, life got a lot easier. Yes, they have less experience but sometimes that inexperience leads to more creative solutions than I could ever think of. When there is something that is very important to me, I take it to my kids and I talk to them about it (my oldest is only 8). A lack of experience doesn&#39;t automatically mean that they need somebody to micromanage what they do in order to protect them. How can they gain experience if we don&#39;t trust them enough to live and make decisions. Rather than looking at kids as being inexperienced, I try to take the approach that they provide a fresh/new perspective. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I also feel that if they are equals then that does not mean they are, until they actually are grown ups, somehow above or outside the typical social mores.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>There are ways to help kids navigate the social mores in our society. Whenever my child has a difficult time going somewhere and behaving according to the acceptable norms, then I talk to them about what those norms are and give them the choice of going or not. If they are too young to make that decision and cannot handle those places, then I don&#39;t take them to those places. It&#39;s that simple. I will periodically try to push the envelope. Sometimes, we have to leave because they aren&#39;t ready and sometimes we get to stay and enjoy ourselves. Sometimes, it is just unrealistic to expect kids to be able to navigate the adult world. I am an adult and still have trouble navigating it. Social mores don&#39;t always make sense to me. I have had to learn when to accept them and when to reject them. Frankly, I am still learning. I don&#39;t expect a 5 year old to be as far along in that journey as I am. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt; It just seems to me that every time someone posts something that starts a hot topic discussion here and has a slightly different view or method in their unschooling they are attacked into submission.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Unschooling is all about choice. You can come here and ask for an unschooling perspective or you can go find a support group. I am on other lists that pat me on the back and give me encouragement because unschooling can be very scary and just plain weird at times. I have come to realize that this group is not one of those groups. When I come to this list, I choose to accept the social norms/mores that have been established by the moderators. There are some unschooling groups that I cannot tolerate. That is my baggage. I don&#39;t go to those lists and try to get people to change. I don&#39;t go to those lists and try to get them to correct their behavior and be more gentle or less judgmental. <br/>\n<br/>\nThis is where I come to get straight talk. Some of what is said here does come off as harsh. It is not meant to be that way. It is meant to be how to unschool. If we responded differently or sugar coated things, then that wouldn&#39;t be unschooling. That would be something else. Everyone is at a different place in the unschooling journey. What is presented here is what I consider the ideal. Can I always attain the ideal? No, I don&#39;t always live up to the ideals of unschooling, especially as posed on this list, but I sure try to incorporate it wherever I can to help me get a little further along in my journey. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; I mean is unschooling really about freedom or are the parameters of it just as rigid as those of mainstream philosophies? I (i am being careful not to say &quot;we&quot; here) live outside the mainstream in almost every facet of my life and face judgment and ridicule for the choices I make including the choice of homeschooling/unschooling. I have grown to expect this treatment from those who live completely mainstream lives but I expect more from those who know how difficult it is to swim against the current.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It is about so much more than just freedom. For me, it is about removing fear. I have to remove the fear that I have about kids jumping on the furniture. I have to remove the fear that I have about other people judging me. I have to remove the fear of being different. It doesn&#39;t matter what the rest of the world thinks. It doesn&#39;t matter what other homeschooling parents think. It doesn&#39;t matter what other unschooling parents think. When you remove the fear, then it will be a lot easier to understand the perspective of unschoolers. I have found that the thing that kept me from getting this list was fear. I was afraid to hear something different. I was afraid that I wasn&#39;t doing something right. I was afraid of being even more different than I already was. When I was able to get rid of all those fears, this list made so much more sense and became so much more helpful. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;And, incidentally, I would love to know how all of you explain to toddlers and preschoolers that it&#39;s cool to jump on the furniture at home but not at grandma&#39;s, or at a party at a friends house, or while great grandma is sitting on it with hot coffee in her lap, or over my pregnant belly, or at the doctor&#39;s office, etc. I mean many if not most toddlers generalize such things. My five year old son still can not understand why he can&#39;t pretend to be a wild jungle animal on the floor during coffee hour at church at the feet of old people with hot coffee. (that paragraph may have come off as sarcasm but it is a 100% genuine question)&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I have always had a different set of standards for behavior at home versus when we go out. Home is where my family gets to be wild. That is where we get to explore and be ourselves. Home is where we get to recharge. It is our sanctuary. When we go out into the world, my family behaves according to what is acceptable. If my kids (or me or my husband) can&#39;t behave, then that means that perhaps we don&#39;t need to be there. I am thinking that I would get completely bored at a church function like the one you describe because I don&#39;t drink coffee and I very seldom have anything in common with older people that go to church. So, sometimes, it helps to try to think like your kid and remember what it was like to be a kid. If you like going to those functions, then take stuff for your child to do that is acceptable to those around you and will serve as a distraction to your child. I have never had a problem with different rules at different places. But, we try not to have one size fits all rules. We try to evaluate each unique situation and act accordingly. When we have company, it is not acceptable for my children to jump on the furniture. We talk a lot about everything. Even if I think something may be a little advanced, I still talk to my kids about it. I have learned that my kids are far more capable than most people (even me) think. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our current struggles","postDate":"1263065267","msgId":42827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpYWxiais3ajVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg=="},"prevInTopic":42826,"nextInTopic":42828,"prevInTime":42826,"nextInTime":42828,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... ***************** That s a concern that s not *just* about furniture, though, its about rough play in an environment that s not really suitable to such.","messageBody":"<div id=\"ygrps-yiv-874638661\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Chrissy&quot; &lt;EquinoxAutumn@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Not wanting one&#39;s children to jump on furniture is not necessarily putting one&#39;s pretty things before one&#39;s children.  I do not want my 1, 3, and 5 year old sons colliding with one another and then landing on or against the windows, brick hearth, the woodwork that is so old and petrified that it is sometimes impossible to get a nail through it.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat&#39;s a concern that&#39;s not *just* about furniture, though, its about rough play in an environment that&#39;s not really suitable to such. Its more a matter of finding solutions for kids to get out their big muscle movement needs and higher energy needs somewhere outside the house - the same as if you were living in a bitty apartment somewhere. But if you *see* it just in terms of the furniture, it becomes about furniture, not about the needs of your children and how to meet them better. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We can not get a new bed nor should we.  <br/>\n<br/>\n </span></blockquote>Why not? If you could, it would be an easy solution. There&#39;s Nothing Wrong with easy solutions! They don&#39;t turn children into monsters, I promise. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Every thing we own is hand me down and ugly and i still don&#39;t want it broken nor should the boys.<br/>\n </span></blockquote>****************<br/>\n<br/>\nWhy should it matter to them? That&#39;s a serious question, not a rhetorical one. What&#39;s wrong with breaking things? <br/>\n<br/>\nRay has always broken things. He has, until recently, been one of those people who &quot;didn&#39;t know his own strength&quot;. He&#39;d break screen doors trying to open them, break cups setting them down, hurt people by hugging too hard. For years we tried to get him to be gentler, under the assumption that he &quot;shouldn&#39;t&quot; break things. The trouble was, he didn&#39;t have that kind of control over his body. He ended up believing he was out-of-control, dangerous, bad - none of which motivated him to try to be gentler. So we shifted our focus, accepted that this was an innate part of Ray, and looked for other solutions. When we did that, he felt better about himself and became an active part of the process of finding solutions. Some of those solutions included things like taking down all the screen doors - something we wouldn&#39;t have considered when we were focused on what Ray &quot;should&quot; be, rather than who he actually was. <br/>\n<br/>\nMorgan&#39;s a differnt person. With her we have a whole different set of options available. We can *expect* that most of the time, things won&#39;t be broken because that&#39;s not the way she interacts with the world. Today, in fact, while she was balancing a balloon on a badminton racket, I could say &quot;hey, do that Over Here, please, away from the windows&quot;. With Ray at the same age, it would have been a matter of &quot;lets go outside and find something to smash that racket on!&quot; Different solutions stem from different needs. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If we know that they will have to be thrown in the landfill in a (random guess) month from the jumping then it is selfish to have a month of fun and then cause that much waste isn&#39;t it?<br/>\n </span></blockquote>******************<br/>\n<br/>\nAccepting Ray&#39;s tendency to break things allowed us to adjust other kinds of expectations. We actively looked for things that we&#39;d be Okay with him trashing. His bio mom was fantastic in this regard, actually, since she loved to dumpster dive. We&#39;d give him things to destroy to save things in the house, stuff that was, often, on the way to a landfill anyway. <br/>\n<br/>\nIs it really such a terrible thing to have fun? Is it really Better for kids to be all wound up with pent up muscular tension than to replace a bit of furniture, or repurpose an old matress or some cusions? <br/>\n<br/>\nIts not necessary for kids to be made systematically unhappy in order for them to grow up to be good people. Now, maybe your kids are happy without jumping on the furniture! Maybe its not a battle, every day, to get them to do something else - if so, no wonder you&#39;re baffled! You have a different context. Ray wasn&#39;t interested in jumping on the furniture, he was interested in smashing things - so we found him things to smash. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;go find something else fun to do like play a game, go outside and jump rope, go for a bike ride, etc. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nThose are other possible solutions, too, and they may work well for some kids, some families. Part of the problem, however, is that, in the case of jumping on furniture, some kids will need specific *jumping* solutions - there are physical needs involving the large muscles of the legs and vestibular stimulation. A mini trampoline is another good alternative - often found cheap at goodwill type stores if price is an issue, and its something that can be used indoors, although not in every home (sounds like it wouldn&#39;t be a good option in yours, for example). <br/>\n<br/>\nIts generally a good idea to offer alternatives - other ways to meet the same needs. Jumping *on the furniture* may not be a need per se, but jumping may be, and depending on the situation could be a need that&#39;s harder to meet by going out somewhere. Mo tended to want to jump right around the time of day I was crashing, so jumping on a chair (our one, designated jumping chair, braced against a wall, with reminders to jump holding the back) was an option that allowed me to lie down on the sofa while she was getting some energy out. Its Not an option that would have worked the same way with Ray, but then jumping was less of a need for him than using the big muscles of his arms - smashing or whacking or swinging on a rope. <br/>\n<br/>\nThe other aspect, as I mentioned above, is to ask &quot;how much of a battle would it be?&quot; If you can redirect your kids easily to go do something else, Fantastic! Then all this rigamarole is probably nonsensical to you. Redirecting my kids isn&#39;t always an option without turning things into a power struggle - so my solutions come from a different perspective, one where I&#39;m assuming &quot;lets go ride bikes!&quot; is going to be met with substantial resistance. Its Good to be reminded that not all kids are that intense, I sometimes forget that Mo, in particular, is a very strong willed, intense individual. Compared to Ray at the same age, she&#39;s a pussy cat!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So i feel that to accuse a parent looking for advice of putting their &quot;pretty sofa&quot; before their relationship with their children is hateful and counterintuitive to both this group and unschooling. <br/>\n </span></blockquote>************************<br/>\n<br/>\nBut I&#39;ve done that! **I&#39;ve** put furniture and dishes before my relationship with Ray, back in the day because, to the best of my knowledge, I was Supposed to do that in order to teach him to be more careful. Its not hateful on my part to suggest someone else is making the same mistake. Its not hateful on the part of other longtime unschoolers, who&#39;ve seen others make that same mistake over and over and over again to point it out - its one of the basic differences between unschooling and other kinds of  parenting: that we&#39;re not trying to teach kids a set of life lessons for their betterment. Its not hateful to let people know its Okay to put the needs of children before the standards that most of us have been conditioned to believe go along with parenting. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The couch could potentially last another ugly but utilitarian 20-30 years if we just treat it well.<br/>\n </span></blockquote>***********************<br/>\n<br/>\nWhat&#39;s the cost of &quot;treating it well&quot;? that&#39;s the question, from an unschooling standpoint. If the cost is a bit more creativity on the part of parents, that&#39;s one thing - by all means be more creative! If the cost is a child&#39;s self esteem, or other, physical needs, that&#39;s too much. I&#39;m not saying offering alternatives is going to destroy a child&#39;s self esteem - good heavens no! I&#39;m saying sometimes a better alternative is for parents to re-evaluate how they apply their values to their children, and consider another subset of options. If treating a sofa well means ongoing disregard for a child&#39;s needs, then you haven&#39;t saved the world, you&#39;ve broken it further. But that&#39;s a significant &quot;If&quot;! Sometimes there Are other options, for sure! Morgan has never once, at 8, destroyed something with and ax, and Ray, at 8, didn&#39;t jump on the furniture.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I feel that many of the responses i have been reading here lately have been judgmental instead of supportive.<br/>\n </span></blockquote>***************<br/>\n<br/>\nI&#39;m sorry if you&#39;ve felt attacked. I won&#39;t say unschoolers are non-judgemental, because that&#39;s not really the point - its really not a matter of &quot;anything goes&quot; even for those of us who&#39;ve found jumping on the furniture to be a viable solution. Its more a matter of taking the needs of children seriously - so seriously that we&#39;re willing to do some things that are a bit startling, because those solutions are kinder for some children. <br/>\n<br/>\nNot all the solutions that were kinder for Ray are kinder for Mo and vice versa. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I (i am being careful not to say &quot;we&quot; here) live outside the mainstream in almost every facet of my life and face judgment and ridicule for the choices I make including the choice of homeschooling/unschooling.  I have grown to expect this treatment from those who live completely mainstream lives but I expect more from those who know how difficult it is to swim against the current.   <br/>\n </span></blockquote>************************<br/>\n<br/>\nNo-one is saying you have to change that *for yourself*. The question, from a radical unschooling standpoint, is how you can go about being who you are while also supporting your children to be who they are - and they may not give a fig for your ideals! So then what? Do you put your other ideals before your kids? Do you look for a compromise? Sometimes questioning your ideals can provide some answers - what Exactly is it that you value? how strongly do you feel this? Is it strong enough, important enough, to hurt your children over? The conventional wisdom (of the alternative community as much as the mainstream) is that kids will benefit in the long run by parents hurting their feelings. Its for their own good. They &quot;have to&quot; learn. <br/>\n<br/>\nThe &quot;radical&quot; part of radical unschooling is that it draws the line at the present moment. Being hard on kids doesn&#39;t bring more kindness, more peace, into the world right now, nor does it teach what its intended to teach. It doesn&#39;t do the good its purported to do. <br/>\n<br/>\nIf that&#39;s true, if saying &quot;this couch will last 30 more years if you don&#39;t jump on it&quot; doesn&#39;t help your kids share that value, doesn&#39;t teach them to think about the future, doesn&#39;t give them a sense of perspective or help them love the earth, what do you have? An ugly sofa *and* an angry, frustrated child? That&#39;s not a better world. But again, maybe there&#39;s another option, another way to say &quot;yes&quot; to the need for big lower-body movement and vestibular stimulation. If so Great! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;      And, incidentally, I would love to know how all of you explain to toddlers and preschoolers that it&#39;s cool to jump on the furniture at home but not at grandma&#39;s, or at a party at a friends house, or while great grandma is sitting on it with hot coffee in her lap, or over my pregnant belly, or at the doctor&#39;s office, etc.<br/>\n </span></blockquote>****************<br/>\n<br/>\nWhen my kids aren&#39;t able to deal with a different set of rules, I don&#39;t take them place where they&#39;ll be impacted by those rules. I didn&#39;t take Ray places were there were a lot of things that weren&#39;t okay to break for years! I didn&#39;t take Mo to places where she couldn&#39;t at least bounce a little on the furniture. I *did* tell Ray he couldn&#39;t hug me while I was pregnant without asking me first and it *did* hurt his feelings somewhat. I&#39;m not saying there are No limits in the world! But I also didn&#39;t expect resisting the impulse to hurl himself into my arms would be beneficial to Ray at that point, so I tried to be as gentle and compassionate about the matter as possible. <br/>\n<br/>\nSome kids are better about dealing with changing expectations than others - Mo was actually pretty understanding about not jumping on things elsewhere for instance. Ray, otoh, had bigger needs, and less impulse control when he was little. It wasn&#39;t a matter of what anyone wanted! It was a matter of his needs being too big for him to accomodate along with other people&#39;s rules. In the non-unschooling world, there are plenty of those children, they&#39;re just punished for it and shamed for the fact that the punishment doesn&#39;t do much to stop them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My five year old son still can not understand why he can&#39;t pretend to be a wild jungle animal on the floor during coffee hour at church at the feet of old people with hot coffee.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThen I wouldn&#39;t take him without bringing someone along specifically to play with him elsewhere - out in the hall or outside, perhaps. You&#39;re expecting him to do something he&#39;s showing you, by his behavior, that he&#39;s currently unable to do. It doesn&#39;t matter that he &quot;should&quot; be able to remember the limits of the environment, he can&#39;t do that yet, and its not kind to him, or you, or the old people with coffee to place him in that kind of situation. Be easier on yourself, mama! Leave him home or find someone to play with him so you can socialize *and* he can have a good time, or if that&#39;s not possible, skip coffee hour for a while until your guy is able to keep all those other needs in mind. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our current struggles","postDate":"1263064995","msgId":42826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMTM3Mi4yMTkxLnFtQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg=="},"prevInTopic":42825,"nextInTopic":42827,"prevInTime":42825,"nextInTime":42827,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"I am not sure that the answers here are necessarily any more creative than other places as they still fit neatly within the parameters of a certain list of","messageBody":"<div id=\"ygrps-yiv-1986426698\">&quot;I am not sure that the answers here are necessarily any more creative than other places as they still fit neatly within the parameters of a certain list of unschooling &quot;rules&quot;. I feel that many of the responses i have been reading here lately have been judgmental instead of supportive.&quot;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nOnly the owners of this list can decide what rules they have for their list.<br/>\nI would say that  what they most want here is to keep the discussion on unschooling<br/>\nand what helps people  towards a joyfull unschooling life and what does not.<br/>\nWhat does not is going to be discussed. Those ideas will be  picked at.<br/>\nPeople sometimes come to the list with ideas that will hinder their unschooling jorney.<br/>\nThose ideas will be taken apart and discussed.<br/>\nThis is not a &quot;whatever-works-for-you &quot; support list.<br/>\nOnce and idea is thrown out in the list its not about the person who wrote it anymore but about that idea. <br/>\nThere are many support list around if that is what one is looking for.<br/>\n<br/>\nHere is the idea of support:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support/\">http://sandradodd.com/support/</a><br/>\nand here is the problem with support:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support/problem\">http://sandradodd.com/support/problem</a><br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\n &quot;Not wanting one&#39;s children to jump on furniture is not necessarily putting one&#39;s pretty things before one&#39;s children&quot;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-==<br/>\n<br/>\nThe advice ideas shared on this list come from many different families and are not only directed at the person who asked for it.<br/>\nMore often than not it is helping many people that just lurk and read.<br/>\nIt may not work in your house to let them jump on the couch. Other ideas were given.<br/>\nGetting a trampoline, putting matress in the floor, having an old freecycle matress in a room just for jumping. No one said &quot;Just let your kids jump on your furniture until they break&quot;.<br/>\nPeople will give ideas of what worked for them taking in account the kids , the home and the parents. I found out that in my house I rather have a $20 dollar couch and not worry about it  ( be in spilling, getting paint on it, breaking, cats scracthing, dogs sitting on it...).<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\n&quot; I am ABSOLUTELY all for having a good time and treating children as the equals they are but they do have less experience then adults. I also feel that if they are equals then that does not mean they are, until they actually are grown ups, somehow above or outside the typical social mores. Aside from this would I not be remiss if I didn&#39;t say something like, &quot;The couch could potentially last another ugly but utilitarian 20-30 years if we just treat it well. Let&#39;s keep it out of the landfill, prevent waste and the need to spend money we don&#39;t have (and even if we did it could be spent elsewhere to everyone&#39;s greater joy), and go find something else fun to do like play a game, go outside and jump rope, go for a bike ride, etc.&#39;&quot;<br/>\n<br/>\n-=-=-=-=-=-=-=<br/>\n<br/>\nI would have said that in less words like: &quot;Hey that may break the couch, lets go jump outside/play in the park/ go to a jumping place/....&quot;<br/>\nThat idea was shared. I remember writng about adressing your children&#39;s need and if jumping is one, find a way to get that need taken care of.<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\n &quot;It just seems to me that every time someone posts something that starts a hot topic discussion here and has a slightly different view or method in their unschooling they are attacked into submission.&quot;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=<br/>\n<br/>\nNo one is being attack here. Ideas WILL be discussed. This is not a list where one is going to be get a pat on the back and told:&quot;Whatever works for you&quot;.<br/>\n<br/>\n-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\n&quot; This does not seem to give what Alex said a positive connotation:<br/>\n<br/>\n&quot;THe difference between the advice you will get somewhere else and the advice<br/>\nhere is that here people question things, are more creative and put their kids<br/>\nand the realtionship with them above a pretty sofa!&quot;<br/>\n<br/>\nbut instead a judgemental and far from suportive one.&quot;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\nI am sorry you feel so defensive and attacked by it. I stand for what I wrote and I am thankful that I had my ideas challenged many times in this list.<br/>\nI have grown so much as a parent, wife and person because of it.<br/>\nIts been very positive to have some of my ideas taken appart and beliefs shaken.<br/>\nI welcome them now but I am sure I too felt unconfortable back when.<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n&quot;And, incidentally, I would love to know how all of you explain to toddlers and preschoolers that it&#39;s cool to jump on the furniture at home but not at grandma&#39;s, or at a party at a friends house, or while great grandma is sitting on it with hot coffee in her lap, or over my pregnant belly, or at the doctor&#39;s office, etc. I mean many if not most toddlers generalize such things. My five year old son still can not understand why he can&#39;t pretend to be a wild jungle animal on the floor during coffee hour at church at the feet of old people with hot coffee. (that paragraph may have come off as sarcasm but it is a 100% genuine question)&quot;<br/>\n<br/>\n-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI simply tell my kids that its their house and they don&#39;t like people to jump on their couch. My kids don&#39;t jump at other peoples house. They are able to undertand that some things are OK in our house but not in others. If your child is not yet ready to understand that than you may need to re-think taking your child to a situation where he would most likely fail. Find alternatives. Someone to watch him while you go to church, meet grandma at a park instead of her home. It won&#39;t be always like this. Kids grow and mature.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\n&quot;I am quite nervous about clicking send now because I fear the attack I am about to receive but this is how I feel. I can only hope that my opinions and reactions will be received as intended.&quot;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=<br/>\n<br/>\nand how are they intended?<br/>\nYou said people are being judgmental but aren&#39;t you judging what people are writing here too?<br/>\nI think that judging is not a bad thing as most people say.<br/>\nI certainly don;t think that everything a parent does to a child is as good as anything else.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our current struggles","postDate":"1263064946","msgId":42825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0Mzc5MS44OTMxOS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg=="},"prevInTopic":42824,"nextInTopic":42826,"prevInTime":42824,"nextInTime":42826,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"I find it fascinating when someone has attacked the list, maybe because they feel attacked, and then ask that others be gentle. I m not going to be harsh. But","messageBody":"<div id=\"ygrps-yiv-1241177550\">I find it fascinating when someone has attacked the list, maybe because they feel attacked, and then ask that others be gentle. I&#39;m not going to be harsh. But I&#39;m not going to coddle someone. <br/>\n<br/>\nYou wrote this: <br/>\n&quot;I (i am being careful not to say &quot;we&quot; here) live outside the mainstream<br/>\nin almost every facet of my life and face judgment and ridicule for the<br/>\nchoices I make including the choice of homeschooling/unschooling.  I<br/>\nhave grown to expect this treatment from those who live completely<br/>\nmainstream lives but I expect more from those who know how difficult it<br/>\nis to swim against the current.&quot; <br/>\n<br/>\nI live a relatively mainstream life. My husband works as a professor at a medical school and I am his stay at home wife with two children who I have chosen not to put into school. I don&#39;t necessarily share your values. I don&#39;t feel harrassed by strangers about the choices I make. And I don&#39;t look to a different bunch of strangers for comfort when I&#39;m feeling sensitive about the things that other strangers give me a hard time about. <br/>\n<br/>\nYou wrote: <br/>\n&quot;Not wanting one&#39;s children to jump on furniture is not necessarily<br/>\nputting one&#39;s pretty things before one&#39;s children.  I do not want my 1,<br/>\n3, and 5 year old sons colliding with one another and then landing on<br/>\nor against the windows, brick hearth, the woodwork that is so old and<br/>\npetrified that it is sometimes impossible to get a nail through it. The<br/>\nnext response I would expect is something like move the furniture but<br/>\nagain, it is not always that simple.  Our house is about 160 years old<br/>\nand there is not ever more that a few feet between large windows or<br/>\ndoors with windows and we are not going to move based upon anyone&#39;s<br/>\ndesire to jump on the furniture.&quot;<br/>\n<br/>\nSo, you want suggestions for other options or do you just want to tell your kids no? Or is this not a problem for you? Get a trampoline, I got ours free on a local homeschooling list. Lots of space to jump outside. Get one of those little trampolines that can fold up and fit under something else and when someone wants to jump pull it out and put it in the middle of the room where they can jump more safely. Go to one of those ball rooms places regularly so they can get that kind of physical play a lot. <br/>\n<br/>\nI&#39;ve lived in<br/>\nhouses that are over 500 years old and the one we currently rent is<br/>\nless than 40 years old. New for the UK. In some of the houses the walls were closer than others, but jumping on the couch was always possible. In some of the houses the windows were bigger, but fear stayed relatively small. Looking for solutions for active little kids was just part of life. Looking for ways for them to be safe given the constraints of our environment was part of my picture. I want them to have fun at least as much as I want them to be safe. And safe can be on a scale. I don&#39;t need them to never experience a skinned knee or scraped hands. My childhood was rich with green stained, bloody knees from sliding on the grass and falling on the pavement as I ran. <br/>\n<br/>\nThe landfill is nowhere near as important as my children&#39;s now. Another point on which the two of us clearly vary. You can attack me for that. I can withstand the criticism. David, my husband, has toy cars that were from his childhood that come with intact boxes, mint condition. He wasn&#39;t supposed to play too much with them. They were special, to be saved so that he could sell them later when they accrued value. They make me a little sad for him, for his childhood of order and tidiness when I see them. I am happy to know the other stories of him putting toy cars under the wheels of actual cars to see them flatten or flushing others down the toilet watching them swirl. I don&#39;t imagine those moments of childhood freedom were ones his mother would be anything but angry about if she&#39;d caught him. I don&#39;t imagine he shares those stories with her. A landfill doesn&#39;t seem nearly so sad. And there are other choices before a landfill is required. I&#39;ve recovered a<br/>\n few pieces of furniture that I was given at a car boot sale by someone who didn&#39;t want to load them back in his van. I&#39;ve taken things apart and used the bits to make other things. We have couch cushions filled with the cushions from other furniture as well as a giant shark toy that Simon was given by a couple of guys at a fair. There are usually more choices than a kneejerk reaction leaves you with. Honestly. <br/>\n<br/>\n<br/>\n You wrote:  <br/>\n&quot;And, incidentally, I would love to know how all of you explain to<br/>\ntoddlers and preschoolers that it&#39;s cool to jump on the furniture at<br/>\nhome but not at grandma&#39;s, or at a party at a friends house, or while<br/>\ngreat grandma is sitting on it with hot coffee in her lap, or over my<br/>\npregnant belly, or at the doctor&#39;s office, etc.  I mean many if not<br/>\nmost toddlers generalize such things.  My five year old son still can<br/>\nnot understand why he can&#39;t pretend to be a wild jungle animal on the<br/>\nfloor during coffee hour at church at the feet of old people with hot<br/>\ncoffee.&quot;<br/>\n<br/>\nSimon and Linnaea totally got the difference between safe in one place and not safe in another from a really young age, but if your 5 year old is having trouble with it, don&#39;t push the other people&#39;s homes for a bit. In any unavoidable situation, take lots of things that you know will interest him in a big bag and be prepared to not be involved with the adult interactions. A time will come when you can hang out and chat and not be doing a lot of child care, but with a 5, 3, and 1 year old that time is just not now. Redirect inappropriate behaviour with appropriate toys and engagements. Leave early. Try and minimize the number of times that you are putting him in those kinds of situations in any given week, month, year. Get something new to him that he can do and play with in any situation where it may be longer than he can normally take. The better you get at accomodating him, the better he will get at dealing with those kinds of situations. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our current struggles","postDate":"1263063111","msgId":42824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpYWo4Nys5bTB1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNDM0NkU3LjcwOTAzMDlAeWFob28uY2E+"},"prevInTopic":42819,"nextInTopic":42825,"prevInTime":42823,"nextInTime":42825,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... One of the reasons for this suggestion is that it s the kind of simple, expedient solution that parents often *don t* think about where kids are concerned","messageBody":"<div id=\"ygrps-yiv-1244818170\"><blockquote><span title=\"ireply\">&gt;&gt;with a lot of problems people present here, I get this feeling that `buying&#39; a solution seems to come up a lot. And then I feel like, sure, I can afford that one thing for this problem but what about all of the other problems. <br/>\n&gt;&gt;<br/>\n<br/>\n </span></blockquote>One of the reasons for this suggestion is that it&#39;s the kind of simple, expedient solution that parents often *don&#39;t* think about where kids are concerned  at least for &quot;non academic&quot; sorts of issues. Culturally, its perfectly acceptable to spend hundreds of dollars on a curriculum, but to replace a couch bc a child likes to jump on the furniture? It&#39;s the sort of thing that I know *I* found shocking when I first started wrapping my mind around unschooling, and yet I would have spent the same amount of money in a blink for &quot;math manipulatives&quot;. <br/>\n<br/>\nFrom that perspective, it can be a worthwhile exercise, when balking over spending money on something related to children, to compare the amount you&#39;d spend to some sort of  &quot;educational&quot; purpose. Would you scrape together the same $50 for a set of workbooks or posters? Would you find a way to come up with the money for a zoo pass if you thought you&#39;d probably use it? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If I add up all the things we could possibly need to buy, it would be unreachable. But that is just a fear, right?<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m certainly not in a position to &quot;throw money&quot; at every problem that comes my way! But even there, when I was newer to unschooling, thinking in terms of &quot;would I spend this on an educational tool?&quot; helped me to see the kind of *process* I&#39;d use to evaluate the purchase  what kinds of alternatives would I consider? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;d like to make a slipcover for it to extend its life, child-climbing and all. But I think I have to say that really don&#39;t want a sofa that looks really horrible for visitors<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>What about a second cover just for visitors? I&#39;ve done that  had a special cloth (quilts work well for that) that I&#39;d tuck over the sofa for company and then put it away again when they left. My couch gets filled up with toys and art projects on a regular basis (we&#39;ve added two tables to the room and it Still gets filled up its amazing) so I always expect to clean the couch anyway before company. Its not that much more of an issue to throw a clean quilt or afghan over the top of the thing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I was very emotional about not having a place to sit down and nurse the baby<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>About six months ago I realized that I crave a comfortable place to sit. As I said, my couch tends to be full, and the pair of armchairs in the living-room do, too. I tried keeping just the couch clean for awhile, but finally decided to just keep one chair clear  one place to sit. Its enough. Now that its cold I&#39;ve moved it next to the wood stove, so I have one Warm place to sit! Its valuable to Me to carve out that one bit of space for my own piece of mind. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":334199134,"authorName":"Chrissy","from":"&quot;Chrissy&quot; &lt;EquinoxAutumn@...&gt;","profile":"equinox_autumn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our current struggles","postDate":"1263050173","msgId":42819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpYTZqdCtlc25vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYzNjk4LjM1NTMyLnFtQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":42804,"nextInTopic":42824,"prevInTime":42818,"nextInTime":42820,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"I am not sure that the answers here are necessarily any more creative than other places as they still fit neatly within the parameters of a certain list of","messageBody":"<div id=\"ygrps-yiv-886788385\">I am not sure that the answers here are necessarily any more creative than other places as they still fit neatly within the parameters of a certain list of unschooling &quot;rules&quot;.  I feel that many of the responses i have been reading here lately have been judgmental instead of supportive. Not wanting one&#39;s children to jump on furniture is not necessarily putting one&#39;s pretty things before one&#39;s children.  I do not want my 1, 3, and 5 year old sons colliding with one another and then landing on or against the windows, brick hearth, the woodwork that is so old and petrified that it is sometimes impossible to get a nail through it. The next response I would expect is something like move the furniture but again, it is not always that simple.  Our house is about 160 years old and there is not ever more that a few feet between large windows or doors with windows and we are not going to move based upon anyone&#39;s desire to jump on the furniture. Our bed is broken and fixed to the best of our abilities but if it were to be jumped upon it is almost certain that it would collapse and it would be a miracle if there were no injuries.  We can not get a new bed nor should we.  Every thing we own is hand me down and ugly and i still don&#39;t want it broken nor should the boys.  If we know that they will have to be thrown in the landfill in a (random guess) month from the jumping then it is selfish to have a month of fun and then cause that much waste isn&#39;t it?  I am ABSOLUTELY all for having a good time and treating children as the equals they are but they do have less experience then adults.  I also feel that if they are equals then that does not mean they are, until they actually are grown ups, somehow above or outside the typical social mores.  Aside from this would I not be remiss if I didn&#39;t say something like, &quot;The couch could potentially last another ugly but utilitarian 20-30 years if we just treat it well.  Let&#39;s keep it out of the landfill, prevent waste and the need to spend money we don&#39;t have (and even if we did it could be spent elsewhere to everyone&#39;s greater joy),  and go find something else fun to do like play a game, go outside and jump rope, go for a bike ride, etc. It just seems to me that every time someone posts something that starts a hot topic discussion here and has a slightly different view or method in their unschooling they are attacked into submission.  This does not seem to give what Alex said a positive connotation:<br/>\n<br/>\n&quot;THe difference between the advice you will get somewhere else and the advice<br/>\nhere is that here people question things, are more creative and put their kids<br/>\nand the realtionship with them  above a  pretty sofa!&quot;<br/>\n <br/>\nbut instead a judgemental and far from suportive one.  Perhaps I am being sensitive in my standing up for those here, who like me, are trying something new and even a bit scary.  None of us would be here if we didn&#39;t want the best for our children and families.  If we make no other assumption of one another it should be that, right?  So i feel that to accuse a parent looking for advice of putting their &quot;pretty sofa&quot; before their relationship with their children is hateful and counterintuitive to both this group and unschooling.  Everyone seems so sensitive to people using certain words like &quot;we&quot;, or referring to their PASSIONATE food beliefs and choices in a tone that seems absolute but no one flinches when a parent is being accused of ranking inanimate objects above their children.  I mean is unschooling  really about freedom  or are the parameters of it just as rigid as those of mainstream philosophies?  I (i am being careful not to say &quot;we&quot; here) live outside the mainstream in almost every facet of my life and face judgment and ridicule for the choices I make including the choice of homeschooling/unschooling.  I have grown to expect this treatment from those who live completely mainstream lives but I expect more from those who know how difficult it is to swim against the current.   <br/>\n<br/>\n<br/>\n     And, incidentally, I would love to know how all of you explain to toddlers and preschoolers that it&#39;s cool to jump on the furniture at home but not at grandma&#39;s, or at a party at a friends house, or while great grandma is sitting on it with hot coffee in her lap, or over my pregnant belly, or at the doctor&#39;s office, etc.  I mean many if not most toddlers generalize such things.  My five year old son still can not understand why he can&#39;t pretend to be a wild jungle animal on the floor during coffee hour at church at the feet of old people with hot coffee. (that paragraph may have come off as sarcasm but it is a 100% genuine question)<br/>\n<br/>\nI am quite nervous about clicking send now because I fear the attack I am about to receive but this is how I feel.  I can only hope that my opinions and reactions will be received as intended.<br/>\n<br/>\nPeace,<br/>\nChrissy</div>","specialLinks":[]},{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Our current struggles","postDate":"1262890833","msgId":42804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzVERTJEMzI1MTJEQS01RTYwLTVEMERAd2VibWFpbC1tMDUyLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDEyNjI4NTc4MzYuMjc3LjQzODA2Lm00QHlhaG9vZ3JvdXBzLmNvbT4=","referencesHeader":"PDEyNjI4NTc4MzYuMjc3LjQzODA2Lm00QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":42800,"nextInTopic":42819,"prevInTime":42803,"nextInTime":42805,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"During my nursing years (and still, really) there has always been a chair that is MINE. Children have been welcome to share it *with* me :) but not to jump,","messageBody":"<div id=\"ygrps-yiv-470534887\">During my nursing years (and still, really) there has always been a chair that is MINE. Children have been welcome to share it *with* me :) but not to jump, climb, turn it over, or even sit in it without talking to me first. It&#39;s *mine*. I always had a comfy just right space to sit and nurse. If I had wanted a for sure nice space for visitors, perhaps I&#39;d have designated one of the four couches as MINE, too. :) (We have a lot of room, and relatives who sent us their old things when they upgraded) <br/>\n<br/>\nThere are almost always many more than just two options. :)<br/>\n<br/>\nDeborah in IL<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Our current struggles","postDate":"1262867652","msgId":42800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDVENEM0LjgwNDAzQHlhaG9vLmNhPg=="},"prevInTopic":42799,"nextInTopic":42804,"prevInTime":42799,"nextInTime":42801,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"Its not a pretty sofa!  Lol.  Its already old and stained, not the greatest color.  Its already about 20 years old.  The previous owner did NOT let her kids","messageBody":"<div id=\"ygrps-yiv-491742516\">Its not a pretty sofa!  Lol.  Its already old and stained, not the <br/>\ngreatest color.  Its already about 20 years old.  The previous owner did <br/>\nNOT let her kids climb all over it.  Which was lovely for us.  Its got <br/>\ngreat bones though.  Ok, I know comments like this are not really <br/>\nsupposed to be on the list, so sorry about that.  Feel free to not let <br/>\nthis through :)</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our current struggles","postDate":"1262837404","msgId":42799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNjk4LjM1NTMyLnFtQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDRCNDUxOTgxLjEwNTAwMDhAeWFob28uY2E+","referencesHeader":"PDRCNDUxOTgxLjEwNTAwMDhAeWFob28uY2E+"},"prevInTopic":42797,"nextInTopic":42800,"prevInTime":42798,"nextInTime":42800,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"Yay Shira~! THe difference between the advice you will get somewhere else and the advice here is that here people question things, are more creative and put","messageBody":"<div id=\"ygrps-yiv-1787981220\">Yay Shira~!<br/>\nTHe difference between the advice you will get somewhere else and the advice here is that here people question things, are more creative and put their kids and the realtionship with them  above a  pretty sofa!<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Our current struggles","postDate":"1262819713","msgId":42797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDUxOTgxLjEwNTAwMDhAeWFob28uY2E+"},"prevInTopic":42794,"nextInTopic":42799,"prevInTime":42796,"nextInTime":42798,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"I m sort of laughing inside, at myself, and all of this, over a sofa. Haha.  You are so right, about everything, the real value of the sofa, changing how I","messageBody":"<div id=\"ygrps-yiv-1460894107\">I&#39;m sort of laughing inside, at myself, and all of this, over a sofa.  <br/>\nHaha.  You are so right, about everything, the real value of the sofa, <br/>\nchanging how I look at it... and still, I think that having a comfy <br/>\nplace to sit, rest, nurse, etc... is in some fundamental way, important <br/>\nto my sanity in these young kids years, because when I think about <br/>\ngetting rid of the sofa, I get very anxious inside my body, antsy.  But, <br/>\nI think I can let go of the fears of the sofa getting ratty.  Because <br/>\nA)  I can always make/buy a slipcover now or later, and B) this sofa <br/>\nshowed up just in time to replace our mousy-poop sofa when we finally <br/>\ngot rid of the mouse.  Chances are, another one will show up when this <br/>\none bites the dust.  So, I&#39;m going to let go, try to find a trampoline, <br/>\nand let the kids jump!  :)</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our current struggles","postDate":"1262801563","msgId":42794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpMmpxciszZG1oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1RDM0RTE2ODNEQzQ2MkVCODcyREYyNUI3QjdEMDgzQENvbm5pZVBDPg=="},"prevInTopic":42790,"nextInTopic":42797,"prevInTime":42793,"nextInTime":42795,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"I am jumping in here without reading the whole thread, but I saw that it was about worries about furniture getting wrecked by kids. I just wanted to say that","messageBody":"<div id=\"ygrps-yiv-516343422\">I am jumping in here without reading the whole thread, but I saw that it was about worries about furniture getting wrecked by kids. I just wanted to say that one of the absolutely funnest, most active and enjoyable things I did at home when I was a kid was a game my brother and I set up to do flips over the backside of my mom&#39;s couch. We&#39;d do it sometimes for hours at a time and it was definitely not kind to the couch, but it is still one of my best childhood memories, especially with my brother, since we didn&#39;t get along much of the time. I am really, really glad my mom was able to bite her tongue and let us enjoy ourselves. And you know, that couch still lasted her for 15 or so years, even though it was horribly out of style by then (anyone remember those awful early 80&#39;s brown nature prints?) <br/>\n<br/>\nAnyway, my point is, a piece of furniture is so much more to a kid than what it seems like to an adult. It is a castle, tent, trampoline, tree fort, spacecraft launch pad, you get the point. My potty learning 1.5 year old just peed on ours about 5 minutes ago, so add potty, lol. I think my grandparents generation had it right. They had a sitting room for elegant entertaining (guess what, no one ever really used it), and a living room for, you guessed it, living. Since I can&#39;t do the same (not that I would, though I would like a yoga/meditation/art space), I have cheap couches (that I love) from craigslist and cheap coffee tables from Ikea and when my kids are older, I can get new ones. Like my mom, who now has lovely furniture that is totally in style, thank goodness. My one mistake was getting a glass topped table, what a disaster. I would way rather have my old plywood drop leaf, scratched and stained but totally functional table back because even dirty and covered with kid mess it had character. This one just has... fingerprints.<br/>\n<br/>\nOne of my good friends has couches that are lovely chintz. Her house is a really lovely old but reno&#39;d character house and everything is just so, but her couches are cat scratched beyond repair. Her cat died about a year ago, but I&#39;m willing to bet she remembers minnie whenever she sees those scratches. <br/>\n<br/>\n- Tammy</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our current struggles","postDate":"1262737876","msgId":42790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1RDM0RTE2ODNEQzQ2MkVCODcyREYyNUI3QjdEMDgzQENvbm5pZVBDPg==","inReplyToHeader":"PDRCNDM0NkU3LjcwOTAzMDlAeWFob28uY2E+","referencesHeader":"PDRCNDM0NkU3LjcwOTAzMDlAeWFob28uY2E+"},"prevInTopic":42784,"nextInTopic":42794,"prevInTime":42789,"nextInTime":42792,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... thing for this problem, but what about all of the other problems. ","messageBody":"<div id=\"ygrps-yiv-650824762\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; And then I feel like, sure, I can afford that one <br/>\n </span></blockquote>thing for this problem, but what about all of the other problems. &lt;&lt;&lt;&lt;<br/>\n<br/>\nIt&#39;s not about buying stuff to find a solution. It&#39;s about letting go of your fears and being creative. If you have the money to buy something, then buy it. If you don&#39;t, then try to think of other ways that you can meet the need that is being expressed when the kids climb on the furniture. If you don&#39;t have a car and there is a park nearby, then maybe you need to spend more time at the park. The main thing is to try to think of WHY they are climbing on the furniture. If you can find other ways of meeting that need, then do it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;But I think I have to say that really don&#39;t want a sofa that looks <br/>\n </span></blockquote>really horrible for visitors, because it looks so torn up, and I feel <br/>\nlike letting the kids jump or climb a whole lot will accomplish that <br/>\nlook.&lt;&lt;&lt;&lt;<br/>\n<br/>\nWhat would happen if you just got rid of the sofa all together and just had a few chairs or floor pillows? Would the world end? Do you have a lot of visitors? Are the visitors that you have so judgmental that they would end a friendship over your ratty looking couch? Does jumping and climbing on a couch really tear it up and break it? Maybe you could take the cushions off the couch and put them on the floor and let them jump on the couch cushions while they are on the floor. Then, there wouldn&#39;t be the worry of them breaking the springs or back of the couch. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;But my mother&#39;s couch got so ratty from us kids <br/>\n </span></blockquote>climbing on it for years...&lt;&lt;&lt;<br/>\n<br/>\nYou said it took years of you kids climbing on it to make it ratty. Is there a chance that your situation will change in a couple of years? Maybe you will happen upon a better couch somewhere and the situation will be that you can get it to your place without having to pay. I had a futon that I hated because the kids broke the back of it climbing on it and the cats thought it was their personal potty box. I did everything I could to save it. I invested way too much time and energy and emotion on a stupid piece of furniture. Then, one day I woke up and realized that the world would not end if I did not have a couch in my living room. So, I tossed it out and we went without a couch for a while. Then, one day, I was poking around on a website and found a couch & ottoman for $40. I let go of my fears and I was patient and everything worked out. That wouldn&#39;t have happened if I kept fretting about where will people sit when they come over or what will people think when they come over. It was kind of cool to go without a couch because we sat on the floor more and the kids had more room to run and play and get wild. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our current struggles","postDate":"1262701292","msgId":42784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQTE4Q0RDLTM4NDEtNDA2RS1CODI2LTkzQzA5QjY5RUJENUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRCNDM0NkU3LjcwOTAzMDlAeWFob28uY2E+","referencesHeader":"PDRCNDM0NkU3LjcwOTAzMDlAeWFob28uY2E+"},"prevInTopic":42783,"nextInTopic":42790,"prevInTime":42783,"nextInTime":42785,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... It s helpful to see people s ideas not as directives but as ways to break through some unnecessary roadblocks that people don t realize they ve put in","messageBody":"<div id=\"ygrps-yiv-513830908\">On Jan 5, 2010, at 9:04 AM, Shira Rocklin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think<br/>\n&gt; the sofa will be damaged structurally, but I DO want it to be not<br/>\n&gt; completely ratty.<br/>\n<br/>\n </span></blockquote>It&#39;s helpful to see people&#39;s ideas not as directives but as ways to  <br/>\nbreak through some unnecessary roadblocks that people don&#39;t realize  <br/>\nthey&#39;ve put in place.<br/>\n<br/>\nIt&#39;s a common value to have nice furniture and want to keep it for a  <br/>\ngood long while. For unschooling, it&#39;s good to question that value!  <br/>\nIt can be a huge stress reliever when people realize that it might be  <br/>\nbest to have furniture meant for the kids&#39; years at home. And to put  <br/>\nup one of those signs -- I&#39;m not remembering it exactly but says  <br/>\nsomething like &quot;If you&#39;ve come to visit me, great come on it. If  <br/>\nyou&#39;ve come to visit my house, make an appointment&quot; ;-)<br/>\n<br/>\nBut if that doesn&#39;t apply, the suggestion probably helped someone  <br/>\nelse :-)<br/>\n<br/>\nBut if there&#39;s something you need to say no about -- erecting a  <br/>\nroadblock -- then it&#39;s helpful to find alternatives paths for them  <br/>\nthan just plunking down the roadblock. There&#39;s a need they&#39;re trying  <br/>\nto meet. It doesn&#39;t need to be met by the exact thing they&#39;re trying  <br/>\nto do, whether that be running in a parking lot or jumping on a  <br/>\ncouch. But it will help hugely in getting *your* needs met to help  <br/>\nthem find alternatives to their needs.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Our current struggles","postDate":"1262700263","msgId":42783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDM0NkU3LjcwOTAzMDlAeWFob28uY2E+"},"prevInTopic":42769,"nextInTopic":42784,"prevInTime":42782,"nextInTime":42784,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"Is the furniture more important than your children, or your relationship w/ your children? Ok, I think I want to clarify, to get more tailored answers :)","messageBody":"<div id=\"ygrps-yiv-1316825639\">&quot;Is the furniture more important than your children, or your <br/>\nrelationship w/ your children?&quot;<br/>\n<br/>\nOk, I think I want to clarify, to get more tailored answers :)   First, <br/>\nI&#39;m working on getting a trampoline, but without a car, its tricky.  <br/>\nSecond, I know its probably not totally true, but with a lot of problems <br/>\npeople present here, I get this feeling that &#39;buying&#39; a solution seems <br/>\nto come up a lot.  And then I feel like, sure, I can afford that one <br/>\nthing for this problem, but what about all of the other problems.  If I <br/>\nadd up all the things we could possibly need to buy, it would be <br/>\nunreachable.  But that is just a fear, right? <br/>\n<br/>\nOk, so all of our furniture is pretty my old or second hand.  Our sofa <br/>\ncame to us from a neighbor, cost $50 to movers to get it to us, etc.  <br/>\nThe bed is a few years old.  I had a mattress with springs popping out <br/>\nonce, and I feel like if we are jumping on them every day then ours will <br/>\ndo that too, sooner rather than later.  We don&#39;t like to take used <br/>\nupholstered furniture like mattresses or sofas unless we know the giver <br/>\npersonally, since there can be issues with bedbugs in our big city.    <br/>\nI&#39;m concerned about shortening the life of the furniture.  I don&#39;t think <br/>\nthe sofa will be damaged structurally, but I DO want it to be not <br/>\ncompletely ratty.  It wasn&#39;t a small cost, that $50 to get it moved, <br/>\neven though it itself was free.  Its already old and stained.  I&#39;d like <br/>\nto make a slipcover for it to extend its life, child-climbing and all.  <br/>\nBut I think I have to say that really don&#39;t want a sofa that looks <br/>\nreally horrible for visitors, because it looks so torn up, and I feel <br/>\nlike letting the kids jump or climb a whole lot will accomplish that <br/>\nlook. I &#39;feel&#39; that way, but maybe that is not true.  Since Temima does <br/>\nclimb all over it.  But my mother&#39;s couch got so ratty from us kids <br/>\nclimbing on it for years... and now I can see why she had a &#39;fancy&#39; room <br/>\nwith couches no one could ever sit on, lol.  But we don&#39;t have that.  We <br/>\nonly have the one sofa.  This sofa also just replaced one that we had <br/>\nwhen we had a mouse problem and that one I was afraid to sit on and it <br/>\nreally disgusted me and I was very emotional about not having a place to <br/>\nsit down and nurse the baby at that time.  So I guess this is a bit <br/>\nemotionally tied up.</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [unschoolingbasics] Re: Our current struggles","postDate":"1262617834","msgId":42769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0NDAwOS45NTI5MC5xbUB3ZWI2NTcwNi5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFOTk3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42767,"nextInTopic":42783,"prevInTime":42768,"nextInTime":42770,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"...   Is the furniture more important than your children, or your relationship w/ your children?   Our household has always had hand-me-down couches partly","messageBody":"<div id=\"ygrps-yiv-2014783278\"><blockquote><span title=\"ireply\">&gt;I don&#39;t want the kids to jump on the beds (because we<br/>\n&gt; can&#39;t afford to replace them), or climb all over the sofa (same reason),<br/>\n<br/>\n </span></blockquote> <br/>\nIs the furniture more important than your children, or your relationship w/ your children?<br/>\n <br/>\nOur household has always had hand-me-down couches partly because we couldn&#39;t afford new ones, but mostly because we had children.  I didn&#39;t want to have couches I felt the need to protect  We eventually got rid of our couches and now just have cushions and beanbag chairs.  The one &quot;good&quot; chair we have is 12 years old and it has a permanent bowl shape in the middle, partly because one of our daughters prefered to be upside down in the chair for few years.<br/>\n <br/>\nAt this moment two of the beds in our house do have broken slats.  No one knows unless they crawl under the bed.  Once again, duct tape can work wonders...  Even without bouncing, that&#39;s what happens when 5 kids pile onto a twin bed w/ pine slats.  Oh, and my husband actually broke the other :).<br/>\n <br/>\nI realize not everyone lives w/ 2nd hand/low cost furniture.  There are other options.  My SIL has 3 boys who love to jump.  When someone was getting rid of a couch she picked it up and put it on their enclosed porch w/ a slip cover hiding the oldness.  Now when the boys want to jump she directs them to the jumping couch.  <br/>\n <br/>\nMy girls are not much into couch jumping anymore and once DH finds full time employment again we will be purchasing couches because it really would enhance our family life.  However, they&#39;ll still need to have washable covers because spillage happens :).<br/>\n <br/>\nJenna<br/>\n <br/>\n<br/>\n <br/>\n <br/>\n <br/>\n&quot;What&#39;s the matter with you? All it takes is faith and trust. Oh! And something I forgot. Dust!&quot;......<br/>\n&quot; Yep, just a little bit of pixie dust. Now, think of the happiest things. It&#39;s the same as having wings.&quot;                -  Peter Pan<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our current struggles","postDate":"1262612017","msgId":42767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFOTk3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42760,"nextInTopic":42769,"prevInTime":42766,"nextInTime":42768,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... layers of cardboard with a duct-tape shell). Hooray for duct tape!! :- ) Deb R ********************************************************************** This","messageBody":"<div id=\"ygrps-yiv-133225777\"><blockquote><span title=\"ireply\">&gt; cardboard &quot;decking&quot; over the springs that I replace periodically (two<br/>\n </span></blockquote>layers of cardboard with a duct-tape shell). <br/>\nHooray for duct tape!! :- )<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our current struggles","postDate":"1262544933","msgId":42760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGRTVEMDkyMTE2QzRGRTVBMTREMkI3MkU1NzQwOURGQENvbm5pZVBDPg==","inReplyToHeader":"PDMyODEuMTI4Ljk1LjIzOC4xMjEuMTI2MjUzODYxMy5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","referencesHeader":"IDw0QjQwMUQ0Qi42MDkwMTA1QHlhaG9vLmNhPiA8MzI4MS4xMjguOTUuMjM4LjEyMS4xMjYyNTM4NjEzLnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+"},"prevInTopic":42759,"nextInTopic":42767,"prevInTime":42759,"nextInTime":42761,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... I don t see anything wrong with that at all. When I was a kid, I was a bed hopper. I could not and would not sleep alone. If I couldn t find a bed with a","messageBody":"<div id=\"ygrps-yiv-184149619\"><blockquote><span title=\"ireply\">&gt; She is being &#39;parented&#39; to sleep, as a<br/>\n&gt; friend calls it. We are with her the whole time. Why resist sleep so<br/>\n&gt; consistently?<br/>\n<br/>\n </span></blockquote>I don&#39;t see anything wrong with that at all. When I was a kid, I was a bed hopper. I could not and would not sleep alone. If I couldn&#39;t find a bed with a warm person in it, I would go sleep on the couch so I could snuggle up to the back of the couch while burrowing into a blanket. When I was 15, I got my own room because all of my siblings had moved out. I still couldn&#39;t sleep by myself. I would get hives at bedtime. I don&#39;t know why. I just did. I learned to sleep alone but I always welcomed others in my room. If my niece or nephew spent the night, I let them sleep in my room with me. There was some kind of comfort that I got from being in the same room with another person. <br/>\n<br/>\nI have a hard time shutting my mind off. When I am in a room alone at night, I hear every little sound and then every little sound becomes magnified and my mind tries to figure out what it is and where it is coming from. Then, that will lead me to some kind of tangent and then I will think about a bunch of other stuff. I think that my mind becomes hyper alert when I try to go to bed because even smells will drive me crazy. So, I have to sleep with a TV on because otherwise I would NEVER go to sleep. The quiet and solitude gives me way too much to think about. When I didn&#39;t have a TV in my room, I had to turn the radio on to block out the silence. I remember going to bed as a teenager. I would have to go to bed and be asleep before the rest of the house quieted down. I would also have to use relaxation techniques where I would start with my toes and flex and release every muscle until I got to my head. Sometimes, I would make it to my head and have to start over before I could relax enough to actually go to sleep. So, when my kids have trouble sleeping, I keep that in mind. Just last night, my 8 year old couldn&#39;t sleep. She tried sleeping in her room and in the living room but that didn&#39;t work. She just couldn&#39;t relax. I encouraged her to drink a warm glass of milk and come into our room. I put on a TV program that she would like and we both fell asleep talking about it and watching it. <br/>\n<br/>\nI am an adult and there are times that I still need to be parented to sleep. What I mean is that my husband will make me a glass of hot chocolate or other beverage or he will rub my feet or talk to me until I can relax enough to go to sleep. Likewise, there are nights where he can&#39;t sleep so I will softly rub his back like I do for the kids. Sometimes the act of focusing on sleep makes it impossible to go to sleep. If you tell me I have to go to bed, my body might rebel and resist sleep just because. I have seen this play out when my husband will get upset about the kids not being in bed. He will keep reminding them that it is bed time and it seems like the more he reminds them, the more wild they get. On nights when he goes to bed, I will sit in the living room and watch TV with the kids. We will talk about what is on TV or whatever it is that is on our mind. I don&#39;t focus on it being bed time. I focus on it being quiet time. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"&quot;Sacha Davis&quot; &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Our current struggles","postDate":"1262538613","msgId":42759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyODEuMTI4Ljk1LjIzOC4xMjEuMTI2MjUzODYxMy5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","inReplyToHeader":"PDRCNDAxRDRCLjYwOTAxMDVAeWFob28uY2E+","referencesHeader":"IDw0QjQwMUQ0Qi42MDkwMTA1QHlhaG9vLmNhPg=="},"prevInTopic":42755,"nextInTopic":42760,"prevInTime":42758,"nextInTime":42760,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... DS is almost three and has been consistently parented to sleep since birth.  This is 100% our choice.  His sleep has been what I ve come to see as immature","messageBody":"<div id=\"ygrps-yiv-767474514\"><blockquote><span title=\"ireply\">&gt; She is being &#39;parented&#39; to sleep, as a<br/>\n&gt; friend calls it.  We are with her the whole time.  Why resist sleep so<br/>\n&gt; consistently?<br/>\n<br/>\n </span></blockquote>DS is almost three and has been consistently parented to sleep since<br/>\nbirth.  This is 100% our choice.  His sleep has been what I&#39;ve come to see<br/>\nas immature since birth.  I don&#39;t say immature in a negative sense, just<br/>\nin the sense that he seems to require a lot more assistance with sleep<br/>\nthan most other children, and I don&#39;t see requiring assistance as being<br/>\nsomething bad.<br/>\n<br/>\nI have come to see sleep as a process, not an event, and children go<br/>\nthrough that process at different speeds, with the end result of the child<br/>\nbeing able to go to bed and fall asleep without assistance.  I think most<br/>\npeople want this to happen when their child is a toddler, which is why you<br/>\nhave all these transitions to beds and gates put up to keep kids in the<br/>\nroom and kids who basically cry themselves to sleep.  I think it will<br/>\nhappen when my son is ready for it to happen.<br/>\n<br/>\nAnd strangely enough after 2.5 years of struggling to do the right thing<br/>\naround our son&#39;s sleep, he has actually started falling asleep on his own.<br/>\n We can now read him a story, turn on his music, lie down with him for 15<br/>\nminutes then tell him we&#39;re getting up and he&#39;ll lie in bed quietly and<br/>\nfall asleep.  I guess he got to a place where he was ready.  I&#39;m really<br/>\nglad that we worked hard, and really struggled, to respect his process<br/>\ninstead of imposing our own timeline on him.<br/>\n<br/>\nWe haven&#39;t made a final decision on unschooling, but I think our approach<br/>\nto sleep falls along the lines of the unschooling philosophy.<br/>\n<br/>\nI hope this helps a little.<br/>\n<br/>\nS.</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our current struggles","postDate":"1262536724","msgId":42755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhocWg2aytrNGxjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNDAxRDRCLjYwOTAxMDVAeWFob28uY2E+"},"prevInTopic":42744,"nextInTopic":42759,"prevInTime":42754,"nextInTime":42756,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"... Have other options for them - even a matress or cusions on the floor just for jumping. For awhile we had a designated jumping chair that was placed","messageBody":"<div id=\"ygrps-yiv-1409534341\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t want the kids to jump on the beds (because we <br/>\n&gt; can&#39;t afford to replace them), or climb all over the sofa (same reason), <br/>\n<br/>\n </span></blockquote>Have other options for them - even a matress or cusions on the floor just for jumping. For awhile we had a designated &quot;jumping chair&quot; that was placed securely against a wall so that Mo could jump without tipping it over. Its in sorry shape these days, but I&#39;ve managed to extend its life with slipcovers and cardboard &quot;decking&quot; over the springs that I replace periodically (two layers of cardboard with a duct-tape shell). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I tell her honestly what is in it, <br/>\n&gt; and that it will make her itchy or uncomfortable after she eats it.  <br/>\n&gt; Sometimes she eats it, sometimes she doesn&#39;t.  Is this the sort of thing <br/>\n&gt; where I should just let her do what she wants? <br/>\n<br/>\n </span></blockquote>She doesn&#39;t want to be itchy and uncomfortable, I&#39;ll bet. That&#39;s a clear connection, too, something she can wrap her mind around in terms of cause and effect. She&#39;ll still want to experiment with that cause-and-effect though, as you&#39;ve seen. Keep offering her the information as a reminder, for sure. <br/>\n<br/>\nThe trouble with extending that to something like &quot;this choice could maybe possibly result in this partially understood set of consequences ten of your lifetimes from now&quot; is that you&#39;ve moved into a set of criteria that&#39;s such a quagmire even reasonable adults won&#39;t all come to the same decision. That might be a good yardstick for you - if you gave similar information to adults, what would their reactions be?<br/>\n<br/>\nI get migraines - less often as I&#39;ve found the triggers in my diet and lifestyle, but some of the food triggers, in particular, are things I really enjoy. Last year on my birthday I made the choice to eat a food that&#39;s one of my migraine triggers because I hadn&#39;t had it (shrimp...oh I do love shrimp) in years. I looked carefully at all my other &quot;triggers&quot; - like hormones - and decided that everything else was &quot;low&quot; and planned a late dinner so I could go to bed right away the moment I got sick. I didn&#39;t get a migraine, but it would have been &quot;worth it&quot; to me if I had, for that rare pleasure. <br/>\n<br/>\nThat&#39;s an adult making the same kind of decision you&#39;re asking your dd to make with the eczema - not a cut and dried good-vs-bad decision, but one with imediate short term consequences that I had to weigh against desire. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I can relate in a way, as I <br/>\n&gt; also resist sleep often, but at the same time I just don&#39;t get it.<br/>\n<br/>\n </span></blockquote>Why do you resist sleep? Is it something &quot;obvious&quot; like &quot;gotta get this done then I can pass out&quot; or is it more of an internal thing? Think about that. Connect with her sense of not-wanting-to. When you&#39;re resisting sleep, what helps you? The specific strategies may not help her, but talking about your own resistance and the fact that you Have some strategies might. It provides a little big of perspective, the idea that sleep doesn&#39;t come easily for everyone. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I get that kids learn to go to sleep on their own when they are <br/>\n&gt; ready... and sleep through the night when they are ready... but thats <br/>\n&gt; not what is happening here.  She is being &#39;parented&#39; to sleep, as a <br/>\n&gt; friend calls it.<br/>\n<br/>\n </span></blockquote>Good! Its terrible to lie awake in bed in enforced lonliness. Its Okay to parent children genlty, parent them to sleep, parent them to decision making, rather than yanking away the supports when they become inconvenient to &quot;parents&quot;. Its okay to be gentle with children! It doesn&#39;t ruin them, or leave them unable to grow up. <br/>\n<br/>\nKids will eventually learn to go to sleep without parenting, but that doesn&#39;t make it a better option. Its certainly not kinder on the child who Wants to be parented in that uncertain transition down into unconsciousness. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Are there some kids who just need <br/>\n&gt; to let some tears out in order to settle down?<br/>\n<br/>\n </span></blockquote>Some kids will go through a stage of using emotional upset as the means to get past that scary, uncertain transition. Going to sleep is Weird! It can feel really out-of-control to some kids - this uncontrollable force takes them over and they go away for awhile. That&#39;s creepy! Mo went through a stage of using tears as her transition into sleep, although hers was a bit more cut-and-dried than your dds. I mean it really became obvious that it was a strategy, as she&#39;d do the same sorts of things, pick fights or whatever, right around the time she tended to go to sleep. <br/>\n<br/>\nHave you read any Althea Solter? I haven&#39;t, but she&#39;s often recommended on this subject, that of children using emotional upset as a tool to handle transitions and meet other needs. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our current struggles","postDate":"1262532959","msgId":42744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTgwMWNhOGM4YiQzMzg2MWIxMCRkMWEzZmVhOUB1bHJpa2VjNjUwZmMxYj4=","referencesHeader":"PDRCNDAxRDRCLjYwOTAxMDVAeWFob28uY2E+"},"prevInTopic":42741,"nextInTopic":42755,"prevInTime":42743,"nextInTime":42745,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"Hi Shira Could she have a fear of sleping. My eldest son was afraid that he would forget to breathe after he fell asleep. He was about three years old when","messageBody":"<div id=\"ygrps-yiv-1830260134\">Hi Shira<br/>\n<br/>\nCould she have a fear of sleping. My eldest son was afraid that he would forget to breathe after he fell asleep. He was about three years old when that was the reason why he resisted to go to sleep. I don&#39;t know whee he got that idea, but as soon as it was out in the open it cleared for him<br/>\n<br/>\nBlissigs<br/>\nUlrike<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our current struggles","postDate":"1262494305","msgId":42741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNjY1Ni40NzkyMy5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDRCNDAxRDRCLjYwOTAxMDVAeWFob28uY2E+","referencesHeader":"PDRCNDAxRDRCLjYwOTAxMDVAeWFob28uY2E+"},"prevInTopic":42738,"nextInTopic":42744,"prevInTime":42740,"nextInTime":42742,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"I don t want the kids to jump on the beds (because we can t afford to replace them), or climb all over the sofa (same reason), or other activities which taken","messageBody":"<div id=\"ygrps-yiv-1551933614\">I don&#39;t want the kids to jump on the beds (because we <br/>\ncan&#39;t afford to replace them), or climb all over the sofa (same reason), <br/>\nor other activities which taken on their own, we could deal with the <br/>\nrepercussions, but added all up, we could not be able to easily replace <br/>\nthe losses (in terms of furniture). <br/>\n<br/>\n&#39;-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nFurniture-<br/>\nPut away anything thatis delicate and you cannot replace. I put away my antigue side table and got some freecycle ones.<br/>\nCouch - I have a $25 dollar one ( really nice!) and the one before was only $1( another geat buy!).<br/>\nIf you cannot afford and you have a really nice couch provide your kids alternatives to jumping/ Simply state: &quot;Don;t jump on the couch , it can break it , jump here in the mini trampoline&quot;<br/>\nIf they need more physical outlets provide them with it. Just because you unschool it does not mean your nice couch gets destroyed. Find ways to fulfill their need to jump either by providing a safe alternative or creating an environment that is OK for them to do so.<br/>\nAll my nice antiques are in the attic. They will come down when the kids are ready for it.<br/>\nI don&#39;t know about your bed. I have two queen mattresses over their box springs on top of those simple frames and we jump in bed a lot. Including my 195 pound husband. Never broke the bed. But if I had a really nice frame I would either take it off and put them on a cheap one ( or on the floor) or  provide the kids with a great alternative like a trampoline.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Shira Rocklin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shirarocklin@...\">shirarocklin@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Sat, January 2, 2010 10:30:03 PM<br/>\nSubject: [unschoolingbasics] Our current struggles<br/>\n<br/>\n  <br/>\nI&#39;ve been finding that redefining my needs vs. wants, being flexible <br/>\nabout who&#39;s needs and wants might override who&#39;s (as in, let the little <br/>\npeople win lots of the time), has been very enlightening. But at the <br/>\nsame time, after having let go of a LOT... I&#39;m still struggling with <br/>\nthings like... I don&#39;t want the kids to jump on the beds (because we <br/>\ncan&#39;t afford to replace them), or climb all over the sofa (same reason), <br/>\nor other activities which taken on their own, we could deal with the <br/>\nrepercussions, but added all up, we could not be able to easily replace <br/>\nthe losses (in terms of furniture). <br/>\n<br/>\nWhat about things that don&#39;t have horrible repercussions. .. like my <br/>\neducated guess based on experiences we&#39;ve had that my 3yo eating <br/>\nsynthetic ingredients or food colorings has been causing her eczema to <br/>\nflare up more. So I&#39;ve explained to her the connection. And there are <br/>\ntimes when a candy cane, or some other food, has been provided for her, <br/>\nand she asks me if its ok to eat, and I tell her honestly what is in it, <br/>\nand that it will make her itchy or uncomfortable after she eats it. <br/>\nSometimes she eats it, sometimes she doesn&#39;t. Is this the sort of thing <br/>\nwhere I should just let her do what she wants? Let her eat something <br/>\nthat makes her ill? What if we are trying to get rid of the eczema more <br/>\nactively at some point, and then anything that could trigger it should <br/>\nbe avoided, in order to be rid of it, and then maybe later on be able to <br/>\ntolerate those foods? Where is this on the &#39;protecting our children&#39; <br/>\nspectrum of jumping off a cliff vs. wearing mismatched socks?<br/>\n<br/>\nGoing to sleep - its not that we are seeking out a set bedtime, but we <br/>\nare struggling with DD resisting sleep when she is clearly tired, <br/>\nstruggling to stay up. She&#39;s been this way since birth, except for <br/>\nseveral months when the baby was born when she went to bed at 6:30 every <br/>\nnight for some reason. She even says she is tired. I started out <br/>\nnursing her to sleep, she was a big nurser. Then we sang her to sleep <br/>\nwhen I couldn&#39;t stand to nurse while pregnant. That morphed into <br/>\nreading books until she fell asleep. Now DH is sometimes reading books <br/>\nto her to sleep, but sometimes she doesn&#39;t want that. There are times <br/>\nwhen she doesn&#39;t want to go to sleep, even though she is clearly coming <br/>\nacross as ready to fall asleep, all her usual signals like on the nights <br/>\nwhere things work out more smoothly. The idea of lying in bed awake, or <br/>\nlearning to &#39;relax,&#39; or practicing breathing, or listening to music or <br/>\nthe traffic, etc... don&#39;t fly with her. I can relate in a way, as I <br/>\nalso resist sleep often, but at the same time I just don&#39;t get it. I <br/>\nmean, I get that kids learn to go to sleep on their own when they are <br/>\nready... and sleep through the night when they are ready... but thats <br/>\nnot what is happening here. She is being &#39;parented&#39; to sleep, as a <br/>\nfriend calls it. We are with her the whole time. Why resist sleep so <br/>\nconsistently? Right now, she&#39;s struggled not to sleep until 11:26. DH <br/>\nhad to go take his medications that make him drowsy and drowsed in her <br/>\nbed hoping she&#39;d be ready soon. She wanted a drink, PJs (she wanted to <br/>\nbe naked before), cream for her eczema, etc... and then I suggested we <br/>\nput the cream on it bed so she can wait for the itching to stop and I <br/>\ntacked on &#39;and go to sleep&#39; to the end of that sentence, as if they sort <br/>\nof go together. And we did all that, and then I turned off the light and <br/>\nkissed her and left her with her daddy asleep beside her. And she spent <br/>\na few minutes until now lightly crying, but not calling for me like she <br/>\noften does, or sounding angry or anything that would let me know that <br/>\nshe really doesn&#39;t want to be there. Are there some kids who just need <br/>\nto let some tears out in order to settle down? Because now she&#39;s fallen <br/>\nasleep, probably from exhaustion and having daddy sleeping next to her <br/>\nwith his sleep rythms. But really, she could have gone to sleep 1-2 <br/>\nhours ago, if she wanted to go with the flow of her tiredness. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Our current struggles","postDate":"1262493003","msgId":42738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDAxRDRCLjYwOTAxMDVAeWFob28uY2E+"},"prevInTopic":0,"nextInTopic":42741,"prevInTime":42737,"nextInTime":42739,"topicId":42738,"numMessagesInTopic":0,"msgSnippet":"I ve been finding that redefining my needs vs. wants, being flexible about who s needs and wants might override who s (as in, let the little people win lots of","messageBody":"<div id=\"ygrps-yiv-347089225\">I&#39;ve been finding that redefining my needs vs. wants, being flexible <br/>\nabout who&#39;s needs and wants might override who&#39;s (as in, let the little <br/>\npeople win lots of the time), has been very enlightening.  But at the <br/>\nsame time, after having let go of a LOT... I&#39;m still struggling with <br/>\nthings like... I don&#39;t want the kids to jump on the beds (because we <br/>\ncan&#39;t afford to replace them), or climb all over the sofa (same reason), <br/>\nor other activities which taken on their own, we could deal with the <br/>\nrepercussions, but added all up, we could not be able to easily replace <br/>\nthe losses (in terms of furniture). <br/>\n<br/>\nWhat about things that don&#39;t have horrible repercussions... like my <br/>\neducated guess based on experiences we&#39;ve had that my 3yo eating <br/>\nsynthetic ingredients or food colorings has been causing her eczema to <br/>\nflare up more.  So I&#39;ve explained to her the connection.  And there are <br/>\ntimes when a candy cane, or some other food, has been provided for her, <br/>\nand she asks me if its ok to eat, and I tell her honestly what is in it, <br/>\nand that it will make her itchy or uncomfortable after she eats it.  <br/>\nSometimes she eats it, sometimes she doesn&#39;t.  Is this the sort of thing <br/>\nwhere I should just let her do what she wants?  Let her eat something <br/>\nthat makes her ill?  What if we are trying to get rid of the eczema more <br/>\nactively at some point, and then anything that could trigger it should <br/>\nbe avoided, in order to be rid of it, and then maybe later on be able to <br/>\ntolerate those foods?  Where is this on the &#39;protecting our children&#39; <br/>\nspectrum of jumping off a cliff vs. wearing mismatched socks?<br/>\n<br/>\nGoing to sleep - its not that we are seeking out a set bedtime, but we <br/>\nare struggling with DD resisting sleep when she is clearly tired, <br/>\nstruggling to stay up.  She&#39;s been this way since birth, except for <br/>\nseveral months when the baby was born when she went to bed at 6:30 every <br/>\nnight for some reason.  She even says she is tired.  I started out <br/>\nnursing her to sleep, she was a big nurser.  Then we sang her to sleep <br/>\nwhen I couldn&#39;t stand to nurse while pregnant.  That morphed into <br/>\nreading books until she fell asleep.  Now DH is sometimes reading books <br/>\nto her to sleep, but sometimes she doesn&#39;t want that.  There are times <br/>\nwhen she doesn&#39;t want to go to sleep, even though she is clearly coming <br/>\nacross as ready to fall asleep, all her usual signals like on the nights <br/>\nwhere things work out more smoothly.  The idea of lying in bed awake, or <br/>\nlearning to &#39;relax,&#39; or practicing breathing, or listening to music or <br/>\nthe traffic, etc... don&#39;t fly with her.  I can relate in a way, as I <br/>\nalso resist sleep often, but at the same time I just don&#39;t get it.  I <br/>\nmean, I get that kids learn to go to sleep on their own when they are <br/>\nready... and sleep through the night when they are ready... but thats <br/>\nnot what is happening here.  She is being &#39;parented&#39; to sleep, as a <br/>\nfriend calls it.  We are with her the whole time.  Why resist sleep so <br/>\nconsistently?   Right now, she&#39;s struggled not to sleep until 11:26.  DH <br/>\nhad to go take his medications that make him drowsy and drowsed in her <br/>\nbed hoping she&#39;d be ready soon.  She wanted a drink, PJs (she wanted to <br/>\nbe naked before), cream for her eczema, etc... and then I suggested we <br/>\nput the cream on it bed so she can wait for the itching to stop and I <br/>\ntacked on &#39;and go to sleep&#39; to the end of that sentence, as if they sort <br/>\nof go together. And we did all that, and then I turned off the light and <br/>\nkissed her and left her with her daddy asleep beside her.  And she spent <br/>\na few minutes until now lightly crying, but not calling for me like she <br/>\noften does, or sounding angry or anything that would let me know that <br/>\nshe really doesn&#39;t want to be there.  Are there some kids who just need <br/>\nto let some tears out in order to settle down?  Because now she&#39;s fallen <br/>\nasleep, probably from exhaustion and having daddy sleeping next to her <br/>\nwith his sleep rythms.   But really, she could have gone to sleep 1-2 <br/>\nhours ago, if she wanted to go with the flow of her tiredness.</div>","specialLinks":[]}],"prevTopicId":42787,"nextTopicId":42805}}