{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Brushing teeth...our experiences","postDate":"1088124727","msgId":999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlhLmRjNmMwZTEuMmUwY2QxMzdAYW9sLmNvbT4="},"prevInTopic":998,"nextInTopic":0,"prevInTime":998,"nextInTime":1000,"topicId":998,"numMessagesInTopic":0,"msgSnippet":"When Cameron was little, I would tell him that I just couldn t be in bed with someone who didn t brush his teeth or wash his feet (if really dirty). I would","messageBody":"<div id=\"ygrps-yiv-1148873045\">When Cameron was little, I would tell him that I just couldn&#39;t be in bed  <br/>\nwith someone who didn&#39;t brush his teeth or wash his feet (if really dirty). I  <br/>\nwould roll over and make a big deal about Ben&#39;s breath or Cameron&#39;s breath (and  <br/>\nfeet); they&#39;d do the same with me. &quot;NO stinky breath in bed!&quot; &quot;I don&#39;t want <br/>\nto  sleep with someone with bad breath!&quot;<br/>\n <br/>\nWorked to get him to brush because he wanted to be in bed with me.<br/>\n <br/>\nThe funny story that goes with though is: Cameron was talking with an old  <br/>\nhigh school boyfriend of mine. He was down at Cameron&#39;s level----right in his  <br/>\nface.<br/>\n <br/>\nCam took a big whiff and said, &quot;You have bad breath. You can&#39;t sleep with  MY <br/>\nmom!&quot;<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":72521049,"authorName":"Wendy E","from":"&quot;Wendy E&quot; &lt;mommytoluc@...&gt;","profile":"mommytoluc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Brushing teeth...our experiences","postDate":"1088122646","msgId":998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiZnF1bSt1Z3QxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":999,"prevInTime":997,"nextInTime":999,"topicId":998,"numMessagesInTopic":0,"msgSnippet":"When Lucas (now 5yo) was just under 2yo I noticed some brownish spots on his teeth.  Up until this point we had just been sort of playing around with tooth","messageBody":"<div id=\"ygrps-yiv-1925982598\">When Lucas (now 5yo) was just under 2yo I noticed some brownish <br/>\nspots on his teeth.  Up until this point we had just been sort of <br/>\nplaying around with tooth brushing.  I was not looking forward to <br/>\ngoing to the dentist because I had read that dentists blame early <br/>\ncavities on night nursing.  Lucas was still nursing frequently, day <br/>\nand night, and since I am committed to child led weaning (he still <br/>\nnurses once in the morning at age 5) I did not want some dentist <br/>\ntelling me this was wrong.  Well, I was referred to a great dentist <br/>\nby our wonderful pediatrician (both BFing advocates and the latter a <br/>\nfrequent LLL speaker) and she (the dentist) did not question my <br/>\nnight nursing and attributed the decay more to genetics.  She felt <br/>\nhe got cavities in spite of the nursing...not because of it. She did <br/>\nsay that dental hygiene plays a part in getting cavities and the <br/>\nprogression of decay and was very important...and we knew that it <br/>\nwas important for our child to start taking care of his teeth.  We <br/>\nhad to have several teeth worked on and we used IV sedation to do it <br/>\n(recommended for a child this young...and he couldnt&#39; have sat <br/>\nthrough it w/o it). It was a really big deal, and something we did <br/>\nnot want to go through again but we ended up going through it again <br/>\njust last month...another IV sedation and $3000 later.... You hear <br/>\nall sorts of scenerios...we flossed and brushed every day and never <br/>\ngot a cavity, we flossed and brushed every day and still got a <br/>\nmouthful of cavities, we never brushed and never got a cavity and so <br/>\non..... But, it makes sense to me that trying to have good dental <br/>\nhygiene is helpful in preventing cavities.  I also feel it is a <br/>\nmatter of cleanliness as well....and I do believe kids need a bit of <br/>\nfacilitation in this area.  Modeling is the best way to go...but I <br/>\npersonally feel this is too important of an area to just let them <br/>\nfigure out on their own.  It has been somewhat of a stuggle for <br/>\nus...getting the brushing done, finding a toothpaste that he will <br/>\ntolerate...chasing around with a toothbrush etc.....I do not feel <br/>\nthat we have done the best job with it (sometimes it was like <br/>\npulling teeth! LOL) and having to go in again for more work sort of <br/>\nshows that. This time around Lucas realized what was going on...<br/>\n(when he was 2 he just woke up and his mouth felt funny and forgot <br/>\nabout it the next day...and of course he didn&#39;t connect it to tooth <br/>\nbrushing).  Now he has made the connection, he know that he needs to <br/>\ntake care of his teeth to prevent cavities and keep himself from <br/>\ngoing through that again.  But he will not do it on his own....so, <br/>\nit&#39;s a Catch-22 situation, KWIM?  In other matters, he can make his <br/>\nown choices about.  But he only has one set of teeth and I feel I <br/>\nneed to do the best I can in helping him to take care of them, even <br/>\nif he is resistant to it.  All that said, I am still open to hearing <br/>\nideas and less coersive ways of getting him to do it.  At this <br/>\npoint, he is just reluctant... Since it&#39;s been a theme in our house <br/>\nfor awhile and I feel I&#39;ve tried everything in the book I have <br/>\nprobably heard it before, but who knows, one of you may have some <br/>\nmagical way I have not tried and it might be the answer.  So, that&#39;s <br/>\nour story.  No real answers...just our experience, and my opinion <br/>\nthat it is really important to have good dental hygiene.  <br/>\n<br/>\nWendy</div>","specialLinks":[]}],"prevTopicId":932,"nextTopicId":961}}