{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":832843,"authorName":"Ariannah Armstrong","from":"Ariannah Armstrong &lt;adagio@...&gt;","profile":"guitarsarebeautiful","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168205274","msgId":20394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QTE2NURBLjIwMzA3MDVAZm91bnRhaW4ubnNsdWcubnMuY2E+","inReplyToHeader":"PEMyNDQ4MEVCLTYxNEEtNEMwNC1CRTg4LTJEN0IzN0JDNEQ4REBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PEJBWTctRjEyN0JBQzFFOUVCNkQ5MzUzNDA3QzFDQUJGMEBwaHguZ2JsPiA8QzI0NDgwRUItNjE0QS00QzA0LUJFODgtMkQ3QjM3QkM0RDhEQGVhcnRobGluay5uZXQ+"},"prevInTopic":20392,"nextInTopic":0,"prevInTime":20393,"nextInTime":20395,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"... Yeah, that is what I have learned to do over the past while.  Rather than saying, No automatically by default, I ll say, Great idea.  Can we do this","messageBody":"<div id=\"ygrps-yiv-626443887\">Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; By focusing on helping our kids get what they want from life, by our  <br/>\n&gt; kids seeing us working to help them within the limitations of life  <br/>\n&gt; (for example, saying &quot;I&#39;d be happy to go to the grocery store in the  <br/>\n&gt; morning but right now I&#39;m exhausted. Let&#39;s see if we can find a  <br/>\n&gt; substitute until then,&quot; they&#39;ll figure out for themselves that the  <br/>\n&gt; whole world doesn&#39;t stop for them. They don&#39;t need to hear no to  <br/>\n&gt; learn that.<br/>\n<br/>\n </span></blockquote>Yeah, that is what I have learned to do over the past while.  Rather<br/>\nthan saying, &quot;No&quot; automatically by default, I&#39;ll say, &quot;Great idea.  Can<br/>\nwe do this (name a certain time) when I&#39;m more likely to get right into<br/>\nit with you?&quot;  They&#39;d rather have a willing and eager mom doing stuff<br/>\nwith them, than one who hasn&#39;t had the chance to unwind and is only<br/>\n&quot;half there&quot;.   My children pick up on this instinctively.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Helping kids navigate the realities of life is a much better route to  <br/>\n&gt; unschooling than saying no in order to get some lesson into them.<br/>\n<br/>\n </span></blockquote>Indeed.<br/>\nAriannah in Nova Scotia<br/>\n-- <br/>\n&quot;May we all have a vision now and then<br/>\nOf a world where every neighbour is a friend&quot;<br/>\nAbba &quot;Happy New Year&quot; 1980<br/>\nPersonal Blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://ec.lecti.ca\">http://ec.lecti.ca</a></div>","specialLinks":[]},{"userId":832843,"authorName":"Ariannah Armstrong","from":"Ariannah Armstrong &lt;adagio@...&gt;","profile":"guitarsarebeautiful","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168204971","msgId":20392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QTE2NEFCLjgwOTAwMDNAZm91bnRhaW4ubnNsdWcubnMuY2E+","inReplyToHeader":"PDMyNDU2QzFGLTBFNDQtNEM5RS1BMTJELTI2N0Y0ODI0MUZDQ0BlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PGNkMi43OGZiMDc0LjMyZDA1NGFiQGFvbC5jb20+IDwzMjQ1NkMxRi0wRTQ0LTRDOUUtQTEyRC0yNjdGNDgyNDFGQ0NAZWFydGhsaW5rLm5ldD4="},"prevInTopic":20365,"nextInTopic":20394,"prevInTime":20391,"nextInTime":20393,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"... I once took a parenting course that made me want to throw the textbook into a fire place.  They had put it so that there was not a single situation in","messageBody":"<div id=\"ygrps-yiv-1324531909\">Joyce Fetteroll wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; It&#39;s not the no that makes kids listen. It&#39;s building a relationship  <br/>\n&gt; of trust. It takes a huge amount of work to get to the point where a  <br/>\n&gt; parent can say an occasional &quot;Don&#39;t,&quot; and the child will take that to  <br/>\n&gt; heart. It&#39;s a huge huge disservice to the thoughtful work involved in  <br/>\n&gt; building relationships that people discuss here and work on to boil  <br/>\n&gt; it down to a message that suggests all of that can be gotten by  <br/>\n&gt; saying &quot;No&quot; to kids.<br/>\n<br/>\n </span></blockquote>I once took a parenting course that made me want to throw the textbook<br/>\ninto a fire place.  They had put it so that there was not a single<br/>\nsituation in which the word &quot;No&quot; was appropriate.  Sometimes, &quot;No&quot; in a<br/>\nfirm voice (not &quot;mean&quot;) is a great time saver and lets kids know that<br/>\nwhatever is going on needs to stop.<br/>\n<br/>\nHowever, since unschooling, I have become more and more of a YES mom,<br/>\nand it&#39;s pretty much my default answer for many things (after finding<br/>\nout how much arbitrary restriction I had put on my kids without even<br/>\nrealizing it)..  Now, when they hear the word &quot;no&quot;, it&#39;s a different<br/>\nenough word, that they know I must indeed mean it, rather than as the<br/>\ndefault drone which originally caused them to say, &quot;yeah, knew she&#39;d say<br/>\nthat&quot;.<br/>\n<br/>\nAriannah in Nova Scotia<br/>\n-- <br/>\n&quot;May we all have a vision now and then<br/>\nOf a world where every neighbour is a friend&quot;<br/>\nAbba &quot;Happy New Year&quot; 1980<br/>\nPersonal Blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://ec.lecti.ca\">http://ec.lecti.ca</a></div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168143153","msgId":20365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4OS42YWU3MDgzLjMyZDFjZDMxQGFvbC5jb20+"},"prevInTopic":20359,"nextInTopic":20392,"prevInTime":20364,"nextInTime":20366,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/6/2007 8:55:42 P.M. Eastern Standard Time, sylgt04@yahoo.com writes: How do you threaten to kill your child and do it with respect and","messageBody":"<div id=\"ygrps-yiv-816819358\">In a message dated 1/6/2007 8:55:42 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a> writes:<br/>\n<br/>\nHow do you threaten to kill your child and do it with respect and  love? And <br/>\nwould she really have killed you? I&#39;m sure not, so why  threaten you with that?<br/>\nshe saw people die of lung cancer and ruin their lives  with cigarettes and <br/>\nwhen she found out that I tried a few she totally LOST  it and said things that <br/>\nwere TOTALLY out of character for her. To see her  with that passion, <br/>\ncraziness and trauma in her eyes, tears pouring  down her face really HIT ME like a <br/>\nton of bricks. I thought &quot;OH CRAP  I am doing something AWFUL with my life I <br/>\ncan&#39;t do this anymore!&quot; For her  to fall from grace like this was absolutely out <br/>\nof character. She is the  gentlest most soft spoken kind loving human being <br/>\non earth. It was  THE PERFECT way for me to see her be about something so <br/>\nserious.  My Mom used to make similar threats and it did  nothing to make us do <br/>\nwhat she asked/said -- we just got better at not  getting caught.<br/>\n<br/>\n<br/>\n<br/>\nAs I said, this was totally out of character for her.  The fact that she did <br/>\nsomething like this 2 or 3 times total in  her whole life is probably why it <br/>\nhad such a great effect. If  you are constantly freaking out about everything <br/>\nkids (and everyone else)  will tune you out. She selected the PERFECT time and <br/>\nway to &quot;loose it&quot;  and every time someone remarks about how nice it is that I <br/>\nnever  developed bad health habits that interfere with my career (I sing opera <br/>\n and jazz for a living) I look back at that moment and think about all she  <br/>\ndid for me. <br/>\n <br/>\nThat story (the &quot;I will kill you before the cigarette&#39;s  do&quot;) is a story my <br/>\nchildren 11,9 and 7 already have heard and laugh  about with their Baka <br/>\n(grandma) and they always ask her or me to tell it.  They see it as loving, funny <br/>\nafter the fact, and just part of our  crazy family. <br/>\n <br/>\nAdriana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: No.","postDate":"1168142244","msgId":20359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhMC43MzBkYWM4LjMyZDFjOWE0QGFvbC5jb20+"},"prevInTopic":20349,"nextInTopic":20365,"prevInTime":20358,"nextInTime":20360,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/6/2007 5:50:45 P.M. Eastern Standard Time, starsuncloud@comcast.net writes: You better not ever come home pregnant or blah, blah, blah .","messageBody":"<div id=\"ygrps-yiv-802570222\">In a message dated 1/6/2007 5:50:45 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\n&quot;You better not<br/>\never come home pregnant or blah, blah, blah&quot;.  It sounds like you might<br/>\nhave a hard time examining the not-so-great  parts about the way you<br/>\nwere raised along with the wonderful parts.  You can love your parents<br/>\ndearly and still recognize where you might  do better.<br/>\n<br/>\nI&#39;ve never felt more love because someone told me &quot;you  better not&quot;. It<br/>\nsounds like your upbringing was pretty sheltered in a  lot of ways.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWow, I&#39;m in the minority of people who do not  feel I could &quot;do better&quot; than <br/>\nmy parents (instead I only DREAM of being as  wonderful as they were) yet this <br/>\nisn&#39;t a good thing?!  SHEESH! I  think of myself as the luckiest lady on <br/>\nearth. I&#39;m so glad I fell in love  with a man who has the same regard for his <br/>\nparents and who&#39;s parents have  the same regard for theirs! Its a really GREAT way <br/>\nto feel and life sure  is happy for all involved. <br/>\n <br/>\nMaybe my childhood was sheltered but I thank God  for that! We all turned out <br/>\nvery healthy and didn&#39;t get ourselves  into the kind of trouble that I&#39;ve <br/>\nseen ruin people; early sex, drugs,  self-disrespecting behavior. I DID feel <br/>\nloved by &quot;you better not&quot; and I  still feel loved when my better half tells me <br/>\nwhat streets he doesn&#39;t want  me driving on (because they are unsafe) or how late <br/>\nat night it too late  to go to the market (also because of safety). <br/>\n <br/>\nBut it isn&#39;t as if something &quot;bad&quot; will happen in our  relationship if I do <br/>\ngo to the market after dark; I&#39;ll simply come  home to some comment like &quot;so <br/>\nyou like being out with the muggers?&quot; (think  an episode of Raymond) it is all <br/>\nvery tongue and cheek, joking yet a  little serious at the same time, and very <br/>\nloving as in &quot;if I didn&#39;t love  you I wouldn&#39;t tell you what to do.&quot; I TRULY <br/>\nthink this could just be  a cultural thing because he is Italian and I am <br/>\nextremely ethnic as well  (Croatian, similar culturally) and we tell each other and <br/>\nour children and  our parents and friends, etc...  that we love one another  <br/>\nby being busy bodies and telling each other what to do constantly.  Maybe if <br/>\nyou aren&#39;t part of our culture you can&#39;t understand it. I  would be DEVASTATED <br/>\n(and feel very unloved) if I wore a new outfit in  front or my mom, aunts and <br/>\nsisters and it didn&#39;t get &quot;critiqued&quot; in a  multitude of ways (just perfect, <br/>\ntoo tight in the butt, do you think  you are Brittany Spears, you shouldn&#39;t <br/>\nwear stripes, makes you look busty,  etc...) to which I would respond &quot;kiss my <br/>\ntoo tight ass&quot; and everyone  would burst into laughter and hug. When we leave <br/>\neach other alone and  do what normal people call &quot;respectful&quot; it is actually (in <br/>\nour culture) a  way of being really mean to  someone.          <br/>\n <br/>\nIn terms of the pregnancy thing, the &quot;light and regular&quot;  way of saying it in <br/>\nmy family every now and then (this was always in  response to finding out <br/>\nthat some kid at school had done something they  didn&#39;t approve of) was &quot;you <br/>\nbetter not&quot; but it was really more of just a  knee-jerk thing to say than the only <br/>\nway they said it. There were the rare  occasions that we&#39;d be sitting at the <br/>\ntable or going to bed and brushing  our teeth and they would go into more <br/>\ndepth about how they felt about it.  That if we did something like that, we would <br/>\nthen have to be 100%  responsible for the baby financially and otherwise which <br/>\nmeant no more  riding lessons, no more ponies, no more music lessons, and of <br/>\ncourse  living on our own - all things we didn&#39;t want happening. They made it  <br/>\nVERY CLEAR that they would love us and be &quot;in love&quot; with us forever no  mat<br/>\nter what, but they wouldn&#39;t support us financially because when you  have sex <br/>\nyou MUST be old enough to support yourself and take  care of all the <br/>\nconsequences that sex can lead to. What could  be wrong with that. So really, they <br/>\nweren&#39;t saying &quot;no&quot; to  sex, they were saying &quot;if you do it, you should be prepared <br/>\nto live  as an adult, and we will be sad about that (and feel disgraced as a  <br/>\nfamily) but will love you no matter what.&quot; To me that is very  HEALTHY, <br/>\ntruthful and practical. <br/>\n <br/>\nAdriana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168134398","msgId":20349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxMjM2Ljk5MjE0LnFtQHdlYjUzODE0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDQwOS43MTJhODVlOS4zMmQxMzMxZkBhb2wuY29tPg=="},"prevInTopic":20346,"nextInTopic":20359,"prevInTime":20348,"nextInTime":20350,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"maybe my parents said it with more respect and love? none of us rebelled, we just loved our parents even more when they set boundaries. it made us feel safe.","messageBody":"<div id=\"ygrps-yiv-1326801860\">maybe my parents said it with more respect and love? none of us rebelled, we <br/>\njust loved our parents even more when they set boundaries. it made us feel <br/>\nsafe. but our parents were EXTREMELY affectionate and loving and attached to <br/>\nus (like glue) still are! :-)<br/>\nAdriana <br/>\n<br/>\n<br/>\n  *****<br/>\n   <br/>\n  How do you threaten to kill your child and do it with respect and love?  And would she really have killed you?  I&#39;m sure not, so why threaten you with that?<br/>\n   <br/>\n  My Mom used to make similar threats and it did nothing to make us do what she asked/said -- we just got better at not getting caught.<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n<br/>\n          Gary (dh)<br/>\n  Will (almost 22!) Andy (10-1/2) and Dan (almost 6) <br/>\n   <br/>\n      Peace is the vibrant space which stimulates the dance of kindness, merriment and freedom. ~ unknown<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourhapahome.blogspot.com\">http://ourhapahome.blogspot.com</a><br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: No.","postDate":"1168125648","msgId":20334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyMzJFMDU3LUUzMzctNEFFNi1CRDhCLTRGRDc1NkU4Qjg1OEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGVucDhvNytvdnI3QGVHcm91cHMuY29tPg==","referencesHeader":"PGVucDhvNytvdnI3QGVHcm91cHMuY29tPg=="},"prevInTopic":20333,"nextInTopic":20346,"prevInTime":20333,"nextInTime":20335,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"... I think in the context of a supportive, trusting environment, You better not come home pregnant could be heard as just an obvious statement of what s","messageBody":"<div id=\"ygrps-yiv-1533707384\">On Jan 6, 2007, at 5:44 PM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m sorry, but there&#39;s nothing respectful about saying &quot;You better not<br/>\n&gt; ever come home pregnant or blah, blah, blah&quot;.<br/>\n<br/>\n </span></blockquote>I think in the context of a supportive, trusting environment, &quot;You  <br/>\nbetter not come home pregnant&quot; could be heard as just an obvious  <br/>\nstatement of what&#39;s already accepted.<br/>\n<br/>\nBut the point isn&#39;t whether or not it&#39;s heard as loving or  <br/>\ncontrolling by a particular person. The point is how can we create an  <br/>\nenvironment where kids trust that our goal is to help them get what  <br/>\nthey want?<br/>\n<br/>\n&quot;No&quot; doesn&#39;t create that environment. Saying &quot;Yes&quot; -- and saying it  <br/>\nmindfully as Ren pointed out -- does. Actively helping them move  <br/>\ntowards what they&#39;re trying to get is how we build their trust that  <br/>\nwe want to help them get what they want.<br/>\n<br/>\nThere are two separate arguments going on here: One side is arguing  <br/>\nthat never saying no is a bad idea. The other side is clearly saying  <br/>\nthat&#39;s not the point and trying to discuss the more important issue  <br/>\nof how to create a trusting environment.<br/>\n<br/>\nMaybe to get past the impasse, for those who are arguing that it&#39;s  <br/>\nnecessary to say no, in what instances did you feel that the best  <br/>\noption has been to say no?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215599348,"authorName":"Karen","from":"Karen &lt;kldickson@...&gt;","profile":"muthahen14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168125418","msgId":20346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwZGM3MzM1MDcwMTA2MTUxNmwxYmUzOWRiNm8yYWIxMDM2ZjExNGQzNDA5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQwOS43MTJhODVlOS4zMmQxMzMxZkBhb2wuY29tPg==","referencesHeader":"PDQwOS43MTJhODVlOS4zMmQxMzMxZkBhb2wuY29tPg=="},"prevInTopic":20334,"nextInTopic":20349,"prevInTime":20345,"nextInTime":20347,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"Adriana wrote: maybe my parents said it with more respect and love?  none of us rebelled, we just loved our parents even more when they set  boundaries. it","messageBody":"<div id=\"ygrps-yiv-910567426\">Adriana wrote: maybe my parents said it with more respect and love?  none of<br/>\nus rebelled, we<br/>\njust loved our parents even more when they set  boundaries. it made us feel<br/>\nsafe. but our parents were EXTREMELY  affectionate and loving and attached<br/>\nto<br/>\nus (like glue) still are!  :-)<br/>\nI would totally agree with you Adriana.  My parents were more authoritarian<br/>\nand not physical and a *no* was a *no* and *because I said so*.  I have<br/>\nnever been able to relate to that, and I remember having trouble in high<br/>\nschool maths because with trigonometry I couldn&#39;t get the *why* we had to do<br/>\nit and the teachers just kept saying *because you need to know*, drove me<br/>\nnuts....<br/>\n<br/>\nI think too in my case I didn&#39;t respect my parents; more a fearful type of<br/>\nrespect and so I snuck around and did what I did.  I do agree that certain<br/>\nchildren need to feel boundaries to feel secure but it needs to be done in a<br/>\ngentle, caring, respectful way rather than simply done from a position of<br/>\npower.<br/>\n<br/>\nCheers<br/>\n<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 07/01/07, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:singdoula@...\">singdoula@...</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:singdoula@...\">singdoula@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; In a message dated 1/6/2007 10:16:13 A.M. Eastern Standard Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kldickson@...\">kldickson@...</a> writes:<br/>\n&gt;<br/>\n&gt; My parents said similar things and I rebelled big time - drugs,  sex,<br/>\n&gt; alcohol, staying at boyfriends homes overnight instead of where  I said I<br/>\n&gt; would be, lying etc; so I guess everyone responds  differently.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Adriana<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":263883708,"authorName":"camden","from":"&quot;camden&quot; &lt;ccoutlaw@...&gt;","profile":"ccoutlaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: No.","postDate":"1168125303","msgId":20333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzEwMWM3MzFlOCRkMDAxZWZiMCQ2NDAxYThjMEBuZXdsYXA+","referencesHeader":"PGVucDFmaytuYTduQGVHcm91cHMuY29tPg=="},"prevInTopic":20330,"nextInTopic":20334,"prevInTime":20332,"nextInTime":20334,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"~They said don t come home pregnant or ... When my two oldest ds (now 23 & 25) were in their early teen years I gave both of them a box of condoms & the offer","messageBody":"<div id=\"ygrps-yiv-1477957760\">~They said don&#39;t come home pregnant or<br/>\n<blockquote><span title=\"ireply\"> &gt; with some funky STD and so we didn&#39;t have sex~<br/>\n<br/>\n<br/>\n </span></blockquote>When my two oldest ds (now 23 & 25) were in their early teen years I gave both of them a box of condoms & the offer to discuss anything they wanted totally without judgment.  I knew that in the throws of passion, they weren&#39;t going to stop because I said so.  Mom saying &quot;No don&#39;t do that, your too young&quot;  wasn&#39;t going to deter something they felt they were ready to do.  So I wanted them prepared ~ responsibly mind & body.<br/>\n<br/>\nHere&#39;s what happened~ my youngest of the two took them to school (they were in PS at the time) and blew them up on the  bus like balloons ... LOL.  That&#39;s what he thought of having sex.  My oldest kept them for awhile & threw them away when they expired ( didn&#39;t use any )  and asked me to get him more just incase.  Neither of them (to my knowledge) got anyone pregnant or came home with a STD.<br/>\n<br/>\nI knew from the beginning  ~ and from experience ~  that my mom saying &quot;No, sex is not for the unmarried&quot;  didn&#39;t stop me from becoming pregnant at the age of 16.<br/>\n<br/>\nSo instead of saying no ........  listen & talk with your teens.  Knowing they can come to you & express themselves openly is good for them & you.<br/>\n<br/>\nCarol <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168124610","msgId":20330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjIyOEE2OUI1Mzg4OUFFMDJDQjJGOENDQUJFMEBwaHguZ2JsPg==","inReplyToHeader":"PEMyNDQ4MEVCLTYxNEEtNEMwNC1CRTg4LTJEN0IzN0JDNEQ4REBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":20329,"nextInTopic":20333,"prevInTime":20329,"nextInTime":20331,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"Agreed, good point. Wildflower ... _________________________________________________________________ The MSN Entertainment Guide to Golden Globes is here.  Get","messageBody":"<div id=\"ygrps-yiv-1119531151\">Agreed, good point.<br/>\n<br/>\nWildflower<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;Subject: Re: [unschoolingbasics] No.<br/>\n&gt;Date: Sat, 6 Jan 2007 08:14:06 -0500<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;On Jan 5, 2007, at 6:13 PM, Wildflower Car wrote:<br/>\n&gt;<br/>\n&gt; &gt; But based on title alone,<br/>\n&gt; &gt; I agree. Kids and adults need to hear no from others and also,<br/>\n&gt; &gt; maybe more<br/>\n&gt; &gt; importantly, need to know the freedom of being able to say no.<br/>\n&gt;<br/>\n&gt;While I understand what you&#39;re saying, trying to get across the idea<br/>\n&gt;that people need to know the world doesn&#39;t revolve around them, it&#39;s<br/>\n&gt;really no different than saying &quot;People need to know how to read,&quot;<br/>\n&gt;and &quot;People need to know how to do math.&quot;<br/>\n&gt;<br/>\n&gt;While those statements are true, thinking that we need to do<br/>\n&gt;something specific, eg, say no, in order to impart that lesson is a<br/>\n&gt;huge stumbling block towards unschooling.<br/>\n&gt;<br/>\n&gt;By focusing on helping our kids get what they want from life, by our<br/>\n&gt;kids seeing us working to help them within the limitations of life<br/>\n&gt;(for example, saying &quot;I&#39;d be happy to go to the grocery store in the<br/>\n&gt;morning but right now I&#39;m exhausted. Let&#39;s see if we can find a<br/>\n&gt;substitute until then,&quot; they&#39;ll figure out for themselves that the<br/>\n&gt;whole world doesn&#39;t stop for them. They don&#39;t need to hear no to<br/>\n&gt;learn that.<br/>\n&gt;<br/>\n&gt;Helping kids navigate the realities of life is a much better route to<br/>\n&gt;unschooling than saying no in order to get some lesson into them.<br/>\n&gt;<br/>\n&gt;Joyce<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>_________________________________________________________________<br/>\nThe MSN Entertainment Guide to Golden Globes is here.  Get all the scoop. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.msn.com/tv/globes2007/?icid=nctagline2\">http://tv.msn.com/tv/globes2007/?icid=nctagline2</a></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: No.","postDate":"1168123585","msgId":20329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucDhzMSs4MW04QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQwOS43MTJhODVlOS4zMmQxMzMxZkBhb2wuY29tPg=="},"prevInTopic":20328,"nextInTopic":20330,"prevInTime":20328,"nextInTime":20330,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"~~maybe my parents said it with more respect and love? none of us rebelled, we just loved our parents even more when they set boundaries. it made us feel safe.","messageBody":"<div id=\"ygrps-yiv-459731536\">~~maybe my parents said it with more respect and love? none of us<br/>\nrebelled, we just loved our parents even more when they set<br/>\nboundaries. it made us feel safe. but our parents were EXTREMELY<br/>\naffectionate and loving and attached to us (like glue) still are! :-)~~<br/>\n<br/>\nI&#39;m sorry, but there&#39;s nothing respectful about saying &quot;You better not<br/>\never come home pregnant or blah, blah, blah&quot;. It sounds like you might<br/>\nhave a hard time examining the not-so-great parts about the way you<br/>\nwere raised along with the wonderful parts. You can love your parents<br/>\ndearly and still recognize where you might do better.<br/>\n<br/>\nI&#39;ve never felt more love because someone told me &quot;you better not&quot;. It<br/>\nsounds like your upbringing was pretty sheltered in a lot of ways.<br/>\nThat, and personality may have played a big role in the kind of<br/>\nreactions that followed.<br/>\n<br/>\nMy parents were very affectionate also. Our family had a lot of<br/>\nnurture within. I never thought &quot;you better not&quot; did anything but<br/>\nhelped us learn how to hide things from them.<br/>\n<br/>\nI went to a typical public school, and out of the hundreds of kids<br/>\nthere, I know of very few that the &quot;you better not&quot; actually worked<br/>\non!! Didn&#39;t work on any of MY friends. Even the ones from very loving<br/>\nand nurturing families. I could tell you quite a few stories about the<br/>\ncrazy stuff we did!! <br/>\n<br/>\nI don&#39;t believe &quot;no you better not&quot; is EVER better than honest<br/>\ndialogue, open communication and trusting that our children WILL make<br/>\ntheir own choices regardless and the best we can do is give truthful<br/>\ninformation and be there for them.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: No.","postDate":"1168123463","msgId":20328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucDhvNytvdnI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQwOS43MTJhODVlOS4zMmQxMzMxZkBhb2wuY29tPg=="},"prevInTopic":20326,"nextInTopic":20329,"prevInTime":20327,"nextInTime":20329,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"~~maybe my parents said it with more respect and love? none of us rebelled, we just loved our parents even more when they set boundaries. it made us feel safe.","messageBody":"<div id=\"ygrps-yiv-2078306589\">~~maybe my parents said it with more respect and love? none of us<br/>\nrebelled, we just loved our parents even more when they set<br/>\nboundaries. it made us feel safe. but our parents were EXTREMELY<br/>\naffectionate and loving and attached to us (like glue) still are! :-)~~<br/>\n<br/>\nI&#39;m sorry, but there&#39;s nothing respectful about saying &quot;You better not<br/>\never come home pregnant or blah, blah, blah&quot;. It sounds like you might<br/>\nhave a hard time examining the not-so-great parts about the way you<br/>\nwere raised along with the wonderful parts. You can love your parents<br/>\ndearly and still recognize where you might do better.<br/>\n<br/>\nI&#39;ve never felt more love because someone told me &quot;you better not&quot;. It<br/>\nsounds like your upbringing was pretty sheltered in a lot of ways.<br/>\nThat, and personality may have played a big role in the kind of<br/>\nreactions that followed.<br/>\n<br/>\nMy parents were very affectionate also. Our family had a lot of<br/>\nnurture within. I never thought &quot;you better not&quot; did anything but<br/>\nhelped us learn how to hide things from them.<br/>\n<br/>\nI went to a typical public school, and out of the hundreds of kids<br/>\nthere, I know of very few that the &quot;you better not&quot; actually worked<br/>\non!! Didn&#39;t work on any of MY friends. Even the ones from very loving<br/>\nand nurturing families. I could tell you quite a few stories about the<br/>\ncrazy stuff we did!! <br/>\n<br/>\nI don&#39;t believe &quot;no you better not&quot; is EVER better than honest<br/>\ndialogue, open communication and trusting that our children WILL make<br/>\ntheir own choices regardless and the best we can do is give truthful<br/>\ninformation and be there for them.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: No.","postDate":"1168117670","msgId":20326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMyNy5lMDljNWJiLjMyZDE2OWE2QGFvbC5jb20+"},"prevInTopic":20320,"nextInTopic":20328,"prevInTime":20325,"nextInTime":20327,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/6/2007 3:44:06 P.M. Eastern Standard Time, starsuncloud@comcast.net writes: I m always surprised that this works for anyone, because it","messageBody":"<div id=\"ygrps-yiv-1108894794\">In a message dated 1/6/2007 3:44:06 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\nI&#39;m always surprised that this works for anyone, because it sure  as<br/>\nhell didn&#39;t stop ME! Open communication and trust would have  helped<br/>\nme navigate some rough years a lot better. Telling a kid &quot;NO&quot;  doesn&#39;t<br/>\nstop them. Parents are fooling themselves if they think  that&#39;s all it<br/>\ntakes. <br/>\n<br/>\n<br/>\n<br/>\ngosh it worked for almost everyone I associate with! we  grew up in a very <br/>\nclose knit community of 1st generation Slavic  people and everyone knew everyone <br/>\nelse and everyone&#39;s parents handled it  this way and none of us got into <br/>\ntrouble. I am always amazed by people who  don&#39;t listen to their parents. I did in <br/>\nsmall unharmful ways, ways they  thought were amusing, but never in ways that <br/>\ndid end up hurting my life  and future. I trusted them to be right (and they <br/>\nalways were!!) Same with  my better half&#39;s upbringing and all of our cousins <br/>\nand siblings. I guess  we just had super great families?<br/>\n <br/>\nAdriana  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: No.","postDate":"1168116020","msgId":20320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucDFmaytuYTduQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyNDU2QzFGLTBFNDQtNEM5RS1BMTJELTI2N0Y0ODI0MUZDQ0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":20311,"nextInTopic":20326,"prevInTime":20319,"nextInTime":20321,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"~They said don t come home pregnant or ... I m always surprised that this works for anyone, because it sure as hell didn t stop ME!  Open communication and","messageBody":"<div id=\"ygrps-yiv-2128045471\">~They said don&#39;t come home pregnant or<br/>\n<blockquote><span title=\"ireply\"> &gt; with some funky STD and so we didn&#39;t have sex~<br/>\n<br/>\n </span></blockquote>I&#39;m always surprised that this works for anyone, because it sure as<br/>\nhell didn&#39;t stop ME!  Open communication and trust would have helped<br/>\nme navigate some rough years a lot better. Telling a kid &quot;NO&quot; doesn&#39;t<br/>\nstop them. Parents are fooling themselves if they think that&#39;s all it<br/>\ntakes. <br/>\n<br/>\nSome kids just get really good at hiding stuff.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168103711","msgId":20311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwOS43MTJhODVlOS4zMmQxMzMxZkBhb2wuY29tPg=="},"prevInTopic":20303,"nextInTopic":20320,"prevInTime":20310,"nextInTime":20312,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/6/2007 10:16:13 A.M. Eastern Standard Time, kldickson@gmail.com writes: My parents said similar things and I rebelled big time - drugs,","messageBody":"<div id=\"ygrps-yiv-139198220\">In a message dated 1/6/2007 10:16:13 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kldickson@...\">kldickson@...</a> writes:<br/>\n<br/>\nMy parents said similar things and I rebelled big time - drugs,  sex,<br/>\nalcohol, staying at boyfriends homes overnight instead of where  I said I<br/>\nwould be, lying etc; so I guess everyone responds  differently.<br/>\n<br/>\n<br/>\n<br/>\nmaybe my parents said it with more respect and love?  none of us rebelled, we <br/>\njust loved our parents even more when they set  boundaries. it made us feel <br/>\nsafe. but our parents were EXTREMELY  affectionate and loving and attached to <br/>\nus (like glue) still are!  :-)<br/>\nAdriana   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168090293","msgId":20297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNDU2QzFGLTBFNDQtNEM5RS1BMTJELTI2N0Y0ODI0MUZDQ0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGNkMi43OGZiMDc0LjMyZDA1NGFiQGFvbC5jb20+","referencesHeader":"PGNkMi43OGZiMDc0LjMyZDA1NGFiQGFvbC5jb20+"},"prevInTopic":20296,"nextInTopic":20303,"prevInTime":20296,"nextInTime":20298,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"... And lots of parents have said similar things and kids have come home pregnant. (Or runaway pregnant.) It s not the no that makes kids listen. It s building","messageBody":"<div id=\"ygrps-yiv-1747866141\">On Jan 5, 2007, at 8:26 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:singdoula@...\">singdoula@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They  said don&#39;t come home pregnant or<br/>\n&gt; with some funky STD and so we didn&#39;t have  sex.<br/>\n<br/>\n </span></blockquote>And lots of parents have said similar things and kids have come home  <br/>\npregnant. (Or runaway pregnant.)<br/>\n<br/>\nIt&#39;s not the no that makes kids listen. It&#39;s building a relationship  <br/>\nof trust. It takes a huge amount of work to get to the point where a  <br/>\nparent can say an occasional &quot;Don&#39;t,&quot; and the child will take that to  <br/>\nheart. It&#39;s a huge huge disservice to the thoughtful work involved in  <br/>\nbuilding relationships that people discuss here and work on to boil  <br/>\nit down to a message that suggests all of that can be gotten by  <br/>\nsaying &quot;No&quot; to kids.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168089246","msgId":20296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyNDQ4MEVCLTYxNEEtNEMwNC1CRTg4LTJEN0IzN0JDNEQ4REBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PEJBWTctRjEyN0JBQzFFOUVCNkQ5MzUzNDA3QzFDQUJGMEBwaHguZ2JsPg==","referencesHeader":"PEJBWTctRjEyN0JBQzFFOUVCNkQ5MzUzNDA3QzFDQUJGMEBwaHguZ2JsPg=="},"prevInTopic":20285,"nextInTopic":20297,"prevInTime":20295,"nextInTime":20297,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"... While I understand what you re saying, trying to get across the idea that people need to know the world doesn t revolve around them, it s really no","messageBody":"<div id=\"ygrps-yiv-570431392\">On Jan 5, 2007, at 6:13 PM, Wildflower Car wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But based on title alone,<br/>\n&gt; I agree. Kids and adults need to hear no from others and also,  <br/>\n&gt; maybe more<br/>\n&gt; importantly, need to know the freedom of being able to say no.<br/>\n<br/>\n </span></blockquote>While I understand what you&#39;re saying, trying to get across the idea  <br/>\nthat people need to know the world doesn&#39;t revolve around them, it&#39;s  <br/>\nreally no different than saying &quot;People need to know how to read,&quot;  <br/>\nand &quot;People need to know how to do math.&quot;<br/>\n<br/>\nWhile those statements are true, thinking that we need to do  <br/>\nsomething specific, eg, say no, in order to impart that lesson is a  <br/>\nhuge stumbling block towards unschooling.<br/>\n<br/>\nBy focusing on helping our kids get what they want from life, by our  <br/>\nkids seeing us working to help them within the limitations of life  <br/>\n(for example, saying &quot;I&#39;d be happy to go to the grocery store in the  <br/>\nmorning but right now I&#39;m exhausted. Let&#39;s see if we can find a  <br/>\nsubstitute until then,&quot; they&#39;ll figure out for themselves that the  <br/>\nwhole world doesn&#39;t stop for them. They don&#39;t need to hear no to  <br/>\nlearn that.<br/>\n<br/>\nHelping kids navigate the realities of life is a much better route to  <br/>\nunschooling than saying no in order to get some lesson into them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215599348,"authorName":"Karen","from":"Karen &lt;kldickson@...&gt;","profile":"muthahen14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168074865","msgId":20303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwZGM3MzM1MDcwMTA2MDExNHk0YmIyYmQyZGozYjgwMGQ2NGE4YjU4ZjRhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGNkMi43OGZiMDc0LjMyZDA1NGFiQGFvbC5jb20+","referencesHeader":"PGNkMi43OGZiMDc0LjMyZDA1NGFiQGFvbC5jb20+"},"prevInTopic":20297,"nextInTopic":20311,"prevInTime":20302,"nextInTime":20304,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"Hi Adriana, Adriana wrote: They  said don t come home pregnant or with some funky STD and so we didn t have  sex. They told us that we would disgrace ourselves","messageBody":"<div id=\"ygrps-yiv-1109460817\">Hi Adriana,<br/>\nAdriana wrote: They  said don&#39;t come home pregnant or with some funky STD<br/>\nand so we didn&#39;t have  sex. They told us that we would disgrace ourselves<br/>\nforever if we  tried drugs so we never tried them. And the time<br/>\nmy mom caught me with a  &quot;clove&quot; cigarette (remember those? for those of you<br/>\nthat went to high  school in the late 80&#39;s early 90&#39;s) she said that she<br/>\nwould<br/>\nkill me  with her bare hands before the cigarettes killed me if she ever saw<br/>\nme  with one again. I remember almost instantly respecting her and loving<br/>\nher<br/>\neven more than I already did and Lord knows I never smoked one of those or<br/>\neven stood NEXT to someone smoking after that! My mom is my best friend<br/>\nin  the<br/>\nwhole world and sometimes best friends have to get tough with each  other. I<br/>\nrespect the heck out of my parents for sometimes having to get  tough and<br/>\nfeel<br/>\nsorry for children who don&#39;t have that in their  lives.<br/>\n<br/>\nMy parents said similar things and I rebelled big time - drugs, sex,<br/>\nalcohol, staying at boyfriends homes overnight instead of where I said I<br/>\nwould be, lying etc; so I guess everyone responds differently.<br/>\n<br/>\nI know my kids are relating to me a whole lot better since I have become<br/>\nmore conscious about how I word my &#39;no&#39;s&#39;.  And since I&#39;ve been conscious of<br/>\nletting go of unnecessary control (necessary control for me would be to<br/>\navoid a life threatening situation as described by you), they are more<br/>\nresponsible, think about things more and whether they really wanted what<br/>\nthey asked for after all, just an all round better situation for the whole<br/>\nfamily.  Plus, and its a big plus, my life (and I&#39;m thinking theirs too) is<br/>\nmore peaceful and joy filled.<br/>\n<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 06/01/07, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:singdoula@...\">singdoula@...</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:singdoula@...\">singdoula@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; In a message dated 1/5/2007 6:22:06 P.M. Eastern Standard Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolfool@...\">unschoolfool@...</a> writes:<br/>\n&gt;<br/>\n&gt; I  don&#39;t know anything about this book or this guy. But based on title<br/>\n&gt; alone,<br/>\n&gt; I agree. Kids and adults need to hear no from others and  also, maybe more<br/>\n&gt; importantly, need to know the freedom of being able  to say no. And if we<br/>\n&gt; want the freedom to say it, we need to accept  the reality that we&#39;ll hear<br/>\n&gt; it.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; You are so right! How can you ever learn to assert yourself if  your<br/>\n&gt; parents<br/>\n&gt; don&#39;t show you how by their example. And no isn&#39;t  always negative it is<br/>\n&gt; just<br/>\n&gt; &quot;no.&quot; Saying no, saying yes and  saying &quot;I&#39;m sorry I wish I knew but I<br/>\n&gt; don&#39;t<br/>\n&gt; know&quot; are all ways of  saying &quot;I love you.&quot;<br/>\n&gt;<br/>\n&gt; My personal pet peeve isn&#39;t with people who don&#39;t say  no, its with people<br/>\n&gt; who always speak in the same soft gentle passive voice  and never use a &quot;I<br/>\n&gt; MEAN<br/>\n&gt; BUSINESS&quot; voice. I think that really hurts  children in the long run. I<br/>\n&gt; saw a<br/>\n&gt; child raised that way get bit by a baby  rattle snake because his mom was<br/>\n&gt; saying &quot;please don&#39;t walk there,  sweetheart don&#39;t touch that, the snake<br/>\n&gt; will bite<br/>\n&gt; and it will  feel like an ouchie boo boo&quot; in almost a whisper and the 3<br/>\n&gt; year<br/>\n&gt; old simply  ignored her walked forward, reached down at the snake and got<br/>\n&gt; bit.<br/>\n&gt; I  was still pretty little but I remember back then feeling thankful  that<br/>\n&gt; my<br/>\n&gt; mom and dad would have screamed until their voices bled in order  to keep<br/>\n&gt; me<br/>\n&gt; out of danger, even if it scared me a little. And even if they  had to<br/>\n&gt; stay<br/>\n&gt; whisper quiet (as to not arouse a snake) they could do it in a  way that<br/>\n&gt; made me<br/>\n&gt; listen and do what I was told. They were such kind  gentle affectionate<br/>\n&gt; respectful people, but there were those handful of  times that they really<br/>\n&gt; told us<br/>\n&gt; the way it was going to be &quot;or else.&quot; They  said don&#39;t come home pregnant<br/>\n&gt; or<br/>\n&gt; with some funky STD and so we didn&#39;t have  sex. They told us that we would<br/>\n&gt; disgrace ourselves forever if we  tried drugs so we never tried them. And<br/>\n&gt; the time<br/>\n&gt; my mom caught me with a  &quot;clove&quot; cigarette (remember those? for those of<br/>\n&gt; you<br/>\n&gt; that went to high  school in the late 80&#39;s early 90&#39;s) she said that she<br/>\n&gt; would<br/>\n&gt; kill me  with her bare hands before the cigarettes killed me if she ever<br/>\n&gt; saw<br/>\n&gt; me  with one again. I remember almost instantly respecting her and loving<br/>\n&gt; her<br/>\n&gt; even more than I already did and Lord knows I never smoked one of those or<br/>\n&gt; even stood NEXT to someone smoking after that! My mom is my best friend<br/>\n&gt; in  the<br/>\n&gt; whole world and sometimes best friends have to get tough with each  other.<br/>\n&gt; I<br/>\n&gt; respect the heck out of my parents for sometimes having to get  tough and<br/>\n&gt; feel<br/>\n&gt; sorry for children who don&#39;t have that in their  lives.<br/>\n&gt;<br/>\n&gt; Adriana<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] No.","postDate":"1168046763","msgId":20285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkMi43OGZiMDc0LjMyZDA1NGFiQGFvbC5jb20+"},"prevInTopic":20277,"nextInTopic":20296,"prevInTime":20284,"nextInTime":20286,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/5/2007 6:22:06 P.M. Eastern Standard Time, unschoolfool@hotmail.com writes: I  don t know anything about this book or this guy. But based","messageBody":"<div id=\"ygrps-yiv-670930438\">In a message dated 1/5/2007 6:22:06 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolfool@...\">unschoolfool@...</a> writes:<br/>\n<br/>\nI  don&#39;t know anything about this book or this guy. But based on title  <br/>\nalone, <br/>\nI agree. Kids and adults need to hear no from others and  also, maybe more <br/>\nimportantly, need to know the freedom of being able  to say no. And if we <br/>\nwant the freedom to say it, we need to accept  the reality that we&#39;ll hear  <br/>\nit.<br/>\n <br/>\n<br/>\nYou are so right! How can you ever learn to assert yourself if  your parents <br/>\ndon&#39;t show you how by their example. And no isn&#39;t  always negative it is just <br/>\n&quot;no.&quot; Saying no, saying yes and  saying &quot;I&#39;m sorry I wish I knew but I don&#39;t <br/>\nknow&quot; are all ways of  saying &quot;I love you.&quot; <br/>\n <br/>\nMy personal pet peeve isn&#39;t with people who don&#39;t say  no, its with people <br/>\nwho always speak in the same soft gentle passive voice  and never use a &quot;I MEAN <br/>\nBUSINESS&quot; voice. I think that really hurts  children in the long run. I saw a <br/>\nchild raised that way get bit by a baby  rattle snake because his mom was <br/>\nsaying &quot;please don&#39;t walk there,  sweetheart don&#39;t touch that, the snake will bite <br/>\nand it will  feel like an ouchie boo boo&quot; in almost a whisper and the 3 year <br/>\nold simply  ignored her walked forward, reached down at the snake and got bit. <br/>\nI  was still pretty little but I remember back then feeling thankful  that my <br/>\nmom and dad would have screamed until their voices bled in order  to keep me <br/>\nout of danger, even if it scared me a little. And even if they  had to stay <br/>\nwhisper quiet (as to not arouse a snake) they could do it in a  way that made me <br/>\nlisten and do what I was told. They were such kind  gentle affectionate <br/>\nrespectful people, but there were those handful of  times that they really told us <br/>\nthe way it was going to be &quot;or else.&quot; They  said don&#39;t come home pregnant or <br/>\nwith some funky STD and so we didn&#39;t have  sex. They told us that we would <br/>\ndisgrace ourselves forever if we  tried drugs so we never tried them. And the time <br/>\nmy mom caught me with a  &quot;clove&quot; cigarette (remember those? for those of you <br/>\nthat went to high  school in the late 80&#39;s early 90&#39;s) she said that she would <br/>\nkill me  with her bare hands before the cigarettes killed me if she ever saw <br/>\nme  with one again. I remember almost instantly respecting her and loving her  <br/>\neven more than I already did and Lord knows I never smoked one of those or  <br/>\neven stood NEXT to someone smoking after that! My mom is my best friend in  the <br/>\nwhole world and sometimes best friends have to get tough with each  other. I <br/>\nrespect the heck out of my parents for sometimes having to get  tough and feel <br/>\nsorry for children who don&#39;t have that in their  lives.<br/>\n <br/>\nAdriana  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"No.","postDate":"1168038825","msgId":20277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjEyN0JBQzFFOUVCNkQ5MzUzNDA3QzFDQUJGMEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":20285,"prevInTime":20276,"nextInTime":20278,"topicId":20277,"numMessagesInTopic":0,"msgSnippet":"I don t know anything about this book or this guy. But based on title alone, I agree. Kids and adults need to hear no from others and also, maybe more ","messageBody":"<div id=\"ygrps-yiv-1472362520\">I don&#39;t know anything about this book or this guy. But based on title alone, <br/>\nI agree. Kids and adults need to hear no from others and also, maybe more <br/>\nimportantly, need to know the freedom of being able to say no. And if we <br/>\nwant the freedom to say it, we need to accept the reality that we&#39;ll hear  <br/>\nit.<br/>\n<br/>\nThis is one of the things I learned in my own unschool life. My parents <br/>\nnever said no. I had a very hard time saying no to anyone, and when I <br/>\nstarted trying to assert myself, I used it to harshly. Live and learn.<br/>\n<br/>\nMuch love,<br/>\nWildflower<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: &quot;polykowholsteins&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykow@...\">polykow@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;Subject: [unschoolingbasics] Kids need to hear NO from parents!<br/>\n&gt;Date: Fri, 05 Jan 2007 21:47:09 -0000<br/>\n&gt;<br/>\n&gt;I just came across this link....check out the book.<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mediafamily.org/\">http://www.mediafamily.org/</a><br/>\n&gt;<br/>\n&gt;Unbeleivable.{shake head)<br/>\n&gt;They people don&#39;t know why their kids grow up and are so unhappy, hate<br/>\n&gt;them, etc<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Alex<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>_________________________________________________________________<br/>\nDave vs. Carl: The Insignificant Championship Series. Who will win? <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/MSN/go/msnnkwsp0070000001msn/direct/01/?href=http://davevscarl.spaces.live.com/?icid=T001MSN38C07001\">http://clk.atdmt.com/MSN/go/msnnkwsp0070000001msn/direct/01/?href=http://davevscarl.spaces.live.com/?icid=T001MSN38C07001</a></div>","specialLinks":[]}],"prevTopicId":20269,"nextTopicId":20165}}