{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: pitfalls to avoid","postDate":"1091649136","msgId":2511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQTUVCRENQQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVCQ0NQQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":2491,"nextInTopic":0,"prevInTime":2510,"nextInTime":2512,"topicId":2476,"numMessagesInTopic":0,"msgSnippet":"None of  those kids had ever been to school, either.  They were just mean by nature, I guess .... The unschooled kids that I met at the conference were just","messageBody":"<div id=\"ygrps-yiv-1361818914\">&quot;None of  those kids had ever been to school, either.  They were just mean<br/>\nby nature, I guess .... The unschooled kids that I met at the conference<br/>\nwere<br/>\njust SO different from the school at home kids. &quot;<br/>\n<br/>\n<br/>\nWow, this really made me think.  Since I don&#39;t tend to think that children<br/>\nare mean &quot;naturally&quot; at all, but by something they learn or experience, I<br/>\nwonder if it&#39;s the case that the forced structuring, whether it be school at<br/>\nschool or strict school at home, somehow generates this mean quality in many<br/>\nchildren.  When I think of what it takes for a child to be &quot;mean&quot;, to<br/>\nostracize others, I wonder... could be the parents do this also, so it&#39;s<br/>\nmodeling.  But since Crystal noticed this difference, I also wonder if there<br/>\nis something sort of inherently &quot;mean&quot; about forcing children to do what<br/>\nthey do not wish to do - whether they get forced at home by carrots at the<br/>\nend of the rope or in some other way, they are being pushed down a path that<br/>\nis not what is true to who they are and they are not in control of stopping<br/>\nthat.  Someone who feels &quot;oppressed&quot; in this way, I can see why they might<br/>\nbe &quot;mean&quot; - because what they are learning is that it&#39;s good to be the one<br/>\nin control, it&#39;s good to be the one who has the carrots, and they are trying<br/>\nto grab onto that any way they can.  Maybe that is yet another excellent<br/>\nreason to unschool.<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: pitfalls to avoid","postDate":"1091626104","msgId":2491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlcW85bytzMzhkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgyLjEyM2U2YzNkLjJlNDE0NTIyQGFvbC5jb20+"},"prevInTopic":2489,"nextInTopic":2511,"prevInTime":2490,"nextInTime":2492,"topicId":2476,"numMessagesInTopic":0,"msgSnippet":"Park days were a great way to meet more people, but I found that none of us enjoyed them after a year of the same ol -same ol . The moms were mean, the kids","messageBody":"<div id=\"ygrps-yiv-965537000\">Park days were a great way to meet more people, but I found that <br/>\nnone of us enjoyed them after a year of the same ol&#39;-same ol&#39;. The <br/>\nmoms were mean, the kids were mean (but not as mean as the schooled <br/>\nkids that would show up some days). <br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\nWe&#39;ve encountered this too.  We were part of a teen game group--the <br/>\npoint of the group was for teens to get together to play games, no <br/>\nschoolwork allowed.  One day a mom brought her daughter&#39;s math <br/>\nbecause she had been resisting doing it that day.  So while the <br/>\nother kids played games this girl sat with her mom doing math.  At <br/>\none point the mom litterally screamed at her, &quot;you know this, why <br/>\ncan&#39;t you do it?&quot;.  I wanted to tell her that if she knew the girl <br/>\nknew it, then why did she have to keep doing it, but I didn&#39;t know <br/>\nthe mom well enough to speak up.  It totally ruined the mood of that <br/>\nday and my kids didn&#39;t want to go back after that.<br/>\n<br/>\nThen we moved and met up with another group of school-at-homers for <br/>\ntheir outings and park days.  They had a co-op but I told them my <br/>\nkids wouldn&#39;t be interested.  Since these kids knew each other since <br/>\nbirth they were very mean to my daughter, the new kid.  None of <br/>\nthose kids had ever been to school, either.  They were just mean by <br/>\nnature, I guess.  We spent a half a year with this group, but after <br/>\nChristmas break my kids didn&#39;t want to do things with them anymore.  <br/>\n<br/>\nSo now we just do things alone--well not alone, I have 3 kids and 2 <br/>\ngrandkids so we&#39;re a group all by ourselves.  One of the reasons we <br/>\nwanted to join that group was because we just moved to this area and <br/>\nwe didn&#39;t know what there was to do around here.  Not everything <br/>\ngets advertised in the paper.  But, we&#39;re surviving without them and <br/>\nbeing with them has given my kids a distorted view of<br/>\nwhat &quot;homeschooled kids&quot; are like.  The unschooled kids that I met <br/>\nat the conference were just SO different from the school at home <br/>\nkids.  We have lots of unschoolers in my state, though, and I have <br/>\nno problem travelling to meet them.<br/>\n<br/>\nCrystal</div>","specialLinks":[]},{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: pitfalls to avoid","postDate":"1091624765","msgId":2489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlcW12dCtrYnA0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwODA0LjA1NTY1Ny41MjE2LjE3ODQ2NEB3ZWJtYWlsMjMubnljLnVudGQuY29tPg=="},"prevInTopic":2486,"nextInTopic":2491,"prevInTime":2488,"nextInTime":2490,"topicId":2476,"numMessagesInTopic":0,"msgSnippet":"So I m really glad we started this group and my kids are thrilled to have a range of friends that don t get offended by their South Park humor and choice of","messageBody":"<div id=\"ygrps-yiv-1277370535\">&quot;So I&#39;m really glad we started this group and my kids are thrilled to <br/>\nhave a range of friends that don&#39;t get offended by their South Park <br/>\nhumor and choice of games.&quot;<br/>\n<br/>\nThanks for sharing that!  I cannot wait for the day that we have <br/>\npeople around us like that.  So many people don&#39;t understand my son&#39;s <br/>\nsense of humor!  It&#39;s over their heads most of the time. &lt;g&gt;  It will <br/>\nbe so refreshing when we actually have people around that can relate.<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"pitfalls to avoid","postDate":"1091624171","msgId":2486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODA0LjA1NTY1Ny41MjE2LjE3ODQ2NEB3ZWJtYWlsMjMubnljLnVudGQuY29tPg=="},"prevInTopic":2478,"nextInTopic":2489,"prevInTime":2485,"nextInTime":2487,"topicId":2476,"numMessagesInTopic":0,"msgSnippet":"They ll show up! Just ask Pam  G. and Priss and Ren---they ve all done it with huge success!  Yep. I m still pinching myself, because I can NOT believe how","messageBody":"<div id=\"ygrps-yiv-2141564029\">&quot;They&#39;ll show up! Just ask Pam  G. <br/>\n<br/>\nand Priss and Ren---they&#39;ve all done it with huge success! &quot;<br/>\n<br/>\nYep.<br/>\nI&#39;m still pinching myself, because I can NOT believe how many interesting, open minded homeschoolers there are in Pencacola. For those of you that don&#39;t know the area, it&#39;s part of the Bible belt/deep south where strict Baptists and spanking parents rule.<br/>\n<br/>\nThe main homeschool support group is a Christian group, very intolerant of unschoolers. I really thought we&#39;d only know a couple folks that would understand, but I got online and found a couple other families besides us.<br/>\nThat has now grown into a group that is very busy and active (except in the summer unfortunately, when we dwindle off to just a few) with EIGHT unschooling families. Three of the unschooling families are totally RADICAL and we love hanging out together frequently.<br/>\n<br/>\nAh, and then there&#39;s a couple folks up in Milton and Mobile that I expect to see this year...so we may have more radical unschoolers amongst us.:)<br/>\nOne of them is considering a move to P&#39;cola (hey Millie?)<br/>\n<br/>\nThe homeschoolers that hang out with us are either fairly relaxed/eclectic or very open minded about unschooling. To each his own kinda thing. So I&#39;m really glad we started this group and my kids are thrilled to have a range of friends that don&#39;t get offended by their South Park humor and choice of games.<br/>\n<br/>\nRen<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] pitfalls to avoid","postDate":"1091562274","msgId":2478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyLjEyM2U2YzNkLjJlNDE0NTIyQGFvbC5jb20+"},"prevInTopic":2476,"nextInTopic":2486,"prevInTime":2477,"nextInTime":2479,"topicId":2476,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/3/2004 3:19:38 PM Eastern Daylight Time, meplusfive@bellsouth.net writes: Depending on how I am feeling I can either shrug it off or begin","messageBody":"<div id=\"ygrps-yiv-1993213910\">In a message dated 8/3/2004 3:19:38 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meplusfive@...\">meplusfive@...</a> writes:<br/>\n<br/>\nDepending on how I am feeling I can either shrug it off or begin  to<br/>\nquestion myself.Not fun.Does this happen to anyone here and if so what  do<br/>\nyou do?&lt;&lt;&lt;&lt;<br/>\n <br/>\n&quot;Depending on how I&#39;m feeling&quot;----well then I wouldn&#39;t even GO if I were  <br/>\nfeeling vulnerable.<br/>\n <br/>\nBut, then again, now I just don&#39;t go! &lt;g&gt;<br/>\n <br/>\nWell, I went for months and months. Mostly I spent my time fielding  <br/>\nunschooling questions form a bunch of school-at-homers (doh!)----they always  wanted <br/>\nto know what *my* kids were doing. (Nobody ever asked *them* what their  kids <br/>\nwere doing! &lt;G&gt;)<br/>\n <br/>\nAfter a while, Duncan had made friends with a couple of kids, so we just  <br/>\nstarted asking *them* to go to the park with us. <br/>\n <br/>\nPark days were a great way to meet more people, but I found that none of us  <br/>\nenjoyed them after a year of the same ol&#39;-same ol&#39;. The moms were mean, the <br/>\nkids  were mean (but not as mean as the schooled kids that would show up some <br/>\ndays).  We&#39;re happier just inviting one other family at a time to do a park day <br/>\nnow. But  we now have a base to chose from. Park days are a GREAT way to meet <br/>\nother  homeschooling families and decide which ones to spend more time with.<br/>\n <br/>\nThere are two groups: one in Greenville, SC and a NC  group----they have SO <br/>\nmany unschoolers and relaxed, peaceful moms that we&#39;ve  been known to crash <br/>\ntheir park days and field trips because they&#39;re so much fun!  &lt;G&gt; I have to drive <br/>\ntwo hours or so, but it&#39;s worth it!<br/>\n <br/>\nMy advice would be to put up flyers in your town----at health food stores,  <br/>\nat Le Leche League meetings---you know, places that &quot;alternative types&quot; hang  <br/>\nout! &lt;g&gt; Advertise a park day for unschoolers. Start a yahoo e-group like  this <br/>\none---anyone can start one---and advertise on local homeschooling e-lists  <br/>\nthat you are starting an unschoolers&#39; group. They&#39;ll show up! Just ask Pam  G. <br/>\nand Priss and Ren---they&#39;ve all done it with huge success!  <br/>\n <br/>\nThere ARE unschoolers where you are; they&#39;re just scared or closeted or  <br/>\nunsure---and *positive* they&#39;re the ONLY ones! DO something about it!  &lt;g&gt;<br/>\n <br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":173749108,"authorName":"Sharon Thomas","from":"&quot;Sharon Thomas&quot; &lt;meplusfive@...&gt;","profile":"meplusfive","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] pitfalls to avoid","postDate":"1091560482","msgId":2476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMEZFNDIyLjAwMDAwMS4wMDUwOEBKSU0tMldNU1VRRVFKWEc+","referencesHeader":"PDEyOC40N2QzNDkyMy4yZTQxMzliZUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":2478,"prevInTime":2475,"nextInTime":2477,"topicId":2476,"numMessagesInTopic":0,"msgSnippet":"... Hanging around strict school-at-homers (doh!) and looking at curriculum catalogues. Using school-think and school-speak. Thinking that one kind of learning","messageBody":"<div id=\"ygrps-yiv-1431698971\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;What are the pitfalls to  avoid?&lt;&lt;&lt;&lt;\r<br/>\n\r<br/>\n </span></blockquote>Hanging around strict school-at-homers (doh!) and looking at curriculum  \r<br/>\ncatalogues. Using school-think and school-speak. Thinking that one kind of  \r<br/>\nlearning (academic) is more important than all other kinds. It ALL counts!\r<br/>\n\r<br/>\n\r<br/>\nKelly,\r<br/>\n I love this!!!  To see it in print really hits home.Hanging around with<br/>\nstrict homeschoolers is a biggy for me.Especially if we have had a difficult<br/>\nweek and I am feeling like &quot;what are we learning?&quot;\r<br/>\n Next is a curriculum magazine.....always seems to be one item that \r<br/>\ngrabs my attention. I imagine what would end it all though is to ask the<br/>\nkids &quot;does this look interesting?&quot;LOL\r<br/>\n  Being with other homeschoolers gives my kids time out to play.Most of our<br/>\nfriends are relaxed but there does get to be a point where the topic goes to<br/>\n&quot;too much tv. or video games&quot; etc and I feel out of place. We were very<br/>\nstrict on it and have begun to lighten up and the feeling I get from the<br/>\ndiscussion is.....it&#39;s not being a responsible parent to allow all those<br/>\nfreedoms.\r<br/>\n Depending on how I am feeling I can either shrug it off or begin to<br/>\nquestion myself.Not fun.Does this happen to anyone here and if so what do<br/>\nyou do?\r<br/>\n  sharon\r<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":2446,"nextTopicId":2517}}