{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":138862876,"authorName":"Geneva Goza","from":"&quot;Geneva Goza&quot; &lt;goza@...&gt;","profile":"nevagoza","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] EFT","postDate":"1089319215","msgId":1567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYmYwMWM0NjUyYiRjNzE5OWM0MCQ5NzlkMzJkOEBnb3phPg==","referencesHeader":"PDBJMEkwMDQ0V0xCVVZPQGwtZGFlbW9uPg=="},"prevInTopic":1544,"nextInTopic":0,"prevInTime":1566,"nextInTime":1568,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Thank you and thank you for sharing this wonderful info!! Geneva Hi Geneva, What a beautiful name! [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1899462841\">Thank you and thank you for sharing this wonderful info!!<br/>\nGeneva <br/>\n  Hi Geneva,<br/>\n<br/>\n<br/>\n  What a beautiful name!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089291927","msgId":1541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlOS4yNGFhODliOC4yZTFlYTA5N0Bhb2wuY29tPg=="},"prevInTopic":1536,"nextInTopic":1544,"prevInTime":1540,"nextInTime":1542,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/8/2004 4:54:25 AM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: Sorry if it seems like I am fighting advice again. Just","messageBody":"<div id=\"ygrps-yiv-938583647\">In a message dated 7/8/2004 4:54:25 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\nSorry if it seems like I am fighting advice again. Just explaining <br/>\nthings. VERY greatful for all the ideas, even ones I do not agree <br/>\nwith because it does not mean I will never agree with it and who is <br/>\nto say I will not need it someday!<br/>\n<br/>\n  Blessings,<br/>\n  Kimmy<br/>\n************************<br/>\nActually, Kimmy, I&#39;ve been pretty impressed by how you&#39;ve held all of the <br/>\nadvice you&#39;ve gotten. Sometimes people get really defensive, and you haven&#39;t at <br/>\nall. Getting advice here does NOT mean you have to take it.<br/>\n<br/>\nI&#39;ve been thinking about your daughter and the scary movie, and it made me <br/>\nthink about Bruno Bettelheim. He wrote a book called &quot;Uses of Enchantment,&quot; <br/>\nwhich mostly discussed how children use fairy tales to work out psychological <br/>\nissues in their development. For example, lots of fairy tales have dead moms, and <br/>\nkids might use those to process their fears of losing their mothers, or even <br/>\ntheir occasional anger at parents. (I haven&#39;t read the book in a LONG time, so <br/>\nthis might not be an accurate example.)<br/>\n<br/>\nI wonder if your daughter might be using the movie in the same way. Clearly, <br/>\nshe is processing SOMETHING. Mostly, I wouldn&#39;t worry about it a whole lot. <br/>\nWhile her fears as a result might be difficult for you to deal with right now, I <br/>\nsuspect that she got a whole lot more out of that movie than you did. (From <br/>\nyour description, it sounds like a perfectly horrid movie! ;)  )<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\nCome to the Live and Learn Unschooling Conference August 27-29 in Peabody, MA!<br/>\nFor more information, go to www.LiveandLearnConference.org<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Crystal the Brave -- TV PROBLEMS --\tNot same old, same old.","postDate":"1089284921","msgId":1536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMTJBMzc5LjI4RDg2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGNjaWF1Yitib3Q1QGVHcm91cHMuY29tPg=="},"prevInTopic":1535,"nextInTopic":1541,"prevInTime":1535,"nextInTime":1537,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"... Forgot to address that. I think the troublesome desensitizing comes when someone is *without choice* repeatedly exposed they find disturbing but they need","messageBody":"<div id=\"ygrps-yiv-1481551758\">on 7/7/04 10:18 PM, Kimberly at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I talked to hubby about it and he said it<br/>\n&gt; might de-sencitise her to things and that is not something we want<br/>\n&gt; or she needs.<br/>\n<br/>\n </span></blockquote>Forgot to address that.<br/>\n<br/>\nI think the troublesome desensitizing comes when someone is *without choice*<br/>\nrepeatedly exposed they find disturbing but they need to put up with. None<br/>\nof us wants to be desensitized to real suffering, but if our choice seems to<br/>\nbe to learn to ignore it or to suffer ourselves, we often choose to shut<br/>\nthat part of us off and become desensitized to suffering.<br/>\n<br/>\nIf Crystal was being exposed to violent movies that she didn&#39;t want to see<br/>\nand couldn&#39;t get away from, that&#39;s different than choosing to watch a<br/>\nviolent movie, or choosing to watch it repeatedly so she can get over<br/>\nfeeling upset.<br/>\n<br/>\nI can watch horror movies that aren&#39;t set in modern times. But that hasn&#39;t<br/>\nat all desensitized me to real gore. I *don&#39;t* want to see traffic<br/>\naccidents. I *don&#39;t* want to see real people&#39;s heads blown up. Same with<br/>\nchoosing to play violent video games. There&#39;s a clear division between<br/>\nwhat&#39;s acceptable to see pretended and what&#39;s acceptable to allow to happen<br/>\nin real life to real people.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Crystal the Brave -- TV PROBLEMS --\tNot same old, same old.","postDate":"1089284195","msgId":1535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMTJBMEEzLjI4RDg2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGNjaWF1Yitib3Q1QGVHcm91cHMuY29tPg=="},"prevInTopic":1534,"nextInTopic":1536,"prevInTime":1534,"nextInTime":1536,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"... The early years can leave us with the feeling of When s it *my* turn? I keep giving and giving and not only is no one giving to me, I can t even take. ","messageBody":"<div id=\"ygrps-yiv-143988663\">on 7/7/04 10:18 PM, Kimberly at Kontessa_Rose@... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With hubby now having one day off a week<br/>\n&gt; and it having been his birthday, we wanted some time alone and<br/>\n&gt; seeing it was midnight and do not force her to go to sleep at a<br/>\n&gt; certain time, we seem to have little choice.<br/>\n<br/>\n </span></blockquote>The early years can leave us with the feeling of &quot;When&#39;s it *my* turn? I<br/>\nkeep giving and giving and not only is no one giving to me, I can&#39;t even<br/>\ntake.&quot;<br/>\n<br/>\nUnfortunately that&#39;s the reality of those years and it helps loads to accept<br/>\nthat that&#39;s how it is for now and that it *will* change. She will get older.<br/>\nShe will be able to understand things on a different level.<br/>\n<br/>\nFrom how you described your old style of parenting, Crystal knew that her<br/>\nneeds had to be sacrificed when you decided your needs had to be met. So<br/>\neven if you just express that you have needs, she&#39;s still going to hear &quot;so<br/>\nhere&#39;s what you have to sacrifice,&quot; even if you don&#39;t mean that any more.<br/>\nIt&#39;s going to take her a while to gain confidence that you having needs<br/>\ndoesn&#39;t mean she *has* to give something up.<br/>\n<br/>\nShe needs to gain confidence that her needs are number one in your book.<br/>\n(Your own needs are also number one but you won&#39;t find it acceptable to<br/>\nsacrifice her needs for yours any more. Your goal is to find a solution that<br/>\nworks for both of you.)<br/>\n<br/>\nSo rather than setting her up with something to do so you can cross your<br/>\nfingers and hope you can snatch alone time, it would help if you&#39;re honest<br/>\nwith her and tell her what your needs are. For instance: &quot;Daddy and I<br/>\nhaven&#39;t gotten to watch one of those movies adults like and kids don&#39;t for a<br/>\nlong time and I&#39;d like to give that to him as a present. How could we do<br/>\nthat? It&#39;ll take about 2 hours so how could we work that out?&quot;<br/>\n<br/>\nAnd then one of the hard parts is actually hearing those suggestions and<br/>\ntaking them seriously. You might need to think outside the box! If she<br/>\nsuggests watching at 4AM it might seem easy to laugh and dismiss it, but<br/>\nyou&#39;ll need to consider whether it might actually work. (But don&#39;t be afraid<br/>\nof honestly saying when something won&#39;t work.) The more she&#39;s treated as<br/>\ndoing the best she can, the better her best will be. :-)<br/>\n<br/>\nShe migtht come up with a great solution and then not be able to follow<br/>\nthrough -- like she might suggest she play a game with your friend&#39;s son for<br/>\n2 hours but the game only lasts 10 mintues (so it&#39;s helpful to come up with<br/>\ncontingency plans with her!) -- but that doesn&#39;t mean it didn&#39;t work. There<br/>\nare going to be rocks in the road and you&#39;ll have to accept that her actions<br/>\ndon&#39;t necessarily reflect her intent. She may want to give you two hours but<br/>\nnot be able to understand what that really means or how to go about it. So<br/>\nyou can remind her that she was helping you give Daddy 2 hours to watch a<br/>\nmovie, so how can she make that happen.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As for letting her watch it over and over. This is something I<br/>\n&gt; need to think about more. I talked to hubby about it and he said it<br/>\n&gt; might de-sencitise her to things and that is not something we want<br/>\n&gt; or she needs. But also, it is NOTHING like the matrix, have any of<br/>\n&gt; you seen it? It is the grossest movie I have ever seen. I do not<br/>\n&gt; think I want it in the house, disturbing!<br/>\n<br/>\n </span></blockquote>If she&#39;s *asking* to watch it again, that&#39;s different than making her watch<br/>\nit. Perhaps part of her is understanding that it&#39;s not real and another part<br/>\nis saying it is real so she understands her need to watch it again is a way<br/>\nof showing the &quot;It&#39;s real&quot; part of her that it&#39;s wrong.<br/>\n<br/>\n(Yes, I&#39;ve seen it. And, yes, it&#39;s gross. I *think* it was deliberately<br/>\nover-the-top gross as an attempt to be a satire on graphic violence.)<br/>\n<br/>\nI&#39;d second the suggestion to watch any &quot;making of&quot; extras on the DVD. (Do<br/>\nyou have access to the local library system or only if you live off base?<br/>\nThe movie has been out for a while so it might be in one of the nearby<br/>\nlibraries for free. Another option might be checking on Half.com<br/>\n(http://www.half.com) and buying a used one. It&#39;s possible it might be<br/>\ncheaper than renting -- and then you can sell it when she&#39;s done if the<br/>\nprocess is something that might take a week or two to work through.)<br/>\n<br/>\nWhat about you sleeping with her in her room until she works through this?<br/>\nYou can reassure your hasband that it won&#39;t be forever and that the more she<br/>\nfeels you&#39;re there for her through her fears, the less time it will take.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":95670547,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;sherri--lee@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089264824","msgId":1534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBJMEkwMEgwWVE0RVVEQGwtZGFlbW9uPg==","inReplyToHeader":"PGNjaWF1Yitib3Q1QGVHcm91cHMuY29tPg=="},"prevInTopic":1531,"nextInTopic":1535,"prevInTime":1533,"nextInTime":1535,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Hi Kimmy, I have seen both movies and I agree with you Starship Troopers is not in the same realm as The Matrix movies. I would hesitate to use the","messageBody":"<div id=\"ygrps-yiv-222157347\">Hi Kimmy,<br/>\n<br/>\n <br/>\n<br/>\nI have seen both movies and I agree with you Starship Troopers is not in the<br/>\nsame realm as The Matrix movies.<br/>\n<br/>\n <br/>\n<br/>\nI would hesitate to use the &quot;de-sensitize&quot; her idea as well. This might work<br/>\nfor some kids, it might de-sensitize them to things you don&#39;t want them to<br/>\nbe de-sensitized too and on another hand, it might just serve to heighten<br/>\nthe sensitivity.<br/>\n<br/>\n <br/>\n<br/>\nIn my family, de-sensitizing was the theme for me, as I was always perceived<br/>\nto be TOO sensitive. So it was believed that if I was just tormented enough<br/>\nI would stop being TOO sensitive. I had rubber spiders and snakes thrown at<br/>\nme regularly, to this day I still shake when I see them in stores and can<br/>\nnot touch a page with them on it. I was forced into dark rooms and am still<br/>\nafraid of the dark. I was forced to eat worms and still am afraid of them.<br/>\nIt went on and on.. I won&#39;t bore you. The end result is, all these things<br/>\nwere/are still funny to my family, my reaction is still funny and I am even<br/>\nMORE sensitive than before. None of it de-sensitized me. it heightened my<br/>\nsensitivity to having an expectation of people doing the worst to me always.<br/>\nLots of work to get over it. <br/>\n<br/>\n <br/>\n<br/>\nI am not suggesting that you are doing any of this, just saying that I<br/>\nimmediately felt caution about the idea of letting her watch it over and<br/>\nover as it MIGHT de-sensitize her, but it might not. Only you will know<br/>\nwhich way it will go as she is your child, just wanted to add that caution.<br/>\n<br/>\n <br/>\n<br/>\nAnd I just wanted to say I understand your caution about the privacy issue.<br/>\nI think people in the military live in a different world than the rest of us<br/>\nwith a completely separate list of fears and concerns, and if this is a<br/>\nboundary issue for your family then you need to listen to that,<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nSherri-Lee<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: Kimberly [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a>] <br/>\nSent: Wednesday, July 07, 2004 7:19 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Re: Crystal the Brave -- TV PROBLEMS -- Not<br/>\nsame old, same old.<br/>\n<br/>\n <br/>\n<br/>\nThank you all for the help. I had not thought about showing her the <br/>\nmaking of the movie. Sadly hubby already returned the movie before <br/>\ngoing to work. But we will rent it again. <br/>\n<br/>\nAs for why she watched the movie. It could have been her wanting to <br/>\nspend time with us, she had spent all day with her Daddy and I <br/>\nalready and seemed very ready to go do her own thing. It would have <br/>\nbeen best for us maybe to just set things fun up for them to do and <br/>\nlet them have at it if they chose without makeing it seem like it <br/>\nwas something to do other then being with us. I do not think she <br/>\nknows we would have put the movie off to be with her, and honestly I <br/>\ndo not think we would have. With hubby now having one day off a week <br/>\nand it having been his birthday, we wanted some time alone and <br/>\nseeing it was midnight and do not force her to go to sleep at a <br/>\ncertain time, we seem to have little choice. He could only stay up <br/>\nso late as he had a double shift today to be ready for. I envy those <br/>\npeople who have a bendable lifestyle and job, but my husband does <br/>\nnot. He is a soldier, and in his job of MI, he has to be in top <br/>\nshape at all times, there is no being late to work, or being sleepy <br/>\nat all on the job. I swear she only sleeps 1. when hubby is working, <br/>\nand 2. when she can not possibly stay awake any longer. Some things <br/>\nare very hard to make flexable. He and I both deserve to have time <br/>\ntogether, relax and watch tv. And Goddess forbid, sometimes, be <br/>\nalone even! <br/>\n<br/>\nAnd that brings me to our bed room. On occation we let her sleep <br/>\nwith us, mostly when my hubby is away on missions. Sadly my husband <br/>\nfeels very strongly about personal space and on some things I agree. <br/>\nA friend, another soldier was convicted of being a child molester by <br/>\na little girl who we believed was talking into it by her scamming <br/>\nmother. In short, the military has over an 80% conviction rate. No <br/>\nevidence was found, just her word against his. He lost. In this day <br/>\nand age, we have to worry about such things. My husband does not <br/>\neven baby sit now. We are stiving to teach Crystal that bed rooms <br/>\nare personal spaces and bathrooms are to be used alone. Sorry if <br/>\nthis bothers some people. Not everything works for everyone. And we <br/>\nmust respect our feeling as much as our childs. Some people NEED <br/>\nmore space then others. <br/>\n<br/>\n  As for letting her watch it over and over. This is something I <br/>\nneed to think about more. I talked to hubby about it and he said it <br/>\nmight de-sencitise her to things and that is not something we want <br/>\nor she needs. But also, it is NOTHING like the matrix, have any of <br/>\nyou seen it? It is the grossest movie I have ever seen. I do not <br/>\nthink I want it in the house, disturbing! <br/>\n<br/>\nA sci-fi movie was on today, an old one called spiders. I put it on <br/>\nand asked her if she wanted to watch it. She stopped for a sec, then <br/>\nwent back to playing. I was very happy to find something else to <br/>\nwatch! <br/>\n<br/>\nSorry if it seems like I am fighting advice again. Just explaining <br/>\nthings. VERY greatful for all the ideas, even ones I do not agree <br/>\nwith because it does not mean I will never agree with it and who is <br/>\nto say I will not need it someday!<br/>\n<br/>\n  Blessings,<br/>\n  Kimmy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129k2kpr6/M=295196.4901138.6071305.3001176/D=gr\">http://us.ard.yahoo.com/SIG=129k2kpr6/M=295196.4901138.6071305.3001176/D=gr</a><br/>\noups/S=1705081972:HM/EXP=1089342706/A=2128215/R=0/SIG=10se96mf6/*http:/compa<br/>\nnion.yahoo.com&gt; click here<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=\">http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=</a><br/>\n:HM/A=2128215/rand=447238024&gt; <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*\tTo visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n*\tTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*\tYour use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":107504422,"authorName":"jesika hare","from":"jesika hare &lt;jesika2starr@...&gt;","profile":"jesika2starr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] EFT","postDate":"1089260952","msgId":1544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzA4MDQyOTEyLjQ3NTcwLnFtYWlsQHdlYjUzOTA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDBJMEkwMDQ0V0xCVVZPQGwtZGFlbW9uPg=="},"prevInTopic":1541,"nextInTopic":1567,"prevInTime":1543,"nextInTime":1545,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"my hypnobirthing teacher, heather told me about this...... it really works!!","messageBody":"<div id=\"ygrps-yiv-1670415922\">my hypnobirthing teacher, heather told me about<br/>\nthis...... it really works!!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- Sherri-Lee Pressman &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sherri--lee@...\">sherri--lee@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; EFT, is Emotional Freedom Technique. All info about<br/>\n&gt; it from the person who<br/>\n&gt; designed it can be found at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.emofree.com\">http://www.emofree.com</a><br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.emofree.com/\">http://www.emofree.com/</a>&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":95670547,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;sherri--lee@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"EFT","postDate":"1089258613","msgId":1531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBJMEkwMDQ0V0xCVVZPQGwtZGFlbW9uPg==","inReplyToHeader":"PDAyMGMwMWM0NjQ1MSRjMDU1MjJiMCQyNDlmMzJkOEBnb3phPg=="},"prevInTopic":1527,"nextInTopic":1534,"prevInTime":1530,"nextInTime":1532,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Hi Geneva, What a beautiful name! EFT, is Emotional Freedom Technique. All info about it from the person who designed it can be found at http://www.emofree.com","messageBody":"<div id=\"ygrps-yiv-886665589\">Hi Geneva,<br/>\n<br/>\n<br/>\nWhat a beautiful name!<br/>\n<br/>\n <br/>\n<br/>\nEFT, is Emotional Freedom Technique. All info about it from the person who<br/>\ndesigned it can be found at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.emofree.com\">http://www.emofree.com</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.emofree.com/\">http://www.emofree.com/</a>&gt;<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nEssentially, you use your fingers to tap on certain areas of your body<br/>\n(meridian and acupuncture points) while thinking of an emotional issue. So<br/>\nyou could get yourself REALLY afraid of the dark. feel it, immerse yourself<br/>\nin it get it right in your face, then tap on the spots while thinking about<br/>\nit. Amazingly at the end of it, you will likely feel less fear of that<br/>\nissue.<br/>\n<br/>\n <br/>\n<br/>\nFor me I had to go back to specific issues as a child that had triggered<br/>\nthis fear and get myself emotionally involved in the story again, then tap<br/>\non it and now I am leaving the door between the bathroom and my bedroom open<br/>\nWITH the bathroom window open all night long! To me that is no small<br/>\nvictory. I can&#39;t leave the door open out of the bedroom yet, or the sliding<br/>\ndoors, but am working on it. It is literally the most powerful technique I<br/>\nhave ever come across and has helped me immensely.<br/>\n<br/>\n<br/>\nThe best part is old knee jerk reactions I would have to my mom or brothers<br/>\nsay from childhood, that I just didn&#39;t feel like I had any control over,<br/>\nhave been cleared up with this. So that now, we get together and my brother<br/>\nwill try to push the old buttons, I see him and it for what it is and don&#39;t<br/>\nreact the same old way which just leaves him completely flustered and<br/>\nwithout a clue what to do next. It has made the small amount of time I spend<br/>\nwith him tolerable and the time I spend with my mom, less emotionally<br/>\ncharged and more pleasant for us all.<br/>\n<br/>\n <br/>\n<br/>\nThere is a manual on the site you can download and you can learn how to do<br/>\nit (it is so simple, my 4 year old daughter does it on herself and us) and<br/>\nstart chipping away at the old things.<br/>\n<br/>\n <br/>\n<br/>\nGood luck,<br/>\n<br/>\n<br/>\nSherri-Lee<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: Geneva Goza [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:goza@...\">goza@...</a>] <br/>\nSent: Wednesday, July 07, 2004 11:40 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not<br/>\nsame old, same old.<br/>\n<br/>\n <br/>\n<br/>\nAmen - I&#39;m 29 and scared of the dark too...What is EFT?  <br/>\nGeneva <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nNot sure I have any advice, but this is one of the reasons, why I like when<br/>\ndd goes to bed earlier than me and dh. We can watch what ever movie we want<br/>\nthen and I think as a couple we deserve some time to ourselves to watch<br/>\nadult content shows that might not be appropriate for her.<br/>\n<br/>\n<br/>\n<br/>\nAs a person who is still afraid of the dark (I am almost 41) and just<br/>\nrecently have found using EFT helping with my inability to sleep with an<br/>\nopen door or window in my room, because of the horror movies I watched as a<br/>\nchild (and then added terrorism by brothers) I am protective of my dd. She<br/>\njust does not get it when I tell her it is too scary, she thinks she can<br/>\nhandle anything... great. but it is up to me to protect her from somethings<br/>\nsometimes.<br/>\n<br/>\n<br/>\n<br/>\nNot sure what you can do now, except lots of talking and reassuring and<br/>\nsnuggling and no forcing her to deal with the dark sooner than she is ready.<br/>\n<br/>\n<br/>\n<br/>\nSorry I am no help, but I can really feel for you,<br/>\n<br/>\n<br/>\n<br/>\nSherri-Lee<br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: Kimberly [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a>] <br/>\nSent: Tuesday, July 06, 2004 11:00 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same<br/>\nold, same old.<br/>\n<br/>\n<br/>\n<br/>\nAdvice needed. <br/>\n<br/>\nOnce again I am feeling like a bad mother. Hubby and I rented a <br/>\nmovie, Starship Troopers 2, set the kids up in another room with lots <br/>\nto do and freedom to do it. As it turns out all our daughter wants to <br/>\ndo is be with us. We tell her it is a scary movie about bugs and that <br/>\nwe would rather she not watch it. We try to explain it. But she <br/>\ninsists and so taking advice found here, I give in and let her. <br/>\n<br/>\nOMG that was the worst, grossest, freakiest, movie I have ever seen. <br/>\nWorst then resident evil. And my daughter watched it all... did not <br/>\neven flinch. She wanted to watch it again after it was over. I tried <br/>\nto talk to her about it. She thinks the big spiders are real, she <br/>\nthinks everything on TV is real and I have no clue how to explain it <br/>\nto her that it is not. And even though she wants to see it again, she <br/>\nis not wanting to sleep alone or let any of us sleep in our rooms. <br/>\n<br/>\nI just can not believe I let her watch that. She is only 4 years <br/>\nold! I think I am the one in shock. I wish I had not seen it. <br/>\nNow she will not go into a dark room alone... I asked her to draw a <br/>\npicture of the monster she thinks is in my bathroom. Happy she did <br/>\nnot draw a spider, just a one eyed monster that is very tall! LOL <br/>\n<br/>\nOk, so I know I might be over reacting, but I remember still the <br/>\nhorror movies my parents let me watch as a child, and I wish they <br/>\nhadn&#39;t. We do not always know what is best for us, never mind at age <br/>\n4!<br/>\n<br/>\n  Crystal the Brave... leaving lights on for years to come! <br/>\n<br/>\n  Blessings,<br/>\n  Kimmy<br/>\n<br/>\nP.S. I must say, I am doing a great job not showing her how freaked <br/>\nI am about all this. Trying not to react till I have a better idea <br/>\nhow best to do so for her!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129mu5946/M=295196.4901138.6071305.3001176/D=gr\">http://us.ard.yahoo.com/SIG=129mu5946/M=295196.4901138.6071305.3001176/D=gr</a><br/>\noups/S=1705081972:HM/EXP=1089290047/A=2128215/R=0/SIG=10se96mf6/*http:/compa<br/>\nnion.yahoo.com&gt; click here<br/>\n<br/>\n<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=\">http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=</a><br/>\n:HM/A=2128215/rand=731129736&gt; <br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*      To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n*      To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*      Your use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n----<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129cdv5ui/M=295196.4901138.6071305.3001176/D=gr\">http://us.ard.yahoo.com/SIG=129cdv5ui/M=295196.4901138.6071305.3001176/D=gr</a><br/>\noups/S=1705081972:HM/EXP=1089316905/A=2128215/R=0/SIG=10se96mf6/*http:/compa<br/>\nnion.yahoo.com&gt; click here<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=\">http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=</a><br/>\n:HM/A=2128215/rand=656991830&gt; <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*\tTo visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n*\tTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*\tYour use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089255071","msgId":1525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":1522,"nextInTopic":1527,"prevInTime":1524,"nextInTime":1526,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Jayn is afraid of only real spiders, flies, moths, beetles, roaches, small dogs and snails (for crying out loud, snails? Yup). Sometimes she won t go into dark","messageBody":"<div id=\"ygrps-yiv-405440594\">Jayn is afraid of only real spiders, flies, moths, beetles, roaches, small<br/>\ndogs and snails (for crying out loud, snails? Yup). Sometimes she won&#39;t go<br/>\ninto dark rooms and other times doesn&#39;t care at all - for the same room. She<br/>\nstill sleeps with us regardless of whether she is in a scared mood or not. <br/>\n<br/>\nJayn watches movies over and over. She asks me to fast forward scary scenes,<br/>\nnone of which seem to relate to her real fears as noted above, but often<br/>\n(but not always) have to do with loud noises or explosions and demolitions.<br/>\nUsually what may scare her the first time, like the Spiderman movie, will<br/>\nsubsequently become not scary when she revisits it on her own timetable.<br/>\nOften she is scared by animated things ahead of live action. It is really<br/>\nquite baffling and pretty much unpredictable.<br/>\n<br/>\nAll I can do is honor all her fears, chase away the flies, and go with her<br/>\ninto the dark rooms as much as she wants me to. In Jayn&#39;s case (which seems<br/>\nto place her entirely in the minority to judge by other folks&#39; stories) I do<br/>\nnot try to warn her in advance re movies or tv - since she just digs her<br/>\nheels in, and usually I am wrong anyway.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.714 / Virus Database: 470 - Release Date: 7/2/2004</div>","specialLinks":[]},{"userId":51071079,"authorName":"Kimberly","from":"&quot;Kimberly&quot; &lt;Kontessa_Rose@...&gt;","profile":"kontessa_rose","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089253131","msgId":1527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjaWF1Yitib3Q1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDIwMWM0NjQ4NCQ2ZWQ5YmE4MCQ2NDAwYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":1525,"nextInTopic":1531,"prevInTime":1526,"nextInTime":1528,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Thank you all for the help. I had not thought about showing her the making of the movie. Sadly hubby already returned the movie before going to work. But we","messageBody":"<div id=\"ygrps-yiv-1992509817\">Thank you all for the help. I had not thought about showing her the <br/>\nmaking of the movie. Sadly hubby already returned the movie before <br/>\ngoing to work. But we will rent it again. <br/>\n<br/>\n As for why she watched the movie. It could have been her wanting to <br/>\nspend time with us, she had spent all day with her Daddy and I <br/>\nalready and seemed very ready to go do her own thing. It would have <br/>\nbeen best for us maybe to just set things fun up for them to do and <br/>\nlet them have at it if they chose without makeing it seem like it <br/>\nwas something to do other then being with us. I do not think she <br/>\nknows we would have put the movie off to be with her, and honestly I <br/>\ndo not think we would have. With hubby now having one day off a week <br/>\nand it having been his birthday, we wanted some time alone and <br/>\nseeing it was midnight and do not force her to go to sleep at a <br/>\ncertain time, we seem to have little choice. He could only stay up <br/>\nso late as he had a double shift today to be ready for. I envy those <br/>\npeople who have a bendable lifestyle and job, but my husband does <br/>\nnot. He is a soldier, and in his job of MI, he has to be in top <br/>\nshape at all times, there is no being late to work, or being sleepy <br/>\nat all on the job. I swear she only sleeps 1. when hubby is working, <br/>\nand 2. when she can not possibly stay awake any longer. Some things <br/>\nare very hard to make flexable. He and I both deserve to have time <br/>\ntogether, relax and watch tv. And Goddess forbid, sometimes, be <br/>\nalone even! <br/>\n<br/>\n And that brings me to our bed room. On occation we let her sleep <br/>\nwith us, mostly when my hubby is away on missions. Sadly my husband <br/>\nfeels very strongly about personal space and on some things I agree. <br/>\nA friend, another soldier was convicted of being a child molester by <br/>\na little girl who we believed was talking into it by her scamming <br/>\nmother. In short, the military has over an 80% conviction rate. No <br/>\nevidence was found, just her word against his. He lost. In this day <br/>\nand age, we have to worry about such things. My husband does not <br/>\neven baby sit now. We are stiving to teach Crystal that bed rooms <br/>\nare personal spaces and bathrooms are to be used alone. Sorry if <br/>\nthis bothers some people. Not everything works for everyone. And we <br/>\nmust respect our feeling as much as our childs. Some people NEED <br/>\nmore space then others. <br/>\n<br/>\n  As for letting her watch it over and over. This is something I <br/>\nneed to think about more. I talked to hubby about it and he said it <br/>\nmight de-sencitise her to things and that is not something we want <br/>\nor she needs. But also, it is NOTHING like the matrix, have any of <br/>\nyou seen it? It is the grossest movie I have ever seen. I do not <br/>\nthink I want it in the house, disturbing! <br/>\n<br/>\n A sci-fi movie was on today, an old one called spiders. I put it on <br/>\nand asked her if she wanted to watch it. She stopped for a sec, then <br/>\nwent back to playing. I was very happy to find something else to <br/>\nwatch! <br/>\n<br/>\n Sorry if it seems like I am fighting advice again. Just explaining <br/>\nthings. VERY greatful for all the ideas, even ones I do not agree <br/>\nwith because it does not mean I will never agree with it and who is <br/>\nto say I will not need it someday!<br/>\n<br/>\n  Blessings,<br/>\n  Kimmy</div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"ruekream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089247342","msgId":1522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDIwMWM0NjQ4NCQ2ZWQ5YmE4MCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":1506,"nextInTopic":1525,"prevInTime":1521,"nextInTime":1523,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"... do is be with us. **If she wanted to be with you she might just have said she wanted to watch the movie to get to spend time with you.  Did she know you","messageBody":"<div id=\"ygrps-yiv-1318629905\"><blockquote><span title=\"ireply\">&gt;&gt;As it turns out all our daughter wants to<br/>\n </span></blockquote>do is be with us.<br/>\n<br/>\n**If she wanted to be with you she might just have said she wanted to watch<br/>\nthe movie to get to spend time with you.  Did she know you would shut off<br/>\nthe movie and be with her if she didn&#39;t want to watch it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;she<br/>\n </span></blockquote>thinks everything on TV is real and I have no clue how to explain it<br/>\nto her that it is not.<br/>\n<br/>\n**DVDs often have behind the scenes information on them.  Maybe she could<br/>\nsee how they make the spiders.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; she<br/>\n </span></blockquote>is not wanting to sleep alone or let any of us sleep in our rooms.<br/>\n<br/>\n**Will she sleep with you in your room?  ~Rue<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138862876,"authorName":"Geneva Goza","from":"&quot;Geneva Goza&quot; &lt;goza@...&gt;","profile":"nevagoza","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089225574","msgId":1506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMGMwMWM0NjQ1MSRjMDU1MjJiMCQyNDlmMzJkOEBnb3phPg==","referencesHeader":"PDBJMEgwMEs0M1UwQVcwQGwtZGFlbW9uPg=="},"prevInTopic":1496,"nextInTopic":1522,"prevInTime":1505,"nextInTime":1507,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Amen - I m 29 and scared of the dark too...What is EFT? Geneva Not sure I have any advice, but this is one of the reasons, why I like when dd goes to bed","messageBody":"<div id=\"ygrps-yiv-1332412349\">Amen - I&#39;m 29 and scared of the dark too...What is EFT?  <br/>\nGeneva <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nNot sure I have any advice, but this is one of the reasons, why I like when<br/>\ndd goes to bed earlier than me and dh. We can watch what ever movie we want<br/>\nthen and I think as a couple we deserve some time to ourselves to watch<br/>\nadult content shows that might not be appropriate for her.<br/>\n<br/>\n<br/>\n<br/>\nAs a person who is still afraid of the dark (I am almost 41) and just<br/>\nrecently have found using EFT helping with my inability to sleep with an<br/>\nopen door or window in my room, because of the horror movies I watched as a<br/>\nchild (and then added terrorism by brothers) I am protective of my dd. She<br/>\njust does not get it when I tell her it is too scary, she thinks she can<br/>\nhandle anything... great. but it is up to me to protect her from somethings<br/>\nsometimes.<br/>\n<br/>\n<br/>\n<br/>\nNot sure what you can do now, except lots of talking and reassuring and<br/>\nsnuggling and no forcing her to deal with the dark sooner than she is ready.<br/>\n<br/>\n<br/>\n<br/>\nSorry I am no help, but I can really feel for you,<br/>\n<br/>\n<br/>\n<br/>\nSherri-Lee<br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: Kimberly [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a>] <br/>\nSent: Tuesday, July 06, 2004 11:00 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same<br/>\nold, same old.<br/>\n<br/>\n<br/>\n<br/>\nAdvice needed. <br/>\n<br/>\nOnce again I am feeling like a bad mother. Hubby and I rented a <br/>\nmovie, Starship Troopers 2, set the kids up in another room with lots <br/>\nto do and freedom to do it. As it turns out all our daughter wants to <br/>\ndo is be with us. We tell her it is a scary movie about bugs and that <br/>\nwe would rather she not watch it. We try to explain it. But she <br/>\ninsists and so taking advice found here, I give in and let her. <br/>\n<br/>\nOMG that was the worst, grossest, freakiest, movie I have ever seen. <br/>\nWorst then resident evil. And my daughter watched it all... did not <br/>\neven flinch. She wanted to watch it again after it was over. I tried <br/>\nto talk to her about it. She thinks the big spiders are real, she <br/>\nthinks everything on TV is real and I have no clue how to explain it <br/>\nto her that it is not. And even though she wants to see it again, she <br/>\nis not wanting to sleep alone or let any of us sleep in our rooms. <br/>\n<br/>\nI just can not believe I let her watch that. She is only 4 years <br/>\nold! I think I am the one in shock. I wish I had not seen it. <br/>\nNow she will not go into a dark room alone... I asked her to draw a <br/>\npicture of the monster she thinks is in my bathroom. Happy she did <br/>\nnot draw a spider, just a one eyed monster that is very tall! LOL <br/>\n<br/>\nOk, so I know I might be over reacting, but I remember still the <br/>\nhorror movies my parents let me watch as a child, and I wish they <br/>\nhadn&#39;t. We do not always know what is best for us, never mind at age <br/>\n4!<br/>\n<br/>\n  Crystal the Brave... leaving lights on for years to come! <br/>\n<br/>\n  Blessings,<br/>\n  Kimmy<br/>\n<br/>\nP.S. I must say, I am doing a great job not showing her how freaked <br/>\nI am about all this. Trying not to react till I have a better idea <br/>\nhow best to do so for her!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129mu5946/M=295196.4901138.6071305.3001176/D=gr\">http://us.ard.yahoo.com/SIG=129mu5946/M=295196.4901138.6071305.3001176/D=gr</a><br/>\noups/S=1705081972:HM/EXP=1089290047/A=2128215/R=0/SIG=10se96mf6/*http:/compa<br/>\nnion.yahoo.com&gt; click here<br/>\n<br/>\n<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=\">http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=</a><br/>\n:HM/A=2128215/rand=731129736&gt; <br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*      To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n*      To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*      Your use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":95670547,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;sherri--lee@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089223205","msgId":1496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBJMEgwMEs0M1UwQVcwQGwtZGFlbW9uPg==","inReplyToHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":1491,"nextInTopic":1506,"prevInTime":1495,"nextInTime":1497,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"HI Kimmy, Not sure I have any advice, but this is one of the reasons, why I like when dd goes to bed earlier than me and dh. We can watch what ever movie we","messageBody":"<div id=\"ygrps-yiv-726979995\">HI Kimmy,<br/>\n<br/>\n <br/>\n<br/>\nNot sure I have any advice, but this is one of the reasons, why I like when<br/>\ndd goes to bed earlier than me and dh. We can watch what ever movie we want<br/>\nthen and I think as a couple we deserve some time to ourselves to watch<br/>\nadult content shows that might not be appropriate for her.<br/>\n<br/>\n <br/>\n<br/>\nAs a person who is still afraid of the dark (I am almost 41) and just<br/>\nrecently have found using EFT helping with my inability to sleep with an<br/>\nopen door or window in my room, because of the horror movies I watched as a<br/>\nchild (and then added terrorism by brothers) I am protective of my dd. She<br/>\njust does not get it when I tell her it is too scary, she thinks she can<br/>\nhandle anything... great. but it is up to me to protect her from somethings<br/>\nsometimes.<br/>\n<br/>\n <br/>\n<br/>\nNot sure what you can do now, except lots of talking and reassuring and<br/>\nsnuggling and no forcing her to deal with the dark sooner than she is ready.<br/>\n<br/>\n <br/>\n<br/>\nSorry I am no help, but I can really feel for you,<br/>\n<br/>\n <br/>\n<br/>\nSherri-Lee<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: Kimberly [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a>] <br/>\nSent: Tuesday, July 06, 2004 11:00 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same<br/>\nold, same old.<br/>\n<br/>\n <br/>\n<br/>\nAdvice needed. <br/>\n<br/>\nOnce again I am feeling like a bad mother. Hubby and I rented a <br/>\nmovie, Starship Troopers 2, set the kids up in another room with lots <br/>\nto do and freedom to do it. As it turns out all our daughter wants to <br/>\ndo is be with us. We tell her it is a scary movie about bugs and that <br/>\nwe would rather she not watch it. We try to explain it. But she <br/>\ninsists and so taking advice found here, I give in and let her. <br/>\n<br/>\nOMG that was the worst, grossest, freakiest, movie I have ever seen. <br/>\nWorst then resident evil. And my daughter watched it all... did not <br/>\neven flinch. She wanted to watch it again after it was over. I tried <br/>\nto talk to her about it. She thinks the big spiders are real, she <br/>\nthinks everything on TV is real and I have no clue how to explain it <br/>\nto her that it is not. And even though she wants to see it again, she <br/>\nis not wanting to sleep alone or let any of us sleep in our rooms. <br/>\n<br/>\nI just can not believe I let her watch that. She is only 4 years <br/>\nold! I think I am the one in shock. I wish I had not seen it. <br/>\nNow she will not go into a dark room alone... I asked her to draw a <br/>\npicture of the monster she thinks is in my bathroom. Happy she did <br/>\nnot draw a spider, just a one eyed monster that is very tall! LOL <br/>\n<br/>\nOk, so I know I might be over reacting, but I remember still the <br/>\nhorror movies my parents let me watch as a child, and I wish they <br/>\nhadn&#39;t. We do not always know what is best for us, never mind at age <br/>\n4!<br/>\n<br/>\n  Crystal the Brave... leaving lights on for years to come! <br/>\n<br/>\n  Blessings,<br/>\n  Kimmy<br/>\n<br/>\nP.S. I must say, I am doing a great job not showing her how freaked <br/>\nI am about all this. Trying not to react till I have a better idea <br/>\nhow best to do so for her!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129mu5946/M=295196.4901138.6071305.3001176/D=gr\">http://us.ard.yahoo.com/SIG=129mu5946/M=295196.4901138.6071305.3001176/D=gr</a><br/>\noups/S=1705081972:HM/EXP=1089290047/A=2128215/R=0/SIG=10se96mf6/*http:/compa<br/>\nnion.yahoo.com&gt; click here<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=\">http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=</a><br/>\n:HM/A=2128215/rand=731129736&gt; <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*\tTo visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n*\tTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*\tYour use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089218045","msgId":1491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2NDQxRDk2LUQwMzMtMTFEOC1CMDE4LTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg==","referencesHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":1484,"nextInTopic":1496,"prevInTime":1490,"nextInTime":1492,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"... Just a guess here, but given what you ve told us about your DD..... could she have insisted on watching it simply because YOU told her you didn t want her","messageBody":"<div id=\"ygrps-yiv-258324743\">On Jul 7, 2004, at 1:59 AM, Kimberly wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [Hubby and I rented a movie, Starship Troopers 2, &lt;snip&gt; As it turns <br/>\n&gt; out<br/>\n&gt;  all our daughter wants to do is be with us. We tell her it is a scary <br/>\n&gt; movie<br/>\n&gt;  about bugs and that we would rather she not watch it.]<br/>\n<br/>\n </span></blockquote>Just a guess here, but given what you&#39;ve told us about your DD..... <br/>\ncould she have insisted on watching it simply because YOU told her you <br/>\ndidn&#39;t want her to?  You didn&#39;t give her the option of watching for a <br/>\nminute or so (without comment) for HER to decide if she wanted to stick <br/>\naround or not.  Could be a possibility I suppose.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [And my daughter watched it all... did not even flinch. She wanted<br/>\n&gt; to watch it again after it was over. I tried to talk to her about it.]<br/>\n<br/>\n </span></blockquote>My kids watched the Matrix over and over and over and over and over and <br/>\nover.  They were 4 and 2-1/2 at the time.  They weren&#39;t freaked out by <br/>\nthe movie at all and they just wanted to watch it again and again as if <br/>\nit were just another Disney movie.  LOL  They were free to watch it as <br/>\noften as they wanted to and they got bored with it.  They don&#39;t really <br/>\nmention it much.  They&#39;ve since seen both of the sequels at the theater <br/>\nwith us and they think they&#39;re just great movies.  I agree!  LOL<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [And even though she wants to see it again, she is not wanting to sleep<br/>\n&gt; alone or let any of us sleep in our rooms.]<br/>\n<br/>\n </span></blockquote>Hmmm, well, my family doesn&#39;t sleep alone or have their own rooms so I <br/>\nreally don&#39;t have any advice for you on this issue other than &quot;why <br/>\ncan&#39;t she sleep with you?&quot;  Can&#39;t she &quot;camp&quot; on your bedroom floor <br/>\nusing a raft or the couch cushions?  If she wants to sleep near you <br/>\nthen let her sleep near you.  :)<br/>\n<br/>\n-Tracy-</div>","specialLinks":[]},{"userId":138085708,"authorName":"earthmothergypsy","from":"&quot;earthmothergypsy&quot; &lt;earthmothergypsy@...&gt;","profile":"earthmothergypsy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089213424","msgId":1484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjaDQ1Zys2OTZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":1474,"nextInTopic":1491,"prevInTime":1483,"nextInTime":1485,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Okay, I know this sounds really wierd, but maybe you should let her watch it over and over until she has it processed in her mind. Sometimes that is what","messageBody":"<div id=\"ygrps-yiv-1371083765\">Okay, I know this sounds really wierd, but maybe you should let her <br/>\nwatch it over and over until she has it &quot;processed&quot; in her mind.  <br/>\nSometimes that is what they have to do to get it all figured out so <br/>\nthat they aren&#39;t afraid anymore.  That has happened here in our home <br/>\nand as much as I wanted to &quot;protect&quot; my dd from seeing this stuff <br/>\nagain, I found that she really NEEDED to see it over and over to put <br/>\nit all into perspective.  (Hope that makes sense.)   <br/>\n<br/>\nJust my humble opinion and experience.  :)<br/>\n<br/>\n~Amanda<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kimberly&quot; <br/>\n&lt;Kontessa_Rose@h...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  Advice needed. <br/>\n&gt; <br/>\n&gt;  Once again I am feeling like a bad mother. Hubby and I rented a <br/>\n&gt; movie, Starship Troopers 2, set the kids up in another room with <br/>\n </span></blockquote>lots <br/>\n<blockquote><span title=\"ireply\"> &gt; to do and freedom to do it. As it turns out all our daughter wants <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; do is be with us. We tell her it is a scary movie about bugs and <br/>\n </span></blockquote>that <br/>\n<blockquote><span title=\"ireply\"> &gt; we would rather she not watch it. We try to explain it. But she <br/>\n&gt; insists and so taking advice found here, I give in and let her. <br/>\n&gt; <br/>\n&gt;  OMG that was the worst, grossest, freakiest, movie I have ever <br/>\n </span></blockquote>seen. <br/>\n<blockquote><span title=\"ireply\"> &gt; Worst then resident evil. And my daughter watched it all... did not <br/>\n&gt; even flinch. She wanted to watch it again after it was over. I <br/>\n </span></blockquote>tried <br/>\n<blockquote><span title=\"ireply\"> &gt; to talk to her about it. She thinks the big spiders are real, she <br/>\n&gt; thinks everything on TV is real and I have no clue how to explain <br/>\n </span></blockquote>it <br/>\n<blockquote><span title=\"ireply\"> &gt; to her that it is not. And even though she wants to see it again, <br/>\n </span></blockquote>she <br/>\n<blockquote><span title=\"ireply\"> &gt; is not wanting to sleep alone or let any of us sleep in our rooms. <br/>\n&gt; <br/>\n&gt;  I just can not believe I let her watch that. She is only 4 years <br/>\n&gt; old! I think I am the one in shock. I wish I had not seen it. <br/>\n&gt; Now she will not go into a dark room alone... I asked her to draw a <br/>\n&gt; picture of the monster she thinks is in my bathroom. Happy she did <br/>\n&gt; not draw a spider, just a one eyed monster that is very tall! LOL <br/>\n&gt; <br/>\n&gt;  Ok, so I know I might be over reacting, but I remember still the <br/>\n&gt; horror movies my parents let me watch as a child, and I wish they <br/>\n&gt; hadn&#39;t. We do not always know what is best for us, never mind at <br/>\n </span></blockquote>age <br/>\n<blockquote><span title=\"ireply\"> &gt; 4!<br/>\n&gt; <br/>\n&gt;   Crystal the Brave... leaving lights on for years to come! <br/>\n&gt; <br/>\n&gt;   Blessings,<br/>\n&gt;   Kimmy<br/>\n&gt; <br/>\n&gt;  P.S. I must say, I am doing a great job not showing her how <br/>\n </span></blockquote>freaked <br/>\n<blockquote><span title=\"qreply\"> &gt; I am about all this. Trying not to react till I have a better idea <br/>\n&gt; how best to do so for her! </span></blockquote></div>","specialLinks":[]},{"userId":173212844,"authorName":"Michelle","from":"Michelle &lt;mamatoethan1@...&gt;","profile":"mamatoethan1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089204228","msgId":1474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzA3MTI0MzQ4LjExMDAxLnFtYWlsQHdlYjUzMzA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":1472,"nextInTopic":1484,"prevInTime":1473,"nextInTime":1475,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Kimmy: Is the movie on DVD and do the possibly have any extra features?  The sometimes show the making of the movie, and show how they create the special","messageBody":"<div id=\"ygrps-yiv-166331227\">Kimmy:<br/>\n <br/>\nIs the movie on DVD and do the possibly have any extra features?  The sometimes show the making of the movie, and show how they create the special effects.  If you sit and watch it with your daughter, showing that all of the spiders and stuff was created using a computer, it may help her see that they are not real.  Also, seeing the actors acting out some of the scenes may drive it home that it is all fake.  KWIM.<br/>\n <br/>\nMichelle<br/>\n<br/>\nKimberly &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a>&gt; wrote:<br/>\n She thinks the big spiders are real, she <br/>\nthinks everything on TV is real and I have no clue how to explain it <br/>\nto her that it is not. <br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":51071079,"authorName":"Kimberly","from":"&quot;Kimberly&quot; &lt;Kontessa_Rose@...&gt;","profile":"kontessa_rose","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Crystal the Brave -- TV PROBLEMS -- Not same old, same old.","postDate":"1089179977","msgId":1472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjZzNnOStxNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":1474,"prevInTime":1471,"nextInTime":1473,"topicId":1472,"numMessagesInTopic":0,"msgSnippet":"Advice needed. Once again I am feeling like a bad mother. Hubby and I rented a movie, Starship Troopers 2, set the kids up in another room with lots to do and","messageBody":"<div id=\"ygrps-yiv-806499299\">Advice needed. <br/>\n<br/>\n Once again I am feeling like a bad mother. Hubby and I rented a <br/>\nmovie, Starship Troopers 2, set the kids up in another room with lots <br/>\nto do and freedom to do it. As it turns out all our daughter wants to <br/>\ndo is be with us. We tell her it is a scary movie about bugs and that <br/>\nwe would rather she not watch it. We try to explain it. But she <br/>\ninsists and so taking advice found here, I give in and let her. <br/>\n<br/>\n OMG that was the worst, grossest, freakiest, movie I have ever seen. <br/>\nWorst then resident evil. And my daughter watched it all... did not <br/>\neven flinch. She wanted to watch it again after it was over. I tried <br/>\nto talk to her about it. She thinks the big spiders are real, she <br/>\nthinks everything on TV is real and I have no clue how to explain it <br/>\nto her that it is not. And even though she wants to see it again, she <br/>\nis not wanting to sleep alone or let any of us sleep in our rooms. <br/>\n<br/>\n I just can not believe I let her watch that. She is only 4 years <br/>\nold! I think I am the one in shock. I wish I had not seen it. <br/>\nNow she will not go into a dark room alone... I asked her to draw a <br/>\npicture of the monster she thinks is in my bathroom. Happy she did <br/>\nnot draw a spider, just a one eyed monster that is very tall! LOL <br/>\n<br/>\n Ok, so I know I might be over reacting, but I remember still the <br/>\nhorror movies my parents let me watch as a child, and I wish they <br/>\nhadn&#39;t. We do not always know what is best for us, never mind at age <br/>\n4!<br/>\n<br/>\n  Crystal the Brave... leaving lights on for years to come! <br/>\n<br/>\n  Blessings,<br/>\n  Kimmy<br/>\n<br/>\n P.S. I must say, I am doing a great job not showing her how freaked <br/>\nI am about all this. Trying not to react till I have a better idea <br/>\nhow best to do so for her!</div>","specialLinks":[]}],"prevTopicId":1561,"nextTopicId":1100}}