{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":208642734,"authorName":"Susan Maguire","from":"Susan Maguire &lt;asmb65@...&gt;","profile":"asmb65","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Was Intro and Question (Long, Sorry!)","postDate":"1182329518","msgId":24603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMDM0NC44NjA1Ny5xbUB3ZWIzMDkxMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":24602,"nextInTime":24604,"topicId":24603,"numMessagesInTopic":0,"msgSnippet":"Thanks for all the responses everyone. Lots to think about. I should probably do a bit more of an introduction. My kids are very free and make most of their","messageBody":"<div id=\"ygrps-yiv-1621762836\">Thanks for all the responses everyone. Lots to think about.<br/>\n<br/>\nI should probably do a bit more of an introduction. My kids are very free and make most of their own decisions. Many would say they are a little too wild. I think they are angels, or maybe devilish angels ;)<br/>\nOne set of our neighbors won&#39;t let their kids in our yard because it terrifies them. We have a few tree forts interconnected by a network of rather airy ramps. Our two-year-old has been playing on them since he could crawl. They are structurally sound, albeit way off the ground, and our kids are completely fine on them. The neighbor kids I mentioned could definitely fall since they have no innate balance since they&#39;ve never been allowed to develop it! My family would definitely be the ones playing in the &quot;Closed&quot; pool at night and we&#39;d have a hard time not making too much noise. My kids go to bed whenever they feel like it which is why it is 12:30 a.m. and I&#39;m just getting to the computer &lt;g&gt;<br/>\n <br/>\nBut I will admit we could be accused of being Luddites (no this is not a bicycle powered computer I&#39;m driving!). Luckily, however, we&#39;re living in a community with many like-minded people. I don&#39;t preach social and environmental change and sustainability (there are enough other people doing that in this town) but to the best of our ability, we try to live it. I know that if this change does not occur that this planet will be in a big mess due to global warming (which can not be attributed to the normal fluctuations over the millenia - the movie An Inconvenient Truth makes that pretty clear regardless of your political affiliations). So our purchases and actions reflect what little we&#39;re trying to do to make the small changes that are required by everyone to reverse the global warming that we are seeing. And those changes are not great.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; You&#39;ve probably seen this already with the foods you are offering<br/>\n&gt; them - but you&#39;re standing in the way of their &quot;play and curiosity&quot;<br/>\n&gt; by not allowing them to try things that look interesting to them.<br/>\n&gt; You&#39;re giving them mixed messages about learning. *Some* topics are<br/>\n&gt; fine to explore to their hearts&#39; content, but not all - and you&#39;re<br/>\n&gt; deciding which.&quot;<br/>\n <br/>\n </span></blockquote>Actually they get pretty well anything they ask for. But as I said we&#39;re not living in the mainstream. I don&#39;t have to say &quot;no&quot; to my kids about pop or candy since the (huge) grocery store we go to in town doesn&#39;t even sell it. My kids do play at other friends homes a lot and they don&#39;t have that stuff either. We bake a lot of cookies muffins, bread, make home made ice cream, you name it. They enjoy it. My kids go trick or treating and they eat some of what they get, give some of it to us, or the letter carrier, play endless games sorting it and stacking it and then like last year, the rest sits in a bowl gathering dust for over a month. My youngest took a bite of many things but didn&#39;t finish anything. It was far too sweet for his taste buds. My older boy only seemed to really like the M&Ms. But when he saw them in a store in another town months later he only commented that those were the candies that such-and-such a neighbor had given him. He didn&#39;t ask to buy them, he<br/>\n knew they weren&#39;t forbidden, he&#39;d had them before in our own home. It&#39;s like if you grow up eating East Indian curries all the time, when you move somewhere else and try something new it will be interesting but chances are what you&#39;ll really crave when you go back to cooking for yourself will be East Indian curries. So here is where I see my role in modelling. I provide them with healthy options, I don&#39;t forbid but I don&#39;t intentionally drag them past lots of unhealthy options so they can try it out. They&#39;ll have lots of time for that when they&#39;re older and have sound nutritional knowledge.<br/>\n <br/>\n&lt; snip from my original post &gt; Any more so than someone else might say their ten year-old can not try<br/>\nmarijuana. So is this considered an arbitrary limit?<br/>\n <br/>\n&lt;a response&gt;At what age *would* it be OK for a person to try marijuana? Eleven?<br/>\n<blockquote><span title=\"ireply\"> &gt;Fifteen? Thirty-two? How about that Snickers bar? &lt;g&gt;<br/>\n<br/>\n&gt;At almost 47, I&#39;ve never smoked it, by choice. But my 19 year old son<br/>\n&gt;has. Do you think I could have stopped him? Do you think I could now?<br/>\n&gt;How?<br/>\n<br/>\n </span></blockquote>Well I&#39;ve smoked a lot of marijuana in my life and yes I inhaled ;) Mostly in early high school (inhaling, that is). By the time I was in the first years of university I&#39;d pretty much lost interest. But I don&#39;t find anything wrong with it or alcohol. It is sad when either are abused or when someone becomes dependent. I make a few types of country wines - apple, blackberry, cherry - and yep, my kids drink them. We water it down greatly with soda water so they&#39;re really not getting much alcohol. They love it. We serve it to them whenever we&#39;re having a glass at dinner and they ask for a glass too. They have their own little mini wine glasses (sherry glasses). But I wouldn&#39;t say yes if my ten-year old asked me to buy him dope. I&#39;d explain that it is a choice that he needs to make when he is older but it is not something that is healthy for him at this age. Could I stop him? No. But I could discourage him and give him some facts. Someone may say &quot;Why not let them try it?&quot;<br/>\n Because there is no guarantee they won&#39;t like it. Then you are forced to say no to something you have said it&#39;s okay for them to try. This is worse in my mind. You have said &quot;yes&quot; now you need to say &quot;no&quot;. Research shows that ideally people won&#39;t begin their experimentation with drugs until their early to mid-20s once brain development is finished. Well fat chance of that but at least as a parent you can discourage it until the brain is a little more ready for the damage.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;TV and food limits don&#39;t allow a child to find out what he *really*<br/>\n&gt; likes and dislikes. It allows *you* to make that decision *for* him.<br/>\n<br/>\n </span></blockquote>Again, I do have to admit some &quot;cultural&quot; differences here. We don&#39;t own a television. Truth be told I&#39;ve never owned one, neither has my husband. Of the five closest families that we hang out with regularly, only one family owns one. But I have no idea where it is in their house since I&#39;ve never noticed it. I know their kids do watch it sometimes. I had no limits on my T.V. watching when I was a kid but my brothers and I never watched more than an hour or so a day. By the time I left home, I think the T.V. must have been in a closet somewhere since I can&#39;t picture where it was in that house. We spent hours sitting around the living room at the fire, talking, reading. We tinkered in the workshop together or alone. We went skiing, tobogganing. My 70-year-old dad still goes tobogganing. My kids have seen TVs in stores and no, I don&#39;t drag them away from them. At a local store, several times they have happily played on the lawn mower tractors that are for sale while watching<br/>\n the 20 screens that are on the wall. Frankly they&#39;ve been far more interested in the tractors than the TVs They&#39;ve never asked for us to buy one. I fully assume that by the time they are teenagers we will have one.<br/>\n <br/>\nWhen it comes to things that would scare my little ones on TV, what concerns me is more in the flipping the channels and catching the first few seconds or minutes of something scary that they really didn&#39;t want to see but now it&#39;s too late. My oldest has often has often asked me to flip ahead in a story book when he thinks something is getting too scary for him so I can check if I think it is okay. I then describe to him what is coming in general terms and he&#39;ll decide if he wants me to keep reading. I can&#39;t do that with TV. My kids are very young and sweet and innocent - no, they don&#39;t know that people kill one another yet. I&#39;m sure that&#39;s not far off but my oldest is almost ready for that now. He is an incredibly sensitive boy. His little brother is much less so.<br/>\n <br/>\nSo in a nutshell, I believe in much of the freedom and the choice. But when they are really little I think it is a lovely innocent time and having healthy limits that they can understand is fine.<br/>\n <br/>\nWarmly,<br/>\nSusan<br/>\n<br/>\n<br/>\n      Be smarter than spam. See how smart SpamGuard is at giving junk email the boot with the All-new Yahoo! Mail at <a rel=\"nofollow\" target=\"_blank\" href=\"http://mrd.mail.yahoo.com/try_beta?.intl=ca\">http://mrd.mail.yahoo.com/try_beta?.intl=ca</a></div>","specialLinks":[]}],"prevTopicId":24479,"nextTopicId":24605}}