{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":278107510,"authorName":"alisonslp","from":"&quot;alisonslp&quot; &lt;alisonslp@...&gt;","profile":"alisonslp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: little journal note - new &quot;computers&quot; and learning","postDate":"1167784805","msgId":20198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuZXUxNStzbXY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMzkwMWM3MmU4MyQxOWEzMTRhMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20184,"nextInTopic":0,"prevInTime":20196,"nextInTime":20199,"topicId":20172,"numMessagesInTopic":0,"msgSnippet":"... I should have mentioned it again. We are new unschoolers. I decided to take a permanent vacation from school in early December. Before that, we followed","messageBody":"<div id=\"ygrps-yiv-2049271692\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deb Lewis&quot; &lt;d.lewis@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, are you not unschoolers?  You&#39;ve probably said but my sieve, I<br/>\n&gt;mean  brain, doesn&#39;t hold on to some things.<br/>\n<br/>\n </span></blockquote>I should have mentioned it again. We are new unschoolers. I decided to<br/>\n&quot;take a permanent vacation&quot; from school in early December. Before<br/>\nthat, we followed a relaxed classical approach with a focus on reading<br/>\nwriting and math. I have 6yr old twins (boy and girl) and a 3yr old<br/>\nboy. I am more onboard with unschooling than DH. He&#39;s with the kids<br/>\nthree days during the week while I work and tends to want some<br/>\nstructure. He didn&#39;t feel comfortable just letting them &quot;play&quot; all day<br/>\nlong. So in dec, he had them read a little bit each day, write in a<br/>\njournal and do some math activities. He didn&#39;t care what they chose to<br/>\nwrite, read or play (games, computer game dealing with math) as long<br/>\nas they did at least something structured. On the days I was home,<br/>\nthere was so much going on getting ready for the holidays and<br/>\nvisitors, that the kids were left to their own devices, but often<br/>\noffered to help me.  <br/>\n<br/>\nI realize that &quot;assigning&quot; work, is not unschooling, regardless of how<br/>\nmuch control the kids have about the actual activities.  But given<br/>\nthat DH isn&#39;t quite on the same page as me just yet, and he is trying<br/>\nto embrace this as best as he can, I see this as a reasonable<br/>\ntransition compromise. I will say that he hasn&#39;t asked for any &quot;plan&quot;<br/>\nfor the new year in terms of what he should be focusing on with the<br/>\nkids. That&#39;s a good sign. <br/>\n<br/>\nalison<br/>\n<br/>\nSo that&#39;s the situation at this point.</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: little journal note - new &quot;computers&quot; and learning","postDate":"1167760425","msgId":20184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjQwMWM3MmU5NiRmMzQ0OWE0MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20178,"nextInTopic":20198,"prevInTime":20183,"nextInTime":20185,"topicId":20172,"numMessagesInTopic":0,"msgSnippet":"***But just a different perspective in case someone is worried that their child does use these correctly . :)*** It s the freedom to use a thing, - Leapster,","messageBody":"<div id=\"ygrps-yiv-766590520\">***But just a different perspective in case someone is worried that their <br/>\nchild<br/>\ndoes use these &quot;correctly&quot;. :)***<br/>\n<br/>\nIt&#39;s the freedom to use a thing, - Leapster, pine cone, dryer sheet - on <br/>\nyour own terms, for as long as you want and to be finished when you want <br/>\nthat makes the difference.<br/>\n<br/>\n***It *is* helpful when beginning to unschool to remind oneself that <br/>\nlearning<br/>\nhappens everywhere and not to get hung up on the educational content listed <br/>\non<br/>\nthe box.***<br/>\n<br/>\n***And not to worry if they are using it &quot;correctly&quot;***<br/>\n<br/>\nIt&#39;s not easy for some folks to spend some significant amount of money on a <br/>\ntoy with promised educational benefits and then to see a kid use it for a <br/>\nrocket launcher instead.&lt;g&gt;   But it&#39;s a pivotal moment when a parent can <br/>\ndelight in his or her child&#39;s own unique vision rather than focus on a <br/>\nprescribed use with the same tunnel vision of the manufacturer.<br/>\n<br/>\nAnd I should mention that Dylan uses many things in their prescribed way; <br/>\nstove, oven, microwave, furnace, TV, DVD player, PS2, computer, piano, <br/>\ntelescope, trampoline, and has had some fun/success/surprises in using those <br/>\nthings in other ways as well.&lt;G&gt;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: little journal note - new &quot;computers&quot; and learning","postDate":"1167752923","msgId":20178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3ZS45OTcxMDE0LjMyY2JkOGRiQGFvbC5jb20+"},"prevInTopic":20177,"nextInTopic":20184,"prevInTime":20177,"nextInTime":20179,"topicId":20172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/2/2007 10:37:10 A.M. Eastern Standard Time, d.lewis@bresnan.net writes: I  don t think he ever asked for an educational type toy for the","messageBody":"<div id=\"ygrps-yiv-1867004072\">In a message dated 1/2/2007 10:37:10 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a> writes:<br/>\n<br/>\nI  don&#39;t think he ever asked for an educational type toy for the purpose of  <br/>\nlearning the thing the manufacturer was hoping to  teach.<br/>\n<br/>\n<br/>\n*******<br/>\n <br/>\nBoth of my kids really like &quot;educational&quot; toys.  Especially my  daughter.  <br/>\nShe has a Barbie computer and pulls it out every so often.   She says she is <br/>\ngoing to learn to spell.  She has never been to  school.<br/>\n <br/>\nMy son is a little more suspicious of such things, having gone to  preschool. <br/>\n But he has a Leapster and really enjoys most of the games, even  though most <br/>\nare overwhelmingly schooly.  A new one he got for Christmas has  quizzes, <br/>\nwhich he is enjoying very much.  Go figure.<br/>\n <br/>\nNone of the overtly obvious learning toys are considered more or less  <br/>\nimportant than other toys.  I buy both and the kids enjoy both.  I  don&#39;t notice <br/>\nthem &quot;learning&quot; more from the educational ones.<br/>\n <br/>\nIt *is* helpful when beginning to unschool to remind oneself that learning  <br/>\nhappens everywhere and not to get hung up on the educational content listed on  <br/>\nthe box.  Actually, I copy the box and put it in my state records.   &lt;g&gt;  And <br/>\nnot to worry if they are using it &quot;correctly&quot;, as Deb points  out.<br/>\n <br/>\nBut just a different perspective in case someone is worried that their  child <br/>\ndoes use these &quot;correctly&quot;.  :)<br/>\n <br/>\nLeslie in SC <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: little journal note - new &quot;computers&quot; and learning","postDate":"1167751900","msgId":20177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzkwMWM3MmU4MyQxOWEzMTRhMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":20172,"nextInTopic":20178,"prevInTime":20176,"nextInTime":20178,"topicId":20172,"numMessagesInTopic":0,"msgSnippet":"***DS has spelled more words right with this little computer that he had from Sept. - Nov. with our spelling work. And when he gets it wrong, he doesn t get","messageBody":"<div id=\"ygrps-yiv-745108501\">***DS has<br/>\nspelled more words right with this little computer that he had from<br/>\nSept. - Nov. with our spelling work. And when he gets it wrong, he<br/>\ndoesn&#39;t get frustrated. He just tries again. He said to me - &quot;mom,<br/>\nthis is SO much better that school work!&quot; I just had to laugh and<br/>\nagree with him. ***<br/>\n<br/>\nSo, are you not unschoolers?  You&#39;ve probably said but my sieve, I mean <br/>\nbrain, doesn&#39;t hold on to some things.<br/>\n<br/>\nI was rabidly anti &quot;educational&quot; toy.  They irked me.  It IRKS me that <br/>\npeople who make toys should be trying to manipulate and trick kids into <br/>\nlearning.  A kid can learn more from a shoe box filled with pine cones than <br/>\nfrom researched, expert constructed, educational, beepy things.<br/>\n<br/>\nBut I let Dylan get what he wanted.  He wanted some math machine we saw <br/>\nsomewhere and I stayed smilingly quiet and got it for him and turns out he <br/>\nwanted to pretend it was an instrument panel on a space ship.   I was <br/>\noverjoyed. &lt;g&gt;   But really, had he used it for it&#39;s intended purpose, if <br/>\nthat&#39;s what he wanted it for, he&#39;d have had just as much fun as pretending <br/>\nto be Mr. Spock.  They know so much more than we do about what they want and <br/>\nwhat they like.<br/>\n<br/>\nMy kid probably used it differently because he had no idea people studied or <br/>\nworked at or played at math.  At that time he may not have known what the <br/>\nword math meant.  I think we still have that machine but the cord shorted <br/>\nout.  Maybe I&#39;ll fix the cord and turn it on and see what I was afraid of <br/>\nten years ago.&lt;g&gt; Maybe we&#39;ll have fun remembering how he played with it. <br/>\nI&#39;ll reminisce a little about how he almost always saw something other than <br/>\nwhat he was looking at.  His gloved fingers, bent a certain way made the <br/>\nface of a monster in a story.  Dryer sheets were webs of silk fired from <br/>\nMothra&#39;s offspring at an enemy.   A math machine was an instrument panel <br/>\nupon which the success of a dangerous mission depended.<br/>\n<br/>\nI don&#39;t think he ever asked for an educational type toy for the purpose of <br/>\nlearning the thing the manufacturer was hoping to teach.   Having been <br/>\nunschooled his whole life he felt very little, if any, interest in school <br/>\nlooking stuff.   He liked number puzzles for a while, those fat, magazine <br/>\nstyle puzzle books in impulse isles at grocery stores.  He did some Sudoku <br/>\nbut hasn&#39;t done those in a year or more.  Never had a work book nor spelling <br/>\nbook that I remember.  He did love mazes and we scoured the country (via the <br/>\ninternet)  looking for maze books.  He drew maze after maze for me to solve <br/>\nand they were filled with peril.  I would sometimes take a wrong turn and be <br/>\ndevoured by a dragon.<br/>\n<br/>\nBut spelling.  No spelling lessons, no spelling work.  A few years ago my <br/>\nbrother gave him an electronic speller, one of those things you can plug the <br/>\nword in the way you think it&#39;s spelled and it will give you options for <br/>\nwords you might have meant. &lt;g&gt;  He mostly used it when we played Scrabble <br/>\nbut I haven&#39;t seen it in a year or so.<br/>\n<br/>\n***DS has spelled more words right with this little computer that he had <br/>\nfrom<br/>\nSept. - Nov. with our spelling work. ***<br/>\n<br/>\nAre you hoping to move toward unschooling?   I went through the school <br/>\nsystem and I&#39;m a terrible speller.  My spelling improved considerably when I <br/>\nstarted emailing friends and using spell check.  Unschooling advice about <br/>\nhelping kids with spelling has been to spell words for them when they wanted <br/>\nto know how a word was spelled.  I can say as an adult who had spelling <br/>\nlessons and spelling tests and spelling work in school that the only thing <br/>\nthat improved my spelling was having the correct spelling simply given to me <br/>\n(with spell check.)   I was in my thirties before I personally saw the truth <br/>\nof that but my kid knows solidly that his spelling will improve the more he <br/>\nwrites and that a person can live well and happily even if they&#39;re not the <br/>\nbest of spellers. &lt;g&gt;<br/>\n<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":278107510,"authorName":"alisonslp","from":"&quot;alisonslp&quot; &lt;alisonslp@...&gt;","profile":"alisonslp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"little journal note - new &quot;computers&quot; and learning","postDate":"1167713165","msgId":20172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuY28yZCtvc3A4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20177,"prevInTime":20171,"nextInTime":20173,"topicId":20172,"numMessagesInTopic":0,"msgSnippet":"A couple days ago, both dd and ds decided to spend their extra Christmas money on these little mini computers (barbie and batman). They love laptops, as dh and","messageBody":"<div id=\"ygrps-yiv-115319586\">A couple days ago, both dd and ds decided to spend their extra<br/>\nChristmas money on these little mini computers (barbie and batman).<br/>\nThey love laptops, as dh and I both have them. Anyway, traditionally,<br/>\nI would never have let them buy one of these. The noise, the<br/>\n&quot;uselessness&quot; of it... I have said before I have a thing about<br/>\nelectronic toys (educationally oriented or not) that I need to get<br/>\nover.  Anyway, I kept my mouth shut and they bought what they wanted.<br/>\nTurns out it&#39;s an &quot;educational&quot; toy - has all these games related to<br/>\nspelling, math, logic, music, etc. They are having a blast! DS has<br/>\nspelled more words right with this little computer that he had from<br/>\nSept. - Nov. with our spelling work. And when he gets it wrong, he<br/>\ndoesn&#39;t get frustrated. He just tries again. He said to me - &quot;mom,<br/>\nthis is SO much better that school work!&quot;  I just had to laugh and<br/>\nagree with him. Then I joined him in playing one of the frogger type<br/>\ngames that was on it as well. I&#39;m still not thrilled that these<br/>\nelectronic toys are making their way in my house but I must say that I<br/>\ndo have a new appreciation for the attention and dedication that I am<br/>\nseeing in my son when he&#39;s playing with them.<br/>\n<br/>\nalison</div>","specialLinks":[]}],"prevTopicId":20189,"nextTopicId":20225}}