{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedtime...again","postDate":"1272474459","msgId":43799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyOXEwcitidXNsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZGN0VBQjBGRjVFMDQ5RURBNEVDRTk3NjZFQ0I2MDFDQENvbm5pZVBDPg=="},"prevInTopic":43797,"nextInTopic":0,"prevInTime":43798,"nextInTime":43800,"topicId":43790,"numMessagesInTopic":0,"msgSnippet":"We have four kids (12, 8, 4 and 1) and they usually are up when I am up.  There are times I am up later or earlier than everyone else, but because I value","messageBody":"<div id=\"ygrps-yiv-179133429\">We have four kids (12, 8, 4 and 1) and they usually are up when I am up.  There are times I am up later or earlier than everyone else, but because I value sleep so much, I choose sleep over time up alone.  Still, there are various moments during the day where I can do something when the baby is occupied by my side or playing with a big brother or sister.  That might be a moment (like now) when I can chk email.  I do what I can and then hope I can do more later.  Some days have more moments than others.  Dh, when he comes home, will hang out and play with the baby for a while too.    <br/>\n<br/>\nEach time my youngest would get to be about threeish, it was much easier for me to do things as my children didn&#39;t then need the constant supervision that wee ones need.  This made it so much easier to chop vegetables/cook, clean up, do things with the older kids, get into more projects we want to do, etc.  <br/>\n<br/>\nJust to write this, I have left the computer to follow the baby a few times, he&#39;s played with his brother a bit, and now he just left the room.  So I am off..  <br/>\nLaurie :)</div>","specialLinks":[]},{"userId":329793070,"authorName":"sharonmbliss","from":"&quot;sharonmbliss&quot; &lt;sharonmbliss@...&gt;","profile":"sharonmbliss","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Bedtime...again","postDate":"1272458118","msgId":43797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyOWEyNis0b3RjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43795,"nextInTopic":43799,"prevInTime":43796,"nextInTime":43798,"topicId":43790,"numMessagesInTopic":0,"msgSnippet":"I m new to unschooling and on here mostly to glean information but I just wanted to throw in my 2 cents. My children (4 & 2) are up with us until we go to bed","messageBody":"<div id=\"ygrps-yiv-914865516\">I&#39;m new to unschooling and on here mostly to glean information but I just wanted to throw in my 2 cents. My children (4 & 2) are up with us until we go to bed sometimes 10:00 sometimes midnight, sometimes I&#39;m really worn out before they are. Sometimes I do wonder if the grass is greener in those homes with strict bedtimes and free time for adults in the evening but I often think back to what my goals are as a parent and I also acknowledge the blessings. For example right now my children are asleep and I have some me time on my computer. I often hear complaints from bedtime parents that their kids are up at dawn full of energy and ready to play, I sometimes wake up my kids in the late morning so we don&#39;t miss an activity or I can enjoy extended me time. Right now I&#39;m pregnant so I often sleep as much as they do so it works out that they go to bed when I do. It doesn&#39;t allow me to unwind and I sometimes feel like I need more time for me. I do find their energy switches somewhat in the evening and they do spend more time watching tv on their own or playing together and it allows me to have some time with my husband or just vegging out to a tv program myself. For me, letting go of the bedtime routine when I didn&#39;t get the sense that they are tired helped. I hate wasting my energy &quot;getting the kids ready for bed&quot; just to have them spring away to go play. Then I&#39;m exhausted and they want to play and I&#39;m more likely to be irritated. Right now, we just slowly do those bedtime things, teeth brushing, pj&#39;s, etc, as I do them for me because I&#39;m tired or when I sense they are really tired and it works out more peacefully. <br/>\n<br/>\nSharon Bliss<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtime...again","postDate":"1272410272","msgId":43795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGN0VBQjBGRjVFMDQ5RURBNEVDRTk3NjZFQ0I2MDFDQENvbm5pZVBDPg==","inReplyToHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43794,"nextInTopic":43797,"prevInTime":43794,"nextInTime":43796,"topicId":43790,"numMessagesInTopic":0,"msgSnippet":"... I bring them downstairs. This has actually been ok when it s just dd (3 1/2) as she s pretty keen to do her own thing most of the evening.","messageBody":"<div id=\"ygrps-yiv-1474654213\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;If they&#39;re not tired, I persevere until I begin to seethe, then<br/>\n </span></blockquote>I bring them downstairs. This has actually been ok when it&#39;s just dd (3<br/>\n1/2) as she&#39;s pretty keen to do her own thing most of the evening.&lt;&lt;&lt;&lt;<br/>\n<br/>\nIf they aren&#39;t tired, why persevere? Do something fun to help them get tired. We went through a period where we would do the Hokey Pokey at bed time to help the kids get rid of any extra energy. That might not work for some kids but for mine doing those big muscle movements help them wind down. There is no need to seethe about it. If you know that there is a chance that they will want to stay up later or are not tired, then why set yourself up for getting mad. We went through a period where as soon as we would go to bed, my 5 year old would ask for something to eat. We tried offering her something to eat before going to bed but she would say that she wasn&#39;t hungry. The minute we were all laying down, she would ask. My husband and I got mad about it at first. However, when we saw that us getting up AFTER we all went to bed was meeting some need of hers, we changed our attitude. Now, when she asks, one of us will get up and get her a quick snack that she can eat in bed. We were wasting way too much energy trying to fight it when it was soooo much easier to just go with it. Our evenings were so much more peaceful. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;What I really need support with is that I am totally NOT in the zone of<br/>\n </span></blockquote>having my kids with me all evening as well as all day. I feel this must<br/>\njust be natural to some people.&lt;&lt;&lt;&lt;<br/>\n<br/>\nI don&#39;t know that it is natural to some people. I think part of the problem is that society sets us up to expect to have time away from our kids. Mainstream parenting is all about finding ways to separate yourself from your kids. I found that getting that idea out of my head was a big step in moving towards being able to be with the kids all day and all night. Have you thought of getting a little alone time in the mornings rather than in the evening? I have been known to sneak out of bed at 3 AM to get a little me time. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;But I don&#39;t want to play games in the evening as well as the day. I want to do things<br/>\n </span></blockquote>which can&#39;t be done with a curious 2 year old around (without saying no to<br/>\nhim all the time).&lt;&lt;&lt;&lt;<br/>\n<br/>\nThey are only two for such a short time. Enjoy every minute of it. Relish it. Find things to do that you can do with a curious 2 year old around. Why do you have to play games? Is that what your 2 year old wants? Is there something else that he/she can do while you are doing your stuff? I have lots of toy boxes all over the house so that there is something for my kids to do in pretty much every room of the house. If I am in the kitchen cooking, they can play in the pots and pans. If I want to play on the computer, they can play with the toys that are behind me. It is a matter of getting creative. Perhaps you can set up a TV with a favorite show to help divert attention so you can do other stuff. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Bedtime...again","postDate":"1272409580","msgId":43794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBMkE1NjdDLUMyNDAtNEY5RS1CNDBFLTZBOTUyQ0IyODhGOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43793,"nextInTopic":43795,"prevInTime":43793,"nextInTime":43795,"topicId":43790,"numMessagesInTopic":0,"msgSnippet":"... Undoubtedly for *some* but really really helpful to let go of that idea! It s definitely *not* natural for everyone. It s something that most have to work","messageBody":"<div id=\"ygrps-yiv-77752663\">On Apr 27, 2010, at 4:07 PM, Caroline Gallear wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I really need support with is that I am totally NOT in the zone  <br/>\n&gt; of<br/>\n&gt; having my kids with me all evening as well as all day. I feel this  <br/>\n&gt; must<br/>\n&gt; just be natural to some people.<br/>\n<br/>\n </span></blockquote>Undoubtedly for *some* but really really helpful to let go of that  <br/>\nidea! It&#39;s definitely *not* natural for everyone. It&#39;s something that  <br/>\nmost have to work at. And work *not* to squash the feelings but to  <br/>\nshift viewpoint and expectations so you know that right now, at this  <br/>\npoint in your life, this is what your kids need. There *will* be time  <br/>\nlater when you&#39;ll be able to have free evenings.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedtime...again","postDate":"1272405998","msgId":43793,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyN241ZSt1ZDdiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43791,"nextInTopic":43794,"prevInTime":43792,"nextInTime":43794,"topicId":43790,"numMessagesInTopic":0,"msgSnippet":"... That s a place to start, seeing that they re not tired and working on shifting your perspective before you start seething. It can help to think that you re","messageBody":"<div id=\"ygrps-yiv-257717779\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Caroline Gallear &lt;carolinegallear@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;If they&#39;re not tired, I persevere until I begin to seethe<br/>\n<br/>\n </span></blockquote>That&#39;s a place to start, seeing that they&#39;re not tired and working on shifting your perspective before you start seething. It can help to think that you&#39;re really only changing your perspective Now, tonight. Its not all and forever, just right now, a small step. That can help that step not feel overwhelming. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t<br/>\n&gt; want to play games in the evening as well as the day.  I want to do things<br/>\n&gt; which can&#39;t be done with a curious 2 year old around (without saying no to<br/>\n&gt; him all the time).<br/>\n<br/>\n </span></blockquote>To some extent, this depends on what you are wanting to do. Somethings can be broken down into bits and done piecemeal during the day. When Mo was 2, and on the go alllll the time, I&#39;d have something handy at all times. There would be long minutes where I didn&#39;t need to keep both eyes on her every second, and I could read a little, or knit a little. At first I thought I&#39;d never get anything read or done - like I couldn&#39;t possibly figure out how to concentrate in that weird, different way, with one eye on my kid. Its a skill! So there&#39;s a learning curve and it takes practice. <br/>\n<br/>\nI recently watched an interview with Madeline L&#39;Engle, where she talked about writing &quot;A Wrinkle in Time&quot;. She said she had two young children at home, so she&#39;d write a sentence or two when she got a free moment. You can do amazing things in a moment or two at a time, but you won&#39;t do them if you spend them wishing you had a whole hour ;) <br/>\n<br/>\nSomething else that helped be, when I&#39;d start to get antsy or resentful, was to remind myself to savor those moments. It sounds trite, but its easy to get wrapped up in the Hassle of parenting and forget that its something you want to do, that loving your children Right Now, not just in the abstract, is something you really want to do. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I really need support with is that I am totally NOT in the zone of<br/>\n&gt; having my kids with me all evening as well as all day.  I feel this must<br/>\n&gt; just be natural to some people.<br/>\n<br/>\n </span></blockquote>It wasn&#39;t natural to me! It was excruciating at first. I didn&#39;t have the skills. I knew how to spend hours all wrapped up in my own projects, not moments. I kicked and screamed, mentally. I wanted my life, my brain back. Once I started stepping away from the expectation that I could have lots of time &quot;to myself&quot; I found I had more little moments available, I found ways to use those little moments to recharge - a deep breath, a scribbled note about an idea, a good look at the sky, that might be all I had time for, so I got in the habit of relishing those as much and as hard as I&#39;d savor my kids. It took practice. I didn&#39;t start out all zen-like and mellow - mellow isn&#39;t really something I do well at all, and I&#39;m more zen-like in my sense of irony than anything else, but I got a whole lot better at appreciating little things, and moments, and ultimately appreciating myself, too. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":441747317,"authorName":"Erica Guthaus","from":"Erica Guthaus &lt;eguthaus@...&gt;","profile":"jandegoot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtime...again","postDate":"1272399374","msgId":43791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzQTk0QTU3LUI2QzYtNDQyRC1BN0UzLURDOURERDZFNDg0N0BnbWFpbC5jb20+","inReplyToHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43790,"nextInTopic":43793,"prevInTime":43790,"nextInTime":43792,"topicId":43790,"numMessagesInTopic":0,"msgSnippet":"Thank you so much for posting this.  I echo your emotions as this is something that is *heavy* on my heart these days to the point that it makes me question","messageBody":"<div id=\"ygrps-yiv-767683277\">Thank you so much for posting this.  I echo your emotions as this is<br/>\nsomething that is *heavy* on my heart these days to the point that it<br/>\nmakes me question the wisdom of keeping these children with me all<br/>\nthe time (would it be more wise to send the oldest (and most intense)<br/>\ndd to traditional school just to save some sanity.)!  I love them<br/>\nall, but I also have yet to figure out how I can recharge enough to<br/>\nkeep all this going without breaking myself (or a child! kidding of<br/>\ncourse!) in the process!  So, you are not alone!  Anxiously awaiting<br/>\nsome replies<br/>\n<br/>\nErica<br/>\ndd 4.5<br/>\ndd 2.5<br/>\nds 5mos</div>","specialLinks":[]},{"userId":326479635,"authorName":"Caroline Gallear","from":"Caroline Gallear &lt;carolinegallear@...&gt;","profile":"caroline.gallear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Bedtime...again","postDate":"1272398875","msgId":43790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHUya2YwYzRkZDYxMDA0MjcxMzA3aTZlYWFkZjJlajYzZGJlNzUxNTUwN2E2NGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":43791,"prevInTime":43789,"nextInTime":43791,"topicId":43790,"numMessagesInTopic":0,"msgSnippet":"Hi patient readers... I don t like bedtime, or the prospect of bedtime.  I feel embarrassed to be asking about it again, but having really entered the era of","messageBody":"<div id=\"ygrps-yiv-1734041226\">Hi patient readers...<br/>\n<br/>\nI don&#39;t like bedtime, or the prospect of bedtime.  I feel embarrassed to be<br/>\nasking about it again, but having really entered the era of the bedtime<br/>\nbattle with my 3 1/2 year old, I am seriously interested in &#39;unschooling<br/>\nbedtime&#39; for real.<br/>\n<br/>\nCurrently we do bath, story etc, finishing with breastfeed for ds and<br/>\nwhispered story for dd, which sends them both to sleep.  If they&#39;re pretty<br/>\ntired, this all goes smoothly, no arguments, ending any time between 7.30<br/>\nand 8.30pm.  If they&#39;re not tired, I persevere until I begin to seethe, then<br/>\nI bring them downstairs.  This has actually been ok when it&#39;s just dd (3<br/>\n1/2) as she&#39;s pretty keen to do her own thing most of the evening.<br/>\n<br/>\nWhat I really need support with is that I am totally NOT in the zone of<br/>\nhaving my kids with me all evening as well as all day.  I feel this must<br/>\njust be natural to some people.  Like I have always breastfed on demand, its<br/>\njust been a part of motherhood I expected, I wouldn&#39;t think of making baby<br/>\nwait/cry it out etc.  ( Please know I&#39;m not singing my own praises, just<br/>\ntrying to clarify how differently I feel about these issues.)  But I don&#39;t<br/>\nwant to play games in the evening as well as the day.  I want to do things<br/>\nwhich can&#39;t be done with a curious 2 year old around (without saying no to<br/>\nhim all the time).<br/>\n<br/>\nBut... letting my children learn when they are tired, not having to stop<br/>\ngames because of a random time on the clock, all of this sounds good in<br/>\ntheory.  How can I change my perspective so much?  I don&#39;t need convincing,<br/>\nI need help to accept this as potential part of my parenting day.<br/>\n<br/>\nmy brain is melting now, please send your wise advice!<br/>\n<br/>\nThank you thank you,<br/>\nCaroline.<br/>\n<br/>\ndd 3 1/2<br/>\nds nearly 2,<br/>\nHampshire UK.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43798,"nextTopicId":43737}}