{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":26,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:going to church","postDate":"1273497039","msgId":43931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRGMUFCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39452,"nextInTopic":0,"prevInTime":43930,"nextInTime":43932,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"Okay, I d already replied to Amy directly but since this discussion is green lighted, here s my response (with some additional edits/information): What we do","messageBody":"<div id=\"ygrps-yiv-1727810978\">Okay, I&#39;d already replied to Amy directly but since this discussion is<br/>\ngreen lighted, here&#39;s my response (with some additional<br/>\nedits/information):<br/>\n<br/>\nWhat we do is that DS (not quite 12) is required to come with us simple<br/>\nbecause he&#39;s not old enough (legally) to be home alone for 4 or 5 hours<br/>\n(we typically leave the house around 8:30 and get home close to 1; it&#39;s<br/>\na 25 minute drive each way). However, if DH and/or I have no<br/>\nresponsibilities on a given Sunday (which is somewhat rare), DS can<br/>\nrequest to stay home and we&#39;ll honor that. If that&#39;s not possible, we<br/>\nhave DS&#39; &quot;church bag&quot; - it contains his current reading material,<br/>\nsketchpads and assortment of his favorite markers, water bottle, snacks,<br/>\nand occasionally his Nintendo DS and headphones (that is less and less<br/>\nas he&#39;s gotten older by his choice - I pack the bag based on his<br/>\nrequests). He is also welcome to curl up and take a nap with his head on<br/>\nmy lap. We&#39;ve never required any specific &quot;involvement&quot; from him during<br/>\nworship time - we asked that he be quiet and not bounce around a lot for<br/>\npoliteness (and I make sure that all his stuff is packed so as to make<br/>\nit easily and quietly accessible - I&#39;ll take snacks out of crinkly<br/>\npackaging and put it in reusable, easy open containers) but he did not<br/>\nhave to &quot;sit still and pay attention&quot;. He was never &quot;required&quot; to attend<br/>\nBible class. When he was younger, he enjoyed it, but as he got into the<br/>\n8-9 yr old range, he didn&#39;t like the &#39;schooly&#39; feel of it most of the<br/>\ntime - the sticker charts, memorization, awards/prizes, worksheets and<br/>\nsuch (unless I was teaching - it *is* possible to teach Bible classes as<br/>\nan unschooler). So, if I wasn&#39;t teaching, the two of us had our own<br/>\nclass. He&#39;d suggest the subject matter and I&#39;d prepare thoughts,<br/>\noutline, etc. and we&#39;d have great discussions - we studied through Acts,<br/>\nJudges, corporate and personal worship, and other stuff. On the one or<br/>\ntwo rare occasions where someone raised a question (or an eyebrow), it<br/>\ntook just a quick &quot;Oh we&#39;ve been studying thus and such and DS commented<br/>\nthat ....&quot; And they&#39;d back off when they realized that he was getting<br/>\nsome serious almost-adult-level Bible study.  Haven&#39;t had any questions<br/>\nin recent memory. He has also assisted me the last two times I&#39;ve taught<br/>\nthe youngest kids (4-7 yr olds) - he invented board games, helped with<br/>\ncrafts, bulletin board ideas, and so on. He has choices for Bible class<br/>\ntime: he can be with me (one on one or helping me teach), he can be in<br/>\nBible class with his age-mates, he can sit in the adult class with me<br/>\nand DH (which he&#39;s also chosen on occasion when DH and I were both in a<br/>\nclass that we felt a need for. DS will probably be in the adult class<br/>\nagain this summer as DH will be teaching it).<br/>\n<br/>\nI guess, bottom line, is lots of discussion and seeking what meets ALL<br/>\nneeds as much as possible. There are times when both DH and I feel a<br/>\nneed to be at worship so DS has to come along and we do whatever we can<br/>\nto make the situation as palatable/pleasant for him as possible. And,<br/>\nlately, DS has started being more involved on his own - he sings when we<br/>\nsing, bows his head with us during prayer time, and even sometimes pays<br/>\nattention through the sermon (he sometimes pays attention better than<br/>\nsome adults). We&#39;ve never required any of it but over time he&#39;s chosen<br/>\nto do so for his own reasons.<br/>\n<br/>\nAlso, DH and I will be leading a discussion group at the Northeast<br/>\nUnschooling Conference in August around these type topics (open to all<br/>\nbelief systems, Christian and other, since similar situations come up in<br/>\na variety of areas).<br/>\n<br/>\nDeb R<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Consensual Living Article","postDate":"1239551389","msgId":39452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMDkwNDEyMDg0OXE0ODhjYWI5YW45YjA0NmMxMzg3OTg5NmY1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdycjRjNStkaHUxQGVHcm91cHMuY29tPg==","referencesHeader":"PDQ5ZTBjNDA2LjI5NTc4YzBhLjI1OWIuNjc0MkBteC5nb29nbGUuY29tPgkgPGdycjRjNStkaHUxQGVHcm91cHMuY29tPg=="},"prevInTopic":39449,"nextInTopic":43931,"prevInTime":39451,"nextInTime":39453,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"Meeting multiple needs belonging to others sometimes requires strategy changes...ie The parents alone time  could be re-envisioned/rescheduled. Trust needs","messageBody":"<div id=\"ygrps-yiv-990213435\">Meeting multiple needs belonging to others sometimes requires strategy<br/>\nchanges...ie The parents &quot;alone time&quot;  could be re-envisioned/rescheduled.<br/>\nTrust needs to be built.   Assessing everyone&#39;s needs, emotions, and some<br/>\ncreative strategies can be employed.<br/>\n<br/>\nI recommend Marshall Rosenberg&#39;s Non-violent Communication series.<br/>\n<br/>\nMy Compassionate Communication group has added SPA and SEN:  Specific<br/>\nActionable Goals and Self-Empathy Now.   First, try looking at your needs,<br/>\nthen your emotions, and lastly, see if changing  to a different strategy<br/>\nwill enable you to meet the need. At times you can empathize with yourself,<br/>\nand feel disappointed or angry, and then allow yourself to re-think your<br/>\nstrategy and identify your &quot;real&quot; needs and emotions.  Some needs are<br/>\ndeferred.  It helps to frame things as a choice, rather than see yourself as<br/>\ntrapped or victimized. I am choosing to meet my need for safety(emotional)<br/>\nby staying home with my upset child.  I am choosing to met my need for peace<br/>\nand ease or emotional connection...There are physical, emotional and<br/>\nintellectual needs.   Strategies can meet our needs, but at times need to be<br/>\ntweaked to meet everyone&#39;s needs.<br/>\n<br/>\n<br/>\nIE...Exaggerated  example of conflicting needs.<br/>\n<br/>\nYou are agoraphobic, but you  need to buy groceries. If  you cannot leave<br/>\nyour house, yet you need to eat what do you do? Your need is not to leave<br/>\nthe house, but to eat food  to continue to live.   Changing to a different<br/>\nstrategy allows you to meet your need for food, without feeling unsafe.<br/>\n<br/>\nMy partner and I often met our needs and our nursing baby&#39;s needs by<br/>\nbringing him to movies and nursing him(with all 3) to sleep.  Our needs, the<br/>\nbaby&#39;s needs and the need&#39;s of other patrons were all met.  At a certain age<br/>\nthe boys could stay with a sitter  or enjoy the film.<br/>\n<br/>\nMy partner and I are interested in meeting our need for rest with a<br/>\nvacation.  Chances are though we dream of long expensive vacations, but will<br/>\nget a limited time to camp or go to a cottage, rather than a hotel in<br/>\nFrance, Italy, or some other location.  Really, there are times when its<br/>\njust puttering at home that meets that need, going out for coffee or a long<br/>\nbath.<br/>\n<br/>\n<br/>\nMarina<br/>\n<br/>\n2009/4/11 amflowers71 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eurochamp99@...\">eurochamp99@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; That is a lovely story, thank you.<br/>\n&gt;<br/>\n&gt; As a complete novice here, I would be interested to know how this could<br/>\n&gt; have looked from a consensual living / unschooling perspective if say, the<br/>\n&gt; Mommy really couldn&#39;t get happy with the idea of Blockbuster and still<br/>\n&gt; really wanted to go out with husband as planned? Ie if it were not possible<br/>\n&gt; to find a way to meet Mommy and son&#39;s desires at the same time.<br/>\n&gt;<br/>\n&gt; I can kind of imagine that most non-consensual families would fall into 2<br/>\n&gt; main camps, either &quot;no, you&#39;re staying home with the sitter and that&#39;s it!&quot;<br/>\n&gt; or a begrudging agreement to blockbuster by one or both parents - still<br/>\n&gt; holding onto the desire to go out, and not freely going for the blockbuster<br/>\n&gt; option with a happy heart.<br/>\n&gt;<br/>\n&gt; Thanks<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nAn ordinary person will save the world by living as though she can<br/>\n.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":348735811,"authorName":"amflowers71","from":"&quot;amflowers71&quot; &lt;eurochamp99@...&gt;","profile":"amflowers71","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Consensual Living Article","postDate":"1239487685","msgId":39449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdycjRjNStkaHUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5ZTBjNDA2LjI5NTc4YzBhLjI1OWIuNjc0MkBteC5nb29nbGUuY29tPg=="},"prevInTopic":39442,"nextInTopic":39452,"prevInTime":39448,"nextInTime":39450,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"That is a lovely story, thank you. As a complete novice here, I would be interested to know how this could have looked from a consensual living / unschooling","messageBody":"<div id=\"ygrps-yiv-2039415907\">That is a lovely story, thank you.<br/>\n<br/>\nAs a complete novice here, I would be interested to know how this could have looked from a consensual living / unschooling perspective if say, the Mommy really couldn&#39;t get happy with the idea of Blockbuster and still really wanted to go out with husband as planned?  Ie if it were not possible to find a way to meet Mommy and son&#39;s desires at the same time.<br/>\n<br/>\nI can kind of imagine that most non-consensual families would fall into 2 main camps, either &quot;no, you&#39;re staying home with the sitter and that&#39;s it!&quot; or a begrudging agreement to blockbuster by one or both parents - still holding onto the desire to go out, and not freely going for the blockbuster option with a happy heart.<br/>\n<br/>\nThanks</div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Consensual Living Article","postDate":"1239467010","msgId":39442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZTBjNDA2LjI5NTc4YzBhLjI1OWIuNjc0MkBteC5nb29nbGUuY29tPg==","inReplyToHeader":"PGdyb25nbSttNGpzQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTEzMC1XNDU1NjQ5RUU1QjRGNTU0RTBFQUY0M0MyODAwQHBoeC5nYmw+IDxncm9uZ20rbTRqc0BlR3JvdXBzLmNvbT4="},"prevInTopic":39432,"nextInTopic":39449,"prevInTime":39441,"nextInTime":39444,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... Yesterday was a relaxing day.  We ve all be sick recently with colds, and the symptoms come and go day to day.  My wife was up the night before quite a bit","messageBody":"<div id=\"ygrps-yiv-750658848\"><blockquote><span title=\"ireply\">&gt; It&#39;s not always physically possible to do everything everyone wants right <br/>\n&gt; now - but I can always value everyone&#39;s needs Right Now. By value I mean <br/>\n&gt; taking them seriously and looking for mutually acceptable options...<br/>\n<br/>\n<br/>\n </span></blockquote>Yesterday was a relaxing day.  We&#39;ve all be sick recently with colds, and<br/>\nthe symptoms come and go day to day.  My wife was up the night before quite<br/>\na bit with two coughing kids, but I never woke up.  Sometimes I think I<br/>\ncould sleep through a tornado, yet I can be awakened by my kids or wife with<br/>\na gentle touch.  We&#39;re cosleepers and have never had a separate bed or<br/>\nbedroom or crib for the kids.<br/>\n<br/>\nI got up at 6am to have some solitude (routine), and around 7:30 I heard my<br/>\n6 month old cooing and playing upstairs.  She was the only one awake in the<br/>\nbed, but she was trying to wake up the others by patting and talking to<br/>\nthem, so I put her in a wrap and cleaned the kitchen, did some laundry, etc.<br/>\nMy 4 y/o son woke up about 8:30, and I engaged him with playdough making<br/>\ndino footprints and other fun things, and also found a big wad of silly<br/>\nputty I had found in my office last week.  <br/>\n<br/>\nI shut the bedroom door and told them to let mommy sleep as long as she<br/>\nwanted.  She came out of the bedroom around 10, around the time our<br/>\nchiropractor friend was coming by to try out some new techniques she learned<br/>\nat a seminar last week (yep, a House Call...isn&#39;t that awesome!).  We all<br/>\ngot treated, free-flow, along with chatting and playing.  The chiro left<br/>\naround noon.<br/>\n<br/>\nAround that time, my wife was checking Facebook, and one of her Denver<br/>\nfriends posted that she was going to see Bruce Springsteen that night.<br/>\n&quot;Hey!&quot;, my wife said, &quot;Springsteen&#39;s playing.  Wanna go?&quot;.  Heck yeah I<br/>\nwanna go.  It was my birthday this week, so that would be an awesome<br/>\nbirthday celebration.  I&#39;ve only seen him once, back in 1993, but he&#39;s one<br/>\nof my favorite artists as judged by how many hundreds of hours I&#39;ve spent<br/>\nlistening to him in my life.  She was already looking on Craigslist for<br/>\ntickets, and was finding some seats at decent prices.  I found our kid-sized<br/>\near muffs (identical to the ones I use in my garage when using loud power<br/>\ntools) plus some other foam ear plugs that I could cut/modify to plug our<br/>\nlittle one&#39;s ears if necessary.  We haven&#39;t been to a show with her yet, but<br/>\nwe did several concerts with our son, and between plugs and muffs, we always<br/>\nfigured out how to enjoy the show, protect our ears, and have fun.<br/>\n<br/>\nMy wife already had a sitter arranged since we usually have one on Friday<br/>\nnights for date night.  We&#39;ve used this sitter for about a year, and our son<br/>\nloves her.  Sometimes on date nights we&#39;ll actually just hang around the<br/>\nhouse while he runs around and plays with the sitter, or they might go to a<br/>\nmovie and give us some time alone at home with baby.<br/>\n<br/>\nSitter arrived at 5:30pm, and we were planning to leave the house soon after<br/>\nbut were having some ticket issues.  People were advertising tickets that<br/>\nweren&#39;t actually available.  By 6pm we had tickets in hand for the 7:30<br/>\nshow, plus planned to meet some friends there who had a corporate suite, and<br/>\nthey thought there would be plenty of room to pull us in there once they<br/>\nOK&#39;d it with the suite owner.  <br/>\n<br/>\nSon was asleep on the couch.  He and I had spent an hour in the hot tub in<br/>\nthe afternoon, which had relaxed him a lot.  That on top of the fact that<br/>\nhis cough had kept him awake a lot the night before meant he was sleeping<br/>\nhard.  I put the baby in the car, then went back in to say bye to sitter and<br/>\nkiss my son.  When I got in the house, son was sitting on my wife&#39;s lap.  He<br/>\nhad awakened when she kissed the top of his head, and he wanted her to stay<br/>\nhome with him.  He said for me to go to the concert by myself.<br/>\n<br/>\nI told him I didn&#39;t want to go by myself (even though it was a possibility,<br/>\nit was far from my preference).  And I asked him if there was anything he<br/>\ncould think of doing with the sitter that would make it OK for mommy and<br/>\ndaddy to go to the concert.  My wife and I (and the sitter) threw out lots<br/>\nof options such as a trip to the toy store, a movie, a trip to the<br/>\ntake-and-bake pizza joint that has the awesome raw cookie dough, Blockbuster<br/>\nto rent movies, etc.  We&#39;ve only been in this situation one other time,<br/>\nwhere he didn&#39;t want us to leave for a date night.  On that prior occasion,<br/>\nwe had come up with a solution he liked.  <br/>\n<br/>\nAfter presenting all the options, I asked him what would be the most joyful<br/>\nthing to do.  He wanted to be with Mommy, and for all of us go to<br/>\nBlockbuster together.  I asked my wife what the most joyful thing to do<br/>\nwould be, and she thought Blockbuster sounded fine.  And I agreed.  The car<br/>\nwas already running, and baby was waiting in it, so I said let&#39;s go to<br/>\nBlockbuster.  He agreed, so we all climbed in the car (including sitter) and<br/>\nleft.  The whole conversation took just a few minutes.  We ended up going to<br/>\na sushi place, then to Blockbuster where we got some Scooby-Doo videos, then<br/>\nback home to watch them.<br/>\n<br/>\nI know that there were many options in that situation.  I know that I could<br/>\nhave thought of some ways to &quot;get&quot; him to accept the fact that we had<br/>\n$170.00 worth of concert tickets in-hand, obtained at the last minute, and<br/>\nwe really wanted to go to the Bruce Springsteen show.  And I did tell him<br/>\nthat, but I didn&#39;t make it coercive, nor did I try to Guilt him into it, the<br/>\nway my own parents would have done with me.  But based on the fact that he&#39;s<br/>\nusually completely 100% OK with us leaving him with the sitter, it was very<br/>\neasy this time to skip the concert and meet his needs for being cuddled by<br/>\nmommy.  Watching the videos was fun and relaxing.  Plus, while driving to<br/>\nthe sushi place I made a few calls and found some friends who were thrilled<br/>\nto use our tickets, even though it was incredibly last-minute.<br/>\n<br/>\nI&#39;m not claiming that this is exactly &quot;Consensual Living&quot;, but I&#39;ve read<br/>\nenough about CL philosophy to know how it helps in our radical unschooling<br/>\nlifestyle.  And I&#39;m not claiming that our decision was a &quot;right&quot; or &quot;good&quot;<br/>\none or would fit for others.  And in the same scenario in the future, I<br/>\nmight have a blast of clarity that would get us to the show and leave my son<br/>\nsmiling.  Our emotions about the situation were light and happy and fun.<br/>\nConcerts come and go.  In that moment, the priority was in meeting my son&#39;s<br/>\nneeds, and my connection to him is worth a lot more than $170.  A side<br/>\nbenefit was that our sitter got to see very clearly how we live and make<br/>\ndecisions together.  I could spend hours explaining consensual lifestyles to<br/>\nher, or she could just see it in action.  It was a fun night.  -=b.</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Consensual Living Article","postDate":"1239411210","msgId":39432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwNDEwMTc1M3cyMWNiOWNlNmszY2E4ZjIxZjY4YjliMmQ3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdyb25nbSttNGpzQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTEzMC1XNDU1NjQ5RUU1QjRGNTU0RTBFQUY0M0MyODAwQHBoeC5nYmw+CSA8Z3JvbmdtK200anNAZUdyb3Vwcy5jb20+"},"prevInTopic":39430,"nextInTopic":39442,"prevInTime":39431,"nextInTime":39433,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... My own personal rule-of-thumb (as it were) is the child should never be asked to give -even a little- for anything that will continue to exist long after","messageBody":"<div id=\"ygrps-yiv-1285814299\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; but at what point should the children also be willing to give a little,<br/>\n&gt; since the parents are supposed to be expected to give so much.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My own personal rule-of-thumb (as it were) is the child should never be<br/>\nasked to give -even a little- for anything that will continue to exist long<br/>\nafter this stage of the child&#39;s life.<br/>\nIn the case of church and family togetherness, honoring the temporary state<br/>\nof even *being* a child feels much better than resentment. The church and<br/>\nthe community and the opportunity to commune as a family over donuts and<br/>\nkool-aid (one of my favorite childhood memories) will still be there for<br/>\nrevisit 6 months, a year, 10 years from now.<br/>\nWhich memories of Sunday morning relationships do you want your child to<br/>\ncarry?<br/>\n99.99% of the time, some version of that question clarifies my question of<br/>\nwhat to do.<br/>\n~diana :)<br/>\nxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Consensual Living Article","postDate":"1239408982","msgId":39430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyb25nbSttNGpzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEzMC1XNDU1NjQ5RUU1QjRGNTU0RTBFQUY0M0MyODAwQHBoeC5nYmw+"},"prevInTopic":39428,"nextInTopic":39432,"prevInTime":39429,"nextInTime":39431,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... ****************************** There s a should in the middle of that - when Should a child...? Try wondering: When Can a child...? When can children","messageBody":"<div id=\"ygrps-yiv-1130298451\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Heather & Markus Schleidt &lt;hmschleidt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I guess what I am trying to get at is this:  I hear a lot about consensual living and that it is about understanding where people are at and trying to meet the needs of each person, but at what point should the children also be willing to give a little, since the parents are supposed to be expected to give so much. <br/>\n </span></blockquote>******************************<br/>\n<br/>\nThere&#39;s a &quot;should&quot; in the middle of that - when Should a child...? Try wondering: When Can a child...? When can children offer up the love and support we offer them? What does it take? Generally, it takes having enough of their needs met enough of the time - think of filling a cup. When a child is &quot;full&quot; of love, he or she will offer it up gladly. What&#39;s enough? Depends on the child (or adult for that matter). Some kids have bigger needs, or different needs from the rest of the family. When Ray was little he had Enormous needs. It was tempting to think &quot;its not fair that he needs so much...what about our needs?&quot; but that doesn&#39;t help anything. It only leads to resentment and even less needs being met overall. So we put a lot of energy into meeting Ray&#39;s needs and got creative about meeting adult needs.<br/>\n<br/>\nWhen you work to meet the needs of everyone in the family with love and compassion, then love and compassion are more readily available for everyone in the family. I think where many people tend to get stuck is thinking there has to be a way to meet everyone&#39;s needs at the same time, or its not consensual or not unschooling. I&#39;ve found it far far more helpful to think in terms of Valuing every family members needs all the time. Its not always physically possible to do everything everyone wants right now - but I can always value everyone&#39;s needs Right Now. By value I mean taking them seriously and looking for mutually acceptible options, but also commiserating with a family member who isn&#39;t getting to do what he or she wants right now. That&#39;s important, too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If my dh played flag football every week and wanted me to come to his games, I would, as a choice and out of love, attend as many games as I could because it means something to him.  I, also, might bring my kids along most of the time, even if they weren&#39;t thrilled about it because I can&#39;t pay someone to watch them all the time just because they don&#39;t want to participate.<br/>\n </span></blockquote>******************************************<br/>\n<br/>\nSo, one question that comes to mind is - how important is your physical presence to your dh? Can you find other ways to meet His needs? George plays music three nights a week and Ray enjoys going with him, but Mo doesn&#39;t, so I stay home with her. Now and then I might bring Mo along, if there are plenty of other things for her to do - in summer we go to the coffee house more bc she can play outside, for example. I find other ways to fill up George&#39;s cups of love and appreciation and care and look for other ways to socialize with adults on my own. I don&#39;t assume our adult needs aren&#39;t important, but I look for alternatives. I don&#39;t expect to meet every one of my partner&#39;s emotional needs, personally, and he doesn&#39;t expect to meet mine.<br/>\n<br/>\nThat might be something to think and/or discuss with your dh - are there other ways he can feel supported and loved that don&#39;t include the rest of the family doing one specific thing? Maybe if you and your dh and the one child can have a special time when they do something fun together, dh would be okay with the two of you not attending church more often. If you and dh can find ways to meet some other needs (since it sounds like there&#39;s a certain amount of meeting y&#39;alls connection needs involved), maybe you can feel better about not going to church so often, yourself. Do you see what I&#39;m getting at?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If a mom cancels a lunch date with her friend because her daughter doesn&#39;t want to go, when is it appropriate to expect a 6 yo to understand he has to cancel his desire to play Wii on Sunday when the rest of the family wants to do something together?<br/>\n </span></blockquote>*********************************<br/>\n<br/>\nSee, I&#39;d go at this whole (theoretical) situation from a different angle entirely. I know my 7yo is about 50% likely to back out of a lunch date with me and my best gal pal, so I plan for that in advance. I either arrange to meet somewhere my kid will like to be (McDs with a playland, a mall with a Chuck E Cheese) or I arrange an alternative for my kid. I set us all up for the best possible outcome. <br/>\n<br/>\nIf the rest of the family has plans - like today, we had plans to run some errands and Mo woke up and started playing computer games Right away - I remind Mo of the plans and then remind her again with time to change gears before we go. If she seems like she&#39;s going to have a really tough time leaving the games, I look for other unmet needs in the moment. Is there something we can bring along that&#39;s just as fun? Or does she really just need me to hang out with her and play With her for half an hour before we leave, instead of being all wrapped up in logistics.<br/>\n<br/>\nSomething to watch out for is having expectations as to what fairness looks like. Its possible to have lots of love and compassion and work to value and meet everyone&#39;s needs without it looking very fair to an outsider. Like I said, when Ray was little, his needs were gigantic. It took a huge amount of love and support and very active attention all day long to meet Ray&#39;s needs. Other parents were shocked how much attention he needed - but we had learned the hard way that trying to be &quot;fair&quot; in the sense of thinking his needs should only get equal play to ours left us all unhappy most of the time. It helped me to see Ray&#39;s neediness as an opportunity - a gift if you like. I got to learn more about myself and my capacity for love - and creative problem solving!<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Consensual Living Article","postDate":"1239387528","msgId":39428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMjk1NS41ODMwNC5xbUB3ZWIzNjkwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39427,"nextInTopic":39430,"prevInTime":39427,"nextInTime":39429,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"  My dh doesn t force me to go to church with him, and although we have different spiritual beliefs, I actually use the time to learn something new, enjoy","messageBody":"<div id=\"ygrps-yiv-1390195424\">  &gt;&gt;My dh doesn&#39;t force me to go to church with him, and although we have<br/>\ndifferent spiritual beliefs, I actually use the time to learn something<br/>\nnew, enjoy the music, or just enjoy doing something with my dh<br/>\ntogether.  If my dh played flag football every week and wanted me to<br/>\ncome to his games, I would, as a choice and out of love, attend as many<br/>\ngames as I could because it means something to him. &gt;&gt;<br/>\n<br/>\nIt seems odd to me that a man would need his wife and family with him to fulfill his spiritual needs.  My husband has hobbies that he partakes in without me, and I have things I do without him, and then things that we both enjoy we do together--I don&#39;t need to go to his gaming sessions to &quot;be supportive&quot; or to show him I love him--he knows that, and he comes home excited and shares with me and I listen, and this is how I show my support--by listening and caring that he has a good time--NOT by having to be in attendance.  Sorry to say, it sounds a bit co-dependent to me....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I guess what I am trying to get at is this:  I hear a lot about<br/>\n </span></blockquote>consensual living and that it is about understanding where people are<br/>\nat and trying to meet the needs of each person, but at what point<br/>\nshould the children also be willing to give a little, since the parents<br/>\nare supposed to be expected to give so much.  If a mom cancels a lunch<br/>\ndate with her friend because her daughter doesn&#39;t want to go, when is<br/>\nit appropriate to expect a 6 yo to understand he has to cancel his<br/>\ndesire to play Wii on Sunday when the rest of the family wants to do<br/>\nsomething together? &gt;&gt;<br/>\n<br/>\nIf you want to have a lunch date,  find a way to make that acceptable to your kid--go to lunch at a kid-friendly restaurant, have your friend come to your house for lunch, send your kid to the park with grandma and go...there are too many options to name.  If your child wants to play wii on Sunday while the rest of the family wants to go elsewhere, find a babysitter, grandma, a friend, whomever, to stay with the kid and play.  Again, too many options to name.  There is no &quot;one person&#39;s wants&quot; coming out ahead there....unless *your* wants are &quot;I have to have my family around me at all times and we must all do fun things together as a family at all time&quot;--which again, is co-dependent imo.  <br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321243056,"authorName":"Heather & Markus Schleidt","from":"Heather & Markus Schleidt &lt;hmschleidt@...&gt;","profile":"hmschleidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Consensual Living Article","postDate":"1239385684","msgId":39427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEzMC1XNDU1NjQ5RUU1QjRGNTU0RTBFQUY0M0MyODAwQHBoeC5nYmw+","inReplyToHeader":"PGdybnBkdCtua2Q0QGVHcm91cHMuY29tPg==","referencesHeader":"PEE5NzU2M0ZBLTEyMzctNDE4Qi1CMkZDLUU2RTg0RTE4OEMyM0BnbWFpbC5jb20+IDxncm5wZHQrbmtkNEBlR3JvdXBzLmNvbT4="},"prevInTopic":39425,"nextInTopic":39428,"prevInTime":39426,"nextInTime":39428,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"Ren, I realize what you are saying because my parents forced me to go to Sunday School (three nerds from my high school plus me) and my husband was forced,","messageBody":"<div id=\"ygrps-yiv-449877757\">Ren,<br/>\n<br/>\n <br/>\n<br/>\nI realize what you are saying because my parents forced me to go to Sunday School (three nerds from my high school plus me) and my husband was forced, also, and he became rebellious for many years.  <br/>\n<br/>\n <br/>\n<br/>\nThe issue is that the rest of the family enjoys going and wants to go for the most part, so because of his limited age (and the fact that I can&#39;t pay a babysitter every Sunday) he has to come along, although I try not to force him to participate, etc if he doesn&#39;t want to.  I want him to enjoy the experience regardless of what he ends up believing as he grows older.  I have read some responses about bringing things that he enjoys and can do, asking a young adult from the church to take him to a playground (like that!!) and just letting him miss occassionally, which I already do.  He and I skip every once in a while together and I offer that option to anyone else that would like to take it.<br/>\n<br/>\n <br/>\n<br/>\nThe burning question, since I can see you are passionate about this, is &quot;How do you create a &#39;consensual&#39; environment when there are so many people and situations and emotions and opinions to deal with?  My dh doesn&#39;t force me to go to church with him, and although we have different spiritual beliefs, I actually use the time to learn something new, enjoy the music, or just enjoy doing something with my dh together.  If my dh played flag football every week and wanted me to come to his games, I would, as a choice and out of love, attend as many games as I could because it means something to him.  I, also, might bring my kids along most of the time, even if they weren&#39;t thrilled about it because I can&#39;t pay someone to watch them all the time just because they don&#39;t want to participate.  They wouldn&#39;t have to stand there and watch him every minute (nor any minute if they didn&#39;t want to) but that was my ultimate question - how do you create a consensual environment without forgetting about the adult needs, too?<br/>\n<br/>\n <br/>\n<br/>\nYou stated that I should stop &quot;forcing&quot; him to go, and I understand the principle behind that, but in an environment that tries to meet everyone&#39;s needs, my ds is the only one not getting his needs met (remember my other children like church and I enjoy the experience and time with my husband and value going with him to something important).  Since he is only now 6 years old, how would you handle that if it was something that was important to you - forget that it is church, maybe it is a sports event or a homeschool lecture you have to speak at, etc.  Just curious.  I have decided, since reading many of these posts, to skip church with him a little more often to try and make the times that he does have to go less impactful, but I really don&#39;t WANT to skip every week and I do nursery duty once a month as a voluntary commitment.<br/>\n<br/>\n <br/>\n<br/>\nI guess what I am trying to get at is this:  I hear a lot about consensual living and that it is about understanding where people are at and trying to meet the needs of each person, but at what point should the children also be willing to give a little, since the parents are supposed to be expected to give so much.  If a mom cancels a lunch date with her friend because her daughter doesn&#39;t want to go, when is it appropriate to expect a 6 yo to understand he has to cancel his desire to play Wii on Sunday when the rest of the family wants to do something together?  Does that make sense?  How can it be called &quot;consensual living&quot; if one person&#39;s needs or desires are met over the needs or desires of 5 others.  If my dh were &quot;forcing&quot; any of us to go, I would agree with your assessment and would stop forcing all of us to go at any cost.  But that is simply not the case.  My child is only forced to go at this point because of his legal age limit and the fact that every one else in the family wants to do this.<br/>\n<br/>\n <br/>\n<br/>\nDoes this line of questions make sense?  I am not arguing the &quot;go to church or not&quot; thing - I really am trying to get a grasp on how to make our home environment more respectful to each individual living here but still understand how to make that happen most of the time when there are 6 individuals with separate needs.  Any advice is appreciated and believe me, I have been talking to my husband day and night about the great advice I get here and how I am trying to implement it when I can.  He is slowly getting the unschooling as a lifestyle and even let the kids stay up the other night as long as they wanted without complaining to me!!!  <br/>\n<br/>\n <br/>\n<br/>\nThanks,<br/>\n<br/>\nHeather<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a><br/>\nDate: Fri, 10 Apr 2009 15:42:53 +0000<br/>\nSubject: [unschoolingbasics] Re: Consensual Living Article<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~~My husband and I have both agreed that we don&#39;t want to force one set<br/>\nof beliefs on our children and when they are old enough to stay home<br/>\nalone if they so choose that they may make that decision or choose to<br/>\nattend another worship-style, church, or activity while we go to<br/>\nchurch but right now we have the age issue and he doesn&#39;t have the<br/>\noption to stay home regularly without me staying home and<br/>\ndisrespecting my husband&#39;s needs for this.~~<br/>\n<br/>\nHere&#39;s my take on it, for what it&#39;s worth. An adult should have the capability to own their issues. If church is important to him and everyone else is going to keep him happy, that&#39;s not healthy, nor is it consensual. It&#39;s one thing if the other people are enjoying the time and getting something out of it. He&#39;s old enough to understand that church is HIS thing. <br/>\n<br/>\nBut that&#39;s just me. I would never make my child attend church to keep my dh happy. I grew up being forced to go to church and not only do I NOT attend another worship-style church, I don&#39;t attend church at all. Nor do I believe in any religion. So if your kid doesn&#39;t like going to church, stop making him go. Your dh can take care of his own religious needs, his children aren&#39;t responsible for keeping him happy. <br/>\n<br/>\nMy cynical .02.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\ncan <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nRediscover Hotmail®: Get e-mail storage that grows with you. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://windowslive.com/RediscoverHotmail?ocid=TXT_TAGLM_WL_HM_Rediscover_Storage1_042009\">http://windowslive.com/RediscoverHotmail?ocid=TXT_TAGLM_WL_HM_Rediscover_Storage1_042009</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Consensual Living Article","postDate":"1239378173","msgId":39425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdybnBkdCtua2Q0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE5NzU2M0ZBLTEyMzctNDE4Qi1CMkZDLUU2RTg0RTE4OEMyM0BnbWFpbC5jb20+"},"prevInTopic":39422,"nextInTopic":39427,"prevInTime":39424,"nextInTime":39426,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"~~My husband and I have both agreed that we don t want to force one set of beliefs on our children and when they are old enough to stay home alone if they so","messageBody":"<div id=\"ygrps-yiv-1979172154\">~~My husband and I have both agreed that we don&#39;t want to force one set<br/>\nof beliefs on our children and when they are old enough to stay home<br/>\nalone if they so choose that they may make that decision or choose to<br/>\nattend another worship-style, church, or activity while we go to<br/>\nchurch but right now we have the age issue and he doesn&#39;t have the<br/>\noption to stay home regularly without me staying home and<br/>\ndisrespecting my husband&#39;s needs for this.~~<br/>\n<br/>\n<br/>\nHere&#39;s my take on it, for what it&#39;s worth. An adult should have the capability to own their issues. If church is important to him and everyone else is going to keep him happy, that&#39;s not healthy, nor is it consensual. It&#39;s one thing if the other people are enjoying the time and getting something out of it.  He&#39;s old enough to understand that church is HIS thing. <br/>\n<br/>\nBut that&#39;s just me. I would never make my child attend church to keep my dh happy. I grew up being forced to go to church and not only do I NOT attend another worship-style church, I don&#39;t attend church at all. Nor do I believe in any religion. So if your kid doesn&#39;t like going to church, stop making him go. Your dh can take care of his own religious needs, his children aren&#39;t responsible for keeping him  happy. <br/>\n<br/>\nMy cynical .02.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula Moyer","from":"Krisula Moyer &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Consensual Living Article","postDate":"1239346103","msgId":39422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5NzU2M0ZBLTEyMzctNDE4Qi1CMkZDLUU2RTg0RTE4OEMyM0BnbWFpbC5jb20+"},"prevInTopic":39399,"nextInTopic":39425,"prevInTime":39421,"nextInTime":39423,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... If it is not acceptable for the entire family to cancel an appointment regularly to meet one person s needs, does anyone have any suggestions as to how","messageBody":"<div id=\"ygrps-yiv-456745050\"><blockquote><span title=\"ireply\">&gt;&gt;So, my ultimate question with regards to consensual living is this:  <br/>\n </span></blockquote>If it is not acceptable for the entire family to &quot;cancel&quot; an  <br/>\nappointment regularly to meet one person&#39;s needs, does anyone have any  <br/>\nsuggestions as to how to handle this situation with my 5 yo and still  <br/>\nmake it an enjoyable experience for him? I don&#39;t want him growing up  <br/>\nHATING going to church or resenting the fact that we forced him to go.  <br/>\nMy husband and I have both agreed that we don&#39;t want to force one set  <br/>\nof beliefs on our children and when they are old enough to stay home  <br/>\nalone if they so choose that they may make that decision or choose to  <br/>\nattend another worship-style, church, or activity while we go to  <br/>\nchurch but right now we have the age issue and he doesn&#39;t have the  <br/>\noption to stay home regularly without me staying home and  <br/>\ndisrespecting my husband&#39;s needs for this. I once read that love is a  <br/>\nchoice, so inspite of the fact that our views differ - I choose to  <br/>\nattend church with him out of love and respect for him, but my kids  <br/>\ndon&#39;t quite understand that just yet. &lt;&lt;<br/>\n<br/>\nCould a young adult from the church take your son on a little outing  <br/>\non sundays instead of having him attend the service?  We once had a  <br/>\nyoung woman from our church take my daughter to Starbucks while my  <br/>\nhusband and I worked as musicians during the service.  She would then  <br/>\ntake her to a playground to run and play until it was time to go  <br/>\nhome.  The young woman liked spendingtime with Anika better than  <br/>\nchurch as well so it was good  for everyone.: )<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] going to church","postDate":"1239250200","msgId":39399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5REQ3NTE4LjUwN0BtYWMuY29tPg==","inReplyToHeader":"PEJBWTEzMC1XMjg4NDI0NUM2RUY2NTQ5NDZGNzNBOEMyODMwQHBoeC5nYmw+","referencesHeader":"PEJBWTEzMC1XMjUyQTEzREM0ODEwNUI1QzRCNUYxQUMyODUwQHBoeC5nYmw+IDxncmpkNGgramhvNUBlR3JvdXBzLmNvbT4gPEJBWTEzMC1XMjg4NDI0NUM2RUY2NTQ5NDZGNzNBOEMyODMwQHBoeC5nYmw+"},"prevInTopic":39397,"nextInTopic":39422,"prevInTime":39398,"nextInTime":39400,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... Just yesterday I stood and watched a lot of little kids (mostly boys - maybe just a fluke) being forced to get their picture taken with the Easter Bunny. A","messageBody":"<div id=\"ygrps-yiv-830232482\">On 4/8/2009 8:33 PM, Heather & Markus Schleidt wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; These are all great questions and a lot of the advice I have received so far on this situation I have actually implemented.  For example, I asked the children which of them wanted to go see the Easter Bunny today and my ds (that doesn&#39;t want to go to church) said he didn&#39;t want to see the Easter Bunny.  This was an important event for my mother (living with us) and I really wanted all the children to participate and get a picture together.  BUT.... I told him that if he really didn&#39;t want to go that he would not have to and he could go to a friend&#39;s house while we went to the Easter Bunny, but then I did explain that grandma was excited and he might think about doing something nice for her and going and getting his picture taken, but that it truly was HIS choice.  I really meant it and I believe he understood that.  I told him I would come back in a few hours and he could let me know his decision.  In the end, he went with us voluntarily AND let me pick out a nice &quot;preppy&quot; type outfit that would look nice in the picture.  Not something he would usually wear but he didn&#39;t complain one bit.  I think because he KNEW it was his choice (really) that he made a decision that included all of us.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Just yesterday I stood and watched a lot of little kids (mostly boys - <br/>\nmaybe just a fluke) being forced to get their picture taken with the <br/>\nEaster Bunny. A SCARY guy, by the way - very very tall! There were those <br/>\nwho were sobbing, those who were screaming, some clinging to a parent, <br/>\nhanging on for all they were worth. I suppose it was contagious - <br/>\nbecause there were about 8 separate families in line and all the kids <br/>\nwere resisting.<br/>\n<br/>\nWay around on the side, kind of from the back, there was one mom who had <br/>\nhanded her phone to her little kid and was letting him take a picture of <br/>\nthe Easter Bunny. They were oblivious to the screaming and crying around <br/>\non the other side - they were smiling at each other and giggling. I <br/>\nthought how MUCH nicer those pictures would be as a memory - the Easter <br/>\nBunny kind of through some artificial plants and from the side.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":321243056,"authorName":"Heather & Markus Schleidt","from":"Heather & Markus Schleidt &lt;hmschleidt@...&gt;","profile":"hmschleidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] going to church","postDate":"1239247994","msgId":39397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEzMC1XMjg4NDI0NUM2RUY2NTQ5NDZGNzNBOEMyODMwQHBoeC5nYmw+","inReplyToHeader":"PGdyamQ0aCtqaG81QGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTEzMC1XMjUyQTEzREM0ODEwNUI1QzRCNUYxQUMyODUwQHBoeC5nYmw+IDxncmpkNGgramhvNUBlR3JvdXBzLmNvbT4="},"prevInTopic":39385,"nextInTopic":39399,"prevInTime":39396,"nextInTime":39398,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"These are all great questions and a lot of the advice I have received so far on this situation I have actually implemented.  For example, I asked the children","messageBody":"<div id=\"ygrps-yiv-2053979852\">These are all great questions and a lot of the advice I have received so far on this situation I have actually implemented.  For example, I asked the children which of them wanted to go see the Easter Bunny today and my ds (that doesn&#39;t want to go to church) said he didn&#39;t want to see the Easter Bunny.  This was an important event for my mother (living with us) and I really wanted all the children to participate and get a picture together.  BUT.... I told him that if he really didn&#39;t want to go that he would not have to and he could go to a friend&#39;s house while we went to the Easter Bunny, but then I did explain that grandma was excited and he might think about doing something nice for her and going and getting his picture taken, but that it truly was HIS choice.  I really meant it and I believe he understood that.  I told him I would come back in a few hours and he could let me know his decision.  In the end, he went with us voluntarily AND let me pick out a nice &quot;preppy&quot; type outfit that would look nice in the picture.  Not something he would usually wear but he didn&#39;t complain one bit.  I think because he KNEW it was his choice (really) that he made a decision that included all of us.<br/>\n<br/>\n <br/>\n<br/>\nWe attend a small church and it is one that works for both my dh and me.  It has taken us 7 years to find one that is suitable to us both, so we are set here, but I think I will talk to dh and try to be more flexible with my ds and his desires.  I know that my dh would be ok with that, as long as we come along occassionally.  He, too, likes skipping church and just hanging out as a family on Sundays (our only day off work) so I can probably organize a fun-type day that accentuates the &quot;family&quot; aspect of being together and not just sleeping in and all doing our own thing.  We do that often during the week, so a few fun things for all of us as a family on Sundays once a month or every 6 weeks or so would probably be something my dh would go for and would help with ds.  I can even involve all the kids in deciding what that activity might be.<br/>\n<br/>\n <br/>\n<br/>\nPS - since I have been on this board and have tried to really use the advice I have been given, I have had more compliments about my children and their behavior and respect for others.  It has been exciting to see their growth and I REALLY appreciate the advice.  Thanks!<br/>\n<br/>\n <br/>\n<br/>\nHeather<br/>\n <br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a><br/>\nDate: Wed, 8 Apr 2009 23:48:33 +0000<br/>\nSubject: [unschoolingbasics] going to church<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIs there something he can bring along to do quietly that he enjoys - a portable game or movie, perhaps? Altenately, can you get a babysitter for him, one that will hang out with him at the church when he doesn&#39;t want to be in class and you aren&#39;t in the nursery? Or can you take on the nursery more often to give him the option of hanging out there with you? <br/>\n<br/>\nYou said he doesn&#39;t want to get up in time - are there other services you can attend? I don&#39;t know how big your church is, I&#39;m used to the big kind that have a bunch of alternate times. If you&#39;ve been going to a small church, can you find a larger one that has more options? <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nRediscover Hotmail®: Get e-mail storage that grows with you. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://windowslive.com/RediscoverHotmail?ocid=TXT_TAGLM_WL_HM_Rediscover_Storage1_042009\">http://windowslive.com/RediscoverHotmail?ocid=TXT_TAGLM_WL_HM_Rediscover_Storage1_042009</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"going to church","postDate":"1239234513","msgId":39385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyamQ0aCtqaG81QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEzMC1XMjUyQTEzREM0ODEwNUI1QzRCNUYxQUMyODUwQHBoeC5nYmw+"},"prevInTopic":39384,"nextInTopic":39397,"prevInTime":39384,"nextInTime":39386,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"Is there something he can bring along to do quietly that he enjoys - a portable game or movie, perhaps? Altenately, can you get a babysitter for him, one that","messageBody":"<div id=\"ygrps-yiv-1303598699\">Is there something he can bring along to do quietly that he enjoys - a portable game or movie, perhaps? Altenately, can you get a babysitter for him, one that will hang out with him at the church when he doesn&#39;t want to be in class and you aren&#39;t in the nursery? Or can you take on the nursery more often to give him the option of hanging out there with you? <br/>\n<br/>\nYou said he doesn&#39;t want to get up in time - are there other services you can attend? I don&#39;t know how big your church is, I&#39;m used to the big kind that have a bunch of alternate times. If you&#39;ve been going to a small church, can you find a larger one that has more options? <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Consensual Living Article","postDate":"1239226354","msgId":39384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMDkwNDA4MTQzMnQzMzFiNjM4M3c5MjBkZmE3ODUxYWQ4OTNkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39364,"nextInTopic":39385,"prevInTime":39383,"nextInTime":39385,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"I try to practise integrated living, in which kids are not excluded from decision-making.  It is hard,when I empathize with a child member of my family dealing","messageBody":"<div id=\"ygrps-yiv-344691239\">I try to practise integrated living, in which kids are not excluded from<br/>\ndecision-making.  It is hard,when I empathize with a child member of my<br/>\nfamily dealing with a rough situation and  strangers try to label me a saint<br/>\nor complain about whining just &quot;encouraging&quot; things. They don&#39;t understand<br/>\nthe mutuality in our relationship(reciprocity)?<br/>\n<br/>\nThe author is &quot;one of those people&quot; who thinks kids should be seen and not<br/>\nheard.  Empowered children are outside her box!<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Consensual Living Article","postDate":"1239197615","msgId":39364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRTgxQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39346,"nextInTopic":39384,"prevInTime":39363,"nextInTime":39365,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"We do something similar - there are times DS doesn t want to go but none of us is comfortable with him being home himself for the situation (he s almost 11 but","messageBody":"<div id=\"ygrps-yiv-968791945\">We do something similar - there are times DS doesn&#39;t want to go but none\r<br/>\nof us is comfortable with him being home himself for the situation (he&#39;s\r<br/>\nalmost 11 but we&#39;re gone from 8:30 to about 1:00 and it&#39;s a 25-30 minute\r<br/>\ndriving distance). However, he knows that it is important for me and for\r<br/>\nDH, it&#39;s *our* issue, something we need/want/enjoy. Sometimes, one or\r<br/>\nboth of us will stay home with him and he knows he can ask/request to\r<br/>\nstay home and we will try to work something out. More often, though, we\r<br/>\nall go because DH and I often have commitments we&#39;ve made - for\r<br/>\ninstance, on April 19 DH is preaching; Since January, I&#39;ve been teaching\r<br/>\nthe under-7 yr old class (but then DS is my co-teacher and helps design\r<br/>\nthe activities so it&#39;s a whole other arrangement). Also, we bring a bag\r<br/>\no&#39; stuff for DS and always have - a water bottle, a few simple/quiet\r<br/>\nsnacks, activities of his choice - currently that&#39;s a couple books and\r<br/>\nhis sketchpad and colored pencils but it has up until recently also\r<br/>\nincluded his Nintendo DS with headphones. Yes, he has sat through the\r<br/>\nentire worship service with his headphones on playing Pokemon - and been\r<br/>\nmuch less disruptive to those around than the folks who try to get their\r<br/>\n5 yr olds to sit quietly for over an hour (worship time runs about 75\r<br/>\nminutes on average, sometimes less, rarely more) with a handful of\r<br/>\nCheerios, a piece of paper and 3 crayons. There was one particular\r<br/>\nmorning where I was teaching and DH had some responsibilities so staying\r<br/>\nhome wouldn&#39;t work but DS was really tired (he forgot that it was\r<br/>\nSaturday night - even though I reminded him as he has requested - so he\r<br/>\nstayed up all night, was awake when we got up). We went slowly getting\r<br/>\nready, and he just curled up on his jacket in the classroom and napped\r<br/>\nthrough class and worship (the classroom is not the same place as where\r<br/>\nworship is; that day we actually ended up with no kids in class - one\r<br/>\nwas at her dad&#39;s that weekend and the other two &#39;regulars&#39; stayed home\r<br/>\nbecause of a cold). He also spent the better part of last year sitting\r<br/>\nwith me in the adult class because he didn&#39;t want to go to the kid&#39;s\r<br/>\nclass and that was fine (we did agree that being in class -smaller\r<br/>\nspace, etc- was not good for the Nintendo DS so he read or colored or\r<br/>\nnapped instead). I think that what really goes far is acknowledging his\r<br/>\nfeelings, not rushing the situation, and providing as much as we can of\r<br/>\n&#39;comforts of home&#39; - for instance, on those rough mornings, I might\r<br/>\nspend a little extra time and instead of just popping some slices of\r<br/>\ncheese and some crackers into a ziplock, I&#39;ll get out the mini cookie\r<br/>\ncutters and make heart shapes with the cheese, just a little extra bit\r<br/>\no&#39; lovin&#39; for him. Oh, and we also express honest appreciation for his\r<br/>\ncooperation and attendance same as I would if DH did something that he\r<br/>\nwasn&#39;t all that crazy about because it was important to me. Plus, over\r<br/>\nthe last couple of years, there are some tasks that HE has taken on\r<br/>\nalongside us, that he feels ownership of. For instance, about 2 some\r<br/>\nyears ago, he didn&#39;t want to go to the kid&#39;s class and I wasn&#39;t teaching\r<br/>\na class, so we had our own class together (we studied the book of Acts\r<br/>\nby his choice BTW). We met in the only space available at the time - the\r<br/>\nfood pantry space. Well, since we were there anyhow, we just started to\r<br/>\nshelve items that had been donated each week, inventory items and\r<br/>\nprovide a list of needed items for the weekly bulletin, etc. We no\r<br/>\nlonger have our own class in there but his first stop each Sunday is to\r<br/>\ncheck the donation bin and help me shelve the items coming in and check\r<br/>\nwhat items are running low. Plus, he has always had an affinity for the\r<br/>\nlittler kids and loves helping with them - he has a developed a &#39;plan&#39;\r<br/>\nfor when some of the 4-6 yr olds are playing afterward and their parents\r<br/>\nare wanting to go - I signal him and he plays chase and runs the kids\r<br/>\nover to their parents via a circuitous route. Kids had fun and parents\r<br/>\nare grateful and DS just loves helping. Long winded way of saying if\r<br/>\nthere is some sort of task that you can work side by side on whether\r<br/>\nit&#39;s picking up coffee cups after coffee hour or setting songbooks back\r<br/>\nin their places or what have you (depending on what is available at your\r<br/>\nplace of worship). The other thing DS has self-chosen is to pick up the\r<br/>\nsmall plastic communion cups each week to take to the trash can (and he\r<br/>\nhelps when I have the responsibility for setting up the coffee and\r<br/>\ncommunion each week for the month).\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284534827,"authorName":"Jeff Sabo","from":"Jeff Sabo &lt;freeboysdad@...&gt;","profile":"freeboysdad","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Consensual Living Article","postDate":"1239113549","msgId":39346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2NjA2MC45Mzg0OC5xbUB3ZWI1NTgwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":39345,"nextInTopic":39364,"prevInTime":39345,"nextInTime":39347,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"This is a really interesting situation. In your second paragraph, you mention that your DH expects to go whether your children (or you, for that matter) wish","messageBody":"<div id=\"ygrps-yiv-819297885\">This is a really interesting situation. In your second paragraph, you mention that your DH expects to go whether your children (or you, for that matter) wish to go or not. I completely understand this, as I too held onto &quot;expectations&quot; for a while after we started unschooling. But I think there is a big difference between an expectation and a need. As an example (example only - - no need to argue with it :-)), if one of your kids got hurt and had to go to the emergency room, well there&#39;s not much wriggle room for anyone in terms of being able to say &quot;no&quot; - you HAVE to go, DH HAS to go, and it&#39;s extremely likely that you both WANT to go - so it&#39;s a true need. But the church example is another matter entirely, I think. I know it is important to him, just like having meals together, strict bedtimes, having a clean house, and hearing &quot;please&quot; and &quot;thank you&quot; were important to me once upon a time. But as I began to embrace unschooling, I had to release my<br/>\n family from my own expectations of them, and allow them the room and the freedom to set their own expectations for themselves. This was hard, for sure; after all, I had 30 years to build up the notion of what the perfect family was in my mind, based on examples and other input from society. But I don&#39;t think that unschooling does or should have many (if any) components that involve &quot;expectations&quot; in the traditional sense, primarily because expectations can be very, very powerful and lead us to say or do things that are manipulative or coersive in order to have our expectations met. <br/>\n <br/>\nNow setting that word aside, it could be that DH finds a deep sense of peace and enlightenment at Church that he wants to share with his whole family, much like the way our kids find things that they just cannot wait to tell us or share with us throughout the day, simply because they&#39;re just so exciting and meaningful. How very admirable that is. But if that&#39;s the case, isn&#39;t there a happy middle ground in which DH and the kids who WANT to go DO go, and then come home and share their sense of peace and excitement with the other? If you were able to do something like that, the folks who want to stay home would feel valued, and the folks who want to go to Church would feel valued. <br/>\n <br/>\nBest wishes for a peaceful resolution that works for all of you - <br/>\n <br/>\nJeff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Tue, 4/7/09, Heather & Markus Schleidt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hmschleidt@...\">hmschleidt@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Heather & Markus Schleidt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hmschleidt@...\">hmschleidt@...</a>&gt;<br/>\nSubject: RE: [unschoolingbasics] Consensual Living Article<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Tuesday, April 7, 2009, 12:24 AM<br/>\n<br/>\n<br/>\n<br/>\nI have a question.  I am working really hard on creating an environment that is more equal and respectful for the parents and children.  It is very difficult (especially right now with my parents living with us - soon to end!!!) because my husband is much farther behind on the curve than I am, but I keep working on him and talking to him about what I am learning on this board and books I read and articles, etc.  He really is learning and trying to work on it, too, although he is DEFINATELY more old-school than I am.  <br/>\n<br/>\n<br/>\n<br/>\nAnyway, my question has to do with attending church as a family.  My husband and I have very different religious views, however, we agree to respect each other and we do very well in this.  He was raised going to church as a family and expects that our children (4 kids, 8 years and under) go with us regardless of whether they want to or not.  This is not a problem for 3 of my kids who love going, however, my 5 yo does not like church, does not want to get up in time for it, sulks around the house, stomps his feet because he has to get his shoes on, etc.  Sometimes he enjoys himself after he gets there, sometimes he does not.<br/>\n<br/>\n<br/>\n<br/>\nBecause I value my husband and the time for us to be together in something that is very important to him, I &quot;force&quot; my child to attend, although I do give him the option of not going to his class and sitting with us if he wants, which is often times appealing to him.  I also allow him to help when I have nursery duty.  I have also come to the conclusion that it is ok for us to skip church once in a while and have explained that to my husband who does not push it when I say that I feel that a certain day is calling us to stay home.  Sometimes he goes without me, sometimes he, too, chooses to stay at home and enjoy the day - which almost always happens!<br/>\n<br/>\n<br/>\n<br/>\nSo, my ultimate question with regards to consensual living is this:  If it is not acceptable for the entire family to &quot;cancel&quot; an appointment regularly to meet one person&#39;s needs, does anyone have any suggestions as to how to handle this situation with my 5 yo and still make it an enjoyable experience for him?  I don&#39;t want him growing up HATING going to church or resenting the fact that we forced him to go.  My husband and I have both agreed that we don&#39;t want to force one set of beliefs on our children and when they are old enough to stay home alone if they so choose that they may make that decision or choose to attend another worship-style, church, or activity while we go to church but right now we have the age issue and he doesn&#39;t have the option to stay home regularly without me staying home and disrespecting my husband&#39;s needs for this.  I once read that love is a choice, so inspite of the fact that our views differ - I choose to attend church<br/>\n with him out of love and respect for him, but my kids don&#39;t quite understand that just yet.  <br/>\n<br/>\n<br/>\n<br/>\nAny help with this one??  In almost all other areas (art class, cub scouts, tae kwon do, choosing a restaurant) I am very respectful and ASK my children if they would like to attend that class or if they have suggestions for dinner, etc, but this is a difficult thing for me because it involves the whole family.  I can&#39;t stand when people tell a child they have to finish an activity or sport because the parent paid money for it, whether they like it or not, but I feel the church thing is more about respect for my husband and the other children in my family that look forward to attending each week.<br/>\n<br/>\n<br/>\n<br/>\nThoughts anyone?<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:list.brad@...\">list.brad@...</a><br/>\nDate: Mon, 6 Apr 2009 16:13:46 -0600<br/>\nSubject: RE: [unschoolingbasics] Consensual Living Article<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; From: Amy<br/>\n&gt; What do you think?<br/>\n&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents\">http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents</a><br/>\n-are-equals/<br/>\n<br/>\nThe best way to get your questions answered about Consensual Living would be<br/>\nto join their Yahoo group and read the archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Consensual-living/\">http://groups.yahoo.com/group/Consensual-living/</a><br/>\n<br/>\nOn your link above, I got a good chuckle from one of the commenters who said<br/>\nthey removed all rules for a week and just let their children make all<br/>\ndecisions, without any guidance, and the fact that after a week they wanted<br/>\ntheir old mom back with all of the rules means that CL doesn&#39;t work.<br/>\n<br/>\nThe main link I find between CL and Unschooling thought is the emphasis on<br/>\nTrust.<br/>\n<br/>\n-=b.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nWindows Live™: Keep your life in sync.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://windowslive.com/explore?ocid=TXT_TAGLM_WL_allup_1a_explore_042009\">http://windowslive.com/explore?ocid=TXT_TAGLM_WL_allup_1a_explore_042009</a><br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":367169565,"authorName":"Melissa Gray","from":"Melissa Gray &lt;melissagr8@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Consensual Living Article","postDate":"1239111211","msgId":39345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwMjE4NDIwLTFBRDItNERBQi05MjFCLThFM0Y5NUU0NzA1NUBnbWFpbC5jb20+","inReplyToHeader":"PEJBWTEzMC1XMjUyQTEzREM0ODEwNUI1QzRCNUYxQUMyODUwQHBoeC5nYmw+","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+IDw0OWRhN2VhMC4yMDAxOGUwYS40N2E4LmZmZmY5OTA4QG14Lmdvb2dsZS5jb20+IDxCQVkxMzAtVzI1MkExM0RDNDgxMDVCNUM0QjVGMUFDMjg1MEBwaHguZ2JsPg=="},"prevInTopic":39344,"nextInTopic":39346,"prevInTime":39344,"nextInTime":39346,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"We have a large family, and often there are things scheduled that a majority of people want to do, but one or two don t. In situations like that, we make sure","messageBody":"<div id=\"ygrps-yiv-2065810641\">We have a large family, and often there are things scheduled that a  <br/>\nmajority of people want to do, but one or two don&#39;t.<br/>\n<br/>\nIn situations like that, we make sure to include an extra activity  <br/>\nthat makes it worth it to the people who don&#39;t want to go. It&#39;s not a  <br/>\npay-off, not really, but just saying, I know this sucks for you, does  <br/>\nx or y make it a bit more appealing? For church, it meant eating out  <br/>\nafter church twice a month (which hey! Worked out for me too, because  <br/>\nI didn&#39;t have to come home and cook lol!) For drs appointments and  <br/>\nsuch, it means stopping at Sonic or some similar place for ice cream  <br/>\nafterwards. On park days or other unschool activity days, it might  <br/>\nmean stopping by a favorite book store or fun place to hang out a while.<br/>\n<br/>\nIt also means adjusting our expectations for what THAT child might be  <br/>\ndoing while we&#39;re there. DS&#39;s are often in attendance, with  <br/>\nheadphones...sometimes my iphone so they can surf the net. Lots of  <br/>\nspiral notebooks and pens.<br/>\nA library book. pokemon cards. whatever the passion.<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel, Avari and baby  <br/>\nNathan<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 7, 2009, at 2:24 AM, Heather & Markus Schleidt wrote:<br/>\n&gt;<br/>\n&gt; So, my ultimate question with regards to consensual living is  <br/>\n&gt; this:  If it is not acceptable for the entire family to &quot;cancel&quot; an  <br/>\n&gt; appointment regularly to meet one person&#39;s needs, does anyone have  <br/>\n&gt; any suggestions as to how to handle this situation with my 5 yo and  <br/>\n&gt; still make it an enjoyable experience for him?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Consensual Living Article","postDate":"1239110319","msgId":39344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyZmpyZis2bWhhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEEwQzI2MkQxLTc1ODUtNDRGNC1BMTFFLTkyNzFDRDE4MUVGRUB2ZXJpem9uLm5ldD4="},"prevInTopic":39341,"nextInTopic":39345,"prevInTime":39343,"nextInTime":39345,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... I think sometimes giving it something appealing afterwards helps too.  We have 4 young kids as well, and one that often isnt interested as much in the","messageBody":"<div id=\"ygrps-yiv-1380900257\"><blockquote><span title=\"ireply\">&gt; &gt; I feel the church thing is more about respect for my husband and  <br/>\n&gt; &gt; the other children in my family that look forward to attending each  <br/>\n&gt; &gt; week.<br/>\n&gt; <br/>\n&gt; How about approaching it that way to him? Let him know having the   <br/>\n&gt; whole family go to church together is something Daddy loves. (You&#39;re  <br/>\n&gt; not telling him why he needs to do it or why he needs to agree. It&#39;s  <br/>\n&gt; information on why you like to do it and how Daddy feels.)<br/>\n&gt; <br/>\n&gt; Let him know you and Daddy both appreciate it when he goes and that  <br/>\n&gt; you know it&#39;s not always fun. Ask him what can help make it easier  <br/>\n&gt; for him to do this nice thing for Daddy.<br/>\n&gt; <br/>\n&gt; And involve him and the other kids in thinking up nice things to do  <br/>\n&gt; for other people throughout the week. And, when an opportunity to do  <br/>\n&gt; something nice for him arises, let him know how it makes you happy to  <br/>\n&gt; be able to do nice things for him too :-)<br/>\n&gt; <br/>\n&gt; How about a periodic Do Something Nice Day? Each person secretly gets  <br/>\n&gt; someone else&#39;s name and they secretly do something nice for that  <br/>\n&gt; person :-)<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n </span></blockquote>I think sometimes giving it something appealing afterwards helps too.  We have 4 young kids as well, and one that often isnt interested as much in the activities as the others and I try to help make it more appealing with a trip to fun stores or lunch out or just ice cream on the way home.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Consensual Living Article","postDate":"1239099787","msgId":39341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwQzI2MkQxLTc1ODUtNDRGNC1BMTFFLTkyNzFDRDE4MUVGRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEJBWTEzMC1XMjUyQTEzREM0ODEwNUI1QzRCNUYxQUMyODUwQHBoeC5nYmw+","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+IDw0OWRhN2VhMC4yMDAxOGUwYS40N2E4LmZmZmY5OTA4QG14Lmdvb2dsZS5jb20+IDxCQVkxMzAtVzI1MkExM0RDNDgxMDVCNUM0QjVGMUFDMjg1MEBwaHguZ2JsPg=="},"prevInTopic":39340,"nextInTopic":39344,"prevInTime":39340,"nextInTime":39342,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... How about approaching it that way to him? Let him know having the whole family go to church together is something Daddy loves. (You re not telling him why","messageBody":"<div id=\"ygrps-yiv-1824478550\">On Apr 7, 2009, at 3:24 AM, Heather & Markus Schleidt wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel the church thing is more about respect for my husband and  <br/>\n&gt; the other children in my family that look forward to attending each  <br/>\n&gt; week.<br/>\n<br/>\n </span></blockquote>How about approaching it that way to him? Let him know having the   <br/>\nwhole family go to church together is something Daddy loves. (You&#39;re  <br/>\nnot telling him why he needs to do it or why he needs to agree. It&#39;s  <br/>\ninformation on why you like to do it and how Daddy feels.)<br/>\n<br/>\nLet him know you and Daddy both appreciate it when he goes and that  <br/>\nyou know it&#39;s not always fun. Ask him what can help make it easier  <br/>\nfor him to do this nice thing for Daddy.<br/>\n<br/>\nAnd involve him and the other kids in thinking up nice things to do  <br/>\nfor other people throughout the week. And, when an opportunity to do  <br/>\nsomething nice for him arises, let him know how it makes you happy to  <br/>\nbe able to do nice things for him too :-)<br/>\n<br/>\nHow about a periodic Do Something Nice Day? Each person secretly gets  <br/>\nsomeone else&#39;s name and they secretly do something nice for that  <br/>\nperson :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321243056,"authorName":"Heather & Markus Schleidt","from":"Heather & Markus Schleidt &lt;hmschleidt@...&gt;","profile":"hmschleidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Consensual Living Article","postDate":"1239089087","msgId":39340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEzMC1XMjUyQTEzREM0ODEwNUI1QzRCNUYxQUMyODUwQHBoeC5nYmw+","inReplyToHeader":"PDQ5ZGE3ZWEwLjIwMDE4ZTBhLjQ3YTguZmZmZjk5MDhAbXguZ29vZ2xlLmNvbT4=","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+IDw0OWRhN2VhMC4yMDAxOGUwYS40N2E4LmZmZmY5OTA4QG14Lmdvb2dsZS5jb20+"},"prevInTopic":39339,"nextInTopic":39341,"prevInTime":39339,"nextInTime":39341,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"I have a question.  I am working really hard on creating an environment that is more equal and respectful for the parents and children.  It is very difficult","messageBody":"<div id=\"ygrps-yiv-1823326427\">I have a question.  I am working really hard on creating an environment that is more equal and respectful for the parents and children.  It is very difficult (especially right now with my parents living with us - soon to end!!!) because my husband is much farther behind on the curve than I am, but I keep working on him and talking to him about what I am learning on this board and books I read and articles, etc.  He really is learning and trying to work on it, too, although he is DEFINATELY more old-school than I am.  <br/>\n<br/>\n <br/>\n<br/>\nAnyway, my question has to do with attending church as a family.  My husband and I have very different religious views, however, we agree to respect each other and we do very well in this.  He was raised going to church as a family and expects that our children (4 kids, 8 years and under) go with us regardless of whether they want to or not.  This is not a problem for 3 of my kids who love going, however, my 5 yo does not like church, does not want to get up in time for it, sulks around the house, stomps his feet because he has to get his shoes on, etc.  Sometimes he enjoys himself after he gets there, sometimes he does not.<br/>\n<br/>\n <br/>\n<br/>\nBecause I value my husband and the time for us to be together in something that is very important to him, I &quot;force&quot; my child to attend, although I do give him the option of not going to his class and sitting with us if he wants, which is often times appealing to him.  I also allow him to help when I have nursery duty.  I have also come to the conclusion that it is ok for us to skip church once in a while and have explained that to my husband who does not push it when I say that I feel that a certain day is calling us to stay home.  Sometimes he goes without me, sometimes he, too, chooses to stay at home and enjoy the day - which almost always happens!<br/>\n<br/>\n <br/>\n<br/>\nSo, my ultimate question with regards to consensual living is this:  If it is not acceptable for the entire family to &quot;cancel&quot; an appointment regularly to meet one person&#39;s needs, does anyone have any suggestions as to how to handle this situation with my 5 yo and still make it an enjoyable experience for him?  I don&#39;t want him growing up HATING going to church or resenting the fact that we forced him to go.  My husband and I have both agreed that we don&#39;t want to force one set of beliefs on our children and when they are old enough to stay home alone if they so choose that they may make that decision or choose to attend another worship-style, church, or activity while we go to church but right now we have the age issue and he doesn&#39;t have the option to stay home regularly without me staying home and disrespecting my husband&#39;s needs for this.  I once read that love is a choice, so inspite of the fact that our views differ - I choose to attend church with him out of love and respect for him, but my kids don&#39;t quite understand that just yet.  <br/>\n<br/>\n <br/>\n<br/>\nAny help with this one??  In almost all other areas (art class, cub scouts, tae kwon do, choosing a restaurant) I am very respectful and ASK my children if they would like to attend that class or if they have suggestions for dinner, etc, but this is a difficult thing for me because it involves the whole family.  I can&#39;t stand when people tell a child they have to finish an activity or sport because the parent paid money for it, whether they like it or not, but I feel the church thing is more about respect for my husband and the other children in my family that look forward to attending each week.<br/>\n<br/>\n <br/>\n<br/>\nThoughts anyone?<br/>\n <br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:list.brad@...\">list.brad@...</a><br/>\nDate: Mon, 6 Apr 2009 16:13:46 -0600<br/>\nSubject: RE: [unschoolingbasics] Consensual Living Article<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Amy<br/>\n&gt; What do you think?<br/>\n&gt;<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents\">http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents</a><br/>\n-are-equals/<br/>\n<br/>\nThe best way to get your questions answered about Consensual Living would be<br/>\nto join their Yahoo group and read the archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Consensual-living/\">http://groups.yahoo.com/group/Consensual-living/</a><br/>\n<br/>\nOn your link above, I got a good chuckle from one of the commenters who said<br/>\nthey removed all rules for a week and just let their children make all<br/>\ndecisions, without any guidance, and the fact that after a week they wanted<br/>\ntheir old mom back with all of the rules means that CL doesn&#39;t work.<br/>\n<br/>\nThe main link I find between CL and Unschooling thought is the emphasis on<br/>\nTrust.<br/>\n<br/>\n-=b.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nWindows Live�: Keep your life in sync.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://windowslive.com/explore?ocid=TXT_TAGLM_WL_allup_1a_explore_042009\">http://windowslive.com/explore?ocid=TXT_TAGLM_WL_allup_1a_explore_042009</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Consensual Living Article","postDate":"1239075924","msgId":39339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3MUNEMDlCLTk4QjgtNDJDMS1BREM2LTU1NzgzNDg1REY0MkBnbWFpbC5jb20+","inReplyToHeader":"PDM5NDg0Ni4xMDcxNS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+IDwxOEM2RTcyNC0zNENCLTQ5Q0UtQjlEOS01ODMzNkU5NDNFRjBAZ21haWwuY29tPiA8Mzk0ODQ2LjEwNzE1LnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":39336,"nextInTopic":39340,"prevInTime":39338,"nextInTime":39340,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"Oops when I reread my comment that should have said the she did NOT research it or take it seriously. Faith Sent from my iPhone On Apr 6, 2009, at 8:32 PM,","messageBody":"<div id=\"ygrps-yiv-1396643249\">Oops when I reread my comment that should have said the she did NOT  <br/>\nresearch it or take it seriously.<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\nOn Apr 6, 2009, at 8:32 PM, BRIAN POLIKOWSKY  <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I did no get to the end of the article but it was really  <br/>\n&gt; condescending and written by someone who really cannot hide her  <br/>\n&gt; dislike of the idea.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ________________________________<br/>\n&gt; From: Faith Void &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:littlemsvoid@...\">littlemsvoid@...</a>&gt;<br/>\n&gt; To: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n&gt; &gt;<br/>\n&gt; Sent: Monday, April 6, 2009 5:21:19 PM<br/>\n&gt; Subject: Re: [unschoolingbasics] Consensual Living Article<br/>\n&gt;<br/>\n&gt; I thought it was crap. She did seem to have done any reasearch or<br/>\n&gt; tried to understand her chose topic.<br/>\n&gt;<br/>\n&gt; do you have specific questions about the article?<br/>\n&gt;<br/>\n&gt; Faith<br/>\n&gt;<br/>\n&gt; Sent from my iPhone<br/>\n&gt;<br/>\n&gt; On Apr 6, 2009, at 2:10 PM, Amy &lt;quinlonsma@yahoo. com&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; What do you think?<br/>\n&gt; &gt;<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdi\">http://www.parentdi</a> sh.com/2009/ 04/06/consensual -living-when-  <br/>\n&gt; kids-and- parents-are- equals/<br/>\n&gt; &gt;<br/>\n&gt; &gt; Love and Laughter,<br/>\n&gt; &gt;<br/>\n&gt; &gt; Amy<br/>\n&gt; &gt;<br/>\n&gt; &gt; snugglebugg. com/sagepixie<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Consensual Living Article","postDate":"1239067694","msgId":39336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyZWE3ZSs5cjl1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39335,"nextInTopic":39339,"prevInTime":39335,"nextInTime":39337,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"This article is terrible.  So are the comments.  This person is just shooting off at the mouth er.... pen, and has no real facts or useful information.","messageBody":"<div id=\"ygrps-yiv-549414997\">This article is terrible.  So are the comments.  This person is just shooting off at the mouth er.... pen, and has no real facts or useful information.  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amy &lt;quinlonsma@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; What do you think?<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents-are-equals/\">http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents-are-equals/</a> </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Consensual Living Article","postDate":"1239064330","msgId":39335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NDg0Ni4xMDcxNS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+IDwxOEM2RTcyNC0zNENCLTQ5Q0UtQjlEOS01ODMzNkU5NDNFRjBAZ21haWwuY29tPg=="},"prevInTopic":39333,"nextInTopic":39336,"prevInTime":39334,"nextInTime":39336,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"I did no get to the end of the article but it was really condescending and written by someone who really cannot hide her dislike of the idea.   Alex","messageBody":"<div id=\"ygrps-yiv-1318598865\">I did no get to the end of the article but it was really condescending and written by someone who really cannot hide her dislike of the idea. <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Faith Void &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:littlemsvoid@...\">littlemsvoid@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Monday, April 6, 2009 5:21:19 PM<br/>\nSubject: Re: [unschoolingbasics] Consensual Living Article<br/>\n<br/>\n<br/>\nI thought it was crap. She did seem to have done any reasearch or <br/>\ntried to understand her chose topic.<br/>\n<br/>\ndo you have specific questions about the article?<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 6, 2009, at 2:10 PM, Amy &lt;quinlonsma@yahoo. com&gt; wrote:<br/>\n<br/>\n&gt; What do you think?<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdi\">http://www.parentdi</a> sh.com/2009/ 04/06/consensual -living-when- kids-and- parents-are- equals/<br/>\n&gt;<br/>\n&gt; Love and Laughter,<br/>\n&gt;<br/>\n&gt; Amy<br/>\n&gt;<br/>\n&gt; snugglebugg. com/sagepixie<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Consensual Living Article","postDate":"1239056479","msgId":39333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4QzZFNzI0LTM0Q0ItNDlDRS1COUQ5LTU4MzM2RTk0M0VGMEBnbWFpbC5jb20+","inReplyToHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39332,"nextInTopic":39335,"prevInTime":39332,"nextInTime":39334,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"I thought it was crap. She did seem to have done any reasearch or tried to understand her chose topic. do you have specific questions about the article? Faith ","messageBody":"<div id=\"ygrps-yiv-2041502857\">I thought it was crap. She did seem to have done any reasearch or  <br/>\ntried to understand her chose topic.<br/>\n<br/>\ndo you have specific questions about the article?<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 6, 2009, at 2:10 PM, Amy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:quinlonsma@...\">quinlonsma@...</a>&gt; wrote:<br/>\n<br/>\n&gt; What do you think?<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents-are-equals/\">http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents-are-equals/</a><br/>\n&gt;<br/>\n&gt; Love and Laughter,<br/>\n&gt;<br/>\n&gt; Amy<br/>\n&gt;<br/>\n&gt; snugglebugg.com/sagepixie<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Consensual Living Article","postDate":"1239056026","msgId":39332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZGE3ZWEwLjIwMDE4ZTBhLjQ3YTguZmZmZjk5MDhAbXguZ29vZ2xlLmNvbT4=","inReplyToHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39330,"nextInTopic":39333,"prevInTime":39331,"nextInTime":39333,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"... http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents -are-equals/ The best way to get your questions answered about Consensual","messageBody":"<div id=\"ygrps-yiv-339153254\"><blockquote><span title=\"ireply\">&gt; From: Amy<br/>\n&gt; What do you think?<br/>\n&gt;<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents\">http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents</a><br/>\n-are-equals/<br/>\n<br/>\n<br/>\nThe best way to get your questions answered about Consensual Living would be<br/>\nto join their Yahoo group and read the archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Consensual-living/\">http://groups.yahoo.com/group/Consensual-living/</a><br/>\n<br/>\nOn your link above, I got a good chuckle from one of the commenters who said<br/>\nthey removed all rules for a week and just let their children make all<br/>\ndecisions, without any guidance, and the fact that after a week they wanted<br/>\ntheir old mom back with all of the rules means that CL doesn&#39;t work.<br/>\n<br/>\nThe main link I find between CL and Unschooling thought is the emphasis on<br/>\nTrust.<br/>\n<br/>\n<br/>\n-=b.</div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Consensual Living Article","postDate":"1239041457","msgId":39330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyMzkzOS42NzQ2Ny5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":39332,"prevInTime":39329,"nextInTime":39331,"topicId":39330,"numMessagesInTopic":0,"msgSnippet":"What do you think? http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents-are-equals/ Love and Laughter, Amy snugglebugg.com/sagepixie ","messageBody":"<div id=\"ygrps-yiv-1756530602\">What do you think?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents-are-equals/\">http://www.parentdish.com/2009/04/06/consensual-living-when-kids-and-parents-are-equals/</a><br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43930,"nextTopicId":43878}}