{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Q: How is it hard?","postDate":"1268667819","msgId":43352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFRTE1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":43349,"nextInTopic":0,"prevInTime":43351,"nextInTime":43353,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"I agree with Meredith - learning to be up front about what I was needing was helpful. Trying to get DS ready to head out the door BEFORE I ve eaten is a recipe","messageBody":"<div id=\"ygrps-yiv-1900510487\">I agree with Meredith - learning to be up front about what I was needing<br/>\nwas helpful. Trying to get DS ready to head out the door BEFORE I&#39;ve<br/>\neaten is a recipe for disaster. Instead I shower, eat, dress, pack up<br/>\nwhatever gear we need and THEN I can focus solely on DS&#39; needs as he&#39;s<br/>\ngetting ready. Or, on another tack, if I&#39;m feeling ick or tired, I just<br/>\ntell my DS and DH &quot;I&#39;m feeling ick - I need to go take a nap, come get<br/>\nme in an hour&quot; or whatever. Sometimes, something happens and they need<br/>\nto come get me sooner, other times, they peek in and see that I need<br/>\nmore sleep so they check back later.<br/>\n<br/>\nAlso, those &quot;bunch of better skills&quot; eventually become habit. You don&#39;t<br/>\nthink a whole lot about the mechanics of driving once you&#39;ve driven for<br/>\na while. If you knit or sew or whatever, you don&#39;t think a lot about the<br/>\nmechanics of doing it, you just do it. Same thing. As the skills of<br/>\npartnering with your family members become more &quot;comfortable&quot;, become<br/>\nyour habit, then even when you&#39;re sick, that&#39;s where you&#39;ll turn first -<br/>\nit may not be as smooth or easy as when you&#39;re in top form, but that&#39;ll<br/>\nbe your goal. <br/>\n<br/>\nOver time, a level of trust is &#39;banked&#39; such that on those days when you<br/>\nmaybe lose it a bit, or you&#39;re not in top form, the rest of the family<br/>\noften will give you the slack that you give them. There have been times<br/>\nwhen I was in bed feeling ick and DS will come check on me, ask if I<br/>\nneed anything, and so on - same way as I check in with him when he&#39;s<br/>\nick. It&#39;s a mutual caring and trusting that grows over time. <br/>\n<br/>\nDeb Rossing<br/>\nQuality Control<br/>\nCNC Software, Inc.<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [unschoolingbasics] Re: Newbie Q: How is it hard?","postDate":"1268604694","msgId":43349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyODA0Mi4zMzcwNC5xbUB3ZWI2NTcwNC5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PGhuajZicyt0NHZuQGVHcm91cHMuY29tPg=="},"prevInTopic":43348,"nextInTopic":43352,"prevInTime":43348,"nextInTime":43350,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"My experience w/ school was similar to Emma s.  We were in the system for 7 years.  Living a life totally controlled by the school calendar and schedule was","messageBody":"<div id=\"ygrps-yiv-984041720\">My experience w/ school was similar to Emma&#39;s.  We were in the system for 7 years.  Living a life totally controlled by the school calendar and schedule was not easy for me.  The stress in the morning of having 3 kids and their lunches ready in time for the bus was not fun for anyone.  But on top of that, I spent so much time over those years trying to make sure my children&#39;s needs were met while they were in a system that said it wanted my children to be authentically engaged, with teachers who were (mostly) really great people and were working hard to be progressive, caring teachers, when in reality the system could not meet their needs and those teachers were trapped in its dysfunction.  Those needs being academic, social, developmental: the need to feel safe, the need for a peaceful place to eat lunch, the need to feel heard....  My children all struggled with school differently.  For one of them the day was just too long, even when she was<br/>\n 8.  For another the social interactions were brutal.  P.E. was torture for my oldest.  Even though they were &quot;good students&quot; in the eyes of the school, school was not good for them, or our family.<br/>\n <br/>\nI spent so much time and energy coping with the fall out, communicating with teachers, meeting with administration, and volunteering in the school.  Now all that energy can go back to where it should have been all along, to my kids, our home, living a fun life together.<br/>\n <br/>\nUnschooling takes everything I have to give and then some.  However, it&#39;s positive.  School took everything I had and then some but for what?  For all the hour I invested we didn&#39;t make progress, we didn&#39;t improve the system and my girls&#39; struggles didn&#39;t go away.<br/>\n <br/>\nJenna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Q: How is it hard?","postDate":"1268588536","msgId":43344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuajc1byticjdxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuZ29wditqYmo2QGVHcm91cHMuY29tPg=="},"prevInTopic":43338,"nextInTopic":43348,"prevInTime":43343,"nextInTime":43345,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"... ********************* What helped me most was learning a bunch of better skills - and one of those has been how to manage my own needs better so I m not","messageBody":"<div id=\"ygrps-yiv-441432518\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So, how did you dismantle your &quot;authoritative&quot; bent to get to the place you are now? I suspect this is an area that will be &quot;hard&quot; for me - when I&#39;m tired, when I haven&#39;t eaten well, when I&#39;ve overindulged in caffeine, when something else is bugging me...<br/>\n </span></blockquote>*********************<br/>\n<br/>\nWhat helped me most was learning a bunch of better skills - and one of those has been how to manage my own needs better so I&#39;m not sticking myself in the position of being tired, hungry, etc as much as I used to be. In the process of learning to take better care of myself, I&#39;ve also come to notice better when I&#39;m getting cranky and be upfront about that with the people I love - it helps Me to notice it, because I can then either do something about it directly (eat! take a B vitamin!) or simply be aware that I&#39;m &quot;off&quot; and slow down a bit. Give myself time to take a deep breath and think, rather than flying off the handle. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Are you talking about &quot;getting it right&quot; with being a parent? Or being an unschooler?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nGetting it right in the sense of being A Good Role Model. It wasn&#39;t hard for me to get comfortable with the idea of kids learning &quot;naturally&quot; but I worried about giving the &quot;right&quot; messages to my kids, modelling the &quot;right&quot; things, providing the &quot;right&quot; environment to facilitate natural learning. That was part of my baggage, the idea that there was some optimal way to parent (or unschool for that matter) and if I didn&#39;t get it right I was selling my kids short. Letting go of that fear, its easier to connect with my kids, find out who they are and what their interests and passions and concernes may be. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":262197475,"authorName":"evalahu","from":"&quot;evalahu&quot; &lt;etuhill@...&gt;","profile":"evalahu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Q: How is it hard?","postDate":"1268587708","msgId":43348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuajZicyt0NHZuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuZHFoZys0MzNoQGVHcm91cHMuY29tPg=="},"prevInTopic":43344,"nextInTopic":43349,"prevInTime":43347,"nextInTime":43349,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"Hi Rebecca I just wanted to say something to support your joyful feelings and tell you what I think is hard. My dd went to school for about 2 years on and off","messageBody":"<div id=\"ygrps-yiv-1177883202\">Hi Rebecca<br/>\n<br/>\nI just wanted to say something to support your joyful feelings and tell you what I think is hard. My dd went to school for about 2 years on and off before we took the plunge to homeschool and then unschool. And from our experience of school, remembering to give your child money for lunch tickets every Monday morning is hard; remembering to wash the uniform on Sunday ready for Monday is hard (we&#39;re from the UK where school uniform is enforced in most schools); dashing home from wherever you happen to be at 3.00pm to pick your child up 5 DAYS A WEEK is hard; dragging a kicking screaming child into the classroom is hard; remembering to check your child&#39;s school bag for the myriad slips of paper the school sends home for you every week is hard; sitting for hours every week doing homework with your child is hard.... I think you get the idea. I REALLY struggled with all these things and more and I was so unhappy with the situation. It does look as if most of our reasons for taking our dd out of school were selfish personal ones, but I was unhappy and my dd was too, and once we gave it all up the sense of freedom was wonderful. I then tried to follow a curriculum and made us unhappy all over again, so I just stopped. <br/>\nI am astounded at how my dd learns and the things she choose to do with her time. There are days when I think hmm not much learning going on today, but I know now to shut up and relax. <br/>\n<br/>\nEnjoy your time together<br/>\nEmma<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all:<br/>\n&gt; <br/>\n&gt; After dithering for a long long time, we have finally decided to cut the strings of all our fears and fully/radically unschool in our family. Our son is 9-years-old and has always learned at home (but not in a school-at-home way... more super relaxed eclectic).<br/>\n&gt; <br/>\n&gt; I&#39;ve been scanning boards and sites and soaking up as much soul-edifying-bracing stuff about RU that I can but I keep bumping up against experienced folks saying that this way of doing things is &quot;hard&quot;. <br/>\n&gt; <br/>\n&gt; I know that it can be hard to move away from an adult-oriented home, but we&#39;ve never really had one of those. I know it can be hard to be attentive to our children 24/7 in a respectful and wide-awake way, and I have to work on that (including consciously moving away from where I&#39;m sitting right now... in front of this screen... and getting off the darned phone). I know that it can be hard to get one&#39;s mind away from top-down learning as being &quot;the way&quot; people learn (but I&#39;ve been in the natural learning camp for almost 20 years). I know it can be hard to let go of math (the reason it has taken me this long). And I know it takes work (or trust, if that&#39;s work) to not worry about your child turning into a screen/junkfood addict who never sleeps if we take away all parental controls (and we&#39;re not removing all stops right this minute... we are doing what Joyce suggests and saying &quot;yes&quot; as often as we can so that the transition is smooth for all of us).<br/>\n&gt; <br/>\n&gt; So... I&#39;d like to know what I&#39;m missing here. Is there some other ways this is &quot;hard&quot;?<br/>\n&gt; <br/>\n&gt; Right now, I&#39;m so full of joy and happiness in this life choice for our family  that I feel relaxed in ways I haven&#39;t for years. (Expectations are a heavy burden.) So, it&#39;s hard for me to imagine &quot;hard&quot;.<br/>\n&gt; <br/>\n&gt; Would love to hear some perspectives on this.<br/>\n&gt; <br/>\n&gt; Thanks so much!<br/>\n&gt; <br/>\n&gt; Rebecca<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca McClure","from":"&quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Q: How is it hard?","postDate":"1268508286","msgId":43334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZ29wditqYmo2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuZTBjbit1dGNpQGVHcm91cHMuY29tPg=="},"prevInTopic":43328,"nextInTopic":43338,"prevInTime":43333,"nextInTime":43335,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"... I guess that is the part where we come to an understanding that learning is not necessarily synonymous with school (or vice versa) or even things that look","messageBody":"<div id=\"ygrps-yiv-119057237\"><blockquote><span title=\"ireply\">&gt; I think you hit the nail on the head, Rebecca, the hard stuff is the deschooling. <br/>\n<br/>\n </span></blockquote>I guess that is the part where we come to an understanding that learning is not necessarily synonymous with school (or vice versa) or even things that look like school (i.e. curriculum, etc.). I&#39;ve been in that camp for a long time. In fact, I&#39;m even completely allergic to most guided field trips. I prefer outings to be open-ended with lots of opportunities to explore (without being told what to explore or how to explore or even how long to explore). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But having been an &quot;authoritative&quot; parent my own experience is that unschooling is much easier Because I&#39;m not fighting with my kids. <br/>\n<br/>\n </span></blockquote>I didn&#39;t start out as an authoritative parent. But I took on some work that grew into a full-time at-home job and I was juggling that and home-based learning at the same time. I got a bit cranky and intolerant (and bossy), which I deeply regret now. <br/>\n<br/>\nSo, how did you dismantle your &quot;authoritative&quot; bent to get to the place you are now? I suspect this is an area that will be &quot;hard&quot; for me - when I&#39;m tired, when I haven&#39;t eaten well, when I&#39;ve overindulged in caffeine, when something else is bugging me...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t feel the same pressure to &quot;get it right&quot; - not because I&#39;m perfect, but also not because there&#39;s no such thing as right and wrong. <br/>\n<br/>\n </span></blockquote>Are you talking about &quot;getting it right&quot; with being a parent? Or being an unschooler? Or?<br/>\n<br/>\nI had put together a response about &quot;getting it right&quot; with home learning (i.e. turning out a well-informed, educated child that proves it works) and how I am letting myself off that hook. But then I started wondering if I was on the same page as you on the &quot;getting it right&quot; bit. <br/>\n<br/>\nI was first involved in alt ed about 18 years ago (after I got my teaching degree) and at that time, I was reading John Holt and Grace Llewelyn and John Taylor Gatto (saw him speak) and it was all very exciting and I was quite happy to facilitate natural learning (according to what I thought unschooling was) with other people&#39;s children. But when I was recently working for a natural-learning supportive online school, there were forums where people could chat. I realized that unschooling has evolved (or people&#39;s understanding of it has) and that I needed to do a lot more thinking about it (especially about &quot;whole life&quot; unschooling) before I could just dive in and claim that&#39;s what we were doing. There seemed to be an element of &quot;doing it right&quot; (or maybe &quot;not doing it wrong&quot;) that I picked up on. So, I&#39;m wondering if that&#39;s what you are talking about? <br/>\n<br/>\nI truly believe that we&#39;ve been on the path for some time now, but I needed to sort some stuff out along the way before I could really throw off some of my worries and concerns and embrace it fully.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Here&#39;s a piece by Kelly Lovejoy about the &quot;stages&quot; of unschooling that might be helpful:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/stages\">http://sandradodd.com/unschool/stages</a><br/>\n<br/>\n </span></blockquote>Really helpful. Thanks, Meredith!<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca McClure","from":"&quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Q: How is it hard?","postDate":"1268457452","msgId":43328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZjc1Yyt0MDVkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMxMTMyNS42NjgyNi5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":43327,"nextInTopic":43334,"prevInTime":43327,"nextInTime":43329,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"... I read that and I liked  it! I know that trust will certainly be something I ll need to visit on a regular basis, especially since, in our home learning","messageBody":"<div id=\"ygrps-yiv-1954646827\">Schuyler  wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I think it is harder because you have to get to the point Joyce wrote about on Always Learning: &quot;If someone can redefine &quot;all one needs to know&quot; to the ability to explore and figure out how to get something to work for them *and* then trust that that is enough, they can get past that big initial  hump between them and &quot;getting&quot; unschooling.&quot;<br/>\n<br/>\n </span></blockquote>I read that and I liked  it! I know that trust will certainly be something I&#39;ll need to visit on a regular basis, especially since, in our home learning community, we are surrounded by folks who do some version of &quot;school at home&quot;. Fortunately, I do know some unschoolers, too, and it&#39;s thanks to their willingness to listen while I hash through my angsty areas that we&#39;re now embracing unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And living without the population of people who are also unschooling around, it is easy to feel that the classes and the achievements and the activities that others of their peers are doing are necessary, are good, are valuable, even if your child/ren doesn&#39;t want to go and do and be. <br/>\n<br/>\n </span></blockquote>It&#39;s a bit of a rat race out there in home-learning land - so many options! We started out on the &quot;many classes&quot; path  because I&#39;d offer and my son would say yes. It took a while for me to realize what he was saying yes to wasn&#39;t the actual class. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You have to be willing to get and up and go and do when you might otherwise be more inclined to sit and relax and not do.<br/>\n<br/>\n </span></blockquote>Oh, yes. This will be an area of focus for me. I like being home. :)<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; The rewards are amazing.<br/>\n<br/>\n </span></blockquote>Thanks so much for this, Schuyler!<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Newbie Q: How is it hard?","postDate":"1268419551","msgId":43338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2QwMWNhYzIxNCQzZjA1NTkxMCQxZTdiN2I3YkB1bHJpa2VjNjUwZmMxYj4=","referencesHeader":"PGhuZTBjbit1dGNpQGVHcm91cHMuY29tPg=="},"prevInTopic":43334,"nextInTopic":43344,"prevInTime":43337,"nextInTime":43339,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"Hi friends This may be off but as i m reading on this thread I am wondering why unschooling as in radical unschooling seems to be such a big thing. If I take","messageBody":"<div id=\"ygrps-yiv-1463027605\">Hi friends<br/>\n<br/>\nThis may be off but as i&#39;m reading on this thread I am wondering why &#39;unschooling&#39; as in radical unschooling seems to be such a big thing. <br/>\n<br/>\nIf I take any relationship that really works I find the partners in the relationship viewing each other as &#39;equals&#39;. Not necessarily equal in skills but equal in rights and allowance of needs. As soon as we look at another as being &#39;less than&#39; we have &#39;relationships&#39; that need all kinds of hoops for jumping through. And that is what I see with &#39;traditional parenting&#39; and schooling and many other forms of &#39;living and doing things together&#39;. Also in the work place.<br/>\n<br/>\nFor a parent who views the child(ren) as &#39;lacking&#39; it me seem hard to switch to unschooling. For a parent who sees the child as &#39;complete&#39; even though not fully skilled the &#39;unschooling&#39; way of relating may be the &#39;next natural step&#39; to be taken with the ease with which any other steps are taken.<br/>\n<br/>\nOff my soap box. &lt;grin&gt;<br/>\n<br/>\nUlrike<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Q: How is it hard?","postDate":"1268417751","msgId":43327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZTBjbit1dGNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuZHFoZys0MzNoQGVHcm91cHMuY29tPg=="},"prevInTopic":43323,"nextInTopic":43328,"prevInTime":43326,"nextInTime":43328,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"... ************ I think you hit the nail on the head, Rebecca, the hard stuff is the deschooling. Parenting is work, I think we all know that! But having been","messageBody":"<div id=\"ygrps-yiv-1740010973\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So... I&#39;d like to know what I&#39;m missing here. Is there some other ways this is &quot;hard&quot;?<br/>\n </span></blockquote>************<br/>\n<br/>\nI think you hit the nail on the head, Rebecca, the hard stuff is the deschooling. <br/>\n<br/>\nParenting is work, I think we all know that! But having been an &quot;authoritative&quot; parent my own experience is that unschooling is much easier Because I&#39;m not fighting with my kids. Sure, there are ups and downs and my kids are quirky and have a lot of energy and *I&#39;m* quirky and have a lot of Opinions! but its so much less stressful in so many ways. I don&#39;t feel the same pressure to &quot;get it right&quot; - not because I&#39;m perfect, but also not because there&#39;s no such thing as right and wrong. Its more that, if I screw up royally, I&#39;m not locked into the traditional parenting role of holding some imaginary line. I can back up, apologise, and try again. I get to be fallible and I get to be kind. <br/>\n<br/>\nHere&#39;s a piece by Kelly Lovejoy about the &quot;stages&quot; of unschooling that might be helpful:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/stages\">http://sandradodd.com/unschool/stages</a><br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Newbie Q: How is it hard?","postDate":"1268414012","msgId":43323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMTMyNS42NjgyNi5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhuZHFoZys0MzNoQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuZHFoZys0MzNoQGVHcm91cHMuY29tPg=="},"prevInTopic":43321,"nextInTopic":43327,"prevInTime":43322,"nextInTime":43324,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"I think unschooling, having only unschooled, is harder than any other approach in part because you aren t relying on other people s expertise to guide you.","messageBody":"<div id=\"ygrps-yiv-631990594\">I think unschooling, having only unschooled, is harder than any other approach in part because you aren&#39;t relying on other people&#39;s expertise to guide you. There are lists like this, but there aren&#39;t unschooling curriculums, there aren&#39;t people on the street, or people out walking their dog, or people giving advice on television about the unschooling way. It is a truly independent venture. <br/>\n<br/>\nI think it is harder because you have to get to the point Joyce wrote about on Always Learning: &quot;If someone can redefine &quot;all one needs to know&quot; to the ability to  <br/>\nexplore and figure out how to get something to work for them *and* then trust that that is enough, they can get past that big initial  hump between them and &quot;getting&quot; unschooling.&quot;&quot; -- You have to get to the point of truly trusting that your child/ren will learn all they need to know as they need to know it and not need to be pre-primed with knowledge before they come to a problem you the educator/parent predict may arise. And living without the population of people who are also unschooling around, it is easy to feel that the classes and the achievements and the activities that others of their peers are doing are necessary, are good, are valuable, even if your child/ren doesn&#39;t want to go and do and be. <br/>\n<br/>\nI think it is harder because it takes an active and engaged parent. You have to be willing to work to find your child/ren interesting things to do and explore and to support their interests as they come and be willing to move on as they move on. You have to notice when they are idling out of choice versus out of boredom and lack of stimulation. You have to be willing to accept no as an answer to questions that in a more traditionally parenting household might be asked, but wouldn&#39;t be optional. You have to be willing to get and up and go and do when you might otherwise be more inclined to sit and relax and not do. <br/>\n<br/>\nThe rewards are amazing. And the more you do, the longer you&#39;ve been doing, the harder it is to even imagine a world where you didn&#39;t believe that exploring the world was the best way to learning about the world.  <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Rebecca McClure &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ackirebecci@...\">ackirebecci@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Friday, 12 March, 2010 16:36:00<br/>\nSubject: [unschoolingbasics] Newbie Q: How is it hard?<br/>\n<br/>\nHi all:<br/>\n<br/>\nAfter dithering for a long long time, we have finally decided to cut the strings of all our fears and fully/radically unschool in our family. Our son is 9-years-old and has always learned at home (but not in a school-at-home way... more super relaxed eclectic).<br/>\n<br/>\nI&#39;ve been scanning boards and sites and soaking up as much soul-edifying-bracing stuff about RU that I can but I keep bumping up against experienced folks saying that this way of doing things is &quot;hard&quot;. <br/>\n<br/>\nI know that it can be hard to move away from an adult-oriented home, but we&#39;ve never really had one of those. I know it can be hard to be attentive to our children 24/7 in a respectful and wide-awake way, and I have to work on that (including consciously moving away from where I&#39;m sitting right now... in front of this screen... and getting off the darned phone). I know that it can be hard to get one&#39;s mind away from top-down learning as being &quot;the way&quot; people learn (but I&#39;ve been in the natural learning camp for almost 20 years). I know it can be hard to let go of math (the reason it has taken me this long). And I know it takes work (or trust, if that&#39;s work) to not worry about your child turning into a screen/junkfood addict who never sleeps if we take away all parental controls (and we&#39;re not removing all stops right this minute... we are doing what Joyce suggests and saying &quot;yes&quot; as often as we can so that the transition is smooth for all of us).<br/>\n<br/>\nSo... I&#39;d like to know what I&#39;m missing here. Is there some other ways this is &quot;hard&quot;?<br/>\n<br/>\nRight now, I&#39;m so full of joy and happiness in this life choice for our family  that I feel relaxed in ways I haven&#39;t for years. (Expectations are a heavy burden.) So, it&#39;s hard for me to imagine &quot;hard&quot;.<br/>\n<br/>\nWould love to hear some perspectives on this.<br/>\n<br/>\nThanks so much!<br/>\n<br/>\nRebecca<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca McClure","from":"&quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Newbie Q: How is it hard?","postDate":"1268411760","msgId":43321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZHFoZys0MzNoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43323,"prevInTime":43320,"nextInTime":43322,"topicId":43321,"numMessagesInTopic":0,"msgSnippet":"Hi all: After dithering for a long long time, we have finally decided to cut the strings of all our fears and fully/radically unschool in our family. Our son","messageBody":"<div id=\"ygrps-yiv-1865298007\">Hi all:<br/>\n<br/>\nAfter dithering for a long long time, we have finally decided to cut the strings of all our fears and fully/radically unschool in our family. Our son is 9-years-old and has always learned at home (but not in a school-at-home way... more super relaxed eclectic).<br/>\n<br/>\nI&#39;ve been scanning boards and sites and soaking up as much soul-edifying-bracing stuff about RU that I can but I keep bumping up against experienced folks saying that this way of doing things is &quot;hard&quot;. <br/>\n<br/>\nI know that it can be hard to move away from an adult-oriented home, but we&#39;ve never really had one of those. I know it can be hard to be attentive to our children 24/7 in a respectful and wide-awake way, and I have to work on that (including consciously moving away from where I&#39;m sitting right now... in front of this screen... and getting off the darned phone). I know that it can be hard to get one&#39;s mind away from top-down learning as being &quot;the way&quot; people learn (but I&#39;ve been in the natural learning camp for almost 20 years). I know it can be hard to let go of math (the reason it has taken me this long). And I know it takes work (or trust, if that&#39;s work) to not worry about your child turning into a screen/junkfood addict who never sleeps if we take away all parental controls (and we&#39;re not removing all stops right this minute... we are doing what Joyce suggests and saying &quot;yes&quot; as often as we can so that the transition is smooth for all of us).<br/>\n<br/>\nSo... I&#39;d like to know what I&#39;m missing here. Is there some other ways this is &quot;hard&quot;?<br/>\n<br/>\nRight now, I&#39;m so full of joy and happiness in this life choice for our family  that I feel relaxed in ways I haven&#39;t for years. (Expectations are a heavy burden.) So, it&#39;s hard for me to imagine &quot;hard&quot;.<br/>\n<br/>\nWould love to hear some perspectives on this.<br/>\n<br/>\nThanks so much!<br/>\n<br/>\nRebecca</div>","specialLinks":[]}],"prevTopicId":43336,"nextTopicId":43353}}