{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":94040812,"authorName":"Lisa Heyman","from":"&quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"reason, expectations, limits & compromising WAS Re: video games","postDate":"1194198153","msgId":27550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYyMUQ3MzFEQzA0QjJEQ0VBMEJBRDFEMThGMEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":27549,"nextInTime":27551,"topicId":27550,"numMessagesInTopic":0,"msgSnippet":"Posted by: Adrean Clark  adrean@tmail.com  fuzzyellowduck","messageBody":"<div id=\"ygrps-yiv-512577926\">Posted by: &quot;Adrean Clark&quot;<br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adrean@...\">adrean@...</a>?Subject=%20Re%3A%20video%20games&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adrean@...\">adrean@...</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://profiles.yahoo.com/fuzzyellowduck\">http://profiles.yahoo.com/fuzzyellowduck</a>&gt; fuzzyellowduck <br/>\n<br/>\nSat Nov 3, 2007 6:32 pm (PST) <br/>\n<br/>\nRight, but my boys are 8 and 4 years old (twins). At that time they were <br/>\nabout 6 and 2 years old. It is very difficult to reason with two very <br/>\nyoung children.&gt;&gt;&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nLH:  Well that&#39;s where I suggest you need to shift your attitude about young<br/>\nchildren.  I have found that they have much better reason than most adults<br/>\nbecause their understanding of the world does not yet come from fear.  Their<br/>\ncreative ideas are not limited by years of *experience* which box us in.  If<br/>\nyou really listen to young children or watch an infant or prespeaking<br/>\ntoddler their reaction to the world is totally based on true reason of the<br/>\nreal moment.   At least that is my experience of always unschooled children<br/>\n- or children that have been totally respected.  They are not, do not learn,<br/>\nmanipulation.  They learn to honestly express themselves and have very<br/>\nintuitive astute responses to every situation of the moment.  Sounds like<br/>\nyou need to learn to listen better and appreciate your children&#39;s<br/>\nintelligence.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Another thing I find hard to accept about video games is the culture of <br/>\nviolence. It does not sit right to tell kids not to hit each other and <br/>\nto be cooperative when you&#39;re playing Kill Stuff In A Good Story IV? <br/>\nIsn&#39;t that a contradiction?&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nLH:  The violence in video games bothers me as well.  And your right - by<br/>\ntelling kids not to hit each other or be cooperative will not be the reason<br/>\nthey learn how to &quot;cooperate in a socially acceptable manner.&quot;  They will<br/>\nlearn what behaviour mommy accepts and expects and that by following mommy&#39;s<br/>\nrules they will get some of what they want and only an illusion of what they<br/>\nneed - love and respect.  I think it&#39;s ok to share what makes you<br/>\nuncomfortable but you cannot expect them to be uncomfortable with the same<br/>\nthings.  What they may learn from your expression of your discomfort is that<br/>\nit&#39;s ok to express their discomfort.  When I am uncomfortable with behaviour<br/>\nof folks I am with I will express it and ask for ideas what to do about it.<br/>\nI&#39;ve come to learn that what makes me uncomfortable is not what is making<br/>\nothers uncomfortable and as such it is I who needs to change my behaviour or<br/>\nattitude.  My kids love the physical rough housing with their father.  It<br/>\nmakes me uncomfortable because I fear someone getting hurt (it happens).<br/>\nThey don&#39;t fear it even when it does happen.  I have learned to leave the<br/>\nroom because at those times I am the only one uncomfortable.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Mind I&#39;m not totally against games. I enjoy them and I have learned a <br/>\nlot from some of them. The DS has some good games that I *might* <br/>\nconsider. Anything in life can be either good or bad, it is just how <br/>\nyou use it.  I just feel that its my role as a parent to be there and <br/>\nhelp consider good choices. &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nLH:  As unschooling parents we learn that what we consider good or bad may<br/>\nnot be true for others.  As unschooling parents we learn to trust our<br/>\nchildren and respect their choices even if they are not the ones we would<br/>\nmake.  Because ultimately they will make different choices than we do and<br/>\nultimately I don&#39;t want my kids to have to hide, run away, or lie to have<br/>\nthe freedom to make their own choices.  And I want them to always be able to<br/>\nmake their own choices.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;As we have limits on ourselves, so do they.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nLH:  There are organic limits, organic structure that occurs through all<br/>\nchoices.  We have choices we make.  So do they.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Someone mentioned is it right to give up something because it causes <br/>\ngrumpiness? If it made someone grumpy for my to pick my nose in front of <br/>\nthem, yes I would need to give that up to fit in with manners. It&#39;s <br/>\nabout compromising. &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nLH:  Personally, I have always hated the word compromise.  It implies that<br/>\nsomeone or everyone in the resolution has to give up or compromise<br/>\nsomething, a part of, their desires, goals, ideas, choices.  It&#39;s been<br/>\nargued that it&#39;s all a matter of semantics - but I don&#39;t agree.  I think its<br/>\nan important shift in navigating differences and coming to solutions to give<br/>\nup on the idea of compromise and instead reach for solutions that work for<br/>\neveryone.  I know that exists and works.  I know that if everyone is honored<br/>\nin their needs and in an environment which fosters safe communication then<br/>\nsolutions will happen where everyone is getting their needs met and no one<br/>\ncompromises themselves.  If you have not really done this before, then it<br/>\nwill take time to learn to renavigate forms on communication in your home.  <br/>\n<br/>\n <br/>\n<br/>\nFor instance, using your example, you may be picking your nose because it is<br/>\nstuffed and needs to be cleared.  If it makes someone else uncomfortable (I<br/>\nassuming that&#39;s what you meant by grumpy) and they express their discomfort<br/>\nyou have a choice.   You can leave the room and clean your nose or you can<br/>\nstay.  Recognize that its not about *manners* as much as you having the<br/>\nability to make some one else more comfortable by leaving the room to clean<br/>\nyour nose and do so because you can and because you are being respectful to<br/>\nthe others sensibility.    By shifting your perception of the situation you<br/>\nare compromising nothing.  In fact, you are honoring both yourself and the<br/>\nother.  BTW - another solution may simply be to get a tissue &lt;G&gt;.  It is<br/>\nperfectly acceptable to &quot;blow one&#39;s nose&quot; publically.<br/>\n<br/>\n <br/>\n<br/>\nA better example might be:  When my dd was about 4 and I wanted to go to the<br/>\npool for a swim and she didn&#39;t want to leave the house - the solution was to<br/>\ntake a bath together at home.  What I recognized was that I just wanted to<br/>\nbe in water and she wanted to be at home.  There was no sense of compromise<br/>\nbecause we both got our needs met.  If it was about the exercise I was<br/>\nlooking for I could have taken out my jumper and jumped at home.  But it was<br/>\nabout being in water.<br/>\n<br/>\n <br/>\n<br/>\nLisa Heyman<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":20039,"nextTopicId":27539}}