{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Punished by Rewards","postDate":"1146067133","msgId":12486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUybzVidCtmMWJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGUybzFiNSsyZm1tQGVHcm91cHMuY29tPg=="},"prevInTopic":12484,"nextInTopic":0,"prevInTime":12485,"nextInTime":12487,"topicId":12484,"numMessagesInTopic":0,"msgSnippet":"I loved that book -- really resonated with me on a few levels.  And it helped me understand the rapid decrease in my son s reading (not level, but amount.)  He","messageBody":"<div id=\"ygrps-yiv-1960291504\">I loved that book -- really resonated with me on a few levels.  And it <br/>\nhelped me understand the rapid decrease in my son&#39;s reading (not level, <br/>\nbut amount.)  He used to love to read -- but two things happened: <br/>\nreading requirements and reading incentive programs.  Both of those <br/>\nkilled his love of reading, or at least made it seriously sick.  Now, I <br/>\ntry to help him find books he will enjoy (he has somewhat specific <br/>\nreading tastes -- and how many books involving codes and such are <br/>\nthere?  But Digital Fortress let me know that he can still get <br/>\nengrossed in a book, that his reading level hasn&#39;t suffered, and that <br/>\nif we find the right book, he loves to read.)<br/>\n<br/>\nI have recommended this book to many people in all three states I&#39;ve <br/>\nhomeschooled in.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Punished by Rewards","postDate":"1146063013","msgId":12484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUybzFiNSsyZm1tQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":12486,"prevInTime":12483,"nextInTime":12485,"topicId":12484,"numMessagesInTopic":0,"msgSnippet":"...by Alfie Kohn is being discussed over at the Always Unschooled list. Since I ve been thinking a lot about punishment and how it is detrimental to","messageBody":"<div id=\"ygrps-yiv-586849948\">...by Alfie Kohn is being discussed over at the Always Unschooled<br/>\nlist.    <br/>\nSince I&#39;ve been thinking a lot about punishment and how it is<br/>\ndetrimental to unschooling, I decided to swipe this wonderful critique<br/>\nand share it with you all.<br/>\n<br/>\nJust as punishment is harmful, so can the wrong kind of praise/rewards<br/>\nbe harmful. The following was written by Cathy over at AU:<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\nI&#39;ll go first...<br/>\n<br/>\nThis is the first book that I wrote in and made little notes in the<br/>\nmargins since I got my masters.  I really love the way Kohn writes,<br/>\nhe makes this kind of confronting information so accessible, he<br/>\ncomforts you through the paradigm shift if you let him, kwim?<br/>\n<br/>\nAnyway, here are a few of the things that I really liked, which I<br/>\nactually wrote on a peice of card stock so I could put them on my<br/>\nfridge (since that, and not sharing, was the intent I didn&#39;t write<br/>\ndown the page numbers -- sorry!).<br/>\n<br/>\n&quot;Children are more likely to grow into caring people if they<br/>\nthemselves are cared about.&quot;<br/>\n<br/>\n&quot;If children feel safe, they can take risks, ask questions, make<br/>\nmistakes, learnt trust, share their feelings, and grow.&quot;<br/>\n<br/>\n&quot;If they are taken seriously they can respect others.&quot;<br/>\n<br/>\n&quot;If their emotional needs are met, they have the luxury of being<br/>\nable to meet other people&#39;s needs.&quot;<br/>\n<br/>\nAnd then his little list of things to think about when using praise:<br/>\n<br/>\n1) &quot;Don&#39;t praise people, only what people do.&quot;<br/>\n2) &quot;Make praise as specific as possible.&quot;<br/>\n3) &quot;Avoid phony praise.&quot;<br/>\n4) &quot;Avoid praise that sets up a competition.&quot;<br/>\n<br/>\nHe refers to praise at one point as something that becomes like a<br/>\nnervous tick, the automatic &quot;good job&quot; (I think he talks about this<br/>\nin both PBR and UC) -- this really struck home for me when I first<br/>\nread UC about 9 months ago, and PBR just drove home the point even<br/>\nmore.  I find, for myself, that I have to be REALLY MINDFUL when I<br/>\nstart to praise my children, I have had to strive to break the<br/>\npraise habit so to speak.  At first, I really wanted to disregard<br/>\nwhat he was saying, because &#39;how could praise be bad&#39;?  And of<br/>\ncourse he clarifies this point, it isn&#39;t praise in and of itselfthat<br/>\nis bad, it is how praise is used -- this is where the mindfulness<br/>\ncomes in, I have become conscious of not only what I praise and how<br/>\nI phrase it, but also of why I am praising.<br/>\n<br/>\nSometimes I find myself backpedalling on praise, something I never<br/>\nwould have done before, because as the words come out of my mouth I<br/>\nrealize that I am not just acknowledging, for example, that<br/>\nthey &quot;took the laundry out the laundry machine and brought the<br/>\nbasket upstairs all by themselves for the first time&quot; -- there is a<br/>\nhidden agenda in the praise.  So, then I go back over the words, try<br/>\nto rephrase to say something else to remove the agenda.  I might<br/>\nfollow that other statement with something like &quot;thanks for doing<br/>\nthat today&quot; because I want to thank them for being helpful but I<br/>\nreally want to remove that hidden agenda of maybe they will do it<br/>\nagain, so that is why I add the today, trying to let them know that<br/>\nit is perfectly okay if it never happens again.  I am sure that<br/>\nthere are better ways to do this, but I find that, as with all<br/>\nthings RU, I just have to keep working on it, being and becoming<br/>\nmore conscious of how my words are heard.<br/>\n<br/>\nBTW, I really credit Kohn for generating my paradigm shift<br/>\nfrom &quot;pop&quot; parenting as he calls it to unschooling.  Unconditional<br/>\nParenting, his latest book, brought all that I had read about<br/>\nunschooling into perspective -- it gave me not just an idea that it<br/>\nmight be the way to go, but some good concrete evidence in the form<br/>\nof studies and documentation that pushed me through that rough spot<br/>\n(you know, the one where you think that maybe you can pick and<br/>\nchoose instead of fully embracing) and got me to really give up on<br/>\nthe &quot;pop&quot; parenting and take on radical unschooling.</div>","specialLinks":[]}],"prevTopicId":12482,"nextTopicId":12479}}