{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Funshop Help","postDate":"1153851983","msgId":16000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhNW5vZitxMGhlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA3MjUxMTAxaDE1NzdhYzE0azQwODZkOTJjMDU4NTAyODNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":15997,"nextInTopic":0,"prevInTime":15999,"nextInTime":16001,"topicId":15997,"numMessagesInTopic":0,"msgSnippet":"Playdough - the recipe with the cream of tartar and unsweetened kool aid was really great; nice texture, smells good, cool colors, didn t bleed color the way","messageBody":"<div id=\"ygrps-yiv-912499653\">Playdough - the recipe with the cream of tartar and unsweetened kool <br/>\naid was really great; nice texture, smells good, cool colors, <br/>\ndidn&#39;t &quot;bleed&quot; color the way food coloring tends to<br/>\n<br/>\nFound materials - for example, marshmallows and toothpicks, <br/>\ncardboard tubes and yarn and glue; just have folks save up misc bits <br/>\n(cardboard tubes; bits of foil - you know how that last bit of foil <br/>\nin the package is *always* too small for whatever you want to wrap <br/>\nLOL; oddments of yarn; craft sticks; markers, crayons, glue, <br/>\nglitter, tuna cans (melt crayons and pour into tuna cans to make <br/>\nreally wild multi color fat crayons), fabric scraps, etc.) - can do <br/>\nbuilding, can do puppetry (maybe even produce a puppet show if drama <br/>\nwas popular), can make all sorts of crafts. Not totally a found <br/>\nthing but if someone can pick up photosensitive paper (at a craft <br/>\nstore), you can go out and find leaves and rocks and flowers and <br/>\nsuch and make &quot;sun prints&quot;<br/>\n<br/>\nIf you&#39;ve got a kitchenette available, food is always good: soft <br/>\npretzels are fun and easy, for example. DS was in a &quot;co-op&quot; activity <br/>\na year or so ago that was &quot;cooking science&quot; where they explored how <br/>\nyeast works and sugar crystals and whipped cream (which of course <br/>\nonce they made whipped cream they HAD TO have ice cream sundaes <br/>\nlol), could also make butter to go with some fresh bread (depending <br/>\non the time you&#39;ve got available). And so on. It was pretty cool <br/>\nstuff and Tasty!<br/>\n<br/>\nDH coordinated a chess club during that co-op time. No one was <br/>\nrequired to play or anything (as if he would do that lol) but he <br/>\nexplained stuff for beginners, had chess puzzles (like from the <br/>\nnewspaper) available for more advanced kids, and for the last <br/>\nmeeting day he challenged the whole bunch - they could team up even <br/>\n(2 or 3 kids per board) if they wanted to and he played several <br/>\nsimultaneous games at once - the kids thought that was fun and it <br/>\ngave each group of kids a little time to consider moves as he moved <br/>\nfrom board to board. So, maybe an open board game time would be fun -<br/>\n I&#39;m sure there are kids there who are tired of playing the same <br/>\ngames with their younger siblings over and over and would relish a <br/>\nbit more of a challenge (or vice versa the little ones might like <br/>\nplaying with someone on their own skill level). <br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Funshop Help","postDate":"1153850495","msgId":15997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA3MjUxMTAxaDE1NzdhYzE0azQwODZkOTJjMDU4NTAyODNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":16000,"prevInTime":15996,"nextInTime":15998,"topicId":15997,"numMessagesInTopic":0,"msgSnippet":"Hey everyone!  I need a little feedback from those of you that have been to unschooling conferences and workshops and those that are just so darn creative.  We","messageBody":"<div id=\"ygrps-yiv-1780214420\">Hey everyone!  I need a little feedback from those of you that have<br/>\nbeen to unschooling conferences and workshops and those that are just<br/>\nso darn creative.  We have a small &quot;funschool&quot; here in Pensacola that<br/>\nwe did started last year.  We ended up with two classes that made it<br/>\nfor the whole year and that was dulcimer and drama.  We had a<br/>\n&quot;gathering of minds&quot; to come up with ideas for next year and was<br/>\ndisheartened with a lot of the ideas that were being brought up.  They<br/>\nwere very, well, schooly.  When I talked to the kids about what was<br/>\nsuggested they all rolled their eyes and expressed disinterest.  This<br/>\nwas FUN last year and it looks very schoolish this year.<br/>\nUnfortunately, we have lost quite a few of our unschooling families<br/>\nbecause they dared to MOVE AWAY or the just DON&#39;T COME anymore (you<br/>\nknow who you are! LOL!)  Anyway, three of the parents that came to the<br/>\nfunschool planning meeting are more traditional homeschoolers.  One<br/>\neven has a child in a church run &quot;co-op&quot; which is nothing more than a<br/>\nlow cost private school.  So the ideas being bantered around were very<br/>\nschoolish-looking.  So I talked with Rose (hi Rose) and I told her I<br/>\nwould post here for some ideas about FUNSHOPS.  So, what funshops have<br/>\nyou or your kids done at conferences and other unschool get togethers<br/>\nthat we might be able to copy, borrow or steal?<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]}],"prevTopicId":15996,"nextTopicId":15979}}