{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"team commitments","postDate":"1150500239","msgId":14682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2dmVpZitsNTNuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14681,"nextInTime":14683,"topicId":14682,"numMessagesInTopic":0,"msgSnippet":"So it s a big lie to tell a child their Little League team will suffer if they quit. YES!! I think it s really, really important for kids to dip their toe in","messageBody":"<div id=\"ygrps-yiv-2039077004\">&quot;So it&#39;s a big lie to tell a child their Little League team will<br/>\nsuffer if they quit.&quot;<br/>\n<br/>\nYES!! I think it&#39;s really, really important for kids to dip their toe<br/>\nin the pool of many activities as part of their learning experience. I<br/>\npurposely sign my kids up for LOW stress, LOW commitment versions of<br/>\nthings they want to try on purpose!! If they want to continue and get<br/>\nmore serious, we can up the ante slowly.<br/>\n<br/>\nNobody has really pointed that out yet. WHY go with Little League as<br/>\ntheir first experience? Why not try YMCA or some other LOW commitment<br/>\nteam sport? There are LOADS of choices.<br/>\nIn fact, Trevor&#39;s first experience with baseball was a group of<br/>\nhomeschoolers getting together to form a very cooperative team so the<br/>\nkids could learn the sport without all the stress.<br/>\n<br/>\nThere were girls and boys, kids of all colors and even some with<br/>\ndisabilities. It was a very supportive coach-pitch team and the whole<br/>\npoint was having fun, learning baseball and making friends. No<br/>\npressure. The kids cheered for everyone, no matter how good or awful<br/>\nthey played. <br/>\nGreat experience.<br/>\n<br/>\nThen, we signed up for city league. Got a REALLY lameass coach and<br/>\ninstead of letting him quit at the first sign of unhappiness, we did<br/>\nthat whole &quot;your team is counting on you CRAP&quot;.<br/>\n<br/>\nYou know what? That team would not have done better or worse whether<br/>\nmy son was there or not. But all these years later, he still doesn&#39;t<br/>\nwant to play baseball ever again.<br/>\nMy child will ALWAYS come before some damn team.<br/>\n<br/>\nAs they learn what they like, as they learn I&#39;m their advocate and<br/>\nally, as they learn and grow and develop responsibility they will<br/>\nlearn about when to quit and when it&#39;s better to stick it<br/>\nout...without their parents getting credit for making them do it. They<br/>\nlearn how to listen to their OWN voice. That makes for much more<br/>\nself-driven people than those that are pushed or forced.<br/>\n<br/>\nThere is the flip-side too. Parents that aren&#39;t being advocates, but<br/>\nsimply absent. Parents that DON&#39;T explain to a child how their actions<br/>\naffect others...ever. Parents that aren&#39;t helping a child navigate and<br/>\nconsider all the different angles of an issue. That isn&#39;t what we&#39;re<br/>\nadvocating here. But we ARE advocating for trusting the child and<br/>\nlistening to them! Our ideals are not more important than their own<br/>\ncomfort level. <br/>\n<br/>\nI know that if my child needs to get away from an activity, they need<br/>\nme to listen and trust their choice. <br/>\nI was forced to continue piano lessons against my will for quite a<br/>\nwhile. If I&#39;d been allowed to quit when *I* wanted to, I&#39;d have picked<br/>\nit up again. I wanted more lessons in high school and my parents<br/>\nattitude was &quot;well you decided to quit, tough luck now&quot; <br/>\nStupid.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":14653,"nextTopicId":14686}}