{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":274933479,"authorName":"sharon currie","from":"sharon currie &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Other people&#39;s property","postDate":"1192016854","msgId":26980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMDMyMi43MjQ2MC5xbUB3ZWIyNzMxMC5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":26958,"nextInTopic":0,"prevInTime":26979,"nextInTime":26981,"topicId":26939,"numMessagesInTopic":0,"msgSnippet":"Hi Kendrah, I m in the same situation. Two of my son s school going friends seems so intend to try to break some of his toys when they are in our house, many","messageBody":"<div id=\"ygrps-yiv-1545736490\">Hi Kendrah,<br/>\n   <br/>\n  I&#39;m in the same situation. Two of my son&#39;s &quot;school going&quot; friends seems so intend to try to break some of his toys when they are in our house, many times. They try to pretend that they are playing with it but they are actually handling it very very roughly and aggresively, so much so that it is obvious that their intention was to break it. And I think I know why; I think it&#39;s because my son is so oblivious to thier boasting and competitive streak (my son is an aspie, and is always just happy to see them, oblivious to whatever &quot;super duper toys&quot; they seem to be boasting to be the proud owner of! ) . This I believe can spark off some &quot;anger of being ignore&quot; because my son wouldn&#39;t (couldn&#39;t would be the correct word) acknowledge thier superiority in having a better &quot;super duper &quot; toy and &quot;envy&quot; because my son too, do have equally super duper toys that they don&#39;t have. <br/>\n   <br/>\n  I can&#39;t speak to the parents because it&#39;s a very sensitive matter, as both these children do have very caring (but controlling) parents. Again, it only happens when the parents are not around, this viciousness/&quot; the need to do naughty things &quot; springs up.  So I usually put away favourite and expensive toys awayand allow my son the chance to take control of this situation whereby he only have to share if he&#39;s happy to share his toys. That he can still have his friend ove to play and yet still able to protect the favourite ones from being attacked! He can now show his friend his selected favourite toys, but telling the friend &quot;they are not for sharing&quot; because &quot;it&#39;s very precious&quot; and &quot;you always hit my toys very hard!&quot;  This has resolve the issue because the children very soon realised that they can only see this &quot;precious forbidden toys&quot; but not allowed to play with it, due to thier previous demonstrated aggresive attitude towards my son&#39;s toy. They very soon realised<br/>\n thier mistake and asked my son&#39;s permission if they could &quot;play with it gently&quot;. And very soon, they were treating the toys vey nicely, because they know if they cross the boundary again, my son will never trust them again to let them near many more toys! <br/>\n   <br/>\n  The reason I say &quot;precious&quot; is because when you isolate any toys, and place a &quot;see no touch&quot; status to it, you elevate it into a &quot;forbidden fruit&quot; status, which makes it even more enticing to a child. All the rest of the toys that&#39;s on the floor by now is of no relevance! What they want is that &quot;precious toy&quot; that they can&#39;t have!  This is where I felt it is easier to &quot;drive&quot; the message across to any child, if you abuse the hospitality, you will NOT be accorded full hospitality too! But if you show respect, then full respect and trust will be accorded to you as a very special guest, so special, that you were trusted enough to be given DS&#39;s most &quot;precious toy&quot; to play with! And they always put the toy back where they found it in the first place, because &quot;it&#39;s DS precious toy&quot;  and it&#39;s not to be left lying around, just incase it get broken. <br/>\n   <br/>\n  Perhaps, you could think about elevating or putting away or bringing indoor some of the favourite toys, if not most of the toys.  This way, if they want any toys, they&#39;ll have no choice but to come knock and asked for it. Then you can state down your TERMS!!! <br/>\n   <br/>\n  It just seems like these children are helping themselves BIG TIME to your son&#39;s toys, because you may have &quot;un-intentionally&quot; given them this idea that they are free to help themslevs to the toys, and that you&#39;re ok for them to &quot;play&quot; with it (your definetion of play could be very different to their &quot;defination&quot; of play!) . While you are happy to share with them, then they must be help to understand that you&#39;re not very happy that they didn&#39;t put the toys back where they found them (hence it arrived at thier home!) and that they are breaking your toys, hence breaking your heart because now your son could no longer play with that toy. And to help them understand that they have abused the hospitality that you&#39;ve kindly accorded to them, make them aware of what they are doing, that&#39;s hurting your  or son&#39;s feelings. If they can&#39;t RESPECT your feelings, then you do not have to accord such kind hopitality again, and this means they are not allowed into your garage again ,<br/>\n which means a visit to the parents to indicate this final  wish of yours!  <br/>\n   <br/>\n  Just my personal opinion, Hope it helps. <br/>\n   <br/>\n  Sharon<br/>\n     <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\n Yahoo! Answers - Get better answers from someone who knows. Tryit now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137096857,"authorName":"Ruby Cooper","from":"&quot;Ruby Cooper&quot; &lt;riharper@...&gt;","profile":"riharpercooper","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Other people&#39;s property","postDate":"1191943684","msgId":26958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlZzZtNCs0czU0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlZjU1dCtwNXRnQGVHcm91cHMuY29tPg=="},"prevInTopic":26942,"nextInTopic":26980,"prevInTime":26957,"nextInTime":26959,"topicId":26939,"numMessagesInTopic":0,"msgSnippet":"We have had similar issues ourselves.  One thing I think is important is to get your children s take on the situation.  If they aren t complaining to the","messageBody":"<div id=\"ygrps-yiv-800175852\">We have had similar issues ourselves.  One thing I think is important is<br/>\nto get your children&#39;s take on the situation.  If they aren&#39;t<br/>\ncomplaining to the extent of your own feelings, maybe some things can<br/>\njust be overlooked.  That being said, if they feel the same way or more<br/>\nso, and feel taken advantage of or intruded upon, it will probably give<br/>\nyou better insight into how to handle the situation.  For instance if<br/>\nthey want to preserve the relationships at all costs, maybe you won&#39;t be<br/>\nso direct.  However if they are upset themselves, you can feel much<br/>\nbetter about setting down guidelines with no fear of the consequences to<br/>\ntheir relationship to the other children.<br/>\n<br/>\nIf the neighbors don&#39;t respect the boundary of your home--open garage or<br/>\nnot, maybe you should change having the garage open.  Again, if it&#39;s<br/>\nimpt to the kids they won&#39;t mind the &quot;hassle&quot; of opening and shutting<br/>\nthe door and putting the toys away.<br/>\n<br/>\nWe had to start locking the our back door so our next door neighbor kids<br/>\ndidn&#39;t just walk in.  When the kids came over I had to tell them that it<br/>\nwasn&#39;t a good time.  When they rode on my daughter&#39;s new ride on toy<br/>\n(under the carport) and not having asked permission,  I started putting<br/>\na tarp over it.  Signals to set some boundaries.  Then I talked to the<br/>\nMom about my kids feeling like their space was invaded.  Our situation<br/>\nis a bit different as we travel and these neighbors were taking care of<br/>\nour animals while we were gone--paid well for their services not a<br/>\nfavor.  However the kids came to view our house as their playhouse and<br/>\nour cabinets as their cabinets, our food their food.  So we put space<br/>\nand distance between us and it has seemed to help.<br/>\n<br/>\nAll that to say, that I had to take my kids feeling into the situation,<br/>\nthey felt more strongly about it than I did.  Knowing how they felt<br/>\nallowed me to make a decision beyond my own feelings that helped my<br/>\nchildren to feel more secure in their own home.  It did seem to have a<br/>\nlittle chill in the relationship for a couple of weeks, but my kids were<br/>\nhappy and secure so it&#39;s worth it to me.  And our relationship with the<br/>\nneighbors is at a more healthy level again.<br/>\n<br/>\nRuby-Mom to Luke 10, Kate 6</div>","specialLinks":[]},{"userId":295439124,"authorName":"wisdomalways5","from":"&quot;wisdomalways5&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Other people&#39;s property","postDate":"1191909373","msgId":26942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlZjU1dCtwNXRnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4RDg4RDgzLTY4NkMtNDgxOS04NDAyLTU0MDMyOUQ2QzM0MUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":26958,"prevInTime":26941,"nextInTime":26943,"topicId":26939,"numMessagesInTopic":0,"msgSnippet":"Have a party and discuss what the boundaries are for having the privledge of being in your yard and home and if they can not abide by them then they can not","messageBody":"<div id=\"ygrps-yiv-39261229\">Have a &quot;party&quot; and discuss what the boundaries are for having the <br/>\nprivledge of being in your yard and home and if they can not abide <br/>\nby them then they can not play<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kendrah Nilsestuen <br/>\n&lt;carebear-79@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; A couple months ago I posted to this list about having to <br/>\n </span></blockquote>entertain  <br/>\n<blockquote><span title=\"ireply\"> &gt; other children. At the time it seemed no matter where I went with <br/>\n </span></blockquote>my  <br/>\n<blockquote><span title=\"ireply\"> &gt; kiddos I was having to entertain several other kids as well, <br/>\n </span></blockquote>because  <br/>\n<blockquote><span title=\"ireply\"> &gt; (at least it seemed) their parents didn&#39;t want to. This would <br/>\n </span></blockquote>happen  <br/>\n<blockquote><span title=\"ireply\"> &gt; not only when we went out to the park but also in our front yard <br/>\n </span></blockquote>with  <br/>\n<blockquote><span title=\"ireply\"> &gt; the neighborhood kids. Thanks to Karen (hi Karen!) and her <br/>\n </span></blockquote>abundance  <br/>\n<blockquote><span title=\"ireply\"> &gt; of love post I feel I&#39;ve really comes to terms with the irritation <br/>\n </span></blockquote>is  <br/>\n<blockquote><span title=\"ireply\"> &gt; was causing me, and opened my heart to find that there was an  <br/>\n&gt; abundance of love! Somedays I have an abundance of love, but not <br/>\n </span></blockquote>an  <br/>\n<blockquote><span title=\"ireply\"> &gt; abundance of energy and will simply tell the neighborhood kids <br/>\n </span></blockquote>that  <br/>\n<blockquote><span title=\"ireply\"> &gt; we need some family time. It has worked well. Tonight I found <br/>\n </span></blockquote>myself  <br/>\n<blockquote><span title=\"ireply\"> &gt; a bit frustrated with some of the neighborhood kids and wanted <br/>\n </span></blockquote>some  <br/>\n<blockquote><span title=\"ireply\"> &gt; perspective.<br/>\n&gt; <br/>\n&gt; Last night dh was taking ds for a walk. He walked passed a yard <br/>\n </span></blockquote>of  <br/>\n<blockquote><span title=\"ireply\"> &gt; one of our neighbors and found one of our mini tool kits in their  <br/>\n&gt; yard. We know it was ours for sure because dh&#39;s initials are on <br/>\n </span></blockquote>it.  <br/>\n<blockquote><span title=\"ireply\"> &gt; We have this in a cabinet in our garage, so for someone to get it  <br/>\n&gt; they would of had to come in and take it. Then tonight around 7pm <br/>\n </span></blockquote>I  <br/>\n<blockquote><span title=\"ireply\"> &gt; opened the door to find two of the neighborhood boys (one of <br/>\n </span></blockquote>which  <br/>\n<blockquote><span title=\"ireply\"> &gt; lives where we found the tool kit) playing with some of the toys <br/>\n </span></blockquote>from  <br/>\n<blockquote><span title=\"ireply\"> &gt; our garage, and a few that were left in the front yard. One of <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; toys was a plastic lawnmower that my son loves. It was broken. I  <br/>\n&gt; asked them as nicely as I could (admittedly I was pretty <br/>\n </span></blockquote>irritated)  <br/>\n<blockquote><span title=\"ireply\"> &gt; if they knew how it got broke they both said in unison &quot;I didn&#39;t <br/>\n </span></blockquote>do  <br/>\n<blockquote><span title=\"ireply\"> &gt; it, it was him.&quot; Each one pointing at the other. Then they ran <br/>\n </span></blockquote>home.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; These are two of the boys that I have spent many hours <br/>\n </span></blockquote>entertaining  <br/>\n<blockquote><span title=\"ireply\"> &gt; and letting play with us in our yard. Now they&#39;ve come into our <br/>\n </span></blockquote>yard  <br/>\n<blockquote><span title=\"ireply\"> &gt; and played with my kiddos toys without asking (Dh has told them <br/>\n </span></blockquote>that  <br/>\n<blockquote><span title=\"ireply\"> &gt; he doesn&#39;t mind if they play in our yard or garage when we are <br/>\n </span></blockquote>there,  <br/>\n<blockquote><span title=\"ireply\"> &gt; but to to please come and ask if they can use them if we are <br/>\n </span></blockquote>not).  <br/>\n<blockquote><span title=\"ireply\"> &gt; Then they broke one of them. It is easily replaceable. I can go <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; Toys R Us and get a new one tomorrow for $10. It is the principle  <br/>\n&gt; though.<br/>\n&gt; <br/>\n&gt; Am I wrong for being so irritated about this? It just feels so  <br/>\n&gt; disrespectful. My mom says I should go to each set of parents and <br/>\n </span></blockquote>rat  <br/>\n<blockquote><span title=\"ireply\"> &gt; the kids out, requesting $5 from each child since no one will fess <br/>\n </span></blockquote>up  <br/>\n<blockquote><span title=\"ireply\"> &gt; to actually doing it. With one child I know if I tell his parents <br/>\n </span></blockquote>he  <br/>\n<blockquote><span title=\"ireply\"> &gt; will get spanked for it. The other boys parents seem so <br/>\n </span></blockquote>disconnected  <br/>\n<blockquote><span title=\"ireply\"> &gt; from their son I&#39;m not sure what they will do. So that isn&#39;t the  <br/>\n&gt; route I want to take.<br/>\n&gt; <br/>\n&gt; My kiddos are in and out so much during the day that I don&#39;t <br/>\n </span></blockquote>usually  <br/>\n<blockquote><span title=\"ireply\"> &gt; put the garage door down or put the toys away each time we come <br/>\n </span></blockquote>back  <br/>\n<blockquote><span title=\"ireply\"> &gt; inside, but maybe I will start having to. I&#39;m not sure what else <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"qreply\"> &gt; do from here. I feel like my abundance of love is getting taken  <br/>\n&gt; advantage of.<br/>\n&gt; <br/>\n&gt; Any thoughts or suggestions?<br/>\n&gt; <br/>\n&gt; Kendrah:)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":26920,"nextTopicId":26797}}