{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: Competitive sports","postDate":"1137217872","msgId":9026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTQyMDA2MDU1MS4xNDQ3MS40M0M4OTE1MDAwMEQ2NDdEMDAwMDM4ODcyMjA1ODg0NDg0MDIwRTAzMDUwQzA3MDgwMDAzQGNvbWNhc3QubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":9025,"nextInTime":9027,"topicId":9026,"numMessagesInTopic":0,"msgSnippet":"Hi, Where we live many businesses have  embraced the homeschooling community and offer homeschool classes, pretty much set up by the people interested. Right","messageBody":"<div id=\"ygrps-yiv-1053951042\">Hi,<br/>\n<br/>\nWhere we live many businesses have  embraced the homeschooling community and offer homeschool classes, pretty much set up by the people interested. Right now there is a  homeschool and adult ballet class, homeschool clay class at an Art Center. Both gyms in town have a homeschool class, totalling 3 different times kids could go to gym a week, be with mixed genders/ages and play gymnastics. It is structured, in a way that makes it safe. A mom asked a college kid she knew if he would run a track program. He is getting income and is a great coach, the kids love him and they get to run on the big track at the University. All skills, no competition. Possibilities are endless.<br/>\n<br/>\nI would suggest you find a place you like and see if they can meet your need for a class, non competitive, skills focused. The private workout gyms also cater a few programs that specialize skills and drills, not games and winning. One has indoor soccer skills during the wetter months.<br/>\n<br/>\nThat being said, my son is a competitive swimmer. I started him out in out noncompetitive program and he walked the path to the competitive one. I never imagined I would be driving all over Northern California, seeing each city&#39;s pool facilities. And I know I will be involved in this for a LONG time. It is his passion<br/>\n<br/>\nI would be careful to say we don&#39;t like competitive sports, because one of your children might. One thing I love about my son&#39;s swim coach is he takes each child and helps them reach their potential where ever they are at. He stresses individual improvement over winning and comments about things well done in a race, even if you had a slower time than before. He is often heard talking about the old meaning of competition, that which people come together to help each reach their best in that moment. <br/>\n<br/>\nOur society has warped competition into to win you must crush the other, but imagine 2 boys racing in a pool, each pulling the other along. 1 touches the wall first, thus wins, but both get their best personal time ever and number 2 breaks a team record. He is not a loser by any means. He gets out of the pool, smiling and out of breathe and embraces number 1 for helping him get his own personal best. Competition can be very positive too.<br/>\n<br/>\nI do know what you are talking about, though. Seek out any soccer program run by AYSO. They stress playtime over competition and every player plays. Be an assistant coach to help smooth over the really exhuberant parents. Be involved, and most of all watch your child&#39;s cues to see if they like it or not, which sounds like what you have already been doing.<br/>\n<br/>\nMary</div>","specialLinks":[]}],"prevTopicId":9022,"nextTopicId":9028}}