{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: still deschooling","postDate":"1242135330","msgId":40036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1YnR2MisybmZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg=="},"prevInTopic":40035,"nextInTopic":0,"prevInTime":40035,"nextInTime":40037,"topicId":40025,"numMessagesInTopic":0,"msgSnippet":"... ******I remember the day I sort of looked up and I thought I realized that deschooling was over.  It was 2 years after he left first grade.  I was right","messageBody":"<div id=\"ygrps-yiv-1046710772\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;kmkjoy&quot; &lt;kellykoschmeder@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now it is mid May and I feel like we are still in the deschooling phase.  <br/>\n<br/>\n </span></blockquote>******I remember the day I sort of looked up and I thought I realized that deschooling was over.  It was 2 years after he left first grade.  I was right and wrong.  I still feel that the deschooling process for him is pretty much over, he lives in the absence of school as if it didn&#39;t exist, however his schooling and traditional parenting for the first years of his life is still painful for him.  I don&#39;t know that he will ever fully heal from any of that, but I can help him be more comfortable. <br/>\n=====================================================================  <br/>\n<br/>\nDS spends most of his indoor time in different room from the rest of us, playing video games or watching TV.  He doesn&#39;t seem to have much interest in doing things with the family, maybe I&#39;m not engaging him enough.  <br/>\n<br/>\n******I&#39;m smiling because recently I posted as my facebook status as sort of a joke &quot;can a playroom be too much fun?&quot;  My 2 older boys some time ago decided to have a &quot;sleeping room&quot; and a &quot;playroom&quot;.  I sometimes wonder if they will ever want to do anything else!  <br/>\n<br/>\nMy oldest is not much interested in hanging with me or the family most of the time.  I can&#39;t say it doesn&#39;t bother me once in awhile, but I do respect his need to stay home and his desire to be independent of us a lot.<br/>\n=====================================================================<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We&#39;ve never had very strict food rules, I put veggies on his plate when I&#39;m making up his lunch, but there is no big deal made of anything.  Lately though he has been eating mostly junk.  <br/>\n<br/>\n </span></blockquote>******Although I know what you mean, it&#39;s not junk.  It&#39;s food.  You&#39;ve gotten some great advice about food at his age, but be careful about associating negative feelings towards the food he loves.  <br/>\n=====================================================================<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He seems much more sensitive now too.  There have been many instances over the last few weeks where he has come to me crying or very upset about something.  He has always been a little bit sensitive, but not like this.<br/>\n<br/>\n </span></blockquote>******My first thought was the children in school are not free to feel or express their feelings.  So while it could be developmental, it could also be a huge release that he has never felt comfortable experiencing. <br/>\n<br/>\n-Heather <br/>\n======================================================================</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] still deschooling","postDate":"1242132149","msgId":40035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNTEyMDU0MnAzNGM5NDQzNGo1ZjA1NDA1MzYzYTI5YWJhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg=="},"prevInTopic":40033,"nextInTopic":40036,"prevInTime":40034,"nextInTime":40036,"topicId":40025,"numMessagesInTopic":0,"msgSnippet":"OP: We are now in our 6th month of deschooling. ds will be 11 in a couple weeks. He was in school through 4th with the exception of a few months a couple of","messageBody":"<div id=\"ygrps-yiv-1024425273\">OP: We are now in our 6th month of deschooling. ds will be 11 in a couple<br/>\nweeks. He was in school through 4th with the exception of a few months a<br/>\ncouple of years ago when we tried &quot;school at home&quot;, that didn&#39;t go well,<br/>\nhence back to school. I have 10 mo old twins here too. ds didn&#39;t go to<br/>\nschool at all this year, at the end of the last school year he asked to stay<br/>\nhome. In September we started an eclectic homeschool style, around<br/>\nThanksgiving we&#39;d had enough and decided to take a break. I&#39;d been reading a<br/>\nlot about unschooling and figured it was time to do what I felt was right<br/>\nand begin the deschooling process. Of couse I&#39;m constantly reading books and<br/>\nblogs, websites and lists to help me with my mind set and open myself up to<br/>\na different way of parenting.<br/>\n<br/>\n***It sounds like you have found some resources to open things up for you.<br/>\nDeschooling is as much for the parents (if not more) as for the children.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nOP: Now it is mid May and I feel like we are still in the deschooling phase.<br/>\nDS spends most of his indoor time in different room from the rest of us,<br/>\nplaying video games or watching TV. He doesn&#39;t seem to have much interest in<br/>\ndoing things with the family, maybe I&#39;m not engaging him enough.<br/>\n<br/>\n***There is no set amount of time to deschool. I find that things come up<br/>\nfor me all the time. My kids have never been to school or schooled at home.<br/>\nI rose out of school over 20 years ago!<br/>\nHe may not be interested. I found that at that age my daughter was trying<br/>\nout her independence more. She has her own life going on and I am a huge<br/>\npart of it but more peripheral. Its like when the babies turn into toddlers,<br/>\nthey slowly start moving farther away. First they toddle away then scamper<br/>\nback to reconnect. At some point they venture out of the room and toddle<br/>\nback, reconnect.<br/>\n<br/>\nI see my oldest find other &quot;rooms&quot; to explore. She tries on everything,<br/>\nclothes, attitudes, mannerisms, music styles, friends, it&#39;s like dress-ups<br/>\nfor tween/teens. Its part of being who they are.<br/>\n<br/>\nIf you feel you may not be engaging him enough than engage him more. Go to<br/>\nhim. Be part of his world, just a little bit. See how he reacts. Step back<br/>\nor forward accordingly. If he was use to being away from you for 8 hours a<br/>\nday it might take a bit of time to get use to this new way of being.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nOP: We&#39;ve never had very strict food rules, I put veggies on his plate when<br/>\nI&#39;m making up his lunch, but there is no big deal made of anything. Lately<br/>\nthough he has been eating mostly junk. We do have more soda in the house<br/>\nthan usual because it was left over from a party, but we usually have some<br/>\nin the house. He is drinking it more than ever before.<br/>\n<br/>\n***Food is still hard for me. I just keep my mouth shut a lot. I give<br/>\ninformation and step back. I have come a long way in seeing food as food. I<br/>\nam mostly fine about not separating food into good and junk foods. I talk in<br/>\nfood that helps us feel our best and food that hurts. This can be tricky.<br/>\nHowever the more I let go of my food issues the healthier our family is. It<br/>\nis my hang up.<br/>\n<br/>\nI think some people just like soda more than others. I don&#39;t like it. My ds<br/>\ndoesn&#39;t like it much, but enjoys it occasionally. My dd12 loves it! She<br/>\nstruggles with moderating herself because she doesn&#39;t like the way she feels<br/>\nafter drinking too much. But in order to learn that about herself she *HAS<br/>\nTO* drink too much. It is hard to watch as a parent. One of my parenting<br/>\ngoals is to allow my children to retain their selves. The other is to have a<br/>\nhealthy relationship bases on mutual respect.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nOP: He seems much more sensitive now too. There have been many instances<br/>\nover the last few weeks where he has come to me crying or very upset about<br/>\nsomething. He has always been a little bit sensitive, but not like this.<br/>\n<br/>\n***I think others have said this is typical of that age. Also keep in mind<br/>\nthat he likely had to hide his sensativities at school.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-==--==<br/>\n<br/>\nOP: I need suggestions. I don&#39;t want to push him. This morning when he was<br/>\nasking about the soda, we talked about how soda tastes good and then about<br/>\nhow our body gets it&#39;s energy from food and that different foods have<br/>\ndifferent things our bodies need. That our bodies like variety so they can<br/>\nget all the nutrition it needs. I left it there, if he wants a soda with<br/>\nlunch, then he will have it.<br/>\n<br/>\n***That sounds right, give information and then let them have space.<br/>\n<br/>\nFaith<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: still deschooling","postDate":"1242130303","msgId":40033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMEMwQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":40031,"nextInTopic":40035,"prevInTime":40032,"nextInTime":40034,"topicId":40025,"numMessagesInTopic":0,"msgSnippet":"I agree - DS is almost 11 and the last 6 months to a year he s been closer to the edge emotionally (tears up more often and more easily, etc) than he had been","messageBody":"<div id=\"ygrps-yiv-1884777043\">I agree - DS is almost 11 and the last 6 months to a year he&#39;s been\r<br/>\ncloser to the edge emotionally (tears up more often and more easily,\r<br/>\netc) than he had been for years. He&#39;s also become more attached, almost\r<br/>\nthe way toddlers want to stay right nearby and not venture off very far.\r<br/>\nThis is a kid who had no signs of &quot;clinginess&quot; as a 3 yr old - he was\r<br/>\nvery keyed in to &#39;safe&#39; spaces and would take off on his own in those\r<br/>\nsituations and hang out with other people (one time, at a potluck at\r<br/>\nchurch, I found him in another room with all the teenage girls, giggling\r<br/>\nand flirting away LOL). For the record, he&#39;s never been schooled (home\r<br/>\nor institution) so my guess is that it&#39;s more a matter of being on the\r<br/>\nbrink of another major leap forward developmentally that&#39;s triggering\r<br/>\nmuch of this. What seems to be helping (YMMV) is to spend more connected\r<br/>\ntime with him - even if it&#39;s simply sitting next to him reading while\r<br/>\nhe&#39;s watching a DVD on his laptop or playing a videogame (If it&#39;s a game\r<br/>\nI can manage to be near without motion sickness - even catching motion\r<br/>\nperipherally makes me uncomfortable with some games). Lots and lots more\r<br/>\nhugs, snuggles, silly inside jokes, spending time together, again almost\r<br/>\nlike when he was much younger. And, for him, lots of physical contact -\r<br/>\nhugs, holding hands in parking lots (at nearly 11, that&#39;s not an\r<br/>\nessential safety thing anymore), tucking in blankets, back rubs, foot\r<br/>\nrubs, etc. Sometimes I&#39;ll reach over the back of the couch to hug him\r<br/>\nand he&#39;ll grab my arms and not let go. I&#39;ll leave it be a hug for a bit\r<br/>\nthen turn it into a playful game of trying to &#39;escape&#39; from him (but not\r<br/>\ntrying too terribly hard) - very much like games we played when he was\r<br/>\nyounger. It seems as if the prospect of moving into this next stage of\r<br/>\nlife is both enticing and scary - eagerly awaiting and yet anxious at\r<br/>\nthe same time. Maybe (haven&#39;t finished my first cuppa yet so this might\r<br/>\nbe off a bit) it&#39;s similar to pre-wedding type jitters - something that\r<br/>\nis both eagerly looked forward to and yet it&#39;s a major life change and\r<br/>\ncan produce anxiety as well. And we all know how emotional (good and\r<br/>\nbad) that pre-wedding time can be. Or, even, given the pre-pubescent\r<br/>\nbeginnings of hormonal changes, it might even be akin to pregnancy -\r<br/>\nanother major life change with added hormones for extra emotion (yum!\r<br/>\nLOL)\r<br/>\n\r<br/>\nWe&#39;re just taking things in stride as always - partnering with him to\r<br/>\nwork through this new stage.\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] still deschooling","postDate":"1242119812","msgId":40031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5ODczQTQ0LUVFOUEtNDE0NS04MjNELTA4QkZBMkM0OTg5OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg=="},"prevInTopic":40030,"nextInTopic":40033,"prevInTime":40030,"nextInTime":40032,"topicId":40025,"numMessagesInTopic":0,"msgSnippet":"... I agree with Melissa and the food is part of puberty too. The soda and the junk food are fatty and he s naturally seeking out high calorie foods. He s","messageBody":"<div id=\"ygrps-yiv-988223983\">On May 11, 2009, at 11:59 AM, kmkjoy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lately though he has been eating mostly junk. We do have more soda  <br/>\n&gt; in the house than usual because it was left over from a party, but  <br/>\n&gt; we usually have some in the house. He is drinking it more than ever  <br/>\n&gt; before.<br/>\n<br/>\n </span></blockquote>I agree with Melissa and the food is part of puberty too. The soda  <br/>\nand the &quot;junk&quot; food are fatty and he&#39;s naturally seeking out high  <br/>\ncalorie foods. He&#39;s also likely to get a bit chunky for the same  <br/>\nreason most baby start out fat. He&#39;s gearing up for an even larger  <br/>\ngrowth spurt than babies do.<br/>\n<br/>\nAdd in some nutritionally dense high calorie foods like full fat  <br/>\ncheese, lunch meat and anything else you can think of. Make smoothies  <br/>\nwith full fat yogurt. (Lots of good recipes on line.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367169565,"authorName":"Melissa Gray","from":"Melissa Gray &lt;melissagr8@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] still deschooling","postDate":"1242103376","msgId":40030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQkZFQjg2LTE3OUQtNDExRS05OUFGLTJDNUUyNEFCQjI3N0BnbWFpbC5jb20+","inReplyToHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg=="},"prevInTopic":40029,"nextInTopic":40031,"prevInTime":40029,"nextInTime":40031,"topicId":40025,"numMessagesInTopic":0,"msgSnippet":"We pulled our son out of school at the end of fourth grade as well, and honestly it took two years for him to deschool to the point that I saw in life-long","messageBody":"<div id=\"ygrps-yiv-1203883896\">We pulled our son out of school at the end of fourth grade as well,  <br/>\nand honestly it took two years for him to deschool to the point that  <br/>\nI saw in life-long unschooled children.<br/>\n<br/>\nThe sensitive part I honestly would put down to hormones, all of my  <br/>\nchildren became very sensitive at about nine/ten years of age. It is  <br/>\na time in which I think parents need to really focus as much on their  <br/>\nchildren as they did when the kids were toddlers. They NEED us just  <br/>\nas much then! I liked Tammy&#39;s suggestions of taking stuff to him,  <br/>\nsitting and talking about whatever he is doing. We did that with  <br/>\njosh, talking almost all about video games or what he was looking at  <br/>\non the internet.<br/>\n<br/>\nYour first instinct is right, don&#39;t push him! It will come, slowly  <br/>\nbut surely. Deschooling can be hard, esp when we&#39;re still caught up  <br/>\nin our own fears instead of living now.<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel, Avari, and  <br/>\nbaby Nathan!<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 11, 2009, at 10:59 AM, kmkjoy wrote:<br/>\n<br/>\n&gt; &lt;snip&gt;<br/>\n&gt; Now it is mid May and I feel like we are still in the deschooling  <br/>\n&gt; phase. DS spends most of his indoor time in different room from the  <br/>\n&gt; rest of us, playing video games or watching TV.<br/>\n&gt;<br/>\n<br/>\n&gt; He doesn&#39;t seem to have much interest in doing things with the  <br/>\n&gt; family, maybe I&#39;m not engaging him enough.<br/>\n&gt; We&#39;ve never had very strict food rules, I put veggies on his plate  <br/>\n&gt; when I&#39;m making up his lunch, but there is no big deal made of  <br/>\n&gt; anything. Lately though he has been eating mostly junk. We do have  <br/>\n&gt; more soda in the house than usual because it was left over from a  <br/>\n&gt; party, but we usually have some in the house. He is drinking it  <br/>\n&gt; more than ever before.<br/>\n&gt; He seems much more sensitive now too. There have been many  <br/>\n&gt; instances over the last few weeks where he has come to me crying or  <br/>\n&gt; very upset about something. He has always been a little bit  <br/>\n&gt; sensitive, but not like this.<br/>\n&gt;<br/>\n&gt; I need suggestions. I don&#39;t want to push him. This morning when he  <br/>\n&gt; was asking about the soda, we talked about how soda tastes good and  <br/>\n&gt; then about how our body gets it&#39;s energy from food and that  <br/>\n&gt; different foods have different things our bodies need. That our  <br/>\n&gt; bodies like variety so they can get all the nutrition it needs. I  <br/>\n&gt; left it there, if he wants a soda with lunch, then he will have it.<br/>\n&gt;<br/>\n&gt; ~Kelly<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] still deschooling","postDate":"1242101864","msgId":40029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0NTg0My4zODk4MC5xbUB3ZWI0NTMxNS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg=="},"prevInTopic":40025,"nextInTopic":40030,"prevInTime":40028,"nextInTime":40030,"topicId":40025,"numMessagesInTopic":0,"msgSnippet":"Kelly, My daughter will be 11 the end of this year, it is our first year out of public school system. We are moving more and more to unschooling. It is","messageBody":"<div id=\"ygrps-yiv-1567044174\">Kelly,<br/>\n<br/>\nMy daughter will be 11 the end of this year, it is our first year out of public school system. We are moving more and more to unschooling. It is frustrating when they decide to be in a different room. I don&#39;t push, though I did to begin with, and I do talk to her about what she is up to. She has delved into anime. I have gotten to the point where I take her snacks, drinks, meals, etc. We sit and chat about the latest show or movie she is watching. She is getting more into communicating with us and just beginning to get up and walk away from things when she finds something else to do. She has developed friends, activities, etc. If she indicates that she wants to be left alone then I accept that. It isn&#39;t easy but I do know she is exploring what she is interested in. Each child takes a different amount of time. Talk to your son about what he is doing, what is so fascinating to him about whatever it is. I had to do that to even begin to understand what was<br/>\n going through her mind, otherwise it was frustrating beyond belief because I felt disconnected from her but that was a new feeling either. We are slowly rebuilding/building our relationship. She has started to come to me more and more with thoughts, ideas, you name it. But I had to give her that space and show her that I loved and trusted her before that could even happen. <br/>\n<br/>\n<br/>\nAs for crying, being sensitive, etc it maybe part of growing up. My daughter has done the same thing and sometimes doesn&#39;t know why she feels the way she does. Hold him, hug him and listen to what he has to say. Offer up your thoughts. Everything is new and different and that is scary. Don&#39;t worry about the &quot;junk&quot; food, inactivity, etc. It will all equal out when the time is right. Right now love and support as he finds his way into his comfort zone and figures things out. <br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: kmkjoy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellykoschmeder@...\">kellykoschmeder@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Monday, May 11, 2009 11:59:14 AM<br/>\nSubject: [unschoolingbasics] still deschooling<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWe are now in our 6th month of deschooling.  ds will be 11 in a couple weeks.  He was in school through 4th with the exception of a few months a couple of years ago when we tried &quot;school at home&quot;, that didn&#39;t go well, hence back to school.  I have 10 mo old twins here too.  ds didn&#39;t go to school at all this year, at the end of the last school year he asked to stay home.  In September we started an eclectic homeschool style, around Thanksgiving we&#39;d had enough and decided to take a break.  I&#39;d been reading a lot about unschooling and figured it was time to do what I felt was right and begin the deschooling process.  Of couse I&#39;m constantly reading books and blogs, websites and lists to help me with my mind set and open myself up to a different way of parenting.<br/>\n<br/>\nNow it is mid May and I feel like we are still in the deschooling phase.  DS spends most of his indoor time in different room from the rest of us, playing video games or watching TV.  He doesn&#39;t seem to have much interest in doing things with the family, maybe I&#39;m not engaging him enough. <br/>\nWe&#39;ve never had very strict food rules, I put veggies on his plate when I&#39;m making up his lunch, but there is no big deal made of anything.  Lately though he has been eating mostly junk.  We do have more soda in the house than usual because it was left over from a party, but we usually have some in the house.  He is drinking it more than ever before.<br/>\nHe seems much more sensitive now too.  There have been many instances over the last few weeks where he has come to me crying or very upset about something.  He has always been a little bit sensitive, but not like this.<br/>\n<br/>\nI need suggestions.  I don&#39;t want to push him.  This morning when he was asking about the soda, we talked about how soda tastes good and then about how our body gets it&#39;s energy from food and that different foods have different things our bodies need.  That our bodies like variety so they can get all the nutrition it needs.  I left it there, if he wants a soda with lunch, then he will have it.<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222924223,"authorName":"kmkjoy","from":"&quot;kmkjoy&quot; &lt;kellykoschmeder@...&gt;","profile":"kmkjoy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"still deschooling","postDate":"1242057554","msgId":40025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OWkwaSsydWMzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40029,"prevInTime":40024,"nextInTime":40026,"topicId":40025,"numMessagesInTopic":0,"msgSnippet":"We are now in our 6th month of deschooling.  ds will be 11 in a couple weeks.  He was in school through 4th with the exception of a few months a couple of","messageBody":"<div id=\"ygrps-yiv-434217070\">We are now in our 6th month of deschooling.  ds will be 11 in a couple weeks.  He was in school through 4th with the exception of a few months a couple of years ago when we tried &quot;school at home&quot;, that didn&#39;t go well, hence back to school.  I have 10 mo old twins here too.  ds didn&#39;t go to school at all this year, at the end of the last school year he asked to stay home.  In September we started an eclectic homeschool style, around Thanksgiving we&#39;d had enough and decided to take a break.  I&#39;d been reading a lot about unschooling and figured it was time to do what I felt was right and begin the deschooling process.  Of couse I&#39;m constantly reading books and blogs, websites and lists to help me with my mind set and open myself up to a different way of parenting.<br/>\n<br/>\nNow it is mid May and I feel like we are still in the deschooling phase.  DS spends most of his indoor time in different room from the rest of us, playing video games or watching TV.  He doesn&#39;t seem to have much interest in doing things with the family, maybe I&#39;m not engaging him enough.  <br/>\nWe&#39;ve never had very strict food rules, I put veggies on his plate when I&#39;m making up his lunch, but there is no big deal made of anything.  Lately though he has been eating mostly junk.  We do have more soda in the house than usual because it was left over from a party, but we usually have some in the house.  He is drinking it more than ever before.<br/>\nHe seems much more sensitive now too.  There have been many instances over the last few weeks where he has come to me crying or very upset about something.  He has always been a little bit sensitive, but not like this.<br/>\n<br/>\nI need suggestions.  I don&#39;t want to push him.  This morning when he was asking about the soda, we talked about how soda tastes good and then about how our body gets it&#39;s energy from food and that different foods have different things our bodies need.  That our bodies like variety so they can get all the nutrition it needs.  I left it there, if he wants a soda with lunch, then he will have it.<br/>\n<br/>\n~Kelly</div>","specialLinks":[]}],"prevTopicId":40022,"nextTopicId":39988}}