{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":300893042,"authorName":"colleenkellyp","from":"&quot;colleenkellyp&quot; &lt;cpaeff@...&gt;","profile":"colleenkellyp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:unsupportive husband (sorry it&#39;s so long!)","postDate":"1259617704","msgId":42285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmMWVqOCtucDVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFN0NCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42284,"nextInTopic":0,"prevInTime":42284,"nextInTime":42286,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"... So your film editor homebody husband has a problem with a video/media-loving homebody son s activities? Hmm, seems like son is following in dad s","messageBody":"<div id=\"ygrps-yiv-1526423953\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; &lt;debra.rossing@...&gt; wrote:<br/>\n<br/>\n&quot;So your film editor homebody husband has a problem with a video/media-loving homebody son&#39;s activities? Hmm, seems like son is following in dad&#39;s footsteps to me.&quot;<br/>\n<br/>\nI know! Crazy, right!?<br/>\n<br/>\n<br/>\n&quot;What is it dad thinks son should be doing? More importantly, I think, how would dad have felt as a 14 yr old if his love for movies, media, etc had been encouraged and supported as valuable, not just something that had to take second place to more &quot;worthwhile&quot; pursuits (like sports, academics, etc)? (I&#39;m presuming that he loved movies/media growing up at some point which led him to the path he&#39;s now following) It can be very unnerving sometimes to see your kid(s) getting the freedom that you wished you&#39;d had as a kid.&quot;<br/>\n<br/>\nNow that you mention it, I think that could have something to do with it. My husband didn&#39;t get much of a childhood. He had to grow up and fend for himself very early. I think in a way he thinks Jerry should be doing the same.<br/>\n<br/>\n <br/>\n&quot;Definitely don&#39;t ignore hubby&#39;s concerns. In fact, sit down and discuss them - maybe even bring a notepad and pen with you so you can make notes if that will help him feel that he&#39;s being heard and taken seriously. Then, don&#39;t answer him back or defend anything. Ask him for a day (or two or three) to consider his concerns and then meet back again so you can address his concerns. Very serious, almost businesslike in some respects. If you can draw parallels between them that might also help - his son is fascinated/interested in the same things he is interested in, like father like son. Draw out the positive aspects of his personality and strengths and show him how his son has those SAME interests, abilities and draw on his help to support and encourage those things. And, there may be some things that he has a good point about - let him know it&#39;s a good point. Then strategize together on possible ways to address them - what two or three things might help with sleep schedules for instance?&quot; <br/>\n<br/>\nReally great idea! Thank you!<br/>\n<br/>\n&quot;Then, once he&#39;s feeling heard and is okay with plans A, B, C, bring Jerry into a discussion regarding the topic. See if Jerry might have a couple more options as well.&quot;<br/>\n<br/>\n<br/>\nJerry actually called a family meeting this morning. He wanted to talk about how he and Warren had been locking horns. It went really well. I acted as moderator. They both talked about how they&#39;ve been getting angry at each other and why and what each person can do to avoid that. And then they talked about ways they can show mutual respect for each other. Then they had a pillow fight. :)<br/>\n<br/>\nI&#39;m feeling so much better now about how things will go while Warren is off work. I think the stress of being unemployed my have had a lot to do with Warren&#39;s outburst the other night. I told me the other day (over Krispy Kreme donuts--yum!) that he had overreacted and didn&#39;t really want to send Jerry back to school. Phew!<br/>\n<br/>\nThanks for all your help.<br/>\nColleen </span></blockquote></div>","specialLinks":[]},{"userId":300893042,"authorName":"colleenkellyp","from":"&quot;colleenkellyp&quot; &lt;cpaeff@...&gt;","profile":"colleenkellyp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unsupportive husband (sorry it&#39;s so long!)","postDate":"1259617050","msgId":42284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmMWR1cSs1a2dyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVENjQ0OUU2NEU2RDREOTE5MjAxNEI2RjI4OEFCMTJEQExZTEFMQVAyPg=="},"prevInTopic":42283,"nextInTopic":42285,"prevInTime":42283,"nextInTime":42285,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"... I haven t, Lyla. I ll check it out and e-mail it to my husband as well. -","messageBody":"<div id=\"ygrps-yiv-1995355391\"><blockquote><span title=\"ireply\">&gt; have you seen this article?<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.downes.ca/post/38502\">http://www.downes.ca/post/38502</a><br/>\n<br/>\n&gt; lyla<br/>\n<br/>\n </span></blockquote>I haven&#39;t, Lyla. I&#39;ll check it out and e-mail it to my husband as well.<br/>\n<br/>\n-</div>","specialLinks":[]},{"userId":300893042,"authorName":"colleenkellyp","from":"&quot;colleenkellyp&quot; &lt;cpaeff@...&gt;","profile":"colleenkellyp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unsupportive husband (sorry it&#39;s so long!)","postDate":"1259616984","msgId":42283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmMWRzbytmZHNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMTFCOTI2LjMwMzA0MDJAY294Lm5ldD4="},"prevInTopic":42276,"nextInTopic":42284,"prevInTime":42282,"nextInTime":42284,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"... Not really, Elizabeth. But I think they re trying to come up with a joint project to do while Warren is off work. ... He is. There is definitely a power","messageBody":"<div id=\"ygrps-yiv-1951548680\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Elizabeth &lt;elizabeth.simon@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Does your son have any interest in film editing (or something related)and that could involve your husband?<br/>\n<br/>\n </span></blockquote>Not really, Elizabeth. But I think they&#39;re trying to come up with a joint project to do while Warren is off work.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is your husband Jerry&#39;s father? It sounds like there may be a <br/>\n&gt; relationship issue there that is turning into a power struggle...<br/>\n&gt; I could be wrong but I see this with my son and his dad (my husband).<br/>\n<br/>\n </span></blockquote>He is. There is definitely a power struggle going on. We had a really nice talk this morning (all three of us) at my son&#39;s urging and it seems like maybe some of the problems will start to smooth out. They are both out doing Jerry&#39;s dog walking job at the moment, so that should provide for some nice bonding time. :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Elizabeth </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:unsupportive husband (sorry it&#39;s so long!)","postDate":"1259593068","msgId":42276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFN0NCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42257,"nextInTopic":42283,"prevInTime":42275,"nextInTime":42277,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"So your film editor homebody husband has a problem with a video/media-loving homebody son s activities? Hmm, seems like son is following in dad s footsteps to","messageBody":"<div id=\"ygrps-yiv-1508107273\">So your film editor homebody husband has a problem with a<br/>\nvideo/media-loving homebody son&#39;s activities? Hmm, seems like son is<br/>\nfollowing in dad&#39;s footsteps to me. What is it dad thinks son should be<br/>\ndoing? More importantly, I think, how would dad have felt as a 14 yr old<br/>\nif his love for movies, media, etc had been encouraged and supported as<br/>\nvaluable, not just something that had to take second place to more<br/>\n&quot;worthwhile&quot; pursuits (like sports, academics, etc)? (I&#39;m presuming that<br/>\nhe loved movies/media growing up at some point which led him to the path<br/>\nhe&#39;s now following) It can be very unnerving sometimes to see your<br/>\nkid(s) getting the freedom that you wished you&#39;d had as a kid. Several<br/>\nyears ago (DS is now 11 and has never been schooled; he was maybe 6ish<br/>\nat the time), DH and DS were locking horns often (which got really<br/>\nsticky since I WOH fulltime and DH is home with DS). I&#39;d get phone calls<br/>\nto try to help them sort things out. So, I took an evening, when things<br/>\nwere quieted down, DS was in his room playing quietly or whatever, and<br/>\nDH and I were snuggled in the dark all cozy, to bring up the subject.<br/>\nTurns out that DH was jealous of DS&#39; freedom which increased his<br/>\ndiscomfort because he didn&#39;t like feeling jealous of his son. Took a lot<br/>\nof talk to come around to that discovery. Then we could work from there<br/>\n- DH realized that he could allow himself the freedom that he didn&#39;t get<br/>\nas a kid NOW as an adult. His interests were valid simply because they<br/>\nwere his interests, they didn&#39;t have to be &quot;worthwhile&quot; or &quot;productive&quot;<br/>\n(he grew up with the idea of &#39;earning&#39; everything he had, and being<br/>\nproductive and useful and anything that wasn&#39;t productive was a waste of<br/>\ntime and money). <br/>\n<br/>\nDefinitely don&#39;t ignore hubby&#39;s concerns. In fact, sit down and discuss<br/>\nthem - maybe even bring a notepad and pen with you so you can make notes<br/>\nif that will help him feel that he&#39;s being heard and taken seriously.<br/>\nThen, don&#39;t answer him back or defend anything. Ask him for a day (or<br/>\ntwo or three) to consider his concerns and then meet back again so you<br/>\ncan address his concerns. Very serious, almost businesslike in some<br/>\nrespects. If you can draw parallels between them that might also help -<br/>\nhis son is fascinated/interested in the same things he is interested in,<br/>\nlike father like son. Draw out the positive aspects of his personality<br/>\nand strengths and show him how his son has those SAME interests,<br/>\nabilities and draw on his help to support and encourage those things.<br/>\nAnd, there may be some things that he has a good point about - let him<br/>\nknow it&#39;s a good point. Then strategize together on possible ways to<br/>\naddress them - what two or three things might help with sleep schedules<br/>\nfor instance? Then, once he&#39;s feeling heard and is okay with plans A, B,<br/>\nC, bring Jerry into a discussion regarding the topic. See if Jerry might<br/>\nhave a couple more options as well. For instance, DS often gets on a<br/>\n&#39;backwards&#39; sleep schedule, awake until I leave for work, then sleeping<br/>\nmost of the day. He&#39;s getting enough hours of sleep, that&#39;s not a big<br/>\nissue for us. What is, or becomes eventually, an issue is that we miss<br/>\nhim. There are times that he&#39;s waking up at 7 or 8 pm as DH and I are<br/>\nwinding down for the day. We discussed it with him a while back and<br/>\nwe&#39;ll remind him about it if several days go by when we haven&#39;t had much<br/>\nchance to spend time with him. More often, though, he&#39;ll notice it and<br/>\ntry to adjust his schedule a little bit so he can be awake maybe late<br/>\nafternoons and on. We&#39;ll assist however he asks us to if he&#39;s trying to<br/>\nflip his schedule around a bit (such as him asking DH to wake him up so<br/>\nthey can go have lunch at the pond or so they can go to GameStop to<br/>\ncheck whether the price on a game he&#39;s wanting has come down).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":300893042,"authorName":"colleenkellyp","from":"&quot;colleenkellyp&quot; &lt;cpaeff@...&gt;","profile":"colleenkellyp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unsupportive husband (sorry it&#39;s so long!)","postDate":"1259508380","msgId":42257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhldTNxcythdHU4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI1OTg4Mi43NDk2Ny5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":42256,"nextInTopic":42276,"prevInTime":42256,"nextInTime":42258,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"Those are great ideas Schuyler--including the intervention! Ha! And actually your previous post was helpful too because when Warren was Jerry s age and he was","messageBody":"<div id=\"ygrps-yiv-1202590165\">Those are great ideas Schuyler--including the intervention! Ha! And actually your previous post was helpful too because when Warren was Jerry&#39;s age and he was in school he was over at a friend&#39;s house getting high every day! So asking him about his school experience may not be such a bad idea. I doubt he wants the same for our son. ;)<br/>\n<br/>\nAnd I think you&#39;re right that Warren is feeling a bit stressed and is maybe looking to Jerry as a &quot;project.&quot; (I&#39;ve been guilty of that myself but thank goodness I know the signs now and I can stop myself before it starts!) <br/>\n<br/>\nHe does need to reacquaint himself with Jerry, I think. The problem is that it&#39;s very hard for him to just accept Jerry as he is. It&#39;s Warren&#39;s nature to see the negative (or what he views as negative) before everything else (he comes by it honestly--his mother is, seriously, the mother of all pessimists and not a very pleasant person to be around). Plus, Jerry is very different from Warren. For example, Warren loves sports but Jerry&#39;s not into them at all. Warren does make an effort. He&#39;s read some of the manga that Jerry likes and he plays video games with him now and then (though he doesn&#39;t really like them at all). But the real problem as far as I see it is that Warren can&#39;t just accept Jerry. He always wants something to be different. He&#39;s not doing it with malice--it&#39;s just who he is. And I&#39;m not quite sure how to make him see that Jerry is fine the way he is. It sounds awful but a part of Warren thinks Jerry&#39;s just lazy and a bit selfish. I feel like Warren&#39;s ruining their relationship, to tell you the truth. But I don&#39;t know how to change it.<br/>\n<br/>\nAnyway, thanks so much for your ideas and for writing. I&#39;m definitely going to plan a little get-away for us--maybe to San Diego! :)<br/>\n<br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I got the wrong end of the stick, didn&#39;t I? You wrote:<br/>\n&gt; <br/>\n&gt; &gt;Last night my husband told me he thinks Jerry should be in school. I&#39;m really in a quandary. I can&#39;t just ignore my husband, but I don&#39;t want to force our son to do something he&#39;s not interested in doing (I&#39;m talking about turning off the TV here, not going to school--that will never happen). &lt;<br/>\n&gt; <br/>\n&gt; and I responded entirely from a what about school perspective. <br/>\n&gt; <br/>\n&gt; My brother writes for television and I always found it amusing how much he felt his children needed to moderate their television watching. It seems that a film editor may be suffering from the same kind of thing. <br/>\n&gt; <br/>\n&gt; Simon spends a fair bit of time watching youtube or television or playing video games. And I am repeatedly impressed by how much information he derives from those sources. It is clearly a very intellectual exercise, his television, computer and video game using. He is weighing and measuring and comparing and contrasting and assessing all the time. It isn&#39;t a passive pursuit of amusement, it is an active analysis of content and quality going on. <br/>\n&gt; <br/>\n&gt; &gt;It&#39;s true that Jerry spends a lot of time in front of the television, but he does do other things. I kept a log of how we spend our days for about a week and a half (then Thanksgiving got in the way) so my husband would see that Jerry is actually getting off the couch. And the log did prove my point. But it also showed that Jerry does manage to cram a lot of television into each day--a minimum of six hours (most of it happens between 6 p.m. and 1 a.m.--another bone of contention between my husband and son. My husband doesn&#39;t think Jerry should stay up that late.)&lt;<br/>\n&gt; <br/>\n&gt; Simon is much the same. He likes the stand up that is on late at night and so he watches that. The schedule of a child without school is very different from one with school. Simon also, though, isn&#39;t just ever doing one thing. If he&#39;s watching television he is probably also doing something on the computer and listening to something on the ipod or he&#39;s playing with a cat or he&#39;s talking to me or David or Linnaea. If he&#39;s playing on the xbox he&#39;s also talking to someone else who&#39;s playing or he&#39;s listening to Stephen Fry read Harry Potter or he&#39;s showing me something he built on Halo, or all three. <br/>\n&gt; <br/>\n&gt; I think the journal is a good idea. And I still stand by the idea of taking a trip somewhere to do something just the 3 of you. Move away from the house where contention is centred and find something else to do that gets everyone feeling affectionate again, maybe. <br/>\n&gt; <br/>\n&gt; Schuyler<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unsupportive husband (sorry it&#39;s so long!)","postDate":"1259495901","msgId":42256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1OTg4Mi43NDk2Ny5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":42254,"nextInTopic":42257,"prevInTime":42255,"nextInTime":42257,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"... and I responded entirely from a what about school perspective. My brother writes for television and I always found it amusing how much he felt his children","messageBody":"<div id=\"ygrps-yiv-590493303\">I got the wrong end of the stick, didn&#39;t I? You wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Last night my husband told me he thinks Jerry should be in school. I&#39;m really in a quandary. I can&#39;t just ignore my husband, but I don&#39;t want to force our son to do something he&#39;s not interested in doing (I&#39;m talking about turning off the TV here, not going to school--that will never happen). &lt;<br/>\n<br/>\n </span></blockquote>and I responded entirely from a what about school perspective. <br/>\n<br/>\nMy brother writes for television and I always found it amusing how much he felt his children needed to moderate their television watching. It seems that a film editor may be suffering from the same kind of thing. <br/>\n<br/>\nSimon spends a fair bit of time watching youtube or television or playing video games. And I am repeatedly impressed by how much information he derives from those sources. It is clearly a very intellectual exercise, his television, computer and video game using. He is weighing and measuring and comparing and contrasting and assessing all the time. It isn&#39;t a passive pursuit of amusement, it is an active analysis of content and quality going on. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s true that Jerry spends a lot of time in front of the television, but he does do other things. I kept a log of how we spend our days for about a week and a half (then Thanksgiving got in the way) so my husband would see that Jerry is actually getting off the couch. And the log did prove my point. But it also showed that Jerry does manage to cram a lot of television into each day--a minimum of six hours (most of it happens between 6 p.m. and 1 a.m.--another bone of contention between my husband and son. My husband doesn&#39;t think Jerry should stay up that late.)&lt;<br/>\n<br/>\n </span></blockquote>Simon is much the same. He likes the stand up that is on late at night and so he watches that. The schedule of a child without school is very different from one with school. Simon also, though, isn&#39;t just ever doing one thing. If he&#39;s watching television he is probably also doing something on the computer and listening to something on the ipod or he&#39;s playing with a cat or he&#39;s talking to me or David or Linnaea. If he&#39;s playing on the xbox he&#39;s also talking to someone else who&#39;s playing or he&#39;s listening to Stephen Fry read Harry Potter or he&#39;s showing me something he built on Halo, or all three. <br/>\n<br/>\nI think the journal is a good idea. And I still stand by the idea of taking a trip somewhere to do something just the 3 of you. Move away from the house where contention is centred and find something else to do that gets everyone feeling affectionate again, maybe. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unsupportive husband (sorry it&#39;s so long!)","postDate":"1259489832","msgId":42254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2Mjk4Ljc0NDIyLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGhlc2JobStvMzJvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlc2JobStvMzJvQGVHcm91cHMuY29tPg=="},"prevInTopic":42252,"nextInTopic":42256,"prevInTime":42253,"nextInTime":42255,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"Oh, Colleen, that must be so hard. Maybe you could get Jeff Sabo to come over and do an intervention ; .   I would ask Warren what it is he wants. Calmly and","messageBody":"<div id=\"ygrps-yiv-1034226547\">Oh, Colleen, that must be so hard. Maybe you could get Jeff Sabo to come over and do an intervention ;&gt;.  <br/>\n<br/>\nI would ask Warren what it is he wants. Calmly and without all the emotion that I could carry into a conversation about Simon or Linnaea going to school. Ask him to talk about what he thinks school would give to Jerry. Talk about his school experience. Talk about what it was that he did when he was 14. When I was 14, I was smoking and failing school and hanging out with the tough kids. I don&#39;t remember getting a lot out of my classes. Frog dissection occured that year. I don&#39;t remember why that was important, 27 years later. There was no context. It was frog dissection day. I can remember Toni Koob who always did a bit better in English than I did and whose boyfriend I later dated in high school and whose ex-boyfriend later dumped me to get back together with her and her leopard spot dyed hair. And Alicia Leffler with her cockroach infested house and her uncle who conned me out of my paper route earnings for a couple of crappy digital watches. I don&#39;t<br/>\n remember much about school. I can remember the lockers and the gym uniforms and how cold it was changing and not having boobs but wanting a bra so much. Oh, and the gas station where they had a coin operated cigarette machine so we could buy cigarettes without having to find someone who looked of age to buy them for us. And Sean Rhourke who I had a crush on and we&#39;d joke around a lot in shop class when we were supposed to making a wood puzzle. <br/>\n<br/>\nIs he worried about work? Is he worried about other things? Is it normal when he is out of work, transitionally, for him to fuss about all the other things going on, to look for things to do? Maybe right now he&#39;s just turning toward Jerry as a project.Maybe ask him to trust you and this and to just reserve judgement. Maybe you could organise some really fun things, different things, to do for all of you. Go on vacation given that you have this moment of everybody around. Go do something that is engaging for everybody and distract Warren from the focus on all of the things he thinks are wrong with unschooling. <br/>\n<br/>\nJerry is really interesting and engaging. I really enjoy Jerry. Maybe Warren just needs to get more experience enjoying Jerry again. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: colleenkellyp &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cpaeff@...\">cpaeff@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Saturday, 28 November, 2009 23:25:42<br/>\nSubject: [unschoolingbasics] unsupportive husband (sorry it&#39;s so long!)<br/>\n<br/>\nMy 14-year-old son has been unschooled for about two and a half years now (after 5 years in school) and up until this point my husband has been willing to let me lead the way--even though he&#39;s not entirely convinced that radical unschooling is best for our son. However, my husband is now unemployed (he&#39;s a freelance film editor so he&#39;s usually out of work for a few weeks or months every year or two) which means he is home, judging how my son is spending his time. <br/>\n<br/>\nMy husband is on board with the idea of unschooling as an educational choice, but he doesn&#39;t want our son watching television and being on the computer (often simultaneously--he&#39;s a multi-tasker!) all day. I&#39;m really feeling caught in the middle here. <br/>\n<br/>\nLast night my husband told me he thinks Jerry should be in school. I&#39;m really in a quandary. I can&#39;t just ignore my husband, but I don&#39;t want to force our son to do something he&#39;s not interested in doing (I&#39;m talking about turning off the TV here, not going to school--that will never happen). <br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unsupportive husband (sorry it&#39;s so long!)","postDate":"1259460282","msgId":42252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVENjQ0OUU2NEU2RDREOTE5MjAxNEI2RjI4OEFCMTJEQExZTEFMQVAyPg==","inReplyToHeader":"PGhlc2JobStvMzJvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlc2JobStvMzJvQGVHcm91cHMuY29tPg=="},"prevInTopic":42249,"nextInTopic":42254,"prevInTime":42251,"nextInTime":42253,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"have you seen this article? http://www.downes.ca/post/38502 lyla MARKETPLACE Going Green: Your Yahoo! Groups resource for green living ... Mom Power: Discover","messageBody":"<div id=\"ygrps-yiv-659920418\">have you seen this article?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.downes.ca/post/38502\">http://www.downes.ca/post/38502</a><br/>\n<br/>\nlyla<br/>\n  MARKETPLACE<br/>\n  Going Green: Your Yahoo! Groups resource for green living<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Mom Power: Discover the community of moms doing more for their families, for the world and for each other  Switch to: Text-Only, Daily Digest . Unsubscribe . Terms of Use.<br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":104291387,"authorName":"Elizabeth","from":"Elizabeth &lt;elizabeth.simon@...&gt;","profile":"elizabethgsimon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unsupportive husband (sorry it&#39;s so long!)","postDate":"1259452710","msgId":42249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMTFCOTI2LjMwMzA0MDJAY294Lm5ldD4=","inReplyToHeader":"PGhlc2JobStvMzJvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlc2JobStvMzJvQGVHcm91cHMuY29tPg=="},"prevInTopic":42247,"nextInTopic":42252,"prevInTime":42248,"nextInTime":42250,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"Does your son have any interest in film editing (or something related) and that could involve your husband? Is your husband Jerry s father? It sounds like","messageBody":"<div id=\"ygrps-yiv-1139536786\">Does your son have any interest in film editing (or something related) <br/>\nand that could involve your husband?<br/>\nIs your husband Jerry&#39;s father? It sounds like there may be a <br/>\nrelationship issue there that is turning into a power struggle...<br/>\nI could be wrong but I see this with my son and his dad (my husband).<br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\ncolleenkellyp wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; My 14-year-old son has been unschooled for about two and a half years <br/>\n&gt; now (after 5 years in school) and up until this point my husband has <br/>\n&gt; been willing to let me lead the way--even though he&#39;s not entirely <br/>\n&gt; convinced that radical unschooling is best for our son. However, my <br/>\n&gt; husband is now unemployed (he&#39;s a freelance film editor so he&#39;s <br/>\n&gt; usually out of work for a few weeks or months every year or two) which <br/>\n&gt; means he is home, judging how my son is spending his time.<br/>\n&gt;<br/>\n&gt; My husband is on board with the idea of unschooling as an educational <br/>\n&gt; choice, but he doesn&#39;t want our son watching television and being on <br/>\n&gt; the computer (often simultaneously--he&#39;s a multi-tasker!) all day. I&#39;m <br/>\n&gt; really feeling caught in the middle here.<br/>\n&gt;<br/>\n&gt; Last night my husband told me he thinks Jerry should be in school. I&#39;m <br/>\n&gt; really in a quandary. I can&#39;t just ignore my husband, but I don&#39;t want <br/>\n&gt; to force our son to do something he&#39;s not interested in doing (I&#39;m <br/>\n&gt; talking about turning off the TV here, not going to school--that will <br/>\n&gt; never happen).<br/>\n&gt;<br/>\n&gt; It&#39;s true that Jerry spends a lot of time in front of the television, <br/>\n&gt; but he does do other things. I kept a log of how we spend our days for <br/>\n&gt; about a week and a half (then Thanksgiving got in the way) so my <br/>\n&gt; husband would see that Jerry is actually getting off the couch. And <br/>\n&gt; the log did prove my point. But it also showed that Jerry does manage <br/>\n&gt; to cram a lot of television into each day--a minimum of six hours <br/>\n&gt; (most of it happens between 6 p.m. and 1 a.m.--another bone of <br/>\n&gt; contention between my husband and son. My husband doesn&#39;t think Jerry <br/>\n&gt; should stay up that late.)<br/>\n&gt;<br/>\n&gt; My husband has good intentions and really cares about our son. I can <br/>\n&gt; honestly see where he&#39;s coming from. But I also want our son to make <br/>\n&gt; his own choices. I want him to be free to follow his passions, and for <br/>\n&gt; whatever reason his passions at the moment (and for most of the past <br/>\n&gt; two years) are largely found on television (or on the computer or <br/>\n&gt; Nintendo DS on his lap and in his hand, respectively, as he watches).<br/>\n&gt;<br/>\n&gt; It&#39;s true that Jerry frequently says he&#39;s getting bored doing the same <br/>\n&gt; thing, so I&#39;ve been looking for new ideas. My niece (also <br/>\n&gt; homeschooled) spends one day a week with us now and we&#39;ve started a <br/>\n&gt; knitting circle that Jerry really enjoys (for the company--not so much <br/>\n&gt; the knitting). He&#39;s also got a dog walking job that we go to 5 days a <br/>\n&gt; week. And we&#39;ve started a weekly D&D game. Plus we&#39;re going to look <br/>\n&gt; into volunteering at a no kill shelter. So I&#39;m definitely looking for <br/>\n&gt; alternatives to home and television, but my son is also a homebody (a <br/>\n&gt; quality, I might add, that he gets from his father!) so he needs time <br/>\n&gt; at home to recharge.<br/>\n&gt;<br/>\n&gt; I think my husband&#39;s fears would be eased if he saw my son doing <br/>\n&gt; something that looked a bit more schoolish. Jerry does take Japanese <br/>\n&gt; lessons (his choice), but doesn&#39;t do any practice in between meetings <br/>\n&gt; with his tutor. So maybe some Japanese practice, or some typing <br/>\n&gt; practice, or maybe more reading would help. But forcing Jerry to do <br/>\n&gt; &quot;lessons&quot; is not really what I want to be doing. Last week I suggested <br/>\n&gt; that Jerry think of some questions he&#39;d like answered and he came up <br/>\n&gt; with two, so we&#39;re exploring a couple new subjects (Could dinosaurs <br/>\n&gt; really be brought back to life, as in Jurassic Park? And, How did <br/>\n&gt; people come up with the idea of dragons?) Maybe that will make my <br/>\n&gt; husband feel like we&#39;re &quot;doing something.&quot;<br/>\n&gt;<br/>\n&gt; I don&#39;t want my husband to come across as some kind of <br/>\n&gt; anti-unschooling ogre. He&#39;s really been very patient. But he&#39;s <br/>\n&gt; patience is waning and I feel ignoring his concerns is not the best <br/>\n&gt; thing for our relationship--or for his relationship with Jerry.<br/>\n&gt;<br/>\n&gt; I know that if my husband treated my son with more respect (as in <br/>\n&gt; respecting Jerry&#39;s desire to watch television and go to bed when he&#39;s <br/>\n&gt; tired) Jerry would offer the same respect back and might even listen <br/>\n&gt; to his concerns re: television. But my husband doesn&#39;t offer it and <br/>\n&gt; therefore, doesn&#39;t often receive it. I can see how frustrated my <br/>\n&gt; husband gets when he tells Jerry to go to bed and Jerry ignores him. <br/>\n&gt; Even though I&#39;ve explained to my husband that there is no reason for <br/>\n&gt; Jerry to go to bed at a certain time (he still gets a solid 10 hours <br/>\n&gt; of sleep), my husband just doesn&#39;t see it that way.<br/>\n&gt;<br/>\n&gt; I could keep going, but lucky for the readers of this list Jerry is <br/>\n&gt; ready to walk to the store for ice cream! Thanks in advance for your help.<br/>\n&gt;<br/>\n&gt; Colleen<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":300893042,"authorName":"colleenkellyp","from":"&quot;colleenkellyp&quot; &lt;cpaeff@...&gt;","profile":"colleenkellyp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"unsupportive husband (sorry it&#39;s so long!)","postDate":"1259450742","msgId":42247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlc2JobStvMzJvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42249,"prevInTime":42246,"nextInTime":42248,"topicId":42247,"numMessagesInTopic":0,"msgSnippet":"My 14-year-old son has been unschooled for about two and a half years now (after 5 years in school) and up until this point my husband has been willing to let","messageBody":"<div id=\"ygrps-yiv-1595266917\">My 14-year-old son has been unschooled for about two and a half years now (after 5 years in school) and up until this point my husband has been willing to let me lead the way--even though he&#39;s not entirely convinced that radical unschooling is best for our son. However, my husband is now unemployed (he&#39;s a freelance film editor so he&#39;s usually out of work for a few weeks or months every year or two) which means he is home, judging how my son is spending his time. <br/>\n<br/>\nMy husband is on board with the idea of unschooling as an educational choice, but he doesn&#39;t want our son watching television and being on the computer (often simultaneously--he&#39;s a multi-tasker!) all day. I&#39;m really feeling caught in the middle here. <br/>\n<br/>\nLast night my husband told me he thinks Jerry should be in school. I&#39;m really in a quandary. I can&#39;t just ignore my husband, but I don&#39;t want to force our son to do something he&#39;s not interested in doing (I&#39;m talking about turning off the TV here, not going to school--that will never happen). <br/>\n<br/>\nIt&#39;s true that Jerry spends a lot of time in front of the television, but he does do other things. I kept a log of how we spend our days for about a week and a half (then Thanksgiving got in the way) so my husband would see that Jerry is actually getting off the couch. And the log did prove my point. But it also showed that Jerry does manage to cram a lot of television into each day--a minimum of six hours (most of it happens between 6 p.m. and 1 a.m.--another bone of contention between my husband and son. My husband doesn&#39;t think Jerry should stay up that late.)<br/>\n<br/>\nMy husband has good intentions and really cares about our son. I can honestly see where he&#39;s coming from. But I also want our son to make his own choices. I want him to be free to follow his passions, and for whatever reason his passions at the moment (and for most of the past two years) are largely found on television (or on the computer or Nintendo DS on his lap and in his hand, respectively, as he watches). <br/>\n<br/>\nIt&#39;s true that Jerry frequently says he&#39;s getting bored doing the same thing, so I&#39;ve been looking for new ideas. My niece (also homeschooled) spends one day a week with us now and we&#39;ve started a knitting circle that Jerry really enjoys (for the company--not so much the knitting). He&#39;s also got a dog walking job that we go to 5 days a week. And we&#39;ve started a weekly D&D game. Plus we&#39;re going to look into volunteering at a no kill shelter. So I&#39;m definitely looking for alternatives to home and television, but my son is also a homebody (a quality, I might add, that he gets from his father!) so he needs time at home to recharge.<br/>\n<br/>\nI think my husband&#39;s fears would be eased if he saw my son doing something that looked a bit more schoolish. Jerry does take Japanese lessons (his choice), but doesn&#39;t do any practice in between meetings with his tutor. So maybe some Japanese practice, or some typing practice, or maybe more reading would help. But forcing Jerry to do &quot;lessons&quot; is not really what I want to be doing. Last week I suggested that Jerry think of some questions he&#39;d like answered and he came up with two, so we&#39;re exploring a couple new subjects (Could dinosaurs really be brought back to life, as in Jurassic Park? And, How did people come up with the idea of dragons?) Maybe that will make my husband feel like we&#39;re &quot;doing something.&quot;<br/>\n<br/>\nI don&#39;t want my husband to come across as some kind of anti-unschooling ogre. He&#39;s really been very patient. But he&#39;s patience is waning and I feel ignoring his concerns is not the best thing for our relationship--or for his relationship with Jerry.<br/>\n<br/>\nI know that if my husband treated my son with more respect (as in respecting Jerry&#39;s desire to watch television and go to bed when he&#39;s tired) Jerry would offer the same respect back and might even listen to his concerns re: television. But my husband doesn&#39;t offer it and therefore, doesn&#39;t often receive it. I can see how frustrated my husband gets when he tells Jerry to go to bed and Jerry ignores him. Even though I&#39;ve explained to my husband that there is no reason for Jerry to go to bed at a certain time (he still gets a solid 10 hours of sleep), my husband just doesn&#39;t see it that way.<br/>\n<br/>\nI could keep going, but lucky for the readers of this list Jerry is ready to walk to the store for ice cream! Thanks in advance for your help.<br/>\n<br/>\nColleen</div>","specialLinks":[]}],"prevTopicId":42217,"nextTopicId":42248}}