{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"standardized testing, etc.","postDate":"1149962616","msgId":14315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODVBQ0Y1NDFDNzI1Mi0xN0IwLTFEQjZAbWJsay1kMTkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":14314,"nextInTime":14316,"topicId":14315,"numMessagesInTopic":0,"msgSnippet":"Leslie Moyer granted permission for me to crosspost this and the next post to blast some of teh fallacies about unschooling. Matt took the ACT test last month","messageBody":"<div id=\"ygrps-yiv-22081028\">Leslie Moyer granted permission for me to crosspost this and the next <br/>\npost to blast some of teh fallacies about unschooling.<br/>\n<br/>\n<br/>\n<br/>\nMatt took the ACT test last month and he just got the scores back <br/>\ntoday. He did *so* great, scoring in the 99th percentile--the highest <br/>\nselectivity rating. I&#39;m very proud of him, for sure, but I&#39;m really not <br/>\nwriting this to brag on *him* but to use his achievement to shine the <br/>\nspotlight on the process of unschooling.<br/>\n<br/>\nMatt is 17 and has never had a vocabulary assignment, a spelling list, <br/>\nor an assigned math worksheet. I have never &quot;assigned&quot; him <br/>\n*anything*--no multiplication tables, no books or book reports, no <br/>\nworksheets--nothing. He has completely followed his own interests in <br/>\nlife and had time to have a childhood and healthy adolescence....to be <br/>\ncreative, to pursue his interests, to develop passions, to dig in the <br/>\ndirt, to play music, to play--and fight--with his sisters, to watch TV <br/>\nand to read....and read....and read.<br/>\n<br/>\nAs an unschooling mom, I haven&#39;t &quot;done nothing&quot;, however....<br/>\n<br/>\nI took my children to interesting places, I bought them books and <br/>\nelectronics kits and magazine subscriptions and computers and Legos and <br/>\nmagnets and shovels and crayons and guitars and more books. I took them <br/>\nto the library *very* often (and from a very early age) and read to <br/>\nthem often. We went to museums, we got memberships in zoos and art <br/>\nmuseums and went to science clubs and art classes and endless Scouting <br/>\nevents. We drove endless miles to thousands of events and places and <br/>\nvolunteer activities and walks-in-the-woods. We heard presentations and <br/>\nlectures, we watched TV and movies and stars (both kinds) together, we <br/>\nlistened to talk radio and had discussions about it in the car, and we <br/>\nwent to plays and concerts. I indulged their every interest--no matter <br/>\nhow deep or shallow (IMO)--to the very best of my ability. We hosted <br/>\nforeign exchange students and traveled as much as we could afford. We <br/>\nshopped for car insurance and tomatoes and thrift-store clothes <br/>\ntogether, we had dinner discussions and no bedtimes (unless it began to <br/>\naffect others in the family &lt;g&gt;). We planted gardens and made compost. <br/>\nI passed on information about opportunities and believed in my <br/>\nchildren.....and loved them for who they were, uniquely. I tried to put <br/>\naside my goals for their lives and trusted that they would figure out <br/>\ntheir own worthy goals. I tried (but often failed) to be patient. I <br/>\nloved their dad, and he loved & supported all of us.<br/>\n<br/>\nWhat Matt did has been spectacular to witness. He blossomed, he <br/>\npursued, he reflected, he had patience with me. He *wanted* to do well <br/>\non the ACT so he did what he needed to to achieve that. He accomplishes <br/>\nwhat he puts his mind to--in all different areas of his life. He still <br/>\nblows my mind every day....unschooling blows my mind every day. I&#39;ve <br/>\nbeen doing it for all of his 17 years and I *still* don&#39;t understand <br/>\nit. But this many years later, I finally trust it most every day.<br/>\n<br/>\nThe Oklahoma Department of Education would have strung me up on truancy <br/>\ncharges without hesitation if they&#39;d known what was going on in our <br/>\nhome--it looks *nothing at all* like &quot;school&quot;--if they&#39;d had the chance <br/>\nor cared to pursue it. They just couldn&#39;t possibly understand.....they <br/>\nknow nothing about real learning....only about teaching.<br/>\n<br/>\nI don&#39;t know what Matt will do next in his life. It&#39;s often scary for <br/>\nme to think about, so I mostly don&#39;t. But I trust him to figure it out <br/>\nand I think he trusts we&#39;ll help him however he needs us to.<br/>\n<br/>\nMy daughters are also individuals, of course, and I honestly don&#39;t <br/>\nknow--nor care--how well they score on the ACT test. I have a feeling <br/>\nthat at least one of them will shine most strongly in areas not tested <br/>\nby those conventional means. And I trust them, too....hard as it is. <br/>\nThey&#39;re neat people.<br/>\n<br/>\nI know I tend to be too-evangelical about unschooling. (Evangelical: <br/>\ncharacterized by ardent or crusading enthusiasm; zealous &lt;g&gt;) I don&#39;t <br/>\nthink it&#39;s the answer for every family, but our family has experienced <br/>\nso many gifts through unschooling that we would have missed if I were <br/>\ntheir taskmaster teacher in addition to trying to be their loving <br/>\nmother....it&#39;s just too hard for me, personally, to be the latter to <br/>\nrisk it with the former. And I kept my faith that the former wasn&#39;t <br/>\nnecessary....even as a goal to &quot;a superior education.&quot;<br/>\n<br/>\nSo far, so good.<br/>\n<br/>\n--Leslie<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot;  <br/>\n~Frank Smith<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]}],"prevTopicId":14311,"nextTopicId":14316}}