{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":88180166,"authorName":"BillAndrea@aol.com","from":"BillAndrea@...","profile":"surpeti","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: please challenge my assumptions","postDate":"1090096762","msgId":2199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkLjRhZjI3OTFiLjJlMmFlODdhQGFvbC5jb20+"},"prevInTopic":2184,"nextInTopic":0,"prevInTime":2198,"nextInTime":2200,"topicId":2151,"numMessagesInTopic":0,"msgSnippet":"Thanks for all the encouraging feedback on our crossword puzzle foray.  It s true--glazed looks do signal loss of interest, but even better: when ds lost focus","messageBody":"<div id=\"ygrps-yiv-798270136\">Thanks for all the encouraging feedback on our crossword puzzle foray.  It&#39;s <br/>\ntrue--glazed looks do signal loss of interest, but even better: when ds lost <br/>\nfocus he would just start poking me with his pencil!  A clear sign.  But he <br/>\nkept going back to it all day.<br/>\n<br/>\nDs raced downstairs the next morning to start the x-word puzzle I had been <br/>\nordered to make up for him, did one word and then mysteriously lost interest.  <br/>\nMy last (and greatest) puzzle is languishing under the couch...I&#39;ll keep all <br/>\nthe really great ideas for extending his interest for such time as it becomes an <br/>\ninterest again.<br/>\n<br/>\nThis question of communicating passion continues to interest me.  I see that <br/>\nI *could* easily squelch ds&#39;s interests by my own lack of interest.  Example: <br/>\nhe is into dramatic play around pirates and, more recently, knights, so I got <br/>\nhim some foam-type swords I saw.  Of course I was pressed into service but I <br/>\njust was such a wussy--I just didn&#39;t know how to get into swordfighting--I <br/>\ncould tell it was underwhelming and not very fun.  Fortunately when dh came home <br/>\nan incredibly rousing battle was fought, one that even I (now in a more <br/>\ncomfortable role as queen) started getting into.  With older children who are more <br/>\nindependent, I can see it&#39;s not necessary to have the same interests, just help <br/>\nthem get the resources they need to pursue them.  But when you&#39;re 4 and your <br/>\nmom sucks at being a knight (and you live kind of far from your friends), <br/>\nwhat&#39;s a kid to do?  Am I sending messages that this is not a &quot;good&quot; interest?  <br/>\nBecause I don&#39;t mean to do that.<br/>\n<br/>\nAlso, re: the line between communicating passion and having an agenda:  <br/>\nBefore finding this list, I purchased some children&#39;s French language videos for <br/>\nds.  Clearly my idea, so not a very unschooling thing to do.  But again, I have <br/>\na dear mentor who is French, I studied it in school and thought it would be <br/>\nfun to get back into.  Since ds&#39;s screen time was pretty restricted pre-list <br/>\n(and still is, though less so), he was amazed that Mom was *letting* him watch <br/>\nthese videos.  He thinks they are great and now a lot of our imaginative play <br/>\nconcerns the characters therein (he usually says stuff in English and I reply in <br/>\nFrench).  He *loves* playing Corvax (the bad guy) and it actually seems to be <br/>\na way for him to work out some aggression issues.  So, I can tell he <br/>\ndefinitely resonates with this but then, his choices have been limited in some ways.  <br/>\nStill, even with videos, there are some he *doesn&#39;t* care for so it&#39;s not like <br/>\nhe&#39;ll take anything just because his access has been relatively limited.  <br/>\nMaybe I just lucked into pushing an agenda he was interested in anyway??  Any <br/>\nthoughts on this whole topic?<br/>\n<br/>\nI will say that he doesn&#39;t actually watch the videos much any more--he <br/>\nprefers the imaginative play.  And when he does watch, he has lately been watching <br/>\nthem in English (which was included I guess for the parents&#39; sake).  I have <br/>\nsome trouble biting my tongue--I spent the $$ so he&#39;d watch the French <br/>\nversion!!!--but I do realize that it was *my* idea anyway.  I guess I put it out there <br/>\nwith the French agenda, and he took it but with an <br/>\nimaginative-play-about-bad-guys agenda....Funny how you can get what you need from things.  BTW he does <br/>\nlike to sprinkle French words in our conversations and especially likes that in <br/>\nFrench your toes are &quot;the fingers of your feet.&quot;<br/>\n<br/>\nThank you all for letting me explore my own thoughts and giving me yours!<br/>\nAndrea<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] please challenge my assumptions","postDate":"1090029792","msgId":2184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExOC4zNTU3YTg5My4yZTI5NGRhN0Bhb2wuY29tPg=="},"prevInTopic":2168,"nextInTopic":2199,"prevInTime":2183,"nextInTime":2185,"topicId":2151,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-725489477\">&lt;&lt;&lt;&lt;I&#39;m sure this little thing won&#39;t last forever and it is so okay with me<br/>\nthat <br/>\nhis interest wanes  (whew! I&#39;m running out of short phonetic words I can<br/>\ndraw <br/>\nanyway) but I&#39;m not clear about the phonetic aspect.  As I said, I have a<br/>\nword <br/>\npassion that I&#39;m sure I communicate; there&#39;s tons of history implicit in <br/>\nwhich words are phonetic and which aren&#39;t--I could go on and on.  We are<br/>\ntruly <br/>\nhaving a joyful time with it, but am I inserting my own agenda here??  So I <br/>\nthought I&#39;d put this out there for those who can detect/challenge<br/>\nassumptions <br/>\nreally well.  Please have at it!&gt;&gt;&gt;&gt;<br/>\n<br/>\nSorry to disappoint you, but it sounds like you have absolutely zero to<br/>\nworry about. Even if you have to repeat words periodically. <br/>\n<br/>\nKeep having fun and take your cue for ds and his enjoyment level.<br/>\n<br/>\nI&#39;d love to see some of the puzzles you have made.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.721 / Virus Database: 477 - Release Date: 7/16/2004</div>","specialLinks":[]},{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: please challenge my assumptions","postDate":"1090024370","msgId":2168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkOXMzaStrbTZuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExOC4zNTU3YTg5My4yZTI5NGRhN0Bhb2wuY29tPg=="},"prevInTopic":2158,"nextInTopic":2184,"prevInTime":2167,"nextInTime":2169,"topicId":2151,"numMessagesInTopic":0,"msgSnippet":"When someone is sharing a passion and someone else glazzzzzes over, then it s your own agenda. Otherwise, I think it is the joy of being able to communicate","messageBody":"<div id=\"ygrps-yiv-1095840153\">When someone is sharing a passion and someone else glazzzzzes over, <br/>\nthen it&#39;s your own agenda. Otherwise, I think it is the joy of being <br/>\nable to communicate with language. What is the point of learning <br/>\nwords and how to spell other than to share your thoughts, interests <br/>\nand journey with others.<br/>\n<br/>\nSounds like fun. <br/>\n<br/>\nThe other difference is that it is not mandatory for him to continue <br/>\nthis IF he indicates a lack of interest. I find myself wondering &quot;did <br/>\nI make him do it?&quot; too but we have never used any rewards or <br/>\npunishments, so I have to remember that &quot;make&quot; is my own experience <br/>\nand filter of the world. I am just sensitive not to imply no choice. <br/>\nBut asking repeatedly &quot;are you sure you want to do this?&quot; can beg the <br/>\nanswer &quot;maybe I don&#39;t&quot;. Listening to a child was not modelled for me <br/>\nso I try to remember: would I be comfortable having an adult interact <br/>\nthis way with me? <br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BillAndrea@a... wrote:<br/>\n&gt; Hi all<br/>\n&gt; <br/>\n&gt; We are in the middle of something wonderful for ds (4.5yo).  I want <br/>\nto make <br/>\n&gt; it even more joyful if possible, so I&#39;d like to get feedback on <br/>\nwhere (if at <br/>\n&gt; all) I am falling back on schooling notions and how to push this <br/>\neven further in <br/>\n&gt; the direction of joyful learning.<br/>\n&gt; <br/>\n&gt; My sis habitually mails me the Sunday crossword puzzle from my old <br/>\nhometown <br/>\n&gt; newspaper.  Ds has shown interest in the past and wanted to put <br/>\nletters in the <br/>\n&gt; squares, so this time I asked if he&#39;d like me to make him his own <br/>\ncrossword <br/>\n&gt; and he could do his while I did mine.  He was thrilled with this <br/>\nsuggestion.  I <br/>\n&gt; drew pictures for clues and used only phonetic words (more on <br/>\nthis).  He had a <br/>\n&gt; blast and I wound up making about 10 of these, at his insistence, <br/>\nthroughout <br/>\n&gt; the day (& had to promise to make one for him to wake up to in the <br/>\nmorning).  <br/>\n&gt; Needless to say I got little chance to do my own puzzle!<br/>\n&gt; <br/>\n&gt; We worked them out together.  He usually got the picture clues <br/>\nright away, <br/>\n&gt; then we would puzzle out how the word might be spelled by sounding <br/>\nit out.  I <br/>\n&gt; did it that way because he was given a &quot;workbook&quot; (not by me) that <br/>\nhe *loved* <br/>\n&gt; (to my surprise).  There was a lot of &quot;insert the middle letter&quot; of <br/>\n3-letter <br/>\n&gt; phonetic-type words in there.  Also, building on that, I got him <br/>\nsome Bob books <br/>\n&gt; (the first ones are completely phonetic) which he has from time to <br/>\ntime been <br/>\n&gt; passionate about (and then leaves for weeks and that is okay with <br/>\nme).  Anyway, <br/>\n&gt; I was aware that the sounding out part was (1) fun for both of us <br/>\n(I have such <br/>\n&gt; a passion for words and sounds that I&#39;m actually fascinated by <br/>\nsounding out <br/>\n&gt; b-u-s) AND (2) seemed pretty &quot;schoolish.&quot;  When dh came home and <br/>\nwas coopted <br/>\n&gt; into this, I noticed that he would simply tell ds how to spell the <br/>\nword once ds <br/>\n&gt; figured out the picture-clue.  Ds did not object to this.  So, <br/>\nthough he <br/>\n&gt; seemed to have fun doing the sounding out (just as another part of <br/>\nthe game of <br/>\n&gt; figuring the whole thing out), he didn&#39;t care if that part wasn&#39;t <br/>\nthere either.  <br/>\n&gt; (By the way, dh is a notoriously poor speller and I used to be a <br/>\n&gt; copyeditor--hmmm.)<br/>\n&gt; <br/>\n&gt; I&#39;m sure this little thing won&#39;t last forever and it is so okay <br/>\nwith me that <br/>\n&gt; his interest wanes  (whew! I&#39;m running out of short phonetic words <br/>\nI can draw <br/>\n&gt; anyway) but I&#39;m not clear about the phonetic aspect.  As I said, I <br/>\nhave a word <br/>\n&gt; passion that I&#39;m sure I communicate; there&#39;s tons of history <br/>\nimplicit in <br/>\n&gt; which words are phonetic and which aren&#39;t--I could go on and on.  <br/>\nWe are truly <br/>\n&gt; having a joyful time with it, but am I inserting my own agenda <br/>\nhere??  So I <br/>\n&gt; thought I&#39;d put this out there for those who can detect/challenge <br/>\nassumptions <br/>\n&gt; really well.  Please have at it!<br/>\n&gt; <br/>\n&gt; Thanks.<br/>\n&gt; Andrea S. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] please challenge my assumptions","postDate":"1089997456","msgId":2158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGUwMWM0NmI1NiRlZGNjZDRjMCQ2NDAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDExOC4zNTU3YTg5My4yZTI5NGRhN0Bhb2wuY29tPg=="},"prevInTopic":2152,"nextInTopic":2168,"prevInTime":2157,"nextInTime":2159,"topicId":2151,"numMessagesInTopic":0,"msgSnippet":"I m not in any way holding myself out as an expert, but here are my thoughts.  If you made up 10 more puzzles tonight and tomorrow morning he said he d rather","messageBody":"<div id=\"ygrps-yiv-619750976\">I&#39;m not in any way holding myself out as an expert, but here are my thoughts.  If you made up 10 more puzzles tonight and tomorrow morning he said he&#39;d rather [insert conventionally non-educational activity here], and you could, as you said, say, Ok quite joyfully (and maybe even rejoice in having some time to do your own puzzle), then I think you are not inserting your own agenda.<br/>\n<br/>\nIf your 4.5 yo hasn&#39;t been to school or school-at-home, then I think you can trust his reactions of what he says he likes and doesn&#39;t like much more readily than if at some point he had been exposed to what the &quot;right&quot; answers were to what he &quot;should&quot; like.  <br/>\n<br/>\nCommunicating passion is part of what makes the world interesting to me.  Even a subject that I wouldn&#39;t own my own find fascinating (say, subtle differences in fish genotypes) can be quite fascinating to hear my brother the ichthyologist talk about.  <br/>\n<br/>\nAs for continuing/extending the fun --What I tend to do is to think about what my daughter is enjoying about the activity and then propose another activity that has that thing in common.  <br/>\n<br/>\n If what he likes is the interlocking words puzzle part: do you think he would like to make up his own puzzles - maybe he could use scrabble tiles or boggle dice to put together words in a puzzle for you to solve with phonetic spelling, or he could ask his father to help make one for you or you to make one for his father.  Or if you gave him some words with common letters written out large on pieces of card, he could rearrange them to make an interlocking puzzle.  <br/>\n<br/>\nIf what he likes is the complete or figure out the word part, the Reader Rabbit computer games have a lot of those kinds of games in the kindergarten and first grade (their descriptions) games.  My daughter likes those.  <br/>\n<br/>\nMaybe talk about what languages words can come from, if he finds that part interesting?  Lydia likes words that are the same or similar in more than one language - she&#39;s particularly fond of bicycle in Italian -- bicicylette (dont&#39; have a dictionary handy to look up the spelling of that). <br/>\n<br/>\nI think there is something joyful anytime that we feel that someone &quot;gets&quot; our interest -- that feeling of being understood and supported.  I think our kids feel that whenever they feel that we are thinking about what interests them and genuinely offering support with no ulterior motives. <br/>\n<br/>\n-Cat <br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BillAndrea@...\">BillAndrea@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, July 16, 2004 11:26 AM<br/>\n  Subject: [unschoolingbasics] please challenge my assumptions<br/>\n<br/>\n<br/>\n  Hi all<br/>\n<br/>\n  We are in the middle of something wonderful for ds (4.5yo).  I want to make <br/>\n  it even more joyful if possible, so I&#39;d like to get feedback on where (if at <br/>\n  all) I am falling back on schooling notions and how to push this even further in <br/>\n  the direction of joyful learning.<br/>\n   <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] please challenge my assumptions","postDate":"1089992438","msgId":2152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjNS4xYjIxOTQ3NC4yZTI5NTBmNkBhb2wuY29tPg=="},"prevInTopic":2151,"nextInTopic":2158,"prevInTime":2151,"nextInTime":2153,"topicId":2151,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/16/2004 11:31:40 AM Eastern Daylight Time, BillAndrea@aol.com writes: I m sure  this little thing won t last forever and it is so okay","messageBody":"<div id=\"ygrps-yiv-247747410\">In a message dated 7/16/2004 11:31:40 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BillAndrea@...\">BillAndrea@...</a> writes:<br/>\n<br/>\nI&#39;m sure  this little thing won&#39;t last forever and it is so okay with me that <br/>\nhis  interest wanes  (whew! I&#39;m running out of short phonetic words I can <br/>\ndraw  <br/>\nanyway) but I&#39;m not clear about the phonetic aspect.  As I said, I  have a <br/>\nword <br/>\npassion that I&#39;m sure I communicate; there&#39;s tons of history  implicit in <br/>\nwhich words are phonetic and which aren&#39;t--I could go on and  on. <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;<br/>\n <br/>\nSounds fun. One thing that he might like is to know that sometimes &quot;ph&quot;  <br/>\nmakes the &quot;f&quot; sound----so you can insert an word that shows that. Or  that &quot;c&quot; can <br/>\nmake the &quot;s&quot; or the &quot;k&quot; sound----or &quot;ch&quot;. Making it fun with  only *one* <br/>\nweird sound at a time.<br/>\n <br/>\nHaving two &quot;styles&quot;----yours and your husband&#39;s  to call on is  great.<br/>\n <br/>\nIt may be a passion that lasts forever or only a day----either way, he&#39;s  <br/>\ngetting something out of it.<br/>\n <br/>\nHave fun!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":88180166,"authorName":"BillAndrea@aol.com","from":"BillAndrea@...","profile":"surpeti","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"please challenge my assumptions","postDate":"1089991591","msgId":2151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExOC4zNTU3YTg5My4yZTI5NGRhN0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":2152,"prevInTime":2150,"nextInTime":2152,"topicId":2151,"numMessagesInTopic":0,"msgSnippet":"Hi all We are in the middle of something wonderful for ds (4.5yo).  I want to make it even more joyful if possible, so I d like to get feedback on where (if at","messageBody":"<div id=\"ygrps-yiv-1356206775\">Hi all<br/>\n<br/>\nWe are in the middle of something wonderful for ds (4.5yo).  I want to make <br/>\nit even more joyful if possible, so I&#39;d like to get feedback on where (if at <br/>\nall) I am falling back on schooling notions and how to push this even further in <br/>\nthe direction of joyful learning.<br/>\n<br/>\nMy sis habitually mails me the Sunday crossword puzzle from my old hometown <br/>\nnewspaper.  Ds has shown interest in the past and wanted to put letters in the <br/>\nsquares, so this time I asked if he&#39;d like me to make him his own crossword <br/>\nand he could do his while I did mine.  He was thrilled with this suggestion.  I <br/>\ndrew pictures for clues and used only phonetic words (more on this).  He had a <br/>\nblast and I wound up making about 10 of these, at his insistence, throughout <br/>\nthe day (& had to promise to make one for him to wake up to in the morning).  <br/>\nNeedless to say I got little chance to do my own puzzle!<br/>\n<br/>\nWe worked them out together.  He usually got the picture clues right away, <br/>\nthen we would puzzle out how the word might be spelled by sounding it out.  I <br/>\ndid it that way because he was given a &quot;workbook&quot; (not by me) that he *loved* <br/>\n(to my surprise).  There was a lot of &quot;insert the middle letter&quot; of 3-letter <br/>\nphonetic-type words in there.  Also, building on that, I got him some Bob books <br/>\n(the first ones are completely phonetic) which he has from time to time been <br/>\npassionate about (and then leaves for weeks and that is okay with me).  Anyway, <br/>\nI was aware that the sounding out part was (1) fun for both of us (I have such <br/>\na passion for words and sounds that I&#39;m actually fascinated by sounding out <br/>\nb-u-s) AND (2) seemed pretty &quot;schoolish.&quot;  When dh came home and was coopted <br/>\ninto this, I noticed that he would simply tell ds how to spell the word once ds <br/>\nfigured out the picture-clue.  Ds did not object to this.  So, though he <br/>\nseemed to have fun doing the sounding out (just as another part of the game of <br/>\nfiguring the whole thing out), he didn&#39;t care if that part wasn&#39;t there either.  <br/>\n(By the way, dh is a notoriously poor speller and I used to be a <br/>\ncopyeditor--hmmm.)<br/>\n<br/>\nI&#39;m sure this little thing won&#39;t last forever and it is so okay with me that <br/>\nhis interest wanes  (whew! I&#39;m running out of short phonetic words I can draw <br/>\nanyway) but I&#39;m not clear about the phonetic aspect.  As I said, I have a word <br/>\npassion that I&#39;m sure I communicate; there&#39;s tons of history implicit in <br/>\nwhich words are phonetic and which aren&#39;t--I could go on and on.  We are truly <br/>\nhaving a joyful time with it, but am I inserting my own agenda here??  So I <br/>\nthought I&#39;d put this out there for those who can detect/challenge assumptions <br/>\nreally well.  Please have at it!<br/>\n<br/>\nThanks.<br/>\nAndrea S. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":2187,"nextTopicId":2202}}