{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":68,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Radical Unschooling...?","postDate":"1333149689","msgId":48169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDNTIzNUMwLTQ0MkYtNDM4Ri05RUMwLTU4NTIwOTg5NjkyOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsNTF1dCs2YWdsQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsNTF1dCs2YWdsQGVHcm91cHMuY29tPg=="},"prevInTopic":48168,"nextInTopic":48170,"prevInTime":48168,"nextInTime":48170,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... But you framed it as a question. If he can t say no, then it s not a question. It s phrased in a way that fools the mom into believing she s being polite.","messageBody":"<div id=\"ygrps-yiv-248512896\">On Mar 30, 2012, at 3:35 PM, lindaguitar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There were times that I&#39;d say to my son, &quot;N, will you please unload the dishwasher?&quot;,<br/>\n&gt; and he&#39;d say &quot;Do I have to?&quot;, and I&#39;d say, &quot;Yes; ...&quot;<br/>\n<br/>\n </span></blockquote>But you framed it as a question. If he can&#39;t say no, then it&#39;s not a question. It&#39;s phrased in a way that fools the mom into believing she&#39;s being polite. Which is why it&#39;s hard to understand kids&#39; reactions. *They&#39;re* responding to being conscripted for labor.<br/>\n<br/>\nIf a mom isn&#39;t comfortable phrasing a need for help as a statement then it&#39;s best for relationships to rethink. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Even before I became disabled by osteoarthritis, to the point<br/>\n&gt; where I can barely stand or walk, I had chronic back pain,<br/>\n&gt; and did not have the energy to do it all myself.<br/>\n<br/>\n </span></blockquote>But it doesn&#39;t sound like you brought them into the process. You saw what you wanted done and you saw hands you could use to get it done.<br/>\n<br/>\nIf it&#39;s an ongoing problem, its easier to get willing help by drawing people into the problem solving rather than seeing them as free labor for your solutions. People put more energy into problems and solutions they feel they own. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And, really, I still don&#39;t think it was unreasonable<br/>\n&gt; of me to insist that the kids help out.<br/>\n<br/>\n </span></blockquote>It&#39;s not unreasonable but it&#39;s part of human nature that if someone is dragging us to see the world through their eyes so they can get us to do something they want us to do, that we&#39;re going to fight against the forced view point and fight against the forced labor.<br/>\n<br/>\nIt&#39;s easier to get people to help by retaining full responsibility for a task and then working from their view point, accepting that when people feel they can say no, they&#39;ll be more willing to help if they say yes.<br/>\n<br/>\nAnd it&#39;s easier especially to get kids to help by seeing through their eyes because they truly can&#39;t see adult views until they&#39;re adults. No matter how much sense the adult view seems to an adult, a child isn&#39;t an adult. They don&#39;t have -- can&#39;t have really -- the same priorities. They can only operate from the priorities and views of children.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; kids who are treated with respect and courtesy, and whose rights<br/>\n&gt; as people are honored, do grow up to be helpful and take on their<br/>\n&gt; share of household maintenance willingly, I think. <br/>\n<br/>\n </span></blockquote>They definitely grow up to be helpful, which is what I&#39;ve seen happen over 20 years in families who have done this.<br/>\n<br/>\nBut whether or not they share in the household maintenance will be more a matter of personalities rather than having been treated with respect. <br/>\n<br/>\nThe dynamic of a child brought into a family isn&#39;t the same as someone who has joined a group voluntarily. The dynamic is really closer to a guest than a partner just because they&#39;ve grown up dependent on their parents. And that dynamic doesn&#39;t stop just because a child turns a certain age. My daughter was always willing to help when I asked. But she&#39;d get focused on her projects and the house was below her radar. It isn&#39;t her house so that isn&#39;t surprising. But now that she&#39;s on her own, she sees the things that need done and does them because they&#39;re her tasks and her place.<br/>\n<br/>\nA parent might be able to draw a child in so the child feels nearly as much ownership of the tasks as the parent, but, like I said, that will be far more dependent on personality of the parent and the child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It was their clothes, and their choice when and whether to have clean clothes. <br/>\n<br/>\n </span></blockquote>Again, whether the kids feel that&#39;s right will depend on personality. For many kids being taken care of feels like love. To say in effect that you won&#39;t take care of their needs is going to feel like a withdrawal of love.<br/>\n<br/>\nNot for every child, but it&#39;s something that&#39;s more likely to move away from building great relationships than toward it.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333145535","msgId":48168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsNWIzditnZzhkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsNTF1dCs2YWdsQGVHcm91cHMuY29tPg=="},"prevInTopic":48167,"nextInTopic":48169,"prevInTime":48167,"nextInTime":48169,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... *************** Ah, the question-that s-not-a-question! There have been times when I really needed a hand with something - and when George was injured","messageBody":"<div id=\"ygrps-yiv-1927873524\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;There were times that I&#39;d say to my son, &quot;N, will you please unload the dishwasher?&quot;, and he&#39;d say &quot;Do I have to?&quot;, and I&#39;d say, &quot;Yes;<br/>\n </span></blockquote>***************<br/>\n<br/>\nAh, the question-that&#39;s-not-a-question! There have been times when I really needed a hand with something - and when George was injured times when he really needed help. Then we didn&#39;t ask - we were polite, but didn&#39;t make it a pretend question: Ray, please bring in more firewood. But those sorts of things George and I both try to keep to a minimum.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Radical Unschooling...?","postDate":"1333144722","msgId":48167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsNWFhaSt0dGk3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsNG1iMytxZHFpQGVHcm91cHMuY29tPg=="},"prevInTopic":48164,"nextInTopic":48168,"prevInTime":48166,"nextInTime":48168,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... **************** Keep in mind that he doesn t have as much time to practice. He could be 100% in agreement in theory, but still lag way behind in actual","messageBody":"<div id=\"ygrps-yiv-488269418\">&quot;jenuhferr&quot; &lt;jenuhferr@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;ve tried to help him understand what is happening and i&#39;m trying to go slow and i think i have been. I printed up a few pages of Sandra and Joyce :) and put one copy in each bathroom a while ago. It did work but i think in practice it&#39;s not really working.<br/>\n </span></blockquote>****************<br/>\n<br/>\nKeep in mind that he doesn&#39;t have as much time to practice. He could be 100% in agreement in theory, but still lag way behind in actual skills simply because he&#39;s not home as many hours as you are. Often what happens with dads who Want to unschool (and by &quot;dads&quot; here I mean &quot;parent who works out of the home&quot;... which sort of makes me the dad in my home ;)) is they take a lot longer to catch on, but then seem to do so really fast. Give him time. <br/>\n<br/>\nAlso, remember that it&#39;s much harder to learn with a critical audience - so be careful not to Be a critical audience. Loving up on your husband more will help him feel less like he&#39;s under surveillance in his own home. <br/>\n<br/>\nOh! it can also help to have one clean space in the house - a real challenge at the end of an unschooling day, I know! But especially if the area around the front door is clean, that can help the &quot;I&#39;m home&quot; transition go more smoothly. That was something I didn&#39;t realize until I became the breadwinner of the family - it really makes a difference to how I feel about coming into my house if I walk into chaos directly or have a little bit of a buffer. With that buffer, I can take a breath and then look around at the evidence of a full, fun unschooling day, spread out all over the house with a smile: ah! that&#39;s what I worked so hard for all day: natural learning. Without that buffer, it&#39;s more like &quot;I worked my buns off for This?&quot; George, having been on the other side, understands. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Radical Unschooling...?","postDate":"1333142718","msgId":48164,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsNThidSthOXFuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDAwMWNkMGUwNSQwMWNiNzlmMCQwNTYyNmRkMCRAbmV0Pg=="},"prevInTopic":48163,"nextInTopic":48167,"prevInTime":48163,"nextInTime":48165,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... Gifts of time and thoughtfulness. Moments of welcome and invitation. The joy of watching children be sweet and generous on their own terms and growing into","messageBody":"<div id=\"ygrps-yiv-1463192741\">Lisa Dixon &lt;lddixon@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Could you give an example of what you would replace chores with?<br/>\n<br/>\n </span></blockquote>Gifts of time and thoughtfulness. Moments of welcome and invitation. The joy of watching children be sweet and generous on their own terms and growing into the awareness of how to be sweet and generous in ways meaningful to other people. The peace of never having to argue or coerce, threaten, or reward. The assurance that you won&#39;t have to spend half a day coaxing another person to do a job you could do in a quarter the time, and then maybe have to re-do it anyway.<br/>\n<br/>\nIt can help to consider what chores are about - what you think they do. They exist as a kind of teaching tool, but like all teaching tools, the effectiveness depends wholly on the interest in the person being taught. When we were homeschooling Ray and wanted him to wash dishes, he did it badly. After we stopped requiring him to do dishes, he stopped, and then eventually started doing dishes again - and did it well. When kids who have chores are kind and helpful, it&#39;s because they choose to do so, not because they&#39;ve been made to do things they dislike. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/\">http://sandradodd.com/chores/</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Radical Unschooling...?","postDate":"1333142032","msgId":48163,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzMxNDIwMzIuNDQ1NTIuWWFob29NYWlsTmVvQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpsNTF1dCs2YWdsQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMmNrdSt0cG1mQGVHcm91cHMuY29tPiA8amw1MXV0KzZhZ2xAZUdyb3Vwcy5jb20+"},"prevInTopic":48162,"nextInTopic":48164,"prevInTime":48162,"nextInTime":48164,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... and making it a punishment, and just being somewhat insistent about needing and expecting some help from everyone who lives in the house. I was generally","messageBody":"<div id=\"ygrps-yiv-1328025627\"><blockquote><span title=\"ireply\">&gt;&gt;I guess, to me, there&#39;s a big difference between being nasty about it <br/>\n </span></blockquote>and making it a punishment, and just being somewhat insistent about <br/>\nneeding and expecting some help from everyone who lives in the house. I <br/>\nwas generally polite about it; I made a point of saying please, and <br/>\nthank you after they had done it. But, looking back, I do remember that <br/>\nmy son (and even my daughter, occasionally) acted like they felt a bit <br/>\n&quot;put upon&quot;. There were times that I&#39;d say to my son, &quot;N, will you please unload the dishwasher?&quot;, and he&#39;d say &quot;Do I have to?&quot;, and I&#39;d say, <br/>\n&quot;Yes; I need to get the dirty dishes in there so that the I have the <br/>\nsink and counter clear, so that I can make dinner!&quot; Even before I became disabled by osteoarthritis, to the point where I can barely stand or <br/>\nwalk, I had chronic back pain, and did not have the energy to do it all <br/>\nmyself. And, really, I still don&#39;t think it was unreasonable of me to <br/>\ninsist that the kids help out. But I think sometimes they did. And I <br/>\nknow that an able-bodied radical unschooling mom would do it all by <br/>\nherself if the kids didn&#39;t feel like helping. &lt;&lt;<br/>\n<br/>\n<br/>\nI don&#39;t have any debiliating illness. Sometimes I get a headache, sometimes I&#39;m tired, but mostly I&#39;m a pretty healthy and able-bodied woman. That said, both Simon and Linnaea are happy to help when I need help. I know a number of unschooling children who are more than willing to step up to the plate when they are needed. They are able to see how their parents are working to help them and are willing to go the extra mile in response. Without it being required, without it being forced upon them. It helps in those households where a parent&#39;s illness or incapicitation is buffered by other people coming in to help, or by a lowering of the parents expectations. Paper plates and cups makes dinner dishes easier. Filling a sink with soapy water to let the dishes soak makes moving through the dinner dishes faster. On nights when you are too tired and your children are otherwise engaged, ordering a pizza or making something easy from frozen makes dishes less an<br/>\n issue. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;There were times that I&#39;d say to my son, &quot;N, will you please unload the dishwasher?&quot;, and he&#39;d say &quot;Do I have to?&quot;, and I&#39;d say, <br/>\n </span></blockquote>&quot;Yes; I need to get the dirty dishes in there so that the I have the <br/>\nsink and counter clear, so that I can make dinner!&lt;&lt; <br/>\n<br/>\n<br/>\nIf it isn&#39;t a question that they can answer with a no, don&#39;t ask it as a yes or no question. Say N, I need you to do the dishes so that I can make dinner. If you have a way of making it possible for him to say no, then it really works as a yes or no question, otherwise, please and thank you and a question mark inflection just dress up a command. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I taught my kids to do their own laundry when they were about 9 and 11. <br/>\n </span></blockquote>After that, I would occasionally ask them &quot;Do you need to do some <br/>\nlaundry, so you&#39;ll have clean clothes tomorrow?&quot; But that was not an <br/>\nissue that I felt that I had to insist on. It was their clothes, and <br/>\ntheir choice when and whether to have clean clothes.&lt;&lt;<br/>\n<br/>\nOf course, as their parent, it is your responsibility to keep them in clean clothes, or, certainly, clean for a given range of clean. And it is a generous and a good act to figure out how to do that. Simply showing someone how to do the laundry doesn&#39;t mean that you are no longer responsible for their wellbeing, nor that you are incapable of helping them out when they need help.<br/>\n<br/>\n<br/>\nSo, as I said, I am coming from a position of relative privilege, of able-bodiedness when I say that I completely agree with your statement &quot;kids who <br/>\nare treated with respect and courtesy, and whose rights as people are <br/>\nhonored, do grow up to be helpful and take on their share of household <br/>\nmaintenance willingly&quot;. The other things in your post only hamper someone growing into their own generous and considerate selves. And they don&#39;t let you really see them choose to be generous: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/tales.\">http://sandradodd.com/chores/tales.</a> The true spontaneous gift of someone else choosing when and how they will be generous and helpful only comes from not having a requirement, a chore. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Radical Unschooling...?","postDate":"1333136157","msgId":48162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsNTF1dCs2YWdsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsMmNrdSt0cG1mQGVHcm91cHMuY29tPg=="},"prevInTopic":48161,"nextInTopic":48163,"prevInTime":48161,"nextInTime":48163,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... Wow, that sounds like the sort of long-term, stressful, anxiety-producing parenting that could almost leave a person with something like PTSD! To me, it","messageBody":"<div id=\"ygrps-yiv-1549559375\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Melissa J&quot; &lt;mnjenkins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... ANYWAY. Chores are an interesting thing. My mother was nasty<br/>\n&gt; about it. She made them a punishment. They were also something that<br/>\n&gt; completely replaced all of Saturday and almost every free hour of<br/>\n&gt; time throughout the week, ... Often, when I was at school my mother<br/>\n&gt; would comb through my room and throw my things away. <br/>\n<br/>\n </span></blockquote>Wow, that sounds like the sort of long-term, stressful, anxiety-producing parenting that could almost leave a person with something like PTSD! To me, it sounds like slavery. So, kudos to you for doing whatever you can to try to come up with a healthier way to manage your household now. It sounds like you are doing a great job of not putting that kind of stress on your kids.<br/>\n<br/>\nNow, after reading what you wrote, I worry that I may have made it sound like I was that forceful or harsh with my kids about chores, when I said that I insisted that they do some. I guess, to me, there&#39;s a big difference between being nasty about it and making it a punishment, and just being somewhat insistent about needing and expecting some help from everyone who lives in the house. I was generally polite about it; I made a point of saying please, and thank you after they had done it. But, looking back, I do remember that my son (and even my daughter, occasionally) acted like they felt a bit &quot;put upon&quot;. There were times that I&#39;d say to my son, &quot;N, will you please unload the dishwasher?&quot;, and he&#39;d say &quot;Do I have to?&quot;, and I&#39;d say, &quot;Yes; I need to get the dirty dishes in there so that the I have the sink and counter clear, so that I can make dinner!&quot; Even before I became disabled by osteoarthritis, to the point where I can barely stand or walk, I had chronic back pain, and did not have the energy to do it all myself. And, really, I still don&#39;t think it was unreasonable of me to insist that the kids help out. But I think sometimes they did. And I know that an able-bodied radical unschooling mom would do it all by herself if the kids didn&#39;t feel like helping. And, generally, kids who are treated with respect and courtesy, and whose rights as people are honored, do grow up to be helpful and take on their share of household maintenance willingly, I think. <br/>\n<br/>\nI taught my kids to do their own laundry when they were about 9 and 11. After that, I would occasionally ask them &quot;Do you need to do some laundry, so you&#39;ll have clean clothes tomorrow?&quot; But that was not an issue that I felt that I had to insist on. It was their clothes, and their choice when and whether to have clean clothes. <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333134317","msgId":48161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCRkE3QTYzLTZBODctNEU4Qy05OTE1LTZBMEZGRjNGQzQ4RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsNG1iMytxZHFpQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsNG1iMytxZHFpQGVHcm91cHMuY29tPg=="},"prevInTopic":48160,"nextInTopic":48162,"prevInTime":48160,"nextInTime":48162,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... The whole list of what he could do sounds dismissive of what he s saying. What it says is I want to do this unschooling thing. And any problems it causes","messageBody":"<div id=\"ygrps-yiv-939066197\">On Mar 30, 2012, at 12:17 PM, jenuhferr wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He says things like he just wants the day to end.<br/>\n&gt; I try to explain that if he needs to relax alone that he should do it.  ...<br/>\n&gt; Or he can bury his head in his laptop and work and try to escape like he has been. :-/<br/>\n<br/>\n </span></blockquote>The whole list of what he could do sounds dismissive of what he&#39;s saying. What it says is &quot;I want to do this unschooling thing. And any problems it causes you are up to you to solve.&quot;<br/>\n<br/>\nIf home isn&#39;t feeling like a haven for him, a nice quiet bar might start looking a lot more appealing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve tried to help him understand what is happening<br/>\n<br/>\n </span></blockquote>And if he joined a church that caused upheaval in your life and he tried to get you to think like him instead of making the change as painless as possible for you since he knew you weren&#39;t entirely sold, how would you react? Would you embrace learning more about this irritating religion? Would you want to do it for someone who apparently cares more about his new ideas than he does about how you feel about it?<br/>\n<br/>\nYou introduced the upheaval. You need to be the one easing the transition for the family or it&#39;s liable to backfire on you.<br/>\n<br/>\nSo how can you make evenings more peaceful for him and your daughter?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He still acts the same toward my daughter when he&#39;s home which <br/>\n&gt; could be confusing for her and makes me feel bad.<br/>\n<br/>\n </span></blockquote>Kids are pretty savvy that different people have different approaches.<br/>\n<br/>\nBut if a child were throwing a tantrum, the advice here wouldn&#39;t be &quot;Yes, you&#39;re right, your child is being unreasonable. You need to stop his tantrums right now.&quot;<br/>\n<br/>\nBe soothing to *him*. Treat him as gently as you are learning to treat your daughter. He&#39;s going to work every day so you can stay home and do this goofy thing that has introduced irritation into his evening. He could decide to go to work and not come home to the irritation.<br/>\n<br/>\nMake it less irritating for him. Make his life more peaceful so it&#39;s a place he wants to come home to.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":236160882,"authorName":"jenuhferr","from":"&quot;jenuhferr&quot; &lt;jenuhferr@...&gt;","profile":"jenuhferr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333124259","msgId":48160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsNG1iMytxZHFpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsMnA0NCszbHY5QGVHcm91cHMuY29tPg=="},"prevInTopic":48158,"nextInTopic":48161,"prevInTime":48159,"nextInTime":48161,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"Thank you Melissa and your reply Meredith. I was goong to post about this very issue. We re deschooling right now although our daughter seems to be there","messageBody":"<div id=\"ygrps-yiv-922770420\">Thank you Melissa and your reply Meredith. I was goong to post about this very issue. We&#39;re deschooling right now although our daughter seems to be &#39;there&#39; already which makes sense. The biggest roadblocks for me haven&#39;t really been the academic stuff it&#39;s more trying to silence the voices and judgment from an abusive authoritarian upbringing. That experience, i think, helped push me toward attachment parenting and now unschooling because i did not want that for my child. <br/>\n<br/>\nMy husband however came from a quiet, but somewhat emotionless home. His Mom is lovely but his Dad (coming from an upbringing like mine) is gentle but authoritative and he had a very long career in the public school system. When we started homeschooling that was the end of the good relationship i had with him.  This homeschooling stuff is apparently all my fault. My husband is jello and says he doesn&#39;t know what to say in my defense (how about &#39;shut up dad&#39;) because he doesn&#39;t know enough about homeschooling (now unschooling.) I can&#39;t WAIT until his dad finds out about unschooling. I&#39;m surely not going to tell him!<br/>\n<br/>\nMy husband is having a big problem with what he seems to see as chaos when he gets home from work. I explain to DD that daddy needs some time to relax and she totally understands. But the very loose (almost nonexistent now) bedtime is really upsetting for him. He says things like he just wants the day to end. I try to explain that if he needs to relax alone that he should do it. Or he can WATCH DD dance like a maniac and not dance WITH her. He can sit and play Legos. Or he can bury his head in his laptop and work and try to escape like he has been. :-/<br/>\n<br/>\nI&#39;ve tried to help him understand what is happening and i&#39;m trying to go slow and i think i have been. I printed up a few pages of Sandra and Joyce :) and put one copy in each bathroom a while ago. It did work but i think in practice it&#39;s not really working. I asked him last night in a serious sincere way if he wants to stop unschooling and he said no no. He still acts the same toward my daughter when he&#39;s home which could be confusing for her and makes me feel bad.<br/>\n<br/>\nThe advice given is going to be helpful i think. Trying to find a balance.<br/>\n<br/>\nThanks, Jen<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  &quot;Melissa J&quot; &lt;mnjenkins@&gt; wrote:<br/>\n&gt; &gt; he explained that he wanted time to unwind and spend those last few hours with me. I know he gets REALLY defensive about &#39;us&#39;.<br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; One of the traps that parents can fall into is lumping together a whole bunch of needs into one big lump: time to unwind, time for adult conversation, time for closeness, time for sex. If you&#39;re depending on the same hour-and-a-half a night for all of that, then that chunk of time seems reeeeeeaaaaalllly important.<br/>\n&gt; <br/>\n&gt;  The trouble is, kids aren&#39;t convenient ;) They want to learn at the Darnedest times, and they want to spend time with their parents at the darnedest times, too And kids get older and need less sleep! So that chunk of time can seem like a competition between dad and kids - with dad feeling like he needs to defend his &quot;time&quot; against all comers. Over time, that can be hard on relationships. Kids don&#39;t feel like they can count on their parents all the time, especially kids who are night owls... like many young teens!<br/>\n&gt; <br/>\n&gt; What can help is to spread out the ways you meet all those needs so that chunk of time doesn&#39;t feel so vital. Find small ways to connect - smiles, emails, phone calls, conversations that include kids or happen around kids. Help dad find ways to relax And be with the kids - watching tv or playing video games or reading a story, for instance. Help dad feels loved and valued - and sexy! in lots of small ways, with touches and pats, ambushes in the bathroom and pantry, naughty moments when the kids are too preoccupied to notice. Loving up on dads is a good way for them to feel a whole lot better about unschooling! They get to have some of the benefits of time and care and &quot;yes&quot; - and then they &quot;get&quot; why those things are helpful to kids. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333115708","msgId":48158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUyMEM0RURAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":48156,"nextInTopic":48160,"prevInTime":48157,"nextInTime":48159,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... And, too, make sure that you (the global you, the person who is wanting the change) are being as gentle, respectful, etc with your partner as you are with","messageBody":"<div id=\"ygrps-yiv-1273030064\"><blockquote><span title=\"ireply\">&gt; Perhaps I&#39;m projecting, that could be, but I know when I backed off talking to my husband and simply employed what respectful parenting approaches I could within his comfort zone, I could see the mood in the house changed.\r<br/>\n\r<br/>\n </span></blockquote>And, too, make sure that you (the global you, the person who is wanting the change) are being as gentle, respectful, etc with your partner as you are with your kids.  It’s important to treat the adults with the same mindful gentle respectfulness as we do the kids. That doesn’t always get talked about a lot simply because there’s usually a lot more ground to cover in relation to the kids because the traditional model is that adults are respectful to other adults but kids are kids and ‘have to’ do as the adults say and need to be ‘taught’ to ‘behave’. (I get a chuckle when I hear someone tell their kids to ‘behave’ - that’s easy, everyone is always behaving; sometimes they - adults or kids - are just behaving inappropriately!) But, if we’re tipping over the other side of the balance and putting the adult needs second, that’s not it either. It’s about balancing the wants, needs, etc of the entire household AS a household - not as one person juggling everyone. When DS was 3, 4, 5 years old, DH and I had a weekly date night - usually DS would spend a couple hours with MIL (he was her only grandkid until he was 5 so she loved spending time with the grandboy) - and sometimes we simply went home for some of that quiet cuddle time. By the time DS was about 7, we didn’t always have the date night - sometimes, we’d just let him know we were going upstairs for private time, to knock if he needed us, and we’d be down in a bit. Of course, it wasn’t long until he wanted to know what ‘private time’ was for - so I told him (he asked me directly) - sometimes we talk, sometimes we watch a movie that wasn’t an interesting one for him (often it’d be a romantic comedy type, DS is more a 007 kinda kid LOL), and sometimes we’d have sex. He said oh okay… And came back a few weeks later to get more info on “what exactly is sex?” LOL\r<br/>\n\r<br/>\nAnd, yeah, we do lots of those little bits of connection throughout the day - little two and three letter texts that only make sense to us (yes we have our own ‘text speak’); emails and voicemails; even something as simple and mundane as doing the dishes together (he washes, I dry and put up) is connecting. There’s a thing going around Facebook about marriage as an heirloom quilt with lots of tiny pieces stitched tightly together - and that seems to fit here as well. It’s about those little bits done frequently rather than necessarily having large chunks once a day. Hmm just had a thought, something that I used to do when DS was littler - I’m a list maker, so when I’ve got a Saturday full of things to get done, I make a list. Typical list might include ‘exciting’ things like clean toilets, sweep floors, grocery shopping, etc. But, there’d be things that DS wanted me to do with him, like watch a new episode of Spongebob that came on at 10 am. So, I’d write it right on my to-do list “watch Spongebob at 10 am” and I’d work the rest of the schedule around that because they had no specific time constraints. I’d also add things like “Hug DS” and “play Battleship”  and such. It acted as a reminder to me to slow down (I can get really wound up in ‘to do’ stuff) AND it let DS know that he was a priority. Same thing might be helpful for a hubby who may be feeling a bit like he’s going to get shoved aside if he doesn’t defend his space. Make daily ‘dates’ with him - for instance, pop a note into his lunch bag or briefcase or whatever that says “meet me in the laundry room at 6:30 ♥” - then be there! Even if it’s just 5 minutes to rub his shoulders or ‘snog’ a bit (I love that Britishism!) or hear a highlight of his day. Or ‘surprise’ him by getting up early and washing his back in the shower (Or even sneak in after he’s in the shower and stand there holding a towel to dry him down when he’s done). Lots of little things build up (ask anyone who was in New England last winter - snowflakes are beautiful individually, but watch out when they gang up!)\r<br/>\n\r<br/>\nIt can be particular difficult, from what I’ve heard and seen, for men to adjust to a radical unschooling lifestyle. The idea that men need to always be in control, firm but fair, etc. is a big deal in society. I think someone (or someones) have referenced Sandra Dodd’s (If not, it’s <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling.html)\">http://sandradodd.com/unschooling.html)</a> It might be particularly helpful to search on Ben Lovejoy’s writings - he’s now a whole hearted unschooling dad to two sons (young men now). He’s also got lots of ‘man cred’ you might say - Citadel graduate, military kind of guy - so sometimes that helps because it’s not a lot of moms talking, it’s a “man’s man” type of guy who believes that this is a good thing. And, you might not find specifics from him about bedtimes per se but the principles behind the things (I think one of the articles is related to principles vs. rules)\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333111736","msgId":48156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUyMEM0OEFAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":48155,"nextInTopic":48158,"prevInTime":48155,"nextInTime":48157,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"One thing that happens of its own accord *over time* as you step away from the idea that kids must be taught to learn (schooling whether public, private or at","messageBody":"<div id=\"ygrps-yiv-141760343\">One thing that happens of its own accord *over time* as you step away from the idea that kids must be taught to learn (schooling whether public, private or at home) is that all those other &quot;must&quot; things get called into question. Often, at the nub of many things is the convenience of the adults. Now, that&#39;s not to say that it&#39;s a small thing. But, it is neither more nor less important than what the kids want. It&#39;s about partnering with the kids AND with the adults, in parity. Oh, and it&#39;s not about &#39;always saying yes&#39; - it&#39;s about removing the arbitrary, knee jerk, because I said so No. It&#39;s about being creative in getting to Yes - with the kids AND the adults. What that looks like changes. It&#39;s about operating by principle rather than by rule, rules require punishment (most people nowadays call it &#39;consequences&#39; but they&#39;re punishments, &#39;consequences&#39; don&#39;t need to be enforced, they happen, they&#39;re real - drop a handful of pasta, it&#39;ll hit the floor, gravity and all, y&#39;know - that&#39;s cause and effect, a real consequence of the action. Too often, the &#39;consequence&#39; would be having to clean it up and/or having the pasta taken away. That&#39;s not a &#39;consequence&#39;, that&#39;s a punishment). Sometimes DS can&#39;t have something, we&#39;re out of bananas until I shop tomorrow. No need to &#39;teach a lesson&#39; about not having everything right when you want it. It&#39;s part of life. My role is to say &quot;Yes, I&#39;ll get some bananas at the grocery store tomorrow&quot; and helping him maybe find another snack right now, commiserating with him about how yummy bananas are and that would be the best snack to have, figuring out how to plan better (how many bananas do we go through in a week? Need to get more next time around...) It&#39;s not really any different than how two adults would interact - if hubby loves bananas, I&#39;d make sure to get plenty of bananas.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333110008","msgId":48155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzQTcwREMxLTZBRUEtNDlFMy1CRTRFLTU1ODBCQ0U4MkE4QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAwMDAwMWNkMGUwNSQwMWNiNzlmMCQwNTYyNmRkMCRAbmV0Pg==","referencesHeader":"PDAwMDAwMWNkMGUwNSQwMWNiNzlmMCQwNTYyNmRkMCRAbmV0Pg=="},"prevInTopic":48153,"nextInTopic":48156,"prevInTime":48154,"nextInTime":48156,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... What Chris said :-) Also here: http://joyfullyrejoycing.com/ Scroll down the right. It s one of my favorite topics :-) What makes the issue of chores","messageBody":"<div id=\"ygrps-yiv-809594232\">On Mar 29, 2012, at 7:38 PM, Lisa Dixon wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Could you give an example of what you would replace chores with?<br/>\n<br/>\n </span></blockquote>What Chris said :-)<br/>\n<br/>\nAlso here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nScroll down the right. It&#39;s one of my favorite topics :-)<br/>\n<br/>\nWhat makes the issue of chores confusing is people have absorbed throughout their lives supposed truths about kids and chores. But many of the ideas are false and many have consequences that are shrugged off.<br/>\n<br/>\nAnd when someone&#39;s goal for her family shifts to creating a supportive atmosphere for learning, conventional views of chores can steer people 180 degrees away from that goal.<br/>\n<br/>\nSome typical reasons for making kids do chores are:<br/>\n<br/>\nKids have to learn to be responsible for their messes.<br/>\nKids have to pull their weight. They&#39;re given food and lodging so it&#39;s &quot;only fair&quot; that they contribute.<br/>\nKids have to learn there are things in life we just have to do.<br/>\nThere&#39;s a lot of work in the upkeep of a home. Kids contribute to the mess so they should contribute to the upkeep.<br/>\nKids need to learn Mom isn&#39;t their servant.<br/>\n<br/>\n&quot;Should,&quot; &quot;have to,&quot; &quot;need to,&quot; and &quot;only fair&quot; are often good indicators of thoughts that could be pulled apart and examined. :-) Are those ideas really true? Do the pros outweigh the cons?<br/>\n<br/>\nUnfortunately most people only have controlled or un-parented kids as data to draw conclusions from. So the above often seem true.<br/>\n<br/>\nUnschoolers have kids who are respected and supported. We have a clear goal we&#39;re steering toward so it&#39;s easier to make choices. And we also have 20 or more years of first hand examples of what *really* happens.<br/>\n<br/>\nWhen kids are shamed, coerced, forced or any other negative emotion is stirred when they&#39;re made to do chores, what kids learn isn&#39;t likely to be responsibility. It&#39;s far more likely they&#39;re learn it sucks to be powerless and rocks to have power to make others do what you want. They&#39;ll learn mom cares less about them and more about her house. They&#39;ll learn chores are drudgery.<br/>\n<br/>\nKids *do* seem to be ignorant of what adults would label responsibility. And it *seems* like making them be &quot;responsible&quot; -- but really it&#39;s conscripted labor and not responsibility at all -- is the cause of them becoming more responsible. (But of course not all kids *do* become responsible from being forced. Some rebel. And since chores seems to work sometimes and fail others, it&#39;s assumed there&#39;s something wrong with the child rather than something wrong with the forced chores.)<br/>\n<br/>\nSince radical unschoolers don&#39;t force chores on kids and they become responsible anyway, it isn&#39;t the chores that do it! It&#39;s age. And, for radical unschoolers, it&#39;s support for who they are. It&#39;s inviting them joyfully into your world to share in the household tasks. It&#39;s respecting they may have more important things to do. The whole process of chores works *so* much better when parents see their chores as theirs and see their kids as volunteering their time when they could be doing something they like better. It&#39;s thanking them sincerely for giving up their time to do something for you.  It&#39;s being people kids want to spend time with and do things for :-)<br/>\n<br/>\nThe radical unschooling approach won&#39;t yield kids who do chores without asking. But  -- when kids are developmentally ready -- they will see things that need done and do them. They will happily help when asked -- if the parent respects when they&#39;re asking and accepts &quot;I can do it later&quot; and, also, &quot;I&#39;m busy.&quot; They will help even when it&#39;s inconvenient  for them if you&#39;ve built up a confidence in them that you wouldn&#39;t tell them -- e.g., not ask -- you need their help unless you really did. Basically you treat them as you would any other fellow human being, respecting they have busy lives, that people love to help but really hate having tasks thrust on them without a say.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333107674","msgId":48153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBRDc5M0M4LUNEQUItNDc2MC04QUNBLUQ4MDk5QkRBQkI2NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsMmNrdSt0cG1mQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMmNrdSt0cG1mQGVHcm91cHMuY29tPg=="},"prevInTopic":48152,"nextInTopic":48155,"prevInTime":48152,"nextInTime":48154,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... If by it you mean radical unschooling, then, yes, there are ways to do it right. There are ways to screw it up. There are choices that are warmer, that","messageBody":"<div id=\"ygrps-yiv-1678041050\">On Mar 29, 2012, at 3:19 PM, Melissa J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know that there is no one way to do it &#39;right&#39;,<br/>\n<br/>\n </span></blockquote>If by &quot;it&quot; you mean radical unschooling, then, yes, there are ways to do it right. There are ways to screw it up.<br/>\n<br/>\nThere are choices that are warmer, that move toward it. There are choices that are cooler, that move away from it.<br/>\n<br/>\nRadical unschooling will look different in practice from family to family because personalities and likes and dislikes and family needs are different. But the principles will be the same.<br/>\n<br/>\nIf by &quot;it&quot; you mean &quot;what works for my family&quot;, then, yes, there&#39;s is no right way since there is no &quot;it&quot;. It&#39;s different for every family. &quot;What works for my family&quot; may be obedient kids in one family, or light chores in another, or following God&#39;s way in another.<br/>\n<br/>\nI think where people get confused is they have a vague idea of &quot;what&#39;s best&quot; without ever defining it. Mostly because it&#39;s full of contradictions! ;-) They want their kids to follow what they love from what&#39;s best for them and not be too inconvenient in the process ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; it just needs to be what&#39;s needed, what fosters happiness, and brings the family together.<br/>\n<br/>\n </span></blockquote>And that can be the foundation to build a philosophy from. What principles and practices will help you make the choices that move toward that? What principles and practices will steer you away? And how do you prioritize when a choice will lead toward one but away from another?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333107012","msgId":48152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QkMyQzNBLUVEQzAtNDNCQS05NTkyLUVBNjk5MDE3RTUyM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg=="},"prevInTopic":48151,"nextInTopic":48153,"prevInTime":48151,"nextInTime":48153,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... Maybe because you were focused on helping them learn before. And then you shifted to doing unschooling. It helps to focus on what your goal is and then","messageBody":"<div id=\"ygrps-yiv-669445257\">On Mar 29, 2012, at 3:00 PM, Melissa J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve done this more effectively before. What killed me was thinking I was doing it &#39;wrong&#39;<br/>\n<br/>\n </span></blockquote>Maybe because you were focused on helping them learn before. And then you shifted to &quot;doing unschooling.&quot;<br/>\n<br/>\nIt helps to focus on what your goal is and then find a way that will help you keep steering in that direction.<br/>\n<br/>\nI think it does confuse people when they define their goal as unschooling. Unschooling is too vague. It gets defined by different people in different ways. It&#39;s hard to steer towards something vague!<br/>\n<br/>\nUnschooling is a philosophy, a set of principles. The particular collection of principles labeled unschooling helps people make the choices that move in a particular direction. That direction is creating an atmosphere that supports children&#39;s learning.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333106610","msgId":48151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEMTBFOTkwLUMyQjctNEJENi1CRTI0LUU4QjFFMDVGNUYzMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg=="},"prevInTopic":48150,"nextInTopic":48152,"prevInTime":48150,"nextInTime":48152,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... It will help to not see that as school. :-) It s learning. It s exploring the world. It s exploring their interests. It s as much a way of learning about","messageBody":"<div id=\"ygrps-yiv-1474118609\">On Mar 29, 2012, at 3:00 PM, Melissa J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For doing things along the lines of &#39;school&#39;, I do want to read to them<br/>\n<br/>\n </span></blockquote>It will help to not see that as school. :-)<br/>\n<br/>\nIt&#39;s learning. It&#39;s exploring the world. It&#39;s exploring their interests.<br/>\n<br/>\nIt&#39;s as much a way of learning about the world as digging in the dirt, watching TV, playing with stuffed animals, pretending to be superheroes is.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333106445","msgId":48150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBMUU2QkY3LUY0OTMtNERGRi05N0ZELTkzRkQ3REYzNzlGMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg=="},"prevInTopic":48149,"nextInTopic":48151,"prevInTime":48149,"nextInTime":48151,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... You can also give them the information and let them decide. You can say Dinner is in 15 minutes. You can have the cookie now or after. Or I can get you","messageBody":"<div id=\"ygrps-yiv-207720433\">On Mar 29, 2012, at 3:00 PM, Melissa J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I might say something like &#39;yes, you can have a cookie<br/>\n&gt; after dinner&#39; - and they are always fine with that. <br/>\n<br/>\n </span></blockquote>You can also give them the information and let them decide. You can say &quot;Dinner is in 15 minutes. You can have the cookie now or after. Or I can get you something to tide you over until dinner time.&quot;<br/>\n<br/>\nIf they&#39;re often asking late in the day, you can set out monkey platters before they&#39;re hungry enough to notice. (Sometimes kids don&#39;t notice until they&#39;re *really* hungry!) Kids have small stomachs and high energy needs so they need to eat fairly often.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/monkeyplatters/\">http://sandradodd.com/monkeyplatters/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333106156","msgId":48149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENERUU2RDdCLTc2REYtNEE5MC1CN0IxLTQ4NUIxQzYxNzQ5OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg=="},"prevInTopic":48148,"nextInTopic":48150,"prevInTime":48148,"nextInTime":48150,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... Even after he can tell time, it won t totally solve the problem. People are at the mercy of the programmers. They can whimsically decide to shift the","messageBody":"<div id=\"ygrps-yiv-1841583678\">On Mar 29, 2012, at 3:00 PM, Melissa J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son is still learning to tell time and worries that<br/>\n&gt; if the TV isn&#39;t on all morning, that he will miss the show.<br/>\n<br/>\n </span></blockquote>Even after he can tell time, it won&#39;t totally solve the problem. People are at the mercy of the programmers. They can whimsically decide to shift the schedule. Or put a new episode on amidst a bunch of repeats.<br/>\n<br/>\nThe more control he has, the less powerless he&#39;ll feel. Recording his programs can give him control. DVRs are a marvelous invention. They keep track of when the programs are on. If the provider gets the information in time, the DVR can even know to shift times and record double episodes. Also buying series on DVDs. If it&#39;s an older series, they&#39;re often available relatively cheaply from Amazon.<br/>\n<br/>\n(Once my daughter could watch her programs whenever she wanted with the DVR, her TV watching went way down. She was watching a lot because she didn&#39;t want to miss a new or favorite episode. Once she had control, it freed her from feeling she needed to watch whenever the program was on.)<br/>\n<br/>\nThere are legitimate streaming services. Hulu is one. I think TV.com keeps up with where programs are available. So if you go to the listing at tv.com it will show you the online (free and paid) options for watching.<br/>\n<br/>\nAmazon has their &quot;Amazon Prime&quot; subscription for $90 per year. Which allows streaming of many shows and movies but also free shipping on purchase.<br/>\n<br/>\nNetflix has an unlimited streaming plan (no DVDs) for $7.99 a month.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333105311","msgId":48148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExQzgyQkE2LUYzNkMtNDZFRC1BQTBDLTcwNjY3QjEzN0MxOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsMmJ2NStlNjhvQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMmJ2NStlNjhvQGVHcm91cHMuY29tPg=="},"prevInTopic":48147,"nextInTopic":48149,"prevInTime":48147,"nextInTime":48149,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... First, don t think of it as no bedtimes. That s like turning the Bedtime is 9PM rule into a No bedtimes rule. Radical unschoolers avoid *arbitrary*","messageBody":"<div id=\"ygrps-yiv-144114424\">On Mar 29, 2012, at 3:08 PM, Melissa J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; no bedtimes<br/>\n<br/>\n<br/>\n </span></blockquote>First, don&#39;t think of it as no bedtimes. That&#39;s like turning the &quot;Bedtime is 9PM&quot; rule into a &quot;No bedtimes&quot; rule.<br/>\n<br/>\nRadical unschoolers avoid *arbitrary* bedtimes, e.g., avoid letting the clock tell the kids when they&#39;re tired. They focus on being attuned to the child and the chid&#39;s needs rather than on what others say the child needs. And the principles help them weigh their options.<br/>\n<br/>\nThe principle is to fall sleep when tired. Some kids do fine noticing when they&#39;re tired and can stop what they&#39;re doing to sleep. (Especially older kids.) Younger kids can fight sleep. It&#39;s so hard to set aside something they&#39;re deeply involved in for something boring like sleep. &quot;No bedtimes&quot; can mean they get overtired, wound up and don&#39;t fall asleep until they&#39;re exhausted. Basically it can be a recipe for disaster And some kids are natural night owls so they&#39;re getting wound up as the adult world is winding down ;-)<br/>\n<br/>\nInstead, create an atmosphere for sleep so the kids can fall asleep when they&#39;re tired. Have a routine in the evening that helps get into the rhythm of listening to their bodies. Turn the lights lower. Do a bath. Do quieter activities like reading. Get CDs for them to listen to in bed if they like. Or a TV if that&#39;s what they&#39;re leaning towards needing.<br/>\n<br/>\nIf the kids are fighting wind down, they may need to get energy out. Some have had success with kids bouncing on a trampoline or wrestling in the evening.<br/>\n<br/>\nIf they fall asleep in front of the TV then you can carry them to bed. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When we talked about bedtime last night, he said that the<br/>\n&gt; kids would stay up all night long. I said &#39;so?&#39;<br/>\n<br/>\n </span></blockquote>Try not to say &quot;So?&quot; :-)<br/>\n<br/>\nIt tends to make people defensive. It&#39;s harder for someone to hear new ideas when they&#39;re focused on defending their own ideas.<br/>\n<br/>\nIt helps to treat his concerns seriously. As seriously as an unschooler would treat her children&#39;s concerns. He has them for what he feels are good reasons and to dismiss them will feel to him like &quot;I don&#39;t care about your feelings only about what I want.&quot;<br/>\n<br/>\nAgree with him if it&#39;s true. Or agree that it does sounds that way. Talk about what you believe and what you&#39;re trying to do. Dig into his concerns to clarify them and find out what bothers him. Talk about what you can do to ease the concerns or ways his needs can be met in other ways.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":471006631,"authorName":"Chris Parker-Barnes","from":"Chris Parker-Barnes &lt;chrisjparkerbarnes@...&gt;","profile":"chrisparkerbarnes@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333103643","msgId":48147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQUI5VFNHeTRmR3IzSm4tRDBPTUxiempnaWtRYm9fPUUyX0MwTjRNUnpBUEpyUFZQQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDAwMDAwMWNkMGUwNSQwMWNiNzlmMCQwNTYyNmRkMCRAbmV0Pg==","referencesHeader":"PDAwMDAwMWNkMGUwNSQwMWNiNzlmMCQwNTYyNmRkMCRAbmV0Pg=="},"prevInTopic":48146,"nextInTopic":48148,"prevInTime":48146,"nextInTime":48148,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"Hi everyone I am relatively new to this group and have been sitting back reading all of the wonderful advice and ideas, and am very grateful for all the","messageBody":"<div id=\"ygrps-yiv-806541753\">Hi everyone<br/>\nI am relatively new to this group and have been sitting back reading<br/>\nall of the wonderful advice and ideas, and am very grateful for all<br/>\nthe collective knowledge that is coming out.  So firstly, thanks to<br/>\nall those who have and are sharing experiences.<br/>\n<br/>\nSo I thought I would add my five cents worth (yes, I am from<br/>\nAustralia!) to this question.<br/>\nWhen it comes to chores, I think it is really important, (like a lot<br/>\nof other areas), not to push the point. My son is only six and I have<br/>\nbeen doing this with him for a while now, but I try to make any chores<br/>\nsound like fun, rather than something that I dread doing. And  I don&#39;t<br/>\nhave the expectation that it is his chore so he has to do it.<br/>\nInstead, I have the attitude that I will do it, and if he chooses to<br/>\nhelp then that just makes it all so much easier.<br/>\nSome examples:  He helps me take the bins out every week.  I always<br/>\nsay, I am going to put the bins out, do you want to come and help?  9<br/>\ntimes out of 10 the answer is yes, and then when we get outside, he<br/>\nraces ahead and does it all on his own and insists that I don&#39;t do it.<br/>\n But on the very odd occasion, he doesn&#39;t want to (whether that is<br/>\nbecause he is tired, or doing something he is really engaged in), so I<br/>\njust say ok, and go and do it myself.<br/>\nSimilar thing has happened with setting the table for meals, it<br/>\nstarted out as a cooperative chore, now he does it by himself.  And in<br/>\nfact, one day recently, I thought he had said he didn&#39;t want to do it,<br/>\nso I did it myself and he got upset with me because what he had meant<br/>\nto say was that he would do it in a minute.<br/>\n<br/>\nWe also do things like change the sheets on the beds together.  It is<br/>\nalways a lot of fun because one of our cats likes to jump around on<br/>\nthe bed and often gets tucked into bed under sheets / doonas etc.  It<br/>\ncan be quite hilarious, but I assure you there are never any<br/>\ncomplaints in the house about changing the sheets!<br/>\nEven things like putting the washing machine on - my son likes to do<br/>\nthat because he likes to push the buttons. Or hanging the washing on<br/>\nthe line - we make games out of him handing me pegs, or taking pegs<br/>\noff the line and trying to throw them into the peg basket, which he<br/>\nmoves around.<br/>\nIn the meantime, he is learning how to use the washing machine, how to<br/>\nput clothes on the line etc.  And yes, the chores take longer than<br/>\nthey normally would, but there is usually a lot of laughter involved.<br/>\nWhile this is all going on, he is learning what has to be done within<br/>\na household, and how to do it, without any stress or negativity.<br/>\nMy unschooling motto: relax and have fun and it will all happen in good time!<br/>\nEnjoy :)<br/>\n<br/>\nChris<br/>\n(from Adelaide, Australia)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 3/30/12, Lisa Dixon &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lddixon@...\">lddixon@...</a>&gt; wrote:<br/>\n&gt; Could you give an example of what you would replace chores with?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thanks!<br/>\n&gt;<br/>\n&gt; Lisa<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Radical Unschooling...?","postDate":"1333088658","msgId":48145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsM2ppaSsxMDNlZUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGpsMmJ2NStlNjhvQGVHcm91cHMuY29tPg=="},"prevInTopic":48144,"nextInTopic":48146,"prevInTime":48144,"nextInTime":48146,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... stay up all night long. I said so? and then explained that they probably would go on a binge and then go to bed when they are tired. He threw up his arms","messageBody":"<div id=\"ygrps-yiv-287291494\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Melissa J&quot; &lt;mnjenkins@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When we talked about bedtime last night, he said that the kids would<br/>\n </span></blockquote>stay up all night long. I said &#39;so?&#39; and then explained that they<br/>\nprobably would go on a binge and then go to bed when they are tired. He<br/>\nthrew up his arms and said &#39;do what you want, but I think it&#39;s a bad<br/>\nidea&#39;. We then talked about it quietly later, and he explained that he<br/>\nwanted time to unwind and spend those last few hours with me. I know he<br/>\ngets REALLY defensive about &#39;us&#39;.<br/>\n<br/>\nI have a couple thoughts about this.  Without having any idea what the<br/>\nastrology stuff is, it seems here like your husband might feel like he&#39;s<br/>\nput on the spot.  Now he has to defend himself against someone and that<br/>\nmakes people feel uneasy generally.  I would suggest that rather than<br/>\nmaking or wanting to make new house rules, you ease into this kind of<br/>\nparenting approach and let this take shape naturally.  Your husband is<br/>\nlikely thinking young kids who stay up late alone are not safe. <br/>\nDepending on your kids, he may have  a point.  He may think kids who<br/>\nhave no rules grow up to be self-centered and hard to get along with. <br/>\nCertainly none of us want our kids to turn out like that.  I think<br/>\nyou&#39;re asking him to jump into a rather advanced expectation before he&#39;s<br/>\nhad the experience of knowing what a family can be without coercion and<br/>\nmanipulation.   Does he think your kids are capable of being safe and<br/>\ncourteous and getting themselves to bed independently?  Do you think<br/>\nthey are?  What would he like to see to know he can feel safe and<br/>\nconfident that his children are not being neglected?<br/>\n  Perhaps I&#39;m projecting, that could be, but I know when I backed off<br/>\ntalking to my husband and simply employed what respectful parenting<br/>\napproaches I could within his comfort zone, I could see the mood in the<br/>\nhouse changed.  H esaw the kids as more relaxed, happy, and responsible.<br/>\nOne night he pulled me to bed and told me it&#39;s okay, the kids were busy.<br/>\nThey&#39;re big kids anyway, they know not to burn the house down.  ;)<br/>\nYour husband might also be more stressed at work than he&#39;s letting on. <br/>\nOne of the reasons &quot;down time&quot; is so valuable is because we have so many<br/>\npressures that feel out of our control during the day.  Our kids are no<br/>\ndifferent.  In my experience, giving my kids more control in general<br/>\nhelped to alleviate this stress. Our home was more relaxing as I<br/>\nincreased their ability to make choices.  My husband and I had less<br/>\n&quot;together alone&quot; time when he came home from work, but what time we had<br/>\ntogether as a family was better than it had ever been. We began to<br/>\ngenuinely enjoy each other&#39;s company rather than simply getting along.  <br/>\nNow my husband and I go to bed earlier than our kids regularly.  They&#39;re<br/>\nolder than yours (my youngest is 12), but eventually you&#39;ll have teens<br/>\nin your house who won&#39;t take a bath and go to bed after supper anyway. <br/>\nThat time you have with him is going to require a different solution. <br/>\nThere&#39;s no rush to this.  Take this slowly, allow your kids to take<br/>\ncontrol as is practical for your whole family.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333758624,"authorName":"Lisa Dixon","from":"Lisa Dixon &lt;lddixon@...&gt;","profile":"lddixon4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333064292","msgId":48146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWNkMGUwNSQwMWNiNzlmMCQwNTYyNmRkMCRAbmV0Pg=="},"prevInTopic":48145,"nextInTopic":48147,"prevInTime":48145,"nextInTime":48147,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"Could you give an example of what you would replace chores with? Thanks! Lisa [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1686828480\">Could you give an example of what you would replace chores with?<br/>\n<br/>\n <br/>\n<br/>\nThanks! <br/>\n<br/>\nLisa<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333061572","msgId":48144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMnA0NCszbHY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsMmJ2NStlNjhvQGVHcm91cHMuY29tPg=="},"prevInTopic":48143,"nextInTopic":48145,"prevInTime":48143,"nextInTime":48145,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... *************** One of the traps that parents can fall into is lumping together a whole bunch of needs into one big lump: time to unwind, time for adult","messageBody":"<div id=\"ygrps-yiv-332657027\">&quot;Melissa J&quot; &lt;mnjenkins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; he explained that he wanted time to unwind and spend those last few hours with me. I know he gets REALLY defensive about &#39;us&#39;.<br/>\n </span></blockquote>***************<br/>\n<br/>\nOne of the traps that parents can fall into is lumping together a whole bunch of needs into one big lump: time to unwind, time for adult conversation, time for closeness, time for sex. If you&#39;re depending on the same hour-and-a-half a night for all of that, then that chunk of time seems reeeeeeaaaaalllly important.<br/>\n<br/>\n The trouble is, kids aren&#39;t convenient ;) They want to learn at the Darnedest times, and they want to spend time with their parents at the darnedest times, too And kids get older and need less sleep! So that chunk of time can seem like a competition between dad and kids - with dad feeling like he needs to defend his &quot;time&quot; against all comers. Over time, that can be hard on relationships. Kids don&#39;t feel like they can count on their parents all the time, especially kids who are night owls... like many young teens!<br/>\n<br/>\nWhat can help is to spread out the ways you meet all those needs so that chunk of time doesn&#39;t feel so vital. Find small ways to connect - smiles, emails, phone calls, conversations that include kids or happen around kids. Help dad find ways to relax And be with the kids - watching tv or playing video games or reading a story, for instance. Help dad feels loved and valued - and sexy! in lots of small ways, with touches and pats, ambushes in the bathroom and pantry, naughty moments when the kids are too preoccupied to notice. Loving up on dads is a good way for them to feel a whole lot better about unschooling! They get to have some of the benefits of time and care and &quot;yes&quot; - and then they &quot;get&quot; why those things are helpful to kids. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333060659","msgId":48143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMm83aisxMGxzZ0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg=="},"prevInTopic":48140,"nextInTopic":48144,"prevInTime":48142,"nextInTime":48144,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... *************** There s a good bit of personality involved, too. A lot of parents get interested in the whole life aspects of unschooling when their kids","messageBody":"<div id=\"ygrps-yiv-933743527\">&quot;Melissa J&quot; &lt;mnjenkins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think all of this is because it&#39;s how I&#39;ve done things with them since birth. They are used to it.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThere&#39;s a good bit of personality involved, too. A lot of parents get interested in the &quot;whole life&quot; aspects of unschooling when their kids stop going along with all the things they&#39;ve done since birth, or the things they&#39;ve done since birth have been one battle after another. They&#39;re not necessarily doing anything differently than you, but they have different kids with different needs. That&#39;s one of the reasons writers on the list like me will pick apart posts the way we do - it&#39;s not enough to know what &quot;works&quot; for one family because each family is different. So the idea is to try and get down below the surface and see the underlying principles of how human beings learn - what helps and what doesn&#39;t. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Instead of really saying &#39;no&#39;, I might say something like &#39;yes, you can have a cookie after dinner&#39; - and they are always fine with that.<br/>\n </span></blockquote>***************<br/>\n<br/>\nMealtimes can be a hot-button issue for some parents and if the kids aren&#39;t amenable, that can make meals into a power struggle. The good news is that it doesn&#39;t have to be - but for that to happen, it helps for parents to stop and think about what they want from &quot;the family meal&quot; on a deeper level. Lots of thoughts about food and meals here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My son is still learning to tell time and worries that if the TV isn&#39;t on all morning, that he will miss the show. I&#39;ve been trying to help him read time<br/>\n </span></blockquote>****************<br/>\n<br/>\nSometimes recording favorite shows can help with that - or buying whole seasons of shows on dvd, so kids can watch them any time. Some kids, too, like to have the tv on in the background - similar to the way many adults like music on in the background, but I know my daughter also really likes the little bit of extra motion and activity in the room.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;What killed me was thinking I was doing it &#39;wrong&#39;.<br/>\n<br/>\n </span></blockquote>Right and wrong are based on having a particular goal - and peaceful, joyful living can be that particular goal! If there&#39;s a lot of stress and misery in my home, I start asking myself what I could be doing better - usually, in my case, I&#39;m getting too wrapped up in my own stuff and forgetting about the people I love. I love a good project... and it helps me to remember that my family is the best project I have. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":226140779,"authorName":"Melissa J","from":"&quot;Melissa J&quot; &lt;mnjenkins@...&gt;","profile":"meljenart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333048798","msgId":48140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMmNrdSt0cG1mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkxMTZCODc2LTAyNTctNEZGNi1BRjM2LTY4QjAyNTIyOTU4QUB2ZXJpem9uLm5ldD4="},"prevInTopic":48139,"nextInTopic":48143,"prevInTime":48139,"nextInTime":48141,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... Thank you Joyce. :-) I hope I am not offending here at all! I do try my best to implement changes that help our family. I know that there is no one way to","messageBody":"<div id=\"ygrps-yiv-1752705599\"><blockquote><span title=\"ireply\">&gt; But all ideas here will come from a radical unschooling point of view. So problems brought here will get radical unschooling feedback. In other words we won&#39;t help someone implement chores just because they&#39;re uncomfortable letting them go. The suggestions will be to drop the chores and what to replace them with.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n<br/>\n </span></blockquote>Thank you Joyce. :-) I hope I am not offending here at all! I do try my best to implement changes that help our family. I know that there is no one way to do it &#39;right&#39;, it just needs to be what&#39;s needed, what fosters happiness, and brings the family together.<br/>\n<br/>\nI do think, like I said in a few replies here so far (as I become more comfortable with what I am reading :-)) that I will take things one step at a time. I think today I will sit down and write out ideas that coincide with what the kids love. I am going to ask them what they&#39;d love to learn more about, what their favorite things are, what they want to do, etc. I want to help them expand their universe with the things they love and enjoy, and help give them ideas for things they can do to foster that love.<br/>\n<br/>\nFor example, our daughter loves horses. We found the Bella Sara cards and started helping her collect them. :-) <br/>\n<br/>\nANYWAY. Chores are an interesting thing. My mother was nasty about it. She made them a punishment. They were also something that completely replaced all of Saturday and almost every free hour of time throughout the week, and if we didn&#39;t do something right, she&#39;d make us do it all over again. Often, when I was at school my mother would comb through my room and throw my things away. Believe me, that has carried over into my adulthood. Now, I freak out at the thought of tossing anything. You can also imagine how much my mind naturally bucks the thought of doing anything that resembles chores. It&#39;s very, very hard for me.<br/>\n<br/>\nWhat I do is I try my best to set a good example. I explain to the kids that I&#39;m not a perfect person, but NOBODY is. That &#39;mommy is doing her best&#39;. When the dinner table is covered and they want to craft, I suggest they put things away so they have room, and I try to help. It never turns into anything negative. Or when I am folding laundry or doing dishes, they often come along and want to help. This happens when I feed the cats sometimes, too.<br/>\n<br/>\nThat&#39;s my story, lol. I hope I&#39;m not overwhelming everyone with my novels, lol!!<br/>\n<br/>\nMelissa</div>","specialLinks":[]},{"userId":226140779,"authorName":"Melissa J","from":"&quot;Melissa J&quot; &lt;mnjenkins@...&gt;","profile":"meljenart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333048101","msgId":48139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMmJ2NStlNjhvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsMjh0MCt2ZzBtQGVHcm91cHMuY29tPg=="},"prevInTopic":48138,"nextInTopic":48140,"prevInTime":48138,"nextInTime":48140,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... My husband and I are soulmates. We both know that. It can be difficult at times as he is a Libra and I am a Cancer, and we both VERY MUCH fit the","messageBody":"<div id=\"ygrps-yiv-326191855\"><blockquote><span title=\"ireply\">&gt; Listen to your husband, take seriously his concerns.  Share with him<br/>\n&gt; yours.  In my experience, identifying the core problem does much more to<br/>\n&gt; help you work together as a unit to reach a particular goal.  Whether or<br/>\n&gt; not you unschool, knowing that you and he are truly on the same page<br/>\n&gt; will help you both solve all kinds of situations you&#39;ll face in the<br/>\n&gt; future.<br/>\n<br/>\n </span></blockquote>My husband and I are soulmates. We both know that. It can be difficult at times as he is a Libra and I am a Cancer, and we both VERY MUCH fit the stereotypes of each. So his Libra side comes out with right/wrong, bedtime, rules, etc. He is often very, very stern about it in an abrasive way. It is something we are working on.<br/>\n<br/>\nWhen we talked about bedtime last night, he said that the kids would stay up all night long. I said &#39;so?&#39; and then explained that they probably would go on a binge and then go to bed when they are tired. He threw up his arms and said &#39;do what you want, but I think it&#39;s a bad idea&#39;. We then talked about it quietly later, and he explained that he wanted time to unwind and spend those last few hours with me. I know he gets REALLY defensive about &#39;us&#39;.<br/>\n<br/>\nAnyway, I know it will take time. I think what I might do is simply go with what works for our family. If the kids like &#39;bedtimes&#39;, then we&#39;ll go with that. If they want workbooks, or love the math curriculum we were using, I&#39;ll go with that. <br/>\n<br/>\nI LOVE that I stumbled across unschooling. I think I might take a bit of an eclectic approach - or just plain not label it at all - and see where it goes, and go from there. :-)<br/>\n<br/>\nThanks everyone for your continued help!<br/>\n<br/>\nMelissa<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Unschooling came slowly, as one homeschool<br/>\n&gt; subject was rejected after another (this took months and months, it<br/>\n&gt; really was a very gradual process).  Eventually I saw my kids learning<br/>\n&gt; the things that I was eager for them to learn in an academic setting (we<br/>\n&gt; talked about the cold war following their discovery of the Beatles and<br/>\n&gt; the song &quot;Revolution&quot;).  But in time I learned to see more important<br/>\n&gt; skills coming through.  Far more important than learning history or math<br/>\n&gt; or science. </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Radical Unschooling...?","postDate":"1333047814","msgId":48135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxMTZCODc2LTAyNTctNEZGNi1BRjM2LTY4QjAyNTIyOTU4QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpsMjY2cStianVwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsMjY2cStianVwQGVHcm91cHMuY29tPg=="},"prevInTopic":48134,"nextInTopic":48136,"prevInTime":48134,"nextInTime":48136,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... Those are practices and tools to grow an atmosphere for learning. They are what the principles that grow an atmosphere for learning can look like when put","messageBody":"<div id=\"ygrps-yiv-1883202315\">On Mar 29, 2012, at 1:30 PM, Melissa J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway. I am not sure I&#39;m comfortable with the idea of<br/>\n&gt; unschooling as a lifestyle - i.e. no bedtimes, always saying yes, etc.<br/>\n<br/>\n<br/>\n </span></blockquote>Those are practices and tools to grow an atmosphere for learning. They are what the principles that grow an atmosphere for learning can look like when put into practice.<br/>\n<br/>\nBut they shouldn&#39;t be dropped into place without understanding what they&#39;re for and why. Someone could have no bedtimes, no limits on food or tv, always say yes and have nothing resembling radical unschooling.<br/>\n<br/>\nRead to understand first, then you won&#39;t be doing uncomfortable things just because they&#39;re &quot;radical unschooling ideas&quot;.<br/>\n<br/>\nChange things because there&#39;s a problem to be solved. One of the first bits of advice is &quot;Don&#39;t&#39; drop all your rules at once.&quot;<br/>\n<br/>\nAs you read more about radical unschooling, you may begin to see behavior in a way you hadn&#39;t before. You may see that the kids are, for instance, balking at what you believe are reasonable requests, and it may spark a sudden understanding about something said here. Then you can start playing around with the ideas.<br/>\n<br/>\nList members are welcome to pick and choose from the ideas posted to the list. Those who aren&#39;t radically unschooling  won&#39;t get the full benefit but the results will be better than conventional education and conventional parenting.<br/>\n<br/>\nBut all ideas here will come from a radical unschooling point of view. So problems brought here will get radical unschooling feedback. In other words we won&#39;t help someone implement chores just because they&#39;re uncomfortable letting them go. The suggestions will be to drop the chores and what to replace them with.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":226140779,"authorName":"Melissa J","from":"&quot;Melissa J&quot; &lt;mnjenkins@...&gt;","profile":"meljenart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Radical Unschooling...?","postDate":"1333047601","msgId":48138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMmJmaCtwNGZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsMjdkMytqbjFiQGVHcm91cHMuY29tPg=="},"prevInTopic":48136,"nextInTopic":48139,"prevInTime":48137,"nextInTime":48139,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"Thank you! I guess the easiest way to explain how I do things now, is for example... if we ve been watching TV a lot and it s a beautiful day outside, I","messageBody":"<div id=\"ygrps-yiv-833701662\">Thank you!<br/>\n<br/>\nI guess the easiest way to explain how I do things now, is for example... if we&#39;ve been watching TV a lot and it&#39;s a beautiful day outside, I suggest that we go for a walk. If that doesn&#39;t sound fun to the kids, I suggest riding bikes or going to the park - and if they jump up and get excited, then we go. If not, I might go outside and check on the bird feeder or whatnot, and the kids continue to do what they were doing. If they love a certain TV show, I put it on for them. (Or they do it themselves). My son is still learning to tell time and worries that if the TV isn&#39;t on all morning, that he will miss the show. I&#39;ve been trying to help him read time, and if the kids are both doing something else and totally not interested in the TV, I turn it off. 99% of the time they don&#39;t notice. :-)<br/>\n<br/>\nFor food, candies/cookies, bedtime, washing up, picking up toys... I do these things gently. I try not to be harsh at all. Instead of really saying &#39;no&#39;, I might say something like &#39;yes, you can have a cookie after dinner&#39; - and they are always fine with that. If my son throws a fit about something, I redirect his attention to something I know he would love doing, like helping me cook dinner. He loves that. For bedtime (and this is something hubby has a hard time with, since he wants quite time with me and our apartment is REALLY small) - if the kids are having a lot of fun, I say &#39;sure, you can stay up for 30 more minutes. They usually cheer with excitement, and when 30m rolls around they are 100% fine with climbing into bed.<br/>\n<br/>\nI think all of this is because it&#39;s how I&#39;ve done things with them since birth. They are used to it.<br/>\n<br/>\nFor doing things along the lines of &#39;school&#39;, I do want to read to them - they LOVE it when I do. I love classical stories like Peter Pan, Alice in Wonderland - and they love hearing them. If I&#39;m not interested in it, they normally aren&#39;t, either. I don&#39;t just read classical litarature though. And when we go to the library, I try to have them pick out things they&#39;d like to look at or have me read to them. Then I pick things that I think would be fun to learn about together - whatever goes in-line with things they&#39;ve loved before... learning more about Benjamin Franklin, King Arthur, Fire Trucks, Cats, Egypt, etc.<br/>\n<br/>\nAnyway, that&#39;s what I want to expand on. I&#39;ve done this more effectively before. What killed me was thinking I was doing it &#39;wrong&#39;. Oh, if only I could find my original notes when I decided I wanted to homeschool. I know back then I had the right idea - enjoying the wonderful, amazing adventures surrounding us in our every-day lives.<br/>\n<br/>\nMelissa</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Radical Unschooling...?","postDate":"1333044960","msgId":48134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMjh0MCt2ZzBtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsMjY2cStianVwQGVHcm91cHMuY29tPg=="},"prevInTopic":48132,"nextInTopic":48135,"prevInTime":48133,"nextInTime":48135,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... night about bedtime, and it did NOT go over well at all. I don t want this to cause a huge abrasion in our marriage, as he has a very, very different view","messageBody":"<div id=\"ygrps-yiv-451059016\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Melissa J&quot; &lt;mnjenkins@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I hope everyone here understands. I tried talking to my husband last<br/>\n </span></blockquote>night about bedtime, and it did NOT go over well at all. I don&#39;t want<br/>\nthis to cause a huge abrasion in our marriage, as he has a very, very<br/>\ndifferent view on things.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Anyway thank you in advance -<br/>\n&gt; Melissa<br/>\n<br/>\n </span></blockquote>Your marriage is the foundation of your family.  You and your husband<br/>\nneed to know each other are dependable as well as courteous and<br/>\ncompassionate.  You need to know you can trust each other.  This will<br/>\nset the tone for your family and your kids will pick up on this and<br/>\napply it to relationships in their lives.  Raising your children in the<br/>\nkind of environment you desire takes both of you on the same page. <br/>\nListen to your husband, take seriously his concerns.  Share with him<br/>\nyours.  In my experience, identifying the core problem does much more to<br/>\nhelp you work together as a unit to reach a particular goal.  Whether or<br/>\nnot you unschool, knowing that you and he are truly on the same page<br/>\nwill help you both solve all kinds of situations you&#39;ll face in the<br/>\nfuture.<br/>\n<br/>\nAs an example, when I first looked into unschooling I felt much the same<br/>\nway - relieved that there exists a &quot;natural&quot; way to raise my children. <br/>\nMy husband, with a Ph.D., wasn&#39;t so interested in the idea of his kids<br/>\ndoing &quot;whatever.&quot;  He values a formal education and truth be told, so do<br/>\nI.  Eventually we figured out our core problem (not problem as in<br/>\ntrouble, but a neutral problem requiring a solution).  We both agreed<br/>\nthat we want our kids to be responsible, respectful, courteous, as well<br/>\nas be critical thinkers.  Unschooling came slowly, as one homeschool<br/>\nsubject was rejected after another (this took months and months, it<br/>\nreally was a very gradual process).  Eventually I saw my kids learning<br/>\nthe things that I was eager for them to learn in an academic setting (we<br/>\ntalked about the cold war following their discovery of the Beatles and<br/>\nthe song &quot;Revolution&quot;).  But in time I learned to see more important<br/>\nskills coming through.  Far more important than learning history or math<br/>\nor science.  I watched as my kids started to take initiative rather than<br/>\nwait to be asked or told what to do.  I saw them no longer blaming<br/>\nothers for things that didn&#39;t get done.  I saw them take responsibility<br/>\nfor things they wanted, and respond to set-backs calmly and critically. <br/>\nI saw them identify and solve their own problems effectively and<br/>\ncourteously.  I see bedtime as one of those problems to be solved.  Two<br/>\nof my kids stay up until 3-4 every night.  One child gets to bed by<br/>\nmidnight.  Its a personal choice inspired by their own solutions to the<br/>\nproblem called, &quot;how do I budget my time.&quot;   <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333758624,"authorName":"Lisa Dixon","from":"Lisa Dixon &lt;lddixon@...&gt;","profile":"lddixon4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Radical Unschooling...?","postDate":"1333043927","msgId":48136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMDIwMWNkMGRkNSQ5NzAwODA0MCRjNTAxODBjMCRAbmV0Pg=="},"prevInTopic":48135,"nextInTopic":48138,"prevInTime":48135,"nextInTime":48137,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"Meredith, Thank you for that rule-busting stuff! I needed to hear that! I really did not understand the reasoning behind all the permissiveness until you ","messageBody":"<div id=\"ygrps-yiv-2041909721\">Meredith,<br/>\n<br/>\n <br/>\n<br/>\nThank you for that rule-busting stuff! I needed to hear that! I really did<br/>\nnot understand the reasoning behind all the permissiveness until you<br/>\nmentioned the relationship part. I know that is true from experience with my<br/>\nown kids. I just needed someone to say it that way J<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Radical Unschooling...?","postDate":"1333043427","msgId":48132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMjdkMytqbjFiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsMjY2cStianVwQGVHcm91cHMuY29tPg=="},"prevInTopic":48131,"nextInTopic":48134,"prevInTime":48131,"nextInTime":48133,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"... Radical unschooling extends the idea that human beings are naturally inclined to learn into all areas of learning - alternately, academic unschooling","messageBody":"<div id=\"ygrps-yiv-716667214\">&quot;Melissa J&quot; &lt;mnjenkins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Are these two things truly different?<br/>\n<br/>\n </span></blockquote>Radical unschooling extends the idea that human beings are naturally inclined to learn into all areas of learning - alternately, &quot;academic unschooling&quot; narrows the definition of learning to only include school subjects ;) This list assumes learning is learning and people are wired to learn and that &quot;unschooling&quot; refers to learning... so it&#39;s a radical unschooling list in that sense.  <br/>\n<br/>\nThat being said, it&#39;s Very Helpful to ease in to unschooling! Read a little, try a little, wait a little, watch and see what happens. Keep the advice that helps your family be happier and more peaceful. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t want this to cause a huge abrasion in our marriage<br/>\n<br/>\n </span></blockquote>Your marriage is important! Unschooling doesn&#39;t work well in situations where people are unhappy and stressed out - in fact, a lot of the advice you get on this list will have more to do with smoothing out relationships and creating a peaceful home than &quot;learning&quot; in an academic sense. Since we&#39;re coming from the premise that learning itself is natural, that frees parents up to work on creating an environment which supports people and relationships. That&#39;s a big part of the &quot;why&quot; behind things like moving away from rules, limits, bedtimes etc - when those things stress family relationships, it can be Really Helpful to question and rethink the rules. It&#39;s not rule-busting for it&#39;s own sake, but to make your whole life easier. So if it Doesn&#39;t make your life easier, it&#39;s better to wait on that kind of thing. Eventually, you kids will be older and the rules you have now will change anyway- that&#39;s part of the nature of rules and another part of the reason why unschoolers often prefer to step away from them and live instead by deeper principles.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":226140779,"authorName":"Melissa J","from":"&quot;Melissa J&quot; &lt;mnjenkins@...&gt;","profile":"meljenart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Radical Unschooling...?","postDate":"1333042202","msgId":48131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMjY2cStianVwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48132,"prevInTime":48130,"nextInTime":48132,"topicId":48131,"numMessagesInTopic":0,"msgSnippet":"Hello again everyone :-) In my massive amounts of reading & research I ve been doing since yesterday morning, I came across not only unschooling (obviously,","messageBody":"<div id=\"ygrps-yiv-525744684\">Hello again everyone :-)<br/>\n<br/>\nIn my massive amounts of reading & research I&#39;ve been doing since yesterday morning, I came across not only unschooling (obviously, lol) but radical unschooling. I had no idea about the latter. Are these two things truly different?<br/>\n<br/>\nWhen I first learned more about the basis of unschooling where &#39;homeshcooling&#39; was concerned, it really sparked an interest in me since it&#39;s what we seem to naturally fall in line with. I think I&#39;m in a massive detox mode since we&#39;ve hardly done anything lately that I would consider &#39;learning&#39;, but I suppose I just need to open my eyes a bit more and help present things that I know my children love, and help them expand on that. When they get angry or grumpy, I try my hardest to talk with them about it and we change the environment as family - taking time to play TOGETHER or going to the park, etc.<br/>\n<br/>\nAnyway. I am not sure I&#39;m comfortable with the idea of unschooling as a lifestyle - i.e. no bedtimes, always saying yes, etc. I don&#39;t really want to debate any of those topics as I&#39;ve been reading about them over and over... it&#39;s just how I feel about it at this point. BUT - I am worried that if I try to do unschooling with their homeschool, and no where else, it might feel unbalanced.<br/>\n<br/>\nIs there a way I can be a bit more directed, but still try to go with what the kids love? Is that what&#39;s considered eclectic learning?<br/>\n<br/>\nI hope everyone here understands. I tried talking to my husband last night about bedtime, and it did NOT go over well at all. I don&#39;t want this to cause a huge abrasion in our marriage, as he has a very, very different view on things.<br/>\n<br/>\nAnyway thank you in advance - <br/>\nMelissa</div>","specialLinks":[]}],"prevTopicId":48222,"nextTopicId":48235}}