{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 4-H paperwork","postDate":"1240247637","msgId":39661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzaWFnbCtuMXFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5MDI2My42OTY3Ny5xbUB3ZWIzNjkwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39660,"nextInTopic":0,"prevInTime":39660,"nextInTime":39662,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... I ve considered it - but the local people usually know and won t permit it.  I worry about the duplicity of honesty, but when I explain that unequal law","messageBody":"<div id=\"ygrps-yiv-333403398\"><blockquote><span title=\"ireply\">&gt; My kids have wanted to do things that they were not &quot;allowed&quot; to by age, so we lied.  Always an option :)<br/>\n<br/>\n </span></blockquote>I&#39;ve considered it - but the local people usually know and won&#39;t permit it.  I worry about the duplicity of honesty, but when I explain that unequal law are just put out by people and people have a right to change them if they are inequitable or harmful, it seems reasonable.</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] 4-H paperwork","postDate":"1240246201","msgId":39660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5MDI2My42OTY3Ny5xbUB3ZWIzNjkwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39653,"nextInTopic":39661,"prevInTime":39659,"nextInTime":39661,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... advance to State until 14-years old!  I hate this age discrimination!  My daughter wanted to go to an entrepreneurship camp 2 years ago in Missouri, but","messageBody":"<div id=\"ygrps-yiv-1554676949\"><blockquote><span title=\"ireply\">&gt;&gt;Here in Arkansas, they don&#39;t have to do that, but they don&#39;t get to<br/>\n </span></blockquote>advance to State until 14-years old!  I hate this age discrimination! <br/>\nMy daughter wanted to go to an entrepreneurship camp 2 years ago in<br/>\nMissouri, but is still 2 years away from being allowed.&gt;&gt;<br/>\n<br/>\nMy kids have wanted to do things that they were not &quot;allowed&quot; to by age, so we lied.  Always an option :)<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Money obsession - Lots of changes - Stress","postDate":"1240159485","msgId":39653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzZmtkdCt2Y2NwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzZWVwMytqcWFiQGVHcm91cHMuY29tPg=="},"prevInTopic":39652,"nextInTopic":39660,"prevInTime":39652,"nextInTime":39654,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... ********************* Do you give them money to spend however they want? Are they used to thinking that the only way they can have money with no strings","messageBody":"<div id=\"ygrps-yiv-1561280329\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My daughter wants to save for a house and car.  My son just wants it, to spend or otherwise. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nDo you give them money to spend however they want? Are they used to thinking that the only way they can have money with no strings attatched is to make their own? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But, I do admit that I have my eye out for what it could lead to in the future because we so often have been on shaky ground with jobs and my folks taught me NOTHING<br/>\n </span></blockquote>*****************************<br/>\n<br/>\nA whole lot of how people spend money has to do with personality (development plays a part, but how it play a part depends on personality). Moreso than any other factor, like family history or income. You can teach your kids a ton about money and spending without it making much of a difference in how they spend, either as kids or adults. Even people with similar &quot;baggage&quot; about money will express that in different ways. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; So, I understand that a lot of unschoolers are entrepreneurs.  Do you consider this a negative?<br/>\n </span></blockquote>*******************************<br/>\n<br/>\nThis is a common theme in your questions: what do unschoolers think? The important question is: What do your Kids think and feel and want and wish and hope? Ray has made things to sell, off and on. He&#39;s also happy doing agricultural work for pay. Mo would love to try being a street vendor, of lemonade or flowers, but we live so far in the country we haven&#39;t figured out how to make that work yet. I&#39;m still looking for opportunities.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My kids like all the adults fine.  They just want kids, too.  Thus, camps are important to them.  But, I do understand the benefits and desire to foster older mentors for my kids.  It just takes time.<br/>\n </span></blockquote>****************************<br/>\n<br/>\nConsidering that your kids want more kid-friends, looking for adult mentors could take a back seat, or even be dropped completely. Look at fun, social things to do where there are other kids. Make an effort to keep up with far-flung friends. Are your kids on the internet? Do they have Myspace or Facebook pages? Those are good ways to stay in touch. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I think it may be hard for a lot of people to understand some of the needs going on here if they haven&#39;t experienced living in constant change since 2001 and loosing jobs and friends and activities and security <br/>\n </span></blockquote>**************************<br/>\n<br/>\nAll the moving is a Big issue - one you&#39;ve been dropping hints about in bits and pieces, so its been hard to understand How big of an issue it is in your family. I&#39;m starting to wonder if all this Activity in y&#39;all&#39;s life isn&#39;t a reaction to so much change and insecurity. It sounds a whole lot like the way people binge when limits are lifted - like y&#39;all are grabbing everything with both hands Right Now, since you don&#39;t know when it will all be taken away again. That&#39;s hard. To some extent, its the sort of thing you just have to wait out. Everyone needs time to trust that the rug isn&#39;t going to be pulled out under their feet again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, I&#39;m all about simply trying to stabilize their environment and trying to find what they want to do and with whom. <br/>\n </span></blockquote>***************************<br/>\n<br/>\nDon&#39;t forget, you are part of their environment - a big, important part, The Mom. You&#39;re kids are going to take their emotional cues from you, to a large extent. That&#39;s part of the responsibility that comes with being the Mom - if you&#39;re worried about changes, the kids will pick that up. Think about what you need to stabilize yourself - that&#39;s the most helpful thing you can do. If you&#39;re taking on too much (maybe binging a little, yourself) you can&#39;t have the emotional stability the kids need. <br/>\n<br/>\nAll the kindness and respect I mentioned in another post apply to you, too. Look for more ways to be kind and gentle to yourself, as well as the kids. You are as deserving of care and regard as they are. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My son is at an age and temperament that he was not much affected. <br/>\n<br/>\n </span></blockquote>He&#39;s every bit as much affected as everyone else in the family, I guarantee it. He just has a different personality.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He is a prime target for unschooling.  He is definitely internally motivated for all sorts of things - and actively pursues them. <br/>\n </span></blockquote>**********************<br/>\n<br/>\nListen to him and follow his lead. Figure out what you need so you aren&#39;t so fearful - that will help you help him better.<br/>\n<br/>\nIf your dd wants to try school, let her try. Its the end of the current school year. Spend the summer doing everything you can to help her make another good friend - personally I&#39;d look for more social activities rather than classes or programs, but it sounds like your dd is comfortable with the idea that such things are good and important, so classes may be fine. Work on not over-promoting the potential long-term benefits of classes and programs, though. Focus on the social connections, since that&#39;s what your dd most needs. If she makes a good friend over the summer she may have a different idea about school. Its not the sort of thing you need to decide for a few months, though.<br/>\n<br/>\n&quot;Prime targets&quot; for unschooling are families with kids who aren&#39;t happy with school or homeschool. You go back and forth talking about stress and loss and then talking about how wonderfully happy and connected y&#39;all are - mixed messages. More than anything, you need to work through your fears and find your guiding principles. Unschooling won&#39;t work in an atmosphere of fearfulness. It needs to grow out of something positive.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Wait to radical unschool?","postDate":"1240155762","msgId":39652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzZmdwaSt0NTRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzZWY1ays1cjhuQGVHcm91cHMuY29tPg=="},"prevInTopic":39651,"nextInTopic":39653,"prevInTime":39651,"nextInTime":39653,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... ************************************ Sorry, I m thinking more than I m writing and not being as clear as I d like. Yesterday I spent in the garden, today","messageBody":"<div id=\"ygrps-yiv-511737483\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &quot;&quot;Naturally *I* think radical unschooling is a better way to live, but chances are, if your kids are reasonably happy now and you try to make a big change, they&#39;ll be confused and possibly hurt and your whole family will come to conclude &quot;this isn&#39;t for us&quot;. It&#39;d be better to wait. You can be kinder and more authentic with your kids without radical unschooling, and that may be all you need.&quot;&quot; <br/>\n&gt; &gt; ---Meredith (Mo 7, Ray 15)<br/>\n&gt; <br/>\n&gt; I&#39;m confused by your last statement.  Why would it be better to wait?  How can I be kinder or more authentic?  What is all I might need?<br/>\n </span></blockquote>************************************<br/>\n<br/>\nSorry, I&#39;m thinking more than I&#39;m writing and not being as clear as I&#39;d like. Yesterday I spent in the garden, today its raining and I have time to articulate more of what&#39;s in my head:<br/>\n<br/>\nI&#39;ve been wondering How you would go about moving closer to unschooling, in light of your statements and responses. Generally, when a family moves to unschooling, the best thing to do is take a break - but from what you&#39;re saying, no-one in your family wants That. They&#39;re all pretty content in that regard. So changing that wouldn&#39;t help anything, would only confuse everyone and make it seem like unschooling is a bad idea. So in that sense, waiting would help everyone in the family clarify whether y&#39;all need to make a change or not. But waiting doesn&#39;t mean changing nothing at all - you can still work on deschooling yourself, if the ideas of radical unschooling are intriguing to you.<br/>\n<br/>\nRadical unschooling is all about relationships and starts with being kind and respectful to kids. Talking kids around to your way of thinking isn&#39;t kind or respectful - its also not a terribly &quot;authentic&quot; relationship in the sense that you&#39;re basically asking kids to agree with you, to validate Your feeling and value system. That doesn&#39;t honor Who your Kids are. If you want to move closer to unschooling, its essential that you work on listening to and observing your kids more and telling them what you think and feel a whole lot less. Not because your feelings aren&#39;t important, but because you have a lot of Fear - you&#39;ve said so yourself - and are inadvertantly handing it to them every time you present your views. So you&#39;re not getting to know who They are - their thoughts and feelings and values, not really. You&#39;re seeing who they are through the lens of fear, and as a result so are they. If you can get to a point as a family where you&#39;re fears aren&#39;t running the show, that will undoubtably be better for everyone in the family - and it may well be that you can do that without unschooling, which is what I meant by &quot;that may be all you need&quot; - all you need to cultivate more joy and kindess in the family.<br/>\n<br/>\nUnschooling won&#39;t help your fears. If anything, its likely to exacerbate them for awhile. That&#39;s a normal part of deschooling. Radical unschooling dicsussion lists Are Not a substitute for counselling or other kinds of introspective work - we can Tell you what&#39;s worked for us and what hasn&#39;t, but we can&#39;t Get you there. If Fear is the problem, its up to you to find your own way around that. <br/>\n<br/>\nSeveral people have mentioned that thinking &quot;what if my child died suddenly&quot; has been a helpful thought-exercise. That one never worked for me. At times, its been helpful for me to consider, if *I* died tomorrow, what would I regret? And then change those things. Either way, the point of the exercise is to think about what&#39;s really important in life, to think about your guiding principles. Joy and kindness tend to be fundamental principles for radical unschoolers. If there are ideas that you think are More important than joy and kindness, then its likely that unschooling won&#39;t work for you. <br/>\n<br/>\nIf you&#39;re stuck on ideas like success and having lots of opportunities for the future, it may be helpful to think about Why you think those are important. Various unschoolers on this list have talked about how those things haven&#39;t led to more joy in their lives, or how the absense of them hasn&#39;t prevented joy. If the ideas folks on this list have shared don&#39;t move you at all, it may be that unschooling isn&#39;t a good fit for you right now.<br/>\n<br/>\nI asked about needs in another post - that&#39;s another way of looking at why you&#39;re making the decisions you are - and your answer was, essentially, that what you are doing is meeting all y&#39;all&#39;s needs. That doesn&#39;t sound like you&#39;re looking for a change, to me. Its sounds like you&#39;re convinced that your life is just fine. <br/>\n<br/>\nYou&#39;ve asked about &quot;enrichment&quot;, how to give the kids enough opportunities - and the reality, for most unschooling families, is that parents end up doing a lot of looking around and hunting for alternatives that fit their kids and families and trying a bunch of different things. There&#39;s no secret formula. Its work. <br/>\n<br/>\nSome families find classes and programs fit okay with certain kids - not always every kid in the family, though. Many families, especially with younger kids, find programs and classes aren&#39;t very helpful, tend to inhibit the kids and strangle the family with too much commitment. If you&#39;re concerned that the programs and classes you&#39;ve chosen for your kids aren&#39;t right for them, unschoolers can help you re-evaluate and give you ideas for alternatives, but we&#39;re also going to question the idea of Needing classes and programs At All - because so many of us have helped our kids find ways to meet their needs that don&#39;t include such things. <br/>\n<br/>\nYou came here asking &quot;Is there hope for me?&quot; The answer is yes, but it will take You doing Whatever You Need to Do to deal with your fears without passing them along to your kids. That&#39;s going to be your first step. I can&#39;t tell you what will help you in that regard - no one on this list can do that. We can tell you what&#39;s worked for each of us, as individuals, and maybe give you a place to start.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Wait to radical unschool?","postDate":"1240121332","msgId":39650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzZWY1ays1cjhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyMjgxMzMwNy0xMjQwMDk0OTc5LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtNDE5Nzg1NTEyLUBieGUxMjY5LmJpc3gucHJvZC5vbi5ibGFja2JlcnJ5Pg=="},"prevInTopic":39648,"nextInTopic":39651,"prevInTime":39649,"nextInTime":39651,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"Naturally *I* think radical unschooling is a better way to live, but chances are, if your kids are reasonably happy now and you try to make a big change,","messageBody":"<div id=\"ygrps-yiv-1108221729\">Naturally *I* think radical unschooling is a better way to live, but chances are, if your kids are reasonably happy now and you try to make a big change, they&#39;ll be confused and possibly hurt and your whole family will come to conclude &quot;this isn&#39;t for us&quot;. It&#39;d be better to wait. You can be kinder and more authentic with your kids without radical unschooling, and that may be all you need. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; ---Meredith (Mo 7, Ray 15)<br/>\n<br/>\n </span></blockquote>I&#39;m confused by your last statement.  Why would it be better to wait?  How can I be kinder or more authentic?  What is all I might need?</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Money obsession - Lots of changes - Stress","postDate":"1240120931","msgId":39651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzZWVwMytqcWFiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUyMzgyMC45MTY4NC5xbUB3ZWI0NTMxNC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39650,"nextInTopic":39652,"prevInTime":39650,"nextInTime":39652,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... Yes, money has been a common theme.  Both my kids have wanted to earn money since they were young.  Both have wanted to start businesses from lemonade","messageBody":"<div id=\"ygrps-yiv-1309957921\"><blockquote><span title=\"ireply\">&gt; I have noticed a common trend in a few things you have mentioned, money. Is this really an important part of every activity? In the original post you mentioned them playing musical instruments, 4H animal husbandry, and baby sitting. <br/>\n<br/>\n </span></blockquote>Yes, money has been a common theme.  Both my kids have wanted to earn money since they were young.  Both have wanted to start businesses from lemonade stands to garage sales to selling jewelry and much more.  I&#39;m the one who actually prevents it most of the time because it seems too much work!  My daughter wants to save for a house and car.  My son just wants it, to spend or otherwise.  I have always tried to set an example of saving, but the entrepreneurship has been stifled by moves.  My daughter is not at all motivated by money currently and will often ignore Grandparents offers of jobs to earn it.  She is motivated by social interactions.  My son will do about anything asked.  I have no idea why it is important to him.  It just always has been.<br/>\n<br/>\nBut, no, it is not at all an important part of every activity.  We do most things just for fun.  Swimming, soccer, sketching, reading, etc.  But, I do admit that I have my eye out for what it could lead to in the future because we so often have been on shaky ground with jobs and my folks taught me NOTHING - so I was in plenty of debt when I graduated college.  As a result - I have been super conscious of how we spend our money, and have stayed out of debt since then except for the unemployed time when we had to borrow from family to make the mortgage after 20 months of not selling the house and two 10-month periods of no pay), and I wanted my kids to start out better than I did.<br/>\n<br/>\nSo, I understand that a lot of unschoolers are entrepreneurs.  Do you consider this a negative?  I certainly don&#39;t think we do things only for money - except the busking - that was supposed to have been fun - and I think it was interesting - but my son really only did it for money - so we quit because I wanted it to be for the fun of it.  And, we really don&#39;t do anything just for money - we do it because we like it- it just happens to be the end product of the 4-H stuff at Fair or the jewelry-making (because my son initiates wanting to sell it - not because I want him to - I&#39;d rather not!)  But, it is his desire - so I sometimes help him.  But, we would do it regardless.<br/>\n<br/>\nSo, am I different?  Do other unschoolers not ever do things for money?  I see that if we were doing it only for money - such as the playing music - it would not be great.  But, is it a problem as a by-product of doing what they enjoy if they are the ones asking to do it?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As for fashion designing, that is one I can help with a bit, my daughter is passionate about it. She is reading up on costume design and waiting for us to get my sewing machine out of storage. So she is designing Barbie clothes and jewelry and &quot;real&quot; people jewelry. I have shown her basic stitches but she does have a knack for original creations including making her own patterns. There are a ton of resources out there for learning to sew, the library usually has a lot of them. <br/>\n<br/>\n </span></blockquote>My daughter sketches all sorts of clothing designs and creates paper dolls.  She does it out of the shear love of doing it.  I have asked her ballet teacher to let her help her with costumes - but she didn&#39;t take me up on the request.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I will briefly admit to being a library addict. There are plenty of ways to get socialization (I really dislike that word BTW). Just by being in places, it does not have to be with ones peers. There are usually sewing groups in the area, quilting groups, beading groups, etc. Again the library is the best place to check for these types of groups. People of all ages are usually in attendance and getting mentored in these groups will be far more useful than a basic home ec style class.<br/>\n<br/>\n<br/>\n&gt;  My daughter is going to be going to her first sewing meeting next week and is so excited. There are men in this group as well, two of them retired tailors. I am not sure who is more excited the group as a whole or my daughter. Meeting people does not have to be at the peer level only. In &quot;the real world&quot; we meet people of all ages, walks of life, etc. There is more to gain in diversity. A lot of times the only expense with any of these groups are your own for supplies, no dues or fees, they are formed to their varied experiences and to form friendships with people who have common interests. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We have had plenty of diversity.  We know people from all walks of life, ages, and other status.  We have in the past been in a group of older women for cross-stitch.  This whole last year we have gone to a church with no other kids but ours.  We go to music festivals with few kids.  I&#39;m thinking about going to a quilting group in a town near here.  The problem is - we are usually with adults - and older ones at that.  For a long time, we simply did not have any children to be with, except at a couple classes.  They have plenty of opportunities, and have for years done classes or things with adults - but they long for the companionship of other kids - especially coming to our home.  They are VERY &quot;socialized&quot; with ALL age groups and easily interact with them all - that&#39;s why we get compliments on them  a lot.  <br/>\n<br/>\nBut, my daughter especially has NEEDED a special friend her own age.  She finally got one a few months ago, and they are best friends (better than I ever had for sure), but now she can&#39;t see her due to the girl&#39;s family issues and troubles which keeps her away.  So, my daughter is having to find others to fill the void where just recently she felt completely satisfied and didn&#39;t feel it mattered if she had any other kids.  We have lots of adults we have fun with and camp with and garden with.  They just WANT kids.  I keep encouraging them to utilize adults, but sometimes they just aren&#39;t interested.  Though, it is not in the same way as public school kids who can&#39;t seem to interact or don&#39;t feel any connection.  They connect fine.  They just feel a little lack luster sometimes - I think, again, due to constant moves and the deep desire to have a special same-age friend.<br/>\n<br/>\nEven though her best friend is inaccessible right now, I think just having one has made all the difference in her happiness and peace of leaving our previous homes.  She seems much more content and happy and excited about her own life.<br/>\n<br/>\nWe have a VERY tiny library - and a very small community.  So, no one meets there for activities except the kids once a month for an activity and then it is all adult meetings like activist stuff, adult (boring for kids) Spanish, etc.  And, though the opportunities seem like many, it is really a community for adults and most things revolve around them.  I have tried to get the locals to mentor my kids, but have little luck in consistency and regularity.  And, I&#39;ve tried to get permission to let my daughter take the adult art classes she would love - but no go.  We even have a guy at church that teaches woodworking at the private school - but he doesn&#39;t want to really help us with our project because he feels he shouldn&#39;t help homeschoolers since it seems like a conflict of interest to him - and we don&#39;t have a place to do it.   And, I tried to get an older couple who fiddle to take us in - but health and family keeps him from doing it.  And, I found a lady that does embroidery - but her family affairs have prevented her from mentoring yet, too.  And, this is a community of artists - so all seem to think I should pay them.  So, I am trying - it&#39;s just slow going.  We have one older guy and an older woman that do try to take our kids under their  wings.  They camped with us and come over to sing and hike and canoe and other things.  But, they are VERY active people and we haven&#39;t really done anything for months.  And, we have a woman I asked to be another source for female adult mentoring - and we had a couple get-togethers with her.  I have even asked another ballet teacher that believes in mentoring and got lots of mentors for her own daughter - but she really only wants to deal with adults now.  I do want those constant, multi-generational connections that provide connection to a community.  My kids like all the adults fine.  They just want kids, too.  Thus, camps are important to them.  But, I do understand the benefits and desire to foster older mentors for my kids.  It just takes time.<br/>\n<br/>\nSo, does any of this seem a problem as far as unschooling?  I am still listening and trying to learn and understand.  Though, my husband seems to be having a lot of difficulty with the ideas of letting them do what they want all the time.  I am concerned about that as a conflict.  But, I&#39;m waiting to see how other things shake out and give him the opportunity to read on his own about unschooling.<br/>\n<br/>\nI think it may be hard for a lot of people to understand some of the needs going on here if they haven&#39;t experienced living in constant change since 2001 and loosing jobs and friends and activities and security - changing churches and beliefs and religions - living in a tiny trailer and a tent and a moldy mobile home and someone&#39;s house and with grandparents - not seeing your dad for six months due to a job - leaving your best cousin to live far away - leaving your favorite sport behind - living in a community that just didn&#39;t accept you - and finally finding the best friend of your life - only to lose her - and more.  It&#39;s a lot for anyone to take. <br/>\n<br/>\nSo, I&#39;m all about simply trying to stabilize their environment and trying to find what they want to do and with whom.  My son wanted to be on 3 soccer teams last year - so I let him.   This year - he finally narrowed it to one - and we all feel good about that.  My daughter &#39;begged&quot; for more activities, and we now live in town in a house only I don&#39;t care for because that seems to be what all the rest of my family wanted and needed - and it has been beneficial.  She no longer cries every night.  She has stated empathically that she is never moving again - and really loves all the things she is involved in.  I finally think she is stable and contented and happy.  She just still wants more permanent relationship and reciprocation with her age friends.  That&#39;s why she wonders about school - more kids - even though her best friend HATED school and was happy to homeschool.<br/>\n<br/>\nSo - if you see any concerns about this - I can understand and will listen.  I just need you to understand that decisions have been made based on a lot of grief and loss of our old lives and friends and what seemed to work to make our daughter find some healing and  peace with our lives now.  My son is at an age and temperament that he was not much affected.  He is a prime target for unschooling.  He is definitely internally motivated for all sorts of things - and actively pursues them.   But he has only a couple kids that play with him and they are not his age.  He notices that, but it hasn&#39;t bothered him quite as much.  We just don&#39;t have the homeschool group support because they already seem to have their groups and just don&#39;t let us in much - only superficially at lessons.  That&#39;s why I started the homeschool 4-H - to encourage families to get together with us - not just kids.<br/>\n<br/>\nI don&#39;t mean this to be a sob story - and obviously could say more.  There are plenty of other concerns and problems we have to deal with.  I just want you to understand a little of where we are coming from so you can maybe understand why we are here and help us get to a more magical place where fear doesn&#39;t reign for me and my kids feel supported to achieve their dreams - and we all live together in mutual respect and genuine interest and joy for each others company and individual dreams and goals.  My kids seem to feel loved and happy.  They enjoy the little routines we have for bedtime and some different things we do as a family.  They are excited about their lives.  We are very close and open and honest.  <br/>\n<br/>\nBut, I recognize there is too much stress on my part and my husbands part and we often demand instead of request.  I found myself telling my husband to please just say yes today.  But, he is having a lot of difficulty when he comes home to a messy house after working all day and driving over an hour home and grocery shopping and really expects them to pull their weight to help out.  And, I find that I need a more orderly house in order to be fully present for them.  I just want to figure out where to go from here, and how.</div>","specialLinks":[]},{"userId":179855323,"authorName":"Betj","from":"&quot;Betj&quot; &lt;bkind28@...&gt;","profile":"bkind28","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 4-H","postDate":"1240094978","msgId":39648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMjgxMzMwNy0xMjQwMDk0OTc5LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtNDE5Nzg1NTEyLUBieGUxMjY5LmJpc3gucHJvZC5vbi5ibGFja2JlcnJ5Pg==","inReplyToHeader":"PGdzZDMyOStvaDBvQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzYmxzcitmcWs3QGVHcm91cHMuY29tPjxnc2QzMjkrb2gwb0BlR3JvdXBzLmNvbT4="},"prevInTopic":39647,"nextInTopic":39650,"prevInTime":39647,"nextInTime":39649,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"Great point Meredith! My son is in school by choice. He was out 6 wks last year but seems to like it. He wanted to go back this year. I don t make him go to","messageBody":"<div id=\"ygrps-yiv-1818434171\">Great point Meredith! My son is in school by choice. He was out 6 wks last year but seems to like it. He wanted to go back this year. I don&#39;t make him go to bed and he goes when he&#39;s ready. I give him choices and encourage interests. I don&#39;t make him continue with a pursuit just because he started it. He sometimes ask why I get these postings with him in school and I tell him it&#39;s because I learn from them. It&#39;s a wonderful thing to use what I learn to better our relationship! \r<br/>\nBeth\r<br/>\nSent from my Verizon Wireless BlackBerry\r<br/>\n\r<br/>\n-----Original Message-----\r<br/>\nFrom: &quot;Meredith&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt;\r<br/>\n\r<br/>\nDate: Sat, 18 Apr 2009 17:36:09 \r<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;\r<br/>\nSubject: [unschoolingbasics] Re: 4-H\r<br/>\n\r<br/>\n\r<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:\r<br/>\n&gt;&gt; Is competition an anti-unschooling line of thought?  I&#39;ve wondered.\r<br/>\n\r<br/>\nSome kids love to compete, others don&#39;t, or don&#39;t care. Its one thing to support a child who loves to compete, another to set a child up to compete when he or she would be just as happy (or happier) not. Competition can do a number on a person&#39;s self-esteem - regardless of whether they win or lose. \r<br/>\n\r<br/>\nYou&#39;ve said you have a lot of fears where your kids are concerned, which you seem, from the comments you&#39;ve made here, to relieve by focussing on their (present and future) success. So its possible your kids have come to value setting and meeting goals, and even competing, as a way to please you and calm your fears. \r<br/>\n\r<br/>\nDo your kids want to shift to radical unschooling? Its hard to tell from your posts. Do the people in your family seem content with the relationships y&#39;all have? Most people who come to unschooling with older kids do so because the kids aren&#39;t happy. Naturally *I* think radical unschooling is a better way to live, but chances are, if your kids are reasonably happy now and you try to make a big change, they&#39;ll be confused and possibly hurt and your whole family will come to conclude &quot;this isn&#39;t for us&quot;. It&#39;d be better to wait. You can be kinder and more authentic with your kids without radical unschooling, and that may be all you need. \r<br/>\n\r<br/>\n---Meredith (Mo 7, Ray 15)\r<br/>\n\r<br/>\n\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 4-H","postDate":"1240076169","msgId":39647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzZDMyOStvaDBvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzYmxzcitmcWs3QGVHcm91cHMuY29tPg=="},"prevInTopic":39646,"nextInTopic":39648,"prevInTime":39646,"nextInTime":39648,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... Some kids love to compete, others don t, or don t care. Its one thing to support a child who loves to compete, another to set a child up to compete when he","messageBody":"<div id=\"ygrps-yiv-1214967099\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Is competition an anti-unschooling line of thought?  I&#39;ve wondered.<br/>\n<br/>\n </span></blockquote>Some kids love to compete, others don&#39;t, or don&#39;t care. Its one thing to support a child who loves to compete, another to set a child up to compete when he or she would be just as happy (or happier) not. Competition can do a number on a person&#39;s self-esteem - regardless of whether they win or lose. <br/>\n<br/>\nYou&#39;ve said you have a lot of fears where your kids are concerned, which you seem, from the comments you&#39;ve made here, to relieve by focussing on their (present and future) success. So its possible your kids have come to value setting and meeting goals, and even competing, as a way to please you and calm your fears. <br/>\n<br/>\nDo your kids want to shift to radical unschooling? Its hard to tell from your posts. Do the people in your family seem content with the relationships y&#39;all have? Most people who come to unschooling with older kids do so because the kids aren&#39;t happy. Naturally *I* think radical unschooling is a better way to live, but chances are, if your kids are reasonably happy now and you try to make a big change, they&#39;ll be confused and possibly hurt and your whole family will come to conclude &quot;this isn&#39;t for us&quot;. It&#39;d be better to wait. You can be kinder and more authentic with your kids without radical unschooling, and that may be all you need. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] 4-H","postDate":"1240072843","msgId":39646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyMzgyMC45MTY4NC5xbUB3ZWI0NTMxNC5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGdzYmxzcitmcWs3QGVHcm91cHMuY29tPg==","referencesHeader":"PGdzYmxzcitmcWs3QGVHcm91cHMuY29tPg=="},"prevInTopic":39645,"nextInTopic":39647,"prevInTime":39645,"nextInTime":39647,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"I have noticed a common trend in a few things you have mentioned, money. Is this really an important part of every activity? In the original post you mentioned","messageBody":"<div id=\"ygrps-yiv-1635442588\">I have noticed a common trend in a few things you have mentioned, money. Is this really an important part of every activity? In the original post you mentioned them playing musical instruments, 4H animal husbandry, and baby sitting. <br/>\n<br/>\n <br/>\nAs for fashion designing, that is one I can help with a bit, my daughter is passionate about it. She is reading up on costume design and waiting for us to get my sewing machine out of storage. So she is designing Barbie clothes and jewelry and &quot;real&quot; people jewelry. I have shown her basic stitches but she does have a knack for original creations including making her own patterns. There are a ton of resources out there for learning to sew, the library usually has a lot of them. I will briefly admit to being a library addict. There are plenty of ways to get socialization (I really dislike that word BTW). Just by being in places, it does not have to be with ones peers. There are usually sewing groups in the area, quilting groups, beading groups, etc. Again the library is the best place to check for these types of groups. People of all ages are usually in attendance and getting mentored in these groups will be far more useful than a basic home ec style<br/>\n class. My daughter is going to be going to her first sewing meeting next week and is so excited. There are men in this group as well, two of them retired tailors. I am not sure who is more excited the group as a whole or my daughter. Meeting people does not have to be at the peer level only. In &quot;the real world&quot; we meet people of all ages, walks of life, etc. There is more to gain in diversity. A lot of times the only expense with any of these groups are your own for supplies, no dues or fees, they are formed to their varied experiences and to form friendships with people who have common interests. <br/>\n<br/>\n<br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"4-H paperwork","postDate":"1240033526","msgId":39645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYnBkbSttM3NrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDkwNDE1MTAzNTE4LmZ0MmEwN3AwbWN3c3drMGNAd2VibWFpbC5sb2NhbG5ldC5jb20+"},"prevInTopic":39644,"nextInTopic":39646,"prevInTime":39644,"nextInTime":39646,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... Missouri was that way about presentations, which I didn t mind because my kids are great with public speaking.  But, I know others who wouldn t do it - and","messageBody":"<div id=\"ygrps-yiv-1179241841\"><blockquote><span title=\"ireply\">&gt;   No reason to let the paperwork stuff ruin the 4-H activities.  This <br/>\n&gt; will be our last year because other requirements of 4-H (public <br/>\n&gt; presentations) have now ruined it for my son, who has done 2 but <br/>\n&gt; doesn&#39;t want to do any more.  That&#39;s another story- we tried lots of <br/>\n&gt; ways to problem solve with our 4-H office, but they are adamant that <br/>\n&gt; presentations be done their way, without flexibility for kids who don&#39;t <br/>\n&gt; feel comfortable doing them.<br/>\n<br/>\n </span></blockquote>Missouri was that way about presentations, which I didn&#39;t mind because my kids are great with public speaking.  But, I know others who wouldn&#39;t do it - and you can&#39;t get credit for your project if you don&#39;t.  Crazy!  <br/>\n<br/>\nHere in Arkansas, they don&#39;t have to do that, but they don&#39;t get to advance to State until 14-years old!  I hate this age discrimination!  My daughter wanted to go to an entrepreneurship camp 2 years ago in Missouri, but is still 2 years away from being allowed.<br/>\n<br/>\nHave you told them it is either no or you leave 4-H?</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"4-H","postDate":"1240029915","msgId":39644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYmxzcitmcWs3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzYWlpbSs5ODJwQGVHcm91cHMuY29tPg=="},"prevInTopic":39638,"nextInTopic":39645,"prevInTime":39643,"nextInTime":39645,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... I introduced the opportunity, but they want to do it.  My daughter likes to have a goal.  They like finishing and feeling they ve accomplished something.","messageBody":"<div id=\"ygrps-yiv-628273329\"><blockquote><span title=\"ireply\">&gt; You seem to have a huge focus on shows and competitions - is this something that&#39;s important to the kids (as opposed to something you&#39;ve made important)? <br/>\n<br/>\n </span></blockquote>I introduced the opportunity, but they want to do it.  My daughter likes to have a goal.  They like finishing and feeling they&#39;ve accomplished something.  They like the ribbons and sometimes money.  They both enjoyed giving demonstrations at the fair.  They both are confident and like performing and want to show an animal in the ring to show what they have accomplished.  My son thinks he would probably want to do it, but I doubt he would know any difference if I didn&#39;t tell him about it.  He is always happy and content no matter what.<br/>\n<br/>\nIs competition an anti-unschooling line of thought?  I&#39;ve wondered.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If so, are there ways You can enter animals in fairs personally for them to get around the 4H thing? <br/>\n<br/>\n </span></blockquote>Not here.  You MUST be in 4-H to show the animals.  You can do other things outside of 4-H, but you don&#39;t get any money - it is far more lucrative and gets you somewhere in the organization later if you do it through 4-H.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t see anything you&#39;ve listed as a benefit of 4H that can&#39;t be found some other way.<br/>\n<br/>\n </span></blockquote>I&#39;m sure there are other places, I feel that I am forever looking.  It takes over a year or two or three to begin to know what is going on, but we already moved by then.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Something I&#39;ve learned to do is to break things down into smaller parts and look for the underlying needs. What need is met by going to a Babysitting Clinic? <br/>\n<br/>\n </span></blockquote>I didn&#39;t care if she went or not.  She asked to go.  She wants to babysit and thinks she is good with children.  She just wanted to do something with kids and to gain more confidence - kind of an official way to start a job.  I asked her if she just wanted to start babysitting, but she feels this will help her know more.  She doesn&#39;t lack confidence or anything, she just wants to understand how to deal with various situations - she just want s to learn more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;A need to do some nurturing? Let other area moms know you have a child who wants to be a Mother&#39;s Helper - post flyers in grocery stores and libraries. <br/>\n<br/>\n </span></blockquote>She primarily just seems to think it would make her feel good - I assume because it is a step toward maturity.  She knows it is not a big money maker and she can do other things, it is just one little thing she has wanted to do for over a year now.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What needs are met by going to camp? <br/>\n<br/>\n </span></blockquote>I asked my son that (figuring I knew the answer) and he said with a &quot;duh&quot; look on his face, &quot;That&#39;s like asking a kid WHY he wants to play?&quot;  My daughter instantly concurred!  I burst out laughing!  My kids have been to lots of different kinds of camps - Suzuki, church, 4-H, drama, etc. - and they are going to science camps and several others this summer - all their own desire - I just find the camps for them.  They LOVE the chance to be away from home with other kids in a natural setting without Mom since I am always with them.  It gives them a chance to spread their wings and make new friends all on their own.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What needs are met by going to a sewing class? <br/>\n<br/>\n </span></blockquote>My daughter wants to be in fashion and she thinks it will be good to know if that&#39;s waht she chooses to do, and she enjoys it.  She also wants to be with other people, so it is a chance to socialize - which is her primary motivation for ALL of these things.  My son sort-of-kind-of wants to know how to sew and enjoys it and is very proud of the things he makes.  He&#39;s made a football pillow and a bag - both of which he was excited about, etc.  His complaint is the setting is ugly and small and the hand-outs are poor.  But, he does like it and vies for the sewing machine.  He says it depends on what we are making.  He does not really want to make clothes.  He wants to make a pillow gun.  So, I guess I will have to tell the teacher he will do that instead of the shorts she has planned for him.  He is into making all sorts of things - including jewelry and fly-tying and glass beads and more.  So, it kind of goes along with all that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What needs are met by going to a leadership conference? <br/>\n<br/>\n&gt;That was only $25 for a weekend in a hotel in Branson, Missouri to be with a bunch of other kids!  They couldn&#39;t pass that up.  But, it was postponed and we won&#39;t get to go now due to conflicts.  They don&#39;t really know what it is all about, but didn&#39;t care, it would have a pool!<br/>\n<br/>\n&gt;I&#39;ll bet folks on this list can help you find other ways to meet all those needs, that don&#39;t involve shackeling yourself to an organization that sees you as its local workhorse.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I do have mixed feelings.  On the one hand, I think it has already provided us with MANY fun and interesting times and lots of free lessons.  On the other hand, I sometimes HATE the pressure to do certain things that are simply the green monster feeding itself.  In order to get the highest points and the best potential for scholarships, you need to have participated in 4-H events at all levels.  I think it shouldn&#39;t matter whether it was 4-H or not, or where it was held.  And, they hold my kids back in Arkansas.  Here, they can&#39;t go to State with their things because they are too young.  In Missouri, they went to State 2 years ago and won blue ribbons!!!  It is annoying.<br/>\n<br/>\nBut, they both say they want to stay in 4-H, so I keep doing it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You seem to be going a million directions at once! Isn&#39;t that stressful? <br/>\n<br/>\n </span></blockquote>Yes, sometimes.  And, then, no sometimes.  I like what we do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;There&#39;s a tremendous value in having time to simply Be - beyond the philosophical/spiritual value, that is. Kids need time for all the thousands of connections they are making every day to settle a little. They learn better with some downtime. Stress makes it harder to learn anything, at any age.<br/>\n<br/>\n </span></blockquote>I hear you, and sometimes I feel that is all I want.  But, many days we have that.  We sleep until 11:00 or go swimming or read books.  But, not enough with Dad at all.  But, I think both my kids feel more balanced than I do.  And, our stress is considerably less than it was the last few years.  We have a place to sleep, some friends, enough money to cover our bills, a pretty place to go swimming and fishing, etc.  They seem to like the balance.  There have been times - especially last year, where we only had things going on 2 days a week.  They really, really wanted more - and cried often to go back home - which was impossible. But, they are happy now.   It&#39;s the parents that want more down-time usually.  Not the kids.  But, they are also still looking for settling into friendships.  That has not been easy due to all the moves.  We believe we will be here for a long time, now.  But, I thought that before.  The economy and corporate greed and small-town politics have all contributed to our gypsy life.   But, when I am in the feed store, I&#39;d like nothing better than to have a farm and never leave it!  The kids want it all!</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: was:will kids learn music, now 4-H paperwork","postDate":"1239993750","msgId":39638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYWlpbSs5ODJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzOTU4aCtobzRsQGVHcm91cHMuY29tPg=="},"prevInTopic":39631,"nextInTopic":39644,"prevInTime":39637,"nextInTime":39639,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... ***************************** Do it for them - take dictation, or set up a way to do your records on the computer so they can go to the year-end party even","messageBody":"<div id=\"ygrps-yiv-654793236\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  The year-end journal they turn in for competition will be much more difficult, though.  We are NOT good at keeping track of things right now.  That is when I really wish she was an avid and quick writer.  But, I think she may do alright.  My son, however, will not be able to write at all and it will be chore.  So, I don&#39;t know whether to just forget his journal - which eliminate him from getting any rewards or a chance to go to the year-end celebration - or what.<br/>\n </span></blockquote>*****************************<br/>\n<br/>\nDo it for them - take dictation, or set up a way to do your records on the computer so they can go to the year-end party even if they don&#39;t get any prizes. <br/>\n<br/>\nYou seem to have a huge focus on shows and competitions - is this something that&#39;s important to the kids (as opposed to something you&#39;ve made important)? If so, are there ways You can enter animals in fairs personally for them to get around the 4H thing? <br/>\n<br/>\nI don&#39;t see anything you&#39;ve listed as a benefit of 4H that can&#39;t be found some other way.<br/>\n<br/>\nSomething I&#39;ve learned to do is to break things down into smaller parts and look for the underlying needs. What need is met by going to a Babysitting Clinic? A need to do some nurturing? Let other area moms know you have a child who wants to be a Mother&#39;s Helper - post flyers in grocery stores and libraries. What needs are met by going to camp? What needs are met by going to a sewing class? What needs are met by going to a leadership conference? I&#39;ll bet folks on this list can help you find other ways to meet all those needs, that don&#39;t involve shackeling yourself to an organization that sees you as its local workhorse.<br/>\n<br/>\nYou seem to be going a million directions at once! Isn&#39;t that stressful? It would drive me nuts. We&#39;re only going a hundred directions at once, at my house ;) There&#39;s a tremendous value in having time to simply Be - beyond the philosophical/spiritual value, that is. Kids need time for all the thousands of connections they are making every day to settle a little. They learn better with some downtime. Stress makes it harder to learn anything, at any age.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: was:will kids learn music, now 4-H paperwork","postDate":"1239947345","msgId":39631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOTU4aCtobzRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY5OTA4MS4xOTQ4NC5xbUB3ZWI1MDQwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39617,"nextInTopic":39638,"prevInTime":39630,"nextInTime":39632,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... It is possible to plan the fun stuff that I do without 4-H, definitely.  I have planned and done spelunking, ice skating, sewing a bag, having a chef show","messageBody":"<div id=\"ygrps-yiv-1849657123\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Gwen &lt;willow_selene@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t know anything about how 4-H works, but is it possible to just plan the fun stuff without being a member of 4-H?  Does being a member of 4-H give your group special access to activities that you wouldn&#39;t otherwise have?<br/>\n<br/>\n<br/>\n </span></blockquote>It is possible to plan the fun stuff that I do without 4-H, definitely.  I have planned and done spelunking, ice skating, sewing a bag, having a chef show us how to bake something, learning how to give a presentation, making greeting cards to sell, etc.<br/>\nBut, the bonus to 4-H is huge.  They can take animals to the fair and make money. They can&#39;t enter animals in this fair if they don&#39;t belong to 4-H.  They can go to the Babysitting Clinic.  They can compete at District and State O&#39;Ramas in anything that they want - like ballet, singing, speaking, showmanship (I don&#39;t really know what all because I&#39;ve never done it)  They have opportunities for scholarships to college and camps and leadership conferences.  We will be attending a day at a camp to compete in Wildlife Habitat (never done that before either, so don&#39;t know what to expect - but thought just going to camp and being with the kids would be an experience).  They are going to a 3-day summer camp.  They will go to a 3-day summer sew-and-swim camp here.  They have a Fun with Food day and more.  We get free sewing classes every month.  When we lived in Missouri, we got free horseback riding lessons every week!  And the list goes on.<br/>\n<br/>\nThese are events that I simply cannot do that are local, county, district, and state-wide.  It is just a door to opportunity if they want it.<br/>\n<br/>\nIn some states, your family can be a club by themselves, but not here.  I may cave and join another group - but they are all in other towns and with homeschoolers and locals that are not friendly toward our more liberal views and methods.  Many of them are suspicious of anyone from our town because we are the liberal town for the entire state.  And, my daughter didn&#39;t like the other group and wanted me to start this one.  She has more opportunity in my group to be in leadership - which she wanted.  She is still glad I&#39;m leader, even though we&#39;re having a rough go of it.  And, the office told me just to keep going right now and not worry about lack of members because they really wanted a group in my town.  So, we&#39;re doing that minus meetings currently.<br/>\n<br/>\nI guess I don&#39;t mind if I can just keep going and go ahead and write up the notes for her myself.  The year-end journal they turn in for competition will be much more difficult, though.  We are NOT good at keeping track of things right now.  That is when I really wish she was an avid and quick writer.  But, I think she may do alright.  My son, however, will not be able to write at all and it will be chore.  So, I don&#39;t know whether to just forget his journal - which eliminate him from getting any rewards or a chance to go to the year-end celebration - or what.</div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: was:will kids learn music, now 4-H paperwork","postDate":"1239905939","msgId":39617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5OTA4MS4xOTQ4NC5xbUB3ZWI1MDQwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGdzNnEzNCtiZzNiQGVHcm91cHMuY29tPg=="},"prevInTopic":39596,"nextInTopic":39631,"prevInTime":39616,"nextInTime":39618,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"I don t know anything about how 4-H works, but is it possible to just plan the fun stuff without being a member of 4-H?  Does being a member of 4-H give your","messageBody":"<div id=\"ygrps-yiv-1367813603\">I don&#39;t know anything about how 4-H works, but is it possible to just plan the fun stuff without being a member of 4-H?  Does being a member of 4-H give your group special access to activities that you wouldn&#39;t otherwise have?<br/>\n<br/>\nGwen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 4/16/09, uuhomeschooler2 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:publicprofile34@...\">publicprofile34@...</a>&gt; wrote:<br/>\nSo, for a couple months now, I&#39;ve just scheduled fun stuff and nixed the<br/>\nmeetings.  I&#39;m wondering when the office will crack down on me for that.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: was:will kids learn music, now 4-H paperwork","postDate":"1239870372","msgId":39596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzNnEzNCtiZzNiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDkwNDE1MTAzNTE4LmZ0MmEwN3AwbWN3c3drMGNAd2VibWFpbC5sb2NhbG5ldC5jb20+"},"prevInTopic":39584,"nextInTopic":39617,"prevInTime":39595,"nextInTime":39597,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"... Yes, I could help , but she simply doesn t want to do it, and I don t either! ... Yes, I think just doing it for her is better right now. ... I know that","messageBody":"<div id=\"ygrps-yiv-807611938\"><blockquote><span title=\"ireply\">&gt;   My friend (who does school at home with her kids) and I started a <br/>\n&gt; homeschool 4-H group 3 years ago.  We have had a variety of kids in the <br/>\n&gt; officer positions: we&#39;ve had a secretary who didn&#39;t write yet, a <br/>\n&gt; president who didn&#39;t read yet, etc.  Our answer to the paperwork <br/>\n&gt; problem was &quot;helping the kids do it&quot;. <br/>\n&gt; <br/>\n </span></blockquote>Yes, I could &quot;help&quot;, but she simply doesn&#39;t want to do it, and I don&#39;t either!  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Some families felt comfortable with helping their kids with it at <br/>\n&gt; home, for the families who did not, we found solutions such as: meeting <br/>\n&gt; ahead of time for a few minutes with the secretary to go over the mtg <br/>\n&gt; minutes she would read aloud at the mtg, making a checklist type format <br/>\n&gt; where she only needed to fill in the blanks to take minutes, or just <br/>\n&gt; assigning and adult helper to take the notes or fill out treasury <br/>\n&gt; reports or what not.  Or one of the leaders would just do it- no biggie.<br/>\n<br/>\n </span></blockquote>Yes, I think just doing it for her is better right now.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;   No reason to let the paperwork stuff ruin the 4-H activities.  This <br/>\n&gt; will be our last year because other requirements of 4-H (public <br/>\n&gt; presentations) have now ruined it for my son, who has done 2 but <br/>\n&gt; doesn&#39;t want to do any more.  That&#39;s another story- we tried lots of <br/>\n&gt; ways to problem solve with our 4-H office, but they are adamant that <br/>\n&gt; presentations be done their way, without flexibility for kids who don&#39;t <br/>\n&gt; feel comfortable doing them.<br/>\n<br/>\n </span></blockquote>I know that some States and counties are like that.  Mine is much easier to work with, but, my group is struggling because I&#39;m the lone-ranger - and one family broke up and quit and the other just comes and goes as they like.  So, that&#39;s why I&#39;m feeling burdened.  My kids are liking the opportunities, though, so I am trying to keep it up, at least in pretense.  My daughter wanted to go to a babysitting clinic this weekend and have chicks and go to a weekend retreat - all 4-H.  So, we&#39;re still trying to make it happen.  But, it does many times seem at odds with unschooling.  You know they don&#39;t like the meetings.<br/>\nSo, for a couple months now, I&#39;ve just scheduled fun stuff and nixed the meetings.  I&#39;m wondering when the office will crack down on me for that.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;   But, we are instead starting a homeschool co-op to fill our need for <br/>\n&gt; some contact with other homeschooling families.  Now- if we just had <br/>\n&gt; some unschoolers around here....<br/>\n<br/>\n </span></blockquote>YES!  I can&#39;t find any even relaxed homeschoolers, let alone unschoolers.  Most all that I know are very hardcore curriculum.  But, I have contacted some from some other yahoo groups and am hoping to get some connection.<br/>\n<br/>\nThanks</div>","specialLinks":[]},{"userId":346413918,"authorName":"bokusfam@localnet.com","from":"bokusfam@...","profile":"amandabokus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"was:will kids learn music, now 4-H paperwork","postDate":"1239806118","msgId":39584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDkwNDE1MTAzNTE4LmZ0MmEwN3AwbWN3c3drMGNAd2VibWFpbC5sb2NhbG5ldC5jb20+"},"prevInTopic":0,"nextInTopic":39596,"prevInTime":39583,"nextInTime":39585,"topicId":39584,"numMessagesInTopic":0,"msgSnippet":"Hi there.  I just wanted to chime in about 4-H paperwork. My friend (who does school at home with her kids) and I started a homeschool 4-H group 3 years","messageBody":"<div id=\"ygrps-yiv-90819168\">Hi there.  I just wanted to chime in about 4-H paperwork.<br/>\n<br/>\n  My friend (who does school at home with her kids) and I started a <br/>\nhomeschool 4-H group 3 years ago.  We have had a variety of kids in the <br/>\nofficer positions: we&#39;ve had a secretary who didn&#39;t write yet, a <br/>\npresident who didn&#39;t read yet, etc.  Our answer to the paperwork <br/>\nproblem was &quot;helping the kids do it&quot;. <br/>\n<br/>\n  Some families felt comfortable with helping their kids with it at <br/>\nhome, for the families who did not, we found solutions such as: meeting <br/>\nahead of time for a few minutes with the secretary to go over the mtg <br/>\nminutes she would read aloud at the mtg, making a checklist type format <br/>\nwhere she only needed to fill in the blanks to take minutes, or just <br/>\nassigning and adult helper to take the notes or fill out treasury <br/>\nreports or what not.  Or one of the leaders would just do it- no biggie.<br/>\n<br/>\n  No reason to let the paperwork stuff ruin the 4-H activities.  This <br/>\nwill be our last year because other requirements of 4-H (public <br/>\npresentations) have now ruined it for my son, who has done 2 but <br/>\ndoesn&#39;t want to do any more.  That&#39;s another story- we tried lots of <br/>\nways to problem solve with our 4-H office, but they are adamant that <br/>\npresentations be done their way, without flexibility for kids who don&#39;t <br/>\nfeel comfortable doing them.<br/>\n<br/>\n  But, we are instead starting a homeschool co-op to fill our need for <br/>\nsome contact with other homeschooling families.  Now- if we just had <br/>\nsome unschoolers around here....<br/>\n<br/>\n  Best of luck.  Amanda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39657,"nextTopicId":39654}}