{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":220662483,"authorName":"Alice","from":"&quot;Alice&quot; &lt;thesackmans@...&gt;","profile":"alice_in_idaho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 5-yr-old Wants to Go To School","postDate":"1176304524","msgId":23103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2aXUyYys4MjE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGV2Zzlpbis1anZqQGVHcm91cHMuY29tPg=="},"prevInTopic":23093,"nextInTopic":0,"prevInTime":23102,"nextInTime":23104,"topicId":23091,"numMessagesInTopic":0,"msgSnippet":"... My dd wanted to go school last September.  The media is a propaganda mill for how much fun school is!   The kids are bombarded with it and it is hard to","messageBody":"<div id=\"ygrps-yiv-1067324144\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rob_saxon_2001&quot;<br/>\n&lt;TheSaxons@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Our older daughter, Genevieve, has decided that she wants to go to<br/>\n&gt; school.  She started this a year ago, and for a while, her Sunday<br/>\n&gt; School class seemed to address that.  But now she is bringing it<br/>\n&gt; back up again.  <br/>\n<br/>\n<br/>\n </span></blockquote>My dd wanted to go school last September.  The media is a propaganda<br/>\nmill for how much &quot;fun&quot; school is!   The kids are bombarded with it<br/>\nand it is hard to combat that as a parent. <br/>\n<br/>\nAnyway, I talked talked talked to my dd about school but let her know<br/>\nthat I supported her and that it was her choice. We tried to meet her<br/>\nneeds in other ways but she chose to go to school anyway. So off she<br/>\nwent, all excited about learning and making friends and having &quot;FUN&quot;.<br/>\n She would come home with a headache or a stomach ache and say &quot;I am<br/>\nnot going to tomorrow.&quot;  So she wouldn&#39;t go the next day.  Then she<br/>\nwould think, &quot;maybe it is fun?  I&#39;ll go tomorrow!&quot;.  So she alternated<br/>\ndays for the first 3 weeks.  I finally told her that she needed to<br/>\nmake a choice to either go every day or stop going all together<br/>\nbecause I was going to get in trouble if she didn&#39;t start going more<br/>\noften.  So she opted out. <br/>\n<br/>\nShe really was able to see for herself how awful it was.  She thought<br/>\nit was boring and she hated having to ask to go to the bathroom (and<br/>\nonce a teacher told her no).  She hated the &quot;time-out&quot; chair and how<br/>\nshe had to sit in just a certain way when the teacher was reading a<br/>\nstory.  She hated that she couldn&#39;t write the letters in her name the<br/>\nway she had always done it (it wasn&#39;t the &quot;kindergarten way&quot;) She<br/>\ncould hardly think of anything positive to say about it!  And she<br/>\nreally tried to make it work but the fact of the matter is that school<br/>\nsucks!  One night, while she was still attending, we were snuggling in<br/>\nbed and talking about it and she started crying and said, &quot;It&#39;s all<br/>\nlies!  They said it would be fun and that I would learn things but it<br/>\nis all lies!&quot;  I just held her closed and grieved with her over her<br/>\nloss of a dream.<br/>\n<br/>\nWhat this all taught me is that school really does suck.  And if you<br/>\ncontinue to live in a radical unschooling way at home and don&#39;t let<br/>\nyourself get sucked into the &quot;school mentality&quot;, your child (if she<br/>\ngoes) will see through the lies.  Who wouldn&#39;t?  The contrast is too<br/>\nstriking.  Keep your life at home fun and full of joy.  Explore the<br/>\nworld together.  Be their partner.  If she does end up going, do not<br/>\nstop living the RU life because now you have one kid &quot;in school&quot;.  Do<br/>\nnot let school have that kind of power over you or your family.<br/>\n<br/>\nWe fear that our children will become brainwashed, like all the other<br/>\nkids, but I think that can happen only if the parents are also in on<br/>\nthe brainwashing.  If you maintain a radical unschooling lifestyle at<br/>\nhome, the kid will see through the brainwashing that the school is<br/>\ntrying to do to them.  Our kids are too strong of individuals, too<br/>\naware of their ability to make choices, too empowered.  They won&#39;t let<br/>\nschool strip them of that.  Kids that are already stripped of power<br/>\nhave nothing to lose in school and possibly might gain some power<br/>\nthere.  RU kids have their very identities to lose. I am guessing that<br/>\nall RU kids would figure out that school sucks pretty fast.<br/>\n<br/>\nI hope that takes the fear out of it anyway and maybe helps a little!<br/>\n I just want to clarify that I am not saying &quot;send her to school - no<br/>\nproblem&quot;.  What I am saying is that, if after exhausting all other<br/>\npossibilities, your daughter still wants to go to school, continue to<br/>\nlive like RU&#39;ers.  She will get out of school as soon as the negatives<br/>\noutweigh the positives  which will probably be pretty quick.  I would<br/>\ncall the school district and find out how many days she can be absent<br/>\nbefore you get in trouble, just so you know.  And have your intent to<br/>\nhomeschool (or whatever it is you need in your state) ready to go so<br/>\nyou can send it to them and get her out immediately when she says she<br/>\nhas had enough.<br/>\n-Alice<br/>\njoyfully living the RU life with dh Ordell, ds Andrew, dd Audrey and<br/>\nvarious neices and nephews and other kids who come to our happy home</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 5-yr-old Wants to Go To School","postDate":"1176231718","msgId":23093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2Z212Nitwdm41QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGV2Zzlpbis1anZqQGVHcm91cHMuY29tPg=="},"prevInTopic":23091,"nextInTopic":23103,"prevInTime":23092,"nextInTime":23094,"topicId":23091,"numMessagesInTopic":0,"msgSnippet":"Hi Rob One thing that was really helpful for us was being part of a homeschool group (an inclusive, relaxed, eclectic bunch for the most part) from the time DS","messageBody":"<div id=\"ygrps-yiv-672697136\">Hi Rob<br/>\n<br/>\nOne thing that was really helpful for us was being part of a <br/>\nhomeschool group (an inclusive, relaxed, eclectic bunch for the most <br/>\npart) from the time DS was around 3 yrs old - at first it was mostly <br/>\njust the occasional park day and such and then other activities like <br/>\ntrips to the zoo or the fire station or what-have-you. Bottom line <br/>\nwas that by the time he was &quot;school age&quot; he already knew a bunch of <br/>\nkids, his age, older, younger, that all homeschooled. It wasn&#39;t an <br/>\nunusual thing at all, like &quot;everyone else is going&quot; - he knew that <br/>\nkids went to school (a bus stops at the house across the street) but <br/>\nhe also knew that there were bunches of kids that didn&#39;t. <br/>\nInterestingly enough, he got the *opposite* opinion from those kid <br/>\nshows - he decided that school took up too much time and he didn&#39;t <br/>\nwant to give up stuff he was already doing (sleeping late, eating <br/>\nwhen he wanted to, playing games and watching TV and going places) <br/>\nfor the dubious &quot;excitement&quot; of school. It helped having experiences <br/>\nlike spending a day at the park and getting behind a school bus full <br/>\nof kids who had been in school all day. Didn&#39;t take a whole lot for <br/>\nhim to notice the difference between his running and playing day and <br/>\ntheir sit still and quiet day.<br/>\n<br/>\nHave you talked about what specifically it is that she is wanting <br/>\nfrom school? Much of the kid stuff on TV and in books and movies is <br/>\nabout how cool it is at school - playing at recess and so on. Few <br/>\nshow the flip side - sitting at a desk, tests, waiting for meals, <br/>\nbathroom breaks, play time, etc. (FWIW if you can find Recess and <br/>\nThe Weekenders it might help a tiny bit - both of those shows <br/>\nbasically say that there&#39;s school and then there&#39;s exciting LIFE and <br/>\nyou have to survive through school to get to life, at recess, after <br/>\nschool, on weekends and holidays). Maybe riding the bus and doing <br/>\ncraft projects are the big things. Okay, so figure out how to bring <br/>\nthat into her life - it might mean that you do crafts with her in <br/>\nthe evenings if Mom is struggling to handle both girls&#39; needs during <br/>\nthe day. Since I&#39;m at work fulltime, DS (he&#39;s almost 9, never been <br/>\nschooled) and I have biweekly date nights together (the alternate <br/>\nweeks, DS visits with MIL and DH and I have date nights). His choice <br/>\nof what we do - sometimes it&#39;s Starbucks (his favorite spot), <br/>\nsometimes it&#39;s dinner at a fav restaurant, sometimes he requests to <br/>\nstay home and play a board game with just me or we go and watch a <br/>\nDVD together, just us snuggled up. Perhaps setting up a &quot;Craft <br/>\nnight&quot; or, as DS suggested this weekend, a &quot;Science experiment&quot; <br/>\nnight or whatever - whatever will fill what she is expecting school <br/>\nto fulfill - might help.<br/>\n<br/>\nAnd, again, she might choose school anyhow. Might read Guerilla <br/>\nLearning by Grace Llewellyn. Even though she&#39;s in school, your <br/>\nattitudes don&#39;t necessarily need to accept the &quot;line&quot; that schools <br/>\nhand out about grades and test scores and such.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":195592821,"authorName":"rob_saxon_2001","from":"&quot;rob_saxon_2001&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"5-yr-old Wants to Go To School","postDate":"1176218007","msgId":23091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2Zzlpbis1anZqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":23093,"prevInTime":23090,"nextInTime":23092,"topicId":23091,"numMessagesInTopic":0,"msgSnippet":"Hey there, My name is Rob, and I ve been a lapsed lurker for a good while now. We have two girls, ages 5 and just turned 4 (16 months apart). Our older","messageBody":"<div id=\"ygrps-yiv-554798001\">Hey there,<br/>\n<br/>\nMy name is Rob, and I&#39;ve been a lapsed lurker for a good while now. <br/>\nWe have two girls, ages 5 and just turned 4 (16 months apart).  <br/>\n<br/>\nOur older daughter, Genevieve, has decided that she wants to go to<br/>\nschool.  She started this a year ago, and for a while, her Sunday<br/>\nSchool class seemed to address that.  But now she is bringing it back<br/>\nup again.  I think my wife Seana has put it better than I could, so<br/>\nhere is her post to another group.  Sorry for any duplicates.  And<br/>\nthank you for your time and thoughts on this.<br/>\n<br/>\nNote:  Seana&#39;s mom is *mostly* supportive of our unschooling the<br/>\ngirls.  She&#39;s not antagonistic, and she does not try to subvert us,<br/>\neither.<br/>\n<br/>\n--Rob<br/>\nDH to Seana for 10 years<br/>\nDaddy to Genevieve (5.33 years)<br/>\nDaddy to Elissa (Now 4!)<br/>\n<br/>\n***************<br/>\n<br/>\nGenevieve has recently started talking, again, about going to &quot;real<br/>\nschool&quot;.  She told my mom that she wants to learn exciting things.   <br/>\nI know she is bored but when I try to initiate something, she&#39;s not<br/>\ninterested.  I&#39;m not very happy about the idea of putting her in<br/>\npublic, all day, kindergarten and we can&#39;t afford private.  I feel<br/>\nlike I&#39;m failing her.  Elissa demands so much of me that I just don&#39;t<br/>\nhave much for Genevieve.  I try to help her see things and I know that<br/>\nshe isn&#39;t aware of how much she is learning/knows compared to<br/>\n&#39;schooled&#39; kids but it is so hard when everyone is pushing &quot;how fun<br/>\nschool is.&quot;<br/>\nHELP!<br/>\n-- <br/>\nSeana</div>","specialLinks":[]}],"prevTopicId":23099,"nextTopicId":23100}}