{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Explaining unschooling long","postDate":"1153494503","msgId":15938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2NC4yN2FhZmI1LjMxZjI0N2U3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":15937,"nextInTime":15939,"topicId":15938,"numMessagesInTopic":0,"msgSnippet":"I sent this to a local traditional homeschool list in my state  and thought I d FWD it here.. I The original post was seeking a unschool  friendly councilor in","messageBody":"<div id=\"ygrps-yiv-391646807\">I sent this to a local traditional homeschool list in my state  and thought <br/>\nI&#39;d FWD it here.. I The original post was seeking a unschool  friendly <br/>\ncouncilor in my state for a child who had lost a sibling. Another  parent asked the <br/>\ndifference between unschooling and homeschooling. I think her Q  was meaning why <br/>\nan unschool friendly councilor.. Being on this list for  years I know <br/>\nunschooling is a bit misunderstood  as not parenting  (or not as welcomed as <br/>\nAbeka)and more so I wrote this... Laura<br/>\n <br/>\n******************************************************************************<br/>\n****<br/>\n <br/>\nA few parents have said on my unschool list that counselors  sometimes <br/>\nsuggest that the parent do a more structured style of learning or  school to <br/>\ndistract the child from what worries or saddens them. I  disagree with this thinking. <br/>\nSchool is not the way to mend child&#39;s  heart.<br/>\n <br/>\nThe difference between unschooling and homeschooling  (IMO) is more a <br/>\nparenting style/life than an educational one. I realize  that contradicts what <br/>\nsomeone just said and it may make sense to some but I  think that is where the <br/>\nconfusion comes in. The parenting style needs change  before the educational style <br/>\nis openly tweaked/dropped. It is key to success in  unschooling(again IMO). <br/>\nYou cannot unschool if the parent is not on board bc  they are after all the <br/>\n&quot;love&quot; that is needed to support the child along.  Love meaning support that <br/>\nchild seeks guided by them and their interests. Much  more than can be explained <br/>\nin one email..<br/>\n <br/>\nUnschooling is still misunderstood in Maine. I&#39;ve had my  list for a few <br/>\nyears and people still say we unschool except Math  &/or English.. whatever <br/>\nsubject.. unschooling does not focus on  subjects it focuses on a happy family and <br/>\nindividual interests.   Unschooling has become a popular label/style with mixed <br/>\n understanding(at least locally). Allowing a child freedom and then ripping  <br/>\nthe rug out from under them is not unschooling. Once people understand what it <br/>\n &quot;really&quot; is they discover it is one of the top gentlest-child <br/>\ncentered-family  focused styles out there. <br/>\nIt is often the chosen path when crisis hits and a healing one  that focuses <br/>\non the heart of the child.<br/>\n <br/>\nUnschooling is based on 100% supportive 24/7 parental trust.  If that trust <br/>\ncomes and goes it can affect the outcome. <br/>\nI often say one cannot unschool part time bc I feel  it cannot be done <br/>\nsuccessfully on a PT basis. Relaxed homeschool or  unit studies come close <br/>\n(sorta/maybe not) but they are not unschooling bc the  parental trust/relax needs to be <br/>\nthere. A child can enjoy a topic of  interest and get it without a test or <br/>\nlesson plan if they can freely choose how  much or how little time to spend on <br/>\nit.<br/>\nI&#39;m not talking basic trust. What I mean is allowing the child  to be who <br/>\nthey are without drawing the line when something crosses a parental  comfort zone <br/>\nof what they appear to be relaxed about but really had a firm  hidden line <br/>\ndrawn.<br/>\nWe teach our children to try new things and that has to be  something the <br/>\nparent examples. Many parents have no hobbies,play or explore (a  recent <br/>\ndiscussion on one of the ww lists)but <br/>\nexpect the kids to. A child is born curious but it is parent  who limit <br/>\nthat...<br/>\n <br/>\n Many things unschoolers do not do is punish,force  chores,curriculum, spank, <br/>\ncontrol,limit tv, movies,video games, limit/require  certain food etc... On <br/>\nthe surface that sounds wacky but as a former  Marine trust me I know control. <br/>\nThe difference is we don&#39;t have those need-to  do/control bc our children do <br/>\nnot engage in things that cause us alarm or a  want to limit.  We do help guide <br/>\nthem when they seek it.. sure ..but it&#39;s  not anything we make a rule over bc <br/>\nwe don&#39;t have a relationship based on rule  breaking. <br/>\n <br/>\nUnschooling takes some weeks to get and others years. It&#39;s not  a religion <br/>\nbut it certainly takes some a similar time to get there.<br/>\nAs an unschooling parent (radical I guess) of 4 fully  unschooling children <br/>\nages 2-14 (almost 15) I see the difference between my teen  who had some <br/>\nschooling experience and my smaller 3 who did not. <br/>\nMy younger children come to learning more  easily where my son knows and <br/>\nremembers the &quot;you need to learn this&quot; bells  and whistles going off which creates <br/>\na block for him.<br/>\n <br/>\nMy daughter a few weeks ago at 11pm was asking me math  questions. As an uns<br/>\nchool family I don&#39;t label the subject, tell her it&#39;s to  late or continue if <br/>\nshe doesn&#39;t understand it (or want to)bc I know she  will come back to it when <br/>\nshe&#39;s ready(vs me being ready to explain it). I  used life examples like our <br/>\ndogs, food she was eating or items on the  counter we were at. That night we <br/>\ndiscussed multiplication (without the label)  and she understood it. She&#39;s 6 , <br/>\nas an unschooler I didn&#39;t see a need to wait bc  she was doing 2x2 and 4x4. Age <br/>\nor grade doesn&#39;t matter to an unschooler either.  She learned it not from a <br/>\nbook but rather being able to have the time to think  about things in her mind <br/>\nrather than given busy work.  She then came  to me when she wanted more <br/>\ninformation. I never came close to those  conversations with my son who hated school <br/>\nwhen he was her age. <br/>\nThis is getting lengthy...<br/>\n <br/>\nThere is an interview I did in May that might be helpful. It  drags in the <br/>\nbeginning and I cannot speak to some of his political comments  so FFWD over <br/>\nthem if it drags.  <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://wmpg.org/archivefiles/Homedad/2006mp3s/184Unschooling42506.mp3_\">http://wmpg.org/archivefiles/Homedad/2006mp3s/184Unschooling42506.mp3_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://wmpg.org/archivefiles/Homedad/2006mp3s/184Unschooling42506.mp3)\">http://wmpg.org/archivefiles/Homedad/2006mp3s/184Unschooling42506.mp3)</a> <br/>\n <br/>\nClearly Homeschooling works for many, we simply expanded our  lifestyle to <br/>\nunschooling.<br/>\n <br/>\nLaura<br/>\nUnscholingMaine.com<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15932,"nextTopicId":15939}}