{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":28,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223665207","msgId":36525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5NDk3OC4zNDU1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":36513,"nextInTopic":0,"prevInTime":36524,"nextInTime":36526,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I tried responding to this in color. I m having a hard time using yahoo mail to separate my words from the words I m responding to. I don t know that the color","messageBody":"<div id=\"ygrps-yiv-1021800608\">I tried responding to this in color. I&#39;m having a hard time using yahoo mail to separate my words from the words I&#39;m responding to. I don&#39;t know that the color will pass through yahoo groups, but I&#39;m hoping it will be more clear. <br/>\n<br/>\n<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\nI wanted to respond to what you said----<br/>\n<br/>\n~By imagining that they were dead. No joke. <br/>\nWhen I start feeling that resentment building (not just for my children, but Ben or my dogs or cats or my garden or whatever), I imagine what my life would be like withOUT them/it. I CHOSE to have my children, my husband, my pets, my LIFE. Do I *really* want to live withOUT them?<br/>\nAlong with a deep breath (or three), this thought jars me right back into contentment, not resentment.~<br/>\n <br/>\nI feel mixed feelings about this only because that doesn&#39;t work for me. It can work and get me through that moment or that day but not that week.<br/>\n&lt;snip&gt;<br/>\n<br/>\nOften the moment is what I need. Often it is only a moment of tension or doubt or fear or anger or whatever that I need to get through, so imagining someone else&#39;s absence from my life is the impetus to speak with the love that I feel instead of with the fearful emotion that I may be also dealing with. In the face of the most frightening thing, Simon or Linnaea dying, the smaller thing seems so much less important. <br/>\n<br/>\n<br/>\nWhen I was a child a friend of mine had a poster in her bathroom that said when you get to the end of your rope tie a knot and hang on. I&#39;ve found that the knot that gives me a moment to breathe is often all I need to come back to the parent that I want to be.<br/>\n<br/>\n&lt;snip&gt;When I made a decision  to become a parent it is like walking a labyrinth, I didn&#39;t know what was on the other side. None of us do..We all walk the journey. In that journey our past childhood stories come up, we have an amazing opportunity to heal them if we choose to, if we are aware of them. Through this journey i realized that I am a woman, a partner and mother and friend .......on and on. They are all the facets of my light. And it is important for me to shine through all of those.&lt;snip&gt;<br/>\n<br/>\nI can&#39;t shine through one aspect without shining through all of me. By focusing on being a kinder, more loving mom I am also a kinder, more loving wife and a kinder, more loving friend. I have found, to my great glee, that my patience is not a finite aspect, I don&#39;t run out of it more quickly because I use it more frequently, nor my love, nor my gentleness.  It&#39;s more like a muscle, the more I exercise it the stronger and more accessible it becomes. <br/>\n<br/>\n&lt;snip&gt;If I only shine in one aspect I am not full, I am not gleaming, I am not happy...And I have done it..I have made promises to myself that I will be the best mom and have succeeded, but the rest of me was altered as my realationships were too. The relationship with myself, my partner, some friends...But I was gleaming as a mother...&lt;snip&gt;<br/>\n<br/>\nIt&#39;s like you are seeing yourself as a series of subjects. You are math or you are English or you are Social Studies. I don&#39;t understand the separation. I understand time constraints, I understand how if you spend most of your time with your children you have less time with other people or on your own, but I certainly don&#39;t see myself as some series of people defined by who I am engaging with. I am always me. And I feel better being me when I feel like I am being better doing whatever it is I am doing. I feel better when I can make someone laugh or smile or feel better about themselves or more amused in my company. I feel better about me when I can engage someone, be it Simon or Linnaea or David or myself or my dad or my friend, whomever. If I am gleaming as a mother I am gleaming as a person. They aren&#39;t separate roles. It just feels so much like you are complicating something by seperating it out into so many different paths radiating out of yourself. <br/>\n<br/>\n&lt;snip&gt;Trying to find myself again and find my way back to the other imortant aspects of my life  were so difficult and a challenge..I felt it was<br/>\neasier to hind behind the mother becasue I was good at it. Through this process it became important to me to find balance and knowing even though I am a mother which I love being, I am a woman first, a life partner second...and some people hate to hear this but mother third..The funny and ironic thing is that my childrens needs tend to come first anyway.lol <br/>\nSo fo me it is more of my mind set to strive for this balance. I feel for me this is the foundation for a happy life for our family- I can empower my children to take care of themselves before taking care of others.. When I have balance then it really looks like the children are coming first. When I am able to feed myself and fill my cup with the things that I need, I am such a better mother at meeting their needs.. They are actually happier children for it as well. The days go so smooth...When I say I am taking care of myself, Trinity says so you can be a better mommy and I love it when you are happy. &lt;snip&gt;<br/>\n<br/>\nIt&#39;s fantastic that it works in your household. If things are going well here saying that I need a moment to breathe or to deal with whatever, works as well. Often my impatience can come from hunger and I am really good at recognizing that and dealing with it. In a moment when I am needed, when Linnaea or Simon or both are at a point of crisis it is essential that I put aside any of my limitations. It is not a moment when I can say that I need to take care of myself, nor is it a moment when I can say that I need to take care of David or company or a conversation I&#39;m having. They have to come first in ways that no one else does. Actually, as I mull that over, anyone who is in need the way they can be in need comes first. It is that I am more exposed to Simon and Linnaea in that kind of need than I ever am to anyone else.<br/>\n<br/>\n&lt;snip&gt;So when I am feeling resentful or loss of patience it is because I have lost the balance, I am so aware that I am not taking care of myself. I choose at that moment to say I love my family and I wouldn&#39;t want<br/>\nthem to not be in my life..Yes it helps shift that moment and that day<br/>\nfor me but if I ignore it it just comes back the next day and the next.<br/>\nSo it is a reminder that I need to fill my cup again. &lt;snip&gt;<br/>\n<br/>\nI agree, sort of. My impatience or resentment can come from things like putting off hunger or a need to pee, so to some extent it is about not taking care of myself. When I&#39;ve decided that my impatience comes from lack of me time, that never works. I can never get enough me time. The decision that I need some sort of separate space to heal myself, or to fill myself doesn&#39;t jibe with the day to day needs of two children who are with me most of the time. It actually makes me more likely to resent the time I&#39;m not getting to myself  if I see that time as something I require for my wellbeing.  Which makes me more likely to be grouchy with Simon and with Linnaea and, particularly, with David. It is much better if I can discover that fulfillment within my day to day life. I do find it all the time. I find it reading a story with Linnaea and smelling her hair as I go. Or listening to Simon tell me about a video game he watched be played on Youtube. The other<br/>\n night he and I cuddled up and watched the first Harry Potter movie halfway through and he knew so much from listening and relistening to the books it was fantastic. And that kind of interaction fills me in ways that me time never could. I fill my cup from their taps. I fill my cup being with them. Knowing that they won&#39;t always be part of my every day makes the time with them that much more fulfilling, really. Day after day and week after week, it helps to know that they are here now, and I am so very, very lucky. <br/>\n<br/>\n &lt;snip&gt;My realtionship needs to be fed as well. That is so important, my children are here b/c of my relationship they deserve to witness a loving relationship through it&#39;s hard time as well as good times. The hard time don&#39;t have to be about yelling but them baring wittness to what healthy communication/ arguement  looks like...But when I am not taking care of me I end up yelling becasue I dont have the energy for anything..Which is what is happening right now in my life..Very difficult.<br/>\n&lt;snip&gt;<br/>\n<br/>\nWhen does your energy wane? I&#39;ve noticed that I tend to crash at fairly regular times of day, which makes it predictable, which also makes it avoidable. I tend to go down before dinner because I&#39;m hungry. So I try and have a snack before dinner. It helps a lot. I also try and set up calming things to do when I&#39;m making dinner. Or I used to when Simon and Linnaea were younger, so they don&#39;t call on me so much. Because I go down that route I also try and up my pre-dinner offerings to Simon and Linnaea. Having them calmer pre-dinner makes it much less likely that I will melt down instead of be helpful. <br/>\n<br/>\n&lt;snip&gt;These are my processes. This is what works for me..And becasue I am very pregnant right now &lt;snip&gt;<br/>\n<br/>\nBeing pregnant means you are going to be more tired and more hungry and working with an energy deficit more often than not. It helps a lot to have energy food readily available and things that your kids can do while you relax. I can remember more than once sleeping in front of a bedroom door where I&#39;d set up really cool things for Simon to play with when I was pregnant with Linnaea. It helps a lot to recognize that it is a limitation of pregnancy and to treat it as such. I used to have power bars available for when I felt edgy when I was pregnant. It helped. It also helped to be transparent with David. It still helps for me to say, I&#39;m sorry, I&#39;m tired and I&#39;m being short with you because I&#39;m wiped out and am more sensitive to things than I would usually be. It isn&#39;t as good as me recognizing those things before I speak, but it is better than me holding on to my angry response even once I&#39;ve recognized that it was driven by my own internal needs rather<br/>\n than based on some failing in David. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question","postDate":"1223648390","msgId":36513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjbm9hNis1MjRpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIwMjgyNzk2NjExQHJydi5uZXQ+"},"prevInTopic":36479,"nextInTopic":36525,"prevInTime":36512,"nextInTime":36514,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"UGH!  I see that all the time too and the tear stained kid faces, the red bloated parent faces... it completely breaks my heart and I just want to say, WHY?","messageBody":"<div id=\"ygrps-yiv-1521849189\">UGH!  I see that all the time too and the tear stained kid faces, the red bloated parent <br/>\nfaces... it completely breaks my heart and I just want to say, WHY?  WHY do they &quot;HAVE&quot; <br/>\nto?  In some cases I have said that and the parent has stopped and taken a moment and <br/>\nsaid, you&#39;re right...  but it was someone I knew who was trying to change things.<br/>\n<br/>\nI am weird in the sense that I compartmentalize things in my head.  I don&#39;t know why, <br/>\ndefense mechanism maybe?  But I have always done things that way.  My brain keeps <br/>\nthings in compartments where they &quot;belong&quot; so I don&#39;t pull something from the &quot;my <br/>\nmother&quot; compartment to use on my husband, children, in-laws.  If that makes any sense <br/>\nto you at all.....LOL  It is just how my brain has set up the buffer zone and it is a good <br/>\nthing for my DH and children that it is that way.  Thanks for the comments, I don&#39;t know <br/>\nabout smart.....might be a little bit wise from what I have been through......but you know <br/>\nwhat you get when you combine humor and intelligence?  A Smart Alek (or wise....lol).  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Janet Gerla &lt;janeteg@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; You are so lucky, smart, wise, whatever. I see so many parents who <br/>\n&gt; say &quot;Well, when *I* was a kid, I had to do (whatever) - so SO DO YOU!!&quot;<br/>\n&gt; <br/>\n&gt; Janet in MN<br/>\n&gt; <br/>\n&gt; At 09:31 AM 10/9/2008, you wrote:<br/>\n&gt; &gt;I am working on me and fixing my past hurt while not involving my <br/>\n&gt; &gt;children in those<br/>\n&gt; &gt;issues because they are growing up with parents that have realized <br/>\n&gt; &gt;there is a better way.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question- OT","postDate":"1223587945","msgId":36479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDA5MTQzMnczZDhjNzFjMG4xZTNjYTBkMmU1OTFlZWE2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdjaXA5bitxczc1QGVHcm91cHMuY29tPg==","referencesHeader":"PDNhOTNmZmYxMDgxMDA4MDUwN3gyYWM1MmNlN2w2ZjYyMjQwZjk0NjczM2M3QG1haWwuZ21haWwuY29tPgkgPGdjaXA5bitxczc1QGVHcm91cHMuY29tPg=="},"prevInTopic":36475,"nextInTopic":36513,"prevInTime":36478,"nextInTime":36480,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Oh how nice.  I love a lot of kids around.  Maybe when Karl gets older.  :) ~Katherine ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-241240821\">Oh how nice.  I love a lot of kids around.  Maybe when Karl gets older.  :)<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/8/08, lyeping2008 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lyeping2008@...\">lyeping2008@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   LOL! Thank Katherine. I&#39;m glad I&#39;ve make someone happy today.<br/>\n&gt;<br/>\n&gt; Talking about soup, yesterday I made butternut, ham and broadbean<br/>\n&gt; soup. I also made a cottage pie which we&#39;re having today, and have<br/>\n&gt; onw on standby in the freezer. I slow roasted a whole chicken that<br/>\n&gt; we had for dinner yesterday with some roast potatoes, and had it in<br/>\n&gt; our caeser salad today, and still have the meaty carcass for maybe<br/>\n&gt; another pot of soup. I&#39;ve decanted a big pot of curry into 2 freezer<br/>\n&gt; container and that will probably be dinner sometime later this week.<br/>\n&gt;<br/>\n&gt; I am effectively having 2 sons now, because DS has found a new best<br/>\n&gt; friend that happened to be in the same village. So we went for a<br/>\n&gt; lovely long sunny walk to the park, stayed there for an hour or so,<br/>\n&gt; went by the bf&#39;s house to get his scooter, and came home with a new<br/>\n&gt; recruit, bf&#39;s sister LOL! So now, I have 3 kids in my front room,<br/>\n&gt; dinner in the oven, and I&#39;m having a lovely dwon time reading my<br/>\n&gt; emails LOL!<br/>\n&gt;<br/>\n&gt; Hugs and love to all<br/>\n&gt; SharonBugs.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223580694","msgId":36475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDA5MTIzMWkxMGYyN2Q1MmtiYzFhMmRlNzFiMTk0MTk3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdjbDRrNytwc3RsQGVHcm91cHMuY29tPg==","referencesHeader":"PDNhOTNmZmYxMDgxMDA4MTA0N21hMTMzYWQ5cDkxZmJhZDMzMDYxZjVhMTdAbWFpbC5nbWFpbC5jb20+CSA8Z2NsNGs3K3BzdGxAZUdyb3Vwcy5jb20+"},"prevInTopic":36474,"nextInTopic":36479,"prevInTime":36474,"nextInTime":36476,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I am all admiration, Amberlee.  My mom raised 4 younger siblings with her older brother.  They did all the kid minding while their parents worked in the","messageBody":"<div id=\"ygrps-yiv-999269764\">I am all admiration, Amberlee.  My mom raised 4 younger siblings with her<br/>\nolder brother.  They did all the kid minding while their parents worked in<br/>\nthe factory.  The hired maid (never met her and I forget her name) kept the<br/>\nhouse and helped with adult wisdom on tougher problems for some insanely low<br/>\namount of money per week.  They had it very hard but somehow made it all<br/>\nhang together and the kids grew up.  So by the time she married my dad to<br/>\nget away from all that at almost 17... well, long story short she had her<br/>\nfirst child a year later and the 2nd 8 years after the 1st.  My sister Beth<br/>\nwas thrilled to have a sibling *and* she was put in charge at a mere 8 years<br/>\nold.  There was no need for that since my mom wasn&#39;t working but it was<br/>\ntradition and I&#39;m sure she had the big time baggage from raising her<br/>\nsiblings.  Beth resents that and she&#39;s a good sport about it.  :(  I wasn&#39;t<br/>\nthere so I don&#39;t know why things panned out like that.<br/>\n<br/>\nGood on you Amberlee for making different choices because you know a better<br/>\nway!  I think you&#39;re already seeing the fruits of better decision making in<br/>\nthat your oldest child willingly volunteers to help out of kindness to his<br/>\nparents.  I think as long as enough options remain available and if<br/>\nsometimes you go on errands and he doesn&#39;t want to or can&#39;t very well for<br/>\nsome reason, you can take the young&#39;uns with you (as I&#39;m sure you have...<br/>\nmany times before when he was too young to safely be of help).  I think<br/>\nthat&#39;s great.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/9/08, amberlee_b &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amberlee16@...\">amberlee16@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   BING! Lightbulb moment....<br/>\n&gt; &gt;<br/>\n&gt; &gt; A couple of things I see. Many children suffer through much longer stages<br/>\n&gt; &gt; of responsibility for themselves (and inappropriately for others as well<br/>\n&gt; &gt; possibly) before they&#39;re ready. They have higher levels of resentment for<br/>\n&gt; &gt; lost freedom and stages of their lives that were swamped by things they<br/>\n&gt; &gt; didn&#39;t choose. For many, this is due to school, or parents, or church or<br/>\n&gt; &gt; whatever, and often it&#39;s a combination of those things. So, not realizing<br/>\n&gt; &gt; parenting would require a high level of devotion to do it right, for many<br/>\n&gt; &gt; the feeling of loss can be very great indeed.<br/>\n&gt;<br/>\n&gt; This is so true! I was *in charge* of my younger siblings by the time I was<br/>\n&gt; 8 years old.<br/>\n&gt; When I made it into middle school I was sick and tired of doing things for<br/>\n&gt; them. Forced to<br/>\n&gt; babysit from 8 on...forced to feed, change diapers, etc. No wonder I didn&#39;t<br/>\n&gt; want to ever<br/>\n&gt; marry or have children. I was a great babysitter/nanny...but I didn&#39;t have<br/>\n&gt; to keep those<br/>\n&gt; kids. I was great at the responsibility end of things, I didn&#39;t want any<br/>\n&gt; children alone or<br/>\n&gt; hurt...but I didn&#39;t want my own.<br/>\n&gt;<br/>\n&gt; Fast forward to meeting my DH and having 3 amazing children. Do I sometimes<br/>\n&gt; feel that<br/>\n&gt; resentment, that I DON&quot;T WANT to cook dinner for the upteenth time and have<br/>\n&gt; to clean it<br/>\n&gt; up myself and then vacuum and pick up the trail of toys the cat brought<br/>\n&gt; down and the<br/>\n&gt; papers my son cut up etc etc....Of course I do feel those things. But I<br/>\n&gt; swallow them, or at<br/>\n&gt; least try to.<br/>\n&gt;<br/>\n&gt; The freedom to run and play, climb trees, read outside, ride my bike was<br/>\n&gt; taken from me.<br/>\n&gt; Not only was school forcing me to &quot;wait for my classmates&quot; to catch up to<br/>\n&gt; where I was<br/>\n&gt; before I was &quot;allowed&quot; to go on and &quot;learn more&quot; I was in charge of 3 kids<br/>\n&gt; younger than I<br/>\n&gt; was and angry angry angry. It wasn&#39;t until recently I was understanding<br/>\n&gt; some of that<br/>\n&gt; anger, and this post and thread really turned on the light. I am not angry<br/>\n&gt; at my children,<br/>\n&gt; it isn&#39;t their fault I have resentment. But I now understand where it was<br/>\n&gt; coming from.<br/>\n&gt; When I was their ages I had a lot more responsibility, I worked, I cleaned,<br/>\n&gt; I babysat. I<br/>\n&gt; wasn&#39;t ASKED to do those things, I was told I had to.<br/>\n&gt;<br/>\n&gt; Because I have tried to parent differently, because we are now unschooling<br/>\n&gt; just about<br/>\n&gt; everything.....my eldest will ask if he can watch the 2 younger ones for an<br/>\n&gt; hour or 2 so<br/>\n&gt; dad and I can go out or so I can shop alone. (We haven&#39;t done date night<br/>\n&gt; that way yet, but<br/>\n&gt; he has stayed home with them while I run to the store to get milk and it<br/>\n&gt; has been fine)...<br/>\n&gt;<br/>\n&gt; I am working on me and fixing my past hurt while not involving my children<br/>\n&gt; in those<br/>\n&gt; issues because they are growing up with parents that have realized there is<br/>\n&gt; a better way.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":187978159,"authorName":"Natalie Picone-Louro","from":"Natalie Picone-Louro &lt;mothers_dance@...&gt;","profile":"mothers_dance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I have a question","postDate":"1223580626","msgId":36474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MDAzNy43MzQ0MS5xbUB3ZWI1MjUxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36468,"nextInTopic":36475,"prevInTime":36473,"nextInTime":36475,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Hi Amber wow besides age difference you were 8 I was 11, sounds like we have done the same things in our childhood. I can so relate to what you mean when you","messageBody":"<div id=\"ygrps-yiv-691421863\">Hi Amber wow besides age difference you were 8 I was 11, sounds like we have done the same things in our childhood. I can so relate to what you mean when you say having to do things and feeling resentful. I feel I have healed so much of my childhood years. But it is like an onion it peels away layer by layer, it doesn&#39;t go away it just gets easier..I know where all of my stuff comes from and it used to be hard not to take it out on Trinity and then I realized what I was doing and worked on seperating myself. I read Raising Our Children Raising Ourselves, and that was my turning point for me, Trinity was 3 and BellaSky was on her way to being born. It isn&#39;t their fault what I have been through. At the same time I love knowing my children have chosen me to teach me and at the same time they need exactly what I have to offer from the experiences I have had. Just as I have chosen my parents.<br/>\nRemembering back my mother basically unschooled us in our home even though we went to school. She instilled so much love and acceptance and trust. There was no need to please her. I can remember always feeling loved, but because of her childhood- she would flip out and go crazy sometimes as well. She didn&#39;t have a support system or a tribe to go to. She didn&#39;t even have my dad. He didn&#39;t know how to help her. <br/>\nWhat I am thankful for is from her experience I learned how important it is to have a support system and a tribe and ask for help. These were things she couldn&#39;t do. So I have taken what she wasn&#39;t able to have in her life as a very young mother-(she had me wehn she was 15yrs old, 4 girls by the age of 24) and make it a priority in my life to be the woman I want to be and that is all of me. My sister and I used to say we get to live the life our parents didn&#39;t get to live. They showed us the path and it is our job to continue and find our own way.<br/>\nThank you for sharing your story.<br/>\nNatalie<br/>\nVisit our blog:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://twodancingpepitas.blogspot.com/\">http://twodancingpepitas.blogspot.com/</a><br/>\n<br/>\nOur deepest fear is not that we are inadequate. Our deepest fear is <br/>\nthat we are powerful beyond measure. <br/>\n- Marianne Williamson<br/>\n<br/>\n&quot;You know you are face-to-face with the unfinished business of your own childhood when you respond with strong negative feelings to your child&#39;s behavior.&quot; (Hendrix and Hunt, 1997)<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187841659,"authorName":"Janet Gerla","from":"Janet Gerla &lt;janeteg@...&gt;","profile":"janeteg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223563579","msgId":36468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMjgyNzk2NjExQHJydi5uZXQ+","inReplyToHeader":"PGdjbDRrNytwc3RsQGVHcm91cHMuY29tPg==","referencesHeader":"PDNhOTNmZmYxMDgxMDA4MTA0N21hMTMzYWQ5cDkxZmJhZDMzMDYxZjVhMTdAbWFpbC5nbWFpbC5jb20+IDxnY2w0azcrcHN0bEBlR3JvdXBzLmNvbT4="},"prevInTopic":36467,"nextInTopic":36474,"prevInTime":36467,"nextInTime":36469,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"You are so lucky, smart, wise, whatever. I see so many parents who say Well, when *I* was a kid, I had to do (whatever) - so SO DO YOU!! Janet in MN","messageBody":"<div id=\"ygrps-yiv-836969108\">You are so lucky, smart, wise, whatever. I see so many parents who <br/>\nsay &quot;Well, when *I* was a kid, I had to do (whatever) - so SO DO YOU!!&quot;<br/>\n<br/>\nJanet in MN<br/>\n<br/>\nAt 09:31 AM 10/9/2008, you wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;I am working on me and fixing my past hurt while not involving my <br/>\n&gt;children in those<br/>\n&gt;issues because they are growing up with parents that have realized <br/>\n&gt;there is a better way. </span></blockquote></div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question","postDate":"1223562695","msgId":36467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjbDRrNytwc3RsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgxMDA4MTA0N21hMTMzYWQ5cDkxZmJhZDMzMDYxZjVhMTdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":36460,"nextInTopic":36468,"prevInTime":36466,"nextInTime":36468,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"BING!  Lightbulb moment.... ... This is so true!  I was *in charge* of my younger siblings by the time I was 8 years old. When I made it into middle school I","messageBody":"<div id=\"ygrps-yiv-1236965970\">BING!  Lightbulb moment....<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; A couple of things I see.  Many children suffer through much longer stages<br/>\n&gt; of responsibility for themselves (and inappropriately for others as well<br/>\n&gt; possibly) before they&#39;re ready.  They have higher levels of resentment for<br/>\n&gt; lost freedom and stages of their lives that were swamped by things they<br/>\n&gt; didn&#39;t choose.  For many, this is due to school, or parents, or church or<br/>\n&gt; whatever, and often it&#39;s a combination of those things.  So, not realizing<br/>\n&gt; parenting would require a high level of devotion to do it right, for many<br/>\n&gt; the feeling of loss can be very great indeed.<br/>\n<br/>\n </span></blockquote>This is so true!  I was *in charge* of my younger siblings by the time I was 8 years old.  <br/>\nWhen I made it into middle school I was sick and tired of doing things for them.  Forced to <br/>\nbabysit from 8 on...forced to feed, change diapers, etc.  No wonder I didn&#39;t want to ever <br/>\nmarry or have children.  I was a great babysitter/nanny...but I didn&#39;t have to keep those <br/>\nkids.  I was great at the responsibility end of things, I didn&#39;t want any children alone or <br/>\nhurt...but I didn&#39;t want my own.<br/>\n<br/>\nFast forward to meeting my DH and having 3 amazing children.  Do I sometimes feel that <br/>\nresentment, that I DON&quot;T WANT to cook dinner for the upteenth time and have to clean it <br/>\nup myself and then vacuum and pick up the trail of toys the cat brought down and the <br/>\npapers my son cut up etc etc....Of course I do feel those things.  But I swallow them, or at <br/>\nleast try to.  <br/>\n<br/>\nThe freedom to run and play, climb trees, read outside, ride my bike was taken from me.  <br/>\nNot only was school forcing me to &quot;wait for my classmates&quot; to catch up to where I was <br/>\nbefore I was &quot;allowed&quot; to go on and &quot;learn more&quot; I was in charge of 3 kids younger than I <br/>\nwas and angry angry angry.  It wasn&#39;t until recently I was understanding some of that <br/>\nanger, and this post and thread really turned on the light.  I am not angry at my children, <br/>\nit isn&#39;t their fault I have resentment.  But I now understand where it was coming from. <br/>\nWhen I was their ages I had a lot more responsibility, I worked, I cleaned, I babysat.  I <br/>\nwasn&#39;t ASKED to do those things, I was told I had to.<br/>\n<br/>\nBecause I have tried to parent differently, because we are now unschooling just about <br/>\neverything.....my eldest will ask if he can watch the 2 younger ones for an hour or 2 so <br/>\ndad and I can go out or so I can shop alone. (We haven&#39;t done date night that way yet, but <br/>\nhe has stayed home with them while I run to the store to get milk and it has been fine)...<br/>\n<br/>\nI am working on me and fixing my past hurt while not involving my children in those <br/>\nissues because they are growing up with parents that have realized there is a better way.</div>","specialLinks":[]},{"userId":224332249,"authorName":"kswestley","from":"&quot;kswestley&quot; &lt;kathenry@...&gt;","profile":"kswestley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question","postDate":"1223524106","msgId":36460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjanV1YStldjgxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIyOTYyNC42NzE2Ni5xbUB3ZWI1MjUxMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36442,"nextInTopic":36467,"prevInTime":36459,"nextInTime":36461,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I haven t read all of the messages, but I wanted to say thank you Natalie- your words REALLY spoke deeply to me.  I can totally relate and it was what I needed","messageBody":"<div id=\"ygrps-yiv-972372192\">I haven&#39;t read all of the messages, but I wanted to say thank you<br/>\nNatalie- your words REALLY spoke deeply to me.  I can totally relate<br/>\nand it was what I needed to read right now.  :)<br/>\n<br/>\nKathryn<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Natalie Picone-Louro<br/>\n&lt;mothers_dance@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I made a decision  to become a parent it is like walking a<br/>\n </span></blockquote>labyrinth, I didn&#39;t know what was on the other side. None of us do..We<br/>\nall walk the journey. In that journey our past childhood stories come<br/>\nup, we have an amazing opportunity to heal them if we choose to, if we<br/>\nare aware of them. Through this journey i realized that I am a woman,<br/>\na partner and mother and friend .......on and on. They are all the<br/>\nfacets of my light. And it is important for me to shine through all of<br/>\nthose. If I only shine in one aspect I am not full, I am not gleaming,<br/>\nI am not happy...And I have done it..I have made promises to myself<br/>\nthat I will be the best mom and have succeeded, but the rest of me was<br/>\naltered as my realationships were too. The relationship with myself,<br/>\nmy partner, some friends...But I was gleaming as a mother...Trying to<br/>\nfind myself again and find my way back to the other imortant aspects<br/>\nof my life  were so difficult and a challenge..I felt it was<br/>\n<blockquote><span title=\"ireply\"> &gt;  easier to hind behind the mother becasue I was good at it. Through<br/>\n </span></blockquote>this process it became important to me to find balance and knowing<br/>\neven though I am a mother which I love being, I am a woman first, a<br/>\nlife partner second...and some people hate to hear this but mother<br/>\nthird..The funny and ironic thing is that my childrens needs tend to<br/>\ncome first anyway.lol <br/>\n<blockquote><span title=\"ireply\"> &gt; So fo me it is more of my mind set to strive for this balance. I<br/>\n </span></blockquote>feel for me this is the foundation for a happy life for our family- I<br/>\ncan empower my children to take care of themselves before taking care<br/>\nof others.. When I have balance then it really looks like the children<br/>\nare coming first. When I am able to feed myself and fill my cup with<br/>\nthe things that I need, I am such a better mother at meeting their<br/>\nneeds.. They are actually happier children for it as well. The days go<br/>\nso smooth...When I say I am taking care of myself, Trinity says so you<br/>\ncan be a better mommy and I love it when you are happy. <br/>\n<blockquote><span title=\"ireply\"> &gt; So when I am feeling resentful or loss of patience it is because I<br/>\n </span></blockquote>have lost the balance, I am so aware that I am not taking care of<br/>\nmyself.  <br/>\n<blockquote><span title=\"ireply\"> &gt; I choose at that moment to say I love my family and I wouldn&#39;t want<br/>\n </span></blockquote>them to not be in my life..Yes it helps shift that moment and that day<br/>\nfor me but if I ignore it it just comes back the next day and the<br/>\nnext. So it is a reminder that I need to fill my cup again.  I am back<br/>\non my path to doing what I need to do to take care of me and address<br/>\nthe issue I am having which always ends up being very healing to<br/>\nmyself and as a result I am a more authentic parent. <br/>\n<blockquote><span title=\"ireply\"> &gt; My realtionship needs to be fed as well. That is so important, my<br/>\n </span></blockquote>children are here b/c of my relationship they deserve to witness a<br/>\nloving relationship through it&#39;s hard time as well as good times. The<br/>\nhard time don&#39;t have to be about yelling but them baring wittness to<br/>\nwhat healthy communication/arguement  looks like...But when I am not<br/>\ntaking care of me I end up yelling becasue I dont have the energy for<br/>\nanything..Which is what is happening right now in my life..Very difficult.<br/>\n<blockquote><span title=\"ireply\"> &gt; These are my processes. This is what works for me..And becasue I am<br/>\n </span></blockquote>very pregnant right now I am very sensative to hearing what works for<br/>\nother people and sometimes thinking to myself well then I must be<br/>\ndoing something wrong if it isn&#39;t working for me or if I try it, it<br/>\ndoesn&#39;t make me feel very good then I feel worse...It is like having<br/>\nbabies all of our bodies work different, we react different, we feel<br/>\ndifferent and we birth different..Birthing ourselves is never the<br/>\nsame as the next person. No birth is alike. <br/>\n<blockquote><span title=\"ireply\"> &gt; I feel I just needed to say this and share..Not to debate anyone or<br/>\n </span></blockquote>disagree. With loving intentions I bare wittness and I hope you all<br/>\nhave too.<br/>\n<blockquote><span title=\"ireply\"> &gt; Be well and take what works for you and leave the rest behind.<br/>\n&gt; <br/>\n&gt; Trying to love myself in my process, Natalie<br/>\n&gt; <br/>\n&gt; Visit our blog:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://twodancingpepitas.blogspot.com/\">http://twodancingpepitas.blogspot.com/</a><br/>\n&gt; <br/>\n&gt; Our deepest fear is not that we are inadequate. Our deepest fear is <br/>\n&gt; that we are powerful beyond measure. <br/>\n&gt; - Marianne Williamson<br/>\n&gt; <br/>\n&gt; &quot;You know you are face-to-face with the unfinished business of your<br/>\n </span></blockquote>own childhood when you respond with strong negative feelings to your<br/>\nchild&#39;s behavior.&quot; (Hendrix and Hunt, 1997)<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223506943","msgId":36442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MDE1My4xNzA4Ny5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGdjaXUxaStibnVlQGVHcm91cHMuY29tPg=="},"prevInTopic":36435,"nextInTopic":36460,"prevInTime":36441,"nextInTime":36443,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Natalie,   I can see how your life experience has made it important for you to feel you need balance between being a mom and everything else you are. My","messageBody":"<div id=\"ygrps-yiv-560192075\">Natalie,<br/>\n <br/>\nI can see how your life experience has made it important for you to feel you need &quot;balance&quot; between being a mom and everything else you are.<br/>\nMy life experience was so different and care-free.<br/>\nYou had to grow up too fast. I admire your strenght.<br/>\nPeople are different and we have different baggages.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187978159,"authorName":"Natalie","from":"&quot;Natalie&quot; &lt;mothers_dance@...&gt;","profile":"mothers_dance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question","postDate":"1223490418","msgId":36435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjaXUxaStibnVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgxMDA4MTA0N21hMTMzYWQ5cDkxZmJhZDMzMDYxZjVhMTdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":36434,"nextInTopic":36442,"prevInTime":36434,"nextInTime":36436,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I agree that I am all of these things all at the same time as well. I don t wake up saying I am a woman first partner second..and so on..It is my way to help","messageBody":"<div id=\"ygrps-yiv-63624084\">I agree that I am all of these things all at the same time as well.  <br/>\nI don&#39;t wake up saying I am a woman first partner second..and so <br/>\non..It is my way to help remind myself of that. That doesn&#39;t say that <br/>\nmy children aren&#39;t important.<br/>\nI just wanted to share my unfoldings of being a mom. <br/>\nMy mother left me and my sisters when I was 11, so I helped raise <br/>\nthree younger siblings at a very young age. I guess I had to grow up <br/>\nreally quickly..And I am greatfull  for my experience and I don&#39;t <br/>\nregret it. It was unfortunate having to be responsable for three <br/>\nchildren while I was still a child but I survived it. Some years in <br/>\ntherapy..lol<br/>\n I couldn&#39;t wait to become a mother..I had Trinity who is now 5 when <br/>\nI was 26. I really didn&#39;t know what it meant to take care of myself <br/>\nuntil after Trinity was born. So balance is very important to becasue <br/>\nI can forget very easily about me and lose myself. And sleeping a <br/>\nlittle bit extra to have balance is not what I was talking about. <br/>\nAnyway I do love being a mom and i love the choices we have made. <br/>\nBellaSky is 2 now and there is another on the way and we are very <br/>\nexcited..Little ones do need us more I am not denying that. I have <br/>\nlittle ones I know..I just know for me that sometimes I need to fill <br/>\nmy cup in order to be the mother I want to be that they deserve me to <br/>\nbe. And it is up to me to give myself permission to do that, and own <br/>\nit. <br/>\nThanks for listening.<br/>\nNatalie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, k &lt;katherand@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;Through this process it became important to me to find balance <br/>\nand<br/>\n&gt; knowing even though I am a mother which I love being, I am a woman <br/>\nfirst, a<br/>\n&gt; life partner second...and some people hate to hear this but mother<br/>\n&gt; third..&lt;&lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; I think it must be easier for some than others who don&#39;t tend to <br/>\nput things<br/>\n&gt; in order chronologically or numerically.  Or maybe I do order things<br/>\n&gt; unconsciously (now that I&#39;m writing it out) and just take it <br/>\nfurther back...<br/>\n&gt; first I didn&#39;t exist at all, then I was a zygote, and when I was <br/>\nborn I was<br/>\n&gt; a baby, then I became a child, and sometime later I finally I had <br/>\nthe<br/>\n&gt; privileges and responsibilities of adulthood and many other roles <br/>\nto fill.<br/>\n&gt; <br/>\n&gt; I am *still* a woman and a partner even while I&#39;m a mother.  I&#39;m a <br/>\ngirl, a<br/>\n&gt; baby, and a child too.  Alas I&#39;m no longer just a zygote.  All the <br/>\nthings I<br/>\n&gt; am take place pretty much simultaneously.  I&#39;ve chosen different <br/>\npriorities<br/>\n&gt; for those things at different points in my life.<br/>\n&gt; <br/>\n&gt; It&#39;s hard to see our roles changing continually and to experience <br/>\nit as<br/>\n&gt; loss.  It was a treasure to be a young&#39;un, but I&#39;ll probably never <br/>\nhave the<br/>\n&gt; freedom to safely be irresponsible as a mother the way I was as a <br/>\nsmall<br/>\n&gt; girl.  I&#39;m still a girl though (so Karl tells me).<br/>\n&gt; <br/>\n&gt; A couple of things I see.  Many children suffer through much longer <br/>\nstages<br/>\n&gt; of responsibility for themselves (and inappropriately for others as <br/>\nwell<br/>\n&gt; possibly) before they&#39;re ready.  They have higher levels of <br/>\nresentment for<br/>\n&gt; lost freedom and stages of their lives that were swamped by things <br/>\nthey<br/>\n&gt; didn&#39;t choose.  For many, this is due to school, or parents, or <br/>\nchurch or<br/>\n&gt; whatever, and often it&#39;s a combination of those things.  So, not <br/>\nrealizing<br/>\n&gt; parenting would require a high level of devotion to do it right, <br/>\nfor many<br/>\n&gt; the feeling of loss can be very great indeed.<br/>\n&gt; <br/>\n&gt; For the sake of our own sanity, thinking through and knowing these <br/>\nthings<br/>\n&gt; can go a long way toward not blaming our children or resenting our <br/>\nfamilies<br/>\n&gt; for our own decisions *and* all those arbitrary decisions of others <br/>\nin our<br/>\n&gt; past.<br/>\n&gt; <br/>\n&gt; Finding ways around our angst is better for our own happiness.  <br/>\nIt&#39;s a whole<br/>\n&gt; lot better for our families.<br/>\n&gt; <br/>\n&gt; ~Katherine<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223488076","msgId":36434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDA4MTA0N21hMTMzYWQ5cDkxZmJhZDMzMDYxZjVhMTdAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDIyOTYyNC42NzE2Ni5xbUB3ZWI1MjUxMi5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDIyOTYyNC42NzE2Ni5xbUB3ZWI1MjUxMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36433,"nextInTopic":36435,"prevInTime":36433,"nextInTime":36435,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"... knowing even though I am a mother which I love being, I am a woman first, a life partner second...and some people hate to hear this but mother third..","messageBody":"<div id=\"ygrps-yiv-1848490341\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;Through this process it became important to me to find balance and<br/>\n </span></blockquote>knowing even though I am a mother which I love being, I am a woman first, a<br/>\nlife partner second...and some people hate to hear this but mother<br/>\nthird..&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI think it must be easier for some than others who don&#39;t tend to put things<br/>\nin order chronologically or numerically.  Or maybe I do order things<br/>\nunconsciously (now that I&#39;m writing it out) and just take it further back...<br/>\nfirst I didn&#39;t exist at all, then I was a zygote, and when I was born I was<br/>\na baby, then I became a child, and sometime later I finally I had the<br/>\nprivileges and responsibilities of adulthood and many other roles to fill.<br/>\n<br/>\nI am *still* a woman and a partner even while I&#39;m a mother.  I&#39;m a girl, a<br/>\nbaby, and a child too.  Alas I&#39;m no longer just a zygote.  All the things I<br/>\nam take place pretty much simultaneously.  I&#39;ve chosen different priorities<br/>\nfor those things at different points in my life.<br/>\n<br/>\nIt&#39;s hard to see our roles changing continually and to experience it as<br/>\nloss.  It was a treasure to be a young&#39;un, but I&#39;ll probably never have the<br/>\nfreedom to safely be irresponsible as a mother the way I was as a small<br/>\ngirl.  I&#39;m still a girl though (so Karl tells me).<br/>\n<br/>\nA couple of things I see.  Many children suffer through much longer stages<br/>\nof responsibility for themselves (and inappropriately for others as well<br/>\npossibly) before they&#39;re ready.  They have higher levels of resentment for<br/>\nlost freedom and stages of their lives that were swamped by things they<br/>\ndidn&#39;t choose.  For many, this is due to school, or parents, or church or<br/>\nwhatever, and often it&#39;s a combination of those things.  So, not realizing<br/>\nparenting would require a high level of devotion to do it right, for many<br/>\nthe feeling of loss can be very great indeed.<br/>\n<br/>\nFor the sake of our own sanity, thinking through and knowing these things<br/>\ncan go a long way toward not blaming our children or resenting our families<br/>\nfor our own decisions *and* all those arbitrary decisions of others in our<br/>\npast.<br/>\n<br/>\nFinding ways around our angst is better for our own happiness.  It&#39;s a whole<br/>\nlot better for our families.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223485773","msgId":36433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2ODA5Ny42OTE5NS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDIyOTYyNC42NzE2Ni5xbUB3ZWI1MjUxMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36432,"nextInTopic":36434,"prevInTime":36432,"nextInTime":36434,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Isn t it funny?! How people can see things differently. I am a mother first since I had my kids. It does work for me to imagine my kids or my husband gone. It","messageBody":"<div id=\"ygrps-yiv-446804325\">Isn&#39;t it funny?! How people can see things differently.<br/>\nI am a mother first since I had my kids.<br/>\nIt does work for me to imagine my kids or my husband gone.<br/>\nIt gets me right back to my priorities.<br/>\nMy kids are my priorities. I am lucky that my wonderful husband Brian thinks the same way I do. That does not mean that I don&#39;t try to find ways to work on my relationship with him. I do.<br/>\nThe other day I spend hours brainstorming and talking to a fellow unschooler mom on sex, taking care of myself so I could do better for my kids and husband and those kind of issues.<br/>\nSure it is important to have a healthy relationship with your partner at home around your children. <br/>\nAbsolutely you should take care of yourself so you can be a better mother.<br/>\nBut doing one thing does not mean you can&#39;t do the other.<br/>\nBeing a mother first does not preclude being a woman, wife and partner.<br/>\nIt just takes more work and creativity.<br/>\nBut right now my kids are little, they are 2 and 6. and they need me as a mother more than anything. It will come the time where they will be like Cameron and I will be like Kelly and  I will be spending the weekend with my girlfriend having girl time and all that entails.<br/>\nMaybe it is because I came into motherhood after I was 36 years old and I had 36 years of doing everything I wanted to do. I dated a lot, traveled a lot, took care of myself a lot, had thousand ( and I mean thousands) of pedicures, manicures, facials and massages on those years. <br/>\nBut I would not trade being home in my sweats with the house dirty, paint in my fingers ( i was just making a shirt decoration with my son for his little sister-his idea), hair unbrushed and wild for any of those things. Being with my kids is truly more important than anything at the moment. <br/>\nI don&#39;t resent them. Even the other morning when I wanted to sleep in for 20 more minutes and my dd wanted me to play with her. It took me a while to get going that day and I butted heads with her for a little. I was tired. My choice to stay in the computer until late. So I took several deep breaths and got up to go play with her. Looking back I do not wish I had slept longer. I wished I had gotten up earlier to play with her. <br/>\nWe don;t know how long we have with our kids. If she was gone would I have looked back and wished I had slept longer so I could be balanced? I don&#39;&#39;t think so.<br/>\nYes my kids are more important. Yes right now I am a mother first. They grow up fast.<br/>\nI want to be there. I will never regret that.<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question- OT","postDate":"1223485559","msgId":36432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjaXA5bitxczc1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgxMDA4MDUwN3gyYWM1MmNlN2w2ZjYyMjQwZjk0NjczM2M3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":36427,"nextInTopic":36433,"prevInTime":36431,"nextInTime":36433,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"LOL! Thank Katherine. I m glad I ve make someone happy today. Talking about soup, yesterday I made butternut, ham and broadbean soup. I also made a cottage pie","messageBody":"<div id=\"ygrps-yiv-1153391311\">LOL! Thank Katherine. I&#39;m glad I&#39;ve make someone happy today. <br/>\n<br/>\nTalking about soup, yesterday I made butternut, ham and broadbean <br/>\nsoup. I also made a cottage pie which we&#39;re having today, and have <br/>\nonw on standby in the freezer. I slow roasted a whole chicken that <br/>\nwe had for dinner yesterday with some roast potatoes, and had it in <br/>\nour caeser salad today, and still have the meaty carcass for maybe <br/>\nanother pot of soup. I&#39;ve decanted a big pot of curry into 2 freezer <br/>\ncontainer and that will probably be dinner sometime later this week. <br/>\n<br/>\nI am effectively having 2 sons now, because DS has found a new best <br/>\nfriend that happened to be in the same village. So we went for a <br/>\nlovely long sunny walk to the park, stayed there for an hour or so, <br/>\nwent by the bf&#39;s house to get his scooter, and came home with a new <br/>\nrecruit, bf&#39;s sister LOL! So now, I have 3 kids in my front room, <br/>\ndinner in the oven, and I&#39;m having a lovely dwon time reading my <br/>\nemails LOL!<br/>\n<br/>\nHugs and love to all<br/>\nSharonBugs.</div>","specialLinks":[]},{"userId":187978159,"authorName":"Natalie Picone-Louro","from":"Natalie Picone-Louro &lt;mothers_dance@...&gt;","profile":"mothers_dance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I have a question","postDate":"1223482793","msgId":36427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyOTYyNC42NzE2Ni5xbUB3ZWI1MjUxMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36422,"nextInTopic":36432,"prevInTime":36426,"nextInTime":36428,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"HI Kelly and everyone.. i have been thinking long and hard on this one and having been around you Kelly for the first time during the hickory conference, I","messageBody":"<div id=\"ygrps-yiv-247222195\">HI Kelly and everyone.. i have been thinking long and hard on this one and having been around you Kelly for the first time during the hickory conference, I really felt heard and held and your compassion. It was awsome to be in your presense.<br/>\n <br/>\nI wanted to respond to what you said----<br/>\n<br/>\n~By imagining that they were dead. No joke. <br/>\nWhen I start feeling that resentment building (not just for my children, but Ben or my dogs or cats or my garden or whatever), I imagine what my life would be like withOUT them/it. I CHOSE to have my children, my husband, my pets, my LIFE. Do I *really* want to live withOUT them?<br/>\nAlong with a deep breath (or three), this thought jars me right back into contentment, not resentment.~<br/>\n <br/>\nI feel mixed feelings about this only because that doesn&#39;t work for me. It can work and get me through that moment or that day but not that week. I can clearly see it works for you and even more so now then before b/c you are actually experiencing not enough time with Cameron. So you are super appreciaiting your time with Duncan knowing that soon when he is older he will be doing the same thing all kids do when they get older..I so appreciate your wisdom.<br/>\nWhen I made a decision  to become a parent it is like walking a labyrinth, I didn&#39;t know what was on the other side. None of us do..We all walk the journey. In that journey our past childhood stories come up, we have an amazing opportunity to heal them if we choose to, if we are aware of them. Through this journey i realized that I am a woman, a partner and mother and friend .......on and on. They are all the facets of my light. And it is important for me to shine through all of those. If I only shine in one aspect I am not full, I am not gleaming, I am not happy...And I have done it..I have made promises to myself that I will be the best mom and have succeeded, but the rest of me was altered as my realationships were too. The relationship with myself, my partner, some friends...But I was gleaming as a mother...Trying to find myself again and find my way back to the other imortant aspects of my life  were so difficult and a challenge..I felt it was<br/>\n easier to hind behind the mother becasue I was good at it. Through this process it became important to me to find balance and knowing even though I am a mother which I love being, I am a woman first, a life partner second...and some people hate to hear this but mother third..The funny and ironic thing is that my childrens needs tend to come first anyway.lol <br/>\nSo fo me it is more of my mind set to strive for this balance. I feel for me this is the foundation for a happy life for our family- I can empower my children to take care of themselves before taking care of others.. When I have balance then it really looks like the children are coming first. When I am able to feed myself and fill my cup with the things that I need, I am such a better mother at meeting their needs.. They are actually happier children for it as well. The days go so smooth...When I say I am taking care of myself, Trinity says so you can be a better mommy and I love it when you are happy. <br/>\nSo when I am feeling resentful or loss of patience it is because I have lost the balance, I am so aware that I am not taking care of myself.  <br/>\nI choose at that moment to say I love my family and I wouldn&#39;t want them to not be in my life..Yes it helps shift that moment and that day for me but if I ignore it it just comes back the next day and the next. So it is a reminder that I need to fill my cup again.  I am back on my path to doing what I need to do to take care of me and address the issue I am having which always ends up being very healing to myself and as a result I am a more authentic parent. <br/>\nMy realtionship needs to be fed as well. That is so important, my children are here b/c of my relationship they deserve to witness a loving relationship through it&#39;s hard time as well as good times. The hard time don&#39;t have to be about yelling but them baring wittness to what healthy communication/arguement  looks like...But when I am not taking care of me I end up yelling becasue I dont have the energy for anything..Which is what is happening right now in my life..Very difficult.<br/>\nThese are my processes. This is what works for me..And becasue I am very pregnant right now I am very sensative to hearing what works for other people and sometimes thinking to myself well then I must be doing something wrong if it isn&#39;t working for me or if I try it, it doesn&#39;t make me feel very good then I feel worse...It is like having babies all of our bodies work different, we react different, we feel different and we birth different..Birthing ourselves is never the same as the next person. No birth is alike. <br/>\nI feel I just needed to say this and share..Not to debate anyone or disagree. With loving intentions I bare wittness and I hope you all have too.<br/>\nBe well and take what works for you and leave the rest behind.<br/>\n<br/>\nTrying to love myself in my process, Natalie<br/>\n<br/>\nVisit our blog:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://twodancingpepitas.blogspot.com/\">http://twodancingpepitas.blogspot.com/</a><br/>\n<br/>\nOur deepest fear is not that we are inadequate. Our deepest fear is <br/>\nthat we are powerful beyond measure. <br/>\n- Marianne Williamson<br/>\n<br/>\n&quot;You know you are face-to-face with the unfinished business of your own childhood when you respond with strong negative feelings to your child&#39;s behavior.&quot; (Hendrix and Hunt, 1997)<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223476512","msgId":36422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQUY3NkEzNEU4QzlCMy0xNkEwLTNDMUBXRUJNQUlMLU1BMDkuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGdjYW41bit2dG9mQGVHcm91cHMuY29tPg=="},"prevInTopic":36421,"nextInTopic":36427,"prevInTime":36421,"nextInTime":36423,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"So, how do you keep that resentment in check without feeling like there is nothing left/ no time left for you? -=-=-=-=-=-=-=-=-=-=-=-=-=-=- Seriously?  By","messageBody":"<div id=\"ygrps-yiv-885331048\">So, how do you keep that resentment in check without feeling like<br/>\nthere is nothing left/ no time left for you?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nSeriously? <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBy imagining that they were dead. No joke. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWhen I start feeling that resentment building (not just for my children, but Ben or my dogs or cats or my garden or whatever), I imagine what my life would be like withOUT them/it. I CHOSE to have my children, my husband, my pets, my LIFE. Do I *really* want to live withOUT them?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAlong with a deep breath (or three), this thought jars me right back into contentment, not resentment.<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223476400","msgId":36421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5Q0ZDMEJDLTJEQzktNDg1Qi1CMjc4LUU4NjgzNzQ4RTg0QkBjb3gubmV0Pg==","inReplyToHeader":"PDhDQUY3NUNDRUExODk2My0xMjI4LTI2RDVAV0VCTUFJTC1NQTA5LnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PGdjYW41bit2dG9mQGVHcm91cHMuY29tPiA8Z2NmaW8yK3I2b2JAZUdyb3Vwcy5jb20+IDwzYTkzZmZmMTA4MTAwODA1MDd4MmFjNTJjZTdsNmY2MjI0MGY5NDY3MzNjN0BtYWlsLmdtYWlsLmNvbT4gPDhDQUY3NUNDRUExODk2My0xMjI4LTI2RDVAV0VCTUFJTC1NQTA5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":36417,"nextInTopic":36422,"prevInTime":36420,"nextInTime":36422,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Haha! Kelly, I can sense this is a girl and she s channeling you...she kicked when I read this ;-) I do have to tell you all, I had such a shock yesterday,","messageBody":"<div id=\"ygrps-yiv-2122095020\">Haha! Kelly, I can sense this is a girl and she&#39;s channeling  <br/>\nyou...she kicked when I read this ;-)<br/>\n<br/>\nI do have to tell you all, I had such a shock yesterday, when Josh  <br/>\ngot a phone call. This really adult voice asked for him, and I was  <br/>\nreally just hesitant, &quot;Okaaay....&quot;<br/>\n<br/>\nIt was the secretary from the optometrist, confirming an appointment  <br/>\nhe had made to get his contacts. Holy Moly. I had said I needed to  <br/>\nmake one, he called, made the appointment and now is getting his own  <br/>\nphone calls to confirm (yes yes...he forgot to mention it to ME, the  <br/>\ndriver, but hey) It&#39;s one more step that he&#39;s moving away from  <br/>\nneeding me. It&#39;s a total &quot;Ack!&quot; moment.<br/>\n<br/>\nI&#39;m almost grateful for all the other people in my life keeping me  <br/>\nbusy, so I can not freak out so much. I&#39;m definitely not ready for my  <br/>\nfirst baby to be leaving me.<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 8, 2008, at 7:59 AM, Kelly Lovejoy wrote:<br/>\n&gt;<br/>\n&gt; I KNOW it feels as if your current life will never end. I remember  <br/>\n&gt; that time. But it DOES end (Maybe not for Melissa! &lt;G<br/>\n&gt; &gt;)---and sometimes you&#39;re not quite ready for it!<br/>\n&gt;<br/>\n&gt; I promise you will miss it when it&#39;s gone. They&#39;re only little and  <br/>\n&gt; needy for a short, short period of time.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223470757","msgId":36417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQUY3NUNDRUExODk2My0xMjI4LTI2RDVAV0VCTUFJTC1NQTA5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgxMDA4MDUwN3gyYWM1MmNlN2w2ZjYyMjQwZjk0NjczM2M3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdjYW41bit2dG9mQGVHcm91cHMuY29tPiA8Z2NmaW8yK3I2b2JAZUdyb3Vwcy5jb20+IDwzYTkzZmZmMTA4MTAwODA1MDd4MmFjNTJjZTdsNmY2MjI0MGY5NDY3MzNjN0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":36408,"nextInTopic":36421,"prevInTime":36416,"nextInTime":36418,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Time to ourselves will, in all likelihood, come back around eventually once our children are grown. Time with to devote with our kids is so short-lived and","messageBody":"<div id=\"ygrps-yiv-964921759\">Time to ourselves will, in all likelihood, come back around eventually once<br/>\nour children are grown.<br/>\nTime with to devote with our kids is so short-lived and precious.  Savor<br/>\nthat too in amongst savoring glorious moments of downtime.<br/>\n<br/>\n*************************<br/>\n<br/>\n<br/>\n<br/>\nI cannot tell you how much to savor what you have *right now*!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nCameron is now 20---he&#39;ll be 21 in January. He&#39;s in Mexico until October 21---and he may not be home right after that. He may stay in Massachusetts or Rhode Island before driving home---or who knows? He was in the northeast, visiting friends and at Not Back To School Camp before this trip to Mexico, so it&#39;ll be more that two months or more--before we see him again. Earlier this year, he was gone to the northwest and Canada for six weeks. I TREASURE each *minute* I get with him now.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nDuncan (12) is now on the graveyard shift (he actually hasn&#39;t been to bed YET today/night! I can&#39;t believe he&#39;s up now, playing Team Force Two.), so I don&#39;t get to see him all that much during the day. He spent last week at a friend&#39;s house, so that week I had NO children at home---not even sleeping ones!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI spent Sunday and Monday in Charleston with a friend from Colorado. Because our children were so happy playing together withOUT us, *we* got to play too---shopping, dining, visiting touristy sites, and just GABBING! <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI KNOW it feels as if your current life will never end. I remember that time. But it DOES end (Maybe not for Melissa! &lt;G<br/>\n<blockquote><span title=\"ireply\"> &gt;)---and sometimes you&#39;re not quite ready for it!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I promise you will miss it when it&#39;s gone. They&#39;re only little and needy for a short, short period of time.<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I have a question","postDate":"1223467674","msgId":36408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDA4MDUwN3gyYWM1MmNlN2w2ZjYyMjQwZjk0NjczM2M3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdjZmlvMityNm9iQGVHcm91cHMuY29tPg==","referencesHeader":"PGdjYW41bit2dG9mQGVHcm91cHMuY29tPiA8Z2NmaW8yK3I2b2JAZUdyb3Vwcy5jb20+"},"prevInTopic":36388,"nextInTopic":36417,"prevInTime":36407,"nextInTime":36409,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I get up earlier in the a.m. to go on the internet.  Time to myself which I used to have in abundance.  So much abundance that quite often I could say I had","messageBody":"<div id=\"ygrps-yiv-650627063\">I get up earlier in the a.m. to go on the internet.  Time to myself which I<br/>\nused to have in abundance.  So much abundance that quite often I could say I<br/>\nhad more than I really wanted.  I got very used to it, married in my mid<br/>\n30s, and to some extent I still feel like demanding the extravagant amounts<br/>\nI had pre-marriage not just pre-kid.  In almost every way, though, I&#39;m glad<br/>\nnot to have all that time to myself and to feel privileged to share with<br/>\nothers in such a meaningful way.<br/>\n<br/>\nParenting can seem like an exhausting grind, looked at from one<br/>\nperspective.  From a child&#39;s perspective, parents may be their one and only<br/>\nchance at getting loads and loads of devotion, and they kind of seem to know<br/>\nthis somehow.  To them, it&#39;s a dire need not a luxury.  After this parent,<br/>\nthere is no other waiting to take the place of that parent.<br/>\n<br/>\nTime to ourselves will, in all likelihood, come back around eventually once<br/>\nour children are grown.<br/>\nTime with to devote with our kids is so short-lived and precious.  Savor<br/>\nthat too in amongst savoring glorious moments of downtime.<br/>\n<br/>\nI love what you wrote, Sharon.  Your words themselves exuded a feeling of<br/>\nyummy lassitude.  Full of great ideas too.  Thanks!  I&#39;m a sucker for tea<br/>\nand chocolate or tea and anything.  I don&#39;t drink it as much in the summer<br/>\nbut now it&#39;s fall here and I&#39;m getting back to enjoying my tea really<br/>\nregularly again.  I make more soup this time of year too.  And bake or dream<br/>\nof baking (both equally good in their own way) much more this time of year.<br/>\nMaybe we&#39;ll go make some gingerbread at my sister&#39;s house today.  I might<br/>\nadd some pumpkin to the batter.  Going to google a recipe for that now.  :)<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/7/08, lyeping2008 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lyeping2008@...\">lyeping2008@...</a>&gt; wrote:<br/>\n<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Marla B.&quot; &lt;marla@...&gt;<br/>\n&gt;  wrote:<br/>\n&gt;  &gt; So, how do you keep that resentment in check without feeling like<br/>\n&gt;  &gt; there is nothing left/ no time left for you?<br/>\n&gt;  &gt; Marla<br/>\n&gt;<br/>\n&gt;  Hi Marla,<br/>\n&gt;<br/>\n&gt;  I&#39;m in similar but not exactly the same as your situation. I only<br/>\n&gt;  have one very needy 8 yrs old, and I&#39;m living admidst a suburb full<br/>\n&gt;  of houses but is alone with no friends because I&#39;m the foreigner<br/>\n&gt;  here. I don&#39;t know how to help you but just want you to know, I<br/>\n&gt;  understand what you&#39;re saying about resentment.<br/>\n&gt;<br/>\n&gt;  I&#39;ve learn to accept and understand that long hours of down time is<br/>\n&gt;  not possible because I cannot stop being a parent. So in order for<br/>\n&gt;  me to not get lost with my own frustrations and resentment, I need<br/>\n&gt;  to be creative and create down time for myself. And i realised that<br/>\n&gt;  mini downtime can be had, if I &quot;be consciously&quot; aware of<br/>\n&gt;  my &quot;emotions of savouring the act of slowing down&quot; and pay attention<br/>\n&gt;  to what I&#39;m doing.<br/>\n&gt;<br/>\n&gt;  What is your down-time? What do you want to do. Plan it. Or snatch<br/>\n&gt;  it as and when opportunity arises.<br/>\n&gt;<br/>\n&gt;  I find my upmost concern is food. My house can fall apart with dust<br/>\n&gt;  (i&#39;ll bear with it for only a few days before manically vacumming)<br/>\n&gt;  and toys everywhere (this I can survive), but I cannot escape the<br/>\n&gt;  duties of fixing daily lunches or dinners. So I then to batch cook<br/>\n&gt;  and freeze it. With this duty out of the way, I&#39;m ever ready to<br/>\n&gt;  snatch any of those down time windows, whenever it pop it&#39;s head<br/>\n&gt;  up.<br/>\n&gt;<br/>\n&gt;  This is my 10 minute downtime thinking - savouring the fact that I<br/>\n&gt;  can slow down, and take my own sweet time in deciding which type of<br/>\n&gt;  tea would I like, sniffing each and every teabox, while lunch/<br/>\n&gt;  dinner is in the microwave, defrosting.<br/>\n&gt;<br/>\n&gt;  The internet or book and music and sleep is my down-time. I then to<br/>\n&gt;  snatch this &quot;down-time moments&quot; by sitting next to my kid when he&#39;s<br/>\n&gt;  engaged in his own interest.<br/>\n&gt;<br/>\n&gt;  On some evenings, i&#39;ll instigate &quot;downtime moments&quot; by just curling<br/>\n&gt;  up in bed earlier than usual. He&#39;ll be watching his video, i&#39;ll be<br/>\n&gt;  reading or we&#39;ll both watch something we both like. Sometimes, I&#39;m<br/>\n&gt;  energize enough to be able to comeback downstairs when he&#39;s asleep<br/>\n&gt;  with hubby. Becuase it&#39;s the only time I can do something wihtout<br/>\n&gt;  interruption, so I&#39;ll indulge in a more elaborate &quot;downtime&quot; like<br/>\n&gt;  paint, or prepare my self a snack that I can savour slowly, instead<br/>\n&gt;  of my usual gobbling it down.<br/>\n&gt;<br/>\n&gt;  You mentioned your hubby works 2 jobs. He must sleep at some point<br/>\n&gt;  of time right? Can you snuggle up to him with the young one? This<br/>\n&gt;  way, maybe the young one will sleep longer without you? Giving you a<br/>\n&gt;  window of alone time?<br/>\n&gt;<br/>\n&gt;  In the morning, when my kid&#39;s settled down with breakfast, I then to<br/>\n&gt;  go back upstairs for a quick 10 -15 mins moment for myself. I&#39;ll put<br/>\n&gt;  my favourite cd on and use this moment slow down and savour which<br/>\n&gt;  shampoo or soap (i&#39;ve got lots, I&#39;m a Lush person) should i use<br/>\n&gt;  today. Before manically rushing thru my wash and get dressed, before<br/>\n&gt;  my son comes thundering up the stairs demanding my attention. You<br/>\n&gt;  have an older child, could you get him to watch over the little one,<br/>\n&gt;  giving you these little windows of quiet moments?<br/>\n&gt;<br/>\n&gt;  I know your hubby work hard, can he not help give you a break<br/>\n&gt;  anytime during his off days, like he gets to catch up on his sleep<br/>\n&gt;  in the day time, and maybe he&#39;ll appreciate snuggling up early in<br/>\n&gt;  the evening again, watching video in bed with the kids, giving you a<br/>\n&gt;  chunk of the evening off?<br/>\n&gt;<br/>\n&gt;  I find that by me being &quot;conscious&quot; of allowing myself to &quot;savour&quot;<br/>\n&gt;  this mini &quot;slow down&quot; times, even if it is only 10 minutes, i don&#39;t<br/>\n&gt;  get so uptight and frustrated. I then to remind myself to take a<br/>\n&gt;  deep breath (you&#39;ll be surprised how many of us forgets to breath<br/>\n&gt;  deep, and leisurely) and savour the un-rush moment of deciding on<br/>\n&gt;  something like picking a cd that I like and put it on, take another<br/>\n&gt;  deep breath, sit down and have some chocolates or cup of tea.<br/>\n&gt;<br/>\n&gt;  I also bake, even tho it is something that my kid requested for.<br/>\n&gt;  Baking is my down time. So I then to savour every unrush moment from<br/>\n&gt;  measuring to whizzing it up. And recently I&#39;ve found the right<br/>\n&gt;  frosting recipe that my kid likes- so it&#39;s a double bonus for me.<br/>\n&gt;<br/>\n&gt;  Now I believe my downtime is over, because my kid&#39;s been harrassing<br/>\n&gt;  me for the past 10 minutes for some chewing gum.<br/>\n&gt;<br/>\n&gt;  I hope this helps. All the best.<br/>\n&gt;<br/>\n&gt;  Hugs and smiles<br/>\n&gt;  SharonBugs.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question","postDate":"1223380546","msgId":36388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjZmlvMityNm9iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjYW41bit2dG9mQGVHcm91cHMuY29tPg=="},"prevInTopic":36385,"nextInTopic":36408,"prevInTime":36387,"nextInTime":36389,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"... Hi Marla, I m in similar but not exactly the same as your situation. I only have one very needy 8 yrs old, and I m living admidst a suburb full of houses","messageBody":"<div id=\"ygrps-yiv-399391721\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Marla B.&quot; &lt;marla@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So, how do you keep that resentment in check without feeling like<br/>\n&gt; there is nothing left/ no time left for you?<br/>\n&gt; Marla<br/>\n<br/>\n<br/>\n </span></blockquote>Hi Marla,<br/>\n<br/>\nI&#39;m in similar but not exactly the same as your situation. I only <br/>\nhave one very needy 8 yrs old, and I&#39;m living admidst a suburb full <br/>\nof houses but is alone with no friends because I&#39;m the foreigner <br/>\nhere. I don&#39;t know how to help you but just want you to know, I <br/>\nunderstand what you&#39;re saying about resentment. <br/>\n<br/>\nI&#39;ve learn to accept and understand that long hours of down time is <br/>\nnot possible because I cannot stop being a parent. So in order for <br/>\nme to not get lost with my own frustrations and resentment, I need <br/>\nto be creative and create down time for myself. And i realised that <br/>\nmini downtime can be had, if I &quot;be consciously&quot; aware of <br/>\nmy &quot;emotions of savouring the act of slowing down&quot; and pay attention <br/>\nto what I&#39;m doing.   <br/>\n<br/>\nWhat is your down-time? What do you want to do. Plan it. Or snatch <br/>\nit as and when opportunity arises. <br/>\n<br/>\nI find my upmost concern is food. My house can fall apart with dust<br/>\n(i&#39;ll bear with it for only a few days before manically vacumming) <br/>\nand toys everywhere (this I can survive), but I cannot escape the <br/>\nduties of fixing daily lunches or dinners. So I then to batch cook <br/>\nand freeze it. With this duty out of the way, I&#39;m ever ready to <br/>\nsnatch any of those down time windows, whenever it pop it&#39;s head <br/>\nup.  <br/>\n<br/>\nThis is my 10 minute downtime thinking - savouring the fact that I <br/>\ncan slow down, and take my own sweet time in deciding which type of <br/>\ntea would I like, sniffing each and every teabox, while lunch/ <br/>\ndinner is in the microwave, defrosting.  <br/>\n<br/>\nThe internet or book and music and sleep is my down-time. I then to  <br/>\nsnatch this &quot;down-time moments&quot; by sitting next to my kid when he&#39;s <br/>\nengaged in his own interest. <br/>\n<br/>\nOn some evenings, i&#39;ll instigate &quot;downtime moments&quot; by just curling <br/>\nup in bed earlier than usual. He&#39;ll be watching his video, i&#39;ll be <br/>\nreading or we&#39;ll both watch something we both like. Sometimes, I&#39;m <br/>\nenergize enough to be able to comeback downstairs when he&#39;s asleep <br/>\nwith hubby. Becuase it&#39;s the only time I can do something wihtout <br/>\ninterruption, so I&#39;ll indulge in a more elaborate &quot;downtime&quot; like <br/>\npaint, or prepare my self a snack that I can savour slowly, instead <br/>\nof my usual gobbling it down.    <br/>\n<br/>\nYou mentioned your hubby works 2 jobs. He must sleep at some point <br/>\nof time right? Can you snuggle up to him with the young one? This <br/>\nway, maybe the young one will sleep longer without you? Giving you a <br/>\nwindow of alone time?  <br/>\n<br/>\nIn the morning, when my kid&#39;s settled down with breakfast, I then to <br/>\ngo back upstairs for a quick 10 -15 mins moment for myself. I&#39;ll put <br/>\nmy favourite cd on and use this moment slow down and savour which <br/>\nshampoo or soap (i&#39;ve got lots, I&#39;m a Lush person) should i use <br/>\ntoday. Before manically rushing thru my wash and get dressed, before <br/>\nmy son comes thundering up the stairs demanding my attention. You <br/>\nhave an older child, could you get him to watch over the little one, <br/>\ngiving you these little windows of quiet moments? <br/>\n<br/>\nI know your hubby work hard, can he not help give you a break <br/>\nanytime during his off days, like he gets to catch up on his sleep <br/>\nin the day time, and maybe he&#39;ll appreciate snuggling up early in <br/>\nthe evening again, watching video in bed with the kids, giving you a <br/>\nchunk of the evening off? <br/>\n<br/>\nI find that by me being &quot;conscious&quot; of allowing myself to &quot;savour&quot; <br/>\nthis mini &quot;slow down&quot; times, even if it is only 10 minutes, i don&#39;t <br/>\nget so uptight and frustrated. I then to remind myself to take a <br/>\ndeep breath (you&#39;ll be surprised how many of us forgets to breath <br/>\ndeep, and leisurely) and savour the un-rush moment of deciding on <br/>\nsomething like picking a cd that I like and put it on, take another <br/>\ndeep breath, sit down and have some chocolates or cup of tea.    <br/>\n<br/>\nI also bake, even tho it is something that my kid requested for. <br/>\nBaking is my down time. So I then to savour every unrush moment from <br/>\nmeasuring to whizzing it up. And recently I&#39;ve found the right <br/>\nfrosting recipe that my kid likes- so it&#39;s a double bonus for me. <br/>\n <br/>\nNow I believe my downtime is over, because my kid&#39;s been harrassing <br/>\nme for the past 10 minutes for some chewing gum. <br/>\n<br/>\nI hope this helps. All the best.<br/>\n<br/>\nHugs and smiles<br/>\nSharonBugs.</div>","specialLinks":[]},{"userId":99005687,"authorName":"Sherri","from":"&quot;Sherri&quot; &lt;sherrildr@...&gt;","profile":"sherrildr2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: I have a question","postDate":"1223325555","msgId":36385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNWMwMWM5MjdmMyQ5OGZiZTEzMCQ5MzAyYThjMEBTaGVyQmVhcj4=","inReplyToHeader":"PGdjZHNjbys2M3NlQGVHcm91cHMuY29tPg==","referencesHeader":"PGdjOTE2OCs3YWxxQGVHcm91cHMuY29tPiA8Z2Nkc2NvKzYzc2VAZUdyb3Vwcy5jb20+"},"prevInTopic":36384,"nextInTopic":36388,"prevInTime":36384,"nextInTime":36386,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Thanks Therese! Sherri [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1275220099\">Thanks Therese!<br/>\n <br/>\nSherri<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":232638265,"authorName":"Therese","from":"&quot;Therese&quot; &lt;luvmy2gifts@...&gt;","profile":"luvmy2gifts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question","postDate":"1223324888","msgId":36384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjZHNjbys2M3NlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjOTE2OCs3YWxxQGVHcm91cHMuY29tPg=="},"prevInTopic":36372,"nextInTopic":36385,"prevInTime":36383,"nextInTime":36385,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I think it comes down to our expectations.  Sometimes our expectations of children are for them to treat us the same way we (as big adults) would treat them.","messageBody":"<div id=\"ygrps-yiv-1363890929\">I think it comes down to our expectations.  Sometimes our <br/>\nexpectations of children are for them to treat us the same way we (as <br/>\nbig adults) would treat them.  (The golden rule) But children often <br/>\nare not able to do this yet because of their stages in development.  <br/>\nI know it helps me to lower my expectations, because otherwise I get <br/>\nfeeling grumpy and feeling like &quot;I&quot; deserve more and start giving out <br/>\nguilt trips.  I think its good to tell children about the &#39;Golden <br/>\nrule&#39;, but I don&#39;t expect my children to be able to give the same <br/>\nrespect yet at 2 and 4 years old.  There little bodies are in the <br/>\nhere and now.    <br/>\n<br/>\nMy husband works crazy hours and goes to night school so he isn&#39;t <br/>\nusually available to watch the kids for me.  I actually just got my <br/>\nhair cut- at the same place my children get their haircuts.  This <br/>\nhaircut place is made for children with a whole room full of toys for <br/>\nthem to play with, but they serve adults too.  I have gone there and <br/>\nhad my color and cut while they play or watch videos on their tv. <br/>\nCheck around your city and you might be able to find a children&#39;s <br/>\nplace that cuts adults hair too.<br/>\n<br/>\nBlessings,<br/>\nTherese<br/>\n<br/>\nGentle Christian unschooling mama<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sherrildr2000&quot; <br/>\n&lt;sherrildr@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I adore being with my child.  However, there are times I wonder how <br/>\n&gt; in Radical homeschooling I get my needs met. I wanted to get my <br/>\n </span></blockquote>hair <br/>\n<blockquote><span title=\"ireply\"> &gt; cut for over a week.  DH was working long hours and I needed my <br/>\n </span></blockquote>child <br/>\n<blockquote><span title=\"ireply\"> &gt; to come with me.  She was not on board with going with me to get my <br/>\n&gt; hair cut.  I became angry, but didn&#39;t let it out and the more it <br/>\n </span></blockquote>went <br/>\n<blockquote><span title=\"ireply\"> &gt; on the more angry I got.  Finally after 2 weeks, I got my haircut <br/>\n&gt; without her.<br/>\n&gt; <br/>\n&gt; However, I did tell her it made me sad that I had a need to get my <br/>\n&gt; hair cut and she wouldn&#39;t cooperate.  That when she has the same <br/>\n </span></blockquote>need <br/>\n<blockquote><span title=\"ireply\"> &gt; I cooperate with her.  That I felt we should be respectful of each <br/>\n&gt; other&#39;s needs.  She apolgized and I felt I should have said <br/>\n </span></blockquote>something <br/>\n<blockquote><span title=\"ireply\"> &gt; sooner.<br/>\n&gt; <br/>\n&gt; There have been other situations that have come up, I gucess I just <br/>\n&gt; don&#39;t understand, how to handle this.  I feel like I turned my life <br/>\n&gt; totally over to her and have no rights to anything for myself any <br/>\n&gt; longer. Faith is a great child.  I know it&#39;s me that needs to <br/>\n </span></blockquote>figure <br/>\n<blockquote><span title=\"qreply\"> &gt; out the change in rolls.  Please share your thoughts.<br/>\n&gt; <br/>\n&gt; Sherri<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I have a question/haircuts","postDate":"1223254048","msgId":36367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDA1MTc0N3MzNzBhNDQ1OGszN2E5NmIzMGFhNDc0ZmVlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ4RThBOTVFLjYwNDA5MDhAdHdjbnkucnIuY29tPg==","referencesHeader":"PDc3MDM1NC41MDA3MC5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+CSA8NDhFOEE5NUUuNjA0MDkwOEB0d2NueS5yci5jb20+"},"prevInTopic":36357,"nextInTopic":36372,"prevInTime":36366,"nextInTime":36368,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"This is what I usually do instead of going to get mine cut.  Hard to get it done more cheaply and I like to be in charge of what happens.  Cutting my own hair","messageBody":"<div id=\"ygrps-yiv-1713891302\">This is what I usually do instead of going to get mine cut.  Hard to get it<br/>\ndone more cheaply and I like to be in charge of what happens.  Cutting my<br/>\nown hair is fine.  Long hair is easy to cut yourself... part in back and<br/>\npull the hair forward.<br/>\n<br/>\nThis last time, Karl trimmed my hair, and was surprised at how hard it is to<br/>\ncut through.  That was much more fun than cutting my own hair and it was<br/>\nfree also.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/5/08, hbmccarty &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hbmccarty@...\">hbmccarty@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   I have cut my own hair at home for years. I think as an adult I have had<br/>\n&gt;<br/>\n&gt; someone else cut my hair maybe 2 times- once in a salon, and once a<br/>\n&gt; friend buzzed it off. (I am 41) Of course my expectations aren&#39;t very<br/>\n&gt; high and I wear my hair long. I work from home so I don&#39;t need to look<br/>\n&gt; any particular way for that. My kids would actually like to give me a<br/>\n&gt; hair cut, so maybe we&#39;ll try that next time!<br/>\n&gt;<br/>\n&gt; Heather (in NY)<br/>\n&gt;<br/>\n&gt; Schuyler wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; There are people everywhere who will do in home haircuts. Could you<br/>\n&gt; &gt; call one of them?<br/>\n&gt; &gt;<br/>\n&gt; &gt; .<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":284278731,"authorName":"susanleeb52","from":"&quot;susanleeb52&quot; &lt;jgsbmg@...&gt;","profile":"susanleeb52","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question/haircuts","postDate":"1223222932","msgId":36372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjYW9xaytuOXByQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4RThBOTVFLjYwNDA5MDhAdHdjbnkucnIuY29tPg=="},"prevInTopic":36367,"nextInTopic":36384,"prevInTime":36371,"nextInTime":36373,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I struggle with this also. What has worked somewhat for us is for me to simply assume that any errands of any kind will need to be done in the evening or on ","messageBody":"<div id=\"ygrps-yiv-569518519\">I struggle with this also.<br/>\n<br/>\nWhat has worked somewhat for us is for me to simply assume that any <br/>\nerrands of any kind will need to be done in the evening or on <br/>\nweekends, when my child can stay home.  Once I am working from that <br/>\nassumption, then I am no longer angry that it&#39;s happening that way, <br/>\nif that makes any sense.<br/>\n<br/>\nAnd this is a bit of a tangent, but I think if you&#39;re going to talk <br/>\nhonestly with your child about feelings, than you should use honest <br/>\nwords.  If you were angry that you couldn&#39;t reach an agreement about <br/>\ngoing somewhere, then say that, don&#39;t say that it made you sad.<br/>\n<br/>\nFor me, using the word &quot;sad&quot; instead of &quot;angry&quot; is a way to avoid the <br/>\nidea that I was angry without just cause (which is often the case).  <br/>\nIf I really shouldn&#39;t be angry about something, then I need to deal <br/>\nwith that myself.<br/>\n<br/>\nSusan,<br/>\nwho also needs a haircut</div>","specialLinks":[]},{"userId":77228268,"authorName":"Marla B.","from":"&quot;Marla B.&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I have a question","postDate":"1223221239","msgId":36357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjYW41bit2dG9mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjOTE2OCs3YWxxQGVHcm91cHMuY29tPg=="},"prevInTopic":36354,"nextInTopic":36367,"prevInTime":36356,"nextInTime":36358,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"... People have given great responses for the haircut issue!  I would also love to hear more about the basic issue of being an unschooling mom who does so much","messageBody":"<div id=\"ygrps-yiv-1004132061\"><blockquote><span title=\"ireply\">&gt; There have been other situations that have come up, I gucess I just <br/>\n&gt; don&#39;t understand, how to handle this.  I feel like I turned my life <br/>\n&gt; totally over to her and have no rights to anything for myself any <br/>\n&gt; longer. Faith is a great child.  I know it&#39;s me that needs to figure <br/>\n&gt; out the change in rolls.  Please share your thoughts.<br/>\n&gt; <br/>\n&gt; Sherri<br/>\n<br/>\n<br/>\n </span></blockquote>People have given great responses for the haircut issue!  I would also<br/>\nlove to hear more about the basic issue of being an unschooling mom<br/>\nwho does so much for her kids, but feels like her needs aren&#39;t being<br/>\nmet, leading to resentment.<br/>\n<br/>\nI know I feel like this more than I&#39;d like, though I feel fortunate<br/>\nthat I do get to be with them so much.  My dds are 9 yo. and 5 yo.,<br/>\nbut both still sleep with me and the 5 yo. is still nursing<br/>\n(sporadically - LOL).  I can&#39;t have down time after they go to bed,<br/>\nbecause they sleep when I sleep.  Getting up early isn&#39;t an option<br/>\nbecause they usually wake when I wake.  So, it&#39;s rare that I get much<br/>\ntime to myself.  Even just to stop and think.  We live very rural and<br/>\nsitters are very hard to find.  We have no family nearby and my<br/>\nhusband works 2 jobs.  <br/>\n<br/>\nSo, how do you keep that resentment in check without feeling like<br/>\nthere is nothing left/ no time left for you?<br/>\n<br/>\nThanks!<br/>\n<br/>\nMarla</div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heathermccarty1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I have a question/haircuts","postDate":"1223207262","msgId":36354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4RThBOTVFLjYwNDA5MDhAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PDc3MDM1NC41MDA3MC5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDc3MDM1NC41MDA3MC5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":36351,"nextInTopic":36357,"prevInTime":36353,"nextInTime":36355,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I have cut my own hair at home for years. I think as an adult I have had someone else cut my hair maybe 2 times- once in a salon, and once a friend buzzed it","messageBody":"<div id=\"ygrps-yiv-1056877994\">I have cut my own hair at home for years. I think as an adult I have had <br/>\nsomeone else cut my hair maybe 2 times- once in a salon, and once a <br/>\nfriend buzzed it off. (I am 41) Of course my expectations aren&#39;t very <br/>\nhigh and I wear my hair long. I work from home so I don&#39;t need to look <br/>\nany particular way for that. My kids would actually like to give me a <br/>\nhair cut, so maybe we&#39;ll try that next time!<br/>\n<br/>\nHeather (in NY)<br/>\n<br/>\nSchuyler wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; There are people everywhere who will do in home haircuts. Could you <br/>\n&gt; call one of them?<br/>\n&gt;<br/>\n&gt; .<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I have a question","postDate":"1223196127","msgId":36351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MDM1NC41MDA3MC5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":36349,"nextInTopic":36354,"prevInTime":36350,"nextInTime":36352,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"There are people everywhere who will do in home haircuts. Could you call one of them? I ve gone years without haircuts, maybe make sure that you can go alone","messageBody":"<div id=\"ygrps-yiv-911635548\">There are people everywhere who will do in home haircuts. Could you call one of them? I&#39;ve gone years without haircuts, maybe make sure that you can go alone when you do go. Other people&#39;s haircuts can be boring. Unfortunately by deciding that she needed to go with you, you set up a point to feel resentful about. It is easier not to resent things when you see what you are doing as a gift and not an abandonment of your rights. <br/>\n<br/>\nSimon, 11, doesn&#39;t always like to go places with us. Linnaea, 8, adores going out. It is good for me to know in advance of any going out that Simon may decide he doesn&#39;t want to go. If David is around, and with only one car he needs to be, it makes it easier to accomodate both of their desires. Next Saturday we get a second car, which will change that. It&#39;ll mean that Simon has to be onboard with doing something if something is going to happen, if David isn&#39;t around. One of the ways that I can accomodate that is make sure that whatever is going on includes things that he likes particularly. Or that it includes time with his friends. Soon it will be less of an issue. Soon I&#39;ll be fine with him staying home alone for longer periods of time. But we live in the middle of not a lot going on, so it takes time to get to something going on and a long time to get back. But until then, me getting resentful just makes him miserable and me miserable and it doesn&#39;t<br/>\n help him to want to go along the next time. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\nI adore being with my child.  However, there are times I wonder how <br/>\nin Radical homeschooling I get my needs met. I wanted to get my hair <br/>\ncut for over a week.  DH was working long hours and I needed my child <br/>\nto come with me.  She was not on board with going with me to get my <br/>\nhair cut.  I became angry, but didn&#39;t let it out and the more it went <br/>\non the more angry I got.  Finally after 2 weeks, I got my haircut <br/>\nwithout her.<br/>\n<br/>\nHowever, I did tell her it made me sad that I had a need to get my <br/>\nhair cut and she wouldn&#39;t cooperate.  That when she has the same need <br/>\nI cooperate with her.  That I felt we should be respectful of each <br/>\nother&#39;s needs.  She apolgized and I felt I should have said something <br/>\nsooner.<br/>\n<br/>\nThere have been other situations that have come up, I gucess I just <br/>\ndon&#39;t understand, how to handle this.  I feel like I turned my life <br/>\ntotally over to her and have no rights to anything for myself any <br/>\nlonger. Faith is a great child.  I know it&#39;s me that needs to figure <br/>\nout the change in rolls.  Please share your thoughts.<br/>\n<br/>\n<br/>\n__.    <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224031522,"authorName":"Zoa Conner","from":"Zoa Conner &lt;zoaconner@...&gt;","profile":"zoaconner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] I have a question","postDate":"1223166971","msgId":36349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1MEQ4NDNCLjEwQ0REJXpvYWNvbm5lckBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGdjOTE2OCs3YWxxQGVHcm91cHMuY29tPg=="},"prevInTopic":36348,"nextInTopic":36351,"prevInTime":36348,"nextInTime":36350,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"Sherri, You are probably right ­ you could have benefited from saying something sooner. How about something like: I really need to get my hair cut. Its ","messageBody":"<div id=\"ygrps-yiv-1916536665\">Sherri,<br/>\n<br/>\nYou are probably right ­ you could have benefited from saying something<br/>\nsooner. How about something like: I really need to get my hair cut. Its<br/>\ndriving me crazy right now. I know going there is not fun for you. What can<br/>\nwe bring with us that would be fun to do while I get my cut? Or where can we<br/>\ngo for you after the haircut? Or who can we bring to hang out with you while<br/>\nI am busy?<br/>\n<br/>\nTry the tactic of asking her to help you figure out how to get your hair cut<br/>\ninstead of asking her permission. Problem solve together. Also figure out<br/>\nwhy she did not want to go with you. Her reasons give you a big clue as to<br/>\nhow to solve the problem.<br/>\n----------------<br/>\nZoa Conner, PhD<br/>\nPhysicist and Organic Learning Mother<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoaconner@...\">zoaconner@...</a><br/>\n*Handmade stuff @ earthyzee.etsy.com <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99005687,"authorName":"sherrildr2000","from":"&quot;sherrildr2000&quot; &lt;sherrildr@...&gt;","profile":"sherrildr2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I have a question","postDate":"1223165960","msgId":36348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjOTE2OCs3YWxxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36349,"prevInTime":36347,"nextInTime":36349,"topicId":36348,"numMessagesInTopic":0,"msgSnippet":"I adore being with my child.  However, there are times I wonder how in Radical homeschooling I get my needs met. I wanted to get my hair cut for over a week.","messageBody":"<div id=\"ygrps-yiv-770653019\">I adore being with my child.  However, there are times I wonder how <br/>\nin Radical homeschooling I get my needs met. I wanted to get my hair <br/>\ncut for over a week.  DH was working long hours and I needed my child <br/>\nto come with me.  She was not on board with going with me to get my <br/>\nhair cut.  I became angry, but didn&#39;t let it out and the more it went <br/>\non the more angry I got.  Finally after 2 weeks, I got my haircut <br/>\nwithout her.<br/>\n<br/>\nHowever, I did tell her it made me sad that I had a need to get my <br/>\nhair cut and she wouldn&#39;t cooperate.  That when she has the same need <br/>\nI cooperate with her.  That I felt we should be respectful of each <br/>\nother&#39;s needs.  She apolgized and I felt I should have said something <br/>\nsooner.<br/>\n<br/>\nThere have been other situations that have come up, I gucess I just <br/>\ndon&#39;t understand, how to handle this.  I feel like I turned my life <br/>\ntotally over to her and have no rights to anything for myself any <br/>\nlonger. Faith is a great child.  I know it&#39;s me that needs to figure <br/>\nout the change in rolls.  Please share your thoughts.<br/>\n<br/>\nSherri</div>","specialLinks":[]}],"prevTopicId":36476,"nextTopicId":36548}}