{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134401445","msgId":8231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0NENDgyNzZCRDE2Qi05QjgtMzA0QEZXTS1NMDguc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PEJBWTExNS1EQVYxNzY4MjFDMkY2RjMwMTg4MUY0NEE5RDM0NDBAcGh4LmdibD4=","referencesHeader":"PDAxNWMwMWM1ZmNmOSQxMzc5YzFkMCQ2NDAxYThjMEBIT01FPiA8QkFZMTE1LURBVjE3NjgyMUMyRjZGMzAxODgxRjQ0QTlEMzQ0MEBwaHguZ2JsPg=="},"prevInTopic":8171,"nextInTopic":0,"prevInTime":8230,"nextInTime":8232,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"... From: Lesa McMahon-Lowe  I was spanked and never feared my father.  my mom didn t spank us because she was too emotional and you","messageBody":"<div id=\"ygrps-yiv-833833038\">-----Original Message-----<br/>\nFrom: Lesa McMahon-Lowe &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lesajm@...\">lesajm@...</a>&gt;<br/>\n<br/>\nI was spanked and never &quot;feared&quot; my father.  my mom didn&#39;t spank us because<br/>\nshe was too emotional and you never spank a child out of anger (like Yolanda<br/>\nmentioned).<br/>\n-=-=-=-<br/>\n <br/>\nThis is the part that really gets to me. I can understand hitting out of anger, frustration, ---hell, all <br/>\nsorts of reasons, especially of that&#39;s how you were raised (I was). But the cold-blooded part is what <br/>\nfreaks me out. In anger or infrustration, people are capable of serious violence. After the fact though---<br/>\nshouldn&#39;t you be able to find a BETTER way of dealing with the problem?????<br/>\n <br/>\n-===-=-  <br/>\n<br/>\nI don&#39;t spank my daughter because that is what my husband wants.  And as his<br/>\nwife I will concede to that way of doing things.  I&#39;m more like my mother<br/>\nanyway and would never want to expose my child to spanking out of anger. <br/>\n<br/>\n-=-=-=-<br/>\nWhy can&#39;t that read: I &quot;would never want to expose my child to spanking&quot; ---and just stop there?????<br/>\n-=-=-=-<br/>\n<br/>\nI like the way Yolanda laid things out.  This is the way I was raised and it<br/>\nworked in our household.  My upbringing truly saved me during my teen years<br/>\nafter my parents divorced.<br/>\n<br/>\n-=-=-=-=-<br/>\nBeating a child will NOT save him in any way, shape, or manner.<br/>\n <br/>\nIt &quot;works&quot; for YOU. It does nothing FOR your child.<br/>\n <br/>\nSo you&#39;re telling us that you were spanked as a teen after your parents divorced and that saved you?????<br/>\n <br/>\n ~KellyKelly LovejoyConference CoordinatorLive and Learn Unschooling Conference<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a>  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] What do you think?","postDate":"1134298539","msgId":8171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDUxMjExMDQwNDE1LjE0MDA2LnFtYWlsQHdlYjYxMjEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":8170,"nextInTopic":8231,"prevInTime":8170,"nextInTime":8172,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1575577397\">&lt;&lt;&lt;&lt;&lt; I was raised pretty much the same way I am raising them, and I was<br/>\nNEVER afraid of my parents.  I&#39;m not blind, I see my parents for who they<br/>\nare, faults and all (which is why my children aren&#39;t being raised exactly<br/>\nthe same), but I love and respect them deeply. &gt;&gt;&gt;&gt;<br/>\n<br/>\nYet this suggests that you are willing, even desirous, of embracing your<br/>\nparents&#39; faults or parenting defects - repeating their mistakes along with<br/>\ntheir positive ideas as if you have no other choice but to take all or<br/>\nnothing.<br/>\n<br/>\nI don&#39;t understand why anyone would look at their parents&#39; errors and say<br/>\n&quot;I&#39;m going to do *exactly* the same&quot;.<br/>\n<br/>\nAlso it is &quot;one size fits all&quot; parenting. Our children are not ourselves.<br/>\nOur children are not clones of us or each other (even twins!). They could<br/>\nhave different needs than we may have had growing up and from each other.<br/>\n<br/>\n&lt;&lt;&lt;&lt; never come to any kind of agreement.&gt;&gt;<br/>\n   <br/>\n  Funny, but I thought that tolerance and multiculturalism were about<br/>\naccepting each other&#39;s differences, not making sure everyone comes to an<br/>\nagreement. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThis is not a tolerance and multiculturalism discussion list. This is an<br/>\nUnschooling discussion list. Anyone who *chooses to* can learn how to<br/>\nUnschool regardless of religious beliefs, race, ancestry or cultural<br/>\nbackground. <br/>\n<br/>\nWhile what an Unschooling life looks like will be different and brilliantly<br/>\nunique in every family, there are some Principles which are common<br/>\nunderpinnings, if we are moving towards the fullest measure of joy in our<br/>\nchildren&#39;s lives. One of those includes moving away from an adversarial<br/>\nrelationship through employing the Principles of Respect, Kindness,<br/>\nCompassion, Understanding and Empowerment of children&#39;s autonomy. <br/>\n<br/>\nI believe that there is no place for spanking a child in a life of Radical<br/>\nUnschooling. If we are choosing to spank our child, for whatever reason, we<br/>\nare failing as an Unschooling parent in that moment. However that doesn&#39;t<br/>\nmean that we can&#39;t do better in the next moment, or the next time the same<br/>\nissue comes up if we choose to!<br/>\n<br/>\nWhile ever spanking is in the toolbox as an option, while ever it is a<br/>\nthinkable, possible alternative, there is a barrier to Unschooling with Joy.<br/>\nKeeping spanking in mind means there is always that place where some line<br/>\ncan be crossed into &quot;this is the situation where spanking is allowable&quot;.<br/>\n<br/>\nSpanking is *never* necessary. It is a bad choice being made by the parent.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  I do treat my children respectfully,&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nExcept for those moments, no matter how few and far between, when you are<br/>\nchoosing to spank them. Except for those moments when you scroll through<br/>\nyour mental list of &quot;spankable offenses&quot;, no matter how fleeting that<br/>\nthought is. <br/>\n<br/>\n&lt;&lt;&lt;&lt; and we will continue our search for how to best help them reach their<br/>\ngoals in life, but if having to live by the beliefs of others on this list<br/>\nrather than our own is a requisite here, then this is not the place for me<br/>\nto find help in that search. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI don&#39;t care about anyone&#39;s beliefs here, except when they are promoting<br/>\npractices and ideas that are barriers to Unschooling. The idea is not for<br/>\nanyone to impose their beliefs on the list members (impossible anyway), but<br/>\nfor everyone to rigorously and consciously examine how their own beliefs<br/>\nmight be hindering the journey to Unschooling.<br/>\n<br/>\nMaking Obedience the overriding life principle and directing your children&#39;s<br/>\nlives with that as the tentpole is a barrier to Unschooling with Joy.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.371 / Virus Database: 267.13.13/197 - Release Date: 12/9/2005</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] oops was What do you think?","postDate":"1134295849","msgId":8170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PENEQThBRkEyLTY3MkMtNENDQi05MjNDLUVFM0RCMDc3RTk3M0Btc3UuZWR1Pg=="},"prevInTopic":8169,"nextInTopic":8171,"prevInTime":8169,"nextInTime":8171,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-761983982\">&lt;&lt;&lt;&lt;&lt; I feel sort of silly; I didn&#39;t realize until I read it a second time  <br/>\nthat Yolonda was leaving. I wouldn&#39;t have written that whole thing if  <br/>\nI&#39;d realized. Oops. &gt;&gt;&gt;&gt;<br/>\n<br/>\nI, for one, am SO GLAD that you did. That post contains a wealth of thought<br/>\nprovoking ideas and deeply interesting points. (Reply under separate cover.)<br/>\n<br/>\nAlso sometimes people wait to see what the reaction is to their proclaiming<br/>\nleaving before actually going, or just go no-mail temporarily.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.371 / Virus Database: 267.13.13/197 - Release Date: 12/9/2005</div>","specialLinks":[]},{"userId":188668263,"authorName":"Su Penn","from":"Su Penn &lt;pennsu@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] oops was What do you think?","postDate":"1134278641","msgId":8169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENEQThBRkEyLTY3MkMtNENDQi05MjNDLUVFM0RCMDc3RTk3M0Btc3UuZWR1Pg==","inReplyToHeader":"PDIwMDUxMjExMDQwNDE1LjE0MDA2LnFtYWlsQHdlYjYxMjEyLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDUxMjExMDQwNDE1LjE0MDA2LnFtYWlsQHdlYjYxMjEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":8168,"nextInTopic":8170,"prevInTime":8168,"nextInTime":8170,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"I feel sort of silly; I didn t realize until I read it a second time that Yolonda was leaving. I wouldn t have written that whole thing if I d realized. Oops. ","messageBody":"<div id=\"ygrps-yiv-1621997679\">I feel sort of silly; I didn&#39;t realize until I read it a second time  <br/>\nthat Yolonda was leaving. I wouldn&#39;t have written that whole thing if  <br/>\nI&#39;d realized. Oops.<br/>\n<br/>\nSu<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 10, 2005, at 11:04 PM, Yolonda Hicks wrote:<br/>\n<br/>\n&gt; Withdrawing, </span></blockquote></div>","specialLinks":[]},{"userId":188668263,"authorName":"Su Penn","from":"Su Penn &lt;pennsu@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] punishment, was What do you think?","postDate":"1134278306","msgId":8168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5QjkwRDM4LTkyQzYtNEVFNi04NzdDLTREMTIwQTNDMzI5MEBtc3UuZWR1Pg==","inReplyToHeader":"PDIwMDUxMjExMDQwNDE1LjE0MDA2LnFtYWlsQHdlYjYxMjEyLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDUxMjExMDQwNDE1LjE0MDA2LnFtYWlsQHdlYjYxMjEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":8167,"nextInTopic":8169,"prevInTime":8167,"nextInTime":8169,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"I don t understand how a relationship in which one person can hit another one to gain compliance can be NOT adversarial. I m not trying to trash you, Yolonda,","messageBody":"<div id=\"ygrps-yiv-235379414\">I don&#39;t understand how a relationship in which one person can hit  <br/>\nanother one to gain compliance can be NOT adversarial. I&#39;m not trying  <br/>\nto trash you, Yolonda, but trying to understand. Can you explain to  <br/>\nme how that doesn&#39;t feel adversarial to you or to your kids?<br/>\n<br/>\nI know that whenever I lose patience and get snappy or (god forbid)  <br/>\nstart yelling, or when I get really focused on getting my kid to do  <br/>\nthe thing I want him to do NOW, it definitely feels adversarial to  <br/>\nme. I feel like we have lost our alliance, that we are no longer  <br/>\nwanting the same things--and it always feels like a failure to me  <br/>\nwhen we can&#39;t find a common preference.<br/>\n<br/>\nI guess I would even make this broader than the issue of spanking per  <br/>\nse--at our house, whenever I use my greater power to force  <br/>\ncompliance, I think my son and I are adversaries. And when we are  <br/>\nadversaries, I always win. But it feels crappy to both of us. I  <br/>\nwouldn&#39;t say we have an adversarial relationship in general, but we  <br/>\nhave our adversarial moments--and it always feels like a failure, and  <br/>\nlike something I don&#39;t want to do again. I can&#39;t imagine using my  <br/>\ngreater physical power, or the power I have as the one with the money  <br/>\nand the car keys, to force my son to do something he didn&#39;t want to  <br/>\ndo--and then thinking, &quot;wow, that was great. That was exactly what I  <br/>\nwanted to happen. I&#39;m going to keep doing that from now on!&quot;<br/>\n<br/>\nAnd I would think, too, that whenever there is the possibility of  <br/>\npunishment, there are going to be things kids aren&#39;t going to tell  <br/>\ntheir parents. If I got spanked before for crossing the street by  <br/>\nmyself, I&#39;m not going to tell my mom I went across the street to see  <br/>\nthe neighbor&#39;s new puppy. This is not about Yolonda and her kids; I  <br/>\nam thinking hypothetically and about my own childhood. Whenever I  <br/>\nwent to parties as a teenager, my mother would tell me, &quot;Now, if your  <br/>\ndate is drinking and you don&#39;t want to ride home with him, just give  <br/>\nus a call. Anytime you need us to pick you up from a party, call!  <br/>\nWe&#39;d rather come out and get you in the middle of the night than have  <br/>\nyou driving with someone who&#39;s been drinking.&quot;<br/>\n<br/>\nThat sounds good. And I&#39;m sure my mother would have told anybody,  <br/>\n&quot;Susan knows that she can call us anytime if she needs to.&quot; But I  <br/>\ncouldn&#39;t, really. I knew from my other experiences with my parents  <br/>\nthat they would not have calmly come to pick me up in a non- <br/>\njudgmental way; I&#39;d have been harangued and shamed the whole way  <br/>\nhome, and probably punished for being at a party where alcohol was  <br/>\nserved, even if I hadn&#39;t been drinking. When I was 16, I was a  <br/>\npassenger in a car when a friend started driving like an idiot on a  <br/>\ngravel road, and ended up rolling the car. Even though I had been  <br/>\nsaying, &quot;Cheryl, stop that!&quot; my parents blamed me for the accident  <br/>\nand grounded me. I was a passenger, but somehow I caused the  <br/>\naccident! I knew from things like that that no matter what they said  <br/>\nabout &quot;call us in the middle of the night,&quot; I couldn&#39;t really--not  <br/>\nwithout paying a price.<br/>\n<br/>\nClarifying: I&#39;m not saying Yolonda does anything like what my parents  <br/>\ndid. But I&#39;m pretty sure my mother&#39;s perception of our relationship,  <br/>\nand mine, were quite a bit different.<br/>\n<br/>\nAs a thought-experiment and based on my own experiences, I can&#39;t see  <br/>\na relationship in which punishment--physical or not--plays a part as  <br/>\nanything but adversarial. And I can&#39;t imagine kids who have been  <br/>\npunished for certain things feeling that they can really tell their  <br/>\nparents &quot;anything.&quot; The possibility of punishment lays the groundwork  <br/>\nfor secrecy and mistrust.<br/>\n<br/>\nSu<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 10, 2005, at 11:04 PM, Yolonda Hicks wrote:<br/>\n<br/>\n&gt; I do not, now, nor ever have had an adversarial relationship with  <br/>\n&gt; my children.  My children know that I love them more than life  <br/>\n&gt; itself and do not hesitate to bring any issues to me. </span></blockquote></div>","specialLinks":[]},{"userId":222095129,"authorName":"Yolonda Hicks","from":"Yolonda Hicks &lt;books_music_birds@...&gt;","profile":"books_music_birds","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134273854","msgId":8167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjExMDQwNDE1LjE0MDA2LnFtYWlsQHdlYjYxMjEyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGRuZXJiaytoOW1oQGVHcm91cHMuY29tPg=="},"prevInTopic":8146,"nextInTopic":8168,"prevInTime":8166,"nextInTime":8168,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1219595829\">&lt;&lt;&quot;I also do not believe that corporal punishment, when used wisely and<br/>\ncarefully, is abuse. &quot;<br/>\n<br/>\nYou won&#39;t find much agreement on that viewpoint at this list.&gt;&gt;<br/>\n   <br/>\n  I think that&#39;s been pretty obvious so far, what with people calling me everything from cold-blooded to a child abuser.<br/>\n  <br/>\n&lt;&lt;ways to move beyond an adversarial relationship with <br/>\nyour children.&gt;&gt;<br/>\n   <br/>\n  I do not, now, nor ever have had an adversarial relationship with my children.  My children know that I love them more than life itself and do not hesitate to bring any issues to me.  I was raised pretty much the same way I am raising them, and I was NEVER afraid of my parents.  I&#39;m not blind, I see my parents for who they are, faults and all (which is why my children aren&#39;t being raised exactly the same), but I love and respect them deeply.<br/>\n<br/>\n&lt;&lt;I also ask that quoting the Bible be kept to a minimum....I <br/>\nrecognize there are Christians here that love their faith, but there <br/>\nare also Atheists, Pagans, Jews, some of us with no label that fits <br/>\netc....and we don&#39;t want to sift through posts with a bunch of Bible <br/>\nverses being quoted. I hope you can understand.&gt;&gt;<br/>\n   <br/>\n  The only reason I quoted the verses in this case was in response to the verses quoted in the original post, which left out the parents&#39; responsibility and the post which questioned whether the writer of the original quotes ever read the New Testament.<br/>\n  <br/>\n&lt;&lt;Sharing your views is fine of course, quoting your holy book isn&#39;t <br/>\nso great because we could all do that from a variety of sources (the <br/>\nTalmud, qu&#39;ran etc...) and never come to any kind of agreement.&gt;&gt;<br/>\n   <br/>\n  Funny, but I thought that tolerance and multiculturalism were about accepting each other&#39;s differences, not making sure everyone comes to an agreement. Since I had already stated that I try to live my life by the Bible, it is the basis for most of my views on life.  I would think that that would also be true for someone who had another belief system based on a holy book.<br/>\n<br/>\n&lt;&lt;So let&#39;s focus on how to treat children respectfully, how to stop <br/>\nspanking, how to trust learning how to live peacefully and joyfully <br/>\nas families in freedom.:)&gt;&gt;<br/>\n   <br/>\n  I do treat my children respectfully, and we will continue our search for how to best help them reach their goals in life, but if having to live by the beliefs of others on this list rather than our own is a requisite here, then this is not the place for me to find help in that search.<br/>\n<br/>\n<br/>\nWithdrawing,<br/>\n  Yolonda Hicks<br/>\n<br/>\n\t\t\t<br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\n Find Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227522899,"authorName":"camden","from":"camden &lt;ccoutlaw@...&gt;","profile":"ccoutlaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134229973","msgId":8146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzEwMWM1ZmRhMiQzMjNkNjFlMCQ2NDAxYThjMEBIT01FPg==","referencesHeader":"PDAwMTYwMWM1ZmQyYyQyYTU4ZDNlMCQ2NTAxYThjMEBob21lPiA8QkFZMTE1LURBVjEwRENBQzQ4MkFDQkFDODEzNzgzNkJEMzQ0MEBwaHguZ2JsPg=="},"prevInTopic":8144,"nextInTopic":8167,"prevInTime":8145,"nextInTime":8147,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Lesa, I didn t think you wouldn t read it, I truely hoped you would. If I didn t want you or anyone else to read it (or expect that you wouldn t), I wouldn t ","messageBody":"<div id=\"ygrps-yiv-4656346\">Lesa,<br/>\n<br/>\nI didn&#39;t think you wouldn&#39;t read it, I truely hoped you would. If I didn&#39;t <br/>\nwant you or anyone else to read it (or expect that you wouldn&#39;t), I wouldn&#39;t <br/>\nhave written about it here.  I was not discussing your specific upbringing. <br/>\nI do not know your father and did not say I did.<br/>\n<br/>\nAs far as if it tore out your father&#39;s heart, I don&#39;t know.  What I said was <br/>\n&quot;it would tear my heart out<br/>\n if I hit my child no matter what fatty part of the body it was on&quot;.<br/>\n<br/>\nIf you have a great relationship with your father that&#39;s great.  I love my <br/>\ndad to pieces. He did spank & I wish he didn&#39;t. I wish he had found another <br/>\nway to deal with issues that arrose.  He is deceased now & I&#39;d give anything <br/>\nto spend another day with him, but I still think he was wrong about the <br/>\nspanking. It was abuse, plain & simple in my opinion.  I think he realized <br/>\nthat later in life as he apologized for all the mistakes he made as a <br/>\nparent.   I used my parents examples of parenting, examined it, took the <br/>\ngood & trashed the bad.  As will my children, because I am not perfect. I <br/>\nhope they will take my parenting skills and examine them.  I hope they feel <br/>\nthere is more good than bad. And I certainly hope they will build on the <br/>\ngood. ( and forgive & learn from my mistakes)<br/>\n<br/>\nThis was not a personal attack on your family. If you feel it is you <br/>\nmisunderstood my point.  It is an &quot;attack&quot; on hitting kids & the idea that <br/>\nit is okay.<br/>\n<br/>\nCarol<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Lesa McMahon-Lowe&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lesajm@...\">lesajm@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, December 10, 2005 10:22 AM<br/>\nSubject: Re: [unschoolingbasics] What do you think?<br/>\n<br/>\n<br/>\n&gt; Please don&#39;t discuss my upbringing like I&#39;m not going to read it.  How you<br/>\n&gt; got out of that that my father had no emotion or that it didn&#39;t tear his<br/>\n&gt; heart out, I don&#39;t know.  I think I can go back to my post and read <br/>\n&gt; exactly<br/>\n&gt; what I wrote... and I can assure you that I never said anything of the <br/>\n&gt; sort.<br/>\n&gt;<br/>\n&gt; My father is the best father anyone could ever have.  He is kind, <br/>\n&gt; supportive<br/>\n&gt; and always there for me no matter what.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt;<br/>\n&gt; Lesa<br/>\n&gt;<br/>\n&gt; -------Original Message-------<br/>\n&gt;<br/>\n&gt; From: camden<br/>\n&gt; Date: 12/09/05 21:11:28<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Subject: Re: [unschoolingbasics] What do you think?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;&gt;&quot;I was spanked and never &quot;feared&quot; my father.  my mom didn&#39;t spank us<br/>\n&gt;&gt;&gt;because<br/>\n&gt;&gt;&gt; she was too emotional and you never spank a child out of anger (like<br/>\n&gt;&gt;&gt; Yolanda<br/>\n&gt;&gt;&gt; mentioned).&quot;<br/>\n&gt;<br/>\n&gt; I still know it is wrong.  Calm spanking???  I would hate to see a person<br/>\n&gt; who would have NO emotion while hitting a child, it would tear my heart <br/>\n&gt; out<br/>\n&gt; if I hit my child no matter what fatty part of the body it was on.<br/>\n&gt;<br/>\n&gt; If you can&#39;t look at it from a child&#39;s point of view, try from an adult<br/>\n&gt; perspective......... What if you were at work and you filed the paper work<br/>\n&gt; wrong or pushed the wrong buttons on the copier machine and they office<br/>\n&gt; course of action was 2 swats for the first offense and 3 for the second.<br/>\n&gt; Isn&#39;t that considered assault?  Would you put up with that as an adult?<br/>\n&gt; Would you allow your husband to hit you if you did the dishes &quot;wrong&quot; ? <br/>\n&gt; Not<br/>\n&gt;<br/>\n&gt; me.<br/>\n&gt;<br/>\n&gt; Children feel so defenseless when an older, bigger person uses force as a<br/>\n&gt; way to get what they want.  I have apologized to my two oldest (22 & 24)<br/>\n&gt; sons for the way I parented when they were young.  If I could go back and<br/>\n&gt; take back the spankings (which were few & far between, but none the less<br/>\n&gt; still happened) I would.  I now know that my older kids were &quot;well <br/>\n&gt; behaved&quot;<br/>\n&gt; kids because they didn&#39;t want to get a spanking.   Now I have 6 kids at <br/>\n&gt; home<br/>\n&gt;<br/>\n&gt; who are great, respectful to others, fun, interesting people.<br/>\n&gt;<br/>\n&gt; And they got that way without one spanking !!!!!<br/>\n&gt;<br/>\n&gt; Carol<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; SPONSORED LINKS Secondary school education Graduate school education Home<br/>\n&gt; school education<br/>\n&gt; Graduate school education online High school education Chicago school<br/>\n&gt; education<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; YAHOO! GROUPS LINKS<br/>\n&gt;<br/>\n&gt; Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What do you think?","postDate":"1134229111","msgId":8144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRuZXNwbitvczAzQGVHcm91cHMuY29tPg=="},"prevInTopic":8141,"nextInTopic":8146,"prevInTime":8143,"nextInTime":8145,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Please don t discuss my upbringing like I m not going to read it. Nobody was discussing you or your childhood, they were discussing what you said, which was","messageBody":"<div id=\"ygrps-yiv-716177823\">&quot;Please don&#39;t discuss my upbringing like I&#39;m not going to read it.&quot;<br/>\n<br/>\nNobody was discussing you or your childhood, they were discussing <br/>\nwhat you said, which was about a parent HITTING a child with no <br/>\nanger.<br/>\n<br/>\nThe person was simply responding to that information. It&#39;s not about <br/>\nyour father, or your childhood, it&#39;s about the idea of a parent <br/>\nhitting a child without anger...which is NOT a good thing around <br/>\nhere.<br/>\n<br/>\nIf you&#39;re feeling a strong sense of loyalty to your parents still, <br/>\nwithout having examined the things they could have done better, then <br/>\nI can see why spanking seems ok to you.<br/>\nMost of us have had years and years to come to terms with the good <br/>\nAND bad our parents did (yes, because they didn&#39;t have better tools <br/>\nand often struggled to do better than their own parents) and try to <br/>\ndo better.<br/>\nI love my parents very, very much. I think they did a great job, <br/>\nespecially considering how they were raised..but I had to examine <br/>\nthe things they did wrong in order to not repeat that behavior.<br/>\n<br/>\nThis isn&#39;t about anyone or their parents though. This is about the <br/>\nidea...please keep the disussion about ideas.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134228135","msgId":8141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYxMERDQUM0ODJBQ0JBQzgxMzc4MzZCRDM0NDBAcGh4LmdibD4=","referencesHeader":"PDAwMTYwMWM1ZmQyYyQyYTU4ZDNlMCQ2NTAxYThjMEBob21lPg=="},"prevInTopic":8139,"nextInTopic":8144,"prevInTime":8140,"nextInTime":8142,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Please don t discuss my upbringing like I m not going to read it.  How you\ngot out of that that my father had no emotion or that it didn t tear his\nheart out,","messageBody":"<div id=\"ygrps-yiv-167397840\">Please don&#39;t discuss my upbringing like I&#39;m not going to read it.  How you<br/>\ngot out of that that my father had no emotion or that it didn&#39;t tear his<br/>\nheart out, I don&#39;t know.  I think I can go back to my post and read exactly<br/>\nwhat I wrote... and I can assure you that I never said anything of the sort.\r<br/>\n\r<br/>\nMy father is the best father anyone could ever have.  He is kind, supportive<br/>\n and always there for me no matter what.  \r<br/>\n\r<br/>\n\r<br/>\nThanks,\r<br/>\n\r<br/>\nLesa \r<br/>\n \r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: camden\r<br/>\nDate: 12/09/05 21:11:28\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: Re: [unschoolingbasics] What do you think?\r<br/>\n \r<br/>\n\r<br/>\n\r<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;I was spanked and never &quot;feared&quot; my father.  my mom didn&#39;t spank us \r<br/>\n&gt;&gt;because\r<br/>\n&gt;&gt; she was too emotional and you never spank a child out of anger (like \r<br/>\n&gt;&gt; Yolanda\r<br/>\n&gt;&gt; mentioned).&quot;\r<br/>\n\r<br/>\n </span></blockquote>I still know it is wrong.  Calm spanking???  I would hate to see a person \r<br/>\nwho would have NO emotion while hitting a child, it would tear my heart out \r<br/>\nif I hit my child no matter what fatty part of the body it was on.\r<br/>\n\r<br/>\nIf you can&#39;t look at it from a child&#39;s point of view, try from an adult \r<br/>\nperspective......... What if you were at work and you filed the paper work \r<br/>\nwrong or pushed the wrong buttons on the copier machine and they office \r<br/>\ncourse of action was 2 swats for the first offense and 3 for the second. \r<br/>\nIsn&#39;t that considered assault?  Would you put up with that as an adult? \r<br/>\nWould you allow your husband to hit you if you did the dishes &quot;wrong&quot; ?  Not<br/>\n\r<br/>\nme.\r<br/>\n\r<br/>\nChildren feel so defenseless when an older, bigger person uses force as a \r<br/>\nway to get what they want.  I have apologized to my two oldest (22 & 24) \r<br/>\nsons for the way I parented when they were young.  If I could go back and \r<br/>\ntake back the spankings (which were few & far between, but none the less \r<br/>\nstill happened) I would.  I now know that my older kids were &quot;well behaved&quot; \r<br/>\nkids because they didn&#39;t want to get a spanking.   Now I have 6 kids at home<br/>\n\r<br/>\nwho are great, respectful to others, fun, interesting people.\r<br/>\n\r<br/>\nAnd they got that way without one spanking !!!!!\r<br/>\n\r<br/>\nCarol\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nSPONSORED LINKS Secondary school education Graduate school education Home<br/>\nschool education \r<br/>\nGraduate school education online High school education Chicago school<br/>\neducation \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nYAHOO! GROUPS LINKS \r<br/>\n\r<br/>\n Visit your group &quot;unschoolingbasics&quot; on the web.\r<br/>\n  \r<br/>\n To unsubscribe from this group, send an email to:\r<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>\r<br/>\n  \r<br/>\n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What do you think?","postDate":"1134227636","msgId":8139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRuZXJiaytoOW1oQGVHcm91cHMuY29tPg=="},"prevInTopic":8134,"nextInTopic":8141,"prevInTime":8138,"nextInTime":8140,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"I also do not believe that corporal punishment, when used wisely and carefully, is abuse.  You won t find much agreement on that viewpoint at this list. If","messageBody":"<div id=\"ygrps-yiv-2114712249\">&quot;I also do not believe that corporal punishment, when used wisely and<br/>\ncarefully, is abuse. &quot;<br/>\n<br/>\nYou won&#39;t find much agreement on that viewpoint at this list.<br/>\n<br/>\nIf you&#39;re interested in defending spanking, you&#39;re going to get a <br/>\nlot of strong and persuasive disagreement. If you&#39;re interested in <br/>\nhalting the hitting, then you&#39;ll get a lot of encouragement and <br/>\nsupport and ideas here.<br/>\n<br/>\nIt flies in the face of unschooling philosophies to hit a child. <br/>\nAbsolutely, without a doubt in direct opposition to every <br/>\nunschooling philosophy that exists.<br/>\n<br/>\nThis list is here for the purpose of moving people closer to <br/>\nunschooling philosophies. Maybe through smaller steps, maybe in <br/>\ndifferent ways, but that IS the purpose of this list. Our advice <br/>\nwill always lean towards radical unschooling.<br/>\n<br/>\nI hope you&#39;ll stick around and pick the brains of several of us that <br/>\nhave moved from spanking to never, ever punishing our children.<br/>\nAnd those that never did it to begin with.  There&#39;s a goldmine of <br/>\ninformation and ways to move beyond an adversarial relationship with <br/>\nyour children.<br/>\n<br/>\nI also ask that quoting the Bible be kept to a minimum....I <br/>\nrecognize there are Christians here that love their faith, but there <br/>\nare also Atheists, Pagans, Jews, some of us with no label that fits <br/>\netc....and we don&#39;t want to sift through posts with a bunch of Bible <br/>\nverses being quoted. I hope you can understand.<br/>\nThis is a very diverse list and in order to keep it a safe place for <br/>\npeople to receive unschooling advice, we need to keep religious <br/>\nstuff to a minimum.<br/>\nSharing your views is fine of course, quoting your holy book isn&#39;t <br/>\nso great because we could all do that from a variety of sources (the <br/>\nTalmud, qu&#39;ran etc...) and never come to any kind of agreement.<br/>\n<br/>\nSo let&#39;s focus on how to treat children respectfully, how to stop <br/>\nspanking, how to trust learning how to live peacefully and joyfully <br/>\nas families in freedom.:)<br/>\n<br/>\nRespectfully,<br/>\nRen</div>","specialLinks":[]},{"userId":183015595,"authorName":"Mother Earth (Tyra)","from":"&quot;Mother Earth &#92;(Tyra&#92;)&quot; &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134201009","msgId":8134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWUwMWM1ZmQ1ZSQ1ODc1ZGU4MCQ2YTAwYThjMEBjb21wdXRlcj4=","referencesHeader":"PDIwMDUxMjA5LjE4MjAyMi4yNzk2LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":8133,"nextInTopic":8139,"prevInTime":8133,"nextInTime":8135,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Well put, Deb!  Another child advocate!  I love it!  I am so with you on helping children avert dangerous activities by allowing them to explore it in a safe","messageBody":"<div id=\"ygrps-yiv-1447762089\">Well put, Deb!  Another child advocate!  I love it!  I am so with you on helping children avert dangerous activities by allowing them to explore it in a safe environment.  That is how I have gotten my children to not do dangerous things.!<br/>\n<br/>\nPeace!<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Deb Lewis <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, December 09, 2005 7:20 PM<br/>\n  Subject: Re: [unschoolingbasics] What do you think?<br/>\n  .<br/>\n<br/>\n  Does it follow logically that if you hit someone who depends on you,<br/>\n  trusts you, loves you,  who is physically smaller than you, less<br/>\n  experienced than you, who doesn&#39;t have legal recourse against you, that<br/>\n  it could be anything but abuse?<br/>\n<br/>\n  My mom is Jewish.  Her family believed if a child behaved badly it was<br/>\n  because of bad parenting and hitting someone because they have flawed<br/>\n  parents is mean and ignorant. <br/>\n<br/>\n  There was a time when men could hit their women and it was socially<br/>\n  acceptable.  How many women would say it was not abuse? <br/>\n<br/>\n  ***...as a child who continually goes out into the street (or plays with<br/>\n  fire, etc.) regardless of all correction methods tried.***<br/>\n<br/>\n  If a child repeatedly runs into the street the problem is not with the<br/>\n  child but with the mom.  If a child is curious about the street, mom<br/>\n  should go into the street with the child, when it&#39;s safe, until the child<br/>\n  has had his curiosity satisfied.  If a child is playing with fire, mom<br/>\n  should help him light matches in a safe place until his curiosity is<br/>\n  satisfied.   With a lot of close attention and talking about safe and<br/>\n  unsafe times and places to go into the street or to light fires, a child<br/>\n  will learn what he needs to in order to be safe.  It takes more time and<br/>\n  attention on the parents part then a spanking does but it&#39;s better all<br/>\n  around for the child, parent and relationship.  <br/>\n<br/>\n  No one deserves to be hit for being curious about the world.  They<br/>\n  deserve opportunity and the help of someone who will show them how to be<br/>\n  safe. <br/>\n<br/>\n  Children who are curious about the world do not need to be corrected. <br/>\n  They are not mistakes.  Their behavior is not a mistake.  It is perfectly<br/>\n  normal and human to want to understand the world around us.  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":183015595,"authorName":"Mother Earth (Tyra)","from":"&quot;Mother Earth &#92;(Tyra&#92;)&quot; &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134200642","msgId":8133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDUwMWM1ZmQ1ZCQ3ZTA4ODJjMCQ2YTAwYThjMEBjb21wdXRlcj4=","referencesHeader":"PDAyNzAwMWM1ZmQyMiQzNTI0ZDk5MCQ2NDAxYThjMEBIT01FPiA8MDAxNjAxYzVmZDJjJDJhNThkM2UwJDY1MDFhOGMwQGhvbWU+"},"prevInTopic":8130,"nextInTopic":8134,"prevInTime":8132,"nextInTime":8134,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Thank you for being an advocate for children.  A voice for people who often times are voiceless. Peace Tyra ... From: camden To:","messageBody":"<div id=\"ygrps-yiv-563818892\">Thank you for being an advocate for children.  A voice for people who often times are voiceless.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: camden <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, December 09, 2005 7:49 PM<br/>\n  Subject: Re: [unschoolingbasics] What do you think?<br/>\n<br/>\n  Children feel so defenseless when an older, bigger person uses force as a <br/>\n  way to get what they want.  I have apologized to my two oldest (22 & 24) <br/>\n  sons for the way I parented when they were young.  If I could go back and <br/>\n  take back the spankings (which were few & far between, but none the less <br/>\n  still happened) I would.  I now know that my older kids were &quot;well behaved&quot; <br/>\n  kids because they didn&#39;t want to get a spanking.   Now I have 6 kids at home <br/>\n  who are great, respectful to others, fun, interesting people.<br/>\n<br/>\n  And they got that way without one spanking !!!!!<br/>\n<br/>\n  Carol<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":227522899,"authorName":"camden","from":"camden &lt;ccoutlaw@...&gt;","profile":"ccoutlaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134179348","msgId":8130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTYwMWM1ZmQyYyQyYTU4ZDNlMCQ2NTAxYThjMEBob21lPg==","referencesHeader":"PDAyNzAwMWM1ZmQyMiQzNTI0ZDk5MCQ2NDAxYThjMEBIT01FPg=="},"prevInTopic":8128,"nextInTopic":8133,"prevInTime":8129,"nextInTime":8131,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"... I still know it is wrong.  Calm spanking???  I would hate to see a person who would have NO emotion while hitting a child, it would tear my heart out if I","messageBody":"<div id=\"ygrps-yiv-1480489040\"><blockquote><span title=\"ireply\">&gt;&gt;&quot;I was spanked and never &quot;feared&quot; my father.  my mom didn&#39;t spank us <br/>\n&gt;&gt;because<br/>\n&gt;&gt; she was too emotional and you never spank a child out of anger (like <br/>\n&gt;&gt; Yolanda<br/>\n&gt;&gt; mentioned).&quot;<br/>\n<br/>\n </span></blockquote>I still know it is wrong.  Calm spanking???  I would hate to see a person <br/>\nwho would have NO emotion while hitting a child, it would tear my heart out <br/>\nif I hit my child no matter what fatty part of the body it was on.<br/>\n<br/>\nIf you can&#39;t look at it from a child&#39;s point of view, try from an adult <br/>\nperspective......... What if you were at work and you filed the paper work <br/>\nwrong or pushed the wrong buttons on the copier machine and they office <br/>\ncourse of action was 2 swats for the first offense and 3 for the second. <br/>\nIsn&#39;t that considered assault?  Would you put up with that as an adult? <br/>\nWould you allow your husband to hit you if you did the dishes &quot;wrong&quot; ?  Not <br/>\nme.<br/>\n<br/>\nChildren feel so defenseless when an older, bigger person uses force as a <br/>\nway to get what they want.  I have apologized to my two oldest (22 & 24) <br/>\nsons for the way I parented when they were young.  If I could go back and <br/>\ntake back the spankings (which were few & far between, but none the less <br/>\nstill happened) I would.  I now know that my older kids were &quot;well behaved&quot; <br/>\nkids because they didn&#39;t want to get a spanking.   Now I have 6 kids at home <br/>\nwho are great, respectful to others, fun, interesting people.<br/>\n<br/>\n And they got that way without one spanking !!!!!<br/>\n<br/>\nCarol</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134177622","msgId":8128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjA5LjE4MjAyMi4yNzk2LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":8126,"nextInTopic":8130,"prevInTime":8127,"nextInTime":8129,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"***I also do not believe that corporal punishment, when used wisely and carefully, is abuse. *** If you hit anyone else in order to make them do what you want","messageBody":"<div id=\"ygrps-yiv-931152882\">***I also do not believe that corporal punishment, when used wisely and<br/>\ncarefully, is abuse. ***<br/>\n<br/>\nIf you hit anyone else in order to make them do what you want them to do,<br/>\nor in order to &quot;punish&quot; them (and punishment is just revenge with a<br/>\npolitically correct name)  you can be charged with a crime and if<br/>\nconvicted serve time in jail for assault.<br/>\n<br/>\nDoes it follow logically that if you hit someone who depends on you,<br/>\ntrusts you, loves you,  who is physically smaller than you, less<br/>\nexperienced than you, who doesn&#39;t have legal recourse against you, that<br/>\nit could be anything but abuse?<br/>\n<br/>\nMy mom is Jewish.  Her family believed if a child behaved badly it was<br/>\nbecause of bad parenting and hitting someone because they have flawed<br/>\nparents is mean and ignorant. <br/>\n <br/>\nThere was a time when men could hit their women and it was socially<br/>\nacceptable.  How many women would say it was not abuse? <br/>\n<br/>\n***...as a child who continually goes out into the street (or plays with<br/>\nfire, etc.) regardless of all correction methods tried.***<br/>\n<br/>\nIf a child repeatedly runs into the street the problem is not with the<br/>\nchild but with the mom.  If a child is curious about the street, mom<br/>\nshould go into the street with the child, when it&#39;s safe, until the child<br/>\nhas had his curiosity satisfied.  If a child is playing with fire, mom<br/>\nshould help him light matches in a safe place until his curiosity is<br/>\nsatisfied.   With a lot of close attention and talking about safe and<br/>\nunsafe times and places to go into the street or to light fires, a child<br/>\nwill learn what he needs to in order to be safe.  It takes more time and<br/>\nattention on the parents part then a spanking does but it&#39;s better all<br/>\naround for the child, parent and relationship.  <br/>\n<br/>\nNo one deserves to be hit for being curious about the world.  They<br/>\ndeserve opportunity and the help of someone who will show them how to be<br/>\nsafe. <br/>\n<br/>\nChildren who are curious about the world do not need to be corrected. <br/>\nThey are not mistakes.  Their behavior is not a mistake.  It is perfectly<br/>\nnormal and human to want to understand the world around us.  <br/>\n<br/>\n***...an appropriately done spanking (on the fatty tissue of the buttocks<br/>\nand by an emotionally-controlled parent, no anger) gives a reminder to<br/>\nthe child that stings but does not injure, which is highly preferable to<br/>\na dead child.***<br/>\n<br/>\nA child hit by a parent or a dead child are not the only two choices. <br/>\nThere are much better choices if a parent is willing and able to think it<br/>\nthrough.  <br/>\n<br/>\n***...by an emotionally-controlled parent, no anger...***<br/>\n<br/>\nCold blooded assault is not less reprehensible than lashing out in anger<br/>\nand in some courts thought to be much worse.  It shows a deliberate,<br/>\npremeditated attack.   <br/>\n<br/>\n***If this mother was truly paying attention to how her son is wired, she<br/>\nwould be looking for other ways to help him learn.***<br/>\n<br/>\nI absolutely agree and think you should consider this carefully and<br/>\nthoughtfully the next time you&#39;re about to hit a child. <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134174221","msgId":8126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYxNzY4MjFDMkY2RjMwMTg4MUY0NEE5RDM0NDBAcGh4LmdibD4=","referencesHeader":"PDAxNWMwMWM1ZmNmOSQxMzc5YzFkMCQ2NDAxYThjMEBIT01FPg=="},"prevInTopic":8125,"nextInTopic":8128,"prevInTime":8125,"nextInTime":8127,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"I was spanked and never feared my father.  my mom didn t spank us because\nshe was too emotional and you never spank a child out of anger (like Yolanda","messageBody":"<div id=\"ygrps-yiv-1538653926\">I was spanked and never &quot;feared&quot; my father.  my mom didn&#39;t spank us because<br/>\nshe was too emotional and you never spank a child out of anger (like Yolanda<br/>\nmentioned).\r<br/>\n\r<br/>\nI don&#39;t spank my daughter because that is what my husband wants.  And as his<br/>\nwife I will concede to that way of doing things.  I&#39;m more like my mother<br/>\nanyway and would never want to expose my child to spanking out of anger. \r<br/>\n\r<br/>\nI like the way Yolanda laid things out.  This is the way I was raised and it<br/>\nworked in our household.  My upbringing truly saved me during my teen years<br/>\nafter my parents divorced.\r<br/>\n\r<br/>\nLesa\r<br/>\n \r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: camden\r<br/>\nDate: 12/09/05 13:55:44\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: Re: [unschoolingbasics] What do you think?\r<br/>\n \r<br/>\nI had my first child when I was 16 & tried to raise him the way my parents \r<br/>\ndid because I thought that was the right and only way.  I did spank, as did \r<br/>\nmy parents.\r<br/>\n\r<br/>\nDo I regret this?  Oh Yes !!  I don&#39;t think any good comes of using corporal<br/>\n\r<br/>\npunishment. I feel it only produces fear. I want my kids to respect & love \r<br/>\nme, not fear me.  When my kids make a mistake big or small, I want to know \r<br/>\nthat they feel they can come to me and not fear what will happen if they do.\r<br/>\n\r<br/>\nMy parents never changed in their belief of spanking, I started out \r<br/>\nbelieving this and changed, my hope is my kids will choose not to go down \r<br/>\nthe &quot;spanking&quot; path to begin with.\r<br/>\n\r<br/>\nSo thats what I think.\r<br/>\n\r<br/>\nCarol\r<br/>\n\r<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- \r<br/>\nFrom: &quot;Yolonda Hicks&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:books_music_birds@...\">books_music_birds@...</a>&gt;\r<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;\r<br/>\nSent: Friday, December 09, 2005 2:04 PM\r<br/>\nSubject: Re: [unschoolingbasics] What do you think?\r<br/>\n\r<br/>\n\r<br/>\n&gt; As a Christian who reads and tries to live by the Bible as a whole, I have<br/>\n\r<br/>\n&gt; to both agree and disagree with both sides of this argument.  The Bible, \r<br/>\n&gt; even in the New Testament (which the original post referred to but did not<br/>\n\r<br/>\n&gt; quote), does require obedience from children but also places requirements \r<br/>\n&gt; on the parents. (The verses I&#39;m quoting below are from the \r<br/>\n&gt; NIrV--translation written to about a &quot;3rd-grade&quot; level--as my daughter&#39;s \r<br/>\n&gt; Bible was the one close at hand.)\r<br/>\n&gt;\r<br/>\n&gt;  Ephesians 6:1-2 states, &quot;Children, obey your parents as believers in the \r<br/>\n&gt; Lord.  Obey them because it&#39;s the right thing to do.  Scripture says, \r<br/>\n&gt; &#39;Honor your father and mother.&#39;  That is the first commandment that has a \r<br/>\n&gt; promise.&quot;  However, verse 4 says, &quot;Fathers [and mothers], don&#39;t make your \r<br/>\n&gt; children angry.  Instead, train them and teach them the ways of the Lords \r<br/>\n&gt; as you raise them.&quot;\r<br/>\n&gt;\r<br/>\n&gt;  Colossians 3:20 states, &quot;Children, obey your parents in everything.  That<br/>\n\r<br/>\n&gt; pleases the Lord.&quot;  It is immediately followed, though, by verse 21 \r<br/>\n&gt; stating, &quot;Fathers [and mothers], don&#39;t make your children bitter.  If you \r<br/>\n&gt; do, they will lose hope.&quot;\r<br/>\n&gt;\r<br/>\n&gt;  For those of us who believe the Bible, we are told that children need to \r<br/>\n&gt; obey, but we are also told that we have the responsibility to make the \r<br/>\n&gt; right rules/commands.  God&#39;s rules for us are to protect us and for our \r<br/>\n&gt; good, so our rules should be for our children (not because it makes our \r<br/>\n&gt; lives easier or we just like things that way).  My children are not \r<br/>\n&gt; &quot;perfect models of obedience&quot;, even to good rules, but the fact that they \r<br/>\n&gt; have been trained in the importance of obedience has literally saved my \r<br/>\n&gt; son&#39;s life twice.\r<br/>\n&gt;\r<br/>\n&gt;  I also do not believe that corporal punishment, when used wisely and \r<br/>\n&gt; carefully, is abuse.  The shepherd&#39;s rod was used to gently guide the \r<br/>\n&gt; sheep, but, in certain circumstances when a sheep would continue to do \r<br/>\n&gt; something which endangered it, it was also used to strike the sheep. I was<br/>\n\r<br/>\n&gt; taught that spanking is the same, not to be used for every little offense \r<br/>\n&gt; (that&#39;s where guidance, related consequences, or sometimes even rewards \r<br/>\n&gt; for the opposite behavior come into play) but reserved for serious \r<br/>\n&gt; problems, as a child who continually goes out into the street (or plays \r<br/>\n&gt; with fire, etc.) regardless of all correction methods tried.  At that \r<br/>\n&gt; point, an appropriately done spanking (on the fatty tissue of the buttocks<br/>\n\r<br/>\n&gt; and by an emotionally-controlled parent, no anger) gives a reminder to the<br/>\n\r<br/>\n&gt; child that stings but does not injure, which is highly preferable to a \r<br/>\n&gt; dead child.  Usually once does the trick; I&#39;ve never met or heard about a \r<br/>\n&gt; &quot;normal&quot; child who required more than twice to correct a\r<br/>\n&gt; situation like this--and you don&#39;t use corporal punishment at all with a \r<br/>\n&gt; mentally handicapped child, or one who has been previously abused.\r<br/>\n&gt;\r<br/>\n&gt;  However, I think forcing that poor child to do two pages of math is \r<br/>\n&gt; probably pushing the limit.  Even when we were completely school-at-home, \r<br/>\n&gt; my son would have had an emotional breakdown if I&#39;d expected that of him \r<br/>\n&gt; (and he LIKES math). There&#39;s another verse in the Bible that talks about \r<br/>\n&gt; training up a child in the way he/she should go, literally meaning \r<br/>\n&gt; according to his/her bent (the way God made the child--personality, \r<br/>\n&gt; talents, etc.).  If this mother was truly paying attention to how her son \r<br/>\n&gt; is wired, she would be looking for other ways to help him learn.\r<br/>\n&gt;\r<br/>\n&gt;  Just my two cents worth,\r<br/>\n&gt;  Yolonda Hicks\r<br/>\n&gt;\r<br/>\n&gt; ---------------------------------\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt; ---------------------------------\r<br/>\n&gt; Yahoo! Shopping\r<br/>\n&gt; Find Great Deals on Holiday Gifts at Yahoo! Shopping\r<br/>\n&gt;\r<br/>\n&gt; [Non-text portions of this message have been removed]\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt; Yahoo! Groups Links\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt;\r<br/>\n&gt; \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nSPONSORED LINKS Secondary school education Graduate school education Home<br/>\nschool education \r<br/>\nGraduate school education online High school education Chicago school<br/>\neducation \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nYAHOO! GROUPS LINKS \r<br/>\n\r<br/>\n Visit your group &quot;unschoolingbasics&quot; on the web.\r<br/>\n  \r<br/>\n To unsubscribe from this group, send an email to:\r<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>\r<br/>\n  \r<br/>\n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":119145590,"authorName":"April","from":"&quot;April&quot; &lt;abmorris23@...&gt;","profile":"klkb624","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] What do you think?","postDate":"1134167877","msgId":8125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDUxMjA5MTQxNTI2Ljk3ODY4LnFtYWlsQHdlYjUzNDE1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":8124,"nextInTopic":8126,"prevInTime":8124,"nextInTime":8126,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Sadly, I do know parents that would give or follow this advice.  The advantage of being a parent of older kids is that I am in a position to offer an","messageBody":"<div id=\"ygrps-yiv-178296836\">Sadly, I do know parents that would give or follow this advice.  The<br/>\nadvantage of being a parent of older kids is that I am in a position to<br/>\noffer an alternative view of Biblical parenting. Some see it as a breath of<br/>\nfresh air, others see it as blasphemy. I just keep doing what I think is<br/>\nright for us and let the cards fall where they may.<br/>\n<br/>\n <br/>\n<br/>\n~April<br/>\nMom to Kate-19, Lisa-16, Karl-14, & Ben-10.<br/>\n*REACH Homeschool Grp, an inclusive group in Oakland County<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.reachhomeschool.com\">http://www.reachhomeschool.com</a>&gt; www.reachhomeschool.com<br/>\n<br/>\n* Michigan Unschoolers<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/michigan_unschoolers/\">http://groups.yahoo.com/group/michigan_unschoolers/</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/michigan_unschoolers/\">http://groups.yahoo.com/group/michigan_unschoolers/</a><br/>\n*Check out Chuck&#39;s art!     &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.artkunst23.com/\">http://www.artkunst23.com/</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.artkunst23.com\">http://www.artkunst23.com</a><br/>\n&quot;Know where to find the information and how to use it - That&#39;s the secret of<br/>\nsuccess.&quot;<br/>\nAlbert Einstein (1879-1955)<br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Ann<br/>\nSent: Friday, December 09, 2005 9:15 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] What do you think?<br/>\n<br/>\n <br/>\n<br/>\nThis is horrifying! .... So ignorant too.  Shepard&#39;s don&#39;t use their rod to<br/>\nbeat the sheep, they use it to gently guide the sheep.  So his advice is<br/>\nbased on a biblical interpretation that a rod is used for beating!  This<br/>\npoor little guy just wants to play and would learn beautifully by playing.<br/>\nThe only concept he is learning is to hate all the subject matter she is<br/>\ncramming down his throat.  <br/>\n  I can tell I just don&#39;t know people like this because I am too shocked.<br/>\n   <br/>\n  I am Christian ( a part of what would be a liberal segment of Christianity<br/>\nadmittedly), but I know of no parent that would actually take that advice.<br/>\nThe ones I know would be frantically trying other curriculum&#39;s or move to<br/>\n&#39;unit studies&#39; or other such stuff, but they wouldn&#39;t resort to hitting<br/>\ntheir kids.  In fact I get quite a few questions that start like How do you<br/>\nunschool, or what do you mean by unchooling?  Most some interested, some<br/>\neven receptive.  <br/>\n   <br/>\n  Ann<br/>\n<br/>\n&quot;Mother Earth (Tyra)&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motherspirit@...\">motherspirit@...</a>&gt; wrote:<br/>\n  Mabel<br/>\n<br/>\nI was reading an online newsletter from Sonlight and found the following<br/>\nanswer and question.  Now that I am unschooling, this is wild to me.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\n<br/>\nBad Attitudes<br/>\n<br/>\nPOST: How do you handle attitude with schoolwork? My 7-year-old son gives me<br/>\nsuch grief every day over schoolwork. Every day it is the same nonsense. Can<br/>\nwe (play, watch tv, go outside . . .)? &quot;Not until you&#39;ve done your<br/>\nschoolwork.&quot; Eyes roll, shoulders slouch, big sigh and groan!<br/>\n<br/>\nSo when he actually gets his books out and starts something, he tries to do<br/>\nthe bare minimum. If I say two pages of math, he forgets and does one! Then<br/>\nthe &quot;I can&#39;t find my _____ book&quot; starts! Now we have a schoolroom, and they<br/>\neach have a specific section on the shelves in the closet to use for their<br/>\nbooks. He is so lazy about picking his stuff up and putting it away where it<br/>\nbelongs. We had a huge discussion this weekend about how he was going to<br/>\nmiss out on things because he was getting extra chores until he learned to<br/>\ndo things right the first time.<br/>\n<br/>\nBack to schoolwork, though: every time I correct a page and realize he<br/>\ndidn&#39;t understand the problem and ask him how to do it correctly, the tears<br/>\nand drama start. I don&#39;t understand it! He does very well when he wants to.<br/>\nHe is good at math and typically gets the concepts easily. His problem comes<br/>\nwhen he rushes through and doesn&#39;t take the time to read the directions. I<br/>\nam so frustrated with the same things everyday. It seems to be more of an<br/>\nattitude problem than actually not understanding though. If he truly didn&#39;t<br/>\nget the concept I could understand but he is frustrated because he thought<br/>\nhe was done and now I am going to ask him to correct the ones he missed.<br/>\n<br/>\nMy husband is complaining that all I do is fuss at them nonstop but nothing<br/>\nI am saying or doing seems to make a change in their behaviors. I feel like<br/>\nthe meanest mom in the world some days, but I know they should be able to do<br/>\nthe simplest things like pick up after themselves and follow my directions<br/>\nwithout such disagreement. I am feeling like I am drowning underneath it all<br/>\nand not enjoying my family the way God intended me to. Anyone have any<br/>\nadvice?????<br/>\n<br/>\n--beattiebunchnh<br/>\n<br/>\nPOST: I am convinced that the very most important and basic &quot;lesson&quot; our<br/>\nchildren must learn is obedience. Why? Because God requires that we obey<br/>\nHim. Time after time, our children will have to decide whether they&#39;re going<br/>\nto obey God or not. If they learn and practice &quot;half-obedience&quot; (delayed<br/>\nobedience or obedience with attitude) to mom and dad, are they not learning<br/>\nhow to &quot;half obey&quot;? Aren&#39;t they learning to obey God that way? Do we want<br/>\nthem to reason, &quot;It&#39;s ok for me to do this. I&#39;ll obey God eventually&quot;?!)<br/>\n<br/>\n1--Start with extremely clear expectations/rules. Be sure every child knows<br/>\nexactly what is expected. Don&#39;t make a list a mile long. You could even<br/>\nstart with simply one rule: Obey mom and dad immediately, completely, every<br/>\ntime, with a good attitude. Decide beforehand what the consequences will be<br/>\nfor NOT obeying. Explain this clearly to them beforehand. &quot;If you CHOOSE to<br/>\ndisobey, this will be the consequence YOU ARE CHOOSING.&quot; (Personally, I<br/>\nbelieve the &quot;rod&quot; is to be used most of the time. Do you know how often this<br/>\nis mentioned in Scripture?!?!) Whatever the consequence, make it something<br/>\nthe child really wants to avoid. Note: &quot;Childishness&quot; is not the same as<br/>\n&quot;disobedience.&quot; Don&#39;t punish childishness. It is exasperating to a parent,<br/>\nbut it requires training.<br/>\n<br/>\n2--Calmly and quietly, in love, &quot;reprove&quot; a child when he disobeys. Remind<br/>\nhim of what God says. God says in the Word that children must obey their<br/>\nparents. It is sin not to obey. This is to obey God, too. (You want him to<br/>\nlearn to obey God!) There is no other choice to be made. God knows what is<br/>\nbest for him. Tell him you want him to learn to obey you so he will choose<br/>\nto obey God later. You are sorry he&#39;s chosen to disobey and now must bear<br/>\nthe consequences. It is his choice. (You needn&#39;t fuss over and over at him<br/>\nor get mad. You explained everything ahead of time and he knew the plan.)<br/>\n[Ex. 20:12, Eph. 6:1, Col. 3:20] &quot;Do all things without complaining or<br/>\narguing.&quot; All children and parents should memorize this command!<br/>\n<br/>\n3--Lead your child to confess his sin to God. Pray with him. Lead him to ask<br/>\nforgiveness of you as well as of God. (This is very hard for adults to do<br/>\neven, but it melts hearts in repentance.)<br/>\n<br/>\n4--Calmly carry out the consequence. Remember, the Bible says that no<br/>\ndiscipline is pleasant at the time, but it has sweet rewards. Prov. 19:18<br/>\nsays &quot;Discipline your son while there is hope, and do not desire his death.&quot;<br/>\nProv. 13:24 says, &quot;He who spares the rod hates his son, but he who loves him<br/>\ndisciplines him diligently.&quot; Prov. 22:15 says, &quot;Foolishness is bound up in<br/>\nthe heart of a child; the rod of discipline will remove it far from him.&quot;<br/>\nRead Prov. 29:15, 17. Prov. 23:13-14, says &quot;Do not withhold discipline from<br/>\na child; if you punish him with the rod, he will not die. Punish him with<br/>\nthe rod and save his soul from death.&quot;<br/>\n<br/>\n5--Love, hug, and forgive your child completely.<br/>\n<br/>\nRepeat every time the child disobeys! Teach him that obedience is of utmost<br/>\nimportance!<br/>\n<br/>\n--Jannyruth <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Secondary school education   Graduate school education   Home school<br/>\neducation     Graduate school education online   High school education<br/>\nChicago school education <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n                  <br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\nFind Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\nYAHOO! GROUPS LINKS <br/>\n<br/>\n <br/>\n<br/>\n*\t Visit your group &quot;unschoolingbasics<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics\">http://groups.yahoo.com/group/unschoolingbasics</a>&gt; &quot; on the web.<br/>\n  <br/>\n*\t To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*\t Your use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":207475060,"authorName":"Anastasia Hall","from":"Anastasia Hall &lt;hall.anastasia@...&gt;","profile":"o2manee","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134159774","msgId":8124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjA5MjAyMjU0Ljk0MjczLnFtYWlsQHdlYjgxMjA5Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDUxMjA5MTkwNDU4LjU0NDM1LnFtYWlsQHdlYjYxMjEzLm1haWwueWFob28uY29tPg=="},"prevInTopic":8123,"nextInTopic":8125,"prevInTime":8123,"nextInTime":8125,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Yolanda, I have my Bible open and was just typing the same thing and lost the post before I could get it sent.  The Sonlight people missed the part about","messageBody":"<div id=\"ygrps-yiv-906088951\">Yolanda, I have my Bible open and was just typing the same thing and lost the post before I could get it sent.  The Sonlight people missed the part about fathers not provoking their children unto wrath, lest they become discouraged, didn&#39;t they?  I would think Mom nagging and hounding me to do math papers would cause me to be wrathful and discouraged.  Personally, fear of reproof causes resentment in me leading to disobedience, and love brings me to obedience.<br/>\n   <br/>\n  Anastasia<br/>\n   <br/>\n  LOL- I&#39;m listening to Dr. Phil on the TV in the other room saying that 75% of kids whose parents push them too hard in music or sports drop out of the activity and never pick it up again....  Fitting?<br/>\n<br/>\nYolonda Hicks &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:books_music_birds@...\">books_music_birds@...</a>&gt; wrote:<br/>\n  As a Christian who reads and tries to live by the Bible as a whole, I have to both agree and disagree with both sides of this argument.  The Bible, even in the New Testament (which the original post referred to but did not quote), does require obedience from children but also places requirements on the parents. (The verses I&#39;m quoting below are from the NIrV--translation written to about a &quot;3rd-grade&quot; level--as my daughter&#39;s Bible was the one close at hand.)  <br/>\n   <br/>\n  Ephesians 6:1-2 states, &quot;Children, obey your parents as believers in the Lord.  Obey them because it&#39;s the right thing to do.  Scripture says, &#39;Honor your father and mother.&#39;  That is the first commandment that has a promise.&quot;  However, verse 4 says, &quot;Fathers [and mothers], don&#39;t make your children angry.  Instead, train them and teach them the ways of the Lords as you raise them.&quot; <br/>\n   <br/>\n  Colossians 3:20 states, &quot;Children, obey your parents in everything.  That pleases the Lord.&quot;  It is immediately followed, though, by verse 21 stating, &quot;Fathers [and mothers], don&#39;t make your children bitter.  If you do, they will lose hope.&quot;<br/>\n<br/>\n  For those of us who believe the Bible, we are told that children need to obey, but we are also told that we have the responsibility to make the right rules/commands.  God&#39;s rules for us are to protect us and for our good, so our rules should be for our children (not because it makes our lives easier or we just like things that way).  My children are not &quot;perfect models of obedience&quot;, even to good rules, but the fact that they have been trained in the importance of obedience has literally saved my son&#39;s life twice.<br/>\n   <br/>\n  I also do not believe that corporal punishment, when used wisely and carefully, is abuse.  The shepherd&#39;s rod was used to gently guide the sheep, but, in certain circumstances when a sheep would continue to do something which endangered it, it was also used to strike the sheep. I was taught that spanking is the same, not to be used for every little offense (that&#39;s where guidance, related consequences, or sometimes even rewards for the opposite behavior come into play) but reserved for serious problems, as a child who continually goes out into the street (or plays with fire, etc.) regardless of all correction methods tried.  At that point, an appropriately done spanking (on the fatty tissue of the buttocks and by an emotionally-controlled parent, no anger) gives a reminder to the child that stings but does not injure, which is highly preferable to a dead child.  Usually once does the trick; I&#39;ve never met or heard about a &quot;normal&quot; child who required more than twice to correct a<br/>\nsituation like this--and you don&#39;t use corporal punishment at all with a mentally handicapped child, or one who has been previously abused.<br/>\n   <br/>\n  However, I think forcing that poor child to do two pages of math is probably pushing the limit.  Even when we were completely school-at-home, my son would have had an emotional breakdown if I&#39;d expected that of him (and he LIKES math). There&#39;s another verse in the Bible that talks about training up a child in the way he/she should go, literally meaning according to his/her bent (the way God made the child--personality, talents, etc.).  If this mother was truly paying attention to how her son is wired, she would be looking for other ways to help him learn.<br/>\n   <br/>\n  Just my two cents worth,<br/>\n  Yolonda Hicks<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n                  <br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\nFind Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227522899,"authorName":"camden","from":"camden &lt;ccoutlaw@...&gt;","profile":"ccoutlaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134157427","msgId":8123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNWMwMWM1ZmNmOSQxMzc5YzFkMCQ2NDAxYThjMEBIT01FPg==","referencesHeader":"PDIwMDUxMjA5MTkwNDU4LjU0NDM1LnFtYWlsQHdlYjYxMjEzLm1haWwueWFob28uY29tPg=="},"prevInTopic":8122,"nextInTopic":8124,"prevInTime":8122,"nextInTime":8124,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"I had my first child when I was 16 & tried to raise him the way my parents did because I thought that was the right and only way.  I did spank, as did my","messageBody":"<div id=\"ygrps-yiv-47831726\">I had my first child when I was 16 & tried to raise him the way my parents <br/>\ndid because I thought that was the right and only way.  I did spank, as did <br/>\nmy parents.<br/>\n<br/>\nDo I regret this?  Oh Yes !!  I don&#39;t think any good comes of using corporal <br/>\npunishment. I feel it only produces fear. I want my kids to respect & love <br/>\nme, not fear me.  When my kids make a mistake big or small, I want to know <br/>\nthat they feel they can come to me and not fear what will happen if they do.<br/>\n<br/>\nMy parents never changed in their belief of spanking, I started out <br/>\nbelieving this and changed, my hope is my kids will choose not to go down <br/>\nthe &quot;spanking&quot; path to begin with.<br/>\n<br/>\nSo thats what I think.<br/>\n<br/>\nCarol<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Yolonda Hicks&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:books_music_birds@...\">books_music_birds@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, December 09, 2005 2:04 PM<br/>\nSubject: Re: [unschoolingbasics] What do you think?<br/>\n<br/>\n<br/>\n&gt; As a Christian who reads and tries to live by the Bible as a whole, I have <br/>\n&gt; to both agree and disagree with both sides of this argument.  The Bible, <br/>\n&gt; even in the New Testament (which the original post referred to but did not <br/>\n&gt; quote), does require obedience from children but also places requirements <br/>\n&gt; on the parents. (The verses I&#39;m quoting below are from the <br/>\n&gt; NIrV--translation written to about a &quot;3rd-grade&quot; level--as my daughter&#39;s <br/>\n&gt; Bible was the one close at hand.)<br/>\n&gt;<br/>\n&gt;  Ephesians 6:1-2 states, &quot;Children, obey your parents as believers in the <br/>\n&gt; Lord.  Obey them because it&#39;s the right thing to do.  Scripture says, <br/>\n&gt; &#39;Honor your father and mother.&#39;  That is the first commandment that has a <br/>\n&gt; promise.&quot;  However, verse 4 says, &quot;Fathers [and mothers], don&#39;t make your <br/>\n&gt; children angry.  Instead, train them and teach them the ways of the Lords <br/>\n&gt; as you raise them.&quot;<br/>\n&gt;<br/>\n&gt;  Colossians 3:20 states, &quot;Children, obey your parents in everything.  That <br/>\n&gt; pleases the Lord.&quot;  It is immediately followed, though, by verse 21 <br/>\n&gt; stating, &quot;Fathers [and mothers], don&#39;t make your children bitter.  If you <br/>\n&gt; do, they will lose hope.&quot;<br/>\n&gt;<br/>\n&gt;  For those of us who believe the Bible, we are told that children need to <br/>\n&gt; obey, but we are also told that we have the responsibility to make the <br/>\n&gt; right rules/commands.  God&#39;s rules for us are to protect us and for our <br/>\n&gt; good, so our rules should be for our children (not because it makes our <br/>\n&gt; lives easier or we just like things that way).  My children are not <br/>\n&gt; &quot;perfect models of obedience&quot;, even to good rules, but the fact that they <br/>\n&gt; have been trained in the importance of obedience has literally saved my <br/>\n&gt; son&#39;s life twice.<br/>\n&gt;<br/>\n&gt;  I also do not believe that corporal punishment, when used wisely and <br/>\n&gt; carefully, is abuse.  The shepherd&#39;s rod was used to gently guide the <br/>\n&gt; sheep, but, in certain circumstances when a sheep would continue to do <br/>\n&gt; something which endangered it, it was also used to strike the sheep. I was <br/>\n&gt; taught that spanking is the same, not to be used for every little offense <br/>\n&gt; (that&#39;s where guidance, related consequences, or sometimes even rewards <br/>\n&gt; for the opposite behavior come into play) but reserved for serious <br/>\n&gt; problems, as a child who continually goes out into the street (or plays <br/>\n&gt; with fire, etc.) regardless of all correction methods tried.  At that <br/>\n&gt; point, an appropriately done spanking (on the fatty tissue of the buttocks <br/>\n&gt; and by an emotionally-controlled parent, no anger) gives a reminder to the <br/>\n&gt; child that stings but does not injure, which is highly preferable to a <br/>\n&gt; dead child.  Usually once does the trick; I&#39;ve never met or heard about a <br/>\n&gt; &quot;normal&quot; child who required more than twice to correct a<br/>\n&gt; situation like this--and you don&#39;t use corporal punishment at all with a <br/>\n&gt; mentally handicapped child, or one who has been previously abused.<br/>\n&gt;<br/>\n&gt;  However, I think forcing that poor child to do two pages of math is <br/>\n&gt; probably pushing the limit.  Even when we were completely school-at-home, <br/>\n&gt; my son would have had an emotional breakdown if I&#39;d expected that of him <br/>\n&gt; (and he LIKES math). There&#39;s another verse in the Bible that talks about <br/>\n&gt; training up a child in the way he/she should go, literally meaning <br/>\n&gt; according to his/her bent (the way God made the child--personality, <br/>\n&gt; talents, etc.).  If this mother was truly paying attention to how her son <br/>\n&gt; is wired, she would be looking for other ways to help him learn.<br/>\n&gt;<br/>\n&gt;  Just my two cents worth,<br/>\n&gt;  Yolonda Hicks<br/>\n&gt;<br/>\n&gt; ---------------------------------<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ---------------------------------<br/>\n&gt; Yahoo! Shopping<br/>\n&gt; Find Great Deals on Holiday Gifts at Yahoo! Shopping<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":222095129,"authorName":"Yolonda Hicks","from":"Yolonda Hicks &lt;books_music_birds@...&gt;","profile":"books_music_birds","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134155098","msgId":8122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjA5MTkwNDU4LjU0NDM1LnFtYWlsQHdlYjYxMjEzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFlMi40OWY0YjVjNy4zMGNhZmY0ZUBhb2wuY29tPg=="},"prevInTopic":8121,"nextInTopic":8123,"prevInTime":8121,"nextInTime":8123,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"As a Christian who reads and tries to live by the Bible as a whole, I have to both agree and disagree with both sides of this argument.  The Bible, even in the","messageBody":"<div id=\"ygrps-yiv-260413881\">As a Christian who reads and tries to live by the Bible as a whole, I have to both agree and disagree with both sides of this argument.  The Bible, even in the New Testament (which the original post referred to but did not quote), does require obedience from children but also places requirements on the parents. (The verses I&#39;m quoting below are from the NIrV--translation written to about a &quot;3rd-grade&quot; level--as my daughter&#39;s Bible was the one close at hand.)  <br/>\n   <br/>\n  Ephesians 6:1-2 states, &quot;Children, obey your parents as believers in the Lord.  Obey them because it&#39;s the right thing to do.  Scripture says, &#39;Honor your father and mother.&#39;  That is the first commandment that has a promise.&quot;  However, verse 4 says, &quot;Fathers [and mothers], don&#39;t make your children angry.  Instead, train them and teach them the ways of the Lords as you raise them.&quot; <br/>\n   <br/>\n  Colossians 3:20 states, &quot;Children, obey your parents in everything.  That pleases the Lord.&quot;  It is immediately followed, though, by verse 21 stating, &quot;Fathers [and mothers], don&#39;t make your children bitter.  If you do, they will lose hope.&quot;<br/>\n<br/>\n  For those of us who believe the Bible, we are told that children need to obey, but we are also told that we have the responsibility to make the right rules/commands.  God&#39;s rules for us are to protect us and for our good, so our rules should be for our children (not because it makes our lives easier or we just like things that way).  My children are not &quot;perfect models of obedience&quot;, even to good rules, but the fact that they have been trained in the importance of obedience has literally saved my son&#39;s life twice.<br/>\n   <br/>\n  I also do not believe that corporal punishment, when used wisely and carefully, is abuse.  The shepherd&#39;s rod was used to gently guide the sheep, but, in certain circumstances when a sheep would continue to do something which endangered it, it was also used to strike the sheep. I was taught that spanking is the same, not to be used for every little offense (that&#39;s where guidance, related consequences, or sometimes even rewards for the opposite behavior come into play) but reserved for serious problems, as a child who continually goes out into the street (or plays with fire, etc.) regardless of all correction methods tried.  At that point, an appropriately done spanking (on the fatty tissue of the buttocks and by an emotionally-controlled parent, no anger) gives a reminder to the child that stings but does not injure, which is highly preferable to a dead child.  Usually once does the trick; I&#39;ve never met or heard about a &quot;normal&quot; child who required more than twice to correct a<br/>\n situation like this--and you don&#39;t use corporal punishment at all with a mentally handicapped child, or one who has been previously abused.<br/>\n   <br/>\n  However, I think forcing that poor child to do two pages of math is probably pushing the limit.  Even when we were completely school-at-home, my son would have had an emotional breakdown if I&#39;d expected that of him (and he LIKES math). There&#39;s another verse in the Bible that talks about training up a child in the way he/she should go, literally meaning according to his/her bent (the way God made the child--personality, talents, etc.).  If this mother was truly paying attention to how her son is wired, she would be looking for other ways to help him learn.<br/>\n   <br/>\n  Just my two cents worth,<br/>\n  Yolonda Hicks<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n\t\t\t<br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\n Find Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134142798","msgId":8121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMi40OWY0YjVjNy4zMGNhZmY0ZUBhb2wuY29tPg=="},"prevInTopic":8120,"nextInTopic":8122,"prevInTime":8120,"nextInTime":8122,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"I wonder if these people ever bother to read the NEW Testament....you know, where Jesus teaches unconditional love? Leslie in SC [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-164370958\">I wonder if these people ever bother to read the NEW Testament....you know,  <br/>\nwhere Jesus teaches unconditional love?<br/>\n <br/>\nLeslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1224177,"authorName":"Saulithyia@aol.com","from":"Saulithyia@...","profile":"saulithyia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134141983","msgId":8119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMi4zNDZlYmYyLjMwY2FmYzFmQGFvbC5jb20+"},"prevInTopic":8118,"nextInTopic":8120,"prevInTime":8118,"nextInTime":8120,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/9/2005 7:45:46 AM Eastern Standard Time, motherspirit@bellsouth.net writes: I was  reading an online newsletter from Sonlight and found","messageBody":"<div id=\"ygrps-yiv-336910809\">In a message dated 12/9/2005 7:45:46 AM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motherspirit@...\">motherspirit@...</a> writes:<br/>\n<br/>\nI was  reading an online newsletter from Sonlight and found the following <br/>\nanswer and  question.  Now that I am unschooling, this is wild to  me.<br/>\n<br/>\n<br/>\n<br/>\n~~~~~~~~~~<br/>\nOMG, that is just AWFUL! Poor kiddos... I can&#39;t IMAGINE doing that to my  <br/>\nchildren. Not at all... and then to advise someone to beat their child?? I&#39;m not  <br/>\nreligious, nor was I raised that way, so I am not extremely familiar withe <br/>\nthe  Bible, but, I highly doubt &quot;God&quot; intended for parents to abuse their kids <br/>\nto  force them into compliance. If that&#39;s the case, that&#39;s not a god I&#39;d want <br/>\nto be  worshipping. I think some people take symbolism too literally, and take <br/>\nthings  out of context.      <br/>\n<br/>\nJenny<br/>\nUnschooling in Greenfield, MA<br/>\nDanny (12-1-99), Kelsey  (11-1-01) and Evelyn  (5-19-04)<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~<br/>\nThe  important thing is not so much that every child should be taught, as <br/>\nthat every  child should be given the wish to learn.  ~John  Lubbock<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] What do you think?","postDate":"1134140320","msgId":8120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDUxMjA5MTQxNTI2Ljk3ODY4LnFtYWlsQHdlYjUzNDE1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":8119,"nextInTopic":8121,"prevInTime":8119,"nextInTime":8121,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2116597024\">&lt;&lt;&lt;&lt;POST: How do you handle attitude with schoolwork? My 7-year-old son<br/>\ngives me such grief every day over schoolwork. Every day it is the same<br/>\nnonsense. Can we (play, watch tv, go outside . . .)? &quot;Not until you&#39;ve done<br/>\nyour schoolwork.&quot; Eyes roll, shoulders slouch, big sigh and groan!&gt;&gt;&gt;&gt;<br/>\n<br/>\nI think it is a shame that this mother is not posting this question to an<br/>\nUnschooling list where she actually might receive the kind of compassionate<br/>\nsuggestions that would enable her to enjoy being a parent again, since that<br/>\nis her wish. <br/>\n<br/>\nThe replier is in a sense hijacking a question about education and turning<br/>\nit into a polemic about Obedience. The suggestion, of beating the spirit out<br/>\nof her son, could so easily backfire to result in a rebellious person -<br/>\ncertainly not someone who would enjoy learning.<br/>\n<br/>\nThis poor kid is only one year older than Jayn. There are moments when I<br/>\nthink I would like obedience - how simple it would be for me if all I had to<br/>\nsay was &quot;sit&quot; and Jayn would immediately stop jumping and dancing - except<br/>\nthat in a world where I had that kind of fear based power over her, why<br/>\nwould she want to dance?<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.371 / Virus Database: 267.13.13/195 - Release Date: 12/8/2005</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What do you think?","postDate":"1134139776","msgId":8118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRuYzVpMCtnaTQ3QGVHcm91cHMuY29tPg=="},"prevInTopic":8117,"nextInTopic":8119,"prevInTime":8117,"nextInTime":8119,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"We had a huge discussion this weekend about how he was going to miss out on things because he was getting extra chores until he learned to do things right the","messageBody":"<div id=\"ygrps-yiv-463407857\">&quot;We had a<br/>\nhuge discussion this weekend about how he was going to miss out on <br/>\nthings<br/>\nbecause he was getting extra chores until he learned to do things <br/>\nright the<br/>\nfirst time.&quot;<br/>\n<br/>\nAnd they&#39;ll wonder why he hates them when he&#39;s a teen, or why he wants <br/>\nto run away. duh.<br/>\n<br/>\nIt&#39;s child abuse on every level and it&#39;s sick.<br/>\n<br/>\nI wonder if that Mom would be glad she focused on forcing her child to <br/>\nobey instantly, causing much stress every day of their lives, if she <br/>\nlost that child today. What a horrible way to live.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":163468813,"authorName":"patricia tidmore","from":"patricia tidmore &lt;ptidmore1117@...&gt;","profile":"ptidmore1117","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134138199","msgId":8117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjA5MTQyMzE5LjQyNjIxLnFtYWlsQHdlYjUyMzE1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwNDIwMWM1ZmNiZiQ3MWM2NDcyMCQ2YTAwYThjMEBjb21wdXRlcj4="},"prevInTopic":8116,"nextInTopic":8118,"prevInTime":8116,"nextInTime":8118,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"This is so sad.This poor baby! Tricia Mother Earth (Tyra)  wrote: Mabel I was reading an online newsletter from Sonlight and","messageBody":"<div id=\"ygrps-yiv-691801035\">This is so sad.This poor baby!<br/>\n  Tricia<br/>\n<br/>\n&quot;Mother Earth (Tyra)&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motherspirit@...\">motherspirit@...</a>&gt; wrote: <br/>\n  Mabel<br/>\n<br/>\nI was reading an online newsletter from Sonlight and found the following answer and question.  Now that I am unschooling, this is wild to me.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\n<br/>\nBad Attitudes<br/>\n<br/>\nPOST: How do you handle attitude with schoolwork? My 7-year-old son gives me such grief every day over schoolwork. Every day it is the same nonsense. Can we (play, watch tv, go outside . . .)? &quot;Not until you&#39;ve done your schoolwork.&quot; Eyes roll, shoulders slouch, big sigh and groan!<br/>\n<br/>\nSo when he actually gets his books out and starts something, he tries to do the bare minimum. If I say two pages of math, he forgets and does one! Then the &quot;I can&#39;t find my _____ book&quot; starts! Now we have a schoolroom, and they each have a specific section on the shelves in the closet to use for their books. He is so lazy about picking his stuff up and putting it away where it belongs. We had a huge discussion this weekend about how he was going to miss out on things because he was getting extra chores until he learned to do things right the first time.<br/>\n<br/>\nBack to schoolwork, though: every time I correct a page and realize he didn&#39;t understand the problem and ask him how to do it correctly, the tears and drama start. I don&#39;t understand it! He does very well when he wants to. He is good at math and typically gets the concepts easily. His problem comes when he rushes through and doesn&#39;t take the time to read the directions. I am so frustrated with the same things everyday. It seems to be more of an attitude problem than actually not understanding though. If he truly didn&#39;t get the concept I could understand but he is frustrated because he thought he was done and now I am going to ask him to correct the ones he missed.<br/>\n<br/>\nMy husband is complaining that all I do is fuss at them nonstop but nothing I am saying or doing seems to make a change in their behaviors. I feel like the meanest mom in the world some days, but I know they should be able to do the simplest things like pick up after themselves and follow my directions without such disagreement. I am feeling like I am drowning underneath it all and not enjoying my family the way God intended me to. Anyone have any advice?????<br/>\n<br/>\n--beattiebunchnh<br/>\n<br/>\nPOST: I am convinced that the very most important and basic &quot;lesson&quot; our children must learn is obedience. Why? Because God requires that we obey Him. Time after time, our children will have to decide whether they&#39;re going to obey God or not. If they learn and practice &quot;half-obedience&quot; (delayed obedience or obedience with attitude) to mom and dad, are they not learning how to &quot;half obey&quot;? Aren&#39;t they learning to obey God that way? Do we want them to reason, &quot;It&#39;s ok for me to do this. I&#39;ll obey God eventually&quot;?!)<br/>\n<br/>\n1--Start with extremely clear expectations/rules. Be sure every child knows exactly what is expected. Don&#39;t make a list a mile long. You could even start with simply one rule: Obey mom and dad immediately, completely, every time, with a good attitude. Decide beforehand what the consequences will be for NOT obeying. Explain this clearly to them beforehand. &quot;If you CHOOSE to disobey, this will be the consequence YOU ARE CHOOSING.&quot; (Personally, I believe the &quot;rod&quot; is to be used most of the time. Do you know how often this is mentioned in Scripture?!?!) Whatever the consequence, make it something the child really wants to avoid. Note: &quot;Childishness&quot; is not the same as &quot;disobedience.&quot; Don&#39;t punish childishness. It is exasperating to a parent, but it requires training.<br/>\n<br/>\n2--Calmly and quietly, in love, &quot;reprove&quot; a child when he disobeys. Remind him of what God says. God says in the Word that children must obey their parents. It is sin not to obey. This is to obey God, too. (You want him to learn to obey God!) There is no other choice to be made. God knows what is best for him. Tell him you want him to learn to obey you so he will choose to obey God later. You are sorry he&#39;s chosen to disobey and now must bear the consequences. It is his choice. (You needn&#39;t fuss over and over at him or get mad. You explained everything ahead of time and he knew the plan.) [Ex. 20:12, Eph. 6:1, Col. 3:20] &quot;Do all things without complaining or arguing.&quot; All children and parents should memorize this command!<br/>\n<br/>\n3--Lead your child to confess his sin to God. Pray with him. Lead him to ask forgiveness of you as well as of God. (This is very hard for adults to do even, but it melts hearts in repentance.)<br/>\n<br/>\n4--Calmly carry out the consequence. Remember, the Bible says that no discipline is pleasant at the time, but it has sweet rewards. Prov. 19:18 says &quot;Discipline your son while there is hope, and do not desire his death.&quot; Prov. 13:24 says, &quot;He who spares the rod hates his son, but he who loves him disciplines him diligently.&quot; Prov. 22:15 says, &quot;Foolishness is bound up in the heart of a child; the rod of discipline will remove it far from him.&quot; Read Prov. 29:15, 17. Prov. 23:13-14, says &quot;Do not withhold discipline from a child; if you punish him with the rod, he will not die. Punish him with the rod and save his soul from death.&quot;<br/>\n<br/>\n5--Love, hug, and forgive your child completely.<br/>\n<br/>\nRepeat every time the child disobeys! Teach him that obedience is of utmost importance!<br/>\n<br/>\n--Jannyruth <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Secondary school education   Graduate school education   Home school education     Graduate school education online   High school education   Chicago school education <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n&quot;I am learning al the time,the tombstone will be my diploma&quot;-Eartha Kitt<br/>\n<br/>\nDo not follow where the path may lead.Go instead where there is no path and leave a trail...<br/>\n\t\t\t<br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\n Find Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143188961,"authorName":"Ann","from":"Ann &lt;ann_mv05@...&gt;","profile":"ann_mv05","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What do you think?","postDate":"1134137725","msgId":8116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjA5MTQxNTI2Ljk3ODY4LnFtYWlsQHdlYjUzNDE1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwNDIwMWM1ZmNiZiQ3MWM2NDcyMCQ2YTAwYThjMEBjb21wdXRlcj4="},"prevInTopic":8115,"nextInTopic":8117,"prevInTime":8115,"nextInTime":8117,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"This is horrifying! .... So ignorant too.  Shepard s don t use their rod to beat the sheep, they use it to gently guide the sheep.  So his advice is based on a","messageBody":"<div id=\"ygrps-yiv-188288708\">This is horrifying! .... So ignorant too.  Shepard&#39;s don&#39;t use their rod to beat the sheep, they use it to gently guide the sheep.  So his advice is based on a biblical interpretation that a rod is used for beating!  This poor little guy just wants to play and would learn beautifully by playing.  The only concept he is learning is to hate all the subject matter she is cramming down his throat.  <br/>\n  I can tell I just don&#39;t know people like this because I am too shocked.<br/>\n   <br/>\n  I am Christian ( a part of what would be a liberal segment of Christianity admittedly), but I know of no parent that would actually take that advice.  The ones I know would be frantically trying other curriculum&#39;s or move to &#39;unit studies&#39; or other such stuff, but they wouldn&#39;t resort to hitting their kids.  In fact I get quite a few questions that start like How do you unschool, or what do you mean by unchooling?  Most some interested, some even receptive.  <br/>\n   <br/>\n  Ann<br/>\n<br/>\n&quot;Mother Earth (Tyra)&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motherspirit@...\">motherspirit@...</a>&gt; wrote:<br/>\n  Mabel<br/>\n<br/>\nI was reading an online newsletter from Sonlight and found the following answer and question.  Now that I am unschooling, this is wild to me.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\n<br/>\nBad Attitudes<br/>\n<br/>\nPOST: How do you handle attitude with schoolwork? My 7-year-old son gives me such grief every day over schoolwork. Every day it is the same nonsense. Can we (play, watch tv, go outside . . .)? &quot;Not until you&#39;ve done your schoolwork.&quot; Eyes roll, shoulders slouch, big sigh and groan!<br/>\n<br/>\nSo when he actually gets his books out and starts something, he tries to do the bare minimum. If I say two pages of math, he forgets and does one! Then the &quot;I can&#39;t find my _____ book&quot; starts! Now we have a schoolroom, and they each have a specific section on the shelves in the closet to use for their books. He is so lazy about picking his stuff up and putting it away where it belongs. We had a huge discussion this weekend about how he was going to miss out on things because he was getting extra chores until he learned to do things right the first time.<br/>\n<br/>\nBack to schoolwork, though: every time I correct a page and realize he didn&#39;t understand the problem and ask him how to do it correctly, the tears and drama start. I don&#39;t understand it! He does very well when he wants to. He is good at math and typically gets the concepts easily. His problem comes when he rushes through and doesn&#39;t take the time to read the directions. I am so frustrated with the same things everyday. It seems to be more of an attitude problem than actually not understanding though. If he truly didn&#39;t get the concept I could understand but he is frustrated because he thought he was done and now I am going to ask him to correct the ones he missed.<br/>\n<br/>\nMy husband is complaining that all I do is fuss at them nonstop but nothing I am saying or doing seems to make a change in their behaviors. I feel like the meanest mom in the world some days, but I know they should be able to do the simplest things like pick up after themselves and follow my directions without such disagreement. I am feeling like I am drowning underneath it all and not enjoying my family the way God intended me to. Anyone have any advice?????<br/>\n<br/>\n--beattiebunchnh<br/>\n<br/>\nPOST: I am convinced that the very most important and basic &quot;lesson&quot; our children must learn is obedience. Why? Because God requires that we obey Him. Time after time, our children will have to decide whether they&#39;re going to obey God or not. If they learn and practice &quot;half-obedience&quot; (delayed obedience or obedience with attitude) to mom and dad, are they not learning how to &quot;half obey&quot;? Aren&#39;t they learning to obey God that way? Do we want them to reason, &quot;It&#39;s ok for me to do this. I&#39;ll obey God eventually&quot;?!)<br/>\n<br/>\n1--Start with extremely clear expectations/rules. Be sure every child knows exactly what is expected. Don&#39;t make a list a mile long. You could even start with simply one rule: Obey mom and dad immediately, completely, every time, with a good attitude. Decide beforehand what the consequences will be for NOT obeying. Explain this clearly to them beforehand. &quot;If you CHOOSE to disobey, this will be the consequence YOU ARE CHOOSING.&quot; (Personally, I believe the &quot;rod&quot; is to be used most of the time. Do you know how often this is mentioned in Scripture?!?!) Whatever the consequence, make it something the child really wants to avoid. Note: &quot;Childishness&quot; is not the same as &quot;disobedience.&quot; Don&#39;t punish childishness. It is exasperating to a parent, but it requires training.<br/>\n<br/>\n2--Calmly and quietly, in love, &quot;reprove&quot; a child when he disobeys. Remind him of what God says. God says in the Word that children must obey their parents. It is sin not to obey. This is to obey God, too. (You want him to learn to obey God!) There is no other choice to be made. God knows what is best for him. Tell him you want him to learn to obey you so he will choose to obey God later. You are sorry he&#39;s chosen to disobey and now must bear the consequences. It is his choice. (You needn&#39;t fuss over and over at him or get mad. You explained everything ahead of time and he knew the plan.) [Ex. 20:12, Eph. 6:1, Col. 3:20] &quot;Do all things without complaining or arguing.&quot; All children and parents should memorize this command!<br/>\n<br/>\n3--Lead your child to confess his sin to God. Pray with him. Lead him to ask forgiveness of you as well as of God. (This is very hard for adults to do even, but it melts hearts in repentance.)<br/>\n<br/>\n4--Calmly carry out the consequence. Remember, the Bible says that no discipline is pleasant at the time, but it has sweet rewards. Prov. 19:18 says &quot;Discipline your son while there is hope, and do not desire his death.&quot; Prov. 13:24 says, &quot;He who spares the rod hates his son, but he who loves him disciplines him diligently.&quot; Prov. 22:15 says, &quot;Foolishness is bound up in the heart of a child; the rod of discipline will remove it far from him.&quot; Read Prov. 29:15, 17. Prov. 23:13-14, says &quot;Do not withhold discipline from a child; if you punish him with the rod, he will not die. Punish him with the rod and save his soul from death.&quot;<br/>\n<br/>\n5--Love, hug, and forgive your child completely.<br/>\n<br/>\nRepeat every time the child disobeys! Teach him that obedience is of utmost importance!<br/>\n<br/>\n--Jannyruth <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Secondary school education   Graduate school education   Home school education     Graduate school education online   High school education   Chicago school education <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n\t\t\t<br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\n Find Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"RE: [unschoolingbasics] What do you think?","postDate":"1134134834","msgId":8115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGUwMWM1ZmNjNCQ0NGNlY2JjMCQ2OTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PDAwNDIwMWM1ZmNiZiQ3MWM2NDcyMCQ2YTAwYThjMEBjb21wdXRlcj4="},"prevInTopic":8114,"nextInTopic":8116,"prevInTime":8114,"nextInTime":8116,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Gag!  And the sad thing is that people read that and respond accordingly. ... Angela game-enthusiast@adelphia.net","messageBody":"<div id=\"ygrps-yiv-766708563\">Gag!  And the sad thing is that people read that and respond accordingly.  <br/>\n:(<br/>\n<br/>\nAngela<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a></div>","specialLinks":[]},{"userId":183015595,"authorName":"Mother Earth (Tyra)","from":"&quot;Mother Earth &#92;(Tyra&#92;)&quot; &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What do you think?","postDate":"1134132760","msgId":8114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDIwMWM1ZmNiZiQ3MWM2NDcyMCQ2YTAwYThjMEBjb21wdXRlcj4="},"prevInTopic":0,"nextInTopic":8115,"prevInTime":8113,"nextInTime":8115,"topicId":8114,"numMessagesInTopic":0,"msgSnippet":"Mabel I was reading an online newsletter from Sonlight and found the following answer and question.  Now that I am unschooling, this is wild to me. Peace Tyra ","messageBody":"<div id=\"ygrps-yiv-1494996435\">Mabel<br/>\n<br/>\nI was reading an online newsletter from Sonlight and found the following answer and question.  Now that I am unschooling, this is wild to me.<br/>\n<br/>\nPeace<br/>\nTyra<br/>\n<br/>\nBad Attitudes<br/>\n<br/>\nPOST: How do you handle attitude with schoolwork? My 7-year-old son gives me such grief every day over schoolwork. Every day it is the same nonsense. Can we (play, watch tv, go outside . . .)? &quot;Not until you&#39;ve done your schoolwork.&quot; Eyes roll, shoulders slouch, big sigh and groan!<br/>\n<br/>\nSo when he actually gets his books out and starts something, he tries to do the bare minimum. If I say two pages of math, he forgets and does one! Then the &quot;I can&#39;t find my _____ book&quot; starts! Now we have a schoolroom, and they each have a specific section on the shelves in the closet to use for their books. He is so lazy about picking his stuff up and putting it away where it belongs. We had a huge discussion this weekend about how he was going to miss out on things because he was getting extra chores until he learned to do things right the first time.<br/>\n<br/>\nBack to schoolwork, though: every time I correct a page and realize he didn&#39;t understand the problem and ask him how to do it correctly, the tears and drama start. I don&#39;t understand it! He does very well when he wants to. He is good at math and typically gets the concepts easily. His problem comes when he rushes through and doesn&#39;t take the time to read the directions. I am so frustrated with the same things everyday. It seems to be more of an attitude problem than actually not understanding though. If he truly didn&#39;t get the concept I could understand but he is frustrated because he thought he was done and now I am going to ask him to correct the ones he missed.<br/>\n<br/>\nMy husband is complaining that all I do is fuss at them nonstop but nothing I am saying or doing seems to make a change in their behaviors. I feel like the meanest mom in the world some days, but I know they should be able to do the simplest things like pick up after themselves and follow my directions without such disagreement. I am feeling like I am drowning underneath it all and not enjoying my family the way God intended me to. Anyone have any advice?????<br/>\n<br/>\n--beattiebunchnh<br/>\n<br/>\nPOST: I am convinced that the very most important and basic &quot;lesson&quot; our children must learn is obedience. Why? Because God requires that we obey Him. Time after time, our children will have to decide whether they&#39;re going to obey God or not. If they learn and practice &quot;half-obedience&quot; (delayed obedience or obedience with attitude) to mom and dad, are they not learning how to &quot;half obey&quot;? Aren&#39;t they learning to obey God that way? Do we want them to reason, &quot;It&#39;s ok for me to do this. I&#39;ll obey God eventually&quot;?!)<br/>\n<br/>\n1--Start with extremely clear expectations/rules. Be sure every child knows exactly what is expected. Don&#39;t make a list a mile long. You could even start with simply one rule: Obey mom and dad immediately, completely, every time, with a good attitude. Decide beforehand what the consequences will be for NOT obeying. Explain this clearly to them beforehand. &quot;If you CHOOSE to disobey, this will be the consequence YOU ARE CHOOSING.&quot; (Personally, I believe the &quot;rod&quot; is to be used most of the time. Do you know how often this is mentioned in Scripture?!?!) Whatever the consequence, make it something the child really wants to avoid. Note: &quot;Childishness&quot; is not the same as &quot;disobedience.&quot; Don&#39;t punish childishness. It is exasperating to a parent, but it requires training.<br/>\n<br/>\n2--Calmly and quietly, in love, &quot;reprove&quot; a child when he disobeys. Remind him of what God says. God says in the Word that children must obey their parents. It is sin not to obey. This is to obey God, too. (You want him to learn to obey God!) There is no other choice to be made. God knows what is best for him. Tell him you want him to learn to obey you so he will choose to obey God later. You are sorry he&#39;s chosen to disobey and now must bear the consequences. It is his choice. (You needn&#39;t fuss over and over at him or get mad. You explained everything ahead of time and he knew the plan.) [Ex. 20:12, Eph. 6:1, Col. 3:20] &quot;Do all things without complaining or arguing.&quot; All children and parents should memorize this command!<br/>\n<br/>\n3--Lead your child to confess his sin to God. Pray with him. Lead him to ask forgiveness of you as well as of God. (This is very hard for adults to do even, but it melts hearts in repentance.)<br/>\n<br/>\n4--Calmly carry out the consequence. Remember, the Bible says that no discipline is pleasant at the time, but it has sweet rewards. Prov. 19:18 says &quot;Discipline your son while there is hope, and do not desire his death.&quot; Prov. 13:24 says, &quot;He who spares the rod hates his son, but he who loves him disciplines him diligently.&quot; Prov. 22:15 says, &quot;Foolishness is bound up in the heart of a child; the rod of discipline will remove it far from him.&quot; Read Prov. 29:15, 17. Prov. 23:13-14, says &quot;Do not withhold discipline from a child; if you punish him with the rod, he will not die. Punish him with the rod and save his soul from death.&quot;<br/>\n<br/>\n5--Love, hug, and forgive your child completely.<br/>\n<br/>\nRepeat every time the child disobeys! Teach him that obedience is of utmost importance!<br/>\n<br/>\n--Jannyruth <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":8229,"nextTopicId":8150}}