{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":64267811,"authorName":"Latha Poonamallee","from":"Latha Poonamallee &lt;pclatha@...&gt;","profile":"pclatha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Kiddie classes etc.","postDate":"1239322218","msgId":39420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NDA3My43ODY4OS5xbUB3ZWI4MzAwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg=="},"prevInTopic":39406,"nextInTopic":0,"prevInTime":39419,"nextInTime":39421,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"I live in a college town and there are a lot of opportunities/resources at very reasonable costs that I can afford easily. The way I look at classes is more","messageBody":"<div id=\"ygrps-yiv-275718007\">I live in a college town and there are a lot of opportunities/resources at very reasonable costs that I can afford easily. The way I look at classes is more like offering a monkey platter. Whether ds (almost 7) wants to take something or continue is completely upto him. For example, he got a birthday present of 3 horseback riding lessons in a local farm for his last birthday from a homeschooling family with three kids. He was very excited about the prospect of learning to ride a horse with his friends but he didn&#39;t really enjoy it very much the first time but wanted to try it a second time. He tried it and felt better about it and completed his third session because his friends were going but it is not something he was super excited about. <br/>\n <br/>\nGiven his personality, he enjoys one on one sessions with instructors he can connect well in stuff that interests him. A year and half ago he started to take guitar lessons (he wanted to) with a teacher. He is great friends with his teacher who shares his passion for Star Wars. His teacher is also a locally well known artist and so my son wanted to work with him on art and so began to take art lessons with him. But once he started to take art lessons, he stopped focusing as much on his guitar. A couple of months ago I asked him if he was still interested in continuing his guitar lessons and offered him the option to quit if he didn&#39;t feel like it. He said that he wanted to take the lessons because he enjoyed it but he didn&#39;t want to practice at home. Sometimes, he would spend the entire hour and half doing an art or sculpture project rather than play the guitar. Sometimes, he plays his teacher&#39;s mandolin instead of his guitar or brings some Indian<br/>\n music to share with his teacher. I am totally ok with it because I think this whole lesson thing is a social activity for him because he enjoys his teacher&#39;s company. We have had his teacher and teacher&#39;s girlfriend for dinner and starwars etc.  <br/>\n <br/>\nBut he does not like any real &#39;in class&#39; instruction type of thing. For instance, swimming. I don&#39;t swim (at all) and so I wanted him to have the opportunity to learn it young. So I put him in a summer swim program when he was four which consisted of basically taking him to the pool every class and sitting with him on the sideline. But he always enjoyed getting into the pool with me when we were at a hotel or something. I let that go and put him back in a class when he was 5. This was at my university pool (olympic size college town culture where everybody and their cousin came to the class at the same time). He refused to get into the pool again. He said that it was too big, too noisy and too crowded and he got too cold. I let that term go and found an alternate time which was not crowded, got him a wet suit to keep him warm etc. He learnt some basic skills but at that time, I discovered that another university in the area offered a weekly open swim<br/>\n session for homeschooling families and we began to go to that, where he swims/plays with homeschooled kids of different ages and absolutely, absolutely enjoys is. He stopped taking lessons but is swimming better than ever!  <br/>\n <br/>\nThe one exception is tennis, partly because it gives him an opportunity to run around having fun. The tennis program he is in is totally non-competitive but more focused on developing on court skills through drills and games. We have taken cross-country skiing classes together but once we learnt a few basic skills I find that he enjoys skiing with me more than advancing his skills or competitive skiing with other kids of his age/ability. <br/>\n <br/>\nLatha<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 4/8/09, Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt;<br/>\nSubject: [unschoolingbasics] kinda new here<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, April 8, 2009, 11:54 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nhey all!<br/>\nI&#39;m Agnieszka, Polish-Canadian mama of 2 (and ttc #3 as now this month!!!). Our girls are 4 and 2.5. We AP, co-sleep, nursed as long as I could, and unschool and are totally rad in all different respects! :-p<br/>\n<br/>\nMy girls have taken a couple of classes of things they life, just to try them out. Kalina (4) has taken &quot;dance&quot; (it wasn&#39;t really any particular dance... just kind of playing around) because she loves dance, and they are both in swim classes because they appear so terrified of water when they are with me... <br/>\n<br/>\nI am really unsure about classes in general because they call seem to include that authority figure type who more often than not has the I&#39;m-the-boss attitude... <br/>\n<br/>\nSo, this is one of my questions: what are your approaches to putting your kiddies in classes??? <br/>\n<br/>\nThe other, ever present question on my mind is this: how much children&#39;s tv shows is TOO much??? I know that this is a huge thing, so all I want to ask you, if you feel comfortable sharing either on the forum or privately, to please share with me your personal approach to it????<br/>\n<br/>\nHere is what I do: the girls have their favourite dvds (and we dont&#39; have a tv player, so dvds are all they get) and they watch about 1.5 hours per morning, on average. Morning has become our &quot;show-time&quot;, and when guilt leaves me alone, I enjoy that time and use it for this, for example, or for paying bills or making phone calls...<br/>\n<br/>\nAnd this final point leads me to another question: when do you find YOU-time?? And I don&#39;t mean time for extra lovely things like baths... I mean time for simpler but equally important things like showers, or journaling, or yoga... I&#39;m not sure what I&#39;m doing wrong but my time always ends up crowded out with the girls&#39; needs... <br/>\n<br/>\nAnyway, I&#39;d love to hear your thoughts!!!<br/>\n<br/>\nAgnieszka<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] kinda new here","postDate":"1239287657","msgId":39406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMjcyOC43MjgwMi5xbUB3ZWI4NjIxMC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39405,"nextInTopic":39420,"prevInTime":39405,"nextInTime":39407,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"... Simon and Linnaea have gone to a few different classes, karate and kung fu and horse riding among them. They ve enjoyed them for a bit and then decided","messageBody":"<div id=\"ygrps-yiv-1760541156\">________________________________<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt;<br/>\n<br/>\n&gt; So, this is one of my questions: what are your approaches to putting your kiddies in classes???  <br/>\n </span></blockquote>----------------<br/>\nSimon and Linnaea have gone to a few different classes, karate and kung fu and horse riding among them. They&#39;ve enjoyed them for a bit and then decided they didn&#39;t want to go. Simon is less comfortable with a classroom structure than Linnaea and is less likely to want to do classes. I am relatively indifferent to classes in general, in specific I may rave about one and rant about another. If there is something that Simon or Linnaea want to learn that a class may facilitate in a way that would be less easy to achieve in other ways, and they want to go that route than I am perfectly happy with a class. They can quit when they want and they can rejoin if they want to later. <br/>\n<br/>\nYou asked though about &quot;putting your kiddies in classes&quot;. I have never put my kiddies in classes, I have suggested or mentioned something that they might like and they&#39;ve signed up through me. They volunteered their time and attention, not the other way around. <br/>\n-----------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The other, ever present question on my mind is this: how much children&#39;s tv shows is TOO much???  I know that this is a huge thing, so all I want to ask you, if you feel comfortable &gt; sharing either on the forum or privately, to please share with me your personal approach to it????<br/>\n </span></blockquote>---------------<br/>\n<br/>\nThey&#39;ve never gotten to too much or too little. They turn it on and turn it off as they choose. I don&#39;t think I&#39;ve set a television limit since Simon was 4. Simon and Linnaea have watched different amounts of television from one day to the next, from one week to the next, from one year to the next. It depends on the day. Simon got up early today and has watched a couple of television shows. One some strange looking British sitcom from the 80&#39;s with the best flocked wallpaper in the background and a woman wearing strands of pearls and matching earings and permed hair (just looked, it&#39;s Just Good Friends). He&#39;s got a cold and is feeling a bit low today. He&#39;s chatting with David and playing with the cat and just asked me to look up Carry on Henry on youtube. Watching television isn&#39;t an isolated activity, It isn&#39;t something he&#39;s doing on his own without any relationship with the rest of the family or the rest of the world. <br/>\n<br/>\nWhen he was younger, more in the range of your children&#39;s ages, he and I would snuggle up and watch Teletubbies and Blues Clues and Bear in the Big Blue House (his favorite) and Arthur and we&#39;d play and chat and giggle and dance and BE together in those moments. When we lived in Japan we&#39;d watch Ampanman and Pokemon and all these other strange shows with puppets or super heroes that were so completely alien from the children&#39;s shows I&#39;d seen. Linnaea was an infant then and would bounce on my lap or nurse or struggle with rolling on the mattress we had on the floor and Simon and I would watch and play and talk. And he&#39;d make up games for us to play based on the shows he&#39;d watched. He would fight and catch pokemon, he would rescue animals, he would fly all over the house in the cape I made from a window covering that had been left in the apartment by the previous tenant. Television was a part of a day of connecting with each other and telling stories and<br/>\n playing, sometimes it was background noise, sometimes it was the pivot around which all else turned. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Here is what I do: the girls have their favourite dvds (and we dont&#39; have a tv player, so dvds are all they get) and they watch about 1.5 hours per morning, on average.  Morning has become &gt; our &quot;show-time&quot;, and when guilt leaves me alone, I enjoy that time and use it for this, for example, or for paying bills or making phone calls...<br/>\n<br/>\n </span></blockquote>Make the time be less about you getting time alone and more about you all hanging out together. I would also recommend that you don&#39;t make television a ritual thing that occurs at a specific time of day and no other. Let it be a part of your day together. And move on from the dvds into the rest of the televised world if you can. By setting it aside you are changing its value to something special, something that is a treat. Television is a thing, more like a library than book, but it is a tool for exploring the world in a similar way to books. Simon and I snuggled up on the couch yesterday while Linnaea was still sleeping and watched a show about World War II and I learned more and it sparked off more thoughts for me about things like the Geneva Convention and how countries have agreed to rules about war like it was a sporting event and how Germany felt that they could kill and/or beat the Russians because they hadn&#39;t signed on to the convention. And<br/>\n more. And we watched that because Simon&#39;s been playing Call of Duty: World at War which takes place on both the Russian Front and in the South Pacific, two areas of WWII that I never really think about unless I&#39;m watching South Pacific or a Hogan&#39;s Heroes episode where the Russian Front is threatened. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And this final point leads me to another question:  when do you find YOU-time??  And I don&#39;t mean time for extra lovely things like baths... I mean time for simpler but equally important &gt; things like showers, or journaling, or yoga...  I&#39;m not sure what I&#39;m doing wrong but my time always ends up crowded out with the girls&#39; needs...  <br/>\n<br/>\n </span></blockquote>When Simon and Linnaea were little any time I had to myself was about them napping or about David being home. Baths were often all of us in the tub together. If I wrote in those years it was something quickly here or there and not anything like I can do now. Even this e-mail has had many stops and starts as I watched a Carry On Christmas special with Simon and fixed choux pastry for a party tomorrow and snickerdoodle dough and got food and drinks for Simon and Linnaea and cleaned the cat boxes and took a shower and hung laundry out and all the various and sundry other things that I&#39;ve done. <br/>\n<br/>\nI can remember feeling like me time was really important. Like it was something I was missing and it made me feel hard done by at times and self-pitying at others. When I stopped fixating on the idea that somehow I needed this time I stopped missing it so much. As long as I held out this hope for me time for whatever it was, reading a book, watching a movie, knitting a jumper, whatever, the less I was able to enjoy sitting and playing with Simon and Linnaea wherever or whatever they were doing. It still happens. The more wrapped up I am in a story about what is supposed to happen or what it is I am supposed to do the less I am flexible when Simon or Linnaea want to change the plans I&#39;ve made or we&#39;ve made together. Being more willing to go with what they want and what they need and to be with them fully and attentively, the less I whine and/or storm about how my needs aren&#39;t getting met. The funny thing is that the time will come so quickly when you have<br/>\n much more me time, you won&#39;t want it nearly as much as you thought you did. Gonna stop now. Linnaea wants the computer to play Oblivion.<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] kinda new here","postDate":"1239273833","msgId":39405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NjcxODlFLTQ2NUMtNDU3RS1BNDU5LTU2RDM0NEJCRUU4RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg==","referencesHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg=="},"prevInTopic":39398,"nextInTopic":39406,"prevInTime":39404,"nextInTime":39406,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"... Depends on the class. Depends on the child. Depends on the mom too! For *kids* who want a formal approach, who want lessons, classes can be great. But to","messageBody":"<div id=\"ygrps-yiv-858389896\">On Apr 8, 2009, at 11:54 AM, Agnieszka wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, this is one of my questions: what are your approaches to  <br/>\n&gt; putting your kiddies in classes???<br/>\n<br/>\n </span></blockquote>Depends on the class. Depends on the child. Depends on the mom too!<br/>\n<br/>\nFor *kids* who want a formal approach, who want lessons, classes can  <br/>\nbe great. But to allow unschooling to flourish, it&#39;s important for  <br/>\nparents and kids to know that classes aren&#39;t necessary for learning.  <br/>\nInterest, access to materials, freedom to explore are all that&#39;s  <br/>\nnecessary.<br/>\n<br/>\nSometimes kids get a passion to know more than they can get by free  <br/>\nexploration -- martial arts class comes to mind. Sometimes kids want  <br/>\nto connect with other kids who share the same interests.<br/>\n<br/>\nBut classes as a way to impart a body of knowledge onto a child who  <br/>\nshows an interest, or even as a way to nurture an interest, are good  <br/>\nconcepts to let go of!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The other, ever present question on my mind is this: how much  <br/>\n&gt; children&#39;s tv shows is TOO much???<br/>\n<br/>\n </span></blockquote>When they turn it off ;-)<br/>\n<br/>\nWhich is assuming kids have other opportunities swirling in their  <br/>\nlives to choose from. If TV is the least boring choice (to the kids)  <br/>\nit&#39;s the mom&#39;s responsibility to add more to their lives.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Morning has become our &quot;show-time&quot;, and when guilt leaves me alone,  <br/>\n&gt; I enjoy that time and use it for this, for example, or for paying  <br/>\n&gt; bills or making phone calls...<br/>\n<br/>\n </span></blockquote>While it&#39;s not necessary to sit with them all the time, every time,  <br/>\nit&#39;s relationship growing to be with them, to understand what they  <br/>\nenjoy, to know enough to connect with them through the shows.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and we dont&#39; have a tv player, so dvds are all they get<br/>\n<br/>\n </span></blockquote>This is similar to saying &quot;We don&#39;t take them to bookstores or  <br/>\nlibraries, so the few books we have at home are all they get.&quot;<br/>\n<br/>\nIf you don&#39;t have reception or can&#39;t afford cable, that&#39;s one thing.  <br/>\nBut if TV is kept away for other reasons, it&#39;s no different than  <br/>\nlimiting them to a few books.<br/>\n<br/>\nIf you have high speed internet, there&#39;s a wealth of programming on  <br/>\nthe internet. :-) Here&#39;s some legal sites:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hulu.com\">http://www.hulu.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.crunchyroll.com\">http://www.crunchyroll.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joost.com\">http://www.joost.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sling.com\">http://www.sling.com</a><br/>\n<br/>\nThere&#39;s a great deal written about TV here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a> (scroll down the left side)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: kinda new here","postDate":"1239249781","msgId":39398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5REQ3Mzc1LjkwNjA3MDJAbWFjLmNvbT4=","inReplyToHeader":"PGdyanB0dSszbm03QGVHcm91cHMuY29tPg==","referencesHeader":"PGdyanB0dSszbm03QGVHcm91cHMuY29tPg=="},"prevInTopic":39396,"nextInTopic":39405,"prevInTime":39397,"nextInTime":39399,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"... My 5 yo kid would be climbing on a fence and someone would say, You should get her into gymnastics.  My 3 year old would be dancing and singing - happy","messageBody":"<div id=\"ygrps-yiv-935818350\">On 4/8/2009 8:26 PM, Ren Allen wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; A few children love that structure and it might be worth it. If there is something a child is interested in and your first reaction is &quot;ooh, let&#39;s sign up for a class&quot;, slow down and think of other creative options. Classes are often a great way to make a kid think they don&#39;t like the thing you&#39;re paying for.<br/>\n&gt;<br/>\n&gt; I think getting in a pool frequently with young children is WAY better than paying for a class. Lots of things are like that. A very young child would rather be with their parent anyway...why not spend the money finding ways to connect and have fun together? The learning happens more fluidly and naturally that way.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>My 5 yo kid would be climbing on a fence and someone would say, &quot;You <br/>\nshould get her into gymnastics.&quot;  My 3 year old would be dancing and <br/>\nsinging - happy as a lark, and someone would say, &quot;You should get her <br/>\ninto dance lessons.&quot; Roya loved the water - and people would say, &quot;She <br/>\nneeds a swimming class.&quot;<br/>\n<br/>\nI&#39;m so glad my mom&#39;s reaction was, &quot;Why? She&#39;s having a blast doing her <br/>\nown form of gymnastics/dance/whatever right now. She clearly doesn&#39;t <br/>\nneed lessons to have a good time.&quot;<br/>\n<br/>\nAlso - when our kids were older and did have specific interests, we did <br/>\na lot of arranging our own versions of classes. I hired a couple to come <br/>\nto the park and teach swing dance. That way it was done on our terms <br/>\n(which mean ALL ages - kids and adults - and that kids could come and go <br/>\nthroughout the class, if they felt like it). It worked out really really <br/>\nwell.<br/>\n<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kinda new here","postDate":"1239247614","msgId":39396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyanB0dSszbm03QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVBODRBMDFDOTlFRTQwQjc5MUNGMkIxRkM3QTY1NUI2QGZlYXRoZXJiZWFuPg=="},"prevInTopic":39390,"nextInTopic":39398,"prevInTime":39395,"nextInTime":39397,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"~~So, this is one of my questions: what are your approaches to putting your kiddies in classes???~~ I m not a big fan of young children in any kind of class,","messageBody":"<div id=\"ygrps-yiv-32126748\">~~So, this is one of my questions: what are your approaches to putting your kiddies in classes???~~<br/>\n<br/>\nI&#39;m not a big fan of young children in any kind of class, but maybe that&#39;s because my kids don&#39;t have a strong interest in much formal class type of learning. They&#39;ve come and gone from a few things like gymnastics, but they were usually over 5 before we tried any of that. Even 5ish is young but I stayed and it was totally their choice.<br/>\n<br/>\nFor the most part, I think you can get a LOT more out of doing things yourselves that classes offer. Great  equipment and/or spending money on home equipment usually offers better options than classes. Finding people who love kids and just enjoy sharing their passions is better than classes. There are so many better ways to spend that same money for the most part.<br/>\n<br/>\nA few children love that structure and it might be worth it. If there is something a child is interested in and your first reaction is &quot;ooh, let&#39;s sign up for a class&quot;, slow down and think of other creative options. Classes are often a great way to make a kid think they don&#39;t like the thing you&#39;re paying for.<br/>\n<br/>\nI think getting in a pool frequently with young children is WAY better than paying for a class. Lots of things are like that. A very young child would rather be with their parent anyway...why not spend the money finding ways to connect and have fun together? The learning happens more fluidly and naturally that way.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":244317154,"authorName":"Heather Burditt","from":"Heather Burditt &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] kinda new here","postDate":"1239239865","msgId":39390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBODRBMDFDOTlFRTQwQjc5MUNGMkIxRkM3QTY1NUI2QGZlYXRoZXJiZWFuPg==","inReplyToHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg==","referencesHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg=="},"prevInTopic":39383,"nextInTopic":39396,"prevInTime":39389,"nextInTime":39391,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"So, this is one of my questions: what are your approaches to putting your kiddies in classes??? ******My kids usually don t do classes.  They are not","messageBody":"<div id=\"ygrps-yiv-142055749\">So, this is one of my questions: what are your approaches to putting your<br/>\nkiddies in classes??? <br/>\n<br/>\n******My kids usually don&#39;t do classes.  They are not interested in<br/>\nstructure at this point.  However, they both play sports.  My ds4 is<br/>\nstarting soccer this year.  We will listen to him, play with him, support<br/>\nhim, and help make it an enjoyable experience.  We won&#39;t force to him to<br/>\nstay if he wants to leave or continue if he wants to quit.<br/>\n======================================================================<br/>\n<br/>\n<br/>\nThe other, ever present question on my mind is this: how much children&#39;s tv<br/>\nshows is TOO much??? I know that this is a huge thing, so all I want to ask<br/>\nyou, if you feel comfortable sharing either on the forum or privately, to<br/>\nplease share with me your personal approach to it????<br/>\n<br/>\n******I don&#39;t know.  How much IS too much?  My guess is that this varies<br/>\nwith each individual.  Sometimes, when I&#39;ve watched an extended amount of<br/>\ntelevision (which is really not much) I stand up and think, &quot;wow I&#39;ve<br/>\nwatched too much TV&quot;.  No one is limiting my television so I am free to<br/>\ndecide and listen to my body.  My kids are very different as well.  One<br/>\nloves watching television, one doesn&#39;t like it much at all.  They are free<br/>\nto make those decisions for themselves.<br/>\n<br/>\n======================================================================<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217738611,"authorName":"goddessmamaof3@yahoo.com","from":"goddessmamaof3@...","profile":"goddessmamaof3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] kinda new here","postDate":"1239227130","msgId":39383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0NTYxODUzOS0xMjM5MjI2OTc2LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtMzM5MzkzMzk0LUBieGUxMTA0LmJpc3gucHJvZC5vbi5ibGFja2JlcnJ5Pg==","inReplyToHeader":"PDE4MDY3Ni45NTY4MC5xbUB3ZWI0NTMwOS5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPjwxODA2NzYuOTU2ODAucW1Ad2ViNDUzMDkubWFpbC5zcDEueWFob28uY29tPg=="},"prevInTopic":39382,"nextInTopic":39390,"prevInTime":39382,"nextInTime":39384,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"Hi. I haven t posted here in quite awhile but I am feeling the need to get back involved and start getting new ideas from fellow unschoolers. I did have","messageBody":"<div id=\"ygrps-yiv-1396049065\">Hi. I haven&#39;t posted here in quite awhile but I am feeling the need to get back involved and start getting new ideas from fellow unschoolers. I did have something to say about computer time and game time and thought this would be a time to reconnect with the group my daughter plays without restriction on an online game that has her interact with adult and children players. Not only has she reached the highest lvl possible in this game but also is in charge of a group of adults in teaching them how to play and how things work.  She is 10 btw . She knows endless computer information and even teaches me sometimes lol. She even installed my new memory card! Hoping to reconnect and start moving forward in our un schooling life change kim<br/>\nSent from my Verizon Wireless BlackBerry<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Tammy Curry &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamabeart00@...\">mamabeart00@...</a>&gt;<br/>\n<br/>\nDate: Wed, 8 Apr 2009 11:33:38 <br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] kinda new here<br/>\n<br/>\n<br/>\nWelcome Angieszka!<br/>\n<br/>\nMy littles are 10 and 4. This is our first year of homeschooling but as we were allowing time for decompression from PS for our daughter (10) we have just simply started enjoying having her home and the relationship we are rebuilding with her. She has asked about taking some classes and we have checked some out but she really isn&#39;t into those right now. Our son (4) would rather just hang with mom, dad and sissy. So on that note, I have absolutely no advice other than find out what interests them though that might be more difficult to do with babies, everyday the world is brand new again to them. <br/>\n<br/>\nWe used to limit &quot;screen&quot; time per what a pediatrician told us what we should do. What a mistake that was for us, we can see that now. We do not limit their time to watch their favorite movies or shows or play computer games. It is still taking some getting used to on the part of everyone but I can&#39;t tell you how much we enjoy spending the time with the kids enjoying their worlds. At first glance you would think my daughter is totally and mindlessly addicted to anime. However, once we made the choice to sit and watch with her and participate in what she is doing we discovered that the shows and movies she was watching were based on the graphic novels she is reading. She is comparing story boards and learning to make her own graphic novels. She has researched the authors, directors, voice actors, etc. She started off just watching but her interest has grown in such a wide variety of ways. She is also learning how to design costumes because she found out<br/>\n that she can go to convention (as soon as we can find one close enough and we can afford it all) and they have costume contests. This goes with her interest in fashion design. The world of anime is absolutely fascinating. I couldn&#39;t understand any of that until I made up my mind to find out what drew my daughter to it.<br/>\n<br/>\nAs for the 4 yr old, well he thinks of many of the characters he watches as his friends. He doesn&#39;t sit still so watching something for him also means, flying and landing on the couch, standing on his and generally bouncing around while creating this world of adventure based on what he sees. But he has made it is own thing completely. He is also coming up with stories that I have been writing down for him. His other love involves &quot;screen&quot; time as well. City of Heroes/Villains. It is an online MMORPG, same media as the ever popular World of Warcraft. He does very well on his own or his preferred way to play right now is to have some one help him with his toons or to play his toon for him so it can be built up to higher level which makes play easier for him. That or he stands beside one of us and pretends to be playing. He always has a pocket full of wakies and his speed boost power is always on and he is so willing to share those when he has tired one of<br/>\n his parents out. <br/>\n<br/>\nSo as for limiting things like tv and such, I would ask why? There is so much time for them to do other things. They have their whole lives to do other things, if that is what interests them now let them. <br/>\n<br/>\nAs for me time, those are the rare moments when the kids do not need us right there with them. As for grabbing a shower, I think maybe once or twice a week I get the bathroom all to myself. However, I love it when the kids come in and sit and talk. Sometimes it is one of those times when my daughter feels comfortable enough to divulge a private or secret of her own. My son, well and I did this with my daughter until she decided she was too old, he normally jumps right in with me. Though lately he likes to come in and get nakie and wait until mommy steps out so he can have the water all to himself. Basically it is a family affair. Sometimes, if my daughter wants me to, I will go and sit in the bathroom while she showers and we talk. My husband doesn&#39;t come into the bathroom when our daughter is showering, she informed him a while back she was too old for daddy to come in. So no big deal, however, it isn&#39;t unsual for him and I to grab a few moments for<br/>\n ourselves that way. <br/>\n<br/>\nYoga can be a family thing as well. We have actually started watching some yoga videos and have been giving that a shot. I love it. Again we do it as a family. Now talking on the telephone. I do not know about anyone else but there is just this &quot;pheremone&quot; that we must send out alerting our family to that fact. It never fails the kids who have been pleasantly playing in their own worlds, the husband who has been occupied with something, they all of a sudden need you at that very moment. So I get what I have to do done. I am thankful for email, I do more &quot;stuff&quot; via email now than on the phone. I can send a quick hey I got your email will respond when I can instead of having to try and end a conversation. Things that require an actual voice conversation, well sometimes it takes several attempts to get it done but it will eventually get done. Writing of any kind I squeeze in through out the day. But the majority of my waking time is focused on my kids. My<br/>\n husband has been joining me in this more and more and well, life is getting more and more relaxed and enjoyable. I have given up trying to spread myself around. My kids need me right here, right now and that is where I belong. <br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, April 8, 2009 11:54:25 AM<br/>\nSubject: [unschoolingbasics] kinda new here<br/>\n<br/>\n<br/>\nhey all!<br/>\nI&#39;m Agnieszka, Polish-Canadian mama of 2 (and ttc #3 as now this month!!!).  Our girls are 4 and 2.5.  We AP, co-sleep, nursed as long as I could, and unschool and are totally rad in all different respects! :-p<br/>\n<br/>\nMy girls have taken a couple of classes of things they life, just to try them out.  Kalina (4) has taken &quot;dance&quot; (it wasn&#39;t really any particular dance... just kind of playing around) because she loves dance, and they are both in swim classes because they appear so terrified of water when they are with me... <br/>\n<br/>\nI am really unsure about classes in general because they call seem to include that authority figure type who more often than not has the I&#39;m-the-boss attitude... <br/>\n<br/>\nSo, this is one of my questions: what are your approaches to putting your kiddies in classes??? <br/>\n<br/>\nThe other, ever present question on my mind is this: how much children&#39;s tv shows is TOO much???  I know that this is a huge thing, so all I want to ask you, if you feel comfortable sharing either on the forum or privately, to please share with me your personal approach to it????<br/>\n<br/>\nHere is what I do: the girls have their favourite dvds (and we dont&#39; have a tv player, so dvds are all they get) and they watch about 1.5 hours per morning, on average.  Morning has become our &quot;show-time&quot;, and when guilt leaves me alone, I enjoy that time and use it for this, for example, or for paying bills or making phone calls...<br/>\n<br/>\nAnd this final point leads me to another question:  when do you find YOU-time??  And I don&#39;t mean time for extra lovely things like baths... I mean time for simpler but equally important things like showers, or journaling, or yoga...  I&#39;m not sure what I&#39;m doing wrong but my time always ends up crowded out with the girls&#39; needs... <br/>\n<br/>\nAnyway, I&#39;d love to hear your thoughts!!!<br/>\n<br/>\nAgnieszka<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287391473,"authorName":"hamsder clan","from":"hamsder clan &lt;hamsder@...&gt;","profile":"hamsder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] kinda new here","postDate":"1239219878","msgId":39382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxYTgyMmMzMDkwNDA4MTI0NG4yZGIzZWE2MHFhOTdmOWY1YTBlNTQ5MDE4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg==","referencesHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg=="},"prevInTopic":39379,"nextInTopic":39383,"prevInTime":39381,"nextInTime":39383,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"hi, i don t write in too often, simply because i have a hard time finding the time, but thought i would pipe in on classes for youngers. mine are 2 and 4 and","messageBody":"<div id=\"ygrps-yiv-1122274617\">hi,<br/>\n<br/>\ni don&#39;t write in too often, simply because i have a hard time finding<br/>\nthe time, but thought i would pipe in on classes for youngers. mine<br/>\nare 2 and 4 and we&#39;ve been thinking about classes for awhile... i have<br/>\na feeling the 4 year old would really enjoy some dance/gymnastics/art<br/>\ntypes of things.<br/>\n<br/>\nhowever, i&#39;ve sat in on a few classes (*without* the kidlets) and have<br/>\nfound that classes for pre-school aged kids are exactly that:<br/>\npre-school classes. they&#39;re less about the subject matter and more<br/>\nabout the &quot;skills&quot; needed for school... learning to stand in lines,<br/>\nwait your turn, do as you&#39;re told, participate in group activities,<br/>\netc. i&#39;m sure there are exceptions in the world at large, but i have<br/>\nnot yet found them in our small, rural part of the world. :)<br/>\none-on-one classes would probably be a huge improvement, but also a<br/>\nmuch larger financial investment.<br/>\n<br/>\nthere&#39;s a local gym that has weekly open gym days that give them a<br/>\nchance to play on the equipment without the, well, social<br/>\nindoctrination expectations involved in official classes. park trips,<br/>\nmattresses on the floor and a trampoline satisfy many of the same<br/>\nrambunctious needs. loud music and some down-home boogy have been<br/>\nserving us pretty well on the dance front so far. :)<br/>\n<br/>\nanyway, we&#39;ve decided to hold off on classes (unless, of course, the<br/>\nkids decide they&#39;re ready NOW!) until they&#39;re eligible for classes<br/>\nwith older kids where the focus is more on Fun and less on those<br/>\nall-important School Skills.<br/>\n<br/>\n--jenny (larkin 4, finn 2)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Apr 8, 2009 at 8:54 AM, Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I am really unsure about classes in general because they call seem to<br/>\n&gt; include that authority figure type who more often than not has the<br/>\n&gt; I&#39;m-the-boss attitude...<br/>\n&gt;<br/>\n&gt; So, this is one of my questions: what are your approaches to putting your<br/>\n&gt; kiddies in classes??? </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] kinda new here","postDate":"1239216330","msgId":39379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTMwNy45Mzg1NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDE4MDY3Ni45NTY4MC5xbUB3ZWI0NTMwOS5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPiA8MTgwNjc2Ljk1NjgwLnFtQHdlYjQ1MzA5Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":39378,"nextInTopic":39382,"prevInTime":39378,"nextInTime":39380,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"Start by reading here: http://sandradodd.com/help here a great link on toddlers http://sandradodd.com/toddlers About Tv and Video: http://sandradodd.com/tv ","messageBody":"<div id=\"ygrps-yiv-1675674001\">Start by reading here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help\">http://sandradodd.com/help</a><br/>\n<br/>\nhere a great link on toddlers<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/toddlers\">http://sandradodd.com/toddlers</a><br/>\n<br/>\nAbout Tv and Video:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\nthere is much more but these links will keep you busy for a while!<br/>\nWelcome!<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"2"},"subject":"Re: [unschoolingbasics] kinda new here","postDate":"1239215618","msgId":39378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MDY3Ni45NTY4MC5xbUB3ZWI0NTMwOS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg==","referencesHeader":"PGdyaWhiaCtmMmpoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39379,"prevInTime":39377,"nextInTime":39379,"topicId":39376,"numMessagesInTopic":0,"msgSnippet":"Welcome Angieszka! My littles are 10 and 4. This is our first year of homeschooling but as we were allowing time for decompression from PS for our daughter","messageBody":"<div id=\"ygrps-yiv-659614757\">Welcome Angieszka!<br/>\n<br/>\nMy littles are 10 and 4. This is our first year of homeschooling but as we were allowing time for decompression from PS for our daughter (10) we have just simply started enjoying having her home and the relationship we are rebuilding with her. She has asked about taking some classes and we have checked some out but she really isn&#39;t into those right now. Our son (4) would rather just hang with mom, dad and sissy. So on that note, I have absolutely no advice other than find out what interests them though that might be more difficult to do with babies, everyday the world is brand new again to them. <br/>\n<br/>\nWe used to limit &quot;screen&quot; time per what a pediatrician told us what we should do. What a mistake that was for us, we can see that now. We do not limit their time to watch their favorite movies or shows or play computer games. It is still taking some getting used to on the part of everyone but I can&#39;t tell you how much we enjoy spending the time with the kids enjoying their worlds. At first glance you would think my daughter is totally and mindlessly addicted to anime. However, once we made the choice to sit and watch with her and participate in what she is doing we discovered that the shows and movies she was watching were based on the graphic novels she is reading. She is comparing story boards and learning to make her own graphic novels. She has researched the authors, directors, voice actors, etc. She started off just watching but her interest has grown in such a wide variety of ways. She is also learning how to design costumes because she found out<br/>\n that she can go to convention (as soon as we can find one close enough and we can afford it all) and they have costume contests. This goes with her interest in fashion design. The world of anime is absolutely fascinating. I couldn&#39;t understand any of that until I made up my mind to find out what drew my daughter to it.<br/>\n<br/>\nAs for the 4 yr old, well he thinks of many of the characters he watches as his friends. He doesn&#39;t sit still so watching something for him also means, flying and landing on the couch, standing on his and generally bouncing around while creating this world of adventure based on what he sees. But he has made it is own thing completely. He is also coming up with stories that I have been writing down for him. His other love involves &quot;screen&quot; time as well. City of Heroes/Villains. It is an online MMORPG, same media as the ever popular World of Warcraft. He does very well on his own or his preferred way to play right now is to have some one help him with his toons or to play his toon for him so it can be built up to higher level which makes play easier for him. That or he stands beside one of us and pretends to be playing. He always has a pocket full of wakies and his speed boost power is always on and he is so willing to share those when he has tired one of<br/>\n his parents out. <br/>\n<br/>\nSo as for limiting things like tv and such, I would ask why? There is so much time for them to do other things. They have their whole lives to do other things, if that is what interests them now let them. <br/>\n<br/>\nAs for me time, those are the rare moments when the kids do not need us right there with them. As for grabbing a shower, I think maybe once or twice a week I get the bathroom all to myself. However, I love it when the kids come in and sit and talk. Sometimes it is one of those times when my daughter feels comfortable enough to divulge a private or secret of her own. My son, well and I did this with my daughter until she decided she was too old, he normally jumps right in with me. Though lately he likes to come in and get nakie and wait until mommy steps out so he can have the water all to himself. Basically it is a family affair. Sometimes, if my daughter wants me to, I will go and sit in the bathroom while she showers and we talk. My husband doesn&#39;t come into the bathroom when our daughter is showering, she informed him a while back she was too old for daddy to come in. So no big deal, however, it isn&#39;t unsual for him and I to grab a few moments for<br/>\n ourselves that way. <br/>\n<br/>\nYoga can be a family thing as well. We have actually started watching some yoga videos and have been giving that a shot. I love it. Again we do it as a family. Now talking on the telephone. I do not know about anyone else but there is just this &quot;pheremone&quot; that we must send out alerting our family to that fact. It never fails the kids who have been pleasantly playing in their own worlds, the husband who has been occupied with something, they all of a sudden need you at that very moment. So I get what I have to do done. I am thankful for email, I do more &quot;stuff&quot; via email now than on the phone. I can send a quick hey I got your email will respond when I can instead of having to try and end a conversation. Things that require an actual voice conversation, well sometimes it takes several attempts to get it done but it will eventually get done. Writing of any kind I squeeze in through out the day. But the majority of my waking time is focused on my kids. My<br/>\n husband has been joining me in this more and more and well, life is getting more and more relaxed and enjoyable. I have given up trying to spread myself around. My kids need me right here, right now and that is where I belong. <br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, April 8, 2009 11:54:25 AM<br/>\nSubject: [unschoolingbasics] kinda new here<br/>\n<br/>\n<br/>\nhey all!<br/>\nI&#39;m Agnieszka, Polish-Canadian mama of 2 (and ttc #3 as now this month!!!).  Our girls are 4 and 2.5.  We AP, co-sleep, nursed as long as I could, and unschool and are totally rad in all different respects! :-p<br/>\n<br/>\nMy girls have taken a couple of classes of things they life, just to try them out.  Kalina (4) has taken &quot;dance&quot; (it wasn&#39;t really any particular dance... just kind of playing around) because she loves dance, and they are both in swim classes because they appear so terrified of water when they are with me... <br/>\n<br/>\nI am really unsure about classes in general because they call seem to include that authority figure type who more often than not has the I&#39;m-the-boss attitude... <br/>\n<br/>\nSo, this is one of my questions: what are your approaches to putting your kiddies in classes??? <br/>\n<br/>\nThe other, ever present question on my mind is this: how much children&#39;s tv shows is TOO much???  I know that this is a huge thing, so all I want to ask you, if you feel comfortable sharing either on the forum or privately, to please share with me your personal approach to it????<br/>\n<br/>\nHere is what I do: the girls have their favourite dvds (and we dont&#39; have a tv player, so dvds are all they get) and they watch about 1.5 hours per morning, on average.  Morning has become our &quot;show-time&quot;, and when guilt leaves me alone, I enjoy that time and use it for this, for example, or for paying bills or making phone calls...<br/>\n<br/>\nAnd this final point leads me to another question:  when do you find YOU-time??  And I don&#39;t mean time for extra lovely things like baths... I mean time for simpler but equally important things like showers, or journaling, or yoga...  I&#39;m not sure what I&#39;m doing wrong but my time always ends up crowded out with the girls&#39; needs... <br/>\n<br/>\nAnyway, I&#39;d love to hear your thoughts!!!<br/>\n<br/>\nAgnieszka<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39411,"nextTopicId":39446}}