{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Intro,  praise for the conference, thank yous, comments  & questions","postDate":"1132029249","msgId":7734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRsYm9nMSs0YXJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRsYjBldCtlNXBxQGVHcm91cHMuY29tPg=="},"prevInTopic":7727,"nextInTopic":0,"prevInTime":7733,"nextInTime":7735,"topicId":7727,"numMessagesInTopic":0,"msgSnippet":"Welcome Christine! I m glad you got to go to the conference (we couldn t).   Where do you live?   We re in MA. You mentioned your spirited children.  Have you","messageBody":"<div id=\"ygrps-yiv-43815666\">Welcome Christine!<br/>\n<br/>\nI&#39;m glad you got to go to the conference (we couldn&#39;t).   Where do you <br/>\nlive?   We&#39;re in MA.  <br/>\n<br/>\nYou mentioned your spirited children.  Have you checked out Anne&#39;s <br/>\ngroup, shinewithunschooling?   My dd (13) is spirited, or as I now <br/>\nrealize, thanks to Anne&#39;s group, highly sensitive.   This is our first <br/>\nyear unschooling, I pulled Danielle out at the end of 6th grade in <br/>\nJune.  We&#39;re still deschooling (BOTH of us!).<br/>\n<br/>\nI haven&#39;t had much time to check in the past couple of weeks (it&#39;s been <br/>\na challenging month for my dd, first period, bumps in the deschooling <br/>\nprocess, you probably saw my post) plus we had to move my MIL from <br/>\nassisted living to an Alzheimer&#39;s nursing facility a couple of weeks <br/>\nago, still trying to sell her house, we&#39;re over an hour away from all <br/>\nthis.<br/>\n<br/>\nI just wanted to pop in and say hi!<br/>\nJann</div>","specialLinks":[]},{"userId":115295995,"authorName":"crissyhall","from":"&quot;crissyhall&quot; &lt;crissyhall@...&gt;","profile":"crissyhall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Intro,  praise for the conference, thank yous, comments  & questions","postDate":"1132004637","msgId":7727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRsYjBldCtlNXBxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":7734,"prevInTime":7726,"nextInTime":7728,"topicId":7727,"numMessagesInTopic":0,"msgSnippet":"Hi! I ve been reading posts from this group since June 2004 and this is my first post.  I can hardly keep up with the reading, let alone write something!  So","messageBody":"<div id=\"ygrps-yiv-272193153\">Hi! I&#39;ve been reading posts from this group since June 2004 and this<br/>\nis my first post.  I can hardly keep up with the reading, let alone<br/>\nwrite something!  So I&#39;ve saved up a lot and this is my intro, praise<br/>\nfor the conference, thank yous, comments, and questions all in one :).<br/>\n<br/>\nMy intro:  I&#39;m Christine and I have 4 kids; Alexa (11), Autumn (9),<br/>\nNic (6) and Nate (4).  My girls went to public school for K-4 and K-1.<br/>\n I never even considered homeschooling. &quot;Are you kidding, my oldest<br/>\n&quot;spirited&quot; child and I would do nothing but fight!&quot; But luckily my dh<br/>\nwas offered an assignment to a place where the schools were &quot;awful&quot;<br/>\nand everyone sent their kids to $9,000/year/kid private schools. <br/>\nSince that wasn&#39;t a possiblity for us, and &quot;education&quot; was a high<br/>\npriority for us, I started to research homeschooling.  I don&#39;t<br/>\nremember what lead me to John Holt&#39;s &quot;How Children Fail&quot; but it<br/>\nchanged everything.  We ended up staying where &quot;the public schools are<br/>\nsome of the best in the nation&quot; (*note the sarcasm, very good school<br/>\nbut still a school) and I still wanted to unschool! This is our second<br/>\nyear and my oldest dd, who was &quot;dyslexic&quot; in school, is so much<br/>\nhappier, likes reading again and our relationship is so much better.  <br/>\n<br/>\nPraise for the conference: I can&#39;t believe that a conference could<br/>\nchange my life so much!  Dh and the kids rolled their eyes whenever we<br/>\ntalked about going to a conference for vacation, and I began to doubt<br/>\nmyself asking them to drive that far for it but I figured if the<br/>\nconference was a bust (for them)  there&#39;s lots to do in St. Louis.  We<br/>\nended up only seeing the Arch and the City Museum and  * I * was the<br/>\nonly one who wanted to at least see the Arch! LOL My dh said that<br/>\nsince we are *all* having fun and learning so much, we don&#39;t *have* to<br/>\ndo anything and we should stay at the conference!  I couldn&#39;t believe<br/>\nit. He went from thinking that we were making a mistake with<br/>\nunschooling, to trusting me because I&#39;m passionate in my belief in it<br/>\nand have spent alot of time reading about it, to understanding it and<br/>\nbelieving this would work for our family!<br/>\n<br/>\n And while that is so incredibly wonderful to have his support and<br/>\nunderstanding, I couldn&#39;t quite put my finger on what it was that made<br/>\nthe conference even more special than that.  Then I realized that<br/>\nalthough I&#39;ve always believed that you should live in the moment, <br/>\nmake each day special and find joy in what ever you are doing, I<br/>\nreally struggled with actually doing it. The conference and all those<br/>\nwonderful speakers made me see how wonderful, fun, and exciting every<br/>\nday life is *each and every moment*.  Young kids get that, they just<br/>\nlose it along the way and if I can reclaim it and keep it for my kids,<br/>\nthat is the best thing I can do. And learning and trying new things,<br/>\nwithout fear of mistakes or that it will lead to some career, is what<br/>\nmakes life so fun and exciting. <br/>\n<br/>\nThank yous:  Kelly- thank you for cordinating the conference, you<br/>\nhelped change our lives. And thank you to all the speakers: Pam,<br/>\nSandra, Anne, Ren, Danielle, Robyn and Kelly.  I&#39;m so grateful that<br/>\nthe &quot;gurus&quot; of unschooling are such eloquent writers and speakers and<br/>\nshare your time and life with us. I felt like I was at movie premiere<br/>\nwith movie stars; I&#39;ve read so much about you and learned so much from<br/>\nyou and there you were in real life!  And thank you to everyone on<br/>\nthis board for taking the time to ask and answer questions,  I&#39;ve<br/>\nlearned along with you.  <br/>\n<br/>\nKelly, at one of the break out sessions you had mentioned that you<br/>\nthought kids had easy years and hard years, and I said it was the <br/>\ntheory of disequilibrium/equilibrium that you had figured out. Isn&#39;t<br/>\nit funny how parents can instinctly figure things out, even without<br/>\n&quot;experts&quot; ;)  I couldn&#39;t find a really great link, but this is<br/>\nsimiliar to what I had seen<br/>\n.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crs.uvm.edu/nnco/communsupp/work4.html#bp\">http://crs.uvm.edu/nnco/communsupp/work4.html#bp</a> <br/>\n<br/>\n Kids go through stages of huge learning spurst (at the 1/2 year or<br/>\nodd years)  while they are figuring things out, and they are &quot;out of<br/>\nsorts&quot; and &quot;harder&quot; on the parents.  And once they it figure something<br/>\nout, (at the beginning of an age or the even years), they are &quot;easier&quot;<br/>\non the parents.  Of course, kids are all different and some start a<br/>\nstage 6 months earlier or later, but it&#39;s still a similiar pattern.<br/>\n<br/>\nDanielle,  you recently said : &quot;Sam came and helped me redefine what<br/>\namazing, loving children look like, and they&#39;re not always easy. ;)<br/>\nBut, they&#39;re always rewarding, and they benefit just as much, if not<br/>\n*more*, from the AP and Unschooling, and they help *us* grow and<br/>\nstretch in amazing, glorious ways that &quot;easy&quot;children do not.&quot;  <br/>\n<br/>\nI have 3 out of 4 &quot;spirited&quot; (not easy) kids and I had been extremely<br/>\nfrustrated with my youngest when I read that quote. And it made me<br/>\nrealize that I was lucky to have one easy kid so I didn&#39;t feel like<br/>\nthe worst parent in the world, and proof to me that so much is their<br/>\ninborn personality, and I hadn&#39;t somehow messed them up.  And I was<br/>\ngiven Alexa, Nic and Nate to push me to learn more. I thought one was<br/>\nplenty to challenge me, but I guess I&#39;m really stubborn ;)   Nate has<br/>\nmade it even more clear to me that you can&#39;t force anyone to do<br/>\nsomething (even gently and explaining why).  I&#39;m someday going to<br/>\ncompletely understand &quot;mindful parenting&quot;  which is my goal, and I<br/>\nnever would have been &quot;stretched&quot; to do so if my children were easy,<br/>\ncompliant kids that traditional parenting worked with. <br/>\n<br/>\nSo now my questions:  I&#39;ve been trying to say &quot;yes&quot; more and working<br/>\nout compromises, but I&#39;m really struggling with balancing everyone&#39;s<br/>\nneeds and wants.  With my 4 year old, everything has to be his idea or<br/>\nhe just won&#39;t do it. It is fun to see him doing things his way :).  <br/>\nOur biggest struggles have been leaving the house. He&#39;s a happy kid as<br/>\nlong as we are home. So I&#39;ve been trying to honor what he wants, shop<br/>\nand run errands without him, and have lots of completely open days to<br/>\nhang out at home. But how do I handle times when I need him to come<br/>\nwith us and if we stay home,  3 other kids miss out on what they want<br/>\nto do?<br/>\n<br/>\n2nd question:  How do you handle fights between kids?   Especially<br/>\nwhen they have such different personalities.  I worry that the older<br/>\nkids take advantage of the younger, the stronger personalities always<br/>\nwin, etc.  We&#39;ve tried to take turns, flip coins, &quot;paper, rock, and<br/>\nsissors&quot;.etc.   But one kid points out that one side of a coin is<br/>\nweighted to win more often, and  etc. etc.  They are too smart for<br/>\n*my* own good.  We seem to spend all our time to trying to work things<br/>\nout  and then they complain that we don&#39;t have time to do more things. <br/>\n<br/>\nWell enough out of me<br/>\n~Christine</div>","specialLinks":[]}],"prevTopicId":7715,"nextTopicId":7723}}