{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food police","postDate":"1297471091","msgId":46115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGtwais4Mmw3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqNGZiays0dGszQGVHcm91cHMuY29tPg=="},"prevInTopic":46113,"nextInTopic":0,"prevInTime":46114,"nextInTime":46116,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"... *************** As you get more into snacks and monkey platters, if you still want dinner to be a family meal it can help to set things up so that","messageBody":"<div id=\"ygrps-yiv-1509339203\">&quot;Cindy&quot; &lt;millerblend@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I ask them what they want for breakfast each morning and offer choices for lunch, dinner is what I make although I am no longer insisting they eat everything I put on the plate.<br/>\n </span></blockquote>***************<br/>\n<br/>\nAs you get more into snacks and monkey platters, if you still want dinner to be a &quot;family meal&quot; it can help to set things up so that &quot;dinner&quot; is more about socializing than food. We&#39;ve never had dinner as a &quot;required&quot; meal, and so for the most part my partner and I make food that we like - grown up food. The kids may join with a snack, a bowl of cereal, a project, or just sit with us and chit-chat - or not join us at all and we&#39;ll touch base some other time. The nice thing about kids being home all day is that the &quot;family meal&quot; is less of a necessity for connection since there are plenty of other chances for that to happen. <br/>\n<br/>\nAnd when kids don&#39;t come to the table you can enjoy a bit of grown up conversation together! That, in turn, can take some of the pressure off &quot;bed time&quot; as you&#39;ll have met one of the needs that get lumped together in that evening &quot;adult time&quot;. <br/>\n<br/>\nThere are a lot of needs that tend to get lumped together like that in conventional parenting. Dinner is about food And adult connection needs And kid connection needs And etiquette - whew! Throw in tradition and its no wonder so many americans eat in front of the tv ;) Its too much baggage for one half hour. Bed time is about parents having time for connection, problem solving, adult conversation, and sex - that&#39;s a lot of pressure, too! So whenever you can find ways to say Yes to those needs bit by bit, rather than in big lumps, it spreads out the load, as it were. It takes some shifting of perspective, but breaking big issues up into littler issues can go a long way to a more peaceful home. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":100950165,"authorName":"Cindy","from":"&quot;Cindy&quot; &lt;millerblend@...&gt;","profile":"millerblend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food police","postDate":"1297465524","msgId":46113,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGZiays0dGszQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1ODA4QTFCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":46112,"nextInTopic":46115,"prevInTime":46112,"nextInTime":46114,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"We are new to unschooling and I can t say we have totally taken it into our parenting style.  Kids still are told when to go to bed although now there is not a","messageBody":"<div id=\"ygrps-yiv-1596634418\">We are new to unschooling and I can&#39;t say we have totally taken it into our parenting style.  Kids still are told when to go to bed although now there is not a specific time and they aren&#39;t told they have to sleep just be in bed reading, playing, or listening to cd&#39;s.<br/>\n<br/>\nI am still very much struggling with the idea of total freedom in choosing what they EAT.  I ask them what they want for breakfast each morning and offer choices for lunch, dinner is what I make although I am no longer insisting they eat everything I put on the plate.  Today I am trying Sandra Dodd&#39;s idea of a monkey platter.  Just got home from Disney where they ate whatever they wanted.  Curious to see what they eat off the platter.  I put grapes, celery pcs, carrots, broccoli, bananas and salami on it.<br/>\n<br/>\nWhen it comes to potlucks etc....at church or someone&#39;s home my only &quot;rule&quot; is to leave some for the people in line behind us.  :-)<br/>\n<br/>\nCindy M.</div>","specialLinks":[]},{"userId":365958730,"authorName":"jenellerainforest1","from":"&quot;jenellerainforest1&quot; &lt;jenellerainforest1@...&gt;","profile":"jenellerainforest1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food police","postDate":"1297462879","msgId":46112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGNvditmZTllQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1ODA4QTFBQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":46103,"nextInTopic":46113,"prevInTime":46111,"nextInTime":46113,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"Thank you for the advice about being careful when saying things are proven to be harmful.  I have understood artificial blue and red food dyes to have long","messageBody":"<div id=\"ygrps-yiv-1884094700\">Thank you for the advice about being careful when saying things are proven to be harmful.  I have understood artificial blue and red food dyes to have long term health consequences (i.e. reproductive) which wouldn&#39;t be noticed immediately so I&#39;m concerned about simply letting my children only focus on what it immediate consequences like feeling bad.<br/>\n<br/>\nMost of the time my one child in particular will tell me about a comment after we go home.  I almost feel like I will have to tell each person that I&#39;m o.k. with having my children make their own choices, but I am hesitant to do so.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food police","postDate":"1297441212","msgId":46103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqM25qcysyaDJoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpdmtqMitla2ZkQGVHcm91cHMuY29tPg=="},"prevInTopic":46102,"nextInTopic":46112,"prevInTime":46102,"nextInTime":46104,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"... Honestly, first I d look around and see if any of the adults do the same thing! Certainly at a potluck I d expect some people to pig out a little on","messageBody":"<div id=\"ygrps-yiv-242490578\">&quot;lalow&quot; &lt;lalow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I think sometimes the issue is also helping kids learn to be respectful of others and realize that the food is there to share, for example, my son perhaps shouldnt have 4 deviled eggs when whoever brought them only brought a dozen to share amongst 2 dozen people.  That would be rude.  How do you help them do this and also refrain from being &quot;Food Police&quot;?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Honestly, first I&#39;d look around and see if any of the adults do the same thing! Certainly at a potluck I&#39;d expect some people to &quot;pig out&quot; a little on favorite foods. If there *are* specific rules at the parties you attend, its better to find a way to articulate them clearly - and &quot;don&#39;t take too much&quot; isn&#39;t very clear. What&#39;s too much? Four eggs out of a dozen doesn&#39;t look like much. And what if nothing else is appealing? <br/>\n<br/>\nRather than the etiquette of taking &quot;too much&quot;, it might be better to make a special comment to whomever brought the eggs about how much your guy appreciated them! <br/>\n<br/>\nIf I&#39;m going to a potluck, I make sure to bring foods my kids like and/or make sure they eat beforehand. Going to a friend&#39;s for dinner - or a restaurant - I always made sure Mo, in particular, ate beforehand *and* brought enticing snacks in case there were no foods she would want or there was a long wait for food. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food police","postDate":"1297440633","msgId":46102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqM24xcCt0MzYwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpdjRvYysydTluQGVHcm91cHMuY29tPg=="},"prevInTopic":46093,"nextInTopic":46103,"prevInTime":46101,"nextInTime":46103,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"... **************** I say things like its okay with me or we don t have that rule or even she ate earlier, so its okay... without bothering to define","messageBody":"<div id=\"ygrps-yiv-1366402291\">&quot;jenellerainforest1&quot; &lt;jenellerainforest1@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;However, these people are assuming that they should food police my children or ask if I approve of my childrens&#39; choices.  In addition, their children are constantly &quot;correcting&quot; my children.  I would love advice on how to handle this situation.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI say things like &quot;its okay with me&quot; or &quot;we don&#39;t have that rule&quot; or even &quot;she ate earlier, so its okay...&quot; without bothering to define &quot;earlier&quot;. With Mo, I&#39;ll also let my relatives, in particular, know that I&#39;m happy seeing her eat anything at all - when we go out or have company, she&#39;s more likely to forget to eat or be too stressed to eat, so a piece of cake is better than nothing at all. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food police","postDate":"1297345999","msgId":46093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1ODA4QTFCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":46092,"nextInTopic":46102,"prevInTime":46092,"nextInTime":46094,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"I usually check out the situation and cue DS in to things quietly off to the side. I might look over a buffet table and say something like let s start out","messageBody":"<div id=\"ygrps-yiv-1493199258\">I usually check out the situation and cue DS in to things quietly off to<br/>\nthe side. I might look over a buffet table and say something like &quot;let&#39;s<br/>\nstart out with just two devilled eggs to make sure everyone who wants<br/>\nsome gets some. If there are some left, then we can get seconds.&quot; I<br/>\nleave other kids&#39; behavior to their parents (unless it is immediately<br/>\nhazardous to them or someone else - like trying to push smaller kids<br/>\nnear a stairway).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food police","postDate":"1297345871","msgId":46092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1ODA4QTFBQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":46091,"nextInTopic":46093,"prevInTime":46091,"nextInTime":46093,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"... eat although I do occasionally give them information about what is in certain items like artificial dyes which have been proven to be bad for people.","messageBody":"<div id=\"ygrps-yiv-2019384423\"><blockquote><span title=\"ireply\">&gt;I have backed off telling my children what and when to<br/>\n </span></blockquote>eat although I do occasionally give them information about what is in<br/>\ncertain items like artificial dyes which have &gt;been proven to be bad for<br/>\npeople. However, I always make it clear that the choice is theirs. I<br/>\ntell them I want them to learn individually what their body needs.<br/>\n\t\t&quot;proven&quot; in what circumstances and for which people? For<br/>\nyou? Your kids? Your mom? &quot;everybody knows&quot;? By telling them things like<br/>\n&quot;this has been proven to be dangerous but go ahead if you want&quot; you&#39;re<br/>\nsending really mixed signals and judgments.  Certainly food additives<br/>\nand such have been shown to correlate to problems for some people in<br/>\nsome circumstances - there are those that are clinically allergic to red<br/>\ndye (for example), there are those that are affected by red dye, and<br/>\nthere are those who can eat foods with red dye for 90 years without<br/>\nhaving any ill effects (and all sorts of shadings in between these). For<br/>\ninstance, I can eat cookies and cakes made with eggs no problem (yum!)<br/>\nbut I cannot eat an omelette or scrambled eggs without gastrointestinal<br/>\n&#39;distress&#39;. How each individual responds to a given thing is way more<br/>\nnuanced than the black & white good/bad judgment of &quot;it&#39;s been proven to<br/>\nbe bad for people&quot;. If you *choose* not to purchase or eat certain<br/>\nthings, certainly explain that to them &quot;I prefer not to eat this because<br/>\nI feel funny when I do; because there is some information that concerns<br/>\nme about the chemicals in them; etc&quot; <br/>\n\t\tProviding information that&#39;s useful is &quot;Let&#39;s check the<br/>\ningredients on this because you told me that last time you had something<br/>\nwit hydrogenated oil in it, your tummy felt funny and we can try to<br/>\navoid that.&quot; Or &quot;Let&#39;s get this brand instead of that brand because<br/>\nthere&#39;s less salt added which is better for Daddy&#39;s blood pressure&quot; or<br/>\nwhatever the real life information is. We talk about nutrition often at<br/>\nour house (I was diagnosed with type 2 diabetes about 5 years ago and<br/>\nhubby deals with hypertension and hypercholesteremia) and about how<br/>\nfoods feel to us - there are some things that DH and DS can eat that I<br/>\ncan&#39;t (see the egg example above); there are some foods we all choose to<br/>\navoid most of the time but may have on occasion (for instance, when we<br/>\nare a guest in someone&#39;s house, we&#39;re not going to say &quot;no way am I<br/>\neating that pie made with shortening&quot; but we might politely take just a<br/>\nsmall piece).<br/>\n<blockquote><span title=\"ireply\"> \t\t&gt;Well, I don&#39;t like to &quot;interfere&quot; with these families<br/>\n </span></blockquote>way of parenting and so wouldn&#39;t say anything unless questioned - in<br/>\nwhich case I would love to share my ideas. &gt;However, these people are<br/>\nassuming that they should food police my children or ask if I approve of<br/>\nmy childrens&#39; choices. In addition, their children are constantly<br/>\n<blockquote><span title=\"ireply\"> &gt;&quot;correcting&quot; my children. I would love advice on how to handle this<br/>\n </span></blockquote>situation.<br/>\n\t\tIf you&#39;re right there, simply say &quot;no problem, it&#39;s fine<br/>\nfor Susie and Bobby to have that&quot;. It&#39;s your role to step in and assist<br/>\nyour kids, especially when other adults are using their power position<br/>\n(or trying to) to control things. Maybe even let them know that if<br/>\nsomeone is correcting them, they can say &quot;hey Mom, Jimmy says I<br/>\nshouldn&#39;t eat this. Is it okay?&quot; to which you smilingly reply &quot;Sure -<br/>\nhey can I have one?&quot; or &quot;Thanks for the info Jimmy, I&#39;ll go check with<br/>\nmy mom.&quot; And they can come ask you (and you&#39;ll say &quot;okay&quot;). <br/>\n\t\t<br/>\n\t\t--Deb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow","from":"&quot;lalow&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food police","postDate":"1297307042","msgId":46091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdmtqMitla2ZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3OTQ3OC40Mjg4Mi5xbUB3ZWIxMTIwMTQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":46090,"nextInTopic":46092,"prevInTime":46090,"nextInTime":46092,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"I think sometimes the issue is also helping kids learn to be respectful of others and realize that the food is there to share, for example, my son perhaps","messageBody":"<div id=\"ygrps-yiv-721757263\">I think sometimes the issue is also helping kids learn to be respectful of others and realize that the food is there to share, for example, my son perhaps shouldnt have 4 deviled eggs when whoever brought them only brought a dozen to share amongst 2 dozen people.  That would be rude.  How do you help them do this and also refrain from being &quot;Food Police&quot;?</div>","specialLinks":[]},{"userId":248233800,"authorName":"Alix deBohun","from":"Alix deBohun &lt;czarena_unrest@...&gt;","profile":"czarena_unrest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Food police","postDate":"1297293573","msgId":46090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3OTQ3OC40Mjg4Mi5xbUB3ZWIxMTIwMTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGlpdjRvYysydTluQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdjRvYysydTluQGVHcm91cHMuY29tPg=="},"prevInTopic":46089,"nextInTopic":46091,"prevInTime":46089,"nextInTime":46091,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"Rather than get into philosophical discussions with people that I know are not currently receptive,  I simply state  knows what he can eat . I do ","messageBody":"<div id=\"ygrps-yiv-800799334\">Rather than get into philosophical discussions with people that I know are not <br/>\ncurrently receptive,  I simply state &quot;&lt;kids name&gt; knows what he can eat&quot;. I do <br/>\nthis when a parent or child says something to me or to my child. I&#39;ve <br/>\ninterjected it when it&#39;s directed to my children and they are just looking <br/>\ndumbfounded at the person.  &quot;Thank you for your concern, but today I&#39;m not <br/>\nworrying about it&quot; can work to - repeatedly, indefinitely... everyday you aren&#39;t <br/>\nworrying about it :) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: jenellerainforest1 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenellerainforest1@...\">jenellerainforest1@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wed, February 9, 2011 2:33:48 PM<br/>\nSubject: [unschoolingbasics] Food police<br/>\n<br/>\n  <br/>\nHi everyone,<br/>\n<br/>\nI have backed off telling my children what and when to eat although I do <br/>\noccasionally give them information about what is in certain items like <br/>\nartificial dyes which have been proven to be bad for people.  However, I always <br/>\nmake it clear that the choice is theirs.  I tell them I want them to learn <br/>\nindividually what their body needs.<br/>\n<br/>\nMy family gets together weekly with others and one thing we do together is eat.  <br/>\nI&#39;ve noticed what I call &quot;food police&quot; happening all around us at these <br/>\ngatherings.  Parents are after their children for not finishing their plates, <br/>\ntaking too many deserts,etc. Children are &quot;correcting&quot; other children and even <br/>\npointing out when they themselves are making &quot;inappropriate&quot; food choices.<br/>\n<br/>\nWell, I don&#39;t like to &quot;interfere&quot; with these families way of parenting and so <br/>\nwouldn&#39;t say anything unless questioned - in which case I would love to share my <br/>\nideas.  However, these people are assuming that they should food police my <br/>\nchildren or ask if I approve of my childrens&#39; choices.  In addition, their <br/>\nchildren are constantly &quot;correcting&quot; my children.  I would love advice on how to <br/>\nhandle this situation.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":365958730,"authorName":"jenellerainforest1","from":"&quot;jenellerainforest1&quot; &lt;jenellerainforest1@...&gt;","profile":"jenellerainforest1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Food police","postDate":"1297290828","msgId":46089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdjRvYysydTluQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46090,"prevInTime":46088,"nextInTime":46090,"topicId":46089,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I have backed off telling my children what and when to eat although I do occasionally give them information about what is in certain items like","messageBody":"<div id=\"ygrps-yiv-1766335353\">Hi everyone,<br/>\n<br/>\nI have backed off telling my children what and when to eat although I do occasionally give them information about what is in certain items like artificial dyes which have been proven to be bad for people.  However, I always make it clear that the choice is theirs.  I tell them I want them to learn individually what their body needs.<br/>\n<br/>\nMy family gets together weekly with others and one thing we do together is eat.  I&#39;ve noticed what I call &quot;food police&quot; happening all around us at these gatherings.  Parents are after their children for not finishing their plates, taking too many deserts,etc. Children are &quot;correcting&quot; other children and even pointing out when they themselves are making &quot;inappropriate&quot; food choices.<br/>\n<br/>\nWell, I don&#39;t like to &quot;interfere&quot; with these families way of parenting and so wouldn&#39;t say anything unless questioned - in which case I would love to share my ideas.  However, these people are assuming that they should food police my children or ask if I approve of my childrens&#39; choices.  In addition, their children are constantly &quot;correcting&quot; my children.  I would love advice on how to handle this situation.</div>","specialLinks":[]}],"prevTopicId":46035,"nextTopicId":46120}}