{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New to unschooling","postDate":"1294251739","msgId":45774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlnMmNzcis1bXBjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlnMjYxbitiajloQGVHcm91cHMuY29tPg=="},"prevInTopic":45773,"nextInTopic":0,"prevInTime":45773,"nextInTime":45775,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"... *************** There s a great list of things that help learning here: http://sandradodd.com/pam/principles That whole site is marvelous, actually, for","messageBody":"<div id=\"ygrps-yiv-542564012\">&quot;Tanya P&quot; &lt;tanyaholic@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I started out with a really stringent curriculum. As time is passing i realize that they are learning best by spending the amount of time they want to spend on doing the work.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThere&#39;s a great list of things that help learning here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pam/principles\">http://sandradodd.com/pam/principles</a><br/>\n<br/>\nThat whole site is marvelous, actually, for learning about unschooling, as it this one:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nAnd here you&#39;ll find links to a bunch of essays and blogs by unschoolers (kids and parents):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://enjoylifeunschooling.com/\">http://enjoylifeunschooling.com/</a><br/>\n<br/>\nUnschooling doesn&#39;t need any kind of &quot;work&quot; at all, if by that you mean pursuing subjects. Everything kids need to know they can learn organically - which is a pretty intimidating thought if you consider how much time kids spend in school, but most of that school time is spent doing very little, as I think you&#39;ve already discovered. I invite you to check out those sites, read about some unschooling days and lives and get a sense of how its possible to live with your family without ever dividing life up into &quot;work&quot; and &quot;play&quot; - no &quot;teachable moments&quot; or lessons of any kind! Its an amazing way to live... but it can take some time to wrap your mind around the idea that learning doesn&#39;t require teaching and that you can be your kids&#39; partner and friend rather than teacher and leader. <br/>\n<br/>\nFeel free to ask questions or browse through the archives - and please check out those sites, there&#39;s tooooonnnnss of information to dig into. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":473204044,"authorName":"Tanya P","from":"&quot;Tanya P&quot; &lt;tanyaholic@...&gt;","profile":"tanya_phelps","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New to unschooling","postDate":"1294244727","msgId":45773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlnMjYxbitiajloQGVHcm91cHMuY29tPg=="},"prevInTopic":43275,"nextInTopic":45774,"prevInTime":45772,"nextInTime":45774,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"I am so happy. I have been homeschooling my kids this year. They are 7 and 5 and I am expecting soon. I decided that school was causing more heartache and","messageBody":"<div id=\"ygrps-yiv-1970908917\">I am so happy. I have been homeschooling my kids this year. They are 7 and 5 and I am expecting soon. I decided that school was causing more heartache and problems within our family than anything.<br/>\n<br/>\nMy son learned to read and type from trying to find and watch spiderman and sonic the hedgehog videos on the computer when he was only a toddler. He is very fast and has his own incentives to read. Especially now that he has some playstation games that have storylines and missions that he has to read to be able to play farther.<br/>\n<br/>\nI just bought my daughter a V-reader and for the first time she has started to show real recognition of letters and numbers. Before she just had no interest in reading and it seemed like nothing was sinking in.<br/>\n<br/>\nThe school would just send home gigantic packets of things for the kids to do every day. I was overwhelmed. I couldnt understand how going to school for 8 hours a day they were sending home stuff for them to do. I told the school &quot;my kids are young. They need time to play and be with their families and eat and just be kids. They can&#39;t be just working and doing assignments all the time. There are plenty of adults who have a hard time focusing on an entire work day. We don&#39;t usually expect them to come home and spend home time doing work.&quot; I started to feel so far away from the kids.<br/>\n<br/>\nSince they have been home with me I have doubted myself. Wondering if I am hurting their educational chances by having them learn at home. I started out with a really stringent curriculum. As time is passing i realize that they are learning best by spending the amount of time they want to spend on doing the work. Not just endlessly filling out worksheets.<br/>\n<br/>\nI am really glad that I stumbled across this group and &quot;unschooling&quot; philosophy. It really feels good to have other parents with similar ideas about life and kids, who are living those ideals and sticking by their beliefs. This also seems like a great place to ask questions about parenting, teaching, and discipline without being judged for not imposing societal norms on my young, growing, happy family.  Thanks for having such a group! I look forward to talking to some of the other unschooling parents out there!</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to unschooling","postDate":"1267641891","msgId":43275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtbWFuMys2cmhxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhtbGlkbCszN2xhQGVHcm91cHMuY29tPg=="},"prevInTopic":43274,"nextInTopic":45773,"prevInTime":43274,"nextInTime":43276,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Something else to consider, if you re new to unschooling is that school and even school at home can really interfer with a kid s natural ability to","messageBody":"<div id=\"ygrps-yiv-1473766902\">Something else to consider, if you&#39;re new to unschooling is that school and even school at home can really interfer with a kid&#39;s natural ability to self-motivate. It comes back! but it does take some time. Its a good idea for parents to use that time to learn more about natural learning, because, as Schuyler said, it doesn&#39;t look like schoolish learning. Its good to be able to *see* that motivation happen when it does, to realize that a kid who is staying up half the night to beat a game as a highly motivated person, rather than more &quot;doing nothing&quot;. <br/>\n<br/>\nADHD can mean a lot of things - is there something in particular you&#39;re worried about? Is it that he bops from game to toy to show and doesn&#39;t seem to settle? That&#39;s the sort of thing that could be a good trait, if its something he&#39;s doing happily. Not every person needs to sit and focus to get things done. If its the sort of thing that bothers him, if he wants to focus but can&#39;t (and I mean He wants to focus, not that he&#39;s been told he Should want to focus, if you see what I mean) that&#39;s a different matter. <br/>\n<br/>\nSix is young. Its not uncommon for kids not to be reading until 8, or even older. Reading is a complex thing, and &quot;clicks&quot; for kids at different stages of development - some not until early adolescence! And really, its not vital for a young child to read. My 8yo read early, but mostly doesn&#39;t read. Its not something she enjoys. That could change as she gets older, but it doesn&#39;t have to. Not everyone has to read for pleasure in the same way that not everyone has to love to cook!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New to unschooling","postDate":"1267628633","msgId":43274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4MTQ4NS44MTQxNy5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhtbGlkbCszN2xhQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtbGlkbCszN2xhQGVHcm91cHMuY29tPg=="},"prevInTopic":43272,"nextInTopic":43275,"prevInTime":43273,"nextInTime":43275,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"It s easy to see other people s choices as idleness. My son, Simon, he plays a lot of video games, he hangs out and chats with friends on-line, he watches lots","messageBody":"<div id=\"ygrps-yiv-1284962668\">It&#39;s easy to see other people&#39;s choices as idleness. My son, Simon, he plays a lot of video games, he hangs out and chats with friends on-line, he watches lots of youtube videos and lots of movies. It doesn&#39;t look like anything educational could be going on, or that he has any motivation. But if you looked longer, if you hung out with him, if you listened as he talked about so many things, he is very well-educated, his life is producing a very enaged and engaging young man. <br/>\n<br/>\nAt 6 there is very little need to read or write. Linnaea, my daughter, was reading by 6, but my son didn&#39;t read until he was 12. There was no lack of learning in his life because of him not reading. He learned all the time. Linnaea&#39;s learning wasn&#39;t any greater than Simon&#39;s because of her reading. Reading is this wonderful thing for teachers to have their students do. It means that they can better manage a classroom of 20 to 30 students, they can give them a reading assignment. In real life, in a life with closer to one-on-one communication, reading is only one of many, many ways to get information. And reading is slower and less tailored to an individual than conversation is, then going to the grocery store can be, then playing a game like Runescape or World of Warcraft or Halo can be. <br/>\n<br/>\nLook for the learning where they are and in what they are doing. Sit and watch what they do. There are some good deconstructions of activities into educationese at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum.html,\">http://sandradodd.com/unschoolingcurriculum.html,</a> in the pink/purple box on the side there are links to others. There is a lovely view of a day from two approaches at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/ginnyday.html.\">http://sandradodd.com/unschool/ginnyday.html.</a> Maybe those will help you see more of what is going on. <br/>\n<br/>\nSchool is a deconstruction of a life. Without school you get to keep it all whole and learn all the time without having to pigeonhole experiences into subjects or learning outcomes. Reading isn&#39;t separated from math or social studies or science or recess or whatever else, it all is, all together. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\nHey there,My name is Sally. I have 3 children,14,10,and 6. My oldest just does not seem to have his &quot;own&quot; motivation. My 10 year old is ADHD and I think maybe dislexic. My little one just DOES NOT want to read or write. I&#39;m willing to let them take things at their own pace, but I get worried bc I don&#39;t see them interested in anything. They are under an umbrella but I don&#39;t have anything to report. I guess I&#39;m worried about their seeming lack of ambition along with the consequences of them not &quot;doing&quot; anything, academically. <br/>\n<br/>\n<br/>\n<br/>\n-<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337053754,"authorName":"witchywoman345","from":"&quot;witchywoman345&quot; &lt;witchywoman345@...&gt;","profile":"witchywoman345","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New to unschooling","postDate":"1267617013","msgId":43272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtbGlkbCszN2xhQGVHcm91cHMuY29tPg=="},"prevInTopic":38213,"nextInTopic":43274,"prevInTime":43271,"nextInTime":43273,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Hey there,My name is Sally. I have 3 children,14,10,and 6. My oldest just does not seem to have his own motivation. My 10 year old is ADHD and I think maybe","messageBody":"<div id=\"ygrps-yiv-578247623\">Hey there,My name is Sally. I have 3 children,14,10,and 6. My oldest just does not seem to have his &quot;own&quot; motivation. My 10 year old is ADHD and I think maybe dislexic. My little one just DOES NOT want to read or write. I&#39;m willing to let them take things at their own pace, but I get worried bc I don&#39;t see them interested in anything. They are under an umbrella but I don&#39;t have anything to report. I guess I&#39;m worried about their seeming lack of ambition along with the consequences of them not &quot;doing&quot; anything, academically.</div>","specialLinks":[]},{"userId":341424269,"authorName":"aenclade","from":"&quot;aenclade&quot; &lt;aenclade@...&gt;","profile":"aenclade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New to unschooling","postDate":"1233777507","msgId":38213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdtY3MxMytpamVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdtYWJsdis0MHRvQGVHcm91cHMuY29tPg=="},"prevInTopic":38186,"nextInTopic":43272,"prevInTime":38212,"nextInTime":38214,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Hi Ingrid We have an unschooling park day in Santa Monica on Friday afternoons. The age range seems to be birth -13 years old. We are new too...finding our way","messageBody":"<div id=\"ygrps-yiv-156205807\">Hi Ingrid<br/>\n<br/>\nWe have an unschooling park day in Santa Monica on Friday afternoons.<br/>\nThe age range seems to be birth -13 years old. We are new<br/>\ntoo...finding our way slowly but surely...lots of ups and downs. Come<br/>\ncheck it out!!<br/>\nemail me if you want info.I am very interested in getting a park day<br/>\ngoing in the middle of town somewhere where families from all over the<br/>\nLA area could meet. Hopefully we can meet soon!<br/>\n<br/>\nAmanda<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Amanda@...\">Amanda@...</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;ingwafer&quot; &lt;ingwafer@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all! Brand new to unschooling. Pulled 7 year old out of school a <br/>\n&gt; fter the XMAS break. Love the site and would love to meet other LA <br/>\n&gt; area unschooling families. Live in the West Adams area just north of <br/>\n&gt; downtown not far from USC. <br/>\n&gt; Also would love any input on how long it took your children to lose <br/>\n&gt; the fascination for watching tv/video/computer when they first <br/>\n&gt; deschooled. I know in my heart that he is fine. But just would love to <br/>\n&gt; get some since when he is going to step away from the screen and come <br/>\n&gt; to me and ask what I am up to- or that he&#39;d like to play a game or <br/>\n&gt; read with me. Right now he is just prefering alone time- reading, tv, <br/>\n&gt; computer, video or off course playdates with friends enroll him. <br/>\n&gt; <br/>\n&gt; Welcome all thoughts.<br/>\n&gt; Thanks,<br/>\n&gt; Ingrid<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New to unschooling","postDate":"1233757873","msgId":38186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyODU2NC40NTc0MC5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGdtYWJsdis0MHRvQGVHcm91cHMuY29tPg=="},"prevInTopic":38183,"nextInTopic":38213,"prevInTime":38185,"nextInTime":38187,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Sometimes the joy of the television and video games and computer exploration never goes away. I love cruising the internet for information and ideas and","messageBody":"<div id=\"ygrps-yiv-1307300116\">Sometimes the joy of the television and video games and computer exploration never goes away. I love cruising the internet for information and ideas and stories. What has helped instead of looking for the point when Simon or Linnaea come to me is for me to go to them. I play Halo 3 with them and Fable 2 and watch Let&#39;s Play episodes on Youtube with them. I find stuff that I think they&#39;ll like and share it with them, stuff both on television or the internet or games for whatever as well as things outside of those technologies. Enjoy the television with him. You come to him and ask if you could watch him play or watch the show with him or sit with him. Be the active seeker. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: ingwafer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ingwafer@...\">ingwafer@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, 3 February, 2009 9:07:11 PM<br/>\nSubject: [unschoolingbasics] New to unschooling<br/>\n<br/>\nHi all! Brand new to unschooling. Pulled 7 year old out of school a <br/>\nfter the XMAS break. Love the site and would love to meet other LA <br/>\narea unschooling families. Live in the West Adams area just north of <br/>\ndowntown not far from USC. <br/>\nAlso would love any input on how long it took your children to lose <br/>\nthe fascination for watching tv/video/computer when they first <br/>\ndeschooled. I know in my heart that he is fine. But just would love to <br/>\nget some since when he is going to step away from the screen and come <br/>\nto me and ask what I am up to- or that he&#39;d like to play a game or <br/>\nread with me. Right now he is just prefering alone time- reading, tv, <br/>\ncomputer, video or off course playdates with friends enroll him. <br/>\n<br/>\nWelcome all thoughts.<br/>\nThanks,<br/>\nIngrid<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":147008340,"authorName":"ingwafer","from":"&quot;ingwafer&quot; &lt;ingwafer@...&gt;","profile":"ingwafer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"New to unschooling","postDate":"1233695231","msgId":38183,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdtYWJsdis0MHRvQGVHcm91cHMuY29tPg=="},"prevInTopic":18898,"nextInTopic":38186,"prevInTime":38182,"nextInTime":38184,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Hi all! Brand new to unschooling. Pulled 7 year old out of school a fter the XMAS break. Love the site and would love to meet other LA area unschooling","messageBody":"<div id=\"ygrps-yiv-67393373\">Hi all! Brand new to unschooling. Pulled 7 year old out of school a <br/>\nfter the XMAS break. Love the site and would love to meet other LA <br/>\narea unschooling families. Live in the West Adams area just north of <br/>\ndowntown not far from USC. <br/>\nAlso would love any input on how long it took your children to lose <br/>\nthe fascination for watching tv/video/computer when they first <br/>\ndeschooled. I know in my heart that he is fine. But just would love to <br/>\nget some since when he is going to step away from the screen and come <br/>\nto me and ask what I am up to- or that he&#39;d like to play a game or <br/>\nread with me. Right now he is just prefering alone time- reading, tv, <br/>\ncomputer, video or off course playdates with friends enroll him. <br/>\n<br/>\nWelcome all thoughts.<br/>\nThanks,<br/>\nIngrid</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: New to unschooling","postDate":"1163515753","msgId":18898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOEQ2MTMyRjNBNzdCRi01MkMtNTZFOEBNQkxLLU0wNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGVqMmZ2ZStubzc0QGVHcm91cHMuY29tPg=="},"prevInTopic":18834,"nextInTopic":38183,"prevInTime":18897,"nextInTime":18899,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"... From: link8131@sbcglobal.net We are only just beginning (this week!!!) and it is hard to know how much, if any, structure to impose.  Any input from","messageBody":"<div id=\"ygrps-yiv-866877420\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:link8131@...\">link8131@...</a><br/>\n<br/>\nWe are only just beginning (this week!!!) and it is hard to know how <br/>\nmuch, if any, structure to<br/>\nimpose.  Any input from unschoolers with teens would be very welcome!!!<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nNone. Let her heal. She needs time and patience and your trust and <br/>\nrespect.<br/>\n<br/>\nWhere do you live? Finding some other unschooled teens would be good. <br/>\nAlso hooking her up with adults with her same interests---like working <br/>\nparttime at the healthfood store or somewhere she&#39;d feel at home.<br/>\n<br/>\nHave you looked into Not Back to School Camp (www.NBTSC.com   I think)? <br/>\nShe&#39;d fit right in.<br/>\n<br/>\nLive as if school didn&#39;t exist---go, do, be.<br/>\n<br/>\nEnjoy each other. Play games. Watch movies. Play with your food.<br/>\n<br/>\nHave fun!<br/>\n<br/>\n~Kelly<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: New to unschooling","postDate":"1163188853","msgId":18832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCRTk4MkM3LTA2MjktNDgyNS1BMTY2LUEwMTdERDQyMzIxMkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGVqMmZ2ZStubzc0QGVHcm91cHMuY29tPg==","referencesHeader":"PGVqMmZ2ZStubzc0QGVHcm91cHMuY29tPg=="},"prevInTopic":18830,"nextInTopic":18833,"prevInTime":18831,"nextInTime":18833,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"... She sounds absolutely delightful. Your story is heartbreaking - that such an amazing, wonderful girl, so filled with great spirit and sensitivity, should","messageBody":"<div id=\"ygrps-yiv-179956634\">On Nov 10, 2006, at 10:21 AM, abcrewchief wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  We are only just<br/>\n&gt; beginning (this week!!!) and it is hard to know how much, if any,  <br/>\n&gt; structure to impose.  Any<br/>\n&gt; input from unschoolers with teens would be very welcome!!!<br/>\n<br/>\n </span></blockquote>She sounds absolutely delightful. Your story is heartbreaking - that  <br/>\nsuch an amazing, wonderful girl, so filled with great spirit and  <br/>\nsensitivity, should have been made to feel bad about herself. Get her  <br/>\na copy of &quot;The Teenage Liberation Handbook&quot; immediately - at least  <br/>\nshe&#39;ll get the message, loud and clear, that it isn&#39;t &quot;her,&quot; but the  <br/>\nsystem itself that is the problem.<br/>\n<br/>\nDon&#39;t impose ANY structure on her. Support her. Be calm and happy  <br/>\nwith her. Smile a lot! Hug a lot. This might just be the very best  <br/>\nweek/month/year you and she have ever experienced!!<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":228790629,"authorName":"abcrewchief","from":"&quot;abcrewchief&quot; &lt;link8131@...&gt;","profile":"abcrewchief","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to unschooling","postDate":"1163188793","msgId":18834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVqMmxucCtzYjVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGMzNjg2YWFiNDNlYzllMjdmMWQzZDVhNmI2YTZjOTRiQHNvY2tldC5uZXQ+"},"prevInTopic":18833,"nextInTopic":18898,"prevInTime":18833,"nextInTime":18835,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Thanks for the reassurance...and the resources!  Funny thing, Teenage Liberation Handbook will be arriving in the mail from Amazon today.  And I will look","messageBody":"<div id=\"ygrps-yiv-1935043868\">Thanks for the reassurance...and the resources!  Funny thing, &quot;Teenage Liberation <br/>\nHandbook&quot; will be arriving in the mail from Amazon today.  And I will look into the others <br/>\nthat you mention.  I am excited about this, but, more importantly, my daughter is excited <br/>\nabout learning for the first time in so very long.  I feel as though there was a huge stress <br/>\nballoon consuming all of the air in our home, and we just popped it!  Thanks again...<br/>\nAlene<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Linda Green &lt;lindamgreen@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; What would you do if this was summer vacation from school?   Maybe <br/>\n&gt; that&#39;s what you should be doing?  What if you toss your worries out and <br/>\n&gt; let her just be and just detox for a while?    It might be helpful <br/>\n&gt; yourself to read Llewellyn&#39;s &quot;  &quot;Teenage Liberation Handbook?&quot; or <br/>\n&gt; google her &quot;Not Back to School Camp&quot;, or look into the Sudbury School&#39;s <br/>\n&gt; philosophy for ideas at sudval.org or read John Taylor Gatto&#39;s books?   <br/>\n&gt; Maybe after a few months of rest and renewal for you both, you could <br/>\n&gt; together begin to think about what questions you and she together <br/>\n&gt; should be asking?   If you take the attitude that you won&#39;t impose <br/>\n&gt; anything unless and until you have it well thought out and know very <br/>\n&gt; well what you are doing and why, I suspect it is likely that you will <br/>\n&gt; find no imposition will ever be needed.        Linda<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":153118561,"authorName":"airokat@comcast.net","from":"airokat@...","profile":"dawakat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: New to unschooling","postDate":"1163188433","msgId":18833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMTAyMDA2MTk1My4yOTMyLjQ1NTREOEQxMDAwOTlFREEwMDAwMEI3NDIyMDA3NjE0Mzg5QjBFMDUwMTlEMDcwRUBjb21jYXN0Lm5ldD4="},"prevInTopic":18832,"nextInTopic":18834,"prevInTime":18832,"nextInTime":18834,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Alene, My daughter is also new to unschooling. She opted out of the ninth grade after hating school all her life. (long story) I am not imposing any structure","messageBody":"<div id=\"ygrps-yiv-984281126\">Alene,<br/>\n<br/>\nMy daughter is also new to unschooling. She opted out of the ninth grade after hating school all her life. (long story) I am not imposing any structure on her at all. She sleeps past noon, watches all the TV she can stand, and spends time on the computer emailing and IMing. She also reads books and takes a guitar lesson once a week and has a community college class in digital photography. She is much happier, although she laments the loss of community she had in school. It was easier to find and make friends for her at school and she is very sociable. It seems harder to meet unschooled teenagers. Despite that, she still has no desire to go back to school. Her problem with school was the imposed structure and the meaninglessness of the work. Since she has been out of school, she has become more of her old self, singing silly songs and leaping around, stuff she hasnt done since she was 10 or 11. She also carries on lengthy conversations with me about interesting topics when it seemed<br/>\n like all we used to do was fight over things. I realize now how stressful school made our lives and the impact it had on our relationship. <br/>\nKathryn (in CA)<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;abcrewchief&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:link8131@...\">link8131@...</a>&gt; <br/>\nOkay, this is helping me, too. I am also new to unschooling, as I have a very bright 16 <br/>\nyear old daughter who has struggled with depression and attendance issues at our local <br/>\nhigh school. Although they tried everything to help her there, including shortening her <br/>\nschedule and giving her a resource teacher, it didn&#39;t work, and they were recommending <br/>\nwe place her in a therapeutic school. She would struggle to get to school in the morning <br/>\n(and often not make it), then come home and sleep all afternoon until dinner, and then <br/>\nshe would be okay for a couple hours, until the anxiety about facing school the next day <br/>\nsurfaced. And she couldn&#39;t bring herself to do the work (before high school, she was a <br/>\nstraight A student).<br/>\n<br/>\nBut this same daughter goes to the library, comes home with an armful of books she <br/>\nselected, and is happy reading for days and days, until she is ready for another trip to <br/>\nthe library. She also writes constantly, goes on photographic &quot;adventures,&quot; sketches and <br/>\npaints. She is a vegan, and only buys fair trade food and clothes, or thrift clothes. And <br/>\nshe has many kind close, drug-free friends.<br/>\n<br/>\nAfter over 2 years of this incredibly draining struggle with school, it finally dawned on me <br/>\nthat just because she didn&#39;t fit into the box of what our society deems an acceptable way <br/>\nto learn, she was being told there was something wrong with her, and she needed a <br/>\ntherapeutic educational environment. I decided to stop forcing her to focus on what she <br/>\ncouldn&#39;t do, and let her focus on what she could do, and loved to do. We are only just <br/>\nbeginning (this week!!!) and it is hard to know how much, if any, structure to impose. Any <br/>\ninput from unschoolers with teens would be very welcome!!!<br/>\n<br/>\nThanks...Alene <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":245967711,"authorName":"Linda Green","from":"Linda Green &lt;lindamgreen@...&gt;","profile":"whisperingoaks2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Re: New to unschooling","postDate":"1163184944","msgId":18830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzNjg2YWFiNDNlYzllMjdmMWQzZDVhNmI2YTZjOTRiQHNvY2tldC5uZXQ+","inReplyToHeader":"PGVqMmZ2ZStubzc0QGVHcm91cHMuY29tPg==","referencesHeader":"PGVqMmZ2ZStubzc0QGVHcm91cHMuY29tPg=="},"prevInTopic":18829,"nextInTopic":18832,"prevInTime":18829,"nextInTime":18831,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"What would you do if this was summer vacation from school?   Maybe that s what you should be doing?  What if you toss your worries out and let her just be and","messageBody":"<div id=\"ygrps-yiv-1061438640\">What would you do if this was summer vacation from school?   Maybe <br/>\nthat&#39;s what you should be doing?  What if you toss your worries out and <br/>\nlet her just be and just detox for a while?    It might be helpful <br/>\nyourself to read Llewellyn&#39;s &quot;  &quot;Teenage Liberation Handbook?&quot; or <br/>\ngoogle her &quot;Not Back to School Camp&quot;, or look into the Sudbury School&#39;s <br/>\nphilosophy for ideas at sudval.org or read John Taylor Gatto&#39;s books?   <br/>\nMaybe after a few months of rest and renewal for you both, you could <br/>\ntogether begin to think about what questions you and she together <br/>\nshould be asking?   If you take the attitude that you won&#39;t impose <br/>\nanything unless and until you have it well thought out and know very <br/>\nwell what you are doing and why, I suspect it is likely that you will <br/>\nfind no imposition will ever be needed.        Linda<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 10, 2006, at 12:21 PM, abcrewchief wrote:<br/>\n<br/>\n&gt; Okay, this is helping me, too. I am also new to unschooling, as I have <br/>\n&gt; a very bright 16<br/>\n&gt;  year old daughter who has struggled with depression and attendance <br/>\n&gt; issues at our local<br/>\n&gt;  high school. Although they tried everything to help her there, <br/>\n&gt; including shortening her<br/>\n&gt;  schedule and giving her a resource teacher, it didn&#39;t work, and they <br/>\n&gt; were recommending<br/>\n&gt;  we place her in a therapeutic school. She would struggle to get to <br/>\n&gt; school in the morning<br/>\n&gt;  (and often not make it), then come home and sleep all afternoon until <br/>\n&gt; dinner, and then<br/>\n&gt;  she would be okay for a couple hours, until the anxiety about facing <br/>\n&gt; school the next day<br/>\n&gt;  surfaced. And she couldn&#39;t bring herself to do the work (before high <br/>\n&gt; school, she was a<br/>\n&gt;  straight A student).<br/>\n&gt;<br/>\n&gt;  But this same daughter goes to the library, comes home with an armful <br/>\n&gt; of books she<br/>\n&gt;  selected, and is happy reading for days and days, until she is ready <br/>\n&gt; for another trip to<br/>\n&gt;  the library. She also writes constantly, goes on photographic <br/>\n&gt; &quot;adventures,&quot; sketches and<br/>\n&gt;  paints. She is a vegan, and only buys fair trade food and clothes, or <br/>\n&gt; thrift clothes. And<br/>\n&gt;  she has many kind close, drug-free friends.<br/>\n&gt;<br/>\n&gt;  After over 2 years of this incredibly draining struggle with school, <br/>\n&gt; it finally dawned on me<br/>\n&gt;  that just because she didn&#39;t fit into the box of what our society <br/>\n&gt; deems an acceptable way<br/>\n&gt;  to learn, she was being told there was something wrong with her, and <br/>\n&gt; she needed a<br/>\n&gt;  therapeutic educational environment. I decided to stop forcing her to <br/>\n&gt; focus on what she<br/>\n&gt;  couldn&#39;t do, and let her focus on what she could do, and loved to do. <br/>\n&gt; We are only just<br/>\n&gt;  beginning (this week!!!) and it is hard to know how much, if any, <br/>\n&gt; structure to impose. Any<br/>\n&gt;  input from unschoolers with teens would be very welcome!!!<br/>\n&gt;<br/>\n&gt;  Thanks...Alene<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":228790629,"authorName":"abcrewchief","from":"&quot;abcrewchief&quot; &lt;link8131@...&gt;","profile":"abcrewchief","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to unschooling","postDate":"1163182894","msgId":18829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVqMmZ2ZStubzc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjExMTAwNDU3cjU5OWZmOThibDg5OTM5N2VlODc0M2Y2ZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":18824,"nextInTopic":18830,"prevInTime":18828,"nextInTime":18830,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Okay, this is helping me, too.  I am also new to unschooling, as I have a very bright 16 year old daughter who has struggled with depression and attendance","messageBody":"<div id=\"ygrps-yiv-1554143018\">Okay, this is helping me, too.  I am also new to unschooling, as I have a very bright 16 <br/>\nyear old daughter who has struggled with depression and attendance issues at our local <br/>\nhigh school.  Although they tried everything to help her there, including shortening her <br/>\nschedule and giving her a resource teacher, it didn&#39;t work, and they were recommending <br/>\nwe place her in a therapeutic school.  She would struggle to get to school in the morning <br/>\n(and often not make it), then come home and sleep all afternoon until dinner, and then <br/>\nshe would be okay for a couple hours, until the anxiety about facing school the next day <br/>\nsurfaced.  And she couldn&#39;t bring herself to do the work (before high school, she was a <br/>\nstraight A student).<br/>\n<br/>\nBut this same daughter goes to the library, comes home with an armful of books she <br/>\nselected, and is happy reading for days and days, until she is ready for another trip to <br/>\nthe library.  She also writes constantly, goes on photographic &quot;adventures,&quot; sketches and <br/>\npaints.  She is a vegan, and only buys fair trade food and clothes, or thrift clothes.  And <br/>\nshe has many kind close, drug-free friends.<br/>\n<br/>\nAfter over 2 years of this incredibly draining struggle with school, it finally dawned on me <br/>\nthat just because she didn&#39;t fit into the box of what our society deems an acceptable way <br/>\nto learn, she was being told there was something wrong with her, and she needed a <br/>\ntherapeutic educational environment.  I decided to stop forcing her to focus on what she <br/>\ncouldn&#39;t do, and let her focus on what she could do, and loved to do.  We are only just <br/>\nbeginning (this week!!!) and it is hard to know how much, if any, structure to impose.  Any <br/>\ninput from unschoolers with teens would be very welcome!!!<br/>\n<br/>\nThanks...Alene</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] New to unschooling","postDate":"1163163466","msgId":18824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjExMTAwNDU3cjU5OWZmOThibDg5OTM5N2VlODc0M2Y2ZkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDAxNzEwMWM3MDQ3NyRiMTg0NWU5MCQ5ZjAyYThjMEBzcGFjZXdvbWFuPg==","referencesHeader":"PDAxNzEwMWM3MDQ3NyRiMTg0NWU5MCQ5ZjAyYThjMEBzcGFjZXdvbWFuPg=="},"prevInTopic":18823,"nextInTopic":18829,"prevInTime":18823,"nextInTime":18825,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"... My first question is if you are still also reading traditional homeschool books, magazines and websites.  If so you may want to forgo those until you can","messageBody":"<div id=\"ygrps-yiv-942389434\">On 11/9/06, Jennifer Lindsey &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:veryeasytoremember@...\">veryeasytoremember@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hello!<br/>\n&gt;<br/>\n&gt; But I would always like to know more, especially coming from those who have gone before! I was wondering...would &quot;unschooling&quot; be the same as &quot;interest led learning&quot;?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My first question is if you are still also reading traditional<br/>\nhomeschool books, magazines and websites.  If so you may want to forgo<br/>\nthose until you can look at them with unschooling eyes.  Reading the<br/>\nschoolish material keeps the seeds of school implanted in our brains.<br/>\nThose seeds continually sprout choking us and inhibiting us from<br/>\nblooming in unschooling.  :-)  Consider releasing traditional<br/>\nhomeschooling materaial and immersing yourself in only unschooling<br/>\nuntil you have a solid understanding of what you are doing.<br/>\n<br/>\nUnschooling IS interest led learning, but not in the sense that most<br/>\nhomeschoolers view it.  Most homeschoolers view &quot;interest led<br/>\nlearning&quot; as &quot;curriculum built around my child&#39;s interests&quot; rather<br/>\nthan how unschoolers view it &quot;my child is learning at every moment,<br/>\nincluding while pursuing his/her interests.&quot;  If you take a child&#39;s<br/>\ninterest and turn it into curriculum, chances are that interest is<br/>\ngoing to lose appeal even if it is/was something your child truly<br/>\nloves/d.<br/>\n<br/>\nFor instance, I *could* take my daughter&#39;s love of ballroom dance and<br/>\nturn it into a &quot;teaching opportunity&quot; by teaching her the history of<br/>\nthe dance, the culture of the various dances, the reason for the<br/>\ndifferent shoes, the music, the language, etc etc etc.  OR I can allow<br/>\nher to love ballroom dance, rent her movies (at her request), take her<br/>\nto her classes (which she chose), and eventually she is going to<br/>\ndiscover this stuff by herself through exposure, experience and<br/>\ninterest.  And she will probably understand it WAY better than if I<br/>\nturned it into a lesson plan.<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":253500843,"authorName":"Jennifer Lindsey","from":"&quot;Jennifer Lindsey&quot; &lt;veryeasytoremember@...&gt;","profile":"tmom1111111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New to unschooling","postDate":"1163129052","msgId":18823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNzEwMWM3MDQ3NyRiMTg0NWU5MCQ5ZjAyYThjMEBzcGFjZXdvbWFuPg=="},"prevInTopic":4039,"nextInTopic":18824,"prevInTime":18822,"nextInTime":18824,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Hello! I wanted to take a minute to introduce my family. I m Jennifer and I am in the third year of homeschooling my 5 little ones. They are 2,4,6,8, and 10","messageBody":"<div id=\"ygrps-yiv-455423095\">Hello!<br/>\n<br/>\nI wanted to take a minute to introduce my family. I&#39;m Jennifer and I am in the third year of homeschooling my 5 little ones. They are 2,4,6,8, and 10 and we appear to be unschoolers at heart although I am having a difficult time letting go of my educational ideas ( I was a teacher!) for any length of time. Instead of fighting what seems to be so natural for us I have decided to try and embrace it. However, I am so unsure of how or what to do. I would LOVE some reading (or real life) suggestions on how to...I don&#39;t know...proceed from here! I have decided we need to be relaxed and let the kids take the lead. I have read the Unschooling Handbook, Learning all the Time, and several hours of online stuff. But I would always like to know more, especially coming from those who have gone before! I was wondering...would &quot;unschooling&quot; be the same as &quot;interest led learning&quot;?<br/>\n<br/>\nLooking forward to helping and supporting,<br/>\nJennifer<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] New to unschooling","postDate":"1100778847","msgId":4039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMTE4MTE1MzU4Lk1PTlYxNDQzOC5tdGE5LmFkZWxwaGlhLm5ldEBsZWlnaD4=","inReplyToHeader":"PDIwMDQxMTE3MTU1OTUxLjgyODg0LnFtYWlsQHdlYjYwNTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":4038,"nextInTopic":18823,"prevInTime":4038,"nextInTime":4040,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Hi Rebecca, and welcome to the wonderful world of unschooling. One things that helps new unschoolers sometimes is to keep a log of all the great things your","messageBody":"<div id=\"ygrps-yiv-2044962463\">Hi Rebecca, and welcome to the wonderful world of unschooling.<br/>\n<br/>\nOne things that helps new unschoolers sometimes is to keep a log of all the<br/>\ngreat things your kids do on a daily basis. (don&#39;t let them know what you<br/>\nare writing, just do it privately for yourself or they might give more value<br/>\nto the things you write down.) It gives you something to look back on when<br/>\nyou get the worries.<br/>\n<br/>\nI hope you keep on dancing.<br/>\n<br/>\nAngela ~ Maine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a></div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Movies","postDate":"1100762911","msgId":4038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyOEUyMjlGLTM5MzMtMTFEOS04MEE2LTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PGNuZTg0OCszMjhkQGVHcm91cHMuY29tPg==","referencesHeader":"PGNuZTg0OCszMjhkQGVHcm91cHMuY29tPg=="},"prevInTopic":4037,"nextInTopic":4039,"prevInTime":4037,"nextInTime":4039,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"... They have to try it to believe it. And they don t believe it, so they don t try it. -pam","messageBody":"<div id=\"ygrps-yiv-313043002\">On Nov 16, 2004, at 5:05 PM, huntmom1996 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess sometimes I feel so lucky and free-wheeling that I can&#39;t<br/>\n&gt; believe this is all fine.  Why doesn&#39;t everyone do this????<br/>\n<br/>\n </span></blockquote>They have to try it to believe it. And they don&#39;t believe it, so they <br/>\ndon&#39;t try it.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":182487494,"authorName":"Reba Cobb","from":"Reba Cobb &lt;yinfreedom@...&gt;","profile":"yinfreedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] New to unschooling","postDate":"1100734815","msgId":4037,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMTE3MjM0MDE1LjE1ODA3LnFtYWlsQHdlYjYwNTA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":4036,"nextInTopic":4038,"prevInTime":4036,"nextInTime":4038,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Good on you, Reba. Welcome and keep going. I want you to put your post in a file somewhere, so that if you start having doubts and want to slide back, ","messageBody":"<div id=\"ygrps-yiv-1664507666\">Good on you, Reba. Welcome and keep going. I want you to put your post in a<br/>\nfile somewhere, so that if you start having doubts and want to slide back,<br/>\nforgetting the misery that your kids were feeling, you can read it and<br/>\nrefresh your memory. Also you can look at it a year&#39;s time and feel wonder<br/>\nat how far you have come. <br/>\n<br/>\nRemember one of the keys to Unschooling is to stop looking for the<br/>\n&quot;academics&quot; in their activities, and just see the joy and individual<br/>\npassions.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\nYou know Robyn, I&#39;ve always been amazed with my children&#39;s wonder with life.  That joy and individual passions you mentioned.  Now they have time to explore, to wonder, and to just be.  There has always been a part of me, even in my dogmatic days, that admired the embracing of life, the celebrate the moment kind of people.  I&#39;ve seen that love of life in my children. The catching of snowflakes on their tongue.  Ultimately, I didn&#39;t want to squash that out of them.  I want them to be able to explore their creativity.  And in the process I can find my creativity and my passion and joy. We are on this journey together.  My children are opening my eyes to just how important it is to name moths and set them free.<br/>\n<br/>\nthanks for the support and good advice,<br/>\n<br/>\nreba<br/>\n<br/>\n <br/>\n<br/>\n-<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.795 / Virus Database: 539 - Release Date: 11/12/2004<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Discover all thats new in My Yahoo!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":182487494,"authorName":"Reba Cobb","from":"Reba Cobb &lt;yinfreedom@...&gt;","profile":"yinfreedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: New to unschooling","postDate":"1100734022","msgId":4036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMTE3MjMyNzAyLjQ2NjA1LnFtYWlsQHdlYjYwNTEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFkZS4yZWM4MmIzYS4yZWNkMGZmMUBhb2wuY29tPg=="},"prevInTopic":4035,"nextInTopic":4037,"prevInTime":4035,"nextInTime":4037,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"***I m curious as to what you mean by this. :) Were you censoring for content, reading level , or both? And what was your reason for doing so? Hi Deborah, I","messageBody":"<div id=\"ygrps-yiv-1240022660\">***I&#39;m curious as to what you mean by this. :) Were you censoring for content, <br/>\n&quot;reading level&quot;, or both? And what was your reason for doing so?<br/>\n <br/>\n <br/>\nHi Deborah,<br/>\n <br/>\nI would limit their movies.  Reading level - no.  I did do some censoring for content.  Ultimately, I would check out most of the books based on what I thought was important.  Instead of giving them the freedom to forage.  The censoring, goes far deeper than just homeschooling methodologies.  It stemmed from my religious dogmatic beliefs, which I don&#39;t believe anymore.  <br/>\n <br/>\nReba<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New to unschooling","postDate":"1100723697","msgId":4035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZS4yZWM4MmIzYS4yZWNkMGZmMUBhb2wuY29tPg=="},"prevInTopic":4034,"nextInTopic":4036,"prevInTime":4034,"nextInTime":4036,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"** Before I would censor their library check outs.** I m curious as to what you mean by this. :) Were you censoring for content, reading level , or both? And","messageBody":"<div id=\"ygrps-yiv-1936306456\">** Before I would censor their library check outs.**<br/>\n<br/>\nI&#39;m curious as to what you mean by this. :) Were you censoring for content, <br/>\n&quot;reading level&quot;, or both? And what was your reason for doing so?<br/>\n<br/>\nDeborah the insatiable<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] New to unschooling","postDate":"1100720138","msgId":4034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDQxMTE3MTU1OTUxLjgyODg0LnFtYWlsQHdlYjYwNTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":4033,"nextInTopic":4035,"prevInTime":4033,"nextInTime":4035,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2115620354\">&lt;&lt;&lt;&lt;So I am happy to say, THRILLED to say...WE DID IT!  We are unschooling<br/>\n(or deschooling - all of us! me just as much as the kid-os).  We set<br/>\nourselves free.  My girls reclaimed their library cards.  My son claimed my<br/>\nlibrary card.  Jerusha checked out all the Zoo Life movies and Amelia<br/>\nBedilia she could get her hands on.  Before I would censor their library<br/>\ncheck outs.  Eli checked out ONLY dinosaur books.  And Hannah, she checked<br/>\nout whatever she wanted!<br/>\n <br/>\nI&#39;m going to need all the support I can get!  And put up reminders when i<br/>\nhave doubts. Reminders of what we were living before.  This is a complete<br/>\nlifestyle change.  In a way I completely restructuring not only what i<br/>\nthought of as homeschooling, but also parenting, and my life on an<br/>\nindividual level.<br/>\n <br/>\nBut, you know how I feel...like dancing in the wind with the fall leaves,<br/>\nset free, spinning...&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nGood on you, Reba. Welcome and keep going. I want you to put your post in a<br/>\nfile somewhere, so that if you start having doubts and want to slide back,<br/>\nforgetting the misery that your kids were feeling, you can read it and<br/>\nrefresh your memory. Also you can look at it a year&#39;s time and feel wonder<br/>\nat how far you have come. <br/>\n<br/>\nRemember one of the keys to Unschooling is to stop looking for the<br/>\n&quot;academics&quot; in their activities, and just see the joy and individual<br/>\npassions.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.795 / Virus Database: 539 - Release Date: 11/12/2004</div>","specialLinks":[]},{"userId":163468813,"authorName":"patricia tidmore","from":"patricia tidmore &lt;ptidmore1117@...&gt;","profile":"ptidmore1117","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] New to unschooling","postDate":"1100714064","msgId":4033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMTE3MTc1NDI0LjE5NDk5LnFtYWlsQHdlYjUyMzA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQxMTE3MTU1OTUxLjgyODg0LnFtYWlsQHdlYjYwNTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":4032,"nextInTopic":4034,"prevInTime":4032,"nextInTime":4034,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"I know just how you feel Reba! Be free and always look back......so you will never go back!!!!!!! hugs~Pat Reba Cobb  wrote: Hi everyone,","messageBody":"<div id=\"ygrps-yiv-2107110552\">I know just how you feel Reba!<br/>\nBe free and always look back......so you will never go back!!!!!!!<br/>\n    hugs~Pat<br/>\n<br/>\nReba Cobb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yinfreedom@...\">yinfreedom@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nHi everyone,<br/>\n<br/>\nI&#39;ve been reading your posts with great interest this past week. I am new to the group and new to unschooling. My name is Rebecca and I have three children ages 8, 6 , and 3. We live in Logan, Ut and have been homeschooling for 3 years. This is our fourth year. Through the years we have experimented with many varying approaches: rigid &quot;school at home&quot; and Charlotte Mason and Montessori and Classical. So we ended up with an eclectic homeschool method. Although, we never were relaxed. We&#39;ve bought curriculum and sadly, I&#39;ve made my girls do it thinking I was doing what was best for them in a twisted sort of way. My husband has supported homeschool from day one. When I started over a year ago to read Jon Holt and other unschooling materials I could get my hands on at the library and on line, husband didn&#39;t agree with complete child directed education. So I held back and continued with the eclectic approach with sometimes crying, sometimes angry, sometimes frustrated, and<br/>\nsometimes happy, content children. <br/>\n<br/>\nLet me tell you all, this year I said, &quot;That&#39;s it! I am joining my girls with the revolution.&quot; My 6 year old, Jerusha, would cry every morning. Seriously! She did not want to do Saxon math. She did not want to learn how to read. She wanted to do handwriting when she felt like it AND she told me, &quot;Mama, I want more free time.&quot; That&#39;s what she needed. I&#39;ve always had a difficult time instructing my 8 year old. It was a roller coaster with with good days and bad days - the judgement basis of how well i was able to manipulate her in the quest of spoon feeding what i thought she should learn. Now this is really sounding twisted. Like I told you, we are having a revolution here!!! Hannah, 8 years old, is lovingly dubbed &quot;our idea girl&quot;. I think one of the first phrases she uttered was, &quot;I have an idea....&quot; With our rigid homeschooling approach, we were all plumb tuckered out by lunch, and we still had afternoon studies! So she didn&#39;t have the time she needed or wanted<br/>\nexplore her ideas or creativity. She would complain, &quot;I have so many ideas in my head that I can&#39;t concentrate.&quot; And sitting down at the kitchen table doing saxon math was not a conducive learning or even breathing enviroment for her. <br/>\n<br/>\nAnd, my 3 year old son, Eli, was being left in the dust. He wasn&#39;t getting the attention he needed. Like most 3 year olds, he needs lots and lots of love and attention and personal Mommy time. <br/>\n<br/>\nSo I am happy to say, THRILLED to say...WE DID IT! We are unschooling (or deschooling - all of us! me just as much as the kid-os). We set ourselves free. My girls reclaimed their library cards. My son claimed my library card. Jerusha checked out all the Zoo Life movies and Amelia Bedilia she could get her hands on. Before I would censor their library check outs. Eli checked out ONLY dinosaur books. And Hannah, she checked out whatever she wanted!<br/>\n<br/>\nI&#39;m going to need all the support I can get! And put up reminders when i have doubts. Reminders of what we were living before. This is a complete lifestyle change. In a way I completely restructuring not only what i thought of as homeschooling, but also parenting, and my life on an individual level.<br/>\n<br/>\nBut, you know how I feel...like dancing in the wind with the fall leaves, set free, spinning...<br/>\n<br/>\nReba<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nMeet the all-new My Yahoo!  Try it today! <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] New to unschooling","postDate":"1100708853","msgId":4032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ny4zOTAzMjNiYi4yZWNjZDVmNUBhb2wuY29tPg=="},"prevInTopic":4031,"nextInTopic":4033,"prevInTime":4031,"nextInTime":4033,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/17/2004 11:23:42 AM Eastern Standard Time, yinfreedom@yahoo.com writes: But, you  know how I feel...like dancing in the wind with the","messageBody":"<div id=\"ygrps-yiv-1479520639\">In a message dated 11/17/2004 11:23:42 AM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yinfreedom@...\">yinfreedom@...</a> writes:<br/>\n<br/>\nBut, you  know how I feel...like dancing in the wind with the fall leaves, <br/>\nset free,  spinning...&lt;&lt;&lt;<br/>\n <br/>\n&lt;G&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":182487494,"authorName":"Reba Cobb","from":"Reba Cobb &lt;yinfreedom@...&gt;","profile":"yinfreedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New to unschooling","postDate":"1100707190","msgId":4031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMTE3MTU1OTUxLjgyODg0LnFtYWlsQHdlYjYwNTAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNuZTg0OCszMjhkQGVHcm91cHMuY29tPg=="},"prevInTopic":4030,"nextInTopic":4032,"prevInTime":4030,"nextInTime":4032,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I ve been reading your posts with great interest this past week.  I am new to the group and new to unschooling.  My name is Rebecca and I have","messageBody":"<div id=\"ygrps-yiv-878261032\">Hi everyone,<br/>\n <br/>\nI&#39;ve been reading your posts with great interest this past week.  I am new to the group and new to unschooling.  My name is Rebecca and I have three children ages 8, 6 , and 3.  We live in Logan, Ut and have been homeschooling for 3 years.  This is our fourth year.  Through the years we have experimented with many varying approaches: rigid &quot;school at home&quot; and Charlotte Mason and Montessori and Classical.  So we ended up with an eclectic homeschool method.  Although, we never were relaxed.  We&#39;ve bought curriculum and sadly, I&#39;ve made my girls do it thinking I was doing what was best for them in a twisted sort of way.  My husband has supported homeschool from day one.  When I started over a year ago to read Jon Holt and other unschooling materials I could get my hands on at the library and on line, husband didn&#39;t agree with complete child directed education.  So I held back and continued with the eclectic approach with sometimes crying, sometimes angry, sometimes frustrated, and<br/>\n sometimes happy, content children.  <br/>\n <br/>\nLet me tell you all, this year I said, &quot;That&#39;s it!  I am joining my girls with the revolution.&quot;  My 6 year old, Jerusha, would cry every morning.  Seriously!  She did not want to do Saxon math.  She did not want to learn how to read.  She wanted to do handwriting when she felt like it AND she told me, &quot;Mama, I want more free time.&quot;  That&#39;s what she needed.  I&#39;ve always had a difficult time instructing my 8 year old.  It was a roller coaster with with good days and bad days - the judgement basis of how well i was able to manipulate her in the quest of spoon feeding what i thought she should learn.  Now this is really sounding twisted.  Like I told you, we are having a revolution here!!!  Hannah, 8 years old, is lovingly dubbed &quot;our idea girl&quot;.  I think one of the first phrases she uttered was, &quot;I have an idea....&quot;  With our rigid homeschooling approach, we were all plumb tuckered out by lunch, and we still had afternoon studies!  So she didn&#39;t have the time she needed or wanted<br/>\n explore her ideas or creativity.  She would complain, &quot;I have so many ideas in my head that I can&#39;t concentrate.&quot;  And sitting down at the kitchen table doing saxon math was not a conducive learning or even breathing enviroment for her.  <br/>\n <br/>\nAnd, my 3 year old son, Eli, was being left in the dust.  He wasn&#39;t getting the attention he needed.  Like most 3 year olds, he needs lots and lots of love and attention and  personal Mommy time. <br/>\n <br/>\nSo I am happy to say, THRILLED to say...WE DID IT!  We are unschooling (or deschooling - all of us! me just as much as the kid-os).  We set ourselves free.  My girls reclaimed their library cards.  My son claimed my library card.  Jerusha checked out all the Zoo Life movies and Amelia Bedilia she could get her hands on.  Before I would censor their library check outs.  Eli checked out ONLY dinosaur books.  And Hannah, she checked out whatever she wanted!<br/>\n <br/>\nI&#39;m going to need all the support I can get!  And put up reminders when i have doubts. Reminders of what we were living before.  This is a complete lifestyle change.  In a way I completely restructuring not only what i thought of as homeschooling, but also parenting, and my life on an individual level.<br/>\n <br/>\nBut, you know how I feel...like dancing in the wind with the fall leaves, set free, spinning...<br/>\n <br/>\nReba<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Meet the all-new My Yahoo!  Try it today! <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Movies","postDate":"1100656636","msgId":4030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMTE3MDE1NzA2LlVQS1IxMjQ5MC5tdGExMy5hZGVscGhpYS5uZXRAbGVpZ2g+","inReplyToHeader":"PGNuZTg0OCszMjhkQGVHcm91cHMuY29tPg=="},"prevInTopic":4029,"nextInTopic":4031,"prevInTime":4029,"nextInTime":4031,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Jessica wrote: I guess sometimes I feel so lucky and free-wheeling that I can t believe this is all fine.  Why doesn t everyone do this???? ... That s a great","messageBody":"<div id=\"ygrps-yiv-1771389495\">Jessica wrote:<br/>\nI guess sometimes I feel so lucky and free-wheeling that I can&#39;t <br/>\nbelieve this is all fine.  Why doesn&#39;t everyone do this???? <br/>\n-------------------------------------<br/>\n<br/>\nThat&#39;s a great questions and one I&#39;ve asked myself a million times.  If they<br/>\nonly knew.  If they only knew!<br/>\n<br/>\n <br/>\n<br/>\n We spend every day doing just what we please and the kids learn plenty just<br/>\nfollowing their interests.  We&#39;ve ridden our new horse 6 days a week since<br/>\nwe got her 3 weeks ago. <br/>\n<br/>\n <br/>\n<br/>\nAngela ~ Maine<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":189611316,"authorName":"huntmom1996","from":"&quot;huntmom1996&quot; &lt;jechunt@...&gt;","profile":"huntmom1996","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Movies","postDate":"1100653512","msgId":4029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNuZTg0OCszMjhkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":4030,"prevInTime":4028,"nextInTime":4030,"topicId":4029,"numMessagesInTopic":0,"msgSnippet":"Thank you thank you thank you!!! Okay, I heard what every one said and I am relaxing about the movie thing.  We had rented Shrek 2, so we had to stop watching","messageBody":"<div id=\"ygrps-yiv-577771108\">Thank you thank you thank you!!!<br/>\n<br/>\nOkay, I heard what every one said and I am relaxing about the movie <br/>\nthing.  We had rented Shrek 2, so we had to stop watching it, but we <br/>\nmoved on (back?) to Shrek (which we own) and then did a little Pixar <br/>\nsceening.  My daughter is currently &quot;anti-corporate&quot; (her words) and <br/>\nwants to support the fact that Pixar left Disney.  I don&#39;t even know <br/>\nwhere she found that out.  Anyway, we did a Pixar film festival. Now <br/>\nshe wants to see as many Doris Day movies as we can (gag!).  Thanks <br/>\nfor the suggestions, tips and general support.  <br/>\n<br/>\nI guess sometimes I feel so lucky and free-wheeling that I can&#39;t <br/>\nbelieve this is all fine.  Why doesn&#39;t everyone do this???? <br/>\n<br/>\nPeace~Jessica<br/>\np.s. dd has been eating when hungry without prompting lately-<br/>\nyipeeee!  maybe we&#39;re moving beyaond school eating schedule toxicity.</div>","specialLinks":[]}],"prevTopicId":45739,"nextTopicId":5007}}