{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and toddlers","postDate":"1250118823","msgId":40996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1dmliNyt2NnJiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1c2hodCtmdHYzQGVHcm91cHMuY29tPg=="},"prevInTopic":40986,"nextInTopic":0,"prevInTime":40995,"nextInTime":40997,"topicId":40973,"numMessagesInTopic":0,"msgSnippet":"... *********************** Babies are easily distractible. Have you shown your dd how to offer baby another toy and so get the desired object back promptly?","messageBody":"<div id=\"ygrps-yiv-1425885560\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lidjalynne05&quot; &lt;princessjasmine05@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; One thing that has been going on is that my younger baby is now crawling and often grabs toys from the toddler.  My daughter, the 22 month old, hates this and often becomes violent with him (the baby).<br/>\n </span></blockquote>***********************<br/>\n<br/>\nBabies are easily distractible. Have you shown your dd how to offer baby another toy and so get the desired object back promptly? She may be glad to have a peacable solution!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The only way prevent this is to constantly monitor them closely and be right there when they are playing in the room together. <br/>\n </span></blockquote>******************************<br/>\n<br/>\nUntil they learn better skills, yes, its important to be there with them, helping them learn and communicate. They won&#39;t learn good social skills by trial and error (schools prove that pretty well) they need a model and a guide - a parent! <br/>\n<br/>\nIt might help you feel better about this if you drop words like &quot;monitor&quot; and &quot;supervise&quot; from your vocabulary. Kids don&#39;t need supervisors, they need support and help and guidance. You &quot;get&quot; to be those things for your wonderful children! Remind yourself of that often. Sit on the floor and take a deep breath and give yourself permission to savor your kids&#39; childhood. Let the dishes sit five more minutes! You will cherish the memory of giggling a stuffed dog to distract your baby far more than you will the memory of doing household chores while your kids quarrel, I Promise!<br/>\n<br/>\nDo you have a sling or some other way to carry the baby while you do other tasks? That&#39;s another solution - bring baby with you when you can&#39;t be right down on the floor with the pair of them (but do spend plenty of time on the floor, too).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, my daughter is very rough with my parents&#39; little dog.  She sometimes tries to pick her up around the neck, hits her with her hands and objects, etc.  She likes the dog a lot, but for some reason she is also violent with her.<br/>\n </span></blockquote>*****************************<br/>\n<br/>\nSome kids respond well to being shown how to handle pets gently, but others will &quot;love pets to death&quot; as it were, and seem very rough and hurtful in the process. Its a kind of developmental gap that *does* close with age. Don&#39;t panic. But do protect the dog if you&#39;re concerned for its wellbeing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I feel like the only good way to protect the dog is to keep them separated, although that means locking the dog up when we are in the kitchen, which is where the dog has to stay during the day.  Or again, closely monitoring them when they play together. <br/>\n </span></blockquote>************************<br/>\n<br/>\nBoth good solutions! <br/>\n<br/>\nSome kids need more help than others. Impulse control can take longer to develop for some kids than others, and stress can undermine impulse control. How verbal is your older dd? Some kids get very physical when they want to express themselves verbally but can&#39;t, yet. Some kids are just more phyiscal! All of these are issues that will improve with time - as your dd gets older and has more &quot;tools&quot; at her disposal. <br/>\n<br/>\nAs you&#39;re spending time with her, look for things that might trigger less wonderful responses - keep in mind how long since she&#39;s eaten, or slept, in particular. Low energy, as you may know from your own life, can reduce impulse control and impede the ability to make good decisions. Offer snacks regularly. If she seems tired, look for calmer, more restful activities that let her recharge.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":358788661,"authorName":"sharonmbliss","from":"&quot;sharonmbliss&quot; &lt;mrsbliss@...&gt;","profile":"sharonmbliss","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"unschooling and toddlers","postDate":"1250082981","msgId":40986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1dWZiNSs5dWQzQGVHcm91cHMuY29tPg=="},"prevInTopic":40985,"nextInTopic":40996,"prevInTime":40985,"nextInTime":40987,"topicId":40973,"numMessagesInTopic":0,"msgSnippet":"Wow, you are going through a lot right now. I can sympathize with you on many points, though I do not live near Mississippi. I have a 3 1/2 year old and a 20","messageBody":"<div id=\"ygrps-yiv-626197051\">Wow, you are going through a lot right now. I can sympathize with you on many points, though I do not live near Mississippi. I have a 3 1/2 year old and a 20 month old so I have lived through the two young kids so close together. I can say, at least in my case, they have started to really get along with each other and play with each other and sometimes protect one another but that has really been in the last 5 or 6 months. And of course, they do still hit or push one another, my youngest has taken up biting if she is being overpowered by her brother. I&#39;m glad to see she is sticking up for herself and finding a way to level the playing field but I don&#39;t want to encourage biting. Anyway, since your youngest is 7 months, you will likely need to supervise them playing together, but know there will be days in the future where such close suoervision will not be necessary. I know it is hard because you have legitimate things to get done. All I can say is, try to include them as much as possible. If you have to prepare dinner or clean the kitchen, try to set them up near you. My children love to stand on chairs in the kitchen and &quot;help&quot; or play in the sink. You might be able to give your younger child pots and pans and spoons and/or a cabinet of tupperware to pull in and out and stack. <br/>\n<br/>\nRight now, I am trying to organize better so I can spend less time focused on cleaning and picking up toys and more time on playing and following my kids&#39; leads. I&#39;ve already seen an improvement. <br/>\n<br/>\nWhen the baby grabs a toy, try talking to your toddler and let her know that the baby is trying to be like her and wants to play like she is. It might help a little as she starts to understand the motivations of her baby sister instead of viewing her as the enemy or a threat. Show her how to find another toy for the baby or even pre-emptively give the baby a toy when she starts crawling over. My children surprised me at how soon they were able to start trading successfully. I often asked my toddler which one can baby have, when he wanted to hoard all of the toys. This nearly always worked for me and the younger sibling (at this age) will often be happy with whatever they are given. <br/>\n<br/>\nWe just got a puppy too and it&#39;s been difficult. At 3 1/2 my son is violent with the puppy and often wants to kick him, the best I can tell is he is scared of him and doesn&#39;t want to be nipped or jumped up on so using his feet is the only way he can protect himself. It sounds like your situation with the dog is temporary so I would just try to supervise some dog time and then put the dog in the kitchen for awhile. You gotta do what you gotta do and you won&#39;t be able to make everyone happy all of the time. <br/>\n<br/>\nWeaning can add to the strife. Both of my children still nurse frequently. Limiting the toddler&#39;s nursing may be an adjustment but I imagine will be effective. I can&#39;t imagine living through this period without having nursing in my &quot;toolbag&quot;. I think it has helped tremendously with sibling rivalry, helps mellow large emotions and helps everyone still feel loved. You&#39;ll just have to watch how your children are dealing with the changes and do what works for them while meeting your own needs. It might be that they need to nurse more during this time of turmoil, moving, Daddy gone, etc. <br/>\n<br/>\nTry not to put too much pressure on yourself to be the parent you want to be, 24/7. We all have really great moments and less than perfect times/days. Also it can be heartening to remember you can&#39;t change other people&#39;s behavior only your own, but sometimes that&#39;s enough. My husband has different ideas on discipline and other areas of child raising but he does follow my lead a lot and will make changes on his own simply from observing how I handle situations with the kids. He also surprised me recently by reading several John Holt and other unschooling books I have started to accrue and is for the first time, really behind me homeschooling/unschooling with the children. Woo hoo!<br/>\n<br/>\nHang in there. My husband is working in another state right now and it&#39;s hard with him gone for 2 weeks or so at a time but it too is temporary. I&#39;m not always the best at checking the boards, if you ever want to talk more about things, send me an email: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mrsbliss@...\">mrsbliss@...</a>. Sounds like we have a lot of similar things we&#39;re working through. <br/>\n<br/>\nSharon</div>","specialLinks":[]},{"userId":133390932,"authorName":"Mara","from":"Mara &lt;mamadeluz@...&gt;","profile":"mamadeluz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling and toddlers","postDate":"1250082919","msgId":40985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MjAzNy40ODIyNS5xbUB3ZWI1MzIwNy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGg1dTYwdCs0MXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGg1dTYwdCs0MXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":40981,"nextInTopic":40986,"prevInTime":40984,"nextInTime":40986,"topicId":40973,"numMessagesInTopic":0,"msgSnippet":"As you can I would do the things you need to do where you can see them, like folding the laundry, paying bills etc. as much as possible. When mine were younger","messageBody":"<div id=\"ygrps-yiv-2113219143\">As you can I would do the things you need to do where you can see them, like folding the laundry, paying bills etc. as much as possible. When mine were younger I sometimes had to take the little one with me where ever I was doing things if his brother was doing something he shouldn&#39;t destroy. He loved throwing clothes into the washer, play with the pots and pans, roll around in the fresh laundry etc. The house certainly was never entirely clean, and meals were often very scattered. It&#39;s hard now but it will get better. <br/>\nAll the best,<br/>\nMara<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, August 12, 2009 6:37:17 AM<br/>\nSubject: [unschoolingbasics] Re: unschooling and toddlers<br/>\n<br/>\n  <br/>\nYour decision to unschool doesn&#39;t change how old the children are. Yes, you need to be with them and help them interact or separate them as needed. Every minute that you can. It is difficult or impossible to get other things done and it it extremely frustrating and tiring at times. <br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; One thing that has been going on is that my younger baby is now crawling and often grabs toys from the toddler.  My daughter, the 22 month old, hates this and often becomes violent with him (the baby).The only way prevent this is to constantly monitor them closely and be right there when they are playing in the room together.  The difficulty is that I usually try to get something else done while they are entertaining themselves.  Are there any other solutions or do I just need to give up trying to do something with them playing together?<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and toddlers","postDate":"1250073437","msgId":40981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1dTYwdCs0MXB0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1c2hodCtmdHYzQGVHcm91cHMuY29tPg=="},"prevInTopic":40973,"nextInTopic":40985,"prevInTime":40980,"nextInTime":40982,"topicId":40973,"numMessagesInTopic":0,"msgSnippet":"Your decision to unschool doesn t change how old the children are. Yes, you need to be with them and help them interact or separate them as needed. Every","messageBody":"<div id=\"ygrps-yiv-1763248117\">Your decision to unschool doesn&#39;t change how old the children are. Yes, you need to be with them and help them interact or separate them as needed. Every minute that you can. It is difficult or impossible to get other things done and it it extremely frustrating and tiring at times. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; One thing that has been going on is that my younger baby is now crawling and often grabs toys from the toddler.  My daughter, the 22 month old, hates this and often becomes violent with him (the baby).The only way prevent this is to constantly monitor them closely and be right there when they are playing in the room together.  The difficulty is that I usually try to get something else done while they are entertaining themselves.  Are there any other solutions or do I just need to give up trying to do something with them playing together? </span></blockquote></div>","specialLinks":[]},{"userId":330565882,"authorName":"lidjalynne05","from":"&quot;lidjalynne05&quot; &lt;princessjasmine05@...&gt;","profile":"lidjalynne05","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"unschooling and toddlers","postDate":"1250019709","msgId":40973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1c2hodCtmdHYzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40981,"prevInTime":40972,"nextInTime":40974,"topicId":40973,"numMessagesInTopic":0,"msgSnippet":"Hi, everyone, this is my first time to post although I ve been reading for probably over a year now.  I am the mother of two children, a 22 month old and a","messageBody":"<div id=\"ygrps-yiv-1278938834\">Hi, everyone, this is my first time to post although I&#39;ve been reading for probably over a year now.  I am the mother of two children, a 22 month old and a seven month old baby.  I am very interested in unschooling, although I initially became interested b/c I am not a fan of the educational system and value self-motivated learning much more than forced &quot;education.&quot;  Through this list I have discovered that unschooling is more of a philosophy of living than I realized.  I am drawn to this way of living but it is pretty different from anything I have seen or done myself.  It intuitively seems so natural and yet in my daily life it is anything but. It is hard work!<br/>\n<br/>\nI have a few specific issues that I am dealing with regarding my children, who are obviously too young for school, but now that I understand unschooling as a way of life, it seems the time to start is now. <br/>\n<br/>\nOne thing that has been going on is that my younger baby is now crawling and often grabs toys from the toddler.  My daughter, the 22 month old, hates this and often becomes violent with him (the baby).The only way prevent this is to constantly monitor them closely and be right there when they are playing in the room together.  The difficulty is that I usually try to get something else done while they are entertaining themselves.  Are there any other solutions or do I just need to give up trying to do something with them playing together?<br/>\n<br/>\nAlso, my daughter is very rough with my parents&#39; little dog.  She sometimes tries to pick her up around the neck, hits her with her hands and objects, etc.  She likes the dog a lot, but for some reason she is also violent with her.  I feel like the only good way to protect the dog is to keep them separated, although that means locking the dog up when we are in the kitchen, which is where the dog has to stay during the day.  Or again, closely monitoring them when they play together.  <br/>\n<br/>\nRight now we are living with my parents while my husband fixes up the farm house we are supposed to be moving into at the first of next month.  Our little family has been separated since June 20.  We now see my husband, the kids&#39; dad, for a couple of days a week and we haven&#39;t all lived together since June 20, when the kids and I moved to Mississippi (where we now live).  So our lives are very disrupted.  It has been hard on all of us.  I get very burned out and my energy with the kids fluctuates wildly from day to day.  I find it difficult to focus on my parenting goals when in the midst of my family who has very different values and goals.  When I first came here, I had just read Unconditional Parenting and Everyday Blessings and was very inspired to parent differently.  Now I feel like I am being subtly influenced by them.  Also, I feel like the way they interact with the kids is contrary to how I want to, but I can&#39;t control how they act (or how my husband acts for that matter).  I am wondering, do you all have suggestions for how to keep focused on how you want to parent through the day and on how to keep your energy up consistently?  On days when I have lots of energy and am in a good mood, the kids and I do great, and on low energy, low spirit days we are all in a funk.  And two kids under two take a lot of energy.  So I need to boost mine, I feel.<br/>\n<br/>\nAnother background note, I am in the process of weaning my oldest daughter, we pretty swiftly went from nursing somewhat on demand, with me sometimes saying not right now, or distracting her or offering other options, to just nursing 3 times a day.  In some ways it seems like she takes to it better b/c she knows when we will nurse and that I won&#39;t say no at those times, but I wonder if this also is contributing to some of the behavior (although to be honest the behavior started before the weaning, but not before we moved).  I have an insane eczema outbreak right now all over my body, including my nipples, and nursing the two of them all the time was making me want to climb out of my skin.  Still, I am not ready to be totally done with nursing my oldest daughter, so I am trying to hold on to a few nursings a day.  <br/>\n<br/>\nOne more question, are any of you living in Mississippi?</div>","specialLinks":[]}],"prevTopicId":40984,"nextTopicId":9869}}