{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":227522899,"authorName":"camden","from":"camden &lt;ccoutlaw@...&gt;","profile":"ccoutlaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] TV Content musings","postDate":"1124536638","msgId":6144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDgwMWM1YTU3OCRiZWRlZmFmMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PDIwMDUwODIwMDQyNDI3LjgxMzMucW1haWxAd2ViNTE1MDcubWFpbC55YWhvby5jb20+"},"prevInTopic":6141,"nextInTopic":0,"prevInTime":6143,"nextInTime":6145,"topicId":6138,"numMessagesInTopic":0,"msgSnippet":"Hi Cheyenne, I have the same block on my satellite. Here s why, sometimes the kids will fall asleep watching a movie on HBO or something similar and they would","messageBody":"<div id=\"ygrps-yiv-254119199\">Hi Cheyenne,<br/>\nI have the same block on my satellite. Here&#39;s why, sometimes the kids will fall asleep watching a movie on HBO or something similar and they would wake up to porn.  As with you I found the programs sometimes were &quot;unrated&quot; so I tried blocking unrated shows and that blocked all the cartoons. But since they have changed the ratings I found I can block the &quot;mature&quot; rated shows and that pretty much takes care of that.  Except some of the music channels (rap/hip hop/ etc) sometimes get a mature rating also so my son isn&#39;t happy about that.<br/>\nThat comes to your question about music. I have the same question.  I don&#39;t want to limit what he listens to. But on the other hand, SOME of the things that SOME of the bands portray are way over the edge, especially in the videos. I wish there was that happy medium.  Don&#39;t get me wrong, I&#39;m no &quot;prude&quot;, it just bothers me what they are portraying(drugs,violence,bondage,etc).  And I do get the ..what if your husband told you you couldn&#39;t watch them.. idea. I&#39;m trying to work on the letting him do what he chooses and still protecting him. <br/>\nCarol<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Cheyenne Cain <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Saturday, August 20, 2005 12:24 AM<br/>\n  Subject: Re: [unschoolingbasics] TV Content musings<br/>\n<br/>\n<br/>\n  great post robyn. <br/>\n<br/>\n  i must admit that i set the parental block on our cable. all dd has to do is ask for the code to watch whatever. it is just more of a way to protect us both from content we&#39;d rather not come across while channel surfing. at first i just blocked the adult rated program. we have the 900 channel deal and at night all the b-porn comes on. i was really upset though because even after the blocking the &quot;adult programs&quot; a few manage to get through. super cheesy porn like washing cars with boobs. so now i block r rated stuff too. i personnaly think it should all be pay per view. oh well. i guess that will come with my utopian world. <br/>\n<br/>\n  i do have a question regrading music choices. dd is almost 11. she really enjoys hip-hop. understandablly, the music is fun to dance around to. it just irrates me to see the way hip-hop/rap cultures and its attitude towards women: sex objects. how have you (that&#39;s a plural you) dealt with this with your young daughters. <br/>\n<br/>\n  Cheyenne<br/>\n<br/>\n  __________________________________________________<br/>\n  Do You Yahoo!?<br/>\n  Tired of spam?  Yahoo! Mail has the best spam protection around <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    a..  Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n      <br/>\n    b..  To unsubscribe from this group, send an email to:<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c..  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":197929377,"authorName":"Cheyenne Cain","from":"Cheyenne Cain &lt;cherokeecain@...&gt;","profile":"cherokeecain","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] TV Content musings","postDate":"1124511867","msgId":6141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwODIwMDQyNDI3LjgxMzMucW1haWxAd2ViNTE1MDcubWFpbC55YWhvby5jb20+"},"prevInTopic":6138,"nextInTopic":6144,"prevInTime":6140,"nextInTime":6142,"topicId":6138,"numMessagesInTopic":0,"msgSnippet":"great post robyn. i must admit that i set the parental block on our cable. all dd has to do is ask for the code to watch whatever. it is just more of a way to","messageBody":"<div id=\"ygrps-yiv-1323164558\">great post robyn. <br/>\n <br/>\ni must admit that i set the parental block on our cable. all dd has to do is ask for the code to watch whatever. it is just more of a way to protect us both from content we&#39;d rather not come across while channel surfing. at first i just blocked the adult rated program. we have the 900 channel deal and at night all the b-porn comes on. i was really upset though because even after the blocking the &quot;adult programs&quot; a few manage to get through. super cheesy porn like washing cars with boobs. so now i block r rated stuff too. i personnaly think it should all be pay per view. oh well. i guess that will come with my utopian world. <br/>\n <br/>\ni do have a question regrading music choices. dd is almost 11. she really enjoys hip-hop. understandablly, the music is fun to dance around to. it just irrates me to see the way hip-hop/rap cultures and its attitude towards women: sex objects. how have you (that&#39;s a plural you) dealt with this with your young daughters. <br/>\n <br/>\nCheyenne<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"TV Content musings","postDate":"1124505006","msgId":6138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":6141,"prevInTime":6137,"nextInTime":6139,"topicId":6138,"numMessagesInTopic":0,"msgSnippet":"I am cross posting with slight modifications this from AU, for reasons that are immediately clear. ","messageBody":"<div id=\"ygrps-yiv-1260145523\">I am cross posting with slight modifications this from AU, for reasons that<br/>\nare immediately clear.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt; The amount of t.v. hasn&#39;t been the problem, but the content.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt has been the most pronounced incidence of synchronicity that I have yet<br/>\nnoticed on the lists where there have been three mothers posting almost the<br/>\nexact same sentiments on three Unschooling lists, specifically expressing<br/>\nthe same concerns about &quot;limiting to appropriate content&quot; with children of<br/>\nvarying ages, from 2 yo to 6 year olds, to a 10 yo, and a 14 yo.<br/>\n<br/>\nThis is not really the forum for a lengthy dissertation into the discourses<br/>\nof television comedy, or a dissection of the semiotics of the sitcom as a<br/>\ndepiction of the American family - as entertaining as I would personally<br/>\nfind writing such an essay.<br/>\n<br/>\nNor is it necessarily as helpful to get into a lengthy &quot;I don&#39;t like show<br/>\nX&quot;...&quot;Oh I like show X a lot&quot; debate - because tastes differ, definitions of<br/>\n&quot;vulgar&quot; or funny differ, and it doesn&#39;t really get any further into the<br/>\nprinciples behind the ideas of choice and learning.<br/>\n<br/>\nThere seem to be two issues in reference to the content of tv programs or<br/>\nmovies. The first is the idea that the content, while not necessarily<br/>\nobjectionable in itself, is too &quot;mature&quot; for the children - either too scary<br/>\nor too sexually explicit seem to the main concerns. <br/>\n<br/>\nIn the first situation I have found, similarly to what others have reported,<br/>\nthat Jayn is very good at self-care if she starts to become scared of<br/>\nimages, sounds or characters&#39; behavior. She also seems to have developed her<br/>\nown specific coping mechanisms for exploring the scary stuff including fast<br/>\nforwarding, going away for a minute, desensitizing herself with repeated<br/>\ngradual exposures, and role-playing games. I too have learnt the kind of<br/>\nmusic or images that disturb her, and will warn her if a program seems<br/>\nlikely to be scary. <br/>\n<br/>\nIn the case of sexually explicit - and people have different places where<br/>\nthey will become concerned - I have found, again similarly to what others<br/>\nhave reported, that Jayn has zero interest in the sexual or even mere<br/>\nromantic antics of people on tv. She certainly is not seeking it out. If<br/>\nsomething comes on in the course of changing channels or she walks into the<br/>\nother room and something is on, she gets a kind of &quot;that looks stupid&quot;<br/>\nexpression and usually totally ignores it. At around 3, she used to enjoy<br/>\n&quot;Sex and the City&quot; because she liked the pretty dresses and sparkles, and<br/>\nwould just go play with her dolls during any of the incomprehensible to her<br/>\nsexual scenes. Now she just lumps adult themed shows of any kind (eg police<br/>\ndrama) together as &quot;boring&quot; or &quot;stupid garbage&quot; and asks for Disney channel.<br/>\nIt is only a matter of time before she starts expressing ideas and seeking<br/>\nclarification (her version of asking questions) on the odd sexual scenes she<br/>\nbumps into at times on tv.<br/>\n<br/>\n*** I will add that I believe that she will start seeking out or being<br/>\nattracted to programs with sexual content (of any kind) at the appropriate<br/>\ndevelopmental time when her inner questioning arrives at that place - or to<br/>\nput it conversely, she won&#39;t be interested until and unless she is &quot;ready&quot;<br/>\nto receive that kind of information, coupled with the additional guidance<br/>\nthat I will be able to give her about the level of reality that she is<br/>\nseeing. I try to see every new program as an opportunity for more<br/>\ncommunication between us.<br/>\n<br/>\nThe second issue of concern has to do with the &quot;family values&quot; and behavior<br/>\nand relationships of characters in the shows. I have to agree that both the<br/>\ncharacters and the situations in teen sitcoms and movies often depict values<br/>\nthat are in conflict with the ideas of Unschooling, including lousy<br/>\nparenting, adults as adversarial and dumb simultaneously, and sibling<br/>\nconflict portrayed as normal and acceptable. <br/>\n<br/>\nHowever whether these values are going to be genuinely internalized and<br/>\nadopted by our children is another question. I personally doubt it, despite<br/>\nthe experimental forays into these less than charming behaviors our kids<br/>\nsometimes engage in. I am seeing it for the first time - Jayn has started<br/>\ncalling me &quot;stupid head&quot; at odd times - from &quot;Lilo and Stitch&quot; (movie). I<br/>\nhave Trust that it will get old soon. I also endorse the idea of talking<br/>\nover in a genuine way specific behaviors or ideas, rather than making a<br/>\nnegative assessment of the show your kid loves. (I come and blurt the latter<br/>\nonto the lists instead of onto Jayn). ;)<br/>\n<br/>\nAside from the fact that I doubt that any of us are remotely like any of<br/>\nthese detached, authoritarian or befuddled parents, the biggest, hugest,<br/>\nmost significant difference between our children and 100percent of the kids<br/>\nportrayed on any of these shows is: they are all in mandatory school.<br/>\n<br/>\nThese TV children&#39;s primary bonding relationships are shown as being with<br/>\ntheir friends and age peers, and with few exceptions, the majority of their<br/>\ntime is spent in the school hallways, on school related projects, including<br/>\nsome really contrived nonsense, and conversing with each other about school<br/>\nstuff or school people. Additionally, with the one exception of Ren Stevens<br/>\nwho likes it and is a butt of humor for that reason, they seem consider<br/>\nschool a necessary evil. <br/>\n<br/>\nI believe that these shows portray a heightened and exaggerated depiction of<br/>\nwhat we Unschoolers would consider some of the very real negatives of school<br/>\nas they apply to family life - the appropriation of almost all time with the<br/>\nconcomitant disintegration of close family relationships, the culture of<br/>\npeer approval and cliques and personality labeling (&quot;jocks&quot;, &quot;geeks&quot;,<br/>\n&quot;popular girls&quot;, etc), the separation and fostering of distrust and<br/>\ndisconnection between parents and children, the adult (parent or teacher) as<br/>\nboth incomprehensible and a killjoy even while they are &quot;humorously&quot;<br/>\ninfantile (esp. males), children as directly powerless in the face of school<br/>\nor parental rules so resorting to underhand strategies (hi jinks ensue!<br/>\n:P~~). <br/>\n<br/>\nThe entertainment value of these shows to schooled children, who undoubtedly<br/>\nrecognize themselves to a much greater degree, is likely partly in that very<br/>\nseparation from the parents. The tv kids usually spend almost no time in<br/>\nclass of any kind - more wishful thinking for the schooled kids. It is<br/>\npossible that these tv kids have more personal power and autonomy than the<br/>\nreal children - they certainly will do more outlandish stuff. The didactic<br/>\n&quot;mother knows best in the end&quot; message of most of these shows, is a small<br/>\nprice to pay (I mean for the schooled child viewers) for getting to watch<br/>\npeople make really dumb choices (dumber than they might make irl) and follow<br/>\nthrough the absurd results. I notice that &quot;grounding&quot; is the universal<br/>\npunishment, applied even after the &quot;lesson&quot; has been learned. <br/>\n<br/>\nI suspect that most of our children have much less identification with the<br/>\ncharacters. Maybe they watch this stuff with the same sense of disbelieving<br/>\nastonishment that some of us apply to Jerry Springer, or with the same<br/>\ncuriosity as pausing to view a car wreck or collapsed building. It is the<br/>\nvery &quot;otherness&quot; of these families that makes them interesting.<br/>\n<br/>\nI asked Jayn what she likes about &quot;That&#39;s So Raven&quot;, her current favorite. I<br/>\ndiscovered that her attraction to the show comes from her enjoyment of<br/>\nRaven&#39;s dress up as odd characters antics, and also she likes Raven&#39;s<br/>\nregular clothing which is heavy on the sparkle, feathers and embroidery. We<br/>\nrecord the programs, and sometimes if one of the other characters is the<br/>\nfeatured story that day, she will ask me to skip over those scenes that do<br/>\nnot include Raven herself. In other words the actual narrative or internal<br/>\n&quot;logic&quot; is irrelevant to Jayn&#39;s enjoyment.<br/>\n<br/>\nIn the past Jayn has included shows that I don&#39;t like (for values) in her<br/>\nviewing schedule. Her interest has waned, not because I made any attempt to<br/>\nlimit, but because she received all she needed and her interests matured. We<br/>\nhad lots of conversations about specific moments that I disapproved of,<br/>\nalong the lines of other choices the characters could have made in those<br/>\nmoments.<br/>\n<br/>\nUnlike schooled kids, our children have the opportunity to continue to have<br/>\nauthentic relationships with us. We can continue to be the first and primary<br/>\nvalues influence in their lives, as well as their strongest safety net,<br/>\nregardless of what tv shows they like. I hope that it is our huge presence<br/>\nin their lives, and willingness to really listen without a hidden agenda,<br/>\nthat will ultimately mitigate any of the experimental &quot;bad&quot; behavior that<br/>\nthey may try on.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.338 / Virus Database: 267.10.13/78 - Release Date: 8/19/2005</div>","specialLinks":[]}],"prevTopicId":6133,"nextTopicId":6145}}