{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1144001418","msgId":11266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDAyLjEyMTAxOC4yNTY4LjMuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":11226,"nextInTopic":0,"prevInTime":11265,"nextInTime":11267,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"It s hard when we feel criticized or erroneously judged by family. Your sister was hoping to educate you with that e-mail,  so that you would do the right","messageBody":"<div id=\"ygrps-yiv-1309000933\">It&#39;s hard when we feel criticized or erroneously judged by family.  <br/>\n<br/>\nYour sister was hoping to educate you with that e-mail, &lt;g&gt; so that you<br/>\nwould do the right thing by your kids.   If you&#39;ve ever sent a friend or<br/>\nfamily member a link to an anti spanking page or some social change<br/>\nwebsite or other you&#39;ve done the same thing.   It&#39;s not so bad.  <br/>\n<br/>\nIn this case it *sucks* but it&#39;s not so bad. &lt;g&gt;<br/>\n<br/>\nI recommend staying away from your sister until your confidence in<br/>\nunschooling has grown.  <br/>\nI don&#39;t mean you should strike a line through her name or anything, but<br/>\ndon&#39;t go to her house or to family or social events where she will be<br/>\nuntil you feel so confident about what your doing that her remarks won&#39;t<br/>\nbother you any more than if she said &quot;you should try some of this<br/>\ndelicious cake.&quot; &lt;g&gt;   Because she won&#39;t be saying &quot;If you don&#39;t eat this<br/>\ncake you&#39;re an uninformed, ignorant person making a bad choice.&quot;  <br/>\n<br/>\nAvoiding family members doesn&#39;t have to be an act of anger or bitterness.<br/>\n You have the right to do the best thing for yourself and your kids and<br/>\nthe best thing might just be to chill. &lt;g&gt;<br/>\n<br/>\nWhen you have more confidence and when your kids are a little older, your<br/>\nsisters fears will be eased.  David&#39;s family gave us some trouble about<br/>\nDylan in the beginning but it&#39;s been years now since any of them has had<br/>\nanything negative to say.  <br/>\n<br/>\nTry not to be hurt.  Easier said than done, I know.  <br/>\n<br/>\nIf she calls you or emails you, you don&#39;t have to explain anything.  You<br/>\ncan say, &quot;Oh, how are you?  Sorry I&#39;ve got to run, catch you later.&quot; <br/>\nIf she asks specific questions you are not required in any way to answer<br/>\nher.  You really can say &quot;Sorry sis, gotta go!&quot;<br/>\n<br/>\nWe feel we owe our parents/siblings an explanation of our choices and<br/>\ndecisions.  We don&#39;t.  We get to do what we want. &lt;g&gt;<br/>\n<br/>\nLater, when your sis sees your kids are normal and undamaged, think how<br/>\nfun it will be to say &quot;NEENER!&quot; &lt;G&gt; (quietly, to yourself, of course, and<br/>\nhere! )   And you can complain to us if she bugs you.  Tell me where she<br/>\nlives, I&#39;ll go muss her up. &lt;g&gt;</div>","specialLinks":[]},{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with reply to disapproving sister (long)","postDate":"1143843195","msgId":11226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJhZC5lNjEyMGYuMzE1ZjAzN2JAd21jb25uZWN0LmNvbT4="},"prevInTopic":11210,"nextInTopic":11266,"prevInTime":11225,"nextInTime":11227,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/29/2006 10:03:49 PM Eastern Standard Time, ... I agree with you Deirdre so much. My sister happens to be in favor of us hs ing, she s even","messageBody":"<div id=\"ygrps-yiv-2034382205\">In a message dated 3/29/2006 10:03:49 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aycock@...\">aycock@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I think family <br/>\n&gt; is highly over-rated.  If this were a mere friend we were talking <br/>\n&gt; about, you wouldn&#39;t care so much about what she thought, first of <br/>\n&gt; all.  And secondly, you wouldn&#39;t hesitate to end the friendship if <br/>\n&gt; she persisted in trying to make you feel incompetent.  <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I agree with you Deirdre so much. My sister happens to be in favor of us <br/>\nhs&#39;ing, she&#39;s even starting to agree with unschooling. Her kids are all older now <br/>\nand in college so she&#39;s not at the same place in life as I am as far as kids <br/>\ngo but she trusts me and my dh that we will do what&#39;s best for our kids and I <br/>\nthink she&#39;s starting to see the benefits of it already. (we&#39;ve only been <br/>\nhs&#39;ing/unschooling for a little over a yr. now) My brother and my Dad on the other <br/>\nhand, what a pain in the butt! My dh and I have both had family members do some <br/>\nthings to us that we would never allow a friend to do, we decided that just <br/>\nbecause they are of the same blood doesn&#39;t mean we have to take poor behavior <br/>\nfrom them. I certainly wouldn&#39;t allow a friend to treat me poorly, being of the <br/>\nsame family does not give them a free ticket to do so either.<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with reply to disapproving sister (long)","postDate":"1143790693","msgId":11210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3MS5iNjFkODQuMzE1ZTM2NjVAYW9sLmNvbT4="},"prevInTopic":11201,"nextInTopic":11226,"prevInTime":11209,"nextInTime":11211,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"**I like the pass the dip reply but I feel like I have been doing that reply all my life with her in an effort to keep the peace so this goes much deeper ","messageBody":"<div id=\"ygrps-yiv-1166579227\">**I like the &quot;pass the dip&quot; reply but I feel like I have been doing that <br/>\nreply all my life with her in an effort to keep the peace so this goes much deeper <br/>\nthan anyone can ever know. **<br/>\n<br/>\nChristy, I highly recommend reading Harriet Lerner&#39;s books, The Dance of <br/>\nAnger and The Dance of Intimacy. They are about getting unstuck from the <br/>\nrepetetive interactions we have with family members. Won&#39;t help with homeschooling <br/>\nissues but may help you to clarify what you want in your relationship, period. <br/>\n<br/>\nDeborah in IL</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with reply to disapproving sister (long)","postDate":"1143733044","msgId":11196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUwZ3R2aytjc2NlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTMwMWM2NTQwOSRkNzlhOTliMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11195,"nextInTopic":11201,"prevInTime":11195,"nextInTime":11197,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"No advice, but lots of hugs sent your way.  I can understand not wanting to cut your son s relationship with his cousin off, so it is a tricky balancing act","messageBody":"<div id=\"ygrps-yiv-520294720\">No advice, but lots of hugs sent your way.  I can understand not <br/>\nwanting to cut your son&#39;s relationship with his cousin off, so it is <br/>\na tricky balancing act for you, isn&#39;t it?  <br/>\n<br/>\nYou can pick your friends, you can pick your enemies, but you can&#39;t <br/>\npick your friend&#39;s nose -- wait, that is you can&#39;t pick your <br/>\nfamily.  ;-)<br/>\n<br/>\nNo matter what she says, you are doing what is best for YOUR family -<br/>\n- and that is what counts.<br/>\n<br/>\nLinda<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Christy Putnam&quot; <br/>\n&lt;personal_balance@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  The problem comes in that she doesn&#39;t hesitate<br/>\n&gt; to openly question/judge everything I do.  A big part of me wants <br/>\n </span></blockquote>to reply<br/>\n<blockquote><span title=\"ireply\"> &gt; to this pointing that out and telling her that if she chooses not <br/>\n </span></blockquote>to respect<br/>\n<blockquote><span title=\"ireply\"> &gt; my choices as a person and mother, when I respect hers then I cant <br/>\n </span></blockquote>put<br/>\n<blockquote><span title=\"ireply\"> &gt; myself in that position any longer. &gt;  <br/>\n<br/>\n&gt;  <br/>\n&gt; Really the ONLY reasons we ever talk are 1) family <br/>\n </span></blockquote>activities/holiday plans<br/>\n<blockquote><span title=\"ireply\"> &gt; and 2) our older sons are the same age and love to spend time <br/>\n </span></blockquote>together<br/>\n<blockquote><span title=\"ireply\"> &gt; whenever possible.  She lives 2 hrs away from me and we are both <br/>\n </span></blockquote>busy<br/>\n<blockquote><span title=\"ireply\"> &gt; families so trips to see &quot;each other&quot; are few and far between.  If <br/>\n </span></blockquote>the kids<br/>\n<blockquote><span title=\"ireply\"> &gt; weren&#39;t so close I wouldn&#39;t mind severing ties and only being <br/>\n </span></blockquote>civil at<br/>\n<blockquote><span title=\"qreply\"> &gt; family functions.  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with reply to disapproving sister (long)","postDate":"1143731751","msgId":11195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjAzMzAwNzE1aTVlYTQ4NTMyamIyMzhiYTQ1OGQ0MjRlYUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDAwMTMwMWM2NTQwOSRkNzlhOTliMCQ2NDAxYThjMEB0aWJlcml1bT4=","referencesHeader":"PDAwMTMwMWM2NTQwOSRkNzlhOTliMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11192,"nextInTopic":11196,"prevInTime":11194,"nextInTime":11196,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"... Which would be difficult to do with anything more than antecdotal references.  The statistical studies show that home educated children tend to do as well","messageBody":"<div id=\"ygrps-yiv-611466014\">On 3/30/06, Christy Putnam &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:personal_balance@...\">personal_balance@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; It is also really tempting to point out the false statements she put in<br/>\n&gt; the<br/>\n&gt; email.  More to show that I am not an idiot and I do know what I am<br/>\n&gt; talking<br/>\n&gt; about and doing...but also to say &quot;in your face!&quot;  the reason I would<br/>\n&gt; probably not do that is she would see it as a challenge and find<br/>\n&gt; everything<br/>\n&gt; she can to discredit homeschooling.<br/>\n<br/>\n<br/>\n </span></blockquote>Which would be difficult to do with anything more than antecdotal<br/>\nreferences.  The statistical studies show that home educated children tend<br/>\nto do as well as if not exceed their traditionally educated counterparts.<br/>\nThe articles that I have read that discredit homeschooling are written by<br/>\neither uninformed individuals who have no information than what they make up<br/>\nin their heads or by those that are basing their entire homeschool<br/>\ninformation data on one poor example (and usually they are seeing that<br/>\nexample from an exterior viewpoint - some family at church or that they see<br/>\naround town or know of through a friend of a friend.)  I find that the<br/>\narticles written by those in the &quot;education field&quot; can&#39;t argue the learning<br/>\naspect based on statistics, so they tend to argue points such as limited<br/>\nexposure to extra curricular activities (that means sports, cheerleading,<br/>\nchorus and band) or poor socialisation skills.  And most of the time these<br/>\narticles a written based on their hypothesis, not based on anything that<br/>\nproves their hypothesis.  They assume that home educated families are<br/>\nsecluded and have no resources to provide sports, drama, music or art.<br/>\n<br/>\nI got into an argument with someone once who e-mailed me because of<br/>\nsomething I said on my website once (I don&#39;t have that website anymore) He<br/>\nwas adamant that I was ruining my children&#39;s futures because they were<br/>\nisolated, unsocialised and limited in what they could study.  He kept<br/>\nthrowing all these numbers at me from some supposed study.  I kept thinking,<br/>\n&quot;WTF?  Where is he getting these numbers from?&quot; So finally I asked him for<br/>\ncitation of his statistics and he suddenly was no longer interested in<br/>\ndiscussing it with me.  He made me out to be the one that was accusational.<br/>\nI googled some of the stuff he was sending me and could find it no where.<br/>\nSo obviously he was making it all up!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nCatch our new wave of color!<br/>\nBook a March show!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223344266,"authorName":"Christy Putnam","from":"&quot;Christy Putnam&quot; &lt;personal_balance@...&gt;","profile":"personal_balance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with reply to disapproving sister (long)","postDate":"1143730466","msgId":11192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTMwMWM2NTQwOSRkNzlhOTliMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11188,"nextInTopic":11195,"prevInTime":11191,"nextInTime":11193,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"I appreciate all of the replies I have received so far (keep them coming if you want).  I like the pass the dip reply but I feel like I have been doing that","messageBody":"<div id=\"ygrps-yiv-1581608174\">I appreciate all of the replies I have received so far (keep them coming if<br/>\nyou want).  I like the &quot;pass the dip&quot; reply but I feel like I have been<br/>\ndoing that reply all my life with her in an effort to keep the peace so this<br/>\ngoes much deeper than anyone can ever know.  I have always been one to let<br/>\npeople live as they will (as long as they aren&#39;t hurting anyone physically)<br/>\nso I am the same with her.  The problem comes in that she doesn&#39;t hesitate<br/>\nto openly question/judge everything I do.  A big part of me wants to reply<br/>\nto this pointing that out and telling her that if she chooses not to respect<br/>\nmy choices as a person and mother, when I respect hers then I cant put<br/>\nmyself in that position any longer.  I choose to not speak to her about any<br/>\n&#39;taboo subjects&quot; such as parenting, schooling, religion, sexual orientation,<br/>\nor politics.  If she feels the need to talk about those topics with me then<br/>\nI will have to sever the relationship.  <br/>\n <br/>\nIt is also really tempting to point out the false statements she put in the<br/>\nemail.  More to show that I am not an idiot and I do know what I am talking<br/>\nabout and doing...but also to say &quot;in your face!&quot;  the reason I would<br/>\nprobably not do that is she would see it as a challenge and find everything<br/>\nshe can to discredit homeschooling.  One thing I might say is to acknowledge<br/>\nthat there is ample ways to make ourselves &quot;right&quot; and find everything to<br/>\nsupport our own positions.  There are always people that will agree with us<br/>\nand research to support it.  it all depends on what you are looking for.  in<br/>\nthat respect I think anyone looking for understanding in a topic should try<br/>\nto prove themselves wrong...find the research that supports the others<br/>\npersons view as opposed to finding everything that agrees with your view.  I<br/>\nam parenting from my heart with what resonates with me, not based on<br/>\nresearch and statistics...though my dh would prefer that...lol  I KNOW in my<br/>\nheart that this works and I am not out to prove it to anyone, nor do I have<br/>\nto.  My kids are loved and supported to the fullest extent possible every<br/>\nmoment of every day (I am still learning and obtaining creative ways to<br/>\n&quot;reprogram&quot; us out of the distance PS and strict parenting brought us).<br/>\n <br/>\nReally the ONLY reasons we ever talk are 1) family activities/holiday plans<br/>\nand 2) our older sons are the same age and love to spend time together<br/>\nwhenever possible.  She lives 2 hrs away from me and we are both busy<br/>\nfamilies so trips to see &quot;each other&quot; are few and far between.  If the kids<br/>\nweren&#39;t so close I wouldn&#39;t mind severing ties and only being civil at<br/>\nfamily functions.  <br/>\n <br/>\nI think the reason this affects me so much is that this type of behavior has<br/>\nbeen going on all of my life with her and it is calling my mothering into<br/>\nquestion...as if she doesn&#39;t think I am worthy of being a mother.  I would<br/>\nfeel this way regardless of the person...the issue comes in the appropriate<br/>\nresponse that focuses on the positives and it centered in love, not fear.<br/>\nIf it were a stranger or just an acquaintance, it would be much easier to<br/>\ntell them to mind their own business and leave us alone...lovingly, knowing<br/>\nI would most likely never see them again.  But with her and any family<br/>\nmember or close friend, it has to be more thought out.<br/>\n <br/>\nI appreciate the well wishes and ideas of how to reply to her.  I am glad to<br/>\nhave this group to bounce ideas/thoughts off of and help me through this<br/>\nprocess of retraining myself to be a more engaged mother.  I will appreciate<br/>\nany more replies people might have.  I have made a decision to not reply to<br/>\nher until I am completely centered in love about it all...maybe as late as<br/>\nnext week..lol<br/>\n <br/>\n <br/>\nIn Gratitude,<br/>\n<br/>\nChristy Putnam<br/>\nUnschooling Mom to Aden (1) and Seth (11)<br/>\nLoving wife of Chet (ann. 7/4/04)<br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a><br/>\n<br/>\n&quot;Go confidently in the direction of your<br/>\ndreams. Live the life you have always<br/>\nimagined.&quot; - Henry David Thoreau<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help with reply to disapproving sister (long)","postDate":"1143727093","msgId":11188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxYy4xNTc2MDUzLjMxNWQzZGY1QGFvbC5jb20+"},"prevInTopic":11180,"nextInTopic":11192,"prevInTime":11187,"nextInTime":11189,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/29/2006 10:08:12 P.M. Eastern Standard Time, DanaBurdick@comcast.net writes: Perhaps  you can say that directly to her.  I sense that you","messageBody":"<div id=\"ygrps-yiv-723642891\">In a message dated 3/29/2006 10:08:12 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:DanaBurdick@...\">DanaBurdick@...</a> writes:<br/>\n<br/>\nPerhaps  you can say that <br/>\ndirectly to her.  &quot;I sense that you have some fears  about the <br/>\noutcome of our approach to education.  Is this  right?&quot;  <br/>\n<br/>\n<br/>\n************<br/>\n <br/>\nChristy, I am so sorry about your sister.  It is so hard not to have  the <br/>\nsupport of people we care about.<br/>\n <br/>\nI saw what Dana wrote above, I was thinking in a similar way.  Perhaps  a <br/>\nsimple answer of &quot;I appreciate how much you care about my children&quot;....making  <br/>\nsure it isn&#39;t sarcastic    :-)<br/>\n <br/>\nSo many people instinctively lash out at those going &quot;against the  tribe&quot;.  <br/>\nKnow in your heart that this is their issue, not yours.<br/>\n <br/>\nHugs, Leslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with reply to disapproving sister (long)","postDate":"1143688072","msgId":11180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUwZmkyOCs5ZnVhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11179,"nextInTopic":11188,"prevInTime":11179,"nextInTime":11181,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"It sounds like from your post that your sister and you have a strained relationship.  If you were discussing say, what is the best way to invest money, would","messageBody":"<div id=\"ygrps-yiv-1887258621\">It sounds like from your post that your sister and you have a <br/>\nstrained relationship.  If you were discussing say, what is the best <br/>\nway to invest money, would you automatically disagree?  Or, would <br/>\nyou automatically disagree on something less important such as what <br/>\nis the best way to cook a turkey.  In other words, is any topic <br/>\nfodder for disagreement?  Or, are their levels of disagreements?  <br/>\nWhere does your relationship sit, in general and where does <br/>\nunschooling sit overall in this relationship?  What type of <br/>\nrelationship do you want to have with her?  Maybe this will help you <br/>\nthe next time an unschooling discussion begins.  Instead of <br/>\ndefending your choice to unschool, you might take the opportunity to <br/>\nbuild the relationship you want to have with her.  If you are <br/>\ndistant any way, maybe a `pass the dip&#39; response is appropriate.  <br/>\nYou might consider this only if you are truly at peace with this.  <br/>\nIf you have a closer, more amiable relationship in general or want <br/>\nto work toward a better relationship, then maybe working with her to <br/>\nunderstand her fears is more appropriate.    She seems to be very <br/>\nfearful of the outcome for your child.  Perhaps you can say that <br/>\ndirectly to her.  &quot;I sense that you have some fears about the <br/>\noutcome of our approach to education.  Is this right?&quot;  If you are <br/>\nquiet after saying that, then she may begin to open up a bit more <br/>\nwith her deeper concerns.  This approach takes energy and a true <br/>\ndesire to understand her side.  The knee-jerk reaction to this is <br/>\nthat you will cut her off too soon and begin defending your <br/>\nposition.  I would recommend not defending your position at all, but <br/>\nput the ball in her court to allow her to fully express her feelings <br/>\nand concerns.  Turn yourself momentarily into a therapist of sorts.  <br/>\nThen, in turn, you may express your own concerns for your child.   <br/>\nYou may find that you are closer in your fears and concerns than you <br/>\nthink.  The topic turns then from a discussion of unschooling, to <br/>\nconcerns about children, in general.  I&#39;m not suggesting that after <br/>\nthis everyone walks away agreeing, but your sister may feel that her <br/>\nconcerns are heard more clearly and she may be more thoughtful <br/>\nbefore speaking out critically the next time.<br/>\n<br/>\nIf your sister continues to be critical whenever the discussion <br/>\ncomes up, then you can repeat the process, but this time be honest <br/>\nwith her about how you feel when she is critical.  To express your <br/>\nfeelings clearly, you might have to take the time to be honest with <br/>\nyourself and clear in your own mind what you are feeling exactly  <br/>\nnot always an easy task.<br/>\n<br/>\nPeace,<br/>\n-Dana</div>","specialLinks":[]},{"userId":136227309,"authorName":"deirdreaycock","from":"&quot;deirdreaycock&quot; &lt;aycock@...&gt;","profile":"deirdreaycock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with reply to disapproving sister (long)","postDate":"1143687679","msgId":11179,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUwZmhsdit2cHE1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11177,"nextInTopic":11180,"prevInTime":11178,"nextInTime":11180,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"... agree with ... Christy - I have got a sister just like yours!!!!!  My brothers taught me how to deal with it, though.  When we all get together, they eat","messageBody":"<div id=\"ygrps-yiv-862493950\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Christy Putnam&quot; <br/>\n&lt;personal_balance@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; First let me preface this with the fact that my sister does not <br/>\n </span></blockquote>agree with<br/>\n<blockquote><span title=\"ireply\"> &gt; anything I ever do.  <br/>\n&gt; Anyway, here is the email she sent me:<br/>\n&gt;  <br/>\n </span></blockquote>Christy - I have got a sister just like yours!!!!!  My brothers <br/>\ntaught me how to deal with it, though.  When we all get together, <br/>\nthey eat and leave!  &quot;Well, that was wonderful!  Bye!&quot;  <br/>\nAnd that is exactly how I handle this with my sisters and mother-in-<br/>\nlaw.  To the specific email you shared with us, my sister would get <br/>\na reply that has nothing to do with what she wrote.  Leave what she <br/>\nwrote in the email so she can tell you got it.  <br/>\n<br/>\nAnd I would keep your visits with her to a minimum.  I think family <br/>\nis highly over-rated.  If this were a mere friend we were talking <br/>\nabout, you wouldn&#39;t care so much about what she thought, first of <br/>\nall.  And secondly, you wouldn&#39;t hesitate to end the friendship if <br/>\nshe persisted in trying to make you feel incompetent.  <br/>\n<br/>\nDeirdre</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1143685591","msgId":11177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzAzQUY2LTlENzktNEYxQy1BREI1LUEyQzc2Qzc2Q0Q2NkBjb3gubmV0Pg==","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4=","referencesHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11174,"nextInTopic":11179,"prevInTime":11176,"nextInTime":11178,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"Christy, As a fellow Oklahoman, I have to say to your sister...pblt! Sylvia pretty much covered everything as far as college and high school, most of the","messageBody":"<div id=\"ygrps-yiv-967270431\">Christy,<br/>\nAs a fellow Oklahoman, I have to say to your sister...pblt! Sylvia  <br/>\npretty much covered everything as far as college and high school,  <br/>\nmost of the information from your sister was pure scare tactic,  <br/>\nhoping to freak you out and get you to change your mind about  <br/>\nunschooling. If you move from one district to another you get tested,  <br/>\nso I don&#39;t know why it&#39;s such a big deal to get tested to get into a  <br/>\nschool if you&#39;ve been homeschooling.<br/>\n<br/>\nAs far as the reason that the legislation to allow homeschooling,  <br/>\nthere are no requirements because Oklahoma wanted to remain a state  <br/>\nthat facilitates homeschooling. They wanted to allow the parents to  <br/>\nchoose how to teach their own children.<br/>\nHomeschooling parents can make their own diploma&#39;s, and it is  <br/>\nlegitimate. Although no college asks for a copy of a diploma, they do  <br/>\nask for a transcript. Most colleges make allowance for homeschoolers  <br/>\nhowever, including OU, OSU, Harvard, Yale, and every single junior  <br/>\ncollege known to man. OU&#39;s requirements are ACT of 24, and SAT of  <br/>\n1000. That&#39;s it. Not even terribly high scores. I know that smaller  <br/>\nuniversities and colleges have scores of 16 to 18 for admission.<br/>\nYou know, it just makes me mad for you...because she was obviously  <br/>\nexaggerating the facts to try and scare you. The more experienced  <br/>\npeople will tell you just to smile and keep your thoughts to  <br/>\nyourself, but I&#39;d be mad. I&#39;d call her on it! I&#39;d reply that most of  <br/>\nthat is bogus and that you don&#39;t appreciate that kind of input.<br/>\n<br/>\nBut then you can tell what kind of sister I am, I&#39;m the oldest and no  <br/>\none argues with me ;-) Then again, i would never in my life consider  <br/>\ntelling friends or family that what they were doing with their child  <br/>\nwas wrong. I would passionately defend what I&#39;m doing, but never say  <br/>\nthat school was wrong because of x, y, or z.<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 29, 2006, at 6:24 PM, Christy Putnam wrote:<br/>\n&gt;<br/>\n&gt; When we were talking I was amazed about the laws with the state on<br/>\n&gt; homeschooling.  I checked into what you said to find out more about  <br/>\n&gt; it and<br/>\n&gt; found out that when the legislation passed to allow homeschooling they<br/>\n&gt; didn&#39;t apply any requirements to it because the state would have to  <br/>\n&gt; pay for<br/>\n&gt; it [I have never read that this is the reason].<br/>\n&gt; They do however &quot;strongly suggest&quot;<br/>\n&gt; that you use the &quot;pass skills&quot; guidelines provided by the state and  <br/>\n&gt; document<br/>\n&gt; progress.<br/>\n&gt; If for any reason a child would re-enter public or private schools  <br/>\n&gt; most are<br/>\n&gt; required to pass certain criteria to be admitted into each grade.<br/>\n&gt; Students who are homeschooled will &quot;not&quot; have a highschool diploma  <br/>\n&gt; or the<br/>\n&gt; equivilant!<br/>\n&gt; &quot;Some&quot; junior colleges will accept homeschooled students with  <br/>\n&gt; remediation.<br/>\n&gt; Other junior colleges and major universities require homeschool  <br/>\n&gt; children to<br/>\n&gt; pass the SAT test in the high 20&#39;s to be admitted.<br/>\n&gt; There is a good website that has the PASS SKILLS and other interesting<br/>\n&gt; information:  it is www.sde.state.ok.us &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sde.state.ok.us/\">http://www.sde.state.ok.us/</a>&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":221105640,"authorName":"Priscilla Sanstead","from":"Priscilla Sanstead &lt;bobcatpris2000@...&gt;","profile":"bobcatpris2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1143683840","msgId":11201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMzMwMDE1NzIwLjIyNTQucW1haWxAd2ViMzI0MTIubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11196,"nextInTopic":11210,"prevInTime":11200,"nextInTime":11202,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"Christy, It will get easier with your family. Right now she may be really threatened that your decision to homeschool says that her decision to public school","messageBody":"<div id=\"ygrps-yiv-1690301610\">Christy, <br/>\nIt will get easier with your family. Right now she may<br/>\nbe really threatened that your decision to homeschool<br/>\nsays that her decision to public school is stupid and<br/>\nwrong, and she wants to be right. And a lot of what<br/>\nshe is saying is just the programming that everyone in<br/>\nthis country has had about how that&#39;s the only way to<br/>\nraise and educate children---let the schools (experts)<br/>\ndo it. Your calm answers to her questions are the best<br/>\nway to hanlde it right now. Do you have a homeschool<br/>\nstate organization that has a brochure for relatives?<br/>\nMy California one has one for grandparents. Maybe if<br/>\nyou found some brief article about reasons people<br/>\nhomeschool that would help her.<br/>\n<br/>\nMy daughter is almost 13. I pulled her out of PS 3<br/>\nweeks into fifth grade. We never did baby talk. I<br/>\nnever rode around in the car with music blaring---we<br/>\nchatted about what we saw driving down the rode and<br/>\nshe learned stuff from me. We went through houses<br/>\nunder construction and talked about how they bould<br/>\nhouses. We went to the DMV at age 2 1/2 and got a<br/>\ndriver&#39;s brochure full of road sign because she loved<br/>\nthe, and she learned them all. Then we cut them out<br/>\nand put them on toothpicks and cork pieces to be signs<br/>\nin her Thomas train village. School was boooooring<br/>\nafter mom. The teachers would say &quot;Oh you can work<br/>\nwith her when she gets home&quot; Well, she was tired from<br/>\nall that stnding in line and waiting for other people<br/>\nto finish and all that school junk. We have lived a<br/>\nlife of revering books and knowledge, and watch tv for<br/>\nthe fun of history, PBS specials, technology stuff,<br/>\netc. We don&#39;t watch the junk on all the other<br/>\nchannels.<br/>\nShe never valued the popular junk and stupid parts of<br/>\nAmerican culture (like movie star/sports star<br/>\nworship).<br/>\nOf course she didn&#39;t fit in at PS. She is very behind<br/>\non math but advanced on other stuff. The local<br/>\ncommunity college here in California will take her<br/>\nunder the Category called &quot;Special Admit&quot;, and so she<br/>\nis going to take &quot;Philosophy of Religion&quot;, some fancy<br/>\nadvanced computer class, and maybe &quot;Psychology&quot; (she<br/>\nalready read the children&#39;s psych textbook that she<br/>\nfound at a used book store. Did they ask for her<br/>\nSAT/ACT? No. Did they ask for her math? No. Am I<br/>\nworried? No. (Look up www.avc.edu and go to the<br/>\nadmissions section and you can read it for<br/>\nyourself)When she needs to learn math, she will, the<br/>\nmotivation will be there. You don&#39;t teach a child, you<br/>\nget out of the way while they learn. You provide them<br/>\nwith books and things and little or big field trips<br/>\nabout what THEY are interested in. My daughter was<br/>\ngreat in math in kindergarten, but that stupid Saxon<br/>\nmath curricula and teachers that didn&#39;t want to go for<br/>\nthe extra work destroyed her love of it. She actually<br/>\ncried for a Math Camp after kindergarten. I should<br/>\nhave started homeschooling now. You are giving you<br/>\nchild the best gift imaginable. My child has plenty of<br/>\ntime to learn stuff she will need to have a college<br/>\nmajor and go to some 4 year college. I have an MBA, I<br/>\ndon&#39;t know any trig, and the liitle calculus I know<br/>\nfrom &quot;Economics of the Firm&quot; in summer school went out<br/>\nthe window long ago. I cried and got a tutor and<br/>\npassed it by the skin of my teeth. <br/>\n<br/>\nMany colleges really want Homeschoolers because they<br/>\nare so self motivated. Look at the website for UC<br/>\nRiverside (CA), and go to the link about admissions<br/>\nand making a portfolio for homeschoolers. You won&#39;t<br/>\nbelieve how easy it is. Of course I don&#39;t mean college<br/>\nis easy, but if your child wants to go after being<br/>\nhomeschooled, they can.<br/>\n<br/>\nI&#39;m getting ticked off about you sister!<br/>\n<br/>\nGet a John Gatto book from the library for emotional<br/>\nsupport. Let your sister know in your kindest voice<br/>\nthat she has a choice, too, and you&#39;d like her to<br/>\nrespect your choice. Boy, if you could homeschool<br/>\ntogether it would be so good for the kids.<br/>\nGood luck!<br/>\nPriscilla<br/>\n--- Christy Putnam &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:personal_balance@...\">personal_balance@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; First let me preface this with the fact that my<br/>\n&gt; sister does not agree with<br/>\n&gt; anything I ever do.  She doesn&#39;t respect me or my<br/>\n&gt; parenting style, ever<br/>\n&gt; (even when I was super strict), she doesn&#39;t respect<br/>\n&gt; me being pagan, and<br/>\n&gt; doesn&#39;t even attempt to understand any of it.  I was<br/>\n&gt; at her house in Tulsa,<br/>\n&gt; OK yesterday and today.  I am not sure why I even<br/>\n&gt; attempt to do things with<br/>\n&gt; her other than she *is* my sister and our boys are<br/>\n&gt; close in age.  Her kids<br/>\n&gt; are in public school and tonz of activities (I am<br/>\n&gt; not sure how they ever<br/>\n&gt; connect as a family).  The below all happened after<br/>\n&gt; she had yelled &quot;no&quot; at<br/>\n&gt; Aden several times for trying to touch an UNCOVERED<br/>\n&gt; wall socket that was at<br/>\n&gt; his eye level and had a red button on it (you know<br/>\n&gt; those kind that you can<br/>\n&gt; reset)...needless to say I should have just gone<br/>\n&gt; home at that point...<br/>\n&gt;  <br/>\n&gt; That said, I know she doesn&#39;t understand our<br/>\n&gt; decision to homeschool and when<br/>\n&gt; she asked, &quot;So, how do you homeschool?  What do you<br/>\n&gt; do?  Do you set aside<br/>\n&gt; time each day to work on things?&quot; I knew she was<br/>\n&gt; looking to judge me and<br/>\n&gt; what I do.  I am an open & honest person but know<br/>\n&gt; with her that she doesn&#39;t<br/>\n&gt; really listen because her mind is already made up to<br/>\n&gt; judge me so I don&#39;t say<br/>\n&gt; too much.  So my reply was, &quot;We learn by living<br/>\n&gt; life.  Through things he is<br/>\n&gt; interested in.&quot;  She asked, &quot;How do you do<br/>\n&gt; homeschooling, I mean do you just<br/>\n&gt; tell people you are homeschooling or what?&quot;  I told<br/>\n&gt; her that in Oklahoma we<br/>\n&gt; are not required to notify anyone of homeschooling. <br/>\n&gt; She asked, &quot;Well aren&#39;t<br/>\n&gt; there tests he has to take to make sure he is<br/>\n&gt; learning what he is supposed<br/>\n&gt; to be learning?&quot;  I said, &quot;No, no testing required.&quot;<br/>\n&gt;  She then asked, &quot;Do<br/>\n&gt; you have a curriculum?  Does the state have one you<br/>\n&gt; have to go by?&quot; I said,<br/>\n&gt; &quot;No, no curriculum.&quot;  She asked. &quot; Well what about<br/>\n&gt; grades?  He has to test<br/>\n&gt; to get into college, what about that?  Is he going<br/>\n&gt; to college?&quot;  I said, &quot;We<br/>\n&gt; don&#39;t need grades and he will go to college if he<br/>\n&gt; wants to go to college and<br/>\n&gt; we will cross those bridges when we come to them.&quot; <br/>\n&gt; She said &quot;How does he<br/>\n&gt; learn Trig or Calculus?&quot; I said, &quot;Why does he have<br/>\n&gt; to learn that?&quot;  She<br/>\n&gt; said, &quot;You know what I mean.  How does he learn<br/>\n&gt; history or English?&quot; (to<br/>\n&gt; which I should have said, shockingly &quot;He doesn&#39;t<br/>\n&gt; know English?  Oh my, I am<br/>\n&gt; not sure what language I speak then!&quot;  but of course<br/>\n&gt; I held my tongue)  I<br/>\n&gt; just said something like &quot;we learn what he wants to<br/>\n&gt; learn.  He learns the<br/>\n&gt; same way you and I do...if he wants to find<br/>\n&gt; something out he does and I help<br/>\n&gt; him.  Same as a baby (referring to my 15 mo old),<br/>\n&gt; they learn things they<br/>\n&gt; want to learn.&quot;   I then said, &quot;Look, I know it is<br/>\n&gt; not easy to understand<br/>\n&gt; because it is outside the norm but it is more about<br/>\n&gt; trusting him, trusting<br/>\n&gt; the process.&quot;  I don&#39;t remember what was said after<br/>\n&gt; that but she was<br/>\n&gt; obviously very irritated that I was so relaxed and<br/>\n&gt; unmoved by the<br/>\n&gt; questions...so much so that I even worried about her<br/>\n&gt; calling DHS on me or<br/>\n&gt; something.  Then, this morning it was just her and<br/>\n&gt; him in the living room (I<br/>\n&gt; was just in the other room and could hear<br/>\n&gt; everything) and she asked him &quot;So<br/>\n&gt; Seth, what are you learning about?&quot; To which he<br/>\n&gt; offhandedly replied,<br/>\n&gt; &quot;Animals.&quot;  She asked, &quot;What kind of animals?&quot; and<br/>\n&gt; he said, &quot;Fish.&quot; She said<br/>\n&gt; &quot;Oh, like at the aquarium&quot; (we had gone to Tulsa to<br/>\n&gt; participate in a<br/>\n&gt; homeschooling day class at the Oklahoma Aquarium on<br/>\n&gt; Tuesday (the whole<br/>\n&gt; reason we were there in the first place) He answered<br/>\n&gt; &quot;yes,&quot; and it was<br/>\n&gt; dropped.  She later asked me if he was in any<br/>\n&gt; sports.  I replied, &quot;not right<br/>\n&gt; now...we start swim lessons next week which<br/>\n&gt; conflicts with the sports<br/>\n&gt; schedules...blah blah blah&quot; she said &quot;oh so he is<br/>\n&gt; getting some exercise<br/>\n&gt; then&quot; (Seth is on the larger side and does have some<br/>\n&gt; &quot;fat rolls&quot; but he is<br/>\n&gt; not and never has been an unhealthy boy).  I figure<br/>\n&gt; she had a 2 fold reason<br/>\n&gt; for asking about sports...the &quot;fat rolls&quot; and<br/>\n&gt; socialization...since that is<br/>\n&gt; such a hard thing to get when homeschooling (yeah<br/>\n&gt; right).<br/>\n&gt;  <br/>\n&gt; So I wrote the above very long intro to ask how to<br/>\n&gt; reply to this email I<br/>\n&gt; just got from my...well meaning....sister.  I am so<br/>\n&gt; mad right now I could<br/>\n&gt; just send a really nasty email but I want to send<br/>\n&gt; one that is &quot;above that&quot;<br/>\n&gt; with facts to back up what I say...basically a<br/>\n&gt; logical reply, not an<br/>\n&gt; emotional one.  I would like it to include something<br/>\n&gt; about the fact that I<br/>\n&gt; am not an idiot and I do know what is available and<br/>\n&gt; do know what I am doing<br/>\n&gt; and that she should trust that I am not going to do<br/>\n&gt; anything to harm or<br/>\n&gt; jeopardize Seth or Aden&#39;s future...I just don&#39;t know<br/>\n&gt; how to do it right this<br/>\n&gt; minute with all this anger energy welling up inside<br/>\n&gt; of me.  I would<br/>\n&gt; appreciate any help you all could give in how I<br/>\n&gt; could reply with respect,<br/>\n&gt; love and peace...as that is what I would like to<br/>\n&gt; model in all instances.<br/>\n&gt; Anyway, here is the email she sent me:<br/>\n&gt;  <br/>\n&gt; When we were talking I was amazed about the laws<br/>\n&gt; with the state on<br/>\n&gt; homeschooling.  I checked into what you said to find<br/>\n&gt; out more about it and<br/>\n&gt; found out that when the legislation passed to allow<br/>\n&gt; homeschooling they<br/>\n&gt; didn&#39;t apply any requirements to it because the<br/>\n&gt; state would have to pay for<br/>\n&gt; it [I have never read that this is the reason].  <br/>\n&gt; They do however &quot;strongly suggest&quot;<br/>\n&gt; that you use the &quot;pass skills&quot; guidelines provided<br/>\n&gt; by the state and document<br/>\n&gt; progress.  <br/>\n&gt; If for any reason a child would re-enter public or<br/>\n&gt; private schools most are<br/>\n&gt; required to pass certain criteria to be admitted<br/>\n&gt; into each grade. <br/>\n&gt; Students who are homeschooled will &quot;not&quot; have a<br/>\n&gt; highschool diploma or the<br/>\n&gt; equivilant! <br/>\n&gt; &quot;Some&quot; junior colleges will accept homeschooled<br/>\n&gt; students with remediation.  <br/>\n&gt; Other junior colleges and major universities require<br/>\n&gt; homeschool children to<br/>\n&gt; pass the SAT test in the high 20&#39;s to be admitted.<br/>\n&gt; There is a good website that has the PASS SKILLS and<br/>\n&gt; other interesting<br/>\n&gt; information:  it is www.sde.state.ok.us<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sde.state.ok.us/\">http://www.sde.state.ok.us/</a>&gt; <br/>\n&gt; It also looked like there were good phone numbers to<br/>\n&gt; call for more<br/>\n&gt; information.<br/>\n&gt;  <br/>\n&gt; Didn&#39;t know if you knew any of this....just wanted<br/>\n&gt; to let you know what I<br/>\n&gt; had found.<br/>\n&gt;  <br/>\n&gt; In Gratitude,<br/>\n&gt; <br/>\n&gt; Christy Putnam<br/>\n&gt; Unschooling Mom to Aden (1) and Seth (11)<br/>\n&gt; Loving wife of Chet (ann. 7/4/04)<br/>\n&gt; <br/>\n&gt;  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a>&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a><br/>\n&gt; <br/>\n&gt; &quot;Go confidently in the direction of your<br/>\n&gt; dreams. Live the life you have always<br/>\n&gt; imagined.&quot; - Henry David Thoreau<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been<br/>\n&gt; removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1143683432","msgId":11174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjAzMjkxNzUwdjIzYmE5MjRuZTc0NmQwZGNhMGEzMjNlZUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDIwMDYwMzMwMDExMDI3LjEzODA5LnFtYWlsQHdlYjUzODEwLm1haWwueWFob28uY29tPg==","referencesHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4JIDwyMDA2MDMzMDAxMTAyNy4xMzgwOS5xbWFpbEB3ZWI1MzgxMC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":11172,"nextInTopic":11177,"prevInTime":11173,"nextInTime":11175,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"... And the SAT s are scored in the hundreds not the twenties.  I scored a 27 on my ACT and my composite score for my SAT was in the 900 s.  I used to be so ","messageBody":"<div id=\"ygrps-yiv-990235879\">On 3/29/06, Sylvia Toyama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; *****<br/>\n&gt;<br/>\n&gt; Other junior colleges and major universities require homeschool children<br/>\n&gt; to pass the SAT test in the high 20&#39;s to be admitted.<br/>\n&gt;<br/>\n&gt; Last time I checked, all universities required students to have passed<br/>\n&gt; either the ACT (for instate graduates) or the SAT (out of state or private<br/>\n&gt; schools) for admission, even with a public high school diploma.  It&#39;s a<br/>\n&gt; condition for all applicants, not just homeschoolers.  Otherwise, why would<br/>\n&gt; so many high school juniors bother to take the SAT at all?  What a stupid<br/>\n&gt; statement.<br/>\n<br/>\n<br/>\n </span></blockquote>And the SAT&#39;s are scored in the hundreds not the twenties.  I scored a 27 on<br/>\nmy ACT and my composite score for my SAT was in the 900&#39;s.  I used to be so<br/>\nsmart LOL!  So if someone only needed to score in the high 20&#39;s on the<br/>\nSAT to be admitted to college I suppose they just needed to show up and be<br/>\nable to fill their name out.<br/>\n<br/>\nWhen people start giving me bogus information about the &quot;future of my<br/>\nchildren&quot; I tend to send them to the military academy FAQ page which covers<br/>\nthe admittance of homeschooled kids into military academies.  Here is the<br/>\nlink to the Naval Academy:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.usna.edu/Admissions/steps.htm\">http://www.usna.edu/Admissions/steps.htm</a><br/>\n<br/>\nAnd I tell them that if my child wishes to attend the Naval Academy (we come<br/>\nfrom multiple generations of sailors) then they will work towards these<br/>\nrequirements.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nCatch our new wave of color!<br/>\nBook a March show!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1143681027","msgId":11172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMzMwMDExMDI3LjEzODA5LnFtYWlsQHdlYjUzODEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11169,"nextInTopic":11174,"prevInTime":11171,"nextInTime":11173,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"Well, let s see.  Your first option is to ignore her email outright.  Or you could tell her you ve said all you re going to on the topic, then refuse to answer","messageBody":"<div id=\"ygrps-yiv-813541761\">Well, let&#39;s see.  Your first option is to ignore her email outright.  Or you could tell her you&#39;ve said all you&#39;re going to on the topic, then refuse to answer future emails on this subject.  You could suggest that you and she can discuss un/homeschooling only once she&#39;s read at least 2 (or whatever number appeals to you) books, chosen by you, about the topic.  Maybe she could read something by John Holt and Rue&#39;s book, or Sandra&#39;s book.  Then, at least you and she would be on equal footing.  Or maybe she&#39;d refuse to read anything, and you could agree to disagree and not talk about it.  <br/>\n   <br/>\n  My sister and I used to disagree about it, tho not strongly because we&#39;ve always had very different styles. Then, last February she pulled her kids out of school, and gradually she&#39;s landed in unschooling her daughter (her son has chosen to return to high school in the fall).  This September, she hopes to give a funshop at the Live & Learn!  So, we went from disagreeing to me bringing her over to our side! <br/>\n   <br/>\n  Anyway, some idea for how to reply if you decide to:<br/>\n   <br/>\n  &quot;If for any reason a child would re-enter public or private schools most are required to pass certain criteria to be admitted into each grade.&quot;<br/>\n   <br/>\n  Okay, so if they decide to attend school, they&#39;ll take a test.  Often, the same is true for kids moving from one state to another, regardless of school attendance.  This is done to better assess what incoming students might need in remediation. <br/>\n   <br/>\n  ****<br/>\n  Students who are homeschooled will &quot;not&quot; have a highschool diploma or the equivilant!<br/>\n   <br/>\n  People (even non-students) who take and pass the GED will have a diploma -- and maybe they&#39;ll even be able to spell equivalent correctly!  And they could take the GED earlier than they would have graduated -- should they find a need to do so -- and be ahead of their peers.  <br/>\n   <br/>\n  *****<br/>\n   <br/>\n&quot;Some&quot; junior colleges will accept homeschooled students with remediation. <br/>\n   <br/>\n  Total crap -- virtually all junior (community) colleges accept anyone whose check doesn&#39;t bounce. <br/>\n   <br/>\n  *****<br/>\n   <br/>\nOther junior colleges and major universities require homeschool children to pass the SAT test in the high 20&#39;s to be admitted.<br/>\n   <br/>\n  Last time I checked, all universities required students to have passed either the ACT (for instate graduates) or the SAT (out of state or private schools) for admission, even with a public high school diploma.  It&#39;s a condition for all applicants, not just homeschoolers.  Otherwise, why would so many high school juniors bother to take the SAT at all?  What a stupid statement. <br/>\n   <br/>\n  Of course, feel free to be nicer to your sister than I have been above. <br/>\n   <br/>\n  Sylvia<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n          Mom to Will (21) Andy (9) and Dan (5) <br/>\n     <br/>\n  Let the beauty you love be what you do  --  Rumi<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nNew Yahoo! Messenger with Voice. Call regular phones from your PC and save big.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with reply to disapproving sister (long)","postDate":"1143680351","msgId":11169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUwZmFnditpZmhpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11160,"nextInTopic":11172,"prevInTime":11168,"nextInTime":11170,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"I agree with Kristie -- that approach, gee, thanks, I did know that, and I appreciate your concern, and drop the hsing topic, is probably the best.  Generally,","messageBody":"<div id=\"ygrps-yiv-528333805\">I agree with Kristie -- that approach, gee, thanks, I did know that, <br/>\nand I appreciate your concern, and drop the hsing topic, is probably <br/>\nthe best.  Generally, if I can put a positive spin on someone&#39;s <br/>\nmotives -- in this case, that she truly cares about your children&#39;s <br/>\nwell-being -- then I do.  Makes me a happier person, and if I&#39;m <br/>\nwrong, I will be happy to walk in ignorance.  <br/>\n<br/>\nAs for some other things -- well, did she never see public schooled <br/>\nkids with love handles?  I sure have!  &quot;Official&quot; PE doesn&#39;t prevent <br/>\nthat!<br/>\n<br/>\nI commend you for waiting, taking a deep breath, and taking the high <br/>\nroad.  It may not be easy, but you&#39;ll sleep better!<br/>\n<br/>\nLinda<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Christy Putnam&quot; <br/>\n&lt;personal_balance@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; First let me preface this with the fact that my sister does not <br/>\n </span></blockquote>agree with<br/>\n<blockquote><span title=\"ireply\"> &gt; anything I ever do.  She doesn&#39;t respect me or my parenting style, <br/>\n </span></blockquote>ever<br/>\n<blockquote><span title=\"ireply\"> &gt; (even when I was super strict), she doesn&#39;t respect me being pagan, <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; doesn&#39;t even attempt to understand any of it.  I was at her house <br/>\n </span></blockquote>in Tulsa,<br/>\n<blockquote><span title=\"ireply\"> &gt; OK yesterday and today.  I am not sure why I even attempt to do <br/>\n </span></blockquote>things with<br/>\n<blockquote><span title=\"ireply\"> &gt; her other than she *is* my sister and our boys are close in age.  <br/>\n </span></blockquote>Her kids<br/>\n<blockquote><span title=\"ireply\"> &gt; are in public school and tonz of activities (I am not sure how they <br/>\n </span></blockquote>ever<br/>\n<blockquote><span title=\"ireply\"> &gt; connect as a family).  The below all happened after she had <br/>\n </span></blockquote>yelled &quot;no&quot; at<br/>\n<blockquote><span title=\"ireply\"> &gt; Aden several times for trying to touch an UNCOVERED wall socket <br/>\n </span></blockquote>that was at<br/>\n<blockquote><span title=\"ireply\"> &gt; his eye level and had a red button on it (you know those kind that <br/>\n </span></blockquote>you can<br/>\n<blockquote><span title=\"ireply\"> &gt; reset)...needless to say I should have just gone home at that <br/>\n </span></blockquote>point...<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; That said, I know she doesn&#39;t understand our decision to homeschool <br/>\n </span></blockquote>and when<br/>\n<blockquote><span title=\"ireply\"> &gt; she asked, &quot;So, how do you homeschool?  What do you do?  Do you set <br/>\n </span></blockquote>aside<br/>\n<blockquote><span title=\"ireply\"> &gt; time each day to work on things?&quot; I knew she was looking to judge <br/>\n </span></blockquote>me and<br/>\n<blockquote><span title=\"ireply\"> &gt; what I do.  I am an open & honest person but know with her that she <br/>\n </span></blockquote>doesn&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; really listen because her mind is already made up to judge me so I <br/>\n </span></blockquote>don&#39;t say<br/>\n<blockquote><span title=\"ireply\"> &gt; too much.  So my reply was, &quot;We learn by living life.  Through <br/>\n </span></blockquote>things he is<br/>\n<blockquote><span title=\"ireply\"> &gt; interested in.&quot;  She asked, &quot;How do you do homeschooling, I mean do <br/>\n </span></blockquote>you just<br/>\n<blockquote><span title=\"ireply\"> &gt; tell people you are homeschooling or what?&quot;  I told her that in <br/>\n </span></blockquote>Oklahoma we<br/>\n<blockquote><span title=\"ireply\"> &gt; are not required to notify anyone of homeschooling.  She <br/>\n </span></blockquote>asked, &quot;Well aren&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; there tests he has to take to make sure he is learning what he is <br/>\n </span></blockquote>supposed<br/>\n<blockquote><span title=\"ireply\"> &gt; to be learning?&quot;  I said, &quot;No, no testing required.&quot;  She then <br/>\n </span></blockquote>asked, &quot;Do<br/>\n<blockquote><span title=\"ireply\"> &gt; you have a curriculum?  Does the state have one you have to go by?&quot; <br/>\n </span></blockquote>I said,<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;No, no curriculum.&quot;  She asked. &quot; Well what about grades?  He has <br/>\n </span></blockquote>to test<br/>\n<blockquote><span title=\"ireply\"> &gt; to get into college, what about that?  Is he going to college?&quot;  I <br/>\n </span></blockquote>said, &quot;We<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t need grades and he will go to college if he wants to go to <br/>\n </span></blockquote>college and<br/>\n<blockquote><span title=\"ireply\"> &gt; we will cross those bridges when we come to them.&quot;  She said &quot;How <br/>\n </span></blockquote>does he<br/>\n<blockquote><span title=\"ireply\"> &gt; learn Trig or Calculus?&quot; I said, &quot;Why does he have to learn that?&quot;  <br/>\n </span></blockquote>She<br/>\n<blockquote><span title=\"ireply\"> &gt; said, &quot;You know what I mean.  How does he learn history or <br/>\n </span></blockquote>English?&quot; (to<br/>\n<blockquote><span title=\"ireply\"> &gt; which I should have said, shockingly &quot;He doesn&#39;t know English?  Oh <br/>\n </span></blockquote>my, I am<br/>\n<blockquote><span title=\"ireply\"> &gt; not sure what language I speak then!&quot;  but of course I held my <br/>\n </span></blockquote>tongue)  I<br/>\n<blockquote><span title=\"ireply\"> &gt; just said something like &quot;we learn what he wants to learn.  He <br/>\n </span></blockquote>learns the<br/>\n<blockquote><span title=\"ireply\"> &gt; same way you and I do...if he wants to find something out he does <br/>\n </span></blockquote>and I help<br/>\n<blockquote><span title=\"ireply\"> &gt; him.  Same as a baby (referring to my 15 mo old), they learn things <br/>\n </span></blockquote>they<br/>\n<blockquote><span title=\"ireply\"> &gt; want to learn.&quot;   I then said, &quot;Look, I know it is not easy to <br/>\n </span></blockquote>understand<br/>\n<blockquote><span title=\"ireply\"> &gt; because it is outside the norm but it is more about trusting him, <br/>\n </span></blockquote>trusting<br/>\n<blockquote><span title=\"ireply\"> &gt; the process.&quot;  I don&#39;t remember what was said after that but she was<br/>\n&gt; obviously very irritated that I was so relaxed and unmoved by the<br/>\n&gt; questions...so much so that I even worried about her calling DHS on <br/>\n </span></blockquote>me or<br/>\n<blockquote><span title=\"ireply\"> &gt; something.  Then, this morning it was just her and him in the <br/>\n </span></blockquote>living room (I<br/>\n<blockquote><span title=\"ireply\"> &gt; was just in the other room and could hear everything) and she asked <br/>\n </span></blockquote>him &quot;So<br/>\n<blockquote><span title=\"ireply\"> &gt; Seth, what are you learning about?&quot; To which he offhandedly replied,<br/>\n&gt; &quot;Animals.&quot;  She asked, &quot;What kind of animals?&quot; and he said, &quot;Fish.&quot; <br/>\n </span></blockquote>She said<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Oh, like at the aquarium&quot; (we had gone to Tulsa to participate in a<br/>\n&gt; homeschooling day class at the Oklahoma Aquarium on Tuesday (the <br/>\n </span></blockquote>whole<br/>\n<blockquote><span title=\"ireply\"> &gt; reason we were there in the first place) He answered &quot;yes,&quot; and it <br/>\n </span></blockquote>was<br/>\n<blockquote><span title=\"ireply\"> &gt; dropped.  She later asked me if he was in any sports.  I <br/>\n </span></blockquote>replied, &quot;not right<br/>\n<blockquote><span title=\"ireply\"> &gt; now...we start swim lessons next week which conflicts with the <br/>\n </span></blockquote>sports<br/>\n<blockquote><span title=\"ireply\"> &gt; schedules...blah blah blah&quot; she said &quot;oh so he is getting some <br/>\n </span></blockquote>exercise<br/>\n<blockquote><span title=\"ireply\"> &gt; then&quot; (Seth is on the larger side and does have some &quot;fat rolls&quot; <br/>\n </span></blockquote>but he is<br/>\n<blockquote><span title=\"ireply\"> &gt; not and never has been an unhealthy boy).  I figure she had a 2 <br/>\n </span></blockquote>fold reason<br/>\n<blockquote><span title=\"ireply\"> &gt; for asking about sports...the &quot;fat rolls&quot; and socialization...since <br/>\n </span></blockquote>that is<br/>\n<blockquote><span title=\"ireply\"> &gt; such a hard thing to get when homeschooling (yeah right).<br/>\n&gt;  <br/>\n&gt; So I wrote the above very long intro to ask how to reply to this <br/>\n </span></blockquote>email I<br/>\n<blockquote><span title=\"ireply\"> &gt; just got from my...well meaning....sister.  I am so mad right now I <br/>\n </span></blockquote>could<br/>\n<blockquote><span title=\"ireply\"> &gt; just send a really nasty email but I want to send one that <br/>\n </span></blockquote>is &quot;above that&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; with facts to back up what I say...basically a logical reply, not an<br/>\n&gt; emotional one.  I would like it to include something about the fact <br/>\n </span></blockquote>that I<br/>\n<blockquote><span title=\"ireply\"> &gt; am not an idiot and I do know what is available and do know what I <br/>\n </span></blockquote>am doing<br/>\n<blockquote><span title=\"ireply\"> &gt; and that she should trust that I am not going to do anything to <br/>\n </span></blockquote>harm or<br/>\n<blockquote><span title=\"ireply\"> &gt; jeopardize Seth or Aden&#39;s future...I just don&#39;t know how to do it <br/>\n </span></blockquote>right this<br/>\n<blockquote><span title=\"ireply\"> &gt; minute with all this anger energy welling up inside of me.  I would<br/>\n&gt; appreciate any help you all could give in how I could reply with <br/>\n </span></blockquote>respect,<br/>\n<blockquote><span title=\"ireply\"> &gt; love and peace...as that is what I would like to model in all <br/>\n </span></blockquote>instances.<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway, here is the email she sent me:<br/>\n&gt;  <br/>\n&gt; When we were talking I was amazed about the laws with the state on<br/>\n&gt; homeschooling.  I checked into what you said to find out more about <br/>\n </span></blockquote>it and<br/>\n<blockquote><span title=\"ireply\"> &gt; found out that when the legislation passed to allow homeschooling <br/>\n </span></blockquote>they<br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t apply any requirements to it because the state would have to <br/>\n </span></blockquote>pay for<br/>\n<blockquote><span title=\"ireply\"> &gt; it [I have never read that this is the reason].  <br/>\n&gt; They do however &quot;strongly suggest&quot;<br/>\n&gt; that you use the &quot;pass skills&quot; guidelines provided by the state and <br/>\n </span></blockquote>document<br/>\n<blockquote><span title=\"ireply\"> &gt; progress.  <br/>\n&gt; If for any reason a child would re-enter public or private schools <br/>\n </span></blockquote>most are<br/>\n<blockquote><span title=\"ireply\"> &gt; required to pass certain criteria to be admitted into each grade. <br/>\n&gt; Students who are homeschooled will &quot;not&quot; have a highschool diploma <br/>\n </span></blockquote>or the<br/>\n<blockquote><span title=\"ireply\"> &gt; equivilant! <br/>\n&gt; &quot;Some&quot; junior colleges will accept homeschooled students with <br/>\n </span></blockquote>remediation.  <br/>\n<blockquote><span title=\"ireply\"> &gt; Other junior colleges and major universities require homeschool <br/>\n </span></blockquote>children to<br/>\n<blockquote><span title=\"ireply\"> &gt; pass the SAT test in the high 20&#39;s to be admitted.<br/>\n&gt; There is a good website that has the PASS SKILLS and other <br/>\n </span></blockquote>interesting<br/>\n<blockquote><span title=\"ireply\"> &gt; information:  it is www.sde.state.ok.us <br/>\n </span></blockquote>&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sde.state.ok.us/\">http://www.sde.state.ok.us/</a>&gt; <br/>\n<blockquote><span title=\"ireply\"> &gt; It also looked like there were good phone numbers to call for more<br/>\n&gt; information.<br/>\n&gt;  <br/>\n&gt; Didn&#39;t know if you knew any of this....just wanted to let you know <br/>\n </span></blockquote>what I<br/>\n<blockquote><span title=\"qreply\"> &gt; had found.<br/>\n&gt;  <br/>\n&gt; In Gratitude,<br/>\n&gt; <br/>\n&gt; Christy Putnam<br/>\n&gt; Unschooling Mom to Aden (1) and Seth (11)<br/>\n&gt; Loving wife of Chet (ann. 7/4/04)<br/>\n&gt; <br/>\n&gt;  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a>&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a><br/>\n&gt; <br/>\n&gt; &quot;Go confidently in the direction of your<br/>\n&gt; dreams. Live the life you have always<br/>\n&gt; imagined.&quot; - Henry David Thoreau<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1143679712","msgId":11160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjAzMjkxNjQ4eDViM2NkOTlldGVhNDdkYmFjOTAwYjI0ZmRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4=","referencesHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11159,"nextInTopic":11169,"prevInTime":11159,"nextInTime":11161,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"... It sounds like your sister will never be happy with anything that you do. So I wouldn t try to explain anything.  Even if you had a great curriculum with a","messageBody":"<div id=\"ygrps-yiv-260266636\">On 3/29/06, Christy Putnam &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:personal_balance@...\">personal_balance@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; First let me preface this with the fact that my sister does not agree with<br/>\n&gt; anything I ever do.  She doesn&#39;t respect me or my parenting style, ever<br/>\n&gt; (even when I was super strict), she doesn&#39;t respect me being pagan, and<br/>\n&gt; doesn&#39;t even attempt to understand any of it.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>It sounds like your sister will never be happy with anything that you do.<br/>\nSo I wouldn&#39;t try to explain anything.  Even if you had a great curriculum<br/>\nwith a well-laid out &quot;master plan&quot; so your children could get into college,<br/>\na rigorous diet and exercise program and structured socialisation activities<br/>\nshe probably still wouldn&#39;t be satisfied. She sounds like she is the type<br/>\nthat is critical of anything that is outside of her walls.<br/>\n<br/>\nThe best thing that you can do is to keep living your life for you and your<br/>\nfamily.  Give her basic answers and make sure that you present yourself with<br/>\na positive attitude about whatever it is you are doing.<br/>\n<br/>\nI, too, have a son who is rounder in the middle than most kids his age.  He<br/>\ndoesn&#39;t like sports.  His idea of going outside and playing is to go sit in<br/>\nthe grass and watch the ants carry things or to water our new garden and<br/>\ninspect the progress of our seedlings.  Sometimes he will fly an airplane or<br/>\nplay at some made up game.  He enjoys watching tv, playing video and<br/>\ncomputer games, cooking and other sedentary things.  In the summer we go<br/>\nto a friend&#39;s pool and swim once a week or so (the kids are marking down to<br/>\nApril 1st when she said we can return) and he enjoys that but I wouldn&#39;t<br/>\ncall him a &quot;swimmer&quot;  (it looks a whole lot like thrashing around in the<br/>\nwater.)  I get comments from my mother all the time (she is much like your<br/>\nsister and always &quot;testing&quot; the kids to see if they know things.)<br/>\n&quot;Shouldn&#39;t you limit his food?&quot; (We do to a point as he has problems with<br/>\nself-regulation in many areas of his life.)  &quot;Is he going to play (fill in<br/>\nname of sport here) this season?&quot;  &quot;What does his doctor say about his<br/>\nweight?&quot;  (What doctor - she knows we don&#39;t go to one unless we are sick to<br/>\nthe point of needing one.)  It&#39;s a constant barage of questions evertime I&#39;m<br/>\nover there.  So I don&#39;t go over there often.  And fortunately, she has the<br/>\ncommon sense not to bring those things up at my house.<br/>\n<br/>\nIf you are happy with your life, then you don&#39;t need to answer to anyone<br/>\nelse, even your sister.  I did, though, once tell my mom, &quot;Do you not trust<br/>\nthat I would do what I believe is best for my children?&quot;  It helped cut out<br/>\nthe nosy questions, but she just got more sly in how she went about &quot;asking&quot;<br/>\nthem<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nCatch our new wave of color!<br/>\nBook a March show!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220015843,"authorName":"Kristie Cochran","from":"Kristie Cochran &lt;kristiecochran@...&gt;","profile":"kristiecochran","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1143679669","msgId":11159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0MkIyQUI1LjIwMDA2MDBAY294Lm5ldD4=","inReplyToHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4=","referencesHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":11158,"nextInTopic":11160,"prevInTime":11158,"nextInTime":11160,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"I d just say, Thanks, I already knew that.  I do appreciate your interest in homeschooling.  Thanks for letting us stay with you.  We had a great time at the","messageBody":"<div id=\"ygrps-yiv-198465095\">I&#39;d just say, &quot;Thanks, I already knew that.  I do appreciate your <br/>\ninterest in homeschooling.  Thanks for letting us stay with you.  We had <br/>\na great time at the aquarium.&quot;  And just leave it at that.  Don&#39;t give <br/>\nher an &quot;in&quot; to write you another email on the subject.<br/>\n<br/>\nThis is akin to the &quot;bean dip&quot; response to unwanted advice.  &quot;Thanks, <br/>\nand please pass the bean dip.&quot;<br/>\n<br/>\nKristie</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help with reply to disapproving sister (long)","postDate":"1143679021","msgId":11158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwZi4xNDgyYjBkYS4zMTVjODIyZEBhb2wuY29tPg=="},"prevInTopic":11157,"nextInTopic":11159,"prevInTime":11157,"nextInTime":11159,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"Sandra Dodd has a page on this: _http://sandradodd.com/unschool/relatives_ (http://sandradodd.com/unschool/relatives) And... Joyce fetteroll~How to respond to","messageBody":"<div id=\"ygrps-yiv-890415532\">Sandra Dodd has a page on this:<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/relatives_\">http://sandradodd.com/unschool/relatives_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/relatives)\">http://sandradodd.com/unschool/relatives)</a> <br/>\n <br/>\nAnd...<br/>\nJoyce fetteroll~How to respond to negative relatives <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/negative%20people/negativerela\">http://home.earthlink.net/~fetteroll/rejoycing/negative%20people/negativerela</a><br/>\ntives.html_ <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/negative%20people/negativerelatives.html)\">http://home.earthlink.net/~fetteroll/rejoycing/negative%20people/negativerelatives.html)</a> <br/>\n <br/>\nBe strong,<br/>\nLaura<br/>\n <br/>\nUnschoolingmaine.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223344266,"authorName":"Christy Putnam","from":"&quot;Christy Putnam&quot; &lt;personal_balance@...&gt;","profile":"personal_balance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Help with reply to disapproving sister (long)","postDate":"1143678293","msgId":11157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxM2EwMWM2NTM5MCQ1ZGFlN2MzMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":0,"nextInTopic":11158,"prevInTime":11156,"nextInTime":11158,"topicId":11157,"numMessagesInTopic":0,"msgSnippet":"First let me preface this with the fact that my sister does not agree with anything I ever do.  She doesn t respect me or my parenting style, ever (even when I","messageBody":"<div id=\"ygrps-yiv-42405694\">First let me preface this with the fact that my sister does not agree with<br/>\nanything I ever do.  She doesn&#39;t respect me or my parenting style, ever<br/>\n(even when I was super strict), she doesn&#39;t respect me being pagan, and<br/>\ndoesn&#39;t even attempt to understand any of it.  I was at her house in Tulsa,<br/>\nOK yesterday and today.  I am not sure why I even attempt to do things with<br/>\nher other than she *is* my sister and our boys are close in age.  Her kids<br/>\nare in public school and tonz of activities (I am not sure how they ever<br/>\nconnect as a family).  The below all happened after she had yelled &quot;no&quot; at<br/>\nAden several times for trying to touch an UNCOVERED wall socket that was at<br/>\nhis eye level and had a red button on it (you know those kind that you can<br/>\nreset)...needless to say I should have just gone home at that point...<br/>\n <br/>\nThat said, I know she doesn&#39;t understand our decision to homeschool and when<br/>\nshe asked, &quot;So, how do you homeschool?  What do you do?  Do you set aside<br/>\ntime each day to work on things?&quot; I knew she was looking to judge me and<br/>\nwhat I do.  I am an open & honest person but know with her that she doesn&#39;t<br/>\nreally listen because her mind is already made up to judge me so I don&#39;t say<br/>\ntoo much.  So my reply was, &quot;We learn by living life.  Through things he is<br/>\ninterested in.&quot;  She asked, &quot;How do you do homeschooling, I mean do you just<br/>\ntell people you are homeschooling or what?&quot;  I told her that in Oklahoma we<br/>\nare not required to notify anyone of homeschooling.  She asked, &quot;Well aren&#39;t<br/>\nthere tests he has to take to make sure he is learning what he is supposed<br/>\nto be learning?&quot;  I said, &quot;No, no testing required.&quot;  She then asked, &quot;Do<br/>\nyou have a curriculum?  Does the state have one you have to go by?&quot; I said,<br/>\n&quot;No, no curriculum.&quot;  She asked. &quot; Well what about grades?  He has to test<br/>\nto get into college, what about that?  Is he going to college?&quot;  I said, &quot;We<br/>\ndon&#39;t need grades and he will go to college if he wants to go to college and<br/>\nwe will cross those bridges when we come to them.&quot;  She said &quot;How does he<br/>\nlearn Trig or Calculus?&quot; I said, &quot;Why does he have to learn that?&quot;  She<br/>\nsaid, &quot;You know what I mean.  How does he learn history or English?&quot; (to<br/>\nwhich I should have said, shockingly &quot;He doesn&#39;t know English?  Oh my, I am<br/>\nnot sure what language I speak then!&quot;  but of course I held my tongue)  I<br/>\njust said something like &quot;we learn what he wants to learn.  He learns the<br/>\nsame way you and I do...if he wants to find something out he does and I help<br/>\nhim.  Same as a baby (referring to my 15 mo old), they learn things they<br/>\nwant to learn.&quot;   I then said, &quot;Look, I know it is not easy to understand<br/>\nbecause it is outside the norm but it is more about trusting him, trusting<br/>\nthe process.&quot;  I don&#39;t remember what was said after that but she was<br/>\nobviously very irritated that I was so relaxed and unmoved by the<br/>\nquestions...so much so that I even worried about her calling DHS on me or<br/>\nsomething.  Then, this morning it was just her and him in the living room (I<br/>\nwas just in the other room and could hear everything) and she asked him &quot;So<br/>\nSeth, what are you learning about?&quot; To which he offhandedly replied,<br/>\n&quot;Animals.&quot;  She asked, &quot;What kind of animals?&quot; and he said, &quot;Fish.&quot; She said<br/>\n&quot;Oh, like at the aquarium&quot; (we had gone to Tulsa to participate in a<br/>\nhomeschooling day class at the Oklahoma Aquarium on Tuesday (the whole<br/>\nreason we were there in the first place) He answered &quot;yes,&quot; and it was<br/>\ndropped.  She later asked me if he was in any sports.  I replied, &quot;not right<br/>\nnow...we start swim lessons next week which conflicts with the sports<br/>\nschedules...blah blah blah&quot; she said &quot;oh so he is getting some exercise<br/>\nthen&quot; (Seth is on the larger side and does have some &quot;fat rolls&quot; but he is<br/>\nnot and never has been an unhealthy boy).  I figure she had a 2 fold reason<br/>\nfor asking about sports...the &quot;fat rolls&quot; and socialization...since that is<br/>\nsuch a hard thing to get when homeschooling (yeah right).<br/>\n <br/>\nSo I wrote the above very long intro to ask how to reply to this email I<br/>\njust got from my...well meaning....sister.  I am so mad right now I could<br/>\njust send a really nasty email but I want to send one that is &quot;above that&quot;<br/>\nwith facts to back up what I say...basically a logical reply, not an<br/>\nemotional one.  I would like it to include something about the fact that I<br/>\nam not an idiot and I do know what is available and do know what I am doing<br/>\nand that she should trust that I am not going to do anything to harm or<br/>\njeopardize Seth or Aden&#39;s future...I just don&#39;t know how to do it right this<br/>\nminute with all this anger energy welling up inside of me.  I would<br/>\nappreciate any help you all could give in how I could reply with respect,<br/>\nlove and peace...as that is what I would like to model in all instances.<br/>\nAnyway, here is the email she sent me:<br/>\n <br/>\nWhen we were talking I was amazed about the laws with the state on<br/>\nhomeschooling.  I checked into what you said to find out more about it and<br/>\nfound out that when the legislation passed to allow homeschooling they<br/>\ndidn&#39;t apply any requirements to it because the state would have to pay for<br/>\nit [I have never read that this is the reason].  <br/>\nThey do however &quot;strongly suggest&quot;<br/>\nthat you use the &quot;pass skills&quot; guidelines provided by the state and document<br/>\nprogress.  <br/>\nIf for any reason a child would re-enter public or private schools most are<br/>\nrequired to pass certain criteria to be admitted into each grade. <br/>\nStudents who are homeschooled will &quot;not&quot; have a highschool diploma or the<br/>\nequivilant! <br/>\n&quot;Some&quot; junior colleges will accept homeschooled students with remediation.  <br/>\nOther junior colleges and major universities require homeschool children to<br/>\npass the SAT test in the high 20&#39;s to be admitted.<br/>\nThere is a good website that has the PASS SKILLS and other interesting<br/>\ninformation:  it is www.sde.state.ok.us &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sde.state.ok.us/\">http://www.sde.state.ok.us/</a>&gt; <br/>\nIt also looked like there were good phone numbers to call for more<br/>\ninformation.<br/>\n <br/>\nDidn&#39;t know if you knew any of this....just wanted to let you know what I<br/>\nhad found.<br/>\n <br/>\nIn Gratitude,<br/>\n<br/>\nChristy Putnam<br/>\nUnschooling Mom to Aden (1) and Seth (11)<br/>\nLoving wife of Chet (ann. 7/4/04)<br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a><br/>\n<br/>\n&quot;Go confidently in the direction of your<br/>\ndreams. Live the life you have always<br/>\nimagined.&quot; - Henry David Thoreau<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":11256,"nextTopicId":11273}}