{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269717723","msgId":43516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvbGxzcitsamZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvazFrdCtzczM0QGVHcm91cHMuY29tPg=="},"prevInTopic":43511,"nextInTopic":0,"prevInTime":43515,"nextInTime":43517,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"... ***************** Hindsight being 20/20, it probably would have been easier on everyone to find a different game for your kids, or find a way to bow out of","messageBody":"<div id=\"ygrps-yiv-1358346580\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;cara&quot; &lt;caradove@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So after dinner she brought out games to play and started with a card game that said 13+ my oldest is near 14 and all the way down to 3yo wanting to play. She really wanted to play herself and wasn&#39;t thinking of the kids so after listening blankly to the rules I spoke up to say lets try a different game.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nHindsight being 20/20, it probably would have been easier on everyone to find a different game for your kids, or find a way to bow out of the game, or even the rest of the evening. I don&#39;t try to play card and board games with extended family unless I&#39;m pretty sure they can deal with my kids being kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then my 6yo wanted to join in and got up on her husbands knee. Come her turn he made her move for her with no discussion adn moved on. She said &quot;What happened&quot; and &quot;That was no fun&quot;. When I said she would like to make her own turn he said &quot;But she is just a minor&quot; So I took her cards, read them with her... <br/>\n </span></blockquote>********************<br/>\n<br/>\nHow upset was your 6yo? In the middle of things like that, I&#39;d probably have let the turn go by, but offer that she come sit by me for the next turn, and help her then. Jumping in like that makes the whole issue bigger than maybe it needed to be. Of course, if your 6yo was really crushed, that&#39;s a different matter. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But every time wa are there something they say makes me want to throttle them!! &quot;Eat everything on your plate&quot;, &quot;Don&#39;t have a fit if you don&#39;t like your present&quot;<br/>\n </span></blockquote>***************<br/>\n<br/>\nI don&#39;t visit my dad for that reason, and mostly avoid visiting cousins and step-cousins too. Especially around meals - I&#39;m just sooooo sensitive on the issue of bullying children to eat. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":198023026,"authorName":"cara","from":"&quot;cara&quot; &lt;caradove@...&gt;","profile":"caradove","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269664221","msgId":43511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvazFrdCtzczM0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgxMjQxNi43NjU3Ny5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":43509,"nextInTopic":43516,"prevInTime":43510,"nextInTime":43512,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Schuyler, Meredith and everyone, I ve been wanting to post about this but it seems to fit in this discussion so I ll drop in! A few weeks ago we went to my","messageBody":"<div id=\"ygrps-yiv-307449843\">Schuyler, Meredith and everyone,<br/>\n<br/>\nI&#39;ve been wanting to post about this but it seems to fit in this discussion so I&#39;ll drop in!<br/>\n<br/>\nA few weeks ago we went to my husbands Moms for a birthday lunch for him. Relationships were estranged for years but come round to some civility now but not very deep. His sister I just about tolerate as she has put our family through a lot.<br/>\n<br/>\nSo after dinner she brought out games to play and started with a card game that said 13+ my oldest is near 14 and all the way down to 3yo wanting to play. She really wanted to play herself and wasn&#39;t thinking of the kids so after listening blankly to the rules I spoke up to say lets try a different game.<br/>\n<br/>\nWe set up Guillotine, a fun card game, but she harassed all my kids, including a very strategic 12yo who wanted to think deeply about his possible moves, to hurry up and go, she was stressed that her only baby would wake up and she would have to leave the game. We have six kids and our 10mnth old was also asleep on the sofa. I managed to say I felt a bit harassed.<br/>\n<br/>\nThen my 6yo wanted to join in and got up on her husbands knee. Come her turn he made her move for her with no discussion adn moved on. She said &quot;What happened&quot; and &quot;That was no fun&quot;. When I said she would like to make her own turn he said &quot;But she is just a minor&quot; So I took her cards, read them with her and helped her understand her options amid lots of eye rolling from SIL. DD decided to take a high score card away from my BIL, he then put her OFF his knee and said &quot;Now you can sit somewhere else&quot;. She was astounded, as was I and all I could do was get her a chair and set her up beside me.<br/>\n<br/>\nI feel I should have said or done something different! Do we just steer away from games in the future, should I say something after the fact, their ideas about children are SO far from mine I think it would not help. But every time wa are there something they say makes me want to throttle them!! &quot;Eat everything on your plate&quot;, &quot;Don&#39;t have a fit if you don&#39;t like your present&quot;, <br/>\n<br/>\nWe don&#39;t have contact with people who talk to kids that way, except for them. Do I make a stand and damage relations again or deal with it another way?<br/>\n<br/>\n<br/>\nCara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; The other day we got the keys to a local castle ruins (isn&#39;t that cool!) from a guy who owns a Reliant Robin shop in the village next to us. It was Linnaea&#39;s birthday and a sword fight in a privately accessible ruin we&#39;d never been to sounded a very good idea. Anyhow as the guy was handing over the keys he was talking about British history, asking the kids for dates of battles. I&#39;m terrible at dates, so I couldn&#39;t step in and offer a hand, but I could distract. Which is what I did and what David did. He&#39;d mention something specific and we&#39;d ask for more detail about it, moving the conversation from some strange testing of children to an almost discussion of something that interested him. Or we&#39;d comment on our own inability to remember dates and talk about his memory for them.<br/>\n&gt; <br/>\n&gt; In a situation where an adult is speaking to Simon who isn&#39;t that comfortable with strangers, I often take the burden of the conversation. I&#39;ve given Simon a few pat phrases, things like no thank you and thank you, yes and just handy little things to say rather than getting stuck in such overwhelming shyness that he just is unable to think of anything at all to say and so is absolutely silent. But, if the conversation goes further than an offer of assistance or food or whatever, if I&#39;m around I tend to do what I can to take the burden. In a situation where someone was pressing Simon to learn something that he wasn&#39;t interested in learning or to participate in something that he didn&#39;t want to participate in, I&#39;d thank the individual soliciting the activity and tell them that my son wasn&#39;t interested. If they pushed their point, I&#39;d talk about how he prefers to explore things in his own way. But I certainly wouldn&#39;t stand silently by while Simon grew more<br/>\n&gt;  and more uncomfortable with the situation. Nor would I help to build up the other person&#39;s frustration with the discrepency between the appreciation and gratitude they felt their generosity deserved and my son&#39;s apparent lack of those emotions. <br/>\n&gt; <br/>\n&gt; The guy with the keys was showing off. He wanted to talk about something that he knew something about and he wanted to show a trick for remembering dates to this van-load of kids. It is a weird thing, an attempt at engaging a group of children by quizzing them. He wouldn&#39;t have talked to David about the dates of famous British battles. He would have talked to him about volvos and the Bond Bug Reliant Robin he has that David thinks is so cool. He would have talked to me about other things. But children who he hasn&#39;t a clue how to connect with he took an aggressive quizzing approach. It was easy for me to see my kids lack of knowledge about the Battle of Agincourt as a failing on my part to educate them well, at least for a couple of seconds, an embarrassed moment of me the parent/educator. But then I thought a moment longer about how forced the whole structure of the guy&#39;s approach to children was. And how bizarre. It helps a lot to realise that your son<br/>\n&gt;  isn&#39;t wrong or behaving badly by doing his own thing without someone else&#39;s help. This guy who really felt he was owed some sort of engagement with your son is the one who was pushing the relationship between strangers a bit too far. <br/>\n&gt; <br/>\n&gt; People often don&#39;t know how to talk to kids. So they take on inappropriate roles or initiate very contrived or cliched exchanges. It is a desire to connect that makes it happen and, maybe, it will help if y&#39;all can see it as a generous act, even if it is one that isn&#39;t desired. I figure a no thank you is a good response. <br/>\n&gt; <br/>\n&gt; Schuyler<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; <br/>\n&gt; I&#39;ve been raised in the old ways of &#39;respect your elders&#39; and I also no longer have trouble talking to people.  (I was a very shy child long ago.)  I haven&#39;t enforced any such rules nor training on my son and he has been free to make his own assessment of people.  Well my son wanted nothing to do with this man and this man did not take kindly to being ignored.  <br/>\n&gt; <br/>\n&gt; At this point my daughter came up and she being very friendly, she accepted the skating challenges this man started offering her.  He showed her some new skills to help improve her derby skills so as she learned a new trick or two, she would go see what else he could show her. All this was happening right in front of my son who just continued to ignore it.<br/>\n&gt; <br/>\n&gt; The man decided he would use words to force my son to get up and skate.  When my son continued to ignore his demands for eye contact or even show signs the man existed, the man went on to tell my son &quot;You aren&#39;t worth my time or God&#39;s time.&quot;  Then the man said to me my son needed to be forced to go camping then fed to the bears.  I told the man to stay away from my son and not speak to him again.  We left shortly after.<br/>\n&gt; <br/>\n&gt; =(<br/>\n&gt; <br/>\n&gt; Vicki<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":367302968,"authorName":"VickiJ","from":"&quot;VickiJ&quot; &lt;vjohnsonbarrett@...&gt;","profile":"vjohnsonbarrett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269612001","msgId":43509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvaWVsMStzaWhhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExODg0My43MDMxMi5xbUB3ZWI1NDEwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43506,"nextInTopic":43511,"prevInTime":43508,"nextInTime":43510,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"It s good for me to hear this, too. My son, now 13, has been uninterested in much of anything outside of home for about a year now. When he does get together","messageBody":"<div id=\"ygrps-yiv-699211623\">It&#39;s good for me to hear this, too. <br/>\n<br/>\nMy son, now 13, has been uninterested in much of anything outside of home for about a year now. When he does get together with old friends, he has a blast, mostly gaming together, but then goes back to hibernation at home. We&#39;ve moved a ridiculous number of times in the past few years, with few opportunities to meet new kids, so seeing old friends is very rare. My husband and I have been concerned that he&#39;s had such a limited social life, and I&#39;m trying to relax and let him just be. When we have opportunities to go out and do something interesting, exploring Shanghai (just moved here 2 months ago), we tend to pressure him just a bit because it seems he&#39;d stay in our apartment forever if we didn&#39;t &quot;encourage&quot; his getting out every 2 weeks or so. <br/>\n<br/>\nIs this degree of &quot;stay homedness&quot; what people are talking about, or is he even more of a homebody? Even as an unschooler, it&#39;s a challenge to not be judgemental of his choice to stay indoors each and every day and only be on the computer or video game.<br/>\nVicki in Shanghai<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Vickisue Gray &lt;vickisue_gray@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Thanks Deb,  And thanks everyone else who has offered help and advise.<br/>\n&gt; <br/>\n&gt; We&#39;ve been on this journey for 4.5 years now, and you all have helped me so much especially when those fears/incidents arise.  It&#39;s funny how this one incident stressed me so much and how with the approaching teen years, I started fearing just how alone my son is.  He spent a joyful day with his dad yesterday playing on our farm with all our animals, and they came in when I got home from work, we ate, watched some TV and when it was time for me to get some sleep since I had to work today, they went back out and had a bonfire on our island. Last night my son was out of his funk and back to laughing and being happy.  He said he figures he would some day be interested in getting out to &#39;socialize&#39; but he figures that won&#39;t happen till he is more interested in girls.  <br/>\n&gt; <br/>\n&gt; It&#39;s good to know other kids go through the same type of phases.  <br/>\n&gt; <br/>\n&gt; Peace ad Laughter!<br/>\n&gt; Vicki<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269556792","msgId":43506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5ODQ0My45NDcyOC5xbUB3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDEwOTcyMC4zMzcyMC5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhvZzdsdSs4bWgzQGVHcm91cHMuY29tPiA8NTEzODM5LjU1NTAxLnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4gPDEwOTcyMC4zMzcyMC5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43504,"nextInTopic":43509,"prevInTime":43505,"nextInTime":43507,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Good for you! I highly suggest the book I am reading Protecting the Gift by Gavin Debecker. Alex Polikowsky http://polykow.blogspot.com/ ","messageBody":"<div id=\"ygrps-yiv-1574730228\">Good for you! I highly suggest the book I am reading Protecting the Gift by Gavin Debecker.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\nhttp://polykow.blogspot.com/<br/>\n <br/>\nhttp://groups.yahoo.com/group/unschoolingmn/<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Vickisue Gray &lt;vickisue_gray@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Thu, March 25, 2010 2:36:02 PM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nI did.   Then we left.<br/>\n<br/>\n____________ _________ _________ __<br/>\nFrom: BRIAN POLIKOWSKY &lt;polykowholsteins@ yahoo.com&gt;<br/>\nTo: unschoolingbasics@ yahoogroups. com<br/>\nSent: Thu, March 25, 2010 3:27:13 PM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\nThe old guy sounds like a creepy old pervert but why was he allowed to <br/>\ncontinue badgering your son? Why did your daughter have to intervene?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI agree. I am reading the book Protecting the Gift and he seems like the kind of person the author describes in a chapter and how they use that on people. I would have stepped in and told him to beat it and stop harassing you kid.<br/>\n<br/>\nAlex Polikowsky<br/>\nhttp://polykow. blogspot. com/<br/>\n<br/>\nhttp://groups. yahoo.com/ group/unschoolin gmn/<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269545762","msgId":43504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOTcyMC4zMzcyMC5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDUxMzgzOS41NTUwMS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PGhvZzdsdSs4bWgzQGVHcm91cHMuY29tPiA8NTEzODM5LjU1NTAxLnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":43503,"nextInTopic":43506,"prevInTime":43503,"nextInTime":43505,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"I did.   Then we left. ________________________________ From: BRIAN POLIKOWSKY  To: unschoolingbasics@yahoogroups.com Sent: Thu,","messageBody":"<div id=\"ygrps-yiv-715648808\">I did.   Then we left.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Thu, March 25, 2010 3:27:13 PM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nThe old guy sounds like a creepy old pervert but why was he allowed to <br/>\ncontinue badgering your son? Why did your daughter have to intervene?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI agree. I am reading the book Protecting the Gift and he seems like the kind of person the author describes in a chapter and how they use that on people. I would have stepped in and told him to beat it and stop harassing you kid.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\nhttp://polykow. blogspot. com/<br/>\n<br/>\nhttp://groups. yahoo.com/ group/unschoolin gmn/<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269545637","msgId":43503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0ODQ5MS4xNzgwOC5xbUB3ZWI1NDEwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhvZzdsdSs4bWgzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhvZzdsdSs4bWgzQGVHcm91cHMuY29tPg=="},"prevInTopic":43502,"nextInTopic":43504,"prevInTime":43502,"nextInTime":43504,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"It was a very short exchange just totally unexpected.  The older man was there with a woman his age so it didn t have the feel of him being a pervert more of","messageBody":"<div id=\"ygrps-yiv-1463883827\">It was a very short exchange just totally unexpected.  The older man was there with a woman his age so it didn&#39;t have the feel of him being a pervert more of an ancient &#39;teacher&#39; wanting to teach.  My daughter didn&#39;t &#39;intervene&#39;.  She was just open to learning his skating footwork where my son was not.  I don&#39;t feel I needed to &#39;rip the guy a new one&#39; when he at first just offered to show my son &#39;three easy steps to skating&#39;.  I just wasn&#39;t prepared for the swift change from &#39;offer of advise&#39; to &#39;your not worth God&#39;s time&#39;. <br/>\n<br/>\nAs for why was he allowed to continue to badger my son?  He wasn&#39;t.  If you read my last two sentences I stated, &quot;I told the man to stay away from my son and not speak to him again.  We left shortly after.&quot;    Skates had to be removed and returned limiting just how fast leaving could occur.<br/>\n<br/>\nAs for apologizing to my son?  Yes.  He and I spent many hours that night talking.  He is back to my happy kid.<br/>\n<br/>\nVicki<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thu, March 25, 2010 1:48:46 PM<br/>\nSubject: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nSo then you apologized to your son? <br/>\n<br/>\nThe old guy sounds like a creepy old pervert but why was he allowed to continue badgering your son? Why did your daughter have to intervene?<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In unschoolingbasics@ yahoogroups. com, &quot;vickisue_gray&quot; &lt;vickisue_gray@ ...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Meredith you really hit on what I had to deal with last night.<br/>\n&gt; <br/>\n&gt; &quot;to have other people actively imposing their ideas of parenting on one&#39;s own children&quot; <br/>\n&gt; <br/>\n&gt; &quot;Children are expected to comply to the community ethos, under the assumption that such is &quot;good for them&quot; and are, at the very least shamed for non-compliance. &quot;<br/>\n&gt; <br/>\n&gt; In the last few years, my son has preferred the life of a hermit or at least very limited social contact with those of his choosing. <br/>\n&gt; <br/>\n&gt; Well last night, I really wanted to go roller skating, something I haven&#39;t done in years but have really great memories of.  My almost 20yo daughter has joined a roller derby team and had asked us to come skating with her.  So when I got home from work, my daughter was waiting with my son who wasn&#39;t so interested in going.  I told him I would really like for him to come with us for a few hours. <br/>\n&gt; <br/>\n&gt; He agreed to come try skating so we went to the rink.  Upon pulling up, we saw two kids he had known a few years ago.  I like the kids&#39; mom, but my son doesn&#39;t care for her kids as the younger one tends to be violent.  At seeing them, my son lost what little interest he had in going in. (It&#39;s been over two years since he has seen them and the boys didn&#39;t even recognize each other as they have all changed a lot.) <br/>\n&gt; <br/>\n&gt; I told him I really wanted to try skating and it&#39;s a big place.  We can&#39;t just stop living life because we might see someone we aren&#39;t necessarily wanting to socialize with and skating did not require him to hang with those two.  In knowing my son, I figured he was back in his not wanting to try anything new attitude.  (He has skated in the past and liked it but it had been awhile.) <br/>\n&gt; <br/>\n&gt; We went in and got skates on.  Since I realize I&#39;ve aged over the years, I approached the skating carefully.  My son stayed attached to my side which is a bit disconcerting as I was trying to re-establish my balance.  Anyway, eventually I wanted to move off the carpet and he begrudgingly stayed with me.  My skills slowly started returning and I was starting to feel ready to take on the floor. <br/>\n&gt; <br/>\n&gt; At this point, my son who wasn&#39;t having any major issues on the skates had decided to just sit but he didn&#39;t want me to skate either.  An older gray haired gent decided to get involved and &#39;teach my son to skate&#39; and that&#39;s when it all started coming apart.<br/>\n&gt; <br/>\n&gt; I&#39;ve been raised in the old ways of &#39;respect your elders&#39; and I also no longer have trouble talking to people.  (I was a very shy child long ago.)  I haven&#39;t enforced any such rules nor training on my son and he has been free to make his own assessment of people.  Well my son wanted nothing to do with this man and this man did not take kindly to being ignored. <br/>\n&gt; <br/>\n&gt; At this point my daughter came up and she being very friendly, she accepted the skating challenges this man started offering her.  He showed her some new skills to help improve her derby skills so as she learned a new trick or two, she would go see what else he could show her. All this was happening right in front of my son who just continued to ignore it.<br/>\n&gt; <br/>\n&gt; The man decided he would use words to force my son to get up and skate.  When my son continued to ignore his demands for eye contact or even show signs the man existed, the man went on to tell my son &quot;You aren&#39;t worth my time or God&#39;s time.&quot;  Then the man said to me my son needed to be forced to go camping then fed to the bears.  I told the man to stay away from my son and not speak to him again.  We left shortly after.<br/>\n&gt; <br/>\n&gt; =(<br/>\n&gt; <br/>\n&gt; Vicki<br/>\n&gt;<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269545233","msgId":43502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMzgzOS41NTUwMS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhvZzdsdSs4bWgzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhvZzdsdSs4bWgzQGVHcm91cHMuY29tPg=="},"prevInTopic":43501,"nextInTopic":43503,"prevInTime":43501,"nextInTime":43503,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"The old guy sounds like a creepy old pervert but why was he allowed to continue badgering your son? Why did your daughter have to intervene? -=-=-=-=-=- I","messageBody":"<div id=\"ygrps-yiv-2079616835\">The old guy sounds like a creepy old pervert but why was he allowed to <br/>\ncontinue badgering your son? Why did your daughter have to intervene?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI agree. I am reading the book Protecting the Gift and he seems like the kind of person the author describes in a chapter and how they use that on people. I would have stepped in and told him to beat it and stop harassing you kid.<br/>\n <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269539326","msgId":43501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvZzdsdSs4bWgzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPg=="},"prevInTopic":43497,"nextInTopic":43502,"prevInTime":43500,"nextInTime":43502,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"So then you apologized to your son? The old guy sounds like a creepy old pervert but why was he allowed to continue badgering your son? Why did your daughter","messageBody":"<div id=\"ygrps-yiv-2142410697\">So then you apologized to your son? <br/>\n<br/>\nThe old guy sounds like a creepy old pervert but why was he allowed to continue badgering your son? Why did your daughter have to intervene?<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vickisue_gray&quot; &lt;vickisue_gray@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Meredith you really hit on what I had to deal with last night.<br/>\n&gt; <br/>\n&gt; &quot;to have other people actively imposing their ideas of parenting on one&#39;s own children&quot; <br/>\n&gt; <br/>\n&gt; &quot;Children are expected to comply to the community ethos, under the assumption that such is &quot;good for them&quot; and are, at the very least shamed for non-compliance.&quot;<br/>\n&gt; <br/>\n&gt; In the last few years, my son has preferred the life of a hermit or at least very limited social contact with those of his choosing.  <br/>\n&gt; <br/>\n&gt; Well last night, I really wanted to go roller skating, something I haven&#39;t done in years but have really great memories of.  My almost 20yo daughter has joined a roller derby team and had asked us to come skating with her.  So when I got home from work, my daughter was waiting with my son who wasn&#39;t so interested in going.  I told him I would really like for him to come with us for a few hours.  <br/>\n&gt; <br/>\n&gt; He agreed to come try skating so we went to the rink.  Upon pulling up, we saw two kids he had known a few years ago.  I like the kids&#39; mom, but my son doesn&#39;t care for her kids as the younger one tends to be violent.  At seeing them, my son lost what little interest he had in going in. (It&#39;s been over two years since he has seen them and the boys didn&#39;t even recognize each other as they have all changed a lot.) <br/>\n&gt; <br/>\n&gt; I told him I really wanted to try skating and it&#39;s a big place.  We can&#39;t just stop living life because we might see someone we aren&#39;t necessarily wanting to socialize with and skating did not require him to hang with those two.  In knowing my son, I figured he was back in his not wanting to try anything new attitude.  (He has skated in the past and liked it but it had been awhile.) <br/>\n&gt; <br/>\n&gt; We went in and got skates on.  Since I realize I&#39;ve aged over the years, I approached the skating carefully.  My son stayed attached to my side which is a bit disconcerting as I was trying to re-establish my balance.  Anyway, eventually I wanted to move off the carpet and he begrudgingly stayed with me.  My skills slowly started returning and I was starting to feel ready to take on the floor.  <br/>\n&gt; <br/>\n&gt; At this point, my son who wasn&#39;t having any major issues on the skates had decided to just sit but he didn&#39;t want me to skate either.  An older gray haired gent decided to get involved and &#39;teach my son to skate&#39; and that&#39;s when it all started coming apart.<br/>\n&gt; <br/>\n&gt; I&#39;ve been raised in the old ways of &#39;respect your elders&#39; and I also no longer have trouble talking to people.  (I was a very shy child long ago.)  I haven&#39;t enforced any such rules nor training on my son and he has been free to make his own assessment of people.  Well my son wanted nothing to do with this man and this man did not take kindly to being ignored.  <br/>\n&gt; <br/>\n&gt; At this point my daughter came up and she being very friendly, she accepted the skating challenges this man started offering her.  He showed her some new skills to help improve her derby skills so as she learned a new trick or two, she would go see what else he could show her. All this was happening right in front of my son who just continued to ignore it.<br/>\n&gt; <br/>\n&gt; The man decided he would use words to force my son to get up and skate.  When my son continued to ignore his demands for eye contact or even show signs the man existed, the man went on to tell my son &quot;You aren&#39;t worth my time or God&#39;s time.&quot;  Then the man said to me my son needed to be forced to go camping then fed to the bears.  I told the man to stay away from my son and not speak to him again.  We left shortly after.<br/>\n&gt; <br/>\n&gt; =(<br/>\n&gt; <br/>\n&gt; Vicki<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269530116","msgId":43497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExODg0My43MDMxMi5xbUB3ZWI1NDEwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDQ4RjQ0OEM2MDRCRTQ5MEE5RDM4QjhENENDMEJGQjY1QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDw4NTI2MDQuNzIwNTMucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8MzUxMTIuNTI0MDYucW1Ad2ViNTQxMDMubWFpbC5yZTIueWFob28uY29tPiA8NDhGNDQ4QzYwNEJFNDkwQTlEMzhCOEQ0Q0MwQkZCNjVAZGVib3JhaDQzZjEzZmQ+"},"prevInTopic":43496,"nextInTopic":43501,"prevInTime":43496,"nextInTime":43498,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Thanks Deb,  And thanks everyone else who has offered help and advise. We ve been on this journey for 4.5 years now, and you all have helped me so much","messageBody":"<div id=\"ygrps-yiv-213063896\">Thanks Deb,  And thanks everyone else who has offered help and advise.<br/>\n<br/>\nWe&#39;ve been on this journey for 4.5 years now, and you all have helped me so much especially when those fears/incidents arise.  It&#39;s funny how this one incident stressed me so much and how with the approaching teen years, I started fearing just how alone my son is.  He spent a joyful day with his dad yesterday playing on our farm with all our animals, and they came in when I got home from work, we ate, watched some TV and when it was time for me to get some sleep since I had to work today, they went back out and had a bonfire on our island. Last night my son was out of his funk and back to laughing and being happy.  He said he figures he would some day be interested in getting out to &#39;socialize&#39; but he figures that won&#39;t happen till he is more interested in girls.  <br/>\n<br/>\nIt&#39;s good to know other kids go through the same type of phases.  <br/>\n<br/>\nPeace ad Laughter!<br/>\nVicki<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269528554","msgId":43496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4RjQ0OEM2MDRCRTQ5MEE5RDM4QjhENENDMEJGQjY1QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDw4NTI2MDQuNzIwNTMucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8MzUxMTIuNTI0MDYucW1Ad2ViNTQxMDMubWFpbC5yZTIueWFob28uY29tPg=="},"prevInTopic":43490,"nextInTopic":43497,"prevInTime":43495,"nextInTime":43497,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"***but just how much can I let him shut the world out? Is it good for him to completely isolate himself?*** He s with his family, he s not completely isolated.","messageBody":"<div id=\"ygrps-yiv-2037431040\">***but just how much can I let him shut the world out? Is it good for him to completely isolate himself?***<br/>\n<br/>\nHe&#39;s with his family, he&#39;s not completely isolated.  <br/>\n<br/>\nI do not enjoy social events.  Going to dinner at someone&#39;s house, even someone I know and love, is not comfortable for me.  Going into stores...not fun.  <br/>\nI can tell you that people telling me I&#39;d have fun if I just tried, etc, has not helped.  The only way I can go into museums and busy places, is by shutting the world out.  It&#39;s a useful skill. &lt;g&gt;  Your son might develop it and  use it selectively in his life.  When there&#39;s something he really wants to do, he can shut out the world and go into that museum or symphony hall or theater.    <br/>\n<br/>\nThe more you try to coax him into engaging in some social activity the more you point out how different he is.  Few people like to be in the spotlight, fewer still for their differences, especially if those differences seem odd.   He might always be this way.   He shouldn&#39;t be made to feel bad about it.  <br/>\n<br/>\nIt is *very* awkward to be the one everyone sees as different.  The one people focus on to coax into participating in some event or outing.  Experiencing that kind of unwanted attention as a child did  *not* make me more social.  <br/>\n<br/>\n***he has no trouble getting along with people when he chooses to, it&#39;s just that in the last two years, he is choosing to not.***<br/>\n<br/>\nDylan doesn&#39;t enjoy social outings.  But we go out all the time.  We go hiking, we take the telescope out, we go explore ghost towns, historic sites, go camping, etc.  We do go to museums, book stores, music stores, etc.,  but knowing Dylan&#39;s dislike of crowds we&#39;d go in off hours, during school hours, whatever we might do to avoid the busiest times.   Getting out into the world does not have to be about mixing with other people.  <br/>\n<br/>\nA Drive-In is nice alternative to a movie theater.  But we&#39;ve gone to the theater at matinee times and have been the only two people there.  That&#39;s nice because you can ask them to turn down the volume which is always too loud!<br/>\n<br/>\nStop to get sandwiches or pizza to go and drive to a park to eat.   We get sandwiches in a little town about thirty miles away and then go up to the old cemetery to eat.  We eat in the car, then walk around and look at the beautiful old stones.  No annoying people there.  No live ones, anyway.&lt;g&gt; <br/>\n<br/>\nMy point is you can get out into the world without getting out to busy places.   Maybe for the next little while you could just aim for places where there won&#39;t be other people.  <br/>\n<br/>\nAnother thing Dylan really enjoyed was going for late night walks.   Darkness gives him a sense of privacy, there are few people about, it&#39;s a lovely time to talk. (you get to meet interesting dogs and cats and the occasional skunk or raccoon, too!) &lt;g&gt;   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269453129","msgId":43490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3OTkwOS4xNTczLnFtQHdlYjU0MTAyLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDQ5REM4MjBCMTYzNjQ5NUZBRjc1RkNENTRCREFFNDAxQExZTEFMQVAyPg==","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDw4NTI2MDQuNzIwNTMucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8MzUxMTIuNTI0MDYucW1Ad2ViNTQxMDMubWFpbC5yZTIueWFob28uY29tPiA8NTU0MDkwLjY2MjQ5LnFtQHdlYjg2MjA3Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ5REM4MjBCMTYzNjQ5NUZBRjc1RkNENTRCREFFNDAxQExZTEFMQVAyPg=="},"prevInTopic":43489,"nextInTopic":43496,"prevInTime":43489,"nextInTime":43491,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Thanks! I ll go read the articles.  It helps to know this is normal behavior. Vicki ________________________________ From: Lyla Wolfenstein ","messageBody":"<div id=\"ygrps-yiv-515171797\">Thanks!<br/>\n<br/>\nI&#39;ll go read the articles.  It helps to know this is normal behavior.  <br/>\n<br/>\nVicki<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Lyla Wolfenstein &lt;lylaw@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Wed, March 24, 2010 1:39:38 PM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nah i see young teen.  i have an 11.5 year old, also very &quot;inventer-y&quot; with a high IQ (i am sure, but never been tested).  i read this pretty interesting article a few months ago, about existential depression amongst the &quot;gifted&quot;:<br/>\n<br/>\nhttp://www.sengifted.org/articles_counseling/DabrowskisTheory.pdf<br/>\n<br/>\nthat said - i think it&#39;s really common for preteens/young teens to go through a &quot;hibernation&quot; phase.  sometimes a long one.  we are just exiting a nearly 2 year phase of my son pretty much staying home all the time. he&#39;s also introverted (not shy) by temperament, so needs lots of space and time to recharge after being  social, which he has just started re-emerging from his cacoon to explore (being social.)<br/>\n<br/>\nhave you also read ren allen&#39;s &quot;unschooling the atypical child&quot; article?<br/>\n<br/>\nhttp://radicalunsch ooling.blogspot. com/2009/ 10/unerzogen- article.html<br/>\n<br/>\nand this one on unschooling the &quot;gifted&quot; child (hate that term):<br/>\n<br/>\nhttp://www.unschooling.com/library/essays/giftedchild.shtml<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269452398","msgId":43488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4ODY3NC44MTE5Mi5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDU1NDA5MC42NjI0OS5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDw4NTI2MDQuNzIwNTMucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8MzUxMTIuNTI0MDYucW1Ad2ViNTQxMDMubWFpbC5yZTIueWFob28uY29tPiA8NTU0MDkwLjY2MjQ5LnFtQHdlYjg2MjA3Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":43487,"nextInTopic":43489,"prevInTime":43487,"nextInTime":43489,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Thanks. Your words are a much needed reminder. Thank you so much. Vicki ________________________________ From: Schuyler  To:","messageBody":"<div id=\"ygrps-yiv-410016130\">Thanks.<br/>\n<br/>\nYour words are a much needed reminder.  <br/>\n<br/>\nThank you so much.<br/>\nVicki<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wed, March 24, 2010 1:17:00 PM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nWell, whether its the hormonal adjustment that teens go through or not, being kind to him is probably better than worrying about him. Figure out ways to help him be where he is knowing that what he&#39;s got at home is loving and supportive. Bring him food when he&#39;s playing. Touch him, if he likes it. Watch him play things on his xbox. Help him build a cool tower for his cats, if he wants to. Make some hemp scratching posts. Do things that are for him and with him that are all about loving him. And don&#39;t worry about the rest. Worry won&#39;t make anything better, it will just keep you focused on the things you are worried about. And, the more you connect with him the richer you&#39;ll see his life is. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n____________ _________ _________ __<br/>\nFrom: Vickisue Gray &lt;vickisue_gray@ yahoo.com&gt;<br/>\nTo: unschoolingbasics@ yahoogroups. com<br/>\nSent: Wednesday, 24 March, 2010 17:02:24<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\nTell Simon thank you!<br/>\n<br/>\nYes, my son has been a gamer but since we can&#39;t get anything but a satellite connection, he can&#39;t truly interact on xbox and such.  I know it&#39;s not &#39;unschooly&#39; to use terms like IQ and such, but that seems to be part of my son&#39;s makeup.  He comes from a long line of &#39;geniuses&#39; or &#39;inventors&#39; whom were unique individuals.  I&#39;m wishing his paternal grandfather was still around to help him find where he fits in.  You are right that he has no trouble getting along with people when he chooses to, it&#39;s just that in the last two years, he is choosing to not.  He never wants to leave the house for anything and I truly mean anything except to play with his cats.  I&#39;ve been told that the indifference is common in young teens with high IQ&#39;s.  <br/>\n<br/>\nHow would I fix him?  I would just like him to not be so depressed.  His short venture into school back in kindergarten, before I learned of unschooling, lead him into suicidal thoughts at age six, which is why I went looking for another path which lead me here.  I&#39;ve been told the dark thoughts are also part of deep thinkers.  I thought he had gotten past it, but he doesn&#39;t seem to have by what he was saying to me come midnight last night.  If he was a female, I would think he was starting pms.  Do boys have the same hormonal extremes girls go through?  I suppose that would make sense.  He doesn&#39;t know what he needs or wants, or so he says.<br/>\n<br/>\nI&#39;m just at a loss for what to do for him and it&#39;s tearing me up.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269452378","msgId":43489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5REM4MjBCMTYzNjQ5NUZBRjc1RkNENTRCREFFNDAxQExZTEFMQVAyPg==","inReplyToHeader":"PDU1NDA5MC42NjI0OS5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDw4NTI2MDQuNzIwNTMucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8MzUxMTIuNTI0MDYucW1Ad2ViNTQxMDMubWFpbC5yZTIueWFob28uY29tPiA8NTU0MDkwLjY2MjQ5LnFtQHdlYjg2MjA3Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":43488,"nextInTopic":43490,"prevInTime":43488,"nextInTime":43490,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"ah i see young teen.  i have an 11.5 year old, also very inventer-y with a high IQ (i am sure, but never been tested).  i read this pretty interesting","messageBody":"<div id=\"ygrps-yiv-199554882\">ah i see young teen.  i have an 11.5 year old, also very &quot;inventer-y&quot; with a high IQ (i am sure, but never been tested).  i read this pretty interesting article a few months ago, about existential depression amongst the &quot;gifted&quot;:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sengifted.org/articles_counseling/DabrowskisTheory.pdf\">http://www.sengifted.org/articles_counseling/DabrowskisTheory.pdf</a><br/>\n<br/>\nthat said - i think it&#39;s really common for preteens/young teens to go through a &quot;hibernation&quot; phase.  sometimes a long one.  we are just exiting a nearly 2 year phase of my son pretty much staying home all the time. he&#39;s also introverted (not shy) by temperament, so needs lots of space and time to recharge after being  social, which he has just started re-emerging from his cacoon to explore (being social.)<br/>\n<br/>\nhave you also read ren allen&#39;s &quot;unschooling the atypical child&quot; article?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalunschooling.blogspot.com/2009/10/unerzogen-article.html\">http://radicalunschooling.blogspot.com/2009/10/unerzogen-article.html</a><br/>\n<br/>\nand this one on unschooling the &quot;gifted&quot; child (hate that term):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/library/essays/giftedchild.shtml\">http://www.unschooling.com/library/essays/giftedchild.shtml</a><br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269452310","msgId":43487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2ODAzNi43MzQxNi5xbUB3ZWI1NDEwOC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PEQzNzMzNkVERTJCMjQzOEM4QjNGMzg3MDc1MzIyMzhGQExZTEFMQVAyPg==","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDxEMzczMzZFREUyQjI0MzhDOEIzRjM4NzA3NTMyMjM4RkBMWUxBTEFQMj4="},"prevInTopic":43486,"nextInTopic":43488,"prevInTime":43486,"nextInTime":43488,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"He s 12.5.  He reads everything he can get his hands on.  He s deep into theory s and he s a natural at physics and math.  He has already been accepted into","messageBody":"<div id=\"ygrps-yiv-1886082940\">He&#39;s 12.5.  He reads everything he can get his hands on.  He&#39;s deep into theory&#39;s and he&#39;s a natural at physics and math.  He has already been accepted into college but chose to wait till he is taller.  Some of this came from the World of Warcraft experience as people wouldn&#39;t follow the lead of an 11yo, but he had no trouble having a people seek him out for advise and leadership if they thought he was 17 or older.  The only real reason he was considering college, was he was really interested in diving into biology, computer design, and physics.  I&#39;ve bought him the complete LoF series, college biology books, and found programs online for python, scratch, alice, and a few more. He is totally into researching everything about Dwarf Fortress and has been designing fortresses for over four years now.  He wanted to learn binary, so he did.<br/>\n<br/>\nI think he is an incredible, adorable young man.  He wants friends but not enough to go make any.  I just called home, and he is currently laughing and goofing around with dad.  So I&#39;m gathering I should just keep on letting him do as he has been doing and just keep loving him, which isn&#39;t hard to do =), and learn somehow, to let myself not worry nor let his dark moods scare me so.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Lyla Wolfenstein &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lylaw@...\">lylaw@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wed, March 24, 2010 1:15:58 PM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nvickisue, how old is your son? <br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269451476","msgId":43486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvZGhzaytuMHQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM1MTEyLjUyNDA2LnFtQHdlYjU0MTAzLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":43485,"nextInTopic":43487,"prevInTime":43485,"nextInTime":43487,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"... ***************** Ren talks about some teens needing to sort of coccoon themselves for a while - a couple years even - and that was something that","messageBody":"<div id=\"ygrps-yiv-1013016512\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Vickisue Gray &lt;vickisue_gray@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; He never wants to leave the house for anything and I truly mean anything except to play with his cats.  I&#39;ve been told that the indifference is common in young teens with high IQ&#39;s.  <br/>\n </span></blockquote>*****************<br/>\n<br/>\nRen talks about some teens needing to sort of &quot;coccoon&quot; themselves for a while - a couple years even - and that was something that happened with Ray. He switched to a mostly  nocturnal lifestyle and didn&#39;t go out very much. It was startling with such a social guy. It may be your guy needs to pull in for awhile, too. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269451210","msgId":43485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvZGhrYStzOGVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg1MjYwNC43MjA1My5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":43483,"nextInTopic":43486,"prevInTime":43484,"nextInTime":43486,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"... ************* In the same vein, one of Mo s strategies for dealing with people and situations she doesn t know is to bring a portable game. It gives her a","messageBody":"<div id=\"ygrps-yiv-852570005\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I asked Simon, I asked him about your son completely isolating himself. He asked if your son is a gamer. He figured if he was a gamer he wasn&#39;t isolating himself at all; he was just playing with the world in his own way.<br/>\n </span></blockquote>*************<br/>\n<br/>\nIn the same vein, one of Mo&#39;s strategies for dealing with people and situations she doesn&#39;t know is to bring a portable game. It gives her a way to decide just how much to interact - she can focus intently on the game, or use the game as a sort of buffer that she can look over and observe other people for awhile. It also provides a way for her to interact just a little bit, by showing someone her game or making a comment about it. Just this weekend we went to a daffodil festival and Mo spent the whole time with her game in her hands, mostly focused, but interacting in little bits, here and there. Its a really valuable tool for her. <br/>\n<br/>\nSome people need to observe social situation for a long time before interacting. They need to get a feel for the group as a whole, see who&#39;s friendly and kind and who to avoid, develop some strategies, and Then interact. The social norm is to throw oneself in the middle of a group and learn about it from the inside - but that doesn&#39;t work for &quot;observant social learners&quot;. They (we, I do this) tend to shut down in those situations, or freeze up, unless they&#39;ve figured out strategies that let us &quot;pretend&quot; to interact while really watching everyone else. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269451020","msgId":43483,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1NDA5MC42NjI0OS5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDM1MTEyLjUyNDA2LnFtQHdlYjU0MTAzLm1haWwucmUyLnlhaG9vLmNvbT4=","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDw4NTI2MDQuNzIwNTMucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8MzUxMTIuNTI0MDYucW1Ad2ViNTQxMDMubWFpbC5yZTIueWFob28uY29tPg=="},"prevInTopic":43482,"nextInTopic":43485,"prevInTime":43482,"nextInTime":43484,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Well, whether its the hormonal adjustment that teens go through or not, being kind to him is probably better than worrying about him. Figure out ways to help","messageBody":"<div id=\"ygrps-yiv-760258139\">Well, whether its the hormonal adjustment that teens go through or not, being kind to him is probably better than worrying about him. Figure out ways to help him be where he is knowing that what he&#39;s got at home is loving and supportive. Bring him food when he&#39;s playing. Touch him, if he likes it. Watch him play things on his xbox. Help him build a cool tower for his cats, if he wants to. Make some hemp scratching posts. Do things that are for him and with him that are all about loving him. And don&#39;t worry about the rest. Worry won&#39;t make anything better, it will just keep you focused on the things you are worried about. And, the more you connect with him the richer you&#39;ll see his life is. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Vickisue Gray &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vickisue_gray@...\">vickisue_gray@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, 24 March, 2010 17:02:24<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\nTell Simon thank you!<br/>\n<br/>\nYes, my son has been a gamer but since we can&#39;t get anything but a satellite connection, he can&#39;t truly interact on xbox and such. I know it&#39;s not &#39;unschooly&#39; to use terms like IQ and such, but that seems to be part of my son&#39;s makeup. He comes from a long line of &#39;geniuses&#39; or &#39;inventors&#39; whom were unique individuals. I&#39;m wishing his paternal grandfather was still around to help him find where he fits in. You are right that he has no trouble getting along with people when he chooses to, it&#39;s just that in the last two years, he is choosing to not. He never wants to leave the house for anything and I truly mean anything except to play with his cats. I&#39;ve been told that the indifference is common in young teens with high IQ&#39;s. <br/>\n<br/>\nHow would I fix him? I would just like him to not be so depressed. His short venture into school back in kindergarten, before I learned of unschooling, lead him into suicidal thoughts at age six, which is why I went looking for another path which lead me here. I&#39;ve been told the dark thoughts are also part of deep thinkers. I thought he had gotten past it, but he doesn&#39;t seem to have by what he was saying to me come midnight last night. If he was a female, I would think he was starting pms. Do boys have the same hormonal extremes girls go through? I suppose that would make sense. He doesn&#39;t know what he needs or wants, or so he says.<br/>\n<br/>\nI&#39;m just at a loss for what to do for him and it&#39;s tearing me up.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269450958","msgId":43482,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQzNzMzNkVERTJCMjQzOEM4QjNGMzg3MDc1MzIyMzhGQExZTEFMQVAyPg==","inReplyToHeader":"PDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43481,"nextInTopic":43483,"prevInTime":43481,"nextInTime":43483,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"vickisue, how old is your son? lyla [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-369242304\">vickisue, how old is your son?  <br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269450144","msgId":43481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MTEyLjUyNDA2LnFtQHdlYjU0MTAzLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDg1MjYwNC43MjA1My5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+IDw4NTI2MDQuNzIwNTMucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":43480,"nextInTopic":43482,"prevInTime":43480,"nextInTime":43482,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Tell Simon thank you! Yes, my son has been a gamer but since we can t get anything but a satellite connection, he can t truly interact on xbox and such.  I","messageBody":"<div id=\"ygrps-yiv-1561147462\">Tell Simon thank you!<br/>\n<br/>\nYes, my son has been a gamer but since we can&#39;t get anything but a satellite connection, he can&#39;t truly interact on xbox and such.  I know it&#39;s not &#39;unschooly&#39; to use terms like IQ and such, but that seems to be part of my son&#39;s makeup.  He comes from a long line of &#39;geniuses&#39; or &#39;inventors&#39; whom were unique individuals.  I&#39;m wishing his paternal grandfather was still around to help him find where he fits in.  You are right that he has no trouble getting along with people when he chooses to, it&#39;s just that in the last two years, he is choosing to not.  He never wants to leave the house for anything and I truly mean anything except to play with his cats.  I&#39;ve been told that the indifference is common in young teens with high IQ&#39;s.  <br/>\n<br/>\nHow would I fix him?  I would just like him to not be so depressed.  His short venture into school back in kindergarten, before I learned of unschooling, lead him into suicidal thoughts at age six, which is why I went looking for another path which lead me here.  I&#39;ve been told the dark thoughts are also part of deep thinkers.   I thought he had gotten past it, but he doesn&#39;t seem to have by what he was saying to me come midnight last night.   If he was a female, I would think he was starting pms.  Do boys have the same hormonal extremes girls go through?  I suppose that would make sense.  He doesn&#39;t know what he needs or wants, or so he says.<br/>\n<br/>\nI&#39;m just at a loss for what to do for him and it&#39;s tearing me up.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wed, March 24, 2010 12:18:05 PM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nI asked Simon, I asked him about your son completely isolating himself. He asked if your son is a gamer. He figured if he was a gamer he wasn&#39;t isolating himself at all; he was just playing with the world in his own way. Simon is very social on the xbox, playing with lots of people at a go. <br/>\n<br/>\nI&#39;ve watched Simon wax and wane on his desire to go out and do with other people. I&#39;ve noticed that when he chooses to go and do he is actively engaged in the whole experience, but when he is pressed into something he is just going along to accomodate the other people in his life. I try not to press him very often. I still invite him to most things, but I am willing to accept a no far more than I ever push for a yes. <br/>\n<br/>\nHow would you fix him? What could you do that would change him? Would working to change him produce the child you want him to be or would it just leave him sure that he is a failure at the whole being a human thing and that his ability to interact with the world is pretty limited? What if you just continue to accept him for who he is? Instead of looking for the things that you think will handicap him as an adult look to the things that strengthen him as the boy he is. I bet there are lots of things that you like. Lots of things. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n____________ _________ _________ __<br/>\nFrom: Vickisue Gray &lt;vickisue_gray@ yahoo.com&gt;<br/>\nTo: unschoolingbasics@ yahoogroups. com<br/>\nSent: Wednesday, 24 March, 2010 15:04:48<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\nThanks for your thoughts.  I&#39;m amazed at how much this is bothering me.  Neither of my daughters ever had this sort of issue.  The oldest has always been able to handle most everything that has ever come her way.  The almost 18yo dd, had an interesting habit of just turning her big blue eyes on the person which somehow always had the effect of  them being very kind to her.  Unfortunately, my son&#39;s way of dealing with people is to just have nothing to do with people as a whole.  The interaction was short, but it still really bothers me and I know there is no way my son will willingly ever want to try skating there again.  I&#39;m OK with that, but just how much can I let him shut the world out?  Is it good for him to completely isolate himself?<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269447485","msgId":43480,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1MjYwNC43MjA1My5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4gPDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43479,"nextInTopic":43481,"prevInTime":43479,"nextInTime":43481,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"I asked Simon, I asked him about your son completely isolating himself. He asked if your son is a gamer. He figured if he was a gamer he wasn t isolating","messageBody":"<div id=\"ygrps-yiv-1042691650\">I asked Simon, I asked him about your son completely isolating himself. He asked if your son is a gamer. He figured if he was a gamer he wasn&#39;t isolating himself at all; he was just playing with the world in his own way. Simon is very social on the xbox, playing with lots of people at a go. <br/>\n<br/>\nI&#39;ve watched Simon wax and wane on his desire to go out and do with other people. I&#39;ve noticed that when he chooses to go and do he is actively engaged in the whole experience, but when he is pressed into something he is just going along to accomodate the other people in his life. I try not to press him very often. I still invite him to most things, but I am willing to accept a no far more than I ever push for a yes. <br/>\n<br/>\nHow would you fix him? What could you do that would change him? Would working to change him produce the child you want him to be or would it just leave him sure that he is a failure at the whole being a human thing and that his ability to interact with the world is pretty limited? What if you just continue to accept him for who he is? Instead of looking for the things that you think will handicap him as an adult look to the things that strengthen him as the boy he is. I bet there are lots of things that you like. Lots of things. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Vickisue Gray &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vickisue_gray@...\">vickisue_gray@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, 24 March, 2010 15:04:48<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\nThanks for your thoughts.  I&#39;m amazed at how much this is bothering me.  Neither of my daughters ever had this sort of issue.  The oldest has always been able to handle most everything that has ever come her way.  The almost 18yo dd, had an interesting habit of just turning her big blue eyes on the person which somehow always had the effect of  them being very kind to her.  Unfortunately, my son&#39;s way of dealing with people is to just have nothing to do with people as a whole.  The interaction was short, but it still really bothers me and I know there is no way my son will willingly ever want to try skating there again.  I&#39;m OK with that, but just how much can I let him shut the world out?  Is it good for him to completely isolate himself?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269443088","msgId":43479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3NTczNi45MjQyNC5xbUB3ZWI1NDEwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDgxMjQxNi43NjU3Ny5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPiA8ODEyNDE2Ljc2NTc3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":43478,"nextInTopic":43480,"prevInTime":43478,"nextInTime":43480,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Thanks for your thoughts.  I m amazed at how much this is bothering me.  Neither of my daughters ever had this sort of issue.  The oldest has always been able","messageBody":"<div id=\"ygrps-yiv-289329542\">Thanks for your thoughts.  I&#39;m amazed at how much this is bothering me.  Neither of my daughters ever had this sort of issue.  The oldest has always been able to handle most everything that has ever come her way.  The almost 18yo dd, had an interesting habit of just turning her big blue eyes on the person which somehow always had the effect of  them being very kind to her.  Unfortunately, my son&#39;s way of dealing with people is to just have nothing to do with people as a whole.  The interaction was short, but it still really bothers me and I know there is no way my son will willingly ever want to try skating there again.  I&#39;m OK with that, but just how much can I let him shut the world out?  Is it good for him to completely isolate himself?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wed, March 24, 2010 10:34:07 AM<br/>\nSubject: Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)<br/>\n<br/>\n  <br/>\nThe other day we got the keys to a local castle ruins (isn&#39;t that cool!) from a guy who owns a Reliant Robin shop in the village next to us. It was Linnaea&#39;s birthday and a sword fight in a privately accessible ruin we&#39;d never been to sounded a very good idea. Anyhow as the guy was handing over the keys he was talking about British history, asking the kids for dates of battles. I&#39;m terrible at dates, so I couldn&#39;t step in and offer a hand, but I could distract. Which is what I did and what David did. He&#39;d mention something specific and we&#39;d ask for more detail about it, moving the conversation from some strange testing of children to an almost discussion of something that interested him. Or we&#39;d comment on our own inability to remember dates and talk about his memory for them.<br/>\n<br/>\nIn a situation where an adult is speaking to Simon who isn&#39;t that comfortable with strangers, I often take the burden of the conversation. I&#39;ve given Simon a few pat phrases, things like no thank you and thank you, yes and just handy little things to say rather than getting stuck in such overwhelming shyness that he just is unable to think of anything at all to say and so is absolutely silent. But, if the conversation goes further than an offer of assistance or food or whatever, if I&#39;m around I tend to do what I can to take the burden. In a situation where someone was pressing Simon to learn something that he wasn&#39;t interested in learning or to participate in something that he didn&#39;t want to participate in, I&#39;d thank the individual soliciting the activity and tell them that my son wasn&#39;t interested. If they pushed their point, I&#39;d talk about how he prefers to explore things in his own way. But I certainly wouldn&#39;t stand silently by while Simon grew more<br/>\nand more uncomfortable with the situation. Nor would I help to build up the other person&#39;s frustration with the discrepency between the appreciation and gratitude they felt their generosity deserved and my son&#39;s apparent lack of those emotions. <br/>\n<br/>\nThe guy with the keys was showing off. He wanted to talk about something that he knew something about and he wanted to show a trick for remembering dates to this van-load of kids. It is a weird thing, an attempt at engaging a group of children by quizzing them. He wouldn&#39;t have talked to David about the dates of famous British battles. He would have talked to him about volvos and the Bond Bug Reliant Robin he has that David thinks is so cool. He would have talked to me about other things. But children who he hasn&#39;t a clue how to connect with he took an aggressive quizzing approach. It was easy for me to see my kids lack of knowledge about the Battle of Agincourt as a failing on my part to educate them well, at least for a couple of seconds, an embarrassed moment of me the parent/educator. But then I thought a moment longer about how forced the whole structure of the guy&#39;s approach to children was. And how bizarre. It helps a lot to realise that your son<br/>\nisn&#39;t wrong or behaving badly by doing his own thing without someone else&#39;s help. This guy who really felt he was owed some sort of engagement with your son is the one who was pushing the relationship between strangers a bit too far. <br/>\n<br/>\nPeople often don&#39;t know how to talk to kids. So they take on inappropriate roles or initiate very contrived or cliched exchanges. It is a desire to connect that makes it happen and, maybe, it will help if y&#39;all can see it as a generous act, even if it is one that isn&#39;t desired. I figure a no thank you is a good response. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n____________ _________ _________ __<br/>\n<br/>\nI&#39;ve been raised in the old ways of &#39;respect your elders&#39; and I also no longer have trouble talking to people.  (I was a very shy child long ago.)  I haven&#39;t enforced any such rules nor training on my son and he has been free to make his own assessment of people.  Well my son wanted nothing to do with this man and this man did not take kindly to being ignored. <br/>\n<br/>\nAt this point my daughter came up and she being very friendly, she accepted the skating challenges this man started offering her.  He showed her some new skills to help improve her derby skills so as she learned a new trick or two, she would go see what else he could show her. All this was happening right in front of my son who just continued to ignore it.<br/>\n<br/>\nThe man decided he would use words to force my son to get up and skate.  When my son continued to ignore his demands for eye contact or even show signs the man existed, the man went on to tell my son &quot;You aren&#39;t worth my time or God&#39;s time.&quot;  Then the man said to me my son needed to be forced to go camping then fed to the bears.  I told the man to stay away from my son and not speak to him again.  We left shortly after.<br/>\n<br/>\n=(<br/>\n<br/>\nVicki<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: unschooling in an intentional community (the dark side)","postDate":"1269441247","msgId":43478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMjQxNi43NjU3Ny5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPg=="},"prevInTopic":43477,"nextInTopic":43479,"prevInTime":43477,"nextInTime":43479,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"The other day we got the keys to a local castle ruins (isn t that cool!) from a guy who owns a Reliant Robin shop in the village next to us. It was Linnaea s","messageBody":"<div id=\"ygrps-yiv-455868585\">The other day we got the keys to a local castle ruins (isn&#39;t that cool!) from a guy who owns a Reliant Robin shop in the village next to us. It was Linnaea&#39;s birthday and a sword fight in a privately accessible ruin we&#39;d never been to sounded a very good idea. Anyhow as the guy was handing over the keys he was talking about British history, asking the kids for dates of battles. I&#39;m terrible at dates, so I couldn&#39;t step in and offer a hand, but I could distract. Which is what I did and what David did. He&#39;d mention something specific and we&#39;d ask for more detail about it, moving the conversation from some strange testing of children to an almost discussion of something that interested him. Or we&#39;d comment on our own inability to remember dates and talk about his memory for them.<br/>\n<br/>\nIn a situation where an adult is speaking to Simon who isn&#39;t that comfortable with strangers, I often take the burden of the conversation. I&#39;ve given Simon a few pat phrases, things like no thank you and thank you, yes and just handy little things to say rather than getting stuck in such overwhelming shyness that he just is unable to think of anything at all to say and so is absolutely silent. But, if the conversation goes further than an offer of assistance or food or whatever, if I&#39;m around I tend to do what I can to take the burden. In a situation where someone was pressing Simon to learn something that he wasn&#39;t interested in learning or to participate in something that he didn&#39;t want to participate in, I&#39;d thank the individual soliciting the activity and tell them that my son wasn&#39;t interested. If they pushed their point, I&#39;d talk about how he prefers to explore things in his own way. But I certainly wouldn&#39;t stand silently by while Simon grew more<br/>\n and more uncomfortable with the situation. Nor would I help to build up the other person&#39;s frustration with the discrepency between the appreciation and gratitude they felt their generosity deserved and my son&#39;s apparent lack of those emotions. <br/>\n<br/>\nThe guy with the keys was showing off. He wanted to talk about something that he knew something about and he wanted to show a trick for remembering dates to this van-load of kids. It is a weird thing, an attempt at engaging a group of children by quizzing them. He wouldn&#39;t have talked to David about the dates of famous British battles. He would have talked to him about volvos and the Bond Bug Reliant Robin he has that David thinks is so cool. He would have talked to me about other things. But children who he hasn&#39;t a clue how to connect with he took an aggressive quizzing approach. It was easy for me to see my kids lack of knowledge about the Battle of Agincourt as a failing on my part to educate them well, at least for a couple of seconds, an embarrassed moment of me the parent/educator. But then I thought a moment longer about how forced the whole structure of the guy&#39;s approach to children was. And how bizarre. It helps a lot to realise that your son<br/>\n isn&#39;t wrong or behaving badly by doing his own thing without someone else&#39;s help. This guy who really felt he was owed some sort of engagement with your son is the one who was pushing the relationship between strangers a bit too far. <br/>\n<br/>\nPeople often don&#39;t know how to talk to kids. So they take on inappropriate roles or initiate very contrived or cliched exchanges. It is a desire to connect that makes it happen and, maybe, it will help if y&#39;all can see it as a generous act, even if it is one that isn&#39;t desired. I figure a no thank you is a good response. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\nI&#39;ve been raised in the old ways of &#39;respect your elders&#39; and I also no longer have trouble talking to people.  (I was a very shy child long ago.)  I haven&#39;t enforced any such rules nor training on my son and he has been free to make his own assessment of people.  Well my son wanted nothing to do with this man and this man did not take kindly to being ignored.  <br/>\n<br/>\nAt this point my daughter came up and she being very friendly, she accepted the skating challenges this man started offering her.  He showed her some new skills to help improve her derby skills so as she learned a new trick or two, she would go see what else he could show her. All this was happening right in front of my son who just continued to ignore it.<br/>\n<br/>\nThe man decided he would use words to force my son to get up and skate.  When my son continued to ignore his demands for eye contact or even show signs the man existed, the man went on to tell my son &quot;You aren&#39;t worth my time or God&#39;s time.&quot;  Then the man said to me my son needed to be forced to go camping then fed to the bears.  I told the man to stay away from my son and not speak to him again.  We left shortly after.<br/>\n<br/>\n=(<br/>\n<br/>\nVicki<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"vickisue_gray","from":"&quot;vickisue_gray&quot; &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269437276","msgId":43477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvZDQwcytkdWdmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvYWNwYytiNHZnQGVHcm91cHMuY29tPg=="},"prevInTopic":43476,"nextInTopic":43478,"prevInTime":43476,"nextInTime":43478,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Meredith you really hit on what I had to deal with last night. to have other people actively imposing their ideas of parenting on one s own children ","messageBody":"<div id=\"ygrps-yiv-500332900\">Meredith you really hit on what I had to deal with last night.<br/>\n<br/>\n&quot;to have other people actively imposing their ideas of parenting on one&#39;s own children&quot; <br/>\n<br/>\n&quot;Children are expected to comply to the community ethos, under the assumption that such is &quot;good for them&quot; and are, at the very least shamed for non-compliance.&quot;<br/>\n<br/>\nIn the last few years, my son has preferred the life of a hermit or at least very limited social contact with those of his choosing.  <br/>\n<br/>\nWell last night, I really wanted to go roller skating, something I haven&#39;t done in years but have really great memories of.  My almost 20yo daughter has joined a roller derby team and had asked us to come skating with her.  So when I got home from work, my daughter was waiting with my son who wasn&#39;t so interested in going.  I told him I would really like for him to come with us for a few hours.  <br/>\n<br/>\nHe agreed to come try skating so we went to the rink.  Upon pulling up, we saw two kids he had known a few years ago.  I like the kids&#39; mom, but my son doesn&#39;t care for her kids as the younger one tends to be violent.  At seeing them, my son lost what little interest he had in going in. (It&#39;s been over two years since he has seen them and the boys didn&#39;t even recognize each other as they have all changed a lot.) <br/>\n<br/>\nI told him I really wanted to try skating and it&#39;s a big place.  We can&#39;t just stop living life because we might see someone we aren&#39;t necessarily wanting to socialize with and skating did not require him to hang with those two.  In knowing my son, I figured he was back in his not wanting to try anything new attitude.  (He has skated in the past and liked it but it had been awhile.) <br/>\n<br/>\nWe went in and got skates on.  Since I realize I&#39;ve aged over the years, I approached the skating carefully.  My son stayed attached to my side which is a bit disconcerting as I was trying to re-establish my balance.  Anyway, eventually I wanted to move off the carpet and he begrudgingly stayed with me.  My skills slowly started returning and I was starting to feel ready to take on the floor.  <br/>\n<br/>\nAt this point, my son who wasn&#39;t having any major issues on the skates had decided to just sit but he didn&#39;t want me to skate either.  An older gray haired gent decided to get involved and &#39;teach my son to skate&#39; and that&#39;s when it all started coming apart.<br/>\n<br/>\nI&#39;ve been raised in the old ways of &#39;respect your elders&#39; and I also no longer have trouble talking to people.  (I was a very shy child long ago.)  I haven&#39;t enforced any such rules nor training on my son and he has been free to make his own assessment of people.  Well my son wanted nothing to do with this man and this man did not take kindly to being ignored.  <br/>\n<br/>\nAt this point my daughter came up and she being very friendly, she accepted the skating challenges this man started offering her.  He showed her some new skills to help improve her derby skills so as she learned a new trick or two, she would go see what else he could show her. All this was happening right in front of my son who just continued to ignore it.<br/>\n<br/>\nThe man decided he would use words to force my son to get up and skate.  When my son continued to ignore his demands for eye contact or even show signs the man existed, the man went on to tell my son &quot;You aren&#39;t worth my time or God&#39;s time.&quot;  Then the man said to me my son needed to be forced to go camping then fed to the bears.  I told the man to stay away from my son and not speak to him again.  We left shortly after.<br/>\n<br/>\n=(<br/>\n<br/>\nVicki</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling in an intentional community (the dark side)","postDate":"1269435798","msgId":43476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvZDJpbSszaWEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvYWNwYytiNHZnQGVHcm91cHMuY29tPg=="},"prevInTopic":43475,"nextInTopic":43477,"prevInTime":43475,"nextInTime":43477,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Plucking this out of context -- Radical unshcooling *isn t* the same as living a radical or alternative lifestyle and using that as a basis for unstructured","messageBody":"<div id=\"ygrps-yiv-67970978\">Plucking this out of context --<br/>\n<br/>\n<br/>\nRadical unshcooling *isn&#39;t* the same as living a radical or alternative lifestyle and using that as a basis for unstructured education, its a pretty shockingly different paradigm of parent-child relationships. I know I was shocked at first!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>-- to applaud! Yes! We LOOK as &quot;normal&quot; as anyone else in our neighborhood. And the kids generally do all the &quot;normal&quot; things. But the thinking behind those choices -- and who is doing the choosing -- is the difference. <br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":415240058,"authorName":"rmacasa@sbcglobal.net","from":"&quot;rmacasa@...&quot; &lt;rmacasa@...&gt;","profile":"rmacasa@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Introduction and keen to form a community","postDate":"1269433407","msgId":43475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvZDA3dithcG1nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRmODZmYmViMTAwMzIzMDAyN202YjM0MDEzZWhiYmEzMDM1YTUwYTAyNzRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43473,"nextInTopic":43476,"prevInTime":43474,"nextInTime":43476,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"I lived on a community where we were one of five unschooling families.  I agree it does have its drawbacks but the benefits were evident where we were living.","messageBody":"<div id=\"ygrps-yiv-568497897\">I lived on a community where we were one of five unschooling families.  I agree it does have its drawbacks but the benefits were evident where we were living.  Learning how to make things work in a healthy community is a valuable skill for people of all ages.  <br/>\n<br/>\nThe expectations of the community were fair and simple to understand.  Sure some people were grumpy and others more sweet, but no one was shaming children.  A few examples come to mind.  When living so closely with others it is easy for children to feel as though every house is just another extension of their own home.  This was for the most part a good thing, but when people needed their own space they would ask for it.  I did not have an issue with people in the community letting my children know it was not a good time for them to visit. Another example was when a group of children were climbing small apple trees.  I did not see much of a problem with it, but the man who planted and tended to the trees for years did.  He was stressed out thinking the climbers were damaging the trees limbs and pleaded with the children not to climb them.  <br/>\n<br/>\nTheir were slight differences and variations in parenting practices were more pronounced, because of the amount of time spent with one another.  It did create tension and conflict, but also offered a chance for all of us to challenge and develop our peace making skills.<br/>\n<br/>\nI think it depends on what your expectations at the time are.  I never expected everyone in the community to be radical unschoolers.  <br/>\n<br/>\nThe benefits of having a &quot;village&quot; far outweighed any of the drawbacks.  Children from newborns to young adults lived on the community.  They shared learning through group projects of their own.  I recall the younger ones building a &quot;big rig&quot; out of rope, bikes, a dolly, parts of an broken appliance.  The older boys decided they wanted to get sponsored by a skateboarding company.  This encouraged them to fine tune their reading, writing, filming, editing, marketing, computer, and skateboarding skills in order to pursue their dreams.  Whenever the children had a goal in mind they had community members they could call upon with special skills they needed to acquire in order to accomplish the task at hand.  This could be building with cob, gardening, fruit picking, computers, yoga, swimming, bike riding, or even getting a ride to or from town.<br/>\n<br/>\nThe entire time we lived there and even now when we visit I can say my children hardly ever complained of being bored or inactive.  Except on the fluke occasions when most of the young people are off the community.  Their is something magical about living in a community where even your youngest family members are safe to freely move around, have a group of peers, and adults who value them as complete human beings.  <br/>\n<br/>\nAs a woman it was the most supportive community I have ever lived.  It was amazing to have other woman who lovingly helped one another.  I never felt isolated or alone.  Whenever something came up like a trip to the grocery store, an appt., needing time with husband.  The children were able to choose between coming along or staying behind with others.  It was very empowering for them to be able to make so many decisions, have free range of the community, and mixed age groups to pull off big plans.<br/>\n<br/>\n<br/>\nRya</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"unschooling in an intentional community (the dark side)","postDate":"1269347948","msgId":43473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvYWNwYytiNHZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRmODZmYmViMTAwMzIzMDAyN202YjM0MDEzZWhiYmEzMDM1YTUwYTAyNzRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43472,"nextInTopic":43475,"prevInTime":43472,"nextInTime":43474,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"I ve lived in and around intentional communities for years, with and without children, and when I had my dd, Morgan, I made an effort to get away from","messageBody":"<div id=\"ygrps-yiv-417689994\">I&#39;ve lived in and around intentional communities for years, with and without children, and when I had my dd, Morgan, I made an effort to get away from community living. Its frustrating to have one&#39;s parenting continually challenged, to have other people actively imposing their ideas of parenting on one&#39;s own children. Even people who seem to all be on the same page, as far as parenting theory are concerned, can have very different actual ways of relating to children. The trouble with having a &quot;village&quot; is that you have all the drawbacks of living in a small town, and in a community, as opposed to an ecovillage, you have much less distance and separation.<br/>\n<br/>\nUnschooling in an intentional community generally also means more rules, more limits on children. That&#39;s hard if what you&#39;re looking for is whole-life unschooling because the community as a whole can (and generally does) deny children resources, and/or force them to do things they&#39;d rather not do. I&#39;ve yet to see a community where children had as much decision making power as they do in a private home, and I&#39;ve yet to see completley non-punitive parenting in a community setting. Children are expected to comply to the community ethos, under the assumption that such is &quot;good for them&quot; and are, at the very least shamed for non-compliance.<br/>\n<br/>\nThat being said, if your children are easy-going, they&#39;ll probably be fine in a community setting, and just go with the flow. My kids are more &quot;spirited&quot; and that&#39;s much much harder in a community. <br/>\n<br/>\nThe Continuum Concept isn&#39;t the same as unschooling - its similar in some ways, and can inform one&#39;s ideas of natural learning, but its certainly not whole-life/ radical unschooling. The groups in the original CC studies were closed environments, and while its possible to recreate that to an extent, radical unschooling has more to do with expanding kids&#39; worlds than confining them.<br/>\n<br/>\nYou&#39;re welcome to go on reading this list and ask questions! But it may also be a good idea to read the list without comment for a week or two to get an idea what I mean by that. Radical unshcooling *isn&#39;t* the same as living a radical or alternative lifestyle and using that as a basis for unstructured education, its a pretty shockingly different paradigm of parent-child relationships. I know I was shocked at first!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":436114418,"authorName":"Katarina Konkoly","from":"Katarina Konkoly &lt;katarina.konkoly@...&gt;","profile":"katarina.konkoly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Introduction and keen to form a community","postDate":"1269329240","msgId":43472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRmODZmYmViMTAwMzIzMDAyN202YjM0MDEzZWhiYmEzMDM1YTUwYTAyNzRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":43473,"prevInTime":43471,"nextInTime":43473,"topicId":43472,"numMessagesInTopic":0,"msgSnippet":"Hi! I ve just joined this list. We re a small family of many talents. Our interests are diverse as physics, permaculture, poetry, etc. Our son is just turning","messageBody":"<div id=\"ygrps-yiv-607458113\">Hi!<br/>\nI&#39;ve just joined this list. We&#39;re a small family of many talents. Our<br/>\ninterests are diverse as physics, permaculture, poetry, etc. Our son is just<br/>\nturning three, and we had the intention to home educate him before he was<br/>\nborn, after reading Underground History of American Education by Gatto. When<br/>\nhe was around 18 months, I read Continuum Concept by Liedloff, and I<br/>\nrealised that the desire to learn is part of every day life, and that what I<br/>\nmost needed to do was provide him with an environment and community where he<br/>\nwas free to learn for himself.<br/>\n<br/>\nTo that end, we&#39;ve been trying to realise our dream of starting an<br/>\nintentional community in a natural environment. At first, we intended this<br/>\nfor our own benefit (since we grew up on the land and yet don&#39;t want to be<br/>\nwage-slaves paying off a mortgage forever just to grow old there). However,<br/>\nseeing the way my son learns, and how fast, I realised that it&#39;s really<br/>\ncritical to do in the short term. He needs many adults doing meaningful<br/>\nactivity that he can learn from, and older children around him who bridge<br/>\nthe distance and make learning in short steps attainable.<br/>\n<br/>\nWe tried living in a city with my husband working, so that we could save<br/>\nsome money to contribute to a community. However, my son is very attached to<br/>\nhis father, and feels it as a physical pain when they are separated. My<br/>\nhusband left work, and we moved to the country, where my husband is starting<br/>\na web based business from home. It&#39;s not going as fast as we would like, and<br/>\nhe may need to go back to work whilst it takes off. I&#39;m dreading this,<br/>\nbecause my son wants to learn from everything his father does. In the mean<br/>\ntime, I&#39;ve been grateful for my son to have had the opportunity to learn<br/>\nabout something other than traffic and roads, and the local townspeople are<br/>\nvery friendly and welcoming.<br/>\n<br/>\nWe&#39;d love to form a community in Tasmania or New Zealand, somewhere that&#39;s<br/>\nnot going to be too adversely affected by global warming (at least not as<br/>\nmuch as WA where we currently live). The purpose of the proposed community<br/>\nis to allow the full expression of human potential. Our entry on the<br/>\nintentional communities directory is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://directory.ic.org/records/?action=view&page=view&record_id=22047\">http://directory.ic.org/records/?action=view&page=view&record_id=22047</a><br/>\n<br/>\nDoes anyone else unschool in an intentional community? What are your<br/>\nexperiences? Does anyone else want to?<br/>\nI look forward to reading the emails on this group from others on the<br/>\nunschooling journey.<br/>\nKind regards<br/>\nKatarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43515,"nextTopicId":43528}}