{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Starting a business?","postDate":"1341922414","msgId":48746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0aDY5ZSticmVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0ZjloMytzcHAxQGVHcm91cHMuY29tPg=="},"prevInTopic":48744,"nextInTopic":0,"prevInTime":48745,"nextInTime":48747,"topicId":48738,"numMessagesInTopic":0,"msgSnippet":"How old is this child? Nance","messageBody":"<div id=\"ygrps-yiv-203330888\">How old is this child?<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Senlin&quot; &lt;senlin_says@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello, all!<br/>\n&gt; <br/>\n&gt;      My fiance and I are trying to put together a much-needed extra income source but are having trouble because our daughter HATES any talk of business. She wants all focus from both parents to be on her at all times. </span></blockquote></div>","specialLinks":[]},{"userId":346799235,"authorName":"aimeemwheeler","from":"&quot;aimeemwheeler&quot; &lt;apmama@...&gt;","profile":"aimeemwheeler","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Starting a business?","postDate":"1341890601","msgId":48743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0Zzc3OSttdDdtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0ZjloMytzcHAxQGVHcm91cHMuY29tPg=="},"prevInTopic":48740,"nextInTopic":48744,"prevInTime":48742,"nextInTime":48744,"topicId":48738,"numMessagesInTopic":0,"msgSnippet":"Jennifer, Not sure how old your daughter is so take this with a grain of salt.  I am assuming that she is at least elementary school age.  Have to get kids to","messageBody":"<div id=\"ygrps-yiv-1922452649\">Jennifer,<br/>\n<br/>\nNot sure how old your daughter is so take this with a grain of salt.  I am assuming that she is at least elementary school age.  Have to get kids to bed but just read your post and wanted to shoot off a quick response.  Have you talked to her about why she doesn&#39;t like you talking about it?  Could it be that she is worried that you won&#39;t have as much together?  If that is the case, rather than trying to avoid talking about business I would work together to develop a strategy that works for everyone about how you can work and still have time for one another as well as give her space to have the feelings of missing you.  Was there a lot of spereation or stress in your lives about work in the past?  I just get a sense that perhaps this is something best dealt with by supporting her through the feelings she is having and helping her learn to tolerate not always being the focus of all of your attention which is an important thing for her to develop.<br/>\n<br/>\nHTH,<br/>\nAimee</div>","specialLinks":[]},{"userId":471006631,"authorName":"Christina Parker-Barnes","from":"Christina Parker-Barnes &lt;chrisjparkerbarnes@...&gt;","profile":"chrisparkerbarnes@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Starting a business?","postDate":"1341890361","msgId":48744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBNEQxRkM2LTMzOUQtNENGMi1BRDRCLTlFMTQyRjA5OERBMUBnbWFpbC5jb20+","inReplyToHeader":"PGp0ZjloMytzcHAxQGVHcm91cHMuY29tPg==","referencesHeader":"PGp0ZjloMytzcHAxQGVHcm91cHMuY29tPg=="},"prevInTopic":48743,"nextInTopic":48746,"prevInTime":48743,"nextInTime":48745,"topicId":48738,"numMessagesInTopic":0,"msgSnippet":"Hi Jennifer Yes, I am a single Mum and I run a business from my home.  But my son has been part of the process from the start, since there is only the two of","messageBody":"<div id=\"ygrps-yiv-1790580462\">Hi Jennifer<br/>\nYes, I am a single Mum and I run a business from my home.  But my son has been part of the process from the start, since there is only the two of us.  I have always shared my thoughts and discussed everything with him so that he feels completely part of the process and is completely involved.  He understands that for us to do the things we want to do together, we need money and that means some sort of work.  He would rather I work from home than any other alternative.  But we did discuss all alternatives, such as would we be happier if we just accepted welfare benefits (I am in Australia, so don&#39;t know how things work for you) as a single parent, and coped with the shortage of money and only did what we could afford to.<br/>\nHaving said that, he still feels a little unsettled when I am working.  I have clients come to our house and I generally organise that of an evening, when my son is relaxing in front of a DVD, but often when I am working, my son will take some books and snuggle up in my bed, simply because it makes him feel closer to me.  He is getting more comfortable with it as time goes on, but it is still something that is not ideal for him because it does take my attention away from him, even if it is only for an hour. <br/>\nI think this, like many other major changes, is something that needs a lot of time, a lot compassion for your child, and a lot of patient and quiet discussion, with all of you.<br/>\nParenting is about being a family unit, which means that everything that involves the family as a whole (ie pretty much everything) is discussed with the family as a whole.  Your daughter is probably feeling afraid because you are discussing things behind closed doors (or trying to).  Perhaps the best way to think of it is to ask yourself, how would you feel if it was you on the other side of the door while major decisions which have a huge effect of your life, we being made?  Or, how would you feel if it was discussed in front of you without you being part of the discussion?<br/>\nI don&#39;t know the age of your child, but my son is only 6, but I still listen to his input and look at what he has said as being as valuable as the input of an adult.  <br/>\nHope that helps in some way,<br/>\nChris<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/07/2012, at 4:26 AM, Senlin wrote:<br/>\n<br/>\n&gt; Hello, all!<br/>\n&gt; <br/>\n&gt; My fiance and I are trying to put together a much-needed extra income source but are having trouble because our daughter HATES any talk of business. She wants all focus from both parents to be on her at all times. We can&#39;t keep it behind closed doors either as she listens at our door (if awake) and her sleep schedule coupled with my partner&#39;s work schedule does not permit us to talk about things between the two of us while she&#39;s sleeping. I feel as if her discomfort on this subject is undoing all the good that unschooling is doing her. However, we need the extra income to keep us fed and housed not to mention the paid activities our daughter participates in. It&#39;s gotten so that if my partner even mentions his regular day job she becomes enraged. The new endeavor won&#39;t require me to be separated from her at any time so I don&#39;t see it as an abandonment issue... I don&#39;t know how to see it,or what to do, because our daughter is the most important thing in our lives but we definitely need to sort out our finances.<br/>\n&gt; <br/>\n&gt; Do any of you work from home or have you started a new business since you&#39;ve been homeschooling? I&#39;d appreciate any input. Thanks so much.<br/>\n&gt; <br/>\n&gt; --Jennifer<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting a business?","postDate":"1341873699","msgId":48740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0Zm1uMytuNWRlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0Zm1qMCs2NmYzQGVHcm91cHMuY29tPg=="},"prevInTopic":48739,"nextInTopic":48743,"prevInTime":48739,"nextInTime":48741,"topicId":48738,"numMessagesInTopic":0,"msgSnippet":"... Just to clarify that, I work Away from home, I do not work from home. Bad wording, sorry!","messageBody":"<div id=\"ygrps-yiv-22069784\">&quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m currently working full time out of the home<br/>\n<br/>\n </span></blockquote>Just to clarify that, I work Away from home, I do not work from home. Bad wording, sorry!<br/>\n<br/>\n---Mer</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting a business?","postDate":"1341873568","msgId":48739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0Zm1qMCs2NmYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0ZjloMytzcHAxQGVHcm91cHMuY29tPg=="},"prevInTopic":48738,"nextInTopic":48740,"prevInTime":48738,"nextInTime":48740,"topicId":48738,"numMessagesInTopic":0,"msgSnippet":"Without knowing what your plans are, I m afraid this is a bit scattered. I m currently working full time out of the home, while my partner has been building a","messageBody":"<div id=\"ygrps-yiv-1816914332\">Without knowing what your plans are, I&#39;m afraid this is a bit scattered.<br/>\n<br/>\nI&#39;m currently working full time out of the home, while my partner has been building a micro business slowly over the last several years. Before our current arrangement, he worked full time and I did a little work part time from home. It&#39;s Possible to combine work at home and unschooling, but it&#39;s not necessarily easy. It depends on the work and the needs of your kids. Any kind of work takes time and attention... and so do kids! <br/>\n<br/>\nWith two parents working, it can take some creativity and flexibility to &quot;be there&quot; for your child. That&#39;s something to keep in mind as you&#39;re thinking and planning - are you going to be doing the kind of work you can drop at a moment&#39;s notice? If not, it might be a good idea to plan on working in relay with your partner so that when you&#39;re busy, he&#39;s available. <br/>\n<br/>\n&quot;Senlin&quot; &lt;senlin_says@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I feel as if her discomfort on this subject is undoing all the good that unschooling is doing her.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIf she&#39;s feeling so much discomfort on the subject, that&#39;s a sign that she&#39;s seeing herself as less and less important to you compared to money and work. That may not be Your perception! Part of unschooling is striving to look at things from your kid&#39;s point of view - and from her point of view something is terribly wrong. From her perspective, you&#39;ve been shunting her aside to talk money and work, shutting the door on her, pushing her away. Woops. As much as you can, bring her into the process - it could be late in the game for that, since she already feels disenfranchised, but you can help her find ways to adapt.<br/>\n<br/>\nKeep in mind that you are planning on changing her life! If you&#39;ve been trying to reassure her and help her feel better about things, she may be perceiving that as dismissive of her concerns and feelings - better to commiserate, help her grieve if she needs to, and actively brainstorm ways for her to feel connected despite the upcoming changes. The specifics of that are going to depend a whole lot on what you end up doing. Lately, I&#39;ve begun bringing my daughter to work with me once a week - but that totally depended on me having a job where that was feasible and a boss who&#39;s comfortable having her there. At my last job, I arranged to work three and four day weeks and then spend concentrated time with Mo at home. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The new endeavor won&#39;t require me to be separated from her at any time<br/>\n </span></blockquote>***********<br/>\n<br/>\nThat doesn&#39;t sound realistic to me. Work takes time and attention - even simple hand-assembly work you can do from the comfort of your sofa takes a degree of attention and organization. The most common question from parents who are trying to juggle work into home/unschooling is: where do I find the time? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;... the paid activities our daughter participates in.<br/>\n </span></blockquote>***************<br/>\n<br/>\nCan you cut out the paid activities so that she has more time with you? That could help two issues at once if she&#39;s needing more of your attention and you&#39;re needing better cash-flow. Or were you planning on working while she&#39;s at her paid activities? That might be a way to eat your cake and have it, using those as childcare so you can get some work done - depending on what you&#39;re doing. When I worked from home I did hand assembly, which didn&#39;t transport well, but if your work is something you can do on a laptop, that could work, provided you can get a big enough chunk of time to get work done while she&#39;s otherwise occupied. <br/>\n<br/>\nIt could even be easier to get a part time job out of the house rather than try and juggle work at home, so that when you are home you can be there 100%. One of the downsides of self employment is that every day is a work day! <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":335624523,"authorName":"Senlin","from":"&quot;Senlin&quot; &lt;senlin_says@...&gt;","profile":"strange_translation","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Starting a business?","postDate":"1341860195","msgId":48738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0ZjloMytzcHAxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48739,"prevInTime":48737,"nextInTime":48739,"topicId":48738,"numMessagesInTopic":0,"msgSnippet":"Hello, all! My fiance and I are trying to put together a much-needed extra income source but are having trouble because our daughter HATES any talk of","messageBody":"<div id=\"ygrps-yiv-1288385325\">Hello, all!<br/>\n<br/>\n     My fiance and I are trying to put together a much-needed extra income source but are having trouble because our daughter HATES any talk of business. She wants all focus from both parents to be on her at all times. We can&#39;t keep it behind closed doors either as she listens at our door (if awake) and her sleep schedule coupled with my partner&#39;s work schedule does not permit us to talk about things between the two of us while she&#39;s sleeping. I feel as if her discomfort on this subject is undoing all the good that unschooling is doing her. However, we need the extra income to keep us fed and housed not to mention the paid activities our daughter participates in. It&#39;s gotten so that if my partner even mentions his regular day job she becomes enraged. The new endeavor won&#39;t require me to be separated from her at any time so I don&#39;t see it as an abandonment issue... I don&#39;t know how to see it,or what to do, because our daughter is the most important thing in our lives but we definitely need to sort out our finances.<br/>\n<br/>\n    Do any of you work from home or have you started a new business since you&#39;ve been homeschooling? I&#39;d appreciate any input. Thanks so much.<br/>\n<br/>\n--Jennifer</div>","specialLinks":[]}],"prevTopicId":48734,"nextTopicId":48729}}