{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] non unschooling friend needs help w/ dd","postDate":"1227122706","msgId":37067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDgxMTE5MTEyNXcyMWE5MWIxMXFiZTM0MjNjNDMyZDVjNTVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEJDQkI5NEQ2QTUzMDQ0QjRCMEE5OEYxOUY2MUMzRkFGQFJvY2tldFNhdWNlMj4=","referencesHeader":"PEJDQkI5NEQ2QTUzMDQ0QjRCMEE5OEYxOUY2MUMzRkFGQFJvY2tldFNhdWNlMj4="},"prevInTopic":37066,"nextInTopic":0,"prevInTime":37066,"nextInTime":37068,"topicId":37062,"numMessagesInTopic":0,"msgSnippet":"I can only speak of this as it happens in our family... and it doesn t much look like what you ve described! Hayden (now 10) has wanted a dog for the most of","messageBody":"<div id=\"ygrps-yiv-1342420342\">I can only speak of this as it happens in our family... and it doesn&#39;t much<br/>\nlook like what you&#39;ve described!<br/>\nHayden (now 10) has wanted a dog for the most of his life.  *I* was not<br/>\nready for us to have a dog!! About a year ago, I was ready to have *a<br/>\nconversation* about a dog and our work really started.  I watched The Dog<br/>\nWhisperer faithfully, read both of his books, poured over multiple websites<br/>\nre: dog care & training, and shared daily what I was gathering and<br/>\nlearning.  As a family, we looked at breeds & especially activity levels, we<br/>\ntook perfect pet quizzes & finally narrowed down our choices.<br/>\nAs grownups, we had our own conversations about the absurdity of making a<br/>\nyoung human fully responsible for the life of another being -- especially<br/>\nanother being *WE* didn&#39;t even have experience caring for.  We knew this was<br/>\na grownup commitment to our family or no commitment at all. (I wasn&#39;t even<br/>\ngoing to invite resentment into the equation!).<br/>\nWe got Charlie, a 4 year old Newfie mix, on June 15. The most of the<br/>\ndog-care responsibilities have fallen to me: I gotta a good grasp on what it<br/>\ntakes to foster a balanced dog; I&#39;m figuring it out &quot;on the job&quot; and<br/>\nmodeling for both Scotty and Hayden; Hayden has long had a &quot;watch first, act<br/>\nsecond&quot; sense of learning; we&#39;re getting more physical exercise than ever<br/>\nbefore (tired dog=happy family) -- even Hayden&#39;s volunteering to run the dog<br/>\non the bike occasionally (because we make it fun to take the dog out --<br/>\ninteresting books on tape, balls to play with at the park - convienently 1/2<br/>\nway thru the walk, apples to collect and feed the neighbor cows).<br/>\nI really like the way it&#39;s playing out at our house... naturally and *fun*<br/>\n-- none of that power/ultimatum ickiness!<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Nov 18, 2008 at 5:11 PM, DJ250 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dj250@...\">dj250@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   Ok, so my homeschooling friend has a situation w/ her daughter that<br/>\n&gt; she&#39;d like advice on. Here&#39;s what she told me:<br/>\n&gt;<br/>\n&gt; DD said she wanted a bunny (this is like 2 years ago) and even came up w/ a<br/>\n&gt; list for caring for it (&quot;I will....&quot;). Now she&#39;s iffy on the feeding and<br/>\n&gt; cleaning, not as diligent. Mom wants her to hold up her end of the bargain.<br/>\n&gt; DD came up w/ &quot;let&#39;s swap chores&quot; w/ Mom. Mom said ok. Then, dd wants to<br/>\n&gt; change back. Mom loves the rabbit and is thinking of going ahead with doing<br/>\n&gt; the rabbit care chores for her but is not sure she feels ok with doing so<br/>\n&gt; with no strings attached. She&#39;s afraid it&#39;s going to teach her it&#39;s ok to<br/>\n&gt; give up on your end of the bargain when you made one. Dad says if dd doesn&#39;t<br/>\n&gt; do the work, bunny goes bye-bye.<br/>\n&gt; .<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] non unschooling friend needs help w/ dd","postDate":"1227119197","msgId":37066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDQzhDMDc2LTg0MTctNENENC1BMjQ4LUE3MkIxQTUzMzcyOUBtYWMuY29tPg==","inReplyToHeader":"PDY1MjRDQTFBLTJGQ0QtNDBGRi05Mzg0LTU2MUZEMEY1NDcwREB2ZXJpem9uLm5ldD4=","referencesHeader":"PEJDQkI5NEQ2QTUzMDQ0QjRCMEE5OEYxOUY2MUMzRkFGQFJvY2tldFNhdWNlMj4gPDY1MjRDQTFBLTJGQ0QtNDBGRi05Mzg0LTU2MUZEMEY1NDcwREB2ZXJpem9uLm5ldD4="},"prevInTopic":37064,"nextInTopic":37067,"prevInTime":37065,"nextInTime":37067,"topicId":37062,"numMessagesInTopic":0,"msgSnippet":"I run the box office at our local community college theater. Performer/ students who are in the various shows at the college are required to do some kind of","messageBody":"<div id=\"ygrps-yiv-2110017644\">I run the box office at our local community college theater. Performer/ <br/>\nstudents who are in the various shows at the college are required to  <br/>\ndo some kind of crew work during the semester and box office is one of  <br/>\ntheir options. So, at the beginning of the semester they sign up for  <br/>\nthe days/hours they agree to work. I sign up four students for every  <br/>\nhour that the box office is open, even though I only need one student  <br/>\nin there with me at a time. The reason I sign up four is that it is  <br/>\nextremely likely that only 1 out of 4 will actually show up. I give  <br/>\nthem a calendar with the days/hours they&#39;ve signed up for. I call them  <br/>\na week or so before each show to remind them and they always say,  <br/>\n&quot;Yes, I&#39;ll be there.&quot; Then I text message them the day before if it  <br/>\nhas been a week or two since their last work time. I never ever have  <br/>\nhad more than two show up at once. Almost always I get one. Sometimes  <br/>\nI get none. When they do show up, they often show up as much as an  <br/>\nhour late.<br/>\n<br/>\nYesterday Roxana and Rosie were were saying that their musical theater  <br/>\ntechniques course is so frustrating because so many students in there  <br/>\nare so lazy and whiny and don&#39;t pay attention and don&#39;t cooperate.  <br/>\nThey said they could sort of understand it if they were being made to  <br/>\nbe there, but this isn&#39;t a required class for anybody. Rosie and Rox  <br/>\nwere saying they just don&#39;t GET it. Some specific examples: students  <br/>\nconstantly talking so the director has to wait for them to be quiet,  <br/>\nnot being prepared - not having their music with them and not having  <br/>\nlearned lines or practiced dance steps at all, skipping lots of  <br/>\nclasses and then asking to be helped to get caught up during class,  <br/>\nwearing flip-flops to class even though the teacher has specifically  <br/>\ntold that student repeatedly to wear other shoes that they can dance  <br/>\nin, coming in very late and being disruptive, not paying any attention  <br/>\nto directions - needing to have them repeated over and over, not  <br/>\ntaking notes and having to be told the same directions again at the  <br/>\nnext class/rehearsal. All of this while talking loudly and complaining  <br/>\na lot about things like not liking this song, not liking the part  <br/>\nthey&#39;re given, not liking the accompanist, not liking the room or the  <br/>\nair temperature or the chairs. They blatantly disregard the directors  <br/>\nrequests - like, &quot;Stay in your places,&quot; while he works with a smaller  <br/>\ngroup - they leave and go out to get water or just go sit down and  <br/>\nwhen he turns back he has to wait to get the group back together again.<br/>\n<br/>\nThey really are sort of bewildered by why the other students are like  <br/>\nthis. So I asked them why they think they don&#39;t do those things.<br/>\n<br/>\nThey had a hard time articulating exactly why, but Roxana said it is  <br/>\nbecause they see the big picture - they understand that they are all  <br/>\ngoing to get the most they can out of the class if they all  <br/>\ncollaborate and work hard and pay attention. She said, &quot;It is just the  <br/>\nright way to behave, I don&#39;t know, I can&#39;t understand why they don&#39;t  <br/>\nall see that.&quot; She said they are all going to be on stage, putting on  <br/>\na show in front of an audience, at the end of the semester, and she  <br/>\nwants it to be the best it can be - she definitely doesn&#39;t want to be  <br/>\nembarrassed by it. And she said, &quot;I would be so ashamed of myself to  <br/>\nbehave the way they do - I wouldn&#39;t have respect for myself.&quot;<br/>\n<br/>\nThere is another girl in the class and I&#39;ve known her well since she  <br/>\nwas about 7 or 8 years old - very relaxed homeschooled girl who has  <br/>\nalso been treated with great respect and support, never shamed or  <br/>\npunished. She is exactly like my girls - pays attention, does what  <br/>\nshe&#39;s supposed to do, goes the extra mile, is cheerfully and  <br/>\ncompletely responsible.<br/>\n<br/>\nThe interesting thing to me is that these are kids who have not lived  <br/>\nwith shame, they have not been parented by people who belittled them  <br/>\nat all, and yet they have internalized the desire to avoid feeing  <br/>\nashamed. The other kids who have probably had conventional parents and  <br/>\nconventional schooling do not seem to be ashamed of themselves at  <br/>\nall.  They are not embarrassed to have the director say, &quot;I&#39;ve told  <br/>\nyou three time already to wear other shoes. Please, next time, no flip- <br/>\nflops.&quot; The student just smiles and says, &quot;Oops, sorry, okay,&quot; but  <br/>\ndoesn&#39;t seem genuinely sorry or at all embarrassed. When the teacher  <br/>\nturns around and says, &quot;Hey, I told you to stay in your places,&quot; they  <br/>\nsay, &quot;I was tired, I wanted to sit down,&quot; or &quot;I needed a drink,&quot; as  <br/>\nthey put their cell phone back in their pockets. No sense of  <br/>\nembarrassment that they are holding up the class. No genuine apology,  <br/>\never.<br/>\n<br/>\nRoxana once left her music notebook in the theater and the director  <br/>\npicked it up. Rox was frantically looking for it, later, and had to  <br/>\ncall and ask him if he&#39;d seen it. He had it and said, &quot;You need to  <br/>\nkeep better track of this.&quot; She took THAT as harsh criticism and ever  <br/>\nsince worried that he would think of her as someone who was careless  <br/>\nwith her stuff.<br/>\n<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 19, 2008, at 3:47 AM, Joyce Fetteroll wrote:<br/>\n<br/>\n&gt; But unschoolers don&#39;t then say &quot;Whatever!&quot; to whatever kids do. We&#39;re<br/>\n&gt; engaged in the process of helping them learn. What unschoolers do<br/>\n&gt; *instead* of making kids stick with a responsibility, is to see each<br/>\n&gt; attempt at responsibility as a step in learning responsibility. We<br/>\n&gt; talk about the task they&#39;re taking on and who is depending on them to<br/>\n&gt; follow through. (This is *not* a guilt trip! It&#39;s information.) We<br/>\n&gt; trust that they don&#39;t want to hurt others but we accept that they&#39;re<br/>\n&gt; young and may not *yet* be capable of fully grasping what they&#39;re<br/>\n&gt; taking on. We are there to help them. We&#39;re their partners. We build<br/>\n&gt; up trust and they know that we&#39;re there supporting them. </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] non unschooling friend needs help w/ dd","postDate":"1227095249","msgId":37064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MjRDQTFBLTJGQ0QtNDBGRi05Mzg0LTU2MUZEMEY1NDcwREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEJDQkI5NEQ2QTUzMDQ0QjRCMEE5OEYxOUY2MUMzRkFGQFJvY2tldFNhdWNlMj4=","referencesHeader":"PEJDQkI5NEQ2QTUzMDQ0QjRCMEE5OEYxOUY2MUMzRkFGQFJvY2tldFNhdWNlMj4="},"prevInTopic":37062,"nextInTopic":37066,"prevInTime":37063,"nextInTime":37065,"topicId":37062,"numMessagesInTopic":0,"msgSnippet":"... I think what s making the situation hard to see clearly is the very common idea that we teach responsibility by making a child stick with something. As","messageBody":"<div id=\"ygrps-yiv-155863916\">On Nov 18, 2008, at 8:11 PM, DJ250 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; DD said she wanted a bunny (this is like 2 years ago) and even came  <br/>\n&gt; up w/ a list for caring for it (&quot;I will....&quot;).  Now she&#39;s iffy on  <br/>\n&gt; the feeding and cleaning, not as diligent.  Mom wants her to hold  <br/>\n&gt; up her end of the bargain.  DD came up w/ &quot;let&#39;s swap chores&quot; w/  <br/>\n&gt; Mom.  Mom said ok.  Then, dd wants to change back.  Mom loves the  <br/>\n&gt; rabbit and is thinking of going ahead with doing the rabbit care  <br/>\n&gt; chores for her but is not sure she feels ok with doing so with no  <br/>\n&gt; strings attached.  She&#39;s afraid it&#39;s going to teach her it&#39;s ok to  <br/>\n&gt; give up on your end of the bargain when you made one.  Dad says if  <br/>\n&gt; dd doesn&#39;t do the work, bunny goes bye-bye.<br/>\n<br/>\n </span></blockquote>I think what&#39;s making the situation hard to see clearly is the very  <br/>\ncommon idea that we teach responsibility by making a child stick with  <br/>\nsomething.<br/>\n<br/>\nAs adults, there isn&#39;t a single responsibility we have that we can&#39;t  <br/>\ndrop. There might be dire consequences to the thing or our  <br/>\nreputation! but we have the freedom to drop them. We have the freedom  <br/>\nto choose to what level we will maintain our responsibilities.  <br/>\nFathers and mothers could choose to walk out on their kids. But  <br/>\neveryday the ones who stay have chosen to stay. There&#39;s no authority  <br/>\nmaking them ready to send them to their rooms if they drop their  <br/>\nresponsibility to their kids. They *could* empty the bank account and  <br/>\ntake off to Mexico. But they make the choice to stay.<br/>\n<br/>\nA responsibility is something we feel we need to put effort into  <br/>\ndoing because the benefit of doing outweighs the benefit of not  <br/>\ndoing. That feeling of responsibility isn&#39;t something we can impose  <br/>\non someone else. We can make children go through the motions of  <br/>\nresponsibility, but we don&#39;t grow those feelings by making them do  <br/>\nwhat we tell them (or even by making them follow through on what they  <br/>\nagreed.)<br/>\n<br/>\nIf we don&#39;t have that freedom to drop a responsibility, then what  <br/>\nwe&#39;re doing isn&#39;t a responsibility but forced labor.<br/>\n<br/>\nNo matter how much kids beg and promise they&#39;ll do the work of a pet,  <br/>\nthey just aren&#39;t capable of understanding the years of commitment  <br/>\ninvolved in keeping a pet. The daughter already understands the pet  <br/>\nwas more work than she thought. (That doesn&#39;t mean emotion might not  <br/>\noverwhelm her and make her forget when she sees some big brown puppy  <br/>\neyes ;-) But that doesn&#39;t mean she hasn&#39;t absorbed something  <br/>\nimportant from the experience with the rabbit.) Forcing her to  <br/>\ncontinue to care for the rabbit won&#39;t make the message that the task  <br/>\nwas bigger than she thought any clearer. It could very well make her  <br/>\nresent the rabbit (and it&#39;s quality of life will go down.) It will  <br/>\nmodel for her that it&#39;s great to be the one in power who can make  <br/>\nsomeone else do a yucky job you don&#39;t want to do and it sucks to be  <br/>\nthe one without power who is made to do it.<br/>\n<br/>\nDespite what conventional parenting wisdom says, kids don&#39;t need to  <br/>\nbe made to act responsible in order to become responsible. That&#39;s not  <br/>\njust a theory! Unschoolers *know* they don&#39;t need forced and have  <br/>\nseen the positive results.<br/>\n<br/>\nBut unschoolers don&#39;t then say &quot;Whatever!&quot; to whatever kids do. We&#39;re  <br/>\nengaged in the process of helping them learn. What unschoolers do  <br/>\n*instead* of making kids stick with a responsibility, is to see each  <br/>\nattempt at responsibility as a step in learning responsibility. We  <br/>\ntalk about the task they&#39;re taking on and who is depending on them to  <br/>\nfollow through. (This is *not* a guilt trip! It&#39;s information.) We  <br/>\ntrust that they don&#39;t want to hurt others but we accept that they&#39;re  <br/>\nyoung and may not *yet* be capable of fully grasping what they&#39;re  <br/>\ntaking on. We are there to help them. We&#39;re their partners. We build  <br/>\nup trust and they know that we&#39;re there supporting them.<br/>\n<br/>\nWhen we&#39;re partners, kids do grasp -- as they&#39;re developmentally able  <br/>\n-- when we pick up the slack for them. They appreciate our help  <br/>\nbecause we don&#39;t do it resentfully to make them feel guilty. (Forced  <br/>\nguilt often leads to anger at the one who is making you feel guilty.)  <br/>\nAppreciation is not a feeling we can force kids to have! It&#39;s  <br/>\nsomething that grows because our kids trust that we&#39;re truly trying  <br/>\nto help them.<br/>\n<br/>\nThe way an unschooler might approach this is for the mom to  <br/>\nunderstand that her daughter didn&#39;t understand how much work was  <br/>\ninvolved. A dialogue might go:<br/>\n<br/>\nMom: &quot;The bunny is more work than you expected.&quot;<br/>\nDaughter: &quot;Yes, it&#39;s really smelly and it poops everywhere. The cage  <br/>\ntakes hours to clean and I have to do it everyday! And sometimes the  <br/>\nlettuce is all gross and I have to pick off the rotten parts.&quot;<br/>\nMom: &quot;What are some of our options of getting the care the bunny needs?&quot;<br/>\n<br/>\n(This is *not* a trick question to lead the daughter to the &quot;right&quot;  <br/>\nanswer of agreeing to take better care. It&#39;s a real question. Really  <br/>\nexplore all options, even off the wall ones like releasing the bunny  <br/>\ninto the wild. They can talk about the consequences. *All* options  <br/>\nhave good and bad parts and it&#39;s good problem solving to honestly  <br/>\nlook at them rather than rejecting them right off.)<br/>\n<br/>\nMom: &quot;Well, since I do like the bunny, I don&#39;t mind taking care of it.&quot;<br/>\nDaughter: &quot;I&#39;ll do the laundry for you!&quot;<br/>\nMom: &quot;I do appreciate the offer but it&#39;s not necessary.&quot;<br/>\n<br/>\n(Mom shouldn&#39;t hesitate to ask the daughter to help with the rabbit  <br/>\ncare. But it should be a real question and the daughter should be  <br/>\nable to say no. But make it easy for the daughter to help. Make  <br/>\ncaring for the rabbit a pleasant experience for all, including the  <br/>\nrabbit!)<br/>\n<br/>\n(The beauty of this -papproach is that we model problem solving for  <br/>\nkids rather than top down management. :-) They get to see how to  <br/>\napproach a problem and seek out solutions rather than the model of  <br/>\nimposing a solution on the less powerful that they often do see and  <br/>\nexperience.)<br/>\n<br/>\nWritten out like that it sounds way too formal! It should be natural  <br/>\nconversation. And in an unschooling home it&#39;s likely that dialog  <br/>\nmight happen over time since we don&#39;t leave them to their own devices  <br/>\nand only jump in when there&#39;s a problem. We&#39;re there with them, being  <br/>\ntheir partner. Not necessarily at their side all the time, but aware  <br/>\nof what&#39;s going on with them and talking about other solutions to  <br/>\nlittle problems before it gets to the hands up &quot;I can&#39;t take this any  <br/>\nmore!&quot; stage.<br/>\n<br/>\nIf there is a &quot;sit down talk&quot;, a good thing to read first is Sandra  <br/>\nDodd&#39;s essay &quot;Leaning on a truck&quot;:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\nAnd, yes, my 17 yo daughter does take her responsibilities seriously  <br/>\neven though I never made her :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"non unschooling friend needs help w/ dd","postDate":"1227057095","msgId":37062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQkI5NEQ2QTUzMDQ0QjRCMEE5OEYxOUY2MUMzRkFGQFJvY2tldFNhdWNlMj4="},"prevInTopic":0,"nextInTopic":37064,"prevInTime":37061,"nextInTime":37063,"topicId":37062,"numMessagesInTopic":0,"msgSnippet":"Ok, so my homeschooling friend has a situation w/ her daughter that she d like advice on.  Here s what she told me: DD said she wanted a bunny (this is like 2","messageBody":"<div id=\"ygrps-yiv-389132188\">Ok, so my homeschooling friend has a situation w/ her daughter that she&#39;d like advice on.  Here&#39;s what she told me:<br/>\n<br/>\nDD said she wanted a bunny (this is like 2 years ago) and even came up w/ a list for caring for it (&quot;I will....&quot;).  Now she&#39;s iffy on the feeding and cleaning, not as diligent.  Mom wants her to hold up her end of the bargain.  DD came up w/ &quot;let&#39;s swap chores&quot; w/ Mom.  Mom said ok.  Then, dd wants to change back.  Mom loves the rabbit and is thinking of going ahead with doing the rabbit care chores for her but is not sure she feels ok with doing so with no strings attached.  She&#39;s afraid it&#39;s going to teach her it&#39;s ok to give up on your end of the bargain when you made one.  Dad says if dd doesn&#39;t do the work, bunny goes bye-bye.<br/>\n<br/>\nThanks,<br/>\n~Melissa :)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1763,"nextTopicId":37044}}