{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: refusal","postDate":"1173283476","msgId":21962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbW5xays1ZG0zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgyMjc3MC4xMjQ4LnFtQHdlYjYwMzEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":21959,"nextInTopic":0,"prevInTime":21961,"nextInTime":21963,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"I have a few kids as well who don t always like to go places. My 12 year old is old enough to stay home, and since he s done his first aid training he will","messageBody":"<div id=\"ygrps-yiv-417117566\">I have a few kids as well who don&#39;t always like to go places. My 12 year old is old enough <br/>\nto stay home, and since he&#39;s done his first aid training he will keep the 8 yo OR the 7yo <br/>\nhome with him if they don&#39;t want to go. I try to not do both at the same time since they <br/>\ntend to squabble until violence occurs. We also have a neighbor who works irregular <br/>\nhours, so I can always call and ask them to walk over to keep an eye on kids. <br/>\n<br/>\nBut generally we sweeten the pot until everyone wants to go. Playdate? well, if you can <br/>\nsuck it up for an hour with your gameboy, DS or library book, then I think it would be fair <br/>\nto stop for a smoothie. Library? Well, take what you want to play with, and you can play <br/>\nwhile everyone else is looking. We try to keep it shorter if people didn&#39;t want to go, and we <br/>\ntake a ton of treasures to keep people busy. The extra trips usually double our time out of <br/>\nthe house, especially if Josh says, &quot;Well, I want to go but only if we can stop by Borders,&quot; <br/>\nand Emily says &quot;I want to swing by Toys R Us and see how much X, Y and Z is&quot;, and Rachel <br/>\nwant&#39;s the icee from 7-11, but Sam want&#39;s a smoothie from Braums, and Breanna want&#39;s <br/>\nthe mall and the candy store. <br/>\n<br/>\nIt&#39;s probably also some remnant of our mommy/kid dates too, that they just like to get out <br/>\nof the house. Having choices on what to do when out helps a lot. <br/>\n<br/>\nMelissa<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Katharine Wise &lt;katharinewise@...&gt; wrote:<br/>\n&gt; This raises a broader question or two I&#39;ve been wondering recently:  how do others with <br/>\nmultiple children (but no-one old enough to stay home alone or with littler ones) handle <br/>\nmaking decisions to go someplace?  Do others with a child (or more) who generally don&#39;t <br/>\nlike to go places and/or are very shy worry about it?  It seems very limiting, not just for the <br/>\nrest of us, but also for the child who wants to stay at home (and usually, inside). </span></blockquote></div>","specialLinks":[]},{"userId":222220143,"authorName":"Ginger Sabo","from":"Ginger Sabo &lt;kaikade@...&gt;","profile":"kaikade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] refusal","postDate":"1173281406","msgId":21959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNTM5MS4zMjk0Ni5xbUB3ZWIzNDIxMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":21958,"nextInTopic":21962,"prevInTime":21958,"nextInTime":21960,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"I have a 7 year old that hates to go places.  I let him know far in advance that we have to go someplace.  Then if he says he doesn t want to go I say we can","messageBody":"<div id=\"ygrps-yiv-1703758621\">I have a 7 year old that hates to go places.  I let him know far in advance that we have to go someplace.  Then if he says he doesn&#39;t want to go I say we can try the neighbors we have that can watch him.  I also mention that if they are not home or not available that he will have to come.  When I can each of the 3, I make sure he is in earshot so that he know. After I finish the call I let him know if I was able to talk with the potential &#39;sitter&#39; or if I left a message.  I also try and say something that lets him know I am doing everything I can to honor his need.  If all else fails, he had to come with us. I try and make sure he has food and a toy(s) for the car and trip.  If he is aware of all that I try and do for him, he&#39;s ok with going (not happy with it, but not complaining either).  This has been the case for over 6 months now...hoping for him to find a solution within himself.<br/>\n<br/>\n <br/>\nIn Peace,<br/>\nGinger<br/>\nKai(7) and Kade(5)<br/>\n<br/>\nLOVE has impact.<br/>\n<br/>\n&quot;It&#39;s not our differences that divide us. It is our inability to recognize, accept and celebrate those differences.&quot; - Audre Lorde<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Katharine Wise &lt;katharinewise@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Wednesday, March 7, 2007 7:26:03 AM<br/>\nSubject: Re: [unschoolingbasics] refusal<br/>\n<br/>\nThanks, Lisa and Rachel,<br/>\n<br/>\nGlad to know I&#39;m not alone in having a child (or two -- my 4yo is leaning this way too) who doesn&#39;t want to go anywhere (or at least, very, very often doesn&#39;t:-).<br/>\n<br/>\nIn this case, going later really wasn&#39;t an option, although certainly other times it might be. We did end up having a pleasant afternoon anyway. I held my eldest while he (and I as well, but quietly) cried. Told 7yo that we were sad -- 10yo b/c of not going and me b/c of not going but also b/c I could tell that he was feeling angry about going and I didn&#39;t really know why (or something like that). Then 10yo and I read together for awhile, by which point 7yo had unlocked the door. When he came out, we all built bridges with K&#39;nex.<br/>\n<br/>\nAside from the one sentence I spoke through the door, I never said anything more about it to my 7yo. Just gave him a hug when I saw him again after he&#39;d come out. I&#39;m not sure if I should try to talk with him about it. He tends to cover his face, trying not to smile. If I ask questions trying to get at what was going on for him or what we could do differently to help him, he just says, &quot;I don&#39;t know.&quot;<br/>\n<br/>\nI do generally try to look for ways my 7yo doesn&#39;t have to go places if he doesn&#39;t want to. Sometimes he can go to dh&#39;s office or dh can come home to work. Sometimes I can get a ride to/from an activity for my oldest (or dh can take him). But there are times when, in order to get 10yo to karate, the younger boys and I need to take him or pick him up.<br/>\n<br/>\nThis raises a broader question or two I&#39;ve been wondering recently: how do others with multiple children (but no-one old enough to stay home alone or with littler ones) handle making decisions to go someplace? Do others with a child (or more) who generally don&#39;t like to go places and/or are very shy worry about it? It seems very limiting, not just for the rest of us, but also for the child who wants to stay at home (and usually, inside). <br/>\n<br/>\nKatharine<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Lisa Heyman &lt;Lmanathome@msn. com&gt;<br/>\n<br/>\nFor future planning - Was this date planned with everyone in agreement to <br/>\nstart with? Had he been consulted on the plans in advance? Was he involved <br/>\nin something more important to him when it was time to leave? Do you have <br/>\nany idea why he is resistant to going?<br/>\n<br/>\n____________ _________ _________ _________ _________ _________ _<br/>\nDon&#39;t get soaked. Take a quick peek at the forecast<br/>\nwith the Yahoo! Search weather shortcut.<br/>\nhttp://tools. search.yahoo. com/shortcuts/ #loc_weather<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nBe a PS3 game guru.<br/>\nGet your game face on with the latest PS3 news and previews at Yahoo! Games.<br/>\nhttp://videogames.yahoo.com/platform?platform=120121<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: refusal","postDate":"1173281270","msgId":21958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbWxsbStrdGlpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgyMjc3MC4xMjQ4LnFtQHdlYjYwMzEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":21953,"nextInTopic":21959,"prevInTime":21957,"nextInTime":21959,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"... Today I m going to the skatepark with my stepson while Mo hangs out at home with our neighbor. The neighbor s a bit more of the: I m the adult so we re","messageBody":"<div id=\"ygrps-yiv-1842333453\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Katharine Wise <br/>\n&lt;katharinewise@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; This raises a broader question or two I&#39;ve been wondering <br/>\n&gt;recently:  how do others with multiple children (but no-one old <br/>\n&gt;enough to stay home alone or with littler ones) handle making <br/>\n&gt;decisions to go someplace?  <br/>\n<br/>\n </span></blockquote>Today I&#39;m going to the skatepark with my stepson while Mo hangs out <br/>\nat home with our neighbor. The neighbor&#39;s a bit more of the: &quot;I&#39;m <br/>\nthe adult so we&#39;re doing it my way&quot; persuasion, but Mo likes her, so <br/>\nI&#39;m reasonably comfortable with the situation. <br/>\n<br/>\nIf/when we don&#39;t have that option, I load up the car with a whole <br/>\nbunch of stuff for Mo to do *in* the car to make the trip more <br/>\npalatable to her - she might want to get out and play or socialize <br/>\nwherever we are going, but I don&#39;t count on it. The portable DVD <br/>\nplayer helps to sweeten this a Lot - unfortunately it&#39;s having <br/>\ntechnical problems at the moment, so I have to look for other ways <br/>\nfor Mo to get her needs met. Packing toys or books she hasn&#39;t seen <br/>\nfor awhile helps, or stopping to get something new at the dollar <br/>\nstore. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Do others with a child (or more) who <br/>\n&gt;generally don&#39;t like to go places and/or are very shy worry about <br/>\n&gt;it?  It seems very limiting, not just for the rest of us, but also <br/>\n&gt;for the child who wants to stay at home (and usually, inside). <br/>\n<br/>\n </span></blockquote> Some people need to watch or otherwise &quot;take in&quot; a new environment <br/>\nfor a period of time before interacting - that&#39;s usually considered <br/>\na problem, but its a way of learning. Mo needs to watch people for <br/>\nawhile before she&#39;ll interact (&quot;shy&quot;), but will launch herself into <br/>\na physical situation with no hesitation. Her best pal is exactly the <br/>\nopposite - she&#39;ll run up to complete strangers and start a <br/>\nconversation, but hold back and need to watch Mo (or someone else <br/>\nshe knows) *do* something physical before trying it. <br/>\n<br/>\nGoing new places or meeting new people can be stressful. Both Mo and <br/>\nher pal will opt to stay home if they aren&#39;t up for the stress of <br/>\ndealing with &quot;newness&quot;. I work around that as much as I can with Mo -<br/>\n I feel the same way, myself pretty often, so staying home is just <br/>\nfine with me. *I* don&#39;t feel limited by staying home most of the <br/>\ntime. <br/>\n<br/>\nMy stepson&#39;s a lot more social, though, so we&#39;re working on finding <br/>\nways for him to get *out* more that also respect Mo&#39;s needs - mostly <br/>\nfinding people-resources, in our case.<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":224484022,"authorName":"Rachel Salavon","from":"&quot;Rachel Salavon&quot; &lt;rachelsalavon@...&gt;","profile":"mom2twon2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: refusal","postDate":"1173275783","msgId":21953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbWdhNys1Mmg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgyMjc3MC4xMjQ4LnFtQHdlYjYwMzEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":21950,"nextInTopic":21958,"prevInTime":21952,"nextInTime":21954,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"This is a hard one.  In my case, my 7yo is the oldest.  With twin toddlers, it is easier for us to just stay home.  We stay home as much as possible - which is","messageBody":"<div id=\"ygrps-yiv-564857194\">This is a hard one.  In my case, my 7yo is the oldest.  With twin <br/>\ntoddlers, it is easier for us to just stay home.  We stay home as <br/>\nmuch as possible - which is almost all the time.  If we have to go <br/>\npick up/ drop off, I try to make it as painless as possible for <br/>\nhim.  He&#39;ll sometimes stay in the car while I run in (it&#39;s better if <br/>\nhe doesn&#39;t have to wear shoes!). My 5yo is very social and loves to <br/>\ngo places and be with people.  He just recently started going to <br/>\nJudo with my DH.  He seems happy about it (although I hate <br/>\ncompetitive sports for young children).  I try to run all errands <br/>\nwhile DH is home -- which sometimes means groceries at midnight.  <br/>\nAnd I take one or two of the younger ones with me on other trips.  I <br/>\nhave to admit, we would probably go to the zoo and the park a lot <br/>\nmore often if my 7yo was willing.  He has made it very clear that he <br/>\ndoes not like going anywhere.  For some reason he just needs to be <br/>\nhome.  But my other children are young enough that they are happy <br/>\nbeing home too.<br/>\n<br/>\nI have a friend who says parkdays and get togethers with other <br/>\nunschoolers are more for the moms than the kids.  I think she&#39;s <br/>\nright.  We need some adult human contact.  I&#39;m glad I at least have <br/>\nthe internet for some interaction with other moms.<br/>\n<br/>\n&lt;katharinewise@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote> We did end up having a pleasant afternoon anyway.  I held my eldest <br/>\nwhile he (and I as well, but quietly) cried.   Told 7yo that we were <br/>\nsad -- 10yo b/c of not going and me b/c of not going but also b/c I <br/>\ncould tell that he was feeling angry about going and I didn&#39;t really <br/>\nknow why (or something like that).  Then 10yo and I read together <br/>\nfor awhile, by which point 7yo had unlocked the door.  When he came <br/>\nout, we all built bridges with K&#39;nex.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>That is beautiful.  It&#39;s hardest to show your love and generosity in <br/>\nthose moments - especially if another child is hurting.  But that is <br/>\nwhen they need your understanding the most.  I suppose in time, he <br/>\nwill be able to tell you why.  At least he has the freedom to be <br/>\nhonest about his needs.<br/>\n<br/>\nRachel</div>","specialLinks":[]},{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] refusal","postDate":"1173273963","msgId":21950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMjc3MC4xMjQ4LnFtQHdlYjYwMzEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":21946,"nextInTopic":21953,"prevInTime":21949,"nextInTime":21951,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"Thanks, Lisa and Rachel, Glad to know I m not alone in having a child (or two -- my 4yo is leaning this way too) who doesn t want to go anywhere (or at least,","messageBody":"<div id=\"ygrps-yiv-1483017188\">Thanks, Lisa and Rachel,<br/>\n<br/>\nGlad to know I&#39;m not alone in having a child (or two -- my 4yo is leaning this way too) who doesn&#39;t want to go anywhere (or at least, very, very often doesn&#39;t:-).<br/>\n<br/>\nIn this case, going later really wasn&#39;t an option, although certainly other times it might be.  We did end up having a pleasant afternoon anyway.  I held my eldest while he (and I as well, but quietly) cried.   Told 7yo that we were sad -- 10yo b/c of not going and me b/c of not going but also b/c I could tell that he was feeling angry about going and I didn&#39;t really know why (or something like that).  Then 10yo and I read together for awhile, by which point 7yo had unlocked the door.  When he came out, we all built bridges with K&#39;nex.<br/>\n<br/>\nAside from the one sentence I spoke through the door, I never said anything more about it to my 7yo.  Just gave him a hug when I saw him again after he&#39;d come out.  I&#39;m not sure if I should try to talk with him about it.  He tends to cover his face, trying not to smile.  If I ask questions trying to get at what was going on for him or what we could do differently to help him, he just says, &quot;I don&#39;t know.&quot;<br/>\n<br/>\nI do generally try to look for ways my 7yo doesn&#39;t have to go places if he doesn&#39;t want to.  Sometimes he can go to dh&#39;s office or dh can come home to work.  Sometimes I can get a ride to/from an activity for my oldest (or dh can take him).  But there are times when, in order to get 10yo to karate, the younger boys and I need to take him or pick him up.<br/>\n<br/>\nThis raises a broader question or two I&#39;ve been wondering recently:  how do others with multiple children (but no-one old enough to stay home alone or with littler ones) handle making decisions to go someplace?  Do others with a child (or more) who generally don&#39;t like to go places and/or are very shy worry about it?  It seems very limiting, not just for the rest of us, but also for the child who wants to stay at home (and usually, inside). <br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Lisa Heyman &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Lmanathome@...\">Lmanathome@...</a>&gt;<br/>\n<br/>\n<br/>\nFor future planning - Was this date planned with everyone in agreement to <br/>\nstart with?  Had he been consulted on the plans in advance?  Was he involved <br/>\nin something more important to him when it was time to leave?  Do you have <br/>\nany idea why he is resistant to going?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nDon&#39;t get soaked.  Take a quick peek at the forecast<br/>\nwith the Yahoo! Search weather shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#loc_weather\">http://tools.search.yahoo.com/shortcuts/#loc_weather</a></div>","specialLinks":[]},{"userId":185282957,"authorName":"cookskidsbooks","from":"&quot;cookskidsbooks&quot; &lt;gailkcook@...&gt;","profile":"cookskidsbooks","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Now sensitive feet, was re:  refusal","postDate":"1173241435","msgId":21946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzbGVvcis4ZjEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVza3B2YytlbGFsQGVHcm91cHMuY29tPg=="},"prevInTopic":21935,"nextInTopic":21950,"prevInTime":21945,"nextInTime":21947,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"Boy, Rachel, do I remember those days.  My eldest ds, now nearly 11, was that way from about 3 yrs to 9 yrs.  He hated lotion (it made him itchy), so we","messageBody":"<div id=\"ygrps-yiv-1225121659\">Boy, Rachel, do I remember those days.  My eldest ds, now nearly 11,<br/>\nwas that way from about 3 yrs to 9 yrs.  He hated lotion (it made him<br/>\nitchy), so we switched to Gold Bond powder and after awhile, he<br/>\nstopped needing it.  I can&#39;t remember what socks we bought at that<br/>\nage, but the seams were good.  He used to say &quot;I&#39;m having a sock<br/>\nproblem&quot;.   Also had a problem with collars... <br/>\n<br/>\nAnd I thought those years were tough...LOL<br/>\n<br/>\n<br/>\nMy 7 yo ds ... He also has extraordinarily sensitive feet.  We have<br/>\nlots of issues about shoes fitting right and sock seams.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I hear your frustration. Good luck<br/>\n&gt; Rachel </span></blockquote></div>","specialLinks":[]},{"userId":224484022,"authorName":"Rachel Salavon","from":"&quot;Rachel Salavon&quot; &lt;rachelsalavon@...&gt;","profile":"mom2twon2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: refusal","postDate":"1173220140","msgId":21935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVza3B2YytlbGFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcxOTgyMC42OTY5NS5xbUB3ZWI2MDMyMC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":21927,"nextInTopic":21946,"prevInTime":21934,"nextInTime":21936,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"My 7 yo ds doesn t like to go anywhere either.  He goes grudgingly when he doesn t have a choice.  I ve listened to a lot of yelling from him about it.  But he","messageBody":"<div id=\"ygrps-yiv-2038598786\">My 7 yo ds doesn&#39;t like to go anywhere either.  He goes grudgingly <br/>\nwhen he doesn&#39;t have a choice.  I&#39;ve listened to a lot of yelling <br/>\nfrom him about it.  But he has never locked himself in a room and <br/>\nrefused to go.  That&#39;s a hard one.  I don&#39;t really have much to say <br/>\nexcept that my son is very much like that.  He also has <br/>\nextraordinarily sensitive feet.  We have lots of issues about shoes <br/>\nfitting right and sock seams.<br/>\n<br/>\nI hear your frustration. Good luck<br/>\nRachel<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Katharine Wise <br/>\n&lt;katharinewise@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m vacillating between fuming mad and bursting into tears and <br/>\n </span></blockquote>trying to be calm.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; We had plans to go to a friends&#39; house for a playdate.  They have <br/>\n </span></blockquote>children all my kids&#39; ages, but our two oldest are particularly good <br/>\nfriends and we don&#39;t get to get together terribly often (1-2 times <br/>\nper month).  My middle ds (7yo) has just announced that he&#39;s not <br/>\ngoing and locked himself in my bedroom.  Won&#39;t let me in to talk.  <br/>\n(I can&#39;t unlock the door from the outside.)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In many ways he&#39;s doing much better than he was a couple months <br/>\n </span></blockquote>ago, but this is a new one.  My eldest is understandably upset and <br/>\nfeeling manipulated and mistreated.  We don&#39;t have neighbors to play <br/>\nwith, so we&#39;re dependent on playdates and other activities to see <br/>\nfriends at all.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;ve been working so hard trying to help him feel that we&#39;re on <br/>\n </span></blockquote>his side, trying to find ways to do the things he wants, but he <br/>\ndoesn&#39;t seem to believe it.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Katharine<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n </span></blockquote>_____________________________________________________________________<br/>\n_______________<br/>\n<blockquote><span title=\"ireply\"> &gt; Finding fabulous fares is fun.  <br/>\n&gt; Let Yahoo! FareChase search your favorite travel sites to find <br/>\n </span></blockquote>flight and hotel bargains.<br/>\n<blockquote><span title=\"qreply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://farechase.yahoo.com/promo-generic-14795097\">http://farechase.yahoo.com/promo-generic-14795097</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa Heyman","from":"&quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] refusal","postDate":"1173216387","msgId":21927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1GMzQ5MTU1N0Y3MTdEQUIwRTZDNDFCNkQxN0IwQHBoeC5nYmw+"},"prevInTopic":21925,"nextInTopic":21935,"prevInTime":21926,"nextInTime":21928,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"... ======== {{{breathe.  deep long breaths}}} It can be very frustrating to feel powerless - you have no control other people (including your kids). Can you","messageBody":"<div id=\"ygrps-yiv-1919589432\"><blockquote><span title=\"ireply\">&gt;I&#39;m vacillating between fuming mad and bursting into tears and trying to be <br/>\n&gt;calm.<br/>\n </span></blockquote>========<br/>\n{{{breathe.  deep long breaths}}}<br/>\n<br/>\nIt can be very frustrating to feel powerless - you have no control other <br/>\npeople (including your kids). Can you feel the relief of this truth?<br/>\n<br/>\nMy 8yo will say to me when i am frustrated - mommy take a deep breath and <br/>\ngive me 3 kisses.  This brings me right back to what&#39;s important.<br/>\n<br/>\n=========<br/>\n&lt;&lt;We had plans to go to a friends&#39; house for a playdate. They have children <br/>\nall my kids&#39; ages, but our two oldest are particularly good friends and we <br/>\ndon&#39;t get to get together terribly often (1-2 times per month). My middle ds <br/>\n(7yo) has just announced that he&#39;s not going and locked himself in my <br/>\nbedroom. Won&#39;t let me in to talk. (I can&#39;t unlock the door from the <br/>\noutside.)&gt;&gt;<br/>\n============<br/>\n<br/>\nWhen my younger dd shuts herself into a room i sit outside the door until <br/>\nshe comes our or is willing to let me in.  While she initially runs away, <br/>\ni&#39;ve learned from her that she wants to know that i am still very much <br/>\npresent and available in her upset.  All it takes is time.   (is there any <br/>\nharm in arriving later at your friends house for this play date?)<br/>\n<br/>\nFor future planning - Was this date planned with everyone in agreement to <br/>\nstart with?  Had he been consulted on the plans in advance?  Was he involved <br/>\nin something more important to him when it was time to leave?  Do you have <br/>\nany idea why he is resistant to going?<br/>\n<br/>\n============<br/>\n<br/>\n&lt;&lt;In many ways he&#39;s doing much better than he was a couple months ago, but <br/>\nthis is a new one. &gt;&gt;<br/>\n<br/>\n============<br/>\nare you referring to your 7yo or eldest?<br/>\n============<br/>\n<br/>\n&lt;&lt;My eldest is understandably upset and feeling manipulated and mistreated. <br/>\nWe don&#39;t have neighbors to play with, so we&#39;re dependent on playdates and <br/>\nother activities to see friends at all. &gt;&gt;<br/>\n=============<br/>\n<br/>\nFor future planning:   Can you make a date that doesn&#39;t include the younger <br/>\nsib?  Can the child of the other family come to your house?<br/>\n<br/>\n=============<br/>\n&lt;&lt;I&#39;ve been working so hard trying to help him feel that we&#39;re on his side, <br/>\ntrying to find ways to do the things he wants, but he doesn&#39;t seem to <br/>\nbelieve it.&gt;&gt;<br/>\n<br/>\n=============<br/>\n<br/>\nAgain, don&#39;t know exactly which ds you are referring to - regardless, when <br/>\nmy kids are frustrated because they want to go in different directions - the <br/>\nlanguage i use in this situation is &quot;you are both very important - both of <br/>\nyou - i know we can come up with a solution that will work for everyone.&quot;  <br/>\nMaintaining my equilibrium is really important to their trusting the <br/>\noutcome.  And then we brainstorm together.  The day may turn out completely <br/>\ndifferent than originally planned but if you are relaxed, open and flexible <br/>\nit may help your children to move through their feelings of anger and <br/>\nfrustration.  Again, it means taking the time to sort out what everyone <br/>\nneeds - next time you can plan in advance the day differently.<br/>\n<br/>\nLisa Heyman<br/>\n<br/>\n_________________________________________________________________<br/>\nFind a local pizza place, movie theater, and more�.then map the best route! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://maps.live.com/?icid=hmtag1&FORM=MGAC01\">http://maps.live.com/?icid=hmtag1&FORM=MGAC01</a></div>","specialLinks":[]},{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"refusal","postDate":"1173209314","msgId":21925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxOTgyMC42OTY5NS5xbUB3ZWI2MDMyMC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":21927,"prevInTime":21924,"nextInTime":21926,"topicId":21925,"numMessagesInTopic":0,"msgSnippet":"I m vacillating between fuming mad and bursting into tears and trying to be calm. We had plans to go to a friends house for a playdate.  They have children","messageBody":"<div id=\"ygrps-yiv-890593252\">I&#39;m vacillating between fuming mad and bursting into tears and trying to be calm.<br/>\n<br/>\nWe had plans to go to a friends&#39; house for a playdate.  They have children all my kids&#39; ages, but our two oldest are particularly good friends and we don&#39;t get to get together terribly often (1-2 times per month).  My middle ds (7yo) has just announced that he&#39;s not going and locked himself in my bedroom.  Won&#39;t let me in to talk.  (I can&#39;t unlock the door from the outside.)<br/>\n<br/>\nIn many ways he&#39;s doing much better than he was a couple months ago, but this is a new one.  My eldest is understandably upset and feeling manipulated and mistreated.  We don&#39;t have neighbors to play with, so we&#39;re dependent on playdates and other activities to see friends at all.  <br/>\n<br/>\nI&#39;ve been working so hard trying to help him feel that we&#39;re on his side, trying to find ways to do the things he wants, but he doesn&#39;t seem to believe it.<br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nFinding fabulous fares is fun.  <br/>\nLet Yahoo! FareChase search your favorite travel sites to find flight and hotel bargains.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://farechase.yahoo.com/promo-generic-14795097\">http://farechase.yahoo.com/promo-generic-14795097</a></div>","specialLinks":[]}],"prevTopicId":21957,"nextTopicId":21784}}