{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Controlling things","postDate":"1185817278","msgId":25298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4bDdydSs5a2ExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4azg2NSsyNWRzQGVHcm91cHMuY29tPg=="},"prevInTopic":25295,"nextInTopic":0,"prevInTime":25297,"nextInTime":25299,"topicId":25242,"numMessagesInTopic":0,"msgSnippet":"***Come on. Why do you assume I am ignorant? I am a life long homeschooler, mostly an unschoooler. I have been immersed in the un/homeschooling world since","messageBody":"<div id=\"ygrps-yiv-1091545585\">***Come on. Why do you assume I am ignorant? I am a life long <br/>\nhomeschooler, mostly<br/>\nan unschoooler. I have been immersed in the un/homeschooling world <br/>\nsince before my<br/>\nkids were even school age. ***<br/>\n<br/>\nCookie cutter doesn&#39;t mean what you&#39;re insisting in means.  It&#39;s <br/>\nbeen used on unschooling lists for years to refer to the kind of <br/>\neducation public schooled kids get, the kind of treatment kids <br/>\nreceive in school where the individual needs of children are <br/>\nignored.   <br/>\n<br/>\nCookie cutter means the same process over and over again with no <br/>\nvariance and no thought to the individual with the hope of achieving <br/>\nthe same result, a cookie cutter copy, every time. <br/>\n<br/>\nYou misused the word.   No one assumed you were ignorant, we read <br/>\nwhat you wrote. <br/>\n<br/>\nUnschooling is a philosophy of treating children respectfully.  <br/>\nPersonalities will be different in every home, resources will be <br/>\ndifferent, but the belief that children are born fully equipped to <br/>\nlive in the human world is the same.  How individual home lives look <br/>\nwill vary.  That&#39;s not &quot;cookie cutter.&quot;   <br/>\n<br/>\n&quot;Cookie cutter&quot; was a pretty insulting thing to sling out there, <br/>\nthough you probably didn&#39;t know it was offensive.  This list is <br/>\neyeball deep in folks who&#39;ve thought about and rejected the cookie <br/>\ncutter education and life for their children - really thoughtful, <br/>\nmindful people who&#39;ll be happy to move on now and answer your <br/>\nunschooling questions. <br/>\n<br/>\nMaybe you meant an ideal unschooling life.  That&#39;s within the reach <br/>\non anyone seeking it, and shouldn&#39;t be scoffed at.  There are many <br/>\npeople living that ideal life, or near ideal, and many striving for <br/>\nit, who know the benefits to kids of a thoughtful life. <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Controlling things","postDate":"1185811936","msgId":25295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMDlGNTYzLUVEQzAtNEVENS04QzlCLUREQjk4RTQxNEIxNEBkaWVyYXVlci5uZXQ+","referencesHeader":"PEQ5NDYwNjQ5LTcwNzItNDY4Qy05QUY0LTlBNzZFNzM1OTUzMkBkaWVyYXVlci5uZXQ+"},"prevInTopic":25282,"nextInTopic":25298,"prevInTime":25294,"nextInTime":25296,"topicId":25242,"numMessagesInTopic":0,"msgSnippet":"... This hit my in-box, and I realized this reads like, I m a resource for my kids because I know where to get porn. Not exactly what I meant to say! What I","messageBody":"<div id=\"ygrps-yiv-535302602\">Begin forwarded message:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; . So I have some experience I could draw on for that conversation.  <br/>\n&gt; And I know some things like where to get porn that is produced  <br/>\n&gt; consensually by sex-positive people who want to be involved in it,  <br/>\n&gt; so I have that to draw on as well. I&#39;m a resource for my kids on  <br/>\n&gt; this subject, as on so many others.<br/>\n<br/>\n </span></blockquote>This hit my in-box, and I realized this reads like, &quot;I&#39;m a resource  <br/>\nfor my kids because I know where to get porn.&quot; Not exactly what I  <br/>\nmeant to say! What I meant was, I&#39;m a resource because I know things,  <br/>\nI have experience to draw on, I can talk about what is good about  <br/>\nporn and what is not-so-good, both about how it&#39;s produced and how  <br/>\nit&#39;s consumed. My own curiosity has led me in that direction in the  <br/>\npast, so I can affirm that the curiosity itself is not a bad thing. I  <br/>\nhope they would accept my guidance. I am working on my relationships  <br/>\nwith my kids right now (they&#39;re only 6 and 3) in the hope that I can  <br/>\nremain someone they will trust, both to be in conversation with, and  <br/>\nmaybe to believe me if I say (as I do sometimes now about certain  <br/>\nmovies, for instance), &quot;I&#39;m not sure you&#39;d be comfortable watching  <br/>\nthat.&quot;<br/>\n<br/>\nSu, who isn&#39;t contributing to the delinquency of minors quite so much  <br/>\nas it might have seemed at first glance.</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Controlling things","postDate":"1185807054","msgId":25282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4a3RzZStpZ2pqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzQTEwQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":25278,"nextInTopic":25295,"prevInTime":25281,"nextInTime":25283,"topicId":25242,"numMessagesInTopic":0,"msgSnippet":"~~Why are there books written? If there s not one way of doing it, what are you all always talking about? Isn t this list to help people learn a certain way of","messageBody":"<div id=\"ygrps-yiv-437085101\">~~Why are there books written? If there&#39;s not one way of doing it,<br/>\nwhat are you all always talking about? Isn&#39;t this list to help people<br/>\nlearn a certain way of living with their children?~~<br/>\n<br/>\nYes, an idea, a philosophy, a lifestyle...which looks completely<br/>\ndifferent from family to family and person to person. So calling it<br/>\n&quot;cookie-cutter&quot; is really incorrect.<br/>\n<br/>\nWhen you take the idea of being kind for example, that will look<br/>\nextremely different in different situations. Sometimes being kind is<br/>\nstopping someone from hurting themselves. What is kindness to one<br/>\nperson, would be rude to another. So keeping the principles of respect<br/>\nat the forefront, we respond to each and every situation differently.<br/>\n<br/>\nIt seems that with your son, every suggestion made has brought you<br/>\nback to the idea of restricting him. We are trying to say there are<br/>\nways to creatively solve these issues, without stopping the play.<br/>\n<br/>\nI&#39;m going out on a limb here, but I&#39;m going to make a few guesses. It<br/>\nsounds to me like there are too many children over for this kind of<br/>\nplay at once. It sounds like the other parents are turning their<br/>\nchildren loose and nobody is supervising the gun play. I think that&#39;s<br/>\na bad idea considering all the problems that keep surfacing with<br/>\npeople getting hurt. For one parent to be responsible for that many<br/>\nchildren is probably stressful. I&#39;m certainly ok with saying &quot;sorry,<br/>\nwe already have company today&quot; if too many kids come over.<br/>\n<br/>\nAre they wearing safety goggles? Is there ANY kind of &quot;code of<br/>\nconduct&quot; agreed upon by the children and adults involved to keep<br/>\neveryone safe? If somebody was trying to harm any child near me and<br/>\nignored the obvious &quot;stop now&quot;, then all game play ends right there<br/>\nuntil we can come to an agreement that works for everyone.<br/>\n<br/>\nHurting people repeatedly when they are saying &quot;no thanks&quot; is not ok.<br/>\nWhat are you doing to keep your younger child safe? He shouldn&#39;t have<br/>\nto feel threatened in his own home. ARe you present during their play<br/>\nso you can head things off at the pass so to speak? <br/>\n<br/>\nI know that some children are especially challenging. I have a child<br/>\nthat is 6y.o. that challenges me to be a better person every day. I<br/>\nalso know that if that intense child doesn&#39;t feel they shine in your<br/>\neyes, it amps up the behavior and insecurity. They already feel<br/>\n&quot;different&quot; than other people. They need to know they are celebrated<br/>\nand adored for exactly who they are.<br/>\n<br/>\nInstead of focusing on changing his behavior, think about ways to meet<br/>\nhim where he IS. He lacks certain tools. Rather than restricting him,<br/>\nthink about ways to help him get what he needs. I would have NO<br/>\nhesitation approaching the other kids and asking them to come up with<br/>\na code of conduct with me, for play time. If they can&#39;t respect the<br/>\ncodes they help create, for safety, then they aren&#39;t welcome to play<br/>\nat this moment in time. Giving everyone a safe space to play is important.<br/>\n<br/>\nCreate big, fun game days in your yard. Talk about the safety issues<br/>\nahead of time. We would point out the people NOT involved in a game<br/>\nand say &quot;please remember that Ciara and Jared have NOT agreed to be a<br/>\npart of this game, it is not ok to shoot at them&quot;.<br/>\n<br/>\nI just don&#39;t have problems with kids ignoring that. If I see a<br/>\npotential problem arising, I can remind the child that doesn&#39;t want to<br/>\nbe shot, they may want to go inside. Or I might remind the shooters<br/>\nthat &quot;so-and-so does NOT want to be shot..no thank you&quot;.<br/>\n<br/>\nI&#39;m pretty blunt with neighbor kids. They aren&#39;t being raised like my<br/>\nchildren and I can&#39;t treat them the same way at times. We had two<br/>\nneighbor kids at our house ALL the time in Pensacola. I would hide<br/>\ncertain foods when they came over because food was limited and<br/>\ncontrolled at their house so it would disappear and my kids would be<br/>\nupset. It wasn&#39;t in the budget to feed unlimited amounts to neighbor kids.<br/>\n<br/>\nI&#39;m pretty clear about boundaries when neighbor kids come over. I<br/>\nmight say &quot;I really don&#39;t like ____________, we don&#39;t do that in our<br/>\nhouse&quot; and then give them an option that might work better. <br/>\n<br/>\nIt&#39;s pretty hard to have the same principles in effect at all times,<br/>\nwhen those other children aren&#39;t used to operating that way. What<br/>\nwe&#39;ve found, is that over time they figure out how we do things and<br/>\nadapt quite well.<br/>\n<br/>\nWith safety issues, is it really that hard to help the kids come up<br/>\nwith some boundaries for everyone&#39;s benefit?  Try to help them all get<br/>\nwhat they need....nobody WANTS to get hurt.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Controlling things","postDate":"1185804783","msgId":25278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzQTEwQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":25265,"nextInTopic":25282,"prevInTime":25277,"nextInTime":25279,"topicId":25242,"numMessagesInTopic":0,"msgSnippet":"What we re doing here, Maura, is not looking for right answers but bouncing back to each other ideas of this is my situation and I m trying to get from A to","messageBody":"<div id=\"ygrps-yiv-323983057\">What we&#39;re doing here, Maura, is not looking for &quot;right&quot; answers but<br/>\nbouncing back to each other ideas of &quot;this is my situation and I&#39;m<br/>\ntrying to get from A to C but I&#39;m stuck on B - got any ideas for getting<br/>\nunstuck?&quot; We&#39;re here for folks who come around saying &quot;school was<br/>\nkilling my child, so I took him/her out and we homeschooled but that was<br/>\na battle and it was getting us nowhere. I was browsing through Yahoo<br/>\ngroups and saw this one. What&#39;s unschooling? I&#39;ve read a bit and it<br/>\nseems like it would be really good for our family. Can you help me<br/>\nunderstand how to navigate the laws of my state and unschool at the same<br/>\ntime?&quot; It&#39;s also for &quot;We just pulled the kids out last fall and love our<br/>\nnewly free lives BUT the ILs are giving us a lot of grief over our<br/>\ndecision. How have y&#39;all handled that?&quot; And sometimes it&#39;s &quot;Hey folks -<br/>\nI&#39;m just so tired of people questioning why I&#39;m &quot;still&quot; nursing my 3 yr<br/>\nold. Can I vent a bit?&quot; <br/>\n <br/>\nYes, the *principles* look a lot alike but how it looks in practice is<br/>\ndifferent from family to family, person to person. It&#39;s about seeing<br/>\neveryone, whether 2 or 92 as equally valid PEOPLE with equally valid<br/>\nwants, needs, viewpoints. One phrase that gets used often is &quot;would you<br/>\ndo/say/react the same way to this event if it was your<br/>\nspouse/partner/neighbor? how would you react if your<br/>\nspouse/partner/neighbor acted this way toward you?&quot;, perhaps reframing<br/>\nthings to jog out of that pre-set mindset. For instance, I just<br/>\nmentioned to DH the other day that we (generic society we) work hard to<br/>\nimpart &quot;do to others as you would have them do to you&quot; so if our kid<br/>\nhits another, we turn around and give him/her a smack on the butt or<br/>\nsend him/her into &quot;solitary&quot; aka time out. Bit of a mixed message<br/>\ninvolved. So, part of what this board talks about is how to move away<br/>\nfrom that societally conditioned reward/punishment paradigm in child<br/>\nrearing to a paradigm that seeks to address the root cause of the<br/>\nbehavior rather than address the symptom (which also ties in with<br/>\nparallel threads often seen of folks looking for alternatives to<br/>\nmainstream westernized medical practices which tend to medicate the<br/>\nsymptoms away without necessarily looking at what is causing the<br/>\nsymptoms). Then, when we have at least an idea of the roots of the<br/>\nsituation, we can work *as a team* with the child and other members of<br/>\nthe family to find ways to address needs - sometimes it means that we<br/>\nhave to be pretty creative in finding workable compromises.<br/>\n <br/>\nI&#39;ve got a 9 yr old DS and often get &quot;gee wish I had some of his energy!<br/>\ndoes he ever slow down?&quot; type comments. Finding ways to meet his need to<br/>\nbe active while also dealing with things such as DH&#39;s permanent hip<br/>\ndamage (sometimes even sitting is painful) and my work schedule and<br/>\nhealth situations as well (type 2 diabetes plus hypothyroid often leave<br/>\nme really tired in the evenings) requires lots of flexibility (mentally<br/>\nif not physically) and lots of *discussion* - not talking &quot;to&quot; DS but<br/>\n&quot;with&quot; DS. There have been times when I&#39;ve posted with situations and<br/>\ngotten feedback on &quot;have you tried this? is this possible? what<br/>\nabout...?&quot; and it&#39;s all good - some might not apply or be doable where<br/>\nwe are but some is and some triggers a whole new line of thinking -<br/>\n&quot;gee, that&#39;s not available but we do have this which is similar - we<br/>\ncould check that out and see if it might be doable&quot; And sometimes I&#39;ve<br/>\nnot even posted, just read a bit and thought &quot;hey that&#39;s a cool idea! -<br/>\nI&#39;ll see if we want to try doing that&quot;. We rarely say &quot;No&quot; flat out -<br/>\nmore often it&#39;s &quot;I&#39;m really tired right now so I&#39;d rather do something<br/>\nbesides run around the yard with light sabers. How about we plan for<br/>\nthat tomorrow after dinner and watch a Star Wars movie right now?&quot;<br/>\nSometimes that&#39;s okay; sometimes it&#39;s not okay - he needs to move when<br/>\nhe needs to move. So, we might determine that a trip to the playground<br/>\nis in order so he can run and I can sit. Or it might be something else.<br/>\nThere&#39;s no one &quot;if x then y&quot; thing - it&#39;s not rules, it&#39;s principles.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99672907,"authorName":"mauratracy","from":"&quot;mauratracy&quot; &lt;Maura@...&gt;","profile":"mauratracy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Controlling things","postDate":"1185784837","msgId":25265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4azg2NSsyNWRzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2QUNEMjA0LjAwMDAwMS4wMzc2NEBZT1VSLVBBODZaMUkzRzc+"},"prevInTopic":25242,"nextInTopic":25278,"prevInTime":25264,"nextInTime":25266,"topicId":25242,"numMessagesInTopic":0,"msgSnippet":"... You know.....a cookie cutter life is this life you re all describing, the one where we try to meet everyone s needs all the time, where everyone is treated","messageBody":"<div id=\"ygrps-yiv-679988963\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lesa&quot; &lt;lesajm@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  &gt;&gt;&gt;cookie cutter unschooling life&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt; Enlighten me!  What the heck is a cookie cutter unschooling life?  Because I<br/>\n&gt; ve never seen one!  I have unschooling friends all over the place, those I<br/>\n&gt; ve met and are good friends with and those I&#39;ve never met and keep in<br/>\n&gt; contact through yahoo groups, emails, and myspace.  And not one of us lives<br/>\n&gt; our unschooling lives the same way.  <br/>\n<br/>\n </span></blockquote>You know.....a cookie cutter life is this life you&#39;re all describing, the one where we try to <br/>\nmeet everyone&#39;s needs all the time, where everyone is treated as equals, where we are <br/>\npatient and responsive just about all the time, where we don&#39;t restrict our kids from <br/>\nthings, blah, blah, blah, the one about which books are written.  If there&#39;s no such thing as <br/>\na cookie cutter unschooling life, then why does this list exist?  Why are there books <br/>\nwritten?  If there&#39;s not one way of doing it, what are you all always talking about?  Isn&#39;t this <br/>\nlist to help people learn a certain way of living with their children?  I don&#39;t think I am so off <br/>\nto use the term &quot;cookie cutter life.&quot;  <br/>\n<br/>\nCome on.  Why do you assume I am ignorant? I am a life long homeschooler, mostly an <br/>\nunschoooler.  I have been immersed in the un/homeschooling world since before my kids <br/>\nwere even school age.  I *know* that every family is different.  I know every family is going <br/>\nto *look* different based on very many variables.  Give me a break!  That&#39;s not what I was <br/>\ntalking about, and why didn&#39;t *you* know that?  Why did you assume otherwise?<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; So was that just some rote way of saying that you aren&#39;t willing to step out<br/>\n&gt; of the box that you&#39;ve put your life and family in<br/>\n<br/>\n </span></blockquote>Excuse me?  I post on this list, I think, just this one day, and you think you know me well <br/>\nenough to make this comment?  P-lease.  Just what box do you think I put my family in?  <br/>\nYou don&#39;t know us.  What are you assuming?  Seriously, that I want to know.  That&#39;s a <br/>\nridiculous statement.  Did I ever say I was unwilling to step out of a box?  How did I imply <br/>\nthis?  Why would I be here asking questions?!  I, in fact, specifically said I wanted to <br/>\nunderstand.  Did you assume that I was only here to argue?  You are wrong, and that&#39;s a <br/>\nbig mistake.  <br/>\n<br/>\n... and instead throwing<br/>\n<blockquote><span title=\"ireply\"> &gt; out that lame comment<br/>\n<br/>\n </span></blockquote>Nice.  Way to be helpful.  (And yes, that was sarcasm.)  Because *you* misunderstood my <br/>\nmeaning you call my words lame.  Is this, calling people&#39;s words lame, that respect thing <br/>\nwe model for our kids?  We are to treat our kids with respect (of course) and model respect <br/>\nfor them....why do you think it&#39;s OK to treat me, a stranger, practically a guest in this <br/>\nforum, someone coming here for help, with such disrespect ?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;like we would all fall for it?  <br/>\n<br/>\n </span></blockquote>Fall for it?  Seriously, where are you coming from?   Fall for it?  Fall for what?  I totally don&#39;t <br/>\nget you, and I have no idea what you&#39;re talking about.  <br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; You&#39;re lucky that<br/>\n&gt; Sandra Dodd isn&#39;t active on this list because she&#39;d rip that comment up one<br/>\n&gt; side and down the other.<br/>\n<br/>\n </span></blockquote>Well, yes, if she&#39;s anything like you, then, yes, I will consider myself lucky.  I can&#39;t see how <br/>\nit would be helpful to have any of my comments &quot;rip(ped)....up one side and down the <br/>\nother.&quot;  In fact, if I got more replies like yours, or any like you suspect hers might have <br/>\nbeen, I surely would not be here, able to dialogue with the people who were so generous <br/>\nto take the time to kindly reply to me.<br/>\n <br/>\nWhy are you here, Lesa?  Are you here to learn the basics of homeschooling, or are you <br/>\nhere to help others learn what you already know?  If you want to be here to help people, <br/>\nwhy would you come off like gangbusters thinking someone posting is a troll, just looking <br/>\nfor trouble?  Why would you assume the worst?  If you can&#39;t be kind and respectful and <br/>\noffer help, then I think you should keep your comments to yourself.<br/>\n<br/>\nNot that you&#39;d care, but because of your comment, I was sooooooooo close to just <br/>\nunsubbing and finding help for my journey elsewhere.  How can I expect to get help from <br/>\nsomeone so unkind?  I would not want to learn from or model my life after someone who <br/>\nbehaved the way you did.<br/>\n<br/>\nAnd finally, people of the list, is this typical, that someone would post in this brash way, <br/>\nand no one comments?  Don&#39;t ya&#39;all call each other out?  Or maybe you do so off-list.  Or <br/>\nam I alone in thinking Lesa&#39;s post rude?  Some people will be disuaded from posting here, <br/>\nunable to benefit from you all&#39;s help if they get replies like this.  If you all want to be <br/>\nhelpful, wouldn&#39;t you want to rein in people who post with insufficient sensitivity?<br/>\n<br/>\nMaura</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa","from":"&quot;Lesa&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Controlling things","postDate":"1185731076","msgId":25242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExOS1EQVY0OEY4QUU5QjMyNzJBODNCNURBNTREM0VEMEBwaHguZ2JsPg==","referencesHeader":"PGY4aWY2aSthOGx1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25265,"prevInTime":25241,"nextInTime":25243,"topicId":25242,"numMessagesInTopic":0,"msgSnippet":"... Enlighten me!  What the heck is a cookie cutter unschooling life?  Because I\nve never seen one!  I have unschooling friends all over the place, those I\nve","messageBody":"<div id=\"ygrps-yiv-1861856332\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;cookie cutter unschooling life&lt;&lt;&lt;\r<br/>\n \r<br/>\n </span></blockquote>Enlighten me!  What the heck is a cookie cutter unschooling life?  Because I<br/>\nve never seen one!  I have unschooling friends all over the place, those I<br/>\nve met and are good friends with and those I&#39;ve never met and keep in<br/>\ncontact through yahoo groups, emails, and myspace.  And not one of us lives<br/>\nour unschooling lives the same way.  \r<br/>\n\r<br/>\nSo was that just some rote way of saying that you aren&#39;t willing to step out<br/>\nof the box that you&#39;ve put your life and family in... and instead throwing<br/>\nout that lame comment like we would all fall for it?  You&#39;re lucky that<br/>\nSandra Dodd isn&#39;t active on this list because she&#39;d rip that comment up one<br/>\nside and down the other.\r<br/>\n\r<br/>\nLesa M.\r<br/>\nCrunchy Unschooling mom to dd10\r<br/>\nCurrently Reading:  &quot;Traveling Mercies&quot; by Anne Lamott \r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://livinginfreedomeveryday.blogspot.com/\">http://livinginfreedomeveryday.blogspot.com/</a>\r<br/>\n. \r<br/>\n \r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25297,"nextTopicId":25299}}