{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":267621540,"authorName":"Brenna Shugarts","from":"Brenna Shugarts &lt;bshugarts@...&gt;","profile":"bshugarts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Please help re. bullying (Part 1)","postDate":"1238590551","msgId":39231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MDA3Ni44MTI2OS5xbUB3ZWIzMzUwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39224,"nextInTopic":0,"prevInTime":39230,"nextInTime":39232,"topicId":39184,"numMessagesInTopic":0,"msgSnippet":"What is more important though? your child or a few months of tuition? I would go to principal explain why you are taking him out of school & you want out of","messageBody":"<div id=\"ygrps-yiv-1020932551\">What is more important though? your child or a few months of tuition? I would go to principal explain why you are taking him out of school & you want out of the contract or u will call you lawyer & let them handle this. If they are not protecting your child body /spirit then why should they be paid?? bullying changes who you are forever. you can&#39;t fix it or take it back. in the end it is only 3 months of school left if the laywer threat does not work/call one or just pay them. In that time peroid your child could be damaged forever. <br/>\ni was never bullied as a child but know many people who were, as adults it still hurts them.Good luck w/ your decision. brenna<br/>\n<br/>\n<br/>\nreputation is what men & women think of us. character is what God & the angels know of us.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 4/1/09, Vickisue Gray &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vickisue_gray@...\">vickisue_gray@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Vickisue Gray &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vickisue_gray@...\">vickisue_gray@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Please help re. bullying (Part 1)<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, April 1, 2009, 8:42 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;Unfortunately, I could not pull him out of the school, because the school requires that we sign a contract that says we have to stay for the whole schoolyear. If for some reason, we cannot, then we have to continue paying the monthly tuition till schoolyear&#39;s end. &quot;<br/>\n<br/>\nUm.....Why would you ever sign a contract like this???  <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Please help re. bullying (Part 1)","postDate":"1238590361","msgId":39224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwNDAxMDU1MnUxOTUxOGRkdDZiNjZhODQ0MTRmYTE0ZUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDc0NzAyNy42NjQ2MS5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDc0NzAyNy42NjQ2MS5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39223,"nextInTopic":39231,"prevInTime":39223,"nextInTime":39225,"topicId":39184,"numMessagesInTopic":0,"msgSnippet":"For people with more contractual integrity than I, would you still pay a Catholic school if the priest was molesting your child? I don t quite understand why","messageBody":"<div id=\"ygrps-yiv-510124259\">For people with more contractual integrity than I, would you still pay a<br/>\nCatholic school if the priest was molesting your child?<br/>\nI don&#39;t quite understand why some forms of torture are okay (fostering<br/>\nbullies in the original case) and others are not!<br/>\nIn the example of family, I&#39;d change the same thing - if the sister smacked<br/>\nyou instead of yelling at you, would the rest of the family still insist you<br/>\nsee her? Would that be any different?<br/>\n<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Apr 1, 2009 at 5:42 AM, Vickisue Gray &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vickisue_gray@...\">vickisue_gray@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   &quot;Unfortunately, I could not pull him out of the school, because the<br/>\n&gt; school requires that we sign a contract that says we have to stay for the<br/>\n&gt; whole schoolyear. If for some reason, we cannot, then we have to continue<br/>\n&gt; paying the monthly tuition till schoolyear&#39;s end. &quot;<br/>\n&gt;<br/>\n&gt; Um.....Why would you ever sign a contract like this???<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Please help re. bullying (Part 1)","postDate":"1238590227","msgId":39223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdm51aituY2h0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc0NzAyNy42NjQ2MS5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39222,"nextInTopic":39224,"prevInTime":39222,"nextInTime":39224,"topicId":39184,"numMessagesInTopic":0,"msgSnippet":"So you have to pay if he is in school OR out of school. There is still a big difference here.  If you must fulfill your contract you can do so without causing","messageBody":"<div id=\"ygrps-yiv-197399493\">So you have to pay if he is in school OR out of school.<br/>\n<br/>\nThere is still a big difference here.  If you must fulfill your contract you can do so without causing anymore emotional damage to your son, by bringing him home where he is safe.  A few months of limited money seems worth it to me.  <br/>\n<br/>\nI doubt the school can require that the child stay.  Only the money.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; &quot;Unfortunately, I could not pull him out of the school, because the school requires that we sign a contract that says we have to stay for the whole schoolyear. If for some reason, we cannot, then we have to continue paying the monthly tuition till schoolyear&#39;s end. &quot; </span></blockquote></div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"viickisan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Please help re. bullying (Part 1)","postDate":"1238589758","msgId":39222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NzAyNy42NjQ2MS5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39184,"nextInTopic":39223,"prevInTime":39221,"nextInTime":39223,"topicId":39184,"numMessagesInTopic":0,"msgSnippet":"Unfortunately, I could not pull him out of the school, because the school requires that we sign a contract that says we have to stay for the whole schoolyear.","messageBody":"<div id=\"ygrps-yiv-1867288057\">&quot;Unfortunately, I could not pull him out of the school, because the school requires that we sign a contract that says we have to stay for the whole schoolyear. If for some reason, we cannot, then we have to continue paying the monthly tuition till schoolyear&#39;s end. &quot;<br/>\n<br/>\nUm.....Why would you ever sign a contract like this???  <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":346820406,"authorName":"hunnybunnies5@verizon.net","from":"&lt;hunnybunnies5@...&gt;","profile":"shelleydaez","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Please help re. bullying (Part 1)","postDate":"1238428233","msgId":39184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyMTlGNkE1RkUwRjQyOEFCQjBEODAwNjE5MDcwQkRGQHJvYnlQQz4="},"prevInTopic":0,"nextInTopic":39222,"prevInTime":39183,"nextInTime":39185,"topicId":39184,"numMessagesInTopic":0,"msgSnippet":"Hello all, I m so sorry that this post is very long.  But at this stage, I don t think I can see the forest for the trees anymore.  So I decided to ask for","messageBody":"<div id=\"ygrps-yiv-856146045\">Hello all,<br/>\n<br/>\nI&#39;m so sorry that this post is very long.  But at this stage, I don&#39;t think I can see the forest for the trees anymore.  So I decided to ask for some help from you wise ladies.  If anyone is patient enough to plod through these posts and offer me some advice, I would greatly appreciate it!<br/>\n<br/>\nFirst of all, I&#39;ve been a member of your lists for some time now.  I remember having posted a question once about TV restrictions, and I benefitted a lot from all those who shared their thoughts.  Since then, though, I haven&#39;t had much time to participate.  But I read your posts when I can because I get so much out of them as we go through our unschooling journey.<br/>\n<br/>\nWe have 3 children, ages 8, 12 & 16.  We&#39;ve been homeschooling since &#39;99, having started out with school-at-home, then gradually changing our learning lifestyle by applying the principles of Montessori, Charlotte Mason and finally, John Holt, just a few years ago.  <br/>\n<br/>\nI went through some training in Montessori religious education and was really enamored by the program and the beautiful environment that one particular Montessori school offered their students.  In fact, it was through the school head that I discovered the teachings of John Holt -- because Montessori & Holt have similar educational philosophies -- the main difference being, Montessori believes that the child flourishes best in a community (in other words, in a Montessori school), while John Holt believes that the child flourishes best at home. <br/>\n<br/>\nAs much as I love Montessori, I follow John Holt more, because for us, family and homeschooling come first.  (Plus I could only make so many Montessori materials -- the rest, we couldn&#39;t afford).  <br/>\n<br/>\nLast year, though, I developed some health problems.  So we decided to lighten our homeschooling until I resolved my health issues by enrolling our youngest in this Montessori school, especially since this school was connected to our church and is quite near us.  We had heard so many great things about the school, and the head of school herself was such a persuasive and gifted speaker, who was also in favor of John Holt&#39;s teachings.  So we decided to take advantage of this *gift* and have ds try it for one schoolyear, while I continued to unschool my older kids at home.  (The school is only for kids ages 3-12, so my older kids were too old for the school.)  <br/>\n<br/>\nAfter ds&#39;s 1st few weeks in school, however, I realized that we had made a mistake.  It took a while for him to adjust to being in school, of course, and he began to experience bullying from some of the kids (something we hadn&#39;t heard much about from the other parents).  I was so enamored by the school and by the head of school&#39;s persuasive talks that I have to admit, I was naive in expecting it almost to be a kind of utopia for kids.  <br/>\n<br/>\nThe bullying wasn&#39;t anything major.  It consisted mainly of taunting, pushing, shoving, verbal put-downs and tripping ds up once when he was running (luckily, he wasn&#39;t badly hurt).  But it was happening almost everyday that my son wanted to go back to homeschooling.  <br/>\n<br/>\nUnfortunately, I could not pull him out of the school, because the school requires that we sign a contract that says we have to stay for the whole schoolyear.  If for some reason, we cannot, then we have to continue paying the monthly tuition till schoolyear&#39;s end.  So we taught our son to deal with bullies, and he learned how to defend himself with words.  But the bullying still didn&#39;t stop.  So I finally brought it up to the teachers & the head of school. <br/>\n<br/>\nWe had a meeting about it.  They addressed it right away, and the incidents became fewer. Things got better for my son.  <br/>\n<br/>\nThe problem, though, is my son is very sensitive.  He easily gets hurt over minor things, like when his classmates stick their tongues out at him while they&#39;re playing tag because he&#39;s it, and he hasn&#39;t been able to tag them.  The head of school talked to me about it, and dh & I have done our part to help him not take things too personally, telling him that these are just kids -- they don&#39;t mean to hurt him intentionally -- and reminding him that he himself has seen them do unkind things to other kids, not just to him.  <br/>\n<br/>\nMy problem is, when I see ds hurt & upset, I&#39;m like the Mama Bear who wants to protect her cub.  So I felt I had to bring up certain incidents to the teachers to stop them from happening again.  The teachers have been helpful, and things were pretty calm from December up until last week, when all of a sudden, one of the boys (Matthew), who had bullied him before, began to do so again.<br/>\n<br/>\nThis is how it happened:<br/>\n<br/>\nAt the end of recess, the teachers require the kids to sit on the sidewalk curb before going in.  My son, Miguel was about to sit beside someone, when all of a sudden, Matthew pulled his vest roughly from the back, pushed him aside and plopped himself down right where Miguel was going to sit. <br/>\n<br/>\nMiguel was taken by surprise and upset at what Matthew had done.  They had an exchange of words.  He can&#39;t remember the exact wording, but it went something like this:<br/>\n<br/>\nMiguel exclaimed, &quot;Matthew, that wasn&#39;t nice of you to do that!&quot;  <br/>\n<br/>\nMatthew answered, &quot;I don&#39;t care.&quot;  <br/>\n<br/>\nMiguel said, &quot;Please say sorry.&quot;  <br/>\n<br/>\nMatthew replied, &quot;But that wasn&#39;t bullying. It was just rudeness.  So I don&#39;t need to say sorry.&quot;  <br/>\n<br/>\nMiguel replied, &quot;Still, say Sorry.&quot;  <br/>\n<br/>\nMatthew finally said in a flippant tone, &quot;Sorry!&quot;  <br/>\n<br/>\nThen Miguel asked him, &quot;Is that a sincere Sorry?&quot;  <br/>\n<br/>\nMatthew answered, &quot;Well, I&#39;m really not sure.&quot;<br/>\n<br/>\nAt that point, Miguel went to the teacher and told her what happened.  The teacher came over and tried to address the situation (ds can&#39;t remember exactly how), and Matthew told, &quot;But I said sorry already, and it was a sincere sorry!&quot;  So the teacher left it at that.<br/>\n<br/>\nMiguel did not tell her that, previously, Matthew did not want to admit whether his apology was sincere or not.  And she did not tell Matthew to give up the spot he had rudely taken from Miguel.  So, in effect, Matthew got his way, and Miguel remained frustrated, choosing to stand instead beside the teacher before it was time to go in.  <br/>\n<br/>\n(To be continued)<br/>\n<br/>\nShelley Daez<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39202,"nextTopicId":39218}}