{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":367302968,"authorName":"VickiJ","from":"&quot;VickiJ&quot; &lt;vjohnsonbarrett@...&gt;","profile":"vjohnsonbarrett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: learning to let go","postDate":"1286863164","msgId":44948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5MHRmcytrdTFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4dmg0dittY2ZsQGVHcm91cHMuY29tPg=="},"prevInTopic":44947,"nextInTopic":0,"prevInTime":44947,"nextInTime":44949,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for your responses. ... Do you play WoW yourself or read any of those forums? If not, doing so could help you see what your son is doing as","messageBody":"<div id=\"ygrps-yiv-2061910248\">Thanks so much for your responses. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<br/>\n </span></blockquote>Do you play WoW yourself or read any of those forums? If not, doing so could help you see what your son is doing as something other than &quot;unidimensional&quot;. What aspects of those things does he enjoy? The social parts? The problem solving? The thoughfulness and analysis of the writing?&lt;&lt;<br/>\n<br/>\nNo, I don&#39;t play but I watch him quite a bit, and I do know that A LOT is going on, and you&#39;re right, if he was doing certain other things so much of the time I probably wouldn&#39;t be making the same judgements about it.<br/>\n<br/>\nAnd of course, the whole &quot;moving&quot; thing is huge. We&#39;ve lived in 5 places in 3 years. Two of those were very far away, Saipan (Northern Mariana Islands) and Shanghai, China. Pretty tumultuous times, for sure. I am so busy just getting settled in again that sometimes I forget just how much we&#39;ve been through, and need to relax and give us both a break about meeting people and establishing new relationships and routines. And to let myself really admit that yes, it IS HARD, and it takes awhile to develop friendships, etc. We&#39;ve been back since May, and are still feeling pretty isolated. Looks like finding an unschooling conference is something I could be putting on the &quot;front burner&quot; right now.<br/>\n<br/>\nThanks again, it helps just to bounce these things off peope who know what the heck I&#39;m talking about!<br/>\nVicki</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: learning to let go","postDate":"1286817759","msgId":44947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4dmg0dittY2ZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4dDdjOCtuMGptQGVHcm91cHMuY29tPg=="},"prevInTopic":44946,"nextInTopic":44948,"prevInTime":44946,"nextInTime":44948,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"... ************ Do you play WoW yourself or read any of those forums? If not, doing so could help you see what your son is doing as something other than","messageBody":"<div id=\"ygrps-yiv-228866609\">&quot;VickiJ&quot; &lt;vjohnsonbarrett@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I wonder more often if playing World of Warcraft for 15 hours a day, or reading gaming forums, is making him unidimensional.<br/>\n </span></blockquote>************<br/>\n<br/>\nDo you play WoW yourself or read any of those forums? If not, doing so could help you see what your son is doing as something other than &quot;unidimensional&quot;. What aspects of those things does he enjoy? The social parts? The problem solving? The thoughfulness and analysis of the writing? Those are things to think about. <br/>\n<br/>\nAt the same time, consider if he were rebuilding engines for hours on end, or playing a musical instrument - would you still think of him as &quot;unidimensional&quot;? Sometimes the negative messages in the world about video/computer games can shut down your thinking about how learning works - for some people learning looks like how you describe you son. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Are online lists the only place I am to find people who don&#39;t believe in schooling their children?<br/>\n </span></blockquote>**************<br/>\n<br/>\nMaybe, if travel isn&#39;t an option for you. Online lists are my sanity saver! Unschoolers are few and far between, especially radical unschoolers (as opposed to unschooling some things but not everything) and its easy to feel isolated. Its sometimes easier for me to either socialize with people who don&#39;t have kids at all, or people with kids in school so we can just agree to avoid the &quot;hot topic&quot; of education. <br/>\n<br/>\nFinding conferences of gatherings or campouts in your area can be a biiiig help, both in terms of connecting with other adults and in terms of your son meeting other unschoolers. Is he on any of the WoW guilds? I know there&#39;s at least one each for the Horde and the Alliance but my kids don&#39;t Wow, so that&#39;s the extent of my knowledge. <br/>\n<br/>\nIts hard to feel isolated! Keep in mind that moving is a big stressor, too - you didn&#39;t say how long ago but it can take longer than you expect to &quot;settle in&quot; and figure out what the resources are in a new location. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":151505017,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: learning to let go","postDate":"1286812867","msgId":44946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4dmNjMyt0aGhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4dDdjOCtuMGptQGVHcm91cHMuY29tPg=="},"prevInTopic":44945,"nextInTopic":44947,"prevInTime":44945,"nextInTime":44947,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"Oh, and sorry for the double-post, but it seems like you still have the belief that only between the ages of 6 - 17 do kids learn what they need. If he chooses","messageBody":"<div id=\"ygrps-yiv-1436330391\">Oh, and sorry for the double-post, but it seems like you still have the belief that only between the ages of 6 - 17 do kids learn what they need. If he chooses college, then at that time, he can do what he needs to prepare for it. That doesn&#39;t mean just throw him out there, unprepared - but don&#39;t think you have to help him prepare NOW for a choice that&#39;s years down the road.<br/>\n<br/>\nIt sounds like you&#39;re familiar with deschooling - but you haven&#39;t yet deschooled yourself! Read more on Joyce&#39;s and Sandra&#39;s sites about deschooling, let go of the belief there&#39;s only a limited time to &quot;prepare&quot; for the world. He&#39;s in the world now! Even if his chosen world is World of Warcraft.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":151505017,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: learning to let go","postDate":"1286812066","msgId":44945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4dmJqMituaTJtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4dDdjOCtuMGptQGVHcm91cHMuY29tPg=="},"prevInTopic":44944,"nextInTopic":44946,"prevInTime":44944,"nextInTime":44946,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"~~~This paragraph captured how I m feeling this year. My son is of 8th grade age~~~ I recently answered a newish unschooler s email about something similar -","messageBody":"<div id=\"ygrps-yiv-1823907854\">~~~This paragraph captured how I&#39;m feeling this year. My son is of &quot;8th<br/>\ngrade&quot; age~~~<br/>\n<br/>\n<br/>\nI recently answered a newish unschooler&#39;s email about something similar<br/>\n- hope you don&#39;t mind if I cut & paste my response here:<br/>\n<br/>\nThe most important thing for me, in terms of Evan, my oldest, has been<br/>\nto not<br/>\ncompare him to other kids at all. He&#39;s his own person! And just like<br/>\nwhen he was<br/>\nan infant, the question I ask is, &quot;Is he thriving?&quot; - not whether he<br/>\nfits in<br/>\nwith the growth charts! He&#39;s happy, he is who he is. His interests are<br/>\nmostly<br/>\nonline and in gaming, he&#39;s very active on a couple of online forums and<br/>\nwe&#39;ve<br/>\nmade a couple trips for him to meet his online friends. He doesn&#39;t know<br/>\nwhat<br/>\ncareer he wants to pursue, and that&#39;s fine - I trust that he&#39;ll know<br/>\nwhen he<br/>\nknows. He may want to work a few jobs here & there to earn money, rather<br/>\nthan make a &quot;career choice&quot; and that would be fine, too.<br/>\n<br/>\nI just replied to a post on an unschooling forum, the gist of it was the<br/>\nthe<br/>\nwriter was concerned because she saw all the youtube videos of kids at<br/>\nunschooling conferences, and they were on stage singing, or leading<br/>\nworkshops,<br/>\nand her child didn&#39;t do those kinds of things. I made the point that<br/>\nonly kids<br/>\nwho were willing to get on stage would have been recorded; that the<br/>\nyoutube<br/>\nvideos didn&#39;t show the mom & kid in the hotel room, playing cards, or<br/>\nthe child<br/>\nreading quietly in a corner, or the kid that asked to leave the really<br/>\nloud room where<br/>\npeople were singing.<br/>\n<br/>\nI write more, when I write, about Seth, my youngest. He&#39;s loud and funny<br/>\nand on<br/>\nthe go a lot, loves to  have friends around. I don&#39;t write as much about<br/>\nEvan,<br/>\nbut that doesn&#39;t invalidate the choices he&#39;s making; they&#39;re just<br/>\nquieter<br/>\nchoices.<br/>\n<br/>\nThe idea that kids, at 17 or 18 or 19, should know what they want to do<br/>\nin the<br/>\nworld and go do it, is arbitrary, and based very much on the model of<br/>\nschool-college-career. I don&#39;t have an age in mind when I expect Evan to<br/>\nbe<br/>\nready to go out in the world more, but I do trust that it will happen.<br/>\nHe&#39;s<br/>\nhappy, he enjoys his life, and he knows I&#39;ll support the choices he<br/>\nmakes. I<br/>\nthink one positive affect of having a really good relationship with him,<br/>\nis he&#39;s<br/>\nnot in a rush to get out of the house! I&#39;ve made home a place he enjoys<br/>\nbeing,<br/>\nand that says a lot to me. It means he&#39;ll leave when he&#39;s ready; he&#39;ll<br/>\nbe moving<br/>\n*toward* something, not *away* from me.<br/>\n<br/>\nI&#39;m thinking of this video - have you seen it?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=ERbvKrH-GC4&videos=Zei9teWGs5o\">http://www.youtube.com/watch?v=ERbvKrH-GC4&videos=Zei9teWGs5o</a>    In the<br/>\nchoices<br/>\nwe&#39;ve made with unschooling, we&#39;ve gotten off that treadmill, away from<br/>\n&quot;the<br/>\nreward&#39;s up ahead!&quot; kind of thinking. The reward is *now*. Is their now<br/>\nhappy?<br/>\n<br/>\nStill offer things, if you think they&#39;re interesting, or you just want<br/>\nto shake<br/>\nthings up a bit. It&#39;s my job as an unschooling mom to keep putting<br/>\nthings in<br/>\ntheir lives, where they are, offering them at least, even if the boys<br/>\nmight not<br/>\nbe interested. Well, with Seth, I have to be stealthy! He resists<br/>\nanything that<br/>\nseems like &quot;teaching&quot;, or me pushing him at all. It&#39;s more leaving<br/>\nthings<br/>\naround, or saying, &quot;I was interested in doing X, you wanna come?&quot; The<br/>\nmore<br/>\npeaceful I can be, the more accepting, the less he has to push against,<br/>\nso I&#39;ve<br/>\nreally worked on building and maintaining my own inner peace.<br/>\n<br/>\n<br/>\n<br/>\nThe more peaceful you can be about NOW, the better things will flow.<br/>\n<br/>\nAnd, yeah, for a time, you might be making most of your connections and<br/>\ngetting your support online, but I bet you&#39;ll also find folks not too<br/>\nfar from you, the more you &quot;network&quot; and make online friends.<br/>\n<br/>\nAs soon as you can get to an unschooling conference, do so! It can make<br/>\na HUGE difference in how you approach radical unschooling.<br/>\n<br/>\npeace,<br/>\nCaren<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/ERbvKrH-GC4?wmode=opaque","type":"VIDEO"}]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: learning to let go","postDate":"1286806610","msgId":44944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4djY4aSs3c2ZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAzNWYwMWNiNjkwYSQzYzMwMDMwMCRiNDkwMDkwMCRAY29tPg=="},"prevInTopic":44943,"nextInTopic":44945,"prevInTime":44943,"nextInTime":44945,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"... Y know... that may be a way to get them some unschooling - figure out what you d require for them to graduate early and then let them have a few","messageBody":"<div id=\"ygrps-yiv-1368989967\">&quot;Tanya &quot; &lt;tata_buug@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I know the rush is that they see graduation as a means to<br/>\n&gt; freedom.<br/>\n<br/>\n </span></blockquote>Y&#39;know... that may be a way to get them some &quot;unschooling&quot; - figure out what you&#39;d &quot;require&quot; for them to &quot;graduate early&quot; and then let them have a few  years &quot;off&quot; before they decide what they want to do later - college or jobs or whatever. For that matter... just brainstorming here... get a copy of a GED test - I know they make practice test for people studying for the GED - and use that as a baseline. If they can pass the GED now (whether that&#39;s a legal option or not, probably not) then they can &quot;graduate&quot; and have a &quot;break&quot; for a few years. It seems a little sneaky, in a way, but they&#39;re stuck with older ideas about school. Finding a &quot;legitimate&quot; way for them to &quot;succeed&quot; is a win-win in that sense and they still have plenty of time to deschool. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: learning to let go","postDate":"1286801362","msgId":44943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4djE0aStyNWdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAzNWYwMWNiNjkwYSQzYzMwMDMwMCRiNDkwMDkwMCRAY29tPg=="},"prevInTopic":44942,"nextInTopic":44944,"prevInTime":44942,"nextInTime":44944,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"But they can t really do whatever they want, can they? Not like an adult with a car and money. I can take myself to the beach today, if I want. They can t. So","messageBody":"<div id=\"ygrps-yiv-1671083630\">But they can&#39;t really do whatever they want, can they?<br/>\n<br/>\nNot like an adult with a car and money. I can take myself to the beach today, if I want. They can&#39;t.<br/>\n<br/>\nSo what are their choices really?<br/>\n<br/>\nFour kids, one mom, I assume a limited budget and limited time. What are the choices? <br/>\n<br/>\nMaybe reading together at a good unschooling site would be one thing to do -- <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nAlong with more talking about how you have learned more about your options and how people learn and want to show them around your new way of thinking about things. That you have changed and they have that option -- to change along with you. Or not. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Tanya &quot; &lt;tata_buug@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; No, they have not read about it. I tried to explain it but obviously I<br/>\n&gt; didn&#39;t do a decent job considering they looked at me like I was crazy. They<br/>\n&gt; think unschooling means that instead of me saying you have to do this lesson<br/>\n&gt; in math & science & read this book today, they get to decide which subjects<br/>\n&gt; they want to work on & when they want to work on them during the day. They<br/>\n&gt; didn&#39;t get the fact that they didn&#39;t have to work on any subjects but could<br/>\n&gt; have done whatever they wanted. <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; They see school as something you MUST do. All of their friends<br/>\n&gt; school-at-home. Their best friends have vigorous schedules so they can<br/>\n&gt; graduate early, they count hours in each subject, take tests, study for the<br/>\n&gt; SAT and so on. Micah and Xavier look at their schedule and want to know if<br/>\n&gt; we should do more and are asking me if they can graduate early? I have no<br/>\n&gt; idea what &quot;early&quot; is they are 13 & 11. Their thinking is that they use high<br/>\n&gt; school texts now & they can do the things we originally said they had to do<br/>\n&gt; before we would let them graduate (manage a checking account, work on car,<br/>\n&gt; etc.) so I don&#39;t know what to say to them other than your 11 & 13 - what&#39;s<br/>\n&gt; the rush? Only I know the rush is that they see graduation as a means to<br/>\n&gt; freedom. The only unschooling friends they have live back home in FL (we are<br/>\n&gt; currently in TX).<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Tonight they asked me if they had school tomorrow and could I make them a<br/>\n&gt; list of what they need to do. So I am torn on one hand I want to make a list<br/>\n&gt; of schoolish things since that is what they expect, but I know if they<br/>\n&gt; understood the choice was theirs they would NOT do these things. On the<br/>\n&gt; other hand I want to give them a list of my goals for tomorrow and tell them<br/>\n&gt; to either join me or do whatever they want.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; As for unschooling  my younger 2 kids.. they are 3 & 1 and play all day long<br/>\n&gt; :)<br/>\n&gt; <br/>\n&gt; Tanya<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":168839594,"authorName":"Tanya","from":"&quot;Tanya &quot; &lt;tata_buug@...&gt;","profile":"tata_buug","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: learning to let go","postDate":"1286777098","msgId":44942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzNWYwMWNiNjkwYSQzYzMwMDMwMCRiNDkwMDkwMCRAY29tPg==","inReplyToHeader":"PGk4c2FiZys5NjhrQGVHcm91cHMuY29tPg==","referencesHeader":"PDAyMTQwMWNiNjc5YSRhODEyY2NlMCRmODM4NjZhMCRAY29tPiA8aThzYWJnKzk2OGtAZUdyb3Vwcy5jb20+"},"prevInTopic":44941,"nextInTopic":44943,"prevInTime":44941,"nextInTime":44943,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"No, they have not read about it. I tried to explain it but obviously I didn t do a decent job considering they looked at me like I was crazy. They think","messageBody":"<div id=\"ygrps-yiv-212655579\">No, they have not read about it. I tried to explain it but obviously I<br/>\ndidn&#39;t do a decent job considering they looked at me like I was crazy. They<br/>\nthink unschooling means that instead of me saying you have to do this lesson<br/>\nin math & science & read this book today, they get to decide which subjects<br/>\nthey want to work on & when they want to work on them during the day. They<br/>\ndidn&#39;t get the fact that they didn&#39;t have to work on any subjects but could<br/>\nhave done whatever they wanted. <br/>\n<br/>\n <br/>\n<br/>\nThey see school as something you MUST do. All of their friends<br/>\nschool-at-home. Their best friends have vigorous schedules so they can<br/>\ngraduate early, they count hours in each subject, take tests, study for the<br/>\nSAT and so on. Micah and Xavier look at their schedule and want to know if<br/>\nwe should do more and are asking me if they can graduate early? I have no<br/>\nidea what &quot;early&quot; is they are 13 & 11. Their thinking is that they use high<br/>\nschool texts now & they can do the things we originally said they had to do<br/>\nbefore we would let them graduate (manage a checking account, work on car,<br/>\netc.) so I don&#39;t know what to say to them other than your 11 & 13 - what&#39;s<br/>\nthe rush? Only I know the rush is that they see graduation as a means to<br/>\nfreedom. The only unschooling friends they have live back home in FL (we are<br/>\ncurrently in TX).<br/>\n<br/>\n <br/>\n<br/>\nTonight they asked me if they had school tomorrow and could I make them a<br/>\nlist of what they need to do. So I am torn on one hand I want to make a list<br/>\nof schoolish things since that is what they expect, but I know if they<br/>\nunderstood the choice was theirs they would NOT do these things. On the<br/>\nother hand I want to give them a list of my goals for tomorrow and tell them<br/>\nto either join me or do whatever they want.<br/>\n<br/>\n <br/>\n<br/>\nAs for unschooling  my younger 2 kids.. they are 3 & 1 and play all day long<br/>\n:)<br/>\n<br/>\nTanya<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367302968,"authorName":"VickiJ","from":"&quot;VickiJ&quot; &lt;vjohnsonbarrett@...&gt;","profile":"vjohnsonbarrett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: learning to let go","postDate":"1286742216","msgId":44941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4dDdjOCtuMGptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyMTQwMWNiNjc5YSRhODEyY2NlMCRmODM4NjZhMCRAY29tPg=="},"prevInTopic":44940,"nextInTopic":44942,"prevInTime":44940,"nextInTime":44942,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"... This paragraph captured how I m feeling this year. My son is of 8th grade age, and we ve been back and forth with the idea of using or not using a","messageBody":"<div id=\"ygrps-yiv-392289988\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;For me learning to let go as an adult is hard especially when I&#39;m learning to let go at the same time that most of my friends (and children&#39;s friends) are planning their high school years and working towards requirements for graduating high school and deciding when to take the PSAT and SAT. Self doubt sets in and I start questioning myself. What am I doing? Here I am trying to throw out the entire idea of school when my kids should be preparing for college?&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>This paragraph captured how I&#39;m feeling this year. My son is of &quot;8th grade&quot; age, and we&#39;ve been back and forth with the idea of using or not using a curriculum, schooling or not for the past couple of years. We lived outside the country for a year, in 2 different places, and during that time I felt just fine about unschooling. We did not have many outside influences, and did things almost exclusively as a family.<br/>\n<br/>\nNow I have moved back to the U.S. near a long-time friend whose son is the same age as, and friends with, my son. Suddenly I find myself questioning my decisions, listening to her talk about what it&#39;s &quot;our job&quot; to teach our kids, not knowing how to respond to her talk in a way that feels authentic to me. I know I&#39;m feeling judged, although I don&#39;t think she sees it that way. Because I like and respect her, and value our longterm friendship, it&#39;s difficult for me to avoid having her reasoning echo in my head.<br/>\n<br/>\nI&#39;m floundering. I find myself alone (my husband has to stay in China in order to have a job) here, a political liberal in a land of conservatives (Las Vegas, NV), an unschooler among driven parents, not knowing how to find people to connect with who can support me in what I &quot;feel&quot; is the right way to do this. The homeschool groups I have approached seem very tied to religion and conservative thinking, the only &quot;unschoolng&quot; group I&#39;ve found seem quite schooly to me, and it has reinforced my feeling of aloneness. Are online lists the only place I am to find people who don&#39;t believe in schooling their children?<br/>\n<br/>\nWhen he was 11, I stopped schooling my son and we both read a lot of unschooling information. When he spent almost all his waking hours playing computer games I thought it was ok because he was deschooling. Now that he is almost 14, I wonder more often if playing World of Warcraft for 15 hours a day, or reading gaming forums, is making him unidimensional. When we talk about learning about things he&#39;s interested in, he says, &quot;The problem is, I don&#39;t know what else I&#39;m interested in.&quot; That prompted me to begin nudging him to watch more videos about a range of subjects, read more things, etc. which turned into going back to curriculum in order to expose him to things which might turn into interests. He&#39;s only willing to go out and do things away from home every once in awhile, preferring to be on his computer all the time. We have a very close and good relationship, but I am still concerned he is being set up to fail at the things he&#39;ll need to know for college, or adult life.<br/>\n<br/>\nI&#39;ve so respected the insight of Meredith and others on these lists, so I&#39;m looking for help now. Advice, opinions, insight. I know I&#39;ve presented a lot of stuff here, I&#39;m just hoping someone (or many someones) can pick out pieces of my dilemna and help me to either look at it differently or give me ideas about how to proceed. Sorry for the length of my post, it all just came tumbling out once I got started.<br/>\nVicki</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: learning to let go","postDate":"1286712496","msgId":44940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4c2FiZys5NjhrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyMTQwMWNiNjc5YSRhODEyY2NlMCRmODM4NjZhMCRAY29tPg=="},"prevInTopic":44939,"nextInTopic":44941,"prevInTime":44939,"nextInTime":44941,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"Have they read about unschooling? Do they know about the thinking behing it? That it s not Mom not doing something but them having the opportunity to do what","messageBody":"<div id=\"ygrps-yiv-582085660\">Have they read about unschooling? Do they know about the thinking behing it? That it&#39;s not Mom not doing something but them having the opportunity to do what they want? <br/>\n<br/>\nWhat they want may be -- I share the &quot;gasp&quot; :) -- public school or something like it but if they can learn that they own that decision and what goes into their heads, even a schoolish experience can be their own.<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Tanya Ahmann&quot; &lt;tata_buug@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; We have been relaxed homeschoolers since the beginning. By relaxed I mean<br/>\n&gt; during different seasons of our homeschooling path we have used curriculum<br/>\n&gt; and at other times we ditched the books and went with the flow. We went lots<br/>\n&gt; of places and did lots of things and while I saw that my 2 oldest were<br/>\n&gt; learning stuff at those time they saw it as a vacation. My kids enjoyed life<br/>\n&gt; more when we just go and do stuff. They don&#39;t see it as learning (or even<br/>\n&gt; &lt;gasp&gt; as school), which is good because they HATE school. To them school<br/>\n&gt; means text books, thinking inside the box, not learning from the world<br/>\n&gt; around them - because to do that is play and aren&#39;t they suppose to do<br/>\n&gt; school? <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; When you grow up thinking of school as texts, projects, and the what not and<br/>\n&gt; then start homeschooling with the same philosophy it is only natural that<br/>\n&gt; kids, even homeschooled ones, can dislike school. For me learning to let go<br/>\n&gt; as an adult is hard especially when I&#39;m learning to let go at the same time<br/>\n&gt; that most of my friends (and children&#39;s friends) are planning their high<br/>\n&gt; school years and working towards requirements for graduating high school and<br/>\n&gt; deciding when to take the PSAT and SAT. Self doubt sets in and I start<br/>\n&gt; questioning myself. What am I doing? Here I am trying to throw out the<br/>\n&gt; entire idea of school when my kids should be preparing for college? <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I am finding it difficult to learn to unschool (that sounds funny). I feel<br/>\n&gt; like I am sitting on the edge of a cliff wanting to jump off and officially<br/>\n&gt; let go of all schoolish ideas and just live life. Yet, my 2 oldest kids are<br/>\n&gt; not with me. They think they must do school, they want to have a list of<br/>\n&gt; what they are suppose to do each day and it is my fault because I have<br/>\n&gt; taught them to be that way. How do I help my children to let go of school<br/>\n&gt; when I taught them what school was and I am learning to let go at the same<br/>\n&gt; time? I am a list maker naturally. I like having a plan and knowing what I<br/>\n&gt; am doing each week. Is it wrong to plan some activities in our days (ones<br/>\n&gt; they would enjoy and want to do) but we never do because we are to busy<br/>\n&gt; &quot;doing school&quot;? I guess that sounds bad - teaching to let go and planning<br/>\n&gt; our day. By planning activities I mean planning a trip to that museum we<br/>\n&gt; have been wanting to visit or going to the state park we have not gotten to<br/>\n&gt; yet. As I read what I wrote, I know I am still in a &quot;school&quot; mind frame<br/>\n&gt; myself. <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Deschooling myself and my kids is going to take some time. <br/>\n&gt; <br/>\n&gt; Thanks for reading my ramble. I do enjoy reading your posts :-)<br/>\n&gt; <br/>\n&gt; Learning to let go...<br/>\n&gt; <br/>\n&gt; Tanya<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: learning to let go","postDate":"1286636379","msgId":44939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4cTAwcitxNzc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyMTQwMWNiNjc5YSRhODEyY2NlMCRmODM4NjZhMCRAY29tPg=="},"prevInTopic":44938,"nextInTopic":44940,"prevInTime":44938,"nextInTime":44940,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"... Step away from your own goal of wanting them to let go of school and value theirs. That s the heart of unschooling, really, to value what and how your","messageBody":"<div id=\"ygrps-yiv-576435529\">&quot;Tanya Ahmann&quot; &lt;tata_buug@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; my 2 oldest kids are<br/>\n&gt; not with me. They think they must do school, they want to have a list of<br/>\n&gt; what they are suppose to do each day and it is my fault because I have<br/>\n&gt; taught them to be that way. How do I help my children to let go of school<br/>\n<br/>\n </span></blockquote>Step away from your own goal of wanting them to &quot;let go of school&quot; and value theirs. That&#39;s the heart of unschooling, really, to value what and how your kids choose to learn. So right now doing school looks safe - its what they know and what everyone they know is doing. Unschooling looks like goofing off. Getting to an unschooling conference might help them have a different perspective, but in the mean time, its up to you to help them work towards their own goals - and right now their goals are schoolish goals. Its not about &quot;fault&quot; its what they have reason to value. <br/>\n<br/>\nIf your younger kids aren&#39;t as invested in schoolishness, then you can work more toward deschooling and unschooling with them - for that matter, your older kids might change their minds ;) But the goal shouldn&#39;t be to change their minds for them. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":168839594,"authorName":"Tanya Ahmann","from":"&quot;Tanya Ahmann&quot; &lt;tata_buug@...&gt;","profile":"tata_buug","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"learning to let go","postDate":"1286619224","msgId":44938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMTQwMWNiNjc5YSRhODEyY2NlMCRmODM4NjZhMCRAY29tPg=="},"prevInTopic":0,"nextInTopic":44939,"prevInTime":44937,"nextInTime":44939,"topicId":44938,"numMessagesInTopic":0,"msgSnippet":"We have been relaxed homeschoolers since the beginning. By relaxed I mean during different seasons of our homeschooling path we have used curriculum and at","messageBody":"<div id=\"ygrps-yiv-1523585578\">We have been relaxed homeschoolers since the beginning. By relaxed I mean<br/>\nduring different seasons of our homeschooling path we have used curriculum<br/>\nand at other times we ditched the books and went with the flow. We went lots<br/>\nof places and did lots of things and while I saw that my 2 oldest were<br/>\nlearning stuff at those time they saw it as a vacation. My kids enjoyed life<br/>\nmore when we just go and do stuff. They don&#39;t see it as learning (or even<br/>\n&lt;gasp&gt; as school), which is good because they HATE school. To them school<br/>\nmeans text books, thinking inside the box, not learning from the world<br/>\naround them - because to do that is play and aren&#39;t they suppose to do<br/>\nschool? <br/>\n<br/>\n <br/>\n<br/>\nWhen you grow up thinking of school as texts, projects, and the what not and<br/>\nthen start homeschooling with the same philosophy it is only natural that<br/>\nkids, even homeschooled ones, can dislike school. For me learning to let go<br/>\nas an adult is hard especially when I&#39;m learning to let go at the same time<br/>\nthat most of my friends (and children&#39;s friends) are planning their high<br/>\nschool years and working towards requirements for graduating high school and<br/>\ndeciding when to take the PSAT and SAT. Self doubt sets in and I start<br/>\nquestioning myself. What am I doing? Here I am trying to throw out the<br/>\nentire idea of school when my kids should be preparing for college? <br/>\n<br/>\n <br/>\n<br/>\nI am finding it difficult to learn to unschool (that sounds funny). I feel<br/>\nlike I am sitting on the edge of a cliff wanting to jump off and officially<br/>\nlet go of all schoolish ideas and just live life. Yet, my 2 oldest kids are<br/>\nnot with me. They think they must do school, they want to have a list of<br/>\nwhat they are suppose to do each day and it is my fault because I have<br/>\ntaught them to be that way. How do I help my children to let go of school<br/>\nwhen I taught them what school was and I am learning to let go at the same<br/>\ntime? I am a list maker naturally. I like having a plan and knowing what I<br/>\nam doing each week. Is it wrong to plan some activities in our days (ones<br/>\nthey would enjoy and want to do) but we never do because we are to busy<br/>\n&quot;doing school&quot;? I guess that sounds bad - teaching to let go and planning<br/>\nour day. By planning activities I mean planning a trip to that museum we<br/>\nhave been wanting to visit or going to the state park we have not gotten to<br/>\nyet. As I read what I wrote, I know I am still in a &quot;school&quot; mind frame<br/>\nmyself. <br/>\n<br/>\n <br/>\n<br/>\nDeschooling myself and my kids is going to take some time. <br/>\n<br/>\nThanks for reading my ramble. I do enjoy reading your posts :-)<br/>\n<br/>\nLearning to let go...<br/>\n<br/>\nTanya<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44930,"nextTopicId":44957}}