{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: beginning unschooling later in childhood","postDate":"1299177061","msgId":46298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrb21wNStvdXRrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg=="},"prevInTopic":46295,"nextInTopic":0,"prevInTime":46297,"nextInTime":46299,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... Part of that likely relates to How they like to learn. For instance, my 9yo has been unschooled from the start, but she s not much of a talker. If she asks","messageBody":"<div id=\"ygrps-yiv-1881577455\">&quot;odiniella&quot; &lt;hgaimari@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; In our home, these &quot;conversations&quot; would last about 40 seconds and would<br/>\n&gt; consist of one child asking me or their dad and both listening to the<br/>\n&gt; answer then moving on.<br/>\n<br/>\n </span></blockquote>Part of that likely relates to How they like to learn. For instance, my 9yo has been unschooled from the start, but she&#39;s not much of a talker. If she asks a question, she Wants a short answer and will cut me or her dad off if we go on and on. But if I can point her to a resource that lets her look and touch, she can spend a long time with that resource. <br/>\n<br/>\nThe other thing, though, depends on this phrase from the initial quote: &quot;still ongoing discussions&quot;. In our house, ongoing discussion often take the form of thirty seconds here, a few words, there. My 9yo is very good at pulling together references - so part of our &quot;ongoing discussions&quot; involve &quot;oh, that&#39;s like something I read in this story&quot; or &quot;there was a Spongebob episode that mentioned that&quot;. The actual conversation or discussion is spread out rather than concentrated, if you see what I mean. <br/>\n<br/>\n My<br/>\n<blockquote><span title=\"ireply\"> &gt; daughter is 13, my son is 11 and I wonder if I missed the window of<br/>\n&gt; opportunity to teach them this kind of skill.<br/>\n<br/>\n </span></blockquote>My 17yo is a stepson and has been through the mill - homeschool, a few years living with his bio mom and going to public school - before rejoining our unschooling home at 13. At first he was still very tied up in the sort of Q&A paradigm of school. He didn&#39;t want thoughts or suppositions, he wanted &quot;The Answer&quot; and was veeeerrrry suspicious of any attempts to engage him beyond that. Oh, oh, someone&#39;s trying to teach me something. <br/>\n<br/>\nWhat helped was his dad and I being more upfront and transparant about our thinking processes in general. He was used to adults being The Ones Who Know rather than the ones whe think things through or make guesses or flat out flounder around. So it was helpful for him to gradually see more of that - not all at once, but over time becoming more honest about just how often adults Don&#39;t have The Answer. That freed him from a need to project a kind of bravado about what he knew and thought. It became okay to explore again. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: beginning unschooling later in childhood","postDate":"1299149181","msgId":46295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1MjRBNTI2LUY1MTgtNDNDNy04RkE3LTRBNEM1QjQ4QTA3MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlrbmU2NitjYzE3QGVHcm91cHMuY29tPg==","referencesHeader":"PGlrbmU2NitjYzE3QGVHcm91cHMuY29tPg=="},"prevInTopic":46294,"nextInTopic":46298,"prevInTime":46294,"nextInTime":46296,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... Once someone steps far away from school, it s much easier to see that schooled kids aren t partying because that s what they d do if given all the free","messageBody":"<div id=\"ygrps-yiv-707584501\">On Mar 3, 2011, at 1:58 AM, odiniella wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; what did &quot;focusing on only having fun&quot; look like? was<br/>\n&gt; that in their spare time after school?&lt;<br/>\n&gt;<br/>\n&gt; parties<br/>\n<br/>\n </span></blockquote>Once someone steps far away from school, it&#39;s much easier to see that  <br/>\nschooled kids aren&#39;t partying because that&#39;s what they&#39;d do if given  <br/>\nall the free time in the world. They&#39;re partying to decompress from  <br/>\nthe pressures of school and often the pressures of parental  <br/>\nexpectations.<br/>\n<br/>\nIt&#39;s not that unschooled kids don&#39;t like parties! (Some do. Some  <br/>\ndon&#39;t.) But they go to parties for very very different reasons.  <br/>\nUnschooled kids don&#39;t have the need to decompress. They do have social  <br/>\nneeds though. And for some getting together with a bunch of kids can  <br/>\nfun.<br/>\n<br/>\nUnschooled kids go to parties, watch TV, play video games, read books,  <br/>\ngo shopping for very different reasons than schooled kids do. Once  <br/>\nyou&#39;ve stepped away from school, it&#39;s extraordinary how much school  <br/>\nand conventional parenting warps who kids are. Everyone thinks those  <br/>\nkids -- especially teens: surly, slackers, anti-adult world -- are  <br/>\njust how kids are. But it&#39;s not true. That&#39;s how kids are when they&#39;re  <br/>\nunder pressure to be who the parents think they could be.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] beginning unschooling later in childhood","postDate":"1299148454","msgId":46294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1RDdDQTM1LURGQjUtNDIyQS1BRDE3LUY1MUUyOTQwNEM5N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg=="},"prevInTopic":46293,"nextInTopic":46295,"prevInTime":46293,"nextInTime":46295,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... By the parents not expecting them to be other than who they are. By the parents not trying to change who they are but giving them the environment to","messageBody":"<div id=\"ygrps-yiv-992459814\">On Mar 2, 2011, at 8:24 PM, odiniella wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How do your kids learn to answer questions for<br/>\n&gt; themselves and develop this kind of open-ended exploration?<br/>\n<br/>\n </span></blockquote>By the parents not expecting them to be other than who they are. By  <br/>\nthe parents not trying to change who they are but giving them the  <br/>\nenvironment to explore who they are.<br/>\n<br/>\nBy the kids feeling free to ask whatever questions they have and get  <br/>\nthe responses *they&#39;re* seeking. Not necessarily the facts but a  <br/>\nfeeling the parents are responding to what the kids need and not what  <br/>\nthe parents want the kids to have. In other words questions don&#39;t  <br/>\nbecome teaching moments or open the door to some agenda the parents  <br/>\nhave for the kids.<br/>\n<br/>\nI&#39;m not saying you do that, but you asked how it happens. And how it  <br/>\nhappens is the freedom to allow *whatever* will unfold to happen and  <br/>\nto not try to direct it in any particular direction. For the kids the  <br/>\nexperience should feel like asking knowledgeable friends who don&#39;t  <br/>\nhave an emotional investment in the kids learning anything. The  <br/>\nconversations can go wherever interest takes them.<br/>\n<br/>\nYou&#39;ll notice in the conversation the kids weren&#39;t talking about math  <br/>\nor science or doing any writing or picking up after themselves. If  <br/>\nevery extraordinary moment in unschoolers lives were written out it  <br/>\nwould seemingly set the bar so high for subsequent unschoolers that no  <br/>\none would do it ;-)<br/>\n<br/>\nThat&#39;s who those particular kids are. Or were at that moment. I don&#39;t  <br/>\nthink Kat and I ever had a conversation like that. (She&#39;s 19.) Ours  <br/>\ntend to be more along the lines of why people do what they do. We talk  <br/>\nabout writing and drawing. And 90&#39;s metal music. When she was 11-14ish  <br/>\nshe talked about slugbugs, these she and her friend made up, and the  <br/>\nothers and the world they interacted with. It perhaps sounds creative  <br/>\nwritten like that but it really looked like nothing that was leading  <br/>\nto any kind of career -- except maybe as a comics artist for 11 yos!<br/>\n<br/>\nEvery unschooling life has *moments* that look extraordinary.  <br/>\nSometimes those moments look like spontaneous fun learning of  <br/>\nsomething the kids would have been taught in school. Sometimes those  <br/>\nmoment require a mom to take off school glasses and see the  <br/>\nextraordinary in the playing the kids are doing. But mostly it&#39;s  <br/>\ngaining trust that what doesn&#39;t look at all like extraordinary  <br/>\nactually is wonderful things happening.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: beginning unschooling later in childhood","postDate":"1299146194","msgId":46293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3NzQ4Ny4zODY2NS5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlrbmMzOCtsYzdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrbmMzOCtsYzdoQGVHcm91cHMuY29tPg=="},"prevInTopic":46292,"nextInTopic":46294,"prevInTime":46292,"nextInTime":46294,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"She played dolls for the first time in years (we bought new ones because she had given hers away).  That led to an interest in fashion and eventually anime","messageBody":"<div id=\"ygrps-yiv-1356444794\">She played<br/>\ndolls for the first time in years (we bought new ones because she had<br/>\ngiven hers away).  That led to an interest in fashion and eventually<br/>\nanime art, I think. <br/>\n<br/>\n-----------<br/>\nThat&#39;s what learning looks like. You follow connections from one thing to <br/>\nanother. That is absolutely what you are striving to have when you speak with <br/>\nenvy about a conversation stemming from the Simpsons. Notice those moments in <br/>\nletters writ large in your brain. Notice those moments instead o  underscoring <br/>\nthe ones where you feel she isn&#39;t doing anything. <br/>\n<br/>\n<br/>\n----------------<br/>\n<br/>\n  But...I can&#39;t help but worry that I&#39;d let her get to her 20&#39;s without<br/>\nany kinds of job skills (okay... I think that&#39;s one of my biggest<br/>\nconcerns here and I hope that isn&#39;t a terrible thing to admit).  <br/>\n<br/>\n-----------------<br/>\n<br/>\nIt&#39;s a very common thing to be worried about your children. It would be more <br/>\nterrible to admit that you had no concerns regarding your children. If she was <br/>\nin school would you not be worried? If she was in school and struggling to meet <br/>\nthe requirements or unhappy, or happy but you were reading the unemployment <br/>\nstatistics? There aren&#39;t any guarantees. I can&#39;t assure you that unschooling <br/>\nwill give your daughter the skills that she requires to become a happy and <br/>\nsuccessfully employed adult. School can&#39;t do that either. School can guarantee <br/>\nthat they will fail students because that&#39;s how a bell curve works. <br/>\n<br/>\n<br/>\nOne of my epiphanal  moments was when I realised that school had never been <br/>\ntested. It was still at the theoretical phase of an idea. The point of school <br/>\nisn&#39;t necessarily education. The point of school is a pretty muddled thing of <br/>\nchildcare and child welfare and needing more people in the workforce when child <br/>\nlabour laws changed. <br/>\n<br/>\n<br/>\n-----------------<br/>\n<br/>\nIt&#39;s<br/>\nnot that I have a specific expectation of what her adult life will look<br/>\nlike, it&#39;s that she has adult cousins with no real ambition, no skills,<br/>\nno prospects and they aren&#39;t happy with the way things are turning out. <br/>\n<br/>\n------------<br/>\n<br/>\nWhat did they do from 13 to young adulthood? Were they in school? Did school <br/>\nform them so that their lives weren&#39;t fraught with worry and a lack of <br/>\ndirection? No, they are now going through their own period of deschooling, but <br/>\nwith the horrible guilt of knowing that they aren&#39;t achieving at expected <br/>\nlevels. I was like that. I&#39;m guessing there are lots of people who were like <br/>\nthat. They&#39;d been moved forward day after day by external forces and when that <br/>\nframework disappeared they could no longer see the point or the aim. <br/>\n<br/>\n<br/>\n----------------<br/>\n<br/>\n I do, however, know people who spent their teen years<br/>\nfocusing on having fun only to find themselves in their 40&#39;s with very<br/>\nfew options and not as happy as they expected being the grasshopper now<br/>\nthat summer is over.<br/>\n<br/>\n------------<br/>\n<br/>\nI love the ant and the grasshopper fable. It&#39;s so wrong. Ants die in the fall. <br/>\nHuge numbers. Grasshoppers live about a year (although much of that is in a <br/>\ndormant phase) and ants live on average about 90 days. And they don&#39;t ever get <br/>\nto breed. They live in a eusocial system with a queen who came ready to produce <br/>\nbabies. Grasshoppers get to have babies. <br/>\n<br/>\n<br/>\nTeens to 40 is a long time. Are you sure that it was what they did in their <br/>\nteens that so totally defined what they were doing in their 40s? Maybe there <br/>\nwere other choices along the way that you aren&#39;t noticing. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] beginning unschooling later in childhood","postDate":"1299143386","msgId":46289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzMDMwOC4xNzYyNC5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg=="},"prevInTopic":46288,"nextInTopic":46291,"prevInTime":46288,"nextInTime":46290,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"That s a moment in a life that is probably one with lots of conversations. In our home lots and lots of conversations occur. Some are 40 seconds of seeking ","messageBody":"<div id=\"ygrps-yiv-918791844\">That&#39;s a moment in a life that is probably one with lots of conversations. In <br/>\nour home lots and lots of conversations occur. Some are 40 seconds of seeking <br/>\ninformation and some are over a couple of days. For example, we watched <br/>\nOklahoma! the other day and, as always, liked Ado Annie, and talking about her <br/>\nvery unusual voice. I hadn&#39;t seen Gloria Grahame in anything else that I <br/>\nremembered so the next day I spent some time finding her on imdb and wikipedia <br/>\nand youtube. Simon and Linnaea and David and I all spent time watching some of <br/>\nthe videos and discussing some of the stuff about her life. Ado Annie sounds <br/>\nparticularly funny as she had just had plastic surgery and still had the <br/>\nstitches in. And in other movies she would put cotton wads under her upper lip <br/>\nbecause she thought her facial profile was more attractive that way, so she <br/>\nsounds odd in some dialogue scenes. She also slept with her 13 year old stepson <br/>\nwho she later married. There were lots of things to talk about from a little <br/>\ncuriosity about Oklahoma!<br/>\n<br/>\nThat was me kind of perusing the rest of the world and not Simon or Linnaea. But <br/>\nthey were interested in the information. They find lots of stuff from other <br/>\nstuff and ideas and share it with me or with David or with each other. But they <br/>\nalso will stop when their initial need for information is sated. They aren&#39;t <br/>\ndoing it on their own always. And they certainly didn&#39;t start with an <br/>\nexpectation that they do it on their own. When Simon was little and liked a <br/>\ncertain video game I would look for other, similar, video games for us to play <br/>\ntogether. When Linnaea was little and wanted a certain story read to her, I <br/>\nwould look for other similar stories to branch into if she wanted. Although the <br/>\nBaby Bebe Bird book was the only book that she liked for what felt like an age <br/>\nin the moment and retrospectively just feels like a very sweet memory. <br/>\n<br/>\n<br/>\nIt is easy to read stories of other people&#39;s lives and think that your life with <br/>\nyour children is nothing as good as what they have. It is much better to work to <br/>\nsee what is good within your own life and with your own children and see if you <br/>\ncan expand upon that. Don&#39;t work to mimic the life of someone else, work to <br/>\nengage your daughter and your son with things that they enjoy and things that <br/>\nthey like. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: odiniella &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hgaimari@...\">hgaimari@...</a>&gt;<br/>\n<br/>\nIn our home, these &quot;conversations&quot; would last about 40 seconds and would<br/>\nconsist of one child asking me or their dad and both listening to the<br/>\nanswer then moving on.  How do your kids learn to answer questions for<br/>\nthemselves and develop this kind of open-ended exploration?   My<br/>\ndaughter is 13, my son is 11 and I wonder if I missed the window of<br/>\nopportunity to teach them this kind of skill.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: beginning unschooling later in childhood","postDate":"1299139365","msgId":46291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrZU5WTnFhNGJWMmZfQlI1cTFVZ3lCV2ZDRlU2QXpjdEZtREZUaEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlrbmMzOCtsYzdoQGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGluT3dKYm01SFlrd0xjVXQwU2NoWXQ4U3o9X3Y4YXUtYmFlengySEBtYWlsLmdtYWlsLmNvbT4JPGlrbmMzOCtsYzdoQGVHcm91cHMuY29tPg=="},"prevInTopic":46289,"nextInTopic":46292,"prevInTime":46290,"nextInTime":46292,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... How can you support that interest now?  I used to think that finding money for Draven s interests wasn t important.  We are seriously poor people, but ","messageBody":"<div id=\"ygrps-yiv-1053622493\">On Thu, Mar 3, 2011 at 1:22 AM, odiniella &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hgaimari@...\">hgaimari@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; That led to an interest in fashion and eventually<br/>\n&gt; anime art, I think.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>How can you support that interest now?  I used to think that finding money<br/>\nfor Draven&#39;s interests wasn&#39;t important.  We are seriously poor people, but<br/>\nafter I really looked at where our money was going I realized there was so<br/>\nmuch more I could give him to support his interests.  We also made lots of<br/>\nlists, and right before holidays and birthdays we&#39;d double check them<br/>\nand prioritize and then mention things on the list to family and friends.<br/>\n We found ways to get what he wanted without giving up food.  =)  His<br/>\ninterests are different than your daughters, but I still have some ideas.<br/>\n<br/>\nIf your daughter is into fashion, she may not be interested in goodwill (not<br/>\nmuch current fashion there really), however look into resale or consignment<br/>\nshops near you.  Are you near a college town?  I know when I lived in a<br/>\ncollege town there were always advertisements for upscale resale/consignment<br/>\nshops where they had name brand stuff much cheaper.  They would also give<br/>\nyou store credit on any name brand clothing you brought in.  If you&#39;re not<br/>\nnear a college town check out the one closest to you.  While you&#39;re in that<br/>\ntown see if they have a fashion department at the college, find out if they<br/>\ndo any fashion shows.<br/>\n<br/>\nIs she into hair and makeup at all?  Find out if there is a local<br/>\ncosmetology school (or college that has a cosmetology department), they<br/>\nalways need people to practice on and the prices are super cheap.  She can<br/>\nplay with different hairstyles and colors and such and it won&#39;t take you<br/>\nbroke.  Depending on the school they may even do make overs.  When my<br/>\nyounger sister was in cosmetology school at the local community college<br/>\nthere was one homeschooled pre-teen girl that got something done every week<br/>\n(hair, makeup, pedicure, manicure, something), all of the students knew her<br/>\nand would give her tips and such for her to try at home.<br/>\n<br/>\nIs she interested in making clothes?  Get a used sewing machine and let her<br/>\npick out a ton of fabric.  Don&#39;t force her to do it the &quot;right way&quot; or take<br/>\nlessons, just let her play and see what happens.  This is a place where lots<br/>\nof parents slip up.  They want their child to do something &quot;the right way&quot;<br/>\nand completely turn them off of doing it at all.  Is the cost of the fabric<br/>\nthat she practices on worth more than her joy?<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; But...I can&#39;t help but worry that I&#39;d let her get to her 20&#39;s without<br/>\n&gt; any kinds of job skills (okay... I think that&#39;s one of my biggest<br/>\n&gt; concerns here and I hope that isn&#39;t a terrible thing to admit). It&#39;s<br/>\n&gt; not that I have a specific expectation of what her adult life will look<br/>\n&gt; like, it&#39;s that she has adult cousins with no real ambition, no skills,<br/>\n&gt; no prospects and they aren&#39;t happy with the way things are turning out.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>They were probably never given the freedom, the long<br/>\nterm uninterrupted freedom to find their ambition.  They probably spent<br/>\nyears in school being told what to learn, how to learn, what they were<br/>\nallowed to be interested in, etc.  Don&#39;t worry about tomorrow, seriously<br/>\ndon&#39;t.<br/>\n<br/>\nI heard a quote this past week and immediately looked at my partner and said<br/>\n&quot;We need that on our fridge.&quot;<br/>\n<br/>\n&quot;Therefore do not worry about tomorrow, for tomorrow will worry about<br/>\nitself. Each day has enough trouble of its own.&quot;<br/>\n<br/>\nIt is from the bible, but that doesn&#39;t really matter.  To me that quote is<br/>\nwhat unschooling is about.  Don&#39;t worry about what will happen tomorrow, a<br/>\nyear from now, when they&#39;re adults, etc.  Just take care of today.  Make her<br/>\nhappy today. Show her abundance today, now, right this second (if she&#39;s<br/>\nawake).  Making her unhappy today, just so she might possibly have a happier<br/>\nfuture is not what unschooling is about.<br/>\n<br/>\nSo what if she doesn&#39;t know what she wants to do at 14, 15, 16 even 19 or<br/>\n20.  Are you counting the days until you send her off to live on her own?<br/>\n If you are, then possibly unschooling isn&#39;t for you.  She will find her way<br/>\nin her own time, not yours, not anyone elses but her own.  The only way you<br/>\ncan speed that up is to give her that uninterrupted freedom to explore the<br/>\noptions.  Support every single interest she has to the fullest possible<br/>\nextent.<br/>\n<br/>\nTina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: beginning unschooling later in childhood","postDate":"1299135494","msgId":46292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrbmU2NitjYzE3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU5N0MzOEQ1NDVCQjQxMjg5N0ZGRTg4QThBMzdBQzk5QEx5bGFQQz4="},"prevInTopic":46291,"nextInTopic":46293,"prevInTime":46291,"nextInTime":46293,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... that in their spare time after school?","messageBody":"<div id=\"ygrps-yiv-1486692086\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lylaw&quot; &lt;lylaw@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what did &quot;focusing on only having fun&quot; look like?  was<br/>\n </span></blockquote>that in their spare time after school?&lt;<br/>\n<br/>\nparties<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;unschooling is not about &quot;focusing on having fun&quot;<br/>\n </span></blockquote>it&#39;s about living one&#39;s life and learning is a natural<br/>\nside effect of living.  really.  how much have you read about<br/>\nunschooling â&quot; I mean really delved in?  life is not separated out<br/>\ninto &quot;learning&quot; vs. &quot;having fun&quot; when you<br/>\nunschool.  life CAN be fun.  it sounds like your husband loves his life<br/>\nand work.  how did he get to that place?<br/>\n<blockquote><span title=\"ireply\"> &gt; lyla<br/>\n&gt;<br/>\n </span></blockquote>Thank you for being patient with me.  I do appreciate it and I&#39;m sorry<br/>\nif I&#39;m clogging the list with silly questions.   I&#39;m learning that I<br/>\nreally know precious little about unschooling.<br/>\nMy husband&#39;s interests were supported by his parents.  He liked looking<br/>\nunder rocks and catching salamanders and brought home buckets of<br/>\ncrayfish.  They shared his joy and said that&#39;s fine as long as the<br/>\nbucket stays outside.  That kind of thing.  But he enjoyed school very<br/>\nmuch, and expects his kids would too, which is why I&#39;ve never really<br/>\npursued this.  It&#39;s really way out of his comfort level.  Only, I&#39;m<br/>\nfinding that school at home just isn&#39;t working for my kids much more<br/>\nthan school down town did.  So although I&#39;m frightfully ignorant, I&#39;m<br/>\nfinding myself looking into something that appears like it might just be<br/>\nthe best idea for my kids.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: beginning unschooling later in childhood","postDate":"1299134560","msgId":46288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5N0MzOEQ1NDVCQjQxMjg5N0ZGRTg4QThBMzdBQzk5QEx5bGFQQz4=","inReplyToHeader":"PGlrbmMzOCtsYzdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrbmMzOCtsYzdoQGVHcm91cHMuY29tPg=="},"prevInTopic":46285,"nextInTopic":46289,"prevInTime":46287,"nextInTime":46289,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... any kinds of job skills (okay... I think that s one of my biggest concerns here and I hope that isn t a terrible thing to admit). It s not that I have a","messageBody":"<div id=\"ygrps-yiv-1205742510\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;But...I can&#39;t help but worry that I&#39;d let her get to her 20&#39;s without<br/>\n </span></blockquote>any kinds of job skills (okay... I think that&#39;s one of my biggest<br/>\nconcerns here and I hope that isn&#39;t a terrible thing to admit). It&#39;s<br/>\nnot that I have a specific expectation of what her adult life will look<br/>\nlike, it&#39;s that she has adult cousins with no real ambition, no skills,<br/>\nno prospects and they aren&#39;t happy with the way things are turning out.<br/>\nI’d be willing to wager they weren’t unschoolers though!  so clearly, people can go through school as they are “supposed to” and still “turn out” that way.  there are no guarantees in life.  but if you decide that freedom to learn and time and space to discover one’s passions, etc. are valuable, then there’s no better way than unschooling to move toward those values.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; do, however, know people who spent their teen years<br/>\n </span></blockquote>focusing on having fun only to find themselves in their 40&#39;s with very<br/>\nfew options and not as happy as they expected being the grasshopper now<br/>\nthat summer is over.&gt;&gt;<br/>\n<br/>\nwhat did “focusing on only having fun” look like?  was that in their spare time after school?  unschooling is not about “focusing on having fun” it’s about living one’s life and learning is a natural side effect of living.  really.  how much have you read about unschooling – I mean really delved in?  life is not separated out into “learning” vs. “having fun” when you unschool.  life CAN be fun.  it sounds like your husband loves his life and work.  how did he get to that place?  <br/>\nlyla <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: beginning unschooling later in childhood","postDate":"1299133647","msgId":46285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrbmNjZitldHQxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI4N0UzNzQwMzUyNzQyMkU4M0M4OTc3REM5OUVFQzg0QEx5bGFQQz4="},"prevInTopic":46284,"nextInTopic":46288,"prevInTime":46284,"nextInTime":46286,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... begin to ... You ... process ... longer than one month per year of school for one of my children (ironically, the younger one!) and a bit shorter for","messageBody":"<div id=\"ygrps-yiv-742549391\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lylaw&quot; &lt;lylaw@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The short answer is, you haven&#39;t even begun deschooling (let alone<br/>\n&gt; unschooling) if you&#39;re still holding onto a curriculum. You can&#39;t<br/>\n </span></blockquote>begin to<br/>\n<blockquote><span title=\"ireply\"> &gt; swim unless you let go of, and move away from, the side of the pool.<br/>\n </span></blockquote>You<br/>\n<blockquote><span title=\"ireply\"> &gt; probably will not see any of these connections until you are deeply<br/>\n&gt; committed to unschooling and have moved through the deschooling<br/>\n </span></blockquote>process&gt;&gt;&gt;&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; this is absolutely true!  and I also wanted to say that it took much<br/>\n </span></blockquote>longer than one month per year of school for one of my children<br/>\n(ironically, the younger one!) and a bit shorter for the older one<br/>\nâ&quot; every child and every childâs relationship with learning<br/>\nand experience/damage from school is different.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; lyla<br/>\n<br/>\n </span></blockquote>Like I had just mentioned in my last post, I *thought* I had allowed my<br/>\ndaughter to deschool but I can see now that I really didn&#39;t. Is this age<br/>\nan okay age to drop all expectations?  I do worry that my kids will be<br/>\nsomewhat intellectually ignorant because they will not have been exposed<br/>\nto something &quot;everyone else&quot; was, if that makes sense.<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: beginning unschooling later in childhood","postDate":"1299133352","msgId":46284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrbmMzOCtsYzdoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluT3dKYm01SFlrd0xjVXQwU2NoWXQ4U3o9X3Y4YXUtYmFlengySEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46283,"nextInTopic":46285,"prevInTime":46283,"nextInTime":46285,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"... I think you might be right. ... Thank you! ... begin to ... You ... process. ... I thought we had deschooled when bringing my daughter home.  She played ","messageBody":"<div id=\"ygrps-yiv-19699523\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton<br/>\n&lt;tina.tarbutton@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I think you might be looking too hard for the connections they make.<br/>\n </span></blockquote>I think you might be right.<br/>\n<blockquote><span title=\"ireply\"> &gt; Another big thing I want to point out is where you said &quot;I wonder if I<br/>\n&gt; missed the window of opportunity to teach them this kind of skill.&quot;  I<br/>\n&gt; highly recommend you read this page <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching/\">http://sandradodd.com/teaching/</a> on<br/>\n&gt; Sandra Dodd&#39;s website.  One of the big things that helped me with<br/>\n&gt; deschooling was getting past the notion of teaching.<br/>\n </span></blockquote>Thank you!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The short answer is, you haven&#39;t even begun deschooling (let alone<br/>\n&gt; unschooling) if you&#39;re still holding onto a curriculum.  You can&#39;t<br/>\n </span></blockquote>begin to<br/>\n<blockquote><span title=\"ireply\"> &gt; swim unless you let go of, and move away from, the side of the pool. <br/>\n </span></blockquote>You<br/>\n<blockquote><span title=\"ireply\"> &gt; probably will not see any of these connections until you are deeply<br/>\n&gt; committed to unschooling and have moved through the deschooling<br/>\n </span></blockquote>process.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Tina<br/>\n<br/>\n<br/>\n </span></blockquote>I thought we had deschooled when bringing my daughter home.  She played<br/>\ndolls for the first time in years (we bought new ones because she had<br/>\ngiven hers away).  That led to an interest in fashion and eventually<br/>\nanime art, I think. However, I can see now that I really didn&#39;t give her<br/>\ntime to deschool, just decompress a bit.  I really never knew the<br/>\ndifference until now.<br/>\n  But...I can&#39;t help but worry that I&#39;d let her get to her 20&#39;s without<br/>\nany kinds of job skills (okay... I think that&#39;s one of my biggest<br/>\nconcerns here and I hope that isn&#39;t a terrible thing to admit).  It&#39;s<br/>\nnot that I have a specific expectation of what her adult life will look<br/>\nlike, it&#39;s that she has adult cousins with no real ambition, no skills,<br/>\nno prospects and they aren&#39;t happy with the way things are turning out. <br/>\nMy husband, otoh, loves his career - he&#39;s doing exactly what he wants. <br/>\nTHAT&#39;S what I want for them and I don&#39;t know how that happens when a<br/>\nperson doesn&#39;t know what they want to do.   I don&#39;t know anyone who does<br/>\nwhat they wanted to do without the benefit of professionals organizing<br/>\ntheir education.  I do, however, know people who spent their teen years<br/>\nfocusing on having fun only to find themselves in their 40&#39;s with very<br/>\nfew options and not as happy as they expected being the grasshopper now<br/>\nthat summer is over.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] beginning unschooling later in childhood","postDate":"1299131756","msgId":46283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4N0UzNzQwMzUyNzQyMkU4M0M4OTc3REM5OUVFQzg0QEx5bGFQQz4=","inReplyToHeader":"PEFBTkxrVGluT3dKYm01SFlrd0xjVXQwU2NoWXQ4U3o9X3Y4YXUtYmFlengySEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPiA8QUFOTGtUaW5Pd0pibTVIWWt3TGNVdDBTY2hZdDhTej1fdjhhdS1iYWV6eDJIQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":46282,"nextInTopic":46284,"prevInTime":46282,"nextInTime":46284,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"The short answer is, you haven t even begun deschooling (let alone unschooling) if you re still holding onto a curriculum. You can t begin to swim unless you","messageBody":"<div id=\"ygrps-yiv-1606546047\">The short answer is, you haven&#39;t even begun deschooling (let alone<br/>\nunschooling) if you&#39;re still holding onto a curriculum. You can&#39;t begin to<br/>\nswim unless you let go of, and move away from, the side of the pool. You<br/>\nprobably will not see any of these connections until you are deeply<br/>\ncommitted to unschooling and have moved through the deschooling process&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nthis is absolutely true!  and I also wanted to say that it took much longer than one month per year of school for one of my children (ironically, the younger one!) and a bit shorter for the older one – every child and every child’s relationship with learning and experience/damage from school is different.<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] beginning unschooling later in childhood","postDate":"1299124856","msgId":46280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1NjIyOS43MjE1MS5xbUB3ZWIxMTE3MDEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg=="},"prevInTopic":46279,"nextInTopic":46282,"prevInTime":46279,"nextInTime":46281,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"In our home, these conversations would last about 40 seconds and would consist of one child asking me or their dad and both listening to the answer then","messageBody":"<div id=\"ygrps-yiv-879050361\">In our home, these &quot;conversations&quot; would last about 40 seconds and would<br/>\n<br/>\nconsist of one child asking me or their dad and both listening to the<br/>\n<br/>\nanswer then moving on.  How do your kids learn to answer questions for<br/>\n<br/>\nthemselves and develop this kind of open-ended exploration?   My<br/>\n<br/>\ndaughter is 13, my son is 11 and I wonder if I missed the window of<br/>\n<br/>\nopportunity to teach them this kind of skill.&gt;&gt;&gt;&gt;<br/>\n<br/>\nI don&#39;t think you have necessarily lost a window of opportunity but this is one reason why desschooling is so important. Long story but my girls chose school this year. When they come home we will deschool a while even though they have only been in school a year. <br/>\n<br/>\nOk now I&#39;ll try to get to my point in a somewhat succinct fashion. :) Think in school terms a minute. You get programmed to study what you are told, make an educated guess on what will be on the test and remember that stuff at least long enough to make a good grade on the test. If you are really lucky then once in a blue moon something that interests you will coincide with something to remember for &quot;the test&quot;. You go to school 8 hours a day to study what you are told is important, come home to do homework. Unless you skip say eating or sleep there just is&#39;nt time to explore your own interests. <br/>\n<br/>\nAs far as teaching the skill ...for my kids at least it was more a natural modeling sort of thing. Many times a 40 second answer is enough to satisfy them and thats ok. Or sometimes the 40 second answer satisfies for now and later something else leads them back to that subject and they end up exploring more. <br/>\n<br/>\nMy personal favorite is  when they ask me a question I don&#39;t know the answer to. Well, I don&#39;t know but we can find out. Then we could call a friend who is knowledgeable about the subject or go to trusty old google. Sometimes 5 minutes later we have our answer and they are off to something else and sometimes 2 hours later we are still exploring. <br/>\n<br/>\nYou have to remove all the tests, and expectations spoken and unspoken for a long time .<br/>\nWhen they are convinced that they can explore just to explore and that it won&#39;t change next week it will start to evolve. <br/>\n<br/>\nNicole<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n                <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 3/2/11, odiniella &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hgaimari@...\">hgaimari@...</a>&gt; wrote:<br/>\n<br/>\nFrom: odiniella &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hgaimari@...\">hgaimari@...</a>&gt;<br/>\nSubject: [unschoolingbasics] beginning unschooling later in childhood<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, March 2, 2011, 7:24 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      One of the Sandra Dodd links about strewing brought me to this quote:<br/>\n<br/>\nThe Simpsons bit (spoofing) the Bill on Capital Hill (flag burners have<br/>\n<br/>\ntoo much freedom) led to the still ongoing discussions of flag burning<br/>\n<br/>\nas freedom of speech, which led to discussions on political protest<br/>\n<br/>\nwhich led to the ever popular discussions on civil disobedience, which<br/>\n<br/>\nled to the reading of &quot;Civil Disobedience&quot; by Thoreau, which led to<br/>\n<br/>\n&quot;Walden.&quot;(<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/simpsons\">http://sandradodd.com/strew/simpsons</a><br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/simpsons\">http://sandradodd.com/strew/simpsons</a>&gt; )<br/>\n<br/>\nIn our home, these &quot;conversations&quot; would last about 40 seconds and would<br/>\n<br/>\nconsist of one child asking me or their dad and both listening to the<br/>\n<br/>\nanswer then moving on.  How do your kids learn to answer questions for<br/>\n<br/>\nthemselves and develop this kind of open-ended exploration?   My<br/>\n<br/>\ndaughter is 13, my son is 11 and I wonder if I missed the window of<br/>\n<br/>\nopportunity to teach them this kind of skill.<br/>\n<br/>\nHelen<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] beginning unschooling later in childhood","postDate":"1299124852","msgId":46282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluT3dKYm01SFlrd0xjVXQwU2NoWXQ4U3o9X3Y4YXUtYmFlengySEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg=="},"prevInTopic":46280,"nextInTopic":46283,"prevInTime":46281,"nextInTime":46283,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"I think you might be looking too hard for the connections they make. My now 11 year old was homeschooled until about 7 y/o (a very relaxed homeschooling with","messageBody":"<div id=\"ygrps-yiv-1468715993\">I think you might be looking too hard for the connections they make.<br/>\n<br/>\nMy now 11 year old was homeschooled until about 7 y/o (a very relaxed<br/>\nhomeschooling with lots of unschooling philosophy thrown in, before I knew a<br/>\nword for it) then spent 1 year and 1 semester in school, followed by about 9<br/>\nmonths of more relaxed homeschooling before we switched to unschooling about<br/>\n2 years ago (litterally burning all of the workbooks and curriculum and<br/>\nmaking a big issue out of no more school at all).  So in his case going by<br/>\nthe general idea of 1 month for every year in school we would have needed<br/>\nabout 5 months of deschooling.  In reality for us it was more like 10<br/>\nmonths, so we&#39;ve been deeply ingrained in unschooling for about a year.<br/>\n<br/>\nThree months ago was the first time I really experienced the quick one<br/>\nsubject to another to another kind of conversation, it doesn&#39;t happen all<br/>\nthat often in our house.  However I see him making connections every day.<br/>\n<br/>\nHere&#39;s an example that centers around his two main interests, gaming and<br/>\nweapons.  He loves &quot;shoot-em-up&quot; video games and he loves nerf weapons.<br/>\n From there he got interested in real guns, he doesn&#39;t have any interest in<br/>\nshooting anything living, but he does love the bb gun he has at my dads and<br/>\nlately he&#39;s wanted to shoot something a little more powerful and possibly a<br/>\nhandgun.<br/>\n<br/>\nFrom his interest in real guns he began searching out information about<br/>\nguns, which lead to us buying both a gun almanac (which has all of the guns<br/>\nproduced that year) and an ipod app that allows him to look up various guns<br/>\nand get info.<br/>\n<br/>\nFrom there we started talking about 2 different things (probably more, but<br/>\nwe&#39;ll focus on these), mechanics of guns and the history of guns<br/>\n<br/>\nThe history of guns has lead us to touch a little bit on the history of the<br/>\nworld as we were discussing certain guns, why there are more guns made in X<br/>\nyear as opposed to Y year (a war was happening in X, but not in Y).<br/>\n<br/>\nThe mechanics of guns has led us to discussing caliber and gunpowder and the<br/>\ndifference between shot guns and rifles and hand guns.  Why does a larger<br/>\ncaliber gun have more recoil, etc. etc. etc.<br/>\n<br/>\n A game set in the old west that&#39;s using modern guns started a discussion on<br/>\nhistorical accuracy and historical fiction vs. non-fiction.<br/>\n<br/>\nThe lack of recoil in some of the more powerful guns in his games got us<br/>\ntalking about the reality or lack of reality in fantasy games.<br/>\n<br/>\nTo me, him playing the games and enjoying them is just important if not more<br/>\nimportant than any &quot;book learning&quot; that comes out of the games.  I know he&#39;s<br/>\nmaking connections, however those connections did not excite him until a<br/>\nfull year after we had burned the notion that learning comes from<br/>\ncurriculum.  Before that he would avoid those connections, if I made the<br/>\nmistake of pointing them out he would stop playing the game until he could<br/>\nforget that he was &quot;learning&quot; from it.<br/>\n<br/>\nAnother big thing I want to point out is where you said &quot;I wonder if I<br/>\nmissed the window of opportunity to teach them this kind of skill.&quot;  I<br/>\nhighly recommend you read this page <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching/\">http://sandradodd.com/teaching/</a> on<br/>\nSandra Dodd&#39;s website.  One of the big things that helped me with<br/>\ndeschooling was getting past the notion of teaching.<br/>\n<br/>\nThat&#39;s the long answer to your question.<br/>\n<br/>\nThe short answer is, you haven&#39;t even begun deschooling (let alone<br/>\nunschooling) if you&#39;re still holding onto a curriculum.  You can&#39;t begin to<br/>\nswim unless you let go of, and move away from, the side of the pool.  You<br/>\nprobably will not see any of these connections until you are deeply<br/>\ncommitted to unschooling and have moved through the deschooling process.<br/>\n<br/>\nTina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Mar 2, 2011 at 8:24 PM, odiniella &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hgaimari@...\">hgaimari@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; In our home, these &quot;conversations&quot; would last about 40 seconds and would<br/>\n&gt; consist of one child asking me or their dad and both listening to the<br/>\n&gt; answer then moving on. How do your kids learn to answer questions for<br/>\n&gt; themselves and develop this kind of open-ended exploration?<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"beginning unschooling later in childhood","postDate":"1299115451","msgId":46279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrbXFqcitkMGk1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46280,"prevInTime":46278,"nextInTime":46280,"topicId":46279,"numMessagesInTopic":0,"msgSnippet":"One of the Sandra Dodd links about strewing brought me to this quote: The Simpsons bit (spoofing) the Bill on Capital Hill (flag burners have too much freedom)","messageBody":"<div id=\"ygrps-yiv-938435668\">One of the Sandra Dodd links about strewing brought me to this quote:<br/>\nThe Simpsons bit (spoofing) the Bill on Capital Hill (flag burners have<br/>\ntoo much freedom) led to the still ongoing discussions of flag burning<br/>\nas freedom of speech, which led to discussions on political protest<br/>\nwhich led to the ever popular discussions on civil disobedience, which<br/>\nled to the reading of &quot;Civil Disobedience&quot; by Thoreau, which led to<br/>\n&quot;Walden.&quot;(<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/simpsons\">http://sandradodd.com/strew/simpsons</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/simpsons\">http://sandradodd.com/strew/simpsons</a>&gt; )<br/>\nIn our home, these &quot;conversations&quot; would last about 40 seconds and would<br/>\nconsist of one child asking me or their dad and both listening to the<br/>\nanswer then moving on.  How do your kids learn to answer questions for<br/>\nthemselves and develop this kind of open-ended exploration?   My<br/>\ndaughter is 13, my son is 11 and I wonder if I missed the window of<br/>\nopportunity to teach them this kind of skill.<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":7231,"nextTopicId":46286}}