{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225633194","msgId":36932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDgxMTAyMDUzOWwyYTk0MGM0OHVmOGZhYWNmNDUyZDFjNDEzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdlaGY2cStnN3NjQGVHcm91cHMuY29tPg==","referencesHeader":"PGdlY2t2aCtlcTlxQGVHcm91cHMuY29tPiA8Z2VoZjZxK2c3c2NAZUdyb3Vwcy5jb20+"},"prevInTopic":36909,"nextInTopic":0,"prevInTime":36931,"nextInTime":36933,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... I m excited about this! ... Thanks for the analogy. ... Yes, I understand.  I think this is where I was a few months ago and even somewhat recently, but in","messageBody":"<div id=\"ygrps-yiv-1979425179\">On Sat, Nov 1, 2008 at 7:40 AM, lyeping2008 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lyeping2008@...\">lyeping2008@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt; &quot;c3_2323&quot;<br/>\n&gt; &lt;craigiecarter@...&gt; wrote:<br/>\n&gt; I asked if he wanted to read one of the Magic Treehouse books<br/>\n&gt; together, and he said yes. I immediately stopped what I was doing<br/>\n&gt; (something I&#39;m not always good at), went over and sat with &gt; him to<br/>\n&gt; read. He grabs the remote and says &quot;you read, I&#39;ll watch&quot;.<br/>\n&gt;<br/>\n&gt; ----------------------------------------------------------<br/>\n&gt;<br/>\n&gt; As you progress forward into your unschooling, you&#39;ll find your son<br/>\n&gt; has a very different way of learning. Talk about uniqueness!! It is<br/>\n&gt; only thru unschooling will you see your child&#39;s uniqueness unfold and<br/>\n&gt; blossom, without any external intervention.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m excited about this!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Think of your child as a Flower. You wouldn&#39;t prod and probe a flower<br/>\n&gt; to blossom faster, will you? You won&#39;t tell the flower how to bloom<br/>\n&gt; and which petal to bloom first, will you?<br/>\n&gt;<br/>\n&gt; So think of your child as a Flower, who knows when and how and which<br/>\n&gt; petal to bloom.<br/>\n&gt;<br/>\n&gt; Think of all his tv watching as the many petals unfolding. Think of<br/>\n&gt; all the things he&#39;s doing, things you like, things you don&#39;t like, as<br/>\n&gt; his many petals unfolding.<br/>\n&gt;<br/>\n&gt; You wouldn&#39;t tell the flower &quot;Ohh, you&#39;re blooming on one side frst,<br/>\n&gt; you should have unfurled sysmentrically on all sides. You&#39;re doing it<br/>\n&gt; wrong? I dn&#39;t like this flower. It looks funny&quot;<br/>\n&gt;<br/>\n&gt; No you won&#39;t. You will wait for it to fully bloom because you trust<br/>\n&gt; that it will eventually bloomed into a beautiful flower.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks for the analogy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; So think of your son as a Flower.<br/>\n&gt;<br/>\n&gt; My son is the type that will be doing 2 or 3 different thing at the<br/>\n&gt; same time, like listen to his cartoon show on the tv, build some Lego<br/>\n&gt; and play with his DS at the same time. He does the most wierdest thing<br/>\n&gt; ever, but it is HIS way of making sense and learning all the time.<br/>\n&gt;<br/>\n&gt; He does his pocket money talk and &quot;window shopping&quot; in his head with<br/>\n&gt; me while swinging himself on his Dad&#39;s exercise machine, counting<br/>\n&gt; money but yet eyes on tv AND on the calorie counter on the machine<br/>\n&gt; LOL!<br/>\n&gt;<br/>\n&gt; He turns over in bed during bedtime, listening to me reading him his<br/>\n&gt; stories. It doesn&#39;t mean he is not listening, he is just focusing on<br/>\n&gt; something else while listening. And yes, I have read to him while he<br/>\n&gt; played his Lego Star War on his ps2.<br/>\n&gt;<br/>\n&gt; In order for me to stand back and not interfere with my child&#39;s<br/>\n&gt; blossoming, I had to have the patience and trust to stand back and<br/>\n&gt; wait and observe.<br/>\n&gt;<br/>\n&gt; In the beginning, I can&#39;t, it&#39;s so hard. Every minute of my existance,<br/>\n&gt; I have to stop and examine what I am doing consiously, trying to stay<br/>\n&gt; in spirit of unschooling but yet I&#39;m not feeling that calm and<br/>\n&gt; happiness that comes with it. I&#39;m getting more and more frustrated<br/>\n&gt; with my self. This in turn, spill into fire of resentment, and inturn<br/>\n&gt; nearly burnt my flower.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, I understand.  I think this is where I was a few months ago and even<br/>\nsomewhat recently, but in the past few days, I&#39;m feeling more calm and a lot<br/>\nof that is hearing about your experiences and knowledge.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; So I had to stand back, and keep calm before I singe my flower.<br/>\n&gt;<br/>\n&gt; So I told myself, this is too tiring and hard work. I can&#39;t keep<br/>\n&gt; pretending I&#39;m doing ok because I&#39;m not. Maybe because I haven&#39;t<br/>\n&gt; understood this unschooling enough. But I am not giving up. I just had<br/>\n&gt; to figure out a better way so I&#39;m continue reading and learning.<br/>\n&gt;<br/>\n&gt; So I&#39;m thinking maybe, DS can continue to occupy himself with whatever<br/>\n&gt; he wants while mummy focus on learning more about unschooling first.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Good idea, thanks!  Silly as it sounds, I need to give myself permission to<br/>\nbe where I&#39;m at.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; So yes, an Eureka moment- that&#39;s what I&#39;ll do. I&#39;ll learn all I can<br/>\n&gt; about unschooling first, in the first year, before I include DS into<br/>\n&gt; it.<br/>\n&gt;<br/>\n&gt; So I took one year sabbatical from being a &quot;do everything right mum&quot;,<br/>\n&gt; reading and being with DS, playing and doing whatever he wants and<br/>\n&gt; surprise surprise, my son continuied to bloom and blossom in all<br/>\n&gt; directions, without me doing anything.<br/>\n&gt;<br/>\n&gt; When I finally finished exhauting my quench for more info, me and DS<br/>\n&gt; was already living unschooling successfully at month 16, painlessly,<br/>\n&gt; sub-consciously.<br/>\n&gt;<br/>\n&gt; So our secret in our success in unschooling really started with me<br/>\n&gt; UNSCHOOLING myself first!!LOL!!<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I know this is huge.  Tammy Takahashi (sp?) who wrote Deschooling Gently,<br/>\ntalks about the great benefits she received when her dh got a job across the<br/>\ncountry so she unenrolled in many of her grad classes and focused on the<br/>\nones she enjoyed.  She was no longer a slave to her schedule.  So, with<br/>\ntrepidation, I look to let go.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Letting go is the most important part of my unschooling. And I did it<br/>\n&gt; my way, by distracting myself away from needing to do everything<br/>\n&gt; right. But it ws because of my &quot;need to do everything right&quot; that got<br/>\n&gt; me on a different track, away from focusing strongly on DS. Instead, I<br/>\n&gt; was living parellel with my son.<br/>\n&gt;<br/>\n&gt; I was doing my &quot;learning&quot;, and he was doing his playing and tvs and<br/>\n&gt; ps2. Which is why we can constantly be found sitting side by side<br/>\n&gt; each other on the sofa. In the library, him on the computer playing<br/>\n&gt; online games, me looking for more books. We were doing alot of things<br/>\n&gt; together happily.<br/>\n&gt;<br/>\n&gt; There were days I got fed-up of reading, so I suggest we go out<br/>\n&gt; somewhere for a change of scenery- visit friends, playing in the park.<br/>\n&gt; And idea gladly welcomed because I&#39;ll was truly enjoying this break,<br/>\n&gt; just as much as him.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks so much for sharing your experience.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; As for Hubby, I told him truthfully that I&#39;m still reading up on it,<br/>\n&gt; but to be quite frank, I have no clue what we&#39;re doing. I told him<br/>\n&gt;<br/>\n&gt; &quot; All I know is that unschooling couldn&#39;t possibly do anymore harm<br/>\n&gt; than school did to our son&quot;.<br/>\n&gt;<br/>\n&gt; &quot;So, while I am doing my unschooling studies, DS will be doing alot of<br/>\n&gt; playing&quot; I told hubby.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks.  I took a lot away from what manyof you suggested.  Yesterday, I<br/>\nalso got together with a friend who has been having some marriage<br/>\ndifficulties.  It put so much into perspective.  I came home, gave him a big<br/>\nlong hug and we reconnected.  I had already shared that many of you<br/>\nexpressed empathy for him (which I shared as well, but it gave me a<br/>\nconversation starter, lol), and I reminded him that he always knew I was<br/>\n&quot;different&quot;, lol, but that I know this has all been a change for him, all of<br/>\nus really.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &quot;Someone on the list gave me a very good piece of advice - take it 1<br/>\n&gt; year at the time, and at the end of the year, re-assess what you&#39;ve<br/>\n&gt; done and only then decide if you wanna continue or stop&quot;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I really like this.  I guess that&#39;s what I need to alleviate the panic of<br/>\n&quot;what if this isn&#39;t working for him and I don&#39;t see it?&quot;, yk?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; And so the 1 year mark was our personal target. This was also a sign<br/>\n&gt; of my hubby&#39;s commitment to help with this unschooling business.<br/>\n&gt;<br/>\n&gt; We talk alot about unschooling. I know he hasn&#39;t got the time to learn<br/>\n&gt; and understand and read about unschooling. He also hasn&#39;t got the<br/>\n&gt; luxury to stay at home and see all the little Eurekas that son has<br/>\n&gt; shown me.<br/>\n&gt;<br/>\n&gt; I needed him to be involve, to be a partner of this and not sidelined,<br/>\n&gt; thinking it is my duty since I&#39;m the one staying at home and the<br/>\n&gt; mother.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thank you for saying this.  Truly.  A lot of people seem to have the<br/>\nattitude that it doesn&#39;t matter what he thinks.  Which, quite frankly, is a<br/>\nbig part of the problem between us.  He doesn&#39;t articulate well, but I&#39;ve<br/>\ngathered that he feels this way too.  So, I just keep assuring him that it<br/>\ndoes matter, I am listening, but I am also listening to our son and trying<br/>\nto do what is best for him.  I keep driving that point home.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I got hubby involved in a sort of sneaky way but truly, my eyes were<br/>\n&gt; hurting from too much reading off the laptop, so I asked if he could<br/>\n&gt; be kind enough to print out the unschooling stuff that I&#39;ve emailed to<br/>\n&gt; him. I&#39;ve have snuck in stuffs that I need him to &quot;glance thu&quot; like<br/>\n&gt; deschooling and tv stuffs LOL!<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I read him snippets from the book.  I also make sure he knows when Josh<br/>\ncomes up with 9 times 3 is 27, which he learned on Ruff Ruffman.  My husband<br/>\nhas started to recognize how much information he gains from the shows he<br/>\nwatches.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; This way gave my hubby a glimpse of hwat everyone is doing unschooling<br/>\n&gt; wise, and also confidence that I am DOING/ working towards something.<br/>\n&gt;<br/>\n&gt; But I had many opportunity along the way to point out all those<br/>\n&gt; fantastic and interesting things that DS did to hubby. It wasn&#39;t<br/>\n&gt; difficult becuase everything DS did, without any of my intervention or<br/>\n&gt; instigation, is surprising and amazing enough to catch our attention.<br/>\n&gt;<br/>\n&gt; And I&#39;m not talking about doing maths or science experiments or any<br/>\n&gt; other scholarly feats.<br/>\n&gt;<br/>\n&gt; I&#39;m talking about my child repeating what he saw on tv to hubby.<br/>\n&gt;<br/>\n&gt; My child is talking non stop. He is a walking encyclopedia.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, Josh frequently comes out with things and we look at him and say &quot;how<br/>\ndo  you know that?&quot;.  Yesterday, he explained to me how the street sweeper<br/>\nworks.  He said he figured it out from watching it.  I dont&#39; know for sure,<br/>\nbut he sure sounds like he understands how it works.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt;His understanding that him mummy and daddy each had very different tv<br/>\n&gt; shows that we like, and he&#39;s happy to watch it all too. He sets tv<br/>\n&gt; reminders for us all.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>This is what I mean, stand back, and watching your child unfold his<br/>\ntrueself to you.<br/>\n<br/>\nToday, my hubby is a true believer of unschooling. He will talk<br/>\nconfidently to anyone about unschooling and our child&#39;s amazing self.<br/>\nA big change for someone who believed &quot;rules are rules, and need to be<br/>\nfollowed&quot; LOL!!&gt;&gt;<br/>\n<br/>\nMaybe my dh will get there too.  He became quite the homebirth proponent<br/>\nafter we had our  youngest at home.  A couple of years before, he had said<br/>\n&quot;you can have a homebirth and I&#39;ll go to the hospital&quot;.  If you ask him, he<br/>\nwould just say he would pefere the status quo.<br/>\n<br/>\n&lt;&lt;After 23 months of unschooling, I still get hick-ups here and there<br/>\noccasionally. But I understood the problem lies in me, and not my<br/>\nchild. And it normally starts when I start &quot;expecting something&quot; LOL! &gt;&gt;<br/>\n<br/>\nYes, I will have challenges about expectations.  They are pretty deeply<br/>\ningrained that even though I recognize the fallacy, I find myself expecting<br/>\n(really wishing).  But if I have fewer expectations of myself, that &quot;should&quot;<br/>\nhelp.<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nVery much, Thanks!!!<br/>\n<br/>\n<br/>\nChristie<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225553229","msgId":36909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDgxMTAxMDgyN2g3MzM2MzAyZnliMTJmOTg2MGE2NjY5MDBlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDkwNDU2MC4xODQ4My5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDkwNDU2MC4xODQ4My5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":36908,"nextInTopic":36932,"prevInTime":36908,"nextInTime":36910,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"On Sat, Nov 1, 2008 at 1:47 AM, BRIAN POLIKOWSKY ","messageBody":"<div id=\"ygrps-yiv-403114025\">On Sat, Nov 1, 2008 at 1:47 AM, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt;   As it was for all of us here :-) Just because you&#39;re not receiving<br/>\n&gt; &gt; &quot;Oh, wow, yeah, that was hard,&quot; responses, doesn&#39;t mean we haven&#39;t<br/>\n&gt; &gt; been through the experience and understand. It doesn&#39;t mean it wasn&#39;t<br/>\n&gt; &gt; a struggle for some of of the people here.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; May I ask what the hesistance to such responses might be?<br/>\n&gt;<br/>\n&gt; -=-=-=-=-=-=-=-=-=-=<br/>\n&gt;<br/>\n&gt; The people in this list are busy. They have full lives, some multiple kids,<br/>\n&gt; others full time jobs and most lots of commitments.<br/>\n&gt; There is no time to it for some. Foir others is just not their style.<br/>\n&gt; I don;t have time honestly. I have little kids and I never stop ( check<br/>\n&gt; what time I wrote this post!&lt;BWG&gt;)<br/>\n&gt; Speaking for myself I just write in a direct way.<br/>\n&gt; I assume that people asking questions want to change and want straight<br/>\n&gt; answers.<br/>\n&gt; I am not a a trained therapist.<br/>\n&gt; Our kids are growing fast.<br/>\n&gt; Many here take time away form their life to write and help others.<br/>\n&gt; I honestly find it somewhat rude that people sometimes come to the list and<br/>\n&gt; want to tell others how they should write.,<br/>\n&gt; These are people that are not getting payed to help anyone.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m honestly not sure how to respond.  Of course everyone is busy.  I assume<br/>\nthat people who don&#39;t have time to respond, won&#39;t.  You all may remember<br/>\nthat it took me a good 2 weeks to respond to the group replies to my intro.<br/>\nAnd sometimes, I might not get to responding.<br/>\n<br/>\nAs for being rude, that is never my intent.  Nor would I ever tell people<br/>\nwhat to write.  I was offering feedback on how I learn best, and what I&#39;ve<br/>\nobserved over my years of participating in yahoo groups of all types (ICAN,<br/>\nCeliac and foodallergy groups, sexual abuse groups, and birth trauma groups<br/>\netc.)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; They do it for free and willing.  No one has to take the advice. They<br/>\n&gt; can choose to not read the posts from people that write in a style they<br/>\n&gt; don&#39;t like.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, I do this all the time.  I&#39;ve learned over the years that some people&#39;s<br/>\nreplies just aren&#39;t worth the rise in my bp ;-) even though I felt rude not<br/>\nreading what they wrote.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When I come here with questions I want to be challenged. I want to get my<br/>\n&gt; butt kicked and I want to change NOW.<br/>\n&gt; Some one telling me how great I am doing, or patting me on the back is not<br/>\n&gt; going to help me get very far.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>If it helps, I had the same responses to one of my food allergy groups.  B/c<br/>\nthey feel like a child&#39;s health is at stake, they tend not to be very<br/>\nempathic.  I go there for the reality check, but also for a reminder that<br/>\nthere is another side of this frustration I&#39;m experiencing atm.  But I also<br/>\nsee the value of validation that it can be frustrating when you can&#39;t figure<br/>\nout what&#39;s going on.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I may move a few tenths of a mile .<br/>\n&gt; I want to move miles and miles.<br/>\n&gt; We all get it it is hard. We all struggle everyday. We all had a lot to<br/>\n&gt; change. The longer you do it and the more you are willing<br/>\n&gt; to challenge yourself the easier it get.<br/>\n&gt; It seems the OP is open to it&lt;G&gt;<br/>\n&gt; That is great.<br/>\n&gt; Be accepting that people will write they way they will write and not the<br/>\n&gt; way you want them to write.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Sure, I&#39;m very open.  I&#39;m scared but excited.  These conversations have<br/>\nhelped me to understand the approach of the group.<br/>\n<br/>\nThanks for your reply!<br/>\n<br/>\nChristie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225549679","msgId":36908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDgxMTAxMDcyN3c2MjAxM2Y5Y2gxMDE3YzIyMzhmM2NkZTFkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEI4QkE0MTUxLUUzMzEtNENCNS04OEQ5LTMyQ0Y5MEMzNTMzOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGdlY2NmOStxNGNjQGVHcm91cHMuY29tPgkgPDM4OURGMjlCLUZBQkYtNDY1OC1BQTM3LTIyQzM3MkQ1RUFBMUB2ZXJpem9uLm5ldD4JIDw5MjRjNGQwYTA4MTAzMTEzMzNyNGNkNGUwZTdvNzRiZTc2Nzc5MjA4MTE5QG1haWwuZ21haWwuY29tPgkgPEI4QkE0MTUxLUUzMzEtNENCNS04OEQ5LTMyQ0Y5MEMzNTMzOUB2ZXJpem9uLm5ldD4="},"prevInTopic":36895,"nextInTopic":36909,"prevInTime":36907,"nextInTime":36909,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... Thanks for giving me a bit of history.  It helps me to understand. ... Yes. ... Very helpful, thanks.  I really appreciate your willingness to help me ","messageBody":"<div id=\"ygrps-yiv-793103153\">On Fri, Oct 31, 2008 at 10:03 PM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Oct 31, 2008, at 4:33 PM, Christie Craigie-Carter wrote:<br/>\n&gt;<br/>\n&gt; &gt; May I ask what the hesistance to such responses might be? And<br/>\n&gt; &gt; please know<br/>\n&gt; &gt; these are genuine questions, not meant to be critical at all. Is<br/>\n&gt; &gt; it a fear<br/>\n&gt; &gt; that by validating what may be challening would inadvertantly<br/>\n&gt; &gt; encourage<br/>\n&gt; &gt; people not to ask the hard questions that might allow them to change?<br/>\n&gt;<br/>\n&gt; &lt;&lt;&lt;&lt;&lt;Ah. I think part of confusion is &quot;don&#39;t expect empathy here&quot; sounds<br/>\n&gt; like the owners or regular posters got together and agreed not to<br/>\n&gt; write empathetically.<br/>\n&gt;<br/>\n&gt; That&#39;s not what happened. No decisions actual were made ;-) But years<br/>\n&gt; ago a core of posters who naturally write straight forward without<br/>\n&gt; the empathy drew readers who liked that style. And the readers stuck<br/>\n&gt; around, continuing to read and then write the way they liked to read.&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks for giving me a bit of history.  It helps me to understand.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt;&lt;&lt;So, it&#39;s not that regular writers are reluctant to offer empathy.<br/>\n&gt; It&#39;s that this is a self-selected group that are drawn to an<br/>\n&gt; atmosphere where they don&#39;t expect or need empathy.&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Okay.<br/>\n&gt;<br/>\n<br/>\n&gt;<br/>\n&gt; &lt;&lt;And then people who do need empathy wander into a vibrant group that<br/>\n&gt; looks like what they need and end up wondering why there&#39;s no empathy.&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; True, but I can&#39;t change where I am with the snap of my fingers.<br/>\n<br/>\n </span></blockquote>&lt;&lt;&lt;&lt;&lt;No one would expect instant change. It&#39;s a constant process. I&#39;ve<br/>\n<blockquote><span title=\"ireply\"> &gt; been unschooling for 13 years and there are still thoughts that trip<br/>\n&gt; me up occasionally. ;-)&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Very helpful, thanks.  I really appreciate your willingness to help me<br/>\nunderstand and to do some &quot;hand-holding&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt;&lt;&lt;I suspect the regular posters see change is not just an ongoing<br/>\n&gt; process but is best when it&#39;s an active process. And helping people<br/>\n&gt; to keep on moving forward is what they help with.&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Absolutely, change is an ongoing, active process.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; A goal of<br/>\n&gt; &gt; me posting is to hear from others if they had felt this way<br/>\n&gt;<br/>\n&gt; &lt;&lt;&lt;Don&#39;t hold your breath! ;-)&gt;&gt;<br/>\n&gt;<br/>\n&gt; &gt; and what helped<br/>\n&gt; &gt; them, which some people did and I appreciate very much.<br/>\n&gt;<br/>\n&gt; &lt;&lt;I&#39;m glad you got some of what you needed.&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, I have, thanks.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt;Direct questions do work best on this kind of list, though! :-)<br/>\n&gt; Expectations that a conversation will unfold according to certain<br/>\n&gt; social rules like &quot;Oh, I&#39;m sorry. Here&#39;s what I did,&quot; tend to lead to<br/>\n&gt; disappointment. Being direct about requests works lots better!&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ll keep this in mind.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of course, at the end of the day, irregardless of my<br/>\n&gt; husband&#39;s concerns or school district issues, I worry that this<br/>\n&gt; isn&#39;t the<br/>\n&gt; best decision for him, that *my* decision to unschool will<br/>\n&gt; inadvertently not<br/>\n&gt; take care of his needs.<br/>\n<br/>\n </span></blockquote>&lt;&lt;&lt;&lt;How do you know that what you want to do will take care of his needs?<br/>\n<br/>\nHow do parents know that school will take care of their children&#39;s<br/>\nneeds?<br/>\n<br/>\nWe tend to assume that everyone is going along because the thing<br/>\nthey&#39;re doing works. But in the case of school or conventional<br/>\nparenting they&#39;re just trusting that it works. They&#39;ve seen kids come<br/>\nout of school and go to college and get jobs. (And they assume the<br/>\nkids who fail are to blame, not the process since it works for others.)<br/>\n<br/>\nHow many adults do you know who are profoundly happy? Who don&#39;t feel<br/>\ntrapped by what they spent all that money to acquire (the particular<br/>\ndegree they have). How many adults do you know who jumped through all<br/>\nthe hoops to get to the &quot;American Dream&quot; but have no idea who they<br/>\nreally are? They don&#39;t know what they enjoy so they end up just going<br/>\nalong. As they&#39;ve done since they entered school.<br/>\n<br/>\nWhat needs have been taken care of? And which haven&#39;t?&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nThanks so much for those questions!!!!  They are so incredibly helpful to my<br/>\nprocess.  You&#39;re absolutely right--his needs weren&#39;t being met in school,<br/>\nthey weren&#39;t being met by traditional &quot;school at home&quot; and they aren&#39;t being<br/>\nmet by the way we have been relating to him.  As a funny aside, we are<br/>\ncurrently watching Fetch with Ruff Ruffman (a PBS show) and I&#39;m typing away<br/>\nto you all.  Funny how I thought it was perfectly okay to be &quot;present&quot; with<br/>\nhim in this way, but it was too distracting for him to play with something<br/>\nwhile I read.  Hmm.  So much food for thought.<br/>\n<br/>\n&lt;&lt;&lt;Unschooling is different. We aren&#39;t trusting that it will lead a<br/>\nchild to a specific place (like college). We know that treating a<br/>\nchild with respect (which means trusting their choices like TV ;-)<br/>\ncreates whole people.&gt;&gt;&gt;<br/>\n<br/>\nThanks again for sharing your perspective.  You&#39;ve given me so much to think<br/>\nabout.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, ime, acceptance of where a person finds themselves is an<br/>\n&gt; important<br/>\n&gt; step toward change.<br/>\n<br/>\n </span></blockquote>&lt;&lt;Depends on the person.<br/>\n<br/>\nSome people understand &quot;Wherever you go, there you are.&quot; And to move<br/>\ntoward unschooling, it&#39;s more useful to focus where they want to be<br/>\nrather than where they are.<br/>\n<br/>\nI suspect the people who need to hear &quot;You&#39;re okay,&quot; don&#39;t stick<br/>\naround lists like this long because the regular posters just aren&#39;t<br/>\nthe type who think to hand that kind of feedback out. I know I just<br/>\nassume it&#39;s understood that people are where they are. It&#39;s not part<br/>\nof my psyche to need validation for where I am so it doesn&#39;t occur to<br/>\nme to give it. What I want/need is help on getting where I want to<br/>\nbe. And it&#39;s where my brain is when I answer.&gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I find that a mixture of soothing words and validation of the<br/>\n&gt; messages that people hear every day is a starting point.<br/>\n<br/>\n </span></blockquote>&lt;&lt;And if you stick around long enough to get unschooling in a way that<br/>\nyou can explain it to others, then that might be part of your natural<br/>\nstyle of explaining. :-)&gt;&gt;<br/>\n<br/>\nFor sure.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes we only<br/>\n&gt; have a short period of time (i.e. woman is &quot;due&quot; in a short time),<br/>\n&gt; and then<br/>\n&gt; responses tend to be more pointed with less of the empathic<br/>\n&gt; responses b/c<br/>\n&gt; it&#39;s decision making time.<br/>\n<br/>\n </span></blockquote>&lt;&lt;I think where a lot of the regular posters&#39; heads are at is seeing<br/>\nkids in the house as the same as being &quot;due&quot;. Kids don&#39;t have years<br/>\nfor a parent to figure this out. While 38 might not be hugely<br/>\ndifferent from 36 or 41, for a child, that span of years might be<br/>\ntheir whole life if they&#39;re 5. An unschooling practice that a parent<br/>\nis waiting to &quot;get&quot; has been absent from the child&#39;s whole life. And<br/>\nif another 5 years goes by? And other? They&#39;re practically grown.<br/>\n<br/>\nIs that the only way to see things? No. (Though I think the kids<br/>\nwould lean towards the viewpoint of the regular posters ;-) But it is<br/>\nthe kind of help this kind of list gives just because that&#39;s the kind<br/>\nof people who&#39;ve hung around.&gt;&gt;<br/>\n<br/>\nThis intrigues me so much.  I sometimes feel like I&#39;m on a rollercoaster. My<br/>\nvisceral response to the first paragraph above was that pit in the stomach<br/>\nfeeling, that somehow I&#39;m damaging my kids by not learning fast enough.  I<br/>\nliterally have to fight the voices of the majority in my head, which of<br/>\ncourse say that they won&#39;t have the advantages of unschooling in &quot;the real<br/>\nworld&quot;.  Even though I&#39;m always countering with the general concept that<br/>\njust b/c &quot;the real world&quot; won&#39;t be like our family necessarily, doesn&#39;t mean<br/>\nI can&#39;t give them what I&#39;m capable of now.  If you knew the stories of my<br/>\nfamily of origin....oh my.  So, I&#39;m constantly filtering incoming<br/>\ninformation through different sieves, if you will.<br/>\n<br/>\nFor now, I&#39;m working on the &quot;fake it til you make it&quot; piece.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I don&#39;t necessarily think that by changing one&#39;s<br/>\n&gt; view, that emotions are resolved in the process.<br/>\n<br/>\n </span></blockquote>&lt;&lt;&lt;&lt;&lt;&lt;Not immediately. And the shift is something that consciously needs<br/>\nworked at for quite some time. But the more thoughts are pulled up<br/>\nout of familiar ruts, the easier it gets to keep them out of the ruts.<br/>\n<br/>\nFor example, it&#39;s very easy to fall into the rut of reacting with<br/>\nanger at kids for making deliberate messes, like dumping the whole<br/>\ntub of Legos out, for instance. If you&#39;ve got a child who&#39;s a dumper,<br/>\nreacting to his natural inclination with anger, even suppressed anger<br/>\nthat you take somewhere else, is going to have negative effects on<br/>\nthe relationship. Can you just turn that anger off? No, of course<br/>\nnot. But a parent doesn&#39;t need to be a slave to it, either. And if<br/>\nsomeone had that problem, they could ask here, ask what other parents<br/>\ndid about angers flared by irritation. People might come back with a<br/>\nslew of ideas that are wide ranging to tackle it from several<br/>\ndirection: do your own dumping and revel in it :-), find smaller<br/>\nbins, put down a drop cloth and help the child remember to dump<br/>\nthere, smell their hair to remind you how sweet they are :-) and so<br/>\non and so on.<br/>\n<br/>\nIt helps a lot to see the anger as something you [general &quot;you&quot;]<br/>\ndon&#39;t want. To not see it as something that you just have to put up<br/>\nwith because that&#39;s who you are.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nVery, very helpful.  Thanks so much!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My oldest tends to try to get involved in everything, which<br/>\n&gt; upsets the other two, and gets very offended if I ask him to remove<br/>\n&gt; himself<br/>\n&gt; from the situation, no matter how much I thank him for his intent.<br/>\n<br/>\n </span></blockquote>&lt;&lt;You might try giving a few typical scenarios. (Preferably in a<br/>\nseparate thread just so it gets its own attention.)&gt;&gt;<br/>\n<br/>\n<br/>\nI will, thanks!!!<br/>\n<br/>\n&lt;&lt;You might try calling him away to do something rather than telling<br/>\nhim to remove himself. If you were trying to get everyone moving in<br/>\nthe direction you thought best and your husband stepped in and told<br/>\nyou to remove yourself, wouldn&#39;t you feel miffed?&gt;&gt;<br/>\n<br/>\nYes, come to think of it, when I have done this, it has worked much better.<br/>\nThis may sound funny, and not sure I can articulate it well, but I guess<br/>\nI&#39;ve believed in being totally honest, and this has felt a bit manipulative<br/>\nwhen I do this.  To give another example, I&#39;m honest almost to a fault.  I<br/>\ncan&#39;t remember the exact example, but he had asked me once if something<br/>\ncould happen.  The typical response is to reassure your child that all will<br/>\nbe okay.  That didn&#39;t feel totally honest, so I admitted that there could be<br/>\nexceptions.  My dh thought that was waay over the top.  Did I mention I am<br/>\nliteral and a need to know person ;-)?  But, no, I think those are great<br/>\nideas.  Sometimes I definitely get in the way of myself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He alsogets his feelings hurt very easily which I&#39;m not sure how to<br/>\n&gt; handle. I try<br/>\n&gt; to be as gentle as possible, but it doesn&#39;t seem to matter.<br/>\n<br/>\n </span></blockquote>&lt;&lt;Empathy? Does he maybe feel like you&#39;re trying to fix him? Does he<br/>\nfeel wrong? It&#39;s hard to suggest without specific examples.&gt;&gt;<br/>\n<br/>\nI&#39;ll try to come up with specific examples, but yes, I think he feels<br/>\n&quot;wrong&quot; most of the time.  And I feel stuck when there are things that need<br/>\nto be re-directed (like him scaring the dog, or slamming the door with his<br/>\nbrother right there).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m quite frankly exhausted trying to research this and that,<br/>\n&gt; figure out if<br/>\n&gt; this or that is a symptom of another allergy, finding suitable<br/>\n&gt; meals and<br/>\n&gt; snacks, etc.<br/>\n<br/>\n </span></blockquote>&lt;&lt;&lt;&lt;&lt;&lt;What if it&#39;s just who they are?<br/>\n<br/>\nIt might be allergies but it would do them more good to help them<br/>\nfind coping skills rather than seeing some unknown ailment. They are<br/>\nwho they are in the moment, whether it&#39;s caused by genetics or food<br/>\nchemicals. If they&#39;re having problems relating to each other, they<br/>\nneed help now, not more research. I&#39;m sure you are helping, but if<br/>\nyour head is in the &quot;I need to find the allergen that&#39;s causing this&quot;<br/>\nmode, then you&#39;re not as present with them and what they&#39;re feeling<br/>\nright now as you could be. What if you never do find out? And they&#39;re<br/>\nstill having problems at 15? It will serve their future selves a lot<br/>\nbetter to help them find ways to cope with what they&#39;re feeling now,<br/>\nthan to tackle it full on when they&#39;re older and you&#39;re convinced you<br/>\ncan&#39;t figure out what they&#39;re allergic to.<br/>\n<br/>\nThat doesn&#39;t mean stop researching. It means put most of your<br/>\nenergies into helping them cope in the situations they have today. If<br/>\nyou give some examples, some people might be able to help.&gt;&gt;&gt;<br/>\n<br/>\nOh, fwiw, when it comes to behavioral manifestations of allergies, I&#39;ve<br/>\npretty much tabled that for another time.  I focus on the immediate concerns<br/>\nwhich are whether the foods they are eating are damaging their bodies.  My<br/>\nyoungest has symptoms of food allergies which could become life-threatening,<br/>\nand I feel it is very important to figure those out.  I do at times wonder<br/>\nif my oldest might react to corn and dyes, etc, but for now, I&#39;ve chosen to<br/>\naccept him as he is and not try to change it.   So, I do try to find a<br/>\nbalance too and keep it in perspective.<br/>\n<br/>\nAgain, I will try to come up with examples.<br/>\n<br/>\n<br/>\nThank you, thank you, thank you!!!!<br/>\n<br/>\nChristie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: My first week unschooling so far...","postDate":"1225539610","msgId":36895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlaGY2cStnN3NjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlY2t2aCtlcTlxQGVHcm91cHMuY29tPg=="},"prevInTopic":36892,"nextInTopic":36908,"prevInTime":36894,"nextInTime":36896,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"...  wrote: I asked if he wanted to read one of the Magic Treehouse books together, and he said yes. I immediately stopped what I was doing ","messageBody":"<div id=\"ygrps-yiv-1956901686\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;c3_2323&quot;<br/>\n&lt;craigiecarter@...&gt; wrote:<br/>\nI asked if he wanted to read one of the Magic Treehouse books <br/>\ntogether, and he said yes. I immediately stopped what I was doing <br/>\n(something I&#39;m not always good at), went over and sat with &gt; him to <br/>\nread. He grabs the remote and says &quot;you read, I&#39;ll watch&quot;.<br/>\n<br/>\n-----------------------------------------------------------------------<br/>\n<br/>\nAs you progress forward into your unschooling, you&#39;ll find your son <br/>\nhas a very different way of learning. Talk about uniqueness!! It is <br/>\nonly thru unschooling will you see your child&#39;s uniqueness unfold and <br/>\nblossom, without any external intervention.  <br/>\n<br/>\nThink of your child as a Flower. You wouldn&#39;t prod and probe a flower <br/>\nto blossom faster, will you? You won&#39;t tell the flower how to bloom <br/>\nand which petal to bloom first, will you? <br/>\n<br/>\nSo think of your child as a Flower, who knows when and how and which <br/>\npetal to bloom. <br/>\n<br/>\nThink of all his tv watching as the many petals unfolding. Think of <br/>\nall the things he&#39;s doing, things you like, things you don&#39;t like, as <br/>\nhis many petals unfolding. <br/>\n<br/>\nYou wouldn&#39;t tell the flower &quot;Ohh, you&#39;re blooming on one side frst, <br/>\nyou should have unfurled sysmentrically on all sides. You&#39;re doing it <br/>\nwrong? I dn&#39;t like this flower. It looks funny&quot;<br/>\n<br/>\nNo you won&#39;t. You will wait for it to fully bloom because you trust <br/>\nthat it will eventually bloomed into a beautiful flower. <br/>\n<br/>\nSo think of your son as a Flower. <br/>\n<br/>\n<br/>\nMy son is the type that will be doing 2 or 3 different thing at the <br/>\nsame time, like listen to his cartoon show on the tv, build some Lego <br/>\nand play with his DS at the same time. He does the most wierdest thing <br/>\never, but it is HIS way of making sense and learning all the time.  <br/>\n<br/>\nHe does his pocket money talk and &quot;window shopping&quot; in his head with <br/>\nme while swinging himself on his Dad&#39;s exercise machine, counting <br/>\nmoney but yet eyes on tv AND on the calorie counter on the machine <br/>\nLOL! <br/>\n<br/>\nHe turns over in bed during bedtime, listening to me reading him his <br/>\nstories. It doesn&#39;t mean he is not listening, he is just focusing on <br/>\nsomething else while listening. And yes, I have read to him while he <br/>\nplayed his Lego Star War on his ps2.  <br/>\n<br/>\n<br/>\n<br/>\nIn order for me to stand back and not interfere with my child&#39;s <br/>\nblossoming, I had to have the patience and trust to stand back and <br/>\nwait and observe. <br/>\n<br/>\nIn the beginning, I can&#39;t, it&#39;s so hard. Every minute of my existance, <br/>\nI have to stop and examine what I am doing consiously, trying to stay <br/>\nin spirit of unschooling but yet I&#39;m not feeling that calm and <br/>\nhappiness that comes with it. I&#39;m getting more and more frustrated <br/>\nwith my self. This in turn, spill into fire of resentment, and inturn <br/>\nnearly burnt my flower. <br/>\n<br/>\nSo I had to stand back, and keep calm before I singe my flower.  <br/>\n<br/>\nSo I told myself, this is too tiring and hard work. I can&#39;t keep <br/>\npretending I&#39;m doing ok because I&#39;m not. Maybe because I haven&#39;t <br/>\nunderstood this unschooling enough. But I am not giving up. I just had <br/>\nto figure out a better way so I&#39;m continue reading and learning. <br/>\n<br/>\nSo I&#39;m thinking maybe, DS can continue to occupy himself with whatever <br/>\nhe wants while mummy focus on learning more about unschooling first. <br/>\n<br/>\nSo yes, an Eureka moment- that&#39;s what I&#39;ll do. I&#39;ll learn all I can <br/>\nabout unschooling first, in the first year, before I include DS into <br/>\nit. <br/>\n<br/>\nSo I took one year sabbatical from being a &quot;do everything right mum&quot;,  <br/>\nreading and being with DS, playing and doing whatever he wants and <br/>\nsurprise surprise, my son continuied to bloom and blossom in all <br/>\ndirections, without me doing anything. <br/>\n<br/>\nWhen I finally finished exhauting my quench for more info, me and DS <br/>\nwas already living unschooling successfully at month 16, painlessly, <br/>\nsub-consciously.   <br/>\n<br/>\nSo our secret in our success in unschooling really started with me <br/>\nUNSCHOOLING myself first!!LOL!!<br/>\n<br/>\n<br/>\n<br/>\nLetting go is the most important part of my unschooling. And I did it <br/>\nmy way, by distracting myself away from needing to do everything <br/>\nright. But it ws because of my &quot;need to do everything right&quot; that got <br/>\nme on a different track, away from focusing strongly on DS. Instead, I <br/>\nwas living parellel with my son. <br/>\n<br/>\nI was doing my &quot;learning&quot;, and he was doing his playing and tvs and <br/>\nps2.  Which is why we can constantly be found sitting side by side <br/>\neach other on the sofa. In the library, him on the computer playing <br/>\nonline games, me looking for more books.  We were doing alot of things <br/>\ntogether happily.  <br/>\n<br/>\nThere were days I got fed-up of reading, so I suggest we go out <br/>\nsomewhere for a change of scenery- visit friends, playing in the park. <br/>\nAnd idea gladly welcomed because I&#39;ll was truly enjoying this break, <br/>\njust as much as him. <br/>\n<br/>\n<br/>\n<br/>\nAs for Hubby, I told him truthfully that I&#39;m still reading up on it, <br/>\nbut to be quite frank, I have no clue what we&#39;re doing. I told him <br/>\n<br/>\n&quot; All I know is that unschooling couldn&#39;t possibly do anymore harm <br/>\nthan school did to our son&quot;. <br/>\n<br/>\n&quot;So, while I am doing my unschooling studies, DS will be doing alot of <br/>\nplaying&quot; I told hubby.<br/>\n<br/>\n&quot;Someone on the list gave me a very good piece of advice - take it 1 <br/>\nyear at the time, and at the end of the year, re-assess what you&#39;ve <br/>\ndone and only then decide if you wanna continue or stop&quot; <br/>\n<br/>\nAnd so the 1 year mark was our personal target. This was also a sign <br/>\nof my hubby&#39;s commitment to help with this unschooling business.    <br/>\n<br/>\nWe talk alot about unschooling. I know he hasn&#39;t got the time to learn <br/>\nand understand and read about unschooling. He also hasn&#39;t got the <br/>\nluxury to stay at home and see all the little Eurekas that son has <br/>\nshown me. <br/>\n<br/>\nI needed him to be involve, to be a partner of this and not sidelined, <br/>\nthinking it is my duty since I&#39;m the one staying at home and the <br/>\nmother.  <br/>\n<br/>\n<br/>\nI got hubby involved in a sort of sneaky way but truly, my eyes were <br/>\nhurting from too much reading off the laptop, so I asked if he could <br/>\nbe kind enough to print out the unschooling stuff that I&#39;ve emailed to <br/>\nhim. I&#39;ve have snuck in stuffs that I need him to &quot;glance thu&quot; like <br/>\ndeschooling and tv stuffs LOL! <br/>\n<br/>\nThis way gave my hubby a glimpse of hwat everyone is doing unschooling <br/>\nwise, and also confidence that I am DOING/ working towards something.  <br/>\n<br/>\nBut I had many opportunity along the way to point out all those <br/>\nfantastic and interesting things that DS did to hubby. It wasn&#39;t <br/>\ndifficult becuase everything DS did, without any of my intervention or <br/>\ninstigation, is surprising and amazing enough to catch our attention.  <br/>\n<br/>\nAnd I&#39;m not talking about doing maths or science experiments or any <br/>\nother scholarly feats. <br/>\n<br/>\nI&#39;m talking about my child repeating what he saw on tv to hubby. <br/>\n<br/>\nMy child is talking non stop. He is a walking encyclopedia. <br/>\n<br/>\nHe&#39;s constantly informing us about his understanding and discovery <br/>\nfrom comparison about time zone to the Lego building he made, to his <br/>\ncharacter on Grand Theft Auto rescuing other characters from being <br/>\nrob. <br/>\n<br/>\nMy child had many &quot;spider pets&quot; in our garden. He will find bugs or <br/>\ncaterpillars to feed each and every spider that can be found in our <br/>\ngarden. And about the bumble bees on our Lavender bush. <br/>\n<br/>\nHis understanding that him mummy and daddy each had very different tv <br/>\nshows that we like, and he&#39;s happy to watch it all too. He sets tv <br/>\nreminders for us all. <br/>\n <br/>\nHe&#39;s into burning stuff the past 2 months and is having lots of fun <br/>\ndoing it and informing us of all his discoveries.  <br/>\n<br/>\nThis is what I mean,  stand back, and watching your child unfold his <br/>\ntrueself to you. <br/>\n<br/>\n<br/>\n<br/>\nToday, my hubby is a true believer of unschooling. He will talk <br/>\nconfidently to anyone about unschooling and our child&#39;s amazing self.  <br/>\nA big change for someone who believed &quot;rules are rules, and need to be <br/>\nfollowed&quot; LOL!!<br/>\n<br/>\nAfter 23 months of unschooling, I still get hick-ups here and there <br/>\noccasionally. But I understood the problem lies in me, and not my <br/>\nchild. And it normally starts when I start &quot;expecting something&quot; LOL!  <br/>\n<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nBest Wishes,<br/>\nSharonBugs.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225518474","msgId":36892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwNDU2MC4xODQ4My5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":36890,"nextInTopic":36895,"prevInTime":36891,"nextInTime":36893,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"As it was for all of us here :-) Just because you re not receiving ... May I ask what the hesistance to such responses might be? -=-=-=-=-=-=-=-=-=-= ","messageBody":"<div id=\"ygrps-yiv-510534401\">As it was for all of us here :-) Just because you&#39;re not receiving<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Oh, wow, yeah, that was hard,&quot; responses, doesn&#39;t mean we haven&#39;t<br/>\n&gt; been through the experience and understand. It doesn&#39;t mean it wasn&#39;t<br/>\n&gt; a struggle for some of of the people here.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>May I ask what the hesistance to such responses might be?<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nThepeople in this list are busy. They have full lives,some multiple kids, others full time jobs and most lots of commitments.<br/>\nThere is no time to it for some. Foir others is just not their style.<br/>\nI don;t have time honestly. I have little kids and Inever stop ( check what time I wrote this post!&lt;BWG&gt;)<br/>\nSpeaking for myself I just write in a direct way.<br/>\nI assume that people asking questions want to change and want straight answers.<br/>\nI am not a a trained therapist.<br/>\nOur kids are growingfast.<br/>\nMany here take time away form their life towrite and help others.<br/>\nI honestly find it somewhat rude that people sometimes come to the list and want to tell others how they should write.,<br/>\nThese are people that are not getting payed to helpanyone.<br/>\nThey do it for free and willing. No one has to take the advice. They canchoose to not read the posts from peoplethat write in a style they don&#39;t like.<br/>\nWhen I come here with questions I want to be challenged. I want to get my butt kicked and I want to change NOW.<br/>\nSomeone telling me how greatI am doing, or patting me on the back is not going to help me get very far.<br/>\nI may move a few tenths of a mile .<br/>\nI want to move miles and miles.<br/>\nWe all get it it is hard. We all struggle everyday.Weall had a lot to change. The longer you do it and the more you are willing<br/>\nto challengeyourself the easier it get.<br/>\nIt seems the OP is open to it&lt;G&gt;<br/>\nThat is great.<br/>\nBe accepting that people will write they way they will write and not the way you want them to write.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225505029","msgId":36890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4QkE0MTUxLUUzMzEtNENCNS04OEQ5LTMyQ0Y5MEMzNTMzOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDkyNGM0ZDBhMDgxMDMxMTMzM3I0Y2Q0ZTBlN283NGJlNzY3NzkyMDgxMTlAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGdlY2NmOStxNGNjQGVHcm91cHMuY29tPiA8Mzg5REYyOUItRkFCRi00NjU4LUFBMzctMjJDMzcyRDVFQUExQHZlcml6b24ubmV0PiA8OTI0YzRkMGEwODEwMzExMzMzcjRjZDRlMGU3bzc0YmU3Njc3OTIwODExOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":36889,"nextInTopic":36892,"prevInTime":36889,"nextInTime":36891,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... Ah. I think part of confusion is don t expect empathy here sounds like the owners or regular posters got together and agreed not to write empathetically.","messageBody":"<div id=\"ygrps-yiv-2008308091\">On Oct 31, 2008, at 4:33 PM, Christie Craigie-Carter wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; May I ask what the hesistance to such responses might be?  And  <br/>\n&gt; please know<br/>\n&gt; these are genuine questions, not meant to be critical at all.  Is  <br/>\n&gt; it a fear<br/>\n&gt; that by validating what may be challening would inadvertantly  <br/>\n&gt; encourage<br/>\n&gt; people not to ask the hard questions that might allow them to change?<br/>\n<br/>\n </span></blockquote>Ah. I think part of confusion is &quot;don&#39;t expect empathy here&quot; sounds  <br/>\nlike the owners or regular posters got together and agreed not to  <br/>\nwrite empathetically.<br/>\n<br/>\nThat&#39;s not what happened. No decisions actual were made ;-) But years  <br/>\nago a core of posters who naturally write straight forward without  <br/>\nthe empathy drew readers who liked that style. And the readers stuck  <br/>\naround, continuing to read and then write the way they liked to read.<br/>\n<br/>\nSo, it&#39;s not that regular writers are reluctant to offer empathy.  <br/>\nIt&#39;s that this is a self-selected group that are drawn to an  <br/>\natmosphere where they don&#39;t expect or need empathy.<br/>\n<br/>\nAnd then people who do need empathy wander into a vibrant group that  <br/>\nlooks like what they need and end up wondering why there&#39;s no empathy!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; True, but I can&#39;t change where I am with the snap of my fingers.<br/>\n<br/>\n </span></blockquote>No one would expect instant change. It&#39;s a constant process. I&#39;ve  <br/>\nbeen unschooling for 13 years and there are still thoughts that trip  <br/>\nme up occasionally. ;-)<br/>\n<br/>\nI suspect the regular posters see change is not just an ongoing  <br/>\nprocess but is best when it&#39;s an active process. And helping people  <br/>\nto keep on moving forward is what they help with.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A goal of<br/>\n&gt; me posting is to hear from others if they had felt this way<br/>\n<br/>\n </span></blockquote>Don&#39;t hold your breath! ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and what helped<br/>\n&gt; them, which some people did and I appreciate very much.<br/>\n<br/>\n </span></blockquote>I&#39;m glad you got some of what you needed.<br/>\n<br/>\nDirect questions do work best on this kind of list, though! :-)  <br/>\nExpectations that a conversation will unfold according to certain  <br/>\nsocial rules like &quot;Oh, I&#39;m sorry. Here&#39;s what I did,&quot; tend to lead to  <br/>\ndisappointment. Being direct about requests works lots better!<br/>\n<br/>\n(And you may have done that. Threads about a specific problem are  <br/>\neasier to remember the flow of.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of course, at the end of the day, irregardless of my<br/>\n&gt; husband&#39;s concerns or school district issues, I worry that this  <br/>\n&gt; isn&#39;t the<br/>\n&gt; best decision for him, that *my* decision to unschool will  <br/>\n&gt; inadvertently not<br/>\n&gt; take care of his needs.<br/>\n<br/>\n </span></blockquote>How do you know that what you want to do will take care of his needs?<br/>\n<br/>\nHow do parents know that school will take care of their children&#39;s  <br/>\nneeds?<br/>\n<br/>\nWe tend to assume that everyone is going along because the thing  <br/>\nthey&#39;re doing works. But in the case of school or conventional  <br/>\nparenting they&#39;re just trusting that it works. They&#39;ve seen kids come  <br/>\nout of school and go to college and get jobs. (And they assume the  <br/>\nkids who fail are to blame, not the process since it works for others.)<br/>\n<br/>\nHow many adults do you know who are profoundly happy? Who don&#39;t feel  <br/>\ntrapped by what they spent all that money to acquire (the particular  <br/>\ndegree they have). How many adults do you know who jumped through all  <br/>\nthe hoops to get to the &quot;American Dream&quot; but have no idea who they  <br/>\nreally are? They don&#39;t know what they enjoy so they end up just going  <br/>\nalong. As they&#39;ve done since they entered school.<br/>\n<br/>\nWhat needs have been taken care of? And which haven&#39;t?<br/>\n<br/>\nUnschooling is different. We aren&#39;t trusting that it will lead a  <br/>\nchild to a specific place (like college). We know that treating a  <br/>\nchild with respect (which means trusting their choices like TV ;-)  <br/>\ncreates whole people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, ime, acceptance of where a person finds themselves is an  <br/>\n&gt; important<br/>\n&gt; step toward change.<br/>\n<br/>\n </span></blockquote>Depends on the person.<br/>\n<br/>\nSome people understand &quot;Wherever you go, there you are.&quot; And to move  <br/>\ntoward unschooling, it&#39;s more useful to focus where they want to be  <br/>\nrather than where they are.<br/>\n<br/>\nI suspect the people who need to hear &quot;You&#39;re okay,&quot; don&#39;t stick  <br/>\naround lists like this long because the regular posters just aren&#39;t  <br/>\nthe type who think to hand that kind of feedback out. I know I just  <br/>\nassume it&#39;s understood that people are where they are. It&#39;s not part  <br/>\nof my psyche to need validation for where I am so it doesn&#39;t occur to  <br/>\nme to give it. What I want/need is help on getting where I want to  <br/>\nbe. And it&#39;s where my brain is when I answer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I find that a mixture of soothing words and validation of the<br/>\n&gt; messages that people hear every day is a starting point.<br/>\n<br/>\n </span></blockquote>And if you stick around long enough to get unschooling in a way that  <br/>\nyou can explain it to others, then that might be part of your natural  <br/>\nstyle of explaining. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes we only<br/>\n&gt; have a short period of time (i.e. woman is &quot;due&quot; in a short time),  <br/>\n&gt; and then<br/>\n&gt; responses tend to be more pointed with less of the empathic  <br/>\n&gt; responses b/c<br/>\n&gt; it&#39;s decision making time.<br/>\n<br/>\n </span></blockquote>I think where a lot of the regular posters&#39; heads are at is seeing  <br/>\nkids in the house as the same as being &quot;due&quot;. Kids don&#39;t have years  <br/>\nfor a parent to figure this out. While 38 might not be hugely  <br/>\ndifferent from 36 or 41, for a child, that span of years might be  <br/>\ntheir whole life if they&#39;re 5. An unschooling practice that a parent  <br/>\nis waiting to &quot;get&quot; has been absent from the child&#39;s whole life. And  <br/>\nif another 5 years goes by? And other? They&#39;re practically grown.<br/>\n<br/>\nIs that the only way to see things? No. (Though I think the kids  <br/>\nwould lean towards the viewpoint of the regular posters ;-) But it is  <br/>\nthe kind of help this kind of list gives just because that&#39;s the kind  <br/>\nof people who&#39;ve hung around.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I don&#39;t necessarily think that by changing one&#39;s<br/>\n&gt; view, that emotions are resolved in the process.<br/>\n<br/>\n </span></blockquote>Not immediately. And the shift is something that consciously needs  <br/>\nworked at for quite some time. But the more thoughts are pulled up  <br/>\nout of familiar ruts, the easier it gets to keep them out of the ruts.<br/>\n<br/>\nFor example, it&#39;s very easy to fall into the rut of reacting with  <br/>\nanger at kids for making deliberate messes, like dumping the whole  <br/>\ntub of Legos out, for instance. If you&#39;ve got a child who&#39;s a dumper,  <br/>\nreacting to his natural inclination with anger, even suppressed anger  <br/>\nthat you take somewhere else, is going to have negative effects on  <br/>\nthe relationship. Can you just turn that anger off? No, of course  <br/>\nnot. But a parent doesn&#39;t need to be a slave to it, either. And if  <br/>\nsomeone had that problem, they could ask here, ask what other parents  <br/>\ndid about angers flared by irritation. People might come back with a  <br/>\nslew of ideas that are wide ranging to tackle it from several  <br/>\ndirection: do your own dumping and revel in it :-), find smaller  <br/>\nbins, put down a drop cloth and help the child remember to dump  <br/>\nthere, smell their hair to remind you how sweet they are :-) and so  <br/>\non and so on.<br/>\n<br/>\nIt helps a lot to see the anger as something you [general &quot;you&quot;]  <br/>\ndon&#39;t want. To not see it as something that you just have to put up  <br/>\nwith because that&#39;s who you are.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My oldest tends to try to get involved in everything, which<br/>\n&gt; upsets the other two, and gets very offended if I ask him to remove  <br/>\n&gt; himself<br/>\n&gt; from the situation, no matter how much I thank him for his intent.<br/>\n<br/>\n </span></blockquote>You might try giving a few typical scenarios. (Preferably in a  <br/>\nseparate thread just so it gets its own attention.)<br/>\n<br/>\nYou might try calling him away to do something rather than telling  <br/>\nhim to remove himself. If you were trying to get everyone moving in  <br/>\nthe direction you thought best and your husband stepped in and told  <br/>\nyou to remove yourself, wouldn&#39;t you feel miffed?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He alsogets his feelings hurt very easily which I&#39;m not sure how to  <br/>\n&gt; handle.  I try<br/>\n&gt; to be as gentle as possible, but it doesn&#39;t seem to matter.<br/>\n<br/>\n </span></blockquote>Empathy? Does he maybe feel like you&#39;re trying to fix him? Does he  <br/>\nfeel wrong? It&#39;s hard to suggest without specific examples.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m quite frankly exhausted trying to research this and that,  <br/>\n&gt; figure out if<br/>\n&gt; this or that is a symptom of another allergy, finding suitable  <br/>\n&gt; meals and<br/>\n&gt; snacks, etc.<br/>\n<br/>\n </span></blockquote>What if it&#39;s just who they are?<br/>\n<br/>\nIt might be allergies but it would do them more good to help them  <br/>\nfind coping skills rather than seeing some unknown ailment. They are  <br/>\nwho they are in the moment, whether it&#39;s caused by genetics or food  <br/>\nchemicals. If they&#39;re having problems relating to each other, they  <br/>\nneed help now, not more research. I&#39;m sure you are helping, but if  <br/>\nyour head is in the &quot;I need to find the allergen that&#39;s causing this&quot;  <br/>\nmode, then you&#39;re not as present with them and what they&#39;re feeling  <br/>\nright now as you could be. What if you never do find out? And they&#39;re  <br/>\nstill having problems at 15? It will serve their future selves a lot  <br/>\nbetter to help them find ways to cope with what they&#39;re feeling now,  <br/>\nthan to tackle it full on when they&#39;re older and you&#39;re convinced you  <br/>\ncan&#39;t figure out what they&#39;re allergic to.<br/>\n<br/>\nThat doesn&#39;t mean stop researching. It means put most of your  <br/>\nenergies into helping them cope in the situations they have today. If  <br/>\nyou give some examples, some people might be able to help.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225485236","msgId":36889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDgxMDMxMTMzM3I0Y2Q0ZTBlN283NGJlNzY3NzkyMDgxMTlAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDM4OURGMjlCLUZBQkYtNDY1OC1BQTM3LTIyQzM3MkQ1RUFBMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGdlY2NmOStxNGNjQGVHcm91cHMuY29tPgkgPDM4OURGMjlCLUZBQkYtNDY1OC1BQTM3LTIyQzM3MkQ1RUFBMUB2ZXJpem9uLm5ldD4="},"prevInTopic":36883,"nextInTopic":36890,"prevInTime":36888,"nextInTime":36890,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... I m a bit confused about this.  As I mentioned, I m a therapist by trade, so it is naturally my inclination to validate where someone else even as I (and ","messageBody":"<div id=\"ygrps-yiv-236054195\">On Fri, Oct 31, 2008 at 1:43 PM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Oct 30, 2008, at 9:22 AM, c3_2323 wrote:<br/>\n&gt;<br/>\n&gt; &gt; If this isn&#39;t a<br/>\n&gt; &gt; proper place to discuss those worries,<br/>\n&gt;<br/>\n&gt; Very definitely this is a great place to discuss worries.<br/>\n&gt;<br/>\n&gt; But if you&#39;re looking for &quot;Yeah, it&#39;s tough, hang in there,&quot; types of<br/>\n&gt; responses it&#39;s not what you&#39;ll get here.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m a bit confused about this.  As I mentioned, I&#39;m a therapist by trade, so<br/>\nit is naturally my inclination to validate where someone else even as I (and<br/>\nthey) hope to move toward change.  I don&#39;t see them as mutually exclusive.<br/>\nPerhaps I misunderstand.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; The list is a great place to help people see a situation from a<br/>\n&gt; different direction so they can help themselves move on. It&#39;s not<br/>\n&gt; great for helping people feel comfortable where they are with their<br/>\n&gt; problems.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Again, I&#39;m not certain what you mean, but if you mean that the list does not<br/>\nempathize with remaining with the status quo, this makes sense of course,<br/>\nthough I find it hard to imagine people would expect members of an<br/>\nunschooling list to encourage activities or practices that are not in line<br/>\nwith that philosophy.  But I tend to be literal and logical and look into<br/>\nthings very deeply.  So, for example, when you said this, I find myself<br/>\ntrying on different possible meanings for what you said.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; even as I &quot;allow&quot; them to<br/>\n&gt; &gt; unfold (i.e. I&#39;m not stopping him from watching TV, it just gives me a<br/>\n&gt; &gt; pit in my stomach), then please let me know.<br/>\n&gt;<br/>\n&gt; The list is a place to discuss anything people want to change to help<br/>\n&gt; them toward unschooling. If anyone doesn&#39;t want to actively work at<br/>\n&gt; changing or doesn&#39;t want an idea examined with an eye towards helping<br/>\n&gt; them get out of their own way as they work toward unschooling, it&#39;s<br/>\n&gt; best not to post the idea.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Well, I don&#39;t post unless I want feedback.  Gosh, I sound defensive.  I<br/>\nguess I feel a little defensive but not overly so.  I guess overall, I don&#39;t<br/>\nsee the harm in saying &quot;yeah it was a shift for me too&quot; or &quot;I can understand<br/>\nthat, here are some ideas&quot;.  Again, I wouldn&#39;t be here if I didn&#39;t want them<br/>\nand wasn&#39;t willing to work on myself.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Also, answers aren&#39;t intended exclusively for the person who posted.<br/>\n&gt; While the answers tend to address a specific situation, the<br/>\n&gt; understanding of the writers is that there may be a dozen or more<br/>\n&gt; people with the same situation. The responses are meant for them too.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Sure.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; While this state of fear might be &quot;just where you are&quot; so to speak,<br/>\n&gt; I&#39;m betting your son is aware you&#39;re uncomfortable with his TV<br/>\n&gt; watching. It will be in your tone of voice and body language. It will<br/>\n&gt; be in the suggestions of what you offer to do. You won&#39;t be able to<br/>\n&gt; respond to &quot;Can I watch TV?&quot; with the same attitude as &quot;Can I read a<br/>\n&gt; book?&quot; No matter how hard you try to be neutral, your discomfort will<br/>\n&gt; be there.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>True, but I can&#39;t change where I am with the snap of my fingers.  A goal of<br/>\nme posting is to hear from others if they had felt this way and what helped<br/>\nthem, which some people did and I appreciate very much.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; So, as far as fostering unschooling goes, it&#39;s best for new<br/>\n&gt; unschoolers to let go of their fears as soon as possible, or, while<br/>\n&gt; they&#39;re working on letting go, to &quot;fake it until they make it&quot; ;-) If<br/>\n&gt; you want ideas on how to let go of fears, people will be happy to<br/>\n&gt; offer what worked for them :-)<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Fake it til I make it better expresses what I meant when I said &quot;do it<br/>\nafraid&quot;.  And yes, any ideas on letting go of fears are always appreciated.<br/>\n<br/>\n<br/>\nI was reading in &quot;Deschooling Gently&quot; last night that she still has moments<br/>\nof panic from time to time.  In some ways I had hoped that there was some<br/>\nmagic, but in other ways, this was reassuring that I&#39;m not alone.  There are<br/>\nsome deeply ingrained messages that I need to get rid of or have responses<br/>\nin my head to.  Of course, at the end of the day, irregardless of my<br/>\nhusband&#39;s concerns or school district issues, I worry that this isn&#39;t the<br/>\nbest decision for him, that *my* decision to unschool will inadvertently not<br/>\ntake care of his needs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; And the thing is, my fears are valid.<br/>\n&gt;<br/>\n&gt; Just because fears a valid -- and, yes, NY and PA are the two hardest<br/>\n&gt; states to unschool in -- doesn&#39;t mean your only option is to put up<br/>\n&gt; with the fears. There are lots of people in NY who have been where<br/>\n&gt; you are. They can help with suggestions.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I appreciate any and all suggestions even if I don&#39;t get a chance to<br/>\nspecifically say so.  And again, I hope you will learn about me that I don&#39;t<br/>\nput up with fears; I examine them, challenge them and make peace with them<br/>\nwhen I can.  I&#39;ve faked till I made a lot of things; homebirthing, not<br/>\nvaccinating and now unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; Sure, that&#39;s fair, but it doesn&#39;t mean it&#39;s not a shift for me.<br/>\n&gt;<br/>\n&gt; As it was for all of us here :-) Just because you&#39;re not receiving<br/>\n&gt; &quot;Oh, wow, yeah, that was hard,&quot; responses, doesn&#39;t mean we haven&#39;t<br/>\n&gt; been through the experience and understand. It doesn&#39;t mean it wasn&#39;t<br/>\n&gt; a struggle for some of of the people here.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>May I ask what the hesistance to such responses might be?  And please know<br/>\nthese are genuine questions, not meant to be critical at all.  Is it a fear<br/>\nthat by validating what may be challening would inadvertantly encourage<br/>\npeople not to ask the hard questions that might allow them to change?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I suspect, though, that what drives a lot of the people to volunteer<br/>\n&gt; their hours in helping others move toward unschooling comes with an<br/>\n&gt; understanding that acceptance of where one is isn&#39;t helpful.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Again, ime, acceptance of where a person finds themselves is an important<br/>\nstep toward change.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I<br/>\n&gt; felt it was okay for people to put up with the problems in their<br/>\n&gt; lives, it wouldn&#39;t get me out of bed at 4:30 every morning for the<br/>\n&gt; past 13 years to say &quot;Oh, yeah, I know what you mean. I had problems<br/>\n&gt; with that too.&quot; The challenge in doing that would have been sucked<br/>\n&gt; out by the second post ;-)<br/>\n&gt;<br/>\n&gt; It&#39;s challenging for unschooling writers to help people see the world<br/>\n&gt; in new ways. It&#39;s what drives a lot of people to post help. And<br/>\n&gt; people need a driving passionate reason to take time from their<br/>\n&gt; families to do something. I think the problem is that new unschoolers<br/>\n&gt; come to lists and a list *feels* like a bunch of women (usually)<br/>\n&gt; sitting around chatting while their kids play with each other. So it<br/>\n&gt; feels like someone can throw out &quot;Let me tell you about my bad day,&quot;<br/>\n&gt; and have others express sympathy and comfort. But the list isn&#39;t like<br/>\n&gt; that. This is work answering people&#39;s concerns. Challenging, fun<br/>\n&gt; (unpaid) work. If it weren&#39;t challenging or fun -- if it was merely<br/>\n&gt; an hour reading tales of people&#39;s miseries and offering &quot;Oh, that&#39;s<br/>\n&gt; too bad&quot; and other soothing words -- there&#39;s a whole pile of other<br/>\n&gt; things waiting for my time! ;-)<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Keeping in mind that you had said that replies are often general statements<br/>\nand not directed toward the OP, I still would like to address what comes to<br/>\nmind for me.  I put in tons of volunteer hours helping people work toward<br/>\nchange.  I run a chapter (and co-lead another) of the International Cesarean<br/>\nAwareness Network and give lots of in person and online support to birthing<br/>\nwomen.  And I find that a mixture of soothing words and validation of the<br/>\nmessages that people hear every day is a starting point.  Sometimes we only<br/>\nhave a short period of time (i.e. woman is &quot;due&quot; in a short time), and then<br/>\nresponses tend to be more pointed with less of the empathic responses b/c<br/>\nit&#39;s decision making time.  A woman has to either decide to change her views<br/>\nand often find a new provider if she chooses one, or she doesn&#39;t and she<br/>\nleaves the group.  I just thought it might help to see how my perspective<br/>\nhas been colored, if you will.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I&#39;m not mad or upset. I&#39;ve just been challenged for years to explain<br/>\n&gt; to people who come to lists expecting soothing words and getting<br/>\n&gt; upset that their lives get examined on a list that has intentionally<br/>\n&gt; gathered people who enjoy discussing. Neither I nor anyone else has<br/>\n&gt; been able to explain why the list is as it is and have someone say<br/>\n&gt; &quot;Oh, I get it!&quot;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Well, I think I get some of it, lol.  I hope it helps to understand that I<br/>\ndon&#39;t post unless I&#39;m willing to have something examined (gently hopefully),<br/>\nand yet I don&#39;t see how empathy has to be left out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; And I<br/>\n&gt; &gt; guess one of the hardest things for me about the shift is not having<br/>\n&gt; &gt; validation that it is a change.<br/>\n&gt;<br/>\n&gt; All shifts are change, of course. I assume you mean change for the<br/>\n&gt; better?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Well, it&#39;s still unknown to me.  Yes, I think it is likely &quot;better&quot;, which<br/>\nis why I am striving toward an unschooling lifestyle, but it is still a<br/>\nprocess and a bit scary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Again, information is the best cure for fear. Read here:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joyfullyrejoycing.com\">http://www.joyfullyrejoycing.com</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/unschooling\">http://www.sandradodd.com/unschooling</a><br/>\n&gt;<br/>\n&gt; Search for whatever fear you have in the archives at this list and I<br/>\n&gt; bet others have had the same one and it&#39;s been discussed :-)<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/messages\">http://groups.yahoo.com/group/unschoolingbasics/messages</a><br/>\n&gt;<br/>\n&gt; There&#39;s no need to be a slave to fear or to any feeling, really. I<br/>\n&gt; think this society does a poor job with feelings. We&#39;re told to let<br/>\n&gt; them out or to hold them in, but not helped with the skills to take<br/>\n&gt; charge of our emotions by actively working at changing our view.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>ITA about society.  I guess I don&#39;t necessarily think that by changing one&#39;s<br/>\nview, that emotions are resolved in the process.  I&#39;m going to chew on that<br/>\na bit.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; He also works<br/>\n&gt; &gt; from home which, wonderful as it can be, makes things tough too. And<br/>\n&gt; &gt; he&#39;s been horribly moody, which is so not him.<br/>\n&gt;<br/>\n&gt; I suspect this is an even bigger factor in your worries than NY<br/>\n&gt; rules. It&#39;s *hard* unschooling while a spouse is watching over<br/>\n&gt; looking for something that resembles &quot;learning&quot;, eg, something kids<br/>\n&gt; would do in school. It&#39;s quite possible the moodiness is him burying<br/>\n&gt; his worry as he trusts you, but it&#39;s building up. He&#39;s scared and<br/>\n&gt; he&#39;s worried because you&#39;re doing something weird that isn&#39;t<br/>\n&gt; comforting his fears. And you&#39;re afraid too! So your lack of<br/>\n&gt; confidence isn&#39;t helping him with his fears.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Hard to know what my biggest worry is.  It changes.  Come quarterly report<br/>\ntime, it will likely be the school district again, though I am starting to<br/>\nhave increased confidence that I can handle the reporting.  ITA about his<br/>\nmoodiness.  I&#39;ve invited him to talk about it but thus far he hasn&#39;t taken<br/>\nme up on it.  He doesn&#39;t outwardly express concerns about homeschooling any<br/>\nmore, but I *feel* it and I know my son does too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Unschooling conferences are great for Dads -- and Moms too :-)<br/>\n&gt;<br/>\n&gt; Try the Unschooling Circuit Riders yahoogroup. It&#39;s a low volume<br/>\n&gt; group that sends out periodic messages listing upcoming conferences.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Done.  Thanks!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; There are also conferences listed here:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/events/event/listUpcoming\">http://familyrun.ning.com/events/event/listUpcoming</a><br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/events/event/listUpcoming\">http://familyrun.ning.com/events/event/listUpcoming</a>&gt;<br/>\n&gt;<br/>\n&gt; &gt; He&#39;s stressed<br/>\n&gt; &gt; by all the yelling and whining and fighting that happens in our house<br/>\n&gt;<br/>\n&gt; I would be too.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Me too.  My kids never used to fight.  I&#39;m not sure what happened.  Perhaps<br/>\nthe addition of a 3rd has just changed the dynamics enough to increase<br/>\nfighting.  My oldest tends to try to get involved in everything, which<br/>\nupsets the other two, and gets very offended if I ask him to remove himself<br/>\nfrom the situation, no matter how much I thank him for his intent.  He also<br/>\ngets his feelings hurt very easily which I&#39;m not sure how to handle.  I try<br/>\nto be as gentle as possible, but it doesn&#39;t seem to matter.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; My first guess is you need to be more present. Be there *before* the<br/>\n&gt; kids can get to the yelling, whining and fighting stage. Learn to see<br/>\n&gt; the build up. Bring snacks. Get out of the house. Call one away to do<br/>\n&gt; something with you (like gathering snacks, folding towels, etc.)<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I can try.  I&#39;ll admit to trying to finish things before the meltdowns,<br/>\nwhich doesn&#39;t always work ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; It&#39;s not that unschooling houses are models of peace and<br/>\n&gt; tranquility ;-) but yelling, whining and fighting are kids&#39; ways of<br/>\n&gt; communicating something&#39;s wrong. While we can&#39;t eliminate all of the<br/>\n&gt; conflict, we can get to a lot of it by being more present and more<br/>\n&gt; aware of what&#39;s going on.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m definitely not good at this.  It&#39;s funny what you say about &quot;ways of<br/>\ncommunicating&quot;.  I spend a lot of time wondering how their ways of<br/>\ncommunication might relate to how they feel and to what they may have eaten<br/>\n(food allergies again), so it&#39;s not a foreign concept to me, but I do think<br/>\nthat has been part of why I haven&#39;t been as present in other ways for them.<br/>\nI&#39;m quite frankly exhausted trying to research this and that, figure out if<br/>\nthis or that is a symptom of another allergy, finding suitable meals and<br/>\nsnacks, etc.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Have you read &quot;Siblings WIthout Rivalry&quot;. Excellent book. Very easy<br/>\n&gt; to read. Also, and more immediate:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/siblings\">http://sandradodd.com/siblings</a><br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I haven&#39;t.  I think it is already on my list, which is slow going, but if<br/>\nnot I will add it.  Thanks again.  I do hope you know that I appreciate your<br/>\nresponses even though some of it was/is confusing given the way my brain<br/>\nworks ;-)<br/>\n<br/>\nChristie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225474999","msgId":36872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4OURGMjlCLUZBQkYtNDY1OC1BQTM3LTIyQzM3MkQ1RUFBMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdlY2NmOStxNGNjQGVHcm91cHMuY29tPg==","referencesHeader":"PGdlY2NmOStxNGNjQGVHcm91cHMuY29tPg=="},"prevInTopic":36868,"nextInTopic":36882,"prevInTime":36871,"nextInTime":36873,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... Very definitely this is a great place to discuss worries. But if you re looking for Yeah, it s tough, hang in there, types of responses it s not what","messageBody":"<div id=\"ygrps-yiv-732687405\">On Oct 30, 2008, at 9:22 AM, c3_2323 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If this isn&#39;t a<br/>\n&gt; proper place to discuss those worries,<br/>\n<br/>\n </span></blockquote>Very definitely this is a great place to discuss worries.<br/>\n<br/>\nBut if you&#39;re looking for &quot;Yeah, it&#39;s tough, hang in there,&quot; types of  <br/>\nresponses it&#39;s not what you&#39;ll get here.<br/>\n<br/>\nThe list is a great place to help people see a situation from a  <br/>\ndifferent direction so they can help themselves move on. It&#39;s not  <br/>\ngreat for helping people feel comfortable where they are with their  <br/>\nproblems.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; even as I &quot;allow&quot; them to<br/>\n&gt; unfold (i.e. I&#39;m not stopping him from watching TV, it just gives me a<br/>\n&gt; pit in my stomach), then please let me know.<br/>\n<br/>\n </span></blockquote>The list is a place to discuss anything people want to change to help  <br/>\nthem toward unschooling. If anyone doesn&#39;t want to actively work at  <br/>\nchanging or doesn&#39;t want an idea examined with an eye towards helping  <br/>\nthem get out of their own way as they work toward unschooling, it&#39;s  <br/>\nbest not to post the idea.<br/>\n<br/>\nAlso, answers aren&#39;t intended exclusively for the person who posted.  <br/>\nWhile the answers tend to address a specific situation, the  <br/>\nunderstanding of the writers is that there may be a dozen or more  <br/>\npeople with the same situation. The responses are meant for them too.<br/>\n<br/>\nWhile this state of fear might be &quot;just where you are&quot; so to speak,  <br/>\nI&#39;m betting your son is aware you&#39;re uncomfortable with his TV  <br/>\nwatching. It will be in your tone of voice and body language. It will  <br/>\nbe in the suggestions of what you offer to do. You won&#39;t be able to  <br/>\nrespond to &quot;Can I watch TV?&quot; with the same attitude as &quot;Can I read a  <br/>\nbook?&quot; No matter how hard you try to be neutral, your discomfort will  <br/>\nbe there.<br/>\n<br/>\nSo, as far as fostering unschooling goes, it&#39;s best for new  <br/>\nunschoolers to let go of their fears as soon as possible, or, while  <br/>\nthey&#39;re working on letting go, to &quot;fake it until they make it&quot; ;-) If  <br/>\nyou want ideas on how to let go of fears, people will be happy to  <br/>\noffer what worked for them :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And the thing is, my fears are valid.<br/>\n<br/>\n </span></blockquote>Just because fears a valid -- and, yes, NY and PA are the two hardest  <br/>\nstates to unschool in -- doesn&#39;t mean your only option is to put up  <br/>\nwith the fears. There are lots of people in NY who have been where  <br/>\nyou are. They can help with suggestions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sure, that&#39;s fair, but it doesn&#39;t mean it&#39;s not a shift for me.<br/>\n<br/>\n </span></blockquote>As it was for all of us here :-) Just because you&#39;re not receiving  <br/>\n&quot;Oh, wow, yeah, that was hard,&quot; responses, doesn&#39;t mean we haven&#39;t  <br/>\nbeen through the experience and understand. It doesn&#39;t mean it wasn&#39;t  <br/>\na struggle for some of of the people here.<br/>\n<br/>\nI suspect, though, that what drives a lot of the people to volunteer  <br/>\ntheir hours in helping others move toward unschooling comes with an  <br/>\nunderstanding that acceptance of where one is isn&#39;t helpful. If I  <br/>\nfelt it was okay for people to put up with the problems in their  <br/>\nlives, it wouldn&#39;t get me out of bed at 4:30 every morning for the  <br/>\npast 13 years to say &quot;Oh, yeah, I know what you mean. I had problems  <br/>\nwith that too.&quot; The challenge in doing that would have been sucked  <br/>\nout by the second post ;-)<br/>\n<br/>\nIt&#39;s challenging for unschooling writers to help people see the world  <br/>\nin new ways. It&#39;s what drives a lot of people to post help. And  <br/>\npeople need a driving passionate reason to take time from their  <br/>\nfamilies to do something. I think the problem is that new unschoolers  <br/>\ncome to lists and a list *feels* like a bunch of women (usually)  <br/>\nsitting around chatting while their kids play with each other. So it  <br/>\nfeels like someone can throw out &quot;Let me tell you about my bad day,&quot;  <br/>\nand have others express sympathy and comfort. But the list isn&#39;t like  <br/>\nthat. This is work answering people&#39;s concerns. Challenging, fun  <br/>\n(unpaid) work. If it weren&#39;t challenging or fun -- if it was merely  <br/>\nan hour reading tales of people&#39;s miseries and offering &quot;Oh, that&#39;s  <br/>\ntoo bad&quot; and other soothing words -- there&#39;s a whole pile of other  <br/>\nthings waiting for my time! ;-)<br/>\n<br/>\nI&#39;m not mad or upset. I&#39;ve just been challenged for years to explain  <br/>\nto people who come to lists expecting soothing words and getting  <br/>\nupset that their lives get examined on a list that has intentionally  <br/>\ngathered people who enjoy discussing. Neither I nor anyone else has  <br/>\nbeen able to explain why the list is as it is and have someone say  <br/>\n&quot;Oh, I get it!&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I<br/>\n&gt; guess one of the hardest things for me about the shift is not having<br/>\n&gt; validation that it is a change.<br/>\n<br/>\n </span></blockquote>All shifts are change, of course. I assume you mean change for the  <br/>\nbetter?<br/>\n<br/>\nAgain, information is the best cure for fear. Read here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joyfullyrejoycing.com\">http://www.joyfullyrejoycing.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/unschooling\">http://www.sandradodd.com/unschooling</a><br/>\n<br/>\nSearch for whatever fear you have in the archives at this list and I  <br/>\nbet others have had the same one and it&#39;s been discussed :-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/messages\">http://groups.yahoo.com/group/unschoolingbasics/messages</a><br/>\n<br/>\nThere&#39;s no need to be a slave to fear or to any feeling, really. I  <br/>\nthink this society does a poor job with feelings. We&#39;re told to let  <br/>\nthem out or to hold them in, but not helped with the skills to take  <br/>\ncharge of our emotions by actively working at changing our view.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He also works<br/>\n&gt; from home which, wonderful as it can be, makes things tough too.  And<br/>\n&gt; he&#39;s been horribly moody, which is so not him.<br/>\n<br/>\n </span></blockquote>I suspect this is an even bigger factor in your worries than NY  <br/>\nrules. It&#39;s *hard* unschooling while a spouse is watching over  <br/>\nlooking for something that resembles &quot;learning&quot;, eg, something kids  <br/>\nwould do in school. It&#39;s quite possible the moodiness is him burying  <br/>\nhis worry as he trusts you, but it&#39;s building up. He&#39;s scared and  <br/>\nhe&#39;s worried because you&#39;re doing something weird that isn&#39;t  <br/>\ncomforting his fears. And you&#39;re afraid too! So your lack of  <br/>\nconfidence isn&#39;t helping him with his fears.<br/>\n<br/>\nUnschooling conferences are great for Dads -- and Moms too :-)<br/>\n<br/>\nTry the Unschooling Circuit Riders yahoogroup. It&#39;s a low volume  <br/>\ngroup that sends out periodic messages listing upcoming conferences.<br/>\n<br/>\nThere are also conferences listed here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/events/event/listUpcoming\">http://familyrun.ning.com/events/event/listUpcoming</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s stressed<br/>\n&gt; by all the yelling and whining and fighting that happens in our house<br/>\n<br/>\n </span></blockquote>I would be too.<br/>\n<br/>\nMy first guess is you need to be more present. Be there *before* the  <br/>\nkids can get to the yelling, whining and fighting stage. Learn to see  <br/>\nthe build up. Bring snacks. Get out of the house. Call one away to do  <br/>\nsomething with you (like gathering snacks, folding towels, etc.)<br/>\n<br/>\nIt&#39;s not that unschooling houses are models of peace and  <br/>\ntranquility ;-) but yelling, whining and fighting are kids&#39; ways of  <br/>\ncommunicating something&#39;s wrong. While we can&#39;t eliminate all of the  <br/>\nconflict, we can get to a lot of it by being more present and more  <br/>\naware of what&#39;s going on.<br/>\n<br/>\nHave you read &quot;Siblings WIthout Rivalry&quot;. Excellent book. Very easy  <br/>\nto read. Also, and more immediate:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/siblings\">http://sandradodd.com/siblings</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] My first week unschooling so far...","postDate":"1225460331","msgId":36868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDgxMDMxMDYzOHc1NjYzOGVhN3M2YjZmYmMyZjE0ODM2NWM1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEJMVTAtU01UUDI0OUNFMDBDNDJDMDc5NDhBNzdCNjlENzIxMEBwaHguZ2JsPg==","referencesHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPgkgPEJMVTAtU01UUDI0OUNFMDBDNDJDMDc5NDhBNzdCNjlENzIxMEBwaHguZ2JsPg=="},"prevInTopic":36866,"nextInTopic":36872,"prevInTime":36867,"nextInTime":36869,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"there is also all the Live and Learn talk downloads. I think that this years is out now. There is also previous years. ","messageBody":"<div id=\"ygrps-yiv-1062840176\">there is also all the Live and Learn talk downloads. I think that this years<br/>\nis out now. There is also previous years.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnshop.com/catalog/index.php?main_page=product_info&products_id=114\">http://liveandlearnshop.com/catalog/index.php?main_page=product_info&products_id=114</a><br/>\n<br/>\nfaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Oct 30, 2008 at 5:52 PM, Kimberlee &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kimmybird@...\">kimmybird@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   I used to prefer to read in print myself, rather than on the computer.<br/>\n&gt; Maybe try printing some of the recommended articles, borrow or buy<br/>\n&gt; some of the recommended books, and listen to some podcasts. Sandra<br/>\n&gt; Dodd for example, was interviewed (Sept 8, 2008) on Relaxed Homeschool<br/>\n&gt; Talk Radio and you can download the podcast for free from itunes (she<br/>\n&gt; talks (amongst other things) about deschooling including how long it<br/>\n&gt; might take).<br/>\n&gt;<br/>\n&gt; Kimberlee<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;m feeling like maybe I didn&#39;t research this enough (so me), as I<br/>\n&gt; &gt; loathe reading off of websites. I&#39;ve certainly done some, but I am so<br/>\n&gt; &gt; nervous.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":341424269,"authorName":"aenclade","from":"&quot;aenclade&quot; &lt;aenclade@...&gt;","profile":"aenclade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: My first week unschooling so far...","postDate":"1225410702","msgId":36865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlZGhhZStucGpkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlZGYyaytkMm5xQGVHcm91cHMuY29tPg=="},"prevInTopic":36862,"nextInTopic":36866,"prevInTime":36864,"nextInTime":36866,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"I am about 7 weeks ahead of you on this journey into unschooling. The first 2 weeks were horrible....it was really hard letting go of preschool, the schedule,","messageBody":"<div id=\"ygrps-yiv-2098593017\">I am about 7 weeks ahead of you on this journey into unschooling. The<br/>\nfirst 2 weeks were horrible....it was really hard letting go of<br/>\npreschool, the schedule, this new way of life. I did do quite a lot of<br/>\nresearch but still this transition is totally hard.the hardest part is<br/>\nchanging myself. I am so committed to making it work that I have found<br/>\nmyself almost 2 months in...the tv made me nuts at first and the most<br/>\nhelpful advice was to put lots of stuff around the tv to play with and<br/>\nlow and behold he now watches while playing with stuff...not all the<br/>\ntime but more and more. the changes are becoming obvious now as he is<br/>\nbecoming more of his own person rather than one of a group that he<br/>\nspends time with everyday. it is truly amazing and at the same time<br/>\nscary so I completely feel for you and encourage you to keep on<br/>\nkeeping on.<br/>\n<br/>\ngood luck and know there are people right there with you <br/>\n<br/>\namanda<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;meredith@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;c3_2323&quot; <br/>\n&gt; &lt;craigiecarter@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; And as ridiculous as it sounds, I think I&#39;m having withdrawal.  I<br/>\n&gt; &gt; know, I said it was ridiculous. <br/>\n&gt; <br/>\n&gt; Its not ridiculous, transitions are hard. It helps me to remind <br/>\n&gt; myself of that frequently when I&#39;m in the middle of one! Maybe you <br/>\n&gt; can tape big signs all over the house that say &quot;its not the <br/>\n&gt; unschooling, its the Transition&quot; as a reminder.<br/>\n&gt; <br/>\n&gt; &gt;&gt; He grabs the remote and says &quot;you read, I&#39;ll watch&quot;.  <br/>\n&gt; <br/>\n&gt; Try to see this as him asking for your company - some connection <br/>\n&gt; with his mamma. See it also as a kind of creative problem-solving on <br/>\n&gt; his part. He can tell that watching a lot of tv means less time with <br/>\n&gt; mom, and he&#39;s not thrilled about that. He can tell that tv isn&#39;t <br/>\n&gt; your thing - so he found a solution! Clever guy! I don&#39;t have any <br/>\n&gt; idea if that&#39;s something you can use in terms of reporting or not - <br/>\n&gt; I don&#39;t live in NY, but I do some &quot;reporting&quot; to Ray&#39;s bio mom. <br/>\n&gt; Ray&#39;s a Very social learner, so I&#39;m often in the position of taking <br/>\n&gt; what he&#39;s doing socially and looking for the learning and &quot;skill <br/>\n&gt; building&quot; going on. <br/>\n&gt; <br/>\n&gt; &gt; Ugh.  I am hoping today that he will want to go out and gather some<br/>\n&gt; &gt; materials for some projects we&#39;ve been talking about, but I want <br/>\n&gt; to be<br/>\n&gt; &gt; okay if he says no.<br/>\n&gt; <br/>\n&gt; If he says no, could you go gather these materials yourself? Is it a <br/>\n&gt; project y&#39;all could do in front of the tv? It does take some time to <br/>\n&gt; shift the way you think about communicating and figuring things out <br/>\n&gt; with your kids. Its convenient to just decide - maybe offer a few <br/>\n&gt; options, but ultimately, that&#39;s still you deciding. Its nowhere near <br/>\n&gt; as convenient to work things out together, especially at first. With <br/>\n&gt; practice, it gets easier, I promise!<br/>\n&gt; <br/>\n&gt; If he&#39;s not interested in doing any kind of projects at all right <br/>\n&gt; now, consider doing some yourself, for your own enjoyment, anyway. <br/>\n&gt; Do them in the same room if possible, so y&#39;all can still enjoy each <br/>\n&gt; other&#39;s company. <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 7, Ray 15)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: My first week unschooling so far...","postDate":"1225408404","msgId":36862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlZGYyaytkMm5xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg=="},"prevInTopic":36858,"nextInTopic":36865,"prevInTime":36861,"nextInTime":36863,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... Its not ridiculous, transitions are hard. It helps me to remind myself of that frequently when I m in the middle of one! Maybe you can tape big signs all","messageBody":"<div id=\"ygrps-yiv-2135761561\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;c3_2323&quot; <br/>\n&lt;craigiecarter@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And as ridiculous as it sounds, I think I&#39;m having withdrawal.  I<br/>\n&gt; know, I said it was ridiculous. <br/>\n<br/>\n </span></blockquote>Its not ridiculous, transitions are hard. It helps me to remind <br/>\nmyself of that frequently when I&#39;m in the middle of one! Maybe you <br/>\ncan tape big signs all over the house that say &quot;its not the <br/>\nunschooling, its the Transition&quot; as a reminder.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He grabs the remote and says &quot;you read, I&#39;ll watch&quot;.  <br/>\n<br/>\n </span></blockquote>Try to see this as him asking for your company - some connection <br/>\nwith his mamma. See it also as a kind of creative problem-solving on <br/>\nhis part. He can tell that watching a lot of tv means less time with <br/>\nmom, and he&#39;s not thrilled about that. He can tell that tv isn&#39;t <br/>\nyour thing - so he found a solution! Clever guy! I don&#39;t have any <br/>\nidea if that&#39;s something you can use in terms of reporting or not - <br/>\nI don&#39;t live in NY, but I do some &quot;reporting&quot; to Ray&#39;s bio mom. <br/>\nRay&#39;s a Very social learner, so I&#39;m often in the position of taking <br/>\nwhat he&#39;s doing socially and looking for the learning and &quot;skill <br/>\nbuilding&quot; going on. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ugh.  I am hoping today that he will want to go out and gather some<br/>\n&gt; materials for some projects we&#39;ve been talking about, but I want <br/>\n </span></blockquote>to be<br/>\n<blockquote><span title=\"ireply\"> &gt; okay if he says no.<br/>\n<br/>\n </span></blockquote>If he says no, could you go gather these materials yourself? Is it a <br/>\nproject y&#39;all could do in front of the tv? It does take some time to <br/>\nshift the way you think about communicating and figuring things out <br/>\nwith your kids. Its convenient to just decide - maybe offer a few <br/>\noptions, but ultimately, that&#39;s still you deciding. Its nowhere near <br/>\nas convenient to work things out together, especially at first. With <br/>\npractice, it gets easier, I promise!<br/>\n<br/>\nIf he&#39;s not interested in doing any kind of projects at all right <br/>\nnow, consider doing some yourself, for your own enjoyment, anyway. <br/>\nDo them in the same room if possible, so y&#39;all can still enjoy each <br/>\nother&#39;s company. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":229360410,"authorName":"Kimberlee","from":"Kimberlee &lt;kimmybird@...&gt;","profile":"scotiabird","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] My first week unschooling so far...","postDate":"1225403540","msgId":36866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTAtU01UUDI0OUNFMDBDNDJDMDc5NDhBNzdCNjlENzIxMEBwaHguZ2JsPg==","inReplyToHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg==","referencesHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg=="},"prevInTopic":36865,"nextInTopic":36868,"prevInTime":36865,"nextInTime":36867,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"I used to prefer to read in print myself, rather than on the computer. Maybe try printing some of the recommended articles, borrow or buy some of the","messageBody":"<div id=\"ygrps-yiv-1319639936\">I used to prefer to read in print myself, rather than on the computer.  <br/>\nMaybe try printing some of the recommended articles, borrow or buy  <br/>\nsome of the recommended books, and listen to some podcasts. Sandra  <br/>\nDodd for example, was interviewed (Sept 8, 2008) on Relaxed Homeschool  <br/>\nTalk Radio and you can download the podcast for free from itunes (she  <br/>\ntalks (amongst other things) about deschooling including how long it  <br/>\nmight take).<br/>\n<br/>\nKimberlee<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m feeling like maybe I didn&#39;t research this enough (so me), as I<br/>\n&gt; loathe reading off of websites. I&#39;ve certainly done some, but I am so<br/>\n&gt; nervous.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: My first week unschooling so far...","postDate":"1225390398","msgId":36858,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlY3RmdStlaTdjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg=="},"prevInTopic":36855,"nextInTopic":36862,"prevInTime":36857,"nextInTime":36859,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... Christie, Crawl up next to him and watch some tv too. Talk about the shows he is watching. My kids truly, truly learn tons from tv. The Suite Life of Zach","messageBody":"<div id=\"ygrps-yiv-373589310\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;c3_2323&quot; &lt;craigiecarter@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And as ridiculous as it sounds, I think I&#39;m having withdrawal.  I<br/>\n&gt; know, I said it was ridiculous.  <br/>\n&gt; <br/>\n&gt; I&#39;m feeling like maybe I didn&#39;t research this enough (so me), as I<br/>\n&gt; loathe reading off of websites.  I&#39;ve certainly done some, but I am so<br/>\n&gt; nervous.<br/>\n&gt; <br/>\n&gt; So far he has chosen only to watch TV and that is so hard for me. <br/>\n<br/>\n<br/>\n </span></blockquote>Christie,<br/>\n<br/>\nCrawl up next to him and watch some tv too. Talk about the shows he is <br/>\nwatching. <br/>\n<br/>\nMy kids truly, truly learn tons from tv. The Suite Life of Zach and <br/>\nCody gave my daughter lots of huge vocabulary words. My son loves <br/>\nMythbusters and How its Made. It all has value.. IT ALL HAS VALUE.<br/>\n<br/>\nYour son will not most likely watch tv forever. But during the time he <br/>\ndoes connect with it, connect with him. <br/>\n<br/>\nLearning does not stop if no book is open, no worksheet present. <br/>\nLearning is all the time. <br/>\n<br/>\nMy kids and I watch Survivor. We often look at the globe and check out <br/>\nwhat it is like where the people are. We discuss the morality and <br/>\nethics of each alliance and each tribal council. We connect through <br/>\nthis somewhat goofy show. <br/>\n<br/>\nYesterday we cooked a pumpkin and then has a cooking frenzy. We <br/>\nsearched on the internet for pumpkin recipes. We watched the squash <br/>\nbecome soft and then become delicous deserts. We weighed our <br/>\ningredients and discussed the boiling temperature and time it took. The <br/>\nkids read each other nutritional value on the recipe.  The game goes <br/>\nlike this.  Someone is reading a label.  They ask how many grams of <br/>\nsugar? The rest guess. Always informative&lt;BWG&gt;<br/>\n<br/>\nKathleen</div>","specialLinks":[]},{"userId":257942097,"authorName":"Rachel Fee","from":"&quot;Rachel Fee&quot; &lt;atinyseed@...&gt;","profile":"atinyseed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: My first week unschooling so far...","postDate":"1225387760","msgId":36882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2YWUwMDQzMDgxMDMwMTAyOW0zNDhhYTc4N2tkMDExZDI2MDViYzQxOTczQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdlY2NmOStxNGNjQGVHcm91cHMuY29tPg==","referencesHeader":"PEQ3N0U3RDVFLUJEQjItNDk2Qy05NTZDLUQ2NjlCQTU0QzQwMEB2ZXJpem9uLm5ldD4JIDxnZWNjZjkrcTRjY0BlR3JvdXBzLmNvbT4="},"prevInTopic":36872,"nextInTopic":36883,"prevInTime":36881,"nextInTime":36883,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"I could have written this post myself!  Thank you so much.  I am just beginning to implement unschooling ideas w/my 3 1/2 yr twin girls & I am sick to death of","messageBody":"<div id=\"ygrps-yiv-1290348094\">I could have written this post myself!  Thank you so much.  I am just<br/>\nbeginning to implement unschooling ideas w/my 3 1/2 yr twin girls & I am<br/>\nsick to death of the screaming, crying, fightig, hitting, & aggression of<br/>\nall kinds.  It takes everything I have not to go into authoritarian parent<br/>\nmode & shut the whole thing down.<br/>\n<br/>\nThanks for sharing your struggle.<br/>\n<br/>\nRachel Fee-Prince<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Oct 30, 2008 at 9:22 AM, c3_2323 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:craigiecarter@...\">craigiecarter@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt; Joyce Fetteroll<br/>\n&gt; &lt;jfetteroll@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; On Oct 29, 2008, at 8:37 AM, c3_2323 wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; I am hoping today that he will want to go out and gather some<br/>\n&gt; &gt; &gt; materials for some projects we&#39;ve been talking about<br/>\n&gt; &gt;<br/>\n&gt; &gt; Expectations can be relationship killers. They can set kids (and<br/>\n&gt; &gt; partners and friends) up to fail.<br/>\n&gt; &gt;<br/>\n&gt; &gt; If you must expect, expect him to watch TV ;-)<br/>\n&gt;<br/>\n&gt; Sure, that&#39;s fair, but it doesn&#39;t mean it&#39;s not a shift for me. And I<br/>\n&gt; guess one of the hardest things for me about the shift is not having<br/>\n&gt; validation that it is a change. I&#39;ve long recognized that &quot;expecting&quot;<br/>\n&gt; my kids to do or be whatever doesn&#39;t work, doesn&#39;t even make sense,<br/>\n&gt; but I have fallen into some of the typical traps.<br/>\n&gt;<br/>\n&gt; Something you all don&#39;t know about me is that I am more than willing<br/>\n&gt; to look at myself. I&#39;m also a therapist, so not only am I<br/>\n&gt; self-reflective, I respond well to empathy ;-) which isn&#39;t the same as<br/>\n&gt; condoning any action.<br/>\n&gt;<br/>\n&gt; And the thing is, my fears are valid. If I sent in my IHIP last year,<br/>\n&gt; with a thorough lay out of what we would be covering, and it was<br/>\n&gt; returned to me covered in red just b/c, it is a reality that I have to<br/>\n&gt; be really careful following my heart and what I think is best for my<br/>\n&gt; kids, lest the authorities become involved. We have a very<br/>\n&gt; controlling superintendent and it is not a pretty situation here.<br/>\n&gt;<br/>\n&gt; So yeah, I&#39;m really nervous. Not only am I stepping outside of my own<br/>\n&gt; box, I&#39;m doing so with some real fears.<br/>\n&gt;<br/>\n&gt; And yeah, the TV thing worries me and it&#39;s going to. If this isn&#39;t a<br/>\n&gt; proper place to discuss those worries, even as I &quot;allow&quot; them to<br/>\n&gt; unfold (i.e. I&#39;m not stopping him from watching TV, it just gives me a<br/>\n&gt; pit in my stomach), then please let me know. I would never intend to<br/>\n&gt; upset anyone, ever.<br/>\n&gt;<br/>\n&gt; Oh, and yeah, my dh is an issue. He&#39;s really a fantastic guy, but<br/>\n&gt; he&#39;s not into hsing in general and forget unschooling. He also works<br/>\n&gt; from home which, wonderful as it can be, makes things tough too. And<br/>\n&gt; he&#39;s been horribly moody, which is so not him.<br/>\n&gt;<br/>\n&gt; This may be more sharing than necessary, but I had really pushed for a<br/>\n&gt; 3rd child, and since have also insisted on not vaccinating my kids,<br/>\n&gt; and now homeschooling. I think he feels disillusioned. He&#39;s stressed<br/>\n&gt; by all the yelling and whining and fighting that happens in our house<br/>\n&gt; (me too, and no not he and I, with rare exceptions). He doesn&#39;t see<br/>\n&gt; the harm of school and has some really traditional views. Not being<br/>\n&gt; confident in all my choices, I often feel caught.<br/>\n&gt;<br/>\n&gt; I don&#39;t say all of this to get sympathy or pats on the back, or<br/>\n&gt; whatever, but I do think it is important to understand where people<br/>\n&gt; are coming from. I&#39;ve been living the past couple of days with a pit<br/>\n&gt; in my stomach and it&#39;s not fun.<br/>\n&gt; &gt;<br/>\n&gt; &gt; If you&#39;re not on a NY list for unschoolers, do find one as soon as<br/>\n&gt; &gt; possible. I know loads of NY unschoolers have gone through a<br/>\n&gt; &gt; deschooling period with TV watching and video game playing. Find out<br/>\n&gt; &gt; how they worked that into their reports. Information is the best cure<br/>\n&gt; &gt; for fear.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Go here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/world\">http://sandradodd.com/world</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; Scroll down. The United States lists are at the bottom.<br/>\n&gt;<br/>\n&gt; Done, thanks! And thanks for your feedback. My apologies if I come<br/>\n&gt; off as defensive. I hope it helps to know how much I want what works<br/>\n&gt; best for my kids. I love them more than anything and if I have to<br/>\n&gt; step way out of boxes for them, I will.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt;<br/>\n&gt; Christie<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n&quot;She softened gradually, melting in the light of the sun, all the while<br/>\nthinking, &#39;O, this is what it&#39;s like to be a planet&#39; & suddenly it was over<br/>\n& the universe expanded by one.&quot;<br/>\n-Brian Andreas<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":356810011,"authorName":"raisingexplorers","from":"&quot;raisingexplorers&quot; &lt;raisingexplorers@...&gt;","profile":"raisingexplorers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: My first week unschooling so far...","postDate":"1225381681","msgId":36883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlY2t2aCtlcTlxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg=="},"prevInTopic":36882,"nextInTopic":36889,"prevInTime":36882,"nextInTime":36884,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"My son is like this, also. He doesn t normally enjoy beginning a reading session by sitting down with me to read a book. He likes to begin by having me start","messageBody":"<div id=\"ygrps-yiv-358744866\">My son is like this, also. He doesn&#39;t normally enjoy beginning a<br/>\nreading session by sitting down with me to read a book. He likes to<br/>\nbegin by having me start reading the book and him doing whatever he<br/>\nwants to do... then, later, sometimes he gets caught up in the book<br/>\nand leaves the other activity behind. Sometimes, he doesn&#39;t, though. <br/>\nWhen he was in Kindergarten, (at public school) the teachers<br/>\ncomplained that he would always want to be playing with items and<br/>\ndoing other things while they tried to read to the class. BUT, that<br/>\nwhen asked about the stories - he could always answer the questions<br/>\ncorrectly. It &quot;seemed&quot; like he wasn&#39;t paying attention to their<br/>\nreading, and they were surprised that even though he had been playing<br/>\nhe was paying attention to the story also. He easily splits his<br/>\nattention. But, the reader finds it &quot;offensive&quot; that they are reading<br/>\nand the person who is being read to &quot;isn&#39;t paying attention the way<br/>\nthe reader thinks they should.&quot; Reading was a struggle, because people<br/>\nwere trying to force him to do it their way. <br/>\n<br/>\nI thought, for a time, that he didn&#39;t like having stories read to him.<br/>\nBut, that wasn&#39;t it. He didn&#39;t like having a reader who was offended<br/>\nby the fact that he didn&#39;t have to sit there quietly and still, only<br/>\npaying attention to the reader, to understand a story. I found this<br/>\nout full force when I began checking out AudioBooks for him. He wanted<br/>\nPeter Pan and Harry Potter. I got the AudioBooks so he could be free<br/>\nto play with his legos, or computer games and listen to the story<br/>\nwhenever he felt like it. He completed both books and related many of<br/>\nthe events in them to me. He was listening to them, understanding them<br/>\nand enjoying them. He didn&#39;t need anybody forcing him to sit still,<br/>\nlook at the book, pay attention, turn off the game, turn off the TV,<br/>\netc. I would say, don&#39;t take offense. Just start reading. My son often<br/>\nwill be playing Gameboy games when I start reading a book, and will<br/>\nstop playing them when I get to exciting parts of the book. <br/>\n<br/>\nMy Father In Law is like this, too. He is a computer/phone networking<br/>\ngenius and frequently must go back to school for new technology. He<br/>\nlistens to Audio Books to help him learn the new technology while he<br/>\nis driving, working on his projects, running on his treadmill,<br/>\nwatching a TV show, playing computer games... Listening to the info<br/>\nwhile engaged in other activities doesn&#39;t seem to hold him back in his<br/>\nfield of ever expanding technology. <br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;c3_2323&quot;<br/>\n&lt;craigiecarter@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote> started leafing through the basket of<br/>\n<blockquote><span title=\"qreply\"> &gt; books next to me.  I asked if he wanted to read one of the Magic<br/>\n&gt; Treehouse books together, and he said yes.  I immediately stopped what<br/>\n&gt; I was doing (something I&#39;m not always good at), went over and sat with<br/>\n&gt; him to read.  He grabs the remote and says &quot;you read, I&#39;ll watch&quot;.  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":217951851,"authorName":"c3_2323","from":"&quot;c3_2323&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: My first week unschooling so far...","postDate":"1225372969","msgId":36855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlY2NmOStxNGNjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ3N0U3RDVFLUJEQjItNDk2Qy05NTZDLUQ2NjlCQTU0QzQwMEB2ZXJpem9uLm5ldD4="},"prevInTopic":36852,"nextInTopic":36858,"prevInTime":36854,"nextInTime":36856,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... Sure, that s fair, but it doesn t mean it s not a shift for me.  And I guess one of the hardest things for me about the shift is not having validation that","messageBody":"<div id=\"ygrps-yiv-175467859\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll<br/>\n&lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Oct 29, 2008, at 8:37 AM, c3_2323 wrote:<br/>\n&gt; <br/>\n&gt; &gt;  I am hoping today that he will want to go out and gather some<br/>\n&gt; &gt; materials for some projects we&#39;ve been talking about<br/>\n&gt; <br/>\n&gt; Expectations can be relationship killers. They can set kids (and  <br/>\n&gt; partners and friends) up to fail.<br/>\n&gt; <br/>\n&gt; If you must expect, expect him to watch TV ;-)<br/>\n<br/>\n<br/>\n </span></blockquote>Sure, that&#39;s fair, but it doesn&#39;t mean it&#39;s not a shift for me.  And I<br/>\nguess one of the hardest things for me about the shift is not having<br/>\nvalidation that it is a change.  I&#39;ve long recognized that &quot;expecting&quot;<br/>\nmy kids to do or be whatever doesn&#39;t work, doesn&#39;t even make sense,<br/>\nbut I have fallen into some of the typical traps.  <br/>\n<br/>\nSomething you all don&#39;t know about me is that I am more than willing<br/>\nto look at myself.  I&#39;m also a therapist, so not only am I<br/>\nself-reflective, I respond well to empathy ;-) which isn&#39;t the same as<br/>\ncondoning any action.  <br/>\n<br/>\nAnd the thing is, my fears are valid.  If I sent in my IHIP last year,<br/>\nwith a thorough lay out of what we would be covering, and it was<br/>\nreturned to me covered in red just b/c, it is a reality that I have to<br/>\nbe really careful following my heart and what I think is best for my<br/>\nkids, lest the authorities become involved.  We have a very<br/>\ncontrolling superintendent and it is not a pretty situation here.  <br/>\n<br/>\nSo yeah, I&#39;m really nervous.  Not only am I stepping outside of my own<br/>\nbox, I&#39;m doing so with some real fears.  <br/>\n<br/>\nAnd yeah, the TV thing worries me and it&#39;s going to.  If this isn&#39;t a<br/>\nproper place to discuss those worries, even as I &quot;allow&quot; them to<br/>\nunfold (i.e. I&#39;m not stopping him from watching TV, it just gives me a<br/>\npit in my stomach), then please let me know.  I would never intend to<br/>\nupset anyone, ever.  <br/>\n<br/>\nOh, and yeah, my dh is an issue.  He&#39;s really a fantastic guy, but<br/>\nhe&#39;s not into hsing in general and forget unschooling.  He also works<br/>\nfrom home which, wonderful as it can be, makes things tough too.  And<br/>\nhe&#39;s been horribly moody, which is so not him.  <br/>\n<br/>\nThis may be more sharing than necessary, but I had really pushed for a<br/>\n3rd child, and since have also insisted on not vaccinating my kids,<br/>\nand now homeschooling.  I think he feels disillusioned.  He&#39;s stressed<br/>\nby all the yelling and whining and fighting that happens in our house<br/>\n(me too, and no not he and I, with rare exceptions).  He doesn&#39;t see<br/>\nthe harm of school and has some really traditional views.  Not being<br/>\nconfident in all my choices, I often feel caught.  <br/>\n<br/>\nI don&#39;t say all of this to get sympathy or pats on the back, or<br/>\nwhatever, but I do think it is important to understand where people<br/>\nare coming from.  I&#39;ve been living the past couple of days with a pit<br/>\nin my stomach and it&#39;s not fun.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If you&#39;re not on a NY list for unschoolers, do find one as soon as  <br/>\n&gt; possible. I know loads of NY unschoolers have gone through a  <br/>\n&gt; deschooling period with TV watching and video game playing. Find out  <br/>\n&gt; how they worked that into their reports. Information is the best cure  <br/>\n&gt; for fear.<br/>\n&gt; <br/>\n&gt; Go here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/world\">http://sandradodd.com/world</a><br/>\n&gt; <br/>\n&gt; Scroll down. The United States lists are at the bottom.<br/>\n<br/>\n </span></blockquote>Done, thanks!  And thanks for your feedback.  My apologies if I come<br/>\noff as defensive.  I hope it helps to know how much I want what works<br/>\nbest for my kids.  I love them more than anything and if I have to<br/>\nstep way out of boxes for them, I will.  <br/>\n<br/>\nThanks,<br/>\n<br/>\nChristie</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] My first week unschooling so far...","postDate":"1225358827","msgId":36852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3N0U3RDVFLUJEQjItNDk2Qy05NTZDLUQ2NjlCQTU0QzQwMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg==","referencesHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg=="},"prevInTopic":36839,"nextInTopic":36855,"prevInTime":36851,"nextInTime":36853,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"... Expectations can be relationship killers. They can set kids (and partners and friends) up to fail. If you must expect, expect him to watch TV ;-) If you re","messageBody":"<div id=\"ygrps-yiv-115588578\">On Oct 29, 2008, at 8:37 AM, c3_2323 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am hoping today that he will want to go out and gather some<br/>\n&gt; materials for some projects we&#39;ve been talking about<br/>\n<br/>\n </span></blockquote>Expectations can be relationship killers. They can set kids (and  <br/>\npartners and friends) up to fail.<br/>\n<br/>\nIf you must expect, expect him to watch TV ;-)<br/>\n<br/>\nIf you&#39;re not on a NY list for unschoolers, do find one as soon as  <br/>\npossible. I know loads of NY unschoolers have gone through a  <br/>\ndeschooling period with TV watching and video game playing. Find out  <br/>\nhow they worked that into their reports. Information is the best cure  <br/>\nfor fear.<br/>\n<br/>\nGo here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/world\">http://sandradodd.com/world</a><br/>\n<br/>\nScroll down. The United States lists are at the bottom.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217951851,"authorName":"c3_2323","from":"&quot;c3_2323&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"My first week unschooling so far...","postDate":"1225283853","msgId":36839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlOWxlZCt2NmhqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36852,"prevInTime":36838,"nextInTime":36840,"topicId":36839,"numMessagesInTopic":0,"msgSnippet":"And as ridiculous as it sounds, I think I m having withdrawal.  I know, I said it was ridiculous. I m feeling like maybe I didn t research this enough (so me),","messageBody":"<div id=\"ygrps-yiv-11643762\">And as ridiculous as it sounds, I think I&#39;m having withdrawal.  I<br/>\nknow, I said it was ridiculous.  <br/>\n<br/>\nI&#39;m feeling like maybe I didn&#39;t research this enough (so me), as I<br/>\nloathe reading off of websites.  I&#39;ve certainly done some, but I am so<br/>\nnervous.<br/>\n<br/>\nSo far he has chosen only to watch TV and that is so hard for me. <br/>\nYesterday, he came over to where I was working (I volunteer for a<br/>\ncouple of organizations), and started leafing through the basket of<br/>\nbooks next to me.  I asked if he wanted to read one of the Magic<br/>\nTreehouse books together, and he said yes.  I immediately stopped what<br/>\nI was doing (something I&#39;m not always good at), went over and sat with<br/>\nhim to read.  He grabs the remote and says &quot;you read, I&#39;ll watch&quot;.  <br/>\n<br/>\nWell, after my youngest, who is not feeling well, had fallen asleep<br/>\nand woken up almost immediately, my tone was harsh even though I<br/>\ndidn&#39;t mean it to be.  The voice in my head was reminding me that this<br/>\nwas not the way to handle it and I did catch myself, but I could tell<br/>\nhe felt badly.  <br/>\n<br/>\nUgh.  I am hoping today that he will want to go out and gather some<br/>\nmaterials for some projects we&#39;ve been talking about, but I want to be<br/>\nokay if he says no.  I just panic a bit that maybe he&#39;ll only watch TV<br/>\nand truth be told, with how my district is, I&#39;m afraid of consequences<br/>\nfrom the district.  I&#39;m pretty stressed about it, actually.  I do live<br/>\nin NY, btw, which I saw someone had posted was a difficult state to<br/>\nunschool in (I think that this was on another list though).<br/>\n<br/>\nFeedback appreciated,<br/>\n<br/>\nChristie</div>","specialLinks":[]}],"prevTopicId":36880,"nextTopicId":36919}}