{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;Rewards Motivate People&quot;","postDate":"1124045113","msgId":6049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRkbzNmcCtvNDhlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":6048,"nextInTime":6050,"topicId":6049,"numMessagesInTopic":0,"msgSnippet":"The following exerpt goes along with the detailed discussion we were having in relation to children and chores .  Spurred by that discussion I sought out a","messageBody":"<div id=\"ygrps-yiv-105102906\">The following exerpt goes along with the detailed discussion we were <br/>\nhaving in relation to children and &quot;chores&quot;.  Spurred by that <br/>\ndiscussion I sought out a few Alfie Kohn books.  I am currently <br/>\nreading, &quot;Unconditional Parenting&quot; and recommend it for anyone that <br/>\nwas facing struggles in relation to that discussion.  The below <br/>\ncomes from his book, &quot;You Know What They Say...&quot;<br/>\n<br/>\nPage 31...<br/>\n<br/>\n&quot;Rewards motivate people...Whether we know it or not, most of us act <br/>\nlike Skinnerians.  It was the Harvard psychologist B.F. Skinner who <br/>\npopularized the theory of positive reinforcement, which holds that <br/>\npresenting a reward after a desired behavior will make that behavior <br/>\nmore likely to occur in the future.  We apply this principle not <br/>\nonly to training the family pet, but also to raising children, <br/>\nteaching students, and managing employees.  If it&#39;s not a doggie <br/>\nbiscuit we offer, then it&#39;s an extra dessert or and A on the report <br/>\ncard or a performance bonus.  <br/>\n<br/>\nThe problem is that this approach often backfires, particularly when <br/>\nwe&#39;re trying to encourage people to be creative.  In one study, <br/>\nfifth- and sixth-grade students were asked to teach a new game to a <br/>\nyounger child.  Those who were promised a free movie ticket for <br/>\ntutoring well turned out to be much less effective than the children <br/>\nwho weren&#39;t promised anything: They took longer to communicate <br/>\nideas, got frustrated more easily, and ended up with pupils who <br/>\ndidn&#39;t understand the game.  In another study, people who expected <br/>\nto receive a prize for making collages or telling stories proved to <br/>\nbe less imaginative at both tasks than those who received nothing.  <br/>\nAnd in a recent review of programs used by twenty-eight different <br/>\ncompanies to encourage seat belt use among employees, the worst <br/>\nresults-especially over the long haul-came from the programs that <br/>\nused prizes to motivate people to buckle up.<br/>\n<br/>\nLots of other research shows the same thing: rewards can be <br/>\ncounterproductive.  The reason, it turns out, is connected to what <br/>\npsychologists call&quot;intrinsic motivation&quot;-a fancy term for enjoying <br/>\nwhat you do.  The fact is that no artificial inducement to do a good <br/>\njob can motivate you as effectively as loving your work.  (Just <br/>\nthink about someone you know who is sensational at what he or she <br/>\ndoes.  Now ask youself whether that person enjoys doing it or is <br/>\nmotivated by a paycheck.)<br/>\n<br/>\nBut not only are rewards less effective than intrinsic motivation-<br/>\nthey actually undermine it.  You started out doing somthing just <br/>\nbecause you found it fun.  But once you were rewarded for doing it, <br/>\nyou came to see yourself as working mostly to get the reward.  Your <br/>\nfascination with the task mysteriously vanished along the way and <br/>\nnow you can&#39;t be bothered to do it unless there&#39;s some reward at <br/>\nstake.&quot;<br/>\n<br/>\nIn the same chapter he goes on to say...<br/>\n<br/>\n&quot;But rewards can be bad news for still another reason: They <br/>\nencourage us to focus narrowly on a task, to do it as quickly as <br/>\npossible and to take few risks.  This approach is death to <br/>\ninnovation and artistic exploration.  &quot;If they feel &#39;this is <br/>\nsomething I have to get through to get the prize,&#39; they&#39;re going to <br/>\nbe less creative,&quot; says Brandeis University&#39;s Teresa Amabile.  The <br/>\nmore emphasis that is placed on an artificial motivator, the more <br/>\ninclined someone will be to do the minimum necessary to obtain it.<br/>\n<br/>\nIf the question, then, is whether rewards motivate people, the <br/>\nanswer is sure-they motivate people to get rewarded.  Unfortunately, <br/>\nthis is often at the expense of interest in, or excellence at, <br/>\nwhatever it is they&#39;re doing.  The result is that millions of well-<br/>\nmeaning teachers and managiers are at this very moment <br/>\nsystematically destroying the very creativity and curiosity they&#39;re <br/>\ntrying to promote.<br/>\n<br/>\nOther researchers have found that rewards are just as deadly when it <br/>\ncomes to encouraging good behavior.  It&#39;s tempting to promise a <br/>\nchild another hour of television or some ice cream if he or she does <br/>\nwhat you want.  Indeed, positive reinforcement is seen by many <br/>\nparents as a progressive alternative to punishment.  The trouble is <br/>\nthat neither punishment nor bribes (which is really what rewards <br/>\nare) help a child to understand the reason for doing something, <br/>\nwhich means he or she is unlikely to keep doing it when there&#39;s no <br/>\none around to dish out a goodie.  Nevermind that it&#39;s manipulative-<br/>\nrewarding is simply ineffective as a long-range strategy.&quot;<br/>\n<br/>\nThe chapter says a little more, but the above really sunk in for <br/>\nme.  It has been a few weeks since we eliminated the &quot;dreaded chore <br/>\nchart&quot; in our home.  We have made great strides in a very little <br/>\namount of time.  <br/>\n<br/>\nI have not &quot;fought&quot; with any child about anything.  We made an <br/>\nagreement that we would take care of things when we noticed that <br/>\nthey needed to be done, and if something started getting out of hand <br/>\nI would be able to ask someone to take care of it.  (Acknowledging <br/>\nthat I cannot, humanly, do everything) Everyone seems very happy <br/>\nwith our new lifestyle choice.  The amazing thing to me is that our <br/>\nhome has stayed clean for an ENTIRE WEEK, and no one has assigned <br/>\nchores.  <br/>\n<br/>\nDo you understand what happened here?  We eliminated assigned chores <br/>\nand received a happy AND orderly home.  Children that used to whine <br/>\nand complain and avoid helping now do it willingly and cheerfully.  <br/>\nWe are not stressed about our living environment.  What a blessing!  <br/>\n<br/>\nThis has been a wonderful experience for us, and I hope that others <br/>\nof you in similar situations have an equally enjoyable experience as <br/>\nwell.<br/>\n<br/>\nTina</div>","specialLinks":[]}],"prevTopicId":6043,"nextTopicId":6060}}