{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: need advice on bedtime issues","postDate":"1227306903","msgId":37083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzM0JFREI5LTNBMUMtNDg0Qy04OEZFLUJDNzUwRERDNDJGRUBtYWMuY29tPg==","inReplyToHeader":"PEQ2MDlDNEMyLUYwQTYtNEJDRS1COUY2LUJGQkQ0MzE0OTgyMEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGdnNG9vbSs5bm5AZUdyb3Vwcy5jb20+IDxENjA5QzRDMi1GMEE2LTRCQ0UtQjlGNi1CRkJENDMxNDk4MjBAdmVyaXpvbi5uZXQ+"},"prevInTopic":37082,"nextInTopic":0,"prevInTime":37082,"nextInTime":37084,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... They always had the freedom to choose when to go to sleep - you can t make anybody go to sleep, really. You mean you gave them the freedom to not stay in","messageBody":"<div id=\"ygrps-yiv-364221207\">On Nov 21, 2008, at 3:57 AM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Our dds, 7 and 9, have been given the freedom to choose when to go<br/>\n&gt;&gt; to sleep.<br/>\n<br/>\n </span></blockquote>They always had the freedom to choose when to go to sleep - you can&#39;t  <br/>\nmake anybody go to sleep, really. You mean you gave them the freedom  <br/>\nto not stay in their beds with the lights off?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We figured out Mommy and Daddy need some quiet time<br/>\n&gt;&gt; alone after around 9 so the kids go upstairs and I read them their<br/>\n&gt;&gt; story.<br/>\n<br/>\n </span></blockquote>&quot;We?&quot;<br/>\n<br/>\nIs this a euphemism for the two of you having sex? Or do you mean he  <br/>\nwants to watch tv without the inconvenience of his children being  <br/>\naround?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Then, we&#39;ve asked that they play quietly out of respect for<br/>\n&gt;&gt; us downstairs.<br/>\n<br/>\n </span></blockquote>Better not to use the word &quot;respect&quot; in this context, when you&#39;re  <br/>\nmaking demands on them. It sounds like very conventional parents who  <br/>\nare demanding that they act like they have respect. You don&#39;t get real  <br/>\nrespect by demanding it - quite the opposite. Use the word respect  <br/>\nwhen you&#39;re considering how you earn it, instead.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Dh is getting frustrated that he has to keep asking<br/>\n&gt;&gt; them repeatedly each night to settle down.<br/>\n<br/>\n </span></blockquote>Has to?<br/>\n<br/>\nWhat are they doing that is so loud that it is bothering you even in  <br/>\nanother part of the house, anyway? Does every little noise bother him?  <br/>\n(I mean, it doesn&#39;t sound like he&#39;s trying to sleep - you said &quot;Mommy  <br/>\nand Daddy need some quiet time,&quot; not that he needs to sleep.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  Last night, he told<br/>\n&gt;&gt; them he was tired of this and told them to go to bed.  What to do?<br/>\n<br/>\n </span></blockquote>Build a nest on the floor for them, put on a nice family video, lower  <br/>\nthe lights, enjoy yourselves as a family. You and dh can snuggle up,  <br/>\ntoo, WITH the kids there. If he doesn&#39;t want to spend time with the  <br/>\nwhole family, can&#39;t he go off somewhere else to be by himself?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n&gt;&gt; I&#39;d like to show dh that giving the girls freedom is actually<br/>\n&gt;&gt; beneficial but this situation isn&#39;t helping.<br/>\n<br/>\n </span></blockquote>I might be wrong, but it sounds like you want to loosen up and let the  <br/>\nkids have more choices, but somehow want it to still work out that  <br/>\nyour husband gets exactly what he wants, regardless of what the kids  <br/>\nwant. That probably can&#39;t happen.<br/>\n<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: need advice on bedtime issues","postDate":"1227268631","msgId":37082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2MDlDNEMyLUYwQTYtNEJDRS1COUY2LUJGQkQ0MzE0OTgyMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdnNG9vbSs5bm5AZUdyb3Vwcy5jb20+","referencesHeader":"PGdnNG9vbSs5bm5AZUdyb3Vwcy5jb20+"},"prevInTopic":37081,"nextInTopic":37083,"prevInTime":37081,"nextInTime":37083,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... 99% of my site is me. That If/then page (http://tinyurl.com/5ryo5d) happens to be mostly other people since I didn t have much practical to say on bedtimes","messageBody":"<div id=\"ygrps-yiv-233400928\">On Nov 20, 2008, at 5:36 PM, Erin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, you mentioned that 8, 5, and 3 1/2 is really too young to let<br/>\n&gt; them stay up.<br/>\n<br/>\n </span></blockquote>99% of my site is me. That If/then page (<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/5ryo5d)\">http://tinyurl.com/5ryo5d)</a>  <br/>\nhappens to be mostly other people since I didn&#39;t have much practical  <br/>\nto say on bedtimes since my daughter liked to go to bed when we  <br/>\ndid. ;-) Sandra Dodd said that about the little kids. But that&#39;s just  <br/>\na clarification, not a disavowal. It&#39;s on my site so I agreed with it.<br/>\n<br/>\nIn the context Sandra was addressing, I&#39;d agree that *mix* of kids  <br/>\nsounds too young. (And the parents had started doing that the year  <br/>\nbefore so were even younger then.) But it&#39;s not a rule. It&#39;s a &quot;Look  <br/>\nat your kids, not at this new (bad) rule of let them stay up as late  <br/>\nas they want.&quot; The responsibility for the 5 and 3 1/2 yos shouldn&#39;t  <br/>\nbe handed to the 8 yo just because mom doesn&#39;t want to stay up and  <br/>\ncan&#39;t figure out how to help the kids to sleep.<br/>\n<br/>\nBut it doesn&#39;t say 8 yos should not be allowed to stay up. And there  <br/>\nare probably some hyperaware 3 1/2 yos who can be trusted to stay up  <br/>\non the computer and crawl into bed when they&#39;re done. That&#39;s why we  <br/>\ntalk about principles rather than rules.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The woman that asked the original question is talking<br/>\n&gt; about girls that are 9 and 7.  Might they be too young to have total<br/>\n&gt; freedom?<br/>\n<br/>\n </span></blockquote>First, we don&#39;t know them. It&#39;s up to the mom to know them and what  <br/>\nthey&#39;re capable of.<br/>\n<br/>\nSecond, the original scenario wasn&#39;t mom and dad going to bed and  <br/>\nkids staying up making noise. Though I&#39;ll address that. If the kids  <br/>\nare &quot;young&quot; and mom can&#39;t get them to sleep or *she* wants to allow  <br/>\nthem to stay up, she should be up with them to help them find quiet  <br/>\nactivities. &quot;Older&quot; kids who are choosing to stay up at night should  <br/>\nsee that as a privilege, not a right. *If* they want to stay up,  <br/>\n*then* they need to be quiet enough for others to sleep. It&#39;s  <br/>\ncourtesy. If they can&#39;t give the courtesy of quiet so others can  <br/>\nsleep, they need to go to bed. That would be true if they were  <br/>\nadults. And people need to extend that courtesy to anyone who wants  <br/>\nto sleep, be it the breadwinner or babies or other kids.<br/>\n<br/>\n(&quot;Young&quot; and &quot;older&quot; is up to the parents to decide. They should know  <br/>\ntheir kids and what they&#39;re able to do.)<br/>\n<br/>\nMom, though, is a special case. She&#39;s the one deciding to allow them  <br/>\nthe privilege to stay up. It&#39;s her responsibility -- until the kids  <br/>\nare mature enough -- to be the keeper of courtesy. Until the kids are  <br/>\nmature enough, she needs to be the one finding a way for the house to  <br/>\nbe quiet enough at night for those who want to sleep. That *might*  <br/>\nmean staying up, or finding a bedtime routine that works, or  <br/>\nsomething else. But *she&#39;s* responsible for allowing others to sleep.<br/>\n<br/>\nThe original scenario was different. I&#39;m assuming the 8&9 yo used to  <br/>\nhave to be in their rooms at 9 asleep or trying to sleep while their  <br/>\nparents enjoyed quiet downstairs. Now it&#39;s that same scenario but the  <br/>\nkids are allowed to be awake and quiet in their rooms (or loose in  <br/>\nthe house? It&#39;s not clear.) Here it is:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our dds, 7 and 9, have been given the freedom to choose when to go  <br/>\n&gt; to sleep.  We figured out Mommy and Daddy need some quiet time  <br/>\n&gt; alone after around 9 so the kids go upstairs and I read them their  <br/>\n&gt; story.  Then, we&#39;ve asked that they play quietly out of respect for  <br/>\n&gt; us downstairs.  Dh is getting frustrated that he has to keep asking  <br/>\n&gt; them repeatedly each night to settle down.  Last night, he told  <br/>\n&gt; them he was tired of this and told them to go to bed.  What to do?   <br/>\n&gt; I&#39;d like to show dh that giving the girls freedom is actually  <br/>\n&gt; beneficial but this situation isn&#39;t helping.<br/>\n<br/>\n </span></blockquote>The kids are showing they&#39;re not yet able to choose to be quiet so  <br/>\nthe mom has unreasonable expectations of her solution working.<br/>\n<br/>\nThey could go back to the old way of lights out at 9. Is it horrible  <br/>\npunishment? No (though with a caveat.) But the actions do say the  <br/>\nadult needs for quiet are more important than kid needs for  <br/>\nexploration. It will whittle at the relationship. The parent will  <br/>\nneed to make up for it in other ways. But if it&#39;s the only rule the  <br/>\nparents have, it&#39;s not going to be horrible. (I&#39;m not advocating it.  <br/>\nI think there are better solutions.)<br/>\n<br/>\n(The caveat is that there have been horror stories here from adults  <br/>\nwho, as kids, could not fall asleep, night after night, until 1 or 2  <br/>\nin the morning. Little kids lying awake at night for hours because  <br/>\nthe parents care more about their need for quiet than their child&#39;s  <br/>\nneed to sleep on a schedule that&#39;s more natural to them. That&#39;s just  <br/>\ncruel.)<br/>\n<br/>\nA need for sleep is universal. A need for alone time after 9 is  <br/>\narbitrary. I think that&#39;s pretty obvious if you turn the scenario  <br/>\naround and have a kid say each night. &quot;Hey, I&#39;m trying to sleep. You  <br/>\nparents need to be quiet.&quot; It would be rude for the parents to be  <br/>\nloud when kids are trying to sleep. But a kid who said, &quot;I need to be  <br/>\nalone after 9 so I need you to be quiet up in your bedroom then,&quot;  <br/>\nthat just sounds dictatorial!<br/>\n<br/>\nA more nurturing way is to create a bedtime routine that helps the  <br/>\nkids wind down. This will take time. The parents could start early  <br/>\nwith low lights, low energy activities, warm bath, snuggle in bed  <br/>\nreading so the house is set up to be conducive to sleep. I know some  <br/>\nparents are reading that and saying &quot;Yeah, right.&quot; ;-) It&#39;s going to  <br/>\ntake more creativity with some kids than with other kids. And for  <br/>\nthose kids who can&#39;t fall asleep until 1 AM it&#39;s probably not going  <br/>\nto work.<br/>\n<br/>\nAnother nurturing way is to allow them to sleep wherever. Set up  <br/>\nnests for them so they can fall asleep when they&#39;re tired wherever  <br/>\nthey are: in mom&#39;s lap, snuggled up on a comfy chair, in a sleeping  <br/>\nbag on the floor. The goal is to not get in the way of them noticing  <br/>\nwhen they&#39;re tired. They shouldn&#39;t feel like they&#39;re missing  <br/>\nsomething if they sleep. They should feel assured that they can wake  <br/>\nup any time and continue what they were doing.<br/>\n<br/>\nOr the mom can *choose* to stay up with them. This is not a  <br/>\nrequirement! And it&#39;s helpful to be aware, though, that staying up  <br/>\nlate if it&#39;s something they&#39;ve never been allowed to do, will seem  <br/>\nlike carnival time. And they&#39;ll likely get wound up and they&#39;ll push  <br/>\nthemselves until they&#39;re so wound up they can&#39;t fall asleep. This can  <br/>\ngo on for quiet some time.<br/>\n<br/>\nThat&#39;s why it&#39;s *much* better to say yes more rather than declare no  <br/>\nmore rules.<br/>\n<br/>\nIf you search for &quot;bedtime routine&quot; in the archives, and read the  <br/>\nthreads there, that will probably give you a better handle on what  <br/>\nI&#39;m talking about since there will be practical examples of what  <br/>\npeople did. And I&#39;m sure others will post to the current thread.<br/>\n<br/>\n(Or if someone knows of a particularly good thread in the archives,  <br/>\nthat would be helpful.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"If..then contracts WAS bedtime issues","postDate":"1227224959","msgId":37080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdnNHQxditpZ3BkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkzRkE5NDJBLUU0ODUtNDMzQi04RUFCLUMxMEMzRUZEMTc4Q0B2ZXJpem9uLm5ldD4="},"prevInTopic":37079,"nextInTopic":37081,"prevInTime":37079,"nextInTime":37081,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... hours ... house ... to ... I get up at 430am for work, so getting to bed early is important to me. You could say that we have an if...then contract similar","messageBody":"<div id=\"ygrps-yiv-1764376449\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll <br/>\n&lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; In the scenario on my page the breadwinner needs to sleep 6-8 <br/>\n </span></blockquote>hours  <br/>\n<blockquote><span title=\"ireply\"> &gt; before he or she has to leave for work on a fairly regular basis.  <br/>\n&gt; Work time is set by the business. That need to sleep at that  <br/>\n&gt; particular time trumps the need for kids to be up and about the <br/>\n </span></blockquote>house  <br/>\n<blockquote><span title=\"ireply\"> &gt; doing things they can do at other times of the day. If they want <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; be up doing when someone&#39;s trying to sleep, then they need to be  <br/>\n&gt; quiet enough for someone to sleep.<br/>\n<br/>\n </span></blockquote>I get up at 430am for work, so getting to bed early is important to <br/>\nme. You could say that we have an if...then contract similar to what <br/>\nJoyce describes. That the same contract applies to *me* as much as <br/>\nthe kids, though. If I expect to get a good night&#39;s sleep its <br/>\nimportant for me to be sure that my kids have what they need *before* <br/>\nI go to bed. If a parent is what they need, George and I have to work <br/>\nout that part - sure I need to be well rested for work, but he&#39;s the <br/>\nat-home parent and may need a break! That&#39;s something that gets <br/>\nworked into the whole if...then equation, too. Its a complex equation <br/>\nwith many variables!<br/>\n<br/>\nFor awhile we had a very explicit if...then contract with Ray. He <br/>\nwanted to try alcohol so we made a deal with him. He could have some <br/>\n*if* he didn&#39;t get obnoxious in that particular way people get when <br/>\nthey&#39;re drunk. He&#39;s seen enough rowdy drunks to know what that looks <br/>\nlike. We didn&#39;t just lay it out as a rule, though. We talked with him <br/>\nabout it, talked about fears and concerns *and* the fact that George <br/>\nand I just don&#39;t enjoy being around people who are wasted. We managed <br/>\nto create a context of &quot;we like you and want to be around you and <br/>\nsupport you while you try this&quot; while also expressing our own <br/>\npersonal boundaries. That sort of context is an important part of how <br/>\nradical unschoolers make agreements - real agreements - with kids.<br/>\n<br/>\nI said &quot;for awhile we had...&quot; which implies we don&#39;t have that <br/>\nagreement any more. In a sense I suppose we do, but really we <br/>\n(parents) don&#39;t have the same concerns anymore. We&#39;ve all had enough <br/>\nexperience in this area that its not something we *need* any kind of <br/>\novert agreement about. Ray doesn&#39;t want to get wasted and doesn&#39;t <br/>\nenjoy the kinds of parties where people are getting drunk. So its <br/>\nkind of a non-issue.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need advice on bedtime issues","postDate":"1227222675","msgId":37079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdnNHFxais5ZDVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdnMWtiYis2OWZpQGVHcm91cHMuY29tPg=="},"prevInTopic":37078,"nextInTopic":37080,"prevInTime":37078,"nextInTime":37080,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... This is a good suggestion just in general - helping kids come up with ideas of what to do when they re at loose ends. I find it helps my kids if I offer to","messageBody":"<div id=\"ygrps-yiv-741047907\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Erin&quot; &lt;theburkemommy@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Have you guys tried giving them suggestions of what they CAN do? <br/>\n<br/>\n </span></blockquote>This is a good suggestion just in general - helping kids come up with <br/>\nideas of what to do when they&#39;re at loose ends. I find it helps my kids <br/>\nif I offer to do things *with* them, even if its just to &quot;get them <br/>\nstarted&quot;. Mo, especially, tends to get all wrapped up in a project and <br/>\nwants to be left alone to work on it, but she also sometimes wants help <br/>\nor just company while she&#39;s transitioning into project mode. <br/>\n<br/>\nIn the evenings she&#39;s more likely to want a little company while she&#39;s <br/>\ntransitioning into sleep mode - but she doesn&#39;t like to be read to! So <br/>\nwe may play a game or just chat for a little while until she <br/>\nannounces &quot;I&#39;m going to bed&quot; where she may go to sleep *or* play with <br/>\nlegos until she drifts off.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":334729351,"authorName":"Erin","from":"&quot;Erin&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need advice on bedtime issues","postDate":"1227220566","msgId":37081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdnNG9vbSs5bm5AZUdyb3Vwcy5jb20+","inReplyToHeader":"PDkzRkE5NDJBLUU0ODUtNDMzQi04RUFCLUMxMEMzRUZEMTc4Q0B2ZXJpem9uLm5ldD4="},"prevInTopic":37080,"nextInTopic":37082,"prevInTime":37080,"nextInTime":37082,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"Yeah, you may want to fix the page!  I went back to take a look and it isn t obvious to me that you re speaking solely of a time that someone has a time","messageBody":"<div id=\"ygrps-yiv-1933641056\">Yeah, you may want to fix the page!  I went back to take a look and <br/>\nit isn&#39;t obvious to me that you&#39;re speaking solely of a time that <br/>\nsomeone has a time commitment and has to get to sleep (ie. the <br/>\nparents have a strict work schedule).<br/>\n<br/>\nAlso, you mentioned that 8, 5, and 3 1/2 is really too young to let <br/>\nthem stay up. The woman that asked the original question is talking <br/>\nabout girls that are 9 and 7.  Might they be too young to have total <br/>\nfreedom?  You mentioned there are steps between inflexible rules and <br/>\ntotal anarchy...do you have some examples you could share?<br/>\n<br/>\nWe are moving from the inflexible rules towards a more flexible place <br/>\nto be.  We have been turning our house &quot;quiet&quot; at about 10ish each <br/>\nnight (but that is NOT a definite time without regard for what <br/>\nthey&#39;re doing).  Our house is VERY small and we have lots of people <br/>\nliving here, so it&#39;s really important that our house is conducive to <br/>\nsleep for those that want/need it and yet still considerate of those <br/>\nthat aren&#39;t tired yet. <br/>\n<br/>\nI&#39;m curious to hear what others are doing besides setting a strict <br/>\nbedtime or giving the kids complete and total freedom to do whatever <br/>\nthey want until they finally pass out.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@yahoogroups.com, Joyce Fetteroll <br/>\n&lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Nov 19, 2008, at 1:02 PM, Erin wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; In<br/>\n&gt; &gt; my little opinion it&#39;s okay to say &quot;IF you can be quiet...THEN you<br/>\n&gt; &gt; can stay up&quot;.  But that also means IF you can&#39;t be quiet...then <br/>\n </span></blockquote>you<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; can&#39;t stay up.  One little warning that what they&#39;re doing isn&#39;t<br/>\n&gt; &gt; quiet and then the second time it&#39;s off to bed.  They can try <br/>\n </span></blockquote>again<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; the next night.<br/>\n&gt; &gt;<br/>\n&gt; &gt; http://joyfullyrejoycing.com/changing%<br/>\n </span></blockquote>20parenting/ifthencontracts.html<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Maybe I need to clarify that page if it left the impression that <br/>\n </span></blockquote>it/ <br/>\n<blockquote><span title=\"ireply\"> &gt; then contracts were for training kids.<br/>\n&gt; <br/>\n&gt; In the scenario on my page the breadwinner needs to sleep 6-8 <br/>\n </span></blockquote>hours  <br/>\n<blockquote><span title=\"ireply\"> &gt; before he or she has to leave for work on a fairly regular basis.  <br/>\n&gt; Work time is set by the business. That need to sleep at that  <br/>\n&gt; particular time trumps the need for kids to be up and about the <br/>\n </span></blockquote>house  <br/>\n<blockquote><span title=\"ireply\"> &gt; doing things they can do at other times of the day. If they want <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; be up doing when someone&#39;s trying to sleep, then they need to be  <br/>\n&gt; quiet enough for someone to sleep.<br/>\n&gt; <br/>\n&gt; Maybe it&#39;s clearer to think if a situation has factors that are <br/>\n </span></blockquote>out  <br/>\n<blockquote><span title=\"ireply\"> &gt; of someone&#39;s control. A work schedule, a project deadline, a sick  <br/>\n&gt; child, a family member in crisis. Time inflexible needs trump time  <br/>\n&gt; flexible needs. (That shouldn&#39;t be a signal to stop creative <br/>\n </span></blockquote>problem  <br/>\n<blockquote><span title=\"ireply\"> &gt; solving, though! Being in their rooms so someone can sleep might <br/>\n </span></blockquote>not  <br/>\n<blockquote><span title=\"ireply\"> &gt; be the only option.)<br/>\n&gt; <br/>\n&gt; But couple time (whether a movie or sex or talking) doesn&#39;t need <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; happen at 9 PM each night. That&#39;s been arbitrarily decided. It&#39;s a  <br/>\n&gt; time that&#39;s convenient for the parents and can happen throughout <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; week in more creative ways. Baby sitters can be hired. Trading off  <br/>\n&gt; kids with other couples.<br/>\n&gt; <br/>\n&gt; I bet if &quot;couple time&quot; were searched in the archives, some more <br/>\n </span></blockquote>ideas  <br/>\n<blockquote><span title=\"qreply\"> &gt; would come up.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula Moyer","from":"Krisula Moyer &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: need advice on bedtime issues","postDate":"1227208908","msgId":37078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCNEZDOTQyLTkzMTQtNEJFRi1COUFELTlFNjYwQUFGOTM1QUBnbWFpbC5jb20+"},"prevInTopic":37075,"nextInTopic":37079,"prevInTime":37077,"nextInTime":37079,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"Joyce said:  ","messageBody":"<div id=\"ygrps-yiv-2038705654\">Joyce said:  &lt;&lt;You&#39;ll make your life much much easier if you work with  <br/>\nyou kids now<br/>\nrather than against them.&gt;&gt;<br/>\n<br/>\n\tI wanted to share how that has looked in our family about this  <br/>\nissue.  There are 5 of us, and each of us has times we go to bed early  <br/>\nand wake early and times we go to bed late and wake late.   Eric(DH)  <br/>\nand I grab our alone time on either end of this spectrum, usually  <br/>\naround the needs of the youngest who still likes me to sit with her as  <br/>\nshe falls asleep (sweet) but sometimes based on the 13yo who likes me  <br/>\nto read to her at night.  (cool now she&#39;s got such good taste in books)<br/>\n<br/>\n\tSo if the kids are up late I&#39;ll grab a nap while they&#39;re playing, and  <br/>\nDH will go to bed.  I&#39;ll get up to read and kiss goodnight etc when  <br/>\nthey&#39;re ready and then I can get up early with dh.  We often ride our  <br/>\nbikes together (we did this morning actually) sometimes we catch up  <br/>\nwith each other over coffee or lie in bed (ahem) together.  The kids  <br/>\nare asleep because they were up late.  It works really well for us.<br/>\n<br/>\nSometimes I fail to manage my time right and end up staying up late  <br/>\nand waking early and on those days I do get cranky but usually I  can  <br/>\nfigure out a way to make it work.<br/>\n<br/>\nI don&#39;t share these arrangements with my more traditional friends and  <br/>\nfamily because they would think I&#39;m totally nuts but I don&#39;t really  <br/>\nsee a down side.  My husband is happy, the kids are happy, Someday I&#39;m  <br/>\nsure I&#39;ll miss it.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: need advice on bedtime issues","postDate":"1227177823","msgId":37075,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzRkE5NDJBLUU0ODUtNDMzQi04RUFCLUMxMEMzRUZEMTc4Q0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdnMWtiYis2OWZpQGVHcm91cHMuY29tPg==","referencesHeader":"PGdnMWtiYis2OWZpQGVHcm91cHMuY29tPg=="},"prevInTopic":37074,"nextInTopic":37078,"prevInTime":37074,"nextInTime":37076,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... Maybe I need to clarify that page if it left the impression that it/ then contracts were for training kids. In the scenario on my page the breadwinner","messageBody":"<div id=\"ygrps-yiv-537761816\">On Nov 19, 2008, at 1:02 PM, Erin wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; In<br/>\n&gt; my little opinion it&#39;s okay to say &quot;IF you can be quiet...THEN you<br/>\n&gt; can stay up&quot;.  But that also means IF you can&#39;t be quiet...then you<br/>\n&gt; can&#39;t stay up.  One little warning that what they&#39;re doing isn&#39;t<br/>\n&gt; quiet and then the second time it&#39;s off to bed.  They can try again<br/>\n&gt; the next night.<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html\">http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html</a><br/>\n<br/>\n </span></blockquote>Maybe I need to clarify that page if it left the impression that it/ <br/>\nthen contracts were for training kids.<br/>\n<br/>\nIn the scenario on my page the breadwinner needs to sleep 6-8 hours  <br/>\nbefore he or she has to leave for work on a fairly regular basis.  <br/>\nWork time is set by the business. That need to sleep at that  <br/>\nparticular time trumps the need for kids to be up and about the house  <br/>\ndoing things they can do at other times of the day. If they want to  <br/>\nbe up doing when someone&#39;s trying to sleep, then they need to be  <br/>\nquiet enough for someone to sleep.<br/>\n<br/>\nMaybe it&#39;s clearer to think if a situation has factors that are out  <br/>\nof someone&#39;s control. A work schedule, a project deadline, a sick  <br/>\nchild, a family member in crisis. Time inflexible needs trump time  <br/>\nflexible needs. (That shouldn&#39;t be a signal to stop creative problem  <br/>\nsolving, though! Being in their rooms so someone can sleep might not  <br/>\nbe the only option.)<br/>\n<br/>\nBut couple time (whether a movie or sex or talking) doesn&#39;t need to  <br/>\nhappen at 9 PM each night. That&#39;s been arbitrarily decided. It&#39;s a  <br/>\ntime that&#39;s convenient for the parents and can happen throughout the  <br/>\nweek in more creative ways. Baby sitters can be hired. Trading off  <br/>\nkids with other couples.<br/>\n<br/>\nI bet if &quot;couple time&quot; were searched in the archives, some more ideas  <br/>\nwould come up.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need advice on bedtime issues","postDate":"1227164067","msgId":37074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdnMzFqMytlcTdwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdnMWtiYis2OWZpQGVHcm91cHMuY29tPg=="},"prevInTopic":37071,"nextInTopic":37075,"prevInTime":37073,"nextInTime":37075,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... I think you re misunderstanding the point that Joyce was trying to make on that webpage. In the above scenario it s just the parents forcing the kids to","messageBody":"<div id=\"ygrps-yiv-1308483179\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Erin&quot; &lt;theburkemommy@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Have you guys tried giving them suggestions of what they CAN do?  In <br/>\n&gt; my little opinion it&#39;s okay to say &quot;IF you can be quiet...THEN you <br/>\n&gt; can stay up&quot;.  But that also means IF you can&#39;t be quiet...then you <br/>\n&gt; can&#39;t stay up.  One little warning that what they&#39;re doing isn&#39;t <br/>\n&gt; quiet and then the second time it&#39;s off to bed.  They can try again <br/>\n&gt; the next night.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>I think you&#39;re misunderstanding the point that Joyce was trying to<br/>\nmake on that webpage. In the above scenario it&#39;s just the parents<br/>\nforcing the kids to act a certain way and using punishment. If the<br/>\nchildren really can&#39;t be quiet and someone needs to sleep, then an<br/>\nadult needs to be present to help them keep the noise down or keep the<br/>\nnoise in a certain area.<br/>\n<br/>\nThe scenario wasn&#39;t about someone sleeping though. It was the adults<br/>\ntrying to make the children be quiet and leave them alone. If the<br/>\nchildren are unable to be quiet, that&#39;s a clear signal they are<br/>\nchoosing to NOT sleep. If they aren&#39;t ready to sleep, they might need<br/>\ntheir parents available!<br/>\n<br/>\nGetting children to do what we want is convenient. But it&#39;s not<br/>\nconsidering their needs along with your own. That whole &quot;if/then&quot;<br/>\nthing really bothers me. It&#39;s not about bribing kids. Joyces examples<br/>\nwere about the reality of how society works. I certainly wouldn&#39;t<br/>\nencourage &quot;if/then&quot; contracts as a useful tool in working towards<br/>\nmindful parenting if they&#39;re being used to extract certain behavior. <br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need advice on bedtime issues","postDate":"1227144817","msgId":37069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdnMmVwaCtzNzljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFRjZBRjE4N0Q1QTRDQTg4MTNDRTE1MTk1QUYxRTA0QFJvY2tldFNhdWNlMj4="},"prevInTopic":37068,"nextInTopic":37071,"prevInTime":37068,"nextInTime":37070,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... Something that helps in our house is an understanding that, while George and I both need a certain amount of quiet time, alone time and adult time, those","messageBody":"<div id=\"ygrps-yiv-2103619711\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;DJ250&quot; &lt;dj250@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We figured out Mommy and Daddy need some quiet time alone<br/>\n<br/>\n </span></blockquote>Something that helps in our house is an understanding that, while <br/>\nGeorge and I both need a certain amount of quiet time, alone time <br/>\nand &quot;adult&quot; time, those things don&#39;t have to coincide every day. We <br/>\nfind ways to flirt with each other pretty much anytime - a meaningful <br/>\nglance here, a &quot;coded&quot; remark there... so we get some of our personal <br/>\nneeds met that way. We each have strategies for finding time alone. <br/>\nHe can feel a sense of &quot;alone&quot; if he&#39;s playing music, even if he&#39;s <br/>\nright in the living room, for example. I can get a little &quot;alone&quot; <br/>\ntime by &quot;veging out&quot; while watching a kid play a video game. And when <br/>\nits quiet - ahhhhhhh! With two pretty energetic kids, we take our <br/>\nmoments of silence seriously!<br/>\n<br/>\nAnyway, since we&#39;re meeting some of those needs in other ways, we&#39;re <br/>\nbetter able to be available in the evenings, even if we&#39;re both <br/>\ntired. One of us will hang out with the kids if they need a parent - <br/>\nand Mo often has a Lot of energy in the evenings, which drives Ray <br/>\nnuts, so a parent is often needed to smooth things over until she <br/>\nwinds down. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d like to show dh that giving the girls freedom is actually <br/>\n&gt;beneficial but this situation isn&#39;t helping.<br/>\n<br/>\n </span></blockquote>Beneficial how? I&#39;m not meaning to be snarky, it sounds like you have <br/>\nsome kind of assumption or expectation and it could be getting in the <br/>\nway of your problem solving. If the assumption is that giving the <br/>\ngirls more freedom will lead to them showing more responsibility, <br/>\ndropping any kind of limit isn&#39;t going to show that immediately - and <br/>\nif you drop a limit without providing any support, maybe not at all.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: need advice on bedtime issues","postDate":"1227130323","msgId":37068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NEFFNDI1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":37065,"nextInTopic":37069,"prevInTime":37067,"nextInTime":37069,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"We ve only got one offspring and more kids = more volume no matter what (same as when you get two or more adults together - I ve even noticed that the room","messageBody":"<div id=\"ygrps-yiv-750403352\">We&#39;ve only got one offspring and more kids = more volume no matter what (same as when you get two or more adults together - I&#39;ve even noticed that the room seems louder when DH and DS come in than when I&#39;m in a room by myself, even if all they&#39;re doing is sitting there quietly watching TV with me). What we&#39;ve done is discuss the situation as a family, looking for family solutions. We told DS that mommy and daddy like to spend some time privately before mommy falls asleep (I WOH fulltime and I&#39;m here at work before 8 am Mon-Fri, being awake past about 10:30 is a stretch). He&#39;s free to be downstairs in the living room watching TV or playing on his laptop or whatever or he can be in his room or some of both. We&#39;ve, together, determined a workable TV volume (oh, parenthetically, SIL lives with us and her bed is against the wall that is back to back with the TV) for after 10 pm. DS knocks before he enters, just as we model knocking before entering his room if he&#39;s in there and the door is closed (or mostly closed). Sometimes, he NEEDS to be snuggled up with us, and we do that. However, he also knows that he&#39;s getting really too big to fit - mommy gets squashed between him and daddy and doesn&#39;t sleep well (grumpy mommy the next day). More often, he&#39;ll come snuggle for a bit then either go downstairs to play or ask me to tuck him into his bed. (Full disclosure: he has a TV/DVD in his room and his laptop is, well, a laptop that can be wherever he wants it). As Joyce noted, rather than making your need your kids&#39; problem to deal with, it is a family situation and needs family input. Maybe it would work better if you got up early with DH while the kids are still asleep. Maybe it would work for you and DH to &#39;trade&#39; kids once a week with a friend. There are all sorts of options besides sending the kids to bed at 9 pm &quot;because daddy said so&quot;<br/>\n<br/>\nYou might also take a bit of a look around the house - are there ways you can make things comfortable for the kids to stay up AND minimize volume from the area they are likely to be in? It&#39;s amazing what something like a big decorative quilt hung on the wall can do for sound dampening. Can they turn down the TV volume and use captioning to follow the details of a program (not all programs need captioning to follow the plot; not all programs have captioning available, such as older DVDs)? Can you put down a sheet or blanket on the floor to dampen the sound of legos and such? I&#39;d bet the kids can come up with some pretty creative ideas.<br/>\n<br/>\nBTW when we were discussing mommy and daddy having private time, a couple of things happened:<br/>\n1 - DS and I decided to have a once a week (or once every other week, it has varied over time)  &quot;date night&quot;, just the two of us. That seems to help fill his cup o&#39; mommy interaction pretty effectively. Perhaps you and your hubby can each spend one on one time doing something special with the kids - each take one then switch the following week maybe - to help fill that aspect of things. It seems, IME, that once DS knew that he wasn&#39;t being shut out but rather he was getting time with me *just like daddy* (regardless of the precise quantity), he didn&#39;t need to work so hard to get his fill.<br/>\n2 - DS wanted to know what mommy and daddy did during &#39;private time&#39; (he understood private since we&#39;ve accorded him privacy since he was a tot, when requested). So, I told him plainly (he was 8 or 9 at the time) that sometimes we just watch a movie that we know he wouldn&#39;t like, sometimes we talk about planning stuff, sometimes we snuggle, and sometimes we have sex. Once that percolated in his brain for a few days, I made a space to see if there were any other questions...yup, &quot;Well, what exactly IS sex?&quot; Gave him just the basics and he&#39;s okay with it so far - but at nearly 10 ½ I&#39;m pretty sure there&#39;s more ahead once puberty gets rolling full steam.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334729351,"authorName":"Erin","from":"&quot;Erin&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need advice on bedtime issues","postDate":"1227117739","msgId":37071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdnMWtiYis2OWZpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFRjZBRjE4N0Q1QTRDQTg4MTNDRTE1MTk1QUYxRTA0QFJvY2tldFNhdWNlMj4="},"prevInTopic":37069,"nextInTopic":37074,"prevInTime":37070,"nextInTime":37072,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"Have you guys tried giving them suggestions of what they CAN do?  In my little opinion it s okay to say IF you can be quiet...THEN you can stay up .  But that","messageBody":"<div id=\"ygrps-yiv-1254045970\">Have you guys tried giving them suggestions of what they CAN do?  In <br/>\nmy little opinion it&#39;s okay to say &quot;IF you can be quiet...THEN you <br/>\ncan stay up&quot;.  But that also means IF you can&#39;t be quiet...then you <br/>\ncan&#39;t stay up.  One little warning that what they&#39;re doing isn&#39;t <br/>\nquiet and then the second time it&#39;s off to bed.  They can try again <br/>\nthe next night.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html\">http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;DJ250&quot; &lt;dj250@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi, Folks,<br/>\n&gt; <br/>\n&gt; Our dds, 7 and 9, have been given the freedom to choose when to go <br/>\nto sleep.  We figured out Mommy and Daddy need some quiet time alone <br/>\nafter around 9 so the kids go upstairs and I read them their story.  <br/>\nThen, we&#39;ve asked that they play quietly out of respect for us <br/>\ndownstairs.  Dh is getting frustrated that he has to keep asking them <br/>\nrepeatedly each night to settle down.  Last night, he told them he <br/>\nwas tired of this and told them to go to bed.  What to do?  I&#39;d like <br/>\nto show dh that giving the girls freedom is actually beneficial but <br/>\nthis situation isn&#39;t helping.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; ~Melissa :)<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] need advice on bedtime issues","postDate":"1227096293","msgId":37065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBQzM0MjlELUI5NEItNEY0NS1BQ0Y4LTMxN0YwNDlDMDBCQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDFFRjZBRjE4N0Q1QTRDQTg4MTNDRTE1MTk1QUYxRTA0QFJvY2tldFNhdWNlMj4=","referencesHeader":"PDFFRjZBRjE4N0Q1QTRDQTg4MTNDRTE1MTk1QUYxRTA0QFJvY2tldFNhdWNlMj4="},"prevInTopic":37063,"nextInTopic":37068,"prevInTime":37064,"nextInTime":37066,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"... This is pretty much destined to failure since it s taking a problem -- parents wanting alone time -- and then imposing a solution on the kids. The problem","messageBody":"<div id=\"ygrps-yiv-1662463639\">On Nov 18, 2008, at 8:16 PM, DJ250 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our dds, 7 and 9, have been given the freedom to choose when to go  <br/>\n&gt; to sleep.  We figured out Mommy and Daddy need some quiet time  <br/>\n&gt; alone after around 9 so the kids go upstairs and I read them their  <br/>\n&gt; story.  Then, we&#39;ve asked that they play quietly out of respect for  <br/>\n&gt; us downstairs.<br/>\n<br/>\n </span></blockquote>This is pretty much destined to failure since it&#39;s taking a problem  <br/>\n-- parents wanting alone time -- and then imposing a solution on the  <br/>\nkids. The problem then shifts from alone time to making the kids  <br/>\ncomply with the imposed solution.<br/>\n<br/>\nIf your husband wanted to read alone after 10 every night and decided  <br/>\nyou should be in your room so the house was quiet for him, how would  <br/>\nthat solution feel to you?<br/>\n<br/>\nMeeting needs by taking from someone else -- eg, taking the kids&#39;  <br/>\nfreedom to play outside their room -- are pretty much destined to fail.<br/>\n<br/>\nI think the original problem needs reapproached and new solutions  <br/>\ngenerated. The biggest problem, though, is parents expecting kids to  <br/>\nbe like toys the parents can put away when it&#39;s convenient for the  <br/>\nparents. It&#39;s going to tear at all your relationships with each other  <br/>\nwhen kids then act like kids and don&#39;t want to be turned off when  <br/>\nparents are done playing! ;-) No matter how ingrained in adults the  <br/>\nexpectation is that parents can get what they want by telling the  <br/>\nkids to do what the parents say, no one has ever gotten it to work  <br/>\nwithout breaking down some of the relationship between parents and kids.<br/>\n<br/>\nAs difficult as this time seems right now, the more you nurture the  <br/>\nrelationship, the fewer times you take from the relationship to make  <br/>\nright now convenient for you, the easier it will be when they&#39;re  <br/>\nteens and they have the ability to say &quot;Screw you!&quot; and storm off  <br/>\ninto the night.<br/>\n<br/>\nYou&#39;ll make your life much much easier if you work with you kids now  <br/>\nrather than against them.<br/>\n<br/>\nI bet there are people here with solutions that worked for them that  <br/>\nyou never would have thought of :-) But it&#39;s not going to look like  <br/>\nkids quietly playing upstairs in their rooms each night at 9 while  <br/>\nyou watch TV. That one you&#39;re going to have to let go of ;-) You  <br/>\n*might* though be able to negotiate an occasional night like that  <br/>\nwhen the kids know you&#39;re on their side, helping them get their needs  <br/>\nmet.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"need advice on bedtime issues","postDate":"1227057377","msgId":37063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFRjZBRjE4N0Q1QTRDQTg4MTNDRTE1MTk1QUYxRTA0QFJvY2tldFNhdWNlMj4="},"prevInTopic":0,"nextInTopic":37065,"prevInTime":37062,"nextInTime":37064,"topicId":37063,"numMessagesInTopic":0,"msgSnippet":"Hi, Folks, Our dds, 7 and 9, have been given the freedom to choose when to go to sleep.  We figured out Mommy and Daddy need some quiet time alone after around","messageBody":"<div id=\"ygrps-yiv-1807048468\">Hi, Folks,<br/>\n<br/>\nOur dds, 7 and 9, have been given the freedom to choose when to go to sleep.  We figured out Mommy and Daddy need some quiet time alone after around 9 so the kids go upstairs and I read them their story.  Then, we&#39;ve asked that they play quietly out of respect for us downstairs.  Dh is getting frustrated that he has to keep asking them repeatedly each night to settle down.  Last night, he told them he was tired of this and told them to go to bed.  What to do?  I&#39;d like to show dh that giving the girls freedom is actually beneficial but this situation isn&#39;t helping.<br/>\n<br/>\nThanks,<br/>\n~Melissa :)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22132,"nextTopicId":37084}}