{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":141,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;Within reason&quot;","postDate":"1191643984","msgId":26763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUQ1RTY1M0VEQTZFNi0xMTVDLTczQjdATUJMSy1NMjkuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MTAxN3VmMjFlNTM2bThjOTIxNjRlN2E3OTI2ZWFAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPgkgPGZlNXF0NCtvbG1jQGVHcm91cHMuY29tPiA8NjdhOWQ3NTAwNzEwMDUxMDE3dWYyMWU1MzZtOGM5MjE2NGU3YTc5MjZlYUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":26762,"nextInTopic":26765,"prevInTime":26762,"nextInTime":26764,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... From: Karen Swanay  But the part of that I see missing here, and again it could be the way things are being said back and forth is","messageBody":"<div id=\"ygrps-yiv-1666726938\">-----Original Message-----<br/>\nFrom: Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt;<br/>\n<br/>\n But<br/>\nthe part of that I see missing here, and again it could be the way <br/>\nthings<br/>\nare being said back and forth is that with the respect I give to them, I<br/>\nexpect the same in return.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWell, in tradtional parenting, you get that respect simply by being the <br/>\nparent and having been on the planet for a very long time. You don&#39;t <br/>\nhave the show the child respect until he shows it to you 100% of the <br/>\ntime.<br/>\n<br/>\nIn gentle parenting, the CHILD gets respect simply because he&#39;s the <br/>\nchild and has only been on this planet for a very short while. He <br/>\ndoesn&#39;t have to show you respect until you&#39;ve earned it. &lt;g&gt;<br/>\n<br/>\nThe funny thing is: it doesn&#39;t take long to show genuine respect to <br/>\nsomeone who is respectful to you.<br/>\n<br/>\nI think it&#39;s best to back off on what I expect of the child until I <br/>\nhave shown him that I am worthy of respect and trust.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I am not here to pick up my son&#39;s underwear off<br/>\nthe bathroom floor when he&#39;s stepped over it 10 times this morning.  <br/>\nCould I<br/>\nhave picked it up?  Sure.  Have I picked it up in the past?  Yes.  But <br/>\nthis<br/>\nmorning, I noticed it when I was on my way to the shower and I said to <br/>\n(this<br/>\nis the 11yr old) &quot;Hey, I noticed your underwear and sleep shirt on the <br/>\nfloor<br/>\nin the bathroom, could you pick that up please?&quot; And then I told him I <br/>\nwas<br/>\ngetting into the shower.  That isn&#39;t any different than I would have <br/>\nspoken<br/>\nto my husband, mother, or friend.  They dropped it they can bend over <br/>\nand<br/>\npick it up.  That&#39;s just common courtesy and everyone living here <br/>\nhelping to<br/>\ntake care of the place we live.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWas it an order or a request?<br/>\n<br/>\nHonestly. Before typing out what you want to say, STOP and think about <br/>\nit clearly and without malice. Was it a command disguised as a question?<br/>\n<br/>\nMine do not *hesitate* to do things I ask of them---even difficult or <br/>\ntime-comsuming things---because they know that they can say &quot;No&quot; or <br/>\nLater&quot; or &quot;Mom, I just don&#39;t feel like it.&quot;  But *I* say those same <br/>\nthings sometimes. And that&#39;s OK---just as long as I&#39;m not saying them <br/>\nout of spite. Kids can see right through that. It&#39;s a lack of respect.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNow, I still yell, but a lot less in the last 4 days than previously.<br/>\nActually only once and that was this morning when the boys were <br/>\nfighting.<br/>\nThen I called them out here and talked to them about it and we (all <br/>\nthree)<br/>\ncame to a better plan of action than the fighting over the X-box.  I <br/>\nthought<br/>\nthat was successful.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYou bet!<br/>\n<br/>\nANd I&#39;m by nature a yeller, but it&#39;s almost gone. Only when really, <br/>\nreally stressed do I yell. But each choice is a move in the &quot;yell-less&quot; <br/>\ndirection! &lt;g&gt;<br/>\n<br/>\n-=-=-===<br/>\n<br/>\nI suppose I&#39;m not as far off as I feel I might be...but I still feel as<br/>\nthough a lot of people on here think I&#39;m a horrible parent who is<br/>\ncontinually stepping on the neck of my boys.  Perhaps in time I will <br/>\nshift<br/>\nmy thinking on baggy pants and other things I have that are rigid.  I do<br/>\nhave to remind myself it&#39;s been 4 days.  That&#39;s not a long time to undo <br/>\n36<br/>\nyrs of training.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nNo one thinks you&#39;re horrible. You&#39;re looking to learn to be <br/>\nbetter---and that&#39;s better than the majority of the parents! &lt;G&gt;<br/>\n<br/>\nTHis is NOT easy---simple, but not easy. It does get easier as you DO <br/>\nit though! &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":90144972,"authorName":"rpindc04","from":"&quot;rpindc04&quot; &lt;robbin_mp@...&gt;","profile":"rpindc04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191643138","msgId":26765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNzE2Mis1ZG5rQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOUQ1RDNFQUEzOUM2Ny0xMTVDLTcwNDlATUJMSy1NMjkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":26763,"nextInTopic":26766,"prevInTime":26764,"nextInTime":26766,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"Wow - you give me a lot to think about. With a 10-year old, just starting homeschooling and changing parenting ideas now, this makes my jaw drop. As with so","messageBody":"<div id=\"ygrps-yiv-1665039482\">Wow - you give me a lot to think about. With a 10-year old, just <br/>\nstarting homeschooling and changing parenting ideas now, this makes <br/>\nmy jaw drop. As with so much I read, it sounds great when writing <br/>\nwith hindsight. Question - how do make it day-to-day, when, for <br/>\ninstance, you don&#39;t know that Goth will be a short phase? I hear a <br/>\npotential answer is &quot;Trust your child.&quot; Does that get easier? I have <br/>\nsuch a visceral reaction to some things, that I think it will be <br/>\nharder to do that when some teen age issues come into the house. For <br/>\ninstance, I find some fashions incredibly unattractive. I don&#39;t want <br/>\nto have to look at them. How do you deal with the fact that you, <br/>\npersonally, think something is a bad choice, less than healthy, or <br/>\nunattractive/uncomfortable to live with in your own home?<br/>\n<br/>\n<br/>\nRobbin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n&gt;<br/>\n&gt; I&#39;ve been foolowing this thread closely, but I&#39;ve been really, <br/>\nreally <br/>\n&gt; busy. I will answer all the other posts as well, but I  thought I <br/>\n&gt; needed to chime in now.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: Karen Swanay &lt;luvbullbreeds@...&gt;<br/>\n&gt; <br/>\n&gt; Well I know they don&#39;t because they are 11 and 9 and they aren&#39;t <br/>\never <br/>\n&gt; out of<br/>\n&gt; my sight.  One of the downsides to being home with me all the time <br/>\nis <br/>\n&gt; they<br/>\n&gt; are with me all the time.<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt; At nine and 11, they should be with you a LOT.<br/>\n&gt; <br/>\n&gt; But what happens when they turn 14 and 16? They will most likely <br/>\nNOT be <br/>\n&gt; with you as much. You will have less and less control each year---<br/>\nas it <br/>\n&gt; *should* be! How do you plan to monitor what they do?<br/>\n&gt; <br/>\n&gt; -=-=-=-=-=-=-<br/>\n&gt; <br/>\n&gt; I hear what is being said now about no and yes.  I don&#39;t know that I<br/>\n&gt; completely buy that all kids raised this way will *never* want to do<br/>\n&gt; something that is completely inappropriate, ie illegal drugs, <br/>\nunderage<br/>\n&gt; drinking etc...but maybe this is OK with you all and you allow it. <br/>\nI <br/>\n&gt; don&#39;t<br/>\n&gt; know.<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; And...................this is my cue! &lt;g&gt;<br/>\n&gt; <br/>\n&gt; Frankly, I could&#39;ve said I won&#39;t &quot;allow&quot; it. But as I&#39;ve said soooo <br/>\n&gt; many times: I&#39;m not that stupid (not saying that *you* are! It&#39;s <br/>\njust <br/>\n&gt; something I&#39;ve said for years about this very subject.). I&#39;m not so <br/>\n&gt; stupid to think that *I* can control what someone else---even if <br/>\nit&#39;s <br/>\n&gt; my own kid---does. I CAN NOT. It&#39;s just not possible. I can only <br/>\n&gt; control *me*.<br/>\n&gt; <br/>\n&gt; As soon as that driver&#39;s license kicks in, parents are OUT of the <br/>\nloop <br/>\n&gt; unless they&#39;ve made it a PRIORITY to be trusted confidantes.<br/>\n&gt; <br/>\n&gt; My 19 year old, Cameron, was in school until the end of sixth <br/>\n&gt; grade---private prep school. We had a long deschooling process, but <br/>\nwe <br/>\n&gt; worked really hard to repair the damage. His best buds though were <br/>\n&gt; *all* schooled kids.<br/>\n&gt; <br/>\n&gt; Now, *I* don&#39;t think of teen sex, drugs, and drinking as <br/>\n&gt; &quot;innappropriate&quot; at all. I think they are *natural* progressions in <br/>\n&gt; life. NOT that *everyone* will do them (nor that anyone really <br/>\n&gt; *should*!), but that that is the age when it is---well, &lt;g&gt; <br/>\n&gt; &quot;age-appropriate&quot;! &lt;G&gt; They WILL try new things---and epecially <br/>\nthings <br/>\n&gt; that they have never experienced before. I really, really DO think <br/>\nit&#39;s <br/>\n&gt; natural. That doesn&#39;t make them any less potentially dangerous (not <br/>\n&gt; that any of them are inherently dangerous---just potentially). Just <br/>\n&gt; something that *I* really didn&#39;t want to shut down communication <br/>\nabout.<br/>\n&gt; <br/>\n&gt; In fact, I&#39;d rather shut down conversations on almost *anything* <br/>\n&gt; else!!! But what do parents forbid? Yep---the very thing we need to <br/>\nBE <br/>\n&gt; present for. The very things our children want more info on. What <br/>\ndo <br/>\n&gt; the children get from their parents instead? &quot;Don&#39;t even THINK <br/>\nabout <br/>\n&gt; drinking/drugs/sex!&quot; THose are the VERY things we need to be as <br/>\n&gt; involved in as possible.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; So---I had a son (and there&#39;s no one here who has met him that <br/>\ndoesn&#39;t <br/>\n&gt; know him to be kind and gentle and responsible and---just all-round <br/>\n&gt; great guy! He really is. I&#39;d think that if he weren&#39;t my first-<br/>\nborn! <br/>\n&gt; I&#39;m just lucky enough to have given birth to him!). So I have this <br/>\nson <br/>\n&gt; who drank, smoked pot, and had sex before he was 18.<br/>\n&gt; <br/>\n&gt; The world didn&#39;t end.<br/>\n&gt; <br/>\n&gt; Would I have been happier if he hadn&#39;t? I don&#39;t know. I think he <br/>\n&gt; learned a LOT. And none of it made him a less perfect, amazing <br/>\nperson. <br/>\n&gt; Seriously.<br/>\n&gt; <br/>\n&gt; He still will have an occasional high-end beer if we&#39;re having a <br/>\nparty. <br/>\n&gt; He&#39;ll have a glass of wine sometimes when we do. He and his <br/>\ngirlfriend <br/>\n&gt; may have a beer at friends&#39; houses (how would I know exactly?? He&#39;s <br/>\nnow <br/>\n&gt; 19---still under-age, but I know I truly have no control!). But <br/>\nhe&#39;s <br/>\n&gt; gotten drunk only once, and he&#39;s not a big fan of alcohol. It&#39;s <br/>\nreally <br/>\n&gt; not an issue.<br/>\n&gt; <br/>\n&gt; Pot---he had a while when he smoked a good bit. We talked a LOT <br/>\nabout <br/>\n&gt; it. I&#39;ve never smoked (I&#39;m 47 and one of the few people my age that <br/>\nI <br/>\n&gt; know who haven&#39;t ever toked), so I had very little experience with <br/>\nit. <br/>\n&gt; My husband smoked a bit in high school and was skeptical of my <br/>\ntactics. <br/>\n&gt; My GOAL was that Cameron be safe. Number One goal is safety. Cam <br/>\nKNOWS <br/>\n&gt; that. NOTHING is more important to me than his welfare.<br/>\n&gt; <br/>\n&gt; I&#39;m stressing this because he knows it---and he knows that I will <br/>\ndo <br/>\n&gt; ANYTHING to keep him safe. I canNOT stop him from being a teen and <br/>\n&gt; experimenting. I CAN, though BE there for him and make sure he gets <br/>\n&gt; home in one piece.<br/>\n&gt; <br/>\n&gt; SO----if he was at a friend&#39;s and smoked, he would CALL me. I would <br/>\ngo <br/>\n&gt; get him. We did this many, many times. I didn&#39;t ridicule him or <br/>\nyell at <br/>\n&gt; him or make him feel that it would be safer to drive himself home <br/>\nand <br/>\n&gt; hide it from me. I&#39;d rather KNOW where he was, with whom, and what <br/>\nthey <br/>\n&gt; were doing than be in the dark about his life---as all his friends&#39; <br/>\n&gt; parents were. Cameron felt safe and valued. His learning never went <br/>\ntoo <br/>\n&gt; far (as his friends&#39; did). We talked about where to buy pot, from <br/>\nwhom, <br/>\n&gt; about organic pot, about what people could put in it. I put him in <br/>\n&gt; touch with friends of mine who still smoked. They gave him GOOD <br/>\nadvice <br/>\n&gt; on what and whom to avoid and ansered many questions about it that <br/>\nI <br/>\n&gt; didn&#39;t know. He shared that with me as well.<br/>\n&gt; <br/>\n&gt; He joined NORML to try to get hemp and pot legalized. He learned a <br/>\nLOT <br/>\n&gt; about its production and prohibition. He&#39;s a knowledgable consumer. <br/>\n&lt;g&gt; <br/>\n&gt; Again---safety and knowledge are so key!<br/>\n&gt; <br/>\n&gt; I don&#39;t feel that I &quot;faciliated&quot; his pot-smoking, but I do feel he <br/>\nmade <br/>\n&gt; better decisions about it because of me and my openness. I wouldn&#39;t <br/>\nbuy <br/>\n&gt; it for him, and we talked about his jeopardizing our unschooling of <br/>\nhis <br/>\n&gt; little brother if he were to get caught. It was a VERY serious <br/>\nsubject <br/>\n&gt; here, and he took *his* responsibility with it very, very seriously.<br/>\n&gt; <br/>\n&gt; Sex. He&#39;s been sexually active for a while. Long-term girlfriend---<br/>\nover <br/>\n&gt; four years now? He didn&#39;t tell me before, but *just* afterwards. It <br/>\n&gt; wasn&#39;t unplanned---they had talked about it for quite a while. Do <br/>\n*I* <br/>\n&gt; feel it was too soon? As a parent, of course I do! &lt;G&gt; He should be <br/>\n35, <br/>\n&gt; right?  But we&#39;ve talked about sex from every angle. He&#39;s gentle <br/>\nand <br/>\n&gt; sweet with Carly, and they love each other. Exactly HOW is a parent <br/>\n&gt; planning to *stop* a teen from having sex? Again, the *best* thing <br/>\nI <br/>\n&gt; can do is to make sure he&#39;s informed and safe. Santa gives condoms <br/>\nin <br/>\n&gt; his stocking---did for several years before he was sexually active. <br/>\nBut <br/>\n&gt; all his friends knew that there was a &quot;stash&quot; in the upstairs <br/>\n&gt; bathroom---there for the taking. I told Carly I&#39;d take her to the <br/>\n&gt; gynocologist if her mother wouldn&#39;t.<br/>\n&gt; <br/>\n&gt; OPEN, HONEST Communication is THE most important thing we have <br/>\ngoing. I <br/>\n&gt; wouldn&#39;t trade THAT for all the non-smoking/non-drinking virgins in <br/>\nthe <br/>\n&gt; world!<br/>\n&gt; <br/>\n&gt; So, YES, some kids DO these things---even IF they are honored and <br/>\n&gt; respected and trusted. (He *was* schooled though for eight years, <br/>\nso <br/>\n&gt; it&#39;s hard to know what would have happened had he never been in <br/>\n&gt; school---I&#39;ll let you know how it goes with his alway-unschooled <br/>\n&gt; brother! &lt;g&gt;)<br/>\n&gt; <br/>\n&gt; OK---back to the regularly scheduled issues:<br/>\n&gt; <br/>\n&gt; -=-=-=-=-=-<br/>\n&gt; <br/>\n&gt; FWIW the sofa thing I did validate Liam&#39;s feelings because the sofa <br/>\nI <br/>\n&gt; wanted<br/>\n&gt; was 9K and white leather and I couldn&#39;t get it either.  We talked <br/>\nabout <br/>\n&gt; how<br/>\n&gt; nice it would be but we didn&#39;t have the space nor the money for <br/>\neither <br/>\n&gt; one.<br/>\n&gt; He was disappointed but I was too.  He didn&#39;t cry over it and I <br/>\ndon&#39;t<br/>\n&gt; believe it left a lasting scar.  But in the end those are the <br/>\nlimits we<br/>\n&gt; have, time, space and money and I don&#39;t have control over those.<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; REAL limits. See? They *do* exist! &lt;bwg&gt;<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt; RE: pants.  It&#39;s not going to happen.  I&#39;m not allowing my children <br/>\nto <br/>\n&gt; dress<br/>\n&gt; like gang members because they think it might be cool.  That <br/>\nprobably <br/>\n&gt; makes<br/>\n&gt; me a bad parent but that&#39;s the way it is.  I discussed the choices <br/>\nthey <br/>\n&gt; were<br/>\n&gt; thinking they&#39;d like to make and asked them what kind of things <br/>\nthey <br/>\n&gt; wanted<br/>\n&gt; people to think about them when they saw them.  They both said they <br/>\n&gt; didn&#39;t<br/>\n&gt; want people to think they were bad kids and came to baggy shorts <br/>\nwhich <br/>\n&gt; hang<br/>\n&gt; on their waists as a compromise.  I would however have held the <br/>\nline had<br/>\n&gt; they fought me.  Yeah that is probably wrong in your (the plural <br/>\nyou) <br/>\n&gt; eyes,<br/>\n&gt; but in the end, these kids are my responsibility to raise and I&#39;m <br/>\nnot <br/>\n&gt; going<br/>\n&gt; to allow them to glorify criminal behavior simply because they see <br/>\nit as<br/>\n&gt; popular culture.  (which btw was a passing fancy and they were <br/>\nquick to<br/>\n&gt; change to something different so I don&#39;t know that it was that<br/>\n&gt; overwhelmingly important to them.)  I&#39;m not going to let my 3 yr <br/>\nold <br/>\n&gt; dress<br/>\n&gt; like pedophile bait when she&#39;s 8 either.  There are limits in this <br/>\n&gt; world and<br/>\n&gt; some of them are artificially constructed.  Little girls shouldn&#39;t <br/>\nbe<br/>\n&gt; wearing pants that say &quot;taste me&quot; on the butt.  Might work in your <br/>\n&gt; family,<br/>\n&gt; it&#39;s not going to work here.<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; Cam was into Goth for a VERY brief period. I went with it. I think <br/>\n&gt; that, because I was so supportive, it didn&#39;t last long. I dyed his <br/>\nhair <br/>\n&gt; black for him; I bought him black nail polish; I bought him his own <br/>\n&gt; eye-liner; I bought lots of black clothes. *I* knew he wasn&#39;t Goth, <br/>\nbut <br/>\n&gt; I helped feed whatever that was that he needed. He went through it <br/>\n&gt; quickly, KNOWING that I respected his need to do and be that for a <br/>\n&gt; while.<br/>\n&gt; <br/>\n&gt; It&#39;s not that it was overwhelmingly important---but it WAS <br/>\nimportant <br/>\n&gt; for a while---even though just a passing fancy. He laughs about it <br/>\nnow. <br/>\n&gt; He felt validated and valued at the time. It really didn&#39;t hurt <br/>\n*me* <br/>\n&gt; any---even though it did &quot;glorify&quot; suicide and death. It wasn&#39;t Who <br/>\nHe <br/>\n&gt; Was---it was just a....passing fancy and part of popular culture.<br/>\n&gt; <br/>\n&gt; There are a lot of &quot;artificial&quot; limits. But I choose not to limit <br/>\nmy <br/>\n&gt; life with silly ones.<br/>\n&gt; <br/>\n&gt; And as my father says: NO one should be wearing pants with &quot;taste <br/>\nme&quot; <br/>\n&gt; on the butt---NOT just little girls! &lt;G&gt;<br/>\n&gt; <br/>\n&gt; =-=-=-=-=-<br/>\n&gt; <br/>\n&gt; Re: sex on the couch...you are right.  I&#39;m trying to find somewhere <br/>\n&gt; where<br/>\n&gt; someone says &quot;no&quot; but apparently that doesn&#39;t happen.  All behavior <br/>\nis <br/>\n&gt; OK.<br/>\n&gt; I don&#39;t know that I see that as correct.  And as I said before I <br/>\ndon&#39;t<br/>\n&gt; believe that because you raise your child with no limits that they <br/>\nwill<br/>\n&gt; automatically become kind sweet wonderful people.  There have to be<br/>\n&gt; instances where a child raised to do whatever whenever has gone <br/>\nwrong <br/>\n&gt; but I<br/>\n&gt; doubt anyone will admit to it.<br/>\n&gt; <br/>\n&gt; -=-=-=-=-=-<br/>\n&gt; <br/>\n&gt; I won&#39;t admit that Cameron has done anything &quot;wrong.&quot; I will say <br/>\nthat <br/>\n&gt; he&#39;s been busy learning a LOT. NONE of it made him a horrible <br/>\nperson. <br/>\n&gt; NOT ONE THING! And knowing that his parents were &quot;in his corner&quot; at <br/>\nall <br/>\n&gt; times encouraged him to BE SMART and be honest and be ....just <br/>\nSMART <br/>\n&gt; and thoughtful about things. He&#39;s not rash and reactive---he THINKS <br/>\n&gt; about things. And he has NOTHING to rebel against. Not one thing. <br/>\nWe <br/>\n&gt; accept that he will try things.<br/>\n&gt; <br/>\n&gt; I think it&#39;s dishonest and irresponsible for parents to encourage <br/>\n&gt; independent, explorers  throughout childhood and then turn around <br/>\nat 13 <br/>\n&gt; and say, &quot;NO! DON&#39;T! STOP!&quot; They&#39;re SUPPOSED to keep learning. It&#39;s <br/>\n&gt; what they DO! They should just be safe and thoughtful about it!<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt;  Still, this discussion has been good for<br/>\n&gt; me.  It has shown me how to switch my thinking.  I am getting <br/>\nthere.  <br/>\n&gt; This<br/>\n&gt; unlearning stuff is hard work! =)<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt; Yeah---I know!<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt; I do have to admit to something.  For the last 4 days I have said <br/>\nNo <br/>\n&gt; only 2<br/>\n&gt; times.  Once was because I physically could not take the kids <br/>\nanywhere <br/>\n&gt; (I<br/>\n&gt; have fibromyalgia, Systemic Lupus and Sjogren&#39;s Syndrome) and I am <br/>\n&gt; having a<br/>\n&gt; flare.  The boys didn&#39;t realize how sick I felt so I told them I <br/>\n&gt; couldn&#39;t do<br/>\n&gt; it now, but we would do later when I was better.  And the other was <br/>\nto <br/>\n&gt; make<br/>\n&gt; brown rice for dinner last night but it takes over an hour and we <br/>\ndidn&#39;t<br/>\n&gt; have time to do it so I&#39;m making it today.<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt; Karen, those are REAL limits. Life is FULL of those! We really <br/>\ndon&#39;t <br/>\n&gt; need to make up arbitrary limits to show kids that there are <br/>\nlimits. <br/>\n&gt; They exist. They&#39;re THERE!<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt;   The boys have not had one fight<br/>\n&gt; in 4 days.  That&#39;s amazing.  I asked my son (the 11 yr old) about <br/>\nit <br/>\n&gt; and he<br/>\n&gt; said it was because he didn&#39;t feel the stress of having to do <br/>\nschool <br/>\n&gt; and he<br/>\n&gt; felt less mad.  So that&#39;s a good thing.<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt; Of course---you may also be relaxing a bit, and they can *feel* <br/>\n&gt; that---whether you SHOW it or not. They are *feeling* the <br/>\ndifference!<br/>\n&gt; <br/>\n&gt; Keep in mind that that&#39;s what it&#39;s like with many of us all the <br/>\n&gt; time---the anxiety&#39;s gone. Not 100%----but just saying yes and not <br/>\n&gt; stressing over every little thing. Enjoy your kids and enjoy the <br/>\n&gt; precious little time you have with them. It goes sooo fast!<br/>\n&gt; <br/>\n&gt; -=-=-=-=-=-<br/>\n&gt; <br/>\n&gt; FTR I also asked the 11 yr old about &quot;no limits&quot; and he was <br/>\n&gt; uncomfortable<br/>\n&gt; with that.  He said he didn&#39;t want me and my husband to stop <br/>\ntelling him<br/>\n&gt; things and to stop providing guidance.  He said &quot;It would feel like <br/>\nyou<br/>\n&gt; didn&#39;t care what happened to me.&quot;   And I read him these posts so I <br/>\n&gt; could<br/>\n&gt; give him the information without my bias getting in his way.  (Not <br/>\nmy <br/>\n&gt; part<br/>\n&gt; just the answers with all identifiers removed.)  So, what do I do <br/>\nthere?<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; Karen, NO ONE here has said NO LIMITS!!!!!<br/>\n&gt; <br/>\n&gt; We say no *ARBITRARY* limits---can you see the difference???<br/>\n&gt; <br/>\n&gt; It&#39;s *one* word, but it makes ALL the difference!!!<br/>\n&gt; <br/>\n&gt; My children know real limits. They also know when someone is being <br/>\n&gt; arbitrary.<br/>\n&gt; <br/>\n&gt; NO ONE has said provide no guidance. We all provide guidance every <br/>\nday! <br/>\n&gt; We are the MOST &quot;guidant&quot; parents you&#39;ll ever meet!<br/>\n&gt; <br/>\n&gt; Lord, if I stopped &quot;telling&quot; my children things, what would I have <br/>\nleft <br/>\n&gt; to say? &lt;g&gt;I just don&#39;t TELL them what to do. I give choices. We <br/>\n&gt; discuss options. I tell them my concerns, and they tell me theirs. <br/>\nThe <br/>\n&gt; important things is that, if they don&#39;t make the same choice *I* <br/>\nwould <br/>\n&gt; make, I&#39;m still OK with that. If they made an informed choice <br/>\n(which <br/>\n&gt; turned out poorly) and *learned* something, they can always make a <br/>\n&gt; better choice next time. And it&#39;s MUCH better to learn to make <br/>\nthose <br/>\n&gt; kinds of decisions when the stakes are so much lower (like kinds of <br/>\n&gt; pants) than when they are life-altering (like buying a house or <br/>\n&gt; choosing a career).<br/>\n&gt; <br/>\n&gt; I cannot tell you how much I trust my boys. They are absolutely <br/>\n&gt; incredible learning machines. And they are lucky in that they get <br/>\nto <br/>\n&gt; see me make all kinds of goofy choices---as well as really good <br/>\nones. I <br/>\n&gt; try to stay as informed about my life AND theirs as I can. But to <br/>\nbe <br/>\n&gt; informed in their lives, they MUST trust me. MUST! They need to <br/>\nknow <br/>\n&gt; that they can make a bad decision and that I am still in their <br/>\ncorners. <br/>\n&gt; I am ALWAYS in their corners. Forever---no matter what. Drugs, <br/>\n&gt; drinking, sex---doesn&#39;t matter. I will support them and be there <br/>\nFOR <br/>\n&gt; them. It&#39;s important to all of us, and THEY know it. And they <br/>\ndidn&#39;t <br/>\n&gt; learn that by having me limit them or control *any*thing they did. <br/>\nThey <br/>\n&gt; learned it by having the freedom (and natural limits) to make <br/>\n&gt; choices---with my help, always.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n______________________________________________________________________<br/>\n__<br/>\n&gt; Email and AIM finally together. You&#39;ve gotta check out free AOL <br/>\nMail! - <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: &quot;Within reason&quot;","postDate":"1191643080","msgId":26762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUQ1RTQzOEVCNjVGMi0xMTVDLTczNjVATUJMSy1NMjkuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MTEyNmo3YmQ0NGMxMndkZDdkOWMyY2IwOGNjNGQ1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPgkgPGZlNWkwaSt0bXNiQGVHcm91cHMuY29tPgkgPDY3YTlkNzUwMDcxMDA1MDc1MWo3NGZhYjdhNHA2MDllOTBmNzEyZGJmOGFhQG1haWwuZ21haWwuY29tPgkgPEEyMkM0Q0Y2LTA0NzEtNDMxNS1CRTM3LUQ5NjMyNjZGNTk1Q0B2ZXJpem9uLm5ldD4gPDY3YTlkNzUwMDcxMDA1MTEyNmo3YmQ0NGMxMndkZDdkOWMyY2IwOGNjNGQ1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26761,"nextInTopic":26763,"prevInTime":26761,"nextInTime":26763,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"I m still going to go back and respond to old posts, but I don t want these to get away!  ... From: Karen Swanay  ... **I was not","messageBody":"<div id=\"ygrps-yiv-1407143572\">I&#39;m still going to go back and respond to old posts, but I don&#39;t want <br/>\nthese to get away! &lt;bwg&gt;<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/5/07, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; On Oct 5, 2007, at 10:51 AM, Karen Swanay wrote:<br/>\n&gt; No smoking. No underage drinking. No Drinking and driving.<br/>\n&gt; And how how how are you going to do that?<br/>\n&gt; If control worked, the world would be full of model citizens.<br/>\n&gt; Seriously. Control is so simple that the most neophyte parent can<br/>\n&gt; figure it out.<br/>\n<br/>\n**I was not mindfully parented and I did not do any of that.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI was not mindfully parented, and I never smoked anything, and did not <br/>\nhave sex until I was legally an adult. But I did drink---and drink and <br/>\ndrive, and drive and ride with others drunker than I was.<br/>\n<br/>\nStupid.<br/>\n<br/>\nBut my brother did all that and more. Same parents.<br/>\n<br/>\nI bet you knew some preacher&#39;s kids, though, huh??? &lt;bwg&gt;<br/>\n<br/>\nBut my father told me that I should not drive after more than two <br/>\ndrinks. Unfortunately, *HE* drove after more than two drinks, and I <br/>\nreally didn&#39;t believe him when he said that he would come get me. I <br/>\nmade *sure* Cameron KNEW it.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\n They know their parents will help them do whatever<br/>\n&gt; they want.<br/>\n<br/>\n** That is what I&#39;ve been saying....whatever they want.  Regardless of<br/>\nanything.  Don&#39;t feed healthy foods because you will create an eating<br/>\ndisorder.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo!<br/>\n<br/>\nWe choose to offer *all* foods and not make *some* foods out to be <br/>\n&quot;bad&quot; or dangerous or scary or verboten.<br/>\n<br/>\nWe discuss our knowledge of foods, how we feel when we eat certain <br/>\nthings, what&#39;s healthful and what&#39;s not. We don&#39;t vilify certain foods, <br/>\nwe don&#39;t force and foods on our children, and we try to model good <br/>\neating habits ourselves.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n  Don&#39;t give bed times.<br/>\n<br/>\n-==-=-<br/>\n<br/>\nNo!<br/>\n<br/>\nWe do not live in our children&#39;s bodies. We cannot *know* how they feel <br/>\ninside. But we can take their cues and work *with* them: we can turn <br/>\nthe lights low, we can turn on soft music, we can sing lullabies, we <br/>\ncan read sweet books, we can snuggle and cuddle and tell stories. We <br/>\ncan make the room &quot;sleepy.&quot;<br/>\n<br/>\nWhen they are older, we can ask that they be quiet during certain <br/>\nhours, but we really can&#39;t *make* anyone go to sleep. Children will <br/>\nsleep when they are tired. Forcing bedtimes does NOT help someone learn <br/>\nhis body&#39;s own cues for sleep. Both my boys know when they are tired. <br/>\nThey sleep until they are rested. Cam&#39;s at about ten hours/day right <br/>\nnow. Dunc&#39;s at about 12. If they don&#39;t get that many at night, each <br/>\nwill take a nap. Because they know they need rest. They can feel it.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDon&#39;t ask a child to pick things up.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNo!<br/>\n<br/>\nAsk, but be OK with a negative answer---for a while. Kids who are used <br/>\nto being MADE to clean up will refuse for a long while until they trust <br/>\nand believe that you are serious---that they actually *have a choice*.<br/>\n<br/>\nBut asking as a way of commanding will NOT make for happy helpers. <br/>\nMODELING happy helping *yourself* will! Go figure!<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\n Don&#39;t...Don&#39;t...Don&#39;t...Don&#39;t...for ME but for kids it&#39;s ANYTHING<br/>\nANYTHING ANYTHING!!!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYou *really* ain&#39;t getting it!<br/>\n<br/>\nIt&#39;s truly a paradigm shift in your thinking. Changing the way we think <br/>\nabout eating and sleeping and cleaning (you above examples)---which are <br/>\nALL natural things for humans---is hard if we, ourselves, have been <br/>\ncontrolled.<br/>\n<br/>\nDo you eat when you are hungry---not putting it off due to a time <br/>\nschedule? or do you eat when you aren&#39;t hungry because you&#39;re out with <br/>\nfriends and everyone&#39;s ordering? To you honor your hunger? Do you know <br/>\nwhen to stop?<br/>\n<br/>\nAs a controlled child, I&#39;m just now figuring it out. My boys GET it! <br/>\nThey only eat when they are hungry and quit just before they are full. <br/>\nThey never over-eat, and we work really hard to get food IN them as <br/>\nsoon as they voice their hunger. Although I indulged their McDonald&#39;s <br/>\ncravings when they were little, neither will eat there now. Duncan just <br/>\nannounced that *he* too was a vegetarian four days ago. (Ugh---major <br/>\ncrimp in *my* meal plans---omnivore that I am! &lt;G&gt;) But I honor that <br/>\nand try to make as many protien-full meals as I can to hep meet their <br/>\ndietary needs. That&#39;s my job<br/>\n<br/>\nBut indulging in McDonald&#39;s did NOT make them fast-food junkies as I <br/>\nwas told it would. Nor did giving them total access to Hershey bars, <br/>\nM&Ms, and Skittles make them choco- or candy-holics. That candy has <br/>\nbeen here for weeks now. It&#39;s only eaten when one of us has overstepped <br/>\nour food needs and not actually MADE food---we&#39;ve just grabbed what&#39;s <br/>\nhandy and easy. But we ALL know this, and we know that, when we reach <br/>\ninto the candy bowl, we really need some FOOD. Oh---and it&#39;s also eaten <br/>\nwhen we have guests who are limited---*they* clean us out!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI&#39;m not trying to be difficult and I&#39;m feeling<br/>\nquite stupid which is not a usual feeling for me.  I simply can not<br/>\nsee how this actually works.  If a child is allowed, encouraged, not<br/>\nguided away from anything they want to do, then how can you (anyone<br/>\nnot just you) say things will never go wrong?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nParadigm shift! Change how you word/think about things:<br/>\n<br/>\nThings don&#39;t &quot;go wrong&quot;---sometimes we make bad decisions.<br/>\n<br/>\nThey aren&#39;t MIStakes; they are LEARNINGtakes, and we get to make a <br/>\nbetter choice next time.<br/>\n<br/>\nYou&#39;re saying: if I don&#39;t tell my child how to do it RIGHT, he&#39;ll never <br/>\nknow how to do it right and he&#39;ll be lost forever.<br/>\n<br/>\nYou *THINK* I&#39;m saying that if I leave them completely alone, they will <br/>\ndo it all right every time.<br/>\n<br/>\nWhat I&#39;m *really* saying is that I give guidance, my opinions, my <br/>\nencouragement, and my help. My *CHILD* gets to make his own decisions <br/>\nwith all that information. Sometimes he makes a bad decision. *Many* <br/>\ntimes he makes wonderful decisions. Either way, he&#39;s LEARNING what <br/>\nworks and what doesn&#39;t. Sometimes *my* advice sucks. That&#39;s good for <br/>\nhim to know too---that I don&#39;t really know everything.<br/>\n<br/>\nIf something *does* &quot;go wrong,&quot; he knows I&#39;m RIGHT there to help get <br/>\nhim out of the jam. It&#39;s NOT sink or swim in my family. I&#39;m nearby with <br/>\nthe life raft if he needs it.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I am not making the<br/>\nassumption that controlled children are better or I wouldn&#39;t have<br/>\nsigned up for this list.  I am searching for ways for us all to be<br/>\nmore happy and have more peace.  This is just a huge thing for me.  It<br/>\nfeels like abdicating all responsibility and that seems like beign<br/>\nneglect.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIf you are abdicating all responsibility, that *IS* huge old MALIGN <br/>\nneglect---nothing BEnign about it!<br/>\n<br/>\nWe don&#39;t want you to abdicate responsibility! We want to you accept <br/>\nthat your children are your responsibility. But your children are more <br/>\nthan capable NOW of making decsions that affect them. Your <br/>\nresponsibility is to help them be the best people they can be *now*. <br/>\nLearning those little learning-takes now will help them as they get <br/>\nolder. Baby-steps. Little decisions now, bigger ones next year, honking <br/>\nbig ones in five years. Choosing a spouse will be easy! &lt;G&gt;<br/>\n<br/>\nWe want you to see that you can only control children as long as you <br/>\nare BY THEIR SIDES all the time. As soon as *they* can make decisions <br/>\n*away* from you, what kind of control do you have then? And will they <br/>\nhave good decision-making heads on their shoulders or will that be the <br/>\nfirst time they&#39;ve had to make *any* REAL decision at all?<br/>\n<br/>\nWouldn&#39;t it be better to hand over some of those decision-MAKING <br/>\nresponsibilities to THEM now so that they have that capability then? <br/>\n(Simple things like sleeping and eating and cleaning their rooms?) Or <br/>\nwould you rather keep controlling what they do up until the time they <br/>\nare free of your arbitrary rules?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n** I do not believe kids are inherently wrong.  They are inherently<br/>\nignorant.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSo your plan is to make all their decisions *for* them until they make <br/>\nthe same decisions *you* would? &lt;g&gt; Good luck with that! You can&#39;t even <br/>\ndecide on britches! &lt;G&gt;<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWe are not born knowing that stoves are hot, that putting<br/>\nbeans in your nose can be uncomfortable and dangerous.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNope, but a little experimentation goes a long LONG way!!!<br/>\n<br/>\nI remember holding Dunc&#39;s hand over the hot burner. He KNEW it was <br/>\nhot---he could tell, and he pulled his hand away as fast and as hard as <br/>\nhe could.<br/>\n<br/>\nNeither of mine ever put things up their noses. I know some kids do. <br/>\nBut a trip to the doc and its removal will keep many from doing it <br/>\nagain.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nChildren have to be taught these things.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNononononoNO!<br/>\n<br/>\nChildren LEARN these things.<br/>\n<br/>\nBig difference, and one that will make or break unschooling.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n And when I read &quot;let them do what they<br/>\nwant&quot; that says to me &quot;don&#39;t stop them from anything&quot;  Is there<br/>\nanother option?  I know one of my hobgoblins is black and white<br/>\nthinking so this could be my stumbling point.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nSOOO black & white. And I&#39;m a black & white thinker too----but you beat <br/>\nme by a loooong shot!<br/>\n<br/>\nHELP them do what they want. They will find a way withOUT your help! <br/>\nYou can be the hindrance, if you choose (but they may still choose <br/>\nit---just after you are no longer in control). OR you can be the <br/>\npartner that inspires and encourages.<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nAnd that is exactly why I&#39;m stuck...kids will want to do something and<br/>\nto respect what they want to do and help them do it no matter what<br/>\nseems wrong.  It&#39;s the &quot;no matter what&quot; that has me.<br/>\n<br/>\n-=-=-=-=-=<br/>\n<br/>\nIf they know you will help them achieve what they want, they will share <br/>\nthat with you, and you can give your opinion and even find someone who <br/>\nis more knowledgable than you are to help. You can share your concerns <br/>\nand find the safest way to do it. If they trust that you are their <br/>\npartner, they will take your concerns seriously. They will also want <br/>\n*you* to be comfortable with their decisions.<br/>\n<br/>\nBUT if you have been a hindrance all their childhoods, why bother even <br/>\ntelling you want they are up to?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n 15 yr old boys<br/>\nwant to have sex.  That&#39;s biological drive.  Do you help your kids<br/>\nachieve that?  Give them pornography?  Time alone with a girlfriend?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n  Not all 15 year old boys want to have sex. Sex IS a biological <br/>\ndrive---and certainly age-appropriate! &lt;g&gt;<br/>\n<br/>\nI talked with my then-15 year old son about it. I got him several books <br/>\n from the library on the changing body. I answered any and all questions <br/>\nhe had on the subject---even the very uncomfortable ones! I supplied <br/>\ncondoms. I offered a gyno appiontment for the girlfriend. He never <br/>\nasked for pornography, but I did find one or two magazines. We <br/>\ndiscussed the good and bad of them and how/why they are made. I didn&#39;t <br/>\nmind leaving them in the house for a bit when I ran errands. We *still* <br/>\ntalk about sex and babies and birth and STDs. There is NO question <br/>\noff-limits. I answer to the best of my ability.<br/>\n<br/>\nAgain, SAFETY is THE most important aspect. I&#39;d rather KNOW what he&#39;s <br/>\ndoing and with whom than be in the dark about such an important part of <br/>\nhis life.<br/>\n<br/>\n-=-=-=-=-=-=<br/>\n<br/>\nI mean, do you guide your kids at all with morals, ethics and values<br/>\nor no?  And no this isn&#39;t an extreme example, it&#39;s an honest to<br/>\ngoodness question.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWell, it IS extreme. But it&#39;s answerable.<br/>\n<br/>\nAnd we talk ALL the time about morals, ethics, and values. Cameron&#39;s on <br/>\na much higher plane with regards to ethics and values than I am. &lt;g&gt;<br/>\n<br/>\nMorals are crap. Kind of like Rules. &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a> </span></blockquote></div>","specialLinks":[]},{"userId":266096457,"authorName":"momma","from":"&quot;momma&quot; &lt;southernbelle@...&gt;","profile":"centurykissed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191641442","msgId":26761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNnZoMitsZ2czQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MTAxN3VmMjFlNTM2bThjOTIxNjRlN2E3OTI2ZWFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":26760,"nextInTopic":26762,"prevInTime":26760,"nextInTime":26762,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... always ... child.  But ... things ... them, I ... One of the things that my children and I have talked about a lot is that everyone everyone deserves","messageBody":"<div id=\"ygrps-yiv-416795817\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot; <br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; This did help.  This is what I&#39;ve been doing all along.  I have <br/>\n </span></blockquote>always<br/>\n<blockquote><span title=\"ireply\"> &gt; treated my kids with more respect than I was treated with as a <br/>\n </span></blockquote>child.  But<br/>\n<blockquote><span title=\"ireply\"> &gt; the part of that I see missing here, and again it could be the way <br/>\n </span></blockquote>things<br/>\n<blockquote><span title=\"ireply\"> &gt; are being said back and forth is that with the respect I give to <br/>\n </span></blockquote>them, I<br/>\n<blockquote><span title=\"ireply\"> &gt; expect the same in return.  <br/>\n<br/>\n </span></blockquote>One of the things that my children and I have talked about a lot is <br/>\nthat everyone everyone deserves courtesy but people earn respect. <br/>\nThere is a difference. Respect is like love. It is something you feel <br/>\ntowards someone else. You can&#39;t demand respect anymore that you can <br/>\ndemand love. (I am in no way thinking that this is where you are <br/>\ncoming from. Just my own thoughts on the subject of respect in <br/>\ngeneral.) I would be shocked if my children didn&#39;t treat me with <br/>\nrespect. Not angry with them but wonder what I could have done to <br/>\nloose thier respect. How I had damaged our relationship? <br/>\n<br/>\nI am not here to pick up my son&#39;s underwear off<br/>\n<blockquote><span title=\"ireply\"> &gt; the bathroom floor when he&#39;s stepped over it 10 times this <br/>\n </span></blockquote>morning.  Could I<br/>\n<blockquote><span title=\"ireply\"> &gt; have picked it up?  Sure.  Have I picked it up in the past?  Yes.  <br/>\n </span></blockquote>But this<br/>\n<blockquote><span title=\"ireply\"> &gt; morning, I noticed it when I was on my way to the shower and I said <br/>\n </span></blockquote>to (this<br/>\n<blockquote><span title=\"ireply\"> &gt; is the 11yr old) &quot;Hey, I noticed your underwear and sleep shirt on <br/>\n </span></blockquote>the floor<br/>\n<blockquote><span title=\"ireply\"> &gt; in the bathroom, could you pick that up please?&quot; And then I told <br/>\n </span></blockquote>him I was<br/>\n<blockquote><span title=\"ireply\"> &gt; getting into the shower.  That isn&#39;t any different than I would <br/>\n </span></blockquote>have spoken<br/>\n<blockquote><span title=\"ireply\"> &gt; to my husband, mother, or friend. <br/>\n<br/>\n </span></blockquote>I ask my children to help out around the house. Right now I am going <br/>\nthrough what has been a very difficult pregnancy. For the first 3 <br/>\nmonths I was sick on the couch. We hardly left the house at all. It <br/>\nhas really been a team effort. My 11 year old and 8 year old kept <br/>\neverything running while I was down. My son cooked for me and his <br/>\nsister and my 8 year old helped pick up the house. I asked a lot of <br/>\nthem and my husband for months. They never hesitated to help. I ask <br/>\nmy kids to help empty the dishwasher pretty regularly and help with <br/>\nlaundry. I don&#39;t see anything wrong with asking the people who live <br/>\nin the home for help-husband and children alike. It&#39;s definatly not a <br/>\none person job. <br/>\n <br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; I suppose I&#39;m not as far off as I feel I might be...but I still <br/>\n </span></blockquote>feel as<br/>\n<blockquote><span title=\"ireply\"> &gt; though a lot of people on here think I&#39;m a horrible parent who is<br/>\n&gt; continually stepping on the neck of my boys.  Perhaps in time I <br/>\n </span></blockquote>will shift<br/>\n<blockquote><span title=\"ireply\"> &gt; my thinking on baggy pants and other things I have that are rigid.  <br/>\n </span></blockquote>I do<br/>\n<blockquote><span title=\"ireply\"> &gt; have to remind myself it&#39;s been 4 days.  That&#39;s not a long time to <br/>\n </span></blockquote>undo 36<br/>\n<blockquote><span title=\"ireply\"> &gt; yrs of training.<br/>\n<br/>\n </span></blockquote>To be perfectly honest, when I joined this group I thought these <br/>\npeople were nuts &lt;g&gt;. It took me a little while to realize that what <br/>\nI was already doing wasn&#39;t so different. What I did learn here was to <br/>\nchange the way I saw my children and situations. I didn&#39;t jump in <br/>\nwith both feet. I took small steps and made small changes. I started <br/>\nreally thinking about my approach to situations and my relationship <br/>\nwith my children. During the process I saw changes in my children and <br/>\nin our relationships. It was like a pebble tossed into a pond. Small <br/>\nchanges led to more changes. It was sort of a natural progression. <br/>\nAubrey</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;Within reason&quot;","postDate":"1191639114","msgId":26760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1MUJFRUI4LUY3QzYtNDlBNy1CQzNFLTQ2MDc1OTBGMkVEQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MTEyNmo3YmQ0NGMxMndkZDdkOWMyY2IwOGNjNGQ1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPiA8ZmU1aTBpK3Rtc2JAZUdyb3Vwcy5jb20+IDw2N2E5ZDc1MDA3MTAwNTA3NTFqNzRmYWI3YTRwNjA5ZTkwZjcxMmRiZjhhYUBtYWlsLmdtYWlsLmNvbT4gPEEyMkM0Q0Y2LTA0NzEtNDMxNS1CRTM3LUQ5NjMyNjZGNTk1Q0B2ZXJpem9uLm5ldD4gPDY3YTlkNzUwMDcxMDA1MTEyNmo3YmQ0NGMxMndkZDdkOWMyY2IwOGNjNGQ1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26759,"nextInTopic":26761,"prevInTime":26759,"nextInTime":26761,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... Kids will want to do something wrong, you mean? Why would they? They want to be healthy, happy, loved, respected, etc. ... And if they do decide to do","messageBody":"<div id=\"ygrps-yiv-1377496246\">On Oct 5, 2007, at 11:26 AM, Karen Swanay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And that is exactly why I&#39;m stuck...kids will want to do something and<br/>\n&gt; to respect what they want to do and help them do it no matter what<br/>\n&gt; seems wrong.<br/>\n<br/>\n </span></blockquote>Kids will want to do something wrong, you mean? Why would they? They  <br/>\nwant to be healthy, happy, loved, respected, etc.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s the &quot;no matter what&quot; that has me. 15 yr old boys<br/>\n&gt; want to have sex.<br/>\n<br/>\n </span></blockquote>And if they do decide to do that, you won&#39;t be able to stop them. It  <br/>\nwon&#39;t be in your control. You&#39;re in complete denial if you think  <br/>\nordering your 15 yo not to have sex means he won&#39;t. And, if you&#39;ve  <br/>\ndone a lot of ordering and commanding and demanding, you may have  <br/>\nbuilt up so much resistance that he&#39;ll do it just to prove you can&#39;t  <br/>\nany longer control him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s biological drive. Do you help your kids<br/>\n&gt; achieve that?<br/>\n<br/>\n </span></blockquote>We have talked about sex - we&#39;ve talked about all the ramifications -  <br/>\nhealth, safety, morality, spirituality, psychology, and on and on.  <br/>\nYou seem to think we support every possible urge they might have, but  <br/>\nwhat we do is support the interests that they want us to support. My  <br/>\nkids did are normal healthy humans and have sexual feelings, but they  <br/>\ndidn&#39;t want to have sex at too young an age and they definitely  <br/>\naren&#39;t interested in their parents supporting that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Give them pornography? Time alone with a girlfriend?<br/>\n&gt; I mean, do you guide your kids at all with morals, ethics and values<br/>\n&gt; or no? And no this isn&#39;t an extreme example, it&#39;s an honest to<br/>\n&gt; goodness question.<br/>\n<br/>\n </span></blockquote>I can&#39;t understand how you can still be asking this kind of question.  <br/>\nDo we guide our kids at all? (But, maybe you still mean something  <br/>\ndifferent by &quot;guide&quot; - maybe you still are equating guidance with  <br/>\nsaying no/setting limits?)<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191639034","msgId":26759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNnQ1cStsNWx2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MTAxN3VmMjFlNTM2bThjOTIxNjRlN2E3OTI2ZWFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":26758,"nextInTopic":26760,"prevInTime":26758,"nextInTime":26760,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"~~I suppose I m not as far off as I feel I might be...but I still feel as though a lot of people on here think I m a horrible parent who is continually","messageBody":"<div id=\"ygrps-yiv-371780974\">~~I suppose I&#39;m not as far off as I feel I might be...but I still feel<br/>\nas though a lot of people on here think I&#39;m a horrible parent who is<br/>\ncontinually stepping on the neck of my boys. ~~<br/>\n<br/>\nI doubt anyone here thinks you&#39;re a horrible anything, much less a<br/>\nhorrible parent. This list attracts the most AWESOME parents and is<br/>\nintended to dig really deep into mindful parenting and unschooling. We<br/>\nall get to take it up a notch here, or examine things more closely or<br/>\nwhatever it is that we need at the moment.<br/>\n<br/>\nSo just because people are examining (and man is that uncomfortable<br/>\nwhen it&#39;s about parenting, something so very close to our hearts) and<br/>\nquestioning does not mean they think badly of you at all. <br/>\n<br/>\nQuite the contrary. For everything that&#39;s been thrown at you, I think<br/>\nyou&#39;re quite willing to examine it, think about it and streeeeetch<br/>\nyour boundaries. Cool.:)<br/>\n<br/>\n~~That is what I&#39;ve been saying....whatever they want. Regardless of<br/>\nanything. Don&#39;t feed healthy foods because you will create an eating<br/>\ndisorder. Don&#39;t give bed times. Don&#39;t ask a child to pick things up.<br/>\nDon&#39;t...Don&#39;t...Don&#39;t...Don&#39;t...for ME but for kids it&#39;s ANYTHING<br/>\nANYTHING ANYTHING!!! ~~<br/>\n<br/>\nI think this is where you&#39;re getting stuck. First of all, find me a<br/>\nquote where somebody says &quot;don&#39;t feed healthy foods&quot;. It doesn&#39;t<br/>\nexist. Find me a quote that says &quot;don&#39;t ask a child to pick up&quot;. It<br/>\ndoesn&#39;t exist.<br/>\n<br/>\nI understand how difficult it is to shift from mainstream<br/>\nput-my-foot-down-because-I-said-so kind of parenting, to the idea of<br/>\npartnering with children but many of us have been there.:)<br/>\n<br/>\nWhere you&#39;re getting stuck (correct me if I&#39;m wrong) is when we say<br/>\n&quot;try to parter WITH your child&quot; you&#39;re hearing &quot;never stop them&quot;. But<br/>\nthat isn&#39;t what is being said.<br/>\n<br/>\nThink of the relationships you have with other adults. Yes, you might<br/>\ncasually ask them to pick up some laundry on the floor, no big deal.<br/>\nBut if they don&#39;t do it, would you pull out the &quot;I&#39;m bigger and<br/>\nstronger so I&#39;ll force you to do it&quot; card? Probably not. I know that&#39;s<br/>\nnot the kind of relationships I want in my life.<br/>\n<br/>\nKids have different priorities than we do. They SHOULD. The way I put<br/>\nthis to my spouse (who still disagrees about some of these things) is<br/>\na more logical way. What takes more energy: going around the house and<br/>\nmaking people pick up their laundry, or just picking it up and<br/>\nthrowing it in the dirty clothes basket? What takes more energy;<br/>\nfinding out who left the milk out, or simply putting it back in the<br/>\nfridge and reminding someone?<br/>\n<br/>\nThere are SO many things that are less energy to just DO. There are SO<br/>\nmany things that if you knew you or your child were going to die<br/>\ntomorrow, would become irrelevant. The things we focus on are really<br/>\nsuch silly things in the light of death.<br/>\n<br/>\nAsking a person to do something is pretty normal around here. Nagging<br/>\nthem is not. Reminding someone about an agreement they made is common.<br/>\nForcing is not. I happily help them with their rooms or with art<br/>\nmesses or whatever it is they are doing. In turn, I usually have<br/>\nhelpers too. If not, I recognize it as MY priority and they should not<br/>\nhave to adopt my standards just because I&#39;m their parent.<br/>\n<br/>\nWe run into real life limits all the time. How we react to those<br/>\nlimits is vastly different than most mainstream families I see in<br/>\naction. I still screw up. My kids know I&#39;m not perfect (gasp).<br/>\n<br/>\nJust last night I pulled a &quot;Jalen, if you brush your teeth now you can<br/>\nstay up and game with Jared longer&quot;...<br/>\nhis teeth are pretty bad and I really care about getting them clean<br/>\nonce in a while...he really doesn&#39;t care. My dh smirks and says &quot;ooh,<br/>\nI hear a manipulation at work&quot;<br/>\n<br/>\nYep. It was. I apologized to Jalen and said &quot;What I meant was, if you<br/>\nbrush your teeth now you won&#39;t have to worry about it when you come<br/>\ndown to bed because I won&#39;t be up to help you.&quot; I was trying to offer<br/>\nthe gaming as a way to get him to brush his teeth. What can I<br/>\nsay?...being tired and out-of-sorts caused a falling back on old<br/>\nbehaviors I really thought were easy to avoid. It happens. Less<br/>\noften...but my kids or dh usually point it out happily.:)<br/>\n<br/>\nIf the last four days were better in your home, then maybe everyone<br/>\nhere is onto something. Something life changing. Something that makes<br/>\nyour family life even better. Maybe, just maybe there is a seed of<br/>\ntruth that is taking hold? Maybe if you keep questioning and hearing<br/>\nexamples it will make more sense? Maybe.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191637998","msgId":26758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNnM1ZStncXB2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVkYTM3ZTg0MDcxMDA1MTY0N3M0M2Q5OWI3dTQzNDE1NTZkODFmOGZmNDJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":26757,"nextInTopic":26759,"prevInTime":26757,"nextInTime":26759,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"~~ We re like actors, turned loose in this world to wander in search of a phantom, endlessly searching for a half formed shadow of our lost reality. When","messageBody":"<div id=\"ygrps-yiv-53632131\">~~&quot;We&#39;re like actors, turned loose in this world to wander in search<br/>\nof a phantom, endlessly searching for a half formed shadow of our lost<br/>\nreality. When others demand that we become the people they want us to<br/>\nbe, they force us to destroy the person we really are. It&#39;s a subtle<br/>\nkind of murder. The most loving parents and relatives commit this<br/>\nmurder with smiles on their faces.&quot;<br/>\n<br/>\n-Jim Morrison (1943-1971)~~<br/>\n<br/>\n<br/>\nHow cool that you posted this Karen! I read this at the RE conference<br/>\nlast month. LOVE it.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191636207","msgId":26753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NTZCNzU3LTIyRDktNDI5Ni1CN0I3LTRCMUVFRTI2Q0NCMEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPiA8NDdjZDkwZTIwNzEwMDUwMDQxcjI1NGVmY2F1YmUwNWVhMzA3MTBjOTQ0OEBtYWlsLmdtYWlsLmNvbT4gPDA5MTYwMTRELTEwREMtNENBRC04MzU5LUEyMUFFNTc3NEFCRkB2ZXJpem9uLm5ldD4gPDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26752,"nextInTopic":26756,"prevInTime":26752,"nextInTime":26754,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... That s too bad if he thinks that parents restricting things is the same thing as parents telling kids things and providing guidance? When parents set the","messageBody":"<div id=\"ygrps-yiv-1074518286\">On Oct 5, 2007, at 6:23 AM, Karen Swanay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; FTR I also asked the 11 yr old about &quot;no limits&quot; and he was  <br/>\n&gt; uncomfortable<br/>\n&gt; with that. He said he didn&#39;t want me and my husband to stop telling  <br/>\n&gt; him<br/>\n&gt; things and to stop providing guidance.<br/>\n<br/>\n </span></blockquote>That&#39;s too bad if he thinks that parents restricting things is the  <br/>\nsame thing as parents telling kids things and providing guidance?<br/>\n<br/>\nWhen parents set the limits, they often don&#39;t even bother to talk to  <br/>\nthe kids about the reasons or provide real guidance - they restrict  <br/>\nin place of those things.<br/>\n<br/>\n&quot;You may only watch tv for 2 hours per day!&quot; &quot;Why?&quot; &quot;Because too much  <br/>\ntv isn&#39;t good for you and it is my job to protect you.&quot;<br/>\n<br/>\nThat&#39;s not what I&#39;d call guidance. Unschoolers do so much more than  <br/>\nthat, without restricting.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191636077","msgId":26752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUQ1RDNFQUEzOUM2Ny0xMTVDLTcwNDlATUJMSy1NMjkuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPgkgPDQ3Y2Q5MGUyMDcxMDA1MDA0MXIyNTRlZmNhdWJlMDVlYTMwNzEwYzk0NDhAbWFpbC5nbWFpbC5jb20+CSA8MDkxNjAxNEQtMTBEQy00Q0FELTgzNTktQTIxQUU1Nzc0QUJGQHZlcml6b24ubmV0PiA8NjdhOWQ3NTAwNzEwMDUwNjIzajE4MTRiZGY5eDFjYmEwNWFjNThiNTQ2YjFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":26750,"nextInTopic":26753,"prevInTime":26751,"nextInTime":26753,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"I ve been foolowing this thread closely, but I ve been really, really busy. I will answer all the other posts as well, but I  thought I needed to chime in now.","messageBody":"<div id=\"ygrps-yiv-331670810\">I&#39;ve been foolowing this thread closely, but I&#39;ve been really, really <br/>\nbusy. I will answer all the other posts as well, but I  thought I <br/>\nneeded to chime in now.<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt;<br/>\n<br/>\nWell I know they don&#39;t because they are 11 and 9 and they aren&#39;t ever <br/>\nout of<br/>\nmy sight.  One of the downsides to being home with me all the time is <br/>\nthey<br/>\nare with me all the time.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAt nine and 11, they should be with you a LOT.<br/>\n<br/>\nBut what happens when they turn 14 and 16? They will most likely NOT be <br/>\nwith you as much. You will have less and less control each year---as it <br/>\n*should* be! How do you plan to monitor what they do?<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nI hear what is being said now about no and yes.  I don&#39;t know that I<br/>\ncompletely buy that all kids raised this way will *never* want to do<br/>\nsomething that is completely inappropriate, ie illegal drugs, underage<br/>\ndrinking etc...but maybe this is OK with you all and you allow it. I <br/>\ndon&#39;t<br/>\nknow.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nAnd...................this is my cue! &lt;g&gt;<br/>\n<br/>\nFrankly, I could&#39;ve said I won&#39;t &quot;allow&quot; it. But as I&#39;ve said soooo <br/>\nmany times: I&#39;m not that stupid (not saying that *you* are! It&#39;s just <br/>\nsomething I&#39;ve said for years about this very subject.). I&#39;m not so <br/>\nstupid to think that *I* can control what someone else---even if it&#39;s <br/>\nmy own kid---does. I CAN NOT. It&#39;s just not possible. I can only <br/>\ncontrol *me*.<br/>\n<br/>\nAs soon as that driver&#39;s license kicks in, parents are OUT of the loop <br/>\nunless they&#39;ve made it a PRIORITY to be trusted confidantes.<br/>\n<br/>\nMy 19 year old, Cameron, was in school until the end of sixth <br/>\ngrade---private prep school. We had a long deschooling process, but we <br/>\nworked really hard to repair the damage. His best buds though were <br/>\n*all* schooled kids.<br/>\n<br/>\nNow, *I* don&#39;t think of teen sex, drugs, and drinking as <br/>\n&quot;innappropriate&quot; at all. I think they are *natural* progressions in <br/>\nlife. NOT that *everyone* will do them (nor that anyone really <br/>\n*should*!), but that that is the age when it is---well, &lt;g&gt; <br/>\n&quot;age-appropriate&quot;! &lt;G&gt; They WILL try new things---and epecially things <br/>\nthat they have never experienced before. I really, really DO think it&#39;s <br/>\nnatural. That doesn&#39;t make them any less potentially dangerous (not <br/>\nthat any of them are inherently dangerous---just potentially). Just <br/>\nsomething that *I* really didn&#39;t want to shut down communication about.<br/>\n<br/>\nIn fact, I&#39;d rather shut down conversations on almost *anything* <br/>\nelse!!! But what do parents forbid? Yep---the very thing we need to BE <br/>\npresent for. The very things our children want more info on. What do <br/>\nthe children get from their parents instead? &quot;Don&#39;t even THINK about <br/>\ndrinking/drugs/sex!&quot; THose are the VERY things we need to be as <br/>\ninvolved in as possible.<br/>\n<br/>\n<br/>\nSo---I had a son (and there&#39;s no one here who has met him that doesn&#39;t <br/>\nknow him to be kind and gentle and responsible and---just all-round <br/>\ngreat guy! He really is. I&#39;d think that if he weren&#39;t my first-born! <br/>\nI&#39;m just lucky enough to have given birth to him!). So I have this son <br/>\nwho drank, smoked pot, and had sex before he was 18.<br/>\n<br/>\nThe world didn&#39;t end.<br/>\n<br/>\nWould I have been happier if he hadn&#39;t? I don&#39;t know. I think he <br/>\nlearned a LOT. And none of it made him a less perfect, amazing person. <br/>\nSeriously.<br/>\n<br/>\nHe still will have an occasional high-end beer if we&#39;re having a party. <br/>\nHe&#39;ll have a glass of wine sometimes when we do. He and his girlfriend <br/>\nmay have a beer at friends&#39; houses (how would I know exactly?? He&#39;s now <br/>\n19---still under-age, but I know I truly have no control!). But he&#39;s <br/>\ngotten drunk only once, and he&#39;s not a big fan of alcohol. It&#39;s really <br/>\nnot an issue.<br/>\n<br/>\nPot---he had a while when he smoked a good bit. We talked a LOT about <br/>\nit. I&#39;ve never smoked (I&#39;m 47 and one of the few people my age that I <br/>\nknow who haven&#39;t ever toked), so I had very little experience with it. <br/>\nMy husband smoked a bit in high school and was skeptical of my tactics. <br/>\nMy GOAL was that Cameron be safe. Number One goal is safety. Cam KNOWS <br/>\nthat. NOTHING is more important to me than his welfare.<br/>\n<br/>\nI&#39;m stressing this because he knows it---and he knows that I will do <br/>\nANYTHING to keep him safe. I canNOT stop him from being a teen and <br/>\nexperimenting. I CAN, though BE there for him and make sure he gets <br/>\nhome in one piece.<br/>\n<br/>\nSO----if he was at a friend&#39;s and smoked, he would CALL me. I would go <br/>\nget him. We did this many, many times. I didn&#39;t ridicule him or yell at <br/>\nhim or make him feel that it would be safer to drive himself home and <br/>\nhide it from me. I&#39;d rather KNOW where he was, with whom, and what they <br/>\nwere doing than be in the dark about his life---as all his friends&#39; <br/>\nparents were. Cameron felt safe and valued. His learning never went too <br/>\nfar (as his friends&#39; did). We talked about where to buy pot, from whom, <br/>\nabout organic pot, about what people could put in it. I put him in <br/>\ntouch with friends of mine who still smoked. They gave him GOOD advice <br/>\non what and whom to avoid and ansered many questions about it that I <br/>\ndidn&#39;t know. He shared that with me as well.<br/>\n<br/>\nHe joined NORML to try to get hemp and pot legalized. He learned a LOT <br/>\nabout its production and prohibition. He&#39;s a knowledgable consumer. &lt;g&gt; <br/>\nAgain---safety and knowledge are so key!<br/>\n<br/>\nI don&#39;t feel that I &quot;faciliated&quot; his pot-smoking, but I do feel he made <br/>\nbetter decisions about it because of me and my openness. I wouldn&#39;t buy <br/>\nit for him, and we talked about his jeopardizing our unschooling of his <br/>\nlittle brother if he were to get caught. It was a VERY serious subject <br/>\nhere, and he took *his* responsibility with it very, very seriously.<br/>\n<br/>\nSex. He&#39;s been sexually active for a while. Long-term girlfriend---over <br/>\nfour years now? He didn&#39;t tell me before, but *just* afterwards. It <br/>\nwasn&#39;t unplanned---they had talked about it for quite a while. Do *I* <br/>\nfeel it was too soon? As a parent, of course I do! &lt;G&gt; He should be 35, <br/>\nright?  But we&#39;ve talked about sex from every angle. He&#39;s gentle and <br/>\nsweet with Carly, and they love each other. Exactly HOW is a parent <br/>\nplanning to *stop* a teen from having sex? Again, the *best* thing I <br/>\ncan do is to make sure he&#39;s informed and safe. Santa gives condoms in <br/>\nhis stocking---did for several years before he was sexually active. But <br/>\nall his friends knew that there was a &quot;stash&quot; in the upstairs <br/>\nbathroom---there for the taking. I told Carly I&#39;d take her to the <br/>\ngynocologist if her mother wouldn&#39;t.<br/>\n<br/>\nOPEN, HONEST Communication is THE most important thing we have going. I <br/>\nwouldn&#39;t trade THAT for all the non-smoking/non-drinking virgins in the <br/>\nworld!<br/>\n<br/>\nSo, YES, some kids DO these things---even IF they are honored and <br/>\nrespected and trusted. (He *was* schooled though for eight years, so <br/>\nit&#39;s hard to know what would have happened had he never been in <br/>\nschool---I&#39;ll let you know how it goes with his alway-unschooled <br/>\nbrother! &lt;g&gt;)<br/>\n<br/>\nOK---back to the regularly scheduled issues:<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nFWIW the sofa thing I did validate Liam&#39;s feelings because the sofa I <br/>\nwanted<br/>\nwas 9K and white leather and I couldn&#39;t get it either.  We talked about <br/>\nhow<br/>\nnice it would be but we didn&#39;t have the space nor the money for either <br/>\none.<br/>\nHe was disappointed but I was too.  He didn&#39;t cry over it and I don&#39;t<br/>\nbelieve it left a lasting scar.  But in the end those are the limits we<br/>\nhave, time, space and money and I don&#39;t have control over those.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nREAL limits. See? They *do* exist! &lt;bwg&gt;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nRE: pants.  It&#39;s not going to happen.  I&#39;m not allowing my children to <br/>\ndress<br/>\nlike gang members because they think it might be cool.  That probably <br/>\nmakes<br/>\nme a bad parent but that&#39;s the way it is.  I discussed the choices they <br/>\nwere<br/>\nthinking they&#39;d like to make and asked them what kind of things they <br/>\nwanted<br/>\npeople to think about them when they saw them.  They both said they <br/>\ndidn&#39;t<br/>\nwant people to think they were bad kids and came to baggy shorts which <br/>\nhang<br/>\non their waists as a compromise.  I would however have held the line had<br/>\nthey fought me.  Yeah that is probably wrong in your (the plural you) <br/>\neyes,<br/>\nbut in the end, these kids are my responsibility to raise and I&#39;m not <br/>\ngoing<br/>\nto allow them to glorify criminal behavior simply because they see it as<br/>\npopular culture.  (which btw was a passing fancy and they were quick to<br/>\nchange to something different so I don&#39;t know that it was that<br/>\noverwhelmingly important to them.)  I&#39;m not going to let my 3 yr old <br/>\ndress<br/>\nlike pedophile bait when she&#39;s 8 either.  There are limits in this <br/>\nworld and<br/>\nsome of them are artificially constructed.  Little girls shouldn&#39;t be<br/>\nwearing pants that say &quot;taste me&quot; on the butt.  Might work in your <br/>\nfamily,<br/>\nit&#39;s not going to work here.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nCam was into Goth for a VERY brief period. I went with it. I think <br/>\nthat, because I was so supportive, it didn&#39;t last long. I dyed his hair <br/>\nblack for him; I bought him black nail polish; I bought him his own <br/>\neye-liner; I bought lots of black clothes. *I* knew he wasn&#39;t Goth, but <br/>\nI helped feed whatever that was that he needed. He went through it <br/>\nquickly, KNOWING that I respected his need to do and be that for a <br/>\nwhile.<br/>\n<br/>\nIt&#39;s not that it was overwhelmingly important---but it WAS important <br/>\nfor a while---even though just a passing fancy. He laughs about it now. <br/>\nHe felt validated and valued at the time. It really didn&#39;t hurt *me* <br/>\nany---even though it did &quot;glorify&quot; suicide and death. It wasn&#39;t Who He <br/>\nWas---it was just a....passing fancy and part of popular culture.<br/>\n<br/>\nThere are a lot of &quot;artificial&quot; limits. But I choose not to limit my <br/>\nlife with silly ones.<br/>\n<br/>\nAnd as my father says: NO one should be wearing pants with &quot;taste me&quot; <br/>\non the butt---NOT just little girls! &lt;G&gt;<br/>\n<br/>\n=-=-=-=-=-<br/>\n<br/>\nRe: sex on the couch...you are right.  I&#39;m trying to find somewhere <br/>\nwhere<br/>\nsomeone says &quot;no&quot; but apparently that doesn&#39;t happen.  All behavior is <br/>\nOK.<br/>\nI don&#39;t know that I see that as correct.  And as I said before I don&#39;t<br/>\nbelieve that because you raise your child with no limits that they will<br/>\nautomatically become kind sweet wonderful people.  There have to be<br/>\ninstances where a child raised to do whatever whenever has gone wrong <br/>\nbut I<br/>\ndoubt anyone will admit to it.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI won&#39;t admit that Cameron has done anything &quot;wrong.&quot; I will say that <br/>\nhe&#39;s been busy learning a LOT. NONE of it made him a horrible person. <br/>\nNOT ONE THING! And knowing that his parents were &quot;in his corner&quot; at all <br/>\ntimes encouraged him to BE SMART and be honest and be ....just SMART <br/>\nand thoughtful about things. He&#39;s not rash and reactive---he THINKS <br/>\nabout things. And he has NOTHING to rebel against. Not one thing. We <br/>\naccept that he will try things.<br/>\n<br/>\nI think it&#39;s dishonest and irresponsible for parents to encourage <br/>\nindependent, explorers  throughout childhood and then turn around at 13 <br/>\nand say, &quot;NO! DON&#39;T! STOP!&quot; They&#39;re SUPPOSED to keep learning. It&#39;s <br/>\nwhat they DO! They should just be safe and thoughtful about it!<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n Still, this discussion has been good for<br/>\nme.  It has shown me how to switch my thinking.  I am getting there.  <br/>\nThis<br/>\nunlearning stuff is hard work! =)<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYeah---I know!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI do have to admit to something.  For the last 4 days I have said No <br/>\nonly 2<br/>\ntimes.  Once was because I physically could not take the kids anywhere <br/>\n(I<br/>\nhave fibromyalgia, Systemic Lupus and Sjogren&#39;s Syndrome) and I am <br/>\nhaving a<br/>\nflare.  The boys didn&#39;t realize how sick I felt so I told them I <br/>\ncouldn&#39;t do<br/>\nit now, but we would do later when I was better.  And the other was to <br/>\nmake<br/>\nbrown rice for dinner last night but it takes over an hour and we didn&#39;t<br/>\nhave time to do it so I&#39;m making it today.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nKaren, those are REAL limits. Life is FULL of those! We really don&#39;t <br/>\nneed to make up arbitrary limits to show kids that there are limits. <br/>\nThey exist. They&#39;re THERE!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n  The boys have not had one fight<br/>\nin 4 days.  That&#39;s amazing.  I asked my son (the 11 yr old) about it <br/>\nand he<br/>\nsaid it was because he didn&#39;t feel the stress of having to do school <br/>\nand he<br/>\nfelt less mad.  So that&#39;s a good thing.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nOf course---you may also be relaxing a bit, and they can *feel* <br/>\nthat---whether you SHOW it or not. They are *feeling* the difference!<br/>\n<br/>\nKeep in mind that that&#39;s what it&#39;s like with many of us all the <br/>\ntime---the anxiety&#39;s gone. Not 100%----but just saying yes and not <br/>\nstressing over every little thing. Enjoy your kids and enjoy the <br/>\nprecious little time you have with them. It goes sooo fast!<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nFTR I also asked the 11 yr old about &quot;no limits&quot; and he was <br/>\nuncomfortable<br/>\nwith that.  He said he didn&#39;t want me and my husband to stop telling him<br/>\nthings and to stop providing guidance.  He said &quot;It would feel like you<br/>\ndidn&#39;t care what happened to me.&quot;   And I read him these posts so I <br/>\ncould<br/>\ngive him the information without my bias getting in his way.  (Not my <br/>\npart<br/>\njust the answers with all identifiers removed.)  So, what do I do there?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nKaren, NO ONE here has said NO LIMITS!!!!!<br/>\n<br/>\nWe say no *ARBITRARY* limits---can you see the difference???<br/>\n<br/>\nIt&#39;s *one* word, but it makes ALL the difference!!!<br/>\n<br/>\nMy children know real limits. They also know when someone is being <br/>\narbitrary.<br/>\n<br/>\nNO ONE has said provide no guidance. We all provide guidance every day! <br/>\nWe are the MOST &quot;guidant&quot; parents you&#39;ll ever meet!<br/>\n<br/>\nLord, if I stopped &quot;telling&quot; my children things, what would I have left <br/>\nto say? &lt;g&gt;I just don&#39;t TELL them what to do. I give choices. We <br/>\ndiscuss options. I tell them my concerns, and they tell me theirs. The <br/>\nimportant things is that, if they don&#39;t make the same choice *I* would <br/>\nmake, I&#39;m still OK with that. If they made an informed choice (which <br/>\nturned out poorly) and *learned* something, they can always make a <br/>\nbetter choice next time. And it&#39;s MUCH better to learn to make those <br/>\nkinds of decisions when the stakes are so much lower (like kinds of <br/>\npants) than when they are life-altering (like buying a house or <br/>\nchoosing a career).<br/>\n<br/>\nI cannot tell you how much I trust my boys. They are absolutely <br/>\nincredible learning machines. And they are lucky in that they get to <br/>\nsee me make all kinds of goofy choices---as well as really good ones. I <br/>\ntry to stay as informed about my life AND theirs as I can. But to be <br/>\ninformed in their lives, they MUST trust me. MUST! They need to know <br/>\nthat they can make a bad decision and that I am still in their corners. <br/>\nI am ALWAYS in their corners. Forever---no matter what. Drugs, <br/>\ndrinking, sex---doesn&#39;t matter. I will support them and be there FOR <br/>\nthem. It&#39;s important to all of us, and THEY know it. And they didn&#39;t <br/>\nlearn that by having me limit them or control *any*thing they did. They <br/>\nlearned it by having the freedom (and natural limits) to make <br/>\nchoices---with my help, always.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":287618285,"authorName":"Karen Buxcel","from":"&quot;Karen Buxcel&quot; &lt;thewildtribe@...&gt;","profile":"blackhillsdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191628066","msgId":26750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVkYTM3ZTg0MDcxMDA1MTY0N3M0M2Q5OWI3dTQzNDE1NTZkODFmOGZmNDJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDQ3MDY4ZDQ4LjAxZjY2MDBhLjIyMTkuZmZmZmE2YmNAbXguZ29vZ2xlLmNvbT4=","referencesHeader":"PEEyNEZFQUZCLTJDNDUtNDFDOC05RjFCLTA3MDg1NkIzM0ZGNUB2ZXJpem9uLm5ldD4JIDw0NzA2OGQ0OC4wMWY2NjAwYS4yMjE5LmZmZmZhNmJjQG14Lmdvb2dsZS5jb20+"},"prevInTopic":26748,"nextInTopic":26752,"prevInTime":26749,"nextInTime":26751,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"Here s a l quote I printed out a while back, and it speaks to what Joyce is talking about.  I LOVE, LOVE, LOVE the way you lay things out, Joyce! Thanks so","messageBody":"<div id=\"ygrps-yiv-197366449\">Here&#39;s a l quote I printed out a while back, and it speaks to what Joyce is<br/>\ntalking about.  I LOVE, LOVE, LOVE the way you lay things out, Joyce!<br/>\nThanks so much for taking the time, it benefits all of us!  Sending so much<br/>\nGratitude your way...<br/>\n<br/>\n<br/>\n&quot;We&#39;re like actors, turned loose in this world to wander in search of a<br/>\nphantom, endlessly searching for a half formed shadow of our lost reality.<br/>\nWhen others demand that we become the people they want us to be, they force<br/>\nus to destroy the person we really are.  It&#39;s a subtle kind of murder.  The<br/>\nmost loving parents and relatives commit this murder with smiles on their<br/>\nfaces.&quot;<br/>\n<br/>\n-Jim Morrison (1943-1971)<br/>\n<br/>\n<br/>\n<br/>\nNamaste~<br/>\nKaren<br/>\n(one of those Hippy, All is Well kind of people! :)  And it *really* works<br/>\nfor us!)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90323324,"authorName":"Shannon Rizzo","from":"&quot;Shannon Rizzo&quot; &lt;shannon@...&gt;","profile":"shnunrizzo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191611715","msgId":26748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MDY4ZDQ4LjAxZjY2MDBhLjIyMTkuZmZmZmE2YmNAbXguZ29vZ2xlLmNvbT4=","inReplyToHeader":"PEEyNEZFQUZCLTJDNDUtNDFDOC05RjFCLTA3MDg1NkIzM0ZGNUB2ZXJpem9uLm5ldD4="},"prevInTopic":26747,"nextInTopic":26750,"prevInTime":26747,"nextInTime":26749,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"Karen, It isn t you vs them - it s collaborative problem solving.  The Explosive Child does a good job of describing the process, and does unfortunately have ","messageBody":"<div id=\"ygrps-yiv-2107877007\">Karen,<br/>\n <br/>\nIt isn&#39;t you vs them - it&#39;s collaborative problem solving.  The Explosive<br/>\nChild does a good job of describing the process, and does unfortunately have<br/>\nan off-putting title.  In addition to using CBS between adult and kids, we<br/>\nare teaching the kids to use it among themselves.  It turns them away from<br/>\nthinking of a situation as either/or (either I get my way or he gets his)<br/>\nbut instead helps them (and us) come to a solution that is satisfactory to<br/>\neach side.<br/>\n <br/>\nShannon<br/>\n <br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition. <br/>\nVersion: 7.5.488 / Virus Database: 269.14.1/1051 - Release Date: 10/5/2007<br/>\n12:27 PM<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;Within reason&quot;","postDate":"1191608790","msgId":26756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDcxMDA1MTEyNmo3YmQ0NGMxMndkZDdkOWMyY2IwOGNjNGQ1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEEyMkM0Q0Y2LTA0NzEtNDMxNS1CRTM3LUQ5NjMyNjZGNTk1Q0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPgkgPGZlNWkwaSt0bXNiQGVHcm91cHMuY29tPgkgPDY3YTlkNzUwMDcxMDA1MDc1MWo3NGZhYjdhNHA2MDllOTBmNzEyZGJmOGFhQG1haWwuZ21haWwuY29tPgkgPEEyMkM0Q0Y2LTA0NzEtNDMxNS1CRTM3LUQ5NjMyNjZGNTk1Q0B2ZXJpem9uLm5ldD4="},"prevInTopic":26753,"nextInTopic":26757,"prevInTime":26755,"nextInTime":26757,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... **I was not mindfully parented and I did not do any of that. They know their parents will help them do whatever ... ** That is what I ve been","messageBody":"<div id=\"ygrps-yiv-1911212204\">On 10/5/07, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Oct 5, 2007, at 10:51 AM, Karen Swanay wrote:<br/>\n&gt;<br/>\n&gt; &gt; No smoking. No underage drinking. No Drinking and driving.<br/>\n&gt;<br/>\n&gt; And how how how are you going to do that?<br/>\n&gt;<br/>\n&gt; If control worked, the world would be full of model citizens.<br/>\n&gt; Seriously. Control is so simple that the most neophyte parent can<br/>\n&gt; figure it out.<br/>\n </span></blockquote>**I was not mindfully parented and I did not do any of that.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n They know their parents will help them do whatever<br/>\n<blockquote><span title=\"ireply\"> &gt; they want.<br/>\n </span></blockquote>** That is what I&#39;ve been saying....whatever they want.  Regardless of<br/>\nanything.  Don&#39;t feed healthy foods because you will create an eating<br/>\ndisorder.  Don&#39;t give bed times.  Don&#39;t ask a child to pick things up.<br/>\n Don&#39;t...Don&#39;t...Don&#39;t...Don&#39;t...for ME but for kids it&#39;s ANYTHING<br/>\nANYTHING ANYTHING!!!  I&#39;m not trying to be difficult and I&#39;m feeling<br/>\nquite stupid which is not a usual feeling for me.  I simply can not<br/>\nsee how this actually works.  If a child is allowed, encouraged, not<br/>\nguided away from anything they want to do, then how can you (anyone<br/>\nnot just you) say things will never go wrong?  I am not making the<br/>\nassumption that controlled children are better or I wouldn&#39;t have<br/>\nsigned up for this list.  I am searching for ways for us all to be<br/>\nmore happy and have more peace.  This is just a huge thing for me.  It<br/>\nfeels like abdicating all responsibility and that seems like beign<br/>\nneglect.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you believe kids are inherently bad and need trained not to be,<br/>\n&gt; mindful parenting will look foolish. If we look at our kids as trying<br/>\n&gt; to do the best they can with the knowledge and skills and development<br/>\n&gt; they have, then treating them with respect is a lot easier and has<br/>\n&gt; much better results!<br/>\n<br/>\n </span></blockquote>** I do not believe kids are inherently wrong.  They are inherently<br/>\nignorant.  We are not born knowing that stoves are hot, that putting<br/>\nbeans in your nose can be uncomfortable and dangerous.  Children have<br/>\nto be taught these things.  And when I read &quot;let them do what they<br/>\nwant&quot; that says to me &quot;don&#39;t stop them from anything&quot;  Is there<br/>\nanother option?  I know one of my hobgoblins is black and white<br/>\nthinking so this could be my stumbling point.<br/>\n<br/>\nAnd that is exactly why I&#39;m stuck...kids will want to do something and<br/>\nto respect what they want to do and help them do it no matter what<br/>\nseems wrong.  It&#39;s the &quot;no matter what&quot; that has me.  15 yr old boys<br/>\nwant to have sex.  That&#39;s biological drive.  Do you help your kids<br/>\nachieve that?  Give them pornography?  Time alone with a girlfriend?<br/>\nI mean, do you guide your kids at all with morals, ethics and values<br/>\nor no?  And no this isn&#39;t an extreme example, it&#39;s an honest to<br/>\ngoodness question.<br/>\n<br/>\nThanks,<br/>\nKaren<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\n&quot;Family isn&#39;t about whose blood you have.  It&#39;s about who you care about.&quot;<br/>\n<br/>\nLOI 1/26/07<br/>\nPA 3/22/07<br/>\nDTC 8/10/07<br/>\nDisclaimer: Any errors in spelling, tact, or fact are transmission errors.<br/>\n<br/>\n~*~ ~*~ ~*~ ~*~ ~*~ ~*~ ~*~</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;Within reason&quot;","postDate":"1191606878","msgId":26747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyMkM0Q0Y2LTA0NzEtNDMxNS1CRTM3LUQ5NjMyNjZGNTk1Q0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDc1MWo3NGZhYjdhNHA2MDllOTBmNzEyZGJmOGFhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPiA8ZmU1aTBpK3Rtc2JAZUdyb3Vwcy5jb20+IDw2N2E5ZDc1MDA3MTAwNTA3NTFqNzRmYWI3YTRwNjA5ZTkwZjcxMmRiZjhhYUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":26746,"nextInTopic":26748,"prevInTime":26746,"nextInTime":26748,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... And how how how are you going to do that? If control worked, the world would be full of model citizens. Seriously. Control is so simple that the most","messageBody":"<div id=\"ygrps-yiv-1205674355\">On Oct 5, 2007, at 10:51 AM, Karen Swanay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; No smoking. No underage drinking. No Drinking and driving.<br/>\n<br/>\n </span></blockquote>And how how how are you going to do that?<br/>\n<br/>\nIf control worked, the world would be full of model citizens.  <br/>\nSeriously. Control is so simple that the most neophyte parent can  <br/>\nfigure it out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Right now they<br/>\n&gt; are pretty good so it&#39;s not. But I have to look down the road and  <br/>\n&gt; see what<br/>\n&gt; might be. That&#39;s a parent&#39;s job. Not to abdicate.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Seriously you need to attend an unschooling conference and *see* some  <br/>\nunschooled kids. If you really think we&#39;re raising kids who do  <br/>\nwhatever whenever you should sign off the list right now.<br/>\n<br/>\nThe conference in Albequerque had dozens of unschooled kids running  <br/>\naround exploring on their own fairly often. (As well as dozens of  <br/>\nkids hanging around their parents!)<br/>\n<br/>\nThat would be a recipe for disaster with conventionally parented  <br/>\nkids. They&#39;d want to do all the things they aren&#39;t allowed to do.<br/>\n<br/>\nBut with the unschooled kids there, the hotel was happy to welcome  <br/>\nthem back. There isn&#39;t a reason to misbehave when they aren&#39;t with  <br/>\ntheir parents. They know their parents will help them do whatever  <br/>\nthey want. They&#39;ve been helped to think about their decisions so they  <br/>\nhave the tools to think things through when they&#39;re on their own.<br/>\n<br/>\nIf you believe kids are inherently bad and need trained not to be,  <br/>\nmindful parenting will look foolish. If we look at our kids as trying  <br/>\nto do the best they can with the knowledge and skills and development  <br/>\nthey have, then treating them with respect is a lot easier and has  <br/>\nmuch better results!<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191606233","msgId":26746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyNEZFQUZCLTJDNDUtNDFDOC05RjFCLTA3MDg1NkIzM0ZGNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPiA8NDdjZDkwZTIwNzEwMDUwMDQxcjI1NGVmY2F1YmUwNWVhMzA3MTBjOTQ0OEBtYWlsLmdtYWlsLmNvbT4gPDA5MTYwMTRELTEwREMtNENBRC04MzU5LUEyMUFFNTc3NEFCRkB2ZXJpem9uLm5ldD4gPDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26745,"nextInTopic":26747,"prevInTime":26745,"nextInTime":26747,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... Because we *aren t* raising children who do whatever whenever! This is a hugely important point that you re stuck on. Yes/no. Do it/ don t do it. Stop","messageBody":"<div id=\"ygrps-yiv-671230112\">On Oct 5, 2007, at 9:23 AM, Karen Swanay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There have to be<br/>\n&gt; instances where a child raised to do whatever whenever has gone  <br/>\n&gt; wrong but I<br/>\n&gt; doubt anyone will admit to it.<br/>\n<br/>\n </span></blockquote>Because we *aren&#39;t* raising children who do whatever whenever!<br/>\n<br/>\nThis is a hugely important point that you&#39;re stuck on. Yes/no. Do it/ <br/>\ndon&#39;t do it. Stop dividing the world into two options and you&#39;ll be  <br/>\nable to understand.<br/>\n<br/>\n  We are helping our kids get what they want.<br/>\n<br/>\nKids *also* don&#39;t want to hurt people. They don&#39;t want to destroy  <br/>\nthings. Kids do hurt others because they either aren&#39;t understanding  <br/>\nor can&#39;t figure out a better way. We&#39;re there to help them figure out  <br/>\na better way.<br/>\n<br/>\nWe help them with the bigger picture when they&#39;re problem solving. As  <br/>\nsomeone said with the piano. It&#39;s not &quot;No, don&#39;t do that&quot; *OR* &quot;Yes  <br/>\ndo that even though your brother wants to sleep&quot; It&#39;s &quot;How about we  <br/>\nmove that to your room so it doesn&#39;t wake your brother?&quot;<br/>\n<br/>\nWhen kids know we&#39;re trying to help, they don&#39;t mind problem solving.  <br/>\nWhen they know their needs are taken seriously the *do* take other&#39;s  <br/>\nneeds seriously.<br/>\n<br/>\nIt&#39;s only when kids feel their needs aren&#39;t taken seriously and they  <br/>\nneed to compete with others to get what they want and they know no  <br/>\none else is going to help them that they hold onto solutions that are  <br/>\nhurtful. They don&#39;t care about others&#39; needs because it becomes clear  <br/>\nthat others don&#39;t care about their needs. (Parents only care about  <br/>\nthe needs the parents agree with and don&#39;t inconvenience them.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All behavior is OK.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Again with the dichotomy.<br/>\n<br/>\nTasting soap is more yucky than okay but a child won&#39;t die.<br/>\n<br/>\nA child running into the street is dangerous and needs to be stopped.<br/>\n<br/>\nA child playing a trumpet at 5AM is rude and needs to find a more  <br/>\nappropriate time to play the trumpet.<br/>\n<br/>\nThese aren&#39;t &quot;nos&quot; but they&#39;re also not &quot;okay&quot;.<br/>\n<br/>\nI would warn my daughter that soap tasted not nice and to try a  <br/>\nlittle bit if she wanted.<br/>\n<br/>\nI would stop my child from running into the street and, depending on  <br/>\nher age, find better places to play until she was old enough to fully  <br/>\nunderstood the dangers of the street.<br/>\n<br/>\nThe trumpet is an opportunity to help a child figure out a better  <br/>\nsolution. And he won&#39;t, as he&#39;s old enough and confident that mom  <br/>\ndoes want to help him play the trumpet, hold onto the solution he hit  <br/>\non first as the only solution for him. When kids are treated with  <br/>\nrespect they do, as they&#39;re developmentally able, not want to hurt  <br/>\nothers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That probably makes<br/>\n&gt; me a bad parent but that&#39;s the way it is.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Bad and good are vague relative terms.<br/>\n<br/>\nYou become a parent whose kids trust you less. The kids also know  <br/>\nthat you don&#39;t trust them. It sets up the foundation for times when  <br/>\nthey will take their problems somewhere other than the person who  <br/>\nwill erect a barrier around them. Wouldn&#39;t you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know that I<br/>\n&gt; completely buy that all kids raised this way will *never* want to do<br/>\n&gt; something that is completely inappropriate, ie illegal drugs, underage<br/>\n&gt; drinking etc...<br/>\n&gt;<br/>\n </span></blockquote>And controlled kids never do this?<br/>\n<br/>\nSeriously if you were to read back through the archives of what some  <br/>\nof the adults here did *because* they were controlled you couldn&#39;t  <br/>\nhold onto the belief that you can make your children be good by  <br/>\nmaking them behave as if they were good. There are thousands of  <br/>\nparents whose kids are sweet at home but holy terrors as soon as  <br/>\nthey&#39;re out of sight.<br/>\n<br/>\nSome kids who are controlled do turn out okay. Not because of the  <br/>\ncontrol but because of other factors that counteract the control.  <br/>\n(Communication and personality are two big factors.)<br/>\n<br/>\nWhat we&#39;re discussing is helping kids problem solve and make choices  <br/>\nso that they can think things through when they aren&#39;t with us. We  <br/>\ndon&#39;t tell them what choices to make but we help them think about  <br/>\ntheir choices. *Sometimes* they&#39;ll deliberately choose &quot;wrong&quot; to  <br/>\nexperience something (Staying up all night, eating a whole chocolate  <br/>\nrabbit,<br/>\n<br/>\nIf you think the only difference between a child who takes drugs and  <br/>\na child who doesn&#39;t is control, you&#39;re at risk for having a child who  <br/>\nwill take drugs. Kids don&#39;t turn to drugs just because they&#39;re  <br/>\noffered. Kids turn to drugs because they&#39;re in pain.<br/>\n<br/>\nUndoubtedly there will be a few always mindfully parented kids who  <br/>\nwill try drugs but I can guarantee it&#39;s for different reasons than  <br/>\nmost kids. (And undoubtedly they would try drugs whether they were  <br/>\ncontrolled or mindfully parented.)<br/>\n<br/>\nThere are *loads* of controlled kids using and abusing drugs. Control  <br/>\nis one of the things that can drive kids *to* drugs: they feel they  <br/>\naren&#39;t heard or understood, that they aren&#39;t taken seriously unless  <br/>\nthey become clones of their parents. Parents don&#39;t control because  <br/>\nthey&#39;re mean. The do it because they love. But to the controlled it  <br/>\ndoesn&#39;t feel at all like love. It *feels* like &quot;You aren&#39;t good  <br/>\nenough the way you are. You need to do things the way I want you to  <br/>\nin order to be accepted by me.&quot; It isn&#39;t at all what the parents  <br/>\nmean, but it&#39;s what it feels like. The kids can&#39;t react to the  <br/>\nparents&#39; intent, only to what they perceive it to be.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but maybe this is OK with you all and you allow it.<br/>\n&gt;<br/>\n </span></blockquote>If you believe that then it&#39;s because again you aren&#39;t reading what  <br/>\npeople are saying and still trying to pigeon hole answers into  <br/>\ncontrol and not control.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;Within reason&quot;","postDate":"1191604669","msgId":26757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDcxMDA1MTAxN3VmMjFlNTM2bThjOTIxNjRlN2E3OTI2ZWFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGZlNXF0NCtvbG1jQGVHcm91cHMuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPgkgPGZlNXF0NCtvbG1jQGVHcm91cHMuY29tPg=="},"prevInTopic":26756,"nextInTopic":26758,"prevInTime":26756,"nextInTime":26758,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"This did help.  This is what I ve been doing all along.  I have always treated my kids with more respect than I was treated with as a child.  But the part of","messageBody":"<div id=\"ygrps-yiv-1334926507\">This did help.  This is what I&#39;ve been doing all along.  I have always<br/>\ntreated my kids with more respect than I was treated with as a child.  But<br/>\nthe part of that I see missing here, and again it could be the way things<br/>\nare being said back and forth is that with the respect I give to them, I<br/>\nexpect the same in return.  I am not here to pick up my son&#39;s underwear off<br/>\nthe bathroom floor when he&#39;s stepped over it 10 times this morning.  Could I<br/>\nhave picked it up?  Sure.  Have I picked it up in the past?  Yes.  But this<br/>\nmorning, I noticed it when I was on my way to the shower and I said to (this<br/>\nis the 11yr old) &quot;Hey, I noticed your underwear and sleep shirt on the floor<br/>\nin the bathroom, could you pick that up please?&quot; And then I told him I was<br/>\ngetting into the shower.  That isn&#39;t any different than I would have spoken<br/>\nto my husband, mother, or friend.  They dropped it they can bend over and<br/>\npick it up.  That&#39;s just common courtesy and everyone living here helping to<br/>\ntake care of the place we live.<br/>\n<br/>\nNow, I still yell, but a lot less in the last 4 days than previously.<br/>\nActually only once and that was this morning when the boys were fighting.<br/>\nThen I called them out here and talked to them about it and we (all three)<br/>\ncame to a better plan of action than the fighting over the X-box.  I thought<br/>\nthat was successful.<br/>\n<br/>\nI suppose I&#39;m not as far off as I feel I might be...but I still feel as<br/>\nthough a lot of people on here think I&#39;m a horrible parent who is<br/>\ncontinually stepping on the neck of my boys.  Perhaps in time I will shift<br/>\nmy thinking on baggy pants and other things I have that are rigid.  I do<br/>\nhave to remind myself it&#39;s been 4 days.  That&#39;s not a long time to undo 36<br/>\nyrs of training.<br/>\n<br/>\nThanks!<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/5/07, momma &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:southernbelle@...\">southernbelle@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; My 11 year old son and I had this same conversation a couple of weeks<br/>\n&gt; ago. He said that it would be really scary to have no guidance. That<br/>\n&gt; the world can be a big scary place sometimes when you are small. I<br/>\n&gt; don&#39;t think I have read where anyone on this list has said that they<br/>\n&gt; do not provide guidance. That would be neglectful and abusive. We<br/>\n&gt; love our children as much as you love yours and would never want any<br/>\n&gt; harm to come to them.<br/>\n<br/>\n&gt; I hope this helps some.<br/>\n&gt; Aubrey<br/>\n-- <br/>\n&quot;Family isn&#39;t about whose blood you have.  It&#39;s about who you care about.&quot;<br/>\n<br/>\nLOI 1/26/07<br/>\nPA 3/22/07<br/>\nDTC 8/10/07<br/>\nDisclaimer: Any errors in spelling, tact, or fact are transmission errors.<br/>\n<br/>\n~*~ ~*~ ~*~ ~*~ ~*~ ~*~ ~*~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":266096457,"authorName":"momma","from":"&quot;momma&quot; &lt;southernbelle@...&gt;","profile":"centurykissed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191603940","msgId":26745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNXF0NCtvbG1jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26744,"nextInTopic":26746,"prevInTime":26744,"nextInTime":26746,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"I m trying to find somewhere where ... is OK. ... don t ... will ... I DO have personal limits. For example, I do not allow anyone (husband, children,","messageBody":"<div id=\"ygrps-yiv-1324666999\">I&#39;m trying to find somewhere where<br/>\n<blockquote><span title=\"ireply\"> &gt; someone says &quot;no&quot; but apparently that doesn&#39;t happen.  All behavior <br/>\n </span></blockquote>is OK.<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know that I see that as correct.  And as I said before I <br/>\n </span></blockquote>don&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; believe that because you raise your child with no limits that they <br/>\n </span></blockquote>will<br/>\n<blockquote><span title=\"ireply\"> &gt; automatically become kind sweet wonderful people. <br/>\n<br/>\n </span></blockquote>I DO have personal limits. For example, I do not allow anyone <br/>\n(husband, children, neighbor, anyone) to be verbally or physically <br/>\nabusive to me. I feel that everyone should have personal limits in <br/>\nthis world. This goes beyond our children. I also believe that no one <br/>\nin our home should feel unsafe. This includes verbal and/or physical <br/>\nabuse or intimidation. I model this to my children and we discuss how <br/>\nit feels to feel unsafe in your own home, how scary that must be and <br/>\nso forth.  <br/>\n<br/>\n There have to be<br/>\n<blockquote><span title=\"ireply\"> &gt; instances where a child raised to do whatever whenever has gone <br/>\n </span></blockquote>wrong but I<br/>\n<blockquote><span title=\"ireply\"> &gt; doubt anyone will admit to it.  <br/>\n<br/>\n </span></blockquote>Yes, there have been times when my children were younger that they <br/>\nwere angry and/or frustrated and used words with me that I was not <br/>\ncomfortable with. My response was-I understand that you are angry and <br/>\nfrustrated but you will not treat me this way. This is exactly what I <br/>\nwould say to my husband/mother/friend or anyone who spoke to me this <br/>\nway. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; FTR I also asked the 11 yr old about &quot;no limits&quot; and he was <br/>\n </span></blockquote>uncomfortable<br/>\n<blockquote><span title=\"ireply\"> &gt; with that.  He said he didn&#39;t want me and my husband to stop <br/>\n </span></blockquote>telling him<br/>\n<blockquote><span title=\"ireply\"> &gt; things and to stop providing guidance.  He said &quot;It would feel like <br/>\n </span></blockquote>you<br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t care what happened to me.&quot;   And I read him these posts so I <br/>\n </span></blockquote>could<br/>\n<blockquote><span title=\"ireply\"> &gt; give him the information without my bias getting in his way.  (Not <br/>\n </span></blockquote>my part<br/>\n<blockquote><span title=\"ireply\"> &gt; just the answers with all identifiers removed.)  So, what do I do <br/>\n </span></blockquote>there?<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Thanks ladies...I continue to learn and change a little each day.<br/>\n&gt; Karen<br/>\n<br/>\n </span></blockquote>My 11 year old son and I had this same conversation a couple of weeks <br/>\nago. He said that it would be really scary to have no guidance. That <br/>\nthe world can be a big scary place sometimes when you are small. I <br/>\ndon&#39;t think I have read where anyone on this list has said that they <br/>\ndo not provide guidance. That would be neglectful and abusive. We <br/>\nlove our children as much as you love yours and would never want any <br/>\nharm to come to them. <br/>\nWhen we started it helped me so much think about how I spoke to my <br/>\nhusband, mother, friends, etc. I spoke diferently to them than I did <br/>\nmy children. I tried to imagine what my honest response would be if <br/>\nit were my husband I was talking to. If I needed help with a chore or <br/>\na project would I say to my dh, &quot;Hey, I need these dishes done right <br/>\nnow. Get in here and do it!&quot;? No, definatly not. I would say <br/>\nsomething like, &quot;I am really snowed under here. When you&#39;re done with <br/>\nwhat your doing can I get a hand in here?&quot; Sometimes it was little <br/>\nthings. If I wanted to vaccum the living room and my dh was watching <br/>\na show would I just go right in and start to vaccum? No, I might <br/>\nsay, &quot;Can you let me know when a commercial is on so I can run the <br/>\nvaccum real quick?&quot; I give the same consideration to my children. <br/>\nThe other day my dd (8) left some toys outside and I noticed that it <br/>\nwas getting ready to rain. Years ago I would have gone to her and <br/>\nscolded her for leaving her toys laying around and made her go out <br/>\nand get them. What would I have done if it was my dh who had left <br/>\nthings outside and it was getting ready to rain? I would have picked <br/>\nthem up for him. That is what I would want someone to do for me. I <br/>\npicked up her toys and took them to her and told her that it was <br/>\ngetting ready to rain so I grabbed her toys. She was so grateful that <br/>\nI had &quot;saved&quot; her dolls. What could have been a power struggle and <br/>\npossibly hurt feelings turned into a thank you and a hug. What&#39;s more <br/>\nimportant? For her to learn to pick up her things or how much it <br/>\nmeans when we help each other out and go out of our way for others? <br/>\nWhen my dh and I were first married he would not go out of his way <br/>\nfor me if it meant an inconvenience for him. This drove me nuts and I <br/>\ncouldn&#39;t understand it. I realized that this was the way his parents <br/>\ntreated him. They would have marched him out to pick up his toys. It <br/>\nwas a totally foriegn concept to him.  <br/>\nWhen I was trying to explain mindful parenting to my dh I said don&#39;t <br/>\ntreat the kids the way you were treated as a child. Treat them how <br/>\nyou WISH you had been treated. That helped him put it in perspective <br/>\nin very simple terms. <br/>\nI hope this helps some.<br/>\nAubrey</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191602762","msgId":26744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNXBvYSs3MW5jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDc1MWo3NGZhYjdhNHA2MDllOTBmNzEyZGJmOGFhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26743,"nextInTopic":26745,"prevInTime":26743,"nextInTime":26745,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... No if it ... guidance. My parents didn t allow any of those things, either, so I waited until they were asleep to sneak out of the house and do them","messageBody":"<div id=\"ygrps-yiv-1132716316\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot; <br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I am simply not going to allow certain things.<br/>\n&gt; No smoking.  No underage drinking.  No Drinking and driving.  <br/>\n </span></blockquote>No &quot;if it<br/>\n<blockquote><span title=\"ireply\"> &gt; feels good do it&quot; because that&#39;s what they want to do.  Kids need <br/>\n </span></blockquote>guidance.<br/>\n<br/>\nMy parents didn&#39;t allow any of those things, either, so I waited <br/>\nuntil they were asleep to sneak out of the house and do them anyway. <br/>\nYou left out underage sex - I was all about that, too. Good little <br/>\ngirl with straight As and my parents never new until years later. <br/>\n<br/>\nThat&#39;s the trouble &quot;not allowing&quot; can get you into. It doesn&#39;t <br/>\nnecessarily set your kids up to make good decisions. If anything, it <br/>\nputs them in a position of hiding what they want from their parents <br/>\nand so make *worse* decisions. <br/>\n<br/>\nOne of the amazing transformations I&#39;ve seen in my stepson is that <br/>\nhe has started to Ask Adults for help, information and guidance. <br/>\nBefore unschooling, he would ignore any of that - maybe even do the <br/>\nexact opposite, just to prove he could. Now he asks and thinks and <br/>\ngets other oppinions and thinks some more and makes Real Decisions - <br/>\nnot the kind of knee-jerk reactions that he previously thought of as <br/>\ndecisions. <br/>\n<br/>\n---Meredith (Mo 6, Ray 14)</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191602594","msgId":26743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3MDAyMS4xMzk3Ny5xbUB3ZWI1MzgwOC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26741,"nextInTopic":26744,"prevInTime":26742,"nextInTime":26744,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"I hear what is being said now about no and yes. I don t know that I completely buy that all kids raised this way will *never* want to do something that is","messageBody":"<div id=\"ygrps-yiv-1290282228\">I hear what is being said now about no and yes. I don&#39;t know that I completely buy that all kids raised this way will *never* want to do something that is completely inappropriate, ie illegal drugs, underage drinking etc...but maybe this is OK with you all and you allow it. I don&#39;t know.<br/>\n<br/>\n  ****<br/>\n  And kids who are told no regularly won&#39;t try drugs and alcohol?  Right. My siblings and I were told no a lot as kids, and we all tried (used regularly) both drugs and alcohol. &lt;g&gt; <br/>\n   <br/>\n  Besides I do think the current drug/alcohol laws in this country are just plain wrong.  I do allow my kids to sample wine & beer -- I think it&#39;s best that they learn about how it makes them feel while they&#39;re still young enough that I can help them.  I&#39;d hate for their first experience with beer to be one too many, followed by a car accident because they hadn&#39;t known or expected what effect alcohol would have on them.  <br/>\n   <br/>\n  *****<br/>\n  <br/>\nRE: pants. It&#39;s not going to happen. I&#39;m not allowing my children to dress like gang members because they think it might be cool. That probably makes me a bad parent but that&#39;s the way it is. I discussed the choices they were thinking they&#39;d like to make and asked them what kind of things they wanted people to think about them when they saw them. They both said they didn&#39;t want people to think they were bad kids and came to baggy shorts which hang on their waists as a compromise. I would however have held the line had they fought me. Yeah that is probably wrong in your (the plural you) eyes, but in the end, these kids are my responsibility to raise and I&#39;m not going to allow them to glorify criminal behavior simply because they see it as popular culture. (which btw was a passing fancy and they were quick to change to something different so I don&#39;t know that it was that<br/>\noverwhelmingly important to them.)<br/>\n   <br/>\n  *****<br/>\n  I have one child who wears his pants low because he can&#39;t tolerate having ANYTHING around his waist.  He wears all his pants and shorts this way.  Even his underwear is worn half way down his butt -- to have anything at his waist drives him to distraction.  I suppose if you mistook him for a gang-banger, I could understand, but you might consider that how someone dresses is no real indication of who s/he is.  That whole judging a book by its cover thing. <br/>\n   <br/>\n  Another point of view my oldest son pointed out to me years ago -- when I was struggling with the idea of how he dressed -- limiting how he presents himself based on what other people might think about him, is allowing someone else to define who he is.  He was right, I don&#39;t want my kids defining themselves based on what others think about them, or on what others tell them something means.  <br/>\n   <br/>\n  ****<br/>\n  I&#39;m not going to let my 3 yr old dress like pedophile bait when she&#39;s 8 either. There are limits in this world and some of them are artificially constructed. Little girls shouldn&#39;t be<br/>\nwearing pants that say &quot;taste me&quot; on the butt. Might work in your family, it&#39;s not going to work here.<br/>\n   <br/>\n  ******<br/>\n  I don&#39;t have daughters, but I do know several unschooled little girls in the 3 - 10 range, and I&#39;ve not seen one of them dressed like &#39;pedophile bait.&#39;  <br/>\n   <br/>\n  *******<br/>\nRe: sex on the couch...you are right. I&#39;m trying to find somewhere where someone says &quot;no&quot; but apparently that doesn&#39;t happen. All behavior is OK. I don&#39;t know that I see that as correct.<br/>\n   <br/>\n  *****<br/>\n  Did someone here say &quot;sure sex on the couch is okay -- bring out the video camera, too&quot; and I missed it? <br/>\n   <br/>\n  ******<br/>\n  And as I said before I don&#39;t believe that because you raise your child with no limits that they will automatically become kind sweet wonderful people.<br/>\n   <br/>\n  ******<br/>\n  Can your preferred method be held to the same standard you&#39;re using to question unschooling?  Does controlling your kids actions, dress and diet *automatically* make them sweet wonderful people?  Are there no traditionally raised kids who&#39;ve gotten into trouble?  <br/>\n   <br/>\n  ******<br/>\n   <br/>\n  FTR I also asked the 11 yr old about &quot;no limits&quot; and he was uncomfortable with that. He said he didn&#39;t want me and my husband to stop telling him things and to stop providing guidance. He said &quot;It would feel like you didn&#39;t care what happened to me.&quot; And I read him these posts so I could give him the information without my bias getting in his way. (Not my part just the answers with all identifiers removed.) So, what do I do there?<br/>\n   <br/>\n   <br/>\n  *****<br/>\n  Your bias got in the way when you represented unschooling as a method that would mean you&#39;d stop *providing guidance* to him.  I have read at these boards for 6+ years and I just don&#39;t see how it&#39;s possible to think we&#39;re providing *no* guidance to our kids. What is related here are stories from parents how give tremendous guidance to our kids.  We&#39;re constantly talking with our kids, about any topic that comes up, with respect for their thoughts and feelings, and with an eye toward how we can expand their world every moment.<br/>\n   <br/>\n  Sylvia<br/>\n  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n          Gary (dh)<br/>\n  Will (22) Andy (11) and Dan (6) <br/>\n   <br/>\n      There can be no keener revelation of a societys soul than the way in which it treats its children ~ Nelson Mandela<br/>\n   <br/>\n<br/>\n<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourhapahome.blogspot.com\">http://ourhapahome.blogspot.com</a><br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://myeverydaysacred.blogspot.com\">http://myeverydaysacred.blogspot.com</a><br/>\n   <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nTake the Internet to Go: Yahoo!Go puts the Internet in your pocket: mail, news, photos & more. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191601634","msgId":26741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNW9sMis4aGR1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26740,"nextInTopic":26743,"prevInTime":26740,"nextInTime":26742,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... space, nor ... limiting ... Was it though? Or was it a natural limit brought about by the circumstances of your family?. Its not necessary to think about ","messageBody":"<div id=\"ygrps-yiv-1509270509\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot; <br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; That is beyond our restrictions.  We did not have the money, the <br/>\n </span></blockquote>space, nor<br/>\n<blockquote><span title=\"ireply\"> &gt; the family situation for leather.  The answer was no.  Was that <br/>\n </span></blockquote>limiting<br/>\n<blockquote><span title=\"ireply\"> &gt; him?  Yep.<br/>\n<br/>\n </span></blockquote>Was it though? Or was it a natural limit brought about by the <br/>\ncircumstances of your family?. Its not necessary to think about <br/>\nthese sorts of limits as something *you* the parent are in charge of <br/>\nimposing - you might as well say that bc you aren&#39;t a superhero you <br/>\nare limiting your child&#39;s ability to defy gravity ;) <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; That is beyond our restrictions.<br/>\n<br/>\n </span></blockquote>This is such a facinating comment, to me - do you feel restricted in <br/>\nyour life? Do you feel hemmed in? Is that how you want your kids to <br/>\nfeel about living? <br/>\n<br/>\nOne of the concepts embraced by unschoolers is to helping our kids <br/>\nto have a bigger life. That&#39;s really hard to do if mom and dad feel <br/>\nas though they are having to fight their way through &quot;restrictions&quot; <br/>\nto do it. So part of helping kids have a bigger, fuller life is to <br/>\nmove from a sense of &quot;restrictedness&quot; to a sense of abundance. That <br/>\ncan be pretty challenging sometimes! <br/>\n<br/>\nWe all make choices about where we will live, how many family <br/>\nmembers will be employed and at what kinds of jobs, and how many <br/>\nchildren we will have - those can all be seen as &quot;restrictions&quot; or <br/>\nobstacles to be overcome, or they can be seen as windows and doors <br/>\nof possibility. Each family is going to have a different set of <br/>\navailable possiblities. Some of those possibilities can be re-<br/>\nnegotiated over time, and others cannot (for instance, its possible <br/>\nto change jobs, but less possible to get rid of a kid!). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He&#39;s still<br/>\n&gt; disappointed.  Should we have gone into debt and eaten all the <br/>\n </span></blockquote>space in our<br/>\n<blockquote><span title=\"ireply\"> &gt; very small living room to make him happy?<br/>\n<br/>\n </span></blockquote>If you want to think in terms of limits, you could just as well say <br/>\nthat the strategy described above would then impose more limits on <br/>\nother family members. But that&#39;s just getting stuck in the same old <br/>\nlimit/restriction  win-lose thinking patterns. Personally, I&#39;d have <br/>\napproached the whole question differently and looked for a way to <br/>\ninclude his tastes and preferences into the decision making process. <br/>\n<br/>\nWould you have purchased a bright red couch if it *was* in your <br/>\nbudget? I would - if everyone in the family liked it. If *some* <br/>\nfamily members liked it and others didn&#39;t, I&#39;d have looked for other <br/>\noptions - a chair, maybe. Or a red bed-spread that could be thrown <br/>\nover the couch sometimes. Or get the red sofa and cover it with a <br/>\ndifferent color bed-spread, for that matter. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am getting the impression still that there should  be no limits <br/>\n </span></blockquote>on<br/>\n<blockquote><span title=\"ireply\"> &gt; children.  I&#39;m sure I&#39;m missing something but I have yet to hear <br/>\n </span></blockquote>the loudest<br/>\n<blockquote><span title=\"ireply\"> &gt; voices on here show any limits they have on their children. <br/>\n<br/>\n </span></blockquote>My family situation doesn&#39;t include a budget for new funiture, <br/>\nperiod! That&#39;s a real limit imposed by the lifestyle choices George <br/>\nand I have made. Our living-room furniture is getting pretty shabby, <br/>\nso at some point soon we&#39;ll be looking to either replace or recover <br/>\nit, and at that point, my kids input will be welcomed. There *are* <br/>\nsome natural limits - in addition to a lack of funds we only have so <br/>\nmuch space, and our home includes an energetic 6yo. So that red <br/>\nleather sectional is out for us, too ;) But at the same time, I <br/>\ndon&#39;t want to make a decision about the furniture that four people <br/>\nwill use every day that doesn&#39;t take all their wants and wishes into <br/>\naccount. <br/>\n<br/>\nI could think about that as limiting - I could say that I allow my <br/>\nchildren and partner to limit my decision making, but that doesn&#39;t <br/>\nput me in the position to feel loving and generous and joyful toward <br/>\nmy family members. I *want* to feel loving and generous and joyful <br/>\nand bring more of those feelings into my home on a regular basis. So <br/>\nrather than saying &quot;my kids limit my world&quot; I will say that I am <br/>\nopen to the wondrous possibilites my kids can offer me. Pink shag <br/>\nrecliner? Wow! I never would have thought of *that* on my own! Cool. <br/>\n<br/>\nOkay, that brings me &#39;round to the &quot;within reason&quot; thing. A pink <br/>\nshag recliner may not be the most &quot;reasonable&quot; choice for our <br/>\nfamily. But its certainly something we could look into and do some <br/>\nproblem-solving. Can we find one second-hand? If its cheap enough, <br/>\nthen the high-energy 6yo&#39;s impact on the pink shag may not be such <br/>\nan issue. Maybe the shag would collect more &quot;gunk&quot;... that&#39;s <br/>\nsomething to consider in the &quot;reasonable&quot; category. Could we, then, <br/>\nget a cover for the chair? Or maybe a different chair, and a pink <br/>\nshaggy throw that can go in the washer? <br/>\n<br/>\nDo you see how this might work differently? I want my kids to be <br/>\npart of the decision as to what is &quot;within reason&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Clothing: I do not..will not allow my sons to run about with their <br/>\n </span></blockquote>pubic<br/>\n<blockquote><span title=\"ireply\"> &gt; area hanging out of their pants.  So, those huge pants that hang <br/>\n </span></blockquote>are<br/>\n<blockquote><span title=\"ireply\"> &gt; verboten. <br/>\n<br/>\n </span></blockquote>So they don&#39;t wear underwear? That would seem like a reasonable &quot;if-<br/>\nthen&quot; sort of agreement - you can wear those pants *if* you wear <br/>\nunderwear. I have a similar agreement with my dd - she can wear <br/>\ndresses and skirts *if* she wears underwear and I make sure she has <br/>\nundies she likes. It doesn&#39;t need to be all or nothing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But too<br/>\n&gt; bad.  There are limits to what an individual can be allowed to <br/>\n </span></blockquote>do.  I would<br/>\n<blockquote><span title=\"ireply\"> &gt; love to be topless on our beach but that&#39;s against the law.  It <br/>\n </span></blockquote>would make<br/>\n<blockquote><span title=\"ireply\"> &gt; me happy.  I&#39;m still not allowed.  Those are lessons that we all <br/>\n </span></blockquote>have to<br/>\n<blockquote><span title=\"ireply\"> &gt; learn.<br/>\n<br/>\n </span></blockquote>Are you really as unhappy as your posts make you sound? You seem to <br/>\nbe saying: &quot;Life sucks, and kids might as well know it now&quot; - is <br/>\nthat really what you believe? <br/>\n<br/>\nOf Course there are impossiblities in life! Its not something we <br/>\nhave to teach kids at all, much less create *more* barriers just for <br/>\nthe sake of teaching them a lesson. Fortunately, we all have the <br/>\noption of using the barriers that exist naturally as opportunities <br/>\nfor problem solving and creative thinking - and we have the <br/>\nwonderful opportunity to model this kind of behavior for our <br/>\nchildren every day, so that they can see the world as a place of <br/>\npossibilities, not restrictions. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, anyway, my kids still have limits on them...mostly they are <br/>\n </span></blockquote>the limits<br/>\n<blockquote><span title=\"ireply\"> &gt; of decency and budget but really, we all (our family) abide by the <br/>\n </span></blockquote>same<br/>\n<blockquote><span title=\"ireply\"> &gt; limits.<br/>\n<br/>\n </span></blockquote>I guess my question would be &quot;who decides?&quot; Maybe the finances are <br/>\npretty &quot;fixed&quot; for now, but I&#39;d be willing to bet the budget has a <br/>\nlittle bit of play in it - who decides how much gets spent on <br/>\nfurniture vs going to amusement parks, for example? <br/>\n<br/>\nWho decides what the limits of decency are in your home? If the <br/>\nlimits are those set by law, that&#39;s one thing, but a butt crack <br/>\nisn&#39;t in the same category as a nipple or a penis - so there&#39;s a <br/>\ndegree to which &quot;decency&quot; can be negotiated. <br/>\n<br/>\n---Meredith (Mo 6, Ray 14)</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;Within reason&quot;","postDate":"1191595873","msgId":26740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDcxMDA1MDc1MWo3NGZhYjdhNHA2MDllOTBmNzEyZGJmOGFhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZlNWkwaSt0bXNiQGVHcm91cHMuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPgkgPGZlNWkwaSt0bXNiQGVHcm91cHMuY29tPg=="},"prevInTopic":26737,"nextInTopic":26741,"prevInTime":26739,"nextInTime":26741,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"Baloney back.  We aren t talking about baggy here we are talking about butt crack showing and underwear showing and in older kids pubic hair showing as they","messageBody":"<div id=\"ygrps-yiv-2014468709\">Baloney back.  We aren&#39;t talking about baggy here we are talking about butt<br/>\ncrack showing and underwear showing and in older kids pubic hair showing as<br/>\nthey walk about.  And yes, I care what others think.  This is a society. We<br/>\nhave rules and expectations.  A neighbor of mine a couple of years ago was<br/>\nvery &quot;whatever they want to do&quot; with her teens.  Her son came home with the<br/>\nword &quot;CRIMINAL&quot; tattooed across his FOREHEAD!  Nice.  That had to be lasered<br/>\noff to the tune of 2300.00.  Idiot kid.  He said he did it because he<br/>\nthought it would be funny.  Funny indeed.<br/>\n<br/>\nI guess I&#39;m coming to the point here where I&#39;m going to &quot;take what I want<br/>\nand leave the rest&quot; because I am simply not going to allow certain things.<br/>\nNo smoking.  No underage drinking.  No Drinking and driving.  No &quot;if it<br/>\nfeels good do it&quot; because that&#39;s what they want to do.  Kids need guidance.<br/>\nThey need help seeing how decisions they make today impact tomorrow.  And my<br/>\nkids are not going to be tripping over their pants.  They will not be<br/>\nhanging around with pubic hair poking out of the tops of their jeans because<br/>\nthe tops of their jeans are just barely hiding their penis.  (Of course they<br/>\nare 11 and 9 so it&#39;s not an issue atm but it will be eventually.)  They will<br/>\nbe protected from poor decision making if that&#39;s an issue.  Right now they<br/>\nare pretty good so it&#39;s not.  But I have to look down the road and see what<br/>\nmight be.  That&#39;s a parent&#39;s job.  Not to abdicate.<br/>\n<br/>\nI&#39;m not telling anyone on here what to do with their kids but I am feeling<br/>\nlike I&#39;m being told I&#39;m a bad parent because I won&#39;t allow mine to do<br/>\nwhatever they want whenever they want.  And FTR, what we do as a family<br/>\ndirectly impacts my husband&#39;s career.  If one of us goes wrong or makes the<br/>\nwrong impression, it can mean no promotions for him which means getting<br/>\nkicked out.  Perhaps it&#39;s our life and our community that is different than<br/>\neveryone else&#39;s...hippy free-love, everything is OK, no rules, no boundries<br/>\nis an anthema here.  Might work for you all but isn&#39;t appropriate here.  I<br/>\nhave to consider all aspects of decisions that are made and one of those is<br/>\nhow things look.  You don&#39;t have to like it, but it&#39;s the way we live at<br/>\nleast for the next 7 yrs then we can retire and life will be our own.<br/>\n<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/5/07, Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; As to clothing being &quot;gang&quot; related. Baloney! Baggy pants were the<br/>\n&gt; norm for fashion for many years. Whatever. It sounds to me like a<br/>\n&gt; parent overly worried about what other people in society think. I<br/>\n&gt; worry more about how my kids feel. Baggy pants aren&#39;t hurting anyone,<br/>\n&gt; least of all the kid that wears them. If a person&#39;s actions are<br/>\n&gt; robbing anyone else of their freedoms, what is the big deal?<br/>\n&gt;<br/>\n&gt; I think unschooling requires a thick skin and a willingness to<br/>\n&gt; advocate for our children in the face of a society that would mold and<br/>\n&gt; shape them for it&#39;s own purposes. Uh-uh. Not here.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n&quot;Family isn&#39;t about whose blood you have.  It&#39;s about who you care about.&quot;<br/>\n<br/>\nLOI 1/26/07<br/>\nPA 3/22/07<br/>\nDTC 8/10/07<br/>\nDisclaimer: Any errors in spelling, tact, or fact are transmission errors.<br/>\n<br/>\n~*~ ~*~ ~*~ ~*~ ~*~ ~*~ ~*~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191594834","msgId":26737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNWkwaSt0bXNiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26734,"nextInTopic":26740,"prevInTime":26736,"nextInTime":26738,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"~~-=-Sometimes people become frustrated about the apparent lack of limits that families on this list place on their kids. They may stretch to conceive of the","messageBody":"<div id=\"ygrps-yiv-1018509811\">~~-=-Sometimes people become frustrated about the apparent lack of limits<br/>\nthat families on this list place on their kids. They may stretch to<br/>\nconceive of the most dramatic situation they can come up with, hoping<br/>\nthat finally someone will agree that yes, here is a situation where<br/>\nyou can &quot;lay down the law&quot; and set limits across the board. The<br/>\nproblem is that they are too busy pushing to find the &quot;no&quot; that they<br/>\nget stuck. You can&#39;t find the &quot;yes&quot; when you&#39;re looking for the place<br/>\nwhere &quot;no&quot; lives. It won&#39;t help you make the shift to a different<br/>\nperspective.-=-~~<br/>\n<br/>\n<br/>\nThis whole post was really great Susan. Can I quote you at my blog?<br/>\n<br/>\nThat&#39;s why the whole &quot;sex on the couch&quot; situation is so amusing to me.<br/>\nOther scenarios people paint are situations that they&#39;d probably NEVER<br/>\ncome across in real life because a healthy, happy child would never<br/>\nWANT to do those things.<br/>\n<br/>\nI have two teens in the house, one with a serious girlfriend and I<br/>\ncan&#39;t imagine in my wildest dreams they would want to have sex in<br/>\nfront of anyone! Much less on my living room couch.<br/>\n<br/>\nLet&#39;s just say they DID. Why? What would motivate a person to want<br/>\nthat? What would the discussion about everyone else&#39;s preference be at<br/>\nthat point?<br/>\n<br/>\nWhen you think about it, that is just plain silliness. <br/>\nThis is why theoretical situations don&#39;t work well for discussion. If<br/>\nANY of us had free children that wanted something like this, then we<br/>\ncould reasonably discuss it. But we don&#39;t. So apparently freedom and<br/>\npartnering with children don&#39;t lead to such situations. <br/>\nDoesn&#39;t surprise me.<br/>\n<br/>\nAs to clothing being &quot;gang&quot; related. Baloney! Baggy pants were the<br/>\nnorm for fashion for many years. Whatever. It sounds to me like a<br/>\nparent overly worried about what other people in society think. I<br/>\nworry more about how my kids feel. Baggy pants aren&#39;t hurting anyone,<br/>\nleast of all  the kid that wears them. If a person&#39;s actions are<br/>\nrobbing anyone else of their freedoms, what is the big deal?<br/>\n<br/>\nI think unschooling requires a thick skin and a willingness to<br/>\nadvocate for our children in the face of a society that would mold and<br/>\nshape them for it&#39;s own purposes. Uh-uh. Not here.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191590602","msgId":26734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDcxMDA1MDYyM2oxODE0YmRmOXgxY2JhMDVhYzU4YjU0NmIxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDA5MTYwMTRELTEwREMtNENBRC04MzU5LUEyMUFFNTc3NEFCRkB2ZXJpem9uLm5ldD4=","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPgkgPDQ3Y2Q5MGUyMDcxMDA1MDA0MXIyNTRlZmNhdWJlMDVlYTMwNzEwYzk0NDhAbWFpbC5nbWFpbC5jb20+CSA8MDkxNjAxNEQtMTBEQy00Q0FELTgzNTktQTIxQUU1Nzc0QUJGQHZlcml6b24ubmV0Pg=="},"prevInTopic":26733,"nextInTopic":26737,"prevInTime":26733,"nextInTime":26735,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"Well I know they don t because they are 11 and 9 and they aren t ever out of my sight.  One of the downsides to being home with me all the time is they are","messageBody":"<div id=\"ygrps-yiv-429419700\">Well I know they don&#39;t because they are 11 and 9 and they aren&#39;t ever out of<br/>\nmy sight.  One of the downsides to being home with me all the time is they<br/>\nare with me all the time.<br/>\n<br/>\nI hear what is being said now about no and yes.  I don&#39;t know that I<br/>\ncompletely buy that all kids raised this way will *never* want to do<br/>\nsomething that is completely inappropriate, ie illegal drugs, underage<br/>\ndrinking etc...but maybe this is OK with you all and you allow it. I don&#39;t<br/>\nknow.<br/>\n<br/>\nFWIW the sofa thing I did validate Liam&#39;s feelings because the sofa I wanted<br/>\nwas 9K and white leather and I couldn&#39;t get it either.  We talked about how<br/>\nnice it would be but we didn&#39;t have the space nor the money for either one.<br/>\nHe was disappointed but I was too.  He didn&#39;t cry over it and I don&#39;t<br/>\nbelieve it left a lasting scar.  But in the end those are the limits we<br/>\nhave, time, space and money and I don&#39;t have control over those.<br/>\n<br/>\nRE: pants.  It&#39;s not going to happen.  I&#39;m not allowing my children to dress<br/>\nlike gang members because they think it might be cool.  That probably makes<br/>\nme a bad parent but that&#39;s the way it is.  I discussed the choices they were<br/>\nthinking they&#39;d like to make and asked them what kind of things they wanted<br/>\npeople to think about them when they saw them.  They both said they didn&#39;t<br/>\nwant people to think they were bad kids and came to baggy shorts which hang<br/>\non their waists as a compromise.  I would however have held the line had<br/>\nthey fought me.  Yeah that is probably wrong in your (the plural you) eyes,<br/>\nbut in the end, these kids are my responsibility to raise and I&#39;m not going<br/>\nto allow them to glorify criminal behavior simply because they see it as<br/>\npopular culture.  (which btw was a passing fancy and they were quick to<br/>\nchange to something different so I don&#39;t know that it was that<br/>\noverwhelmingly important to them.)  I&#39;m not going to let my 3 yr old dress<br/>\nlike pedophile bait when she&#39;s 8 either.  There are limits in this world and<br/>\nsome of them are artificially constructed.  Little girls shouldn&#39;t be<br/>\nwearing pants that say &quot;taste me&quot; on the butt.  Might work in your family,<br/>\nit&#39;s not going to work here.<br/>\n<br/>\nRe: sex on the couch...you are right.  I&#39;m trying to find somewhere where<br/>\nsomeone says &quot;no&quot; but apparently that doesn&#39;t happen.  All behavior is OK.<br/>\nI don&#39;t know that I see that as correct.  And as I said before I don&#39;t<br/>\nbelieve that because you raise your child with no limits that they will<br/>\nautomatically become kind sweet wonderful people.  There have to be<br/>\ninstances where a child raised to do whatever whenever has gone wrong but I<br/>\ndoubt anyone will admit to it.  Still, this discussion has been good for<br/>\nme.  It has shown me how to switch my thinking.  I am getting there.  This<br/>\nunlearning stuff is hard work! =)<br/>\n<br/>\nI do have to admit to something.  For the last 4 days I have said No only 2<br/>\ntimes.  Once was because I physically could not take the kids anywhere (I<br/>\nhave fibromyalgia, Systemic Lupus and Sjogren&#39;s Syndrome) and I am having a<br/>\nflare.  The boys didn&#39;t realize how sick I felt so I told them I couldn&#39;t do<br/>\nit now, but we would do later when I was better.  And the other was to make<br/>\nbrown rice for dinner last night but it takes over an hour and we didn&#39;t<br/>\nhave time to do it so I&#39;m making it today.  The boys have not had one fight<br/>\nin 4 days.  That&#39;s amazing.  I asked my son (the 11 yr old) about it and he<br/>\nsaid it was because he didn&#39;t feel the stress of having to do school and he<br/>\nfelt less mad.  So that&#39;s a good thing.<br/>\n<br/>\nFTR I also asked the 11 yr old about &quot;no limits&quot; and he was uncomfortable<br/>\nwith that.  He said he didn&#39;t want me and my husband to stop telling him<br/>\nthings and to stop providing guidance.  He said &quot;It would feel like you<br/>\ndidn&#39;t care what happened to me.&quot;   And I read him these posts so I could<br/>\ngive him the information without my bias getting in his way.  (Not my part<br/>\njust the answers with all identifiers removed.)  So, what do I do there?<br/>\n<br/>\nThanks ladies...I continue to learn and change a little each day.<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/5/07, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Right now the pants thing isn&#39;t a big deal. If they sneak, no one<br/>\n&gt; will get hurt by their experimenting. But at some point they *will*<br/>\n&gt; want to do risky things. If they know it&#39;s likely you&#39;ll say no, they<br/>\n&gt; aren&#39;t going to come to you. They will do it behind your back and it<br/>\n&gt; will very likely be unsafe.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n-- <br/>\n&quot;Family isn&#39;t about whose blood you have.  It&#39;s about who you care about.&quot;<br/>\n<br/>\nLOI 1/26/07<br/>\nPA 3/22/07<br/>\nDTC 8/10/07<br/>\nDisclaimer: Any errors in spelling, tact, or fact are transmission errors.<br/>\n<br/>\n~*~ ~*~ ~*~ ~*~ ~*~ ~*~ ~*~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Within reason&quot;","postDate":"1191589846","msgId":26730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlNWQ0bSsycDk5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3Y2Q5MGUyMDcxMDA1MDA0MXIyNTRlZmNhdWJlMDVlYTMwNzEwYzk0NDhAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":26729,"nextInTopic":26733,"prevInTime":26729,"nextInTime":26731,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... -=-Sometimes people become frustrated about the apparent lack of limits that families on this list place on their kids. They may stretch to conceive of the","messageBody":"<div id=\"ygrps-yiv-945939612\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Susan &lt;SusanYvonne@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>-=-Sometimes people become frustrated about the apparent lack of limits<br/>\nthat families on this list place on their kids. They may stretch to<br/>\nconceive of the most dramatic situation they can come up with, hoping<br/>\nthat finally someone will agree that yes, here is a situation where<br/>\nyou can &quot;lay down the law&quot; and set limits across the board. The<br/>\nproblem is that they are too busy pushing to find the &quot;no&quot; that they<br/>\nget stuck. You can&#39;t find the &quot;yes&quot; when you&#39;re looking for the place<br/>\nwhere &quot;no&quot; lives. It won&#39;t help you make the shift to a different<br/>\nperspective.-=-<br/>\n<br/>\n<br/>\nI wanted to pull this paragraph out, especially the highlighted part -<br/>\nit&#39;s very well said!<br/>\n<br/>\nCaren<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":290542009,"authorName":"Jesse Suckow Crowell","from":"&quot;Jesse Suckow Crowell&quot; &lt;stompy@...&gt;","profile":"mallemarokin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191588473","msgId":26733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmZWU4NjM5MDcxMDA1MDU0N2diMDk3ZTU3ajE0NjlhMjEwYmI2MzUzMGJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDQ3Y2Q5MGUyMDcxMDA1MDA0MXIyNTRlZmNhdWJlMDVlYTMwNzEwYzk0NDhAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPgkgPDQ3Y2Q5MGUyMDcxMDA1MDA0MXIyNTRlZmNhdWJlMDVlYTMwNzEwYzk0NDhAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":26730,"nextInTopic":26734,"prevInTime":26732,"nextInTime":26734,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"Wow, Susan! What a great post. This is exactly what *I* needed :)  It s what I ve been trying in my bungling fashion to achieve, but really clarifies why I","messageBody":"<div id=\"ygrps-yiv-981449282\">Wow, Susan! What a great post.<br/>\nThis is exactly what *I* needed :)  It&#39;s what I&#39;ve been trying in my<br/>\nbungling fashion to achieve, but really clarifies why I want to be doing<br/>\nthis.  thanks!<br/>\nJess<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/5/07, Susan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SusanYvonne@...\">SusanYvonne@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   -=- For example, one son wanted a red leather sectional sofa priced at<br/>\n&gt; 7000.00. That is beyond our restrictions. We did not have the money,<br/>\n&gt; the space, nor the family situation for leather. The answer was no.<br/>\n&gt; Was that limiting him? Yep. But unless one of the boys has access to a<br/>\n&gt; money fairy it&#39;s the limits we have to abide by. Our budget for our<br/>\n&gt; new furniture was 2K not 7K. -=-<br/>\n&gt;<br/>\n&gt; The ideas that I&#39;ve found helpful in the many, many discussions on<br/>\n&gt; this list about limits are:<br/>\n&gt;<br/>\n&gt; Try to find a way to say yes - look for the &quot;yes&quot;<br/>\n&gt; Avoid making arbitrary decisions<br/>\n&gt; Validate your child&#39;s feelings<br/>\n&gt;<br/>\n&gt; I&#39;m still working on finding yes - I&#39;m getting better at it. I wasn&#39;t<br/>\n&gt; raised in a problem-solving family, so it&#39;s taken extra practice on my<br/>\n&gt; part to find creative solutions and figure out how I can say &quot;yes&quot;<br/>\n&gt; instead of &quot;no&quot;. There are others here with more experience in seeing<br/>\n&gt; the &quot;yes&quot; and can probably give suggestions.<br/>\n&gt;<br/>\n&gt; One thing I&#39;ve realized is that there are different ways of saying<br/>\n&gt; yes. One way: &quot;Yes, that would be a great sofa for when we get a<br/>\n&gt; bigger house / in a few years when we have a bigger budget, etc.&quot;<br/>\n&gt; Another way: &quot;You certainly do have great taste! Yes, I really want<br/>\n&gt; your opinion about which couch we should pick. What other neat sofas<br/>\n&gt; do you see?&quot; And another way: &quot;Yes, red is a perfect color for our<br/>\n&gt; room! Our budget is $2000. Do you see any red sofas for that price? I<br/>\n&gt; know we can find one. Let&#39;s look together!&quot;<br/>\n&gt;<br/>\n&gt; Another example of yes: A really neat thing I saw at a recent<br/>\n&gt; unschooling conference (Live and Learn) were kids climbing the walls -<br/>\n&gt; literally! The buildings had these great rock-wall foundations that<br/>\n&gt; went about ten feet high, with rocks sticking out at various angles.<br/>\n&gt; They were so tempting to climb! I didn&#39;t see anyone tell their child<br/>\n&gt; &quot;no&quot;. What I *did* see were numerous parents standing with their<br/>\n&gt; children, hands steadying them, as they helped them climb the walls<br/>\n&gt; safely.<br/>\n&gt;<br/>\n&gt; Speaking of climbing things, saying yes more has helped dh & I build<br/>\n&gt; trust with our son. He is a fantastic climber and seeks experiences<br/>\n&gt; that sometimes push our comfort level. We used to limit him, tell him<br/>\n&gt; no, pull him down from ledges/walls/trees and generally stopped him<br/>\n&gt; from doing things that (supposedly) aren&#39;t safe for kids to do.<br/>\n&gt; Traditional parenting says we were doing the right thing, because kids<br/>\n&gt; need boundaries and they don&#39;t know their limits, so we have to set<br/>\n&gt; limits for them.<br/>\n&gt;<br/>\n&gt; Through learning about RU we could see that there *IS* a different<br/>\n&gt; approach, one that makes both practical and intuitive sense to us. We<br/>\n&gt; weren&#39;t taking his abilities into account, we were being really<br/>\n&gt; inflexible (as people who live by &quot;rules&quot; tend to be), we weren&#39;t<br/>\n&gt; evaluating each situation independently, we weren&#39;t supporting his<br/>\n&gt; interest.<br/>\n&gt;<br/>\n&gt; Hindsight is 20/20 - we can see that our actions and unreasonableness<br/>\n&gt; were just creating a barrier in our relationship and driving him to<br/>\n&gt; meet his need in unsafe ways. The more we resisted and limited, the<br/>\n&gt; more often he would sneak and do it anyways, without our presence. It<br/>\n&gt; scared us. We knew limiting him even more or resorting to punishment<br/>\n&gt; for not following our &quot;rule&quot; was not the answer. So we chose to take a<br/>\n&gt; different route.<br/>\n&gt;<br/>\n&gt; By supporting his interest we&#39;ve found that he now *asks* us to be<br/>\n&gt; present when he climbs - he trusts that we will support him, not scold<br/>\n&gt; him. His also much safer - he&#39;s not seeking the experience without<br/>\n&gt; help or taking every stolen - and potentially very dangerous -<br/>\n&gt; opportunity he can find. He feels good about us being with him. He<br/>\n&gt; knows that he can express an interest to climb something and we&#39;ll try<br/>\n&gt; our best to make it happen.<br/>\n&gt;<br/>\n&gt; We can see that when he&#39;s allowed to explore freely and safely he is<br/>\n&gt; really good about knowing his own limitations and respecting them -<br/>\n&gt; since we changed our approach (and attitude) he hasn&#39;t felt the need<br/>\n&gt; to attempt truly dangerous climbs and he hasn&#39;t sustained more than a<br/>\n&gt; few minor scratches. Finding the yes has eliminated the power<br/>\n&gt; struggle, which was a source of unending frustration for all of us.<br/>\n&gt; Now we can share in the joy of his interest rather than fear it. In<br/>\n&gt; doing so we&#39;ve have fostered an atmosphere of trust and collaboration.<br/>\n&gt;<br/>\n&gt; -=- I told him our budget and showed him that was more. He&#39;s still<br/>\n&gt; disappointed. Should we have gone into debt and eaten all the space in our<br/>\n&gt; very small living room to make him happy? -=-<br/>\n&gt;<br/>\n&gt; Help walk your child through the situation. Share the process you went<br/>\n&gt; through in evaluating the options. Give them a chance to share their<br/>\n&gt; thoughts. &quot;Yes, let&#39;s think about that. We could keep the old sofa and<br/>\n&gt; save up for this one, but it would probably take us about two years.<br/>\n&gt; The old sofa is in pretty bad shape, I don&#39;t think it would last that<br/>\n&gt; long. I&#39;d rather save up for our vacation to Hawaii / a playstation2 /<br/>\n&gt; that really cool swingset you saw last week. What do you think? Do you<br/>\n&gt; have any ideas?&quot;<br/>\n&gt;<br/>\n&gt; If you only have $2k to spend on a sofa that&#39;s a practical limit.<br/>\n&gt; Sometimes we bump up against practical limits. The point others are<br/>\n&gt; trying to make is that we don&#39;t need to *create* inflexible rules or<br/>\n&gt; impose limits arbitrarily. If we look hard enough at almost any<br/>\n&gt; situation, we can usually see a gray area - in most cases the<br/>\n&gt; situation is not as black/white or win/lose as we may first think. In<br/>\n&gt; situations where we do bump up against natural limits, it becomes<br/>\n&gt; really important to look for alternatives that allow you to say &quot;yes&quot;<br/>\n&gt; and to validate your child&#39;s experience.<br/>\n&gt;<br/>\n&gt; It&#39;s *okay* for your son to be disappointed about not getting the sofa<br/>\n&gt; he desired. Sometimes I was uncomfortable when I sensed feelings of<br/>\n&gt; anger, disappointment, sadness, etc., in my kids. I don&#39;t want them to<br/>\n&gt; feel that way but often the methods I used were not helpful. Denying<br/>\n&gt; the feeling or telling a child to &quot;get over it&quot; doesn&#39;t make it go<br/>\n&gt; away - but it can lead to them feeling worse - only increasing their<br/>\n&gt; feelings of anger, frustration, or sadness because no one is<br/>\n&gt; listening to them or trying to understand how they feel. Even if I<br/>\n&gt; *did* understand, they weren&#39;t hearing that message when I told them<br/>\n&gt; &quot;sorry, that&#39;s the way it is&quot;.<br/>\n&gt;<br/>\n&gt; By acknowledging their feelings, I can help them work through it,<br/>\n&gt; making it becomes easier for them to let go. It also lets them know<br/>\n&gt; that I care - that what they&#39;re feeling matters to me. I used to be<br/>\n&gt; scared of doing this - I thought that focusing on their feelings would<br/>\n&gt; only intensify them or cause them to linger on it longer. But the<br/>\n&gt; opposite is true. When I ignored my children&#39;s disappointment over<br/>\n&gt; something they would act out in other ways or stew over their feelings<br/>\n&gt; for hours. They were seeking acknowledgment and release and I was<br/>\n&gt; withholding it. I also realized how *I* felt when someone I cared<br/>\n&gt; about brushed my feelings aside. Imagine if your husband or friend<br/>\n&gt; told you (even kindly) to just get over it or they ignored your<br/>\n&gt; feelings. It can be hurtful and frustrating.<br/>\n&gt;<br/>\n&gt; Different approaches work for different kids; what may be soothing and<br/>\n&gt; helpful to my kids may not be effective with yours, but you can use<br/>\n&gt; feedback from your kids and the particulars of the situation to<br/>\n&gt; develop some tools for helping them cope with intense feelings. Try to<br/>\n&gt; validate their concern/desire, let them know you&#39;ve heard them, and<br/>\n&gt; create an opportunity for them to share details. You can grant their<br/>\n&gt; wish through imagination or take the silly route to get them laughing.<br/>\n&gt; For example:<br/>\n&gt;<br/>\n&gt; Wow, you really want to get that big red sectional, don&#39;t you?<br/>\n&gt; You&#39;re feeling disappointed that we can&#39;t afford it right now.<br/>\n&gt; What do you like best about it?<br/>\n&gt; I like the color, too. And it does have enough room for all of us!<br/>\n&gt; In fact, it may even hold a giraffe and a few kangaroos, too! How about<br/>\n&gt; that?<br/>\n&gt; What kind of potion could we use to make it small enough to fit into our<br/>\n&gt; house?<br/>\n&gt; I wish I could make this money grow like those flowers you planted,<br/>\n&gt; then we&#39;d have enough to get that couch! How cool would that be?<br/>\n&gt; Too bad it won&#39;t fit in our house right now. We should take a picture<br/>\n&gt; of it for our wish book, don&#39;t you think?<br/>\n&gt; I can see you really like that red color. You know, I bet we can find<br/>\n&gt; a red ottoman!<br/>\n&gt;<br/>\n&gt; -=- Clothing: I do not..will not allow my sons to run about with their<br/>\n&gt; pubic area hanging out of their pants. &lt;snip&gt; I would love to be<br/>\n&gt; topless on our beach but that&#39;s against the law. It would make me<br/>\n&gt; happy. I&#39;m still not allowed. Those are lessons that we all have to<br/>\n&gt; learn. So, instead of the butt crack showing pants, they have<br/>\n&gt; something else they pick out as long as their butt crack is hidden.<br/>\n&gt; AND the clothing has to be within the family budget. -=-<br/>\n&gt;<br/>\n&gt; Well, there *are* topless beaches and as an adult you can choose to<br/>\n&gt; visit them. You can also choose to be topless in the privacy of your<br/>\n&gt; home, purchase a house on the beach with private access, join a nudist<br/>\n&gt; club that sponsors events, go on a clothing-optional cruise, etc.<br/>\n&gt; There are opportunities available that allow you to pursue that<br/>\n&gt; desire/interest. What options are you providing for your boys to<br/>\n&gt; support their choice in clothing?<br/>\n&gt;<br/>\n&gt; -=- So, those huge pants that hang are verboten. Is that squelching<br/>\n&gt; their individuality? Yeah probably. But too bad. There are limits to<br/>\n&gt; what an individual can be allowed to do. -=-<br/>\n&gt;<br/>\n&gt; Yes, there are natural limits, but this is not one of them, it is a<br/>\n&gt; limit you&#39;ve created. Is there a way to meet your desire for<br/>\n&gt; appropriate covering *and* their desire to wear baggy pants? In<br/>\n&gt; previous discussions folks on this list have talked about finding<br/>\n&gt; win-win solutions. That&#39;s really helped me thinking differently about<br/>\n&gt; this stuff - it doesn&#39;t have to be a win/lose. There is usually a way<br/>\n&gt; to meet everyone&#39;s needs.<br/>\n&gt;<br/>\n&gt; Have you brainstormed about this issue? Have you discussed it with<br/>\n&gt; them? Not talking at them, but truly asking for their input and being<br/>\n&gt; receptive to what they say. Why do your boys prefer the big pants? It<br/>\n&gt; is a style they like? Are they more comfortable? How does the<br/>\n&gt; &quot;squelching their individuality&quot; feel to them? How does it affect your<br/>\n&gt; relationship with them? Can they wear baggy pants at home? Can they<br/>\n&gt; wear exercise shorts or boxers under the pants to make them less<br/>\n&gt; revealing?<br/>\n&gt;<br/>\n&gt; My kids prefer to wear as few clothes as possible. We have close<br/>\n&gt; (nosy) neighbors and no outdoor privacy. For practical and legal<br/>\n&gt; reasons, they need to be dressed appropriately when they&#39;re outside.<br/>\n&gt; To make this less of an issue for them, I make sure they they have<br/>\n&gt; choice and say-so over their inside clothing (or lack thereof). They<br/>\n&gt; can wear pjs or just a t-shirt and underwear if they want. They can<br/>\n&gt; put on their bathing suit - as my daughter did this evening - and wear<br/>\n&gt; it around the house if they want. I&#39;m happy to turn the heat up a<br/>\n&gt; little to make it warmer if they are more comfortable spending their<br/>\n&gt; time in shorts and going barefoot.<br/>\n&gt;<br/>\n&gt; &gt; I am getting the impression still that there should be no limits on<br/>\n&gt; &gt; children. I&#39;m sure I&#39;m missing something but I have yet to hear the<br/>\n&gt; loudest<br/>\n&gt; &gt; voices on here show any limits they have on their children.<br/>\n&gt;<br/>\n&gt; I think you&#39;re still seeing this as &quot;all or none&quot; situation. There<br/>\n&gt; *are* natural, practical and/or legal limits. Those exist apart from<br/>\n&gt; any &quot;rules&quot; we may impose on our children. If your goal is to see how<br/>\n&gt; other parents have been successful at removing the &quot;rules&quot; then you<br/>\n&gt; need to stop focusing on the limits. It&#39;s much more helpful to<br/>\n&gt; concentrate on finding the yes.<br/>\n&gt;<br/>\n&gt; -=- So my question is, where does it stop? -=-<br/>\n&gt;<br/>\n&gt; Hmm... maybe it will help you see the underlying principal behind this<br/>\n&gt; discussion if we reword that question, so it becomes &quot;Where does<br/>\n&gt; problem-solving stop?&quot;<br/>\n&gt;<br/>\n&gt; -=- If you have a 16 yr old daughter who wants to have sex on your<br/>\n&gt; sofa in front of you 4 yr old is that OK? (I&#39;m not being flip<br/>\n&gt; seriously. I want to know if what I perceive being said is actually<br/>\n&gt; what&#39;s being advocated.) -=-<br/>\n&gt;<br/>\n&gt; Is it a real-life situation? Possibly, but unlikely. Are your children<br/>\n&gt; really at risk of winding up in this scenario? If you need to focus on<br/>\n&gt; this theoretical situation, then let&#39;s pretend this is a real<br/>\n&gt; situation involving a real teenager. Ask yourself what tragically<br/>\n&gt; unmet need the teen must be experiencing in order for this<br/>\n&gt; circumstance to arise in the first place. What is missing from his<br/>\n&gt; life? Do you think a teenager who desire this type of experience grew<br/>\n&gt; up feeling safe, loved, secure, trusted, supported, valued, and<br/>\n&gt; honored? Why is this teen driven to fulfill his needs in unsafe,<br/>\n&gt; illegal, or inappropriate ways?<br/>\n&gt;<br/>\n&gt; Sometimes people become frustrated about the apparent lack of limits<br/>\n&gt; that families on this list place on their kids. They may stretch to<br/>\n&gt; conceive of the most dramatic situation they can come up with, hoping<br/>\n&gt; that finally someone will agree that yes, here is a situation where<br/>\n&gt; you can &quot;lay down the law&quot; and set limits across the board. The<br/>\n&gt; problem is that they are too busy pushing to find the &quot;no&quot; that they<br/>\n&gt; get stuck. You can&#39;t find the &quot;yes&quot; when you&#39;re looking for the place<br/>\n&gt; where &quot;no&quot; lives. It won&#39;t help you make the shift to a different<br/>\n&gt; perspective.<br/>\n&gt;<br/>\n&gt; A common refrain: &quot;So it&#39;s okay to just let your kid jump off a cliff<br/>\n&gt; or play in the road?&quot;<br/>\n&gt;<br/>\n&gt; Parents on this list have come up with ways to say yes even in these<br/>\n&gt; and other &quot;extreme&quot; situations. However, it must get tiresome for them<br/>\n&gt; to expend energy on coming up with solutions to problems that are<br/>\n&gt; currently non-existent or extremely far-fetched, such as your question<br/>\n&gt; about teenage sex in front of a sibling.<br/>\n&gt;<br/>\n&gt; If you want to go from a place of limits and control to a place of<br/>\n&gt; trust and creative problem-solving, know that focusing on rules or<br/>\n&gt; unlikely situations is not going to help you make the shift. What<br/>\n&gt; might help: taking a recent or current event, looking at it from<br/>\n&gt; different angles, discovering your own issues (and owning them),<br/>\n&gt; thinking about the principals behind unschooling (I listed a few at<br/>\n&gt; the beginning) and choosing to try a different approach in the future.<br/>\n&gt;<br/>\n&gt; Btw, I&#39;m still learning, pushing my own comfort levels, questioning<br/>\n&gt; the assumptions and conventional &quot;wisdom&quot; that resides in my head. I<br/>\n&gt; used to look for the &quot;no&quot;, too, but eventually I realized that it<br/>\n&gt; wasn&#39;t helpful in the long run - it didn&#39;t get me any closer to where<br/>\n&gt; I wanted to be. It only got me stuck in that old way of thinking.<br/>\n&gt;<br/>\n&gt; ~ Susan<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191578967","msgId":26729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5MTYwMTRELTEwREMtNENBRC04MzU5LUEyMUFFNTc3NEFCRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ3Y2Q5MGUyMDcxMDA1MDA0MXIyNTRlZmNhdWJlMDVlYTMwNzEwYzk0NDhAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPiA8NDdjZDkwZTIwNzEwMDUwMDQxcjI1NGVmY2F1YmUwNWVhMzA3MTBjOTQ0OEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":26728,"nextInTopic":26730,"prevInTime":26728,"nextInTime":26730,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... This is a really important point. Parents assume that they can set down a rule and have their kids follow. (And punish when the don t.) What rules do is","messageBody":"<div id=\"ygrps-yiv-546754035\">On Oct 5, 2007, at 3:41 AM, Susan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; By supporting his interest we&#39;ve found that he now *asks* us to be<br/>\n&gt; present when he climbs - he trusts that we will support him, not scold<br/>\n&gt; him. His also much safer - he&#39;s not seeking the experience without<br/>\n&gt; help or taking every stolen - and potentially very dangerous -<br/>\n&gt; opportunity he can find. He feels good about us being with him. He<br/>\n&gt; knows that he can express an interest to climb something and we&#39;ll try<br/>\n&gt; our best to make it happen.<br/>\n<br/>\n </span></blockquote>This is a really important point.<br/>\n<br/>\nParents assume that they can set down a rule and have their kids  <br/>\nfollow. (And punish when the don&#39;t.)<br/>\n<br/>\nWhat rules do is set up a barrier between what a child wants and the  <br/>\nchild.<br/>\n<br/>\nIf there&#39;s an obstacle between what an adult wants and the adult, do  <br/>\nwe admire the one who shrugs and decides the obstacle placer is right  <br/>\nand he really shouldn&#39;t try to do that? Or do we admire the fortitude  <br/>\nto get around it?<br/>\n<br/>\nChildren are the same as adults in that respect. Though some kids  <br/>\n*will* give up trying, it doesn&#39;t mean they give up wanting. (How do  <br/>\nyou feel when someone has said no to what you want when their no  <br/>\ndoesn&#39;t make sense to you? Do you feel like going to them for further  <br/>\nhelp?*Is* that what you want for your relationship with your  <br/>\nchildren?) But some kids aren&#39;t beaten down and what rules do is  <br/>\ncreate an opportunity to be clever. (Again, something we&#39;d cheer in a  <br/>\nmovie as well as real life!) They can figure out a way around it.  <br/>\nThey can batter at it (constantly ask.)<br/>\n<br/>\nIf you read stories of what the adults here did about their own  <br/>\nparents arbitrary rules, you&#39;d know rules don&#39;t work! ;-)<br/>\n<br/>\nHow do you know your sons don&#39;t have a set of pants that they change  <br/>\ninto once they&#39;re out of your sight? (If the pants aren&#39;t in your  <br/>\nbudget, they could have gotten some hand me downs from a friend.)<br/>\n<br/>\nThe truth is you don&#39;t know. *Do* you want to not know what your kids  <br/>\nare up to when they&#39;re away? That&#39;s the type of relationship you&#39;re  <br/>\nfostering with arbitrary rules.<br/>\n<br/>\nMy daughter *does* come to me with problems because she knows she can  <br/>\ntrust me to help her. *Not* just help her with what I agree with.  <br/>\n*Help* her. And since she knows my goal *is* to help her, she isn&#39;t  <br/>\nafraid to come to me and she takes seriously what I say about how to  <br/>\ndo things in a safe way. She also takes her own safety seriously  <br/>\nsince she isn&#39;t trying to prove herself against arbitrary rules.<br/>\n<br/>\nRight now the pants thing isn&#39;t a big deal. If they sneak, no one  <br/>\nwill get hurt by their experimenting. But at some point they *will*  <br/>\nwant to do risky things. If they know it&#39;s likely you&#39;ll say no, they  <br/>\naren&#39;t going to come to you. They will do it behind your back and it  <br/>\nwill very likely be unsafe.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191570104","msgId":26728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcxMDA1MDA0MXIyNTRlZmNhdWJlMDVlYTMwNzEwYzk0NDhAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26726,"nextInTopic":26729,"prevInTime":26727,"nextInTime":26729,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"-=- For example, one son wanted a red leather sectional sofa priced at 7000.00. That is beyond our restrictions. We did not have the money, the space, nor the","messageBody":"<div id=\"ygrps-yiv-933604716\">-=- For example, one son wanted a red leather sectional sofa priced at<br/>\n7000.00. That is beyond our restrictions. We did not have the money,<br/>\nthe space, nor the family situation for leather. The answer was no.<br/>\nWas that limiting him? Yep. But unless one of the boys has access to a<br/>\nmoney fairy it&#39;s the limits we have to abide by. Our budget for our<br/>\nnew furniture was 2K not 7K. -=-<br/>\n<br/>\nThe ideas that I&#39;ve found helpful in the many, many discussions on<br/>\nthis list about limits are:<br/>\n<br/>\nTry to find a way to say yes - look for the &quot;yes&quot;<br/>\nAvoid making arbitrary decisions<br/>\nValidate your child&#39;s feelings<br/>\n<br/>\nI&#39;m still working on finding yes - I&#39;m getting better at it. I wasn&#39;t<br/>\nraised in a problem-solving family, so it&#39;s taken extra practice on my<br/>\npart to find creative solutions and figure out how I can say &quot;yes&quot;<br/>\ninstead of &quot;no&quot;. There are others here with more experience in seeing<br/>\nthe &quot;yes&quot; and can probably give suggestions.<br/>\n<br/>\nOne thing I&#39;ve realized is that there are different ways of saying<br/>\nyes. One way: &quot;Yes, that would be a great sofa for when we get a<br/>\nbigger house / in a few years when we have a bigger budget, etc.&quot;<br/>\nAnother way: &quot;You certainly do have great taste! Yes, I really want<br/>\nyour opinion about which couch we should pick. What other neat sofas<br/>\ndo you see?&quot; And another way: &quot;Yes, red is a perfect color for our<br/>\nroom! Our budget is $2000. Do you see any red sofas for that price? I<br/>\nknow we can find one. Let&#39;s look together!&quot;<br/>\n<br/>\nAnother example of yes: A really neat thing I saw at a recent<br/>\nunschooling conference (Live and Learn) were kids climbing the walls -<br/>\nliterally! The buildings had these great rock-wall foundations that<br/>\nwent about ten feet high, with rocks sticking out at various angles.<br/>\nThey were so tempting to climb! I didn&#39;t see anyone tell their child<br/>\n&quot;no&quot;. What I *did* see were numerous parents standing with their<br/>\nchildren, hands steadying them, as they helped them climb the walls<br/>\nsafely.<br/>\n<br/>\nSpeaking of climbing things, saying yes more has helped dh & I build<br/>\ntrust with our son. He is a fantastic climber and seeks experiences<br/>\nthat sometimes push our comfort level. We used to limit him, tell him<br/>\nno, pull him down from ledges/walls/trees and generally stopped him<br/>\nfrom doing things that (supposedly) aren&#39;t safe for kids to do.<br/>\nTraditional parenting says we were doing the right thing, because kids<br/>\nneed boundaries and they don&#39;t know their limits, so we have to set<br/>\nlimits for them.<br/>\n<br/>\nThrough learning about RU we could see that there *IS* a different<br/>\napproach, one that makes both practical and intuitive sense to us. We<br/>\nweren&#39;t taking his abilities into account, we were being really<br/>\ninflexible (as people who live by &quot;rules&quot; tend to be), we weren&#39;t<br/>\nevaluating each situation independently, we weren&#39;t supporting his<br/>\ninterest.<br/>\n<br/>\nHindsight is 20/20 - we can see that our actions and unreasonableness<br/>\nwere just creating a barrier in our relationship and driving him to<br/>\nmeet his need in unsafe ways. The more we resisted and limited, the<br/>\nmore often he would sneak and do it anyways, without our presence. It<br/>\nscared us. We knew limiting him even more or resorting to punishment<br/>\nfor not following our &quot;rule&quot; was not the answer. So we chose to take a<br/>\ndifferent route.<br/>\n<br/>\nBy supporting his interest we&#39;ve found that he now *asks* us to be<br/>\npresent when he climbs - he trusts that we will support him, not scold<br/>\nhim. His also much safer - he&#39;s not seeking the experience without<br/>\nhelp or taking every stolen - and potentially very dangerous -<br/>\nopportunity he can find. He feels good about us being with him. He<br/>\nknows that he can express an interest to climb something and we&#39;ll try<br/>\nour best to make it happen.<br/>\n<br/>\nWe can see that when he&#39;s allowed to explore freely and safely he is<br/>\nreally good about knowing his own limitations and respecting them -<br/>\nsince we changed our approach (and attitude) he hasn&#39;t felt the need<br/>\nto attempt truly dangerous climbs and he hasn&#39;t sustained more than a<br/>\nfew minor scratches. Finding the yes has eliminated the power<br/>\nstruggle, which was a source of unending frustration for all of us.<br/>\nNow we can share in the joy of his interest rather than fear it. In<br/>\ndoing so we&#39;ve have fostered an atmosphere of trust and collaboration.<br/>\n<br/>\n-=- I told him our budget and showed him that was more.  He&#39;s still<br/>\ndisappointed.  Should we have gone into debt and eaten all the space in our<br/>\nvery small living room to make him happy? -=-<br/>\n<br/>\nHelp walk your child through the situation. Share the process you went<br/>\nthrough in evaluating the options. Give them a chance to share their<br/>\nthoughts. &quot;Yes, let&#39;s think about that. We could keep the old sofa and<br/>\nsave up for this one, but it would probably take us about two years.<br/>\nThe old sofa is in pretty bad shape, I don&#39;t think it would last that<br/>\nlong. I&#39;d rather save up for our vacation to Hawaii / a playstation2 /<br/>\nthat really cool swingset you saw last week. What do you think? Do you<br/>\nhave any ideas?&quot;<br/>\n<br/>\nIf you only have $2k to spend on a sofa that&#39;s a practical limit.<br/>\nSometimes we bump up against practical limits. The point others are<br/>\ntrying to make is that we don&#39;t need to *create* inflexible rules or<br/>\nimpose limits arbitrarily. If we look hard enough at almost any<br/>\nsituation, we can usually see a gray area - in most cases the<br/>\nsituation is not as black/white or win/lose as we may first think. In<br/>\nsituations where we do bump up against natural limits, it becomes<br/>\nreally important to look for alternatives that allow you to say &quot;yes&quot;<br/>\nand to validate your child&#39;s experience.<br/>\n<br/>\nIt&#39;s *okay* for your son to be disappointed about not getting the sofa<br/>\nhe desired. Sometimes I was uncomfortable when I sensed feelings of<br/>\nanger, disappointment, sadness, etc., in my kids. I don&#39;t want them to<br/>\nfeel that way but often the methods I used were not helpful. Denying<br/>\nthe feeling or telling a child to &quot;get over it&quot; doesn&#39;t make it go<br/>\naway - but it can lead to them feeling worse - only increasing their<br/>\nfeelings of  anger, frustration, or sadness because no one is<br/>\nlistening to them or trying to understand how they feel. Even if I<br/>\n*did* understand, they weren&#39;t hearing that message when I told them<br/>\n&quot;sorry, that&#39;s the way it is&quot;.<br/>\n<br/>\nBy acknowledging their feelings, I can help them work through it,<br/>\nmaking it becomes easier for them to let go. It also lets them know<br/>\nthat I care - that what they&#39;re feeling matters to me. I used to be<br/>\nscared of doing this - I thought that focusing on their feelings would<br/>\nonly intensify them or cause them to linger on it longer. But the<br/>\nopposite is true. When I ignored my children&#39;s disappointment over<br/>\nsomething they would act out in other ways or stew over their feelings<br/>\nfor hours. They were seeking acknowledgment and release and I was<br/>\nwithholding it. I also realized how *I* felt when someone I cared<br/>\nabout brushed my feelings aside. Imagine if your husband or friend<br/>\ntold you (even kindly) to just get over it or they ignored your<br/>\nfeelings. It can be hurtful and frustrating.<br/>\n<br/>\nDifferent approaches work for different kids; what may be soothing and<br/>\nhelpful to my kids may not be effective with yours, but you can use<br/>\nfeedback from your kids and the particulars of the situation to<br/>\ndevelop some tools for helping them cope with intense feelings. Try to<br/>\nvalidate their concern/desire, let them know you&#39;ve heard them, and<br/>\ncreate an opportunity for them to share details. You can grant their<br/>\nwish through imagination or take the silly route to get them laughing.<br/>\nFor example:<br/>\n<br/>\nWow, you really want to get that big red sectional, don&#39;t you?<br/>\nYou&#39;re feeling disappointed that we can&#39;t afford it right now.<br/>\nWhat do you like best about it?<br/>\nI like the color, too. And it does have enough room for all of us!<br/>\nIn fact, it may even hold a giraffe and a few kangaroos, too! How about that?<br/>\nWhat kind of potion could we use to make it small enough to fit into our house?<br/>\nI wish I could make this money grow like those flowers you planted,<br/>\nthen we&#39;d have enough to get that couch! How cool would that be?<br/>\nToo bad it won&#39;t fit in our house right now. We should take a picture<br/>\nof it for our wish book, don&#39;t you think?<br/>\nI can see you really like that red color. You know, I bet we can find<br/>\na red ottoman!<br/>\n<br/>\n-=- Clothing: I do not..will not allow my sons to run about with their<br/>\npubic area hanging out of their pants. &lt;snip&gt;  I would love to be<br/>\ntopless on our beach but that&#39;s against the law.  It would make me<br/>\nhappy.  I&#39;m still not allowed.  Those are lessons that we all have to<br/>\nlearn.  So, instead of the butt crack showing pants, they have<br/>\nsomething else they pick out as long as their butt crack is hidden.<br/>\nAND the clothing has to be within the family budget. -=-<br/>\n<br/>\nWell, there *are* topless beaches and as an adult you can choose to<br/>\nvisit them. You can also choose to be topless in the privacy of your<br/>\nhome, purchase a house on the beach with private access, join a nudist<br/>\nclub that sponsors events, go on a clothing-optional cruise, etc.<br/>\nThere are opportunities available that allow you to pursue that<br/>\ndesire/interest. What options are you providing for your boys to<br/>\nsupport their choice in clothing?<br/>\n<br/>\n-=- So, those huge pants that hang are verboten. Is that squelching<br/>\ntheir individuality? Yeah probably.  But too bad. There are limits to<br/>\nwhat an individual can be allowed to do. -=-<br/>\n<br/>\nYes, there are natural limits, but this is not one of them, it is a<br/>\nlimit you&#39;ve created. Is there a way to meet your desire for<br/>\nappropriate covering *and* their desire to wear baggy pants? In<br/>\nprevious discussions folks on this list have talked about finding<br/>\nwin-win solutions. That&#39;s really helped me thinking differently about<br/>\nthis stuff - it doesn&#39;t have to be a win/lose. There is usually a way<br/>\nto meet everyone&#39;s needs.<br/>\n<br/>\nHave you brainstormed about this issue? Have you discussed it with<br/>\nthem? Not talking at them, but truly asking for their input and being<br/>\nreceptive to what they say. Why do your boys prefer the big pants? It<br/>\nis a style they like? Are they more comfortable? How does the<br/>\n&quot;squelching their individuality&quot; feel to them? How does it affect your<br/>\nrelationship with them? Can they wear baggy pants at home? Can they<br/>\nwear exercise shorts or boxers under the pants to make them less<br/>\nrevealing?<br/>\n<br/>\nMy kids prefer to wear as few clothes as possible. We have close<br/>\n(nosy) neighbors and no outdoor privacy. For practical and legal<br/>\nreasons, they need to be dressed appropriately when they&#39;re outside.<br/>\nTo make this less of an issue for them, I make sure they they have<br/>\nchoice and say-so over their inside clothing (or lack thereof). They<br/>\ncan wear pjs or just a t-shirt and underwear if they want. They can<br/>\nput on their bathing suit - as my daughter did this evening - and wear<br/>\nit around the house if they want. I&#39;m happy to turn the heat up a<br/>\nlittle to make it warmer if they are more comfortable spending their<br/>\ntime in shorts and going barefoot.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am getting the impression still that there should  be no limits on<br/>\n&gt; children.  I&#39;m sure I&#39;m missing something but I have yet to hear the loudest<br/>\n&gt; voices on here show any limits they have on their children.<br/>\n<br/>\n </span></blockquote>I think you&#39;re still seeing this as &quot;all or none&quot; situation. There<br/>\n*are* natural, practical and/or legal limits. Those exist apart from<br/>\nany &quot;rules&quot; we may impose on our children. If your goal is to see how<br/>\nother parents have been successful at removing the &quot;rules&quot; then you<br/>\nneed to stop focusing on the limits. It&#39;s much more helpful to<br/>\nconcentrate on finding the yes.<br/>\n<br/>\n-=- So my question is, where does it stop? -=-<br/>\n<br/>\nHmm... maybe it will help you see the underlying principal behind this<br/>\ndiscussion if we reword that question, so it becomes &quot;Where does<br/>\nproblem-solving stop?&quot;<br/>\n<br/>\n-=- If you have a 16 yr old daughter who wants to have sex on your<br/>\nsofa in front of you 4 yr old is that OK?  (I&#39;m not being flip<br/>\nseriously.  I want to know if what I perceive being said is actually<br/>\nwhat&#39;s being advocated.) -=-<br/>\n<br/>\nIs it a real-life situation? Possibly, but unlikely. Are your children<br/>\nreally at risk of winding up in this scenario? If you need to focus on<br/>\nthis theoretical situation, then let&#39;s pretend this is a real<br/>\nsituation involving a real teenager. Ask yourself what tragically<br/>\nunmet need the teen must be experiencing in order for this<br/>\ncircumstance to arise in the first place. What is missing from his<br/>\nlife? Do you think a teenager who desire this type of experience grew<br/>\nup feeling safe, loved, secure, trusted, supported, valued, and<br/>\nhonored? Why is this teen driven to fulfill his needs in unsafe,<br/>\nillegal, or inappropriate ways?<br/>\n<br/>\nSometimes people become frustrated about the apparent lack of limits<br/>\nthat families on this list place on their kids. They may stretch to<br/>\nconceive of the most dramatic situation they can come up with, hoping<br/>\nthat finally someone will agree that yes, here is a situation where<br/>\nyou can &quot;lay down the law&quot; and set limits across the board. The<br/>\nproblem is that they are too busy pushing to find the &quot;no&quot; that they<br/>\nget stuck. You can&#39;t find the &quot;yes&quot; when you&#39;re looking for the place<br/>\nwhere &quot;no&quot; lives. It won&#39;t help you make the shift to a different<br/>\nperspective.<br/>\n<br/>\nA common refrain: &quot;So it&#39;s okay to just let your kid jump off a cliff<br/>\nor play in the road?&quot;<br/>\n<br/>\nParents on this list have come up with ways to say yes even in these<br/>\nand other &quot;extreme&quot; situations. However, it must get tiresome for them<br/>\nto expend energy on coming up with solutions to problems that are<br/>\ncurrently non-existent or extremely far-fetched, such as your question<br/>\nabout teenage sex in front of a sibling.<br/>\n<br/>\nIf you want to go from a place of limits and control to a place of<br/>\ntrust and creative problem-solving, know that focusing on rules or<br/>\nunlikely situations is not going to help you make the shift. What<br/>\nmight help: taking a recent or current event, looking at it from<br/>\ndifferent angles, discovering your own issues (and owning them),<br/>\nthinking about the principals behind unschooling (I listed a few at<br/>\nthe beginning) and choosing to try a different approach in the future.<br/>\n<br/>\nBtw, I&#39;m still learning, pushing my own comfort levels, questioning<br/>\nthe assumptions and conventional &quot;wisdom&quot; that resides in my head. I<br/>\nused to look for the &quot;no&quot;, too, but eventually I realized that it<br/>\nwasn&#39;t helpful in the long run - it didn&#39;t get me any closer to where<br/>\nI wanted to be. It only got me stuck in that old way of thinking.<br/>\n<br/>\n~ Susan</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191557070","msgId":26726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyMDU5MEFBLTgwQTktNDRGQi1BMEExLTA3RDAzRkZEMDUyNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26725,"nextInTopic":26728,"prevInTime":26725,"nextInTime":26727,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"... You re still dividing the world into two pieces. This time it s either kids do what you want or they do whatever. Kids who are controlled tend to push","messageBody":"<div id=\"ygrps-yiv-346744417\">On Oct 4, 2007, at 1:37 PM, Karen Swanay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am getting the impression still that there should be no limits on<br/>\n&gt; children.<br/>\n<br/>\n </span></blockquote>You&#39;re still dividing the world into two pieces. This time it&#39;s  <br/>\neither kids do what you want or they do whatever.<br/>\n<br/>\nKids who are controlled tend to push boundaries and reach for things  <br/>\n*because* they will get a rise out of parents. They make a good case  <br/>\nfor the need for limits!<br/>\n<br/>\nKids who are partners with their parents, don&#39;t need to do that. They  <br/>\ndon&#39;t need to prove that they can do what others think they can&#39;t  <br/>\nbecause no one&#39;s drawing arbitrary lines in the dirt that they aren&#39;t  <br/>\nallowed to cross.<br/>\n<br/>\nMindfully parented kids will want things we&#39;d rather they didn&#39;t but  <br/>\nif they know we respect their needs, they&#39;ll take what we say  <br/>\nseriously. Doesn&#39;t mean they&#39;ll make the choice we would, but they  <br/>\ndon&#39;t make choices based on the need to test their competence in the  <br/>\nface of distrust.<br/>\n<br/>\nControlled kids do not behave the same as mindfully parented  ones.  <br/>\nIf you try to extrapolate behavior based on average kids (meaning  <br/>\nkids who are controlled) it&#39;s not going to make sense why we can  <br/>\ntrust our kids and not set limits. We do discuss things but we don&#39;t  <br/>\nexpect them to make the decisions we would. When they&#39;re treated like  <br/>\nthoughtful people they become thoughtful people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, those huge pants that hang are verboten.<br/>\n&gt;<br/>\n&gt; There are limits to what an individual can be allowed to do. I would<br/>\n&gt; love to be topless on our beach but that&#39;s against the law.<br/>\n&gt;<br/>\n </span></blockquote>These aren&#39;t equivalent. One is a rule you&#39;ve decide the other is a law.<br/>\n<br/>\nIf the pants are illegal in your area, then you don&#39;t need a limit.  <br/>\nThe limit already exists.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, those huge pants that hang are verboten.<br/>\n<br/>\n </span></blockquote>Who will die if they wear those style pants?<br/>\n<br/>\nIt&#39;s a useful question to ask yourself when trying to shift from no  <br/>\nto yes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you have a 16 yr old daughter who wants to have<br/>\n&gt; sex on your sofa in front of you 4 yr old is that OK?<br/>\n&gt;<br/>\n </span></blockquote>Why would a 16 yo want to have sex in front of a 4 yo?<br/>\n<br/>\nReally, that&#39;s a serious question. Do you think that 16 yos naturally  <br/>\nwant to do that? And the only reason they don&#39;t is because parents  <br/>\nsay don&#39;t?<br/>\n<br/>\nI can guarantee that if a 16 yo is doing that it&#39;s 1) because they&#39;re  <br/>\nvery angry and have a poor relationship with their parents (from  <br/>\neither tight control or lack of attention), or 2) they&#39;re growing up  <br/>\nin an environment where that kind of thing is happening around them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191554778","msgId":26725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVERkE2NDY1LTlGRjUtNEE3Ny1BQjQ2LTA5MjY0RjUyNjFDMkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":26724,"nextInTopic":26726,"prevInTime":26724,"nextInTime":26726,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"This reminds me of something that someone said to me, in person, not on a list. I don t know how you can afford all those videogames, she said. I said,","messageBody":"<div id=\"ygrps-yiv-765440590\">This reminds me of something that someone said to me, in person, not  <br/>\non a list.<br/>\n<br/>\n&quot;I don&#39;t know how you can afford all those videogames,&quot; she said.<br/>\n<br/>\n  I said, &quot;Huh?&quot;<br/>\n<br/>\nShe said, &quot;You have no limits on videogames, I heard.&quot;<br/>\n<br/>\nI said, &quot;Huh?&quot; (Brilliant, aren&#39;t I?)<br/>\n<br/>\nWe miscommunicated for a few more minutes and then I realized that  <br/>\nshe thought we bought our kids every videogame they ever asked for,  <br/>\nthe minute they asked, no matter the cost.<br/>\n<br/>\nFunny thing about that - my kids always saved up their own money to  <br/>\nbuy videogames, we seldom bought one for them. They liked buying  <br/>\ntheir own - they liked saving up, anticipating, keeping an eye on the  <br/>\nprice and the expansion packs and all that stuff. She bought her  <br/>\nkids&#39; games, but then limited when and how long they were allowed to  <br/>\nplay. &quot;That&quot; is what we mean by limits, not real limitations imposed  <br/>\nby real circumstances.<br/>\n<br/>\nPoint?<br/>\n<br/>\nWhen we talk about &quot;no limits,&quot; we explain, over and over, that what  <br/>\nwe mean is that we don&#39;t set arbitrary, external limits on how much  <br/>\nthey&#39;re allowed to play.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 4, 2007, at 10:37 AM, Karen Swanay wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; &quot;Within reason&quot; means within the limits of our family&#39;s  <br/>\n&gt; restrictions. For<br/>\n&gt; example, one son wanted a red leather sectional sofa priced at  <br/>\n&gt; 7000.00.<br/>\n&gt; That is beyond our restrictions. We did not have the money, the  <br/>\n&gt; space, nor<br/>\n&gt; the family situation for leather. The answer was no. Was that limiting<br/>\n&gt; him? Yep. But unless one of the boys has access to a money fairy  <br/>\n&gt; it&#39;s the<br/>\n&gt; limits we have to abide by. Our budget for our new furniture was 2K  <br/>\n&gt; not<br/>\n&gt; 7K. I told him our budget and showed him that was more. He&#39;s still<br/>\n&gt; disappointed. Should we have gone into debt and eaten all the space  <br/>\n&gt; in our<br/>\n&gt; very small living room to make him happy?<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] &quot;Within reason&quot;","postDate":"1191544755","msgId":26724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ1MS4xM2NkZjIzOC4zNDM2ZTFiM0Bhb2wuY29tPg=="},"prevInTopic":26722,"nextInTopic":26725,"prevInTime":26723,"nextInTime":26725,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/4/2007 5:31:38 P.M. Eastern Daylight Time, ... disappointed. Should we have gone into  debt and eaten all the space in our very small","messageBody":"<div id=\"ygrps-yiv-361486876\">In a message dated 10/4/2007 5:31:38 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;He&#39;s still<br/>\n </span></blockquote>disappointed. Should we have gone into  debt and eaten all the space in our<br/>\nvery small living room to make him  happy?&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n <br/>\nIn our home, an option to consider might have been...a red  leather gaming <br/>\nchair that could be moved into the living room and then back into  the child&#39;s <br/>\nroom.  We actually did that.  My son has a red  (leather-like) gaming chair in <br/>\nhis room.  We painted his room red and black  and carried it over to the <br/>\nbathroom.  I think the total cost was under  $200.  It is often possible to come to <br/>\nconsensual decisions by being very  creative about the possibilities.  Maybe <br/>\na small red leather gaming chair  for $80 that could be moved into another <br/>\nroom would have been a way to involve  him in the choices yet still be within <br/>\nyour budget and space limitations.<br/>\nI&#39;m not saying that is the only option, just one way to look at one  <br/>\nsituation creatively.  This type of thinking has really helped me in our  unschooling <br/>\njourney.<br/>\n <br/>\nSome of the best advice I got in our early unschooling days were 1) say yes  <br/>\nmore and 2) consider all the options.  I found myself using this  just this <br/>\nmorning when my daughter wanted to practice singing and her brother  was just <br/>\nsleeping....My comment was...&quot;What do you think about moving the piano  into <br/>\nyour room so you could practice earlier and it would still be quiet enough  for <br/>\npeople still sleeping?&quot;  Much better than saying, &quot;Don&#39;t sing right  now!  <br/>\nIt&#39;ll wake up your brother.&quot; or &quot;Go ahead and sing.  It&#39;s time  for him to get up <br/>\nanyway!&quot;<br/>\n <br/>\nDo you actually think any 16 year old girl would want to have sex in  front <br/>\nof their 4 year old brother?  Really? <br/>\n I have an 18 year old daughter right now sitting on the couch with  her <br/>\nboyfriend and they are very comfortable but respectful with their signs  of <br/>\naffection for each other.  Her 14 year old brother is sitting with them  and I can <br/>\nhear them laughing together watching The 70&#39;s show.  I asked them  about your <br/>\nquestion and they just could not comprehend why you would ask  it.  They don&#39;t <br/>\neven kiss in front of the 14 year old because they know it  makes him <br/>\nuncomfortable.  Living in a home of trust and respect  fosters respect and kindness. <br/>\n <br/>\nMy two kids live in a home full of choices and abundance and  trust.  They <br/>\nare kind and respectful and loving with each other, their  friends and their <br/>\nfamily.  They have been trusted and respected and given  these choices for years <br/>\nnow. <br/>\n <br/>\n It is simply because they have been trusted that they have learned to  make <br/>\ngood decisions for themselves rather than depending on others to make  <br/>\ndecisions for them.  Respect and trust will just naturally lead to positive  choices <br/>\nand not to the scenarios that you are imagining.<br/>\n <br/>\nGail<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n          <br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;Within reason&quot;","postDate":"1191519452","msgId":26722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDcxMDA0MTAzN2w0ZGJlN2VhMG9jOWE4ODkyNzQzY2MwYWI3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":26724,"prevInTime":26721,"nextInTime":26723,"topicId":26722,"numMessagesInTopic":0,"msgSnippet":"I had posted that I listen to my kids re: clothing or some such language ... Within reason means within the limits of our family s restrictions.  For ","messageBody":"<div id=\"ygrps-yiv-1368394601\">I had posted that I listen to my kids re: clothing or some such language<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;within reason&quot; and someone questioned that.  And then someone questioned *I<br/>\n&gt; believe* I can&#39;t find the post now...about the boys having some input on our<br/>\n&gt; new furniture but we made the final decision.  Since these are linked, I<br/>\n&gt; answer them here now.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>&quot;Within reason&quot; means within the limits of our family&#39;s restrictions.  For<br/>\nexample, one son wanted a red leather sectional sofa priced at 7000.00.<br/>\nThat is beyond our restrictions.  We did not have the money, the space, nor<br/>\nthe family situation for leather.  The answer was no.  Was that limiting<br/>\nhim?  Yep.  But unless one of the boys has access to a money fairy it&#39;s the<br/>\nlimits we have to abide by.  Our budget for our new furniture was 2K not<br/>\n7K.  I told him our budget and showed him that was more.  He&#39;s still<br/>\ndisappointed.  Should we have gone into debt and eaten all the space in our<br/>\nvery small living room to make him happy?<br/>\n<br/>\nClothing: I do not..will not allow my sons to run about with their pubic<br/>\narea hanging out of their pants.  So, those huge pants that hang are<br/>\nverboten.  Is that squelching their individuality?  Yeah probably.  But too<br/>\nbad.  There are limits to what an individual can be allowed to do.  I would<br/>\nlove to be topless on our beach but that&#39;s against the law.  It would make<br/>\nme happy.  I&#39;m still not allowed.  Those are lessons that we all have to<br/>\nlearn.  So, instead of the butt crack showing pants, they have something<br/>\nelse they pick out as long as their butt crack is hidden.  AND the clothing<br/>\nhas to be within the family budget.<br/>\n<br/>\nI am getting the impression still that there should  be no limits on<br/>\nchildren.  I&#39;m sure I&#39;m missing something but I have yet to hear the loudest<br/>\nvoices on here show any limits they have on their children.  So my question<br/>\nis, where does it stop?  If you have a 16 yr old daughter who wants to have<br/>\nsex on your sofa in front of you 4 yr old is that OK?  (I&#39;m not being flip<br/>\nseriously.  I want to know if what I perceive being said is actually what&#39;s<br/>\nbeing advocated.)<br/>\n<br/>\nSo, anyway, my kids still have limits on them...mostly they are the limits<br/>\nof decency and budget but really, we all (our family) abide by the same<br/>\nlimits.  I don&#39;t walk around with my butt crack showing either even though I<br/>\ncould do.  I don&#39;t spend beyond what my husband makes even though I could<br/>\ndo.  So is that wrong or have I finally gotten one thing right?<br/>\n<br/>\nKaren *still struggling*<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\n&quot;Family isn&#39;t about whose blood you have.  It&#39;s about who you care about.&quot;<br/>\n<br/>\nLOI 1/26/07<br/>\nPA 3/22/07<br/>\nDTC 8/10/07<br/>\nDisclaimer: Any errors in spelling, tact, or fact are transmission errors.<br/>\n<br/>\n~*~ ~*~ ~*~ ~*~ ~*~ ~*~ ~*~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25799,"nextTopicId":27037}}