{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":236403583,"authorName":"sanfrantigger","from":"&quot;sanfrantigger&quot; &lt;serenacli@...&gt;","profile":"sanfrantigger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Gradually letting go of media control","postDate":"1375837185","msgId":49909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0czY2MSs5dGE3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0azU2dStoZGJxQGVHcm91cHMuY29tPg=="},"prevInTopic":49907,"nextInTopic":0,"prevInTime":49908,"nextInTime":49910,"topicId":49900,"numMessagesInTopic":0,"msgSnippet":"... My hesitations were similar to the various anti-media concerns that have been discussed on this list, the Always Learning List and Radical Unschooling Info","messageBody":"<div id=\"ygrps-yiv-534594046\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; Why? What are/were your reasons for imposing limits and controls on electronic media? &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>My hesitations were similar to the various anti-media concerns that have been discussed on this list, the Always Learning List and Radical Unschooling Info Facebook group I&#39;ve read. The point is that I&#39;m making a different choice now and wanted to see how taking a step in a direction towards unschooling would look in the area of media.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; why do you want to do it gradually, rather than naturally, as the opportunities and desire to watch good programs and play with the computer, etc, come up? &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I would like to do it gradually because I have a life partner who&#39;s thoughts and opinions I value. He also has a say in parenting our children. So I&#39;m looking to do this thoughtfully and graduallyand as the opportunities come up. (thanks for bringing up that point.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; Have the limits you impose on screen-time affected your kids badly yet (made them angry and upset?), or are they fine with it? &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>They are starting to feel the affects of the limitations, which is why I want to take a step towards partnering with them. <br/>\n<br/>\nThank you for sharing your experience with the children you are nannying. That is a scenario that I would like to avoid. But in the process I also need to balance that with harmony in my partnership.<br/>\n<br/>\nSo, steps I&#39;ve taken recently: I&#39;ve ordered DVDs from the library for us to watch together i.e. documentaries, children&#39;s shows, children&#39;s movies. My son has taken an interest in the ukelele so I&#39;ve been pulling up YouTube videos of children playing ukelele and pinning them. If they have a question about something they saw or found, I&#39;ll look it up on YouTube for them. Sometimes I set up the laptop in the kitchen so I can watch a children&#39;s show with them while I prepare dinner. I will try to find more ways in the future to say &quot;yes&quot; more.<br/>\n<br/>\nThank you to everyone for your suggestions.</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Gradually letting go of media control","postDate":"1375574046","msgId":49907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0azU2dStoZGJxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0aG40bSs4MmdrQGVHcm91cHMuY29tPg=="},"prevInTopic":49904,"nextInTopic":49909,"prevInTime":49906,"nextInTime":49908,"topicId":49900,"numMessagesInTopic":0,"msgSnippet":"... Why? What are/were your reasons for imposing limits and controls on electronic media? ... If you want to change this, why do you want to do it gradually,","messageBody":"<div id=\"ygrps-yiv-1154889212\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sanfrantigger&quot; &lt;serenacli@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Our household was very limited in terms of media for our young<br/>\n&gt; children (2.5 and 4.5). <br/>\n<br/>\n </span></blockquote>Why? What are/were your reasons for imposing limits and controls on electronic media?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m looking to make gradual changes in the direction of less<br/>\n&gt; control. We&#39;ve moved to a movie per week arrangement for the past<br/>\n&gt; couple of months + occasional YouTube videos when a question comes<br/>\n&gt; up.<br/>\n<br/>\n </span></blockquote>If you want to change this, why do you want to do it gradually, rather than naturally, as the opportunities and desire to watch good programs and play with the computer, etc, come up?<br/>\n<br/>\nDo *you* enjoy watching TV, DVDs/Netflix, and YouTube videos? Do you enjoy using the computer/tablets? Do your kids enjoy them? Or would they, if you let them watch/play?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you please share some of your own stories of gradually lifting<br/>\n&gt; controls on media? It would help me to see how the process unfolded<br/>\n&gt; in other families. Thanks.<br/>\n<br/>\n </span></blockquote>I don&#39;t have the kind of story you&#39;re looking for to share. I never restricted media for my kids. Our whole family has always been avid enthusiasts of TV watching, the internet, video games, etc. I think that TV and all electronic media have been a wonderful, enriching component of our lives!<br/>\n<br/>\nI&#39;m just replying to your post because having a hard time understanding today&#39;s parents who seem to think that electronic media are &quot;bad&quot; and need to be restricted, or banned altogether.<br/>\n<br/>\nMy formerly-unschooled kids are grown and in college now. I work as a nanny for a family with kids ages 5, 6, and 8. I&#39;m not allowed to let the kids watch TV at all (so of course that&#39;s what the children most want to do), or play video games on their tablets. The family&#39;s desktop computer is in an out-of-the-way basement office, set up in such a way that the kids can&#39;t gather round it and look at websites or play games on it together. They don&#39;t have a large laptop computer or printer on the main floor. The family does have 4 or 5 ipads and android tablets. But you can&#39;t access everything on a tablet. <br/>\n*I* am in the habit of being able to look up information, pictures, videos, etc, on a PC whenever I want to, and to look up activities for kids online, and printing things out - like coloring pages or craft templates. I can&#39;t really do that at the house where I babysit. <br/>\n<br/>\nThe kids are allowed to watch music videos on the ipads (after I specifically asked the mom to let them, because she hired/bribed me away from the family I worked for before because of my background as a music teacher and an arts and crafts specialist), and they&#39;re allowed to play electronic games of checkers and chess, and to look at informational websites, under my supervision. But then I&#39;m expected to stop them when they go to their favorite video games. It&#39;s extremely frustrating for me AND for the kids! In fact, I&#39;ve been meaning to ask the parents why they HAVE games on the tablets, that the kids aren&#39;t allowed to play.<br/>\n<br/>\nThe parents also expect me to force the kids to do boring, tedious &quot;homework&quot; on the ipads (in the summer!). This is ostensibly why they have so many tablets. The kids absolutely hate those boring &quot;homework&quot; websites. At this point, at the young ages of 5, 6, and 8, they already hate everything to do with reading, writing, and math!<br/>\n<br/>\nThe mom told me that the 8 y.o. likes to read, and that all three kids enjoy going to the library. The kids have told me that they hate to read or be read to, and do NOT want to go to the library.<br/>\n<br/>\nNeedless to say, this job is extremely frustrating for me. But I desperately need the income. So I try to put a positive spin on their parents&#39; rules/restrictions, and always come up with other types of games, arts and crafts activities, active games, etc. I take them swimming and bowling often. But the children seem generally unhappy and angry, unable and unwilling to entertain themselves, and they fight constantly. On the few occasions when they have had relatives visiting, and have been allowed to watch TV for a while, they seemed much more mellow, and got along better.<br/>\n<br/>\nWith my own kids, I also came up with lots of games, crafts, active activities, etc, too. We went swimming every day, in the summer. I also read aloud a lot to my kids. They enjoyed it! No one had ever made MY kids come to hate books and stories by turning reading into a tedious chore. <br/>\nWatching TV or videos/DVDs was something we did together, a lot. Watching electronic media, or playing on the computer or Nintendo Gameboys was always just one of many activities available for my kids. I never told them they had time limits on any of these things. <br/>\n<br/>\nMy kids are well-educated, well-rounded, creative people, as am I. <br/>\nI never had any limits on TV watching when I was a kid, either.<br/>\n<br/>\nElectronic media are informative, mind-expanding, and <br/>\ncreativity-enhancing, in addition to being entertaining. That&#39;s why I&#39;m having such a hard time understanding parents who place such severe restrictions on them. The restrictions seem to create anger, anxiety, and strife among the kids, in my experience. And also sneakiness and guilt - as the kids will try to hide with a tablet or Gameboy, and play. (I have had this experience with a few other families I&#39;ve worked for, too.)<br/>\n<br/>\nHave the limits you impose on screen-time affected your kids badly yet (made them angry and upset?), or are they fine with it? They&#39;re still very young, so maybe they haven&#39;t found out yet about all the things they might miss out on. Since you are lifting the restrictions, hopefully your kids won&#39;t get to the point of the kids I&#39;ve been taking care of in recent years, who were all older than 4.<br/>\n<br/>\nIf you want specific suggestions for introducing TV shows and other electronic media to your kids, I&#39;d say start by introducing kids&#39; shows, movies, and YouTube videos that *you* would enjoy watching with them! With Netflix, you can pull up old shows that you enjoyed as a kid! From there, they can explore what&#39;s available by themselves, when they learn how to click on other links, or flip through channels or Netflix titles. As for *when* to watch - well, if you&#39;re going to be the one to initiate watching, choose a time when both you and the kids seem to need to do something relaxing together. Or when they might like to sit and watch a show while you do some household chores. I think a 4 y.o. is more likely to be willing to watch TV without you, while a 2 y.o. will probably want to be wherever you are.    <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Gradually letting go of media control","postDate":"1375535738","msgId":49904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0aXZwcStxb2ViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0aG40bSs4MmdrQGVHcm91cHMuY29tPg=="},"prevInTopic":49901,"nextInTopic":49907,"prevInTime":49903,"nextInTime":49905,"topicId":49900,"numMessagesInTopic":0,"msgSnippet":"... ************** We didn t have overt limits on tv/movies when Mo was little - in the sense of no you can t I mean. But we didn t have any kind of tv","messageBody":"<div id=\"ygrps-yiv-1834340622\">&quot;sanfrantigger&quot; &lt;serenacli@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Can you please share some of your own stories of gradually lifting controls on media? <br/>\n </span></blockquote>**************<br/>\n<br/>\nWe didn&#39;t have overt limits on tv/movies when Mo was little - in the sense of &quot;no you can&#39;t&quot; I mean. But we didn&#39;t have any kind of tv reception (no antenna and no cable/satellite) and we had very few videos. So the first part of changing that, for me, was to start buying more videos, borrowing videos from friends, and renting movies. That way I was able to share some things I really liked - I found a whole set of Rocky and Bullwinkle tapes, for instance - and relax a bit while I read more about unschooling and how it didn&#39;t ruin kids ;)<br/>\n<br/>\nPart of relaxing, for me, has involved recognizing that Mo likes to do things in big chunks. So if she finds a new show, for instance, she wants to see All the episodes. Netflix is great for that because it lets her have massive movie marathons. <br/>\n<br/>\nWe had satellite for awhile, when my stepson moved in full time and started unschooling, but ultimately found that Netflix gives us more of what we want - more variety, and more opportunities to watch whole series. And there are more options for watching things on the internet all the time, including the sorts of independent and amateur productions which don&#39;t tend to come to cable anyway. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Gradually letting go of media control","postDate":"1375520384","msgId":49901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyMzM3Q0Q4LThEQTktNDVDMC1BRTU5LUM4NjdFRjNEOTI4QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGt0aG40bSs4MmdrQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0aG40bSs4MmdrQGVHcm91cHMuY29tPg=="},"prevInTopic":49900,"nextInTopic":49904,"prevInTime":49900,"nextInTime":49902,"topicId":49900,"numMessagesInTopic":0,"msgSnippet":"... That sounds like expanding what you ll allow rather than letting go of control. Letting go of control looks like saying yes more :-) When they ask if they","messageBody":"<div id=\"ygrps-yiv-1392858447\">On Aug 2, 2013, at 9:41 PM, sanfrantigger wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I&#39;m looking to make gradual changes in the direction of less control. <br/>\n&gt; We&#39;ve moved to a movie per week arrangement for the past couple of<br/>\n&gt; months + occasional YouTube videos when a question comes up.<br/>\n<br/>\n </span></blockquote>That sounds like expanding what you&#39;ll allow rather than letting go of control.<br/>\n<br/>\nLetting go of control looks like saying yes more :-)<br/>\n<br/>\nWhen they ask if they can watch something, say yes.<br/>\n<br/>\nBe practical and help them with the bigger picture. If they ask for a movie 15 minutes before dinner, let them know dinner is in 15 minutes. Suggest it be watched later and give them some other ideas. Invite them to help you set the table or something. If they&#39;d rather start the movie and interrupt it, let them try that out. The next time you offer other ideas, they will make more sense :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":236403583,"authorName":"sanfrantigger","from":"&quot;sanfrantigger&quot; &lt;serenacli@...&gt;","profile":"sanfrantigger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Gradually letting go of media control","postDate":"1375494102","msgId":49900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0aG40bSs4MmdrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49901,"prevInTime":49899,"nextInTime":49901,"topicId":49900,"numMessagesInTopic":0,"msgSnippet":"Question on gradual change (I ve read this page: http://sandradodd.com/) Our household was very limited in terms of media for our young children (2.5 and 4.5).","messageBody":"<div id=\"ygrps-yiv-612846869\">Question on gradual change (I&#39;ve read this page: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/)\">http://sandradodd.com/)</a><br/>\n<br/>\nOur household was very limited in terms of media for our young children (2.5 and 4.5). I&#39;m looking to make gradual changes in the direction of less control. We&#39;ve moved to a movie per week arrangement for the past couple of months + occasional YouTube videos when a question comes up.<br/>\n<br/>\nCan you please share some of your own stories of gradually lifting controls on media? It would help me to see how the process unfolded in other families. Thanks.</div>","specialLinks":[]}],"prevTopicId":49898,"nextTopicId":206}}