{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":174819350,"authorName":"Jane","from":"Jane &lt;tribecus@...&gt;","profile":"tribecus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Troublesome neighbor/friend","postDate":"1175580697","msgId":22958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4OTQ5MS41MDQwNC5xbUB3ZWI1MjEwOC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGV1c2llMitxOGo3QGVHcm91cHMuY29tPg=="},"prevInTopic":22957,"nextInTopic":0,"prevInTime":22957,"nextInTime":22959,"topicId":22936,"numMessagesInTopic":0,"msgSnippet":"See?  The worst part about e-mail is that you can t hear me nor see me.  I m not upset at all.  I was trying to clarify.  I sincerely apologize if I sounded","messageBody":"<div id=\"ygrps-yiv-1803084470\">See?  The worst part about e-mail is that you can&#39;t hear me nor see me.  I&#39;m not upset at all.  I was trying to clarify.  I sincerely apologize if I sounded otherwise!!<br/>\n  <br/>\nI see your point.  Ds doesn&#39;t legitimize this boy&#39;s choices, but he does offer explanations if either he sees something or if I mention something.  The best part of all this is clearly the relationship we have built.<br/>\n   <br/>\n  Maybe the crux of my concern is that ds is at a crossroads between seeing that he (nor his siblings) isn&#39;t being treated as he would wish, but also clearly wanting to play with this boy almost no matter what.  So much so that he is willing to drop back the boundaries which he has chosen with any other child I can think of (including siblings).  The other day he was actually being hurt and he didn&#39;t stop the other boy.  I stepped in and said it looked rough and asked if both boys were comfortable.  The other boy said that he was, and ds agreed *even though he obviously was NOT*.  <br/>\n   <br/>\n  Thank you sincerely for your thoughts, <br/>\n  Jane<br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n  Jane Powell <br/>\n  Tribe&#39;s Partner<br/>\n   <br/>\n  &quot;You must be the change you wish to see in the world.&quot; - Gandhi <br/>\n   <br/>\n  &quot;There is no right way to do the wrong thing.&quot; - unknown <br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nTV dinner still cooling?<br/>\nCheck out &quot;Tonight&#39;s Picks&quot; on Yahoo! TV.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Troublesome neighbor/friend","postDate":"1175571714","msgId":22957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV1c2llMitxOGo3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIzNTIzMi45Mzc1Mi5xbUB3ZWI1MjEwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":22948,"nextInTopic":22958,"prevInTime":22956,"nextInTime":22958,"topicId":22936,"numMessagesInTopic":0,"msgSnippet":"hey Jane, I didn t mean to upset you. Maybe demonize is a strong word (okay, it *is* a strong word) for this situation. More of what I meant was allowing him","messageBody":"<div id=\"ygrps-yiv-1705359739\">hey Jane,<br/>\nI didn&#39;t mean to upset you. Maybe demonize is a strong word (okay, it *is* a strong word) <br/>\nfor this situation. More of what I meant was allowing him ownership of the situation. Does <br/>\nhe ever mention it being a problem for him, or are you the one bringing it up? Even if you <br/>\nare just offering observations, will it prevent him from becoming concerned with being <br/>\nmisused? I don&#39;t know the answer for your family, of course, I just know that with my son, <br/>\nthese incidents with his friend had to come to a head without me ever saying anything <br/>\nabout what I saw, because in his head once I said something like &quot;Wow, G sure is running <br/>\nlate picking you up&quot; (after two hours of waiting on the front porch) he was legitimizing <br/>\nevery behavior of this visiting child. <br/>\n<br/>\nI haven&#39;t seen you post that any of these behaviors are a problem for your children. So I <br/>\nwas just wondering about that. <br/>\nOffered in compassion<br/>\nmelissa<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jane &lt;tribecus@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m not sure we&#39;re talking about the same thing.  <br/>\n&gt;    <br/>\n&gt;   I am not demonizing the behaviour of anyone in any way.  I am careful to offer <br/>\nobservations or differences and not to use &quot;bad&quot; or &quot;worse&quot;.  And, I am well aware, that I <br/>\nam offering *my* opinion and it does not mean it must be theirs.  I have applied this to <br/>\nboth their things and the way they conduct themselves from the get-go.  Ds clearly sees <br/>\nmy points as I offer them and sees that I am not labeling &quot;bad&quot; (something huge, imo).  I <br/>\nalso respect his right to make his own choices.  If I didn&#39;t, I would have stopped the visits <br/>\nand/or trafficked them entirely long ago.  <br/>\n&gt;    <br/>\n&gt;   Things?  Yep, they&#39;re theirs to decide to do with what they wish up to and including <br/>\ngiving them away.  I get that and live it too.  The point that bothers me is that he comes <br/>\nover and they give him things all the time.  Just give it to him.  It&#39;s quite obvious that&#39;s the <br/>\nreason he comes over -- the things he gets combined with the fact that they have far <br/>\nmore freedom than he does in his family/home.  <br/>\n&gt;    <br/>\n&gt;   Imo, if I had intervened about the sword, it would have demeaned the gesture/<br/>\nintention of my son.  From that interaction I learned that we needed to articulate that this <br/>\nwas a special thing and we would prefer it not be given away when it was given to ds, not <br/>\nafter.  We were lucky that the child forgot it and were able to explain that it was a special <br/>\nitem without being disrespectful to anyone or their intentions.  <br/>\n&gt;    <br/>\n&gt;   Thank you for posting your thoughts. <br/>\n&gt;   Jane Powell </span></blockquote></div>","specialLinks":[]},{"userId":174819350,"authorName":"Jane","from":"Jane &lt;tribecus@...&gt;","profile":"tribecus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Troublesome neighbor/friend","postDate":"1175529728","msgId":22948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNTIzMi45Mzc1Mi5xbUB3ZWI1MjEwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGV1cjYwNiszaWpqQGVHcm91cHMuY29tPg=="},"prevInTopic":22946,"nextInTopic":22957,"prevInTime":22947,"nextInTime":22949,"topicId":22936,"numMessagesInTopic":0,"msgSnippet":"I m not sure we re talking about the same thing. I am not demonizing the behaviour of anyone in any way.  I am careful to offer observations or differences and","messageBody":"<div id=\"ygrps-yiv-1273287878\">I&#39;m not sure we&#39;re talking about the same thing.  <br/>\n   <br/>\n  I am not demonizing the behaviour of anyone in any way.  I am careful to offer observations or differences and not to use &quot;bad&quot; or &quot;worse&quot;.  And, I am well aware, that I am offering *my* opinion and it does not mean it must be theirs.  I have applied this to both their things and the way they conduct themselves from the get-go.  Ds clearly sees my points as I offer them and sees that I am not labeling &quot;bad&quot; (something huge, imo).  I also respect his right to make his own choices.  If I didn&#39;t, I would have stopped the visits and/or trafficked them entirely long ago.  <br/>\n   <br/>\n  Things?  Yep, they&#39;re theirs to decide to do with what they wish up to and including giving them away.  I get that and live it too.  The point that bothers me is that he comes over and they give him things all the time.  Just give it to him.  It&#39;s quite obvious that&#39;s the reason he comes over -- the things he gets combined with the fact that they have far more freedom than he does in his family/home.  <br/>\n   <br/>\n  Imo, if I had intervened about the sword, it would have demeaned the gesture/intention of my son.  From that interaction I learned that we needed to articulate that this was a special thing and we would prefer it not be given away when it was given to ds, not after.  We were lucky that the child forgot it and were able to explain that it was a special item without being disrespectful to anyone or their intentions.  <br/>\n   <br/>\n  Thank you for posting your thoughts. <br/>\n  Jane Powell<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Jane Powell <br/>\n  Tribe&#39;s Partner<br/>\n   <br/>\n  &quot;You must be the change you wish to see in the world.&quot; - Gandhi <br/>\n   <br/>\n  &quot;There is no right way to do the wrong thing.&quot; - unknown <br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nWe won&#39;t tell. Get more on shows you hate to love<br/>\n(and love to hate): Yahoo! TV&#39;s Guilty Pleasures list.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Troublesome neighbor/friend","postDate":"1175526214","msgId":22946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV1cjYwNiszaWpqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc2Nzk4My45MTQ1OS5xbUB3ZWI1MjEwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":22943,"nextInTopic":22948,"prevInTime":22945,"nextInTime":22947,"topicId":22936,"numMessagesInTopic":0,"msgSnippet":"Is it perhaps (as you say) that they ve never seen that kind of behavior that it s so attractive? And by demonizing it, it becomes even more attractive? My","messageBody":"<div id=\"ygrps-yiv-142797254\">Is it perhaps (as you say) that they&#39;ve never seen that kind of behavior that it&#39;s so <br/>\nattractive? And by demonizing it, it becomes even more attractive? <br/>\n<br/>\nMy children are not much older, but I have seen them go through similar things. And <br/>\npersonally I&#39;d rather have them live out this sequence now while they are younger, than <br/>\nwhen older and in the depths of personal evaluations when a friend&#39;s behavior would seem <br/>\nto reflect their inner person. Does that make sense? After all, their entire lives they will <br/>\nmeet people who will gladly take from them, gladly force them to compete for attention, <br/>\nwho requires &#39;things&#39; to be a friend. My son is learning a big lesson right now about <br/>\nunreliable friends, after being forced to wait for two hours for a ride to the medieval fair. <br/>\n<br/>\nI know it hurts to see your children giving away things that are important to you. But really <br/>\nyou have to disassociate your ownership from their things. I&#39;ve seen the longterm of this, <br/>\nmy brother was the kind of child who thought you had to give things to have friends. He <br/>\nwas taken advantage of throughout his childhood (which my neglectful mother never saw), <br/>\nit started young and culminated with someone taking his TRUCK at the age of 19. After <br/>\nthat, he was able to become an advocate for himself and find people who didn&#39;t want <br/>\nthings from him. he is a wonderful steward now of all that he owns, and still quite <br/>\ngenerous in sharing his profits with those who are less fortunate. I wonder how much less <br/>\ntime it would have taken if a mindful parent had been in our household to boost his self-<br/>\nesteem and allow him to make choices of his own. We were never allowed to have choices <br/>\nin our house, it was her way or the highway, as I found when she kicked me out at 16. <br/>\n<br/>\nI am not amazed by your children&#39;s generosity. Children haven&#39;t learned the quid pro quo <br/>\nthat adults have engrained in their heads, and it&#39;s a fine balance between being taken <br/>\nadvantage of and generosity. On the little stuff, let it go. On something like the sword, I <br/>\nwould have stepped in and said &quot;You know what? This was important to (son&#39;s) dh so I <br/>\nthink we&#39;re going to have this toy stay here&quot;. They will develop a sense of self-<br/>\npreservation, after experiencing disappointment or loss of a toy that they regret losing. My <br/>\nson still is very generous about sharing toys, even $50 video games that leave me <br/>\n(internally) gasping for breath that he so blithely let it go to a friends house. This <br/>\nparticular friend bothers me because while he will allow Josh to use his things, when he&#39;s <br/>\nat our house, he won&#39;t let any of the other kids touch his SECOND DS lite, that&#39;s just sitting <br/>\nthere. He won&#39;t let them play any of the games he has on our DS. I did last time state my <br/>\ndisappointment to him, but I don&#39;t step in the way. If the situation arises naturally, I will <br/>\ntalk to Josh about how disappointed I was that Marty wouldn&#39;t do this or that. Josh says &quot;I <br/>\nknow mom, but Marty is very concerned about how things are used, and it&#39;s very hard for <br/>\nhim to let go&quot; I mean, how can I argue with his compassion?<br/>\n<br/>\nAnd now I&#39;ve got to go, but i think I shared my 2 cents.<br/>\nmelissa<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jane &lt;tribecus@...&gt; wrote:<br/>\n&gt;   And, just like you, I also HATE that they saw/see his playing one off against the other, <br/>\nthe threats, etc.  Something they would NEVER think of on their own nor would have ever <br/>\nentered our home/family without this little boy.  <br/>\n&gt;    <br/>\n&gt;   They also keep GIVING him things.  THEIR things, I know, but he has 3 Pokeballs, a few <br/>\nPokemon, and ds even gave him a special sword kind of a thing dh gave he and his <br/>\nbrother (although, as luck would have it, he forgot it!!).  I don&#39;t want them to measure, but <br/>\nhe has never ever given them a THING!!  <br/>\n&gt;    <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":174819350,"authorName":"Jane","from":"Jane &lt;tribecus@...&gt;","profile":"tribecus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Troublesome neighbor/friend","postDate":"1175522751","msgId":22943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2Nzk4My45MTQ1OS5xbUB3ZWI1MjEwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDA0MDIyMDA3MTE1MC45MTM0LjQ2MTBFRTBFMDAwNEI4RDAwMDAwMjNBRTIyMTU1OTM0MTQ5Qzk5MEE5RDBBMDQwQTA4OUJAY29tY2FzdC5uZXQ+"},"prevInTopic":22938,"nextInTopic":22946,"prevInTime":22942,"nextInTime":22944,"topicId":22936,"numMessagesInTopic":0,"msgSnippet":"Wow, it IS the same thing!!  At first, it seemed we NEEDED more folks to play with and that the attraction to this child would dissapate, but the fact is, it","messageBody":"<div id=\"ygrps-yiv-1037529294\">Wow, it IS the same thing!!  At first, it seemed we NEEDED more folks to play with and that the attraction to this child would dissapate, but the fact is, it is THIS child with whom he wishes to play.  No other.  The fact that he&#39;s so close only makes it worse.  OK, he&#39;s moving, but there&#39;s still the issue.  I do point out without berating, and I ask ds if he wants to hear, differences between this boy and others when they come here/we go there.  He clearly sees the same things, but still wants to play...  I find myself attempting to not be home when he gets home from school, etc., but that is not a way I would hope they&#39;d treat me...<br/>\n   <br/>\n  And, just like you, I also HATE that they saw/see his playing one off against the other, the threats, etc.  Something they would NEVER think of on their own nor would have ever entered our home/family without this little boy.  <br/>\n   <br/>\n  They also keep GIVING him things.  THEIR things, I know, but he has 3 Pokeballs, a few Pokemon, and ds even gave him a special sword kind of a thing dh gave he and his brother (although, as luck would have it, he forgot it!!).  I don&#39;t want them to measure, but he has never ever given them a THING!!  <br/>\n   <br/>\n  It helps to know there&#39;s someone else who was just as stuck as I am.  I&#39;m also hoping for some insight from one who has btdt...  <br/>\n<br/>\n  Thanks for taking your time to post!<br/>\n  Jane Powell<br/>\n  <br/>\n <br/>\n<br/>\n<br/>\n  Jane Powell <br/>\n  Tribe&#39;s Partner<br/>\n   <br/>\n  &quot;You must be the change you wish to see in the world.&quot; - Gandhi <br/>\n   <br/>\n  &quot;There is no right way to do the wrong thing.&quot; - unknown <br/>\n<br/>\n<br/>\n \t <br/>\n---------------------------------<br/>\nLooking for earth-friendly autos? <br/>\n Browse Top Cars by &quot;Green Rating&quot; at Yahoo! Autos&#39; Green Center.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180989559,"authorName":"TheLerews@comcast.net","from":"TheLerews@...","profile":"bjlerew66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Troublesome neighbor/friend","postDate":"1175514638","msgId":22938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MDIyMDA3MTE1MC45MTM0LjQ2MTBFRTBFMDAwNEI4RDAwMDAwMjNBRTIyMTU1OTM0MTQ5Qzk5MEE5RDBBMDQwQTA4OUJAY29tY2FzdC5uZXQ+"},"prevInTopic":22936,"nextInTopic":22943,"prevInTime":22937,"nextInTime":22939,"topicId":22936,"numMessagesInTopic":0,"msgSnippet":"I feel for you Jane!  My children also had a friend who I just didn t feel comfortable about. As with your situation, I couldn t put my finger on any one","messageBody":"<div id=\"ygrps-yiv-2028661642\">I feel for you Jane!  My children also had a friend who I just didn&#39;t feel comfortable about. As with your situation, I couldn&#39;t put my finger on any one specific behavior or event....just a general uneasiness on my part.. We had some of the same issues as you- the child helping himself to our pantry, our toys,asking me something and then when he didn&#39;t like my answer  he would ask dh,  etc.,  I would tell myself that I was making too much of these things, but deep down I was concerned that his boldness (and sometimes recklessness) would impact my children in a negative way.  My children loved this child and would ask to see him. I wrestled with ideas of &#39;doing what I think is best for our children&#39; and  &quot; trusting that my children will realize on their own which friends suit them best and &#39; acceptance of a friend even if you don&#39;t agree with every single thing they do&#39;.....So many inner battles I have had about this child.  In the end what has happened is that we&#39;ve met more and <br/>\nmore homeschooling families and new friendships have developed for our children.  The old friend who is in school has also developed other friendships and so our children do not see each other much anymore. On the occasions when they do see one another, my children have come to me with their own observations about how this particular&#39;s child&#39;s behavior differs from our family&#39;s behavior (particularly with regard how we treat others when we visit them in their homes). Although my boys still like this child and play with him if we happen to run into each other,  they don&#39;t ask to see him.  I guess this is a relief to me, but  my concern  (like you Jane) is not feeling entirely comfortable in my ability to handle these sorts of situations.  When the child was around I would stay close by to see what he was saying to my children .....I felt stressed whenever the child was around because his behavior was unpredictable and sometimes eratic ..... When my boys noticed behaviors that were d<br/>\nifferent from theirs they would mention it to me and we would discuss how they felt about those behaviors, etc.,  I feel we have good communucation between us and I know they need to learn to make their own choices, but this feels like a gray area to me-  wanting to &#39;shield them&#39; from behaviors that don&#39;t feel comfortable to ME but knowing that ultimately my children need to make their own observations and choices about people they come into contact with.  Any of the more seasoned unschoolers have any insight?  <br/>\n<br/>\n<br/>\n      <br/>\n  <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":174819350,"authorName":"Jane","from":"Jane &lt;tribecus@...&gt;","profile":"tribecus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Troublesome neighbor/friend","postDate":"1175489539","msgId":22936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0NjQyNi41ODY3Ny5xbUB3ZWI1MjExMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":22938,"prevInTime":22935,"nextInTime":22937,"topicId":22936,"numMessagesInTopic":0,"msgSnippet":"For some time now, ds, almost 10, has been playing with a little boy who lives one house away from us.  90% of the time, the little boy, also almost 10, comes","messageBody":"<div id=\"ygrps-yiv-1316251388\">For some time now, ds, almost 10, has been playing with a little boy who lives one house away from us.  90% of the time, the little boy, also almost 10, comes to our home.  And, just about every time there is some sort of issue.  At first, it was my gut (and still is).  I didn&#39;t trust him (and still don&#39;t).  He was doing things like looking over all the toys, picking up the toys without asking, going and getting food, etc. as if he lived here as well.  Asking our other children to play with their toys, but not choosing to include them in their play.  Nothing &quot;bad&quot; per se, but not the most comfortable things in the world either.  We all talked through them, and ds still wanted to play with him.  He chose to speak with this little boy each time, but...  <br/>\n   <br/>\n  He & my son used to trade video games.  He returned a game cracked and almost broken.  While the game wasn&#39;t new, it was a game that ds *really* liked.  Ds chose to ask the little boy about the crack and the little boy said he didn&#39;t know.  I felt he was lying and told ds so, but, at the end of the day, the game was, in fact, ds&#39;s and his choice of what to do.  He chose to believe him.  <br/>\n   <br/>\n  Once while he was here we accidentally broke a toy he brought which he had left on the floor.  We chose to replace it for him and mentioned nothing of the fact it was left on the floor.  He has yet to even step up and tell us when he brakes something.  We just find it.  <br/>\n   <br/>\n  At the very least, I am physically right with them as they play.  That doesn&#39;t seem to make it better either though.  Today he walked off with dd&#39;s Pokemon.  We had to go over to his home to get it back.  When we asked, he readily returned it, but...<br/>\n   <br/>\n  The last few days, imo, it&#39;s gotten more serious.  My sons and the little boy were riding scooters down our hill.  I saw the little boy riding in the middle of the street.  I asked that he ride on the side of the road, as my boys do, and he said, &quot;in the gutter??&quot;.  I explained that I wasn&#39;t trying to ruin his ride, but if a car came and he was in the middle of the street...  Today he was again riding in the middle of the street.  I told him, point blank, that it wasn&#39;t acceptable to do that.  More than that, it just wasn&#39;t safe.  If he couldn&#39;t stay on the side of the road he wouldn&#39;t be able to ride the scooter at all.  My children were quite bothered by my threat.  We don&#39;t threaten, but, they also have the sense to stay out of the way of a car.    <br/>\n   <br/>\n  Then he and my son asked if he could spend the night.  I said that I would prefer he did not.  When dh arrived home, I heard the little boy asking dh if he could spend the night.  I jumped in and told him that we did not shop around for the best reply here, that we respected each other, and the asking one and then the other was *not* acceptable at our home.  <br/>\n   <br/>\n  There are more examples, but...  <br/>\n   <br/>\n  I am not comfortable with this little boy in our home.  Ds knows this.  We have talked about it endlessly.  That said though, I also don&#39;t feel it fair for me to simply forbid ds to play with him at our home.  Nor do I feel it to be such a bright move for ds simply to go to their home.  Their play is, at times, really rough and ds, while able to set limits on what&#39;s appropriate for himself with dh & his siblings, he has never enforced the same boundaries with this little boy.  Moreover, ds told me that he changes who he is when he&#39;s around this little boy so that his friend wouldn&#39;t be bored and would want to play again.  We talked about what being a friend means and that being a true friend means that you don&#39;t change.  Ds knows this, but says that he still chooses to change.  Leaving him to fend for himself at a home without an adult just doesn&#39;t feel right either.  The little boy should be moving at the end of the school year, but muddling through until then just<br/>\n doesn&#39;t feel right either.  And, when the next time comes...  <br/>\n   <br/>\n  I&#39;m stuck.  What would you do?   <br/>\n   <br/>\n  Tired from thinking and thinking...<br/>\n  Jane<br/>\n   <br/>\n   <br/>\n   <br/>\n<br/>\n<br/>\n  Jane Powell <br/>\n  Tribe&#39;s Partner<br/>\n   <br/>\n  &quot;You must be the change you wish to see in the world.&quot; - Gandhi <br/>\n   <br/>\n  &quot;There is no right way to do the wrong thing.&quot; - unknown <br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nSucker-punch spam with award-winning protection.<br/>\n Try the free Yahoo! Mail Beta.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22951,"nextTopicId":22963}}