{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Healing through unschooling","postDate":"1109608810","msgId":4958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2dmhoYSs2YzFjQGVHcm91cHMuY29tPg=="},"prevInTopic":4957,"nextInTopic":0,"prevInTime":4957,"nextInTime":4959,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":" Biblically in Philippians we are instructed to fill our minds with only things that are good and wholesome, lovely, right and pure so we don t watch any","messageBody":"<div id=\"ygrps-yiv-1360531967\">&quot; Biblically in Philippians we are instructed to fill our minds with <br/>\nonly things that are good and wholesome, lovely, right and pure so <br/>\nwe don&#39;t watch any trash TV or Rated R movies.&quot;<br/>\n<br/>\nOk, I know we all have different beliefs, but if my child wanted to <br/>\nwatch something *I* deemed as &quot;trash&quot;, I would think that trusting <br/>\nmy child over a verse in the Bible would be extremely important.<br/>\n<br/>\nThere are many verses that contradict themselves, considering human <br/>\nneed is important to the unschooling process. Trusting our children <br/>\nto find their spiritual path while watching, learning about things <br/>\nthat aren&#39;t completely &quot;pure&quot; according to Mom and Dad can lead to <br/>\nsome really great learning moments.<br/>\n<br/>\nIf I limited what my children watched, they would have missed out on <br/>\nsome amazing things (because *I* didn&#39;t like them).<br/>\n<br/>\nUnschooling is about trust. It sounds like you&#39;ve all found a <br/>\nwonderful place in your journey...it&#39;s SO awesome to have a dh that <br/>\nunderstands and doesn&#39;t hassle your decision. Really cool.<br/>\n<br/>\nI encourage you to trust that young man fully. If he wants to watch <br/>\nsomething that seems dubious, trust that he&#39;s getting something good <br/>\nout of it. Truly.<br/>\nIt&#39;s hard to let go of our preconcieved notions of what is &quot;good&quot; <br/>\nor &quot;bad&quot;, but since I have been able to do that, I&#39;ve seen so much <br/>\nlearning flow out of it.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Healing through unschooling","postDate":"1109608697","msgId":4957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2dmhkcCtnZzNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGN2c29qcStsaWxuQGVHcm91cHMuY29tPg=="},"prevInTopic":4956,"nextInTopic":4958,"prevInTime":4956,"nextInTime":4958,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"... My first story is about my four year old and the huge change in his personality. A little background: I d always wanted to homeschool, but started off","messageBody":"<div id=\"ygrps-yiv-1690375543\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@n...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What significant healing (if any) has your family found after <br/>\n&gt; adopting an unschooling lifestyle? How has it affected your <br/>\n&gt; relationships  with your immediate family or with others?<br/>\n&gt; Has it increased your feelings of confidence in yourself and your <br/>\n&gt; ability to learn new things at any time?<br/>\n<br/>\n </span></blockquote>My first story is about my four year old and the huge change in his <br/>\npersonality. A little background: I&#39;d always wanted to homeschool, <br/>\nbut started off pushing and controling--well, attempting to control. <br/>\nI was on homeschooling pre-K lists that talked about kids who enjoyed <br/>\nthe elaborate projects their moms set up. There were a ton of rewards <br/>\nneeded to keep the kids doing their work of learning the alphabet and <br/>\nother 3 yr old-ish skills. Even before reading Alfie Kohn, I didn&#39;t <br/>\nlike that. So I kept reading and found unschooling. Even though my <br/>\nson was only 3, it was a big switch from thinking about pushing <br/>\nacademics and controling food, tv, etc. to letting him set the pace <br/>\nand make decisions for himself.<br/>\n<br/>\nAs a baby and toddler, he tended to be anxious about new situations, <br/>\ndoing things for himself or group settings. (One on one, even with <br/>\nnew people, he&#39;s always been outgoing). I started relaxing controls <br/>\nlast May. There were some gradual changes in him and potty training <br/>\nin Oct. when he turned four went very easily. I&#39;d expected every step <br/>\nto be a big deal--the big toilet, public toilets, etc. but instead he <br/>\nenjoyed becoming competant and mastering each step.<br/>\n<br/>\nAround Christmas, he was extremely anxious and stuck to dh and me <br/>\nlike glue. We thought it was because of the holiday (which was fairly <br/>\ncalm, but still a big change from our routine). Anyway, in January, <br/>\nwe figured out that it was a kind of emotional growth spurt! He&#39;s now <br/>\nconfident and wanting to prove himself in physical and other areas. <br/>\nFor instance, he went from refusing to be upstairs alone to opening <br/>\nthe gate to the stairs, closing it behind him (so the 2 yr old is <br/>\nsafe!) and happily playing by himself. From saying he couldn&#39;t open <br/>\nthe fridge to get his cup to trying to make a pb&j sandwich alone! <br/>\n<br/>\nSince it&#39;s been snowy and muddy, we haven&#39;t been outside much, but <br/>\nwe&#39;ve been developing our own gymnastics routines inside. Mikey <br/>\nclimbs on top of the reclining chair and does a backwards somersault <br/>\ndown the chair and lands on his feet. I still can&#39;t believe it when I <br/>\nsee him do that!<br/>\n<br/>\nSome of it is probably natural changes, but I *know* some of it is <br/>\nbecause I&#39;m not trying to push, challenge, strongly encourage him to <br/>\ndo things, but instead being comfortable with his decisions about <br/>\nwhen and if he wants to do something. I was anxious as a child (okay, <br/>\nI&#39;m not exactly over it at 35) and I was pushed a lot and not <br/>\nrespected when I didn&#39;t want to do something. I know my parents were <br/>\ntrying to do their best and were afraid I&#39;d never do this, that and <br/>\nthe other thing, but I&#39;m glad I&#39;ve found a way to support my kids <br/>\nwithout pushing.<br/>\n<br/>\n--aj</div>","specialLinks":[]},{"userId":202172558,"authorName":"Elisa Allender","from":"&quot;Elisa Allender&quot; &lt;eallender@...&gt;","profile":"eally","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Healing through unschooling","postDate":"1109604317","msgId":4956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOGEwMWM1MWRhOSRiNWJkN2NhMCQwNDAxYThjMEBnYXRld2F5LjJ3aXJlLm5ldD4=","referencesHeader":"PDIwMDUwMjI3MTcyNjQ1LlVRWUg1NDAyLm10YTExLmFkZWxwaGlhLm5ldEBsZWlnaD4="},"prevInTopic":4943,"nextInTopic":4957,"prevInTime":4955,"nextInTime":4957,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"I have enjoyed reading all the posts on this subject. My own experience with unschooling only started last year after 3 years of trying to homeschool the","messageBody":"<div id=\"ygrps-yiv-98954352\">I have enjoyed reading all the posts on this subject.<br/>\nMy own experience with unschooling only started last year after 3 years of trying to homeschool the traditional way (by sitting at the kitchen table with workbooks galore!) and failing miserably and making my child hate school.  I always hated school and the whole atmosphere of school (I am an introvert and school is NOT a place for introverted people!)  Living in a Navy family I had to change schools about 8 times and that added to my introverted-ness...LOL, is that even a word?!<br/>\nAll of my teenagers went to public school and have loved most of it (they are all very extroverted and have been extremely involved in band, cheerleading, leadership positions, etc.) so they all say they wouldn&#39;t trade it for anything.  My last two are graduating this year and they are both suffering from a bad case of &quot;senioritis&quot; LOL.  <br/>\n<br/>\nMy husband has not been very supportive of this unschooling method.  We had several discussions here lately, really turning into arguments about it.  He has basically been patient with me the last year but finally felt the &quot;need to say something about my lack of schooling with Dakota each day.&quot;  I got so upset with him recently I couldn&#39;t even think of what to say to him.  So I decided what we needed to do was go away for a weekend and just spend time talking and discussing our ideas/opinions of Dakota&#39;s upbringing.  We did that two weeks ago and it was wonderful!  We were able to hash out everything in a non-confrontational, non-argumentative way and he understands where I am coming from now.  What he was having a hard time understanding was why all of a sudden last year I had made this change to completely unschooling.....he was looking at it as laziness on my part as far as Dakota was concerned!  All he knows is we had 5 other children all go through public school and all of a sudden now I am just keeping our last child home with me every day.  He tried to tell me he always loved school and he feels bad for Dakota!!  I asked him if he loved school so much why didn&#39;t he go on to college or take classes anytime he is interested in something.  I hated school but I love learning!!  I did get my college degree and continue to take classes now on anything I have an interest in that I can&#39;t learn on my own and need a little instruction in.  I showed him how he actually &quot;loved&quot; the activities at school he was involved in (football, basketball, etc) but he didn&#39;t love the book-learning part and he finally agreed.  I went into a lot of detail with him about the whole unschooling philosophy and how it fosters a child&#39;s love for learning and freedom to do that. I also pointed out all of the &quot;things&quot; Dakota has learned this last year ON HIS OWN!  My dh thought that &quot;learning&quot; came from me sitting at the table with a workbook teaching Dakota....he didn&#39;t realize that was completely Dakota&#39;s doing on his own.  I think he finally understands and is much more willing to help Dakota out now when Dakota asks a question or is curious about something.....he sees how he has a major impact/role on his learning experience.....it is not all me anymore! LOL<br/>\n<br/>\nDakota pretty much has the freedom to do what he wants when he wants with a couple of exceptions.  He is always picking up a new hobby or wanting to try something new and I (now that my husband is on board, we) fully support anything he wants to try.  We do restrict shows he watches on TV/movies only because it goes against our Christian beliefs. (We don&#39;t watch it either though.) Biblically in Philippians we are instructed to fill our minds with only things that are good and wholesome, lovely, right and pure so we don&#39;t watch any trash TV or Rated R movies.  He wouldn&#39;t admit this to his friends but he absolutely LOVES watching things like &quot;The Wiggles&quot;, &quot;LazyTown&quot;, &quot;Out of the Box&quot; etc....all the musical shows on in the morning times.  <br/>\n<br/>\nThe second thing he is &quot;made&quot; to do is our Bible studies....but even that can be made fun so he enjoys it now.  I am his Sunday School teacher too so he loves it when he already knows what the lesson is about on Sunday mornings and can answer all the questions! LOL  The kids think he is just so smart! <br/>\n<br/>\nAnyway, I guess the biggest &quot;healing&quot; through unschooling that I have experienced is watching Dakota enjoy his daily life in freedom and watching him absorb life like a sponge knowing he will be supported and loved in whatever he wants to do.  My heart breaks for kids (like those in my SS class) that hate going to school and wish they could just stay home with their mommy & daddy.<br/>\nElisa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Healing through unschooling","postDate":"1109594139","msgId":4943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMjI4MTIzNTMzLkVHQlA0NjE4Lm10YTEzLmFkZWxwaGlhLm5ldEBsZWlnaD4=","inReplyToHeader":"PGN2dTk4Zit2ZWVnQGVHcm91cHMuY29tPg=="},"prevInTopic":4939,"nextInTopic":4956,"prevInTime":4942,"nextInTime":4944,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"I have told this story several times now, about getting a horse for my kids, but I just can t help talking about it some more because it s been life changing","messageBody":"<div id=\"ygrps-yiv-1417632971\">&quot;I have told this story several times now, about getting a horse for <br/>\nmy kids,<br/>\nbut I just can&#39;t help talking about it some more because it&#39;s been <br/>\nlife<br/>\nchanging in many ways.&quot;<br/>\n<br/>\n&lt;&lt;&lt;I love that story. I think it beautifully illustrates how <br/>\nunschoolers see posssibility rather than dead-ends. How unschoolers <br/>\nchallenge themselves to find creative solutions, rather than just <br/>\naccepting &quot;reality&quot; according to society.&gt;&gt;&gt;<br/>\n<br/>\n---<br/>\n<br/>\nThanks.  Every day, at different times during the day, I think about how<br/>\ngreat our lives are.  We have peacefulness, happiness, love, a great<br/>\nrelationship with our kids, a dh who supports unschooling and me, good<br/>\ncoffee.  :-)  We have enough. It just feels so good.  (Sometimes I do wonder<br/>\nif we got someone else&#39;s share of happiness too.)  Life seems unfair at<br/>\ntimes and I sometimes feel guilty for being so happy and contented.<br/>\n<br/>\n <br/>\n<br/>\nGood luck with those businesses!  I am sure you will be a stronger more<br/>\nadept person when you get over whatever stands in your way. You can do it!<br/>\nJust think outside the box.  If you let people know what you need, sometimes<br/>\nthere are people willing to help you get what you want.  They can&#39;t help you<br/>\nif they don&#39;t know what you want though.<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Healing through unschooling","postDate":"1109567567","msgId":4939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2dTk4Zit2ZWVnQGVHcm91cHMuY29tPg=="},"prevInTopic":4938,"nextInTopic":4943,"prevInTime":4938,"nextInTime":4940,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"I have told this story several times now, about getting a horse for my kids, but I just can t help talking about it some more because it s been life changing","messageBody":"<div id=\"ygrps-yiv-1849007940\">&quot;I have told this story several times now, about getting a horse for <br/>\nmy kids,<br/>\nbut I just can&#39;t help talking about it some more because it&#39;s been <br/>\nlife<br/>\nchanging in many ways.&quot;<br/>\n<br/>\nI love that story. I think it beautifully illustrates how <br/>\nunschoolers see posssibility rather than dead-ends. How unschoolers <br/>\nchallenge themselves to find creative solutions, rather than just <br/>\naccepting &quot;reality&quot; according to society.<br/>\n<br/>\nI remember being told all the reasons we couldn&#39;t have a horse when <br/>\nI was a child...there was never any discussion of how we could make <br/>\nit happen or exploration of ideas. Just &quot;no&quot;, we can&#39;t.<br/>\n<br/>\nI think that has been another amazingly healing thing for me...to <br/>\nsee obstacles as challenges not a reason to give up a dream.<br/>\n<br/>\nWe are moving slowly ahead with not one, but two businesses right <br/>\nnow. Slowly pulling in the pieces to make them a reality. There is <br/>\nnothing but joy in this process, because it&#39;s what we love.<br/>\nIn the past, when the difficult parts of a dream or idea came up, I <br/>\nwould typically abandon the project. I had this notion that I was <br/>\nnot &quot;living up to my potential&quot; all my life...boy was that ever a <br/>\nself-fulfilling prophecy. Yucky.<br/>\n<br/>\nThanks for sharing Angela....I really enjoyed being reminded of your <br/>\ndream come true.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Healing through unschooling","postDate":"1109567119","msgId":4938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2dThxZisxMHNvbEBlR3JvdXBzLmNvbT4="},"prevInTopic":4929,"nextInTopic":4939,"prevInTime":4937,"nextInTime":4939,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"Letting go of those things brought us a lot more peace in the house, helped my ds to learn a lot about himself thru making choices and having more control","messageBody":"<div id=\"ygrps-yiv-27532870\">&quot;Letting go of those things brought us a lot more peace in<br/>\nthe house, helped my ds to learn a lot about himself thru making <br/>\nchoices and<br/>\nhaving more control over himself. Letting go of theneed to judge <br/>\nwhat he was<br/>\ndoing in a day as worthy or not worthy was also very healing, seeing <br/>\nthe value<br/>\nin<br/>\nwhatever he does, in every minute of every day, has made all the <br/>\npeople in<br/>\nthis house so relaxed and happy.&quot;<br/>\n<br/>\n<br/>\nThanks for sharing this Nancy....it&#39;s really helped me be more at <br/>\npeace with myself by honoring and valuing my children&#39;s activities <br/>\nwithout all the judgement also.<br/>\n<br/>\nIt&#39;s really cool to hear from people that have always unschooled, <br/>\nyet found healing as they dug deeper.<br/>\nEven if it was more on a personal level than within the family, like <br/>\nMaria.<br/>\n<br/>\nThanks for sharing everyone...I&#39;ve been very touched by all the <br/>\nposts so far. Unschooling philosophies are so Zen like to me. <br/>\nHealing just goes hand in hand with it all I believe...whether it&#39;s <br/>\nchildhood crap we let go of, or better relationships we find (or <br/>\nboth for some of us:)<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":177920469,"authorName":"Maria Dorian","from":"&quot;Maria Dorian&quot; &lt;mariadorian@...&gt;","profile":"pazinhim","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Healing through unschooling","postDate":"1109535334","msgId":4929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2dDlwNis1Z2ZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGN2c29qcStsaWxuQGVHcm91cHMuY29tPg=="},"prevInTopic":4927,"nextInTopic":4938,"prevInTime":4928,"nextInTime":4930,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"Although I can t specifically share a story on how unschooling has helped my family to heal, I can share that because of unschooling (we ve been unschooling","messageBody":"<div id=\"ygrps-yiv-489410569\">Although I can&#39;t specifically share a story on how unschooling has <br/>\nhelped my family to heal, I can share that because of unschooling <br/>\n(we&#39;ve been unschooling since my kiddos were 3), our family doesn&#39;t <br/>\nneed healing at all!  We are a very close family, we love our kids <br/>\nand treat them as our friends.  We are very open about ALL subjects <br/>\nand issues, even if they are only 6 and 5.  I only wish I had this <br/>\ntype of schooling when I was a kid.  I remember crying everyday when <br/>\nI went to school.  As a matter of fact, I was constantly getting <br/>\nsent home from school because I would just cry all day.  I just <br/>\nmissed my parents sooo much!  This happened until I hit third <br/>\ngrade.  It was miserable!  And now I see my kids with no wake up <br/>\ntime, no bed time, and an extremely relaxed learning environment and <br/>\nI notice that they are happy!  And they are learning things that his <br/>\nsame aged friends will have no clue about until they reach much <br/>\nolder grades.  As far as esteem goes, unschooling has helped me to <br/>\nknow that I can teach them in a different way then a school would <br/>\nand they still come out ahead.  Overall, it is a great place to <br/>\nbe...!<br/>\n<br/>\nMaria<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@n...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The list has been a bit on the slow side lately, so I thought I&#39;d <br/>\n&gt; pose some questions I&#39;ve been pondering myself.<br/>\n&gt; I&#39;ve been thinking a lot about how unschooling has helped me heal <br/>\n&gt; myself and my family in a variety of ways....I had a spiritual <br/>\n </span></blockquote>shift <br/>\n<blockquote><span title=\"ireply\"> &gt; after my unschooling shift and even more healing happened in my <br/>\n&gt; personal journey.<br/>\n&gt; Beyond that, our unschooling philosophies have translated into <br/>\n&gt; better relationships all around in our house, not only between our <br/>\n&gt; children, but between Markus and I.<br/>\n&gt; There&#39;s so much about unschooling that has been healing for us. <br/>\n </span></blockquote>Does <br/>\n<blockquote><span title=\"ireply\"> &gt; anyone else have stories to share about this?<br/>\n&gt; What significant healing (if any) has your family found after <br/>\n&gt; adopting an unschooling lifestyle? How has it affected your <br/>\n&gt; relationships  with your immediate family or with others?<br/>\n&gt; Has it increased your feelings of confidence in yourself and your <br/>\n&gt; ability to learn new things at any time?<br/>\n&gt; <br/>\n&gt; There are many things in my journey that have assisted me in <br/>\n </span></blockquote>healing <br/>\n<blockquote><span title=\"qreply\"> &gt; from self esteem and relationship issues, but I can trace a lot of <br/>\n&gt; my shifts back to my unschooling shift. Maybe that sounds too <br/>\n&gt; simple, but it&#39;s true.<br/>\n&gt; <br/>\n&gt; How about the rest of you?<br/>\n&gt; <br/>\n&gt; Ren </span></blockquote></div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Healing through unschooling","postDate":"1109525210","msgId":4927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMjI3MTcyNjQ1LlVRWUg1NDAyLm10YTExLmFkZWxwaGlhLm5ldEBsZWlnaD4=","inReplyToHeader":"PGN2c29qcStsaWxuQGVHcm91cHMuY29tPg=="},"prevInTopic":4926,"nextInTopic":4929,"prevInTime":4926,"nextInTime":4928,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"This is pretty deep and I am not sure I can sum up all the changes that have come over me since discovering unschooling, but I d like to try.  My children have","messageBody":"<div id=\"ygrps-yiv-1944299555\">This is pretty deep and I am not sure I can sum up all the changes that have<br/>\ncome over me since discovering unschooling, but I&#39;d like to try.  My<br/>\nchildren have always been unschooled.  (ages 8 and 10) Our journey began<br/>\nwhen I tried to drop my oldest dd off at nursery school at age 4.75 one day<br/>\nper week, in preparation for kindergarten, which would be 5 days a week.<br/>\nWell, she didn&#39;t want to stay and she made that clear.  I found it kind of<br/>\nshocking that it was normal to the parents and the staff to see a very<br/>\ndistressed child and think nothing of it.   At that moment, I decided to<br/>\nhomeschool (had been thinking about it anyway) and it wasn&#39;t long before I<br/>\ndiscovered unschooling and realized that it wasn&#39;t much different than what<br/>\nI&#39;d already been doing with my kids all along.<br/>\n<br/>\n <br/>\n<br/>\nReading unschooling lists gave me the knowledge and courage to further<br/>\nadvocate for my children.  It helped me to accept my children the way they<br/>\nare without comparing them to other children of the same age.  It helped me<br/>\nto learn to live in the moment and to be a better, less controlling parent.<br/>\nIt helped me not only to accept myself and my differences from other people,<br/>\nIt helped me to appreciate myself and my children and our differences from<br/>\nother people.  <br/>\n<br/>\n <br/>\n<br/>\nI too had a spiritual shift and that helped me to let go of some<br/>\npreconceived notions I had with regards to religion/spirituality.  It sounds<br/>\nso simple to say that but it went deep. I was able to get over feelings of<br/>\nguilt that I wasn&#39;t even aware of on some levels, that were there from my<br/>\nown upbringing.  It was very freeing.  I credit the unschooling lists with<br/>\nhelping me to think outside the box.<br/>\n<br/>\n <br/>\n<br/>\nIt is so hard to put into words how I feel about all the changes that have<br/>\ncome about in the years following my discovery of unschooling.  Our lives<br/>\nare SO rewarding and fulfilling and Peaceful!  We are just a very happy<br/>\nfamily.  I&#39;ve challenged myself to reach for dreams for my children that<br/>\nseemed impossible.  In learning to be my children&#39;s best advocate, I have<br/>\nalso learned to be a better advocate for myself.  <br/>\n<br/>\n <br/>\n<br/>\nI have told this story several times now, about getting a horse for my kids,<br/>\nbut I just can&#39;t help talking about it some more because it&#39;s been life<br/>\nchanging in many ways.  It has just been the best thing for us.  In the<br/>\nfirst few months of horse ownership, I faced and conquered many fears.  I<br/>\nstarted taking riding lesson too (kids had already taken them for a couple<br/>\nyears) and it is such a huge feeling of accomplishment to go from being<br/>\nsomewhat intimidated by these huge animals, to not only feeling comfortable<br/>\naround them, but confident in riding them.<br/>\n<br/>\n <br/>\n<br/>\nI have always been a person who enjoyed challenges and learning new things.<br/>\nI&#39;m a jack of all trades, master of none, and I like it that way.   But most<br/>\nof those things have been static things that I&#39;ve learned to control.  I can<br/>\nuse a skill saw, shingle a roof, wire a house, etc.  Those things are just<br/>\nthings I&#39;ve learned to do with tools.  But with the horse back riding, it is<br/>\ndifferent.  You are reading (body language, etc)  a living breathing animal<br/>\nand working with her and communicating with her and it is such a powerful<br/>\nfeeling of accomplishment.  <br/>\n<br/>\n <br/>\n<br/>\nO.K. We are off to the tack store so I can&#39;t elaborate any more.  I wish I<br/>\ncould make how I feel clearer.  I&#39;ll think on it and maybe write more later.<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n*\t<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77817828,"authorName":"LOWRIEK@aol.com","from":"LOWRIEK@...","profile":"nancylowrie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Healing through unschooling","postDate":"1109520246","msgId":4926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNS4zMWVlNmNlZi4yZjUzNDk3NkBhb2wuY29tPg=="},"prevInTopic":4925,"nextInTopic":4927,"prevInTime":4925,"nextInTime":4927,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"In a message dated 27/02/2005 07:40:19 Pacific Standard Time, starsuncloud@netzero.net writes: There s so much about unschooling that has been healing for us.","messageBody":"<div id=\"ygrps-yiv-1171552835\">In a message dated 27/02/2005 07:40:19 Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\nThere&#39;s so much about unschooling that has been healing for us. Does <br/>\nanyone else have stories to share about this?<br/>\nWhat significant healing (if any) has your family found after <br/>\nadopting an unschooling lifestyle? How has it affected your <br/>\nrelationships  with your immediate family or with others?<br/>\nHas it increased your feelings of confidence in yourself and your <br/>\nability to learn new things at any time?<br/>\n<br/>\n<br/>\n<br/>\nThese are such deep questions, Ren, but I&#39;ll take a stab at it.<br/>\nOur family has always unschooled, our ds is 9.4 and dd is 3.5. I thought we <br/>\nwere unschooling, but I discovered we had lots to learn when I first started <br/>\nreading at unschooling.com and the lists. There I discovered just how <br/>\ncontrolling we were of all that our son did. The usual food, tv, bedtime controls were <br/>\nvery much in place. Letting go of those things brought us a lot more peace in <br/>\nthe house, helped my ds to learn a lot about himself thru making choices and <br/>\nhaving more control over himself. Letting go of theneed to judge what he was <br/>\ndoing in a day as worthy or not worthy was also very healing, seeing the value in <br/>\nwhatever he does, in every minute of every day, has made all the people in <br/>\nthis house so relaxed and happy. <br/>\nMy husband really struggled with the control issues, more so than I did. He <br/>\nhas really relaxed now, and is enjoying the relationship with his children so <br/>\nmuch more. We have really &quot;gelled&quot; as a family, we can feel the connections <br/>\nstrongly, and have a lot more fun doing things together. <br/>\nAs far as increasing my confidence in myself, and my ability to learn new <br/>\nthings at any time, I think that I was always fairly diverse in my interests, and <br/>\nwilling to try new stuff, but now am much more likely to try even more <br/>\nthings. Our house is always so messy, strewn with books, crafts, games, pets. I do <br/>\nnow feel very firm in my philosophy of  unschooling, and am a strong advocate <br/>\nfor my children&#39;s rights to learn in their own way, in their own time. If a <br/>\nsituation arises during an outing or activity with the homeschool group here, I <br/>\nam quick to help ds to do things the way he wants to, rather than the &quot;schooly&quot; <br/>\nway the group sometimes espouses.<br/>\nI think the respectful nature of unschooling now shows in our family, in the <br/>\nway we treat each other and the way my children are in the world. They are <br/>\nempathic and thoughtful, and creative and confident.IT has been very life <br/>\nchanging for all of us, and has allowed me to sort of re-parent the child in me that <br/>\nwas not raised this way. <br/>\nSort of a rambling reply, but it is hard to express the huge changes that <br/>\nhave happened here.<br/>\nGreat post Ren, I look forward to reading other replies.<br/>\n <br/>\nNancy in BC, pondering.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Healing through unschooling","postDate":"1109517754","msgId":4925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2c29qcStsaWxuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":4926,"prevInTime":4924,"nextInTime":4926,"topicId":4925,"numMessagesInTopic":0,"msgSnippet":"The list has been a bit on the slow side lately, so I thought I d pose some questions I ve been pondering myself. I ve been thinking a lot about how","messageBody":"<div id=\"ygrps-yiv-1399241597\">The list has been a bit on the slow side lately, so I thought I&#39;d <br/>\npose some questions I&#39;ve been pondering myself.<br/>\nI&#39;ve been thinking a lot about how unschooling has helped me heal <br/>\nmyself and my family in a variety of ways....I had a spiritual shift <br/>\nafter my unschooling shift and even more healing happened in my <br/>\npersonal journey.<br/>\nBeyond that, our unschooling philosophies have translated into <br/>\nbetter relationships all around in our house, not only between our <br/>\nchildren, but between Markus and I.<br/>\nThere&#39;s so much about unschooling that has been healing for us. Does <br/>\nanyone else have stories to share about this?<br/>\nWhat significant healing (if any) has your family found after <br/>\nadopting an unschooling lifestyle? How has it affected your <br/>\nrelationships  with your immediate family or with others?<br/>\nHas it increased your feelings of confidence in yourself and your <br/>\nability to learn new things at any time?<br/>\n<br/>\nThere are many things in my journey that have assisted me in healing <br/>\nfrom self esteem and relationship issues, but I can trace a lot of <br/>\nmy shifts back to my unschooling shift. Maybe that sounds too <br/>\nsimple, but it&#39;s true.<br/>\n<br/>\nHow about the rest of you?<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":4952,"nextTopicId":4959}}