{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"another letter to relatives","postDate":"1163785285","msgId":19018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOEQ4ODZCRDMxNDkxNS1BMjAtNDgyQkBNQkxLLU0yNi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19017,"nextInTime":19019,"topicId":19018,"numMessagesInTopic":0,"msgSnippet":"I found this searchimg the web a bit. I thought it was a good reply to concerned relatives. I don t know who Stephanie is, but I like her answer! ~Kelly A","messageBody":"<div id=\"ygrps-yiv-1234933530\">I found this searchimg the web a bit. I thought it was a good reply to <br/>\nconcerned relatives. I don&#39;t know who Stephanie is, but I like her <br/>\nanswer!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\nA Letter to Concerned Relatives<br/>\n<br/>\n<br/>\n<br/>\n     My son is just turning 12. I have not been actively pushing him to <br/>\ndo &quot;schoolwork&quot;, in fact, he hasn&#39;t been doing much of anything. I was <br/>\ngetting some flack from relatives because he can&#39;t &quot;rattle off&quot; the <br/>\ntimes tables when they fire questions at him. This had me thinking <br/>\nabout how I could explain &quot;unschooling&quot; to people who have no idea what <br/>\nit means. Their main concern (other than the ever popular <br/>\n&quot;socialization&quot; question) were that the kids didn&#39;t have &quot;some kind of <br/>\nregimented schedule of learning&quot; and that I was keeping them home to <br/>\n&quot;shelter&quot; them from &quot;the real world&quot;. Here is a copy of the letter I <br/>\nwrote them:<br/>\n<br/>\n<br/>\nYour first concern was that they should have &quot;regimented&quot; schedules for <br/>\nlearning. A good schedule is one that meets your personal requirements. <br/>\nMike&#39;s (DH) schedule changes weekly to meet his work requirements. My <br/>\nchildren&#39;s schedules change to meet their requirements. There is <br/>\nnothing inherently &quot;right&quot; about getting up early or going to bed by <br/>\n8pm. Some of our best learning experiences have occurred at night, when <br/>\nthe kids are laying down listening to me read to them.<br/>\n<br/>\nThe idea of sitting down at a table and reading out of a textbook is a <br/>\nmisunderstanding of what learning really involves. The tiny bits of <br/>\nfacts that are generally presented in textbooks are difficult if not <br/>\nimpossible to apply to everyday life. I am curious what a &quot;sensible <br/>\ngoal&quot; for curriculum would be in your opinion? My main goal is to raise <br/>\nindependent, thinking, loving adults with a grasp on the basic skills <br/>\nthey will need to succeed in life. Just how much of what YOU learned in <br/>\nschool do you use everyday? Quick, what is the capital of Germany? What <br/>\nis the major export of Brazil? Have you ever dissected a frog at work? <br/>\nRecite the periodic table of elements in order. What is the symbol for <br/>\nIron? Diagram this sentence and circle the predicate and underline any <br/>\nprepositions. Diagram a factor lattice for the number 32. Had enough?<br/>\n<br/>\nOn the other hand, if you make learning part of your lifestyle, you are <br/>\nlearning all the time. We made a weak battery by using foil, salt, and <br/>\nbaking soda.... to clean the tarnish off my good silver. We experiment <br/>\nwith chemical reactions every day... it&#39;s called cooking. What makes an <br/>\negg go from a liquid to a solid? Why does cornstarch change the <br/>\nphysical properties of a white sauce? What makes the holes in bread? <br/>\nHow does yeast make dough rise? If you have company coming and you have <br/>\nto triple your recipe for Pepper Steak, how much soy sauce will you <br/>\nneed if the original recipe calls for 1/3 cup? If you get $20 for your <br/>\nbirthday, and your brother has $5 left over from Christmas, and there <br/>\nis a toy that you want that costs $35 but is on sale this week for 25% <br/>\noff plus tax, if you pool your money, can you buy it? And if you do, <br/>\nwhat fraction of it is really yours, since you paid more for it than <br/>\nyour brother? :-) Now THAT is practical learning!<br/>\n<br/>\nQuizzing a child to see if he knows the times tables and can rattle <br/>\nthem off is not an accurate measurement of that child&#39;s grasp on math. <br/>\nI am using a practical, hands on approach to math that give the child a <br/>\ngrasp of the fundamentals. If they can see units instead of numbers on <br/>\npaper, then it is easier to manipulate numbers. I don&#39;t want my <br/>\nchildren to just spout memorized facts, I want them to grasp the <br/>\nconcepts that make those facts work. For example, yesterday I asked <br/>\nChris to figure 3 times 12. He got it in seconds. I asked him how he <br/>\ngot the answer so fast, since he has only been working on the times <br/>\ntables up to 10. He said &quot;it was easy, you just take 3x10 and add 3x2 <br/>\n... duh!&quot; See, it doesn&#39;t matter if he KNOWS the answer by memory, it <br/>\nis more important that he knows how to GET the answer! Memorizing math <br/>\nfacts is only for your own convenience. It has no bearing on your <br/>\nunderstanding of multiplication. I could teach IVY the times tables. <br/>\n(she is already learning the 3&#39;s times table from listening to her <br/>\nbrothers practice) but she obviously would have no idea what they mean.<br/>\n<br/>\nIf you believe that my primary reason for homeschooling is to keep my <br/>\nkids away from the &quot;big bad world out there,&quot; you are WAY off! I keep <br/>\nmy kids home because I LIKE THEM HERE! I want to have this time to <br/>\nspend with them, I want them to be able to develop close ties with <br/>\ntheir brothers (and sister). I want them to get their values from US, <br/>\nnot their peers. In case you hadn&#39;t noticed, my children are sweet, <br/>\nloving, intelligent, thoughtful, considerate, helpful, and basically <br/>\ngreat kids! Why do I need to send them away for 8 hours a day? What <br/>\nwill they learn in school that will make such a difference in their <br/>\nlives? I can think of many negative things that they would learn there <br/>\nthat would effect their lives! Hmmm, lets see, there&#39;s sex, drugs, peer <br/>\ndependance, bad language, bad attitudes, humiliation, low self-esteem. <br/>\nI can&#39;t see how learning any of these things will benefit my children! <br/>\nSo why send them? What would they get at school that is so valuable <br/>\nthat they can&#39;t learn it at home? Why not turn that around and ask, <br/>\nwhat can they get at home that they can&#39;t get at school?<br/>\n<br/>\nUnconditional love, acceptance, support, guidance, values, practical <br/>\nlife experience, learning how to make a marriage work, how to be a good <br/>\nparent, to share, to show compassion, to help others, to make good <br/>\ndecisions. I would say that the things you get at home are the most <br/>\nimportant. Somehow, a &quot;good job&quot; isn&#39;t going to be much help if your <br/>\nmarriage is falling apart, is it? What good is a high school diploma if <br/>\nyou don&#39;t know how to balance a checkbook or do your own grocery <br/>\nshopping, or cook your own meals? And if you think school teaches these <br/>\nthings, you are sadly mistaken! School is an artificial environment, <br/>\nnothing there pertains to real life.<br/>\n<br/>\nNo other time in your life will you be in that kind of circumstance <br/>\nwhere you are stuck in a room with people exactly your own age, working <br/>\nnext to, but not with each other, being told to do things by an <br/>\n&quot;authority figure&quot; that have absolutely no bearing on your real life. <br/>\n(Ok, maybe prison comes close) It is no wonder that school attendance <br/>\nis compulsory, no thinking person would voluntarily go there!<br/>\n<br/>\nYou talk about my kids having to go out and meet the world face to <br/>\nface. Well I have news for you.... they LIVE in the real world, it is <br/>\nthe public school that is the sheltered environment. My kids get &quot;real <br/>\nlife&quot; experiences every day. They go shopping, they run errands, they <br/>\ndo housework. How much of what goes on in a classroom is what YOU do <br/>\nevery day?<br/>\n<br/>\nThere will be no great &quot;shock&quot; for my kids, they are already LIVING in <br/>\nthe real world. Why would I want to take them and pen them up in an <br/>\ninstitution for 12 years? If you have any specific questions about my <br/>\nchildren&#39;s education, please feel free to ask me. I am quite pleased <br/>\nwith their progress.<br/>\n<br/>\n-- Stephanie<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]}],"prevTopicId":19004,"nextTopicId":18974}}