{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Digest Number 144","postDate":"1092149978","msgId":2682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMTEtNDExOEUyREEtNDc2NkBzdG9yZWZ1bGwtMzE1NC5iYXkud2VidHYubmV0Pg==","inReplyToHeader":"dW5zY2hvb2xpbmdiYXNpY3NAeWFob29ncm91cHMuY29tJ3MgbWVzc2FnZSBvZiAxMCBBdWcgMjAwNAkwOTowNTo0NyAtMDAwMA=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":2681,"nextInTime":2683,"topicId":2682,"numMessagesInTopic":0,"msgSnippet":"Karen My husband used to have such severe sinus infections when he was a smoker. Also when he held our babies they used to reach up and grab his lit cigerette.","messageBody":"<div id=\"ygrps-yiv-77813896\">Karen<br/>\nMy husband used to have such severe sinus infections when he was a<br/>\nsmoker. Also when he held our babies they used to reach up and grab his<br/>\nlit cigerette. When our eldest went to school and heard how awful<br/>\nsmoking is for the body she went on a continued rampage at home about<br/>\nit. She would even steal her father&#39;s cigerettes and throw them out. He<br/>\nwould get so mad. She would still take them. She would write him letters<br/>\nbegging him to stop smoking because she loved him. He quit. Cold turkey<br/>\nand has never smoked again. Can&#39;t say the same for me. I quit and every<br/>\nnow and then when I am so very overwhelmed I will grab a cigerette. Most<br/>\nof the time I don&#39;t feel the urge for one. My 16 year old son is very<br/>\nnervous, too and seems the most dependent on smoking. He quit smoking<br/>\npot, though. I felt really afraid that he and my two daughters, aged 23<br/>\nand 19 were smoking pot. They knew I didn&#39;t feel comfortable with it<br/>\nyet, I want a clear communication network between us, so we discussed it<br/>\na few times. They don&#39;t like alcohol. They have known people who have<br/>\ndied regarding drinking and driving. They were over to a friends house<br/>\nand a boy slit his wrist while there. He was drunk and the police were<br/>\ncalled, etc. These are the things that scare me. It isn&#39;t them just<br/>\nsitting having a smoke, etc. There are others who gather to &quot;like<br/>\nenergy&quot; who have more going on who don&#39;t have anyone they can discuss<br/>\ntheir emotional concerns with. My kids end up ministering to others,<br/>\nwhich isn&#39;t a bad thing. It has taken a toll on them, at times, though.<br/>\nThen we talk about it and come to some kind of conclusion. It has made<br/>\nthem closer to one another and us as a family. The best conversations<br/>\nseem to be at 11pm for some reason:) Still I keep an &quot;extra eye&quot; on my<br/>\n16 year old son. He seems so fragile in some ways from his years at<br/>\npublic school. He is healing. He said something quite telling last<br/>\nnight. That he wants a &quot;skanky&quot; girlfriend because he is &quot;skanky&quot; and<br/>\nthey are the only ones who would like him. Oui vey... So we talked about<br/>\nthat. He is in love with a young girl who is emotionally &quot;lost.&quot; Her<br/>\nmother uses cocaine and her father was in jail. I think the mom just let<br/>\nthe father move back in after he got out. On one hand he feels drawn to<br/>\nthis girl of &quot;like energy&quot; and on the other hand he &quot;knows.&quot; If I slam<br/>\nthe door shut on him I fear I will lose him. My kids pain is my pain. I<br/>\nhave told them all I will be with them with a whole heart and open mind.<br/>\nThat has been tested over and over again. Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":2681,"nextTopicId":2403}}