{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":159,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208784229","msgId":31946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTcxQ0ExMUVBOEJDMy0xNzQ0LTkwNkBXRUJNQUlMLU1CMDcuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGZ1Z20yMys0bGExQGVHcm91cHMuY29tPg=="},"prevInTopic":31945,"nextInTopic":31947,"prevInTime":31945,"nextInTime":31947,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... From: rabbits3arewe  I am new to this list. I posted with a book recommendation that I think is very supportive of unschooling","messageBody":"<div id=\"ygrps-yiv-98017300\">-----Original Message-----<br/>\nFrom: rabbits3arewe &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rabbits3arewe@...\">rabbits3arewe@...</a>&gt;<br/>\n<br/>\nI am new to this list. I posted with a book recommendation that I<br/>\nthink is very supportive of unschooling philosophies and asked for<br/>\nother books to read. A mom responded and expressed concerns for her<br/>\nchild. I gave her a suggestion based on what we did that was<br/>\nsuccessful. Suddenly things are snowballing.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nThat&#39;s why we suggest that new members read for a week or two and read <br/>\nthe archives for a while before they post.<br/>\n<br/>\nIt&#39;s hard to &quot;get the feel&quot; of a list and its posters in just a few <br/>\ndays.<br/>\n<br/>\nAnything that is posted that is counter to promoting an open, trusting, <br/>\nrespectful relationship with your child will be questioned.<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nI have been told that what I did for my child was dangerous and that<br/>\nmy kids won&#39;t trust me because I&#39;m not going to let them binge on<br/>\nTwinkies.<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nI think you are misunderstanding---or putting a weird spin on it.<br/>\n<br/>\nNo one said it was &quot;dangerous.&quot; It certainly seems like an <br/>\nover-reaction. What was written was that speech therapy for an eight <br/>\nmonth old is drastic and unnecessary---and could potentially color your <br/>\n(and others&#39;) view of your child (as &quot;damaged&quot; or &quot;faulty&quot; or <br/>\n&quot;defective&quot;). I&#39;ve never known of an eight month old who could speak <br/>\nyet, so why would there need to be an intervention? I know you wrote <br/>\nthat there were early &quot;signs&quot;---but that&#39;s like saying a four month old <br/>\nis delayed in walking because he&#39;s not making some certain kind of leg <br/>\nmotions or because he decided to crawl backwards for a while. Or a five <br/>\nyear old is delayed in reading because she&#39;s not writing her name yet.<br/>\n<br/>\nEarly intervention *can* be harmful (not dangerous). It can damage the <br/>\nrelationship between parent and child. Not that an eight month old will <br/>\nknow his mom ever even *did* anything about his speech! &lt;g&gt; But in the <br/>\nmom&#39;s mind, she thinks she &quot;fixed&quot; a problem. THAT can snowball!<br/>\n<br/>\nIt&#39;s that way with reading: schools think that they &quot;teach&quot; reading <br/>\nwith all their lessons and tricks and pressure, but in reality the <br/>\nchild would have come to reading in just about the same time---withOUT <br/>\nall that unnecessary drilling. Patience is BIG. HUGE, but unfortunately <br/>\nan under-appreciated and under-used virtue. &lt;g&gt;<br/>\n<br/>\nThe Twinkie thang---no one said &quot;binge on Twinkies&quot; but you. Forbidding <br/>\nsomething---even for their own good---only backfires.<br/>\n<br/>\nBetter is to discuss the pros and cons and let them make decisions (AND <br/>\naccepting those choices as OK!!!). Even eating *only* Twinkies for a <br/>\nweek won&#39;t kill a person or even permanently damage him. But I doubt <br/>\nthat would be the choice anyone would make if given a wide choice of <br/>\nfood options. Some kids seem to thrive on nothing but boxed mac & <br/>\ncheese and chicken fingers. But not forever---in a healthy home with <br/>\nlots of choices. *Eventually* he&#39;ll branch out---if his eating habits <br/>\nare accepted and he&#39;s given time to explore food in his own time.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIs this how people on this list normally treat each other?<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nMeaning....will things posted that are contrary to an open, respectful, <br/>\ntrusting parent/child relationship be questioned? You betcha!<br/>\n<br/>\nIf you are looking for a list that will support early interventions, <br/>\nI&#39;m afraid this really won&#39;t be a good one for you. A LOT of the <br/>\nproblems with schools (and in our society, in general) stem from the <br/>\nidea that we want everyone doing everything at the same rate as <br/>\neveryone else---and FASTER/SOONER is BETTER. You won&#39;t find unschoolers <br/>\npromoting that.<br/>\n<br/>\nUnschooling accepts that everyone grows and learns at different rates. <br/>\nIt&#39;s not that we won&#39;t ever pursue aid, it&#39;s just that we will give a <br/>\nchild more time to develop and accept that he may not be &quot;on time&quot; <br/>\ndevelopmentally. We use the word &quot;yet&quot; a lot. &lt;g&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a></div>","specialLinks":[]},{"userId":271637621,"authorName":"melissa_hice","from":"&quot;melissa_hice&quot; &lt;mhice@...&gt;","profile":"melissa_hice","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208781110","msgId":31943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1aTFmbis5aTZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1aDRvcSs4c2JnQGVHcm91cHMuY29tPg=="},"prevInTopic":31942,"nextInTopic":31944,"prevInTime":31942,"nextInTime":31944,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... I haven t posted lately, but this one got me thinking.  My dd(9) and I have been listening to the Little House series on cd.  What did people in Laura s","messageBody":"<div id=\"ygrps-yiv-1903066707\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; People are born to development normally, to survive, to thrive. We <br/>\n&gt; don&#39;t need all this intervention and special treatment. If we did, <br/>\n&gt; humans would not populate the planet.<br/>\n&gt; <br/>\n&gt; Alysia<br/>\n&gt;<br/>\n </span></blockquote>I haven&#39;t posted lately, but this one got me thinking.  My dd(9) and I <br/>\nhave been listening to the &quot;Little House&quot; series on cd.  What did <br/>\npeople in Laura&#39;s days do when their 8 month old had &quot;speech delays&quot;?  <br/>\nProbably nothing.  I am thinking back then, nobody knew much about <br/>\nspeech therapy and such and probably just assumed their kid would <br/>\neventually talk like everyone else.  <br/>\n<br/>\nJust thinking here!<br/>\n<br/>\nMelissa</div>","specialLinks":[]},{"userId":271637621,"authorName":"melissa_hice","from":"&quot;melissa_hice&quot; &lt;mhice@...&gt;","profile":"melissa_hice","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208781109","msgId":31944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1aTFmbCs1ZHUyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1aDRvcSs4c2JnQGVHcm91cHMuY29tPg=="},"prevInTopic":31943,"nextInTopic":31945,"prevInTime":31943,"nextInTime":31945,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... I haven t posted lately, but this one got me thinking.  My dd(9) and I have been listening to the Little House series on cd.  What did people in Laura s","messageBody":"<div id=\"ygrps-yiv-1446873227\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; People are born to development normally, to survive, to thrive. We <br/>\n&gt; don&#39;t need all this intervention and special treatment. If we did, <br/>\n&gt; humans would not populate the planet.<br/>\n&gt; <br/>\n&gt; Alysia<br/>\n&gt;<br/>\n </span></blockquote>I haven&#39;t posted lately, but this one got me thinking.  My dd(9) and I <br/>\nhave been listening to the &quot;Little House&quot; series on cd.  What did <br/>\npeople in Laura&#39;s days do when their 8 month old had &quot;speech delays&quot;?  <br/>\nProbably nothing.  I am thinking back then, nobody knew much about <br/>\nspeech therapy and such and probably just assumed their kid would <br/>\neventually talk like everyone else.  <br/>\n<br/>\nJust thinking here!<br/>\n<br/>\nMelissa</div>","specialLinks":[]},{"userId":192176730,"authorName":"Barbara Perez","from":"&quot;Barbara Perez&quot; &lt;barbara.perez@...&gt;","profile":"barbaraperez228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208781100","msgId":31948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwZjQ4NzU2MDgwNDIxMDUzMWg2MThjMGY1NXgzMTBlNTU4ZmU2MDU3NjkyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDkwZjQ4NzU2MDgwNDIxMDUzMXE3MjljMWUxZnY2MTE0N2UzNDA0MzYxZDE2QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZ1Z20yMys0bGExQGVHcm91cHMuY29tPiA8ZnVnbW41K282YzVAZUdyb3Vwcy5jb20+CSA8OTBmNDg3NTYwODA0MjAxODAwZzY3NjZkNjA5bTMzMjEwYmFlNzk2MzYwMGRAbWFpbC5nbWFpbC5jb20+CSA8NEU2NTAxNDctQjZBRS00ODI0LTg5NTMtMEJFMDI2NjA0REIwQHZlcml6b24ubmV0PgkgPDkwZjQ4NzU2MDgwNDIxMDUzMXE3MjljMWUxZnY2MTE0N2UzNDA0MzYxZDE2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":31947,"nextInTopic":31949,"prevInTime":31947,"nextInTime":31949,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"Whew, an addendum to apologize for not having broken up my letany into paragraphs! It s late and I pushed send too soon! On Mon, Apr 21, 2008 at 5:31 AM,","messageBody":"<div id=\"ygrps-yiv-720129029\">Whew, an addendum to apologize for not having broken up my letany into<br/>\nparagraphs!<br/>\nIt&#39;s late and I pushed &quot;send&quot; too soon!<br/>\n<br/>\nOn Mon, Apr 21, 2008 at 5:31 AM, Barbara Perez &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barbara.perez@...\">barbara.perez@...</a>&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Joyce,<br/>\n&gt; I appreciate your statements about protecting children, and about a single<br/>\n&gt; experience not being &quot;deadly&quot; to anyone, and especially about using specific<br/>\n&gt; examples rather than vague ones.<br/>\n&gt; So maybe the difference in where I&#39;m coming from is my experience with<br/>\n&gt; children who had not only not been unschooled from birth, but who had been<br/>\n&gt; through VERY different parenting before coming to me as foster children. Had<br/>\n&gt; I been able to unschool them right away (I obviously wasn&#39;t, since the state<br/>\n&gt; legally had custody, they even had to attend public school, and my hands<br/>\n&gt; were clearly tied  by the agency as to what would have been considered<br/>\n&gt; appropriate parenting regarding many issues) I *may* have been able to take<br/>\n&gt; the absolutely scary but infinitely freeing plunge of providing them with<br/>\n&gt; everything they hadn&#39;t been provided in terms of safety and guidance, while<br/>\n&gt; at the same time supporting them making their own decisions on everything<br/>\n&gt; from eating to how to spend their time to every other decision in their<br/>\n&gt; lives. Clearly I didn&#39;t have that choice, so my goal was to get there very<br/>\n&gt; very gradually instead. But in the course of doing that, and in hindsight, I<br/>\n&gt; came doubt that  the &quot;radical&quot; approach that you and others on this board<br/>\n&gt; advocate would have been in their best interest. In fact, I came to<br/>\n&gt; understand and believe that a gradual approach to independence and freedom<br/>\n&gt; as the child gets older and learns things, COULD be the most sensible<br/>\n&gt; option, if not for &quot;all&quot; children (because I don&#39;t tend to make<br/>\n&gt; pronouncements like that) at least for &quot;my&quot; children and possibly for some<br/>\n&gt; others. After all, many children develop negative habits on their own, for<br/>\n&gt; whatever set of circumstances, including simply the parents not having<br/>\n&gt; discovered unschooling from the start. And that brings me to my point about<br/>\n&gt; habits. I do believe there is such things as unhealthy habits, and healthy<br/>\n&gt; ones - do you? And I also believe that we as humans can be creatures of<br/>\n&gt; habit and that once those behavioral patterns are established, it takes more<br/>\n&gt; than freedom and information to change them, otherwise why would it be so<br/>\n&gt; hard for millions of well-informed, clearly free adults to quit smoking,<br/>\n&gt; overeating, depriving themselves of sleep, and so many other<br/>\n&gt; self-destructive behaviors that plague our society? To oversimplify (and I<br/>\n&gt; do realize it&#39;s more complex than that, but bear with me) I believe this is<br/>\n&gt; because established habits die hard. So, back to parenting, directly related<br/>\n&gt; to protecting my child from harm, besides the short-term &quot;who&#39;s going to die<br/>\n&gt; from this?&quot; question, which I agree with you is useful, I believe another<br/>\n&gt; useful question to ask on a regular basis is &quot;what sort of habits do I want<br/>\n&gt; them to form?&quot; because children have the luxury of being at a stage where<br/>\n&gt; habits  in many areas of their lives are just being formed for the same<br/>\n&gt; time. See, I&#39;m NOT saying that a child that grew up eating boxed macaroni<br/>\n&gt; and cheese to the exclusion of anything else (in one case) or scavenging<br/>\n&gt; from the trash or shop-lifting groceries to survive (in another) will not be<br/>\n&gt; able to outgrow those behaviors (now we&#39;re getting to those specific<br/>\n&gt; examples you were asking for), but I do believe that children need the<br/>\n&gt; guidance of a parent to lead them away from those negative habits, and<br/>\n&gt; leading them away sometimes might take a bit more than just providing<br/>\n&gt; alternatives. Yes, mine are extreme cases, but I point them out because I&#39;ve<br/>\n&gt; heard some people on this and another board say &quot;that just doesn&#39;t happen&quot;<br/>\n&gt; in real life, when I actually have seen specific kids in not even as extreme<br/>\n&gt; cases as mine, but simply in permissive parenting situations (not from<br/>\n&gt; unschoolers at all, on the contrary, permissive in the sense that were<br/>\n&gt; bordering on neglect) developing what I consider to be very unhealthy habits<br/>\n&gt; in terms of their basic physical needs. I&#39;ve seen kids become obese at a<br/>\n&gt; young age clearly not because of some genetic problem but due to the<br/>\n&gt; availability of highly processed high calory foods in the house and nothing<br/>\n&gt; else, combined with the availability of sedentary activity and nothing else.<br/>\n&gt; This is a pet peeve of mine probably because, while my temperament was such<br/>\n&gt; at a young age that I probably would have been much happier to munch away on<br/>\n&gt; high-carb foods while reading book after book on the couch, I did get<br/>\n&gt; enticed/pushed/encouraged by my parents towards some sort of physical<br/>\n&gt; activity (which is probably why we went camping every summer even though my<br/>\n&gt; mom wasn&#39;t keen on it) and why there were definitely rules about mealtimes<br/>\n&gt; and limits on snacks, etc. I have seen the argument about that kind of<br/>\n&gt; &quot;infringement on a child&#39;s freedom&quot; actually causing problems later in life,<br/>\n&gt; and speaking of theory vs. specifics, I can agree with it in theory...but<br/>\n&gt; what I see in my own life is the opposite: When I think of how hard my<br/>\n&gt; parents worked on trying to teach me healthy habits, to me as an adult that<br/>\n&gt; is more of a motivator, not less, to try and lead a healthy life. Is there<br/>\n&gt; anyone out there not with me on this? Are there no adults on this board who<br/>\n&gt; can say they &quot;turned out alright&quot; in some area of their lives, not in spite<br/>\n&gt; of the way they were parented (if they were parented with SOME degree of<br/>\n&gt; rules, as most of my generation were) but because of it?<br/>\n&gt; Again, I do believe in unschooling principles and I&#39;m definitely not<br/>\n&gt; advocating excessive and uncalled for regulation of a child life. I&#39;m<br/>\n&gt; playing devil&#39;s advocate so to speak, only when I see &quot;all or nothing&quot;<br/>\n&gt; reasoning about parenting (vs proactive, careful, balanced reasoning),<br/>\n&gt; which just makes me shrug in an &quot;oh my, the pendulum doeth swing&quot; kind of<br/>\n&gt; way -kwim?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Mon, Apr 21, 2008 at 2:26 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\n&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; On Apr 20, 2008, at 9:00 PM, Barbara Perez wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; As a parent, when a child that doesn&#39;t know better wants<br/>\n&gt; &gt; &gt; something that I know will be harmful to them,<br/>\n&gt; &gt;<br/>\n&gt; &gt; Kids want us to protect them from harm. It would be a betrayal of<br/>\n&gt; &gt; their trust if we stood by and let them get hurt. If my husband stood<br/>\n&gt; &gt; by while I cut my finger off with a chain saw, I&#39;d be pretty pissed!<br/>\n&gt; &gt;<br/>\n&gt; &gt; The issue is what the definition of &quot;harmful&quot; is. Some parents draw<br/>\n&gt; &gt; the harmful line at Twinkies and TV and &quot;too much&quot; computer and R-<br/>\n&gt; &gt; rated movies and advertising and sugar and meat and more than one<br/>\n&gt; &gt; cookie ...<br/>\n&gt; &gt;<br/>\n&gt; &gt; A good question to ask, not as a hand tying rule but as an aid as<br/>\n&gt; &gt; someone is making the transition from no to yes, is, &quot;Who&#39;s going to<br/>\n&gt; &gt; die?&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; So, what harm are you talking about? Real life examples are more<br/>\n&gt; &gt; useful than vagueness.<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; I think that is a terrific<br/>\n&gt; &gt; &gt; time for them to learn about moderation, and discernment, and that<br/>\n&gt; &gt; &gt; not all<br/>\n&gt; &gt; &gt; foods/activities/etc in our big happy world are created equal.<br/>\n&gt; &gt;<br/>\n&gt; &gt; We should be discussing the world as we go along in life not grasping<br/>\n&gt; &gt; at teachable moments. Too often &quot;teachable moments&quot; is a parent<br/>\n&gt; &gt; internally saying &quot;You&#39;re wrong. I&#39;m right. I need you to see the<br/>\n&gt; &gt; right way.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; If my daughter comes for a second bowl of ice cream she&#39;d appreciate<br/>\n&gt; &gt; me saying &quot;We&#39;re eating in 15 minutes.&quot; Then she can use the<br/>\n&gt; &gt; information to make a more informed choice. As part of her decision<br/>\n&gt; &gt; making, she might ask what we&#39;re having. :-) The right answer is<br/>\n&gt; &gt; whatever she decides, not what I think she should do. Part of living<br/>\n&gt; &gt; together, she will have gathered the nutritional value of food but<br/>\n&gt; &gt; even if she decides she&#39;d rather have more ice cream than dinner,<br/>\n&gt; &gt; it&#39;s not a forever decision where this one experience will kill her<br/>\n&gt; &gt; or where forever after she&#39;ll decide to have ice cream instead of<br/>\n&gt; &gt; dinner. She can use the freedom and experience to assess when it&#39;s<br/>\n&gt; &gt; right for *her* to have something other than dinner.<br/>\n&gt; &gt;<br/>\n&gt; &gt; We learn best with the freedom to explore. Part of that freedom is<br/>\n&gt; &gt; trying things out to see what happens *to us*. Part of that freedom<br/>\n&gt; &gt; is the freedom to put up with the bad parts of something for a while<br/>\n&gt; &gt; to get the good parts.<br/>\n&gt; &gt;<br/>\n&gt; &gt; If child is unhappy and feels stuck in a place better than saying no<br/>\n&gt; &gt; to what they&#39;re doing is to expand their world so there is more to<br/>\n&gt; &gt; choose from. Help them find something else rather than make them do<br/>\n&gt; &gt; something else.<br/>\n&gt; &gt;<br/>\n&gt; &gt; But, again, without a specific example, that&#39;s only vaguely helpful.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Joyce<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;  <br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":192176730,"authorName":"Barbara Perez","from":"&quot;Barbara Perez&quot; &lt;barbara.perez@...&gt;","profile":"barbaraperez228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208781065","msgId":31947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwZjQ4NzU2MDgwNDIxMDUzMXE3MjljMWUxZnY2MTE0N2UzNDA0MzYxZDE2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRFNjUwMTQ3LUI2QUUtNDgyNC04OTUzLTBCRTAyNjYwNERCMEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGZ1Z20yMys0bGExQGVHcm91cHMuY29tPiA8ZnVnbW41K282YzVAZUdyb3Vwcy5jb20+CSA8OTBmNDg3NTYwODA0MjAxODAwZzY3NjZkNjA5bTMzMjEwYmFlNzk2MzYwMGRAbWFpbC5nbWFpbC5jb20+CSA8NEU2NTAxNDctQjZBRS00ODI0LTg5NTMtMEJFMDI2NjA0REIwQHZlcml6b24ubmV0Pg=="},"prevInTopic":31946,"nextInTopic":31948,"prevInTime":31946,"nextInTime":31948,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"Joyce, I appreciate your statements about protecting children, and about a single experience not being deadly to anyone, and especially about using specific ","messageBody":"<div id=\"ygrps-yiv-1327378746\">Joyce,<br/>\nI appreciate your statements about protecting children, and about a single<br/>\nexperience not being &quot;deadly&quot; to anyone, and especially about using specific<br/>\nexamples rather than vague ones.<br/>\nSo maybe the difference in where I&#39;m coming from is my experience with<br/>\nchildren who had not only not been unschooled from birth, but who had been<br/>\nthrough VERY different parenting before coming to me as foster children. Had<br/>\nI been able to unschool them right away (I obviously wasn&#39;t, since the state<br/>\nlegally had custody, they even had to attend public school, and my hands<br/>\nwere clearly tied  by the agency as to what would have been considered<br/>\nappropriate parenting regarding many issues) I *may* have been able to take<br/>\nthe absolutely scary but infinitely freeing plunge of providing them with<br/>\neverything they hadn&#39;t been provided in terms of safety and guidance, while<br/>\nat the same time supporting them making their own decisions on everything<br/>\nfrom eating to how to spend their time to every other decision in their<br/>\nlives. Clearly I didn&#39;t have that choice, so my goal was to get there very<br/>\nvery gradually instead. But in the course of doing that, and in hindsight, I<br/>\ncame doubt that  the &quot;radical&quot; approach that you and others on this board<br/>\nadvocate would have been in their best interest. In fact, I came to<br/>\nunderstand and believe that a gradual approach to independence and freedom<br/>\nas the child gets older and learns things, COULD be the most sensible<br/>\noption, if not for &quot;all&quot; children (because I don&#39;t tend to make<br/>\npronouncements like that) at least for &quot;my&quot; children and possibly for some<br/>\nothers. After all, many children develop negative habits on their own, for<br/>\nwhatever set of circumstances, including simply the parents not having<br/>\ndiscovered unschooling from the start. And that brings me to my point about<br/>\nhabits. I do believe there is such things as unhealthy habits, and healthy<br/>\nones - do you? And I also believe that we as humans can be creatures of<br/>\nhabit and that once those behavioral patterns are established, it takes more<br/>\nthan freedom and information to change them, otherwise why would it be so<br/>\nhard for millions of well-informed, clearly free adults to quit smoking,<br/>\novereating, depriving themselves of sleep, and so many other<br/>\nself-destructive behaviors that plague our society? To oversimplify (and I<br/>\ndo realize it&#39;s more complex than that, but bear with me) I believe this is<br/>\nbecause established habits die hard. So, back to parenting, directly related<br/>\nto protecting my child from harm, besides the short-term &quot;who&#39;s going to die<br/>\nfrom this?&quot; question, which I agree with you is useful, I believe another<br/>\nuseful question to ask on a regular basis is &quot;what sort of habits do I want<br/>\nthem to form?&quot; because children have the luxury of being at a stage where<br/>\nhabits  in many areas of their lives are just being formed for the same<br/>\ntime. See, I&#39;m NOT saying that a child that grew up eating boxed macaroni<br/>\nand cheese to the exclusion of anything else (in one case) or scavenging<br/>\nfrom the trash or shop-lifting groceries to survive (in another) will not be<br/>\nable to outgrow those behaviors (now we&#39;re getting to those specific<br/>\nexamples you were asking for), but I do believe that children need the<br/>\nguidance of a parent to lead them away from those negative habits, and<br/>\nleading them away sometimes might take a bit more than just providing<br/>\nalternatives. Yes, mine are extreme cases, but I point them out because I&#39;ve<br/>\nheard some people on this and another board say &quot;that just doesn&#39;t happen&quot;<br/>\nin real life, when I actually have seen specific kids in not even as extreme<br/>\ncases as mine, but simply in permissive parenting situations (not from<br/>\nunschoolers at all, on the contrary, permissive in the sense that were<br/>\nbordering on neglect) developing what I consider to be very unhealthy habits<br/>\nin terms of their basic physical needs. I&#39;ve seen kids become obese at a<br/>\nyoung age clearly not because of some genetic problem but due to the<br/>\navailability of highly processed high calory foods in the house and nothing<br/>\nelse, combined with the availability of sedentary activity and nothing else.<br/>\nThis is a pet peeve of mine probably because, while my temperament was such<br/>\nat a young age that I probably would have been much happier to munch away on<br/>\nhigh-carb foods while reading book after book on the couch, I did get<br/>\nenticed/pushed/encouraged by my parents towards some sort of physical<br/>\nactivity (which is probably why we went camping every summer even though my<br/>\nmom wasn&#39;t keen on it) and why there were definitely rules about mealtimes<br/>\nand limits on snacks, etc. I have seen the argument about that kind of<br/>\n&quot;infringement on a child&#39;s freedom&quot; actually causing problems later in life,<br/>\nand speaking of theory vs. specifics, I can agree with it in theory...but<br/>\nwhat I see in my own life is the opposite: When I think of how hard my<br/>\nparents worked on trying to teach me healthy habits, to me as an adult that<br/>\nis more of a motivator, not less, to try and lead a healthy life. Is there<br/>\nanyone out there not with me on this? Are there no adults on this board who<br/>\ncan say they &quot;turned out alright&quot; in some area of their lives, not in spite<br/>\nof the way they were parented (if they were parented with SOME degree of<br/>\nrules, as most of my generation were) but because of it?<br/>\nAgain, I do believe in unschooling principles and I&#39;m definitely not<br/>\nadvocating excessive and uncalled for regulation of a child life. I&#39;m<br/>\nplaying devil&#39;s advocate so to speak, only when I see &quot;all or nothing&quot;<br/>\nreasoning about parenting (vs proactive, careful, balanced reasoning),<br/>\nwhich just makes me shrug in an &quot;oh my, the pendulum doeth swing&quot; kind of<br/>\nway -kwim?<br/>\n<br/>\nOn Mon, Apr 21, 2008 at 2:26 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Apr 20, 2008, at 9:00 PM, Barbara Perez wrote:<br/>\n&gt;<br/>\n&gt; &gt; As a parent, when a child that doesn&#39;t know better wants<br/>\n&gt; &gt; something that I know will be harmful to them,<br/>\n&gt;<br/>\n&gt; Kids want us to protect them from harm. It would be a betrayal of<br/>\n&gt; their trust if we stood by and let them get hurt. If my husband stood<br/>\n&gt; by while I cut my finger off with a chain saw, I&#39;d be pretty pissed!<br/>\n&gt;<br/>\n&gt; The issue is what the definition of &quot;harmful&quot; is. Some parents draw<br/>\n&gt; the harmful line at Twinkies and TV and &quot;too much&quot; computer and R-<br/>\n&gt; rated movies and advertising and sugar and meat and more than one<br/>\n&gt; cookie ...<br/>\n&gt;<br/>\n&gt; A good question to ask, not as a hand tying rule but as an aid as<br/>\n&gt; someone is making the transition from no to yes, is, &quot;Who&#39;s going to<br/>\n&gt; die?&quot;<br/>\n&gt;<br/>\n&gt; So, what harm are you talking about? Real life examples are more<br/>\n&gt; useful than vagueness.<br/>\n&gt;<br/>\n&gt; &gt; I think that is a terrific<br/>\n&gt; &gt; time for them to learn about moderation, and discernment, and that<br/>\n&gt; &gt; not all<br/>\n&gt; &gt; foods/activities/etc in our big happy world are created equal.<br/>\n&gt;<br/>\n&gt; We should be discussing the world as we go along in life not grasping<br/>\n&gt; at teachable moments. Too often &quot;teachable moments&quot; is a parent<br/>\n&gt; internally saying &quot;You&#39;re wrong. I&#39;m right. I need you to see the<br/>\n&gt; right way.&quot;<br/>\n&gt;<br/>\n&gt; If my daughter comes for a second bowl of ice cream she&#39;d appreciate<br/>\n&gt; me saying &quot;We&#39;re eating in 15 minutes.&quot; Then she can use the<br/>\n&gt; information to make a more informed choice. As part of her decision<br/>\n&gt; making, she might ask what we&#39;re having. :-) The right answer is<br/>\n&gt; whatever she decides, not what I think she should do. Part of living<br/>\n&gt; together, she will have gathered the nutritional value of food but<br/>\n&gt; even if she decides she&#39;d rather have more ice cream than dinner,<br/>\n&gt; it&#39;s not a forever decision where this one experience will kill her<br/>\n&gt; or where forever after she&#39;ll decide to have ice cream instead of<br/>\n&gt; dinner. She can use the freedom and experience to assess when it&#39;s<br/>\n&gt; right for *her* to have something other than dinner.<br/>\n&gt;<br/>\n&gt; We learn best with the freedom to explore. Part of that freedom is<br/>\n&gt; trying things out to see what happens *to us*. Part of that freedom<br/>\n&gt; is the freedom to put up with the bad parts of something for a while<br/>\n&gt; to get the good parts.<br/>\n&gt;<br/>\n&gt; If child is unhappy and feels stuck in a place better than saying no<br/>\n&gt; to what they&#39;re doing is to expand their world so there is more to<br/>\n&gt; choose from. Help them find something else rather than make them do<br/>\n&gt; something else.<br/>\n&gt;<br/>\n&gt; But, again, without a specific example, that&#39;s only vaguely helpful.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":255816758,"authorName":"beensclan","from":"&quot;beensclan&quot; &lt;beensclan@...&gt;","profile":"beensclan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations now Early Intervention","postDate":"1208775273","msgId":31945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1aHJwOStiMmQyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1aDRvcSs4c2JnQGVHcm91cHMuY29tPg=="},"prevInTopic":31944,"nextInTopic":31946,"prevInTime":31944,"nextInTime":31946,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... I agree with what Alysia wrote here and know it for a fact.  I used to work in the Special Needs classrooms.  Around the time I began to become very","messageBody":"<div id=\"ygrps-yiv-15640934\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I think this is a serious problem that stems from the early<br/>\n&gt; intervention stuff from schools. The government provides funds to<br/>\n&gt; states, counties, cities, schools based on the number of children<br/>\n&gt; they have in their districts who need early intervention. Therefore,<br/>\n&gt; it&#39;s beneficial to the district...to find as many children as<br/>\n&gt; possible who need early intervention. It&#39;s difficult for new parents<br/>\n&gt; to trust themselves and trust their children when they see, hear and<br/>\n&gt; read all about all of this stuff everywhere.<br/>\n&gt;<br/>\n&gt; People are born to development normally, to survive, to thrive. We<br/>\n&gt; don&#39;t need all this intervention and special treatment. If we did,<br/>\n&gt; humans would not populate the planet.<br/>\n&gt;<br/>\n&gt; Alysia<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I agree with what Alysia wrote here and know it for a fact.  I used to<br/>\nwork in the Special Needs classrooms.  Around the time I began to become<br/>\nvery disenchanted with the system was when one of the mums decided that<br/>\nshe would like here son to try attending a mainstream Grade 2 class in<br/>\nhopes that his behaviour issues would lessen.  I had to sit at a meeting<br/>\nwith teachers and an administration personel as they all agreed that<br/>\nthey would not let this student go mainstream.  We all knew that if our<br/>\nSpecial Needs class-size dropped to below ten students, we would be<br/>\naffected funding-wise.  The mother&#39;s request to move her son was denied.<br/>\nThe mother ended up taking this to the top and eventually (this makes me<br/>\ncringe...) won the right to move her son to mainstream.<br/>\n<br/>\nAfter my experience with the schools and students with Special Needs I<br/>\nknew to never let my son near that system.  I&#39;m pretty sure that if my<br/>\nson entered the system, a label would be put on him.  It would probably<br/>\nbe some form of sensory integration problem.  Something that I see his<br/>\nbody working out year after year to the point now where he seems<br/>\n&quot;normal&quot;.  Now he&#39;s free to learn, live and love with every confidence<br/>\nthat he is whole and wonderfully made.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208771377","msgId":31942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyQjg1MDE4LTVDRUEtNDE4Ni1BREIyLTE4NDlFRUExRDAyN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGZ1ZzU3Yytsb2lwQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ1ZzU3Yytsb2lwQGVHcm91cHMuY29tPg=="},"prevInTopic":31941,"nextInTopic":31943,"prevInTime":31941,"nextInTime":31943,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... By this do you mean 12 yos struggling with reading? We can discuss real 12 yos but not made up ones. Made up ones have problems that seem probable but","messageBody":"<div id=\"ygrps-yiv-1632434726\">On Apr 20, 2008, at 3:23 PM, rabbits3arewe wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would love to have a discussion about this that is not judgmental or<br/>\n&gt; close-minded.<br/>\n<br/>\n </span></blockquote>By &quot;this&quot; do you mean 12 yos struggling with reading? We can discuss  <br/>\nreal 12 yos but not made up ones. Made up ones have problems that  <br/>\nseem probable but don&#39;t necessarily happen in real life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I see unschooling like a grocery store. Some parents would say, &quot;Eat<br/>\n&gt; what you want.&quot; That is their style. I do not want my child to eat<br/>\n&gt; Twinkies, so I say, &quot;You can eat anything in the produce department.&quot;<br/>\n<br/>\n </span></blockquote>This list is for people who want to find ways to keep their kids safe  <br/>\nwithout controlling them, not for advice on how to limit them. Yes,  <br/>\nit can be a lot more work to find ways to safely help kids explore  <br/>\nthe world than to just say no! We often have to pull our fears out  <br/>\nand scrutinize them. That&#39;s uncomfortable work for many people. It&#39;s  <br/>\n*much* easier to go with the fear and do something &quot;just incase&quot;. But  <br/>\nthis list isn&#39;t for promoting ideas to mollify fears. It&#39;s for  <br/>\ndragging fears out kicking and screaming into the light of day ;-)<br/>\n<br/>\nMy daughter at 16 had a Twinkie recently given by a friend and she  <br/>\nsaid they sampled it and discussed it and tore it apart. It was her  <br/>\nfirst Twinkie. (She&#39;s known about them for years since they&#39;re part  <br/>\nof our culture.) I never bought Twinkies since I don&#39;t like them, but  <br/>\nI also never pointed to them and said &quot;You can have anything but  <br/>\nthat.&quot; I could bet good money she would have been begging to have  <br/>\nsome! And the more I said no, the stronger the desire.<br/>\n<br/>\nPart of her growing up has been talking about food as we cook, as we  <br/>\neat, as we look for packages that don&#39;t have unpronounceable words on  <br/>\nthem ;-) It&#39;s general conversation about food, not unsolicited  <br/>\ninformation given when she&#39;s asked, &quot;Can we try that?&quot; (Though she&#39;d  <br/>\nappreciate me giving useful information she may not have noticed like  <br/>\n&quot;That one&#39;s licorice flavor. The other is mango that you might like  <br/>\nbetter.&quot; Or, &quot;There&#39;s a smaller package incase you don&#39;t like them.&quot;)<br/>\n<br/>\nAs an unrelated example, it was *much* more effective to discuss how  <br/>\nadvertisers use ploys to get us to want to try their product on ads  <br/>\nfor things she didn&#39;t want, toys that didn&#39;t interest her or adult  <br/>\nproducts. WIthout the agenda they were interesting observations and  <br/>\ndiscussions rather than a disguised way of saying &quot;I don&#39;t want you  <br/>\nto have that and I need to persuade you to my way of thinking because  <br/>\nyours is wrong.&quot;<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208770006","msgId":31941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNjUwMTQ3LUI2QUUtNDgyNC04OTUzLTBCRTAyNjYwNERCMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDkwZjQ4NzU2MDgwNDIwMTgwMGc2NzY2ZDYwOW0zMzIxMGJhZTc5NjM2MDBkQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZ1Z20yMys0bGExQGVHcm91cHMuY29tPiA8ZnVnbW41K282YzVAZUdyb3Vwcy5jb20+IDw5MGY0ODc1NjA4MDQyMDE4MDBnNjc2NmQ2MDltMzMyMTBiYWU3OTYzNjAwZEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":31937,"nextInTopic":31942,"prevInTime":31940,"nextInTime":31942,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... Kids want us to protect them from harm. It would be a betrayal of their trust if we stood by and let them get hurt. If my husband stood by while I cut my","messageBody":"<div id=\"ygrps-yiv-447783717\">On Apr 20, 2008, at 9:00 PM, Barbara Perez wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As a parent, when a child that doesn&#39;t know better wants<br/>\n&gt; something that I know will be harmful to them,<br/>\n<br/>\n </span></blockquote>Kids want us to protect them from harm. It would be a betrayal of  <br/>\ntheir trust if we stood by and let them get hurt. If my husband stood  <br/>\nby while I cut my finger off with a chain saw, I&#39;d be pretty pissed!<br/>\n<br/>\nThe issue is what the definition of &quot;harmful&quot; is. Some parents draw  <br/>\nthe harmful line at Twinkies and TV and &quot;too much&quot; computer and R- <br/>\nrated movies and advertising and sugar and meat and more than one  <br/>\ncookie ...<br/>\n<br/>\nA good question to ask, not as a hand tying rule but as an aid as  <br/>\nsomeone is making the transition from no to yes, is, &quot;Who&#39;s going to  <br/>\ndie?&quot;<br/>\n<br/>\nSo, what harm are you talking about? Real life examples are more  <br/>\nuseful than vagueness.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that is a terrific<br/>\n&gt; time for them to learn about moderation, and discernment, and that  <br/>\n&gt; not all<br/>\n&gt; foods/activities/etc in our big happy world are created equal.<br/>\n<br/>\n </span></blockquote>We should be discussing the world as we go along in life not grasping  <br/>\nat teachable moments. Too often &quot;teachable moments&quot; is a parent  <br/>\ninternally saying &quot;You&#39;re wrong. I&#39;m right. I need you to see the  <br/>\nright way.&quot;<br/>\n<br/>\nIf my daughter comes for a second bowl of ice cream she&#39;d appreciate  <br/>\nme saying &quot;We&#39;re eating in 15 minutes.&quot; Then she can use the  <br/>\ninformation to make a more informed choice. As part of her decision  <br/>\nmaking, she might ask what we&#39;re having. :-) The right answer is  <br/>\nwhatever she decides, not what I think she should do. Part of living  <br/>\ntogether, she will have gathered the nutritional value of food but  <br/>\neven if she decides she&#39;d rather have more ice cream than dinner,  <br/>\nit&#39;s not a forever decision where this one experience will kill her  <br/>\nor where forever after she&#39;ll decide to have ice cream instead of  <br/>\ndinner. She can use the freedom and experience to assess when it&#39;s  <br/>\nright for *her* to have something other than dinner.<br/>\n<br/>\nWe learn best with the freedom to explore. Part of that freedom is  <br/>\ntrying things out to see what happens *to us*. Part of that freedom  <br/>\nis the freedom to put up with the bad parts of something for a while  <br/>\nto get the good parts.<br/>\n<br/>\nIf  child is unhappy and feels stuck in a place better than saying no  <br/>\nto what they&#39;re doing is to expand their world so there is more to  <br/>\nchoose from. Help them find something else rather than make them do  <br/>\nsomething else.<br/>\n<br/>\nBut, again, without a specific example, that&#39;s only vaguely helpful.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208751706","msgId":31937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1aDRvcSs4c2JnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZWRzMyt1YjdtQGVHcm91cHMuY29tPg=="},"prevInTopic":31936,"nextInTopic":31941,"prevInTime":31936,"nextInTime":31938,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... will ... like ... more ... I think this is a serious problem that stems from the early intervention stuff from schools. The government provides funds to ","messageBody":"<div id=\"ygrps-yiv-142486929\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  And if a parent is looking for &quot;delays&quot; at the baby stage, how <br/>\n </span></blockquote>will<br/>\n<blockquote><span title=\"ireply\"> &gt; trust unfold when that child is maybe struggling with something <br/>\n </span></blockquote>like<br/>\n<blockquote><span title=\"ireply\"> &gt; reading at 12 years old? Where will the trust be? Will there be <br/>\n </span></blockquote>more<br/>\n<blockquote><span title=\"ireply\"> &gt; therapy?<br/>\n<br/>\n </span></blockquote>I think this is a serious problem that stems from the early <br/>\nintervention stuff from schools. The government provides funds to <br/>\nstates, counties, cities, schools based on the number of children <br/>\nthey have in their districts who need early intervention. Therefore, <br/>\nit&#39;s beneficial to the district...to find as many children as <br/>\npossible who need early intervention. It&#39;s difficult for new parents <br/>\nto trust themselves and trust their children when they see, hear and <br/>\nread all about all of this stuff everywhere.<br/>\n<br/>\nPeople are born to development normally, to survive, to thrive. We <br/>\ndon&#39;t need all this intervention and special treatment. If we did, <br/>\nhumans would not populate the planet.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208751431","msgId":31936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1aDRnNytkNWJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZTg2citqamNuQGVHcm91cHMuY29tPg=="},"prevInTopic":31931,"nextInTopic":31937,"prevInTime":31935,"nextInTime":31937,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... Except that it sends a message to the child that they are somehow defective. ... I don t see how this matters. Norms and averages don t really mean much in","messageBody":"<div id=\"ygrps-yiv-1595030823\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rabbits3arewe&quot; <br/>\n&lt;rabbits3arewe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There is<br/>\n&gt; no reason NOT to intervene.<br/>\n<br/>\n </span></blockquote>Except that it sends a message to the child that they are somehow <br/>\ndefective.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, when a child is considered delayed, what they are doing is<br/>\n&gt; significantly behind the majority of children. <br/>\n<br/>\n </span></blockquote>I don&#39;t see how this matters. Norms and averages don&#39;t really mean <br/>\nmuch in the unschooling world.<br/>\n<br/>\nNot only was he not<br/>\n<blockquote><span title=\"ireply\"> &gt; making the sounds he should have been, he&#39;d also stopped making<br/>\n&gt; sounds, like &quot;o&quot; that he&#39;d been making before. Regression is a <br/>\n </span></blockquote>scary<br/>\n<blockquote><span title=\"ireply\"> &gt; thing.<br/>\n<br/>\n </span></blockquote>Regression can be a scary thing if you let it. My 4yo decided he <br/>\nwanted to wear diapers again. My husband started to get freaked <br/>\nabout it. Why would a 4yo who&#39;s been using the toilet for about 8 <br/>\nmonths all of a sudden want to wear a diaper again? I asked him if <br/>\nhe&#39;d ever heard of regression. It&#39;s quite normal for short periods <br/>\nof time at any age and nothing to be concerned about. My ds wore a <br/>\ndiaper for a couple of hours one day. <br/>\n<br/>\nAn 8 month old is barely verbalizing. I can&#39;t imagine how a speech <br/>\ndelay could be noticed at that time. My 10 month old makes various <br/>\nnoises and then stops for periods of time. Then he will start up <br/>\nagain and maybe make new noises. It&#39;s all normal.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":192176730,"authorName":"Barbara Perez","from":"&quot;Barbara Perez&quot; &lt;barbara.perez@...&gt;","profile":"barbaraperez228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208739652","msgId":31931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwZjQ4NzU2MDgwNDIwMTgwMGc2NzY2ZDYwOW0zMzIxMGJhZTc5NjM2MDBkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZ1Z21uNStvNmM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGZ1Z20yMys0bGExQGVHcm91cHMuY29tPiA8ZnVnbW41K282YzVAZUdyb3Vwcy5jb20+"},"prevInTopic":31930,"nextInTopic":31936,"prevInTime":31930,"nextInTime":31932,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"So let s continue the discussion then. ... something.","messageBody":"<div id=\"ygrps-yiv-1572189959\">So let&#39;s continue the discussion then.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Help doesn&#39;t involve deciding what and when other people need to learn<br/>\n </span></blockquote>something.&lt;<br/>\n<br/>\nI disagree. As a parent, when a child that doesn&#39;t know better wants<br/>\nsomething that I know will be harmful to them, I think that is a terrific<br/>\ntime for them to learn about moderation, and discernment, and that not all<br/>\nfoods/activities/etc in our big happy world are created equal.<br/>\n<br/>\nI believe that&#39;s the point the original poster was trying to make. Yes it&#39;s<br/>\ngreat to be positive and enthusiastic about the produce and the cheese and<br/>\nthe different kinds of bread. And no, I don&#39;t believe it&#39;s necessary for a<br/>\ngood unschooler to say &quot;yes&quot; unquestioningly to EVERYTHING the child<br/>\nsuddenly wants. You can be an unschooler that presents the aspects of those<br/>\nchoices that the child may not have thought about, deciding for them not<br/>\nwhen they&#39;ll learn it, but when they&#39;ll be exposed to a valuable fact or<br/>\nopinion that they might not have otherwise been exposed to. Something as<br/>\nsimple as a true story: &quot;I once ate X Twinkies and then threw up, didn&#39;t<br/>\nwant to see one or smell one for months!&quot; That&#39;s something a child will<br/>\ndecide what to do with in their mind. Whether they&#39;ll still want to try it,<br/>\nor whether to learn vicariously from someone else&#39;s experience. That is<br/>\ntheir choice. The choice to expose the kid to that idea, and when, is the<br/>\nparent&#39;s.<br/>\n<br/>\nSo back to the 8 month old. If the parent decided that the play therapy was<br/>\na positive thing for the reasons she explained, I don&#39;t see how it&#39;s<br/>\n&quot;against unschooling&quot; for her to have done so.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Apr 20, 2008 at 5:21 PM, Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   ~~I gave her a suggestion based on what we did that was<br/>\n&gt; successful. Suddenly things are snowballing.~~<br/>\n&gt;<br/>\n&gt; Nothing is snowballing. Truly.<br/>\n&gt; It&#39;s a discussion list. If you post things that aren&#39;t helpful to<br/>\n&gt; unschooling then it will get a lot of attention and discussion, that&#39;s<br/>\n&gt; all.<br/>\n&gt;<br/>\n&gt; There are going to be certain topics that will garner more interest<br/>\n&gt; and more posts. It&#39;s not about the person posting them, it&#39;s about the<br/>\n&gt; ideas presented. We tend to discuss some things in depth and question<br/>\n&gt; certain ideas pretty intensely.<br/>\n&gt;<br/>\n&gt; If you&#39;re comfortable with that kind of discussion you&#39;ll be fine. If<br/>\n&gt; not, I suggest reading for a while to get a &quot;feel&quot; for the list and<br/>\n&gt; the tone in order to decide if it will be a useful resource.<br/>\n&gt;<br/>\n&gt; Topics that tend to get discussed heavily are food restrictions on<br/>\n&gt; kids, chores, the idea of &quot;experts&quot;/therapy and punishments/rewards.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208737317","msgId":31930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1Z21uNStvNmM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1Z20yMys0bGExQGVHcm91cHMuY29tPg=="},"prevInTopic":31929,"nextInTopic":31931,"prevInTime":31929,"nextInTime":31931,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"~~I gave her a suggestion based on what we did that was successful. Suddenly things are snowballing.~~ Nothing is snowballing. Truly. It s a discussion list.","messageBody":"<div id=\"ygrps-yiv-1071930786\">~~I gave her a suggestion based on what we did that was<br/>\nsuccessful. Suddenly things are snowballing.~~<br/>\n<br/>\nNothing is snowballing. Truly.<br/>\nIt&#39;s a discussion list. If you post things that aren&#39;t helpful to<br/>\nunschooling then it will get a lot of attention and discussion, that&#39;s<br/>\nall.<br/>\n<br/>\nThere are going to be certain topics that will garner more interest<br/>\nand more posts. It&#39;s not about the person posting them, it&#39;s about the<br/>\nideas presented. We tend to discuss some things in depth and question<br/>\ncertain ideas pretty intensely.<br/>\n<br/>\nIf you&#39;re comfortable with that kind of discussion you&#39;ll be fine. If<br/>\nnot, I suggest reading for a while to get a &quot;feel&quot; for the list and<br/>\nthe tone in order to decide if it will be a useful resource.<br/>\n<br/>\nTopics that tend to get discussed heavily are food restrictions on<br/>\nkids, chores, the idea of &quot;experts&quot;/therapy and punishments/rewards.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":156716553,"authorName":"rabbits3arewe","from":"&quot;rabbits3arewe&quot; &lt;rabbits3arewe@...&gt;","profile":"rabbits3arewe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208736643","msgId":31929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1Z20yMys0bGExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZzZtZitpZ3BoQGVHcm91cHMuY29tPg=="},"prevInTopic":31927,"nextInTopic":31930,"prevInTime":31928,"nextInTime":31930,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"I am new to this list. I posted with a book recommendation that I think is very supportive of unschooling philosophies and asked for other books to read. A mom","messageBody":"<div id=\"ygrps-yiv-2004408708\">I am new to this list. I posted with a book recommendation that I<br/>\nthink is very supportive of unschooling philosophies and asked for<br/>\nother books to read. A mom responded and expressed concerns for her<br/>\nchild. I gave her a suggestion based on what we did that was<br/>\nsuccessful. Suddenly things are snowballing.<br/>\n<br/>\nI have been told that what I did for my child was dangerous and that<br/>\nmy kids won&#39;t trust me because I&#39;m not going to let them binge on <br/>\nTwinkies. Is this how people on this list normally treat each other?<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;wisdomalways5&quot;<br/>\n&lt;wisdom1133@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rabbits3arewe&quot; <br/>\n&gt; &lt;rabbits3arewe@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; There are many developmental delays that can become more and more<br/>\n&gt; &gt; serious as children get older. Every child has a different <br/>\n&gt; schedule,<br/>\n&gt; &gt; but some schedules are problematic.<br/>\n&gt; <br/>\n&gt; how do you KNOW they are problematic- if you did not decide it was <br/>\n&gt; a &quot;delay&quot; and let it happen in their own time how much at trusting <br/>\n&gt; would that be<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  Some schedules indicate serious<br/>\n&gt; &gt; problems. <br/>\n&gt; <br/>\n&gt; this is probably true in scholed children but not so much in free <br/>\n&gt; kids who can develop at their own pace- <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I am a proactive parent and I educate myself on the<br/>\n&gt; &gt; difference. I have worked with developmentally delayed children <br/>\n&gt; and I<br/>\n&gt; &gt; have seen the full spectrum of parental involvement. I have seen<br/>\n&gt; &gt; parents whose lack of involvement meant the child would not get the<br/>\n&gt; &gt; help they need and they would have lifelong problems.<br/>\n&gt; <br/>\n&gt; again probably only a problem in schooled kids<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; I see unschooling like a grocery store. Some parents would <br/>\n&gt; say, &quot;Eat<br/>\n&gt; &gt; what you want.&quot; That is their style. I do not want my child to eat<br/>\n&gt; &gt; Twinkies, so I say, &quot;You can eat anything in the produce <br/>\n&gt; department.&quot;<br/>\n&gt; <br/>\n&gt; what if they WANT twinkies- are you going to hide the fact htat <br/>\n&gt; twinkies exist and then what happens when they find out twinkies do <br/>\n&gt; exist and that you hide them and lie about them- how will they trust <br/>\n&gt; anything you have to say<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  The needs of the child and my knowledge will help me choose<br/>\n&gt; &gt; where on the spectrum I need to be at any given time.<br/>\n&gt; <br/>\n&gt; Their needs or the needs you think they should have- how would you <br/>\n&gt; know what their needs are if you are basing them off of the mythical <br/>\n&gt; agverage child<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; If my children were 12 years old and having difficulty reading, <br/>\n&gt; they<br/>\n&gt; &gt; would know that I would be doing as much as possible to help them<br/>\n&gt; &gt; overcome their difficulties.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I would love to have a discussion about this that is not <br/>\n&gt; judgmental or<br/>\n&gt; &gt; close-minded.<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old?","postDate":"1208734388","msgId":31927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1Z2pyayt1MmJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZzU3Yytsb2lwQGVHcm91cHMuY29tPg=="},"prevInTopic":31926,"nextInTopic":31929,"prevInTime":31926,"nextInTime":31928,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... proactive ... figure ... choose ... I don t think anyone s saying its never appropriate to be proactive! The question is more in terms of *how*. From an","messageBody":"<div id=\"ygrps-yiv-676111846\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rabbits3arewe&quot; <br/>\n&lt;rabbits3arewe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I want my children to trust in me. I want them to know I am <br/>\n </span></blockquote>proactive<br/>\n<blockquote><span title=\"ireply\"> &gt; in helping them. Sometimes that means I sit back and let them <br/>\n </span></blockquote>figure<br/>\n<blockquote><span title=\"ireply\"> &gt; it out on their own. Sometimes that means I take a more proactive<br/>\n&gt; approach. The needs of the child and my knowledge will help me <br/>\n </span></blockquote>choose<br/>\n<blockquote><span title=\"ireply\"> &gt; where on the spectrum I need to be at any given time.<br/>\n<br/>\n </span></blockquote>I don&#39;t think anyone&#39;s saying its never appropriate to be proactive! <br/>\nThe question is more in terms of *how*. From an unschooling <br/>\nstandpoint, being proactive in ways that build trust and foster <br/>\nconnections is really important. Calling on an &quot;expert&quot; early on <br/>\ndoesn&#39;t build trust or foster connections between a parent and <br/>\nchild. It doesn&#39;t lead a parent to trust her own judgement more or <br/>\nwork on connecting with her child more. At best, it builds trust in <br/>\nand fosters connections with a stranger. <br/>\n<br/>\nThat&#39;s not to say that calling on trained professionals is never an <br/>\noption for unschoolers! Its not a great place to start, though.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have worked with developmentally delayed children and I<br/>\n&gt; have seen the full spectrum of parental involvement. I have seen<br/>\n&gt; parents whose lack of involvement meant the child would not get the<br/>\n&gt; help they need and they would have lifelong problems.<br/>\n<br/>\n </span></blockquote>Its reasonable to assume that radical unschoolers will be more on <br/>\nthe &quot;involved&quot; end of the spectrum, sort of by definition ;) Perhaps <br/>\nyou could offer some links to online resources for any parents who <br/>\nare concerned about this issue so that they can do some more <br/>\nresearch for themselves? <br/>\n<br/>\n---Meredith (Mo 6, Ray 14)</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208734380","msgId":31926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwNDIwMTYzM2w1MDhlM2ZkOGliMjc2YmRjZjI4NmNhZWNkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZ1ZzZtZitpZ3BoQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ1ZzU3Yytsb2lwQGVHcm91cHMuY29tPiA8ZnVnNm1mK2lncGhAZUdyb3Vwcy5jb20+"},"prevInTopic":31925,"nextInTopic":31927,"prevInTime":31925,"nextInTime":31927,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"I have been unwell of late and haven t followed this thread from the beginning, but I ve read enough to want to post this. My daughter Morgan is almost 4 yrs","messageBody":"<div id=\"ygrps-yiv-1701787240\">I have been unwell of late and haven&#39;t followed this thread from the<br/>\nbeginning, but I&#39;ve read enough to want to post this.<br/>\n<br/>\nMy daughter Morgan is almost 4 yrs old.  She was adopted from China<br/>\nand we brought her home in January.  She had neither English nor<br/>\nChinese language.  The SWI called her &quot;sweet and quiet but very<br/>\ndisobedient&quot;  They told us when they brought her to us that she could<br/>\nnot feed herself nor was she potty trained.  They did not admit she<br/>\nhad no language...they told us she &quot;would refuse to listen&quot;.  (Now<br/>\nkeep in mind this is translated so it sounds harsh but much could have<br/>\nbeen lost in the translation.)<br/>\n<br/>\nBut here&#39;s the deal...Morgan has some 2 dozen words now but<br/>\nunderstands much more.  I can say &quot;Go put this in the trash&quot; and she<br/>\ncan do that but she can&#39;t/won&#39;t say &quot;trash&quot; nor will she point to the<br/>\ntrash can if I ask her where it is.  (Which I have done only to gauge<br/>\nthe depth of her understanding.)  Anyway, everyone that knows us,<br/>\nknows that Morgan was labelled as having autism and everyone is<br/>\npushing us to get her evaluated *RIGHT NOW* before....(insert here a<br/>\nlist of tragedies if it&#39;s not done now)...we have chosen to do<br/>\nnothing.  The five of us do just fine.  Morgan gets fed, makes her<br/>\nwants and needs understood and gets them met.  She uses the words she<br/>\nthinks are most important like &quot;more&quot;...she saw the need to use a word<br/>\nto get what she wanted and she uses it.  If she can say &quot;more&quot; she<br/>\nCOULD say other things.  Is she refusing?  Don&#39;t know...but I don&#39;t<br/>\ncare, I shamelessly steal the words of Mrs Turtle on the cartoon<br/>\nFranklin and use them for myself when I say &quot;Morgan will talk when<br/>\nshe&#39;s ready and not before.&quot;<br/>\n<br/>\nDoes this mean she will be 17 and still not speaking?  I suppose so,<br/>\nbut if that&#39;s the case, we&#39;ll figure it out.  People have advised<br/>\nteaching her signing, and the use of graphic pictures etc so she can<br/>\nmake her needs known but she refuses/can&#39;t/declines to use them.<br/>\nShe&#39;d rather we do what we do now.  It&#39;s comfortable for her.  I could<br/>\n*make* her I guess, by putting her on the NFF (Nothing is For Free)<br/>\nprogram, which I&#39;ve been prompted to do by several &quot;specialists&quot;<br/>\ngiving me unsolicited advice.  That would be say dangling her sippee<br/>\nover her head and not giving it to her until she makes the attempt at<br/>\nspeaking.  I choose not to do that.<br/>\n<br/>\nTo the OP, your 8 month old child might have issues, I didn&#39;t see the<br/>\noriginal post.  But if your child can suck, swallow, stick her/his<br/>\ntongue out etc...then you know all the muscles work.  If your baby can<br/>\ncry you know the voice box works.  If your baby turns toward you or<br/>\nnoises then you know the ears work.  I gently suggest that you rejoice<br/>\nin these things and not worry so much about not having language.  Your<br/>\nbaby will talk when she&#39;s ready and not before.  Personally I would<br/>\nseek help if the child can&#39;t swallow or other such physical issues.<br/>\nBut if the body works, then give the baby room to be her.  She might<br/>\nbe an active listener with nothing much to say.<br/>\n<br/>\nI guess I see it as less an issue of trust as has been suggested by<br/>\nothers and more of an issue of acceptance of your child as she was<br/>\nmade and chooses to be.  I know it&#39;s scary.  I sometimes look at<br/>\nMorgan and wonder if by not getting her seen and forcing all kinds of<br/>\nreparitive therapies on her if I&#39;m dooming her to a life of &quot;less<br/>\nthan&quot; but then I take a deep breath and remind myself that Morgan IS.<br/>\nShe is potential but it&#39;s her potential...not mine.  And she&#39;s a happy<br/>\nkid.  If your baby seems pretty happy I&#39;d let it go.  I had a<br/>\nprecocious talker who was using full sentences by age 12 months.  My<br/>\nsecond child was much less chatty.  And now my third talks when she<br/>\nwants and says what she needs to say.  (Don&#39;t DO DAT!!)  I don&#39;t need<br/>\nher to be able to tell me stories to think she&#39;s OK.  She&#39;s pretty<br/>\ndarn terrific just as she is.<br/>\n<br/>\nhth<br/>\nKaren</div>","specialLinks":[]},{"userId":295439124,"authorName":"wisdomalways5","from":"&quot;wisdomalways5&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208720911","msgId":31925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZzZtZitpZ3BoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZzU3Yytsb2lwQGVHcm91cHMuY29tPg=="},"prevInTopic":31923,"nextInTopic":31926,"prevInTime":31924,"nextInTime":31926,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... schedule, ... how do you KNOW they are problematic- if you did not decide it was a delay and let it happen in their own time how much at trusting would","messageBody":"<div id=\"ygrps-yiv-146485901\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rabbits3arewe&quot; <br/>\n&lt;rabbits3arewe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There are many developmental delays that can become more and more<br/>\n&gt; serious as children get older. Every child has a different <br/>\n </span></blockquote>schedule,<br/>\n<blockquote><span title=\"ireply\"> &gt; but some schedules are problematic.<br/>\n<br/>\n </span></blockquote>how do you KNOW they are problematic- if you did not decide it was <br/>\na &quot;delay&quot; and let it happen in their own time how much at trusting <br/>\nwould that be<br/>\n<br/>\n<br/>\n<br/>\n Some schedules indicate serious<br/>\n<blockquote><span title=\"ireply\"> &gt; problems. <br/>\n<br/>\n </span></blockquote>this is probably true in scholed children but not so much in free <br/>\nkids who can develop at their own pace- <br/>\n<br/>\n<br/>\nI am a proactive parent and I educate myself on the<br/>\n<blockquote><span title=\"ireply\"> &gt; difference. I have worked with developmentally delayed children <br/>\n </span></blockquote>and I<br/>\n<blockquote><span title=\"ireply\"> &gt; have seen the full spectrum of parental involvement. I have seen<br/>\n&gt; parents whose lack of involvement meant the child would not get the<br/>\n&gt; help they need and they would have lifelong problems.<br/>\n<br/>\n </span></blockquote>again probably only a problem in schooled kids<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I see unschooling like a grocery store. Some parents would <br/>\n </span></blockquote>say, &quot;Eat<br/>\n<blockquote><span title=\"ireply\"> &gt; what you want.&quot; That is their style. I do not want my child to eat<br/>\n&gt; Twinkies, so I say, &quot;You can eat anything in the produce <br/>\n </span></blockquote>department.&quot;<br/>\n<br/>\nwhat if they WANT twinkies- are you going to hide the fact htat <br/>\ntwinkies exist and then what happens when they find out twinkies do <br/>\nexist and that you hide them and lie about them- how will they trust <br/>\nanything you have to say<br/>\n<br/>\n<br/>\n The needs of the child and my knowledge will help me choose<br/>\n<blockquote><span title=\"ireply\"> &gt; where on the spectrum I need to be at any given time.<br/>\n<br/>\n </span></blockquote>Their needs or the needs you think they should have- how would you <br/>\nknow what their needs are if you are basing them off of the mythical <br/>\nagverage child<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If my children were 12 years old and having difficulty reading, <br/>\n </span></blockquote>they<br/>\n<blockquote><span title=\"ireply\"> &gt; would know that I would be doing as much as possible to help them<br/>\n&gt; overcome their difficulties.<br/>\n&gt; <br/>\n&gt; I would love to have a discussion about this that is not <br/>\n </span></blockquote>judgmental or<br/>\n<blockquote><span title=\"qreply\"> &gt; close-minded.<br/>\n<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208720341","msgId":31923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZzY0bCt0a2J0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZzU3Yytsb2lwQGVHcm91cHMuY29tPg=="},"prevInTopic":31922,"nextInTopic":31925,"prevInTime":31922,"nextInTime":31924,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"~~ Every child has a different schedule, ... How are different schedules problematic in an unschooling family? Why would it matter if a child spoke early","messageBody":"<div id=\"ygrps-yiv-699147578\">~~ Every child has a different schedule,<br/>\n<blockquote><span title=\"ireply\"> &gt; but some schedules are problematic. Some schedules indicate serious<br/>\n&gt; problems.~~<br/>\n<br/>\n </span></blockquote>How are different &quot;schedules&quot; problematic in an unschooling family?<br/>\nWhy would it matter if a child spoke &quot;early&quot; or &quot;later&quot;...same with<br/>\nreading, same with everything.<br/>\n<br/>\n~~ I have seen<br/>\n<blockquote><span title=\"ireply\"> &gt; parents whose lack of involvement meant the child would not get the<br/>\n&gt; help they need and they would have lifelong problems.~~<br/>\n<br/>\n </span></blockquote>I&#39;m not advocating a lack of involvement, I&#39;m advocating a lack of<br/>\nlabeling developmental differences and bringing in &quot;experts&quot; at the<br/>\ndrop of a hat.<br/>\n<br/>\n<br/>\n~~I see unschooling like a grocery store. Some parents would say, &quot;Eat<br/>\n<blockquote><span title=\"ireply\"> &gt; what you want.&quot; That is their style. I do not want my child to eat<br/>\n&gt; Twinkies, so I say, &quot;You can eat anything in the produce department.&quot;~~<br/>\n<br/>\n </span></blockquote>So what happens when they are beyond your control (and believe me it<br/>\nhappens faster than you would believe)and they want a twinkie?<br/>\n<br/>\n<br/>\n~~I want them to know I am proactive<br/>\n<blockquote><span title=\"ireply\"> &gt; in helping them.~~<br/>\n<br/>\n </span></blockquote>Help doesn&#39;t involve deciding what and when other people need to learn<br/>\nsomething. <br/>\n<br/>\n~~Sometimes that means I sit back and let them figure<br/>\n<blockquote><span title=\"ireply\"> &gt; it out on their own. Sometimes that means I take a more proactive<br/>\n&gt; approach. The needs of the child and my knowledge will help me<br/>\n </span></blockquote>choose where on the spectrum I need to be at any given time.~~<br/>\n<br/>\nI would venture to guess that every parent here feels the same way.<br/>\n<br/>\n<br/>\n~~If my children were 12 years old and having difficulty reading, they<br/>\n<blockquote><span title=\"ireply\"> &gt; would know that I would be doing as much as possible to help them<br/>\n&gt; overcome their difficulties.~~<br/>\n<br/>\n </span></blockquote>But you&#39;re still seeing it as a &quot;difficulty&quot;. My child learned to read<br/>\nat the age of 12 with zero difficulties because we never labeled him<br/>\nas &quot;delayed&quot; nor did we push him to learn anything before he needed it<br/>\nand was developmentally ready. People will learn without being taught.<br/>\nSeeing a child that is learning certain skills later than some of<br/>\ntheir peers and viewing it as a &quot;difficulty&quot; will hinder unschooling<br/>\ntrust.<br/>\n<br/>\n~~I would love to have a discussion about this that is not judgmental<br/>\nor close-minded.~~<br/>\n<br/>\nWe&#39;re pretty open minded here. Problem is, most of us have full<br/>\nawareness of mainstream views. Several here have teaching backgrounds<br/>\nand know all about child development. I&#39;m pretty aware of Piaget and<br/>\nother information out there as my Mum was a teacher herself.  So there<br/>\nisn&#39;t much about developmental &quot;delays&quot; I&#39;m not already aware<br/>\nof....very few people out there will discuss avoiding these labels and<br/>\nfinding a totally different lifestyle where children are trusted.<br/>\n<br/>\nThis list is that place.<br/>\n<br/>\nI hope that my judgment of your choice can be seen as just that.If I<br/>\nwere to place judgement on you as a human being I know very little<br/>\nabout, it would be that you are a very involved, caring and loving parent.<br/>\n<br/>\nThat doesn&#39;t mean I will agree that therapy for an eight month old is<br/>\nnecessary or money well-spent.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Jolene&quot; &lt;joyauxjo@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; So, I can see the point of not labeling a child, especially if it is <br/>\n&gt; &gt; a label with such negative connotations like &quot;delayed.&quot; <br/>\n&gt; &gt; <br/>\n&gt; &gt; However, I also see no problem with the parent using the resource to <br/>\n&gt; &gt; learn more ways to play with her child. Not all aspects of parenting <br/>\n&gt; &gt; come naturally to everyone, and I think that a lot of people who make <br/>\n&gt; &gt; a career out of child development have some cool, fun ideas about <br/>\n&gt; &gt; playing. As long as the parent takes what seems to be good for her <br/>\n&gt; &gt; and her child and leaves the rest (the label &quot;delay&quot;), I think <br/>\n&gt; &gt; there&#39;s nothing wrong with the &quot;therapy.&quot; <br/>\n&gt; &gt; <br/>\n&gt; &gt; I think that the unschooling groups and parents I&#39;ve spoken to have <br/>\n&gt; &gt; had some cool ideas about how I can better interact with my son and <br/>\n&gt; &gt; I&#39;m SOOOO glad I haven&#39;t stayed away from this &quot;therapy.&quot;<br/>\n&gt; &gt; <br/>\n&gt; &gt; Warmly,<br/>\n&gt; &gt; Jolene  =)<br/>\n&gt; &gt; <br/>\n&gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&gt; &gt; &lt;starsuncloud@&gt; wrote:<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; ~~<br/>\n&gt; &gt; &gt; So to me this is really dangerous thinking for our kids! Delayed<br/>\n&gt; &gt; &gt; according to<br/>\n&gt; &gt; &gt; what, according to whom?? How on earth can an average eight month <br/>\n&gt; &gt; old<br/>\n&gt; &gt; &gt; baby be<br/>\n&gt; &gt; &gt; behind???~~<br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; Exactly.<br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; And if a parent is looking for &quot;delays&quot; at the baby stage, how will<br/>\n&gt; &gt; &gt; trust unfold when that child is maybe struggling with something like<br/>\n&gt; &gt; &gt; reading at 12 years old? Where will the trust be? Will there be more<br/>\n&gt; &gt; &gt; therapy?<br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; Ren<br/>\n&gt; &gt; &gt; learninginfreedom.com<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":156716553,"authorName":"rabbits3arewe","from":"&quot;rabbits3arewe&quot; &lt;rabbits3arewe@...&gt;","profile":"rabbits3arewe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208719404","msgId":31922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZzU3Yytsb2lwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZzFycStkODd2QGVHcm91cHMuY29tPg=="},"prevInTopic":31921,"nextInTopic":31923,"prevInTime":31921,"nextInTime":31923,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"I had replied to the prior poster, but the reply never came through. There are many developmental delays that can become more and more serious as children get","messageBody":"<div id=\"ygrps-yiv-446978512\">I had replied to the prior poster, but the reply never came through. <br/>\n<br/>\nThere are many developmental delays that can become more and more<br/>\nserious as children get older. Every child has a different schedule,<br/>\nbut some schedules are problematic. Some schedules indicate serious<br/>\nproblems. I am a proactive parent and I educate myself on the<br/>\ndifference. I have worked with developmentally delayed children and I<br/>\nhave seen the full spectrum of parental involvement. I have seen<br/>\nparents whose lack of involvement meant the child would not get the<br/>\nhelp they need and they would have lifelong problems.<br/>\n<br/>\nI see unschooling like a grocery store. Some parents would say, &quot;Eat<br/>\nwhat you want.&quot; That is their style. I do not want my child to eat<br/>\nTwinkies, so I say, &quot;You can eat anything in the produce department.&quot;<br/>\n<br/>\nI want my children to trust in me. I want them to know I am proactive<br/>\nin helping them. Sometimes that means I sit back and let them figure<br/>\nit out on their own. Sometimes that means I take a more proactive<br/>\napproach. The needs of the child and my knowledge will help me choose<br/>\nwhere on the spectrum I need to be at any given time.<br/>\n<br/>\nIf my children were 12 years old and having difficulty reading, they<br/>\nwould know that I would be doing as much as possible to help them<br/>\novercome their difficulties.<br/>\n<br/>\nI would love to have a discussion about this that is not judgmental or<br/>\nclose-minded.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Jolene&quot; &lt;joyauxjo@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; So, I can see the point of not labeling a child, especially if it is <br/>\n&gt; a label with such negative connotations like &quot;delayed.&quot; <br/>\n&gt; <br/>\n&gt; However, I also see no problem with the parent using the resource to <br/>\n&gt; learn more ways to play with her child. Not all aspects of parenting <br/>\n&gt; come naturally to everyone, and I think that a lot of people who make <br/>\n&gt; a career out of child development have some cool, fun ideas about <br/>\n&gt; playing. As long as the parent takes what seems to be good for her <br/>\n&gt; and her child and leaves the rest (the label &quot;delay&quot;), I think <br/>\n&gt; there&#39;s nothing wrong with the &quot;therapy.&quot; <br/>\n&gt; <br/>\n&gt; I think that the unschooling groups and parents I&#39;ve spoken to have <br/>\n&gt; had some cool ideas about how I can better interact with my son and <br/>\n&gt; I&#39;m SOOOO glad I haven&#39;t stayed away from this &quot;therapy.&quot;<br/>\n&gt; <br/>\n&gt; Warmly,<br/>\n&gt; Jolene  =)<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&gt; &lt;starsuncloud@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; ~~<br/>\n&gt; &gt; So to me this is really dangerous thinking for our kids! Delayed<br/>\n&gt; &gt; according to<br/>\n&gt; &gt; what, according to whom?? How on earth can an average eight month <br/>\n&gt; old<br/>\n&gt; &gt; baby be<br/>\n&gt; &gt; behind???~~<br/>\n&gt; &gt; <br/>\n&gt; &gt; Exactly.<br/>\n&gt; &gt; <br/>\n&gt; &gt; And if a parent is looking for &quot;delays&quot; at the baby stage, how will<br/>\n&gt; &gt; trust unfold when that child is maybe struggling with something like<br/>\n&gt; &gt; reading at 12 years old? Where will the trust be? Will there be more<br/>\n&gt; &gt; therapy?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Ren<br/>\n&gt; &gt; learninginfreedom.com<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208719336","msgId":31921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZzU1OCs5OGxyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZzFycStkODd2QGVHcm91cHMuY29tPg=="},"prevInTopic":31920,"nextInTopic":31922,"prevInTime":31920,"nextInTime":31922,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"~~ However, I also see no problem with the parent using the resource to learn more ways to play with her child. Not all aspects of parenting come naturally to","messageBody":"<div id=\"ygrps-yiv-1929572254\">~~ However, I also see no problem with the parent using the resource<br/>\nto learn more ways to play with her child. Not all aspects of<br/>\nparenting come naturally to everyone~~<br/>\n<br/>\nAbsolutely.<br/>\nA lot of us have learned many new ways of interacting with our<br/>\nchildren and better supporting their needs. That has nothing to do<br/>\nwith comparing a child&#39;s ability to other children. There are reasons<br/>\nto be concerned but a non-talking 8 month old is not one of them in my<br/>\nbook.<br/>\n<br/>\n<br/>\n~~I think that the unschooling groups and parents I&#39;ve spoken to have <br/>\n<blockquote><span title=\"ireply\"> &gt; had some cool ideas about how I can better interact with my son and <br/>\n&gt; I&#39;m SOOOO glad I haven&#39;t stayed away from this &quot;therapy.&quot;~~<br/>\n<br/>\n </span></blockquote>Learning from each other, utilizing resources to better support our<br/>\nfamilies and understand each other are great things to do! I have no<br/>\nissue with people figuring out how to nourish their child whether that<br/>\nchild seems &quot;delayed&quot; or not.<br/>\n<br/>\nI researched the heck out of sensory integration disorder and many<br/>\nother traits in order to understand what might help or hinder Jalen. I<br/>\nchose to never see and of it as a &quot;disorder&quot; (ick) or &quot;delay&quot; because<br/>\nthat is saying the person is somehow &quot;less than&quot; rather than<br/>\nTHEMSELVES. There are times we need a diagnoses. I have met Melissa&#39;s<br/>\nchildren and there is no way I would say she should avoid a diagnoses<br/>\nwhen severe autism is present!<br/>\n<br/>\nSometimes a thing is beyond our scope of capability. Nothing wrong<br/>\nwith gaining some help or understanding.<br/>\n<br/>\nI still don&#39;t see how a non-speaking (or even regressing) BABY needs<br/>\nany kind of &quot;therapy&quot; or diagnoses for language. Again, if unschooling<br/>\nis to work long-term for a family, I think there needs to be a HUGE<br/>\namount of trust in each individual&#39;s time table. There also needs to<br/>\nbe a HUGE amount of trust that a loving, nurturing and aware family<br/>\ncan provide what the child needs, even if utilizing outside resources.<br/>\n<br/>\nIf the first course of action for a non-speaking 8 month old is<br/>\ndiagnoses, &quot;delayed&quot; labels and therapy, what is that family going to<br/>\ndo when faced with other comparisons at a much older age?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Warmly,<br/>\n&gt; Jolene  =)<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&gt; &lt;starsuncloud@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; ~~<br/>\n&gt; &gt; So to me this is really dangerous thinking for our kids! Delayed<br/>\n&gt; &gt; according to<br/>\n&gt; &gt; what, according to whom?? How on earth can an average eight month <br/>\n&gt; old<br/>\n&gt; &gt; baby be<br/>\n&gt; &gt; behind???~~<br/>\n&gt; &gt; <br/>\n&gt; &gt; Exactly.<br/>\n&gt; &gt; <br/>\n&gt; &gt; And if a parent is looking for &quot;delays&quot; at the baby stage, how will<br/>\n&gt; &gt; trust unfold when that child is maybe struggling with something like<br/>\n&gt; &gt; reading at 12 years old? Where will the trust be? Will there be more<br/>\n&gt; &gt; therapy?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Ren<br/>\n&gt; &gt; learninginfreedom.com<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":330670108,"authorName":"Jolene","from":"&quot;Jolene&quot; &lt;joyauxjo@...&gt;","profile":"nuttyaspecanpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;delayed&quot; 8-month-old was: Book Recommendations","postDate":"1208715962","msgId":31920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZzFycStkODd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZWRzMyt1YjdtQGVHcm91cHMuY29tPg=="},"prevInTopic":31916,"nextInTopic":31921,"prevInTime":31919,"nextInTime":31921,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"So, I can see the point of not labeling a child, especially if it is a label with such negative connotations like delayed. However, I also see no problem","messageBody":"<div id=\"ygrps-yiv-1646432841\">So, I can see the point of not labeling a child, especially if it is <br/>\na label with such negative connotations like &quot;delayed.&quot; <br/>\n<br/>\nHowever, I also see no problem with the parent using the resource to <br/>\nlearn more ways to play with her child. Not all aspects of parenting <br/>\ncome naturally to everyone, and I think that a lot of people who make <br/>\na career out of child development have some cool, fun ideas about <br/>\nplaying. As long as the parent takes what seems to be good for her <br/>\nand her child and leaves the rest (the label &quot;delay&quot;), I think <br/>\nthere&#39;s nothing wrong with the &quot;therapy.&quot; <br/>\n<br/>\nI think that the unschooling groups and parents I&#39;ve spoken to have <br/>\nhad some cool ideas about how I can better interact with my son and <br/>\nI&#39;m SOOOO glad I haven&#39;t stayed away from this &quot;therapy.&quot;<br/>\n<br/>\nWarmly,<br/>\nJolene  =)<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ~~<br/>\n&gt; So to me this is really dangerous thinking for our kids! Delayed<br/>\n&gt; according to<br/>\n&gt; what, according to whom?? How on earth can an average eight month <br/>\n </span></blockquote>old<br/>\n<blockquote><span title=\"qreply\"> &gt; baby be<br/>\n&gt; behind???~~<br/>\n&gt; <br/>\n&gt; Exactly.<br/>\n&gt; <br/>\n&gt; And if a parent is looking for &quot;delays&quot; at the baby stage, how will<br/>\n&gt; trust unfold when that child is maybe struggling with something like<br/>\n&gt; reading at 12 years old? Where will the trust be? Will there be more<br/>\n&gt; therapy?<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208662723","msgId":31916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZWRzMyt1YjdtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUyNjQ4NC43NTE5OS5xbUB3ZWI1NDExMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":31915,"nextInTopic":31920,"prevInTime":31915,"nextInTime":31917,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"~~ So to me this is really dangerous thinking for our kids! Delayed according to what, according to whom?? How on earth can an average eight month old baby be ","messageBody":"<div id=\"ygrps-yiv-735269760\">~~<br/>\nSo to me this is really dangerous thinking for our kids! Delayed<br/>\naccording to<br/>\nwhat, according to whom?? How on earth can an average eight month old<br/>\nbaby be<br/>\nbehind???~~<br/>\n<br/>\nExactly.<br/>\n<br/>\nAnd if a parent is looking for &quot;delays&quot; at the baby stage, how will<br/>\ntrust unfold when that child is maybe struggling with something like<br/>\nreading at 12 years old? Where will the trust be? Will there be more<br/>\ntherapy?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208662623","msgId":31915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZWRwMCs5bWppQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZTg2citqamNuQGVHcm91cHMuY29tPg=="},"prevInTopic":31914,"nextInTopic":31916,"prevInTime":31914,"nextInTime":31916,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"~~ Early intervention is free, is play based, and is ... is no reason NOT to intervene.~~ I disagree. I believe that most therapy is less effective than","messageBody":"<div id=\"ygrps-yiv-1502615180\">~~ Early intervention is free, is play based, and is<br/>\n<blockquote><span title=\"ireply\"> &gt; very effective, especially when started as early as possible. There<br/>\n </span></blockquote>is no reason NOT to intervene.~~<br/>\n<br/>\nI disagree.<br/>\nI believe that most &quot;therapy&quot; is less effective than parents being<br/>\nconnected and interacting with their child. ESPECIALLY at such a young<br/>\nage.<br/>\n<br/>\nMy youngest did not speak more than some grunts and garbled words<br/>\nuntil he was close to three years of age. You wouldn&#39;t be able to tell<br/>\nhim apart from the average seven year old today. No therapy, no<br/>\nintervention. I think unschooling will blossom best in an atmosphere<br/>\nof trust and labeling children as &quot;delayed&quot; is NOT going to help that<br/>\nat all.<br/>\n<br/>\n<br/>\n~~ Also, when a child is considered delayed, what they are doing is<br/>\n<blockquote><span title=\"ireply\"> &gt; significantly behind the majority of children. ~~<br/>\n<br/>\n </span></blockquote>And why would that matter? I don&#39;t compare my children to other<br/>\nchildren. They are each developing in their own way and time.<br/>\n<br/>\n~~ Perhaps he would have gotten here without therapy, but as I<br/>\n<blockquote><span title=\"ireply\"> &gt; said, it was free and play based, so there was no reason to not do it.~~<br/>\n<br/>\n </span></blockquote>It doesn&#39;t help parents trust. It makes them think their children<br/>\nwon&#39;t be ok without therapy and intervention. It labels a child as<br/>\n&quot;delayed&quot; when they&#39;re simply unfolding in their own way and time. And<br/>\nyes, &quot;regression&quot; is normal and natural. Even with things like peeing<br/>\nin a toilet and other developmental skills.<br/>\n<br/>\n<br/>\nIf the &quot;therapy&quot; is just play,then parents can do that just fine<br/>\nwithout being fearful or deciding their child is delayed. Unschooling<br/>\nneeds trust to work out well. Trust in each individual&#39;s ability and<br/>\ntime table especially. If you can&#39;t trust an eight month old to<br/>\ndevelop language later than some other children, how can you trust a 9<br/>\nor 10 or 13 year old to read in their own time?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Book Recommendations","postDate":"1208659302","msgId":31913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyNjQ4NC43NTE5OS5xbUB3ZWI1NDExMC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGZ1ZGxtOStiZW4zQGVHcm91cHMuY29tPg=="},"prevInTopic":31912,"nextInTopic":31914,"prevInTime":31912,"nextInTime":31914,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"~~If you re concerned that your child has actual delays (my son had a speech delay that we picked up at 8 months,) you can do a ages and stages questionnaire.","messageBody":"<div id=\"ygrps-yiv-1888667278\">~~If you&#39;re concerned that your child has actual delays (my son had a<br/>\nspeech delay that we picked up at 8 months,) you can do a ages and<br/>\nstages questionnaire. <a rel=\"nofollow\" target=\"_blank\" href=\"http://asq.uoregon\">http://asq.uoregon</a> edu/ It only takes a couple<br/>\nminutes, is free, and uses the standard milestones for your child&#39;s age.~~<br/>\n   <br/>\n  Wow, how did you ever pick up a speech &quot;delay&quot; at EIGHT months???  I&#39;m really curious about that!  My twin girls didn&#39;t say much until after they were 2, and I never thought to even consider that they might be &quot;delayed&quot;, I just always knew they were on *their own* track.<br/>\n   <br/>\n  So to me this is really dangerous thinking for our kids!  Delayed according to what, according to whom??  How on earth can an average eight month old baby be behind???<br/>\n   <br/>\n  Jodi <br/>\n                           <br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156716553,"authorName":"rabbits3arewe","from":"&quot;rabbits3arewe&quot; &lt;rabbits3arewe@...&gt;","profile":"rabbits3arewe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208656923","msgId":31914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZTg2citqamNuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZTYxYSs5YWJsQGVHcm91cHMuY29tPg=="},"prevInTopic":31913,"nextInTopic":31915,"prevInTime":31913,"nextInTime":31915,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"There are milestones that are indicative of children with delays. Because the earlier interventions occur, the easier the delays are to treat, we opted to","messageBody":"<div id=\"ygrps-yiv-1464200526\">There are milestones that are indicative of children with delays.<br/>\nBecause the earlier interventions occur, the easier the delays are to<br/>\ntreat, we opted to start therapy as soon as we found the delay.<br/>\nTherapy consisted of a speech therapist coming to our house and<br/>\nshowing me different ways to play that taught him the &quot;language&quot;<br/>\nskills he needed. Early intervention is free, is play based, and is<br/>\nvery effective, especially when started as early as possible. There is<br/>\nno reason NOT to intervene. Maybe a delay is just a different<br/>\ndevelopment rate that each child has, but maybe it&#39;s something bigger.<br/>\nAlso, when a child is considered delayed, what they are doing is<br/>\nsignificantly behind the majority of children. Not only was he not<br/>\nmaking the sounds he should have been, he&#39;d also stopped making<br/>\nsounds, like &quot;o&quot; that he&#39;d been making before. Regression is a scary<br/>\nthing.<br/>\n<br/>\nSo, we&#39;re now at 28 months and all is well. He is using 5 to 8 word<br/>\nsentences. Perhaps he would have gotten here without therapy, but as I<br/>\nsaid, it was free and play based, so there was no reason to not do it.<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot;<br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; ~~<br/>\n&gt; If you&#39;re concerned that your child has actual delays (my son had a<br/>\n&gt; speech delay that we picked up at 8 months,) ~~<br/>\n&gt; <br/>\n&gt; At EIGHT months??? WHat? <br/>\n&gt; <br/>\n&gt; People are so very different I don&#39;t understand how on earth you could<br/>\n&gt; call ANYTHING &quot;delayed&quot; at eight months of age. Could you explain?<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208654698","msgId":31912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZTYxYSs5YWJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1ZGxtOStiZW4zQGVHcm91cHMuY29tPg=="},"prevInTopic":31911,"nextInTopic":31913,"prevInTime":31911,"nextInTime":31913,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"~~ If you re concerned that your child has actual delays (my son had a speech delay that we picked up at 8 months,) ~~ At EIGHT months??? WHat? People are so","messageBody":"<div id=\"ygrps-yiv-1539546819\">~~<br/>\nIf you&#39;re concerned that your child has actual delays (my son had a<br/>\nspeech delay that we picked up at 8 months,) ~~<br/>\n<br/>\nAt EIGHT months??? WHat? <br/>\n<br/>\nPeople are so very different I don&#39;t understand how on earth you could<br/>\ncall ANYTHING &quot;delayed&quot; at eight months of age. Could you explain?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":156716553,"authorName":"rabbits3arewe","from":"&quot;rabbits3arewe&quot; &lt;rabbits3arewe@...&gt;","profile":"rabbits3arewe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208637961","msgId":31911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1ZGxtOStiZW4zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1YmlqMCtmZHQyQGVHcm91cHMuY29tPg=="},"prevInTopic":31906,"nextInTopic":31912,"prevInTime":31910,"nextInTime":31912,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"The Einstein book has several examples of children that go to academic preschools versus kids who go to play based preschools. By kindergarten, the only","messageBody":"<div id=\"ygrps-yiv-1683218499\">The Einstein book has several examples of children that go to academic<br/>\npreschools versus kids who go to play based preschools. By<br/>\nkindergarten, the only differences are that the academically trained<br/>\nkids have more anxiety and are not as creative.<br/>\n<br/>\nIf you&#39;re concerned that your child has actual delays (my son had a<br/>\nspeech delay that we picked up at 8 months,) you can do a ages and<br/>\nstages questionnaire. <a rel=\"nofollow\" target=\"_blank\" href=\"http://asq.uoregon.edu/\">http://asq.uoregon.edu/</a> It only takes a couple<br/>\nminutes, is free, and uses the standard milestones for your child&#39;s age.<br/>\n<br/>\nWe will unschool as well. Our son is 28 months. I am so excited to be<br/>\ngoing down this path. I think you&#39;ll love the Einstein book.<br/>\n<br/>\n<br/>\nPam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Dina&quot; &lt;dapsign@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; i will be picking up this book asap as i&#39;m needing reassurance about<br/>\nunschooling today.  <br/>\n&gt; although my son isn&#39;t even close to &quot;school age&quot; yet (he&#39;s 20 months<br/>\nold) i see a lot of kids <br/>\n&gt; similar ages who do things completely different than my son.  i&#39;m<br/>\ntrying not to worry about <br/>\n&gt; him and focus on the things he seems to love to do right now (having<br/>\nbooks read to him, <br/>\n&gt; playing with anything with wheels, pointing out things in the<br/>\nenvironment).  i keep telling <br/>\n&gt; myself, &quot;he&#39;s learning all the time no matter what he&#39;s doing&quot;. <br/>\nhard to remember <br/>\n&gt; sometimes in a society that focuses so much on teaching, teaching,<br/>\nteaching.<br/>\n&gt; <br/>\n&gt; thanks!<br/>\n&gt; dina<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rabbits3arewe&quot;<br/>\n&lt;rabbits3arewe@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have just read &quot;Einstein Never Used Flash Cards,&quot;<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Einstein-Never-Used-Flash-Cards/dp/1579546951\">http://www.amazon.com/Einstein-Never-Used-Flash-Cards/dp/1579546951</a><br/>\n&gt; &gt; <br/>\n&gt; &gt; Wonderful book that says the most important things you can do for/with<br/>\n&gt; &gt; your birth to 5 child is 1. talk to them 2. read to them. 3. Let them<br/>\n&gt; &gt; play and play with them.<br/>\n&gt; &gt; <br/>\n&gt; &gt; What I liked about the book is it was filled with LOTS of scientific<br/>\n&gt; &gt; research to back up all its statements and examples of really<br/>\n&gt; &gt; interesting studies on how children learn. It is well written and easy<br/>\n&gt; &gt; to read.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;d like to find a similar book for grade school and even high school<br/>\n&gt; &gt; learning. Does anyone know of such books?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Thanks<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":263835726,"authorName":"Dina","from":"&quot;Dina&quot; &lt;dapsign@...&gt;","profile":"dapsign","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Book Recommendations","postDate":"1208569248","msgId":31906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1YmlqMCtmZHQyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ1OGJvMityMGpiQGVHcm91cHMuY29tPg=="},"prevInTopic":31904,"nextInTopic":31911,"prevInTime":31905,"nextInTime":31907,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"i will be picking up this book asap as i m needing reassurance about unschooling today. although my son isn t even close to school age yet (he s 20 months","messageBody":"<div id=\"ygrps-yiv-1998933985\">i will be picking up this book asap as i&#39;m needing reassurance about unschooling today.  <br/>\nalthough my son isn&#39;t even close to &quot;school age&quot; yet (he&#39;s 20 months old) i see a lot of kids <br/>\nsimilar ages who do things completely different than my son.  i&#39;m trying not to worry about <br/>\nhim and focus on the things he seems to love to do right now (having books read to him, <br/>\nplaying with anything with wheels, pointing out things in the environment).  i keep telling <br/>\nmyself, &quot;he&#39;s learning all the time no matter what he&#39;s doing&quot;.  hard to remember <br/>\nsometimes in a society that focuses so much on teaching, teaching, teaching.<br/>\n<br/>\nthanks!<br/>\ndina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rabbits3arewe&quot; &lt;rabbits3arewe@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I have just read &quot;Einstein Never Used Flash Cards,&quot;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Einstein-Never-Used-Flash-Cards/dp/1579546951\">http://www.amazon.com/Einstein-Never-Used-Flash-Cards/dp/1579546951</a><br/>\n&gt; <br/>\n&gt; Wonderful book that says the most important things you can do for/with<br/>\n&gt; your birth to 5 child is 1. talk to them 2. read to them. 3. Let them<br/>\n&gt; play and play with them.<br/>\n&gt; <br/>\n&gt; What I liked about the book is it was filled with LOTS of scientific<br/>\n&gt; research to back up all its statements and examples of really<br/>\n&gt; interesting studies on how children learn. It is well written and easy<br/>\n&gt; to read.<br/>\n&gt; <br/>\n&gt; I&#39;d like to find a similar book for grade school and even high school<br/>\n&gt; learning. Does anyone know of such books?<br/>\n&gt; <br/>\n&gt; Thanks<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[unschoolingbasics] embracing our kids&#39; BIGness","postDate":"1208547772","msgId":31904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1OTU0MC45Nzc5Ny5xbUB3ZWI1NDEwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PEJFMDIwQTRBLUM0NTMtNDg2Qi1CMjgzLTkyQUQ0NDNCQzA4MUBtYWMuY29tPg=="},"prevInTopic":31903,"nextInTopic":31906,"prevInTime":31903,"nextInTime":31905,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"... Mother Nature doesn t aim for mediocre. She imbues every child with HUGE creative potential. Children are born *knowing* they re supposed to be BIG --","messageBody":"<div id=\"ygrps-yiv-279971732\">Scott Noelle&#39;s Daily Groove is amazing for those of you that don&#39;t yet subscribe.  I have to copy my favourite one yet:<br/>\n   <br/>\n  --------------------------------------------------------------------------------------------------<br/>\n   <br/>\n  Mother Nature doesn&#39;t aim for mediocre. She imbues<br/>\n  every child with HUGE creative potential.<br/>\n   <br/>\n  Children are born *knowing* they&#39;re supposed to be<br/>\n  BIG -- innately powerful, free, and continuously<br/>\n  expanding to new horizons.<br/>\n   <br/>\n  Today, no matter how physically small your child<br/>\n  may be, notice and appreciate his or her BIGness in<br/>\n  spirit. That spirit is easy to see when your child<br/>\n  is expressing pure Love and Joy. But it&#39;s no less<br/>\n  present when s/he&#39;s &quot;misbehaving.&quot; In those trying<br/>\n  times, remember...<br/>\n   <br/>\n     Our children are always doing the best they<br/>\n     can to stay connected to their BIGness --<br/>\n     in a world that expects them to be small.<br/>\n   <br/>\n  ----------------------------------------------------------------------------------------<br/>\n   <br/>\n  So beautiful.  I can&#39;t help but think what a different world we would be living in if ALL children were regarded this way.<br/>\n   <br/>\n  Jodi<br/>\n                           <br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Book Recommendations","postDate":"1208544719","msgId":31903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMDIwQTRBLUM0NTMtNDg2Qi1CMjgzLTkyQUQ0NDNCQzA4MUBtYWMuY29tPg==","inReplyToHeader":"PGZ1OGJvMityMGpiQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ1OGJvMityMGpiQGVHcm91cHMuY29tPg=="},"prevInTopic":31900,"nextInTopic":31904,"prevInTime":31902,"nextInTime":31904,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"The Book of Learning and Forgetting by Frank Smith. -pam ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-611194008\">&quot;The Book of Learning and Forgetting&quot; by Frank Smith.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 17, 2008, at 1:25 PM, rabbits3arewe wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; I&#39;d like to find a similar book for grade school and even high school<br/>\n&gt; learning. Does anyone know of such books?<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":156716553,"authorName":"rabbits3arewe","from":"&quot;rabbits3arewe&quot; &lt;rabbits3arewe@...&gt;","profile":"rabbits3arewe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Book Recommendations","postDate":"1208463938","msgId":31900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1OGJvMityMGpiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":31903,"prevInTime":31899,"nextInTime":31901,"topicId":31900,"numMessagesInTopic":0,"msgSnippet":"I have just read Einstein Never Used Flash Cards, http://www.amazon.com/Einstein-Never-Used-Flash-Cards/dp/1579546951 Wonderful book that says the most","messageBody":"<div id=\"ygrps-yiv-512849605\">I have just read &quot;Einstein Never Used Flash Cards,&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Einstein-Never-Used-Flash-Cards/dp/1579546951\">http://www.amazon.com/Einstein-Never-Used-Flash-Cards/dp/1579546951</a><br/>\n<br/>\nWonderful book that says the most important things you can do for/with<br/>\nyour birth to 5 child is 1. talk to them 2. read to them. 3. Let them<br/>\nplay and play with them.<br/>\n<br/>\nWhat I liked about the book is it was filled with LOTS of scientific<br/>\nresearch to back up all its statements and examples of really<br/>\ninteresting studies on how children learn. It is well written and easy<br/>\nto read.<br/>\n<br/>\nI&#39;d like to find a similar book for grade school and even high school<br/>\nlearning. Does anyone know of such books?<br/>\n<br/>\nThanks</div>","specialLinks":[]}],"prevTopicId":32302,"nextTopicId":32380}}