{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":78,"messages":[{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202406117","msgId":29414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZmZ0NStuaTA5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDgyMGg0MWE0OWQ1Y2szZDdiY2UyMWY3ZDk4NTYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29413,"nextInTopic":29415,"prevInTime":29413,"nextInTime":29415,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"... NO that is not the same - saying he doesn t FEEL loved or supported is not the same as saying you abuse and neglect him. Saying he FEELS unloved and","messageBody":"<div id=\"ygrps-yiv-592938394\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot; <br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; you said he feels that his family doesn&#39;t love nor support him.  <br/>\n&gt;That<br/>\n&gt; is not constructive criticism that&#39;s saying I abuse and neglect my<br/>\n&gt; son.  He&#39;s NOT unloved.<br/>\n&gt; <br/>\n </span></blockquote>NO that is not the same - saying he doesn&#39;t FEEL loved or supported is <br/>\nnot the same as saying you abuse and neglect him. Saying he FEELS <br/>\nunloved and unsupported is his Truth, right now. You love him dearly - <br/>\nif you didn&#39;t, this wouldn&#39;t be a struggle. BUT his world, his <br/>\nperspective, in the here and now is that you are trying to fix him and <br/>\nmake him do things your way (and again that is apparently what HIS <br/>\nVIEW is) rather than helping him get what he&#39;s wanting. Perception is <br/>\nHUGE! Just as you are *perceiving* that you were told that you abuse <br/>\nand neglect your son when NO ONE said that. <br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":332901363,"authorName":"Alysia","from":"Alysia &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 11 is such a hard age","postDate":"1202406103","msgId":29415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNDMzNy40OTI0Mi5xbUB3ZWI0NTkwNS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":29414,"nextInTopic":29416,"prevInTime":29414,"nextInTime":29416,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"**OK well I had given a list of things he could choose from. And we don t just have the money to give him. Plus he s very selfish, (something I ve noticed but","messageBody":"<div id=\"ygrps-yiv-354727908\">&quot;**OK well I had given a list of things he could choose from. And we<br/>\ndon&#39;t just have the money to give him. Plus he&#39;s very selfish,<br/>\n(something I&#39;ve noticed but not said to him or anyone else.) And he<br/>\ndoesn&#39;t take very good care of his things unless he&#39;s worked to get<br/>\nthem. So I figured it would be good for him all around.<br/>\nAdditionally, he saved all his holiday money and bought himself<br/>\nsomething he really wanted and it gave him a sense of pride about what<br/>\nhe had done. And that *is* good for him. So I figured this would be<br/>\ngood. I wish we had so much disposable income I could just hand them<br/>\n100.00 and say &quot;have fun&quot; but we don&#39;t. As I mentioned I have to save<br/>\nfor things I want rather than need. I do jobs myself rather than pay<br/>\nsomeone to do something or am very economical at the grocery to eek<br/>\nout some little extra money. So no, just handing it over isn&#39;t really<br/>\nan option and on top of it all we are saving to take them to Disney<br/>\n(which they know about) in June for their Star Wars weekend. So<br/>\ngiving them each (I have two boys 9 and 11) 100.00 for a<br/>\nskateboard/ripper thingy would cut into the vacation money. I suppose<br/>\nI could give them the option of having one but not the other. Or<br/>\ngetting to go but no souveniers. I just think they will have more fun<br/>\nat the Disney thing. (AND I discussed this with them and the 9 yr old<br/>\nis willing to wait until his bday for his ripper 9 yr old DOB 9 Sept<br/>\n11 yr old 15 Oct) Because the 9 yr old wants that Disney thing and<br/>\nwants money to spend there. Like I said I wish we had it, but we<br/>\ndon&#39;t. I give them little bits of money here and there all the time.<br/>\nBut a big purchase like that is too much for me to swing as<br/>\ndisposable.&quot;<br/>\n   <br/>\n  I see a lot in here about what YOU think is best or would be the most fun but not what your ds really wants. That could be very different. It can also be very different from what his brother wants. That doesn&#39;t make it any less valid.<br/>\n   <br/>\n  He&#39;s probably old enough that you could sit down with him and show him how your budget works, money vs. money out, how and where you save money by doing things yourself, how you pay yourself for those jobs. Then ask him if there are things he thinks he could do or cut back on to save the money for the thing he wants.<br/>\n   <br/>\n  Alysia<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332901363,"authorName":"Alysia","from":"Alysia &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 11 is such a hard age","postDate":"1202405802","msgId":29416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0NDg3OC41MzAxNy5xbUB3ZWI0NTkxNi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":29415,"nextInTopic":29417,"prevInTime":29415,"nextInTime":29417,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"**Well here s the problem with this...we live on base. And the yard work needs to be done THEIR way. Not mine. Not his. And if he s not going to do it up to","messageBody":"<div id=\"ygrps-yiv-1171150376\">&quot;**Well here&#39;s the problem with this...we live on base. And the yard<br/>\nwork needs to be done THEIR way. Not mine. Not his. And if he&#39;s not<br/>\ngoing to do it up to the code we&#39;ve agreed to abide by then he&#39;s not<br/>\nreally doing it and so there isn&#39;t any reason for me to pay him for<br/>\nhelping if he&#39;s going to do it his way. I&#39;m OK with the idea that<br/>\neverything should be what and how he wants with his area, his body,<br/>\netc...but we do live with a set of rules and they have to be followed.<br/>\nSo if he&#39;s not going to do what the list asks for then he&#39;s not<br/>\nreally doing it. He could pick something else from the list I gave<br/>\nhim. AND I gave him the option of not doing anything at all. It was<br/>\na choice. Not a command disguised as a choice. But if he chooses to<br/>\nhelp with the yard then he has to do what needs to be done. I don&#39;t<br/>\nlike the rule either but it is what it is.&quot;<br/>\n   <br/>\n  I wonder if the rule about how the lawn has to be done is as rigid as you think. We&#39;ve lived on two bases and never kept the yard the way it was supposed to be kept all the time and never really had a problem. We got a few notices at the first base when the grass got too tall but we still never really got in any trouble. When I showed those to my ds he was much more willing to mow the lawn right away than when I nagged and nagged at him that it had to be done. Even then, though, it was never done perfectly but we never got any notices about that.<br/>\n   <br/>\n  Alysia<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"11 is such a hard age","postDate":"1202405140","msgId":29413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjYwMWM4NjlhZSQ3NmFlMDA4MCQ2NjAyYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":29412,"nextInTopic":29414,"prevInTime":29412,"nextInTime":29414,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"**11 sounds easy compared to being the parent in these scenarios! :) **First, it is not your job to make him happy all the time or keep everyone else happy","messageBody":"<div id=\"ygrps-yiv-103772094\">**11 sounds easy compared to being the parent in these scenarios! :)<br/>\n<br/>\n**First, it is not your job to &quot;make him happy all the time&quot; or &quot;keep everyone else happy all the time.&quot;<br/>\n<br/>\n<br/>\nI am listening. I am trying to hear how to balance how to make him<br/>\nhappy all the time and keep everyone else happy all the time<br/>\nespecially when what he wants so often requires others not only to be<br/>\nunhappy but miserable. Like when he tells his 9 yr old brother that<br/>\nlife would be better if he just died. That&#39;s not nice. And it<br/>\ndoesn&#39;t mean that John should be cuddled and loved on when he is<br/>\nhateful to his brother. It&#39;s the hardest thing in the world for me to<br/>\nfigure out what to do when one of my kids hurts the other. <br/>\n<br/>\n**Maybe you&#39;ve told this story before and I didn&#39;t see it then but it does seem like a lot of scenes are being thrown into the discussion here -- all jumbled together -- and it sounds like you, Mom, are the one having a hard time. <br/>\n<br/>\n**Not to sound too condescending. . . I don&#39;t want to minimize how you feel when this sort of thing happens and you have the urge to &quot;fix&quot; it. But it is not your place to figure out what to do when one kid hurts another. You will never be able to come up with the &quot;just right&quot; phrase or rule that will prevent one brother from upsetting the other. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAnd FYI<br/>\nthat exchange followed Liam asking John not to throw his things. I<br/>\nheard Liam ask him in a nice way. And he responds with wishing Liam<br/>\nwas dead??? And when I say that wasn&#39;t a nice thing to say he<br/>\nresponds with &quot;well he shouldn&#39;t get his feelings hurt by that I&#39;m<br/>\njust expressing my feelings.&quot;<br/>\n<br/>\nKaren<br/>\n<br/>\n**This is out of context for me as I don&#39;t know the whole story but I think it would get a &quot;don&#39;t be an asshole&quot; comment from me if anyone said that sort of thing to me. Someone has told John it is OK for him to &quot;express his feeling?&quot; Yep, that&#39;s OK. It is not OK to be cruel to others though. Or to hide behind saying it was &quot;just a joke.&quot; And people who do that should be called on it. <br/>\n<br/>\n**But that&#39;s not to say that John isn&#39;t a good person or that he needs to be &quot;changed&quot; or anything as disrespectful sounding as that. Maybe he just needs to have enough life experience to see that this sort of outburst is not productive. Maybe he will never be a diplomat. :) But he&#39;s only 11 and just figuring all of this out. <br/>\n<br/>\n**And if Mom hasn&#39;t figured it out yet -- and it does sound like many of these things upset you and you carry resentment about them -- when to let go and let kids sort things out themselves, when to accept one personality is not as adorable as the next, when to have hurt feelings about what a kid says and when to suck it up and realize he&#39;s just a kid -- imagine how hard it is for the 11-year-old in the picture. <br/>\n<br/>\n**Maybe a less stressful thing than saving for a vacation you can&#39;t afford would help? Maybe clear and repeated explanations about the rules on yardwork not being anyone&#39;s choice but the rules of the military? Maybe an acceptance than trying to live as unschoolers is not a perfect fit with the military but you are all in this together and trying to see how well you can all live together, for each other? <br/>\n<br/>\n**There is so much that comes out every time you post another snippet that it is hard to know what sort of input you want or need. But it doesn&#39;t sound to me that all of the issues are about being 11.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202403934","msgId":29412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZmRvdStvbGkwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZvZjZxdis2b2g3QGVHcm91cHMuY29tPg=="},"prevInTopic":29411,"nextInTopic":29413,"prevInTime":29411,"nextInTime":29413,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"... I think he has a great sense of justice. It is tough for me when my kids call me on my control issues;[.  I always step back and feel hurt too.. But when I","messageBody":"<div id=\"ygrps-yiv-303067326\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; ~~Then he said &quot;You always do that, say<br/>\n&gt; we have a choice when we don&#39;t. If I don&#39;t help I can&#39;t earn extra<br/>\n&gt; money and so you say I have a choice when I don&#39;t. You are so mean<br/>\n&gt; that way.&quot;~~<br/>\n<br/>\n </span></blockquote>I think he has a great sense of justice. It is tough for me when my <br/>\nkids call me on my control issues;[.  I always step back and feel hurt <br/>\ntoo.. But when I look I usually find their perspective legitimate. <br/>\n<br/>\nKathleen</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202403751","msgId":29410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZmRqNyszcjRlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDc0NGkzM2E1ODk0NWo3MDA1YzExNjMwNjRhNzRlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29409,"nextInTopic":29411,"prevInTime":29409,"nextInTime":29411,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"Hi, Karen - I want to invite you to take a deep, deep breath - 3 of them, in fact, right from your tummy. Nice, slow breaths. I can see when you read he feels","messageBody":"<div id=\"ygrps-yiv-874245536\">Hi, Karen - <br/>\n<br/>\nI want to invite you to take a deep, deep breath - 3 of them, in fact,<br/>\nright from your tummy. Nice, slow breaths.<br/>\n<br/>\nI can see when you read &quot;he feels unsupported&quot; you heard &quot;he *is*<br/>\nunloved&quot;. See the difference in those 2 statements? No one here is<br/>\nsaying you don&#39;t love your child. *He feels* unsupported and unheard.<br/>\nHe clearly told you that. Instead of beating your head against the<br/>\nwall of &quot;But he is loved! He is supported! He should see that!&quot;, can<br/>\nyou try to see things from his view? Can you believe his words, and go<br/>\nfrom there? Instead of pointing out to him how wrong his words are.<br/>\n<br/>\nI also want to challenge you to focus on the one issue you brought<br/>\nhere, him wanting something. Can you let go of fears about how his<br/>\nfriends treat him/he treats his friends for now? I *know* you feel<br/>\nthey&#39;re connected, that one thing leads to another. But I believe if<br/>\nyou can temporarily let go of *all* the other issues, and just focus<br/>\non this one thing - the exchange you had about him wanting something -<br/>\nlots of clarity can come.<br/>\n<br/>\nAlso - it would serve you, and your whole family, very well if you<br/>\ndrop the whole idea that it&#39;s your job to make everyone happy. I can&#39;t<br/>\nwrite more about that now, but I hope someone else has time. This is<br/>\nimportant. It is not your job to *make* anyone, and certainly not<br/>\neveryone, happy.<br/>\n<br/>\npeace to you,<br/>\nCaren</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202403675","msgId":29409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZmRncis1bXBuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDg0MmlmYzJlMTMzbjhmOTU4YmNiYzlkMDU2YWFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":29408,"nextInTopic":29410,"prevInTime":29408,"nextInTime":29410,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"... Karen you are the only one who said you are a horrible parent. The folks on this list are trying to reflect how perhaps your reaction made your son feel.","messageBody":"<div id=\"ygrps-yiv-878307392\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot; <br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thanks Rebecca.  I really am trying.  It&#39;s so very hard when there is<br/>\n&gt; more than one person to make happy, and since I am feeling like I did<br/>\n&gt; something wrong or at least not getting it right I came here for help.<br/>\n&gt;  I did not expect someone to tell me I&#39;m a horrible parent.  I&#39;m just<br/>\n&gt; going to think about this for a while and muddle through I guess.<br/>\n&gt; Thanks again.<br/>\n&gt; Karen<br/>\n&gt;<br/>\n </span></blockquote>Karen you are the only one who said you are a horrible parent. <br/>\n<br/>\nThe folks on this list are trying to reflect how perhaps your reaction <br/>\nmade your son feel. They, or he did not say you were horrible. <br/>\n<br/>\nSometimes in our best efforts for our kids we get our own stuff wrapped <br/>\nup in it.<br/>\n<br/>\nThey, these unschooling mamas,are giving you feedback from an <br/>\nunschooling perspective. If you were on a mainstream homeschooling <br/>\ngroup the reaction would have been entirely different. But you asked <br/>\nfor an unschooling thought from radical unschooling folks. They have <br/>\nlots of wisdom. NOT conventional thought, but what folks here have <br/>\ndetermined to be a better choice for their families and kids. It is not <br/>\neasy. It requires we look at things in a new light.<br/>\n<br/>\nNo one here is personally attacking you. They are simply looking at the <br/>\nsituation from an unschooling or a child centered position and <br/>\nreflecting that to you. That is what you asked for. It is NOT an attack <br/>\non you at all.<br/>\n<br/>\nYou are a mother who loves her kid and wants what is best for him. No <br/>\none doubts that. The information shared on this list is for the benefit <br/>\nof all of us. <br/>\n<br/>\nI sometimes get into some of the very same mindsets and need to be <br/>\nshaken loose and refocused on what my philosophy and thoughts are on <br/>\nparenting, homeschooling/unschooling and respect. I have to question <br/>\nmyself and my own learned reactions to get where I want to be.<br/>\n<br/>\nAND btw it is an ongoing process for all of us. <br/>\n<br/>\nKathleen</div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"11 is such a hard age","postDate":"1202403646","msgId":29411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTkwMWM4NjlhYSRmYzIzN2M4MCQ2NjAyYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":29410,"nextInTopic":29412,"prevInTime":29410,"nextInTime":29412,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"In another scenario, if you have the money to give him for yard work, why don t you you just let him have it? ******** Exactly what I was thinking. I know my","messageBody":"<div id=\"ygrps-yiv-1579593954\">In another scenario, if you have the money to give<br/>\nhim for yard work, why don&#39;t you you just let him have it? <br/>\n<br/>\n********<br/>\n<br/>\nExactly what I was thinking.<br/>\n<br/>\nI know my kids know I really don&#39;t have the money when I tell them I don&#39;t. That&#39;s the reality in a lot of homes. <br/>\n<br/>\nBut I don&#39;t suddenly have the money if they do something I want them to do.<br/>\n<br/>\nIf you want him to help you with the yardwork, why not just ask him to help? I don&#39;t have any sort of regular chores for anyone in the house but if I&#39;m trying to do something and need a hand, I ask. &quot;Hey, tall guy (everyone in this darned house is taller than me! :) ), could you reach that down from the shelf for me?&quot; &quot;Honey, could you please move the palm fronds out to the curb for the trash? (who knew they were so heavy??)&quot;<br/>\n<br/>\nMore like I would ask anyone who was standing there for help. Not just because I can either withhold money or not.<br/>\n<br/>\nI just came home from picking up the nephew we babysit. As I was leaving, I told DD that there was a load of clothes in the dryer and it included some of her things. If she wanted something, she could get the load of laundry out. <br/>\n<br/>\nI see that she has dressed and did not take the clothes out of the dryer. So, eventually, I&#39;ll get to it. Or she will if she thinks of it. Or the baby and I will play &quot;laundry&quot; later -- not a method known for its efficiency, btw. :) <br/>\n<br/>\nBut it wasn&#39;t DD&#39;s chore to take the laundry out of the dryer and it would have been insulting to her to suggest that I would pay her to do such a simple thing that&#39;s really just a matter of who needs the clothes.<br/>\n<br/>\nToo much info? :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 11 is such a hard age","postDate":"1202403496","msgId":29408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4ODAzNS45ODE1MC5xbUB3ZWI1NjEwNi5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDg0MmlmYzJlMTMzbjhmOTU4YmNiYzlkMDU2YWFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":29407,"nextInTopic":29409,"prevInTime":29407,"nextInTime":29409,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"Karen, I completely understand this.  We are trying!! I think you need to muddle only over what you want and let go of the hurt you feel by words.  I don t","messageBody":"<div id=\"ygrps-yiv-817709701\">Karen,  <br/>\n   <br/>\n      I completely understand this.  We are trying!! I think you need to muddle only over what you want and let go of the hurt you feel by words.  I don&#39;t think anyone was saying you are a horrible parent -- I think we ( I say we because that is how I have felt at times with various postings towards me -- and to tell the truth I haven&#39;t been posting too much on any group lately in fear of this...)  but I think what is reallllly happening is that you are not happy either with your response --hence why you posted for advice.    So as stated before -- chin up forgive your actions and know that you will make a better choice next time...<br/>\n   <br/>\n   <br/>\n  Hey if it makes you feel in better -- I screamed at my 5 year old today because I keep asking him not to pick on his brother (whose 2) and I just blew.  Not cool but I did -- so now we&#39;ve talked and I&#39;m back to reflecting how not to do that!! <br/>\n<br/>\nKaren Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n          Thanks Rebecca. I really am trying. It&#39;s so very hard when there is<br/>\nmore than one person to make happy, and since I am feeling like I did<br/>\nsomething wrong or at least not getting it right I came here for help.<br/>\nI did not expect someone to tell me I&#39;m a horrible parent. I&#39;m just<br/>\ngoing to think about this for a while and muddle through I guess.<br/>\nThanks again.<br/>\nKaren<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202403129","msgId":29407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZmN2cCtwdmdyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDg0MmlmYzJlMTMzbjhmOTU4YmNiYzlkMDU2YWFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":29405,"nextInTopic":29408,"prevInTime":29406,"nextInTime":29408,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"I swore i would not respond anymore. And I swear it will be the last if it remains confrontational.  it s not my intentions at all. NO ONE told you were a","messageBody":"<div id=\"ygrps-yiv-810627811\">I swore i would not respond anymore. And I swear it will be the last<br/>\nif it remains confrontational.  it&#39;s not my intentions at all.<br/>\n<br/>\nNO ONE told you were a horrible parent.  That is what you chose to<br/>\nhear out of what I said.  When I said &quot;the truth hurts&quot;  I was<br/>\nreferring to everything that was said to help you that you argued or<br/>\nresponded negatively to.  I was referring to the fact that you were<br/>\nobviously bothered by our answers (especially mine I guess).  the<br/>\ntruth does hurt!  and a lot!  I should know!  Especially when you hit<br/>\nthat realization that you have done something contrary to your beliefs<br/>\nand what you would like.  I&#39;m awfully sorry that i hurt your feelings.<br/>\n You shouldn&#39;t take what I am saying so personally.  I don&#39;t mean it<br/>\nthat way.  <br/>\n<br/>\n<br/>\nhonesty is something that everyone asks for, but no one really wants<br/>\nto hear<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot;<br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Thanks Rebecca.  I really am trying.  It&#39;s so very hard when there is<br/>\n&gt; more than one person to make happy, and since I am feeling like I did<br/>\n&gt; something wrong or at least not getting it right I came here for help.<br/>\n&gt;  I did not expect someone to tell me I&#39;m a horrible parent.  I&#39;m just<br/>\n&gt; going to think about this for a while and muddle through I guess.<br/>\n&gt; Thanks again.<br/>\n&gt; Karen<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 11 is such a hard age","postDate":"1202402693","msgId":29405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1MUQ1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":29403,"nextInTopic":29407,"prevInTime":29404,"nextInTime":29406,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"... So then how are you planning to pay him for something you d otherwise do yourself for free? You d have to be coming up with the money from somewhere,","messageBody":"<div id=\"ygrps-yiv-2050227346\"><blockquote><span title=\"ireply\">&gt;And we don&#39;t just have the money to give him.<br/>\n </span></blockquote>So then how are you planning to pay him for something you&#39;d otherwise do<br/>\nyourself for free? You&#39;d have to be coming up with the money from<br/>\nsomewhere, right? If you can&#39;t afford to -give- him the money, then you<br/>\ncan&#39;t afford to -pay- him for his work. If you&#39;ve got $10 to pay him for<br/>\nyard work, you&#39;ve got $10 to give him toward what he wants.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But if he chooses to help with the yard then he has to do what needs to<br/>\n </span></blockquote>be done. I don&#39;t like the rule either but it is what it is.<br/>\nDoes he know WHY things are the way they are (as in, do they give you a<br/>\nlist when you move in saying &quot;This is how to mow the lawn&quot;)? Does it<br/>\nreally have to be done in a certain way or does it just have to have a<br/>\ncertain outcome? For instance, mowing can be done around in<br/>\ndecreasing/increasing circles, in horizontal lines, vertical lines,<br/>\ncriss-cross (like baseball outfields) - does it have to be done in a<br/>\nparticular way or does it just have to be done once per week during the<br/>\nspecified season (or year round if you&#39;re in a warmer climate) and cut<br/>\nto a certain height?<br/>\n<blockquote><span title=\"ireply\"> &gt;The &quot;rule&quot; here is that everyone has the right to feel safe, happy and<br/>\n </span></blockquote>loved.<br/>\nThen it sounds like you &quot;broke&quot; the rule - he didn&#39;t feel safe, happy<br/>\nand loved in your exchange.<br/>\n<br/>\n<br/>\nDeb <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 11 is such a hard age","postDate":"1202402573","msgId":29403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjA3MDg0MmlmYzJlMTMzbjhmOTU4YmNiYzlkMDU2YWFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDEzMzgwNi44NDEyMi5xbUB3ZWI1NjExMC5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDY3YTlkNzUwMDgwMjA3MDc0NGkzM2E1ODk0NWo3MDA1YzExNjMwNjRhNzRlQG1haWwuZ21haWwuY29tPgkgPDEzMzgwNi44NDEyMi5xbUB3ZWI1NjExMC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":29402,"nextInTopic":29405,"prevInTime":29402,"nextInTime":29404,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"Thanks Rebecca.  I really am trying.  It s so very hard when there is more than one person to make happy, and since I am feeling like I did something wrong or","messageBody":"<div id=\"ygrps-yiv-1300793664\">Thanks Rebecca.  I really am trying.  It&#39;s so very hard when there is<br/>\nmore than one person to make happy, and since I am feeling like I did<br/>\nsomething wrong or at least not getting it right I came here for help.<br/>\n I did not expect someone to tell me I&#39;m a horrible parent.  I&#39;m just<br/>\ngoing to think about this for a while and muddle through I guess.<br/>\nThanks again.<br/>\nKaren</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202401947","msgId":29402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZmJxcit1ZjN1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDgyMGg0MWE0OWQ1Y2szZDdiY2UyMWY3ZDk4NTYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29400,"nextInTopic":29403,"prevInTime":29401,"nextInTime":29403,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"Well...  it does.  Although, You seem to have taken it somewhat out of context. Take or leave the advice.  I m not here to argue with you.","messageBody":"<div id=\"ygrps-yiv-27727116\">Well...  it does.  Although, You seem to have taken it somewhat out of<br/>\ncontext. <br/>\n<br/>\nTake or leave the advice.  I&#39;m not here to argue with you.   <br/>\n   <br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot;<br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; I posted this...<br/>\n&gt; <br/>\n&gt; ~~Why do I always feel like you all<br/>\n&gt; think I&#39;m the worst parent in the world when I post here? ~~<br/>\n&gt; <br/>\n&gt; Then you said this....<br/>\n&gt; <br/>\n&gt; &lt;&lt;The truth hurts&gt;&gt;<br/>\n&gt; <br/>\n&gt; ***************************************************<br/>\n&gt; <br/>\n&gt; That is not constructive criticism.  That&#39;s hurtful speak.  And then<br/>\n&gt; you said he feels that his family doesn&#39;t love nor support him.  That<br/>\n&gt; is not constructive criticism that&#39;s saying I abuse and neglect my<br/>\n&gt; son.  He&#39;s NOT unloved.<br/>\n&gt; <br/>\n&gt; I am listening.  I am trying to hear how to balance how to make him<br/>\n&gt; happy all the time and keep everyone else happy all the time<br/>\n&gt; especially when what he wants so often requires others not only to be<br/>\n&gt; unhappy but miserable.  Like when he tells his 9 yr old brother that<br/>\n&gt; life would be better if he just died.  That&#39;s not nice.   And it<br/>\n&gt; doesn&#39;t mean that John should be cuddled and loved on when he is<br/>\n&gt; hateful to his brother.  It&#39;s the hardest thing in the world for me to<br/>\n&gt; figure out what to do when one of my kids hurts the other.  And FYI<br/>\n&gt; that exchange followed Liam asking John not to throw his things.  I<br/>\n&gt; heard Liam ask him in a nice way.  And he responds with wishing Liam<br/>\n&gt; was dead???  And when I say that wasn&#39;t a nice thing to say he<br/>\n&gt; responds with &quot;well he shouldn&#39;t get his feelings hurt by that I&#39;m<br/>\n&gt; just expressing my feelings.&quot;<br/>\n&gt; <br/>\n&gt; Karen<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 11 is such a hard age","postDate":"1202401697","msgId":29400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzgwNi44NDEyMi5xbUB3ZWI1NjExMC5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDc0NGkzM2E1ODk0NWo3MDA1YzExNjMwNjRhNzRlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29398,"nextInTopic":29402,"prevInTime":29399,"nextInTime":29401,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"Hi folks I decided to jump on this thread because even though I don t have a 11 year old that perhaps some of what is being talked about may be something I","messageBody":"<div id=\"ygrps-yiv-91152878\">Hi folks I decided to jump on this thread because even though I don&#39;t have a 11 year old that perhaps some of what is being talked about may be something I need to hear also.  I didn&#39;t expect to find bickering.  Now the peace keeper in me wants to come out.<br/>\n   <br/>\n  Karen,  I have felt this way on groups before  -- this one and others I&#39;m on -- matter of fact recently on another group a guy basically told me I should put my son back into school until I get a grip... OUCH   I felt hurt, angry, defensive.  But I didn&#39;t respond right away, I just thought on it, cried, etc.  After a bit I excepted that my action did sound &quot;out of control&quot; and later the man said that he had a brother that lost his kids because the mother wouldn&#39;t get help for her abusive behavior -- so basically my post set off something inside him -- which I understood completely.  I wasn&#39;t happy with my ways either that was why I was reaching out for help.   Anyway, please , please, try to step back and view your posts and others from an outside angle.  When reading Heathers post I truly don&#39;t see anything in it that you really didn&#39;t say yourself (even in the post before the one below!) Now I don&#39;t think the &quot;truth hurts&quot; statement was polite but ??? let it go.   I<br/>\n truly believe that everyone on these lists mean well.  Remember also we when just communicating via e-mail many times things can be misinterpreted.  We can&#39;t hear your voice tones and such ...   <br/>\n   <br/>\n  Anyway,  Karen you are doing the best you can -- and always trying to improve  -- just like the rest of us.  Take a deep breath surround beautiful white light around you and know that you are one with the divine ....  Good.... Now hug yourself and forgive yourself for your actions... no more quilt!! now go hug your kids.  <br/>\n   <br/>\n  Again, thank you for being willing to speak up and look for solutions. ...  Remember though, really search for what is right for your family!!   <br/>\n<br/>\nKaren Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt; wrote:<br/>\n          Hey that&#39;s unfair. He&#39;s not unsupported by his family. Now you are<br/>\nsaying that he&#39;s unloved. That is NOT true. When he&#39;s blown up at a<br/>\nfriend he gets a hug and we talk about what happened and how he could<br/>\nhave done things differently. What am I supposed to do? Go yell at<br/>\nthe other kid? Make sure all interactions my son has always go his<br/>\nway? Last night he got angry with a friend for bumping him when they<br/>\nwere playing on the trampoline. He freaked out and screamed at his<br/>\nBROTHER who wasn&#39;t even on the trampoline. So they both come in the<br/>\ndoor crying. So I&#39;m supposed to what? Hug John and tell Liam to suck<br/>\nit up because his brother is intense? Honestly, I do not try to abuse<br/>\nmy kids. I go out of my way to be kind and sensitive to them and<br/>\ntheir needs. But there is more than just one of them...and John&#39;s<br/>\nneeds and wants can&#39;t be more important than everyone else&#39;s. He has<br/>\nto give when he doesn&#39;t want to as well as the rest of us. Conflict<br/>\nusually needs compromise to come to solution. But I didn&#39;t deserve<br/>\nyou taking a swipe at my parenting. I don&#39;t tell him what he did<br/>\nwrong. I help him see how things unfolded and how a different<br/>\nreaction would have yeilded a different result. What am I supposed to<br/>\ndo if that is an unloving and abusive response?<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 7, 2008 9:35 AM, swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; The truth hurts. When I first started unschooling and started asking<br/>\n&gt; questions. The answers sometimes made me cry.<br/>\n&gt;<br/>\n&gt; It&#39;s a journey for all of you. You&#39;re spending to much time worrying<br/>\n&gt; about your sons future and what you want for him. If he has a hard<br/>\n&gt; time with a friend. He needs maybe a hug and your support. He<br/>\n&gt; doesn&#39;t need you to tell him everything he did wrong. I&#39;m sure he<br/>\n&gt; knows. His extreme behavior, may always be somewhat extreme, as with<br/>\n&gt; my son. He needs you to love him for who he is. How can he have<br/>\n&gt; friends if he can&#39;t even find support in his family?<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &lt;luvbullbreeds@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Actually it causes him trouble with his friends. Not with the adults<br/>\n&gt; &gt; necessarily. When he freaks out and yells at a friend for something<br/>\n&gt; &gt; that is a mistake or yells at a friend that &quot;I&#39;ll never play with you<br/>\n&gt; &gt; again!&quot; It hurts him in the end. Why do I always feel like you all<br/>\n&gt; &gt; think I&#39;m the worst parent in the world when I post here? I want to<br/>\n&gt; &gt; help him be a happier person. What makes him happy is to have friends<br/>\n&gt; &gt; with whom he gets along. When this extreme behavior causes issues<br/>\n&gt; &gt; what do you suggest I do?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Karen<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNever miss a thing.   Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 11 is such a hard age","postDate":"1202401211","msgId":29398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjA3MDgyMGg0MWE0OWQ1Y2szZDdiY2UyMWY3ZDk4NTYxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZvZjlucStpYW9rQGVHcm91cHMuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDgwMjA3MDc0NGkzM2E1ODk0NWo3MDA1YzExNjMwNjRhNzRlQG1haWwuZ21haWwuY29tPgkgPGZvZjlucStpYW9rQGVHcm91cHMuY29tPg=="},"prevInTopic":29397,"nextInTopic":29400,"prevInTime":29397,"nextInTime":29399,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"I posted this... ~~Why do I always feel like you all think I m the worst parent in the world when I post here? ~~ Then you said this....  ","messageBody":"<div id=\"ygrps-yiv-962787430\">I posted this...<br/>\n<br/>\n~~Why do I always feel like you all<br/>\nthink I&#39;m the worst parent in the world when I post here? ~~<br/>\n<br/>\nThen you said this....<br/>\n<br/>\n&lt;&lt;The truth hurts&gt;&gt;<br/>\n<br/>\n***************************************************<br/>\n<br/>\nThat is not constructive criticism.  That&#39;s hurtful speak.  And then<br/>\nyou said he feels that his family doesn&#39;t love nor support him.  That<br/>\nis not constructive criticism that&#39;s saying I abuse and neglect my<br/>\nson.  He&#39;s NOT unloved.<br/>\n<br/>\nI am listening.  I am trying to hear how to balance how to make him<br/>\nhappy all the time and keep everyone else happy all the time<br/>\nespecially when what he wants so often requires others not only to be<br/>\nunhappy but miserable.  Like when he tells his 9 yr old brother that<br/>\nlife would be better if he just died.  That&#39;s not nice.   And it<br/>\ndoesn&#39;t mean that John should be cuddled and loved on when he is<br/>\nhateful to his brother.  It&#39;s the hardest thing in the world for me to<br/>\nfigure out what to do when one of my kids hurts the other.  And FYI<br/>\nthat exchange followed Liam asking John not to throw his things.  I<br/>\nheard Liam ask him in a nice way.  And he responds with wishing Liam<br/>\nwas dead???  And when I say that wasn&#39;t a nice thing to say he<br/>\nresponds with &quot;well he shouldn&#39;t get his feelings hurt by that I&#39;m<br/>\njust expressing my feelings.&quot;<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202399802","msgId":29397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjlucStpYW9rQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDc0NGkzM2E1ODk0NWo3MDA1YzExNjMwNjRhNzRlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29395,"nextInTopic":29398,"prevInTime":29396,"nextInTime":29398,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"I m sorry your having such a hard time right now.  Until you make the choice to stop taking constructive criticism personally, then no advice you ask for will","messageBody":"<div id=\"ygrps-yiv-772808391\">I&#39;m sorry your having such a hard time right now.  Until you make the<br/>\nchoice to stop taking constructive criticism personally, then no<br/>\nadvice you ask for will do you any good at all.  <br/>\n<br/>\nSorry I couldn&#39;t be of more help to you.  your situation is so<br/>\nfamiliar to me.  I was really hoping i could have helped you.<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot;<br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hey that&#39;s unfair.  He&#39;s not unsupported by his family.  Now you are<br/>\n&gt; saying that he&#39;s unloved.  That is NOT true.  When he&#39;s blown up at a<br/>\n&gt; friend he gets a hug and we talk about what happened and how he could<br/>\n&gt; have done things differently.  What am I supposed to do?  Go yell at<br/>\n&gt; the other kid?  Make sure all interactions my son has always go his<br/>\n&gt; way?  Last night he got angry with a friend for bumping him when they<br/>\n&gt; were playing on the trampoline.  He freaked out and screamed at his<br/>\n&gt; BROTHER who wasn&#39;t even on the trampoline.  So they both come in the<br/>\n&gt; door crying.  So I&#39;m supposed to what?  Hug John and tell Liam to suck<br/>\n&gt; it up because his brother is intense?  Honestly, I do not try to abuse<br/>\n&gt; my kids.  I go out of my way to be kind and sensitive to them and<br/>\n&gt; their needs.  But there is more than just one of them...and John&#39;s<br/>\n&gt; needs and wants can&#39;t be more important than everyone else&#39;s.  He has<br/>\n&gt; to give when he doesn&#39;t want to as well as the rest of us.  Conflict<br/>\n&gt; usually needs compromise to come to solution.  But I didn&#39;t deserve<br/>\n&gt; you taking a swipe at my parenting.  I don&#39;t tell him what he did<br/>\n&gt; wrong.  I help him see how things unfolded and how a different<br/>\n&gt; reaction would have yeilded a different result.  What am I supposed to<br/>\n&gt; do if that is an unloving and abusive response?<br/>\n&gt; Karen<br/>\n&gt; <br/>\n&gt; On Feb 7, 2008 9:35 AM, swissarmy_wife &lt;heatherbean@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; The truth hurts. When I first started unschooling and started asking<br/>\n&gt; &gt; questions. The answers sometimes made me cry.<br/>\n&gt; &gt;<br/>\n&gt; &gt; It&#39;s a journey for all of you. You&#39;re spending to much time worrying<br/>\n&gt; &gt; about your sons future and what you want for him. If he has a hard<br/>\n&gt; &gt; time with a friend. He needs maybe a hug and your support. He<br/>\n&gt; &gt; doesn&#39;t need you to tell him everything he did wrong. I&#39;m sure he<br/>\n&gt; &gt; knows. His extreme behavior, may always be somewhat extreme, as with<br/>\n&gt; &gt; my son. He needs you to love him for who he is. How can he have<br/>\n&gt; &gt; friends if he can&#39;t even find support in his family?<br/>\n&gt; &gt;<br/>\n&gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &lt;luvbullbreeds@&gt; wrote:<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Actually it causes him trouble with his friends. Not with the adults<br/>\n&gt; &gt; &gt; necessarily. When he freaks out and yells at a friend for something<br/>\n&gt; &gt; &gt; that is a mistake or yells at a friend that &quot;I&#39;ll never play<br/>\n </span></blockquote>with you<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt; again!&quot; It hurts him in the end. Why do I always feel like you all<br/>\n&gt; &gt; &gt; think I&#39;m the worst parent in the world when I post here? I want to<br/>\n&gt; &gt; &gt; help him be a happier person. What makes him happy is to have<br/>\n </span></blockquote>friends<br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; &gt; with whom he gets along. When this extreme behavior causes issues<br/>\n&gt; &gt; &gt; what do you suggest I do?<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Karen<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 11 is such a hard age","postDate":"1202399091","msgId":29395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjA3MDc0NGkzM2E1ODk0NWo3MDA1YzExNjMwNjRhNzRlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZvZjhmdCttOHUxQGVHcm91cHMuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDgwMjA3MDcyMWw0MjJlM2FhYXMzYjZjNjI5MmRjNzliOTkxQG1haWwuZ21haWwuY29tPgkgPGZvZjhmdCttOHUxQGVHcm91cHMuY29tPg=="},"prevInTopic":29394,"nextInTopic":29397,"prevInTime":29394,"nextInTime":29396,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"Hey that s unfair.  He s not unsupported by his family.  Now you are saying that he s unloved.  That is NOT true.  When he s blown up at a friend he gets a hug","messageBody":"<div id=\"ygrps-yiv-1594335859\">Hey that&#39;s unfair.  He&#39;s not unsupported by his family.  Now you are<br/>\nsaying that he&#39;s unloved.  That is NOT true.  When he&#39;s blown up at a<br/>\nfriend he gets a hug and we talk about what happened and how he could<br/>\nhave done things differently.  What am I supposed to do?  Go yell at<br/>\nthe other kid?  Make sure all interactions my son has always go his<br/>\nway?  Last night he got angry with a friend for bumping him when they<br/>\nwere playing on the trampoline.  He freaked out and screamed at his<br/>\nBROTHER who wasn&#39;t even on the trampoline.  So they both come in the<br/>\ndoor crying.  So I&#39;m supposed to what?  Hug John and tell Liam to suck<br/>\nit up because his brother is intense?  Honestly, I do not try to abuse<br/>\nmy kids.  I go out of my way to be kind and sensitive to them and<br/>\ntheir needs.  But there is more than just one of them...and John&#39;s<br/>\nneeds and wants can&#39;t be more important than everyone else&#39;s.  He has<br/>\nto give when he doesn&#39;t want to as well as the rest of us.  Conflict<br/>\nusually needs compromise to come to solution.  But I didn&#39;t deserve<br/>\nyou taking a swipe at my parenting.  I don&#39;t tell him what he did<br/>\nwrong.  I help him see how things unfolded and how a different<br/>\nreaction would have yeilded a different result.  What am I supposed to<br/>\ndo if that is an unloving and abusive response?<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 7, 2008 9:35 AM, swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; The truth hurts. When I first started unschooling and started asking<br/>\n&gt; questions. The answers sometimes made me cry.<br/>\n&gt;<br/>\n&gt; It&#39;s a journey for all of you. You&#39;re spending to much time worrying<br/>\n&gt; about your sons future and what you want for him. If he has a hard<br/>\n&gt; time with a friend. He needs maybe a hug and your support. He<br/>\n&gt; doesn&#39;t need you to tell him everything he did wrong. I&#39;m sure he<br/>\n&gt; knows. His extreme behavior, may always be somewhat extreme, as with<br/>\n&gt; my son. He needs you to love him for who he is. How can he have<br/>\n&gt; friends if he can&#39;t even find support in his family?<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &lt;luvbullbreeds@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Actually it causes him trouble with his friends. Not with the adults<br/>\n&gt; &gt; necessarily. When he freaks out and yells at a friend for something<br/>\n&gt; &gt; that is a mistake or yells at a friend that &quot;I&#39;ll never play with you<br/>\n&gt; &gt; again!&quot; It hurts him in the end. Why do I always feel like you all<br/>\n&gt; &gt; think I&#39;m the worst parent in the world when I post here? I want to<br/>\n&gt; &gt; help him be a happier person. What makes him happy is to have friends<br/>\n&gt; &gt; with whom he gets along. When this extreme behavior causes issues<br/>\n&gt; &gt; what do you suggest I do?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Karen<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202398525","msgId":29394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjhmdCttOHUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDcyMWw0MjJlM2FhYXMzYjZjNjI5MmRjNzliOTkxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29393,"nextInTopic":29395,"prevInTime":29393,"nextInTime":29395,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"The truth hurts.  When I first started unschooling and started asking questions.  The answers sometimes made me cry. It s a journey for all of you.  You re","messageBody":"<div id=\"ygrps-yiv-123746991\">The truth hurts.  When I first started unschooling and started asking<br/>\nquestions.  The answers sometimes made me cry.  <br/>\n<br/>\nIt&#39;s a journey for all of you.  You&#39;re spending to much time worrying<br/>\nabout your sons future and what you want for him.  If he has a hard<br/>\ntime with a friend.  He needs maybe a hug and your support.  He<br/>\ndoesn&#39;t need you to tell him everything he did wrong.  I&#39;m sure he<br/>\nknows.  His extreme behavior, may always be somewhat extreme, as with<br/>\nmy son.  He needs you to love him for who he is.  How can he have<br/>\nfriends if he can&#39;t even find support in his family?<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Karen Swanay&quot;<br/>\n&lt;luvbullbreeds@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Actually it causes him trouble with his friends.  Not with the adults<br/>\n&gt; necessarily.  When he freaks out and yells at a friend for something<br/>\n&gt; that is a mistake or yells at a friend that &quot;I&#39;ll never play with you<br/>\n&gt; again!&quot;  It hurts him in the end.  Why do I always feel like you all<br/>\n&gt; think I&#39;m the worst parent in the world when I post here?  I want to<br/>\n&gt; help him be a happier person.  What makes him happy is to have friends<br/>\n&gt; with whom he gets along.  When this extreme behavior causes issues<br/>\n&gt; what do you suggest I do?<br/>\n&gt; <br/>\n&gt; Karen<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202398015","msgId":29393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjd2dit2dDRvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDcyMWw0MjJlM2FhYXMzYjZjNjI5MmRjNzliOTkxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29392,"nextInTopic":29394,"prevInTime":29392,"nextInTime":29394,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"~~Why do I always feel like you all think I m the worst parent in the world when I post here? ~~ You re not or you wouldn t be here!:)The worst parents","messageBody":"<div id=\"ygrps-yiv-1525572309\">~~Why do I always feel like you all<br/>\nthink I&#39;m the worst parent in the world when I post here? ~~<br/>\n<br/>\nYou&#39;re not or you wouldn&#39;t be here!:)The worst parents wouldn&#39;t be<br/>\nasking questions or caring about the outcome. You obviously care very<br/>\nmuch. But there are some big stumbling blocks in your relationship and<br/>\nthe way you view your child that we&#39;re trying to point out. Sometimes<br/>\nit isn&#39;t easy to hear....believe me I know this.  If you&#39;re willing to<br/>\nstop and reflect, without taking it as a personal attack on who you<br/>\nare and your love for your child, there is a big opportunity to help<br/>\nthis relationship get  better.<br/>\n<br/>\nWe can give you information but we can&#39;t make you change.;)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202397858","msgId":29392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjdyMitoY2k3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZvZjdjZytkbzMwQGVHcm91cHMuY29tPg=="},"prevInTopic":29391,"nextInTopic":29393,"prevInTime":29391,"nextInTime":29393,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"~~ So giving them each (I have two boys 9 and 11) 100.00 for a ... Ya know, I couldn t do that right now either. But I can certainly listen to what my child","messageBody":"<div id=\"ygrps-yiv-543121670\">~~&gt;So giving them each (I have two boys 9 and 11) 100.00 for a<br/>\n<blockquote><span title=\"ireply\"> &gt; skateboard/ripper thingy would cut into the vacation money.~~<br/>\n<br/>\n </span></blockquote>Ya know, I couldn&#39;t do that right now either. But I can certainly<br/>\nlisten to what my child wants, brainstorm ideas for helping them get<br/>\nwhat they want and give that child $20 towards the skateboard today.<br/>\nModeling how to get what we want is a valuable tool for children.<br/>\n<br/>\nA child that knows you are on their side, a child that knows you WANT<br/>\nthem to have what they want, is a less frustrated child. A child whose<br/>\nmother sees them as &quot;selfish&quot; is going to act out more, because they<br/>\naren&#39;t in a safe environment. &quot;Safe&quot; is a big word that has a lot to<br/>\ndo with emotional safety. It should be safe to call someone an asshole<br/>\nand feel they will listen and try to figure out what will work better.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 11 is such a hard age","postDate":"1202397690","msgId":29391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjA3MDcyMWw0MjJlM2FhYXMzYjZjNjI5MmRjNzliOTkxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZvZjdhYytiMmFpQGVHcm91cHMuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDgwMjA3MDY0MW02ZTNiN2I2MHE0MGM1ZDkyZTc5ODA0MDUyQG1haWwuZ21haWwuY29tPgkgPGZvZjdhYytiMmFpQGVHcm91cHMuY29tPg=="},"prevInTopic":29390,"nextInTopic":29392,"prevInTime":29390,"nextInTime":29392,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"Actually it causes him trouble with his friends.  Not with the adults necessarily.  When he freaks out and yells at a friend for something that is a mistake or","messageBody":"<div id=\"ygrps-yiv-924432174\">Actually it causes him trouble with his friends.  Not with the adults<br/>\nnecessarily.  When he freaks out and yells at a friend for something<br/>\nthat is a mistake or yells at a friend that &quot;I&#39;ll never play with you<br/>\nagain!&quot;  It hurts him in the end.  Why do I always feel like you all<br/>\nthink I&#39;m the worst parent in the world when I post here?  I want to<br/>\nhelp him be a happier person.  What makes him happy is to have friends<br/>\nwith whom he gets along.  When this extreme behavior causes issues<br/>\nwhat do you suggest I do?<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202397570","msgId":29390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjdpMitqcGhpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDY0MW02ZTNiN2I2MHE0MGM1ZDkyZTc5ODA0MDUyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29389,"nextInTopic":29391,"prevInTime":29389,"nextInTime":29391,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"~~**Nope they are allowed to form whatever opinions they want but if they say something ugly and mean and it hurts my feelings I m going to say that it hurt","messageBody":"<div id=\"ygrps-yiv-488902128\">~~**Nope they are allowed to form whatever opinions they want but if<br/>\nthey say something ugly and mean and it hurts my feelings I&#39;m going to<br/>\nsay that it hurt and if they interrupt me, then I&#39;m going to say that<br/>\nI would like to be shown the same respect I show them.~~<br/>\n<br/>\nBut he was trying to express his frustration and I doubt he&#39;s feeling<br/>\nsafe in being able to do that now. He obviously does NOT want to hurt<br/>\nhis mother&#39;s feelings but the first chance he got to express how he<br/>\nreally felt, it got shut down with an emotional outburst from<br/>\nMom...taking his feelings personally. He has a right to think you&#39;re<br/>\nmean! A safe home means he&#39;s should feel safe in expressing some<br/>\ndifficult feelings he&#39;s having towards you too. As adults, we should<br/>\nhave the tools to be a sounding board for them and give them options<br/>\nfor expressing anger and frustration. <br/>\n<br/>\nWhat he said did not sound mean to me. It sounded like a frustrated<br/>\nkiddo that needed to be heard and empathized with. Rather than telling<br/>\nhim how it hurt your feelings, could you not have just reflectively<br/>\nlistened? &quot;So you feel like I&#39;m not being fair?&quot; and explored it<br/>\nfurther to help you understand where he&#39;s coming from!<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202397392","msgId":29389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjdjZytkbzMwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDY0MW02ZTNiN2I2MHE0MGM1ZDkyZTc5ODA0MDUyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29388,"nextInTopic":29390,"prevInTime":29388,"nextInTime":29390,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"... You said it to all of us.  And your thinking it.  Stop making excuses. If he is selfish all you can do is model unselfish behavior.  You can t force him to","messageBody":"<div id=\"ygrps-yiv-1689867164\"><blockquote><span title=\"ireply\">&gt; **OK well I had given a list of things he could choose from.  And we<br/>\n&gt; don&#39;t just have the money to give him.  Plus he&#39;s very selfish,<br/>\n&gt; (something I&#39;ve noticed but not said to him or anyone else.)  <br/>\n<br/>\n </span></blockquote>You said it to all of us.  And your thinking it.  Stop making excuses.<br/>\n   If he is selfish all you can do is model unselfish behavior.  You<br/>\ncan&#39;t force him to not be selfish.  <br/>\n<br/>\n<br/>\nAnd he<br/>\n<blockquote><span title=\"ireply\"> &gt; doesn&#39;t take very good care of his things unless he&#39;s worked to get<br/>\n&gt; them.  <br/>\n<br/>\n </span></blockquote>There his things you need to respect that.  My child is quite similar.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;So I figured it would be good for him all around.<br/>\n&gt; Additionally, he saved all his holiday money and bought himself<br/>\n&gt; something he really wanted and it gave him a sense of pride about<br/>\n&gt;what he had done.  And that *is* good for him.  So I figured this<br/>\n&gt;would be good.  <br/>\n<br/>\n </span></blockquote>You figured wrong.  Christmas was on his terms.  This time it wasn&#39;t.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I wish we had so much disposable income I could just hand them<br/>\n&gt; 100.00 and say &quot;have fun&quot; but we don&#39;t.  <br/>\n<br/>\n </span></blockquote>Who does?  That&#39;s a lot of money.  My point was, you were willing to<br/>\npay him fo working in the yard.  So you obviously had a few extra<br/>\ndollars for him.  It&#39;s not like you were going to use it to pay<br/>\nsomeone else right?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;As I mentioned I have to save for things I want rather than need.  I<br/>\n&gt;do jobs myself rather than pay someone to do something or am very<br/>\n&gt;economical at the grocery to eek out some little extra money.  So no,<br/>\n&gt;just handing it over isn&#39;t really an option and on top of it all we<br/>\n&gt;are saving to take them to Disney (which they know about) in June for<br/>\n&gt;their Star Wars weekend.  <br/>\n<br/>\n </span></blockquote>You keep mentioning it and I think you need to visit your own<br/>\nresentments about your tight budget.  Have you ever sat down and<br/>\nshowed him on a piece of paper how your paychecks get divvied up and<br/>\nwhy there isn&#39;t much left?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;So giving them each (I have two boys 9 and 11) 100.00 for a<br/>\n&gt; skateboard/ripper thingy would cut into the vacation money.  <br/>\n<br/>\n </span></blockquote>If you can&#39;t afford a skateboard, then you can&#39;t afford a skateboard.<br/>\n You&#39;ve turned it into an argument.  No one has it all.  Maybe you<br/>\nfeel guilty.  You&#39;re trying to force a learning/saving money<br/>\nexperience.  It won&#39;t work.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **Well here&#39;s the problem with this...we live on base.  And the yard<br/>\n&gt; work needs to be done THEIR way.  Not mine.  Not his.  And if he&#39;s not<br/>\n&gt; going to do it up to the code we&#39;ve agreed to abide by then he&#39;s not<br/>\n&gt; really doing it and so there isn&#39;t any reason for me to pay him for<br/>\n&gt; helping if he&#39;s going to do it his way.  I&#39;m OK with the idea that<br/>\n&gt; everything should be what and how he wants with his area, his body,<br/>\n&gt; etc...but we do live with a set of rules and they have to be followed.<br/>\n<br/>\n </span></blockquote>Then you follow them.  Let him do the yard work to the best of his<br/>\nability at the time.  Then YOU pick up the slack.  (without complaint)<br/>\nYour son did not agree to abide by the base rules.  YOU DID.  Your son<br/>\ndid not choose to live on base.  YOU DID.  He is frustrated with<br/>\nyour/the bases rules, and you as the mom should be accepting and<br/>\nloving his help in any form.  And if it isn&#39;t up to code...  then get<br/>\noutside and make it up to code.    <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  So if he&#39;s not going to do what the list asks for then he&#39;s not<br/>\n&gt; really doing it.  He could pick something else from the list I gave<br/>\n&gt; him.  AND I gave him the option of not doing anything at all.  It was<br/>\n&gt; a choice. <br/>\n<br/>\n </span></blockquote>This is not a choice.  This is &quot;my way or the highway&quot;.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **Yeah it really did hurt my feelings.  I go out of my way, choosing<br/>\n&gt; my words carefully, trying to parent them with more respect than I was<br/>\n&gt; ever shown and for that he goes after me.  It did hurt my feelings.<br/>\n&gt; He is allowed to think I&#39;m mean that part didn&#39;t bother me.  He&#39;s been<br/>\n&gt; saying that since he could talk.  I also got the &quot;I hate you!&quot;  thing<br/>\n&gt; when he was 2.  That&#39;s normal frustration.  But when I&#39;m trying to<br/>\n&gt; help him and he says I&#39;m trying to hurt him then yeah that hurts me.<br/>\n<br/>\n </span></blockquote>The truth hurts.  He&#39;s telling you the truth.  Someone else already<br/>\nsaid it, but your turning his problems into his inadequacy.  He feels<br/>\nyour being mean.  It&#39;s fairly obvious why.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; **I&#39;m from Boston.  But interrupting is a constant problem with him.<br/>\n&gt; And it&#39;s not showing others the respect he wants to be shown.  If<br/>\n&gt;his  brother interrupts him when he&#39;s speaking his head blows off. <br/>\n&gt;He hates it.  So it&#39;s not a foreign concept for him.<br/>\n<br/>\n </span></blockquote>Funny coincidence you being from Boston.  you can&#39;t force this stuff.<br/>\n you will only build resentment.  He&#39;s going to resent you.  My guess<br/>\nis he already does.  I bet you interupt HIM to tell him he&#39;s<br/>\ninterrupting YOU.  While your logic may be telling you one thing, two<br/>\nwrongs don&#39;t make right.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Your mother and husband aren&#39;t allowed to form opinions about you<br/>\n&gt; &gt; unless you approve?<br/>\n&gt; <br/>\n&gt; **Nope they are allowed to form whatever opinions they want but if<br/>\n&gt; they say something ugly and mean and it hurts my feelings I&#39;m going to<br/>\n&gt; say that it hurt and if they interrupt me, then I&#39;m going to say that<br/>\n&gt; I would like to be shown the same respect I show them.<br/>\n<br/>\n </span></blockquote>they are adults with years of experience in handling their emotions. <br/>\nyour child does not have that same experience.<br/>\n<br/>\n<br/>\nThe &quot;rule&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; here is that everyone has the right to feel safe, happy and loved.<br/>\n<br/>\n </span></blockquote>He doesn&#39;t.  What are you willing to do to change that.  <br/>\n<br/>\nAnd wants what he wants all the time.  Me too, only I know<br/>\n<blockquote><span title=\"ireply\"> &gt; that can&#39;t happen.  His brother too...etc....<br/>\n<br/>\n </span></blockquote>Look, your just being argumentative.  All children are different.  I<br/>\nwill tell you that my 9 year old requires more attention and love and<br/>\nhandholding than my 3 year old.  It&#39;s just the way things are.  I get<br/>\nfrustrated too sometimes.  He&#39;s really intense.  He&#39;s fairly<br/>\ndemanding.  I&#39;ll say it again...  all children are different.  the<br/>\nexpectation that they should all be the same or act the saem or feel<br/>\nthe same is ridiculous.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***He uses this extremity against his brother too.  So it&#39;s something<br/>\n&gt; we have to change.  It&#39;s not going to serve him well in life.  His<br/>\n&gt; interpersonal relationships often suffer because of it.  And I want to<br/>\n&gt; see him have better friends and be happier.  This really is a<br/>\n&gt; stumbling block for him with others not just me.<br/>\n<br/>\n </span></blockquote>Maybe if you just let it go and quit trying to control him and his<br/>\nfeelings and his behaviors he wouldn&#39;t feel so overwhelmed with<br/>\nexpectations.  Yours are high.  I couldn&#39;t even live up to them and<br/>\nI&#39;m a rational (sometimes.  hehe) adult.  <br/>\n<br/>\nTALK LESS, DO MORE.</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202397324","msgId":29388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjdhYytiMmFpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDY0MW02ZTNiN2I2MHE0MGM1ZDkyZTc5ODA0MDUyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29387,"nextInTopic":29389,"prevInTime":29387,"nextInTime":29389,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"~~He uses this extremity against his brother too. So it s something we have to change. It s not going to serve him well in life. His interpersonal","messageBody":"<div id=\"ygrps-yiv-392865256\">~~He uses this extremity against his brother too. So it&#39;s something<br/>\nwe have to change. It&#39;s not going to serve him well in life. His<br/>\ninterpersonal relationships often suffer because of it. And I want to<br/>\nsee him have better friends and be happier. This really is a<br/>\nstumbling block for him with others not just me.~~<br/>\n<br/>\nThe stumbling block is in the way you view him. You see him as someone<br/>\nthat needs to be changed. You&#39;re focused on how to change his<br/>\nbehavior. He knows this. He is not accepted and cherished for exactly<br/>\nwho-he-is right NOW. So he&#39;s intense. Some of that intensity would<br/>\nprobably diminish if he felt the adults in his life were on his side,<br/>\nwere there to help him get what he wants/needs.<br/>\n<br/>\nWhen you say &quot;it&#39;s something we have to change&quot; that is very<br/>\nworrisome. You can force him to change his behavior just to please<br/>\nyou. That isn&#39;t real change. That isn&#39;t optimal for unschooling.<br/>\nSupport him in the place he&#39;s in TODAY. Most of the problem I am<br/>\nreading, is about how you view this child and the struggles the adults<br/>\nare setting up. Quit struggling. Quit working against him. Ask<br/>\nyourself how you can help him get what he wants rather than set up a<br/>\nfalse situation that is not based on truth. If there is money to pay<br/>\nfor a job, you have SOME kind of money to help him out. He&#39;s smart. He<br/>\nknows this is false and sees right through it.<br/>\n<br/>\nI remember seeing right through that kind of lie adults told me and it<br/>\nmade me a very angry person. He shouldn&#39;t have to jump through hoops<br/>\nto get help. Give him MORE access, not less.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202397019","msgId":29387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjcwcit1NzFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDY0MW02ZTNiN2I2MHE0MGM1ZDkyZTc5ODA0MDUyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29386,"nextInTopic":29388,"prevInTime":29386,"nextInTime":29388,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"~~And we don t just have the money to give him. ~~ Then how can he earn it? If there is money to pay him for a job, then there is money to give him. That is","messageBody":"<div id=\"ygrps-yiv-1976118377\">~~And we<br/>\ndon&#39;t just have the money to give him. ~~<br/>\n<br/>\nThen how can he earn it? If there is money to pay him for a job, then<br/>\nthere is money to give him. That is just not being honest.<br/>\n<br/>\nAs long as he is seen as a &quot;selfish&quot; person, you are going to have<br/>\nstruggles with him. He is doing the best he can. The parents need to<br/>\nchange the way they see him and be his advocate rather than his enemy.<br/>\n<br/>\nI don&#39;t blame him a bit for being angry.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202396831","msgId":29386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjZxdis2b2g3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDU0OHc0YjBhZDM0Z2EzMDY2NjQzMzllODljMUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":29382,"nextInTopic":29387,"prevInTime":29385,"nextInTime":29387,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"~~Then he said You always do that, say we have a choice when we don t. If I don t help I can t earn extra money and so you say I have a choice when I don t.","messageBody":"<div id=\"ygrps-yiv-956944109\">~~Then he said &quot;You always do that, say<br/>\nwe have a choice when we don&#39;t. If I don&#39;t help I can&#39;t earn extra<br/>\nmoney and so you say I have a choice when I don&#39;t. You are so mean<br/>\nthat way.&quot;~~<br/>\n<br/>\n<br/>\nI have to agree with  him 100%. Based on what you wrote, he is being<br/>\ntreated disrespectfully and with little choice. If he can earn the<br/>\nmoney, then you can also budget the money to simply give him. Do the<br/>\nyardwork together, because you&#39;re a team and don&#39;t hold him to your<br/>\nstandard. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: 11 is such a hard age","postDate":"1202395296","msgId":29382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjA3MDY0MW02ZTNiN2I2MHE0MGM1ZDkyZTc5ODA0MDUyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZvZjQxbysyYmgyQGVHcm91cHMuY29tPg==","referencesHeader":"PDY3YTlkNzUwMDgwMjA3MDU0OHc0YjBhZDM0Z2EzMDY2NjQzMzllODljMUBtYWlsLmdtYWlsLmNvbT4JIDxmb2Y0MW8rMmJoMkBlR3JvdXBzLmNvbT4="},"prevInTopic":29381,"nextInTopic":29386,"prevInTime":29381,"nextInTime":29383,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"On Feb 7, 2008 8:19 AM, swissarmy_wife  wrote: Instead of giving him the one chore to earn money. Maybe you could have had a list of","messageBody":"<div id=\"ygrps-yiv-1237945231\"><blockquote><span title=\"qreply\">On Feb 7, 2008 8:19 AM, swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt; wrote:<br/>\nInstead of giving him the one &quot;chore&quot; to earn money. Maybe you could<br/>\nhave had a list of things to choose from or even asked him what he<br/>\nwould like to do. In another scenario, if you have the money to give<br/>\nhim for yard work, why don&#39;t you you just let him have it? Were you<br/>\ngoing to spend it somewhere else? (I definitely could be wrong there,<br/>\nbut I don&#39;t see a problem with it letting a child have a few bucks if<br/>\nthey ask for it)<br/>\n<br/>\n**OK well I had given a list of things he could choose from.  And we<br/>\ndon&#39;t just have the money to give him.  Plus he&#39;s very selfish,<br/>\n(something I&#39;ve noticed but not said to him or anyone else.)  And he<br/>\ndoesn&#39;t take very good care of his things unless he&#39;s worked to get<br/>\nthem.  So I figured it would be good for him all around.<br/>\nAdditionally, he saved all his holiday money and bought himself<br/>\nsomething he really wanted and it gave him a sense of pride about what<br/>\nhe had done.  And that *is* good for him.  So I figured this would be<br/>\ngood.  I wish we had so much disposable income I could just hand them<br/>\n100.00 and say &quot;have fun&quot; but we don&#39;t.  As I mentioned I have to save<br/>\nfor things I want rather than need.  I do jobs myself rather than pay<br/>\nsomeone to do something or am very economical at the grocery to eek<br/>\nout some little extra money.  So no, just handing it over isn&#39;t really<br/>\nan option and on top of it all we are saving to take them to Disney<br/>\n(which they know about) in June for their Star Wars weekend.  So<br/>\ngiving them each (I have two boys 9 and 11) 100.00 for a<br/>\nskateboard/ripper thingy would cut into the vacation money.  I suppose<br/>\nI could give them the option of having one but not the other.  Or<br/>\ngetting to go but no souveniers.  I just think they will have more fun<br/>\nat the Disney thing.  (AND I discussed this with them and the 9 yr old<br/>\nis willing to wait until his bday for his ripper 9 yr old DOB 9 Sept<br/>\n11 yr old 15 Oct)  Because the 9 yr old wants that Disney thing and<br/>\nwants money to spend there.  Like I said I wish we had it, but we<br/>\ndon&#39;t.  I give them little bits of money here and there all the time.<br/>\nBut a big purchase like that is too much for me to swing as<br/>\ndisposable.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Anyway, rather than me doing it all, I offered I<br/>\n&gt; &gt; would pay him to help me. He said &quot;No, I&#39;m not doing that because you<br/>\n&gt; &gt; will want it done your way and I don&#39;t want to put up with that.&quot;<br/>\n&gt;<br/>\n&gt; I don&#39;t blame him. If this is what he believes then its probably<br/>\n&gt; because it either IS that way or WAS that way. I don&#39;t know how long<br/>\n&gt; you have been unschooling, but he might need time to trust that he can<br/>\n&gt; do something HIS way.<br/>\n<br/>\n**Well here&#39;s the problem with this...we live on base.  And the yard<br/>\nwork needs to be done THEIR way.  Not mine.  Not his.  And if he&#39;s not<br/>\ngoing to do it up to the code we&#39;ve agreed to abide by then he&#39;s not<br/>\nreally doing it and so there isn&#39;t any reason for me to pay him for<br/>\nhelping if he&#39;s going to do it his way.  I&#39;m OK with the idea that<br/>\neverything should be what and how he wants with his area, his body,<br/>\netc...but we do live with a set of rules and they have to be followed.<br/>\n So if he&#39;s not going to do what the list asks for then he&#39;s not<br/>\nreally doing it.  He could pick something else from the list I gave<br/>\nhim.  AND I gave him the option of not doing anything at all.  It was<br/>\na choice. Not a command disguised as a choice.  But if he chooses to<br/>\nhelp with the yard then he has to do what needs to be done.  I don&#39;t<br/>\nlike the rule either but it is what it is.<br/>\n<br/>\n&gt; Did it really hurt your feelings? Or were you trying to make a point?<br/>\n&gt; As a parent, I know that many of things my children say I can&#39;t take<br/>\n&gt; personally. They are children and don&#39;t always have the tools to<br/>\n&gt; express their anger and frustration. I would have left that alone.<br/>\n&gt; He&#39;s is allowed to think your mean without you trying to change his<br/>\n&gt; mind. That&#39;s his CHIOCE.<br/>\n<br/>\n**Yeah it really did hurt my feelings.  I go out of my way, choosing<br/>\nmy words carefully, trying to parent them with more respect than I was<br/>\never shown and for that he goes after me.  It did hurt my feelings.<br/>\nHe is allowed to think I&#39;m mean that part didn&#39;t bother me.  He&#39;s been<br/>\nsaying that since he could talk.  I also got the &quot;I hate you!&quot;  thing<br/>\nwhen he was 2.  That&#39;s normal frustration.  But when I&#39;m trying to<br/>\nhelp him and he says I&#39;m trying to hurt him then yeah that hurts me.<br/>\n&gt;&gt;<br/>\n&gt; It does. I have an interrupter. Big time! I&#39;ve chosen not to say<br/>\n&gt; anything anymore. I don&#39;t even know if I should. I do know that when<br/>\n&gt; I let it go. It wasn&#39;t a big deal anymore. He&#39;s a kid. Kids<br/>\n&gt; interrupt. I interrupt! Someone told me it was a Northeast thing.<br/>\n&gt; we all interrupt each other. Ever been to Boston?<br/>\n<br/>\n**I&#39;m from Boston.  But interrupting is a constant problem with him.<br/>\nAnd it&#39;s not showing others the respect he wants to be shown.  If his<br/>\nbrother interrupts him when he&#39;s speaking his head blows off.  He<br/>\nhates it.  So it&#39;s not a foreign concept for him.<br/>\n<br/>\n&gt; Your mother and husband aren&#39;t allowed to form opinions about you<br/>\n&gt; unless you approve?<br/>\n<br/>\n**Nope they are allowed to form whatever opinions they want but if<br/>\nthey say something ugly and mean and it hurts my feelings I&#39;m going to<br/>\nsay that it hurt and if they interrupt me, then I&#39;m going to say that<br/>\nI would like to be shown the same respect I show them.<br/>\n<br/>\n&gt;<br/>\n&gt; He thinks so. And his opinion should be valuable to you.<br/>\n***His opinion is valuable, but it is not the only opinion that<br/>\nmatters here.  There are 5 of us.  And one can&#39;t rule.  The &quot;rule&quot;<br/>\nhere is that everyone has the right to feel safe, happy and loved.<br/>\nAnd so we try not to do things that make others not feel that way.<br/>\nSometimes there is going to be conflict between what two or more<br/>\npeople want but this is a constant thing with him.  He&#39;s SO high<br/>\nstrung.  And wants what he wants all the time.  Me too, only I know<br/>\nthat can&#39;t happen.  His brother too...etc....<br/>\n<br/>\n&gt; I REALLY hope this helps. It sounds like you have a very intense 11<br/>\n&gt; year old. So do I! (9) I know how hard and frustrating it can be to<br/>\n&gt; stay in the now and parent that way you&#39;d like when the emotional<br/>\n&gt; response is so extreme.<br/>\n<br/>\n***He uses this extremity against his brother too.  So it&#39;s something<br/>\nwe have to change.  It&#39;s not going to serve him well in life.  His<br/>\ninterpersonal relationships often suffer because of it.  And I want to<br/>\nsee him have better friends and be happier.  This really is a<br/>\nstumbling block for him with others not just me.<br/>\n<br/>\nKaren </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] 11 is such a hard age","postDate":"1202394640","msgId":29381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDOTA4OUJDLTBBRkUtNDM2Ni1BMzU4LURENDk5NUZENkQ4MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDU0OHc0YjBhZDM0Z2EzMDY2NjQzMzllODljMUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDY3YTlkNzUwMDgwMjA3MDU0OHc0YjBhZDM0Z2EzMDY2NjQzMzllODljMUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":29380,"nextInTopic":29382,"prevInTime":29380,"nextInTime":29382,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"... Relatively so, but not the answer I think you re expecting! I think you need to listen to what your son is saying. He s reacting to how the world feels to","messageBody":"<div id=\"ygrps-yiv-1762411484\"><blockquote><span title=\"ireply\">&gt; OK, this should be a quick and easy answer...maybe =)<br/>\n<br/>\n </span></blockquote>Relatively so, but not the answer I think you&#39;re expecting!<br/>\n<br/>\nI think you need to listen to what your son is saying. He&#39;s reacting  <br/>\nto how the world feels to him, not to how you believe it looks.  <br/>\nRegardless of what the intent of your words and actions is, he&#39;s  <br/>\nfeeling them differently.<br/>\n<br/>\n From what you wrote, I&#39;d say he&#39;s spot on. It *isn&#39;t* fun to help  <br/>\nsomeone who wants a clone of themselves. Free help should be  <br/>\nappreciated regardless of what&#39;s expected. In fact throw expectations  <br/>\naway. Appreciate the *time* someone has taken from their life to do  <br/>\nsomething for you. Paid help should be different, but if you&#39;ve  <br/>\ngotten into this type of interaction over free help in the past, the  <br/>\ndifference will take some healing with a lot of pure unadulterated  <br/>\nappreciation of free help.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;You always do that, say<br/>\n&gt; we have a choice when we don&#39;t.  If I don&#39;t help I can&#39;t earn extra<br/>\n&gt; money and so you say I have a choice when I don&#39;t.  You are so mean<br/>\n&gt; that way.&quot;  And I don&#39;t think I was being mean at all.<br/>\n<br/>\n </span></blockquote>Doesn&#39;t make a difference. *He* sees it his way and he&#39;s going to  <br/>\nreact to how he sees it. If you respond in the way *you* want him to  <br/>\nsee the world, you&#39;ll be butting heads and he&#39;ll feel unheard.<br/>\n<br/>\nYou&#39;ve had years to learn how to be patient with someone who&#39;s still  <br/>\nfeeling his way. He *isn&#39;t* trying to hurt you. He&#39;s just trying to  <br/>\nsolve a problem with skills that aren&#39;t up to the task. They will  <br/>\ngrow. He doesn&#39;t need lessons in the moment on how to relate. Help  <br/>\nhim solve the problem. Don&#39;t change the focus.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I offered him<br/>\n&gt; the choice to help me in the yard or not that&#39;s his choice.<br/>\n<br/>\n </span></blockquote>What you offered was my way or the highway. What he wants is someone  <br/>\nto help him solve his problem. Be his advocate. If one solution falls  <br/>\nthrough, help him think of another. Help him think of dozens.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I said &quot;It hurts my feelings when you say I&#39;m<br/>\n&gt; mean when I&#39;m trying to help you find ways to get what you want.&quot;  And<br/>\n&gt; then he started to cry.  I asked him why he was crying and he said<br/>\n&gt; &quot;When you say I hurt your feelings that makes me sad because it means<br/>\n&gt; you hate me.&quot;<br/>\n<br/>\n </span></blockquote>Again, listen to what he&#39;s telling you.<br/>\n<br/>\nIt *can* be frustrating, certainly, but remove yourself from the  <br/>\nequation. It&#39;s not about you. It&#39;s about him and a problem he&#39;s  <br/>\nhaving. Get yourself out of the way of the problem.<br/>\n<br/>\nDon&#39;t tell him he&#39;s hurt your feelings in a situation like this. It  <br/>\ntakes the focus off the problem and turns him into the problem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OK that SO doesn&#39;t mean that.<br/>\n<br/>\n </span></blockquote>To him it does.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And that in his life he&#39;s going to meet people that are<br/>\n&gt; more sensitive than others and that&#39;s just the way life is.<br/>\n<br/>\n </span></blockquote>He wants to buy something. You&#39;ve turned it into a lecture on how  <br/>\ninadequate he is.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And in<br/>\n&gt; the middle of me talking he butted in and started to talk over  <br/>\n&gt; me.   So<br/>\n&gt; I said &quot;Excuse me, I was speaking.  It&#39;s impolite to interrupt others<br/>\n&gt; when they are talking.<br/>\n<br/>\n </span></blockquote>If I went to someone I trusted for help and they started lecturing me  <br/>\non something that was unrelated, I&#39;d be irritated too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I listen when you speak, it&#39;s disrespectful to<br/>\n&gt; me to not offer me the same courtesy that I extend to you.<br/>\n<br/>\n </span></blockquote>Actually, perhaps what you do is wait until he&#39;s done speaking, but  <br/>\nwhat you&#39;re doing is listening to see if you agree with what he&#39;s  <br/>\nsaying and then tell him he&#39;s wrong. You *aren&#39;t* listening to his  <br/>\nwords and trying to understand *him*.<br/>\n<br/>\nYou&#39;d probably get a lot out of:<br/>\n<br/>\nTHE DAILY GROOVE ~ by Scott Noelle<br/>\nwww.enjoyparenting.com/dailygroove<br/>\n<br/>\nNice and short and sweet everyday, ways to honor our children. :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 11 is such a hard age","postDate":"1202393976","msgId":29380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZvZjQxbysyYmgyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMjA3MDU0OHc0YjBhZDM0Z2EzMDY2NjQzMzllODljMUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":29379,"nextInTopic":29381,"prevInTime":29379,"nextInTime":29381,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"First of all I have to giggle at your subject line.  I think struggles often come with children at different ages and then the statement comes to mind  # is","messageBody":"<div id=\"ygrps-yiv-2130191777\">First of all I have to giggle at your subject line.  I think struggles<br/>\noften come with children at different ages and then the statement<br/>\ncomes to mind  &quot;# is such a hard age&quot;.  It&#39;s kind of like when your<br/>\nout with your child and they do something neat publicly and someone<br/>\nwalks by and says, &quot;thats such a great age&quot;.  They are all tough and<br/>\ngreat.  I could even put my own age in there.  <br/>\n<br/>\nI&#39;m gonna give this a shot because I sometimes have similar struggles<br/>\nwith my 9 year old.  He is very intense and sometimes his tone of<br/>\nvoice is very negative.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I told him he could earn it by<br/>\n&gt; helping to clean up around the yard but that it was his choice.  (And<br/>\n&gt; no, I don&#39;t have the money to just hand him everything he wants under<br/>\n&gt; the sun...I have to save when I want something that I don&#39;t need.  He<br/>\n&gt; has his needs completely taken care of.  His wants we have to work on<br/>\n&gt; budgeting for.)  <br/>\n<br/>\n </span></blockquote>Instead of giving him the one &quot;chore&quot; to earn money.  Maybe you could<br/>\nhave had a list of things to choose from or even asked him what he<br/>\nwould like to do.  In another scenario, if you have the money to give<br/>\nhim for yard work, why don&#39;t you you just let him have it?  Were you<br/>\ngoing to spend it somewhere else?  (I definitely could be wrong there,<br/>\nbut I don&#39;t see a problem with it letting a child have a few bucks if<br/>\nthey ask for it)<br/>\n<br/>\nAnyway, rather than me doing it all, I offered I<br/>\n<blockquote><span title=\"ireply\"> &gt; would pay him to help me.  He said &quot;No, I&#39;m not doing that because you<br/>\n&gt; will want it done your way and I don&#39;t want to put up with that.&quot;  <br/>\n<br/>\n </span></blockquote>I don&#39;t blame him.  If this is what he believes then its probably<br/>\nbecause it either IS that way or WAS that way.  I don&#39;t know how long<br/>\nyou have been unschooling, but he might need time to trust that he can<br/>\ndo something HIS way.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You are so mean that way.&quot;  And I don&#39;t think I was being mean at<br/>\n&gt;all.  I offered him the choice to help me in the yard or not that&#39;s<br/>\n&gt;his choice.  And it hurt my feelings.  So I said &quot;It hurts my<br/>\n&gt;feelings when you say I&#39;m mean when I&#39;m trying to help you find ways<br/>\n&gt;to get what you want.&quot;  <br/>\n<br/>\n </span></blockquote>Did it really hurt your feelings?  Or were you trying to make a point?<br/>\n As a parent, I know that many of things my children say I can&#39;t take<br/>\npersonally.  They are children and don&#39;t always have the tools to<br/>\nexpress their anger and frustration.  I would have left that alone. <br/>\nHe&#39;s is allowed to think your mean without you trying to change his<br/>\nmind.  That&#39;s his CHIOCE.<br/>\n<br/>\n<br/>\n So<br/>\n<blockquote><span title=\"ireply\"> &gt; I said &quot;Excuse me, I was speaking.  It&#39;s impolite to interrupt others<br/>\n&gt; when they are talking.  I listen when you speak, it&#39;s disrespectful to<br/>\n&gt; me to not offer me the same courtesy that I extend to you.&quot;  And<br/>\n&gt; that&#39;s when he freaked out.  Told me I shouldn&#39;t tell him he&#39;s being<br/>\n&gt; disrespectful because that makes him feel bad.<br/>\n<br/>\n </span></blockquote>It does.  I have an interrupter.  Big time!  I&#39;ve chosen not to say<br/>\nanything anymore.  I don&#39;t even know if I should.  I do know that when<br/>\nI let it go.  It wasn&#39;t a big deal anymore.  He&#39;s a kid.  Kids<br/>\ninterrupt.  I interrupt!  Someone told me it was a Northeast thing. <br/>\nwe all interrupt each other.  Ever been to Boston?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So what do I do?  If my husband talked to me that way I&#39;d have<br/>\n&gt; responded the same way.  If my mother did it I would have responded<br/>\n&gt; the same way.  <br/>\n<br/>\n </span></blockquote>Your mother and husband aren&#39;t allowed to form opinions about you<br/>\nunless you approve?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;So I don&#39;t think I  being heavy handed with him because he&#39;s a kid.  <br/>\n<br/>\n </span></blockquote>He thinks so.  And his opinion should be valuable to you.<br/>\n<br/>\n<br/>\n<br/>\nI made a pact with myself the other day.  It&#39;s February and we are<br/>\ngetting some cabin fever around here.  There&#39;s been some struggles.  I<br/>\ndecided, that I was going to TALK LESS and DO MORE.  It&#39;s really<br/>\nworking.  The more I point stuff out, the worse the struggles get.  If<br/>\nI just solve the problems, they see me using problem solving and learn<br/>\nthat way.  <br/>\n<br/>\nI REALLY hope this helps.  It sounds like you have a very intense 11<br/>\nyear old.  So do I!  (9)  I know how hard and frustrating it can be to<br/>\nstay in the now and parent that way you&#39;d like when the emotional<br/>\nresponse is so extreme.</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"11 is such a hard age","postDate":"1202392089","msgId":29379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMjA3MDU0OHc0YjBhZDM0Z2EzMDY2NjQzMzllODljMUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":29380,"prevInTime":29378,"nextInTime":29380,"topicId":29379,"numMessagesInTopic":0,"msgSnippet":"OK, this should be a quick and easy answer...maybe =) This morning I was talking to my 11 yr old son and he was mouthing off.  (We were discussing household","messageBody":"<div id=\"ygrps-yiv-708928145\">OK, this should be a quick and easy answer...maybe =)<br/>\n<br/>\nThis morning I was talking to my 11 yr old son and he was mouthing<br/>\noff.  (We were discussing household chores meaning what is done around<br/>\na house to keep it running smoothly.)  And he was saying he wanted<br/>\nsome extra money to buy something.  I told him he could earn it by<br/>\nhelping to clean up around the yard but that it was his choice.  (And<br/>\nno, I don&#39;t have the money to just hand him everything he wants under<br/>\nthe sun...I have to save when I want something that I don&#39;t need.  He<br/>\nhas his needs completely taken care of.  His wants we have to work on<br/>\nbudgeting for.)  Anyway, rather than me doing it all, I offered I<br/>\nwould pay him to help me.  He said &quot;No, I&#39;m not doing that because you<br/>\nwill want it done your way and I don&#39;t want to put up with that.&quot;  I<br/>\nsaid &quot;OK that&#39;s your choice.&quot;  Then he said &quot;You always do that, say<br/>\nwe have a choice when we don&#39;t.  If I don&#39;t help I can&#39;t earn extra<br/>\nmoney and so you say I have a choice when I don&#39;t.  You are so mean<br/>\nthat way.&quot;  And I don&#39;t think I was being mean at all.  I offered him<br/>\nthe choice to help me in the yard or not that&#39;s his choice.  And it<br/>\nhurt my feelings.  So I said &quot;It hurts my feelings when you say I&#39;m<br/>\nmean when I&#39;m trying to help you find ways to get what you want.&quot;  And<br/>\nthen he started to cry.  I asked him why he was crying and he said<br/>\n&quot;When you say I hurt your feelings that makes me sad because it means<br/>\nyou hate me.&quot;  OK that SO doesn&#39;t mean that.  I explained that it<br/>\ndoesn&#39;t mean I hate him at all but that I have feelings too, and they<br/>\nget hurt.  And that in his life he&#39;s going to meet people that are<br/>\nmore sensitive than others and that&#39;s just the way life is.  And in<br/>\nthe middle of me talking he butted in and started to talk over me.  So<br/>\nI said &quot;Excuse me, I was speaking.  It&#39;s impolite to interrupt others<br/>\nwhen they are talking.  I listen when you speak, it&#39;s disrespectful to<br/>\nme to not offer me the same courtesy that I extend to you.&quot;  And<br/>\nthat&#39;s when he freaked out.  Told me I shouldn&#39;t tell him he&#39;s being<br/>\ndisrespectful because that makes him feel bad.<br/>\n<br/>\nSo what do I do?  If my husband talked to me that way I&#39;d have<br/>\nresponded the same way.  If my mother did it I would have responded<br/>\nthe same way.  If a friend did it same thing.  So I don&#39;t think I was<br/>\nbeing heavy handed with him because he&#39;s a kid.  I have feelings too<br/>\njust like he does.  If I&#39;m trying to respect his feelings and his<br/>\nwants he should do the same with me and everyone else in the house<br/>\nyes?  And if I am wrong can someone offer a different script for this<br/>\nexchange?<br/>\n<br/>\nThank you.<br/>\nKaren</div>","specialLinks":[]}],"prevTopicId":29460,"nextTopicId":29573}}