{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: making home more fun / kids in school","postDate":"1259119613","msgId":42175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1NzRGNTA0NzQ4MTQ0REM4OTI5OTAxRTM4NkFBRDQ0QGJpZ3N1cnByaXNlPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":42174,"nextInTime":42176,"topicId":42175,"numMessagesInTopic":0,"msgSnippet":"*** I am trying to figure out how to support my children*** Help them in every way you can.  Do for them as much as they need.  Be sympathetic. ***I m having a","messageBody":"<div id=\"ygrps-yiv-2117055108\">*** I am trying to figure out how to support my children***<br/>\n<br/>\nHelp them in every way you can.  Do for them as much as they need.  Be sympathetic. <br/>\n<br/>\n***I&#39;m having a hard time dealing with it because they say they want to go, but<br/>\nthey don&#39;t want to do the things they need to do to get there (go to bed early<br/>\nand get themselves ready in the morning) ***<br/>\n<br/>\nThey need your help.  Help them find a routine at night, snuggle in with them and read them to sleep, whatever works.<br/>\nAnd help them get ready in the morning.  Be patient and sympathetic. <br/>\n<br/>\nBeing able to accept and do the hard work that gets us to the things we want comes with emotional maturity.  When we&#39;re kids we wish for things to happen easily or by magic somehow. But as we gain maturity we understand that some things require us to take action and while the action itself might not be our idea of great fun we can do it because it gets us where we want.  You&#39;re the grown up so you have to think like the grown up and help them.  <br/>\n<br/>\n*** I guess my question here is how to be a good unschooling parent to your children when their father<br/>\nhas chosen school for them? ***<br/>\n<br/>\nYou won&#39;t be an unschooling parent but you can still be a mindful parent.  Be thoughtful of their needs and wants.  Be generous and helpful and understanding.  <br/>\n<br/>\n***How do I balance being supportive without doing everything for them? ***<br/>\n<br/>\nThey don&#39;t want you to do everything for them.  They want to feel assured you&#39;ll help them as much as they need.  If you help only as much as you think they should need but are always backing off, worried that you&#39;re doing more than your fair share, their need will get more desperate until it feels to you like they want you to do everything.   No kid really wants his parents to do everything for him.  At least, not forever. &lt;g&gt;<br/>\n<br/>\nYou seem to be overly concerned with whether the situation is fair to you.  You&#39;re a mom now, you need to get over yourself.  If that means therapy or counseling,  do that.  Your kids should not have to wait for you to fix yourself and your problems.   It would benefit you to think about your life and your parenting in terms of choices instead of traps to be avoided.   It would be really good for your kids if you make the choices that help you be a more giving and involved mom.   <br/>\n<br/>\nWhatever it is you need,  it&#39;s not the responsibility of your children.   Find a way to stop being so resentful of the needs of your children.   One way to do that is to understand that you can take control of your emotions.  You don&#39;t have to make decisions based on your mood, you can make them by choosing the best of many options available to you.  What will be good for your kids, what will comfort them and help them feel loved and secure?  Do those things.    <br/>\n<br/>\n***if I was a parent that wanted my children in<br/>\nschool, I would dress them in the morning when they are too tired to get ready.<br/>\nI feel too resentful doing that under these circumstances.***<br/>\n<br/>\nAre you a parent who wants her kids to be loved and supported?  Then be loving and supportive!   The important thing is your relationship with your kids.  They deserve a good relationship with their mom whether they&#39;re in school or not.   If you refuse to help your kids as a way to punish your husband that&#39;s really unhealthy.    Talk with your husband about how you feel.  If you&#39;re angry at him, tell him about it.  Don&#39;t put it on your kids.   They need and deserve your help whether you are happy or sad.  Their need doesn&#39;t go away because you don&#39;t feel like meeting it.    <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42159,"nextTopicId":42148}}