{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Very End of Rope","postDate":"1288356903","msgId":45169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQzQjE3QTdGLTNEMTgtNEZBMS1BQzQzLTU4NEVBRjJGMzJFQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEFBTkxrVGlrSnFZcVlaN1dUN2ltQjlIXz10a2h6T08xOS1wSEFBcjc9UUNxdEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDcxMDcxMS43MTc0Ny5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+IDw4NDA2MzIuMTAzNjQucW1Ad2ViODYyMDQubWFpbC5pcmQueWFob28uY29tPiA8QUFOTGtUaWtKcVlxWVo3V1Q3aW1COUhfPXRraHpPTzE5LXBIQUFyNz1RQ3F0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":45168,"nextInTopic":0,"prevInTime":45168,"nextInTime":45170,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"... I would disagree. I think control and power over is innate. Though not all kids, because of their personalities, act on it. If our brains are seen from","messageBody":"<div id=\"ygrps-yiv-388370360\">On Oct 29, 2010, at 7:47 AM, Karen Swanay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Bullying is LEARNED behavior.<br/>\n<br/>\n<br/>\n </span></blockquote>I would disagree. I think control and &quot;power over&quot; is innate. Though  <br/>\nnot all kids, because of their personalities, act on it.<br/>\n<br/>\nIf our brains are seen from an evolutionary point of view, we built on  <br/>\nbrains that evolved to help us survive alone. Kill or be killed was  <br/>\nright and true.<br/>\n<br/>\nThose ancient brains are still there. They&#39;ve been overlaid with more  <br/>\nsocial brains where what&#39;s right and true is that working together is  <br/>\nbetter for survival. But those two right and trues are still both  <br/>\nthere in our heads. The social tends to override the selfish but  <br/>\nsocial solutions are way more complex. And *that* is what is learned  <br/>\nas moms help with solving problems, not that grabbing, hitting,  <br/>\n&quot;That&#39;s mine!&quot; instinct of the selfish brain.<br/>\n<br/>\nMy total guess is that conflict between the ancient-fishy-loner brain  <br/>\nand the overlaid social brain is where our idea of the internal  <br/>\nstruggle between good and evil has come from. It&#39;s in our biology. But  <br/>\nit isn&#39;t evil to be selfish, to fight for what we need. It&#39;s just, as  <br/>\nnow social creatures, it&#39;s not optimal.<br/>\n<br/>\nThe problem is that thinking only of ourselves is easy. It takes  <br/>\nlearned skills to meet our needs *and* not step on others toes. And  <br/>\nthat&#39;s where moms can step in to help kids with better solutions,  <br/>\nsolutions that meet the selfish brain&#39;s need *and* the social brain&#39;s  <br/>\nneed.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Very End of Rope","postDate":"1288356590","msgId":45168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyMDlENTU3MTg4NDQ5MUJBNDVGQTcwMkIxMDJEQjRGQENvbm5pZVBDPg==","inReplyToHeader":"PEFBTkxrVGlrSnFZcVlaN1dUN2ltQjlIXz10a2h6T08xOS1wSEFBcjc9UUNxdEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDcxMDcxMS43MTc0Ny5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+IDw4NDA2MzIuMTAzNjQucW1Ad2ViODYyMDQubWFpbC5pcmQueWFob28uY29tPiA8QUFOTGtUaWtKcVlxWVo3V1Q3aW1COUhfPXRraHpPTzE5LXBIQUFyNz1RQ3F0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":45161,"nextInTopic":45169,"prevInTime":45167,"nextInTime":45169,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"... Just wanted to pull this out because this has been one of the single most important things for me to remember on any given day. If my girls are hungry, no","messageBody":"<div id=\"ygrps-yiv-1264089478\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;And if it hasn&#39;t been mentioned...keep the little buggers fed!&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Just wanted to pull this out because this has been one of the single most important things for me to remember on any given day. If my girls are hungry, no amount of attention will make a difference. This applies to mom too. If mom is hungry, it is hard for mom to keep it together. Mom and kids should both be well fed through out the day. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Very End of Rope","postDate":"1288352848","msgId":45161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrSnFZcVlaN1dUN2ltQjlIXz10a2h6T08xOS1wSEFBcjc9UUNxdEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDg0MDYzMi4xMDM2NC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDcxMDcxMS43MTc0Ny5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+IDw4NDA2MzIuMTAzNjQucW1Ad2ViODYyMDQubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":45159,"nextInTopic":45168,"prevInTime":45160,"nextInTime":45162,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"Children are not dogs...and yet, humans have a way of exhibiting some of the same behaviors dogs do at times.  (I m an Operant Conditioning dog trainer)   Dogs","messageBody":"<div id=\"ygrps-yiv-1871915319\">Children are not dogs...and yet, humans have a way of exhibiting some of the<br/>\nsame behaviors dogs do at times.  (I&#39;m an Operant Conditioning dog<br/>\ntrainer)   Dogs and people very often operate under the rule of &quot;Negative<br/>\nattention is better than no attention.&quot;  Sounds like what your daughter is<br/>\ndoing.  I think Schuyler wrote an eloquent and perfect post so I&#39;m not going<br/>\nto go into a lot here.  But when I read your post I thought to myself &quot;That<br/>\nkid is BORED.&quot;  It may be that she is feeling unsettled in some way, and at<br/>\n4 she would have no tools to be able to identify what is amiss and she sets<br/>\non picking at her brother for entertainment and to get your attention.  She<br/>\nknows you will come soon enough.  And then she lashes out at you.  (Sounds<br/>\nlike she wants more mommy time.)  So head off the boredom.<br/>\n<br/>\nFWIW, my boys are 14 and 12.  They are exactly 23 months apart.  And they<br/>\nfought A LOT when they were younger.  Less so since we unschooled their<br/>\nlives.  Do remember that if you have conventionally parented or she spends<br/>\ntime anywhere bad for her development like Mommy Day Out programs,<br/>\npreschool, daycare etc...that she has seen and been subjected to &quot;I&#39;m bigger<br/>\nand I control the resources so you HAVE to do what I want.&quot;  Bullying is<br/>\nLEARNED behavior.  So keep that in mind when you deliver your &quot;punishments&quot;<br/>\nfor her behavior.  You are bigger and more powerful than she is and you can<br/>\nmake her do things.  She&#39;s bigger than her little brother, therefore she can<br/>\nmake him do things right?  Keep in mind she&#39;s 4 so the world revolves around<br/>\nher.  (I know many people make the mistake of thinking their dogs think like<br/>\nadult humans...and they do the same thing with their kids...at 4 she is<br/>\nincapable of thinking like a 40 yr old.)<br/>\n<br/>\nA lot of this life is about seeing life through the eyes of your child.  And<br/>\nyes...I&#39;ve had moments of staring at my screen screaming in my head at a<br/>\npost from someone with ONE kid/more than one but wide age gaps handing out<br/>\nadvice on how to have a peaceful home...it&#39;s SO different when you have two<br/>\nand they are close in age.  It ABSOLUTELY makes unschooling harder when your<br/>\nkids are in about the same place developmentally than it is on a parent who<br/>\nhas say one teen and one toddler.  But as Schuyler so eloquently pointed out<br/>\nit CAN be done.  It&#39;s just going to require more flexibility on your part<br/>\nand WAY more attention to the kids.<br/>\n<br/>\nAnd if it hasn&#39;t been mentioned...keep the little buggers fed!  Very often<br/>\nthey get cranky because they need some protein.  Monkey platters should be a<br/>\nstaple in your house while your kids are this age.  There is stuff on Monkey<br/>\nPlatters on Sandra&#39;s site...including my story about my son Liam and his<br/>\nfood issues.<br/>\n<br/>\nHTH,<br/>\nKaren<br/>\nFrom House, MD discussing parents of a child with Autism --<br/>\nDr Allison Cameron:Is it so wrong for them to want to have a normal child?<br/>\nIt&#39;s normal to want to be normal.<br/>\nHouse: Spoken like a true circle queen. See, skinny socially privileged<br/>\nwhite people get to draw this neat little circle, and everyone inside the<br/>\ncircle is normal, anyone outside the circle should be beaten, broken and<br/>\nreset so they can be brought into the circle. Failing that, they should be<br/>\ninstitutionalized or worse, pitied.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Very End of Rope","postDate":"1288347114","msgId":45159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0MDYzMi4xMDM2NC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDcxMDcxMS43MTc0Ny5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDcxMDcxMS43MTc0Ny5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":45156,"nextInTopic":45161,"prevInTime":45158,"nextInTime":45160,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"I wanted to add a couple of thoughts to my earlier post. First I meant to add more to the initial paragraph but forgot. If you can think of her as having to ","messageBody":"<div id=\"ygrps-yiv-1639652695\">I wanted to add a couple of thoughts to my earlier post. First I meant to add <br/>\nmore to the initial paragraph but forgot. If you can think of her as having to <br/>\ngive to another child, to the child who usurped her place of primacy, it may <br/>\nhelp you to be more generous towards her. She is sharing her home, her life, all <br/>\nof her things and joys and lows without having ever been consulted or paid off <br/>\nor having any kind of input, really. If you can maybe see her response to her <br/>\nbrother at least in some way as the response you might feel if your husband <br/>\nbrought home a second wife without consulting you first it may give you a bit <br/>\nmore empathy toward her. <br/>\n<br/>\nSecondly, one of the things that really helped me was Danielle Conger&#39;s article <br/>\non Mindful <br/>\nMothering. <a rel=\"nofollow\" target=\"_blank\" href=\"http://danielleconger.organiclearning.org/mindfulmothering.html.\">http://danielleconger.organiclearning.org/mindfulmothering.html.</a> <br/>\nWhenever I&#39;d feel myself turning from the moment with Simon and Linnaea and <br/>\nlooking for the next thing I had to do, I would grab my mind and turn it back <br/>\ntowards them. The more I was able to redirect my focus to them the less I felt a <br/>\nneed, a calling, a drive to get away. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\n<br/>\n<br/>\nPart of it may be a sense of betrayal. She was the only baby for 2 years and <br/>\nthen you had this other baby, you cheated on her. And now she has to live with <br/>\nthis baby who gets her love and her attention. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Very End of Rope","postDate":"1288342770","msgId":45156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxMDcxMS43MTc0Ny5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":45155,"nextInTopic":45159,"prevInTime":45155,"nextInTime":45157,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"Part of it may be a sense of betrayal. She was the only baby for 2 years and then you had this other baby, you cheated on her. And now she has to live with ","messageBody":"<div id=\"ygrps-yiv-2125210644\">Part of it may be a sense of betrayal. She was the only baby for 2 years and <br/>\nthen you had this other baby, you cheated on her. And now she has to live with <br/>\nthis baby who gets her love and her attention. <br/>\n<br/>\nLinnaea needed more attention than I knew how to give. Simon was very willing to <br/>\ngo along and to get along. It took really settling into the idea that Linnaea <br/>\nneeded me to sit and be with her. She really needed my attention. At 10 she <br/>\nstill does. She will have days where she wants me with her, doing with her, <br/>\nwatching with her, being with her very actively. Lots of conversations and <br/>\nactions and time. I had to learn, and still, sometimes I have to remember, what <br/>\nit was to be there for her, to be with her. Sometimes it was just sitting by her <br/>\nwhile she did something else. Sometimes it was being actively engaged with her <br/>\ndoing things. I can remember very clearly walking through town crying after <br/>\nLinnaea had been so upset, so hurt, so unhappy and I didn&#39;t know what to do. In <br/>\nthe end being with her more and more and more was all that it took. It&#39;s a lot. <br/>\nIt isn&#39;t an easy solution, but nothing else worked. No lecturing, no explaining <br/>\nagain why it wasn&#39;t fair for her to have all of my attention and how Simon <br/>\nneeded some too. It was being there for her all of the time that she needed me <br/>\nto be there for her. <br/>\n<br/>\nThere is an image that may help of filling up her tank. The more her meter is <br/>\nset on full the less likely she will move toward being grouchy and aggressive <br/>\nand mean spirited. She&#39;s little and the tank can go from fairly full to fairly <br/>\nempty pretty darn quickly. The more you give to her the more she will forgive <br/>\nyou in the moments when you can&#39;t. But it takes a lot of giving to get there. <br/>\nAnd the more her tank is kept above half full the bigger her tank will get. The <br/>\nless she will need of direct attention all the time. <br/>\n<br/>\nYou say they are happy out then in, suggests that boredom is a factor. Get more <br/>\nfun stuff to do in. Recognize that in requires more of your direct effort than <br/>\nout because you don&#39;t have the changing scenery to engage them. If there are <br/>\neasy places to go out, try and go there. Like McDonald&#39;s play areas or a park <br/>\ndown the road or the stream in a nearby woods, wherever you live look for a few <br/>\neasy places where you all can wander about. The grocery store, not for shopping, <br/>\nnecessarily, just for wandering and maybe getting a couple of interesting things <br/>\nto try. The mall for the little horse rides or pez dispensers or the toy store <br/>\nto sit in the aisle and explore all the ideas and things or the dollar store or <br/>\nthe pound shop depending on your currency, the 100 rupee store? If getting out <br/>\nis good, get out as much as you can. Go get a movie and wander around the video <br/>\nstore and touch all the dvd cases and look at all the cool pictures. There are <br/>\nsome new games that have hologram covers, so you can turn them and see movement <br/>\nin the image, find those and check them out, just to look at. And come home and <br/>\nsit together and watch a movie and build with blocks and have some pasta shapes <br/>\nwith butter and salt or pizza with whatever toppings they like or a lovely <br/>\nmonkey platter of choices and hang out together. Low key kinds of stuff, but <br/>\nconstant engagement from you. And when things feel like they are spiralling up <br/>\nand out, be calm and change the direction. Do timed races up and down the <br/>\nstairs. See how fast she can run to the bathroom and back. Hide some toys and <br/>\nmake treasure maps to find them. Freeze toys in ice blocks and run a bath for <br/>\nher and drop them in to watch them melt. Get a bottle of diet coke and mentos <br/>\nand make fountains in the garden, mix vinegar and baking soda in old beer bottle <br/>\nwith a little food colouring for a volcano eruption. Sit and watch ants, find <br/>\nsnails and feed them lettuce, get a few in a terrarium and see if your snails <br/>\nhave love darts, those are cool to find. Go on a bug hunt and see what cool bugs <br/>\nyou can see. Try and light a piece of paper on fire with a magnifying glass. <br/>\nBuild a fire and toast marshmallows. Have little new things tucked away that you <br/>\ncan bring out when you can feel tension rising and use them to distract away <br/>\nfrom that moment. <br/>\n<br/>\nIt&#39;s a lot of work being a parent. Once you get into the rhythm a bit more, once <br/>\nyou recognise the expectation of time being greater than you originally had <br/>\nplanned for, it somehow gets easier. Lower your expectations for free time, or <br/>\nat least a moment to yourself. Grab a breath mid-activity. When everyone is <br/>\nengaged, sit back and inhale deeply. It goes so fast, even while it feels like <br/>\nit takes forever. Enjoy every moment you can and some you didn&#39;t expect to. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n-----------------------------------------<br/>\n<br/>\n<br/>\nMy husband and I are tired and very concerned. The two of them torment each <br/>\nother much of the day. Lillian is most often the aggressor and I am feeling like <br/>\nwe are just raising an unhappy, angry and mean little girl. She is so full of <br/>\nempathy at times, so sensitive and bright, and also behaving in ways I don&#39;t <br/>\nunderstand. We TRY SO HARD to respond compassionately to her because we believe <br/>\nthat if someone hurts someone else intentionally, it&#39;s likely because they <br/>\nthemselves are hurting. But we sometimes snap and yell at her, or them.<br/>\n<br/>\nWhen we are out of the house it is much better but I simply do not have the <br/>\nenergy to be out of the house most of the day, everyday. It&#39;s so judgmental of <br/>\nme to label her behavior as mean but it indeed feels like she is so mean to <br/>\nOliver. She laughs when she hits him and he cries. She says &quot;Hahahaha&quot; when he <br/>\nis upset and taunts him. They actually seem to enjoy taunting each other  back <br/>\nand forth for awhile and when I feel like I can&#39;t hear it another second, I just <br/>\nin with something silly and ridiculous to lighten the mood and prevent it from <br/>\nending up with one of them in tears. <br/>\n<br/>\n<br/>\nWe look for the feeling underlying the &quot;symptom&quot; of violence toward her brother <br/>\nbut feel like we just don&#39;t have any more of ourselves to give. She says things <br/>\nlike &quot;You&#39;re stupid Oliver. I&#39;m going to throw you in the trash!&quot; and calls me <br/>\nstupid and bad and very much likes to slam doors (which I don&#39;t care for, <br/>\nreally, but feel like she needs the space sometimes). I&#39;m really, really sick of <br/>\nthe name-calling, the bickering and the violence. And I want to respond lovingly <br/>\nbut don&#39;t feel very loving when I feel verbally abused. <br/>\n<br/>\n<br/>\nI give her as much time alone with me as I can and it&#39;s delightful. It&#39;s when <br/>\nthe kids are together that I feel it falling apart and we all feel pretty <br/>\nmiserable.<br/>\n<br/>\nThoughts?<br/>\n<br/>\nThank you so much.<br/>\n<br/>\nClarissa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Very End of Rope","postDate":"1288334099","msgId":45155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2MTkwMzAyOTMyODRFMjk4QzNFOUI3MTQ2MEZFOEI4QENvbm5pZVBDPg==","inReplyToHeader":"PGlhYzNnbys4ZjZuQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhYzNnbys4ZjZuQGVHcm91cHMuY29tPg=="},"prevInTopic":45151,"nextInTopic":45156,"prevInTime":45154,"nextInTime":45156,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"From: clarissa Sent: Thursday, October 28, 2010 10:06 AM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics] Very End of Rope ... What kinds of","messageBody":"<div id=\"ygrps-yiv-1540441993\">From: clarissa <br/>\nSent: Thursday, October 28, 2010 10:06 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Very End of Rope<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;When we are out of the house it is much better but I simply do not have the energy to be out of the house most of the day, everyday.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>What kinds of things do you have at your house to make your house as cool and interesting as being out and about? I have four kids (20 months, 3.5, 6, 9) and going out all the time just doesn&#39;t work. What I have tried to do is make sure that there are lots of interesting and cool things to do at home. We have computers, DVD&#39;s, gaming systems, a playhouse, tons of toys, lots of art supplies, and a bunch of other stuff to keep things interesting and engaging. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;It&#39;s so judgmental of me to label her behavior as mean but it indeed feels like she is so mean to Oliver. She laughs when she hits him and he cries. She says &quot;Hahahaha&quot; when he is upset and taunts him.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Do they ever play together without any problems? If so, pay attention to the things that they like to do together and try to create more of those opportunities. With my girls, I know that when they start doing stuff like this, they need more of my attention. Sometimes, just being in the same room doing stuff in the middle of them can help prevent some of this. There are times that I pull out all of the tools that I know of and they still do stuff like this. When I sit back and analyze the situation, it is usually because they need attention. Sometimes, they need the attention of their sibling and being mean is the only way to get it. My 6 year old will do mean stuff to her big sister. When she got old enough to actually discuss it, she flat old told me that she was mean to her sister because she feels like her sister ignores her. She doesn&#39;t want my attention, she wants her sisters attention and the only way to get it is to be mean. I have tried to work with the girls to schedule times for them to play together to help eliminate my 6 year old&#39;s desire to play with her sister. Sometimes that will work but not always. A lot of times, what works is for me to start doing something and invite the girls to join me. Making cookies is something that all of my girls will participate in and enjoy. I give each of them a job to do. I hand them the ingredients and they put them in the bowl and stir it. Needless to say, we make lots of cookies. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; They actually seem to enjoy taunting each other back and forth for awhile and when I feel like I can&#39;t hear it another second, I just in with something silly and ridiculous to lighten the mood and prevent it from ending up with one of them in tears.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>They shouldn&#39;t have the opportunity to bicker back and forth for a while. I have found that it is best to be proactive. If I hear them taunting each other, I jump in. I don&#39;t usually give them much opportunity to settle it for themselves because I know that once the taunting begins, there isn&#39;t much chance of it ending nicely. I work from home so I am not always as good at being proactive. I try to do my work while they are playing separately because I know that they tend to do best when they are each doing their own thing. I try to keep an ear out for any of the initial signs of conflict. Some of them are when I hear my 6 year old tell her little sister to leave her toy alone. I listen for the tone of voice that they are using with each other. I know that when my 9 year old uses a certain tone with her sisters that I need to stop whatever it is that I am doing and go be with them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;We look for the feeling underlying the &quot;symptom&quot; of violence toward her brother but feel like we just don&#39;t have any more of ourselves to give. She says things like &quot;You&#39;re stupid Oliver. I&#39;m going to throw you in the trash!&quot; and calls me stupid and bad and very much likes to slam doors (which I don&#39;t care for, really, but feel like she needs the space sometimes). I&#39;m really, really sick of the name-calling, the bickering and the violence. And I want to respond lovingly but don&#39;t feel very loving when I feel verbally abused.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>We have had this happen in our house. Whenever things like this happen, I try to step back and look at my attitude and my behaviors. I find that the more frustrated I get, the less gentle and mindful I am. When I get this way, my kids do to. I am not saying that this is the case for you but it is something worth considering. <br/>\n<br/>\nYour kids are still really, really young so some of it could just be a matter of experimenting and some of it could be not having the tools to express frustration in a way that is acceptable to you. I know that when my girls learn a new word or concept, they will use it a lot. Slamming doors is kind of cool (the big bang and the wind it generates) and it really does get people&#39;s attention. Even though you are with your children, do you actually listen to what they are saying and doing? The only reason I ask this is because of a conversation that I had with my niece (not unschooled). She has been planning to attend an event for the last year. It is something that she has been talking about and planning for but her mom was rather surprised. In talking to her, she made this observation, &quot;Mom wants to be with me and do stuff with me but I don&#39;t feel like she ever really pays attention.&quot; It made me stop and think about whether or not I am truly paying attention to my girls or whether or not I am just going through the motions. <br/>\n<br/>\nYou mention that the older one needs alone time and space. Do you give her that space? Does she ever get to play by herself without anyone interfering? I know that my oldest likes to be with other people but she doesn&#39;t like for them to be up in her area. She is more mellow and likes to just be. When people invade her personal space, she tends to react. I try to protect her personal space and intervene when I see her sisters too close for her comfort. My 6 year old is just the opposite. When she wants to be with someone, she wants to be talking to them and be actively engaged. She wants to be moving, talking, and jumping, and in your face. It drives her big sister crazy, which will lead to her big sister getting frustrated and saying not-so-nice stuff. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Very End of Rope","postDate":"1288310747","msgId":45151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZDM0cityNHZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhYzNnbys4ZjZuQGVHcm91cHMuY29tPg=="},"prevInTopic":45145,"nextInTopic":45155,"prevInTime":45150,"nextInTime":45152,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"... ***************** Finding ways to redirect and lighten the mood is a good idea! Sometimes siblings quarrel because they (or one of them) need more","messageBody":"<div id=\"ygrps-yiv-253179391\">&quot;clarissa&quot; &lt;beasyouare@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;They actually seem to enjoy taunting each other  back and forth for awhile and when I feel like I can&#39;t hear it another second, I just in with something silly and ridiculous to lighten the mood<br/>\n </span></blockquote>*****************<br/>\n<br/>\nFinding ways to redirect and lighten the mood is a good idea!<br/>\n<br/>\n Sometimes siblings quarrel because they (or one of them) need more attention. Sometimes its boredom. Sometimes its little kids problem solving with next to no good skills. If they seem to be needing help problem solving then it can help to get involved - talk to each of them either while they&#39;re together or separate them to talk (that will depend on personalities). Don&#39;t pick sides, just ask each to tell you what&#39;s going on and offer ideas, suggestions. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s so judgmental of me to label her behavior as mean but it indeed feels like she is so mean to Oliver. She laughs when she hits him and he cries. She says &quot;Hahahaha&quot; when he is upset and taunts him.<br/>\n </span></blockquote>********************<br/>\n<br/>\nShe&#39;s little. However much empathy she may have at other times, when her own needs are too big, she can&#39;t access that at all. All she can see are her own needs. Maybe she needs more engagement, more entertainment, more things to do. Certainly she needs you to see her as an emotional person who isn&#39;t always capable of handling her feelings - they&#39;re bigger than her 4yo self right now!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Lillian is most often the aggressor<br/>\n<br/>\n </span></blockquote>One reason is that she&#39;s bigger, so force is an Effective means of problem solving. She doesn&#39;t have better tools yet - to some extent she Can&#39;t have better tools because better tools depend on being able to see the other&#39;s perspective and care about that person&#39;s feelings In The Moment. And in the moment some other need is too big for her to get around. <br/>\n<br/>\nSo spending more time with her is, again, the best help you can give - looking to see what her needs are so you can meet them proactively, which will give you more time to head off conflict before it gets to the hitting stage. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&gt;I feel verbally abused<br/>\n<br/>\n<br/>\n<br/>\n&gt; Hello again,<br/>\n&gt; <br/>\n&gt; I recently got really helpful feedback from Meredith and Schuyler about my 4.5 year old daughter and I&#39;m writing again; this time regarding my 2.5 year old son and his relationship with his sister.<br/>\n&gt; <br/>\n&gt; My husband and I are tired and very concerned. The two of them torment each other much of the day. Lillian is most often the aggressor and I am feeling like we are just raising an unhappy, angry and mean little girl. She is so full of empathy at times, so sensitive and bright, and also behaving in ways I don&#39;t understand. We TRY SO HARD to respond compassionately to her because we believe that if someone hurts someone else intentionally, it&#39;s likely because they themselves are hurting. But we sometimes snap and yell at her, or them.<br/>\n&gt; <br/>\n&gt; When we are out of the house it is much better but I simply do not have the energy to be out of the house most of the day, everyday. It&#39;s so judgmental of me to label her behavior as mean but it indeed feels like she is so mean to Oliver. She laughs when she hits him and he cries. She says &quot;Hahahaha&quot; when he is upset and taunts him. They actually seem to enjoy taunting each other  back and forth for awhile and when I feel like I can&#39;t hear it another second, I just in with something silly and ridiculous to lighten the mood and prevent it from ending up with one of them in tears. <br/>\n&gt; <br/>\n&gt; We look for the feeling underlying the &quot;symptom&quot; of violence toward her brother but feel like we just don&#39;t have any more of ourselves to give. She says things like &quot;You&#39;re stupid Oliver. I&#39;m going to throw you in the trash!&quot; and calls me stupid and bad and very much likes to slam doors (which I don&#39;t care for, really, but feel like she needs the space sometimes). I&#39;m really, really sick of the name-calling, the bickering and the violence. And I want to respond lovingly but don&#39;t feel very loving when I feel verbally abused. <br/>\n&gt; <br/>\n&gt; I give her as much time alone with me as I can and it&#39;s delightful. It&#39;s when the kids are together that I feel it falling apart and we all feel pretty miserable.<br/>\n&gt; <br/>\n&gt; Thoughts?<br/>\n&gt; <br/>\n&gt; Thank you so much.<br/>\n&gt; <br/>\n&gt; Clarissa<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":391672047,"authorName":"kim green","from":"kim green &lt;gardenerkim@...&gt;","profile":"kimgreen00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Very End of Rope","postDate":"1288291344","msgId":45145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltWE1SRjB4Z1ZrT0RuQnJSUis3RXY1YWprRlZIb1RyeFVkSDEzQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlhYzNnbys4ZjZuQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhYzNnbys4ZjZuQGVHcm91cHMuY29tPg=="},"prevInTopic":45133,"nextInTopic":45151,"prevInTime":45144,"nextInTime":45146,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"hi there, I mainly haunt the boards but i have a nine yr old son and a three year old daughter. We are still not truly unschooling but have loosened up","messageBody":"<div id=\"ygrps-yiv-1289253270\">hi there,<br/>\nI mainly haunt the boards but i have a nine yr old son and a three year old<br/>\ndaughter. We are still not truly unschooling but have loosened up extremely<br/>\nin our eclectic homeschooling and are dabbling in unschooling, kind of<br/>\ntouching the waters so to speak.<br/>\n    We have had a wonderful experience with homeopathic treatment.<br/>\n(Homeopathy has been around for a long time and in Europe doctors still<br/>\nactually prescribe homeopathic remedies. Doctors here have had no training<br/>\nin it. ) Our son had major issues with anger and than some with jealousy<br/>\nafter his sister arrived. We tried lots of things and i was at the end of my<br/>\nrope of what to do. I am kind of a holistic type person and try hard not to<br/>\nuse meds/ doctors etc...  and i was about to put him in play therapy and use<br/>\nmedicine to calm him down.  After we found the right remedy-- took two<br/>\nvisits and two different trials at different remedies he was so much better<br/>\ni could not believe the change !!  I could tell when he needed another dose-<br/>\nfor us it was about once a month.Now about every eight weeks or so more<br/>\noften if under lots of stress like holidays etc....<br/>\n   Anyway it changed our family for the better so i thought i would share.<br/>\nInsurance may cover it but probably not. The remedies are cheap like fifteen<br/>\ndollars for several months but the initial consult was a couple of hundred i<br/>\nbelieve. After that the visits are shorter and as needed.<br/>\n   It was like his personality changed in a good way ;) and we really did<br/>\nnot change the rest of our family dynamics much if at all.<br/>\n<br/>\nkim<br/>\n<br/>\nOn Thu, Oct 28, 2010 at 10:06 AM, clar<br/>\nissa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beasyouare@...\">beasyouare@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Hello again,<br/>\n&gt;<br/>\n&gt; I recently got really helpful feedback from Meredith and Schuyler about my<br/>\n&gt; 4.5 year old daughter and I&#39;m writing again; this time regarding my 2.5 year<br/>\n&gt; old son and his relationship with his sister.<br/>\n&gt;<br/>\n&gt; My husband and I are tired and very concerned. The two of them torment each<br/>\n&gt; other much of the day. Lillian is most often the aggressor and I am feeling<br/>\n&gt; like we are just raising an unhappy, angry and mean little girl. She is so<br/>\n&gt; full of empathy at times, so sensitive and bright, and also behaving in ways<br/>\n&gt; I don&#39;t understand. We TRY SO HARD to respond compassionately to her because<br/>\n&gt; we believe that if someone hurts someone else intentionally, it&#39;s likely<br/>\n&gt; because they themselves are hurting. But we sometimes snap and yell at her,<br/>\n&gt; or them.<br/>\n&gt;<br/>\n&gt; When we are out of the house it is much better but I simply do not have the<br/>\n&gt; energy to be out of the house most of the day, everyday. It&#39;s so judgmental<br/>\n&gt; of me to label her behavior as mean but it indeed feels like she is so mean<br/>\n&gt; to Oliver. She laughs when she hits him and he cries. She says &quot;Hahahaha&quot;<br/>\n&gt; when he is upset and taunts him. They actually seem to enjoy taunting each<br/>\n&gt; other back and forth for awhile and when I feel like I can&#39;t hear it another<br/>\n&gt; second, I just in with something silly and ridiculous to lighten the mood<br/>\n&gt; and prevent it from ending up with one of them in tears.<br/>\n&gt;<br/>\n&gt; We look for the feeling underlying the &quot;symptom&quot; of violence toward her<br/>\n&gt; brother but feel like we just don&#39;t have any more of ourselves to give. She<br/>\n&gt; says things like &quot;You&#39;re stupid Oliver. I&#39;m going to throw you in the<br/>\n&gt; trash!&quot; and calls me stupid and bad and very much likes to slam doors (which<br/>\n&gt; I don&#39;t care for, really, but feel like she needs the space sometimes). I&#39;m<br/>\n&gt; really, really sick of the name-calling, the bickering and the violence. And<br/>\n&gt; I want to respond lovingly but don&#39;t feel very loving when I feel verbally<br/>\n&gt; abused.<br/>\n&gt;<br/>\n&gt; I give her as much time alone with me as I can and it&#39;s delightful. It&#39;s<br/>\n&gt; when the kids are together that I feel it falling apart and we all feel<br/>\n&gt; pretty miserable.<br/>\n&gt;<br/>\n&gt; Thoughts?<br/>\n&gt;<br/>\n&gt; Thank you so much.<br/>\n&gt;<br/>\n&gt; Clarissa<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nEducation is not the filling of a pail but the lighting of a fire &quot;~ William<br/>\nButler Yeats~<br/>\n�I am always ready to learn, but I do not always like being taught.�<br/>\nby Winston Churchill<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215968352,"authorName":"clarissa","from":"&quot;clarissa&quot; &lt;beasyouare@...&gt;","profile":"soulstar78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Very End of Rope","postDate":"1288278360","msgId":45133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhYzNnbys4ZjZuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45145,"prevInTime":45132,"nextInTime":45134,"topicId":45133,"numMessagesInTopic":0,"msgSnippet":"Hello again, I recently got really helpful feedback from Meredith and Schuyler about my 4.5 year old daughter and I m writing again; this time regarding my 2.5","messageBody":"<div id=\"ygrps-yiv-511089666\">Hello again,<br/>\n<br/>\nI recently got really helpful feedback from Meredith and Schuyler about my 4.5 year old daughter and I&#39;m writing again; this time regarding my 2.5 year old son and his relationship with his sister.<br/>\n<br/>\nMy husband and I are tired and very concerned. The two of them torment each other much of the day. Lillian is most often the aggressor and I am feeling like we are just raising an unhappy, angry and mean little girl. She is so full of empathy at times, so sensitive and bright, and also behaving in ways I don&#39;t understand. We TRY SO HARD to respond compassionately to her because we believe that if someone hurts someone else intentionally, it&#39;s likely because they themselves are hurting. But we sometimes snap and yell at her, or them.<br/>\n<br/>\nWhen we are out of the house it is much better but I simply do not have the energy to be out of the house most of the day, everyday. It&#39;s so judgmental of me to label her behavior as mean but it indeed feels like she is so mean to Oliver. She laughs when she hits him and he cries. She says &quot;Hahahaha&quot; when he is upset and taunts him. They actually seem to enjoy taunting each other  back and forth for awhile and when I feel like I can&#39;t hear it another second, I just in with something silly and ridiculous to lighten the mood and prevent it from ending up with one of them in tears. <br/>\n<br/>\nWe look for the feeling underlying the &quot;symptom&quot; of violence toward her brother but feel like we just don&#39;t have any more of ourselves to give. She says things like &quot;You&#39;re stupid Oliver. I&#39;m going to throw you in the trash!&quot; and calls me stupid and bad and very much likes to slam doors (which I don&#39;t care for, really, but feel like she needs the space sometimes). I&#39;m really, really sick of the name-calling, the bickering and the violence. And I want to respond lovingly but don&#39;t feel very loving when I feel verbally abused. <br/>\n<br/>\nI give her as much time alone with me as I can and it&#39;s delightful. It&#39;s when the kids are together that I feel it falling apart and we all feel pretty miserable.<br/>\n<br/>\nThoughts?<br/>\n<br/>\nThank you so much.<br/>\n<br/>\nClarissa</div>","specialLinks":[]}],"prevTopicId":45081,"nextTopicId":45170}}