{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225390347","msgId":36881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDgxMDMwMTExMnA1NDVkYmFkZWo4OWFlYmFjNzQ5OTkxMTE0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDhDQjA4Q0M3M0IyN0REMS1GNEMtMTIxQFdFQk1BSUwtTUEwOC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4JIDw4Q0IwOENDNzNCMjdERDEtRjRDLTEyMUBXRUJNQUlMLU1BMDguc3lzb3BzLmFvbC5jb20+"},"prevInTopic":36857,"nextInTopic":0,"prevInTime":36880,"nextInTime":36882,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"... I had to respond to this.  I can t tell you how often I get the manipulative crap thrown at me.  My 2 yr old manipulates me into nursing, my 5 yr old was","messageBody":"<div id=\"ygrps-yiv-380284660\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt; In the example she chooses to highlight, she refers to a child as<br/>\n&gt; &quot;manipulative&quot; and she advises taking away a prized toy as punishment (but<br/>\n&gt; she uses the the common euphemism, &quot;consequence&quot;). I don&#39;t like the idea<br/>\n&gt; that my child is trying to be &quot;manipulative&quot; when he has so few tools to<br/>\n&gt; deal with his environment as it is. You&#39;d think an adult parent would have<br/>\n&gt; more tools than simply ignoring the child and taking away a special<br/>\n&gt; toy---talk about MANIPULATIVE!!!<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I had to respond to this.  I can&#39;t tell you how often I get the manipulative<br/>\ncrap thrown at me.  My 2 yr old &quot;manipulates&quot; me into nursing, my 5 yr old<br/>\nwas &quot;manipulating&quot; me when she had been at my mom&#39;s for a while, I came over<br/>\nand she wanted to snuggle with me rather than go put the puzzle together<br/>\nwith my niece and I was &quot;undermining&quot; my mother by going with her to put the<br/>\npuzzle together as a compromise.   It&#39;s gotten to the point that if anyone<br/>\nuses manipulate in the context of my children, I bark at them immediately.<br/>\nI should probably come up with a better response ;-)<br/>\n<br/>\nBut if we really think about it, it is a child&#39;s job to &quot;manipulate&quot; their<br/>\nparents.  I just choose to find a way of expressing it that is less negative<br/>\nin its connotation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; A &quot;tantrum&quot; is a form of communication. If the parent has been so oblivious<br/>\n&gt; to the child&#39;s attempt to communicate that the child must resort to<br/>\n&gt; &quot;tantrumming&quot;, whose fault is THAT?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Well, I&#39;m not totally sure about this.  Ime, toddlers can tantrum despite a<br/>\nparent&#39;s attempts to anticipate them.  In that sense, I really liked the<br/>\ndistinction between the &quot;types&quot; of tantrums.  And I have to say, for<br/>\nwhatever reason, my kids have never responded to affection during tantrums.<br/>\nIf I&#39;m being totally honest, letting them cool down in another room ended up<br/>\nbeing better for all.  It was awful to see him so upset and I desperately<br/>\nwanted him to stop hurting (and yes, it is/was very stressful for me as<br/>\nwell).  Not to be dramatic, but he didn&#39;t have to suffer as long that way.<br/>\n<br/>\nI&#39;ve been able to observe better with my third child, and am amazed that he<br/>\nseems totally aware (on some level) that he is being &quot;irrational&quot; when he is<br/>\nhaving tantrums.  We will ask him &quot;are you a toddler&quot; Ryan? or &quot;how old are<br/>\nyou, 2&quot;?  and it could be me, but it seems to help him understand that the<br/>\ntantrums are tough but are normal, if that makes sense.  These things are<br/>\nsaid very gently by the way, as I know you can&#39;t read that via email and<br/>\nthose same words could be said very cruelly.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Rue&#39;s book paints a much better picture of how I would want my relationship<br/>\n&gt; with my children to look. I would pay BIG bucks to keep Rue Kream&#39;s book in<br/>\n&gt; print.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I really want to read this.  I might do that instead of trying to read off<br/>\nfrom websites.<br/>\n<br/>\nThanks!!!  I&#39;m getting a lot from these discussions.<br/>\n<br/>\nChristie<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; _,___<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225388305","msgId":36857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjA4Q0Q3MjQwQjlDOS1GNEMtMUFCQFdFQk1BSUwtTUEwOC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGdlYThkdisyYmhvQGVHcm91cHMuY29tPg=="},"prevInTopic":36856,"nextInTopic":36881,"prevInTime":36856,"nextInTime":36858,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"Parenting a Fee Child, An Unschooled Life by Rue Kream (there s even a picture of her cute little butt on the cover!) Available","messageBody":"<div id=\"ygrps-yiv-705059319\">Parenting a Fee Child, An Unschooled Life by Rue Kream (there&#39;s even a picture of her cute little butt on the cover!)<br/>\n<br/>\n<br/>\n<br/>\nAvailable from <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechild.info/\">http://www.freechild.info/</a>  for only $14 plus shipping. Worth its weight in gold! A real BARGAIN! A *must-have* for every unschooling home!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nA few reviews:<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWith a loving heart, generous openness, and the absolute conviction born of experience and observation, Rue is offering both practical suggestions and a paradigm stretching point of view to anyone seeking a greater understanding of a daily life of Unschooling with joy. I personally can’t think of a single question that is not covered somewhere. The format is easy to read, full of warm anecdotes, challenging ideas, and the core idea that the heart of Unschooling is parenting with absolute Trust. ~Robyn L. Coburn, unschooling mom of Jayn<br/>\n<br/>\n <br/>\n<br/>\n“It&#39;s simple, but not easy.”   Without even leaving home, your life can change all kinds of ways.  Relationships between parents and children can go from rough and antagonistic to peaceful, productive and sweet.   It&#39;s not easy, changing one&#39;s life for the better, but this book shows that it&#39;s simple.  ~Sandra Dodd, unschooling mom of Kirby, Marty and Holly<br/>\n<br/>\n <br/>\n<br/>\nI can imagine that some might think that such a life with children is just too good to be true. But I know from my own experience that it is possible! Take her advice to heart!  ~Kelly Lovejoy, unschooling mom of Cameron and Duncan<br/>\n<br/>\n <br/>\n<br/>\nThe most useful book published for new unschoolers since The Unschooling Handbook.  Rue addresses clearly and persuasively the most common questions and objections in an easily accessible format. The personal experience and conviction brought to each answer shines through along with her deep love and respect for her children. I&#39;d recommend this book to anyone embarking on an unschooling lifestyle or wondering how to counter objections from family or friends.  ~Danielle Conger, unschooling mom of Emily, Julia, and Sam<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Erin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:theburkemommy@...\">theburkemommy@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m incredibly new to RU, but I felt the same way, Karen.  The idea of <br/>\nputting them in another room and ignoring them just seems so <br/>\ndisconnected and unaccepting of their feelings!<br/>\n<br/>\nWhat is the book by Rue you are referring to?  We seriously just <br/>\nstarted learning about RU about a month ago, so I&#39;m trying to get my <br/>\nhands on everything I can!!!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225387880","msgId":36856,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjA4Q0M3M0IyN0REMS1GNEMtMTIxQFdFQk1BSUwtTUEwOC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4=","referencesHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4="},"prevInTopic":36853,"nextInTopic":36857,"prevInTime":36855,"nextInTime":36857,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"I do not own Ms. Drew s book, but I have flipped through it. Although it may be a step in the right direction for mainstream, traditional parents, it has LOTS","messageBody":"<div id=\"ygrps-yiv-629260363\">I do not own Ms. Drew&#39;s book, but I have flipped through it.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAlthough it may be a step in the right direction for mainstream, traditional parents, it has LOTS of bad advice from an unschooling/peaceful/mindful/gentle parenting point of view. I wouldn&#39;t recommend it to parents who are looking to actually BE peaceful parents.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIn the example she chooses to highlight, she refers to a child as &quot;manipulative&quot; and she advises taking away a prized toy as punishment (but she uses the the common euphemism, &quot;consequence&quot;). I don&#39;t like the idea that my child is trying to be &quot;manipulative&quot; when he has so few tools to deal with his environment as it is. You&#39;d think an adult parent would have more tools than simply ignoring the child and taking away a special toy---talk about MANIPULATIVE!!!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nA &quot;tantrum&quot; is a form of communication. If the parent has been so oblivious to the child&#39;s attempt to communicate that the child must resort to &quot;tantrumming&quot;, whose fault is THAT?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nRue&#39;s book paints a much better picture of how I would want my relationship with my children to look. I would pay BIG bucks to keep Rue Kream&#39;s book in print.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly Lovejoy<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Kelly &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kelly@...\">kelly@...</a>&gt;<br/>\n<br/>\nSorry for the cross-post. I want to make sure this gets out to all my lists.<br/>\nI think many of you know this book, and have benefitted from it. I&#39;d love to<br/>\nsee it remain available for future parents/children. It would be a shame for<br/>\nit to go out of print.<br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:compostgal@...\">compostgal@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:compostgal@...\">compostgal@...</a>] <br/>\nSent: Tuesday, October 28, 2008 1:09 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:win47win@...\">win47win@...</a>; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertwsimpson@...\">robertwsimpson@...</a>; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kerrymbutch@...\">kerrymbutch@...</a>;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kelly@...\">Kelly@...</a>; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kenschaft@...\">kenschaft@...</a><br/>\nSubject: Re: Peaceful Parents Newsletter from Naomi Drew<br/>\n<br/>\n <br/>\n<br/>\nThis is a fine effort from a fine local person.<br/>\nTrina<br/>\n<br/>\n<br/>\n---- Original Message ----<br/>\nFrom: Naomi Drew &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:win47win@...\">win47win@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:compostgal@...\">compostgal@...</a><br/>\nSent: Tue, 28 Oct 2008 5:00 pm<br/>\nSubject: Peaceful Parents Newsletter from Naomi Drew<br/>\n<br/>\nPEACEFUL PARENTS <br/>\n <br/>\na free e-newsletter from Naomi Drew, author of <br/>\n&quot;Peaceful Parents, Peaceful Kids&quot; <br/>\n                          <br/>\nPlease pass this newsletter on to anyone for whom it can make a <br/>\ndifference.You can e-mail Naomi directly at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Naomi@...\">Naomi@...</a> <br/>\n <br/>\n(To subscribe or unsubscribe please scroll to end) <br/>\n <br/>\nPEACEFUL PARENTS, PEACEFUL KIDS <br/>\n <br/>\nDear Friends, <br/>\nI know that many of you have read and loved &quot;Peaceful Parents, <br/>\nPeaceful Kids.&quot; Nothing makes me happier than knowing this book has <br/>\nhelped so many people navigate their way through parenthood. A mom who <br/>\nattended my workshop in Florida last week told me this was the most <br/>\nlife-changing parenting book she had ever read. <br/>\n <br/>\nWell, I just learned &quot;Peaceful Parents, Peaceful Kids,&quot; is in danger <br/>\nof going out of print. Its publisher, Kensington Books, said that <br/>\nunless sales improve, &quot;Peaceful Parents, Peaceful Kids&quot; will be put to <br/>\nbed forever.  This can&#39;t happen. So many workshops are scheduled <br/>\naround the content in &quot;Peaceful Parents, Peaceful Kids&quot; and so many <br/>\nparents are still waiting to read it. <br/>\n <br/>\nPlease consider giving &quot;Peaceful Parents, Peaceful Kids&quot; as a gift, <br/>\nor donating a copy to your local school, parent group, or religious <br/>\neducation program.  The recipient will be grateful, as have been the <br/>\nmany parents who have benefited from this book since it&#39;s birth in <br/>\n2000. I hope that with your help, &quot;Peaceful Parents, Peaceful Kids&quot; <br/>\nwill make it to its tenth birthday and beyond. <br/>\n <br/>\n&quot;Peaceful Parents, Peaceful Kids&quot; is available at Amazon.com for only <br/>\n$11.20. Here is the exact link. <br/>\n <br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Peaceful-Parents-Kids-Practical-Create/dp/1575666081/r\">http://www.amazon.com/Peaceful-Parents-Kids-Practical-Create/dp/1575666081/r</a><br/>\nef=sr_1_1?ie=UTF8&s=books&qid=1224707879&sr=1-1 <br/>\n <br/>\n <br/>\nBelow is an adapted excerpt from &quot;Peaceful Parents, Peaceful Kids&quot; on <br/>\ntantrums that I know many of you will find helpful. As my way of <br/>\nsaying thanks to anyone who buys the book, I want to send you a signed <br/>\nbook plate for the inside cover. E-mail me at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Naomi@...\">Naomi@...</a> <br/>\nfor details. <br/>\n <br/>\nThank you, as always for your support.  You generously responded when <br/>\nI asked for people to participate in my national survey of <br/>\nelementary-aged kids on conflict, anger, and bullying.  As a result <br/>\nover 2100 students and hundreds of teachers took part.  As soon as I <br/>\nget the go-ahead from Free Spirit Publishing, I will share with you <br/>\nthe complete results.  However, as loyal readers, I&#39;d like you to know <br/>\nthe one result that most stood out for me: <br/>\n <br/>\n73% percent of the students surveyed think other kids are somewhat to <br/>\nvery mean to each other. <br/>\n <br/>\nThis is why the work of peacemaking has to continue in our homes, <br/>\nschool, communities, and in the world at large.  I am so grateful you <br/>\nare all a part of it. <br/>\n <br/>\nIn peace, Naomi <br/>\n <br/>\n <br/>\n <br/>\n****************************************************************************<br/>\n****** <br/>\n <br/>\nFROM &quot;PEACEFUL PARENTS, PEACEFUL KIDS:&quot; <br/>\nDEALING WITH TANTRUMS <br/>\n <br/>\nWhat parent doesn&#39;t dread tantrums?  Well, here&#39;s some good news <br/>\n--you can alleviate much of the chaos brought on by tantrums by <br/>\nidentifying what kind tantrum you child is having: manipulative or <br/>\nspill-over. <br/>\n <br/>\nA manipulative tantrum is the kind kids use to get their way. These <br/>\ntantrums often take place when your child wants something and you say <br/>\nno. Your child then throws a fit to force you to change your mind.  A <br/>\nspill-over tantrum is an entirely different thing.  Spill-over <br/>\ntantrums happen when a child becomes overwhelmed by feelings, senses, <br/>\nand stimuli. These tantrums are unintentional. They usually happen <br/>\nwhen kids are over-tired or hungry.  Children who are highly <br/>\nemotional, ultra-sensitive, and easily over-stimulated tend to have <br/>\nspill-over tantrums. <br/>\n <br/>\nBoth types of tantrums need to be handled differently. <br/>\n <br/>\nThe first step is to determine which type of tantrum your child is <br/>\nhaving. If she&#39;s yelling and screaming because you won&#39;t let her have <br/>\nice cream, it&#39;s probably a manipulative tantrum. Best to ignore it. <br/>\nWalk into another room and let her emote without the benefit of an <br/>\naudience. If you&#39;re out, take your child to the car and let her scream <br/>\nthere. Most importantly, don&#39;t give in or you&#39;ll just encourage <br/>\nanother tantrum next time she wants her way. After the tantrum&#39;s over, <br/>\nexplain, in no uncertain terms, that her behavior was unacceptable, <br/>\nthen give a consequence like taking away a special toy for at least a <br/>\nday, or removing a privilege. <br/>\n <br/>\nTell your child that you expect better of her and that you were <br/>\ndisappointed in her behavior.  Use a no-nonsense non-yelling voice and <br/>\nmake direct eye contact. Remember, you&#39;re the model for your child&#39;s <br/>\nbehavior. One more caveat. If you say you&#39;re going to take away a toy <br/>\nif your child throws another tantrum, be sure to do it. Backing off <br/>\nwill only reinforce manipulation. <br/>\n <br/>\nSpill-over tantrums are entirely different. Your child may be caught <br/>\nin the pattern of feeling overwhelmed and losing control without <br/>\nwanting to. Let&#39;s say it&#39;s been a stressful week and he&#39;s has had a <br/>\nlong and over-stimulating day. It&#39;s past his bedtime, and as he walks <br/>\ntoward his bed he accidentally knocks over a Lego airplane he just <br/>\nmade. He starts wailing uncontrollably and before long, he&#39;s <br/>\ncompletely out of control. This is a spill-over tantrum. Here are a <br/>\nfew suggestions for handling it: <br/>\n <br/>\n- Try to rectify the source of the problem if at all possible. In <br/>\nthis case, helping him put together his broken airplane might do the <br/>\ntrick <br/>\n. <br/>\n- Stay close by. Let your presence be a calming influence. Sometimes <br/>\nleaving the room will add to your child&#39;s upset, so take some deep <br/>\nbreaths and try to keep your own composure. <br/>\n <br/>\n- Touch your child gently if he allows it. Try hugging or stroking <br/>\nhim. Let him put his head in your lap or lean against you; whisper <br/>\nsoothing words to him like, &quot;Mommy&#39;s right here. You&#39;re going to be <br/>\nOK.&quot; Try to remain calm even if he keeps wailing. <br/>\n <br/>\n- Ask him to stop after about five minutes. Have him take a series of <br/>\nslow, deep breaths to regain his composure. Breathe together if you <br/>\ncan. Offering a distraction might help too. &quot;Let&#39;s go downstairs and <br/>\nget a nice cool drink.&quot; <br/>\n <br/>\n- Don&#39;t allow your child to do anything destructive during his <br/>\ntantrum, no matter how upset he is. Make sure he knows ahead of time <br/>\nwhat&#39;s acceptable and what isn&#39;t. Hurting himself, others, or property <br/>\nare not okay. <br/>\n <br/>\nTalk afterwards and help your child identify the feelings that <br/>\nbrought on his tantrum. Together come up with a  plan for next time. <br/>\nAsk him to let you know when he&#39;s feeling overtired or in need of a <br/>\nbreak. Be aware of situations that could trigger him. <br/>\n <br/>\nIf you do all this and the spill-over tantrums continue, try keeping <br/>\na journal and noting what tends to set your child off. Most of all, <br/>\ndon&#39;t lose hope.  This is probably a stage that will end as quickly as <br/>\nit came on.  We&#39;ve all been there. <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n****************************************************************************<br/>\n**************** <br/>\n <br/>\nWORKSHOPS AVAILABLE TO YOUR SCHOOL OR COMMUNITY  <br/>\n <br/>\nSchedule a workshop or keynote for your school, parent group, <br/>\nworkplace, or place of worship while there&#39;s still time. E-mail <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Naomi@...\">Naomi@...</a>. The following topics are currently available: <br/>\n <br/>\n- The Power of Kindness (NEW!!) <br/>\n- Resolving Conflicts and Managing Anger <br/>\n- Bully-proofing Your School <br/>\n- Helping Kids Deal with Bullying <br/>\n- Peaceful Parent, Peaceful Kids <br/>\n- Creating Peaceful Schools <br/>\n- Conflict Resolution for Educators <br/>\n- New Teacher Training <br/>\n- Fostering Acceptance of Diversity <br/>\n- Talking to Teens About the Tough Issues <br/>\n- Building Resilience in Children <br/>\n- Helping Middle Schoolers Handle Conflict <br/>\n- Building Good Character in Children <br/>\n- Fostering Good Listening in Children <br/>\n- Strategies for De-Stressing and Calming <br/>\n- Raising Compassionate Kids <br/>\n- Helping Kids with ADD <br/>\n <br/>\n****************************************************************************<br/>\n**************** <br/>\n <br/>\nNaomi Drew is a registered provider with the New Jersey State <br/>\nDepartment of Education and the NJ Character Education Network.  She <br/>\nis the author of six books, all available through LearningPeace.com <br/>\nand Amazon.com. <br/>\n <br/>\nPeaceful Parents, Peaceful Kids (Kensington Publishers) <br/>\nLearning the Skills of Peacemaking (Pro-Ed Inc.) <br/>\nThe Peaceful Classroom in Action (Personhood Press) <br/>\nHope and Healing: Peaceful Parenting in an Uncertain World  <br/>\n(Kensington Publishers) <br/>\nThe Kids Guide to Working Out Conflicts: How to Stay Calm, Cool, and <br/>\nSafe,  (Free Spirit Publishing)  <br/>\nA Leaders&#39; Guide to The Kids Guide to Working Out Conflicts (Free <br/>\nSpirit Pubishing) <br/>\n     <br/>\nTO ORDER go to www.LEARNINGPEACE.com <br/>\n <br/>\nPeaceful Parents is a free monthly service. Please share this <br/>\nnewsletter.  Feel free to download and circulate.  <br/>\n <br/>\nCopyright Naomi Drew, October, 2008 All Rights Reserved.  <br/>\nThis content may be forwarded in full, with <br/>\ncopyright/contact/creation information intact,without specific <br/>\npermission, when used only in a not-for-profit format.  If any other <br/>\nuse is desired, permission in writing from the author is required. <br/>\n <br/>\n              Love and Peace to All of You. <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\nTo subscribe to this list, browse to: <br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://casts.webvalence.com/listmgr/subscribe?lists=PeacefulParentsNewslette\">http://casts.webvalence.com/listmgr/subscribe?lists=PeacefulParentsNewslette</a><br/>\nr <br/>\n <br/>\nTo cancel, browse to: <br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://casts.webvalence.com/listmgr/cancel?lists=PeacefulParentsNewsletter\">http://casts.webvalence.com/listmgr/cancel?lists=PeacefulParentsNewsletter</a> <br/>\n <br/>\n <br/>\n <br/>\nNaomi Drew <br/>\nc/o Free Spirit Pub. <br/>\n217 Fifth. No., Suite 200 <br/>\nMinneapolis, MN 55401-1299 <br/>\n <br/>\n <br/>\n  _____  <br/>\n<br/>\nsize=2 width=&quot;100%&quot; align=center&gt; <br/>\n<br/>\nPlay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gamevault.ca/?icid=AOLGAM00310000000001\">http://www.gamevault.ca/?icid=AOLGAM00310000000001</a>&gt;  free online games<br/>\nat Gamevault.ca. Word, arcade, puzzle and more. Play now!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235225792,"authorName":"Kelly","from":"&quot;Kelly&quot; &lt;kelly@...&gt;","profile":"dogsheeptiger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225380960","msgId":36853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzOUNCREM4Mzg4ODREOTlCNzdCMzc5OTI1OUZDQzgxQGtlbGx5ZGVzaz4="},"prevInTopic":36851,"nextInTopic":36856,"prevInTime":36852,"nextInTime":36854,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"Yes, there s some stuff in here I wouldn t advocate, but there s also some excellent ideas that are truly respectful. I m thinking that if someone makes it as","messageBody":"<div id=\"ygrps-yiv-1734718136\">Yes, there&#39;s some stuff in here I wouldn&#39;t advocate, but there&#39;s also some<br/>\nexcellent ideas that are truly respectful. I&#39;m thinking that if someone<br/>\nmakes it as far as unschooling in the first place, they&#39;re thinking outside<br/>\nthe box enough to separate the good from the bad. It&#39;s more of a stepping<br/>\nstone book than one I would consider a foundational book. But I happen to<br/>\nknow a lot of parents who read about respectful parenting in this book first<br/>\n(I think it&#39;s the title that catches people&#39;s eye) and have really soared<br/>\ninto this as a way of life. I hesitated when they chose that excerpt to<br/>\nhighlight, but I consider the readers on the groups I&#39;m on to be a smart<br/>\nbunch of people :-)<br/>\n<br/>\n <br/>\n<br/>\nKelly<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225347461","msgId":36851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVEQzk4Q0VFLTZFRTMtNDBFRS04NDJBLTA0NzRENkQ2OEE2RkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGdlYThkdisyYmhvQGVHcm91cHMuY29tPg==","referencesHeader":"PGdlYThkdisyYmhvQGVHcm91cHMuY29tPg=="},"prevInTopic":36844,"nextInTopic":36853,"prevInTime":36850,"nextInTime":36852,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"Hi, Erin, I m not Karen, but here s the link to Rue s book Parenting a Free Child - An Unschooled Life : http://www.freechild.info/ Check out these sites,","messageBody":"<div id=\"ygrps-yiv-1542394802\">Hi, Erin,<br/>\n<br/>\nI&#39;m not Karen, but here&#39;s the link to Rue&#39;s book &quot;Parenting a Free  <br/>\nChild - An Unschooled Life&quot;:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechild.info/\">http://www.freechild.info/</a><br/>\n<br/>\nCheck out these sites, also, if you haven&#39;t already:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 29, 2008, at 11:01 AM, Erin wrote:<br/>\n<br/>\n&gt; I&#39;m incredibly new to RU, but I felt the same way, Karen.  The idea of<br/>\n&gt; putting them in another room and ignoring them just seems so<br/>\n&gt; disconnected and unaccepting of their feelings!<br/>\n&gt;<br/>\n&gt; What is the book by Rue you are referring to?  We seriously just<br/>\n&gt; started learning about RU about a month ago, so I&#39;m trying to get my<br/>\n&gt; hands on everything I can!!!<br/>\n&gt;<br/>\n&gt; Erin<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225309343","msgId":36835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBQkE1QUNDLTRFM0MtNEIxRi1CQjYxLTVGNEE4QTdGQzhCMkBtYWMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgxMDI5MTAyOW4yMmRhMjIyN29mY2MxNDI1ZTYwMjY1MWVlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4gPDY4RTI1NDY1LUYzODItNEFDOC05N0M5LTI4MERCRjA3MjI0M0B2ZXJpem9uLm5ldD4gPDY3YTlkNzUwMDgxMDI5MTAyOW4yMmRhMjIyN29mY2MxNDI1ZTYwMjY1MWVlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":36833,"nextInTopic":36844,"prevInTime":36834,"nextInTime":36836,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"Just because someone posted something here, don t assume it is from a radical unschooling point of view - check it out for yourself (as you did, Karen). -pam","messageBody":"<div id=\"ygrps-yiv-1732260866\">Just because someone posted something here, don&#39;t assume it is from a  <br/>\nradical unschooling point of view - check it out for yourself (as you  <br/>\ndid, Karen).<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 29, 2008, at 10:29 AM, Karen Swanay wrote:<br/>\n<br/>\n&gt; Can anyone offer insight? </span></blockquote></div>","specialLinks":[]},{"userId":334729351,"authorName":"Erin","from":"&quot;Erin&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225303295","msgId":36844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlYThkdisyYmhvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDgxMDI5MTAyOW4yMmRhMjIyN29mY2MxNDI1ZTYwMjY1MWVlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":36835,"nextInTopic":36851,"prevInTime":36843,"nextInTime":36845,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"I m incredibly new to RU, but I felt the same way, Karen.  The idea of putting them in another room and ignoring them just seems so disconnected and","messageBody":"<div id=\"ygrps-yiv-2018426993\">I&#39;m incredibly new to RU, but I felt the same way, Karen.  The idea of <br/>\nputting them in another room and ignoring them just seems so <br/>\ndisconnected and unaccepting of their feelings!<br/>\n<br/>\nWhat is the book by Rue you are referring to?  We seriously just <br/>\nstarted learning about RU about a month ago, so I&#39;m trying to get my <br/>\nhands on everything I can!!!<br/>\n<br/>\nErin</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225301370","msgId":36833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgxMDI5MTAyOW4yMmRhMjIyN29mY2MxNDI1ZTYwMjY1MWVlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY4RTI1NDY1LUYzODItNEFDOC05N0M5LTI4MERCRjA3MjI0M0B2ZXJpem9uLm5ldD4=","referencesHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4JIDw2OEUyNTQ2NS1GMzgyLTRBQzgtOTdDOS0yODBEQkYwNzIyNDNAdmVyaXpvbi5uZXQ+"},"prevInTopic":36832,"nextInTopic":36835,"prevInTime":36832,"nextInTime":36834,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"I m surprised to see this book offered here...I had not read it, was interested in it and then in the excerpt I see this... ","messageBody":"<div id=\"ygrps-yiv-1880236882\">I&#39;m surprised to see this book offered here...I had not read it, was<br/>\ninterested in it and then in the excerpt I see this...<br/>\n<br/>\n&lt;&lt;The first step is to determine which type of tantrum your child is<br/>\nhaving. If she&#39;s yelling and screaming because you won&#39;t let her have<br/>\nice cream, it&#39;s probably a manipulative tantrum. Best to ignore it.<br/>\nWalk into another room and let her emote without the benefit of an<br/>\naudience. If you&#39;re out, take your child to the car and let her scream<br/>\nthere. Most importantly, don&#39;t give in or you&#39;ll just encourage<br/>\nanother tantrum next time she wants her way. After the tantrum&#39;s over,<br/>\nexplain, in no uncertain terms, that her behavior was unacceptable,<br/>\nthen give a consequence like taking away a special toy for at least a<br/>\nday, or removing a privilege.<br/>\n<br/>\nTell your child that you expect better of her and that you were<br/>\ndisappointed in her behavior. Use a no-nonsense non-yelling voice and<br/>\nmake direct eye contact. Remember, you&#39;re the model for your child&#39;s<br/>\nbehavior. One more caveat. If you say you&#39;re going to take away a toy<br/>\nif your child throws another tantrum, be sure to do it. Backing off<br/>\nwill only reinforce manipulation. &gt;&gt;<br/>\n<br/>\nSurely this is the antithesis of RU no?  Is the rest of the book RU or<br/>\nis it strewn with advice like this?  I have a friend who is interested<br/>\nin this life and her kids really need her to relax...I am going to<br/>\ngive her Rue&#39;s book and I thought about giving this one as well but<br/>\nthis is exactly the kind of thing she doesn&#39;t need reinforced as OK.<br/>\n<br/>\nCan anyone offer insight?<br/>\n<br/>\nThanks<br/>\nKaren</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225301000","msgId":36832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4RTI1NDY1LUYzODItNEFDOC05N0M5LTI4MERCRjA3MjI0M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4=","referencesHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4="},"prevInTopic":36830,"nextInTopic":36833,"prevInTime":36831,"nextInTime":36833,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"... I don t know what it might say in her contract with the publisher, but if they ll let her publish it on her own -- an agent could help with the contract","messageBody":"<div id=\"ygrps-yiv-293236110\">On Oct 29, 2008, at 11:58 AM, Kelly wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sorry for the cross-post. I want to make sure this gets out to all  <br/>\n&gt; my lists.<br/>\n&gt; I think many of you know this book, and have benefitted from it.  <br/>\n&gt; I&#39;d love to<br/>\n&gt; see it remain available for future parents/children. It would be a  <br/>\n&gt; shame for<br/>\n&gt; it to go out of print.<br/>\n<br/>\n </span></blockquote>I don&#39;t know what it might say in her contract with the publisher,  <br/>\nbut if they&#39;ll let her publish it on her own -- an agent could help  <br/>\nwith the contract stuff -- the vanity presses are a lot better than  <br/>\nthey used to be. They can print even single copies for a reasonable  <br/>\nprice. Lulu has been around awhile and Sandra Dodd used them and I  <br/>\nthink Rue Kream too. They will also handle the sales through their  <br/>\nwebsite if she doesn&#39;t want to buy a bunch of copies and do it herself.<br/>\n<br/>\nCreate Space is an Amazon owned company and they&#39;ll print and also  <br/>\nhelp market it through Amazon.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lulu.com/\">http://www.lulu.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.createspace.com/\">http://www.createspace.com/</a><br/>\n<br/>\nThere&#39;s a good help file at Create Space:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.createspace.com/Help/Book/FAQ.jsp\">http://www.createspace.com/Help/Book/FAQ.jsp</a><br/>\n<br/>\nand at Lulu:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lulu.com/en/products/?cid=en_home_publish\">http://www.lulu.com/en/products/?cid=en_home_publish</a><br/>\n<br/>\n(Lulu also publishes kid creations like books and comic books which  <br/>\nmy daughter would have *loved* when she was a kid :-) She desperately  <br/>\nwanted real bound copies of her creations. Stapling and comb binding  <br/>\ndidn&#39;t cut it. She wanted it to look and feel like it came from a  <br/>\nstore. That desire did, though, get us into book binding later. :-)<br/>\n<br/>\nSpeaking of books going out of print. the New York Times had an  <br/>\narticle about Google&#39;s scanning efforts.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2008/10/29/technology/internet/29google.html?\">http://www.nytimes.com/2008/10/29/technology/internet/29google.html?</a> <br/>\n_r=1&th&emc=th&oref=slogin<br/>\n<br/>\nThey were sued for scanning out of print copyrighted material and  <br/>\nreached an agreement with authors and publishers that will allow them  <br/>\nto continue to scan and offer about 20% of the book to browse with an  <br/>\noption to purchase it as a download (with part of the sale going to  <br/>\nthe author and publisher). What a great thing for books that are  <br/>\nbarely available as used copies. I see so many interesting-but-not- <br/>\ngreat books being sold for exorbitant prices on Amazon only because  <br/>\nthey&#39;re out of print.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235225792,"authorName":"Kelly","from":"&quot;Kelly&quot; &lt;kelly@...&gt;","profile":"dogsheeptiger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"FW: Peaceful Parents Newsletter from Naomi Drew","postDate":"1225295931","msgId":36830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5NzQ0NEJGQjc3QjQ1NjY5NDc1NzAxMDJDOEE2OThEQGtlbGx5ZGVzaz4="},"prevInTopic":0,"nextInTopic":36832,"prevInTime":36829,"nextInTime":36831,"topicId":36830,"numMessagesInTopic":0,"msgSnippet":"Hi all, Sorry for the cross-post. I want to make sure this gets out to all my lists. I think many of you know this book, and have benefitted from it. I d love","messageBody":"<div id=\"ygrps-yiv-411557565\">Hi all,<br/>\n<br/>\n <br/>\n<br/>\nSorry for the cross-post. I want to make sure this gets out to all my lists.<br/>\nI think many of you know this book, and have benefitted from it. I&#39;d love to<br/>\nsee it remain available for future parents/children. It would be a shame for<br/>\nit to go out of print.<br/>\n<br/>\n <br/>\n<br/>\nThanks!<br/>\n<br/>\n <br/>\n<br/>\nKelly<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:compostgal@...\">compostgal@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:compostgal@...\">compostgal@...</a>] <br/>\nSent: Tuesday, October 28, 2008 1:09 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:win47win@...\">win47win@...</a>; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertwsimpson@...\">robertwsimpson@...</a>; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kerrymbutch@...\">kerrymbutch@...</a>;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kelly@...\">Kelly@...</a>; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kenschaft@...\">kenschaft@...</a><br/>\nSubject: Re: Peaceful Parents Newsletter from Naomi Drew<br/>\n<br/>\n <br/>\n<br/>\nThis is a fine effort from a fine local person.<br/>\nTrina<br/>\n<br/>\n<br/>\n---- Original Message ----<br/>\nFrom: Naomi Drew &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:win47win@...\">win47win@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:compostgal@...\">compostgal@...</a><br/>\nSent: Tue, 28 Oct 2008 5:00 pm<br/>\nSubject: Peaceful Parents Newsletter from Naomi Drew<br/>\n<br/>\nPEACEFUL PARENTS <br/>\n <br/>\na free e-newsletter from Naomi Drew, author of <br/>\n&quot;Peaceful Parents, Peaceful Kids&quot; <br/>\n                          <br/>\nPlease pass this newsletter on to anyone for whom it can make a <br/>\ndifference.You can e-mail Naomi directly at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Naomi@...\">Naomi@...</a> <br/>\n <br/>\n(To subscribe or unsubscribe please scroll to end) <br/>\n <br/>\nPEACEFUL PARENTS, PEACEFUL KIDS <br/>\n <br/>\nDear Friends, <br/>\nI know that many of you have read and loved &quot;Peaceful Parents, <br/>\nPeaceful Kids.&quot; Nothing makes me happier than knowing this book has <br/>\nhelped so many people navigate their way through parenthood. A mom who <br/>\nattended my workshop in Florida last week told me this was the most <br/>\nlife-changing parenting book she had ever read. <br/>\n <br/>\nWell, I just learned &quot;Peaceful Parents, Peaceful Kids,&quot; is in danger <br/>\nof going out of print. Its publisher, Kensington Books, said that <br/>\nunless sales improve, &quot;Peaceful Parents, Peaceful Kids&quot; will be put to <br/>\nbed forever.  This can&#39;t happen. So many workshops are scheduled <br/>\naround the content in &quot;Peaceful Parents, Peaceful Kids&quot; and so many <br/>\nparents are still waiting to read it. <br/>\n <br/>\nPlease consider giving &quot;Peaceful Parents, Peaceful Kids&quot; as a gift, <br/>\nor donating a copy to your local school, parent group, or religious <br/>\neducation program.  The recipient will be grateful, as have been the <br/>\nmany parents who have benefited from this book since it&#39;s birth in <br/>\n2000. I hope that with your help, &quot;Peaceful Parents, Peaceful Kids&quot; <br/>\nwill make it to its tenth birthday and beyond. <br/>\n <br/>\n&quot;Peaceful Parents, Peaceful Kids&quot; is available at Amazon.com for only <br/>\n$11.20. Here is the exact link. <br/>\n <br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Peaceful-Parents-Kids-Practical-Create/dp/1575666081/r\">http://www.amazon.com/Peaceful-Parents-Kids-Practical-Create/dp/1575666081/r</a><br/>\nef=sr_1_1?ie=UTF8&s=books&qid=1224707879&sr=1-1 <br/>\n <br/>\n <br/>\nBelow is an adapted excerpt from &quot;Peaceful Parents, Peaceful Kids&quot; on <br/>\ntantrums that I know many of you will find helpful. As my way of <br/>\nsaying thanks to anyone who buys the book, I want to send you a signed <br/>\nbook plate for the inside cover. E-mail me at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Naomi@...\">Naomi@...</a> <br/>\nfor details. <br/>\n <br/>\nThank you, as always for your support.  You generously responded when <br/>\nI asked for people to participate in my national survey of <br/>\nelementary-aged kids on conflict, anger, and bullying.  As a result <br/>\nover 2100 students and hundreds of teachers took part.  As soon as I <br/>\nget the go-ahead from Free Spirit Publishing, I will share with you <br/>\nthe complete results.  However, as loyal readers, I&#39;d like you to know <br/>\nthe one result that most stood out for me: <br/>\n <br/>\n73% percent of the students surveyed think other kids are somewhat to <br/>\nvery mean to each other. <br/>\n <br/>\nThis is why the work of peacemaking has to continue in our homes, <br/>\nschool, communities, and in the world at large.  I am so grateful you <br/>\nare all a part of it. <br/>\n <br/>\nIn peace, Naomi <br/>\n <br/>\n <br/>\n <br/>\n****************************************************************************<br/>\n****** <br/>\n <br/>\nFROM &quot;PEACEFUL PARENTS, PEACEFUL KIDS:&quot; <br/>\nDEALING WITH TANTRUMS <br/>\n <br/>\nWhat parent doesn&#39;t dread tantrums?  Well, here&#39;s some good news <br/>\n--you can alleviate much of the chaos brought on by tantrums by <br/>\nidentifying what kind tantrum you child is having: manipulative or <br/>\nspill-over. <br/>\n <br/>\nA manipulative tantrum is the kind kids use to get their way. These <br/>\ntantrums often take place when your child wants something and you say <br/>\nno. Your child then throws a fit to force you to change your mind.  A <br/>\nspill-over tantrum is an entirely different thing.  Spill-over <br/>\ntantrums happen when a child becomes overwhelmed by feelings, senses, <br/>\nand stimuli. These tantrums are unintentional. They usually happen <br/>\nwhen kids are over-tired or hungry.  Children who are highly <br/>\nemotional, ultra-sensitive, and easily over-stimulated tend to have <br/>\nspill-over tantrums. <br/>\n <br/>\nBoth types of tantrums need to be handled differently. <br/>\n <br/>\nThe first step is to determine which type of tantrum your child is <br/>\nhaving. If she&#39;s yelling and screaming because you won&#39;t let her have <br/>\nice cream, it&#39;s probably a manipulative tantrum. Best to ignore it. <br/>\nWalk into another room and let her emote without the benefit of an <br/>\naudience. If you&#39;re out, take your child to the car and let her scream <br/>\nthere. Most importantly, don&#39;t give in or you&#39;ll just encourage <br/>\nanother tantrum next time she wants her way. After the tantrum&#39;s over, <br/>\nexplain, in no uncertain terms, that her behavior was unacceptable, <br/>\nthen give a consequence like taking away a special toy for at least a <br/>\nday, or removing a privilege. <br/>\n <br/>\nTell your child that you expect better of her and that you were <br/>\ndisappointed in her behavior.  Use a no-nonsense non-yelling voice and <br/>\nmake direct eye contact. Remember, you&#39;re the model for your child&#39;s <br/>\nbehavior. One more caveat. If you say you&#39;re going to take away a toy <br/>\nif your child throws another tantrum, be sure to do it. Backing off <br/>\nwill only reinforce manipulation. <br/>\n <br/>\nSpill-over tantrums are entirely different. Your child may be caught <br/>\nin the pattern of feeling overwhelmed and losing control without <br/>\nwanting to. Let&#39;s say it&#39;s been a stressful week and he&#39;s has had a <br/>\nlong and over-stimulating day. It&#39;s past his bedtime, and as he walks <br/>\ntoward his bed he accidentally knocks over a Lego airplane he just <br/>\nmade. He starts wailing uncontrollably and before long, he&#39;s <br/>\ncompletely out of control. This is a spill-over tantrum. Here are a <br/>\nfew suggestions for handling it: <br/>\n <br/>\n- Try to rectify the source of the problem if at all possible. In <br/>\nthis case, helping him put together his broken airplane might do the <br/>\ntrick <br/>\n. <br/>\n- Stay close by. Let your presence be a calming influence. Sometimes <br/>\nleaving the room will add to your child&#39;s upset, so take some deep <br/>\nbreaths and try to keep your own composure. <br/>\n <br/>\n- Touch your child gently if he allows it. Try hugging or stroking <br/>\nhim. Let him put his head in your lap or lean against you; whisper <br/>\nsoothing words to him like, &quot;Mommy&#39;s right here. You&#39;re going to be <br/>\nOK.&quot; Try to remain calm even if he keeps wailing. <br/>\n <br/>\n- Ask him to stop after about five minutes. Have him take a series of <br/>\nslow, deep breaths to regain his composure. Breathe together if you <br/>\ncan. Offering a distraction might help too. &quot;Let&#39;s go downstairs and <br/>\nget a nice cool drink.&quot; <br/>\n <br/>\n- Don&#39;t allow your child to do anything destructive during his <br/>\ntantrum, no matter how upset he is. Make sure he knows ahead of time <br/>\nwhat&#39;s acceptable and what isn&#39;t. Hurting himself, others, or property <br/>\nare not okay. <br/>\n <br/>\nTalk afterwards and help your child identify the feelings that <br/>\nbrought on his tantrum. Together come up with a  plan for next time. <br/>\nAsk him to let you know when he&#39;s feeling overtired or in need of a <br/>\nbreak. Be aware of situations that could trigger him. <br/>\n <br/>\nIf you do all this and the spill-over tantrums continue, try keeping <br/>\na journal and noting what tends to set your child off. Most of all, <br/>\ndon&#39;t lose hope.  This is probably a stage that will end as quickly as <br/>\nit came on.  We&#39;ve all been there. <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n****************************************************************************<br/>\n**************** <br/>\n <br/>\nWORKSHOPS AVAILABLE TO YOUR SCHOOL OR COMMUNITY  <br/>\n <br/>\nSchedule a workshop or keynote for your school, parent group, <br/>\nworkplace, or place of worship while there&#39;s still time. E-mail <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Naomi@...\">Naomi@...</a>. The following topics are currently available: <br/>\n <br/>\n- The Power of Kindness (NEW!!) <br/>\n- Resolving Conflicts and Managing Anger <br/>\n- Bully-proofing Your School <br/>\n- Helping Kids Deal with Bullying <br/>\n- Peaceful Parent, Peaceful Kids <br/>\n- Creating Peaceful Schools <br/>\n- Conflict Resolution for Educators <br/>\n- New Teacher Training <br/>\n- Fostering Acceptance of Diversity <br/>\n- Talking to Teens About the Tough Issues <br/>\n- Building Resilience in Children <br/>\n- Helping Middle Schoolers Handle Conflict <br/>\n- Building Good Character in Children <br/>\n- Fostering Good Listening in Children <br/>\n- Strategies for De-Stressing and Calming <br/>\n- Raising Compassionate Kids <br/>\n- Helping Kids with ADD <br/>\n <br/>\n****************************************************************************<br/>\n**************** <br/>\n <br/>\nNaomi Drew is a registered provider with the New Jersey State <br/>\nDepartment of Education and the NJ Character Education Network.  She <br/>\nis the author of six books, all available through LearningPeace.com <br/>\nand Amazon.com. <br/>\n <br/>\nPeaceful Parents, Peaceful Kids (Kensington Publishers) <br/>\nLearning the Skills of Peacemaking (Pro-Ed Inc.) <br/>\nThe Peaceful Classroom in Action (Personhood Press) <br/>\nHope and Healing: Peaceful Parenting in an Uncertain World  <br/>\n(Kensington Publishers) <br/>\nThe Kids Guide to Working Out Conflicts: How to Stay Calm, Cool, and <br/>\nSafe,  (Free Spirit Publishing)  <br/>\nA Leaders&#39; Guide to The Kids Guide to Working Out Conflicts (Free <br/>\nSpirit Pubishing) <br/>\n     <br/>\nTO ORDER go to www.LEARNINGPEACE.com <br/>\n <br/>\nPeaceful Parents is a free monthly service. Please share this <br/>\nnewsletter.  Feel free to download and circulate.  <br/>\n <br/>\nCopyright Naomi Drew, October, 2008 All Rights Reserved.  <br/>\nThis content may be forwarded in full, with <br/>\ncopyright/contact/creation information intact,without specific <br/>\npermission, when used only in a not-for-profit format.  If any other <br/>\nuse is desired, permission in writing from the author is required. <br/>\n <br/>\n              Love and Peace to All of You. <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\nTo subscribe to this list, browse to: <br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://casts.webvalence.com/listmgr/subscribe?lists=PeacefulParentsNewslette\">http://casts.webvalence.com/listmgr/subscribe?lists=PeacefulParentsNewslette</a><br/>\nr <br/>\n <br/>\nTo cancel, browse to: <br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://casts.webvalence.com/listmgr/cancel?lists=PeacefulParentsNewsletter\">http://casts.webvalence.com/listmgr/cancel?lists=PeacefulParentsNewsletter</a> <br/>\n <br/>\n <br/>\n <br/>\nNaomi Drew <br/>\nc/o Free Spirit Pub. <br/>\n217 Fifth. No., Suite 200 <br/>\nMinneapolis, MN 55401-1299 <br/>\n <br/>\n <br/>\n  _____  <br/>\n<br/>\nsize=2 width=&quot;100%&quot; align=center&gt; <br/>\n<br/>\nPlay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gamevault.ca/?icid=AOLGAM00310000000001\">http://www.gamevault.ca/?icid=AOLGAM00310000000001</a>&gt;  free online games<br/>\nat Gamevault.ca. Word, arcade, puzzle and more. Play now!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":36730,"nextTopicId":36795}}