{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":473994495,"authorName":"am7055","from":"am7055 &lt;am7055@...&gt;","profile":"daretodance63","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1342032956","msgId":48758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSGl6K1A3UmtUZzlRMHVUVW5wK1BvTm9Yb3dXRnRrZmZyQU5va0tHcktLOXFWR0VNd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp0a2NobCs5bmFtQGVHcm91cHMuY29tPg==","referencesHeader":"PGp0aWluZytrbDBxQGVHcm91cHMuY29tPgk8anRrY2hsKzluYW1AZUdyb3Vwcy5jb20+"},"prevInTopic":48757,"nextInTopic":0,"prevInTime":48757,"nextInTime":48759,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... out which cards they want Right Now rather than putting too much emphasis on trying to guess which cards they ll need in twenty years.","messageBody":"<div id=\"ygrps-yiv-518885818\">Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;One way of looking at unschooling is that we get to help our kids figure<br/>\n </span></blockquote>out which cards they want Right Now rather than putting too much emphasis<br/>\non trying to guess which cards they&#39;ll need in twenty years.&lt;<br/>\n<br/>\n<br/>\nYes! I admit this has always been my problem. When i first started<br/>\nhomeschooling many years ago, I asked more experienced homeschool moms<br/>\n&quot;what about graduation?&quot; (note: my kid was 5 y.o. at the time).  I was told<br/>\n&quot;do what is right for your son Right Now, and the future will unfold<br/>\nitself.&quot;<br/>\n<br/>\nAnd here I am again, receiving sage advice to stay in the present moment<br/>\nand provide what he needs right now. Thank you for this timely reminder!<br/>\n<br/>\nBecause that is really all we can do. We cannot predict the future, but<br/>\nlearning how to learn and adapt will be essential tools he can use.<br/>\n<br/>\n(Speaking of &quot;predicting the future&quot; - I haven&#39;t thought about using my own<br/>\ntarot deck for this purpose - I&#39;ve been too busy wishing I had a crystal<br/>\nball ;-)<br/>\n<br/>\nAnne<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1342028998","msgId":48757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0a2VjNitmaWY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSGl6K1A1RVFLdHo0RXB3Q2ZNa1pFVU5KdTBmZy1zYVlzaENCT0VMQlhQcUZTSHIyUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48756,"nextInTopic":48758,"prevInTime":48756,"nextInTime":48758,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... *************** I m going to run with that analogy for a bit. In order to stack the deck in someone s favor, you need to know what game he s going to play.","messageBody":"<div id=\"ygrps-yiv-811763470\">am7055 &lt;am7055@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I still feel the need to stack the deck in his favour as much as possible,<br/>\n&gt; giving him all the skills he will need to be happy and successful in life<br/>\n </span></blockquote>***************<br/>\n<br/>\nI&#39;m going to run with that analogy for a bit. <br/>\n<br/>\nIn order to stack the deck in someone&#39;s favor, you need to know what game he&#39;s going to play. That&#39;s problematic. You can make some guesses, but my parents did a grand job of building my a really fantastic canasta deck and my life looks more like a tarot spread. Some of the old cards adapt just fine, but tarot uses some extra cards not available in a standard deck so I&#39;ve scrounged cards from other decks, drawn over some of the cards I have, and cobbled together something that works for me. <br/>\n<br/>\nUltimately, everyone builds their own unique deck and plays a variety of games with it. Some are based on standard decks, some aren&#39;t - some look like cards from Pokemon or Trivial Pursuit, sometimes we&#39;re left trying to play Apples to Apples with three Skip-bo cards, one Pokemon and the Hanged Man. That&#39;s where life gets interesting ;)<br/>\n<br/>\n One way of looking at unschooling is that we get to help our kids figure out which cards they want Right Now rather than putting too much emphasis on trying to guess which cards they&#39;ll need in twenty years. It seems counter intuitive, but it turns out that learning grows from learning - so helping kids do/learn what they want helps them learn more deeply, more broadly, more creatively and skillfully. When kids do that, they learn more about learning and problem solving along with everything else. To return to the analogy of cards, if a kid with a lot of Pokemon cards wants to play something like Poker, we help them figure out how to come close - whether by adding more cards or adapting those they have, or adapting the game itself. And so they learn how to figure out, adapt and add - and That ends up being more useful in the long run than which cards they have. <br/>\n<br/>\nSomewhere along the way I realized I didn&#39;t want to play canasta. I struggled against that for awhile. Some days, I look at my tarot life and can see it as a canasta failure - but it isn&#39;t. It&#39;s just not the game my parents expected me to play. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1342027125","msgId":48756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0a2NobCs5bmFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0aWluZytrbDBxQGVHcm91cHMuY29tPg=="},"prevInTopic":48755,"nextInTopic":48757,"prevInTime":48755,"nextInTime":48757,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... **************** I think for some people that kind of story is a helpful, hopeful view of what s good about human nature and it fits in well with what they","messageBody":"<div id=\"ygrps-yiv-684085828\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; The children do have choices, including, in some places, the choice to attend a school run by European missionaries, or to stay at home with the tribe and live as their ancestors have always lived. From what I have read, most of the kids who try the school choose to leave and go back to their freer way of life at home.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI think for some people that kind of story is a helpful, hopeful view of what&#39;s good about human nature and it fits in well with what they perceive as &quot;natural impulses&quot;. I haven&#39;t experience either traditional cultures or natural impulses as kind or supportive. My experiences have been that &quot;nature&quot; is indifferent, and &quot;natural lifestyles&quot; aren&#39;t supportive of people who don&#39;t fit neatly into the group. That&#39;s not necessarily a bad thing for adults living together, but it can be really hard on children. <br/>\n<br/>\nBut those are examples of how personal experiences inform our view of the world. If you see nature as kind and supportive, then it makes a useful metaphor for touching base with your own kindness. <br/>\n<br/>\nPart of wrapping my mind around unschooling involved stepping away from ideas of natural living and seeing kindness and care as luxuries. I get to lavish my kids and my partner with luxury. That&#39;s cool. I like it. It lets me see my life as big and warm and full, even when we&#39;re struggling to get all the bills paid or keep ahead of the dirty dishes. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":506344661,"authorName":"Kristen Marcantonio","from":"Kristen Marcantonio &lt;kristenssrr@...&gt;","profile":"kristenssrr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: A new article on unschooling here in MN","postDate":"1342012163","msgId":48755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDIwMTIxNjMuMzEzNzguWWFob29NYWlsTmVvQHdlYjEyNTMwNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGp0ZjUycCtwb29uQGVHcm91cHMuY29tPg==","referencesHeader":"PDc5M0M5MENGLUQ5RjktNDc1Ri1BMkU0LTNCQTE5MUFCMjkxN0B5YWhvby5jb20+IDxqdGY1MnArcG9vbkBlR3JvdXBzLmNvbT4="},"prevInTopic":48754,"nextInTopic":48756,"prevInTime":48754,"nextInTime":48756,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Meredith,   Our children love unschooling so far ( we are a few months into it) and you are so right...learning is natural,and kids are naturally sooo curious","messageBody":"<div id=\"ygrps-yiv-625472565\">Meredith,<br/>\n <br/>\nOur children love unschooling so far ( we are a few months into it) and you are so right...learning is natural,and kids are naturally sooo curious about almost everything.<br/>\nThank you for your information on this site.<br/>\n <br/>\nKristen<br/>\n <br/>\n<br/>\n________________________________<br/>\n From: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Monday, July 9, 2012 1:40 PM<br/>\nSubject: [unschoolingbasics] Re: A new article on unschooling here in MN<br/>\n  <br/>\n<br/>\n <br/>\n   <br/>\n <br/>\nCindy Miller &lt;millerblend@...&gt; wrote:<br/>\nWe started unschooling a year ago....tried what is termed &quot;radical&quot; unschooling and it did not work for our family.<br/>\n******************<br/>\n<br/>\nOne common reason people don&#39;t find radical unschooling works for them is they dive in too quickly, change too many things at once. It&#39;s better to ease in - and you may be doing exactly that without even realizing it. The more you see that learning is natural and dependent on the perspective of the learner, the more those ideas can expand into the whole of life. That&#39;s what &quot;radical unschooling&quot; is - seeing that the principles of how human beings learn are part of everything we do. When you jump in too quickly, you set yourself up to learn too many new things simultaneously and it seems outrageous and impossible ;)<br/>\n<br/>\n---Meredith<br/>\n<br/>\n   <br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":506344661,"authorName":"Kristen Marcantonio","from":"Kristen Marcantonio &lt;kristenssrr@...&gt;","profile":"kristenssrr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: A new article on unschooling here in MN","postDate":"1342011791","msgId":48754,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDIwMTE3OTEuMTQ5MjguWWFob29NYWlsTmVvQHdlYjEyNTMwMS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDc5M0M5MENGLUQ5RjktNDc1Ri1BMkU0LTNCQTE5MUFCMjkxN0B5YWhvby5jb20+","referencesHeader":"PDc5M0M5MENGLUQ5RjktNDc1Ri1BMkU0LTNCQTE5MUFCMjkxN0B5YWhvby5jb20+"},"prevInTopic":48753,"nextInTopic":48755,"prevInTime":48753,"nextInTime":48755,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Cindy,   I like your explanation of doing what works best for our family...as needs change we must adapt , and saying we live and learn together as a","messageBody":"<div id=\"ygrps-yiv-1956759787\">Cindy,<br/>\n <br/>\nI like your explanation of &quot;doing what works best for our family...as needs change we must adapt&quot;, and saying &quot;we live and learn together as a family&quot;....excellent terms.<br/>\nIt&#39;s funny b/c my husband and I are also trying to meet a common ground of the &quot;unschooling&quot; definition.<br/>\n <br/>\n<br/>\n________________________________<br/>\n From: Cindy Miller &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:millerblend@...\">millerblend@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; <br/>\nSent: Monday, July 9, 2012 10:39 AM<br/>\nSubject: [unschoolingbasics] Re: A new article on unschooling here in MN<br/>\n  <br/>\n<br/>\n <br/>\n   <br/>\n <br/>\nMeredith,<br/>\n<br/>\nReally appreciate the insight on your reply! We started unschooling a year ago....tried what is termed &quot;radical&quot; unschooling and it did not work for our family. However, the more we&#39;ve stepped away from traditional education the more &quot;radical&quot; we seem to appear to family and friends. ;-)<br/>\n<br/>\nWe just decided to do what works best for our family which means that as needs change we must adapt. My husband and I are still muddling through our definition of unschooling (he does not like that term) but we are both in agreement that use of curriculum in a traditional sit down at a desk style is not beneficial for our boys. I prefer to say that we live and learn together as a family when asked why boys aren&#39;t in &quot;school.&quot;<br/>\n<br/>\nCindy<br/>\n<br/>\nSent from my iPad<br/>\n   <br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1341978619","msgId":48752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDE5Nzg2MTkuOTE4NDAuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PGp0aG9mcStiY3IwQGVHcm91cHMuY29tPiA8anRpaW5nK2tsMHFAZUdyb3Vwcy5jb20+IA=="},"prevInTopic":48751,"nextInTopic":48753,"prevInTime":48751,"nextInTime":48753,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Having spent some part of my life as an anthropologist among anthropologists reading and living and discussing anthropology I can argue that your image of","messageBody":"<div id=\"ygrps-yiv-1415443782\">Having spent some part of my life as an anthropologist among anthropologists reading and living and discussing anthropology I can argue that your image of hunter-gatherers, both pre-modern and modern, is very glossy, very halcyon and fairly inaccurate. The Ache, who are a relatively recently contacted group (1960&#39;s) in Paraguay, will sacrifice children as grave goods if they don&#39;t have enough male family members to stand up for them when a relative dies. There are written records of Australian aboriginal groups who would use drugs derived from plants to control their daughters&#39; fertility to keep them at home as nurse-maids for their siblings, alternately they would use them as trade goods when meeting up with other groups. Those aren&#39;t isolated incidents. Those aren&#39;t few and far between stories, there was an archeaologist I met who was looking at patterns of violence in hunter-gatherer skeletal remains in California, lots of violence, lots of<br/>\n skull damage. <br/>\n <br/>\nI could tell more stories, I could find more evidence that humans aren&#39;t particularly nice to children. Children are less likely to survive childhood to reproductive  age than someone who has already hit 12. Strictly from a gene inheritance standpoint, if you have high infant mortality, you are much more likely to invest in children who&#39;ve already gone past the dangerous ages of 0 to 5 than you are to support the interests of an infant or toddler. But that doesn&#39;t really matter that much on an unschooling list. I don&#39;t think unschooling is the natural human condition. I think it is hard to be patient and kind and to put someone else&#39;s interests before your own. I think that has always been true. I think if it were easy, these kinds of lists would be far rarer than they are, and there would be a much smaller section of a bookstore given over to parenting books. And I think Jean Leidloff was wrong. And Rousseau. <br/>\n <br/>\nSaying that unschooling isn&#39;t the natural human condition isn&#39;t strictly accurate. I think it is natural to be curious, to want to explore ideas and things and environments and situations. I think learning is the natural human condition and unschooling is about setting that up. However, I do think being an unschooling parent isn&#39;t the natural, pre-historic, evolved way that adults relate to children. I think it is a modern condition, this kindness to children. And I believe that it is grown out of having such much greater child survivorship due to modern healthcare and diet and environmental conditions. Babies in richer nations have such high survivorship that parents are almost--almost--assured that their child will make it to adulthood, investing in them is a much surer thing than it has ever been before, ever. I think unschooling rises out of that and not out of what humans once were. Oh, and as Linnaea just pointed out, adult mortality is much<br/>\n lower in the years when having a parent present makes a massive difference in a child&#39;s life. It&#39;s easier to be kind if you are alive to be there. <br/>\n <br/>\nOh, also, Robert Sapolsky, a neuroendocrinologist with one of my all time favourite hair and beard combinations and whose worked in Kenya studying baboons for years, mentions a group of Maasai men who have grown so disturbed by the prevelance of Maasai parents sending their children to school that they kidnap young boys to raise them to be warriors. I am only remembering it in passing, I think it may be in a Primate&#39;s Memoir, but it might not, and I don&#39;t have any books to hand that I would normally have. School is often seen as the first step toward garnering a good life. The efforts that went on in pioneering communities to get and support a teacher to come in and teach their children how to read in the months when they could be excused from farming responsibilities run through so many of the published diaries of women from the mid-1800s in Nebraska, the Dakota&#39;s, Montana. Children died in the Schoolchildren&#39;s Blizzard because they were caught<br/>\n out as they walked home from school <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Schoolhouse_Blizzard%c2%a0or\">http://en.wikipedia.org/wiki/Schoolhouse_Blizzard%c2%a0or</a> as their school ran out of supplies.  <br/>\n <br/>\nI think it is okay to be doing the new thing. I don&#39;t think it needs to have precedence to work. <br/>\n <br/>\nSchuyler<br/>\n <br/>\n<br/>\n________________________________<br/>\n From: lindaguitar &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindaguitar@...\">lindaguitar@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Wednesday, 11 July 2012, 10:52<br/>\nSubject: [unschoolingbasics] Re: Unschooling - natural (was: A new article on unschooling ...)<br/>\n  <br/>\n<br/>\n   <br/>\n <br/>\n<blockquote><span title=\"qreply\"> --- In mailto:unschoolingbasics%40yahoogroups.com, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; .... That&#39;s a very idealized view which only applies to<br/>\n&gt; non-agrarian cultures with an abundance of resources. When there&#39;s<br/>\n&gt; a farm, kids work, like it or not. <br/>\n<br/>\nAs I said, I was speaking of tribal communities. Tribal communities - even when they did/do include some farming - tend not to treat the children as unwilling free labor. The kinds of farms you&#39;re speaking of are individually owned family farms. I wasn&#39;t speaking of that scenario at all.<br/>\n<br/>\nHunter-gatherer tribal communities predate modern civilizations, and they still exist in a few places today. Where they exist, they still treat the children as they have done for tens of thousands of years. The children do have choices, including, in some places, the choice to attend a school run by European missionaries, or to stay at home with the tribe and live as their ancestors have always lived. From what I have read, most of the kids who try the school choose to leave and go back to their freer way of life at home.<br/>\n<br/>\n&gt; When resources are scarce, kids are expected to become economic<br/>\n&gt; assets as early as possible.<br/>\n<br/>\nThis may affect some of the &quot;radical unschooling&quot; ideas about parenting and family dynamics (which, by this interpretation, can not apply where there is economic necessity, and becomes a philosophy by and for the wealthy), but it does not mean that unschooling, as an organic, holistic way of learning, instead of attending a school, is any less natural in family farm situations. Until school attendance became mandatory, many children raised on family farms *were* unschooled, in the way that they learned to read, write, calculate, and learned about science and history, music, art, etc. That&#39;s why we frequently see the names of so many of the early scientists, authors, inventors, and leaders of the American Revolution listed on blogs, unschool groups, Facebook pages, and articles, as example of the &quot;proof&quot; that unschooling leads to success! <br/>\n<br/>\nLinda<br/>\n<br/>\n   <br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":473994495,"authorName":"am7055","from":"am7055 &lt;am7055@...&gt;","profile":"daretodance63","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1341977730","msgId":48753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSGl6K1A1RVFLdHo0RXB3Q2ZNa1pFVU5KdTBmZy1zYVlzaENCT0VMQlhQcUZTSHIyUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp0aTlxNytuNmNkQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSGl6K1A3ZXFiT3IyQ1UxUmVTQVhGU2FnM0pwbmRuOWp6TVhnTms9MzBlOTZDRTlzZ0BtYWlsLmdtYWlsLmNvbT4JPGp0aTlxNytuNmNkQGVHcm91cHMuY29tPg=="},"prevInTopic":48752,"nextInTopic":48754,"prevInTime":48752,"nextInTime":48754,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Thanks, Meredith. Yes, we do know quite a few autistic adults. Years ago, we actively looked for people to work with our son, not the so-called medical","messageBody":"<div id=\"ygrps-yiv-1868630856\">Thanks, Meredith. Yes, we do know quite a few autistic adults. Years ago,<br/>\nwe actively looked for people to work with our son, not the so-called<br/>\nmedical professionals who claimed to know all about autism, but autistic<br/>\npeople who could explain to us what it is like to be autistic in modern<br/>\nsociety, and to teach us how our son processes information. They ended up<br/>\nworking with our kids (and training us) all about their autistic paradigm.<br/>\nThey helped our son understand his sensitivities and how his brain works. I<br/>\nhighly recommend it to all parents of children with autism -- very<br/>\nilluminating.<br/>\n<br/>\nBut we can never be sure how our children will develop. He has consistently<br/>\namazed me over the past several years, at how much he has grown in<br/>\nunderstanding and maturity. (Our autistic friends always remind us of the<br/>\npart we as parents have played in his successes so far--they are huge on<br/>\nvalidation.)<br/>\n<br/>\nI still feel the need to stack the deck in his favour as much as possible,<br/>\ngiving him all the skills he will need to be happy and successful in life<br/>\n(both academic and life skills). Because let&#39;s face it, even for<br/>\nneurotypicals, it&#39;s hard enough in today&#39;s world to make a go of it; if you<br/>\nhave any cognitive impediments or social skill deficits, it&#39;s so much<br/>\nharder.<br/>\n<br/>\nAnne</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1341967920","msgId":48751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0aWluZytrbDBxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0aG9mcStiY3IwQGVHcm91cHMuY29tPg=="},"prevInTopic":48750,"nextInTopic":48752,"prevInTime":48750,"nextInTime":48752,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... As I said, I was speaking of tribal communities. Tribal communities - even when they did/do include some farming - tend not to treat the children as","messageBody":"<div id=\"ygrps-yiv-1878299422\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; .... That&#39;s a very idealized view which only applies to<br/>\n&gt; non-agrarian cultures with an abundance of resources. When there&#39;s<br/>\n&gt; a farm, kids work, like it or not. <br/>\n<br/>\n </span></blockquote>As I said, I was speaking of tribal communities. Tribal communities - even when they did/do include some farming - tend not to treat the children as unwilling free labor. The kinds of farms you&#39;re speaking of are individually owned family farms. I wasn&#39;t speaking of that scenario at all.<br/>\n<br/>\nHunter-gatherer tribal communities predate modern civilizations, and they still exist in a few places today. Where they exist, they still treat the children as they have done for tens of thousands of years. The children do have choices, including, in some places, the choice to attend a school run by European missionaries, or to stay at home with the tribe and live as their ancestors have always lived. From what I have read, most of the kids who try the school choose to leave and go back to their freer way of life at home.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When resources are scarce, kids are expected to become economic<br/>\n&gt; assets as early as possible.<br/>\n<br/>\n </span></blockquote>This may affect some of the &quot;radical unschooling&quot; ideas about parenting and family dynamics (which, by this interpretation, can not apply where there is economic necessity, and becomes a philosophy by and for the wealthy), but it does not mean that unschooling, as an organic, holistic way of learning, instead of attending a school, is any less natural in family farm situations. Until school attendance became mandatory, many children raised on family farms *were* unschooled, in the way that they learned to read, write, calculate, and learned about science and history, music, art, etc. That&#39;s why we frequently see the names of so many of the early scientists, authors, inventors, and leaders of the American Revolution listed on blogs, unschool groups, Facebook pages, and articles, as example of the &quot;proof&quot; that unschooling leads to success!     <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1341958791","msgId":48750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0aTlxNytuNmNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSGl6K1A3ZXFiT3IyQ1UxUmVTQVhGU2FnM0pwbmRuOWp6TVhnTms9MzBlOTZDRTlzZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48749,"nextInTopic":48751,"prevInTime":48749,"nextInTime":48751,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... And with a diagnosis, that s likely to be worse - that s one reason many unschoolers (among others) eschew diagnoses and labels. They can get in the way of","messageBody":"<div id=\"ygrps-yiv-728980085\">am7055 &lt;am7055@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Clearly, I should be honouring each child&#39;s learning styles -- so why<br/>\n&gt; aren&#39;t I? Fear. Lack of trust in myself and my kids.<br/>\n<br/>\n </span></blockquote>And with a diagnosis, that&#39;s likely to be worse - that&#39;s one reason many unschoolers (among others) eschew diagnoses and labels. They can get in the way of being your child&#39;s best partner in learning. <br/>\n<br/>\nDo you know any adults with autism or have you read any autobiographies of people with autism? Not &quot;case studies&quot; but stories of real people living life can be really helpful in terms of seeing past labels which can otherwise eclipse your view of your child. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":473994495,"authorName":"am7055","from":"am7055 &lt;am7055@...&gt;","profile":"daretodance63","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1341947875","msgId":48749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSGl6K1A3ZXFiT3IyQ1UxUmVTQVhGU2FnM0pwbmRuOWp6TVhnTms9MzBlOTZDRTlzZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp0Z2F0ditnMzhxQGVHcm91cHMuY29tPg==","referencesHeader":"PGp0Y3JiOStrMmFqQGVHcm91cHMuY29tPgk8anRnYXR2K2czOHFAZUdyb3Vwcy5jb20+"},"prevInTopic":48748,"nextInTopic":48750,"prevInTime":48748,"nextInTime":48750,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... follow orders without question, to compete against each other at all times, and to lack compassion and empathy. The actual content of what they *call* the","messageBody":"<div id=\"ygrps-yiv-1884012268\">On Mon, Jul 9, 2012 at 9:26 PM, lindaguitar &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindaguitar@...\">lindaguitar@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The fact is, the school system trains children to become obedient, to<br/>\n </span></blockquote>follow orders without question, to compete against each other at all times,<br/>\nand to lack compassion and empathy. The actual content of what they *call*<br/>\nthe curriculum is secondary to these basic lessons. &lt;<br/>\n<br/>\nThank you, Linda, for reminding me of this. So very true.<br/>\n<br/>\nAs a homeschool mom who has always coerced my kids (in some small way) into<br/>\ndoing something that reminds me of school (&quot;come to the kitchen table and<br/>\nlet&#39;s do some math!&quot;), I struggle to remember this. Also, I have my son<br/>\nenrolled in a DL school because he has an autism diagnosis and we get LOTS<br/>\nof funding money to spend on anything from horseback riding therapy to his<br/>\nfavourite activity: rockclimbing. Consequently, I try to follow the DL<br/>\nschool&#39;s curriculum as closely as possible, using my son&#39;s IEP as much as<br/>\npossible, to make adaptations that will more closely suit his learning<br/>\nstyle. But alas, he is still miserable --<br/>\n<br/>\nHence, I am still in conflict with myself over what path best to follow. It<br/>\nkills me to see him resistant to learning, because I see it creep into<br/>\nareas of his life where he IS interested in something, yet won&#39;t put out<br/>\nthe effort to learn/explore because it smacks of &quot;school work&quot; (ex/his love<br/>\nof Minecraft, and his not wanting to research cheats on the Internet, or<br/>\nlook up new recipes to make tools in the Minecraft world).<br/>\n<br/>\nOddly enough, I am starting to unschool my more left-brained kid because<br/>\nshe is younger (not enrolled, therefore no teacher looking over my<br/>\nshoulder) but she is more interested and willing to do the school-y stuff<br/>\nmy son abhors. Sounds like I&#39;m doing things backwards, doesn&#39;t it?<br/>\n<br/>\nClearly, I should be honouring each child&#39;s learning styles -- so why<br/>\naren&#39;t I? Fear. Lack of trust in myself and my kids. This is why I&#39;m so<br/>\nglad to hear all your comments. It gives me confidence.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1341941050","msgId":48748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0aG9mcStiY3IwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0Z2F0ditnMzhxQGVHcm91cHMuY29tPg=="},"prevInTopic":48745,"nextInTopic":48749,"prevInTime":48747,"nextInTime":48749,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... **************** That s a very idealized view which only applies to non-agrarian cultures with an abundance of resources. When there s a farm, kids work,","messageBody":"<div id=\"ygrps-yiv-691287560\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Children were raised by their &quot;tribe&quot;, and were trained by the adults, usually through mentoring and one-on-one guidance or participation in group activities such as fishing and hunting, to live as contributing members of the tribe. But they were pretty much free to roam and play, and choose how to spend their time, until they were &quot;adult&quot; enough to function as an adult member (or &quot;apprentice-adult&quot;) of the tribe. <br/>\n </span></blockquote>****************<br/>\n<br/>\nThat&#39;s a very idealized view which only applies to non-agrarian cultures with an abundance of resources. When there&#39;s a farm, kids work, like it or not. When resources are scarce, kids are expected to become economic assets as early as possible. Apprenticeships don&#39;t start when a child wants, they start when someone needs a small, able body to do labor. That&#39;s well before puberty and it&#39;s something parents choose, not kids. Girls are put to work cooking and caring for siblings a decade before they&#39;re ready to have children of their own - at which point they&#39;ll be married to whomever the parents want. The idea that kids are something other than the property of parents is pretty modern.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; It is a more common human trait to &quot;follow the herd&quot;. <br/>\n<br/>\n </span></blockquote>Exactly. Keeping the herd close and intact is old, primitive behavior - it&#39;s part of human nature. That&#39;s one of the things that makes radical unschooling, in particular, such a challenge - few others are doing it. It&#39;s why trying to unschool without support is so much harder Because we&#39;re wired to need a certain amount of social connection. <br/>\n<br/>\nSchool is an artificial herd, but one of the reasons home and even unschooling kids sometimes choose school is because it can offer more of a particular kind of social connection. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling - natural (was: A new article on unschooling ...)","postDate":"1341894399","msgId":48745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0Z2F0ditnMzhxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0Y3JiOStrMmFqQGVHcm91cHMuY29tPg=="},"prevInTopic":48737,"nextInTopic":48748,"prevInTime":48744,"nextInTime":48746,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"... The opposing suggestions that unschooling is more natural , and that it isn t, got me thinking about what actually is natural for human beings. My first","messageBody":"<div id=\"ygrps-yiv-2079493442\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi, Anne, welcome to the group. I&#39;m going to jump in and highlight a couple common misconceptions about unschooling. <br/>\n&gt; <br/>\n&gt; &lt;am7055@&gt; wrote:<br/>\n&gt; &gt; this natural lifestyle<br/>\n&gt; <br/>\n&gt; Unschooling isn&#39;t all that natural! ....<br/>\n<br/>\n </span></blockquote>The opposing suggestions that unschooling is more &quot;natural&quot;, and that it isn&#39;t, got me thinking about what actually is &quot;natural&quot; for human beings.<br/>\n<br/>\nMy first thought was, &quot;of course unschooling is more natural!&quot; <br/>\n<br/>\nI thought about how human beings have lived, all over the world, for centuries. The more any particular society has lived in small groups, in harmony with nature (thinking specifically about indigenous, tribal societies as they lived in the Americas, Africa, and pre-Roman Britain, for example, before they were conquered by invading armies from the world&#39;s most militant  - &quot;schooled&quot; - cultures, from parts of Europe and the Middle East), the closer their methods of child-rearing were to &quot;unschooling&quot;. Children were raised by their &quot;tribe&quot;, and were trained by the adults, usually through mentoring and one-on-one guidance or participation in group activities such as fishing and hunting, to live as contributing members of the tribe. But they were pretty much free to roam and play, and choose how to spend their time, until they were &quot;adult&quot; enough to function as an adult member (or &quot;apprentice-adult&quot;) of the tribe. <br/>\n<br/>\nSo, in the sense that our current school system is extremely contrived, is run as a dictatorship, is counter to the natural desires and wishes of the vast majority of children, and takes children away from their families and out of society, *unschooling* is much more &quot;natural&quot; than &quot;schooling&quot;.<br/>\n<br/>\nOn the other hand, there is that aspect of human nature that desires to control and dominate others. Looking back in history, we see that this aspect of human nature, which is synonymous with the warlike and violent part of our nature, was the dominant factor in some early civilizations too. The ancient city-state of Sparta is one that comes to my mind. Boys were taken from their mothers at the age of 7, and were sent away to military &quot;schools&quot;, to learn to become warriors. No one asked them whether they wanted to go. The boys - just like public school children today - had no choice about what, when, or where they were taught. And the teaching was certainly not kind or compassionate.<br/>\n<br/>\nThe school system that we have now is the apex and epitome of that side of human nature  even though it pretends to oppose violence, and does NOT overtly train children to become &quot;warriors&quot;. The fact is, the school system trains children to become obedient, to follow orders without question, to compete against each other at all times, and to lack compassion and empathy. The actual content of what they *call* the curriculum is secondary to these basic lessons. In fact, I think it would be more honest if the schools would just stick weapons in the kids&#39; hands and teach them all to be soldiers - because that&#39;s better than teaching them all to be helpless slaves to a covertly militant over-class!<br/>\n<br/>\nBut the extreme to which the human beings whose nature has established this type of school system  possess the dominance/warrior traits, is NOT found in the majority of people. Yes, the warrior/violent trait is &quot;natural&quot;  but it is not predominantly OUR nature, as a species.<br/>\n<br/>\nIt is a more common human trait to &quot;follow the herd&quot;. The vast majority of people are not HAPPY about the school system. Certainly the children hate it! But even those who do start off with the will, strength of personality, and creative-thinking-ability to defy the system, typically get that part of their personality squashed long before they are old enough to be able to fight back, and choose a different path for themselves.<br/>\n<br/>\nWhat we have among unschooling parents is the few survivors of that system (and the occasional lucky individual who was raised outside the system) who still have that ability and the will to think out of the box and defy the tyrants!<br/>\n<br/>\nUnschooling IS more natural than our current school system. It&#39;s just that our [collective] better nature has been perverted and overruled by a minority of the most power-mad and controlling among us, and it takes a special kind of strength and determination  - a trait that is also only found among the minority these days  to insist on returning to a more natural way of raising and educating our children. <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: A new article on unschooling here in MN","postDate":"1341855641","msgId":48737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0ZjUycCtwb29uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5M0M5MENGLUQ5RjktNDc1Ri1BMkU0LTNCQTE5MUFCMjkxN0B5YWhvby5jb20+"},"prevInTopic":48735,"nextInTopic":48745,"prevInTime":48736,"nextInTime":48738,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Cindy Miller  wrote: We started unschooling a year ago....tried what is termed radical unschooling and it did not work for our family. ","messageBody":"<div id=\"ygrps-yiv-622708579\">Cindy Miller &lt;millerblend@...&gt; wrote:<br/>\n We started unschooling a year ago....tried what is termed &quot;radical&quot; unschooling and it did not work for our family.<br/>\n******************<br/>\n<br/>\nOne common reason people don&#39;t find radical unschooling works for them is they dive in too quickly, change too many things at once. It&#39;s better to ease in - and you may be doing exactly that without even realizing it. The more you see that learning is natural and dependent on the perspective of the learner, the more those ideas can expand into the whole of life. That&#39;s what &quot;radical unschooling&quot; is - seeing that the principles of how human beings learn are part of everything we do. When you jump in too quickly, you set yourself up to learn too many new things simultaneously and it seems outrageous and impossible ;)<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":100950165,"authorName":"Cindy Miller","from":"Cindy Miller &lt;millerblend@...&gt;","profile":"millerblend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: A new article on unschooling here in MN","postDate":"1341844759","msgId":48735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5M0M5MENGLUQ5RjktNDc1Ri1BMkU0LTNCQTE5MUFCMjkxN0B5YWhvby5jb20+"},"prevInTopic":48733,"nextInTopic":48737,"prevInTime":48734,"nextInTime":48736,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Meredith, Really appreciate the insight on your reply! We started unschooling a year ago....tried what is termed radical unschooling and it did not work for","messageBody":"<div id=\"ygrps-yiv-2078607717\">Meredith,<br/>\n<br/>\nReally appreciate the insight on your reply! We started unschooling a year ago....tried what is termed &quot;radical&quot; unschooling and it did not work for our family. However, the more we&#39;ve stepped away from traditional education the more &quot;radical&quot; we seem to appear to family and friends. ;-)<br/>\n<br/>\nWe just decided to do what works best for our family which means that as needs change we must adapt. My husband and I are still muddling through our definition of unschooling (he does not like that term) but we are both in agreement that use of curriculum in a traditional sit down at a desk style is not beneficial for our boys. I prefer to say that we live and learn together as a family when asked why boys aren&#39;t in &quot;school.&quot;<br/>\n<br/>\nCindy<br/>\n<br/>\nSent from my iPad</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: A new article on unschooling here in MN","postDate":"1341832071","msgId":48732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0ZWUyNysyaDFnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDE3NzAxMzcuMTc4NTQuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":48731,"nextInTopic":48733,"prevInTime":48731,"nextInTime":48733,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"An unusually positive article! How nice. The usual naysayers and ignorant comments but they got a lot right. Nance","messageBody":"<div id=\"ygrps-yiv-1904882400\">An unusually positive article! How nice. <br/>\n<br/>\nThe usual naysayers and ignorant comments but they got a lot right.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Awhile ago I was contacted by a reporter here in Minnesota who wanted to do an article on unschooling.<br/>\n&gt; I passed it on to my local unschooling group. <br/>\n&gt; Here is how it turned out!<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.startribune.com/local/north/161685515.html?page=1&c=y%c2%a0\">http://www.startribune.com/local/north/161685515.html?page=1&c=y%c2%a0</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":473994495,"authorName":"am7055","from":"am7055 &lt;am7055@...&gt;","profile":"daretodance63","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: A new article on unschooling here in MN","postDate":"1341787662","msgId":48733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSGl6K1A2eWEzS3N6Sk1acjBNTzFfWVQ4NDkyNlUtbnpwNjhEVE1jVUVqcEVmRUJoZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGp0Y3JiOStrMmFqQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSGl6K1A0MldnQmU5NlNEcmVYX2swVU12LVBKRkZvMi00Wj1udUhIMDFHQ3pwV3JSQUBtYWlsLmdtYWlsLmNvbT4JPGp0Y3JiOStrMmFqQGVHcm91cHMuY29tPg=="},"prevInTopic":48732,"nextInTopic":48735,"prevInTime":48732,"nextInTime":48734,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Hi Meredith, Thanks for your insight--points well made! Two of our children are on the autism spectrum. Consequently, my husband and I are accustomed to trying","messageBody":"<div id=\"ygrps-yiv-686801284\">Hi Meredith,<br/>\n<br/>\nThanks for your insight--points well made!<br/>\n<br/>\nTwo of our children are on the autism spectrum. Consequently, my husband<br/>\nand I are accustomed to trying to be in tune with each of our kids,<br/>\nadapting ourselves to their needs and interests, in support of their<br/>\nextreme sensitivities and individual learning styles. To us, this lifestyle<br/>\nis natural (I agree, to others this could be a challenge). Even in our<br/>\nfamily, adjusting to changing development keeps us on our toes and<br/>\nnecessitates being flexible and resourceful.<br/>\n<br/>\nI&#39;m so glad I found this group! I look forward to reading more about the<br/>\nunschooling lifestyle, and learning from all of you.<br/>\n<br/>\nBest,<br/>\nAnne<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jul 8, 2012 at 1:42 PM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi, Anne, welcome to the group. I&#39;m going to jump in and highlight a<br/>\n&gt; couple common misconceptions about unschooling.<br/>\n&gt;<br/>\n&gt; &lt;am7055@...&gt; wrote:<br/>\n&gt; &gt;this natural lifestyle<br/>\n&gt;<br/>\n&gt; Unschooling isn&#39;t all that natural! It&#39;s much more natural for parents to<br/>\n&gt; have pretty strong expectations as to what kids will learn and how and even<br/>\n&gt; when. Unschooling can feel natural when kids interests and needs are<br/>\n&gt; similar to parents - but a whole lot of people fumble their way to<br/>\n&gt; unschooling because we have kids who don&#39;t fit neatly into our preconceived<br/>\n&gt; notions about kids and learning. That actually creates a bit of a<br/>\n&gt; communication gap between unschoolers at time! When kids and parents fit<br/>\n&gt; together well, unschooling seems natural - but when they don&#39;t, it&#39;s a big<br/>\n&gt; challenge for parents to learn to adapt to the needs and interests of very<br/>\n&gt; different children, especially when surrounded by a world full of messages<br/>\n&gt; that it&#39;s the job of parents to make Kids adapt, rather than adapting to<br/>\n&gt; help them navigate the world in ways which work for them, the kids.<br/>\n&gt;<br/>\n&gt; &gt;&gt;unschooling not only works, but is the<br/>\n&gt; &gt; better way than the &quot;brick and mortar&quot; schools<br/>\n&gt;<br/>\n&gt; It&#39;s not better for every family - it doesn&#39;t work for every family.<br/>\n&gt; Unschooling can depend heavily on parents&#39; ability to adapt to changing<br/>\n&gt; situations, and that adaptibility depends, in turn on the psychological and<br/>\n&gt; emotional resources of the parents. A parent who prefers to &quot;go with the<br/>\n&gt; flow&quot; and struggles to adapt to a child who needs routines is going to have<br/>\n&gt; as much difficulty unschooling as a parent who likes a lot of cleanliness<br/>\n&gt; and order, or a parent who needs a lot of emotional validation.<br/>\n&gt;<br/>\n&gt; &gt; These people just can&#39;t realize that they have been<br/>\n&gt; &gt; brainwashed.<br/>\n&gt;<br/>\n&gt; It really shocked me to realize how many of my enlightened alternative<br/>\n&gt; viewpoints were every bit as much scripts as the sorts of things my very<br/>\n&gt; traditional parents would say. When it comes to parenting, most of what<br/>\n&gt; &quot;everyone knows&quot; are things people repeat back and forth to each other, and<br/>\n&gt; the scripts used by alternative parents are mostly the same as other<br/>\n&gt; parents: children need to learn X. with the implication that they won&#39;t<br/>\n&gt; learn it without outside intervention.<br/>\n&gt;<br/>\n&gt; It helped me, personally, to touch base with the most basic principles of<br/>\n&gt; unschooling when I ran into those moments: learning is a basic human drive,<br/>\n&gt; and individual perceptions absolutely determines what is learned. Every<br/>\n&gt; other aspect of unschooling philosophy derives from those.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: A new article on unschooling here in MN","postDate":"1341780137","msgId":48731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0Y3JiOStrMmFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSGl6K1A0MldnQmU5NlNEcmVYX2swVU12LVBKRkZvMi00Wj1udUhIMDFHQ3pwV3JSQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48730,"nextInTopic":48732,"prevInTime":48730,"nextInTime":48732,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Hi, Anne, welcome to the group. I m going to jump in and highlight a couple common misconceptions about unschooling. ... Unschooling isn t all that natural!","messageBody":"<div id=\"ygrps-yiv-1761441407\">Hi, Anne, welcome to the group. I&#39;m going to jump in and highlight a couple common misconceptions about unschooling. <br/>\n<br/>\n&lt;am7055@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;this natural lifestyle<br/>\n<br/>\n </span></blockquote>Unschooling isn&#39;t all that natural! It&#39;s much more natural for parents to have pretty strong expectations as to what kids will learn and how and even when. Unschooling can feel natural when kids interests and needs are similar to parents - but a whole lot of people fumble their way to unschooling because we have kids who don&#39;t fit neatly into our preconceived notions about kids and learning. That actually creates a bit of a communication gap between unschoolers at time! When kids and parents fit together well, unschooling seems natural - but when they don&#39;t, it&#39;s a big challenge for parents to learn to adapt to the needs and interests of very different children, especially when surrounded by a world full of messages that it&#39;s the job of parents to make Kids adapt, rather than adapting to help them navigate the world in ways which work for them, the kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;unschooling not only works, but is the<br/>\n&gt; better way than the &quot;brick and mortar&quot; schools<br/>\n<br/>\n </span></blockquote>It&#39;s not better for every family - it doesn&#39;t work for every family. Unschooling can depend heavily on parents&#39; ability to adapt to changing situations, and that adaptibility depends, in turn on the psychological and emotional resources of the parents. A parent who prefers to &quot;go with the flow&quot; and struggles to adapt to a child who needs routines is going to have as much difficulty unschooling as a parent who likes a lot of cleanliness and order, or a parent who needs a lot of emotional validation. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; These people just can&#39;t realize that they have been<br/>\n&gt; brainwashed.<br/>\n<br/>\n </span></blockquote>It really shocked me to realize how many of my enlightened alternative viewpoints were every bit as much scripts as the sorts of things my very traditional parents would say. When it comes to parenting, most of what &quot;everyone knows&quot; are things people repeat back and forth to each other, and the scripts used by alternative parents are mostly the same as other parents: children need to learn X. with the implication that they won&#39;t learn it without outside intervention. <br/>\n<br/>\nIt helped me, personally, to touch base with the most basic principles of unschooling when I ran into those moments: learning is a basic human drive, and individual perceptions absolutely determines what is learned. Every other aspect of unschooling philosophy derives from those.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":473994495,"authorName":"am7055","from":"am7055 &lt;am7055@...&gt;","profile":"daretodance63","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] A new article on unschooling here in MN","postDate":"1341771466","msgId":48730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSGl6K1A0MldnQmU5NlNEcmVYX2swVU12LVBKRkZvMi00Wj1udUhIMDFHQ3pwV3JSQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNDE3NzAxMzcuMTc4NTQuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDEzNDE3NzAxMzcuMTc4NTQuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":48729,"nextInTopic":48731,"prevInTime":48729,"nextInTime":48731,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Hi Alex, What a great article! Congrats! I m new to this forum (my first day, in fact), and it is so nice to see other families thriving in this natural","messageBody":"<div id=\"ygrps-yiv-267002426\">Hi Alex,<br/>\n<br/>\nWhat a great article! Congrats!<br/>\n<br/>\nI&#39;m new to this forum (my first day, in fact), and it is so nice to see<br/>\nother families thriving in this natural lifestyle. I was very shocked to<br/>\nread the comments though; I thought there would be more positive feedback,<br/>\nyet most comments were obviously written from a fear and ignorance<br/>\nstandpoint. These people just can&#39;t realize that they have been<br/>\nbrainwashed.<br/>\n<br/>\nYet there is hope. Here in Vancouver Canada, there is more acceptance for<br/>\nso-called &quot;alternative&quot; lifestyles. I think we need more success stories to<br/>\nprove to these commenters that unschooling not only works, but is the<br/>\nbetter way than the &quot;brick and mortar&quot; schools.<br/>\n<br/>\n~Anne</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"A new article on unschooling here in MN","postDate":"1341770137","msgId":48729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDE3NzAxMzcuMTc4NTQuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":48730,"prevInTime":48728,"nextInTime":48730,"topicId":48729,"numMessagesInTopic":0,"msgSnippet":"Awhile ago I was contacted by a reporter here in Minnesota who wanted to do an article on unschooling. I passed it on to my local unschooling group.  Here is","messageBody":"<div id=\"ygrps-yiv-684468259\">Awhile ago I was contacted by a reporter here in Minnesota who wanted to do an article on unschooling.<br/>\nI passed it on to my local unschooling group. <br/>\nHere is how it turned out!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.startribune.com/local/north/161685515.html?page=1&c=y%c2%a0\">http://www.startribune.com/local/north/161685515.html?page=1&c=y%c2%a0</a><br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48738,"nextTopicId":48741}}