{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":99005687,"authorName":"Sherri","from":"&quot;Sherri&quot; &lt;sherrildr@...&gt;","profile":"sherrildr2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Need some tips on eliminating food waste - long!","postDate":"1222914772","msgId":36324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzYzAwMWM5MjQzNyQyYmY5MjgwMCQ5MzAyYThjMEBTaGVyQmVhcj4=","inReplyToHeader":"PEM5MDExQTMxLTMxNzgtNDY2Qi1BOEIyLTU4ODM2RjlDQ0FDN0Bjb3gubmV0Pg==","referencesHeader":"PGdidW9ncStqOXQ5QGVHcm91cHMuY29tPiA8QzkwMTFBMzEtMzE3OC00NjZCLUE4QjItNTg4MzZGOUNDQUM3QGNveC5uZXQ+"},"prevInTopic":36323,"nextInTopic":0,"prevInTime":36323,"nextInTime":36325,"topicId":36299,"numMessagesInTopic":0,"msgSnippet":"I cook two meals usually.  One for DH and whatever Faith says she wants. She eats what she wants and is hungry in an hour.  She eats about 5 times a day, very","messageBody":"<div id=\"ygrps-yiv-137468761\">I cook two meals usually.  One for DH and whatever Faith says she wants.<br/>\nShe eats what she wants and is hungry in an hour.  She eats about 5 times a<br/>\nday, very small amounts.  We are small family and I can&#39;t eat anything they<br/>\ncan due to health issues.  We have been doing this for years.  DH is usually<br/>\non a low carb food plan his choice and I ask Faith if she wants some of the<br/>\nprotein Daddy has or something different.  One of her fave&#39;s is fish sticks.<br/>\nWe have the quad&#39;s next door over once a week.  <br/>\n <br/>\nSherri<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Need some tips on eliminating food waste - long!","postDate":"1222908271","msgId":36323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5MDExQTMxLTMxNzgtNDY2Qi1BOEIyLTU4ODM2RjlDQ0FDN0Bjb3gubmV0Pg==","inReplyToHeader":"PGdidW9ncStqOXQ5QGVHcm91cHMuY29tPg==","referencesHeader":"PGdidW9ncStqOXQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":36321,"nextInTopic":36324,"prevInTime":36322,"nextInTime":36324,"topicId":36299,"numMessagesInTopic":0,"msgSnippet":"I know food issues. From my POV: Definitely go with making less (because more can always be made) Don t feel like because YOU won t find it appealing, that the","messageBody":"<div id=\"ygrps-yiv-1266229075\">I know food issues. From my POV:<br/>\n<br/>\nDefinitely go with making less (because more can always be made)<br/>\n<br/>\nDon&#39;t feel like because YOU won&#39;t find it appealing, that the kids  <br/>\nwon&#39;t. There are some things my kids would rather sit out for a while  <br/>\n(Rachel loves grated cheddar cheese that&#39;s been sitting out, after it  <br/>\ngets all greasy. I don&#39;t know why, she doesn&#39;t either, but it&#39;s never  <br/>\npoisoned her) Try saving it in the fridge in a ziplock box and let  <br/>\nthem pick it later.<br/>\n<br/>\nFor snacks we usually make the monkey platter that Nicole (?)  <br/>\nmentioned, and most of our meals are buffet style. Kind of put it  <br/>\ntogether, pick your own foods. Couple of veggies, rice or pasta  <br/>\nplain, and meat plain that they can sauce up they way they want.<br/>\n<br/>\nOur babies have always gone straight to table foods. I might steam  <br/>\ntheir veggies a little longer so that they are softer, and their meat  <br/>\nis cut very finely, but none of mine would eat special foods. They  <br/>\nwant what everyone else is eating.<br/>\n<br/>\nNone of my children have enjoyed cow&#39;s milk, and I&#39;ve never pushed  <br/>\nit, as I&#39;m lactose intolerant and grew up being forced to drink a  <br/>\nglass of milk every night before bed (and being sick all night and  <br/>\nthe next morning) &quot;But it&#39;s good for you!&quot; There are many other ways  <br/>\nto get calcium, beans, greens, yogurt and cheese, and high amounts of  <br/>\ncalcium can cause kidney stones. Potassium is just as important for  <br/>\nabsorption, and eating less calcium with a potassium source is a  <br/>\nbetter way to absorb and build bones. Same for just about everything  <br/>\nelse. If you read how lobbyists work within the FDA, you wouldn&#39;t  <br/>\ntrust a single one of those recommendations. I like the idea of  <br/>\nlooking at your kids. Look at their energy, their skin, their hair,  <br/>\ntheir overall happiness.<br/>\n<br/>\nAs for special needs, we have a few. I&#39;m the evil mom who let her  <br/>\nceliac son eat wheat. I know it&#39;s not ideal for him, eating wheat  <br/>\nraises their chance of cancer by 10%. And he was young, three or  <br/>\nfour. However, he had to know that it makes him sick, no matter if  <br/>\nother&#39;s in our celiac group supported me or not. And now he&#39;s five  <br/>\nyears old, and he will not choose to eat wheat. He&#39;s the only kid in  <br/>\nour support group that can, at this age, go in and order his own food  <br/>\nin a restaurant, verifying everything with waitresses. He doesn&#39;t  <br/>\nWANT to feel sick, and he knows that he makes the choices, they  <br/>\naren&#39;t made for him. I&#39;ll help and point stuff out, but I never say  <br/>\nno. I have a daughter allergic to corn, and another to milk. So these  <br/>\nare all things we&#39;ve had to work through.<br/>\n<br/>\nHTH, feel free to ask any questions. I&#39;m swiped today after a full  <br/>\nday out with kids. Big shopping day (speaking of food!)<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 30, 2008, at 9:50 PM, prism7513 wrote:<br/>\n<br/>\n&gt; Since my oldest has turned 6 and all her friends started kindergarten,<br/>\n&gt; I&#39;ve been delving more deeply into the idea of RADICAL unschooling.<br/>\n&gt; The academic side of unschooling (which I discovered 3 years ago) was<br/>\n&gt; rather easy for me to grasp and is a perfect fit for our family.<br/>\n&gt; However, the radical side has been harder to get my mind around, and I<br/>\n&gt; seem to get stuck on the littlest things.<br/>\n&gt;<br/>\n&gt; I&#39;ve finally decided to try to eliminate all the food limits I had. I<br/>\n&gt; didn&#39;t have many, and have never forced my children to eat all the<br/>\n&gt; food on their plate, and our meal times aren&#39;t rigid and I usually let<br/>\n&gt; them snack whenever. But now I want to let them decide when and how<br/>\n&gt; and what to eat...but I have one question - what tips do you use to<br/>\n&gt; eliminate food from being wasted?<br/>\n&gt;<br/>\n&gt; What I mean is this: when I cook, or fix something to eat, often times<br/>\n&gt; my children (the two oldest are 6 and 4) will say they want more than<br/>\n&gt; one food item. So I&#39;ll prepare it for them. But then they start eating<br/>\n&gt; and realize that they don&#39;t want both, after all. Now, sometimes the<br/>\n&gt; food is fine and can be refrigerated, but other times they took so<br/>\n&gt; long to eat (or not eat) or the food was cheese or something that<br/>\n&gt; becomes hard, or stale, or otherwise less than appetizing to eat<br/>\n&gt; later. And I don&#39;t mind that it wasn&#39;t eaten, but for budgeting and<br/>\n&gt; wasting less in general, I wonder if there&#39;s another way to offer them<br/>\n&gt; anything they want without letting food go bad?<br/>\n&gt;<br/>\n&gt; I&#39;m guessing that this won&#39;t last as the older my kids get the more<br/>\n&gt; they will be able to discern how much of which each food they want, or<br/>\n&gt; at least sample a little before getting huge amounts, etc.<br/>\n&gt;<br/>\n&gt; Also, with babies (I have almost 15 month old twins), I usually just<br/>\n&gt; put a little variety on their trays, same as what we are eating, since<br/>\n&gt; they can&#39;t tell me what they want. Most times they sample some of all,<br/>\n&gt; but don&#39;t eat much of it. But I wonder if any of you do something<br/>\n&gt; different for the littlest ones (they are still nursing, so I think<br/>\n&gt; that&#39;s a lot of it.)<br/>\n&gt;<br/>\n&gt; And lastly, I&#39;m learning that everything I thought I knew about<br/>\n&gt; nutrition is kind of out the window with radical unschooling! So I&#39;m<br/>\n&gt; wondering if there&#39;s ever a point to where you intervene with a<br/>\n&gt; child&#39;s diet? If they become overweight? If they never consume<br/>\n&gt; calcium? (my kids have all refused the bottle and never liked milk<br/>\n&gt; after weaned, and don&#39;t particularly like broccoli or spinach,<br/>\n&gt; either...but I just have hoped that they don&#39;t need it, then...) What<br/>\n&gt; if they have special needs, like cystic fibrosis? (a new friend I made<br/>\n&gt; feeds her son enzymes depending on what he eats.) Just curious.<br/>\n&gt;<br/>\n&gt; Thank you for any and all tips!<br/>\n&gt;<br/>\n&gt; Deb<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Need some tips on eliminating food waste - long!","postDate":"1222907216","msgId":36321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjMTRnZyt0cW4yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdidW9ncStqOXQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":36308,"nextInTopic":36323,"prevInTime":36320,"nextInTime":36322,"topicId":36299,"numMessagesInTopic":0,"msgSnippet":"... them ... Mo cycles through stages where her appetite is very small, so I ve gotten used to giving her a miniscule bit of anything (like four pieces of","messageBody":"<div id=\"ygrps-yiv-1361888538\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;prism7513&quot; &lt;penley75@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;but for budgeting and<br/>\n&gt; wasting less in general, I wonder if there&#39;s another way to offer <br/>\n </span></blockquote>them<br/>\n<blockquote><span title=\"ireply\"> &gt; anything they want without letting food go bad?<br/>\n<br/>\n </span></blockquote>Mo cycles through stages where her appetite is very small, so I&#39;ve <br/>\ngotten used to giving her a miniscule bit of anything (like four <br/>\npieces of popcorn and a grape) and several helpings if she wants <br/>\nmore. Little bitty plates help a lot! Really, with a small plate its <br/>\neasier to create itty bitty portions. You just naturally adjust for <br/>\nthe size of the &quot;container&quot; as it were.  More than that, tiny plates <br/>\nand bowls mean that when she gets herself something she <br/>\nautomatically creates smaller portions. So even if she&#39;s in the &quot;one <br/>\nbite and I&#39;m full&quot; stage, there&#39;s less to throw away. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;when I cook, or fix something to eat, often times<br/>\n&gt; my children (the two oldest are 6 and 4) will say they want more <br/>\n </span></blockquote>than<br/>\n<blockquote><span title=\"ireply\"> &gt; one food item. <br/>\n<br/>\n </span></blockquote>Do you know what a &quot;monkey platter&quot; is? Its kind of a variation on <br/>\nthe tiny portion idea - you offer small portions of several <br/>\ndifferent things all at once. With Mo, I&#39;ll sometimes bring her a <br/>\nplate with half a dozen things on it, but tiny portions. If I&#39;m <br/>\nmaking something for both kids and me besides I&#39;ll do something more <br/>\nlike a little buffet on a tray - a whole bunch of finger foods that <br/>\nanyone can grab. I try not to have any expectations as to what the <br/>\nkids are going to eat - just toss out a variety of options and <br/>\nrefill what gets eaten fastest.<br/>\n<br/>\nWe do have supper most evenings, but generally its me and George and <br/>\nRay, since Mo tends to eat on a different schedule than the rest of <br/>\nus and is still pretty conservative as to what she&#39;ll eat.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And lastly, I&#39;m learning that everything I thought I knew about<br/>\n&gt; nutrition is kind of out the window with radical unschooling! So <br/>\n </span></blockquote>I&#39;m<br/>\n<blockquote><span title=\"ireply\"> &gt; wondering if there&#39;s ever a point to where you intervene with a<br/>\n&gt; child&#39;s diet?<br/>\n<br/>\n </span></blockquote>It helps to look at what kids eat over a period of a week to a <br/>\nmonth, rather than in a single day. They really *do* cover all the <br/>\nnutritional bases, they just don&#39;t do it the way you might expect. <br/>\nThe other thing to keep in mind is that its normal for appetites to <br/>\ngo up and down in relation to growth spurts - and when appetite is <br/>\nlow is often when you&#39;ll see the least overall &quot;nutritional density&quot; <br/>\nin their food choices. That&#39;s when parents tend to panic and start <br/>\nwanting to &quot;intervene&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;my kids have all refused the bottle and never liked milk<br/>\n&gt; after weaned, and don&#39;t particularly like broccoli or spinach,<br/>\n&gt; either...but I just have hoped that they don&#39;t need it, then..<br/>\n<br/>\n </span></blockquote>Its also helpful to take a good look at your kids and see: are they <br/>\nenergetic? happy? do their eyes sparkle? hair shine? skin resilient? <br/>\nTry to focus on the whole, rather than getting bogged down in the <br/>\ndetails of what they (don&#39;t) eat as an indicator of health.<br/>\n<br/>\nMilk, broccoli and spinach are all tough to digest. And there are <br/>\nother sources for the nutrients that don&#39;t have the same strong <br/>\nflavors that can be overwhelming to some children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What<br/>\n&gt; if they have special needs<br/>\n<br/>\n </span></blockquote>Kids want to be healthy and feel good. Its possible to work in <br/>\npartnership with children to help them understand *which* foods help <br/>\nthem feel good on a regular and longer term basis. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":224031522,"authorName":"Zoa Conner","from":"Zoa Conner &lt;zoaconner@...&gt;","profile":"zoaconner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Need some tips on eliminating food waste - long!","postDate":"1222858896","msgId":36308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1MDhEMEQwLjEwQUMyJXpvYWNvbm5lckBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGdidW9ncStqOXQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":36299,"nextInTopic":36321,"prevInTime":36307,"nextInTime":36309,"topicId":36299,"numMessagesInTopic":0,"msgSnippet":"Congratulations on being ready to trust your kids food choices. For those of us who love food (cooking and eating!) it is a hard step to take. At my house, my","messageBody":"<div id=\"ygrps-yiv-1159893755\">Congratulations on being ready to trust your kids food choices. For<br/>\nthose of us who love food (cooking and eating!) it is a hard step to<br/>\ntake. At my house, my kids can eat what they want, but that does<br/>\nnot mean I stopped sharing information about nutrition, food waste,<br/>\nor ways to keep your body healthy and strong. Here are some<br/>\nquestions that I can be heard to ask or say:<br/>\n* are you munchy or starving?<br/>\n* would you like some water while I make a snack for you?<br/>\n* I know you are very hungry now. Do you want a portion of<br/>\ndinner now so you can eat dinner with the rest of us in about<br/>\n* 15 minutes? <br/>\n* Would it work for you to eat this first and then I¹ll make the<br/>\nother thing if you are still hungry?<br/>\n* Can I make that second thing you want after I eat with you?<br/>\n* Wow, you want a bagel, sausage, cereal, and something sweet<br/>\nfor breakfast? (from my 5 year old) Which one shall we start with?<br/>\n* I think I¹ll save this for later. If you find that you have space,<br/>\nI¹ll be happy to get it back out for you (so you can not leave the<br/>\nfood sitting out for long periods of time)<br/>\n* Wow, this cheese has been sitting out and has gotten hard<br/>\nand yucky. I think I can use it in cooking, but I wouldn¹t want to<br/>\njust sit here and eat it. Next time, can you let me know if you¹re<br/>\nnot going to eat it so I can wrap it up and put it in the fridge<br/>\nplease? I prefer not let food get thrown away when someone could<br/>\nhave eaten it instead.<br/>\n* You¹d like 27 sandwiches? I think that might be enough for<br/>\neveryone¹s snack. Can we all share? Or you can cut the sandwich<br/>\ninto tiny pieces ­ 27 of them.<br/>\n<br/>\nAlso, you can suggest foods that can sit out for longer periods of<br/>\ntime. Maybe make a snack area or a tray of sitting-out-for-a-long-time<br/>\nfoods that they can access anytime.<br/>\n<br/>\nFor the 15 month olds, try putting the food in little serving bowls (for<br/>\nstorage when you are done). Their communication skills might be good<br/>\nenough (now or soon!) for them to indicate which bowl they want food<br/>\nfrom. Put a piece or two from each bowl with names in front of them.<br/>\nAsk them if they liked the cantaloupe when they are eating it. I¹m<br/>\nsure you can tell which foods they like and which foods they are<br/>\ngrabbing first.<br/>\n<br/>\nI am finding that there is no need for me to intervene with my kids<br/>\ndiets - as long as I don¹t stop talking to them about healthy bodies<br/>\nand why I choose to eat A instead of B. I might say if I felt they way<br/>\nyou do, I would feed my body protein (or whatever). Maybe it will<br/>\nhelp to mentally shift back to the ³eat healthy over a week² mentality<br/>\nthat you might have had when your older kids were toddlers. You<br/>\nknow ­ average what they eat over a week to look for a balance in<br/>\nfood intake. I¹ll bet if you write everything that goes in the older<br/>\nkids¹ mouths in a day or a week, it will be not so scary looking to<br/>\nyou. I also assume that you have plenty of different kinds of foods<br/>\nin your home (and that you offer the kids) for them to choose from.<br/>\n<br/>\nEnjoy,<br/>\nZoa<br/>\n----------------<br/>\nZoa Conner, PhD<br/>\nPhysicist and Organic Learning Mother<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoaconner@...\">zoaconner@...</a><br/>\n*Handmade stuff @ earthyzee.etsy.com <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":356893003,"authorName":"prism7513","from":"&quot;prism7513&quot; &lt;penley75@...&gt;","profile":"prism7513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Need some tips on eliminating food waste - long!","postDate":"1222829402","msgId":36299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdidW9ncStqOXQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36308,"prevInTime":36298,"nextInTime":36300,"topicId":36299,"numMessagesInTopic":0,"msgSnippet":"Since my oldest has turned 6 and all her friends started kindergarten, I ve been delving more deeply into the idea of RADICAL unschooling. The academic side of","messageBody":"<div id=\"ygrps-yiv-1800085987\">Since my oldest has turned 6 and all her friends started kindergarten,<br/>\nI&#39;ve been delving more deeply into the idea of RADICAL unschooling.<br/>\nThe academic side of unschooling (which I discovered 3 years ago) was<br/>\nrather easy for me to grasp and is a perfect fit for our family.<br/>\nHowever, the radical side has been harder to get my mind around, and I<br/>\nseem to get stuck on the littlest things.<br/>\n<br/>\nI&#39;ve finally decided to try to eliminate all the food limits I had. I<br/>\ndidn&#39;t have many, and have never forced my children to eat all the<br/>\nfood on their plate, and our meal times aren&#39;t rigid and I usually let<br/>\nthem snack whenever. But now I want to let them decide when and how<br/>\nand what to eat...but I have one question - what tips do you use to<br/>\neliminate food from being wasted?<br/>\n<br/>\nWhat I mean is this: when I cook, or fix something to eat, often times<br/>\nmy children (the two oldest are 6 and 4) will say they want more than<br/>\none food item. So I&#39;ll prepare it for them. But then they start eating<br/>\nand realize that they don&#39;t want both, after all. Now, sometimes the<br/>\nfood is fine and can be refrigerated, but other times they took so<br/>\nlong to eat (or not eat) or the food was cheese or something that<br/>\nbecomes hard, or stale, or otherwise less than appetizing to eat<br/>\nlater. And I don&#39;t mind that it wasn&#39;t eaten, but for budgeting and<br/>\nwasting less in general, I wonder if there&#39;s another way to offer them<br/>\nanything they want without letting food go bad?<br/>\n<br/>\nI&#39;m guessing that this won&#39;t last as the older my kids get the more<br/>\nthey will be able to discern how much of which each food they want, or<br/>\nat least sample a little before getting huge amounts, etc. <br/>\n<br/>\nAlso, with babies (I have almost 15 month old twins), I usually just<br/>\nput a little variety on their trays, same as what we are eating, since<br/>\nthey can&#39;t tell me what they want. Most times they sample some of all,<br/>\nbut don&#39;t eat much of it. But I wonder if any of you do something<br/>\ndifferent for the littlest ones (they are still nursing, so I think<br/>\nthat&#39;s a lot of it.)<br/>\n<br/>\nAnd lastly, I&#39;m learning that everything I thought I knew about<br/>\nnutrition is kind of out the window with radical unschooling! So I&#39;m<br/>\nwondering if there&#39;s ever a point to where you intervene with a<br/>\nchild&#39;s diet? If they become overweight? If they never consume<br/>\ncalcium? (my kids have all refused the bottle and never liked milk<br/>\nafter weaned, and don&#39;t particularly like broccoli or spinach,<br/>\neither...but I just have hoped that they don&#39;t need it, then...) What<br/>\nif they have special needs, like cystic fibrosis? (a new friend I made<br/>\nfeeds her son enzymes depending on what he eats.) Just curious.<br/>\n<br/>\nThank you for any and all tips!<br/>\n<br/>\nDeb</div>","specialLinks":[]}],"prevTopicId":36317,"nextTopicId":36309}}