{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] how to introduce unschooling to your children","postDate":"1150088016","msgId":14438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODVCRjM0QzlENjBCQi0xQUIwLTNGQjlAbWJsay1kMjAuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg==","referencesHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg=="},"prevInTopic":14430,"nextInTopic":0,"prevInTime":14437,"nextInTime":14439,"topicId":14400,"numMessagesInTopic":0,"msgSnippet":"... From: Barbara Miller  OK, say we decide to unschool.  How do you tell your kids about it? How do you explain that instead of doing","messageBody":"<div id=\"ygrps-yiv-1094487504\">-----Original Message-----<br/>\nFrom: Barbara Miller &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BarbMiller@...\">BarbMiller@...</a>&gt;<br/>\n<br/>\n<br/>\nOK, say we decide to unschool.  How do you tell your kids about it?  <br/>\nHow do<br/>\nyou explain that instead of doing various subjects, etc., they will be <br/>\ndoing<br/>\nlife?  How do you explain in a positive way that we won&#39;t have summer<br/>\nvacation?  (Yes, it was me that asked about summer vacation the other <br/>\nday -<br/>\nmy family doesn&#39;t obsess about summer - these are just the thoughts <br/>\ngoing<br/>\nthrough my head since summer is somewhat looked forward to).<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAs with most things. it depends. &lt;g&gt;<br/>\n<br/>\nI think it depends on your kids, your relationship with your kids, the <br/>\ntime of year, your issues, their concerns, their friends---lots of <br/>\nthings.<br/>\n<br/>\nProbably the best and safest is to just start summer vacation as usual <br/>\nand simply don&#39;t stop, come September (or first of August around here! <br/>\n&lt;g&gt;). Just keep on going as if the summer vacation never ends.<br/>\n<br/>\nIf they ask, just say that it&#39;s been going so well so far. Let&#39;s keep <br/>\ngoing.<br/>\n<br/>\nIf they question further, you can actually use the word, unschooling, <br/>\nand explain how it works. How you realize that they are natural born <br/>\nlearners. That they have shown you how incredibly smart and creative <br/>\nand curious they are---and that you found other unschooling parents who <br/>\nbelieve that this is the best way that people learn, and they&#39;re <br/>\nwilling to answer all your questions, so you have latched on to it too.<br/>\n<br/>\nYou can give them some of the books to read or find them some <br/>\nunschooling e-penpals or locals to hang with or go to the Live and <br/>\nLearn Unschooling Conference, held September 6-10, 2006 in Albuquerque, <br/>\nNM.<br/>\n<br/>\nYou can be as natural or as &quot;lay-it-out-for-them-in-black-and-white&quot; as <br/>\nyou need to be. Depends on the kids.<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nSo you tell them they aren&#39;t going to be doing school anymore <br/>\n(background of<br/>\ndancing and cheers), but then what do you say when they ask what you are<br/>\ngoing to do?  How do you introduce this pretty new and more or less <br/>\ntotally<br/>\nforeign concept?  Those of you who switched from homeschooling to<br/>\nunschooling - how did you do it?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI screwed up! &lt;g&gt;<br/>\n<br/>\nI couldn&#39;t let go of the schooly stuff in my  head. I can better tell <br/>\nyou what NOT to do! &lt;bwg&gt;<br/>\n<br/>\nDon&#39;t nag.<br/>\nDon&#39;t ask them: &quot;When will you ever pick up a book?&quot;<br/>\nDon&#39;t make them write synopses or draw pictures of the short story you <br/>\njust read to them.<br/>\nDon&#39;t pack the car and say: &quot;Wow! See? That&#39;s geometry!&quot;<br/>\nDon&#39;t make them bake brownies and double or halve the recipe to see <br/>\nwhether they know how to multiply or divide fractions.<br/>\nDon&#39;t let your father have them for the afternoon to &quot;teach&quot; them who <br/>\nthe Lord Proprietors were.<br/>\n<br/>\n<br/>\n&lt;g&gt;<br/>\n<br/>\nDO read to them or get them books on CD **if** they like  that.<br/>\nDO stay in your pjs , make popcorn, order pizza, and watch movies all <br/>\nday **if** they like that.<br/>\nDO get catalogues and ask that they circle ALL the things they think <br/>\nthey might like. (toys or books or games or clothes or---whatever!!)<br/>\nDO buy cool new games and toys and books and clothes <br/>\nand---whatever---you can afford.<br/>\nDO go out to ethnic restaurants and just enjoy the food/atmosphere.DO <br/>\nfeed their passions, even if they are not passions you share.<br/>\n<br/>\nIf they ask, just say that the only thing you want for them is a happy, <br/>\njoyful life. And since the shortest distance between two points is a <br/>\nstraight line (OHMYGAWD! MATH! &lt;G&gt;), you&#39;re going to give them a happy, <br/>\njoyful childhood---starting NOW!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<br/>\nThen you start unschooling, things are starting to hum along, more or <br/>\nless,<br/>\nthen what do you say to the question of &quot;will we get a vacation?&quot;  I&#39;m <br/>\nsure<br/>\nsome of you will respond with something like &quot;we are already on <br/>\nvacation!&quot;<br/>\nBut that might not go over with the kids.  Do they just eventually see <br/>\nthat<br/>\nit is life and true freedom so they won&#39;t be envious at all when they <br/>\nsee<br/>\ntheir friends out of school?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAsk, &quot;What kind of vacation are you thinking of?&quot; And then do it, if <br/>\nit&#39;s in the budget.<br/>\n<br/>\nYes, they eventually *will* see it. But maybe not before they question <br/>\nit.<br/>\n<br/>\nThey may catch hell from friends who tell them they will be stupid <br/>\n(&#39;cause that&#39;s what those kids hear from their parents), but as they <br/>\ngrow and learn, they will see a DISTINCT difference. And all the other <br/>\nkids will be envying them because they&#39;re living their lives as if <br/>\nschool didn&#39;t exist.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\nI realize a lot of this is just that I am still trying to grasp the <br/>\nconcept.<br/>\nAnd I really am intrigued and interested in the concept.  Now I&#39;m <br/>\ntrying to<br/>\ngrasp how the kids will react to unschooling.  Thanks in advance for <br/>\nhelping<br/>\nthis newbie to try to see how this might work.  If unschooling was your <br/>\nidea<br/>\n(vs. your child&#39;s), I&#39;m interested to hear how you told them about it. <br/>\n:-)<br/>\n<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nHard to tell how the kids will react. It depends. &lt;g&gt;<br/>\n<br/>\nI told Cameron up front. But because I understood the concept, but not <br/>\nnecessarily how to put it into action (this comes a LOT easier to <br/>\nparents whose kids have never been to school or schooled-at-home! <br/>\nThey&#39;ve been doing it all along!), it was slow going. My heart said one <br/>\nthing, but my mouth said another!<br/>\n<br/>\nBetter to stop and breathe before you say a word. *Think* whether what <br/>\nyou say will help or hurt the siruation/relationship, then speak. <br/>\nApologize when you screw up and move on.<br/>\n<br/>\nDeschooling should take approximately one month for each year your <br/>\nchild was in school or schooled-at-home.<br/>\n<br/>\nBUT you also have to remember that *you* were also schooled. You need <br/>\nto deschool too. And it will also take *you* one month for each year <br/>\nyou were in school! Yikes! &lt;g&gt;<br/>\n<br/>\nAND---if you screw up and make him do a worksheet or read against his <br/>\nwill or force some math problem on him, you get to start all over again <br/>\nand start your one month for each year counting again! Yech!<br/>\n<br/>\nIt took 18 months or so to deschool Cameron, who was schooled for eight <br/>\nyears, because I couldn&#39;t let go.<br/>\n<br/>\nTrust your child. Respect him. Be patient! Bite your tongue. It&#39;ll be <br/>\nover far faster! &lt;g&gt;<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot;  <br/>\n~Frank Smith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] how to introduce unschooling to your children","postDate":"1150083163","msgId":14430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhBNUM2NEEyLTQ4M0ItNEE3MC04M0I5LUVEOEU5OEQzNjFBOUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg==","referencesHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg=="},"prevInTopic":14427,"nextInTopic":14438,"prevInTime":14429,"nextInTime":14431,"topicId":14400,"numMessagesInTopic":0,"msgSnippet":"... You re not there yet - the question of summer vacation makes sense to you, but not to unschoolers. So - I m sure others will say the same thing - just say","messageBody":"<div id=\"ygrps-yiv-598567339\">On Jun 11, 2006, at 12:40 PM, Barbara Miller wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Then you start unschooling, things are starting to hum along, more  <br/>\n&gt; or less,<br/>\n&gt; then what do you say to the question of &quot;will we get a vacation?&quot;   <br/>\n&gt; I&#39;m sure<br/>\n&gt; some of you will respond with something like &quot;we are already on  <br/>\n&gt; vacation!&quot;<br/>\n&gt; But that might not go over with the kids.  Do they just eventually  <br/>\n&gt; see that<br/>\n&gt; it is life and true freedom so they won&#39;t be envious at all when  <br/>\n&gt; they see<br/>\n&gt; their friends out of school?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I realize a lot of this is just that I am still trying to grasp the  <br/>\n&gt; concept.<br/>\n<br/>\n </span></blockquote>You&#39;re not there yet - the question of summer vacation makes sense to  <br/>\nyou, but not to unschoolers.<br/>\n<br/>\nSo - I&#39;m sure others will say the same thing - just say you&#39;re  <br/>\nstarting summer vacation right now, today. Then never stop.<br/>\n<br/>\nIn a few months the kids might ask, &quot;Hey, when is vacation going to  <br/>\nbe over?&quot; You can say, &quot;I think we&#39;ll just keep on as we are -  I  <br/>\ndon&#39;t want to interrupt all the cool things you&#39;ve been doing.&quot; IF  <br/>\nthey get to the point of saying things like, &quot;But, mom, I&#39;m not  <br/>\nlearning anything!&quot; then it is time to talk to them about unschooling.<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2573098,"authorName":"Barbara Miller","from":"&quot;Barbara Miller&quot; &lt;BarbMiller@...&gt;","profile":"prosperbarb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] how to introduce unschooling to your children","postDate":"1150080261","msgId":14427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmEwMWM2OGRjYSQxYzUzYzUwMCQ2NTAyYThjMEBiYXJibWNlPg==","inReplyToHeader":"PDdDQUU1QzMzLTJFREYtNDJCOC1BRUFFLTk1N0M4MjgzQ0QyREBjb3gubmV0Pg=="},"prevInTopic":14422,"nextInTopic":14430,"prevInTime":14426,"nextInTime":14428,"topicId":14400,"numMessagesInTopic":0,"msgSnippet":"What do you normally do for summer vacation? Do you go somewhere? Do you do anything special besides stop assigning schoolwork? ******** Not really - we swim,","messageBody":"<div id=\"ygrps-yiv-1376929057\">What do you normally do for summer vacation? Do you go somewhere? Do <br/>\nyou do anything special besides stop assigning schoolwork? <br/>\n<br/>\n******** Not really - we swim, sometimes go to a theme park, have relatives<br/>\nvisit, but mostly just hang out, participate in summer reading programs, and<br/>\ntry to do as little activities as possible. &lt;g&gt;<br/>\n<br/>\nis there someplace you wanted to stop? And we went there, no matter <br/>\nwhat I felt about it. So the first few weeks we went to three <br/>\npetstores, two comic book shops, a hardware store, and the florist. <br/>\nNo place really big, but places they&#39;d always wanted to go but I said <br/>\nlater or not now, or we&#39;re too busy.<br/>\n<br/>\n********* that sounds like fun.  The kids don&#39;t ask too much to go different<br/>\nplaces, but if I asked them, I might be surprised.<br/>\n<br/>\nIf you&#39;re kids ask when they will get a vacation, ask them what they <br/>\nhad in mind.<br/>\n<br/>\n*********OK, I&#39;m seeing the light a little.  We don&#39;t travel a whole lot<br/>\n(although I enjoy it and after our recent vacation my hubby and I said we<br/>\nwant to do it more often.)  But, I&#39;m getting it.  If their idea of a<br/>\nvacation is not doing school, so to speak, and we aren&#39;t doing school, so to<br/>\nspeak... ah ha - I&#39;m getting it!  :-)<br/>\n<br/>\n<br/>\nWhat are YOU seeing as unschooling? What are you seeing them do every day?<br/>\n<br/>\n********Now that is an easier question to answer.  My oldest has developed a<br/>\nsomewhat recent interest in acting.  She loves reading, both fiction,<br/>\nbiographies, and historical fiction.  She also enjoys messing around with<br/>\nher website and editing homemade videos she and her sisters and friends<br/>\nmake.  I could easily see her unschooling.  My 10 yo loves dancing and is<br/>\nlooking forward to getting point shoes in the near future.  She reads, but<br/>\nenjoys more entertainment type books - Calvin and Hobbes, The Great Brain<br/>\n(my old books - I LOVED those growing up) - not into the nonfiction-type<br/>\nstuff - and yes, I know that is fine - that is just how she is.  :-)  She<br/>\nhas shown an interest in mechanical-type stuff.  One year we got her a<br/>\ntoolbox with some tools for Christmas.  My 6 yo - well, who knows what her<br/>\ninterests are yet.  But she is just 6.  On the one hand, I can easily see<br/>\nunschooling at her age b/c I think most homeschooling parents try to way<br/>\noverdo it at young ages, but on the other hand, I think it is a little<br/>\nharder.  But, I imagine at her age, you just let them play - that is<br/>\nlearning enough!  :-)  And all of my kids like animals - like their mom. We<br/>\nhave had lots of different pets over the years and my 10 yo is waiting for<br/>\nher bunny she picked out to be weaned.<br/>\n<br/>\nThanks for the responses.  I&#39;m looking forward to talking more with my<br/>\nhusband after I get done reading The Teenage Liberation Handbook and doing<br/>\nsome more research.  We talked some about it on a date last week and I think<br/>\nhe is definitely open to the idea. Well, off to surf the web..<br/>\n<br/>\nBarbara, to whom unschooling is becoming a little clearer every day<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n.<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://geo.yahoo.com/serv?s=97359714&grpId=12789513&grpspId=1600081972&msgI\">http://geo.yahoo.com/serv?s=97359714&grpId=12789513&grpspId=1600081972&msgI</a><br/>\nd=14422&stime=1150071624&gt; <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] how to introduce unschooling to your children","postDate":"1150071968","msgId":14422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDQUU1QzMzLTJFREYtNDJCOC1BRUFFLTk1N0M4MjgzQ0QyREBjb3gubmV0Pg==","inReplyToHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg==","referencesHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg=="},"prevInTopic":14420,"nextInTopic":14427,"prevInTime":14421,"nextInTime":14423,"topicId":14400,"numMessagesInTopic":0,"msgSnippet":"We didn t tell our kids anything. We just stopped saying that it was time for work, and kept doing our morning routine til it was afternoon. Then we did our","messageBody":"<div id=\"ygrps-yiv-1836931036\">We didn&#39;t tell our kids anything. We just stopped saying that it was  <br/>\ntime for work, and kept doing our morning routine til it was  <br/>\nafternoon. Then we did our afternoon routine til it was night. Then  <br/>\nwe tucked them in, slept all night, and did it again. Our homeschool  <br/>\nroutine was pretty, well, routine. Wake up, make beds, eat breakfast.  <br/>\nplay for an hour, do an hour or two of table time, eat lunch, tidy  <br/>\nthe dining and kitchen. Then some quiet time, older kids reading and  <br/>\nyounger being read to, then get up, do a couple of chores, prepare  <br/>\ndinner, eat, dishes, play around, sleep. Not hard to just drop that  <br/>\nhour of table time, and tbh, most of the kids prefer the routine,  <br/>\nminus the chores, and the table time is just craft time or video  <br/>\ngames. Honestly, that schedule got us through a years&#39; worth of  <br/>\ncurriculum in four months. Now it&#39;s getting us through life one day  <br/>\nat a time.<br/>\n<br/>\nWhat do you normally do for summer vacation? Do you go somewhere? Do  <br/>\nyou do anything special besides stop assigning schoolwork? If you  <br/>\ntravel, why would you not do that? If you go to theme parks, do it.  <br/>\nDo what you always do for summer. Because what we&#39;re doing day to day  <br/>\nisn&#39;t stuff the kids don&#39;t want to do, so they aren&#39;t desiring that  <br/>\nbreak that they used to have in the summer.<br/>\n<br/>\nWe didn&#39;t even tell them that we weren&#39;t doing school. When (if) they  <br/>\nasked, we just said we were taking a break. When they asked what  <br/>\nwe&#39;re going to do, I&#39;d say something like, well, I need to go to IGA,  <br/>\nis there someplace you wanted to stop? And we went there, no matter  <br/>\nwhat I felt about it. So the first few weeks we went to three  <br/>\npetstores, two comic book shops, a hardware store, and the florist.  <br/>\nNo place really big, but places they&#39;d always wanted to go but I said  <br/>\nlater or not now, or we&#39;re too busy.<br/>\n<br/>\nIf you&#39;re kids ask when they will get a vacation, ask them what they  <br/>\nhad in mind. If they are used to traveling, travel. I don&#39;t  <br/>\nunderstand why they would be envious of other schoolers. If they get  <br/>\nto stay at home without someone assigning work or making them do  <br/>\nmeaningless mindnumbing number crunching, what would the problem be?  <br/>\nWhat are YOU seeing as unschooling?What are you seeing them do every  <br/>\nday?<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 11, 2006, at 2:40 PM, Barbara Miller wrote:<br/>\n<br/>\n&gt; Got another question. Refresher - I&#39;ve homeschooled for 7 years - my 3<br/>\n&gt; kids, ages 12, 10, and 6 have always been homeschooled, fwiw.<br/>\n&gt;<br/>\n&gt; OK, say we decide to unschool. How do you tell your kids about it?  <br/>\n&gt; How do<br/>\n&gt; you explain that instead of doing various subjects, etc., they will  <br/>\n&gt; be doing<br/>\n&gt; life? How do you explain in a positive way that we won&#39;t have summer<br/>\n&gt; vacation? (Yes, it was me that asked about summer vacation the  <br/>\n&gt; other day -<br/>\n&gt; my family doesn&#39;t obsess about summer - these are just the thoughts  <br/>\n&gt; going<br/>\n&gt; through my head since summer is somewhat looked forward to).<br/>\n&gt;<br/>\n&gt; So you tell them they aren&#39;t going to be doing school anymore  <br/>\n&gt; (background of<br/>\n&gt; dancing and cheers), but then what do you say when they ask what  <br/>\n&gt; you are<br/>\n&gt; going to do? How do you introduce this pretty new and more or less  <br/>\n&gt; totally<br/>\n&gt; foreign concept? Those of you who switched from homeschooling to<br/>\n&gt; unschooling - how did you do it?<br/>\n&gt;<br/>\n&gt; Then you start unschooling, things are starting to hum along, more  <br/>\n&gt; or less,<br/>\n&gt; then what do you say to the question of &quot;will we get a vacation?&quot;  <br/>\n&gt; I&#39;m sure<br/>\n&gt; some of you will respond with something like &quot;we are already on  <br/>\n&gt; vacation!&quot;<br/>\n&gt; But that might not go over with the kids. Do they just eventually  <br/>\n&gt; see that<br/>\n&gt; it is life and true freedom so they won&#39;t be envious at all when  <br/>\n&gt; they see<br/>\n&gt; their friends out of school?<br/>\n&gt;<br/>\n&gt; I realize a lot of this is just that I am still trying to grasp the  <br/>\n&gt; concept.<br/>\n&gt; And I really am intrigued and interested in the concept. Now I&#39;m  <br/>\n&gt; trying to<br/>\n&gt; grasp how the kids will react to unschooling. Thanks in advance for  <br/>\n&gt; helping<br/>\n&gt; this newbie to try to see how this might work. If unschooling was  <br/>\n&gt; your idea<br/>\n&gt; (vs. your child&#39;s), I&#39;m interested to hear how you told them about  <br/>\n&gt; it. :-)<br/>\n&gt;<br/>\n&gt; Barbara<br/>\n&gt;<br/>\n&gt; PS Thanks for the links. I&#39;ve been looking through them. I didn&#39;t  <br/>\n&gt; see this<br/>\n&gt; addressed - if I missed it and someone has a handy link, I&#39;d like  <br/>\n&gt; to see it.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: how to introduce unschooling to your children","postDate":"1150063743","msgId":14420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2aTQ5ditrczVhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg=="},"prevInTopic":14403,"nextInTopic":14422,"prevInTime":14419,"nextInTime":14421,"topicId":14400,"numMessagesInTopic":0,"msgSnippet":"... We were tired of doing stupid schoolwork.  I used to have what I called JOY days which were basically days with no written academic work.  We d still do","messageBody":"<div id=\"ygrps-yiv-1482786325\"><blockquote><span title=\"ireply\">&gt; Those of you who switched from homeschooling to unschooling -<br/>\n&gt; how did you do it?<br/>\n<br/>\n </span></blockquote>We were tired of doing stupid schoolwork.  I used to have what I <br/>\ncalled JOY days which were basically days with no written academic <br/>\nwork.  We&#39;d still do fun things like go to the movies, library, eat <br/>\nat the mall, read a book aloud, play games, etc.  As I read more <br/>\nabout unschooling (my 3rd big jump into the unschooling philosophy <br/>\nactually), I claimed more JOY days.  Sometimes, we&#39;d have our Math <br/>\nout and I&#39;d ask the kids if they knew the concept being taught and <br/>\nif they said yes, I&#39;d say let&#39;s close that dumb book and do <br/>\nsomething different.  <br/>\n<br/>\nWhen I finally made the leap to really call us unschoolers, we held <br/>\na family meeting to discuss our lifestyle changes.  Because the one <br/>\nthing I didn&#39;t do the previous 2 times I tried unschooling was to <br/>\nchange our entire lifestyle into radical unschooling.  We didn&#39;t <br/>\nreally talk about not doing schoolwork, but instead focused on <br/>\nchanges in our lives.  The biggest two changes were eliminating <br/>\nbedtimes and official meal times.  We discussed these changes as a <br/>\nfamily to make sure that mutual respect and kindness were keys to <br/>\nsuccess.  For example, my DH goes to sleep around 11:00pm and wakes <br/>\nup at 6:00am to get ready for work.  He doesn&#39;t like a lot of noise <br/>\nwhen he&#39;s trying to sleep.  The kids decided doing quiet activities <br/>\nduring dad&#39;s sleeping would be kindest thing since everyone was <br/>\ngetting something they wanted.  <br/>\n<br/>\nAs for schoolwork, I asked a few times if they wanted to do their <br/>\nschoolwork.  The first few times were met with very puzzled looks <br/>\nlike they couldn&#39;t believe they were given an option.  When they <br/>\nsaid no, which I totally expected, I followed it up with &#39;Okay, what <br/>\nshould we do instead?&#39;  I quit asking about schoolwork after a week <br/>\nor so because the kids just picked up on the idea that they were <br/>\ntruly FREE to choose their own activities.  Ever since, we just live <br/>\neach day doing what makes us happy.  Every day is a JOY day.  :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then you start unschooling, things are starting to hum along, more<br/>\n&gt; or less, then what do you say to the question of &quot;will we get a<br/>\n&gt; vacation?&quot;<br/>\n<br/>\n </span></blockquote>What kind of vacation?  In our family, the word vacation means going <br/>\naway somewhere different such as the beach, Disney World, or <br/>\nWisconsin to visit my ILs.  So yes, we still take vacations.  We can <br/>\nonly afford one big trip per year and that is what we call <br/>\nvacation.  If we do a day trip somewhere, like hiking or going to <br/>\nthe acquarium or zoo, we just say we&#39;re spending the day doing X.  <br/>\nThose are not vacation days for us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do they just eventually see that it is life and true freedom so<br/>\n&gt; they won&#39;t be envious at all when they see their friends out of<br/>\n&gt; school?<br/>\n<br/>\n </span></blockquote>Why would they feel envious?  Some traditional homeschooling <br/>\nfamilies do &#39;school&#39; when ps kids are out.  I can see the <br/>\nhomeschooled kids of those families feeling envious.  But if your <br/>\nkids are truly able to do anything they like, even hanging out with <br/>\ntheir friends whenever, why would they ever really feel envious?  <br/>\nBeing out of school is a break from the stupid school routine and <br/>\nboring schoolwork.  If your kids aren&#39;t in a stupid routine or doing <br/>\nboring schoolwork, they won&#39;t really require a break, will they?<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; If unschooling was your idea (vs. your child&#39;s), I&#39;m interested to<br/>\n&gt; hear how you told them about it. :-)<br/>\n&gt; Barbara<br/>\n<br/>\n </span></blockquote>My kids do not research homeschooling like I do.  I&#39;ve been reading <br/>\nabout and trying out the different philsophies, trying to find <br/>\nsomething that makes us happy.  Unschooling is the only thing that <br/>\ntruly brings us JOY.  The kids knew they did schoolwork on school <br/>\ndays and could play on non-school days.  I didn&#39;t hand them any <br/>\nexpectations when I decided we&#39;d live an unschooling lifestyle.  I <br/>\nthink it would be really easy to fall into that &#39;newbie unschooler&#39; <br/>\ntrap of taking the schedule away and expecting your children to <br/>\njoyfully choose the same types of schoolish lessons and activities <br/>\nyou did before you began unschooling.  If you&#39;re expecting that, you <br/>\nwill be sorely disappointed.<br/>\n<br/>\nHave you officially &#39;finished&#39; your school year?  Did you previously <br/>\nhave a &#39;first day of school&#39;?  How about just not having it??  Just <br/>\nstart living, loving and enjoying your children on a daily basis and <br/>\nlet one day flow into the next.  I can&#39;t say whether you should or <br/>\nshould not discuss unschooling with your kids.  I didn&#39;t at first, <br/>\nbut did start bringing it up because I would occasionally read aloud <br/>\nfrom Rue Kream&#39;s book.  To be honest, they don&#39;t really care what <br/>\nit&#39;s called.  They are just happy that I am no longer scheduling <br/>\nboring schoolwork or turning fun things into lessons.  They are just <br/>\nliving ... period.<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] how to introduce unschooling to your children","postDate":"1150056221","msgId":14403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4NjE2OEI4LUUwOTYtNERCQy04RUVCLTEwNkI2M0ZGMTM0NEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg==","referencesHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg=="},"prevInTopic":14400,"nextInTopic":14420,"prevInTime":14402,"nextInTime":14404,"topicId":14400,"numMessagesInTopic":0,"msgSnippet":"... Well it s easy since it s summer. You just start doing summer things. I think along the same lines as letting go of control, it s easier to just say yes","messageBody":"<div id=\"ygrps-yiv-854330259\">On Jun 11, 2006, at 3:40 PM, Barbara Miller wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So you tell them they aren&#39;t going to be doing school anymore  <br/>\n&gt; (background of<br/>\n&gt; dancing and cheers), but then what do you say when they ask what  <br/>\n&gt; you are<br/>\n&gt; going to do?<br/>\n<br/>\n </span></blockquote>Well it&#39;s easy since it&#39;s summer. You just start doing summer things.<br/>\n<br/>\nI think along the same lines as letting go of control, it&#39;s easier to  <br/>\njust say yes more often to what they suggest. Don&#39;t turn it into  <br/>\nsomething that you have to do. Just start living life and let life  <br/>\nunfold.<br/>\n<br/>\nGo places. Do things together. Just have fun.<br/>\n<br/>\nWhat if you knew life were going to change in ways that you couldn&#39;t  <br/>\nfathom and you couldn&#39;t prepare for it so the advice people gave you  <br/>\nwas to just spend the time until then doing things you enjoyed. What  <br/>\nwould you do?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2573098,"authorName":"Barbara Miller","from":"&quot;Barbara Miller&quot; &lt;BarbMiller@...&gt;","profile":"prosperbarb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"how to introduce unschooling to your children","postDate":"1150054822","msgId":14400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZmIwMWM2OGQ4ZSRlMTE4ODFmMCQ2NTAyYThjMEBiYXJibWNlPg=="},"prevInTopic":0,"nextInTopic":14403,"prevInTime":14399,"nextInTime":14401,"topicId":14400,"numMessagesInTopic":0,"msgSnippet":"Got another question.  Refresher - I ve homeschooled for 7 years - my 3 kids, ages 12, 10, and 6 have always been homeschooled, fwiw. OK, say we decide to","messageBody":"<div id=\"ygrps-yiv-1925867973\">Got another question.  Refresher - I&#39;ve homeschooled for 7 years - my 3<br/>\nkids, ages 12, 10, and 6 have always been homeschooled, fwiw.<br/>\n<br/>\n <br/>\n<br/>\nOK, say we decide to unschool.  How do you tell your kids about it?  How do<br/>\nyou explain that instead of doing various subjects, etc., they will be doing<br/>\nlife?  How do you explain in a positive way that we won&#39;t have summer<br/>\nvacation?  (Yes, it was me that asked about summer vacation the other day -<br/>\nmy family doesn&#39;t obsess about summer - these are just the thoughts going<br/>\nthrough my head since summer is somewhat looked forward to).<br/>\n<br/>\n <br/>\n<br/>\nSo you tell them they aren&#39;t going to be doing school anymore (background of<br/>\ndancing and cheers), but then what do you say when they ask what you are<br/>\ngoing to do?  How do you introduce this pretty new and more or less totally<br/>\nforeign concept?  Those of you who switched from homeschooling to<br/>\nunschooling - how did you do it?<br/>\n<br/>\n <br/>\n<br/>\nThen you start unschooling, things are starting to hum along, more or less,<br/>\nthen what do you say to the question of &quot;will we get a vacation?&quot;  I&#39;m sure<br/>\nsome of you will respond with something like &quot;we are already on vacation!&quot;<br/>\nBut that might not go over with the kids.  Do they just eventually see that<br/>\nit is life and true freedom so they won&#39;t be envious at all when they see<br/>\ntheir friends out of school?<br/>\n<br/>\n <br/>\n<br/>\nI realize a lot of this is just that I am still trying to grasp the concept.<br/>\nAnd I really am intrigued and interested in the concept.  Now I&#39;m trying to<br/>\ngrasp how the kids will react to unschooling.  Thanks in advance for helping<br/>\nthis newbie to try to see how this might work.  If unschooling was your idea<br/>\n(vs. your child&#39;s), I&#39;m interested to hear how you told them about it. :-)<br/>\n<br/>\n <br/>\n<br/>\nBarbara<br/>\n<br/>\nPS Thanks for the links.  I&#39;ve been looking through them.  I didn&#39;t see this<br/>\naddressed - if I missed it and someone has a handy link, I&#39;d like to see it.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":14193,"nextTopicId":14278}}