{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":314774049,"authorName":"Katie Paige","from":"Katie Paige &lt;paigekitten86@...&gt;","profile":"paigekitten86","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help me respect my 11 month old&#39;s interests","postDate":"1217738905","msgId":35090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MTk2MS44NjM3OC5xbUB3ZWI1NzQwMi5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":35051,"nextInTopic":0,"prevInTime":35089,"nextInTime":35091,"topicId":34927,"numMessagesInTopic":0,"msgSnippet":"Oooh thank you for those links!  That yahoo group looks like it has tons of great information. I could make better use of the time when she is sleeping.  I","messageBody":"<div id=\"ygrps-yiv-1695380335\">Oooh thank you for those links!  That yahoo group looks like it has tons of great information.<br/>\n<br/>\nI could make better use of the time when she is sleeping.  I have set office hours when I need to be available, but that doesn&#39;t mean I can&#39;t work at other times of the day, and then just be around to answer the phone in the morning.  I had avoided doing that because then I felt I was working all day, but obviously my solution isn&#39;t working for me... :)  I hadn&#39;t really thought of that.<br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help me respect my 11 month old&#39;s interests","postDate":"1217639377","msgId":35051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3REY0QTQwLTkwQTUtNDZDNy05Qjg1LTJFN0I5QTlERkQwMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGc2bzE5bitrbGdxQGVHcm91cHMuY29tPg==","referencesHeader":"PGc2bzE5bitrbGdxQGVHcm91cHMuY29tPg=="},"prevInTopic":34927,"nextInTopic":35090,"prevInTime":35050,"nextInTime":35052,"topicId":34927,"numMessagesInTopic":0,"msgSnippet":"On Jul 29, 2008, at 5:15 PM, paigekitten86 wrote: Hi, sorry, I think your email got lost in the discussions about the list. ... Are there parts of your work","messageBody":"<div id=\"ygrps-yiv-66426368\"><blockquote><span title=\"qreply\">On Jul 29, 2008, at 5:15 PM, paigekitten86 wrote:<br/>\n<br/>\nHi, sorry, I think your email got lost in the discussions about the  <br/>\nlist.<br/>\n<br/>\n&gt;  I work at home for 4 hours a day<br/>\n<br/>\nAre there parts of your work that can be shifted to when she&#39;s asleep?<br/>\n<br/>\n&gt; but she would much rather use whatever we are using right that second.<br/>\n<br/>\nThe quickest fix is to realize you can&#39;t change that only make it  <br/>\nworse. Needs don&#39;t go away by being denied. Denying them just makes  <br/>\nthem more intense.<br/>\n<br/>\nThough it&#39;s hard to put actual numbers onto real life, I can make  <br/>\nsome up to illustrate a point. ;-) If someone needs 5 fully attentive  <br/>\ninteractions a day and mom only says yes to every 3rd request, they  <br/>\nhave to ask 15 times to get those 5. It can feel like they&#39;re asking  <br/>\nall the time! Even worse, since they know that most requests get  <br/>\nturned down, and sometimes they don&#39;t get their 5, they have to ask  <br/>\neven more because they know they have to grasp every opportunity  <br/>\npossible to get their needs met. So if they feel needy, they&#39;re not  <br/>\ngoing to stop at 5. They&#39;re going to try to get as much as possible  <br/>\nsince it&#39;s not freely available.<br/>\n<br/>\nAdults do this too! Maybe most people here are too  young to remember  <br/>\ngas crises, but people were filling up well before they needed to and  <br/>\ntaking extra gas just because they weren&#39;t confident they could get  <br/>\nit when they needed it.<br/>\n<br/>\n&gt; realized they didn&#39;t<br/>\n&gt; make noise, dropped it on the floor and reached for my phone again<br/>\n&gt; accidentally hanging up on a potential resident.<br/>\n<br/>\nThough aggravating, it&#39;s really helpful to let go of the consequences  <br/>\nof her actions. While it can feel deliberate, it&#39;s not. She&#39;s not  <br/>\ntrying to make your life more difficult. She&#39;s just trying to meet  <br/>\nher needs.<br/>\n<br/>\nI suspect you know that, but it&#39;s hard to let go. And it can make us  <br/>\nfeel better to be angry at a child who has seemingly hurt us on  <br/>\npurpose than to be angry at a child who has no idea she&#39;s causing  <br/>\nproblems.<br/>\n<br/>\nTwo things might help. Sign up for:<br/>\n<br/>\nTHE DAILY GROOVE ~ by Scott Noelle<br/>\nwww.enjoyparenting.com/dailygroove<br/>\n<br/>\nand<br/>\n<br/>\nAlways Unschooled list<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysUnschooled/\">http://groups.yahoo.com/group/AlwaysUnschooled/</a><br/>\n<br/>\nwhere people might have a collection of practical ideas for that age.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":314774049,"authorName":"paigekitten86","from":"&quot;paigekitten86&quot; &lt;paigekitten86@...&gt;","profile":"paigekitten86","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help me respect my 11 month old&#39;s interests","postDate":"1217366135","msgId":34927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2bzE5bitrbGdxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":35051,"prevInTime":34926,"nextInTime":34928,"topicId":34927,"numMessagesInTopic":0,"msgSnippet":"I have been lurking for a while on this list and it has really been helping me alter my ways of thinking/parenting/behaving to be more in tune with the ideals","messageBody":"<div id=\"ygrps-yiv-140382427\">I have been lurking for a while on this list and it has really been<br/>\nhelping me alter my ways of thinking/parenting/behaving to be more in<br/>\ntune with the ideals I have.  My daughter is only 11 months old right<br/>\nnow, but I have known since I was a teenager that my kids were going<br/>\nto be unschooled (I was homeschooled).<br/>\n<br/>\nI am a hard time giving my daughter the time and supervision she needs<br/>\nto fulfill her interests.  I work at home for 4 hours a day, and up to<br/>\nthis point we have both been content with her sitting on my lap or<br/>\nplaying nearby.  (My husband and I are working to get into a position<br/>\nwhere I do not need to work so much)  Recently she has begun wanting<br/>\nto do whatever I am doing, so I try to give her a phone, her own files<br/>\nin my filing cabinet to pull in and out, her own notebooks and pens,<br/>\nkeys et cetera.  She knows that I have a phone and computer that work<br/>\nand that hers do not so invariably we both end up frustrated because<br/>\nneither of us get to us the &quot;real&quot; items as much as we would like and<br/>\nneed.<br/>\n<br/>\nDD loves electronics and she gets to bang on the laptop with me or DH<br/>\nright there (but not the work computer) and play with the guitar hero<br/>\ncontrollers, remote controls, and camera as much as she would like,<br/>\nbut she would much rather use whatever we are using right that second.<br/>\n<br/>\nFor example, this morning I was on the phone and she wanted it so she<br/>\ntried to grab it away from me.  I pulled it back and handed her the<br/>\nother receiver, she pushed a couple of buttons, realized they didn&#39;t<br/>\nmake noise, dropped it on the floor and reached for my phone again<br/>\naccidentally hanging up on a potential resident. <br/>\n<br/>\nAlso part of my job is walking the property (I manage our apartment<br/>\ncomplex) and she used to love being carried around, but now that she<br/>\nis walking she wants to get down and walk wherever looks interesting.<br/>\n She especially loves stairs, but as she is still learning I have to<br/>\nbe right behind her.  She could go up and down stairs for hours on<br/>\nend.  When I am not working we walk at her pace and play on stairs,<br/>\nbut it is never as long as she would like.  Part of the reason is my<br/>\nown selfishness, when on the stairs I need to give her my full<br/>\nattention and be physically holding her hand or ready to catch her at<br/>\na moments notice.  After 20-40 minutes I get bored or my back gets<br/>\ntired.  <br/>\n<br/>\nOnce a week we visit a location that has a staircase she can manage on<br/>\nher own and she plays on that for an hour or so. <br/>\n<br/>\nI have also tried bringing a slide with stairs indoor for her to use,<br/>\nbut it is not as challenging as she would like, and she mastered it<br/>\nvery quickly and got bored.<br/>\n<br/>\nI need ideas on ways to help her, or a good kick in the pants to make<br/>\nme realize I should be sitting on stairs for hours on end everyday.  <br/>\n<br/>\nI don&#39;t want to just take things away, or pick her up, especially<br/>\nbecause she will scream when I do (rightly so, I would to).<br/>\n<br/>\nRight now I feel very frustrated and like I am not doing my job well,<br/>\nor being a good mother (and the thread about the house has been nice,<br/>\nsince mine is not what I would like it to be)!  Then I feel guilty<br/>\nabout being frustrated, and stressed about feeling guilty which is<br/>\nanother can of worms....</div>","specialLinks":[]}],"prevTopicId":35059,"nextTopicId":35057}}