{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: On encouraging obsessions, leading by example and thanking the grocery clerk:","postDate":"1119013269","msgId":5636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4dWhpbCs3bWZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGUxMmNiNDRlMDUwNjE2MTA1OTllM2EwNkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":5634,"nextInTopic":0,"prevInTime":5635,"nextInTime":5637,"topicId":5631,"numMessagesInTopic":0,"msgSnippet":"... something - we didn t realize what she was saying at first, because she started it at 17 months and the words were a little generic, but the intent is","messageBody":"<div id=\"ygrps-yiv-395708914\"><blockquote><span title=\"ireply\">&gt; Oh, yeah, my daughter says &quot;thank you&quot; whenever we hand her <br/>\n </span></blockquote>something - we didn&#39;t realize what she was saying at first, because she <br/>\nstarted it at 17 months and the words were a little generic, but the <br/>\nintent is obvious.  It sounds like &quot;ti tu&quot;, but she makes eye contact <br/>\nand smiles as she says it and often gives whatever we handed her a hug <br/>\nat the same time&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m enjoying your posts as well!  This reminded me of my daugther at <br/>\nabout the same age (she&#39;s 12 now).  I would say &quot;thank you&quot; when I <br/>\nhanded her something she wanted or indicated she wanted me to give her <br/>\nin a very cheerful voice (I&#39;m not one for baby talk), I wasn&#39;t doing <br/>\nthis to consciously try to teach her manners, but I guess <br/>\nsubconsciously I was doing just that.  I, too, have always modeled as <br/>\nwell, saying thank you, please, excuse me and also making a comment to <br/>\nthose who don&#39;t when they invade my personal space, especially young <br/>\nadults/teenagers etc (ie they brush by you, in a hurry, oblivious to <br/>\nthose around them almost bumping into you. I make sure I get their <br/>\nattention and make a comment).   They&#39;re no need to be rude to others <br/>\nand I see way too much disrespect (even the kids working at the grocery <br/>\nstore at the checkout, chatting with whoever is bagging, not really <br/>\nattending to their job, etc).  We can&#39;t expect our children to learn <br/>\nrespect if we don&#39;t respect them as well.<br/>\n<br/>\nWhen she was small but old enough to converse, and I brought something <br/>\nto her attention in a public place (bumping into someone and telling <br/>\nher to be aware, not forcing her to say she&#39;s sorry, but modeling <br/>\nexcuse me) the adult sometimes would say &quot;oh, that&#39;s alright!&quot;  because <br/>\nshe was little and, I guess &quot;not expected to know better&quot;.  I would <br/>\nsay, no, it&#39;s NOT alright.  If children don&#39;t learn early on to respect <br/>\nothers, they&#39;ll continue into adulthood.  I often got a strange look!  <br/>\nI said it politely, not in a bossy or know it all tone, but I guess <br/>\nit&#39;s something sometimes others don&#39;t think about.<br/>\n<br/>\nWe&#39;ll be homeschooling for the first time this fall, after a lengthy <br/>\ndescooling period for both of us (I&#39;ve always worked full time).  I <br/>\nsee &quot;obsession&quot; in my daughter&#39;s learning style, she can focus for <br/>\nhours on something that interests her, which, of course doesn&#39;t fit <br/>\ninto the constant changing of gears in middle school.  She <br/>\nisn&#39;t &quot;successful&quot; there because this preset schedule doesn&#39;t mesh with <br/>\nher need to follow through on something until she&#39;s had enough or it&#39;s <br/>\ntime (HER choice) to move on.  She can&#39;t switch gears and pick up a new <br/>\ntopic (not of her choosing) as quickly as they expect.  I, too, enjoy <br/>\nobsession, reading for hours when in the mood, researching on the <br/>\ninternet going in whatever direction it takes me, playing piano, <br/>\nlearning about homeschooling and unschooling and learning styles, etc <br/>\netc.<br/>\nJann</div>","specialLinks":[]},{"userId":35875473,"authorName":"Heather","from":"&quot;Heather&quot; &lt;heather@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] On encouraging obsessions","postDate":"1118958050","msgId":5634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyYjFmMWU1LjI1OTI0MWIxLjUyOWMuZmZmZjhjNTNAbXguZ21haWwuY29tPg==","inReplyToHeader":"PGUxMmNiNDRlMDUwNjE2MTA1OTllM2EwNkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":5633,"nextInTopic":5636,"prevInTime":5633,"nextInTime":5635,"topicId":5631,"numMessagesInTopic":0,"msgSnippet":"Hi Daniel, I m enjoying your posts.  My dh & I are currently obsessed with dancing.  I sometimes try to explain to our friends that we are  passionate about","messageBody":"<div id=\"ygrps-yiv-1240864779\">Hi Daniel,<br/>\n<br/>\n <br/>\n<br/>\nI&#39;m enjoying your posts.  My dh & I are currently obsessed with dancing.  I<br/>\nsometimes try to explain to our friends that we are &quot; passionate&quot; about it,<br/>\nbut it feels more  truthful to say we are &quot;obsessed&quot;.  And I sometimes feel<br/>\nguilty for being so.  Of course, we have to take into consideration our<br/>\nchildren & their needs & wants, but the reminder that we are leading by<br/>\nexample, was nice &lt;g&gt;.<br/>\n<br/>\n <br/>\n<br/>\nHeather M<br/>\n<br/>\nTucson AZ<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Encouraging your child to develop their obsessions is more than just<br/>\nletting them go as far as they wish with whatever they are obsessing<br/>\non (although that is probably a pretty big part of it). It also means<br/>\nindulging in your own obsessions as well.  Children learn by example. &gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196291069,"authorName":"Daniel MacIntyre","from":"Daniel MacIntyre &lt;daniel.macintyre@...&gt;","profile":"macintyred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"On encouraging obsessions, leading by example and thanking the grocery clerk:","postDate":"1118944775","msgId":5633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxMmNiNDRlMDUwNjE2MTA1OTllM2EwNkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGUxMmNiNDRlMDUwNjE2MDYxOTRlZmIyNThjQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGUxMmNiNDRlMDUwNjE2MDYxOTRlZmIyNThjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":5631,"nextInTopic":5634,"prevInTime":5632,"nextInTime":5634,"topicId":5631,"numMessagesInTopic":0,"msgSnippet":"Encouraging your child to develop their obsessions is more than just letting them go as far as they wish with whatever they are obsessing on (although that is","messageBody":"<div id=\"ygrps-yiv-712627065\">Encouraging your child to develop their obsessions is more than just<br/>\nletting them go as far as they wish with whatever they are obsessing<br/>\non (although that is probably a pretty big part of it). It also means<br/>\nindulging in your own obsessions as well.  Children learn by example. <br/>\nThis is true, not only for obsessions, but for any trait you wish to<br/>\nsee develop in your children.  If you are providing your child with a<br/>\ngood model, they are likely to imitate that model when presented with<br/>\nsimilar situations.<br/>\n<br/>\nI know this is, on the surface, extremely obvious, but I think<br/>\nsometimes it has to be brought up just to keep it in our thoughts when<br/>\nwe go about our daily business.  I was thinking about this a couple of<br/>\ndays ago, when I was in the grocery store with my son.  He is a little<br/>\nrambunctious and often walks (or runs) ahead of the cart as I shop. <br/>\nHe and an employee crossed paths and before he went past her, he made<br/>\neye contact, smiled and said excuse me.  I didn&#39;t actually see this,<br/>\nbut it made enough of an impression on the employee that she had to<br/>\nmention it to me.  Now, I have never told him to say excuse me or<br/>\nthank you or do many of the other things that are considered polite,<br/>\nbut I do go out of my way to say excuse me when he and I get into<br/>\neachother&#39;s way.  I also do this with anyone as well.  I make sure to<br/>\nsay please to my wife when I make a request and whenever anyone does<br/>\nme a service, I make sure to say Thank you (I do this because I have<br/>\nalways done it, but I do think about it sometimes when I know my son<br/>\nis watching and I sometimes play it up to make sure he notices).<br/>\n<br/>\nNow, I&#39;m not saying this is the only way to learn manners, or that it<br/>\nensures success in and of itself, but this was not the first time I&#39;ve<br/>\nbeen complimented on my son&#39;s manners, so I certainly feel confident<br/>\nthat this has had something to do with it.<br/>\n<br/>\nOh, yeah, my daughter says &quot;thank you&quot; whenever we hand her something<br/>\n- we didn&#39;t realize what she was saying at first, because she started<br/>\nit at 17 months and the words were a little generic, but the intent is<br/>\nobvious.  It sounds like &quot;ti tu&quot;, but she makes eye contact and smiles<br/>\nas she says it and often gives whatever we handed her a hug at the<br/>\nsame time.<br/>\n<br/>\nAs I stood in line after shoppinge, I noticed that the cashiers rarely<br/>\nlooked up at the customers they are helping.  When I got to my<br/>\ncashier, I said hi, responded to her hellohowareyou with my &quot;Fine!<br/>\nthanks for asking - how about you?&quot; at which point she looked up, said<br/>\n&quot;fine&quot; and went quickly back to her job.  At the end, I made sure to<br/>\nsay thanks and mean it.  She looked up again, smiled and said &quot;you&#39;re<br/>\nwelcome.&quot;  I do this because I always did it.  Still, I felt good.<br/>\n<br/>\nI think Zachary knows I feel good about being polite.  Maybe this is<br/>\nwhat he&#39;s learning.<br/>\n<br/>\nDaniel<br/>\n---<br/>\n<br/>\n&quot;You&#39;ll never find fulfillment in committing a selfish act&quot; - Zig Ziglar</div>","specialLinks":[]},{"userId":196291069,"authorName":"Daniel MacIntyre","from":"Daniel MacIntyre &lt;daniel.macintyre@...&gt;","profile":"macintyred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Thinking about obsessions.","postDate":"1118927983","msgId":5631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxMmNiNDRlMDUwNjE2MDYxOTRlZmIyNThjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":5633,"prevInTime":5630,"nextInTime":5632,"topicId":5631,"numMessagesInTopic":0,"msgSnippet":"Please bear with me.  I ve been considering starting a blog, but I want to flesh out a few ideas before I do so, so I m using you all as sounding boards.  Any","messageBody":"<div id=\"ygrps-yiv-161727006\">Please bear with me.  I&#39;ve been considering starting a blog, but I<br/>\nwant to flesh out a few ideas before I do so, so I&#39;m using you all as<br/>\nsounding boards.  Any opinions on the below will be appreciated<br/>\n(constructive opinions will be appreciated more - flattery will be<br/>\nappreciated most :)).<br/>\n<br/>\nI was reading an article on winning a few weeks ago that had Lance<br/>\nArmstrong&#39;s 5 tips for being a winner.  His number one tip was to &quot;Be<br/>\nObsessive.&quot;  For some reason, this has been sitting in the back of my<br/>\nhead ever since.  It finally came back to the forefront bringing a<br/>\nsuprising companion - unschooling.<br/>\n<br/>\nOne of the comments I hear often about unschooling is that it seems<br/>\nlike the unschooled child is lacking the motivation to really reach<br/>\nhis or her potential without someone keeping up some sort of pressure.<br/>\n Obsessiveness seems to be a pretty straightforward answer to that.<br/>\n<br/>\nBy Obsessiveness, Lance Armstrong was talking about a singleminded<br/>\nfocus on one goal or object.  I often hear of athletes &quot;Eating and<br/>\nSleeping&quot; their sport.  I&#39;ve seen a similar phenomenon among<br/>\nresearchers in several fields like Physics, mathematics and<br/>\nengineering.  This got me wondering if obsessiveness is a natural<br/>\nfunction of the brain in general.  Obviously, some forms of<br/>\nobsessiveness are bad - taken to an extreme, it is a mental illness,<br/>\nbut maybe this is an illness of degree, not kind.<br/>\n<br/>\nOften, parents worry if a child is &quot;spending too much time&quot; doing any<br/>\none thing.  Obviously, TV and video game useage are targeted as being<br/>\nsomething we might get &quot;Too much&quot; of, but large quantities of time<br/>\nspent in even good activities like reading, educationally oriented<br/>\nhobbies or productive computer time cause similar reactions in some<br/>\nparents.<br/>\n<br/>\nOften the response to a child spending hours doing video games is that<br/>\nthere is a lot of learning going on under the surface - problem<br/>\nsolving, research, map skills, hand eye coordination, etc..., but<br/>\nmaybe the act of spending hours doing one thing is a learning process<br/>\nin itself.  Encouraging obsessiveness in one area may lead to<br/>\nobsessiveness in other areas later in life.  And obsessiveness is an<br/>\nattribute of a winner.<br/>\n<br/>\n-- <br/>\nDaniel<br/>\n(Amy is doing a half marathon for Team in Training<br/>\nAnyone who wants to help can do so by going to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.active.com/donate/fundraise/tntgmoAMacint\">http://www.active.com/donate/fundraise/tntgmoAMacint</a> )</div>","specialLinks":[]}],"prevTopicId":5627,"nextTopicId":5639}}