{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":94040812,"authorName":"Lisa Heyman","from":"&quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Suggested reading for Extrovert/Introvert families?","postDate":"1191415628","msgId":26675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVY0QkU4NUM1N0YwMTQ0MzVGQTZBMDlEMUFGMEBwaHguZ2JsPg=="},"prevInTopic":26659,"nextInTopic":0,"prevInTime":26674,"nextInTime":26676,"topicId":26659,"numMessagesInTopic":0,"msgSnippet":"Susan - I have a very high energy extroverted child as well.  A couple of things that help us in our house. 1.\tI attempt to set up as many playdates as","messageBody":"<div id=\"ygrps-yiv-281759450\">Susan - I have a very high energy extroverted child as well.  A couple of<br/>\nthings that help us in our house.<br/>\n<br/>\n1.\tI attempt to set up as many playdates as possible.  First I make<br/>\nsure these are friends she wants to be with. I also select time and place<br/>\nand length of time of engagement where I know it will best suit all<br/>\ninvolved.  This helps to spread some of the energy outward and relieves me<br/>\nof the full intensity all the time.  I use the time she is engaged with<br/>\nothers to take care of what I need to do.  Sometimes that means focusing on<br/>\nmy other dd.<br/>\n2.\tMothers helper.  Find an older child, teenager or adult who can come<br/>\nand give my dd the attention she deserves.<br/>\n3.\tConsciously using my dh.  Setting up special time for them one on<br/>\none.  A trip to the zoo or a movie together.<br/>\n4.\tPhysical outlets and activities.  AS much as possible for her.<br/>\nWhile she still wants me present at the place she takes dance classes or<br/>\ntumbles, I use that time to stitch or knit.  (reading a book doesn&#39;t work<br/>\nbecause she wants my attention focused on her).  This is my down time.<br/>\n5.\tMy dd is very loquacious.  When we are out she can spend an hour<br/>\ntalking to someone and not want to leave someplace even though the rest of<br/>\nus are ready to go.  I bring along book or handwork or use this time to<br/>\nengage with my other family members.  I use this time as my rest time while<br/>\nshe engages others around her.  My dd is no longer 5yo and so now I don&#39;t<br/>\nhave to participate in the conversations as I once did as she often needed<br/>\ninterpretation and unfortunately adults could be disrespectful to a young<br/>\nchild&#39;s honest inquiries.  But now that she&#39;s 9 - she navigates<br/>\nconversations pretty well with strangers and 99% of the time adults are<br/>\ntickled by her attention and interest.  <br/>\n<br/>\n <br/>\n<br/>\nAs draining as it feels now, as you continue to respectfully honor him by<br/>\nresponding with patience explanations about how others feel the need for<br/>\nquiet or down time, he will learn to navigate these social cues himself in<br/>\ntime.  My dd is extrodinarily sensitive to understanding others energy<br/>\nboundaries because her energy boundaries have been honored in a respectful<br/>\nmanner.  This came with age.<br/>\n<br/>\n <br/>\n<br/>\nI hope some of these ideas help.<br/>\n<br/>\nLisa Heyman<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Suggested reading for Extrovert/Introvert families?","postDate":"1191363182","msgId":26659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcxMDAyMTUxM3Q3ZmI0NTcyYmw5MTNlYzQ5ZWQzZWVkMDc3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":26675,"prevInTime":26658,"nextInTime":26660,"topicId":26659,"numMessagesInTopic":0,"msgSnippet":"I m reading Raising Your Spirited Child and loving it. Our whole family is fairly spirited (or spunky as the author calls it), but our son is really highly","messageBody":"<div id=\"ygrps-yiv-655602229\">I&#39;m reading &quot;Raising Your Spirited Child&quot; and loving it. Our whole<br/>\nfamily is fairly spirited (or &quot;spunky&quot; as the author calls it), but<br/>\nour son is really highly spirited. There are times when I&#39;m just<br/>\noverwhelmed or confused because I just can&#39;t figure out how to make<br/>\nthings click and go smoother for everyone.<br/>\n<br/>\nThis book is helping me see his POV and understand his temperament<br/>\nmuch better. Our needs - in terms of space, interaction, physical<br/>\nactivity, etc - are on opposite ends of the spectrum. We&#39;re both<br/>\nintense people, but he is *very* extroverted whereas I am highly<br/>\nintroverted. I&#39;ve long suspected this but didn&#39;t have a good grasp on<br/>\nwhat extroverts need. Ah, now it makes sense! Reading through the<br/>\nsmall section in this book on introverts/extroverts, I am better able<br/>\nto see the *whys* behind his behavior. It&#39;s helped me put myself in<br/>\nhis shoes and respond to his needs with more compassion... but...<br/>\n<br/>\nWhile this is helping me understand him better, I&#39;m still short on<br/>\nhaving the actual tools to help us all meet our needs. Maybe some<br/>\nfolks can develop them on the fly once the understanding is in place,<br/>\nbut in this case I realize I need some help getting from point A<br/>\n(understanding) to point B (making it work). DH asked me how we can<br/>\nput this knowledge to practical use... hmm. The book doesn&#39;t discuss<br/>\nwhat to do if the family is composed of 3 people who are introverts<br/>\nand one that is a strong extrovert. I need real-world suggestions for<br/>\nmaking it work. There are times when it seems like he takes what he<br/>\nneeds even when it&#39;s over the threshold of what the rest of us can<br/>\ncomfortably handle. I *know* there are positive solutions and ways to<br/>\nreally appreciate this part of his personality. When his extrovert<br/>\nneeds are met, he really sparkles. But afterwards I&#39;m often left<br/>\nfeeling exhausted and my energy is drained and I get cranky.<br/>\n<br/>\nIt&#39;s a lot for DH & DD to handle as well. If the kids fight it&#39;s<br/>\nusually because one wants space and quiet (daughter) and the other<br/>\nwants conversation and physical closeness (son). I&#39;ve tried to be a<br/>\nbuffer between them - to help ds get his need for interaction met<br/>\nwhile dd enjoys a period of quiet, but afterwards I feel drained and<br/>\nhave no reserves left for others or myself. I can&#39;t concentrate well,<br/>\nproblem solve, or react calmly and rationally when my energy level<br/>\ngets that low. It feels that whenever I reach that point something<br/>\nhappens that is like that proverbial straw on the camel&#39;s back and I<br/>\nend up frustrated, overwhelmed, and grouchy.<br/>\n<br/>\nHe&#39;s five and isn&#39;t good at negotiating or understanding others&#39; needs<br/>\nyet. Explaining that if DD has some quiet time by herself then she&#39;ll<br/>\nbe ready to play or that I need a few minutes alone doesn&#39;t work.<br/>\nWe&#39;ve talked about his needs vs the needs of others and balancing give<br/>\nand take, etc, with empathic language and lots of patience. But he<br/>\ncannot fathom why anyone would want to be alone or why we need quiet<br/>\nspace or that the bouncing, fidgeting and constant stream of sound is<br/>\ndifficult for our sensory systems to handle hour after hour. I know it<br/>\ndoesn&#39;t make sense to him because in his world being around others and<br/>\nmoving his body makes him feel good. I know he is just trying to meet<br/>\nhis needs - and this realization has helped tremendously from my<br/>\n*reaction* standpoint, but the rest of still need to meet our needs,<br/>\ntoo, and I&#39;m at a loss there. I know there is a win-win solution.<br/>\n<br/>\nCan anyone recommend a book that discusses introverts & extroverts and<br/>\nhas practical ideas for creating harmony & meeting everyone&#39;s needs<br/>\nwhen different types are living together?<br/>\n<br/>\nThanks in advance,<br/>\n~ Susan</div>","specialLinks":[]}],"prevTopicId":26639,"nextTopicId":26684}}