{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":83822299,"authorName":"Jeanne Goodman","from":"&quot;Jeanne Goodman&quot; &lt;goodmanj@...&gt;","profile":"desksideguru","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Bad superior attitude was my problem with people","postDate":"1089198259","msgId":1473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MTMwMWM0NjQxMiRhNDAwMmI4MCQ2NTAwYThjMEBMYXB0b3A+","referencesHeader":"PGQ5LmVhNzY5NDEuMmUxY2UxZDhAYW9sLmNvbT4="},"prevInTopic":1470,"nextInTopic":1477,"prevInTime":1472,"nextInTime":1474,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... As far as the way they play together, have you talked to Jayn about  the way real friends treat each other?  That she doesn t have to take what  Renee ","messageBody":"<div id=\"ygrps-yiv-1311751046\">----- Syndi&#39;s Original Message ----- <br/>\n    As far as the way they play together, have you talked to Jayn about  the <br/>\n  way real friends treat each other?  That she doesn&#39;t have to take what  Renee <br/>\n  dishes out?<br/>\nI wonder if this isn&#39;t the real point to all of this. I worry, as I read this thread, that as parents isolate their children from some of this behavior that they disapprove of, whether they are denying them another type of education. An education about dealing with the real world and real people. I&#39;m certainly not suggesting that Robyn should allow Jayn to be molested by another child, but there is a bit of some education that can happen around the &quot;I won&#39;t be your friend anymore&quot; attitude that I believe is typical and age appropriate and worth discussing as a learning opportunity, &quot;When Renee says those things what do you think she&#39;s really trying to say?&quot; &quot;Where do you think she learned that?&quot; &quot;What do you think would happen if you don&#39;t give her those things?&quot;<br/>\n<br/>\nJust my 2 cents.<br/>\n<br/>\nJeanne<br/>\n<br/>\nP.S. (funny story) When Miss T was about 4 she was spending some time with a child who was about six when she learned the phrase &quot;Do x or I won&#39;t be your friend anymore.&quot; Miss T didn&#39;t fully get the concept. When DH went to the bank one day (which is right next to the ice cream shop) T assumed he was going to get her ice cream. When he didn&#39;t she got angry, grabbed onto a railing shouting, &quot;Go away! I&#39;m not going with you. You&#39;re NOT my Daddy anymore!&quot;<br/>\n<br/>\nDH began to nervously look around to see if anyone was getting the police to pick up this &quot;child abductor&quot;. Fortunately for him, no one in this town gives a stiff so it went unnoticed.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125789604,"authorName":"Onesnotenough@aol.com","from":"Onesnotenough@...","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Bad superior attitude was my problem with people","postDate":"1089177560","msgId":1470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5LmVhNzY5NDEuMmUxY2UxZDhAYW9sLmNvbT4="},"prevInTopic":1469,"nextInTopic":1473,"prevInTime":1469,"nextInTime":1471,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"The things that Renee is doing, as far as touching, is something she has learned from somewhere.   Evidently her cousin, but someone had  to  show  her. Yes,","messageBody":"<div id=\"ygrps-yiv-1855751038\">The things that Renee is doing, as far as touching, is something she has  <br/>\nlearned from somewhere.   Evidently her cousin, but someone had  to  show  her.  <br/>\nYes, kids are curious, but that is going alittle  to far.  I agree, follow <br/>\nyour instinct.  <br/>\n  As far as the way they play together, have you talked to Jayn about  the <br/>\nway real friends treat each other?  That she doesn&#39;t have to take what  Renee <br/>\ndishes out?   Just my thoughts.<br/>\nsyndi<br/>\n <br/>\n&quot;...since  we can&#39;t know what knowledge will be most needed in the future, it <br/>\nis senseless  to try to teach it in advance. Instead, we should try to turn <br/>\nout people who  love learning so much and learn so well that they will be able <br/>\nto learn whatever  needs to be learned.&quot;<br/>\n-- _John  Holt_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quoteworld.org/author.php?thetext=John+Holt)\">http://www.quoteworld.org/author.php?thetext=John+Holt)</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":169847153,"authorName":"blessed54321@wmconnect.com","from":"blessed54321@...","profile":"blessed543212003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Bad superior attitude was my problem with people","postDate":"1089174179","msgId":1469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2LjVjNmJkY2Y5LjJlMWNkNGEzQHdtY29ubmVjdC5jb20+"},"prevInTopic":1468,"nextInTopic":1470,"prevInTime":1468,"nextInTime":1470,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/6/2004 10:03:56 PM US Eastern Standard Time, ... hun,,,you are doing the right thing to keep a eye on her,,not that she dpurposefully hurt","messageBody":"<div id=\"ygrps-yiv-1858758859\">In a message dated 7/6/2004 10:03:56 PM US Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I spoke to her mom about this, since I was worried. I mean what if<br/>\n&gt; subsequently it turned out that someone was doing something inappropriate<br/>\n&gt; with Renee, and I had said nothing about my concerns? Any way her mom told<br/>\n&gt; me that it was normal for a 6.5 yo, because Angel (cousin 2 years older and<br/>\n&gt; staying with them over part of summer) did the same stuff. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>hun,,,you are doing the right thing to keep a eye on her,,not that <br/>\nshe&#39;dpurposefully hurt your daughter,,,touching ones self ,,at 6.5 is normal to <br/>\napoint,,but by that age  they learn what is //and//is not appropreate behavior..<br/>\nfollow your instinct..i&#39;ve learned you have that for a reason....<br/>\nJune<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bad superior attitude was my problem with people","postDate":"1089169409","msgId":1468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNjYzNjYitzYmxoQGVHcm91cHMuY29tPg=="},"prevInTopic":1465,"nextInTopic":1469,"prevInTime":1467,"nextInTime":1469,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-80170770\">&lt;&lt;&lt;When Laurie was younger and we were around other parents/children, I <br/>\nhad to watch that I didn&#39;t have an air of superiority about how they <br/>\nwere &#39;handling&#39; their children. I was very uncomfortable around most <br/>\nparents because of their parenting choices.&gt;&gt;&gt;<br/>\n<br/>\n&lt;&lt;&lt;I know of few circumstances where my judgemental attitude was helpful to<br/>\nanyone, and kharmacally (sp???) speaking, it wasn&#39;t good for me either.&gt;&gt;&gt;&gt;<br/>\n<br/>\nHope it&#39;s not too confusing, but I have quoted two different people above.<br/>\nAs usual just when I have a difficulty in my parenting life, it turns up on<br/>\nthe lists.<br/>\n<br/>\nDH was just telling me yesterday that I was too judgmental and superior<br/>\nabout other parents, and it was hurting my peace of mind, and certainly not<br/>\nmaking any positive change in anyone else. He is right, and I hate to admit<br/>\nit to him ;) At least until I have thoroughly confessed my troubles here,<br/>\nanyway.<br/>\n<br/>\nOn UnschoolingDiscussion I have talked about Jayn&#39;s friendship with our<br/>\nneighbors, a little girl two years older in school, and her brother who<br/>\nturned 5 today. My dh and I have never taken to the girl, although we both<br/>\nreally like the boy most of the time. They are parented in the traditional<br/>\nmanner with plenty of punishments, time-outs, I think spanking sometimes,<br/>\nand grabbing of the ear to drag them to their time out corner. Their mother<br/>\nalways asks in a forbidding manner whether they &quot;behaved&quot; when they have<br/>\nvisited, as if expecting to hear dire stories. However they &quot;behave&quot;<br/>\ngenerally pleasantly almost all the time here - exception described a few<br/>\npars below.<br/>\n<br/>\nFor a while I felt I had to limit Jayn&#39;s exposure to Renee, since it seemed<br/>\nto be causing Jayn stress to be seeing a lot of her. Jayn was taking nasty<br/>\nbehaviors and words into other situations with other friends, like saying<br/>\n&quot;I&#39;m not your friend. I don&#39;t love you anymore&quot; which she learnt from Renee.<br/>\nWhen I talked to her about it, I learnt she was saying these things without<br/>\nthought to the meaning, and without feeling it was true, and without any<br/>\nprovocation either - in the spirit of an experiment to discover the other<br/>\nperson&#39;s reaction.(Not that I would endorse this kind of statement as a<br/>\nresponse to provocation!) When Renee started school last fall, the time<br/>\navailable lessened considerably. <br/>\n<br/>\nNow that Jayn is more mature, we are letting the girls play together more,<br/>\non Jayn&#39;s instigation. My challenge is not over-reacting when the horrible<br/>\nlittle wretch brings her nasty school-toxic manipulating behaviors into our<br/>\nhome. I don&#39;t trust her to be truthful, and she is full of one-upmanship<br/>\nover everything Jayn relates to her. She still does &quot;You&#39;re not my friend&quot;<br/>\nat Jayn, as well as threatening to leave, in order to make Jayn give her the<br/>\ntoy she wants to use. Last time Jayn actually said to her &quot;You&#39;re joking!&quot;<br/>\nand laughed. <br/>\n<br/>\nAt the same time, Jayn often tries to change the game or get Renee to share<br/>\nthe toys (Jayn&#39;s toys) in ways that bug Renee - like grabbing. I can see<br/>\nthat Jayn wants to interact with Renee, while Renee just wants to play with<br/>\nthe toys for a while. So far I have failed in redirecting Jayn before she<br/>\nbecomes obnoxious, and thereby provoking the nastiness from Renee. Clearly<br/>\nthat is what I am going to have to do.<br/>\n<br/>\nI feel bad, because my first reaction to Renee was a knee jerk &quot;Please don&#39;t<br/>\nsay that kind of cruel thing to Jayn. If Jayn is doing something that is<br/>\nbothering you just tell her so without the threats.&quot; I said it angrily and I<br/>\nreally regret that, instead of approaching her in a gentle parenting manner.<br/>\nI&#39;m having a hard time getting past my immense and increasing dislike, and<br/>\nI&#39;m ashamed of these hostile feelings. It is hard to remember that she is<br/>\njust a little girl - a somewhat damaged child being treated most<br/>\nunpleasantly and overly controlled at home.<br/>\n<br/>\nMeanwhile, we were invited to participate in a Bar-B-Q for July 4th and to<br/>\ncelebrate Jonah&#39;s birthday. I was not looking forward to it, mostly because<br/>\nI just don&#39;t enjoy their mother&#39;s way of speaking to the kids, and feel I<br/>\nhave to be protective of Jayn. The party was noisy, crowded, constant<br/>\ntelling the kids what to do, and what to eat or drink. Renee announced to<br/>\nJayn that the sodas were for adults. I immediately said Jayn could have<br/>\nwhatever she wanted. Several children (relatives of the family) were<br/>\ncontinually exhorted to &quot;go back and FINISH your hamburger&quot;, when clearly<br/>\nthey were done. One kid even said he was full and was actually told &quot;No<br/>\nyou&#39;re not&quot;. (!!!!!)<br/>\n<br/>\nPoor Jonah, very excited, was told to &quot;CALM DOWN&quot; several times, without<br/>\nmuch help to do that other than various &quot;or else&#39;s&quot;. I got the distinct<br/>\nimpression that they were giving him a lot of leeway because he was birthday<br/>\nboy and on any other day he would be in time out a lot earlier. He does a<br/>\nlot of stuff to deliberately test the limits of the adults around him, like<br/>\ninstantly hitting someone if told not to hit, but the response is always<br/>\npunitive. He is so calm and pleasant at our house.<br/>\n<br/>\nJayn is good at helping herself out of situations. She asked so we went down<br/>\nto swim in the middle, and had a good rest. We were able to escape a<br/>\nterrifically hilarious game of adults lightly spanking the overexcited<br/>\nchildren on their butts with a stick, which looked to me like it would<br/>\nimmediately get out of control the instant the kids regained possession of<br/>\nthe stick. (&quot;Jonah give me that stick NOW!&quot; &quot;(crying) But it&#39;s mine!!&quot;)<br/>\n<br/>\nPretty soon Renee came to swim also, and the other children came down to run<br/>\nabout too. It seemed much better to have them all out doors. <br/>\n<br/>\nThen we were told it was cake time. Jayn got dressed quickly and dh took her<br/>\nback to the party. I stayed home to have a shower and dress more slowly,<br/>\nsince I don&#39;t care about cake. However when I strolled back down the balcony<br/>\nto the party, I found they were playing organized games instead of having<br/>\ncake. What a scene of misery. They were doing Musical Chairs in the<br/>\ntraditional competitive manner, and the littlest guys were instantly crying<br/>\nwhen they were out in the first couple of rounds. Except Jayn who<br/>\ndelightedly called out &quot;I lost!!&quot; as she ran laughingly to Daddy and watched<br/>\nthe others, clapping to the music. The musical chairs game continued, with<br/>\nlots of orders shouted until just about all the kids, except the eldest who<br/>\nhad won a couple of rounds, were in tears. What fun! <br/>\n<br/>\nNext there was to be limbo. Some wanted to sit it out - no, they were told<br/>\nthey have to PLAY NOW. James (my dh) got on one end of the stick. He wanted<br/>\nto lift or lower the stick depending on the participant - but no, he was<br/>\nTOLD that you HAVE TO keep the stick at the same height to find out the<br/>\nwinner - by the mom, not any of the kids. This game degenerated to a lot of<br/>\ncrawling under the stick pretty quickly, and Jayn kept on laughing even<br/>\nwhile others were being shouted at that that was NOT THE RIGHT WAY TO LIMBO.<br/>\nLots of outrage at what was fair being expressed - by the adults!<br/>\n<br/>\nActually Jayn seemed to be the winner in the end. Renee held out a basket of<br/>\nassorted small items (junk from the bottom of her toy box but at least she<br/>\nmeant well) that she had put together as prizes, but Jayn just looked at<br/>\nthem and walked away not getting the concept. Thank you Alfie Kohn. Finally<br/>\nwe moved on to the cake.<br/>\n<br/>\nI did mention to Renee&#39;s dad that there is a way to play Musical Chairs that<br/>\nis non-competitive and every kid ends up laughing instead of crying, but got<br/>\na few &quot;what is the matter with her&quot; looks. Oh well. <br/>\n<br/>\nPart of the problem that dh had with me is that I seem to be almost paranoid<br/>\nabout leaving Jayn alone with any member of that family. I don&#39;t allow her<br/>\nto visit them alone largely because I don&#39;t want her to have to be stuck in<br/>\nthe environment of kids being shouted at and humiliated with nasty<br/>\nadjectives like &quot;sneaky&quot; which of course they live up to. The mom leaves the<br/>\nchildren unsupervised in the bedroom they share, and it is hard on Jonah to<br/>\nbe left out of the girls&#39; play in what is partly his space, so he acts out.<br/>\nIt is just a powderkeg waiting to explode. Renee is very into tattling,<br/>\ntrying to get Jonah or Jayn into trouble, or trying to get her feel badly<br/>\nabout things that Jayn may (or may not) have said in the past. So far this<br/>\nhasn&#39;t worked.<br/>\n<br/>\nAlso recently Renee started doing odd sexual stuff, which may or may not be<br/>\nnormal age appropriate development. Maybe you all can enlighten me here.<br/>\nRenee followed Jayn to the bathroom, and tried to take (dragging her by the<br/>\narm) Jayn into the bathroom with her (which I stopped immediately). She has<br/>\ntried to invent games that involve her putting her hands down Jayn&#39;s<br/>\nswimsuit or pants, which I have also stopped. She is very much into<br/>\nboyfriends, teen tv shows, and evidently has been trying to &quot;Play Doctor&quot;<br/>\nwith her brother, who told on her of course. <br/>\n<br/>\nI spoke to her mom about this, since I was worried. I mean what if<br/>\nsubsequently it turned out that someone was doing something inappropriate<br/>\nwith Renee, and I had said nothing about my concerns? Any way her mom told<br/>\nme that it was normal for a 6.5 yo, because Angel (cousin 2 years older and<br/>\nstaying with them over part of summer) did the same stuff. <br/>\n<br/>\nHer mom also told me that they are very strict about enforcing &quot;private<br/>\nparts are private&quot; with Renee, so something ain&#39;t working there. I wonder if<br/>\nshe is just curious as to whether all girls are essentially the same. Well I<br/>\ndon&#39;t care if it IS normal for Renee, Jayn is not the appropriate vessel for<br/>\nher experimentation. So I watch them. I stay in the same room when they are<br/>\ntogether, and I get into the pool with them, and I prevent them from going<br/>\nto the bathroom together. <br/>\n<br/>\nHowever in terms of the way Jayn and Renee communicate and play together, I<br/>\nguess I am going to have to trust Jayn. Trust that she either can see more<br/>\nin her friend than I can, or that in time she will come to see the nasty<br/>\nbehaviors of Renee and protect herself from them somehow. I&#39;m sure I&#39;m not<br/>\nthe first mother that didn&#39;t like her daughter&#39;s chosen friends.<br/>\n<br/>\nThanks for lasting through this long rant.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.714 / Virus Database: 470 - Release Date: 7/2/2004</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] was problem with people/ parenting choices","postDate":"1089160156","msgId":1465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQRUVLQ0NOQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJQ0VHRUNEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4="},"prevInTopic":1457,"nextInTopic":1468,"prevInTime":1464,"nextInTime":1466,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-31191696\">&lt;&lt;&lt;&lt;My point is friends are friends they don&#39;t<br/>\nnecessarily need to be family.&gt;&gt;&gt;&gt;<br/>\n<br/>\nAnnMarie&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nThis is SO true.  I will say that my own situation though is that I have<br/>\nended up dealing with my family - most days I think I&#39;m doing okay making it<br/>\nwork.  Sometimes I wonder about my sanity at getting it all started.  My<br/>\nsiblings and I had an emotionally abusive childhood that involved a lot of<br/>\nloss.  I was the first of my siblings to have kids.  9 months after my<br/>\ndaughter was born, my sister had her first, a girl.  She was going back to<br/>\nwork part-time and looking for someone to take care of her baby.  I saw a<br/>\nwonderful opportunity to give my daughter a close cousin relationship such<br/>\nas I never had, and also an opportunity to be there as emotional stability<br/>\nfor my niece who I was sure would go through some difficulties knowing my<br/>\nsister as I do.  I knew it would be tricky but decided to try it.<br/>\n<br/>\nThe positives are that five years later, my daughter and this cousin are the<br/>\nbest of friends.  Not only that, but starting to stay in touch with my<br/>\nsister again through this bond to my niece got me back in touch with the<br/>\nformerly allergic to responsibility brother I&#39;d written off, and who got<br/>\nmarried, had a little girl ten months after my sister.  Now all three of<br/>\nthese girls are close as can be, and we have cousin nights at least weekly<br/>\n(and all of us have two kids now).  I actually find my brother and his wife,<br/>\nalthough not attachment parents and stricter than I would be, are not<br/>\nyellers or screamers or punitive in their parenting.  They are okay to be<br/>\naround, although my brother has sort of taken it as a personal affront to<br/>\nhis current career change to teaching that I&#39;m unschooling...sigh.  In any<br/>\nevent, if I look back, I cannot imagine my kids&#39; lives without these close<br/>\nrelationships which are ones that they choose.  It has indeed been<br/>\nincredibly positive for them.  I should add they decide when and if they<br/>\nwant to see cousins - I would never force it on them and sometimes they do<br/>\ntake long breaks and we decline invitations for a while.<br/>\n<br/>\nMy sister on the other hand, and even worse her husband (actually now her<br/>\nex-husband and they are going through bankruptcy and he is what she calls a<br/>\nborderline-alcoholic, so much stress there), are yellers and screamers.<br/>\nWhat they think is what comes out of their mouths.  I have found this<br/>\ndifficult as have my sensitive children.  Firstly I should say that if what<br/>\nwas being screamed was abusive put downs like &quot;You stupid child...!&quot; type of<br/>\nstuff, no way would I have my children witness this.  It&#39;s more like &quot;Emma!<br/>\nI can&#39;t do that right now!  Can&#39;t you see I have to take care of your baby<br/>\nsister!&quot;  that type of thing.  So we have coping strategies...We invite my<br/>\nsister and her ex to drop off the kids and &quot;take a break cause gosh you sure<br/>\nneed it&quot;...they do not need much persuading.  So we get the benefit of the<br/>\nkids without having to put up with them or their parenting.  If we do go<br/>\nover there, we similarly invite them to take a break, and often that works.<br/>\nMore work for me in a way, but better overall.  Also, I take care of myself.<br/>\nIf I find that I&#39;m getting depressed by being around them too much, I take a<br/>\nbreak and stop contact for a while...or spread the contact out more.<br/>\n<br/>\nI definitely talk to my kids (and to my niece when it seems appropriate)<br/>\nabout how they feel about the yelling if it happens and we are around.  My<br/>\ndaughter basically doesn&#39;t really go to their house because of it unless<br/>\nit&#39;s a birthday party or just to swim in their pool.  There was one incident<br/>\nwhen we were at my brother&#39;s house and my sister yelled at my daughter about<br/>\na pushing incident at the table.  I was amazed at my own self-control that I<br/>\nwas able to intervene and handle it calmly at the time, then a few minutes<br/>\nlater, in a separate room, I told my sister that the way she had handled the<br/>\nsituation was not okay with me and I told her how I wanted it handled.  My<br/>\nsister is exactly the defensive type that I generally feel it is useless to<br/>\nconverse with, but it had to be done.  She basically said &quot;Well, I can try,<br/>\nbut you know I just say what comes out of my mouth.&quot;  (ie - I&#39;m a victim of<br/>\nmy own emotions, I have no control).  But she&#39;s never done it again either.<br/>\nIf it became a problem, I&#39;d definitely address it.  Interestingly, I think<br/>\nthat over the last 6 months or so, my sister does not seem to be doing as<br/>\nmuch yelling anymore, even with all the pressures she is under so I&#39;m<br/>\nhopeful that being around the more positive parenting of my brother&#39;s and my<br/>\nfamily has made a difference although I really don&#39;t know.  I do know that<br/>\nmy niece has gotten a visible benefit from the support and greater normalcy<br/>\nof our family and my brother&#39;s family.<br/>\n<br/>\nThe worst part of it for me was when my sister moved to a bigger house (one<br/>\nof the causes of current bankruptcy) with an in-law apartment that my mother<br/>\nmoved into.  ACK!  How was I to know she would do such a thing?  I cut off<br/>\ncontact with my mother years before after deciding life was to short for her<br/>\nto continue to make me feel bad.  Now here I was with children attached to<br/>\nmy sister&#39;s kids and now my mother was there.  I was very anxious for a<br/>\nwhile, but followed my children&#39;s leads and my mother and I basically ignore<br/>\neach other&#39;s presence.  I answer questions about &quot;Gran Gran&quot; as my kids ask.<br/>\nThey haven&#39;t really gotten that interested in her, which is fine with me.<br/>\nNow my sister and her ex are selling the house, so that situation will<br/>\nchange.<br/>\n<br/>\nSo I don&#39;t have any answers or advice, only an &quot;boy, it&#39;s hard and oh so<br/>\ncomplicated!&quot; I see so much positive in our situation.  I&#39;m definitely<br/>\nfollowing the lead of my kids on this one, and I&#39;m hoping I won&#39;t look back<br/>\nwhen I&#39;m old and grey and go &quot;What was I THINKING!&quot;<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":100519971,"authorName":"Alyce","from":"&quot;Alyce&quot; &lt;alyce13j@...&gt;","profile":"alyce13j","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my problem with people","postDate":"1089131936","msgId":1457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjZWtqMCszZ2xiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYxRDhEMzE2LUNGMjItMTFEOC05MDk3LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":1447,"nextInTopic":1465,"prevInTime":1456,"nextInTime":1458,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... ran ... not ... once. That was INDEED the Science Center.  lol.  Funny how the same thing happened! Alyce","messageBody":"<div id=\"ygrps-yiv-1014688344\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, pam sorooshian <br/>\n&lt;pamsoroosh@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; On Jul 5, 2004, at 9:52 AM, Alyce wrote:<br/>\n&gt; <br/>\n&gt; &gt; I saw no reason to pull<br/>\n&gt; &gt; my son off the wall - he entered at the &quot;proper entrance&quot; just <br/>\n </span></blockquote>ran<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; to the farther end to start climbing.  And he wanted to climb up <br/>\n </span></blockquote>not<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; across as were the rules.  Jeez Louise.<br/>\n&gt; <br/>\n&gt; HA - if that was at the Science Center - Rosie did the SAME thing <br/>\n </span></blockquote>once. <br/>\n<br/>\n<br/>\nThat was INDEED the Science Center.  lol.  Funny how the same thing <br/>\nhappened!<br/>\n<br/>\nAlyce</div>","specialLinks":[]},{"userId":171127956,"authorName":"G&M Contracting Inc., Kenneth Gillilan","from":"&quot;G&M Contracting Inc., Kenneth Gillilan&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] was problem with people/ parenting choices","postDate":"1089118910","msgId":1447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJQ0VHRUNEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDIwMDQwNzA1MjA0MzA2LjM3ODE2LnFtYWlsQHdlYjYxMjA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":1442,"nextInTopic":1457,"prevInTime":1446,"nextInTime":1448,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"Beth, My entire family sounds like your sister.  I wish I had a better solution than avoiding the whole holiday ceremony but I don t.  We stopped seeing my ","messageBody":"<div id=\"ygrps-yiv-349901660\">Beth,<br/>\n   My entire family sounds like your sister.  I wish I had a better solution<br/>\nthan avoiding the whole holiday ceremony but I don&#39;t.  We stopped seeing my<br/>\nfamily about 2 years ago, at least for any event that might last more than<br/>\nan hour.  I know that I should probably be using this opportunity to explain<br/>\nto my kids that families have different ways of dealing with things, but I<br/>\nstill am affected by the way my parents treated me and each other that I<br/>\njust can&#39;t do that to my kids even on the short term.  I grew up around only<br/>\ncousins and although I had fun at the time, looking back I probably could<br/>\nhave picked nicer, more sophisticated friends, (not the ones introducing me<br/>\nto alcohol and smoking).  My point is friends are friends they don&#39;t<br/>\nnecessarily need to be family.<br/>\n<br/>\nAnnMarie<br/>\n  -----Original Message-----<br/>\n  From: Beth Fleming [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:momofwc@...\">momofwc@...</a>]<br/>\n  Sent: Monday, July 05, 2004 4:43 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: Re: [unschoolingbasics] was problem with people/ parenting<br/>\nchoices<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt; When Laurie was younger and we were around other<br/>\n  &gt; parents/children, I<br/>\n  &gt; had to watch that I didn&#39;t have an air of<br/>\n  &gt; superiority about how they<br/>\n  &gt; were &#39;handling&#39; their children. I was very<br/>\n  &gt; uncomfortable around most<br/>\n  &gt; parents because of their parenting choices. By the<br/>\n  &gt; time Laurie was<br/>\n  &gt; four or so years old I had a whole new set of<br/>\n  &gt; childless friends. I<br/>\n  &gt; didn&#39;t want to spend any more time and energy<br/>\n  &gt; watching them exhaust<br/>\n  &gt; themselves while making their children miserable. I<br/>\n  &gt; never was able<br/>\n  &gt; to locate any other gentle parents in our area. :-(<br/>\n  &gt;<br/>\n  &gt; love, Valerie<br/>\n  &gt;<br/>\n </span></blockquote>  Hello Valerie and Others,<br/>\n  Looking for a little input...I, too, am uncomfortable<br/>\n  around others whose parenting choices are not my<br/>\n  own...the toughest to deal with is my sister!!  She is<br/>\n  constantly yelling at her kids and getting<br/>\n  angry...this seems normal for her, but makes me, my<br/>\n  husband, and the kids uncomfortable...the sad part is<br/>\n  that since this is the situation, we don&#39;t see them<br/>\n  very much and this keeps my kids from getting to know<br/>\n  their cousins very well.  They are almost exactly the<br/>\n  same ages and play together very well, but just the<br/>\n  thought of spending time with my sister and her<br/>\n  husband being all over the kids gives me the willies!<br/>\n  What to do at holiday time?  Last year, I almost<br/>\n  cancelled and we almost went on a made-up trip to stay<br/>\n  away, but I gave in and went through a hellish visit<br/>\n  for the sake of the kids and their relationship with<br/>\n  their cousins...<br/>\n  I have considered talking to my sister, but her<br/>\n  defensive personality does not allow a &quot;conversation&quot;.<br/>\n<br/>\n  I was hoping that others might be able to share their<br/>\n  wisdom on how to handle this situation...<br/>\n  Thanks to everyone for your sincere and enlightening<br/>\n  posts!<br/>\n  Best,<br/>\n  Beth<br/>\n<blockquote><span title=\"ireply\">   &gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>  __________________________________<br/>\n  Do you Yahoo!?<br/>\n  Yahoo! Mail is new and improved - Check it out!<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a><br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: my problem with people","postDate":"1089101000","msgId":1442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxRDhEMzE2LUNGMjItMTFEOC05MDk3LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGNjYzB2Zyttbm1lQGVHcm91cHMuY29tPg==","referencesHeader":"PGNjYzB2Zyttbm1lQGVHcm91cHMuY29tPg=="},"prevInTopic":1439,"nextInTopic":1447,"prevInTime":1441,"nextInTime":1443,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... HA - if that was at the Science Center - Rosie did the SAME thing once. She did not want to go across, wanted to go up - and wanted to do it at the other","messageBody":"<div id=\"ygrps-yiv-1030548891\">On Jul 5, 2004, at 9:52 AM, Alyce wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I saw no reason to pull<br/>\n&gt; my son off the wall - he entered at the &quot;proper entrance&quot; just ran<br/>\n&gt; to the farther end to start climbing.  And he wanted to climb up not<br/>\n&gt; across as were the rules.  Jeez Louise.<br/>\n<br/>\n </span></blockquote>HA - if that was at the Science Center - Rosie did the SAME thing once. <br/>\nShe did not want to go across, wanted to go up - and wanted to do it at <br/>\nthe other end. The guy at the entrance said, &quot;Start over here.&quot;<br/>\n<br/>\nI intervened (and this time there WAS a line - but she wasn&#39;t holding <br/>\nup the line by going to the end and going up and back down) and I just <br/>\nkind of brazened my way -  I just said, &quot;Oh - she&#39;s going to start <br/>\nthere and just go up and back down.&quot; I said it like: That IS the way <br/>\nshe&#39;s going to do it.<br/>\n<br/>\nHow funny!<br/>\n<br/>\nI think it is natural to want to climb those walls in different ways - <br/>\nnot the one way.<br/>\n<br/>\n-pam<br/>\nWhen I think back<br/>\nOn all the crap I learned in high school<br/>\nIt&#39;s a wonder<br/>\nI can think at all<br/>\n~~~Paul Simon (Kodachrome)</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my problem with people","postDate":"1089078069","msgId":1439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzA1LjE4NDIwMS44NTAzLjIwMzQ2OEB3ZWJtYWlsMjIubnljLnVudGQuY29tPg=="},"prevInTopic":1432,"nextInTopic":1442,"prevInTime":1438,"nextInTime":1440,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"Instead of saying, wow, what a loser , how about a deep breath and  a silent wish for them to find peace for themselves and their  children? One can do","messageBody":"<div id=\"ygrps-yiv-288239985\">&quot;&gt;&gt;Instead of saying, &quot;wow, what a loser&quot;, how about a deep <br/>\nbreath and  a<br/>\nsilent<br/>\nwish for them to find peace for themselves and their  children?&gt;&gt;&gt;&quot;<br/>\n<br/>\nOne can do that AND be extremely frustrated and saddened by what they see or hear.<br/>\nI ran into a former homeschooling Mom, that put her ds back in school after a year of trying to school him at home. Total frustration on both their parts (you should have seen the stack of curriculum she forced on him daily).<br/>\nShe told me they might consider homeschooling again, and went on to tell me about how stressed he is, how the testing gives him anxiety, how he has problems socially because he&#39;s an EXTREME introvert....on and on.<br/>\nI just looked at her and said &quot;you should look into unschooling, you won&#39;t have all that stuff being shoved into his head and he can follow his interests.&quot;<br/>\nHer answer?<br/>\nHe has NO interests. I countered that and said all people have interests (unless they have major brain damage) and that it&#39;s us, as the parents that need to shift how we think in order to honor their interests.<br/>\nWe&#39;re standing in the middle of Books-a-million, while her ds is attending the weekly Yu-gi-oh trading.....but he has no interests?<br/>\nARGH!!<br/>\nShe answered my counter that &quot;No, even when he was three, he had NO interests&quot; and gave me a lame description of his learning &quot;disabilities&quot;.<br/>\nArgh, argh and more argh.<br/>\n<br/>\nThis kind of thing is the extreme end of sadness to me. HOW could a parent see their child as having NO interests at all? It was right in front of her, and she could only see him as broken.<br/>\nThis is a perfect example of our society. I&#39;m so glad I feel like an outcast in this sick society. I&#39;m so glad our family lives completely different from the norm. It&#39;s a wonderful thing to swim upstream...some on in, the water is FINE.:)<br/>\n<br/>\nRen<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my problem with people","postDate":"1089065912","msgId":1432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjY2szbytqZmcwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjYzNjYitzYmxoQGVHcm91cHMuY29tPg=="},"prevInTopic":1429,"nextInTopic":1439,"prevInTime":1431,"nextInTime":1433,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... This is why I like to have the neighborhood kids over without their parents! The people across the street keep apologizing for their kids coming over so","messageBody":"<div id=\"ygrps-yiv-207847939\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Valerie&quot; &lt;valerie@u...&gt; <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I was very uncomfortable around most <br/>\n&gt; parents because of their parenting choices. <br/>\n<br/>\n </span></blockquote>This is why I like to have the neighborhood kids over without their <br/>\nparents! The people across the street keep apologizing for their kids <br/>\ncoming over so much and I love it! I could send Mikey to their house, <br/>\nbut not Caroline, so I&#39;d much rather have kids come over...without <br/>\nthe yelling, spanking or threatening to spank parents!!!<br/>\n<br/>\n--aj</div>","specialLinks":[]},{"userId":171305668,"authorName":"Beth Fleming","from":"Beth Fleming &lt;momofwc@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] was problem with people/ parenting choices","postDate":"1089060186","msgId":1426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzA1MjA0MzA2LjM3ODE2LnFtYWlsQHdlYjYxMjA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNjYzNjYitzYmxoQGVHcm91cHMuY29tPg=="},"prevInTopic":1424,"nextInTopic":1429,"prevInTime":1425,"nextInTime":1427,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... Hello Valerie and Others, Looking for a little input...I, too, am uncomfortable around others whose parenting choices are not my own...the toughest to deal","messageBody":"<div id=\"ygrps-yiv-2033780680\"><blockquote><span title=\"ireply\">&gt; When Laurie was younger and we were around other<br/>\n&gt; parents/children, I <br/>\n&gt; had to watch that I didn&#39;t have an air of<br/>\n&gt; superiority about how they <br/>\n&gt; were &#39;handling&#39; their children. I was very<br/>\n&gt; uncomfortable around most <br/>\n&gt; parents because of their parenting choices. By the<br/>\n&gt; time Laurie was <br/>\n&gt; four or so years old I had a whole new set of<br/>\n&gt; childless friends. I <br/>\n&gt; didn&#39;t want to spend any more time and energy<br/>\n&gt; watching them exhaust <br/>\n&gt; themselves while making their children miserable. I<br/>\n&gt; never was able <br/>\n&gt; to locate any other gentle parents in our area. :-( <br/>\n&gt; <br/>\n&gt; love, Valerie <br/>\n&gt; <br/>\n </span></blockquote>Hello Valerie and Others, <br/>\nLooking for a little input...I, too, am uncomfortable<br/>\naround others whose parenting choices are not my<br/>\nown...the toughest to deal with is my sister!!  She is<br/>\nconstantly yelling at her kids and getting<br/>\nangry...this seems normal for her, but makes me, my<br/>\nhusband, and the kids uncomfortable...the sad part is<br/>\nthat since this is the situation, we don&#39;t see them<br/>\nvery much and this keeps my kids from getting to know<br/>\ntheir cousins very well.  They are almost exactly the<br/>\nsame ages and play together very well, but just the<br/>\nthought of spending time with my sister and her<br/>\nhusband being all over the kids gives me the willies! <br/>\nWhat to do at holiday time?  Last year, I almost<br/>\ncancelled and we almost went on a made-up trip to stay<br/>\naway, but I gave in and went through a hellish visit<br/>\nfor the sake of the kids and their relationship with<br/>\ntheir cousins...<br/>\nI have considered talking to my sister, but her<br/>\ndefensive personality does not allow a &quot;conversation&quot;.<br/>\n <br/>\nI was hoping that others might be able to share their<br/>\nwisdom on how to handle this situation...<br/>\nThanks to everyone for your sincere and enlightening<br/>\nposts!<br/>\nBest, <br/>\nBeth<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n </span></blockquote>__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail is new and improved - Check it out!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: my problem with people","postDate":"1089058760","msgId":1424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5LjJkYTRjMjA3LjJlMWIxMWM4QGFvbC5jb20+"},"prevInTopic":1423,"nextInTopic":1426,"prevInTime":1423,"nextInTime":1425,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/5/2004 1:34:36 PM Eastern Daylight Time, valerie@ubpub.com writes: By the  time Laurie was four or so years old I had a whole new set of","messageBody":"<div id=\"ygrps-yiv-436266245\">In a message dated 7/5/2004 1:34:36 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:valerie@...\">valerie@...</a> writes:<br/>\n<br/>\nBy the  time Laurie was <br/>\nfour or so years old I had a whole new set of childless  friends.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;<br/>\n <br/>\nAll of the people we spend a lot of time with are childless, but love  <br/>\nchildren. Works out better this way.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":169847153,"authorName":"blessed54321@wmconnect.com","from":"blessed54321@...","profile":"blessed543212003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] my problem with people","postDate":"1089057400","msgId":1423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5LjQyODBmNjg1LjJlMWIwYzc4QHdtY29ubmVjdC5jb20+"},"prevInTopic":1421,"nextInTopic":1424,"prevInTime":1422,"nextInTime":1424,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/5/2004 10:37:39 AM US Eastern Standard Time, ... yeah..i ve been told,,[by mom-in-law]that my kids are spoiled,,why??cause they dont just","messageBody":"<div id=\"ygrps-yiv-887980447\">In a message dated 7/5/2004 10:37:39 AM US Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just about cried - it was truly one of the saddest things I&#39;d ever <br/>\n&gt; seen.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>yeah..i&#39;ve been told,,[by mom-in-law]that my kids are spoiled,,why??cause <br/>\nthey dont just sit stone face and do nothing ,,,omg,,,they are KIDS!!!!!!<br/>\nsome people need to get over themselves...<br/>\nJune<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1421182,"authorName":"marbleface@aol.com","from":"marbleface@...","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] my problem with people","postDate":"1089054554","msgId":1429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NS4yZDhhN2VmZi4yZTFiMDE1YUBhb2wuY29tPg=="},"prevInTopic":1426,"nextInTopic":1432,"prevInTime":1428,"nextInTime":1430,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"This is a pretty normal response to hsing though, whether you are unschooling or not. I figure most parents are trying to do the right thing by their children","messageBody":"<div id=\"ygrps-yiv-1088755732\">This is a pretty normal response to hsing though, whether you are unschooling <br/>\nor not. I figure most parents are trying to do the right thing by their <br/>\nchildren and then you choose something different. Hmmm . . . maybe they aren&#39;t the <br/>\ngreat parents they want to be . .. hmmmm . . . so what to do  . . . lash out, <br/>\nthat&#39;s easy, denigrate other choices, that works, etc.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\nIn a message dated 7/5/2004 2:47:37 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\nShe wanted me to tell her it was not just o.k., but a spectacular<br/>\nthing to do. When someone finds out I am homeschooling, they just don&#39;t get<br/>\nit and silence is usually the norm.  This makes me uncomfortable, so most of<br/>\nthe time I just let it go.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125789604,"authorName":"Onesnotenough@aol.com","from":"Onesnotenough@...","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: my problem with people","postDate":"1089052981","msgId":1421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzLjJlMmE0ZTFmLjJlMWFmYjM1QGFvbC5jb20+"},"prevInTopic":1419,"nextInTopic":1423,"prevInTime":1420,"nextInTime":1422,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"Boy, and I thought I was the only one feeling this way!  We were going  to introduce ourselves to a family down the road that I found out are  hs ers.  But ","messageBody":"<div id=\"ygrps-yiv-1032660210\">Boy, and I thought I was the only one feeling this way!  We were going  to <br/>\nintroduce ourselves to a family down the road that I found out are  hs&#39;ers.  But <br/>\nthats just it, I don&#39;t know if they hs or unschool!<br/>\nSyndi-going thru people problems too!<br/>\n <br/>\n&quot;...since  we can&#39;t know what knowledge will be most needed in the future, it <br/>\nis senseless  to try to teach it in advance. Instead, we should try to turn <br/>\nout people who  love learning so much and learn so well that they will be able <br/>\nto learn whatever  needs to be learned.&quot;<br/>\n-- _John  Holt_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quoteworld.org/author.php?thetext=John+Holt)\">http://www.quoteworld.org/author.php?thetext=John+Holt)</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171127956,"authorName":"G&M Contracting Inc., Kenneth Gillilan","from":"&quot;G&M Contracting Inc., Kenneth Gillilan&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: my problem with people","postDate":"1089049705","msgId":1418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJTUVGUENEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGNjYzBhbytxcDBmQGVHcm91cHMuY29tPg=="},"prevInTopic":1414,"nextInTopic":1419,"prevInTime":1417,"nextInTime":1419,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... the benefit of the doubt, they seldom fail to disappoint me. My husband and I felt like we were the only ones who felt this way.  We have proof of it","messageBody":"<div id=\"ygrps-yiv-1465284461\"><blockquote><span title=\"ireply\">&gt;&gt; but honestly, when I give<br/>\n </span></blockquote>the benefit of the doubt, they seldom fail to disappoint me.&gt;&gt;<br/>\n<br/>\nMy husband and I felt like we were the only ones who felt this way.  We have<br/>\nproof of it over and over again.<br/>\n<br/>\nAnnMarie<br/>\n<br/>\n<br/>\n  -----Original Message-----<br/>\n  From: Alyce [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alyce13j@...\">alyce13j@...</a>]<br/>\n  Sent: Monday, July 05, 2004 12:41 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: [unschoolingbasics] Re: my problem with people<br/>\n<br/>\n<br/>\n  ---<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171127956,"authorName":"G&M Contracting Inc., Kenneth Gillilan","from":"&quot;G&M Contracting Inc., Kenneth Gillilan&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: my problem with people","postDate":"1089049700","msgId":1419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJS0VGUENEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGNjYjcxNytnbmVkQGVHcm91cHMuY29tPg=="},"prevInTopic":1418,"nextInTopic":1421,"prevInTime":1418,"nextInTime":1420,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... found the truth to what you already know?  YES! that s exactly it.  This is what feels so isolating to me, like I have all this information and no one","messageBody":"<div id=\"ygrps-yiv-1249030783\"><blockquote><span title=\"ireply\">&gt;&gt;Could it be because others have not YET<br/>\n </span></blockquote>found the truth to what you already know? &gt;&gt;&gt;<br/>\n<br/>\nYES! that&#39;s exactly it.  This is what feels so isolating to me, like I have<br/>\nall this information and no one to share it with.  These people seem so<br/>\ncomfortable with there decisions.  One time a women asked me if I thought<br/>\npreschool was a good idea for her child and I said that waiting and not<br/>\ngoing at all is a perfectly o.k. thing.  As a past owner of a preschool I<br/>\nknow what goes on there and none of it is good for kids.  She got all<br/>\noffended and said,&quot;well, I think he needs it and he can handle it&quot; then<br/>\nstormed off.  What the hell did she ask me her opinion for in the first<br/>\nplace.  She wanted me to tell her it was not just o.k., but a spectacular<br/>\nthing to do. When someone finds out I am homeschooling, they just don&#39;t get<br/>\nit and silence is usually the norm.  This makes me uncomfortable, so most of<br/>\nthe time I just let it go.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;So maybe next time open up, and vent to them your frustration!&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I really would love to do this I&#39;m sure it would make me feel a lot better.<br/>\n<br/>\nAnnMarie<br/>\n  -----Original Message-----<br/>\n  From: Kimberly [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a>]<br/>\n  Sent: Monday, July 05, 2004 5:29 AM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: [unschoolingbasics] Re: my problem with people<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my problem with people","postDate":"1089048779","msgId":1414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjYzNjYitzYmxoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjYjcxNytnbmVkQGVHcm91cHMuY29tPg=="},"prevInTopic":1411,"nextInTopic":1418,"prevInTime":1413,"nextInTime":1415,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"I know I get upset with others when I see them putting silly restictions on kids simply because it makes their lives easier. Kimmy *****This is something that","messageBody":"<div id=\"ygrps-yiv-82682580\">I know I get upset with others when I see them putting silly <br/>\nrestictions on kids simply because it makes their lives easier. <br/>\n<br/>\nKimmy<br/>\n<br/>\n*****This is something that amazes me about traditional parenting. <br/>\nIt DOESN&#39;T make their lives easier. They spend all of their time <br/>\nenforcing the restrictions rather than enjoying life with their <br/>\nchildren. <br/>\n<br/>\nWhen Laurie was younger and we were around other parents/children, I <br/>\nhad to watch that I didn&#39;t have an air of superiority about how they <br/>\nwere &#39;handling&#39; their children. I was very uncomfortable around most <br/>\nparents because of their parenting choices. By the time Laurie was <br/>\nfour or so years old I had a whole new set of childless friends. I <br/>\ndidn&#39;t want to spend any more time and energy watching them exhaust <br/>\nthemselves while making their children miserable. I never was able <br/>\nto locate any other gentle parents in our area. :-( <br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":100519971,"authorName":"Alyce","from":"&quot;Alyce&quot; &lt;alyce13j@...&gt;","profile":"alyce13j","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my problem with people","postDate":"1089046320","msgId":1411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjYzB2Zyttbm1lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjOXJrMys3djZxQGVHcm91cHMuY29tPg=="},"prevInTopic":1409,"nextInTopic":1414,"prevInTime":1410,"nextInTime":1412,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... of ... playground ... voice, You ... I have a climbing wall story.  One day I took my kids to a place with such a wall.  NOBODY was there except the","messageBody":"<div id=\"ygrps-yiv-780055663\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vermontones&quot; <br/>\n&lt;gmcontractinginc@v...&gt; wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;     Another example would be today at our town&#39;s parade.  The kids <br/>\n&gt; were all playing on the playground and a tidy line formed infront <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; the climbing wall.  My son who is used to playing at the <br/>\n </span></blockquote>playground <br/>\n<blockquote><span title=\"ireply\"> &gt; when the others are in school didn&#39;t even notice the line.  He cut <br/>\n&gt; right in front and some women said to him in not a nice <br/>\n </span></blockquote>voice, &quot;You <br/>\n<blockquote><span title=\"ireply\"> &gt; can&#39;t cut in line, go to the back&quot;.  <br/>\n<br/>\n<br/>\n </span></blockquote>I have a climbing wall story.  One day I took my kids to a place <br/>\nwith such a wall.  NOBODY was there except the employees.  I mean at <br/>\nthe climbing wall.  There were a few kids here and there.  Anyway, <br/>\nwe went to the wall.  My son ran up and started climbing at what was <br/>\napparently the Exit end of the wall.  The guy manning the thing <br/>\nsaid, &quot;Start on this end.&quot;  I looked at him and asked, &quot;Why?&quot;  He <br/>\nsays, &quot;That&#39;s the rules.&quot;  I said, &quot;But there&#39;s nobody here...&quot;  I <br/>\nunderstand why they would form a line when many are waiting so that <br/>\neveryone gets a turn... but for the love of Pete... when there is <br/>\nnobody there, what difference does it make where you go on the <br/>\nwall?  He ended up unable to answer my &quot;whys&quot; so just clammed up and <br/>\nlet us go on with our unconventional climb.  I saw no reason to pull <br/>\nmy son off the wall - he entered at the &quot;proper entrance&quot; just ran <br/>\nto the farther end to start climbing.  And he wanted to climb up not <br/>\nacross as were the rules.  Jeez Louise.<br/>\n<br/>\n:)  Alyce</div>","specialLinks":[]},{"userId":100519971,"authorName":"Alyce","from":"&quot;Alyce&quot; &lt;alyce13j@...&gt;","profile":"alyce13j","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my problem with people","postDate":"1089045656","msgId":1409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjYzBhbytxcDBmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZEM0RCMzdELUNFOTctMTFEOC05MDk3LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":1407,"nextInTopic":1411,"prevInTime":1408,"nextInTime":1410,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... other ... on top ... up to ... area ... and ... around, ... a ... GIVE ... is ... little ... that ... better ... got ... ever ... Ack.  You know, sometimes","messageBody":"<div id=\"ygrps-yiv-136228927\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, pam sorooshian <br/>\n&lt;pamsoroosh@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; On Jul 4, 2004, at 2:47 PM, Robyn Coburn wrote:<br/>\n&gt; <br/>\n&gt; &gt; It has been energizing to me to be encouraged to see how foolish <br/>\n </span></blockquote>other<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; people are about restricting their children&#39;s freedoms.<br/>\n&gt; <br/>\n&gt; I was at a nature center last week - it is in a city park but has <br/>\n&gt; trails, natural environment, very cool place.<br/>\n&gt; <br/>\n&gt; Near the exit there is a short stone wall - big wide flat stones <br/>\n </span></blockquote>on top <br/>\n<blockquote><span title=\"ireply\"> &gt; and the wall starts out only a few inches tall and gradually gets <br/>\n </span></blockquote>up to <br/>\n<blockquote><span title=\"ireply\"> &gt; about a foot and a half tall. Not too tall. It divides a grassy <br/>\n </span></blockquote>area <br/>\n<blockquote><span title=\"ireply\"> &gt; from a sidewalk.<br/>\n&gt; <br/>\n&gt; I&#39;d been standing on the sidewalk, then walked up onto the grass, <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; then had walked on the wall - for no reason - just standing <br/>\n </span></blockquote>around, <br/>\n<blockquote><span title=\"ireply\"> &gt; something to do. The place is beautiful.<br/>\n&gt; <br/>\n&gt; A group of kids came by - they&#39;d been walking out on the trail as <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; daycare field trip - they were about 8 years old and all boys.<br/>\n&gt; <br/>\n&gt; I backed away from the wall as they came along the sidewalk TO <br/>\n </span></blockquote>GIVE <br/>\n<blockquote><span title=\"ireply\"> &gt; THEM ROOM to walk on the wall - because they&#39;d just have to - it <br/>\n </span></blockquote>is <br/>\n<blockquote><span title=\"ireply\"> &gt; compelling! &lt;G&gt; Every kid and lots of adults who come by that <br/>\n </span></blockquote>little <br/>\n<blockquote><span title=\"ireply\"> &gt; walkway always walk on that wall. My girls have been walking on <br/>\n </span></blockquote>that <br/>\n<blockquote><span title=\"ireply\"> &gt; wall since they could just barely walk.<br/>\n&gt; <br/>\n&gt; The daycare leaders BARKED at them - &quot;GET OFF OF THERE. You know <br/>\n </span></blockquote>better <br/>\n<blockquote><span title=\"ireply\"> &gt; than that. It isn&#39;t there to walk on. Get back in line.&quot;  The boys <br/>\n </span></blockquote>got <br/>\n<blockquote><span title=\"ireply\"> &gt; back into single file line, not talking, and marched on.<br/>\n&gt; <br/>\n&gt; I just about cried - it was truly one of the saddest things I&#39;d <br/>\n </span></blockquote>ever <br/>\n<blockquote><span title=\"ireply\"> &gt; seen.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; When I think back<br/>\n&gt; On all the crap I learned in high school<br/>\n&gt; It&#39;s a wonder<br/>\n&gt; I can think at all<br/>\n&gt; ~~~Paul Simon (Kodachrome)<br/>\n<br/>\n </span></blockquote>Ack.  You know, sometimes I don&#39;t know exactly where to draw the <br/>\nline.  One day at the community college, Jay climbed just a short <br/>\nway up one of the trees.  I was fine with it.  But an <br/>\nadministrator/teacher/something... came by and yelled at him to get <br/>\ndown.  I assumed it had something to do with liability?  You might <br/>\nknow, Pam.  What&#39;s up with that?  Now I&#39;m never sure when we&#39;re out <br/>\nif a wall or tree is &quot;ok&quot; or if someone is going to come by and <br/>\nholler at us.  Amazing how a single incident will make you <br/>\nparanoid.  I will need to make sure I&#39;m very conscious about these <br/>\nthings... and not succumb to my knee jerk &quot;someone is going to yell <br/>\nat us&quot; reaction.  See now I&#39;m feeling a mite crappy because I know <br/>\nthat since then there have been several instances where I&#39;ve <br/>\ndisallowed his climbing in a public place due to fear of getting in <br/>\ntrouble.  I just hate when strangers take it upon themselves to <br/>\nfuss.  And they do.  <br/>\n<br/>\nTalk about MY problem with people.  I really don&#39;t like most <br/>\npeople.  lol.  Thank god there&#39;s a group near us where there are <br/>\npeople I do like.  I really should check my attitude though when <br/>\ndealing with folks outside the group... but honestly, when I give <br/>\nthe benefit of the doubt, they seldom fail to disappoint me.<br/>\n<br/>\nlol.<br/>\n<br/>\nAlyce</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] my problem with people","postDate":"1089041077","msgId":1407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZEM0RCMzdELUNFOTctMTFEOC05MDk3LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDQwNzA0MjE0Ny5pNjRMbGZDazAyOTI3NEBtYWMuY29tPg==","referencesHeader":"PDIwMDQwNzA0MjE0Ny5pNjRMbGZDazAyOTI3NEBtYWMuY29tPg=="},"prevInTopic":1405,"nextInTopic":1409,"prevInTime":1406,"nextInTime":1408,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... I was at a nature center last week - it is in a city park but has trails, natural environment, very cool place. Near the exit there is a short stone wall -","messageBody":"<div id=\"ygrps-yiv-1173745001\">On Jul 4, 2004, at 2:47 PM, Robyn Coburn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It has been energizing to me to be encouraged to see how foolish other<br/>\n&gt; people are about restricting their children&#39;s freedoms.<br/>\n<br/>\n </span></blockquote>I was at a nature center last week - it is in a city park but has <br/>\ntrails, natural environment, very cool place.<br/>\n<br/>\nNear the exit there is a short stone wall - big wide flat stones on top <br/>\nand the wall starts out only a few inches tall and gradually gets up to <br/>\nabout a foot and a half tall. Not too tall. It divides a grassy area <br/>\nfrom a sidewalk.<br/>\n<br/>\nI&#39;d been standing on the sidewalk, then walked up onto the grass, and <br/>\nthen had walked on the wall - for no reason - just standing around, <br/>\nsomething to do. The place is beautiful.<br/>\n<br/>\nA group of kids came by - they&#39;d been walking out on the trail as a <br/>\ndaycare field trip - they were about 8 years old and all boys.<br/>\n<br/>\nI backed away from the wall as they came along the sidewalk TO GIVE <br/>\nTHEM ROOM to walk on the wall - because they&#39;d just have to - it is <br/>\ncompelling! &lt;G&gt; Every kid and lots of adults who come by that little <br/>\nwalkway always walk on that wall. My girls have been walking on that <br/>\nwall since they could just barely walk.<br/>\n<br/>\nThe daycare leaders BARKED at them - &quot;GET OFF OF THERE. You know better <br/>\nthan that. It isn&#39;t there to walk on. Get back in line.&quot;  The boys got <br/>\nback into single file line, not talking, and marched on.<br/>\n<br/>\nI just about cried - it was truly one of the saddest things I&#39;d ever <br/>\nseen.<br/>\n<br/>\n-pam<br/>\n<br/>\nWhen I think back<br/>\nOn all the crap I learned in high school<br/>\nIt&#39;s a wonder<br/>\nI can think at all<br/>\n~~~Paul Simon (Kodachrome)</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] my problem with people","postDate":"1089040429","msgId":1404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBQzFCMTNGLUNFOTUtMTFEOC05MDk3LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGNjOXJrMys3djZxQGVHcm91cHMuY29tPg==","referencesHeader":"PGNjOXJrMys3djZxQGVHcm91cHMuY29tPg=="},"prevInTopic":1401,"nextInTopic":1405,"prevInTime":1403,"nextInTime":1405,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... I happens. I used to be the life of the party at those school-moms things - like soccer parties, and other get-togethers where I m hanging around mostly","messageBody":"<div id=\"ygrps-yiv-106398789\">On Jul 4, 2004, at 2:08 PM, vermontones wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have been finding myself less and less<br/>\n&gt; tolerable of people doing what they do and say to their children.<br/>\n&gt; When we left the parade I said maybe I don&#39;t belong at social<br/>\n&gt; functions anymore.<br/>\n&gt;     I would never hide my kids away, but I need to find a balance of<br/>\n&gt; acceptance or I&#39;m going to lose it.<br/>\n<br/>\n </span></blockquote>I happens. I used to be the life of the party at those school-moms <br/>\nthings - like soccer parties, and other get-togethers where I&#39;m hanging <br/>\naround mostly with parents of schooled kids. Now I&#39;m quiet and mostly <br/>\nlisten. And I do NOT have much fun. They&#39;re often sad affairs, for me. <br/>\nI feel like I&#39;m putting in my time. I don&#39;t engage with them - so I <br/>\ndon&#39;t have conflict - they like me fine and I&#39;m sure few would realize <br/>\nhow sad I am, underneath.<br/>\n<br/>\n-pam<br/>\nWhen I think back<br/>\nOn all the crap I learned in high school<br/>\nIt&#39;s a wonder<br/>\nI can think at all<br/>\n~~~Paul Simon (Kodachrome)</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: my problem with people","postDate":"1089040142","msgId":1405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2LmZlZTZkZWQuMmUxYWM5MGVAYW9sLmNvbT4="},"prevInTopic":1404,"nextInTopic":1407,"prevInTime":1404,"nextInTime":1406,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/5/2004 11:00:24 AM Eastern Daylight Time, Kontessa_Rose@hotmail.com writes: P.S. I  know many homeschooling groups that go into hidding","messageBody":"<div id=\"ygrps-yiv-62381399\">In a message dated 7/5/2004 11:00:24 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kontessa_Rose@...\">Kontessa_Rose@...</a> writes:<br/>\n<br/>\nP.S. I  know many homeschooling groups that go into hidding durring the<br/>\nsummer  months! Some find new places to visit where other kids are not<br/>\nas likely to  be, make more private play dates, some even go to public<br/>\nparks with the  kids late at night!&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nI just don&#39;t LIKE to go out in the summer. Too many kids out and about!  &lt;g&gt; <br/>\nI much prefer when school&#39;s IN so that we can have OUR library, OUR  zoo, OUR <br/>\nmuseum all to ourselves! <br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":51071079,"authorName":"Kimberly","from":"&quot;Kimberly&quot; &lt;Kontessa_Rose@...&gt;","profile":"kontessa_rose","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my problem with people","postDate":"1089019751","msgId":1401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjYjcxNytnbmVkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjOXJrMys3djZxQGVHcm91cHMuY29tPg=="},"prevInTopic":1395,"nextInTopic":1404,"prevInTime":1400,"nextInTime":1402,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... You sound really frustrated. Could it be because others have not YET found the truth to what you already know? I know I get upset with others when I see","messageBody":"<div id=\"ygrps-yiv-2058217662\"><blockquote><span title=\"ireply\">&gt;     I would never hide my kids away, but I need to find a balance of <br/>\n&gt; acceptance or I&#39;m going to lose it.  <br/>\n&gt; <br/>\n&gt; AnnMarie<br/>\n<br/>\n </span></blockquote>You sound really frustrated. Could it be because others have not YET<br/>\nfound the truth to what you already know? I know I get upset with<br/>\nothers when I see them putting silly restictions on kids simply<br/>\nbecause it makes their lives easier. I now find myself trying very<br/>\nhard to hold my tonge about such things. Then I ask myself what<br/>\nholding my tonge really does other then pen up the anger. What would<br/>\nhappen if I did vent to these people? What if I showed them my upset?<br/>\nI would feel better I think. Would they? Chances are maybe no, but<br/>\nmaybe I would tell them about unschooling or peaceful parenting and<br/>\nthey would get a bug in their butt, for those same parents want to do<br/>\nwhat is best in others eyes, and so they would look those things up,<br/>\nand maybe.... just maybe, Change!<br/>\n<br/>\n So maybe next time open up, and vent to them your frustration!<br/>\n<br/>\n Blessings,<br/>\n  Kimmy<br/>\n<br/>\nP.S. I know many homeschooling groups that go into hidding durring the<br/>\nsummer months! Some find new places to visit where other kids are not<br/>\nas likely to be, make more private play dates, some even go to public<br/>\nparks with the kids late at night! Is there a law that my child can<br/>\nnot go bug hunting at 2am? LOL She is up anyway!</div>","specialLinks":[]},{"userId":169847153,"authorName":"blessed54321@wmconnect.com","from":"blessed54321@...","profile":"blessed543212003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] my problem with people","postDate":"1089006292","msgId":1395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYy4yNTgyMDE4MS4yZTFhNDRkNEB3bWNvbm5lY3QuY29tPg=="},"prevInTopic":1394,"nextInTopic":1401,"prevInTime":1394,"nextInTime":1396,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/4/2004 4:33:19 PM US Eastern Standard Time, ... some of it is a very normal mommy instinct,,to protect..dont have a good answer...i ve had","messageBody":"<div id=\"ygrps-yiv-1427025315\">In a message dated 7/4/2004 4:33:19 PM US Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gmcontractinginc@...\">gmcontractinginc@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; talk about <br/>\n&gt; grades and the position these parents are putting their kids in to be <br/>\n&gt; mournfull, really; conform, stand in line, don&#39;t break the rules even <br/>\n&gt; if your super excited, anyone who doesn&#39;t follow the rules is bad and <br/>\n&gt; you should make a big fuss, those that are different than we are we <br/>\n&gt; should be weary of, etc.  I have been finding myself less and less <br/>\n&gt; tolerable of people doing what they do and say to their children.  <br/>\n&gt; When we left the parade I said maybe I don&#39;t belong at social <br/>\n&gt; functions anymore.  <br/>\n&gt;     I would never hide my kids away, but I need to find a balance of <br/>\n&gt; acceptance or I&#39;m going to lose it.  <br/>\n&gt; <br/>\n&gt; AnnMarie<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>some of it is a very normal mommy instinct,,to protect..dont have a good <br/>\nanswer...i&#39;ve had to let go of alot of it especially since my kids are growing up <br/>\n{19..18,,15,,11,,}they have to figure out these things sometimes...as far as a <br/>\n youngin as your son,,,you may have to explain to him  that some-people <br/>\nforget  how it feels to be excited just to be able to play ,,and maybe if he could <br/>\n,,get back in line ...as far as the busy--bodies at the strawberry <br/>\nfunction....you will meet them everywhere,,,all you can do is what is best for your <br/>\nkids,,,,to heck with the rest of them.,.,.,.,.,.<br/>\nJune<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171127956,"authorName":"G&M Contracting Inc., Kenneth Gillilan","from":"&quot;G&M Contracting Inc., Kenneth Gillilan&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: my problem with people","postDate":"1088998446","msgId":1394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJS0VGSkNEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGNjYTVndCs4anVvQGVHcm91cHMuY29tPg=="},"prevInTopic":1393,"nextInTopic":1395,"prevInTime":1393,"nextInTime":1395,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... about education.  I try to choose my words wisely and keep my mouth shut more than I ve been used to in the past.  It s not always easy, but it s easier","messageBody":"<div id=\"ygrps-yiv-909771599\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Like someone else mentioned, I don&#39;t talk to others<br/>\n </span></blockquote>about &quot;education.&quot;  I try to choose my words wisely and keep my mouth<br/>\nshut more than I&#39;ve been used to in the past.  It&#39;s not always easy,<br/>\nbut it&#39;s easier than getting involved with a philisophical debate.&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m finding it a little lonely to be quite honest.  Like I&#39;m isolating<br/>\nmyself due to my beliefs.  I know that keeping my mouth shut is the best<br/>\nthing to do, because they are not ready to hear what I have to say.  I<br/>\ncertainly know that these specific parents are not going to agree, so why<br/>\nbother.<br/>\n    I had to finish that volunteering job tonight.  The kids were selling<br/>\nthe strawberry shortcake, which they didn&#39;t make or even think up the idea<br/>\nfor.  Parents couldn&#39;t help but turn it in to a math lesson,(counting out<br/>\nmoney) and a bolstering self esteem event,(forcing kids to talk to people<br/>\nand be aggressive sellers).  One of the moms was so pushy she was making her<br/>\ndaughter cry.  I finally couldn&#39;t stand it anymore and took over the<br/>\nregister and I don&#39;t care one bit if they liked it or not.  You can&#39;t tell<br/>\nme those girls were learning anything by crying....<br/>\n  If any of you have any doubts about Unschooling and are thinking of trying<br/>\npublic school; this is public school and it quite frankly sucks!<br/>\n<br/>\nAnnMarie<br/>\n  -----Original Message-----<br/>\n  From: Tina [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoocrew@...\">zoocrew@...</a>]<br/>\n  Sent: Sunday, July 04, 2004 7:57 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: [unschoolingbasics] Re: my problem with people<br/>\n<br/>\n<br/>\n  &quot;Why, since I&#39;ve learned so much about unschooling, do I find it<br/>\n  so hard to relate to non-unschoolers? I find the trivial talk about<br/>\n  grades and the position these parents are putting their kids in to be<br/>\n  mournfull, really; conform, stand in line, don&#39;t break the rules even<br/>\n  if your super excited, anyone who doesn&#39;t follow the rules is bad and<br/>\n  you should make a big fuss, those that are different than we are we<br/>\n  should be weary of, etc. I have been finding myself less and less<br/>\n  tolerable of people doing what they do and say to their children.&quot;<br/>\n<br/>\n  Short answer - Because you are educated and experienced, and you know<br/>\n  more about really living than those around you.<br/>\n<br/>\n  I can totally relate.  Due to the fact that we have a combination of<br/>\n  educational styles within our own home I face these struggles<br/>\n  everyday.  I want to say so bad, &quot;QUIT SCHOOL!&quot;  I have learned so<br/>\n  much about education and living that I just want to scream it to the<br/>\n  other kids, but I can&#39;t.  I just take their sides, make observations,<br/>\n  don&#39;t worry about grades and try to help them have fun.  Basically,<br/>\n  keep the pressure off or at least to a minimum.<br/>\n<br/>\n  Like someone else mentioned, I don&#39;t talk to others<br/>\n  about &quot;education.&quot;  I try to choose my words wisely and keep my mouth<br/>\n  shut more than I&#39;ve been used to in the past.  It&#39;s not always easy,<br/>\n  but it&#39;s easier than getting involved with a philisophical debate.<br/>\n<br/>\n  You go girl!  You did awesome in the examples that you shared.  You<br/>\n  handled the situation on the play ground beautifully!  Way to go...<br/>\n<br/>\n  Tina<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171127956,"authorName":"G&M Contracting Inc., Kenneth Gillilan","from":"&quot;G&M Contracting Inc., Kenneth Gillilan&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] my problem with people","postDate":"1088997844","msgId":1393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJR0VGSkNEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDIwMDQwNzA0MjE0NzQzLklUQlEyMDQyMS5tdGEwMDYudmVyaXpvbi5uZXRAbjIzLmdycC5zY2QueWFob28uY29tPg=="},"prevInTopic":1389,"nextInTopic":1394,"prevInTime":1392,"nextInTime":1394,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"... you meet what may be an obligation (my mother never did anything at my schools when I was a kid - is it mandatory now?) through some other means - donating","messageBody":"<div id=\"ygrps-yiv-605390474\"><blockquote><span title=\"ireply\">&gt;&gt;Can<br/>\n </span></blockquote>you meet what may be an obligation (my mother never did anything at my<br/>\nschools when I was a kid - is it mandatory now?) through some other means -<br/>\ndonating goods or money instead of your valuable time and spirit? &gt;&gt;&gt;<br/>\n<br/>\nYes! I didn&#39;t realize how strenuous volunteering would be on me.  I have<br/>\nmade a pact to donate money or materials from now on.  I find it so hard to<br/>\nfind anything to say to these people, because their lives are about SCHOOL<br/>\nand mine is everything but school.  I guess it surprised me just how strong<br/>\nmy feelings were and being the only one there with those feelings made it<br/>\nworse.  I internalized instead of speaking out and that puts a lot of stress<br/>\non me I guess.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt; You go girl! You&#39;re a hero, and good for you. She was exaggerating, and<br/>\n </span></blockquote>I<br/>\nbet she is one of those parents who constantly mediates the interactions of<br/>\nher children with other kids also.&gt;&gt;&gt;<br/>\n<br/>\n    You should have seen this women.  She had all those kids lined up and<br/>\nstanding at attention for gods sake.  The funny part was that when her<br/>\ndaughter took the turn that she was apparently being robbed of by my son.<br/>\nThe girl couldn&#39;t climb the wall.  It&#39;s as if she had never been to a<br/>\nplayground in her life.  It was clear that it was a novelty thing not<br/>\nsomething they did on any kind of regular basis.  I felt so sad for her.<br/>\nShe kept looking back at her mom as if to ask if she was doing it right.<br/>\nThe girls was supposed to be playing, but she can&#39;t do it without approval<br/>\nfrom mom.  geesh that bugs me.<br/>\n   I am not the type to lash out at someone especially in front of children,<br/>\nbut I kept my composure with an edge of sternness in my voice so she got the<br/>\npicture and the kids didn&#39;t seem fazed.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;(Come to the<br/>\n </span></blockquote>Conference - be freed at least for a weekend!)&gt;&gt;&gt;<br/>\n<br/>\nI wanted to come so badly this year, but it isn&#39;t working out.  I have been<br/>\nsearching, without much luck, for an Unschooling support group where I live,<br/>\nbut haven&#39;t had much luck.  I would love to go to the park with families who<br/>\nthink like I do, what a relief that would be.<br/>\n<br/>\nThanks for your comments, it made me feel better about the situation I&#39;m in.<br/>\n<br/>\nAnnMarie<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Robyn Coburn [mailto:dezigna@...]<br/>\nSent: Sunday, July 04, 2004 5:47 PM<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSubject: RE: [unschoolingbasics] my problem with people<br/>\n<br/>\n<br/>\n    &lt;&lt;&lt; I seem to be having a problem with people lately.  I volunteered<br/>\nAt my daughters school(my oldest daughter attends public school-<br/>\ndivorce situation)I volunteered my time to cut strawberries for a<br/>\nstrawberry shortcake fund raiser.  There were 10 women there coring<br/>\nstrawberries which gave them too much time and freedom to talk.  All<br/>\nthey could talk about was either how much they hated all the work<br/>\nthat went in to the sixth grade fundraisers or what their child was<br/>\ndoing in school.&gt;&gt;&gt;<br/>\n<br/>\nI don&#39;t do school conversations with anyone. I also don&#39;t get involved in<br/>\ncurriculum/coercion discussions with the school-at-homers in my local group.<br/>\nI do this for my own peace of mind, and because school bashing is an<br/>\nemotional sink hole - not to mention like shooting fish in a barrel. I find<br/>\nit emotionally draining, and I need my attention and spirit for my family,<br/>\nand to an extent, my online activities. This is just me - other people are<br/>\neither more generous or more spiritually secure.<br/>\n<br/>\nRealizing that your daughter is in a unique situation compared to most<br/>\nunschooling families, why do you still have to volunteer at her school? Can<br/>\nyou meet what may be an obligation (my mother never did anything at my<br/>\nschools when I was a kid - is it mandatory now?) through some other means -<br/>\ndonating goods or money instead of your valuable time and spirit?<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;I stepped directly between them, looked her straight in<br/>\nthey eye and said, &quot;I can take care of this&quot;, not nicely.  She<br/>\nstomped away yelling, &quot;well I didn&#39;t think anyone was watching him,<br/>\nbecause he&#39;s done it like six times now&quot;.  It was al I could do not<br/>\nto go after her, because I really felt like she was wronging my<br/>\nchild.  She was lying about the amount of times he &quot;cut&quot; for dramatic<br/>\naffect and it royally pissed me off.&gt;&gt;&gt;<br/>\n<br/>\nYou go girl! You&#39;re a hero, and good for you. She was exaggerating, and I<br/>\nbet she is one of those parents who constantly mediates the interactions of<br/>\nher children with other kids also.<br/>\n<br/>\n    &lt;&lt;&lt;&lt;I know this is long winded, but my question is really a simple<br/>\none.  Why, since I&#39;ve learned so much about unschooling, do I find it<br/>\nso hard to relate to non-unschoolers?&gt;&gt;&gt;&gt;<br/>\n<br/>\nBoy, did you say a mouthful! I agree that this is tough. (Come to the<br/>\nConference - be freed at least for a weekend!)<br/>\n<br/>\nOne part of my journey is coming to the shameful realization that I put<br/>\nundue status on to what other people think. I have to check myself a lot. Am<br/>\nI about to say something Jayn because I sense some stranger&#39;s mere<br/>\ndisapproval? Or is Jayn actually being genuinely obnoxious and needing an<br/>\nalternative suggestion (or experiencing some other unmet need)? My dh is so<br/>\ngreat at not caring what a bunch of strangers think - especially those<br/>\npeople who will be completely unaffected in any real way by our actions.<br/>\n<br/>\nIt has been energizing to me to be encouraged to see how foolish other<br/>\npeople are about restricting their children&#39;s freedoms. I am learning, even<br/>\nin homeschooling circles, to just allow Jayn to do her thing, when it is<br/>\nsafe and fair. And my definition of &quot;safe&quot; is also extending beyond the<br/>\ncomfort levels of many parents. I try to encourage the kids, say at the<br/>\npark, to reach a consensus of what is fair - but this is harder (impossible)<br/>\nwhen a bunch of parents jump in with their instructions and orders.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.714 / Virus Database: 470 - Release Date: 7/2/2004<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links</div>","specialLinks":[]},{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my problem with people","postDate":"1088985437","msgId":1389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjYTVndCs4anVvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjOXJrMys3djZxQGVHcm91cHMuY29tPg=="},"prevInTopic":1383,"nextInTopic":1393,"prevInTime":1388,"nextInTime":1390,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"Why, since I ve learned so much about unschooling, do I find it so hard to relate to non-unschoolers? I find the trivial talk about grades and the position","messageBody":"<div id=\"ygrps-yiv-1656985442\">&quot;Why, since I&#39;ve learned so much about unschooling, do I find it<br/>\nso hard to relate to non-unschoolers? I find the trivial talk about<br/>\ngrades and the position these parents are putting their kids in to be<br/>\nmournfull, really; conform, stand in line, don&#39;t break the rules even<br/>\nif your super excited, anyone who doesn&#39;t follow the rules is bad and<br/>\nyou should make a big fuss, those that are different than we are we<br/>\nshould be weary of, etc. I have been finding myself less and less<br/>\ntolerable of people doing what they do and say to their children.&quot;<br/>\n<br/>\nShort answer - Because you are educated and experienced, and you know <br/>\nmore about really living than those around you.  <br/>\n<br/>\nI can totally relate.  Due to the fact that we have a combination of <br/>\neducational styles within our own home I face these struggles <br/>\neveryday.  I want to say so bad, &quot;QUIT SCHOOL!&quot;  I have learned so <br/>\nmuch about education and living that I just want to scream it to the <br/>\nother kids, but I can&#39;t.  I just take their sides, make observations, <br/>\ndon&#39;t worry about grades and try to help them have fun.  Basically, <br/>\nkeep the pressure off or at least to a minimum.<br/>\n<br/>\nLike someone else mentioned, I don&#39;t talk to others <br/>\nabout &quot;education.&quot;  I try to choose my words wisely and keep my mouth <br/>\nshut more than I&#39;ve been used to in the past.  It&#39;s not always easy, <br/>\nbut it&#39;s easier than getting involved with a philisophical debate.<br/>\n<br/>\nYou go girl!  You did awesome in the examples that you shared.  You <br/>\nhandled the situation on the play ground beautifully!  Way to go...<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] my problem with people","postDate":"1088977644","msgId":1383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNjOXJrMys3djZxQGVHcm91cHMuY29tPg=="},"prevInTopic":1381,"nextInTopic":1389,"prevInTime":1382,"nextInTime":1384,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-628431643\">&lt;&lt;&lt; I seem to be having a problem with people lately.  I volunteered <br/>\nAt my daughters school(my oldest daughter attends public school-<br/>\ndivorce situation)I volunteered my time to cut strawberries for a <br/>\nstrawberry shortcake fund raiser.  There were 10 women there coring <br/>\nstrawberries which gave them too much time and freedom to talk.  All <br/>\nthey could talk about was either how much they hated all the work <br/>\nthat went in to the sixth grade fundraisers or what their child was <br/>\ndoing in school.&gt;&gt;&gt;<br/>\n<br/>\nI don&#39;t do school conversations with anyone. I also don&#39;t get involved in<br/>\ncurriculum/coercion discussions with the school-at-homers in my local group.<br/>\nI do this for my own peace of mind, and because school bashing is an<br/>\nemotional sink hole - not to mention like shooting fish in a barrel. I find<br/>\nit emotionally draining, and I need my attention and spirit for my family,<br/>\nand to an extent, my online activities. This is just me - other people are<br/>\neither more generous or more spiritually secure. <br/>\n<br/>\nRealizing that your daughter is in a unique situation compared to most<br/>\nunschooling families, why do you still have to volunteer at her school? Can<br/>\nyou meet what may be an obligation (my mother never did anything at my<br/>\nschools when I was a kid - is it mandatory now?) through some other means -<br/>\ndonating goods or money instead of your valuable time and spirit?   <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;I stepped directly between them, looked her straight in <br/>\nthey eye and said, &quot;I can take care of this&quot;, not nicely.  She <br/>\nstomped away yelling, &quot;well I didn&#39;t think anyone was watching him, <br/>\nbecause he&#39;s done it like six times now&quot;.  It was al I could do not <br/>\nto go after her, because I really felt like she was wronging my <br/>\nchild.  She was lying about the amount of times he &quot;cut&quot; for dramatic <br/>\naffect and it royally pissed me off.&gt;&gt;&gt;<br/>\n<br/>\nYou go girl! You&#39;re a hero, and good for you. She was exaggerating, and I<br/>\nbet she is one of those parents who constantly mediates the interactions of<br/>\nher children with other kids also.   <br/>\n <br/>\n    &lt;&lt;&lt;&lt;I know this is long winded, but my question is really a simple <br/>\none.  Why, since I&#39;ve learned so much about unschooling, do I find it <br/>\nso hard to relate to non-unschoolers?&gt;&gt;&gt;&gt;<br/>\n<br/>\nBoy, did you say a mouthful! I agree that this is tough. (Come to the<br/>\nConference - be freed at least for a weekend!)<br/>\n<br/>\nOne part of my journey is coming to the shameful realization that I put<br/>\nundue status on to what other people think. I have to check myself a lot. Am<br/>\nI about to say something Jayn because I sense some stranger&#39;s mere<br/>\ndisapproval? Or is Jayn actually being genuinely obnoxious and needing an<br/>\nalternative suggestion (or experiencing some other unmet need)? My dh is so<br/>\ngreat at not caring what a bunch of strangers think - especially those<br/>\npeople who will be completely unaffected in any real way by our actions.<br/>\n<br/>\nIt has been energizing to me to be encouraged to see how foolish other<br/>\npeople are about restricting their children&#39;s freedoms. I am learning, even<br/>\nin homeschooling circles, to just allow Jayn to do her thing, when it is<br/>\nsafe and fair. And my definition of &quot;safe&quot; is also extending beyond the<br/>\ncomfort levels of many parents. I try to encourage the kids, say at the<br/>\npark, to reach a consensus of what is fair - but this is harder (impossible)<br/>\nwhen a bunch of parents jump in with their instructions and orders.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.714 / Virus Database: 470 - Release Date: 7/2/2004</div>","specialLinks":[]},{"userId":171127956,"authorName":"vermontones","from":"&quot;vermontones&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my problem with people","postDate":"1088975299","msgId":1381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjOXJrMys3djZxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":1383,"prevInTime":1380,"nextInTime":1382,"topicId":1381,"numMessagesInTopic":0,"msgSnippet":"I seem to be having a problem with people lately.  I volunteered At my daughters school(my oldest daughter attends public school- divorce situation)I","messageBody":"<div id=\"ygrps-yiv-1376040710\">I seem to be having a problem with people lately.  I volunteered <br/>\nAt my daughters school(my oldest daughter attends public school-<br/>\ndivorce situation)I volunteered my time to cut strawberries for a <br/>\nstrawberry shortcake fund raiser.  There were 10 women there coring <br/>\nstrawberries which gave them too much time and freedom to talk.  All <br/>\nthey could talk about was either how much they hated all the work <br/>\nthat went in to the sixth grade fundraisers or what their child was <br/>\ndoing in school.  I might add that a few of the parents were teachers <br/>\nand some were the die hard volunteers(nose into everything).  The <br/>\nwomen next to me says to me, &quot;Your going to have your hands full when <br/>\nyour three boys(who are close in age) come to school.  I <br/>\nresponded, &quot;no I won&#39;t, I&#39;m homeschooling them&quot;.  The teachers heads <br/>\nshot up and more than one parent looked at me like I was out of my <br/>\nmind.  No one said anything negative, but the uncomfortable silence <br/>\nhung there until someone uncomfortabley said that they knew someone <br/>\nwho was a homeschooler.  <br/>\n    Another example would be today at our town&#39;s parade.  The kids <br/>\nwere all playing on the playground and a tidy line formed infront of <br/>\nthe climbing wall.  My son who is used to playing at the playground <br/>\nwhen the others are in school didn&#39;t even notice the line.  He cut <br/>\nright in front and some women said to him in not a nice voice, &quot;You <br/>\ncan&#39;t cut in line, go to the back&quot;.  I let it go and made my <br/>\nprescence known by bending down to talk to him about the difference <br/>\nbetween when we are here alone and when there are alot of people.  We <br/>\nmust wait in line if we would like a turn (ack!).  Well, he waits for <br/>\nhis turn, climbs the wall and goes down the slide.  In his excitement <br/>\nto do it again he cuts the line.  This women bends down to him, <br/>\nsticks his finger in his face and yells at him to get to the back of <br/>\nthe line.  I stepped directly between them, looked her straight in <br/>\nthey eye and said, &quot;I can take care of this&quot;, not nicely.  She <br/>\nstomped away yelling, &quot;well I didn&#39;t think anyone was watching him, <br/>\nbecause he&#39;s done it like six times now&quot;.  It was al I could do not <br/>\nto go after her, because I really felt like she was wronging my <br/>\nchild.  She was lying about the amount of times he &quot;cut&quot; for dramatic <br/>\naffect and it royally pissed me off.  <br/>\n    I know this is long winded, but my question is really a simple <br/>\none.  Why, since I&#39;ve learned so much about unschooling, do I find it <br/>\nso hard to relate to non-unschoolers?  I find the trivial talk about <br/>\ngrades and the position these parents are putting their kids in to be <br/>\nmournfull, really; conform, stand in line, don&#39;t break the rules even <br/>\nif your super excited, anyone who doesn&#39;t follow the rules is bad and <br/>\nyou should make a big fuss, those that are different than we are we <br/>\nshould be weary of, etc.  I have been finding myself less and less <br/>\ntolerable of people doing what they do and say to their children.  <br/>\nWhen we left the parade I said maybe I don&#39;t belong at social <br/>\nfunctions anymore.  <br/>\n    I would never hide my kids away, but I need to find a balance of <br/>\nacceptance or I&#39;m going to lose it.  <br/>\n<br/>\nAnnMarie</div>","specialLinks":[]}],"prevTopicId":1675,"nextTopicId":1215}}