{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Worries","postDate":"1364819864","msgId":49770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5REJGMURAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49768,"nextInTopic":0,"prevInTime":49769,"nextInTime":49771,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"What is it that fascinates them about it? It s not just sitting there watching mutely with them - it s interacting (where appropriate, commercials or pauses","messageBody":"<div id=\"ygrps-yiv-1436462288\">What is it that fascinates them about it? It&#39;s not just sitting there watching mutely with them - it&#39;s interacting (where appropriate, commercials or pauses for snacks or whenever or asking after the fact &quot;was that the one where...? What was your favorite part?&quot; type questions), watching their faces as they watch to see what is drawing out expressions of glee or rapt attention. The 25th time, watch THEM as they watch the program. Go further into it than &quot;into Suite Life&quot; - what does she like? The interaction of the characters, the actors, living at a posh resort hotel type place, etc... Rise of the Guardians has tons of related stuff (I think there are even books/graphic novels related, as well as assorted action figures and all). What does he like about the &#39;actiony&#39; stuff - is it just that it&#39;s fast paced? Is it the high speed vehicles, the cool gadgets, being a super hero,...? When DS was 5-8 ish, he LOVED 007/James Bond - we had the videogames and we looked for the movies whenever they were on, he totally ignored the &quot;Bond girls&quot; and such but loved the Bond gadgets and the villains&#39; &quot;diabolical plots to take over the world&quot;. One weekend, there was a Bond movie festival on TV so we laid in a supply of favorite snacks and simple meals and spent most of the weekend watching (skipping the ones that we didn&#39;t like as much because there are different actors who play 007). Minecraft is really cool - it&#39;s like computerized Legos on steroids and then some! Go to Amazon and search &quot;Minecraft&quot; and look at all the related gear, it&#39;s amazing.<br/>\n<br/>\nWhat games are you playing? Have they watched you play? Are they games where you can play together or compare notes (DS and I compare notes on Fruit Ninja games on our smart phones - keeping each other up to date on which background and swords we&#39;ve unlocked and such like that).<br/>\n<br/>\nIf you can, get a membership to the children&#39;s museum rather than paying each time - even better, get the grandparents or aunties or whomever to give a family membership as a holiday gift maybe. That way, it&#39;s a quick and easy thing - no cash on hand needed, just up and go.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151505017,"authorName":"CarenKH","from":"&quot;CarenKH&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Worries","postDate":"1364509395","msgId":49768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqMmZzaityZnI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqMWc5OStoM3A0QGVHcm91cHMuY29tPg=="},"prevInTopic":49767,"nextInTopic":49770,"prevInTime":49767,"nextInTime":49769,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"=-= My kids LOVE to go OUT and do stuff, I have trouble thinking of things to do, its still winter here, and I HATE the cold, so I dont like doing things","messageBody":"<div id=\"ygrps-yiv-2048092970\">=-=&gt; My kids LOVE to go OUT and do stuff, I have trouble thinking of things to do, its still winter here, and I HATE the cold, so I dont like doing things outside in winter, but there just isnt much to do where we live...=-=<br/>\n<br/>\nInvest in a really good long winter coat, long underwear, warm socks, hats, gloves & scarves. I used to hate the cold as well, and used that as an excuse to not do much in the winter. And, we&#39;re in NC, it&#39;s not like the great frozen tundra here or anything like that. We got a dog, and before we did, I committed to walking him twice a day. Keeping that commitment meant learning how to dress so I&#39;d be warm - and I am! A benefit of that was being more willing to get off my a** in the wintertime, and go do stuff. Hiking, walks on the city&#39;s greenway, taking the dig to the dog park - nothing huge, just getting *out*. That was SO beneficial for all of us!<br/>\n<br/>\nIt did mean an initial outlay of some money, to get quality items. Completely & totally worth it! I bought my coat from Lands&#39; End, and they have a complete, any time, any reason, 100% return policy. I returned my 12-year-old coat this year because of a broken zipper, and they sent me a brand new coat.<br/>\n<br/>\nClothing technology has advanced so much, warm clothing doesn&#39;t have to mean bulky & uncomfortable any more.<br/>\n<br/>\nI am SO glad I learned how to get out in winter - it really seemed to shift stuff for us, in a good way.<br/>\n<br/>\nPeace,<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Worries","postDate":"1364492979","msgId":49767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqMXZyait1ZTM2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqMWc5OStoM3A0QGVHcm91cHMuY29tPg=="},"prevInTopic":49766,"nextInTopic":49768,"prevInTime":49766,"nextInTime":49768,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"... *************** Shops, malls if you have any close by. Specialty shops are like museums! Pet shops are like free zoos and aquariums. Go out and play arcade","messageBody":"<div id=\"ygrps-yiv-36998287\">&quot;sara&quot; &lt;sarajoturtle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My kids LOVE to go OUT and do stuff, I have trouble thinking of things to do, its still winter here, and I HATE the cold<br/>\n </span></blockquote>***************<br/>\n<br/>\nShops, malls if you have any close by. Specialty shops are like museums! Pet shops are like free zoos and aquariums. <br/>\n<br/>\nGo out and play arcade games... here&#39;s the essential &quot;Deb&#39;s List of Things to do in Winter&quot; for some good ideas:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/deblist\">http://sandradodd.com/strew/deblist</a><br/>\n<br/>\nLook for local tourist information - sounds nutty, maybe, but I&#39;m always amazed at the things in my area. Hidden little novelties I didn&#39;t even know were there. <br/>\n<br/>\nLook for little comic book shops - not big ones in big bookstores but little mom-and-pop places. Some are combined with used bookstores, so look for both. Some sell action figures and oddities as well. Some have regular game days for people who like to play RPGs, or pokemon-style card games. And if not you may be able to start something. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Worries","postDate":"1364492453","msgId":49766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqMXZiNSs5dTZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqMGRhOCs3bXA4QGVHcm91cHMuY29tPg=="},"prevInTopic":49765,"nextInTopic":49767,"prevInTime":49765,"nextInTime":49767,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"... ************** Curriculums are a good way to squash their creativity, rather than encourage it. It s great to want to create a rich, full environment - but","messageBody":"<div id=\"ygrps-yiv-311325400\">&quot;sara&quot; &lt;sarajoturtle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What worries me though is that Im not doing enough for them to get thier creative juices going, and that worry is causing me to want to start buying curriculums. <br/>\n </span></blockquote>**************<br/>\n<br/>\nCurriculums are a good way to squash their creativity, rather than encourage it. It&#39;s great to want to create a rich, full environment - but schooly stuff isn&#39;t usually a good way to get there. Instead, think about the sorts of things they like in general - animals or trucks or dinosaurs or pokemon or magic, building or climbing or swimming or dancing... use what they enjoy as a jumping off place to consider what to offer. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Right now my older two (6 and 10) are very into watching movies/tv, and playing on thier kindle fires, with lots of great games including minecraft.  I honestly appreciate all the things they are learning from those games and those tv shows, but sometimes I feel as though Im over here in the side lines just watching. <br/>\n </span></blockquote>**************<br/>\n<br/>\nLook for ways to get involved. Play some of the same games. Look for related ideas and stuff - make costumes or stuffed toys, create a website archiving what they&#39;re doing, make food related to favorite games, shows or characters. <br/>\n<br/>\nAnd look for things to &quot;strew&quot; - strewing isn&#39;t the same as offering something related to what your kids already enjoy, it&#39;s offering things which look interesting in a more general way. That might include &quot;educational&quot; sorts of things like a magnet building set or a marble run, or an interesting deck of cards. It might include seasonal decorating. It might include renting movies or buying audio books which appeal to you but would also be appropriate for kids - Howl&#39;s Moving Castle, or Apollo 13, or Forbidden Planet. The sorts of things your kids might say no to if asked, but if it&#39;s there, they might stop and join you watching or listening. Or not - it&#39;s not a trick or a trap into doing something &quot;good for them&quot; it&#39;s strewing their paths with opportunities. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Worries","postDate":"1364479481","msgId":49764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNDIyOENFLTRDNDMtNDU0MC1BODlBLTA2RDVDREZEQjIwRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtqMGRhOCs3bXA4QGVHcm91cHMuY29tPg==","referencesHeader":"PGtqMGRhOCs3bXA4QGVHcm91cHMuY29tPg=="},"prevInTopic":49763,"nextInTopic":49765,"prevInTime":49763,"nextInTime":49765,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"... They need more than the freedom to choose. They need someone creating choices specifically tailored to their likes and personalities. Don t think of","messageBody":"<div id=\"ygrps-yiv-17923427\">On Mar 27, 2013, at 11:27 PM, sara wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And sometimes I worry that they are just watching tv and such because they dont know what else to do, <br/>\n<br/>\n<br/>\n </span></blockquote>They need more than the freedom to choose. They need someone creating choices specifically tailored to their likes and personalities.<br/>\n<br/>\nDon&#39;t think of yourself as the director of their education. Think of yourself as a cruise director. Create opportunities you believe they&#39;ll enjoy. Take them on adventures which may be &quot;big&quot; like trips to museums and zoos, &quot;medium&quot; like trips to nearby towns, and &quot;small&quot; visits to new playground, new grocery stores.<br/>\n<br/>\nIf they don&#39;t want to go, why don&#39;t they? Are they essentially homebodies? Then create more opportunities at home. Are they busy? Can you bring their busy things along? Are you picking things you think they should enjoy rather than what they do enjoy?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":474971233,"authorName":"sara","from":"&quot;sara&quot; &lt;sarajoturtle@...&gt;","profile":"sarajoturtle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Worries","postDate":"1364477033","msgId":49765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqMWc5OStoM3A0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5REI5ODVAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49764,"nextInTopic":49766,"prevInTime":49764,"nextInTime":49766,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"Well mostly Im just doing my own thing, Im cooking or cleaning most of the time, if not that, then Im on the computer, or playing games by myself, I have a","messageBody":"<div id=\"ygrps-yiv-1824577653\">Well mostly Im just doing my own thing, Im cooking or cleaning most of the time, if not that, then Im on the computer, or playing games by myself, I have a three yr old who still likes my attention so I play with him too.<br/>\n<br/>\nI do watch their shows with them to an extent, they have a tendancy to watch the same things over, and over, and over, so after Ive seen it say 20 times it gets old do me.  My daughter is into Suite life of Zach and Cody, my son likes anything actiony, we just bought Rise of the Guardians, which is really good btw, but they are on thier fifth watch already, so Im kinda bored with it.  I do watch the shows with them the first few times but after that, its not much fun for me.  Plus its not like they are really paying attention to me being there watching it with them anyway.<br/>\n<br/>\nThier games are a little tricky its hard to get involved in that, I mean I watch sometimes, but its on thier kindles which are small so I have to be sitting like behind them to watch.  I dont get minecraft like at all lol so I guess I can ask them questions how it works.<br/>\n<br/>\nMy kids LOVE to go OUT and do stuff, I have trouble thinking of things to do, its still winter here, and I HATE the cold, so I dont like doing things outside in winter, but there just isnt much to do where we live...<br/>\n<br/>\nIm part of a homeschool group that does field trips, we join those but they are usually only once or twice a month and a 45 minute drive away.  Pretty much all the cool stuff is like a 45 minute drive away.  We have a childrens museum which they like but its rediculously expensive, so we cant go often, we have a membership to the zoo, but its closed in the winter.... I just dont know what to do with them besides hang at home...<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt;<br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Worries","postDate":"1364473200","msgId":49763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5REI5ODVAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49762,"nextInTopic":49764,"prevInTime":49762,"nextInTime":49764,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"What are you doing over there by yourself? Are you cooking, gardening, sewing, creating, reading, ...? Are you waiting for something to look like school? Are","messageBody":"<div id=\"ygrps-yiv-1534579546\">What are you doing &quot;over there&quot; by yourself? Are you cooking, gardening, sewing, creating, reading, ...? Are you waiting for something to look like school? Are you waiting for them to say &quot;hey mom, let&#39;s do a workbook. Let&#39;s go to a museum. Let&#39;s go collect leaves.&quot;? Look at what they are loving and find ways to bring more of it into the mix - and look for branches off of it. Look for museum exhibits, magazines/articles, websites. Look for connections between TV program A and movie B and book C. Make a &quot;Minecraft&quot; lunch where the meal is built around square stuff (croutons, cheese cubes, etc - include them in the thinking since they probably know more about it). Look for Spongebob snacks (pineapple, maybe, or invent a &#39;crabby patty&#39;, or whatever). All of that, however, means that you need to be seeing the shows and asking questions about the games, finding out what they love about the movie they&#39;re watching - is it the music, the graphics, the characters, the plot? - not just reading a magazine or doing the laundry &quot;off to the side&quot;. Find out who the writer, producer, voice actors, graphic artists, etc are (imdb.com is helpful for that) and look for other programs by the same person/people. For example, Hugh Laurie from House is also in the Blackadder series (with his actual British accent!) with Rowan Atkinson who is Mr. Bean (hysterically funny program). We&#39;ve actually found a place where we can get Wensleydale cheese, that most beloved cheese of Wallace from Wallace & Grommitt claymation programs. We use things like Netflix (instant queue) to find old episodes of things like Gil Gerard era Buck Rogers TV series to compare the technology and special effects with things like Start Trek: The Next Generation (compare Twiki with Data!) We spent one stretch watching MST3K - really bad old movies with humorous commentary, all those kind of things you&#39;d say &quot;no, don&#39;t go there - that&#39;s where the monster is!&quot; lol Some of these things, old TV and movies, books, connections, are things that you may know that they don&#39;t know exist. Suggest them &quot;Hey kids, I found out that there&#39;s a new exhibit of pineapple art down at the local art museum - I wonder if any of it includes Spongebob&#39;s house?&quot; BUT one of the keys to all of it is offering with no strings attached - they may decide to go for it or they may not, but either way is okay. Consider how you would offer things to a best friend &quot;Hey, I just heard that your favorite band is going to be playing at the venue a couple of towns over - we could have a ladies&#39; night and go!&quot; Friend might say &quot;Awesome! I&#39;m there!&quot; or they might say &quot;Let me check my calendar, if I&#39;m free, great!&quot; or they might say &quot;No thanks&quot;. And, all of that is okay.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Worries","postDate":"1364471882","msgId":49762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqMWI4YStqb2JuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqMGRhOCs3bXA4QGVHcm91cHMuY29tPg=="},"prevInTopic":49760,"nextInTopic":49763,"prevInTime":49761,"nextInTime":49763,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"What else have they suggested? What have you suggested? Are you worried about them or about yourself? Or both? And if it is creativity you are worried about,","messageBody":"<div id=\"ygrps-yiv-1190695336\">What else have they suggested? What have you suggested? Are you worried about them or about yourself? Or both? <br/>\n<br/>\nAnd if it is creativity you are worried about, buying a curriculum doesn&#39;t sound like the solution. :)<br/>\n<br/>\nNance<br/>\n<br/>\n---<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; What worries me though is that Im not doing enough for them to get thier creative juices going, and that worry is causing me to want to start buying curriculums.  I dont want to do that but my worry sometimes takes over.  <br/>\n&gt; <br/>\n&gt; Right now my older two (6 and 10) are very into watching movies/tv, and playing on thier kindle fires, with lots of great games including minecraft.  I honestly appreciate all the things they are learning from those games and those tv shows, but sometimes I feel as though Im over here in the side lines just watching.  I dont really feel involved, they are watching thier movies and playing thier games and Im over here all by myself.  <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":474971233,"authorName":"sara","from":"&quot;sara&quot; &lt;sarajoturtle@...&gt;","profile":"sarajoturtle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Worries","postDate":"1364441224","msgId":49760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqMGRhOCs3bXA4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49762,"prevInTime":49759,"nextInTime":49761,"topicId":49760,"numMessagesInTopic":0,"msgSnippet":"Lately i have been finding myself worrying more about not doing enough with my kids.  Im pretty new to unschooling still, its only been about a yr. I know","messageBody":"<div id=\"ygrps-yiv-2043417595\">Lately i have been finding myself worrying more about not doing enough with my kids.  Im pretty new to unschooling still, its only been about a yr.  <br/>\n<br/>\nI know unschooling is working, I know they are learning.  My daughter (6) is right where she would need to be academically to be in public school, my son however is not, hes 10 and probably at least one grade level behind where he would be in public school, but I dont think he would be any farther ahead being IN school, hes just a late bloomer.<br/>\n<br/>\nWhat worries me though is that Im not doing enough for them to get thier creative juices going, and that worry is causing me to want to start buying curriculums.  I dont want to do that but my worry sometimes takes over.  <br/>\n<br/>\nRight now my older two (6 and 10) are very into watching movies/tv, and playing on thier kindle fires, with lots of great games including minecraft.  I honestly appreciate all the things they are learning from those games and those tv shows, but sometimes I feel as though Im over here in the side lines just watching.  I dont really feel involved, they are watching thier movies and playing thier games and Im over here all by myself.  <br/>\n<br/>\nAnd sometimes I worry that they are just watching tv and such because they dont know what else to do, like they would rather do that than be bored, so thats what they do.  I feel like I should be doing something to get them interested in stuff, but I dont really know how...<br/>\n<br/>\nAppreciate the help, thx!<br/>\n<br/>\nSara</div>","specialLinks":[]}],"prevTopicId":49755,"nextTopicId":49772}}