{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":170260284,"authorName":"sandrewmama","from":"sandrewmama &lt;sandrewmama@...&gt;","profile":"sandrewmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"teen anxiety was: Re: kids asking for things./reply from Colleen\tin GA","postDate":"1097072685","msgId":3416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEODk2QTVDLjI2OTclc2FuZHJld21hbWFAbWNoc2kuY29tPg==","inReplyToHeader":"PDEwOTcwMjUyOTAuMzAxLjg1MTc2Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3415,"nextInTime":3417,"topicId":3416,"numMessagesInTopic":0,"msgSnippet":"Kelly, I think I understand what you are saying.  While four - six more years at home doesn t sound like much, a lot can change in that short time, especially","messageBody":"<div id=\"ygrps-yiv-663446201\">Kelly,<br/>\n<br/>\nI think I understand what you are saying.  While four - six more years at<br/>\nhome doesn&#39;t sound like much, a lot can change in that short time,<br/>\nespecially for a teen.<br/>\n<br/>\nAlthough I believe my 13 yo is experiencing something sort of like<br/>\nde-schooling, de-parental controlling I guess, he has never been to school.<br/>\nWe&#39;ve relaxed homeschooled since the beginning.  Over the years we dabbled<br/>\nin a little bit of commercial math curriculum and last year in a desparate<br/>\nattempt to broaden his horizons,  I started assigning him daily reading and<br/>\npractice in subjects like math, science, history, a foreign language and<br/>\ncritical thinking.  On one hand he seemed to appreciate the direction my<br/>\nassignments gave him and he dutifully worked through the assignments each<br/>\nday.  He seemed adept at managing his time on a daily and weekly basis.  At<br/>\nthat same time he was attending our local Jr. High band class, playing<br/>\nsaxophone in the after-school jazz band and taking private lessons on his<br/>\nclarinet. The number of performances and competition increased considerably<br/>\nand this made him uneasy as well as interfering with the regularly scheduled<br/>\nhomeschool friend time that we&#39;d established over the years.<br/>\n<br/>\nHe also was helping a group of friends (homeschoolers in a<br/>\nhome-school-assistance program) prepare for a literary competition in weekly<br/>\nbook discussion meetings. He was and is Treasurer for his homeschool 4-H<br/>\ngroup.<br/>\n<br/>\nIn January he got sick and we struggled along starting back up again with<br/>\nour routine only to have him get worse and have to drop back out.  This went<br/>\non for several months and over that time he grew more and more resistant to<br/>\nreturning to band at all.  He was so anxious that he&#39;d fallen behind his<br/>\nbandmates and was afraid of messing up and embarrassing himself.  Even<br/>\nthough he was one of the best clarinetists in the band, he did not want to<br/>\ncontinue.  We decided to call it quits for the school year in April.<br/>\n<br/>\nYou asked what he is passionate about.  Passion is a strong emotion.  I&#39;m<br/>\nnot sure that he feels strongly enough about anything to call it a passion<br/>\nbut I know that he enjoys reading and playing role-playing-game video games<br/>\nmore than just about anything else. At one time, for the first couple of<br/>\nyears, I think he was passionate about playing music. A typical day for him,<br/>\nif it doesn&#39;t involve social outings, consists of reading, playing imaginary<br/>\nfantasy-like games with his sister, video games, more reading, more video<br/>\ngames, helping a little around the house, reading to his sister, and more<br/>\nvideo games.<br/>\n<br/>\nHe seems to be aware that there is a lot of interesting stuff to learn<br/>\nabout.  I think he worries about being left behind by his more structured<br/>\nhomeschool mates.  His age-mate friends, who have homeschooled their entire<br/>\nlives are all now either going to school part-time (in talented and gifted<br/>\nprograms) or seriously considering attending high-school beginning next<br/>\nyear. He has no desire whatsoever to go to high school, thankfully, but I<br/>\nbelieve that he is secretly comparing himself, a relatively naive, sensitive<br/>\nand self-sheltered kiddo to his friends who are out there achieving academic<br/>\naccolades, socially gregarious and quite clued into the complexities of the<br/>\nworld.<br/>\n<br/>\nI worry that my responses here are too long, but I&#39;m hoping that by painting<br/>\na detailed picture, someone will be able to offer their experience or<br/>\nsuggestions and others may be able to gain something that helps in their own<br/>\nstruggle.<br/>\n<br/>\nGratefully,<br/>\n<br/>\nChris<br/>\n<blockquote><span title=\"qreply\"> &gt; Time flies, but each moment can last a long time. &lt;g&gt;<br/>\n&gt; <br/>\n&gt; Thirteen is still young. At 13, Cameron was still in his weird deschooling<br/>\n&gt; vegetative state. It wasn&#39;t until he was 14 that things really started to<br/>\n&gt; happen. Fifteen (and with a car!) was a whirlwind----and now at 16, he&#39;s SO<br/>\n&gt; thoughtful and capable and sure of himself----and we can&#39;t keep up with him at<br/>\n&gt; all.<br/>\n&gt; <br/>\n&gt; Most children (and especially schooled children) seem to struggle a bit  from<br/>\n&gt; 12-14. I think the unschooled ones come out more &#39;whole&#39;.<br/>\n&gt; <br/>\n&gt; At 13.5, you have a LOT of time....and no time at all! &lt;G&gt; But I&#39;d<br/>\n&gt; concentrate more on the &#39;a lot of time&#39;. &lt;g&gt;<br/>\n&gt; <br/>\n&gt; What passions does he have?<br/>\n&gt; <br/>\n&gt; ~Kelly </span></blockquote></div>","specialLinks":[]}],"prevTopicId":3405,"nextTopicId":3420}}