{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Speech Disfluencies","postDate":"1184559343","msgId":24985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3ZXJkZit1ZmJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2OUFCMjlGLjMwMjAyMDZAdHdjbnkucnIuY29tPg=="},"prevInTopic":24983,"nextInTopic":0,"prevInTime":24984,"nextInTime":24986,"topicId":24928,"numMessagesInTopic":0,"msgSnippet":"Dear Heather, I just wanted to put in my experiences with therapies, I don t know how helpful it will be but the snip that I quoted below reminded me of my","messageBody":"<div id=\"ygrps-yiv-828091102\">Dear Heather,<br/>\nI just wanted to put in my experiences with therapies, I don&#39;t know how helpful it will be <br/>\nbut the snip that I quoted below reminded me of my Sam. He has dysarthria, mostly his <br/>\nspeech was affected, and at the age of two and a half, we did seek out therapy because he <br/>\nwas so angry all the time, because we couldn&#39;t understand. Not for lack of trying, but we <br/>\nhonestly did not know how to help him and honestly could not understand where he was <br/>\ngoing with stuff. He knew and used some sign language, but he wanted to talk and he <br/>\nwanted us to understand. If we did not understand immediately, people were likely to be <br/>\nhurt. So we went to a good therapist (in that she was very respectful and child-oriented, <br/>\nshe actually worked with us with our other kids too)  and once she figured out where the <br/>\nproblem was, he made really rapid progress. After about twelve months, he was finished. <br/>\n<br/>\nExcept that once ST stopped, he started to regress a bit. But it was okay at that point <br/>\nbecause emotionally he was able to deal with us not understanding, and able to try <br/>\nalternative language options. Today he still has some motor problems, bites himself a lot <br/>\ntalking and eating, but he&#39;s okay with it, and better yet, we all understand how to help him <br/>\nin a natural, loving environment that he&#39;s okay with. If he gets to a point where he&#39;s <br/>\nfrustrated again, we&#39;d address the possibility of therapy again, and use it as needed. But <br/>\nfor now we can do our own stuff (lots of sensory diet, stimulating the mouth, slowing <br/>\ndown and concentrating once or twice a day helps the rest of the day, etc)<br/>\n<br/>\nEarly therapy does help most kids, but it&#39;s not the end-all, be-all that people imagine. In <br/>\nfact, we&#39;ve been vilified because our autistic daughter isn&#39;t in all kinds of therapy, forty <br/>\nhours a week. The funny thing is that she&#39;s still developing, and she&#39;s much happier than <br/>\nshe was before unschooling, untherapy, unEVERYthing. :-) I think unschooling as been the <br/>\nbest for all of our kids because it accepts their differences and we can live our life fulfilling <br/>\nneeds without guilt or worry or shame. I think that &#39;intervention&#39; is a loaded word, because <br/>\nlife intervenes. Kids learn to read because words intervene, writing happens because kids <br/>\nneed to write...and speech happens because kids have to talk. If they need tools, then we <br/>\nfind the tools. For us, it happened to be a speech therapist. Then it wasn&#39;t. It might be <br/>\nagain, but there&#39;s no guarantees. I think what you&#39;ve described for your son has been <br/>\nwonderful, and I&#39;m sorry that he&#39;s worried about his radio class. I hope he can find some <br/>\npeace there,<br/>\nMelissa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, hbmccarty &lt;hbmccarty@...&gt; wrote:<br/>\n. There are plenty of examples of <br/>\n&gt; children learning to read or write or sit still in time with no <br/>\n&gt; intervention. Less so with speech- and the warnings to seek therapy <br/>\n&gt; early are pretty universal.<br/>\n&gt; <br/>\n&gt; Heather<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Speech Disfluencies","postDate":"1184543391","msgId":24983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OUFCMjlGLjMwMjAyMDZAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGY3Nm5zaCtwcWd0QGVHcm91cHMuY29tPg==","referencesHeader":"PGY3Nm5zaCtwcWd0QGVHcm91cHMuY29tPg=="},"prevInTopic":24949,"nextInTopic":24985,"prevInTime":24982,"nextInTime":24984,"topicId":24928,"numMessagesInTopic":0,"msgSnippet":"thanks Lisa- this is helpful ... So apparently the speech therapy did *not* help if there is no real change in a new situation, perhaps it s not the speech but","messageBody":"<div id=\"ygrps-yiv-834007535\">thanks Lisa- this is helpful<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n </span></blockquote>So apparently the speech therapy did *not* help if there is no real<br/>\nchange in a new situation, perhaps it&#39;s not the speech but the new<br/>\nsituation that causes an amount of anxiety. Does this tend to pass<br/>\n<blockquote><span title=\"ireply\">  &gt;once he is comfortable in a new environment?<br/>\n<br/>\n<br/>\n </span></blockquote>I am not sure since this has really not happened like this- so dramatic <br/>\na change in a short period of time. though he does seem to be less <br/>\nworried now than a few days ago, and his speech seems to come a little <br/>\nbit easier. He is willing to go into situations, and is not avoiding speech.<br/>\n<br/>\nI did speak to the supervising professor at the college where he has <br/>\nattended speech therapy and he said that since my son hadn&#39;t been <br/>\nexperiencing the same type of disfluency/speech blockages in the past <br/>\nthat he is now, they hadn&#39;t been focusing on recovery strategies as much <br/>\nas general clearness of speech and confidence, and that he thought that <br/>\nhe could use some more specific strategies to deal with this situation. <br/>\nI like him and the general theory and attitude of this clinic. They are <br/>\nvery respectful of kids, and also deal with anxiety and thoughts <br/>\nunderlying the speech issues, as well as strategies and control.<br/>\n<br/>\nWhen we sought therapy for him the second time a few years ago(age 11?), <br/>\nhis speech was difficult to understand- unclear and low in volume- <br/>\nattempting to cover up the stutter. He had been in speech therapy in our <br/>\nformer school district for a couple of years, but that seemed to be of <br/>\npoor quality and there were 2-3 years in between that he had no speech <br/>\ntherapy.The reason we did seek therapy to begin with was due to my <br/>\nhusband&#39;s concern. I agreed because I was starting to feel like I was <br/>\nbeing neglectful as the conventional wisdom on this says you must seek <br/>\ntherapy at a young age. My husband agreed with this, and I reluctantly <br/>\nagreed to take him, as I couldn&#39;t really back up my point of view- which <br/>\nwas to just wait and see and not focus on it and let him build <br/>\nconfidence in general. We were not allowing our son at that time to make <br/>\ndecisions as much as he does now. Now I  discuss with him whether he <br/>\nwill go back each session, and he says that although he doesn&#39;t enjoy <br/>\ngoing, it has been of benefit and he decides to go back.  It is too late <br/>\nto go back to it not being a thing, or to remove the label. In the past <br/>\ncouple of years his speech has really not been an issue, and he has <br/>\nbecome really great at communicating with all kinds of people and going <br/>\ninto new situations and being comfortable. Maybe due to speech therapy, <br/>\nor maybe it would have happened anyway.<br/>\n<br/>\nNow I am wondering if even taking him at all was a mistake. I have just <br/>\nrealized that I have been looking at this as more of a<br/>\nmedical issue, rather than a what might be described as a learning <br/>\nissue, or not as an issue at all. When I hear of someone seeking help <br/>\nfor a child who is reading or writing, later than usual or doesn&#39;t sit <br/>\nstill, and therefore having a label placed on that child and calling it <br/>\na medical problem, I don&#39;t think of it as being similar to what we did <br/>\nwith our son and his speech. Now I see it. I think when you are the <br/>\nparent of a child who is has some &quot;problem&quot; like this, it can become <br/>\ndifficult to trust yourself and to feel that you must &quot;DO SOMETHING&quot; and <br/>\nquickly, before it is too late- due to opinions of others around you and <br/>\nwanting to be a &quot;good&quot; parent. Especially when the other person is also <br/>\na parent of your child! I often take the strategy of doing nothing until <br/>\nmy husband gets pretty uncomfortable with doing nothing and forces the <br/>\nissue.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;Has he expressed this as limiting or are you? Can you simply be an<br/>\n </span></blockquote>empathetic listener when he expresses frustration and then remind him<br/>\nthat he is a wonderful communicator once he is comfortable in a<br/>\nsituation and that you have full confidence that this will work its<br/>\n<blockquote><span title=\"ireply\">  &gt;way out once Ithaca is no longer new (assuming it is).<br/>\n<br/>\n<br/>\n </span></blockquote>He did bring it up - one night after he attended a session of the  radio <br/>\nbroadcast/sound tech course he is taking- it was the first night they <br/>\nmet at the radio station. He was unable to say his name when he went in, <br/>\nand unable to take his turn speaking on the radio with the other kids. <br/>\nHe expressed frustration at not being able to say what he wanted to say- <br/>\nand thought maybe he shouldn&#39;t go back. We haven&#39;t talked much more <br/>\nabout it, but he is scheduled to go back tomorrow night.<br/>\n<br/>\nI did remind him that he is very capable of clear understandable speech, <br/>\nand that he can get back there again. I also told him that  therapy <br/>\nsessions are available if he feels like he needs them. We are waiting <br/>\nand seeing right now. I feel a little confused about the value of the <br/>\ntherapy, and how to see it.<br/>\n<br/>\nI am not someone who seeks help with health or other problems outside of <br/>\nmyself very often- mostly due to skepticism and partly<br/>\ndue to finances. My husband is much quicker to say- let&#39;s take them to <br/>\nthe doctor, or whoever, when something seems to be wrong.  I usually <br/>\ntrust that things will resolve themselves and trust my own judgment in <br/>\nthe situation, not an expert&#39;s. Most of the time we see a doctor, I <br/>\nwonder why we went and leave the prescription in my wallet, and go home <br/>\nand do what I thought was right anyway. However, my husband does not <br/>\nalways trust my judgment. Sometimes I get a little weary and give in. <br/>\nAnd not really having any information on this particular issue besides <br/>\nthe conventional, I doubt myself. There are plenty of examples of <br/>\nchildren learning to read or write or sit still in time with no <br/>\nintervention. Less so with speech- and the warnings to seek therapy <br/>\nearly are pretty universal.<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Speech Disfluencies","postDate":"1184293585","msgId":24949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3Nm5zaCtwcWd0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2OTRBQjU1LjEwMzAwMDVAdHdjbnkucnIuY29tPg=="},"prevInTopic":24938,"nextInTopic":24983,"prevInTime":24948,"nextInTime":24950,"topicId":24928,"numMessagesInTopic":0,"msgSnippet":"Heather gave me permission to repost this to the group.  We ve been friends for many years and she had emailed me privately about this earlier in the week.  It","messageBody":"<div id=\"ygrps-yiv-39162305\">Heather gave me permission to repost this to the group.  We&#39;ve been <br/>\nfriends for many years and she had emailed me privately about this <br/>\nearlier in the week.  It wasn&#39;t until after i sent her my response <br/>\nthat i saw her posting on UB.  I thought perhaps my personal reply to <br/>\nher would be of interest to others on this list as well as wanting to <br/>\nhear what others might have to say on the subject.<br/>\n<br/>\n***** My reply....<br/>\nOlder dd&#39;s enunciation was difficult to understand when she was <br/>\nyounger (in fact younger dd was the same way).  But it was never a <br/>\nmajor issue because she was<br/>\nalways with me and so I was there to interpret.   (Younger dd on the <br/>\nother hand<br/>\nwas harder to understand and best friend sometimes interpreted even <br/>\nfor me.  It would frustrate younger dd that I would ask her to repeat <br/>\nor slow down what she said so I could understand her.  I had to make <br/>\nsure I was looking directly head on in order to capture what she <br/>\nsaid.)  I had noticed that when older dd spoke to my mom on the phone <br/>\nshe slowed down and spoke more clearly.  It reflected how dependant <br/>\nwe are on visual cues when communicating because in their absence <br/>\n(the telephone) it did require her to compensate.  Also - my personal <br/>\ntheory was that had she been in daycare, preschool or kindergarten <br/>\nthe development of her enunciation would have been different.  She <br/>\nwasn&#39;t required to focus attention on it and so it developed at her <br/>\nown pace.<br/>\nOlder dd still has difficulty with word spaghetti and hospital.  <br/>\nDouble constanants being more difficult language developmentally.  I <br/>\nnever took her to &#39;professional&#39; speech person even though my mother <br/>\nand brother brought it up as something I should consider.  And <br/>\nyounger dd still has a slight lisp that I can detect but no one has <br/>\never commented and I will not.<br/>\n<br/>\nOlder dd has no speech &#39;disfluency&quot; at this time in her life.  What a <br/>\nfancy word for one who can&#39;t get the words out as quickly as their <br/>\nmind is thinking.  (That is what the pediatrician said about her <br/>\nspeaking style when she was 5 and dh insisted we consult <br/>\na &#39;professional.&#39;...she justs thinks faster than she can talk).  That <br/>\nwas the extent of our investigations and we did it discretely so that <br/>\nshe was unaware the doc was listening with intent.<br/>\n<br/>\nWe didn&#39;t notice anything at all with your ds when we were with you <br/>\nlast month.<br/>\n<br/>\nSo apparently the speech therapy did *not* help if there is no real <br/>\nchange in a new situation, perhaps it&#39;s not the speech but the new <br/>\nsituation that causes an amount of anxiety.  Does this tend to pass <br/>\nonce he is comfortable in a new environment?  <br/>\n<br/>\nWithout knowing more...my first instincts would be to not focus on <br/>\nremoving the stuttering per se but to help him to be comfortable with <br/>\nhimself when he finds he is not clearly able to communicate.  To <br/>\nreinforce his success in overcoming his &#39;disfluency&#39; (now that it&#39;s <br/>\nbeen labeled) once he is acclimated to a new environment.  I&#39;d focus <br/>\non giving him tools to build his confidence, reminder him that it <br/>\ndoes eventually pass once a situation is no longer new.  Or that it <br/>\ndoesn&#39;t always exist at all in every situation.  Is it certain people <br/>\nor situations that tend to bring up the stutter?  Is it speaking in <br/>\nfront of a group?  Or just when he&#39;s excited about something?<br/>\nThese would be questions I might ask him *if he wants to discuss <br/>\nit*...or is this something you are concerned about and he is not.  <br/>\nHas he expressed this as limiting or are you?  Can you simply be an <br/>\nempathetic listener when he expresses frustration and then remind him <br/>\nthat he is a wonderful communicator once he is comfortable in a <br/>\nsituation and that you have full confidence that this will work its <br/>\nway out once Ithaca is no longer new (assuming it is).  <br/>\n<br/>\nI think ultimately labels do more harm than good in this type of <br/>\nsituation.<br/>\nAnd having attention drawn to his communication style as being a <br/>\nproblem by adults around him may have only created and then <br/>\nreinforced his own insecurity.<br/>\n<br/>\nPoint out that he communicates beautifully and that you have complete <br/>\nconfidence in him may do more for this resolving itself with time, <br/>\nmaturity and experience than any &#39;therapist&#39; could ever.  <br/>\n<br/>\nOtoh, it may never resolve itself in which case your job is to a. <br/>\ntruly accept him as the beautiful person he is regardless of his <br/>\nproficiency in this skill and b. help maintain (or in this case <br/>\nrebuild) his confidence that he is perfect just the way he is...he <br/>\nhas so many wonderful gifts that this is only a small part of who he <br/>\nis overall and doesn&#39;t or doesn&#39;t have to (a choice) define or limit <br/>\nhim in anyway.<br/>\n<br/>\nHope this is helpful.<br/>\nLisa.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: hbmccarty [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hbmccarty@...\">hbmccarty@...</a>]<br/>\nSent: Wednesday, July 11, 2007 8:03 AM<br/>\nTo: Lisa Heyman<br/>\nSubject: speech disfluency<br/>\n<br/>\nHi Lisa-<br/>\n<br/>\nI am searching archives for stuttering on RUL and came across an old <br/>\npost of yours on the subject- ds is having really intense bout of <br/>\nstuttering that is really limiting him. He has been in speech therapy <br/>\nthe last 2-3 years(mainly due to dh being concerned, though he did <br/>\nagree to go as he felt it was helping), which seems to have helped in <br/>\nthe past, but now he is not as is it summer and he does it at Ithaca <br/>\nCollege. <br/>\n<br/>\nHow have things gone with dd&#39;s speech disfluency- has it just <br/>\nresolved itself over time?<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re:Speech Disfluencies","postDate":"1184247430","msgId":24938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2RUYyRTc4LUQ1QUUtNEIwNS05OTEwLTkxNEIzOUI4OERCRUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":24929,"nextInTopic":24949,"prevInTime":24937,"nextInTime":24939,"topicId":24928,"numMessagesInTopic":0,"msgSnippet":"Hi Heather, This may not be what you re looking for but I ll share what has helped us.  It was pure serendipity.  I met someone in the airport who told me","messageBody":"<div id=\"ygrps-yiv-392768542\">Hi Heather,<br/>\n<br/>\nThis may not be what you&#39;re looking for but I&#39;ll share what has  <br/>\nhelped us.  It was pure serendipity.  I met someone in the airport  <br/>\nwho told me about a woman who helped them w/ their colicky baby.  She  <br/>\ndoes Quantum Energetics and flower remedies (very esoteric ones).  We  <br/>\nworked over the phone.  Our DS was having strong facial tics all of a  <br/>\nsudden.  She  made up a bottle of remedies and I sprayed him (they  <br/>\nsmell divine).  And that was it.  they stopped immediately.  She  <br/>\nworks intuitively and I think is quite amazing.  The flower remedies  <br/>\nshe makes up are for the whole family so we all take them.  Her  <br/>\nwebsite is <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jennyqe.com/\">http://www.jennyqe.com/</a><br/>\n<br/>\nMaybe it might help.<br/>\nAlison</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Speech Disfluencies","postDate":"1184173289","msgId":24929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlMS4xNGE4MDcxNC4zM2M2NjZlOUBhb2wuY29tPg=="},"prevInTopic":24928,"nextInTopic":24938,"prevInTime":24928,"nextInTime":24930,"topicId":24928,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/11/2007 12:41:44 P.M. Eastern Daylight Time, hbmccarty@twcny.rr.com writes: Does  anybody have any experience with anything like this? I","messageBody":"<div id=\"ygrps-yiv-787827067\">In a message dated 7/11/2007 12:41:44 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hbmccarty@...\">hbmccarty@...</a> writes:<br/>\n<br/>\nDoes  anybody have any experience with anything like this? I will try to <br/>\ncontact  a therapist and do some research- but time and time again it is  <br/>\nunschoolers who have the most helpful input in any situation so I am  <br/>\nposting here first.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n___<br/>\n <br/>\nI&#39;m a speech therapist and we are an unschooling family.  I have two  <br/>\nchildren 14 and 17.  If you would like to contact me off list, I&#39;d be happy  to talk <br/>\nwith you about some specific ideas and perhaps resources for you.<br/>\n <br/>\n <br/>\nGail<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Speech Disfluencies","postDate":"1184148309","msgId":24928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OTRBQjU1LjEwMzAwMDVAdHdjbnkucnIuY29tPg=="},"prevInTopic":0,"nextInTopic":24929,"prevInTime":24927,"nextInTime":24929,"topicId":24928,"numMessagesInTopic":0,"msgSnippet":"Hi All- I have joined the group recently, so will start with a quick intro. I am Heather, we live in NY state, we have two children, a son 14, and a daughter,","messageBody":"<div id=\"ygrps-yiv-1714289172\">Hi All-<br/>\n<br/>\nI have joined the group recently, so will start with a quick intro. I am <br/>\nHeather, we live in NY state, we have two children, a son 14, and a <br/>\ndaughter, 10. They have have been unschooled for a long time, but in the <br/>\nlast couple of years we have been moving deeper into it. I work at home, <br/>\nand have interest in discussing unschooling in relation to that.<br/>\n<br/>\nMy immediate concern is my son&#39;s speech disflucencies. He has had a <br/>\nrelatively mild stutter for a long time - he had been going to speech <br/>\ntherapy at our local college for a couple years and he seems to have <br/>\nbenefited from that. He was willing to do this as he does want to be <br/>\nable to speak clearly - he wants to be able to participate verbally.<br/>\n<br/>\nRecently he went to my mom&#39;s for a week, which he has done every summer <br/>\nsince he turned 9- he really looks forward to this. When he returned <br/>\nthis time, we noticed that his disfluency was very extreme - more <br/>\nextreme than ever before. He has severe difficulty getting some words <br/>\nout- sometimes many - even his own name. He gives up trying to say that <br/>\nword and even trying to speak at all. Needless to say, he is very <br/>\nfrustrated.<br/>\n<br/>\nHe also has recently started his first job and a new class in sound <br/>\ntech, and has been very very busy. Though he did have a few days off <br/>\njust now and this hasn&#39;t really helped. I talked to him about what might <br/>\nhave triggered this, he said it started after a large party my mom had- <br/>\nabout 50 people - he played his bass at this party and I imagine was <br/>\ngetting a bit of attention - though it didn&#39;t seem to him that it was <br/>\nextremely traumatic.<br/>\n<br/>\nHe is feeling very worried about not being able to talk at his class, <br/>\nand at work.<br/>\n<br/>\nDoes anybody have any experience with anything like this? I will try to <br/>\ncontact a therapist and do some research- but time and time again it is <br/>\nunschoolers who have the most helpful input in any situation so I am <br/>\nposting here first.<br/>\n<br/>\nthanks so much!<br/>\n<br/>\nHeather M</div>","specialLinks":[]}],"prevTopicId":24918,"nextTopicId":24979}}