{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When do I help 4 yo. dd deal with 8 yo. dd shaming, criticism, namecalling","postDate":"1186154873","msgId":25457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4dmhocCtpNWM2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4c3YxcCtscnRtQGVHcm91cHMuY29tPg=="},"prevInTopic":25442,"nextInTopic":0,"prevInTime":25456,"nextInTime":25458,"topicId":25438,"numMessagesInTopic":0,"msgSnippet":"... Or say something harmful. This has been a really big help with Ray, knowing he can come and complain, or just call for backup when Mo is getting on his","messageBody":"<div id=\"ygrps-yiv-356134569\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I also ask them to come to me if a sibling is driving them crazy,<br/>\n&gt; BEFORE they feel like doing something harmful.<br/>\n<br/>\n </span></blockquote>Or say something harmful. This has been a really big help with Ray, <br/>\nknowing he can come and complain, or just call for backup when Mo is <br/>\ngetting on his nerves. <br/>\n<br/>\nIt has also been really helpful, when he does say something <br/>\nparticularly nasty, to validate his frustration, etc First. Then we <br/>\ntalk about strategies for getting my or George&#39;s attention, if we&#39;re <br/>\nin another room. That part may not be applicable to Marla&#39;s girls, but <br/>\nsince Ray&#39;s been in school, he&#39;s not used to the idea that adults <br/>\n*will* help if called (rather than tell him to suck it up and quit <br/>\ntattling, yikes). <br/>\n<br/>\n---Meredith (Mo 6, Ray 13)</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When do I help 4 yo. dd deal with 8 yo. dd shaming, criticism, namecalling","postDate":"1186070393","msgId":25442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4c3YxcCtscnRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4c3Iybitjb3B0QGVHcm91cHMuY29tPg=="},"prevInTopic":25438,"nextInTopic":25457,"prevInTime":25441,"nextInTime":25443,"topicId":25438,"numMessagesInTopic":0,"msgSnippet":"~~I m still struggling with backing off my 4 yo. and 8 yo. arguments. My sense from Naomi Aldort, who I highly respect, is to just stay quiet unless it looks","messageBody":"<div id=\"ygrps-yiv-1813273922\">~~I&#39;m still struggling with backing off my 4 yo. and 8 yo. arguments.<br/>\nMy sense from Naomi Aldort, who I highly respect, is to just stay<br/>\nquiet unless it looks like it is going to get physical~~<br/>\n<br/>\nI&#39;d have to disagree with her if that&#39;s her stance.<br/>\n<br/>\nThe caveat though, is I DO try to stay out of disagreements. A<br/>\ndisagreement is a whole different animal than put-downs or meanness. A<br/>\ndisagreement can disintegrate into that, but sometimes they just need<br/>\nto yell at each other (Im thinking of my 10 and 6y.o. since none of<br/>\nthe other children fight) and come to an understanding.<br/>\n<br/>\nThere are times I get in between them and arbitrate &quot;Ciara feels angry<br/>\nthat you grabbed the pole from her&quot;<br/>\nor &quot;Jalen really wanted his pole back&quot;<br/>\nNot laying down judgment, just being a calm center for them to have a<br/>\ndiscussion through. By my staying calm and really just talking for<br/>\nthem (exactly what they are saying, but I am &quot;passing the message&quot; so<br/>\nto speak) it helps diffuse things right there.<br/>\n<br/>\nI don&#39;t think it&#39;s a great idea to stay out of it when someone is<br/>\nbeing hurt. It&#39;s up to the person with greater tools to assist those<br/>\nthat need it. I hate to assume they don&#39;t have tools, but usually<br/>\nthat&#39;s why things get ugly in the first place.<br/>\n<br/>\nI&#39;ve also let my kids know that it hurts ME to hear them say mean<br/>\nthings to a sibling. &quot;I love every one of you so much and I wouldn&#39;t<br/>\nlet a stranger talk to you that way. It makes me sad when I hear<br/>\nsomeone in my house being hurt with words&quot;<br/>\n<br/>\nI also ask them to come to me if they feel the need to vent. Yelling<br/>\nabout what a &quot;jerk&quot; someone is or telling me how frustrated they are<br/>\nabout an issue is a safe way to get the feelings out without hurting<br/>\nthe other party.  <br/>\n<br/>\nI try to simply listen when they are venting. &quot;You&#39;re really upset<br/>\nwith him aren&#39;t  you?&quot; or whatever is appropriate for the situation<br/>\nand child. There are times that after the venting, they are ready to<br/>\nmove on. No soluation needs to be developed. They&#39;re done. They just<br/>\nneeded a safe space for their feelings.<br/>\n<br/>\nI also ask them to come to me if a sibling is driving them crazy,<br/>\nBEFORE they feel like doing something harmful. Jalen can be especially<br/>\nintense and if they are getting overwhelmed, I then have an<br/>\nopportunity to get him more involved with me in a fun game or project<br/>\nso they get a &quot;break&quot;.<br/>\n<br/>\nWe really don&#39;t have many of these issues anymore. But it does take a<br/>\nlot of involvement at the younger years. We had the standing protocol<br/>\nof &quot;Use words first, then get an arbitrator to help you problem solve<br/>\n(an older sibling or parent) and if that doesn&#39;t work then hitting<br/>\nmight be the answer&quot;. lol<br/>\nThe arbitrator always works though. Funny thing!:)<br/>\n<br/>\nThere&#39;s a fine line you walk, between being proactive to keep things<br/>\nfrom breaking down too much and honoring their need to work things out<br/>\nin their own way. Once there is name-calling or meanness that could<br/>\nhurt someone, thats beyond the &quot;let them work it out&quot; stage. They need<br/>\na calm center that can use more gentle tools in the situation.<br/>\n<br/>\nOver time, they learn how to utilize these tools and it gets easier<br/>\nand easier. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":77228268,"authorName":"Marla B.","from":"&quot;Marla B.&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"When do I help 4 yo. dd deal with 8 yo. dd shaming, criticism, namecalling","postDate":"1186066327","msgId":25438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4c3Iybitjb3B0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25442,"prevInTime":25437,"nextInTime":25439,"topicId":25438,"numMessagesInTopic":0,"msgSnippet":"I m still struggling with backing off my 4 yo. and 8 yo. arguments. My sense from Naomi Aldort, who I highly respect, is to just stay quiet unless it looks","messageBody":"<div id=\"ygrps-yiv-935792426\">I&#39;m still struggling with backing off my 4 yo. and 8 yo. arguments. <br/>\nMy sense from Naomi Aldort, who I highly respect, is to just stay<br/>\nquiet unless it looks like it is going to get physical.  On the other<br/>\nhand, I want my house to be a safe place for everyone, where they<br/>\ndon&#39;t have to fear being criticized, etc. for something they do. <br/>\nHowever, this can be a tall order for an 8 yo.  <br/>\n<br/>\nSo how do I deal with her telling her 4 yo. dd that if she eats<br/>\nanother popsicle she&#39;ll get fat (when we are trying to not control the<br/>\nfood they eat, other than their choices come from what we have<br/>\navailable at the moment) or she calls her stupid and tells her to shut<br/>\nup for singing too long?   <br/>\n<br/>\nI&#39;ve tried to model respect for them since their birth, and although I<br/>\nfail at times (although I&#39;ve never namecalled -when I&#39;m tired, etc. I<br/>\ncan resort back to how I was parented), I always apologize and point<br/>\nout that I shouldn&#39;t have spoken as I did.  My 8 yo. dd didn&#39;t have<br/>\nthis problem growing up, as she was respected, so why can&#39;t she<br/>\nrespect her 4 yo. dd (I know the word &quot;respect&quot; has it&#39;s own issues,<br/>\nbut I don&#39;t know what other word to use).  Is it just too high an<br/>\nexpectation for an 8 yo.?<br/>\n<br/>\nWe&#39;ve talked about her feelings about her sister (it&#39;s a definite<br/>\nlove/hate relationship.  She is free to let it all out, how much she<br/>\nhates her at times, how she wishes she didn&#39;t exist, etc.).  We&#39;ve<br/>\ntalked about what other options she has for dealing with her sister -<br/>\nwhat words she could use, coming to get me before she says something<br/>\nnasty, etc.  I&#39;ve tried to give her space from her sister, so she gets<br/>\na break if she needs it.  I try to get her sister to come in another<br/>\npart of the house with me or talk about why her older sister is upset.<br/>\n<br/>\nOn the other hand, my 8 yo. used to sing all day when she was little<br/>\n(still does).  She&#39;d constantly sing a narration of whatever she was<br/>\ndoing.  I feel bad that the 4 yo. is being taught by the 8 yo. that<br/>\nshe shouldn&#39;t be doing this.  Or that she shouldn&#39;t eat certain<br/>\nthings.  How do I ensure that the 4 yo. can still be who she needs to<br/>\nbe without the 8 yo. comments hurting that?<br/>\n<br/>\nSorry, I thought this would be a quick post, but as usual, I couldn&#39;t<br/>\nhelp myself - lol.<br/>\n<br/>\nI would love any help or advice or support.<br/>\n<br/>\nThanks!<br/>\n<br/>\nMarla    Mom to Amy (8 yo.) and Lily (4 yo.)</div>","specialLinks":[]}],"prevTopicId":25452,"nextTopicId":25428}}