{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"(practice versus theory)","postDate":"1185998035","msgId":25417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMGQwMWM3ZDQ3NSRiMWZmOWUxMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDAwMzEwMWM3ZDQ0YSRlN2Y4MGNkMCQwZTAwMDAwYUBtYWluPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":25416,"nextInTime":25418,"topicId":25417,"numMessagesInTopic":0,"msgSnippet":"... I think what you are saying are limits I would perceive as help, as time, as others involved. I wouldn t really want to start welding without some advice ","messageBody":"<div id=\"ygrps-yiv-477865251\"><blockquote><span title=\"ireply\">&gt;Obviously no one here would give a 2 year old welding gear limit-free.  But <br/>\n&gt;RU parents are more likely to let the small ones try welding  with  a LOT <br/>\n&gt;of limits &gt;placed on the activity until they&#39;re proven to have some level <br/>\n&gt;of wisdom about the dangers involved.<br/>\n<br/>\n </span></blockquote>I think what you are saying are limits I would perceive as help, as time, as <br/>\nothers involved. I wouldn&#39;t really want to start welding without some advice <br/>\nabout what to wear and what to do and I&#39;m 39. I certainly wouldn&#39;t actually <br/>\neven expect that a two year old could even so much as light the welder.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but mine will do nothing but play RuneScape all day if it&#39;s allowed, (and <br/>\n&gt; sometimes it is).<br/>\n<br/>\n </span></blockquote>I imagine Simon and Linnaea would play RuneScape all day if was <br/>\nallowed/disallowed. I imagine they would do many things semi-obsessively if <br/>\nthere was a question of me controlling access to that thing, that item, that <br/>\nexperience. But with the freedom to choose between television and video <br/>\ngames (many, many video games) and RuneScape and World of Warcraft and Skype <br/>\nand all of those things yesterday they spent most of the day creating paper <br/>\nairplanes. Today they hung out together looking for videos on youtube.com, <br/>\ngot the cat for each other, built geo-mag sculptures, helped me find box <br/>\ntape, talked about Harry Potter with me, created new characters on World of <br/>\nWarcraft (Simon didn&#39;t play his but Linnaea got hers to level 4), and now <br/>\nthey are watching Yugioh (Simon is very excited because he&#39;s catching the <br/>\nfirst episode of the first series).<br/>\n<br/>\nI think it&#39;s easy to see an unnatural obsession when something is new and <br/>\nexciting or limited. The funny thing is if you were to sit and watch, over a <br/>\nweek or two or three, maybe even a month, you&#39;d find that the obsession <br/>\nwould wane, that RuneScape would be popular some days and not others. And <br/>\nmaybe somedays rather than play somebody else&#39;s story they&#39;ll write their <br/>\nown and act it out while moving through the house, or tell you, or borrow <br/>\nthe video camera and put it up on youtube.  It&#39;s like Simon&#39;s or Linnaea&#39;s <br/>\ndiet; on any given day it may look unbalanced, but if you look at it over a <br/>\nweek, they eat very well.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; I think RuneScape is a very valuable activity.  So is dancing, and <br/>\n </span></blockquote>cleaning your room, and reading a book, and climbing trees and hanging out <br/>\nwith your &gt;family...all of those things are limited here, though I frankly <br/>\ndon&#39;t have to set too many limits on excessive room-cleaning!<br/>\n<br/>\nI&#39;m not sure that I understand this, you are limiting how long they can hang <br/>\nout with their family? Why are you concerning yourself so much with limits. <br/>\nWhy can&#39;t they dance and sing and clean their rooms and read a book and <br/>\nclimb trees and hang out with their family to their hearts content? And on <br/>\nthe same level what is so scary about being focused on an amazing story <br/>\ntelling, immersive game like RuneScape?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thing is, we can argue all day about whether TV has any inherent worth <br/>\n&gt; (yes & no--it&#39;s a tool, depends on how you use it) and whether limiting <br/>\n&gt; use of video &gt;games makes me a bad RU mommy, but I see my job as helping <br/>\n&gt; my children to acquire wisdom, and the way we&#39;ve chosen to do so is by <br/>\n&gt; making &quot;all things in &gt;moderation&quot; our mantra.  You may choose to help <br/>\n&gt; your children aquire wisdom in a different way.<br/>\n<br/>\n&gt;I get the feeling many of you teach wisdom the &quot;sink or swim&#39; way in which <br/>\n&gt;you let your kids immerse themselves in whatever impulse they have at any <br/>\n&gt;given &gt;moment.<br/>\n<br/>\n </span></blockquote>I think you are angry here. I think you are speaking out of a sense that <br/>\nwhat is being advocated here is so different from what you believe and what <br/>\nyou do that it makes you angry. Anyhow, I don&#39;t let my children sink or <br/>\nswim. I am right there with them in the swimming pool, swimming along side, <br/>\nholding them up, helping them with whatever they want help with, and more <br/>\noften than not, being absolutely amazed at the skills or ideas the already <br/>\npossess. I like swimming with them. I like helping when they play on the DS <br/>\nor when they play a game on the PS2 or the Wii or the gamecube or the PC or <br/>\nboard games or building paper airplanes or looking up what the kangaroos <br/>\nthat are hopping around the cabin are while staying in Australia, or <br/>\ncreating a Yugioh deck to play against Simon or putting face paint on <br/>\nLinnaea. I like being a part of their lives, and I want to support them and <br/>\nhelp them in whatever impulse (which is a bit slighting, don&#39;t ya&#39; think?) <br/>\nthey have at any given moment.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I can&#39;t presume to know what&#39;s best for yours.<br/>\n<br/>\n </span></blockquote>But if I came to this list and said my kids just can&#39;t handle choices and <br/>\nfreedom so I make the decisions for them, I hope that someone would help me <br/>\nto see the error in my understanding of my children. I would much rather <br/>\nthat someone be an advocate for them than that they say &quot;well I&#39;m sure I <br/>\ncan&#39;t presume to know what is best for your children.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And some adults probably--me being one of them!--could be told the same <br/>\n&gt; thing.  The difference is that I&#39;ve learned to deal with my impulse <br/>\n&gt; control (sort of) and &gt;my kids haven&#39;t.<br/>\n<br/>\n </span></blockquote>How have you done that? Honestly. I can tell you my &quot;impulse control&quot; <br/>\nepiphany moment. I was at this lovely little boutique in Durham, UK (not <br/>\nNorth Carolina) where I&#39;d found a nice sweater for David and I found a very <br/>\nchic button-up sweater with yarn frill cuffs. Very over the top. And I asked <br/>\nDavid if I could have it. Which is just weird in retrospect. I can buy <br/>\nclothes, but I still felt a need to ask permission from my husband to buy a <br/>\nsweater. I didn&#39;t really like the sweater, but I wanted it. And I have it. <br/>\nAfter we left the shop and for a few days later I felt kind of sick about <br/>\nthe sweater. It wasn&#39;t going to make me happy, it wasn&#39;t going to make me <br/>\nfeel better, it really wasn&#39;t even the style of sweater that I tend to find <br/>\nattractive. I still have it, it was only a few years ago that it happened, <br/>\nand I wear it. But it was that sweater that made me realize that I can buy <br/>\nwhat I want and what I need and I don&#39;t need to buy everything that catches <br/>\nmy eye to feel loved or supported or whole.<br/>\n<br/>\nLinnaea and Simon, they turn things down all the time. I offer to buy <br/>\nLinnaea a dress or a couple of dresses and she will maybe pick out one and <br/>\nthat&#39;s all she wants. For her birthday she wanted to pick out a pair of <br/>\nearrings. I was happy to get her a couple of pairs, whatever pair she <br/>\nwanted. She picked out a very simple, very elegant, very inexpensive pair <br/>\nand was happy with that. Simon will turn down many, many things. They feel <br/>\nloved and supported in most of their interests, enough so that they don&#39;t <br/>\nhave to grab at everything that is offered. I&#39;m not saying that they don&#39;t <br/>\nlike the things they like. Simon buys a lot of packs of Yugioh cards, <br/>\nLinnaea buys stuffed animals. But they don&#39;t feel any need to get things <br/>\nthey don&#39;t really want to feel happy or fulfilled.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;They see something they want this second, and everything else falls away, <br/>\n&gt;including the bigger picture things they want (i.e that kid refusing swim <br/>\n&gt;class to stay with &gt;cousins could be my daughter--who will sometimes claim <br/>\n&gt;not to want to go to dance class when she&#39;s immersed in something else--but <br/>\n&gt;in fact dance class is her &gt;passion and once she&#39;s there she&#39;s very glad of <br/>\n&gt;it.  You may think I&#39;m interpreting this wrongly, but it&#39;s true--she <br/>\n&gt;sometimes doesn&#39;t know what she really wants--&gt;she just knows her immediate <br/>\n&gt;desires.<br/>\n<br/>\n </span></blockquote>How aren&#39;t her immediate desires what she wants? I would be very nervous <br/>\nthat you are giving her the message that she doesn&#39;t truly know herself or <br/>\nher own desires. I would really hope that she doesn&#39;t stop trusting herself <br/>\nin the face of the clear understanding that you know what is best for her.<br/>\n<br/>\n<br/>\n----------<br/>\n<br/>\nI was going to keep going, but Linnaea really wants to play Madlibs and <br/>\nSimon wants to look something up on the computer. So I need to go. Maybe <br/>\nI&#39;ll finish going through what you wrote later.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com</div>","specialLinks":[]}],"prevTopicId":25411,"nextTopicId":25452}}