{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Coercion thoughts","postDate":"1088160178","msgId":1027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4LjVhNGQyM2ExLjJlMGQ1YmIyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":1026,"nextInTime":1028,"topicId":1027,"numMessagesInTopic":0,"msgSnippet":"The whole post----WOW! ~Kelly, glad that Robyn is here! In a message dated 6/25/2004 5:27:44 AM Eastern Daylight Time, dezigna@comcast.net writes: I love","messageBody":"<div id=\"ygrps-yiv-737102716\">The whole post----WOW!<br/>\n <br/>\n~Kelly, glad that Robyn is here!<br/>\n <br/>\n <br/>\nIn a message dated 6/25/2004 5:27:44 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\nI love  nagging questions - for me they are always an area of personal  growth<br/>\nwaiting to happen.<br/>\n<br/>\nIt is astonishing to me that anyone would  want to include coercion as one of<br/>\nthe tools for getting children to learn  specific things, or more accurately<br/>\n*appear* to learn things by completing  a certain amount of schoolwork. Yet<br/>\nit happens all the time in schooling  situations. I would consider it as the<br/>\nopposite of unschooling. <br/>\n<br/>\nOr  are you meaning coercion relative to other behavior/areas of life than<br/>\nthe  &quot;educational component&quot; of unschooling?<br/>\n<br/>\nCoercion comes from an absence  of trust. If a person feels like they have to<br/>\nuse coercion to achieve some  goals about their child&#39;s behavior or activity,<br/>\nand say so here, they are  likely to be invited to rethink those goals, the<br/>\nassumptions behind the  goals, as well as offered alternative strategies that<br/>\nare more in keeping  with one of the most fundamental principles of<br/>\nUnschooling - trusting in  our children and promoting their trust in us.<br/>\n<br/>\nSo now some  musings:<br/>\n<br/>\nPeople seem to come to &quot;whole life&quot; Unschooling from two  directions. Many<br/>\nwill say in their introductions that Unschooling seemed a  natural<br/>\nprogression from attachment parenting and the gamut of gentle child  rearing<br/>\npractices. That is how we came to it. We already had complete  freedom around<br/>\nfood (I didn&#39;t make candy available to my infant btw, but  she sure liked<br/>\napple sauce), encouraged computer use, had no bedtime (she  just went with<br/>\nus), allowed potty learning to just happen, and had made an  inviolable<br/>\ncommitment to not spanking or punishing - including imposed  &quot;consequences&quot;. <br/>\n<br/>\nHonesty compels me to admit that TV freedom I wondered  about having read<br/>\nsome of those goofy studies done about brain development.  It was causing me<br/>\na crisis of integrity because I love the television - not  every show on it -<br/>\nand wanted to be free to watch it. It is very ironic  that Jayn is the one<br/>\nwanting it turned off, and I get to watch way less as  she gets older!<br/>\n<br/>\nI was very happy to find Unschooling, having already  concluded that we would<br/>\nbe really, really, really relaxed homeschoolers. It  meant that we could live<br/>\nJayn&#39;s education process in the same way as the  rest of our life -<br/>\nseamlessly. For me and dh the non-coercion came first,  and the journey has<br/>\nbeen about recognizing/stopping if we use manipulation,  and finding better<br/>\nstrategies for problem solving - identifying and  elucidating the Principles<br/>\ninstead of Rules (not that we had any - rules  that is), chucking away the<br/>\nbaggage of our childhoods and educations  instead of constantly opening the<br/>\nbags and getting stuff out of them to  use. Generally just trying to better<br/>\ngrasp what Jayn is communicating and  meet those needs.<br/>\n<br/>\nOther people come to Unschooling from another  educational system, living a<br/>\nlife accustomed to regular household rules,  and start their journey to<br/>\nfreedom with trusting children to learn whatever  they like. Slowly they<br/>\nrenounce schoolish language and thinking (which is  often inherently<br/>\ncoercive) and start to see their children blossom  again.<br/>\n<br/>\nThen it often spreads like osmosis to other areas of life,  gradually as the<br/>\ncomfort level of each family is challenged. Sometimes  people post the same<br/>\nkind of astounded rush of relief and release of the  pressure about &quot;we have<br/>\nlet go of XXXX restrictions and we are all so much  happier&quot;, as they did<br/>\nwhen they first pulled their kid out of public or  private school - &quot;I only<br/>\nwish we had done it sooner&quot; is the number one  sentiment expressed on line.<br/>\n<br/>\nProbably no one on this kind of list wants  to be thought of as using<br/>\ncoercion. They use other language from the  parenting arsenal like &quot;sensible<br/>\nlimits&quot; or &quot;concern for their safety&quot; or  &quot;all living together comfortably&quot;.<br/>\nIt is only by talking about people&#39;s  actual practices, what they *do* and<br/>\nsay to their children in any situation  that the full range of what these<br/>\nphrases really mean comes out.  <br/>\n<br/>\nOne person&#39;s &quot;sensible limits&quot; means that they don&#39;t leave power  tools<br/>\nunattended with a 2 year old and take time to explain that these  are<br/>\ndangerous - perhaps they help them examine all the buttons with the  plug out<br/>\nand show them what the plug looks like. They get them some play  tools and<br/>\nsafety goggles. They let them bang a mallet on some spare wood.  When they<br/>\nsee their child heading for the workshop door, they go with them  or make an<br/>\nappointment to do some more banging after  lunch.<br/>\n<br/>\nAnother&#39;s means that they forbid their 2 year old to enter the  workshop,<br/>\nexplaining seriously but kindly that it is dangerous in there,  then grab the<br/>\nkid and make them stand in a time out corner if they have  gone into the<br/>\nenticingly mysterious doorway. I have read on line mothers  actually<br/>\nbelieving that their children (of various ages) spend their time  outs<br/>\ncarefully contemplating the crime they committed for which they are  being<br/>\npunished/given consequences. I&#39;m dubious (based on my recollections  of my<br/>\nchildhood) that they are making an entirely accurate prediction of  their<br/>\nkids&#39; thoughts at the time.<br/>\n<br/>\nSometimes the phrase &quot;all living  together comfortably&quot;, and its close cousin<br/>\n&quot;they live here too&quot;, have the  unspoken assumption that what is comfortable<br/>\nfor the parents is either  commensurate with, or takes precedence over, what<br/>\nis comfortable for the  child. <br/>\n<br/>\n&quot;No coercion whatsoever&quot; is a marvelous goal to have, a true  gift to your<br/>\nchildren.<br/>\n<br/>\nRobyn L.  Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":988,"nextTopicId":975}}