{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Family Bed question","postDate":"1241269572","msgId":39895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMDExQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39882,"nextInTopic":0,"prevInTime":39894,"nextInTime":39896,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"... - having that gurgling through the night, while soothing, would have me up several times to pee! LOL ","messageBody":"<div id=\"ygrps-yiv-630953331\"><blockquote><span title=\"ireply\">&gt;&quot;a small fountain&quot; \r<br/>\n\r<br/>\n </span></blockquote>- having that gurgling through the night, while soothing, would have me\r<br/>\nup several times to pee! LOL\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":381959449,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;conspicuousfamily@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Family Bed question","postDate":"1241236360","msgId":39882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0Z2cyOCtqMXRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg=="},"prevInTopic":39879,"nextInTopic":39895,"prevInTime":39881,"nextInTime":39883,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"... Is there room for yet another bed in the room?  Maybe a trundle that could be slid under the big bed during the day?  My thinking that more room might","messageBody":"<div id=\"ygrps-yiv-2026957770\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; We have a family bed now, after many years of going back and forth about it, I finally pulled two beds together to make one big bed for us.  <br/>\n<br/>\n </span></blockquote>Is there room for yet another bed in the room?  Maybe a trundle<br/>\nthat could be slid under the big bed during the day?  My <br/>\nthinking that more room might equal less pushing/shoving/<br/>\njostling for position.<br/>\n<br/>\nI know that feeling.  Everybody wants to sleep next to me, but<br/>\nthere are four &quot;younger&quot; kids and I only have a left side and a<br/>\nright side.  So, in our family, kids take turns and keep track<br/>\nof whose turn it is to be next to mom.<br/>\n<br/>\nWe, too, have staggered sleep schedules, insomniacs, two <br/>\nfamily members diagnosed with restless legs syndrome, a dad<br/>\nwho needs to be up early for work and a couple of kids who like<br/>\nto be up all night playing video games.<br/>\n<br/>\nIf I get woken up by activity, I will try meditation.  If that doesn&#39;t<br/>\nsettle me back to sleep, then I might read, or watch TV, with headphones<br/>\nso the noise doesn&#39;t disturb others.  Some people sleep with eye masks,<br/>\nso flickering light from gaming systems, TV, or light used to read doesn&#39;t<br/>\nbother them.  If I don&#39;t sleep, the kids know that I will not be able to <br/>\ndrive them anywhere the next day.  I may not have much energy to<br/>\nplay.  I may nap a lot.  These are not punishments; they are natural<br/>\nconsequences of not sleeping.<br/>\n<br/>\nThere are so many ways to approach family bed!  Excluding anybody<br/>\n(DH, DS) is one choice, but only if everybody is really, truly comfortable<br/>\nwith that choice.<br/>\n<br/>\nSomebody mentioned Sandra Dodd&#39;s rules vs. principles.<br/>\nWell, there is another applicable Sandra Dodd discussion,<br/>\non if/then contracts:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html\">http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html</a><br/>\n<br/>\nSandra responds to this: &quot;I&#39;ve told them &#39;you can stay up, if you&#39;re quiet&#39;. <br/>\nSo, my question is, after you talk about why, come up with ideas and they&#39;re <br/>\nstill having a hard time being quiet, what do you do?&quot;<br/>\n<br/>\nAnd Sandra says, &quot;Then I tell them to go to bed, and the next night I might <br/>\n(depends on various factors) ask them to just stay in their rooms instead of <br/>\nbeing in the den or library the next night, so I could make up missed sleep.&quot;<br/>\n<br/>\nAnd further down on the page, this: &quot;I really feel like I&#39;ve tried everything<br/>\n...any advice or suggestions please.&quot;<br/>\n<br/>\nAnd Sandra&#39;s reply is, &quot;You don&#39;t seem to have tried &#39;I CAN&#39;T BELIEVE YOU <br/>\nWOKE ME UP AGAIN! GET IN THE BED RIGHT NOW.&#39;&quot;<br/>\n<br/>\nSo, I guess we know where she stands on the rights of the sleepers vs.<br/>\nthe rights of the night owls question.<br/>\n<br/>\nAnyway, there are many possible solutions; just don&#39;t stop looking for<br/>\n&#39;em!<br/>\n<br/>\nHTH,<br/>\n<br/>\nKelly Sturman</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Family Bed question","postDate":"1241197182","msgId":39870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0ZjlwdStwYmxiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTQ0NS44MzQ5MS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39868,"nextInTopic":39878,"prevInTime":39869,"nextInTime":39871,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"... I have read the book Beyond Consequences, Logic and Control and I agree it does align itself in many ways with un-schooling.  In the situation you","messageBody":"<div id=\"ygrps-yiv-1353702838\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I&#39;d like to say to my son, &quot;Last night you came to bed and talked and fidgeted.  This woke daddy.  Daddy needs a quiet and still bedroom in order to sleep.  He needs sleep so he can work the next day.  I am not willing to have you in the bed tonight, because daddy needs his sleep.  You can sleep on the couch if you like.&quot;<br/>\n&gt; <br/>\n&gt; My son has experienced lots of early childhood trauma and we are using the &quot;Beyond Consequences, Logic, and Control&quot; techniques with him.  They seem to be working and are very aligned with un-schooling. If you have experience with BC, I&#39;d love your input too!<br/>\n&gt; <br/>\n&gt; How does that sound to you?<br/>\n&gt; <br/>\n </span></blockquote>I have read the book &quot;Beyond Consequences, Logic and Control&quot; and I agree it does align itself in many ways with un-schooling.  In the situation you described, I do believe, I would let my son know that if he needs me and wants to sleep next to me, to quietly wake me and I will come get in his bed or sleep somewhere else with him.  So he gets to be next to you, as he likes, but he doesnt disturb the rest of the family.</div>","specialLinks":[]},{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Family Bed - update","postDate":"1241176703","msgId":39878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0ZWxwditvZDNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg=="},"prevInTopic":39870,"nextInTopic":39879,"prevInTime":39877,"nextInTime":39879,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"Thanks for the advice and support. After writing to all of you and while waiting for some answers, I decided that there must be a more lovable solution than","messageBody":"<div id=\"ygrps-yiv-1963803236\">Thanks for the advice and support. <br/>\n<br/>\nAfter writing to all of you and while waiting for some answers, I decided that there must be a more lovable solution than giving an ultimatum to my sweet son, so I gave it some more thought.  <br/>\n<br/>\nI came up with idea of rearranging us in the bed, like one of you suggested.  Last night we slept like this: hubby, daughter, me, son. And, it worked!! <br/>\n<br/>\nEarlier in the day I had discussed with both kids the importance of keeping quiet so daddy could sleep. And, I showed them the proposed new sleeping arrangement well in advance of bedtime, making sure it worked for them.<br/>\n<br/>\nI&#39;d love to have their help brainstorming a solution in the future, but I think we were all struggling against a little fear - hubby&#39;s late night and loud angry threat of dismantling the family bed.  So, I did the brainstorming on my own. <br/>\n<br/>\nLast night, bedtime in the family bed was a breeze!!  Peter tiptoed in late, snuggled up next to me, and fell right asleep!!  <br/>\n<br/>\nThere is one thing I would do differently next time, and that is to give hubby a little more time to consider the solution I created.  He is still trying to bring himself along into more Peaceful Parenting.  He is resigning himself to the family bed.  He is practicing Beyond Consequences, to much success which seems to surprise and delight him.  Sometimes I fear his responses, they can be negative and loud, and so I delay sharing information or decision making.  I think FEAR holds me back.  So, I desire to stand in my LOVE all the time, when communicating with him.  Better for me, and for him, and for the kids too, I bet!!  <br/>\n<br/>\nLove and thanks to you all!<br/>\n<br/>\n- Elli</div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Family Bed question","postDate":"1241170875","msgId":39879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2OTk4My44OTMwMi5xbUB3ZWI1MjAwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg=="},"prevInTopic":39878,"nextInTopic":39882,"prevInTime":39878,"nextInTime":39880,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"We have always had a family bed. I think in this instance the best solution is for you to sleep in a place near to the edge with room for your son to sleep on","messageBody":"<div id=\"ygrps-yiv-1513624442\">We have always had a family bed. <br/>\n<br/>\nI think in this instance the best solution is for you to sleep in a place near to the edge with room for your son to sleep on the edge and next to you. If you are in the same place every night and he has an easy accessible path to get to you then you&#39;ve eliminated most of the problem. Since he fidgets to sleep, that is who he is and perhaps you are the best person to be accepting of that. <br/>\n<br/>\nIt also sounds like your daughter and husband are light sleepers. Which I know a bit about as I&#39;m writing this a 2am ;-) I&#39;ve found that having music on continuously makes it less likely for sleepers to be startled awake by new sounds. Before the kids my husband and I put on a classical music cd on loop. Since the kids we have a lullaby cd that has since been transferred to an ipod on loop continuously. There are lots of options for &#39;white noise&#39; though. A fan on low, a small fountain or a humidifier also work well. There are also a wide variety of machines available for purchase just google &quot;white noise&quot;.<br/>\n<br/>\nFor some very light sleepers (like myself) ear plugs work great. I use these: <a rel=\"nofollow\" target=\"_blank\" href=\"http://earplugstore.stores.yahoo.net/sleepsafe.html\">http://earplugstore.stores.yahoo.net/sleepsafe.html</a> <br/>\nI like them because you cut the center peice to custom fit your ears. This may be a helpful solution for your husband.<br/>\n<br/>\nHere&#39;s their sleep help page <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://earplugstore.stores.yahoo.net/noname1.html\">http://earplugstore.stores.yahoo.net/noname1.html</a><br/>\n<br/>\nMy son is almost 7 and he stays up much later than I do. Coming from a lit room to a dark room makes it difficult for him to navigate, even though he has a clear path and a spot. When I go to bed before him I leave a little light on his pillow. Red lights are nice because they don&#39;t tend to keep you awake. Sometimes I put the light next to his pillow under his blanket where it can still be seen but is diffused. He also has an impressive collection of small flashlights. Again, red lights are good for lighting up a room without disturbing sleeping people. They are easy to find for purchase. Perhaps if he could see where everyone was it would be easier for him not to bump them. I make sure before I go to sleep he has a chance to say all his goodnights and I ask him to please be careful not to wake me up, I show him where the light is on his pillow and I make sure he has his flashlight. <br/>\n<br/>\nAnother thought is that a common problem for both my husband and my son is that they stay up past when they get tired. For whatever reason they don&#39;t recognize or honor when they first get tired and press on getting more delirious and making worse and worse decisions before finally passing out. When someone is overtired they tend to fidget more before sleeping. <br/>\n<br/>\nFor most people a bed time routine is extremely helpful. Does your son have a routine that he follows to calm himself before he joins you for bed? An example would be:<br/>\n1. Oh I&#39;m tired <br/>\n2. Put away/ turn off what I was doing <br/>\n3. get a sip of water <br/>\n4. go to the bathroom<br/>\n5. stop at the door and take a deep breath<br/>\n6. turn on my flashlight<br/>\n7. find my spot<br/>\n8. turn off my flashlight<br/>\n9. put my flashlight under my pillow<br/>\n<br/>\nMy family has a rather large descrepancy in the sizes of our bodies. When my son was a baby we wouldn&#39;t have been able to cosleep because my with our mattress we would simply roll onto my husband who is the largest. We invested in a foam mattress and it was money very well spent. When one person shifts or rolls or bounces the rest of the bed doesn&#39;t move and it doesn&#39;t disturb anyone else. The prices have come way down on these in the last 7 years. If that&#39;s not a possibility the foam mattress toppers do a bit of the same thing. It should dampen his jostleing enough so that the rest of you aren&#39;t bounced awake.<br/>\n<br/>\nAnother possibility if he&#39;s ok with it would be to give him his own mattress next to the big bed. My son is currently on his own mattress pushed up next to ours. Some familys have a futon on the floor and the close proximity is enough for some children without being right up against anybody. <br/>\n<br/>\nI can&#39;t agree that creating a family bed and then not letting him sleep with you is a good thing for anybody. I think the best solution is one that works for everyone where everyone has their needs being met. You have a wealth of creative caring people here who are happy to help you find ways so that you can all get the sleep you need.<br/>\n<br/>\nSweet Dreams<br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Family Bed question","postDate":"1241165902","msgId":39868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTQ0NS44MzQ5MS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg==","referencesHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg=="},"prevInTopic":39865,"nextInTopic":39870,"prevInTime":39867,"nextInTime":39869,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"In our house, the sleepers needs trump the wakers needs. So, if Simon or Linnaea or David or me were to wake someone who was sleeping, there would be","messageBody":"<div id=\"ygrps-yiv-1471940939\">In our house, the sleepers&#39; needs trump the wakers&#39; needs. So, if Simon or Linnaea or David or me were to wake someone who was sleeping, there would be apologies. Last night, while I was sleeping, David got up to go downstairs and turn down the television volume. Simon and Linnaea were apologetic. They didn&#39;t turn up the television when he left, they didn&#39;t suffer consequences laid down by David or by me, they just had a quieter evening. When there have been sleepovers that have gotten to loud, I&#39;ve come down and said you guys need to be quieter or you need to go to bed. Only once did that warning not work and when I came down a second time I set them up with a movie and put them in a room that isn&#39;t right under the bedroom, where their sleeping bags were, and they went to bed. <br/>\n<br/>\nWhen someone has woken the rest of the household when they go to bed, that isn&#39;t cool. It seems that having staggered bedtimes with a family bed might be a difficult juggle. I don&#39;t know that it would be a situation where one person should be excluded from sleeping in the family bed. It would seem to me that there aremore options than just that one. Your son came to bed last night and woke everyone. Not cool. He wanted to sleep next to you. You could set it up so that you are more accessible for him to slip in next to, put your daughter between you and your husband and sleep on the edge of the bed. That way he can slip in next to you without disturbing anyone but you. He could come to bed at the same time as the rest of you and do something like play on a ds or watch a movie on a dvd player or do something quietly in bed that lets him relax with the rest of the family so that his sleep schedule doesn&#39;t put him in a postion of waking the rest of the<br/>\n family. <br/>\n<br/>\nThe way you wrote it: &quot;Last night you came to bed and talked and fidgeted.  This woke daddy.  Daddy needs a quiet and still bedroom in order to sleep.  He needs sleep so he can work the next day.  I am not willing to have you in the bed tonight, because daddy needs his sleep.  You can sleep on the couch if you like.&quot; it sounds very punitive. Maybe it isn&#39;t how you&#39;d really say it, but it sounds like a lecture to me. Maybe sleeping on the couch is a fun thing for him to do and he sees it as a treat, but from an outsiders&#39; perspective it reads more like he&#39;s being excluded from a family experience. <br/>\n<br/>\nWe had a family bed for a long time, 2 beds pushed together, but we all tended to go to bed at the same time then. Linnaea still sleeps in the same room with David and I, on a bed next to ours, and sometimes there is a shake up of where everyone sleeps. David sleeps with Simon or Linnaea and I sleep with Linnaea or Simon. We went from me and Linnaea sleeping together most nights and David on his own with me possibly slipping out of bed with Linnaea and into bed with him to the situation we have now. Sometimes we wake David when we come to bed, it&#39;s hard to be perfectly quiet when you slip into bed with an already sleeping someone. David has decided that it is worth the disturbance to get to share his bed with me more frequently than the other solutions offered. That doesn&#39;t mean that we take advantage of him and his decision, and we do have enough beds that he can sleep in another room on the nights that he really needs to get a good night&#39;s sleep.<br/>\n<br/>\nIt will help a lot if you explore as many options as you can come up with for sleep solutions rather than if you wake people up you need to sleep alone. It may also help if you think about how much your 8 year old son just wanted to get into bed and snuggle into you and go to sleep feeling safe and secure and loved. His intentions weren&#39;t anything about making everyone unhappy and sleepless, his intentions were sweet. Try and see if you can come up with options that let him feel safe and secure and loved and not abandoned to late nights, on the couch, alone. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n-------------------------------------------------------------------------------------------<br/>\n<br/>\nWe have a family bed now, after many years of going back and forth about it, I finally pulled two beds together to make one big bed for us.  <br/>\n<br/>\nMy son (8 years), who stays up later than everyone else, comes in around 2 am and tries to find the space closest to me.  In the process he wakes his sister, who starts arguing with him, which wakes my hubby, who starts yelling about his sleep and threatening to remove the bed in the morning.<br/>\n<br/>\nI&#39;d like to say to my son, &quot;Last night you came to bed and talked and fidgeted.  This woke daddy.  Daddy needs a quiet and still bedroom in order to sleep.  He needs sleep so he can work the next day.  I am not willing to have you in the bed tonight, because daddy needs his sleep.  You can sleep on the couch if you like.&quot;<br/>\n<br/>\nMy son has experienced lots of early childhood trauma and we are using the &quot;Beyond Consequences, Logic, and Control&quot; techniques with him.  They seem to be working and are very aligned with un-schooling. If you have experience with BC, I&#39;d love your input too!<br/>\n<br/>\nHow does that sound to you?<br/>\n<br/>\n- Elli<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Family Bed question","postDate":"1241118124","msgId":39865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2QTNGNTlGLUUwQzAtNEFFNy05QzQxLTVGN0ExRjFGOEUzM0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg==","referencesHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg=="},"prevInTopic":39863,"nextInTopic":39868,"prevInTime":39864,"nextInTime":39866,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"... One thing that has worked for families in which one parent needed sleep before work is to have a family bed in another room. Dad can sleep on his own and","messageBody":"<div id=\"ygrps-yiv-1209700415\">On Apr 30, 2009, at 4:22 AM, sistergoddesselli wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have a family bed now, after many years of going back and forth  <br/>\n&gt; about it, I finally pulled two beds together to make one big bed for  <br/>\n&gt; us.<br/>\n&gt;<br/>\n&gt; My son (8 years), who stays up later than everyone else, comes in  <br/>\n&gt; around 2 am and tries to find the space closest to me.  In the  <br/>\n&gt; process he wakes his sister, who starts arguing with him, which  <br/>\n&gt; wakes my hubby, who starts yelling about his sleep and threatening  <br/>\n&gt; to remove the bed in the morning.<br/>\n<br/>\n </span></blockquote>One thing that has worked for families in which one parent needed  <br/>\nsleep before work is to have a family bed in another room. Dad can  <br/>\nsleep on his own and you can sleep with the kids (if it&#39;s mum they  <br/>\nwant, and it seems that&#39;s likely). That arrangement doesn&#39;t have to  <br/>\npreclude mum and dad being together once kids are asleep or early in  <br/>\nthe morning or some other time.<br/>\n<br/>\nAs far as waking his sister goes, perhaps you can talk to him about  <br/>\nwhat might work best for everyone in the bed, like where he can crawl  <br/>\nin, so as to disturb the two of you the least.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I&#39;d like to say to my son, &quot;Last night you came to bed and talked  <br/>\n&gt; and fidgeted.  This woke daddy.  Daddy needs a quiet and still  <br/>\n&gt; bedroom in order to sleep.  He needs sleep so he can work the next  <br/>\n&gt; day.  I am not willing to have you in the bed tonight, because daddy  <br/>\n&gt; needs his sleep.  You can sleep on the couch if you like.&quot;<br/>\n<br/>\n </span></blockquote>I&#39;m not sure that&#39;s a good idea. I&#39;d say &quot;No, I don&#39;t like&quot; if I were  <br/>\nyour son!  And what happens the next night?<br/>\n<br/>\nYes, Dad&#39;s sleep is important. But don&#39;t make it your son&#39;s  <br/>\nresponsibility to give it to him. Figure something else out that meets  <br/>\nyour son&#39;s needs, too. &quot;Sleeping on the couch&quot; doesn&#39;t seem to meet  <br/>\nthem, especially if he needs to be close to you.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My son has experienced lots of early childhood trauma and we are  <br/>\n&gt; using the &quot;Beyond Consequences, Logic, and Control&quot; techniques with  <br/>\n&gt; him.  They seem to be working and are very aligned with un- <br/>\n&gt; schooling. If you have experience with BC, I&#39;d love your input too!<br/>\n<br/>\n </span></blockquote>If your son has attachment problems (that&#39;s what Beyond Consequences  <br/>\naddresses, yes?) then telling him that his Dad&#39;s needs are more  <br/>\nimportant than his seems to be handing him more trauma.<br/>\n<br/>\nLiving by principles is central to unschooling. &quot;Techniques&quot; always  <br/>\nworry me, since they are usually designed to get some certain  <br/>\nbehavior, but in a &quot;nicer&quot; way.  Beyond Consequences might have some  <br/>\ngood ideas for you to incorporate, but perhaps it could be just part  <br/>\nof how you all live your lives together. You can read more about  <br/>\nliving by principles, here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/principles/\">http://sandradodd.com/principles/</a><br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":284534827,"authorName":"Jeff Sabo","from":"Jeff Sabo &lt;freeboysdad@...&gt;","profile":"freeboysdad","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Family Bed question","postDate":"1241113271","msgId":39863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0MjQ4Mi45OTY0NC5xbUB3ZWI1NTgwMi5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":39862,"nextInTopic":39865,"prevInTime":39862,"nextInTime":39864,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"We do the same thing, but in a different way. We have two beds pushed together; one for me and Kai (ds10) and one for Ginger and Kade (ds7). I go to sleep at","messageBody":"<div id=\"ygrps-yiv-231824731\">We do the same thing, but in a different way. We have two beds pushed together; one for me and Kai (ds10) and one for Ginger and Kade (ds7). I go to sleep at 10pm on my bed, and Ginger and Kade (ds7) come in at 2am. Kai varies - sometimes, he&#39;ll come in at 2am, sometimes not until 5am! Kai is an extreme fidgeter when he goes to sleep, and I try to wake up by 6am each day. Kai should be able to go to sleep in whatever way he feels is best for him, so if I wake up when he comes in I spend a few minutes with him, and if he&#39;s still fidgeting I give him a kiss and tell him that I&#39;m getting up for a while, and then I stay up for a bit and putter around the house. Some nights I tell him that I need to get some sleep and am moving myself to the couch. The critical thing here is to say that without transfering any sense of guilt to him. It&#39;s not his fault that I woke up; it&#39;s not his fault that my schedule is different from his; and it&#39;s not his fault that<br/>\n he needs to fidget when he comes in. My sleep is my responsibility, not his - so if I wake up or cannot get back to sleep, my choice is to find a way to get back to sleep. He is being a boy, growing up, figuring his body out - and I&#39;m a Dad, so I need to support him in that regardless. <br/>\n <br/>\nHere&#39;s my suggestions: make sure you have two beds, neither of which moves if the other one gets noisy. Perhaps DD can sleep with Dad, and your son can sleep with you. If DD needs you, maybe she could sleep between you and DH? And if Dad does wake up despite all of this, then maybe Dad could think about the best solution.  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 4/30/09, sistergoddesselli &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elinorsparks@...\">elinorsparks@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: sistergoddesselli &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elinorsparks@...\">elinorsparks@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Family Bed question<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Thursday, April 30, 2009, 4:22 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWe have a family bed now, after many years of going back and forth about it, I finally pulled two beds together to make one big bed for us. <br/>\n<br/>\nMy son (8 years), who stays up later than everyone else, comes in around 2 am and tries to find the space closest to me. In the process he wakes his sister, who starts arguing with him, which wakes my hubby, who starts yelling about his sleep and threatening to remove the bed in the morning.<br/>\n<br/>\nI&#39;d like to say to my son, &quot;Last night you came to bed and talked and fidgeted. This woke daddy. Daddy needs a quiet and still bedroom in order to sleep. He needs sleep so he can work the next day. I am not willing to have you in the bed tonight, because daddy needs his sleep. You can sleep on the couch if you like.&quot;<br/>\n<br/>\nMy son has experienced lots of early childhood trauma and we are using the &quot;Beyond Consequences, Logic, and Control&quot; techniques with him. They seem to be working and are very aligned with un-schooling. If you have experience with BC, I&#39;d love your input too!<br/>\n<br/>\nHow does that sound to you?<br/>\n<br/>\n- Elli<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Family Bed question","postDate":"1241090544","msgId":39862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0YzFsZytzbHU0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39863,"prevInTime":39861,"nextInTime":39863,"topicId":39862,"numMessagesInTopic":0,"msgSnippet":"We have a family bed now, after many years of going back and forth about it, I finally pulled two beds together to make one big bed for us. My son (8 years),","messageBody":"<div id=\"ygrps-yiv-1759773203\">We have a family bed now, after many years of going back and forth about it, I finally pulled two beds together to make one big bed for us.  <br/>\n<br/>\nMy son (8 years), who stays up later than everyone else, comes in around 2 am and tries to find the space closest to me.  In the process he wakes his sister, who starts arguing with him, which wakes my hubby, who starts yelling about his sleep and threatening to remove the bed in the morning.<br/>\n<br/>\nI&#39;d like to say to my son, &quot;Last night you came to bed and talked and fidgeted.  This woke daddy.  Daddy needs a quiet and still bedroom in order to sleep.  He needs sleep so he can work the next day.  I am not willing to have you in the bed tonight, because daddy needs his sleep.  You can sleep on the couch if you like.&quot;<br/>\n<br/>\nMy son has experienced lots of early childhood trauma and we are using the &quot;Beyond Consequences, Logic, and Control&quot; techniques with him.  They seem to be working and are very aligned with un-schooling. If you have experience with BC, I&#39;d love your input too!<br/>\n<br/>\nHow does that sound to you?<br/>\n<br/>\n- Elli</div>","specialLinks":[]}],"prevTopicId":39876,"nextTopicId":39877}}