{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:  wanting to do school?","postDate":"1283636791","msgId":44730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDFBOTFDNTQ4REFCNS0xOUVDLTEyNDU3QHdlYm1haWwtbTA5Ny5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44729,"nextInTime":44731,"topicId":44730,"numMessagesInTopic":0,"msgSnippet":"Hi, The original idea behind unschooling was child-led learning.  So, if they are choosing it, then that is OK.  I agree with Lyla, as long as you are careful","messageBody":"<div id=\"ygrps-yiv-1533409574\">Hi,<br/>\n<br/>\nThe original idea behind unschooling was child-led learning.  So, if they are choosing it, then that is OK.  I agree with Lyla, as long as you are careful not to start pushing it and to stay relaxed about it the way you described, then it won&#39;t hurt.  It may be what they feel they need right now. <br/>\n<br/>\n I&#39;d even grade, if they want it.  You can keep it simple, but assigning a certain number of pts for each problem and then add up the pts for the ones they get right and do a simple percentage (like 8 out of 10 problems at 1 pt. each is 80%).  I also, don&#39;t think, if they are willing, that it hurts to go over a problem they missed, as long as you back off if they don&#39;t want to review it. Keep it light - making mistakes and correcting them is a natural method of learning.   <br/>\n<br/>\nAn alternative to grading is to get a stamp that says &quot;good job&quot; or something like that and let them stamp their own work.  They sometimes sell these at staples or the dollar section of Target this time of year.  I had a few when we were more schoolish in our approach, but I didn&#39;t grade.  The girls liked stamping their own work.  <br/>\n<br/>\nAmy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nRe: they want to do school??? help          <br/>\n    <br/>\nPosted by:      &quot;lylaw&quot;            <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lylaw@...\">lylaw@...</a>                                       lylawolf                   <br/>\n    <br/>\n      Fri Sep 3, 2010 7:32 pm        (PDT)    <br/>\n                      <br/>\n<br/>\n<blockquote><span title=\"ireply\">       &gt;&gt;Part of me wants to latch onto this opportunity to teach,<br/>\n<br/>\n </span></blockquote>THIS part will set you back.  but if you are just facilitating them doing workbooks if that&#39;s what they want to do, I don&#39;t think that alone will set you back.  just be careful that you don&#39;t start to value that approach and elevate its importance.  also, I assume you aren&#39;t requiring them to do it, or pressuring them to finish anything, etc.<br/>\n<br/>\nlyla<br/>\n<br/>\nFrom: flyingtwinsmom <br/>\nSent: Friday, September 03, 2010 5:51 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] they want to do school??? help<br/>\n<br/>\nI was a very school at home mom until this past Feb. when I dropped it all and started enjoying my girls. We&#39;ve had good times and bad since then. I&#39;ve tried to do lots with them, but over the summer, they spent more time with ps friends just hanging out. Since the schools have all started again, I&#39;ve just gone on with life and not said anything to the girls. We started going to the library again, and they actually have started listening to me read to them which they hated last year. But they came to me 2 days ago and said they wanted to &quot;do school&quot; again. We talked about what they meant (they want workbooks and they want classes) and we talked about why (they were made to feel stupid by other kids because they can&#39;t read or spell well). I told them that I know that these things will come to them. They just don&#39;t know it right now. I&#39;ve pointed out how much they have been doing in other areas. But they are sure they want to do school. I told them I will do whatever  they want. Is that wrong? <br/>\n<br/>\nI get the feeling that they will burn out on this pretty quickly, but I&#39;m stuck. I can&#39;t not do this and I&#39;m worried it will set back deschooling if we do. I set them free on all the old workbooks I had and I have done my best the last 2 days to &quot;play school&quot; with them, but to keep them interested in doing other things also. I am not setting any goals for this, but am letting them lead. <br/>\n<br/>\nSo all that background to ask, what should I do? LOL Am I really hurting our unschooling efforts by playing along? Part of me wants to latch onto this opportunity to teach, but I&#39;ve been working so hard to drop that type of thought. I did mention to them about unschooling and promised to go to the gathering in OH so they could meet other unschoolers. They seemed excited about that idea. I&#39;m also trying to find some unschoolers that we could make day/weekend trips to meet. Our budget is blown for anything major. I&#39;m also trying to find new and interesting things to do and places to go. Please talk me through this.<br/>\nThanks<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44628,"nextTopicId":44736}}