{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":94040812,"authorName":"Lisa Heyman","from":"&quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: Silverware example","postDate":"1178633621","msgId":23577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYxNEFGN0U1MkVEMkQ0RUFGMzE4OTZCRDE0NDBAcGh4LmdibD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":23576,"nextInTime":23578,"topicId":23577,"numMessagesInTopic":0,"msgSnippet":"Posted by: Joanne O N.  seagullcaller@mac.com    ","messageBody":"<div id=\"ygrps-yiv-641270835\">Posted by: &quot;Joanne O&#39;N.&quot;<br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:seagullcaller@...\">seagullcaller@...</a>?Subject=%20Re%3ASilverware%20example&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:seagullcaller@...\">seagullcaller@...</a>    &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://profiles.yahoo.com/seagullcaller\">http://profiles.yahoo.com/seagullcaller</a>&gt;<br/>\nseagullcaller <br/>\n<br/>\nFri May 4, 2007 6:54 pm (PST) <br/>\n<br/>\nI read but rarely post. But I think it is time that I do so. Recently, my<br/>\nson (6) and I were in <br/>\na restaurant with a friend. He wanted multiple plates of food, since each<br/>\nfood was to be <br/>\non a different plate. I supported and assisted him with that. He also<br/>\nbrought back <br/>\nmultiple forks, spoons and knives. At this point I noticed my new friend<br/>\nglancing at all of <br/>\nthis activity and I began to hear old tapes in my head like she thinks he<br/>\nhas too much <br/>\nsilverware, the restaurant will not like this, now all of this silverware<br/>\nneeds to be washed. <br/>\n<br/>\n[Lisa Heyman] What struck me about your posting Joanne is that the problem<br/>\nseemed to begin with your own self consciousness?<br/>\n<br/>\n<br/>\nAt the end of the meal, not thinking, when the waitress came over I picked<br/>\nup my plates <br/>\nand scooped up the silverware from next to me on the booth seat. <br/>\n<br/>\n[Lisa Heyman] So what you forgot to do is to ask your son if he was finished<br/>\nbefore clearing his place.  This makes my husband furious when wait staff<br/>\nclears without asking.  I can&#39;t stand when he moves my papers on the desk<br/>\nbecause he wants to use the computer.<br/>\n<br/>\nRetrospectively I I had <br/>\nallowed anxiety to develop due to what I was imagining others thought about<br/>\nwhat was <br/>\ngoing on with my son and then with me that I was not forcing him to stop<br/>\nthis behavior. <br/>\n<br/>\n[Lisa Heyman] So your were imagining what others were thinking?  Did anyone<br/>\nactually say anything to you?<br/>\n<br/>\nI <br/>\ntry to explain to him what people expect in public. (He frequently likes to<br/>\npour slat and <br/>\npepper together, mix water in some other things in front of him on the<br/>\ntable, etc. IN <br/>\ngenreal I delight in his creative exploration. <br/>\n<br/>\n[Lisa Heyman] When my oldest dd was young concoctions at restaurants was one<br/>\nof her favorite activities to keep her happy.  The only time the glass or<br/>\nbowl was tipped or spilled was when an adult (my mother) intervened thinking<br/>\nit was not ok because of her own self consciousness of what others were<br/>\nthinking.   I had always made sure to pick up any empty sugar packets so as<br/>\nnot to create extra work for the wait staff.  In fact, my leaving the table<br/>\norderly follows my own philosophy of leaving a place better than I found it<br/>\n- or at the very least, in the Zen buddah tradition &#39;leave no trace.&#39;  As my<br/>\ndd&#39;s get older they have embraced this social convention as their own.  My<br/>\nyounger dd is not as meticulous about her restaurant mess as my older dd was<br/>\nand still very much requires multiple plates for each item of food.  In her<br/>\n8 years I&#39;ve never had a restaurant give us difficulty over this requirement<br/>\nfor one of their patrons.  In fact - because of my response to my dd&#39;s<br/>\ncreativity - my younger dd is into presentation, &#39;plating&#39; as its called on<br/>\nthe food network  - the staff is most often delighted by her excitement as<br/>\nwell.<br/>\n<br/>\nBtw -  My older dd&#39;s restaurant experimentations led to concocting at home<br/>\nwhere by the age of 5 she created an original brownie recipe that was<br/>\nincredible.  I took to setting up a pantry shelf she could reach with food<br/>\nitems that didn&#39;t concern me about cost so she could experiment in attempts<br/>\nto make edible recipes.<br/>\n<br/>\nBut when out ion public if I feel that someone <br/>\nelse is watching, I begin to squirm. <br/>\n<br/>\n[Lisa Heyman] You don&#39;t know what they are thinking?  Have you looked up and<br/>\nsmiled at the person watching the beauty you call your son?  Giving them the<br/>\nsame compassion, joy and acceptance you have for his human experience.  Its<br/>\nvery disarming and could shift their perspective.<br/>\n<br/>\nBut to continue, after I had picked up the silverware, <br/>\nhe rightly became upset and went up to where the silverware was and began<br/>\ntaking now <br/>\nlarge handfuls of each utensil again. I was feeling embarrassed and out of<br/>\ncontrol. I know <br/>\nI am working and striving not to be in control as I want to honor his<br/>\ndecisions even if they <br/>\nare not mine. <br/>\n<br/>\n[Lisa Heyman] Joanne - when I feel my need to control someone else - I<br/>\nrecite the serenity prayer as such: grant me the serenity to accept the<br/>\nthings I can not change (him), the courage to change the things I can<br/>\n(myself).  It helps to remind me that I need to shift my behaviour in that<br/>\nmoment.<br/>\n<br/>\nBut I am having trouble when the behavior begins to have others turn and <br/>\nstare and my trying to speak to him quietly about my regret of taking his<br/>\nsilverware, <br/>\n<br/>\n[Lisa Heyman] What struck me is your &#39;quietly&#39; speaking to him about your<br/>\nregret. From your posting this quiet talk seems to have come from your<br/>\ncontinued self consciousness of others.  Your son is a bright kid - sounds<br/>\nlike he was frustrated by what may have been your mixed message indicating<br/>\nthat he was bad or wrong or not right when in fact you were the one<br/>\ndisrespectful.  My younger dd can sometimes respond to my mistakes<br/>\n(disrespectful behaviour - such as not asking if she is finished with<br/>\nsomething prior to my cleaning it up) with a passionate response (qualifiedy<br/>\nby some people - like my mom or dad as tantrum response for which they are<br/>\nembarrassed.)   I find that the best way to apologize for my mistake is to<br/>\ndo so clearly and loudly and confidently - letting her know I was wrong and<br/>\nshe was right, I should have asked her first prior to removing her things.<br/>\nThen I will calmly and compassionately maintain a loving support until she<br/>\nhas finished with her feelings.  Just because I have apologized doesn&#39;t mean<br/>\nshe will have let go of her frustration.   What helps her in her passionate<br/>\nresponse is for me to maintain my composure, love and acceptance of her<br/>\nexpressions without judgement.<br/>\n<br/>\nI will tell you that ultimately more people in public places have come to me<br/>\nto express their marvel and appreciation of how I&#39;ve handled my dd than<br/>\nthose that may not have appreciated the skillfull parenting that exists.<br/>\nAnd the one time someone told me that I should treat my dd differently (such<br/>\nas punishment, slap or timeout) I&#39;ve responded by saying that I am sorry<br/>\nthat they may have been treated so poorly when they were upset I hope for<br/>\nthem that will have a different experience in their lives from here on out.<br/>\n<br/>\n <br/>\n<br/>\nand <br/>\nthat the silverware was to be used in the restaurant for multiple people,<br/>\nhis behavior got <br/>\nmore insistent and seemed to grow larger. I am still so new. I know I am<br/>\nmaking a ton of <br/>\nmistakes. <br/>\n<br/>\n[Lisa Heyman] As Kelly would call them - learning takes.  You are learning<br/>\nand good for you for recognizing that perhaps there is something in your<br/>\nbehaviour that could be changed to help better accommodate your sons joyful<br/>\nexperience of the world.<br/>\n<br/>\nI am open to all feedback and I would also appreciate the support of knowing<br/>\n<br/>\nothers have either been there or are also struggling with something similar.<br/>\nJoanne O&#39;N.<br/>\n<br/>\n[Lisa Heyman] Sounds like the simple lesson for you may be to remember to<br/>\nask you son before clearing his materials - even though you or someone else<br/>\nthinks he&#39;s done (or should be done).<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23556,"nextTopicId":23578}}