{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":217204862,"authorName":"Misty Felner","from":"&quot;Misty Felner&quot; &lt;misty@...&gt;","profile":"mistyfelner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Handwriting and a little about me","postDate":"1145147363","msgId":12066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExNDQ1ODI2MDguMzM2LjU0MDMyLm0yMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":12065,"nextInTime":12067,"topicId":12066,"numMessagesInTopic":0,"msgSnippet":"Ok, I started to post this story earlier to the mother, sorry I ve forgotten who now, was talking about her ds who hates workbooks, and doesn t like to ","messageBody":"<div id=\"ygrps-yiv-1828395277\">Ok, I started to post this story earlier to the mother, sorry I&#39;ve forgotten<br/>\nwho now, was talking about her ds who hates workbooks, and doesn&#39;t like to<br/>\npractice handwriting.  In light of some of the later posts that I&#39;ve finally<br/>\ngotten to almost a week later I&#39;ve decided maybe someone will come to the<br/>\nrealization that I did.<br/>\n<br/>\nFirst, a little on my background.  I taught 4-6 grade deaf education, that<br/>\nmeans I taught kids who are deaf in all subject areas, for nearly 8 years.<br/>\nThree of those years were spent teaching multi-handicapped (MH) deaf, the<br/>\nsame basic kids (adding and subtracting a few who graduated on to jr. high<br/>\ndue to their age) for all 3 years.  There was no curriculum so I developed<br/>\nmy own thematic units.  The kids came to me from a teacher who never really<br/>\ntaught the kids, just assumed b/c they were MH they couldn&#39;t read or write.<br/>\nI had a different philosophy and was able to teach children in one year more<br/>\nthan they&#39;d been able to do in her class after three.  For example, I<br/>\nremember her bursting into my classroom to brag about how she finally got<br/>\none of the students to write her name.  The following year in my class that<br/>\nchild learned to read and write at least 50 words.  Including her first and<br/>\nlast name, her mother&#39;s name and her address.  Sorry I&#39;m rambling so I&#39;ll go<br/>\non.  After my third year there I moved to another school out of frustration.<br/>\nFrustration of having deaf kids who signed in a school where there were no<br/>\nother kids that signed to be their role model.  We were in the only school<br/>\nin the district with an oral program for the deaf when there were two other<br/>\nschools with other sign language deaf ed. programs.  Which also meant no<br/>\ninterpreters for my students while they were in art and p.e.  So, anyway<br/>\nwhen I moved to one of the other sign language deaf ed. programs that was<br/>\nsupposedly kids who were &quot;normal&quot; except for deafness I found that the kids<br/>\nwere only about a hair higher than the kids I&#39;d been teaching but now I had<br/>\na curriculum to follow.  For fifth grade they were supposed to learn<br/>\nAmerican History and improve their cursive.  Some of these kids couldn&#39;t<br/>\neven name all the months of the year, and none of them could read any higher<br/>\nthan first grade.  (This is b/c sadly most of their parents couldn&#39;t<br/>\ncommunicate with them more than just pointing to things and gesturing, but<br/>\nthat&#39;s another story).  To get to my point the year before I left we all<br/>\ndecided to take this new reading academy (the new trend for the year).  It<br/>\nactually made some good points.  Afterwards the fourth grade deaf ed teacher<br/>\nsaid to me, &quot;why are we teaching cursive to kids who can&#39;t read print,<br/>\nespecially when some of the kids don&#39;t have legible print handwriting?&quot;  He<br/>\nthen went on to talk about how through the academy he was doing things with<br/>\nthe students that pre-schoolers do and how much they loved it.  &quot;It&#39;s like<br/>\nthey missed that part of their life b/c they had no communication at that<br/>\npoint.&quot;  One of the students, a very tough Hispanic 12 yo boy even mentioned<br/>\nhow much he&#39;d like to have a red wagon and play in the sand box.  Sound<br/>\nfamiliar to those of you with toddlers.  Sometimes when I read these posts<br/>\nabout deschooling especially the concerns about handwriting, etc. I think<br/>\nabout this discussion I had with a fellow teacher and how off base the<br/>\ninstruction was for the kids just b/c they were 11 and 12 yo.  <br/>\n<br/>\n<br/>\nI also wanted to mention that I myself also have terrible handwriting as a<br/>\nchild my mother, a lefty, thought it would be better for me to be right<br/>\nhanded person so every time I&#39;d pick up something with my left hand she&#39;d<br/>\nput it in my right.  By the time I was in the 5th grade my handwriting was<br/>\nso bad she told me about doing this and actually suggested that I re-learn<br/>\nto write with my left hand.  I never did, I just have terrible handwriting<br/>\nand try not to write if possible.  Maybe one day I will practice, but it&#39;s<br/>\njust not important now.<br/>\n<br/>\nSorry for the long rambling.<br/>\nMisty</div>","specialLinks":[]}],"prevTopicId":12063,"nextTopicId":12067}}