{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":233219230,"authorName":"Homeschlfor2@aol.com","from":"Homeschlfor2@...","profile":"chrissysspoiled","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What Ive gotten from this Loop  LONGGGGGG","postDate":"1147728969","msgId":13212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2Yi40YzM4ZDIuMzE5YTRlNDlAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13211,"nextInTime":13213,"topicId":13212,"numMessagesInTopic":0,"msgSnippet":"Hiya all!  Ive been putting off sharing for awhile cause well i just  dont get around to it! With all the discussions though I wanted to throw  out a veiwpoint","messageBody":"<div id=\"ygrps-yiv-1667207026\">Hiya all!  Ive been putting off sharing for awhile cause well i just  dont <br/>\nget around to it! With all the discussions though I wanted to throw  out a <br/>\nveiwpoint to those that give great tips and tricks and advice day after  day year <br/>\nafter year that I GOT IT  lol!!!<br/>\n <br/>\nI have 2 children  Bethany is 8 almost 9 and has complete motor  apraxia with <br/>\nsecondary unspecified encephalophy (which I never spell right  lol).  What <br/>\nall that means in human terms is that she &quot;loses&quot; stuff in her  brain, today she <br/>\nmay be able to read simple sentences tomorrow it may be  lost.  Her brain <br/>\nalso sometimes forgets (nice words  lol) to tell her  feet to move so she falls.  <br/>\nOverall its just frustrating for her   nothing horrible,  Anyhow she did 3  <br/>\nyes 3 yrs of prek to get her  therapies... then kindergarten then half of first <br/>\ngrade. My son is 7 and he  is just a typical high energy boy he did 1 yr of <br/>\nprek and half of  kindergarten.<br/>\n <br/>\nWe didn&#39;t send the kids back after Christmas break 2004.  At first we  did <br/>\nack school at home  everyday rigid rigid rigid...... Bethany got worse  I cried <br/>\nall the time  thinking omg I pulled her because the school wanted  her in <br/>\nspecial ed and im making her even worse.....  Jacob just did what  Jacob does <br/>\nslammed the books and said you cant make me.... Bethy though wanted  to please so <br/>\nshe would give herself migraines and just have melt  downs.  About a mnth of <br/>\nthis and I was researching big time  and found  unschooling and this loop.  I <br/>\nfor a yr and half have read read read and  sometimes asked questions.  We have <br/>\nno real limits  we have space  boundries  but sat down ahead of time and said <br/>\nok Mom gets cranky late  afternoon what can we do  I can go to my room since <br/>\nits my issue.... they  agreed no they want to be able to see me easily (my room <br/>\nis what should be the  attic)  so at MY cranky time they either watch movies <br/>\nor play or lie on the  floor right by me and look through books  but they <br/>\ndaily give me my cranky  time.  Daddy works long hrs and odd hrs  so we have what <br/>\nwe call a  sleeproom   it has a double bed bunkbed with twin on top and a twin <br/>\nin  there  plus a tv and vcr  that&#39;s the quiet zone downstairs anyone at  <br/>\nanytime can go in there for sleep or quiet (keep in mind we have a tiny house 2  <br/>\nreal bedrooms and the upstairs space which is the catch all master  bedroom)  <br/>\nthe other room downstairs is the play room.... there is no door  on that room <br/>\nright now and that our rockin room if you go in there  you  respect that it <br/>\ncan be loud messy and way fun!June will be our yr anniversary  of  officially <br/>\nunschooling  and in this year we have DONE NOTHING not  a thing that anyone <br/>\nlooking in would consider schoolish  we play all day  everyday house, dolls, <br/>\nbarbies, rescue heros, hide and seek... Jacobs fave thing  is to announce hey im <br/>\ngoing to play with my imagination.   Now that  its nice they are outside from <br/>\nsunup to sundown  if they are watching tv  and I think its nice out  lol I go <br/>\noutside 99.9% of the time  they  follow  if I dont want to go out I dont expect <br/>\nthem to!<br/>\n <br/>\nBethany still has problems  she still loses things and she still  falls  but <br/>\nyou know  she smiles all the time and when she does lose  stuff she shes mom <br/>\nmy brain just makes me crazy lol  She recently after  pushing my to rough house <br/>\nmore than I was comfortable with expressed you know  sometimes I just get so <br/>\nmad at my body that I just want to cry but cant always  make myself... wow how <br/>\nmany adults dont get that???<br/>\n <br/>\nJacob without a doubt would be on meds  hes just that kind of kid but  if you <br/>\nlook past that constant motion and sometimes destructive curiousity you  find <br/>\nthe most loving child if I may say so myself... he on his own now says mom  <br/>\nIm feeling like I need to run im going to go run around the house 10 times   <br/>\ncount and time me!!!  To cool!<br/>\n <br/>\nOk so now that I have gone on and on I hope you Oldies hehe get just how  <br/>\nmuch you offer and how you make the world of difference.  If I didn&#39;t read  <br/>\nalmost daily someone in someway says ITS OK TO PLAY  id of course be  thinking i <br/>\nwas a horrible mom to not have them reading etc etc!<br/>\n <br/>\n <br/>\nThanks<br/>\nChrissy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":13193,"nextTopicId":13029}}