{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1371145227","msgId":49834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwZDA2YithdHA3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwY2NjcCtoZTJjQGVHcm91cHMuY29tPg=="},"prevInTopic":49833,"nextInTopic":0,"prevInTime":49833,"nextInTime":49835,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"... Do they actually want to *earn* the money? That s an important question - would they be just as happy if it were given, no strings attached? If you can","messageBody":"<div id=\"ygrps-yiv-403984989\"><blockquote><span title=\"ireply\">&gt; &gt; My kids are always wanting a way to earn money and that&#39;s one way we&#39;ve set up. They&#39;d get paid if they chose to do it at someone else&#39;s house as a way to earn money, so why not mine if they so choose?&lt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Do they actually want to *earn* the money? That&#39;s an important question - would they be just as happy if it were given, no strings attached? If you can afford to pay them, can you afford to simply give them more money? <br/>\n<br/>\nI rarely have the luxury of being able to pay people to work for me - when I do, I&#39;ll offer my kids a first pick, if it&#39;s something they&#39;d be interested in doing. Ray&#39;s done a good bit of landscape work, for instance, so I&#39;ve occasionally paid him for yard work, when I have the extra cash. I&#39;d much rather pay someone. I might pay my daughter for graphic design work if I needed some done. But I&#39;m not in the position to pay for housekeeping services. I&#39;ve done a few odd jobs at home over the years and sometimes subcontracted the work to kids - I pay them what I&#39;d make for the same volume of work. <br/>\n<br/>\nMy own experiences with kids wanting to earn money is that they wanted to supplement the family income - mainly so they could have some buying power during times when we&#39;ve been broke, but also to help the family in general. I know sometimes kids want to do adult work to feel grow-up - but that&#39;s not necessarily about earning money, they can be just as happy with volunteer work. <br/>\n<br/>\nIn a more conventional parenting paradigm, when kids &quot;want&quot; to earn money, it&#39;s because a share of the family resources is made contingent on kids living up to parents&#39; expectations. Those might be an expectation that &quot;everyone helps&quot; with a very adult slant on what it means to &quot;help&quot;, or an expectation of good grades. In that sense, money is being used as a reward, as an attempt to mold who kids are and what&#39;s important to them. Like any other teaching practice, the results depend wholly on the perceptions and perspectives of the kids - and as such can widely different even within the same family. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":403767111,"authorName":"Jo Isaac","from":"Jo Isaac &lt;joanneisaac@...&gt;","profile":"joanne.isaac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Allowances","postDate":"1371126016","msgId":49833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERVQjExMS1XNjFBODQ5QTE0Q0M5MUJBOERCNTM5Q0I3ODcwQHBoeC5nYmw+","inReplyToHeader":"PGtwY2NjcCtoZTJjQGVHcm91cHMuY29tPg==","referencesHeader":"PGtvdG9iNSs5aGxjQGVHcm91cHMuY29tPiw8a3BjY2NwK2hlMmNAZUdyb3Vwcy5jb20+"},"prevInTopic":49832,"nextInTopic":49834,"prevInTime":49832,"nextInTime":49834,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"... I m not clear, do the kids also get a set allowance too, that they are free to spend as they wish and working for parents and/or someone else is","messageBody":"<div id=\"ygrps-yiv-1467094766\"><blockquote><span title=\"ireply\">&gt; My kids are always wanting a way to earn money and that&#39;s one way we&#39;ve set up. They&#39;d get paid if they chose to do it at someone else&#39;s house as a way to earn money, so why not mine if they so choose?&lt;<br/>\n<br/>\n </span></blockquote>I&#39;m not clear, do the kids also get a set allowance too, that they are free to spend as they wish and &#39;working&#39; for parents and/or someone else is additional money if they want it?<br/>\nIf it&#39;s essentially the only money they get, and they have to do chores for it and get it recorded, then that is likely to foster resentment against parents, resentment against &#39;chores&#39; and gives them little ability to learn about spending/saving if they don&#39;t get a set, reliable amount each week or month.  If you know you want to save, for say - a $75 Lego set, if you get $25 month you can work out easily how long till you get your Lego, but if your allowance is dependent on chores/behaviour, etc, then it is much harder to budget and you won&#39;t know.<br/>\nIf, however, the kids get a set allowance, and then are offered to do jobs around the house for additional money, then of course if they want to do that (and get a choice), that is great  - but I think they should get paid a fair amount - the amount that you&#39;d pay someone if you got them in from outside the house to do an odd-job, for example.<br/>\nMy  Dad used to &#39;make&#39; me work in the summer holidays (the only times I visited him) and he dished out the jobs (some were truly awful - fishing dead frogs out of the camp ground swimming pool, for example!) and he paid me an absolute pittance - nothing like the money he would have paid his personnel to do such work. I resented it greatly - and often wrote to my Mum to send me money so I could escape the endless jobs for a while.<br/>\nJo.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"","from":"unschoolingbasics-owner@yahoogroups.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1371124953","msgId":49832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwY2NjcCtoZTJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtvdG9iNSs5aGxjQGVHcm91cHMuY29tPg=="},"prevInTopic":49831,"nextInTopic":49833,"prevInTime":49831,"nextInTime":49833,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"I m posting part of an off-line discussion anonymously - it s kind of a tangent from the main topic but one which often comes up wrt giving kids money. As a","messageBody":"<div id=\"ygrps-yiv-1273173338\">I&#39;m posting part of an off-line discussion anonymously - it&#39;s kind of a tangent from the main topic but one which often comes up wrt giving kids money. As a big of back story, someone sent in a link and description to an app which sounded a lot like a &quot;gold star chart&quot; done on the computer - I don&#39;t have the original post, I&#39;m afraid, since I rejected it, but there was a lot about tracking kids behavior and chores. Bleh. In the ensuing email exchange, an important question came up and I thought I&#39;d bring it here - I&#39;ll reply later as I&#39;m heading out the door at the moment. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; My kids are always wanting a way to earn money and that&#39;s one way we&#39;ve set up. They&#39;d get paid if they chose to do it at someone else&#39;s house as a way to earn money, so why not mine if they so choose?&lt; </span></blockquote></div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1370998571","msgId":49831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwOGd2YitvbDQ5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwNWxobitnMHFpQGVHcm91cHMuY29tPg=="},"prevInTopic":49830,"nextInTopic":49832,"prevInTime":49830,"nextInTime":49832,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"... When my kids were little, and when we could afford it, this was our approach too. We gave our kids a fairly small allowance when we had the money to give,","messageBody":"<div id=\"ygrps-yiv-2124497819\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Eva&quot; &lt;evawitsel@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... Besides their allowances we have additional money to spend in<br/>\n&gt; our budget. So they don&#39;t *need* to spend their allowance when they<br/>\n&gt; want or need something. So for example when my son started to play<br/>\n&gt; minecraft, we bought it for him. When we go out for ice cream, we pay<br/>\n&gt; for it. Etc. etc. The allowance is something extra. <br/>\n<br/>\n </span></blockquote>When my kids were little, and when we could afford it, this was our approach too. We gave our kids a fairly small allowance when we had the money to give, but that was so they would have money for little spur-of-the-moment purchases. My kids loved going to Dollar Tree when they were young, and, as others have mentioned, everything there costs a dollar. So nothing is high quality or high value there. But little kids tend to like little toys and nick-knacks, and they enjoy having something new! :-) They also used to enjoy buying little gifts for my husband or me there, occasionally. :-)<br/>\n<br/>\nBut if they wanted something more expensive, and if we could afford it, we bought it for them. Or if we went out for ice ream or a movie, we paid. If we couldn&#39;t afford what they wanted, they understood.<br/>\n<br/>\nI did talk to my kids about regular expenses, like rent/mortgage, utilities, other monthly bills, and groceries, when they were old enough to be interested (which was maybe from age 10 and up). I showed them my way of keeping track of bills due and bills paid. I showed them how I look at our checking account balance and see what bills are due within a particular pay-period, and then I knew how much I could spend on other things in that one or two-week period.<br/>\n<br/>\nBut I did not try to make my kids live as if they were financially independent (or working) and had to plan their own budgets, when they weren&#39;t. <br/>\nI think that kids are better able to learn about and understand budgets and planning for real-life expenses when they are actually in that situation - but it definitely helps to have seen how their parents do it. (Kids can also learn from their parents&#39; mistakes, if the parents are honest with them about it.)  <br/>\n<br/>\nAnyway, my kids are now in college part-time, and both work part-time (full-time in the summer). They both seem to manage money better than my husband and I did when we were younger! <br/>\n<br/>\nMy son has been living in an apartment, with roommates, for 3 years, and has been financially independent (except that we pay his car insurance). (He was lucky enough to have been able to buy a used car in good condition, from a friend, for a very good price, a couple of years ago.) I don&#39;t know how he manages his budget, specifically, but I do know that he lives on what he earns, and has NO debt! (He has both grade-based and financial-need scholarships to cover his tuition.)<br/>\n<br/>\nMy daughter still lives with us. My husband and I drive her to and from college and work. My big dilemma right now is whether to start asking her to pay for the gas, and some of her own groceries. She saves most of what she earns, and I want her to have some savings, for when she needs it! We&#39;re hoping she&#39;ll be able to afford a car soon. I guess I won&#39;t ask her to pay for her food or the gas we use in driving her unless we absolutely have to. If/when she does get a car, then she&#39;ll make her own car and gas payments. And we&#39;ll probably have to ask both kids to pay for their own insurance, at that point.<br/>\n<br/>\nIt&#39;s when your kids are in their late teens and early 20s that this stuff becomes &quot;real&quot;. When they&#39;re 5 years old and want cash in hand AND some larger, more expensive games/toys, I would say it&#39;s better for the parents to save for the big things (and for all family outings). If you can&#39;t afford it right away when they want it, they&#39;ll generally understand. I wouldn&#39;t ask a 5 y.o. to save his allowance.  <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":482616263,"authorName":"judyw0607","from":"&quot;judyw0607&quot; &lt;judyw0607@...&gt;","profile":"judyw0607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1370979111","msgId":49830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwN3R2NytrZ24zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwNWxobitnMHFpQGVHcm91cHMuY29tPg=="},"prevInTopic":49826,"nextInTopic":49831,"prevInTime":49829,"nextInTime":49831,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"We started our two boys on an allowance nearly a year ago when they were 4 and 6.  For them/us, $5 per week seemed like a reasonable starting point, and it s","messageBody":"<div id=\"ygrps-yiv-7463509\">We started our two boys on an allowance nearly a year ago when they were<br/>\n4 and 6.  For them/us, $5 per week seemed like a reasonable starting<br/>\npoint, and it&#39;s still a good working amount.<br/>\n<br/>\nBefore we started, I read up on what other families do for allowance and<br/>\ngot some ideas.  For me, the main thing was that allowance was just<br/>\nthat:  an amount of money we *allow* the kids to have, no strings<br/>\nattached, to spend or save as they please.  I do offer gentle advice if<br/>\nI think an item they want to buy isn&#39;t such a great idea, and they&#39;ve<br/>\nboth become smart shoppers with an eye for value -- not 100% of the<br/>\ntime, but they&#39;re pretty good at it!  They have both learned so much<br/>\nbeing able to shop for themselves (counting money, comparing prices on<br/>\neBay, Amazon, in-store sales, or being willing to pay &quot;full retail&quot;<br/>\nbecause they really, really want whatever it is right then and<br/>\nthere...and that&#39;s okay!).<br/>\n<br/>\nLike Eva, we have money in our family budget (thankfully) to take care<br/>\nof their needs, so allowance is for little extras or what some may<br/>\ncharacterize as impulse purchases.  Sometimes I decide on the fly,<br/>\n&quot;Okay, I can get that for you,&quot; if we come across something they want<br/>\nthat I think is a reasonable request (big or small).  I sometimes have<br/>\nto remind myself that we&#39;d be spending a whole bunch more if they were<br/>\nattending private school -- and even public schools in our area require<br/>\nactivity/field trip fees here and there.  I also give my boys &quot;X&quot; number<br/>\nof dollars to spend in a certain store, like the Dollar Tree (like $3<br/>\neach, so they have fun picking out 3 items each).  Things like getting<br/>\nan ice cream or going out to eat (which is rare, since they both are<br/>\nvery small-quantity, narrow-choice eaters), we take care of -- it&#39;s<br/>\nfood, after all!  :)<br/>\n<br/>\nWhen I was deciding whether/how to start doing allowances, I remember<br/>\nreading that some families give different amounts per child based on<br/>\nage.  I can sort of see that if there&#39;s a big age difference, but my<br/>\nguys are less than 2 years apart.  I remember vividly being the youngest<br/>\nof 5 kids (all close in age) and getting the lesser amount of things<br/>\nbased on age.  It felt horrible, like I wasn&#39;t as important.  And in my<br/>\ncase, the amount of allowance was so small -- barely enough to buy a<br/>\ncouple pieces of candy at the corner store -- it meant my brother and<br/>\nsisters could get the candy they wanted, but I never had quite enough to<br/>\nget what I liked.  And waiting another week to a 4 year old is like an<br/>\neternity...maybe not so much for an 8 or 9 year old.<br/>\n<br/>\nIt&#39;s been fascinating to see how my boys each handle their allowance<br/>\nmoney.  My older son is more likely to spend it quickly (and he likes to<br/>\ngo out shopping), buy my younger is more into saving (and he&#39;s more into<br/>\nstaying at home right now).  I&#39;m sure these things will ebb and<br/>\nflow...in fact, they already have over the last year or so since we<br/>\nstarted allowances.<br/>\n<br/>\nJudy W<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Eva&quot; wrote:<br/>\n&gt;<br/>\n&gt; Our children (6 and 8) get a weekly allowance (is that the same as<br/>\npocket money?). It&#39;s large enough that they can really buy something<br/>\nnice and don&#39;t have to save months to buy the things they like.<br/>\n<br/>\n&gt;<br/>\n&gt; Besides their allowances we have additional money to spend in our<br/>\nbudget. So they don&#39;t *need* to spend their allowance when they want or<br/>\nneed something. So for example when my son started to play minecraft, we<br/>\nbought it for him. When we go out for ice cream, we pay for it. Etc.<br/>\netc. The allowance is something extra. </span></blockquote></div>","specialLinks":[]},{"userId":311108332,"authorName":"Eva","from":"&quot;Eva&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1370904950","msgId":49826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwNWxobitnMHFpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwMzNuditmdDUxQGVHcm91cHMuY29tPg=="},"prevInTopic":49825,"nextInTopic":49830,"prevInTime":49825,"nextInTime":49828,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"... Our children (6 and 8) get a weekly allowance (is that the same as pocket money?). It s large enough that they can really buy something nice and don t have","messageBody":"<div id=\"ygrps-yiv-291270293\">--- That was all I was asking about what other families do ---<br/>\n<br/>\nOur children (6 and 8) get a weekly allowance (is that the same as pocket money?). It&#39;s large enough that they can really buy something nice and don&#39;t have to save months to buy the things they like. I think my oldest was 4 or 5 years old when we started giving them an allowance. At the time he really liked playmobil and the smallest packages cost 2,50 euro, so we gave him 2,50 euro each week :-) He could buy a small package or save for bigger sets (which he often did). <br/>\n<br/>\nBesides their allowances we have additional money to spend in our budget. So they don&#39;t *need* to spend their allowance when they want or need something. So for example when my son started to play minecraft, we bought it for him. When we go out for ice cream, we pay for it. Etc. etc. The allowance is something extra. I remember Sandra once wrote that the allowance is nice so that they can have some money in their pocket to spend completely as they please. I like that!<br/>\n<br/>\nEva<br/>\nBerend (8) & Fiene (6)</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1370887147","msgId":49825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwNTQ1Yis3MXQzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwMzNuditmdDUxQGVHcm91cHMuY29tPg=="},"prevInTopic":49824,"nextInTopic":49826,"prevInTime":49824,"nextInTime":49826,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"... ************ Kelly Lovejoy once said she liked to give her kids enough money that they could spend some and save some - which sounds great, but I ve rarely","messageBody":"<div id=\"ygrps-yiv-913107999\">&quot;virgo.vegan&quot; &lt;virgo.vegan@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;hoping to read some amazing idea that may work in another unschooling family. <br/>\n </span></blockquote>************<br/>\n<br/>\nKelly Lovejoy once said she liked to give her kids enough money that they could spend some and save some - which sounds great, but I&#39;ve rarely had the budget for that! And since our family income has always been affected by self-employment to some extent (right now I have a f/t job, but George is self-employed) our income can very a lot. So we&#39;ve developed strategies for our &quot;feasts and famines&quot;. We haven&#39;t done allowances for awhile, but I&#39;m thinking it might be time to try that again - in part because my income has gotten more stable - so I&#39;m hoping to hear other people&#39;s stories too!<br/>\n<br/>\nIn the past what has worked with Mo was to give her a store-by-store budget - so if we were going to a bunch of stores, I&#39;d do the math, figure out an average, and then adjust it based on the store - she might get a smaller budget for &quot;the Dollar Tree&quot; where everything is a dollar or less, because her money goes further there, and a larger budget at Game Stop or Walmart (where we usually go for Legos). None of that was a secret - I&#39;d let Mo know about the finances etc, but never in a great deal of detail because she doesn&#39;t like words. As she&#39;s gotten older, when we have larger chunks of money to spend I give her the broader picture: &quot;we have enough money for games And legos... up to a hundred dollars total - so roughly three things in the thirty dollar range - where do you want to start?&quot; <br/>\n<br/>\nLately, as I mentioned, my income has been more stable, while at the same time Morgan has gotten less interested in shopping. So maybe there&#39;s no real need for an allowance, but it occurs to me that she might like to save some money and I could facilitate that. She does typically save gift money and will periodically use it to buy something big. And even though she&#39;s not much interested in shopping, I keep my eyes open for things she would like - some &quot;strewing&quot;, some more direct purchases - like getting the latest edition of a comic book she reads. <br/>\n<br/>\nRay never really had an allowance - but there are Big Issues involved having to do with the fact that he&#39;s my stepson. When he was younger (homeschool years, school years) he got money from various sources, sometimes tied to work, or school work, or making someone happy, or as a true gift. By the time he moved in with us as a full-time family member and unschooler, George was in the process of becoming partly disabled, so our finances went down the tubes - Ray&#39;s &quot;spending money&quot; was in the form of a cut of the food stamp budget for awhile. And by the time that all started to settle down he was starting to find work with local farmers. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":345817076,"authorName":"Sylvia Woodman","from":"Sylvia Woodman &lt;sylvia057@...&gt;","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1370886111","msgId":49824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTUhKS0wtam50dFRQdjJTa0ZoZDQtUHBlUmZKR3E5dDctV29LRGJ4VEVFPVE4Y25wUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49823,"nextInTopic":49825,"prevInTime":49823,"nextInTime":49825,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"===-===He asked us to stop giving him allowances and be the ones to buy his things again, that he liked it that way better. When we were the ones keeping track","messageBody":"<div id=\"ygrps-yiv-1094011947\">===-===He asked us to stop giving him allowances and be the ones to buy his<br/>\nthings again, that he liked it that way better. When we were the ones<br/>\nkeeping track of money, he was getting more expensive items - wii games,<br/>\nbigger action figures and lego sets, etc. When he was spending his money he<br/>\nwas getting small things that he really didn&#39;t want but he really enjoyed<br/>\nshopping and buying something. ===-===<br/>\n<br/>\nIt sound to me like you are not giving him a generous enough allowance.<br/>\n When we started our kids out on an allowance when they were 8 and 6 we<br/>\nstarted them on $10 a week.  We are in a bit of a cash flow crunch at the<br/>\npresent moment but as soon as that is past I would like to increase it to<br/>\n$20 a week.  In 2013 $5 a week won&#39;t buy them anything of good quality.  I<br/>\nwant them to really have the experience of having money in order to have<br/>\nthe opportunity to make good decisions with their money.  It&#39;s not<br/>\nreasonable to expect a 6 year old to save for six months to buy something.<br/>\n<br/>\nAlso, as an unschooling parent we have to examine all the things our kids<br/>\nwant in light of unschooling.  Are those wii games, art supplies, that<br/>\nxbox, fabric, apps,that Minecraft account and the hardware to go along with<br/>\nit in fact educational expenses?  If so, then we the parent should be<br/>\nproviding them as surely as it is our responsibility to provide food and<br/>\nshelter.  In other families those things might be considered &quot;recreational&quot;<br/>\nexpenses but for us they are not.<br/>\n<br/>\nWarmly,<br/>\n<br/>\nSylvia<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":295946856,"authorName":"virgo.vegan","from":"&quot;virgo.vegan&quot; &lt;virgo.vegan@...&gt;","profile":"virgo.vegan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1370821183","msgId":49823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwMzNuditmdDUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNzA3MDIzMTYuMTIxNDkuWWFob29NYWlsTmVvQHdlYjE4MjIwMy5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":49822,"nextInTopic":49824,"prevInTime":49822,"nextInTime":49824,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"I gave more details in a response to Susanne - all of the transition was with his input and him wanting things a different way.  That is part of why we are","messageBody":"<div id=\"ygrps-yiv-1631759996\">I gave more details in a response to Susanne - all of the transition was with his input and him wanting things a different way.  That is part of why we are torn about how to treat allowances, and part of why we are hoping to read some amazing idea that may work in another unschooling family.  I am surprised you say it doesn&#39;t matter what other faimlies do.  Part of what I have appreciated and really gleamed form many of these unschooling lists is reading wonderful little anecdotes of how something may have helped a family be better unschoolers.  That was all I was asking about what other families do - that is why I have searched archives here and why I have searched, Sandra&#39;s, Joyce&#39;s and Pam&#39;s pages already.<br/>\n<br/>\nI came her because to my knowledge, Meredith doesn&#39;t have a page and I love her writing and her stories of Ray and Mo since they are such different children. And I was hoping to get a fresh look on this topic.<br/>\n<br/>\nI also am not sure how the page about how much unschooling should cost helps?  There is nothing there about children and them handling money.  I did read this page - <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/allowance\">http://sandradodd.com/math/allowance</a>  and follow the rabbit hole of links before posting here.<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":295946856,"authorName":"virgo.vegan","from":"&quot;virgo.vegan&quot; &lt;virgo.vegan@...&gt;","profile":"virgo.vegan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Allowances","postDate":"1370820619","msgId":49822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwMzM2YitzdXJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwMDFpditjb2UyQGVHcm91cHMuY29tPg=="},"prevInTopic":49821,"nextInTopic":49823,"prevInTime":49821,"nextInTime":49823,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"Responses below ... Pretty much, but also I think it is his personality.  Noah may want something that costs $20 but to save for that is really hard for him.","messageBody":"<div id=\"ygrps-yiv-2033228271\">Responses below <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; We are in the process of revisiting allowances again in our family.  We did them in the past but as soon as Noah (then 4 or 5) had cash in his hands, and went to a store he was buying whatever he could for that amount, but then a week later wishing he had saved it for something bigger.  <br/>\n&gt; <br/>\n&gt; /// So, he was getting an allowance, but because he&#39;s little, it&#39;s hard for him to save his money to buy something in the future?<br/>\n<br/>\n </span></blockquote>Pretty much, but also I think it is his personality.  Noah may want something that costs $20 but to save for that is really hard for him.  His 2 year old brother, Kai,  can save - he wants exactly what he wants and will not subsitute for something he does not want.  So when Noah had $5, and wanted a $20 toy, he wouldn&#39;t be able to save for 4 weeks because he would spend the $5 weekly.  We tried paying him once monthly, but then he didn&#39;t like not getting the money every week.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; So then he asked us to keep his allowance because he wasn&#39;t able to save it <br/>\n&gt; <br/>\n&gt; /// So, it was his idea for you to keep his money?  You were acting as his bank?<br/>\n&gt; <br/>\n </span></blockquote>Yes, this was his idea for us to keep his money. we had an app that he helped us set up so he could see how much money he had without physically having the cash in hand, or in his piggy bank.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; so we stopped allowances <br/>\n&gt; <br/>\n&gt; /// How was it decided to stop?  Did you discuss it as a family, w/ his input?  <br/>\n&gt; <br/>\n </span></blockquote>He asked us to stop giving him allowances and be the ones to buy his things again, that he liked it that way better.  When we were the ones keeping track of money, he was getting more expensive items - wii games, bigger action figures and lego sets, etc.  When he was spending his money he was getting small things that he really didn&#39;t want but he really enjoyed shopping and buying something.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; and went with a system of taking whatever fun money we had in the budget and making a family decision on what to buy.  It was working, is sort of working, but the place where it seems to me not to be working is when Noah, now 6, is asking how much money HE has.  <br/>\n&gt; <br/>\n&gt; /// So, it sounds like he gets the idea of making the family decision on what to buy, but because he&#39;s still so young, he still feels like, somewhere, he has money of his own?<br/>\n<br/>\n </span></blockquote>I spoke to him more about this and found out his confusion about his money cam about when I gave him $5 the other day to spend as he wished since we were going to the dollar store and wal-mart.  I had made an extra $5 on a small craft project and decided to give it to him.  While in the store, he gave it back to me and decided he wanted to buy 2 apps he had seen the night before.  Because he never gave that money to a cashier, he thought he still had money.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I am torn and still trying to sort it out - maybe we give him $5 a week to use however he wants and deduct it from the leftover fun money.  <br/>\n&gt; <br/>\n&gt; /// You mean this as a question?  What if you talk to him about it? ;-)<br/>\n </span></blockquote>Yes- thinking out loud a bit. And yes, been talking to him about it all along.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt; Wondering what other families do - I have searched the archives, but wanted to bring this up again.  <br/>\n&gt; <br/>\n&gt; /// We haven&#39;t figured out allowances yet either ;-).  It&#39;s a work in progress.  :-)<br/>\n&gt; <br/>\n </span></blockquote>It is helpful for me to read ideas of what may work in other families - yes, it is a work in progress and is ever evolving, but many times, I read things on these lists and think, &quot;that or a piece of that, might work in our family.&quot;</div>","specialLinks":[]},{"userId":130986956,"authorName":"yourbestself","from":"&quot;yourbestself&quot; &lt;susanne@...&gt;","profile":"yourbestself","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Allowances","postDate":"1370720671","msgId":49820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwMDFpditjb2UyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtvdG9iNSs5aGxjQGVHcm91cHMuY29tPg=="},"prevInTopic":49819,"nextInTopic":49821,"prevInTime":49819,"nextInTime":49821,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"Hi Susan, I m not 100% sure I understand what s happening so I have some questions. ;-)  I ve put this /// in front of what I ve written. ... /// Me too ;-). ","messageBody":"<div id=\"ygrps-yiv-735858162\">Hi Susan,<br/>\n<br/>\nI&#39;m not 100% sure I understand what&#39;s happening so I have some questions. ;-)  I&#39;ve put this /// in front of what I&#39;ve written.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;virgo.vegan&quot; &lt;virgo.vegan@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; We are in the process of revisiting allowances again in our family.  We did them in the past but as soon as Noah (then 4 or 5) had cash in his hands, and went to a store he was buying whatever he could for that amount, but then a week later wishing he had saved it for something bigger.  <br/>\n<br/>\n/// So, he was getting an allowance, but because he&#39;s little, it&#39;s hard for him to save his money to buy something in the future?<br/>\n<br/>\n&gt; <br/>\n&gt; So then he asked us to keep his allowance because he wasn&#39;t able to save it <br/>\n<br/>\n/// So, it was his idea for you to keep his money?  You were acting as his bank?<br/>\n<br/>\n&gt; so we stopped allowances <br/>\n<br/>\n/// How was it decided to stop?  Did you discuss it as a family, w/ his input?  <br/>\n<br/>\n&gt; and went with a system of taking whatever fun money we had in the budget and making a family decision on what to buy.  It was working, is sort of working, but the place where it seems to me not to be working is when Noah, now 6, is asking how much money HE has.  <br/>\n<br/>\n/// So, it sounds like he gets the idea of making the family decision on what to buy, but because he&#39;s still so young, he still feels like, somewhere, he has money of his own?<br/>\n<br/>\n&gt; I am torn and still trying to sort it out - maybe we give him $5 a week to use however he wants and deduct it from the leftover fun money.  <br/>\n<br/>\n/// You mean this as a question?  What if you talk to him about it? ;-)<br/>\n<br/>\n&gt; Wondering what other families do - I have searched the archives, but wanted to bring this up again.  <br/>\n<br/>\n/// We haven&#39;t figured out allowances yet either ;-).  It&#39;s a work in progress.  :-)<br/>\n<br/>\n&gt; Hope thats okay.<br/>\n<br/>\n/// Me too ;-).<br/>\n<br/>\nBest wishes,<br/>\nSusanne<br/>\n<br/>\n&gt; <br/>\n&gt; Susan<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Allowances","postDate":"1370713144","msgId":49821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtvdnE3bythcDdsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtvdG9iNSs5aGxjQGVHcm91cHMuY29tPg=="},"prevInTopic":49820,"nextInTopic":49822,"prevInTime":49820,"nextInTime":49822,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"Perhaps you can have a combination of allowances and fun money. My two boys are completely different when it comes to  money. My 10 year old has had a cash","messageBody":"<div id=\"ygrps-yiv-208719489\">Perhaps you can have a combination of allowances and fun money. My two boys are completely different when it comes to  money. <br/>\n<br/>\nMy 10 year old has had a cash book since he was about 7. He records his weekly allowance (which is just a small amount) and birthday money etc. He then carefully works out what he wants to buy, comparing prices on ebay and other places etc. When he buys something he also records it in his cash book. He very rarely chooses to spend his money on a whim. <br/>\n<br/>\nMy 8 year old wants the cash, in his hand, on pocket money day. If I forget he cries that he didn&#39;t get his money and doesn&#39;t seem yet to really grasp that it&#39;s still his allowance even if it&#39;s not in his hand. He then tends to spend it at the first available opportunity, and if he doesn&#39;t spend it soon it&#39;ll end up under the bed or in the washing machine. He is also the child who wants to fill the shopping trolley with whatever takes his fancy.<br/>\n<br/>\nWhat I do is I keep the allowance small so both boys have a sense of weekly income which is their own money. My younger son also often gets to choose something small when we&#39;re out and about. So that my older son doesn&#39;t feel this is unfair I then sometimes put towards purchases that he&#39;s saving for, or pay the ebay postage.<br/>\n<br/>\nMany things I consider &quot;educational&quot; and buy out of our family budget eg computer games, books, board games, art supplies etc. They will buy more of stuff they already have lots of eg lego, toy cars, temporary tattoos or other stuff I feel less inclined to buy.<br/>\n<br/>\nBoth seem to feel that they can spend some money on whatever they like, and they get plenty of other stuff they want too.<br/>\n<br/>\nIt&#39;s been like this for some time as it seems to be fluid enough for us all.<br/>\n<br/>\nHope you find a happy way for your family,<br/>\nAlison<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;virgo.vegan&quot; &lt;virgo.vegan@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; We are in the process of revisiting allowances again in our family.  We did them in the past but as soon as Noah (then 4 or 5) had cash in his hands, and went to a store he was buying whatever he could for that amount, but then a week later wishing he had saved it for something bigger.  <br/>\n&gt; <br/>\n&gt; So then he asked us to keep his allowance because he wasn&#39;t able to save it so we stopped allowances and went with a system of taking whatever fun money we had in the budget and making a family decision on what to buy.  It was working, is sort of working, but the place where it seems to me not to be working is when Noah, now 6, is asking how much money HE has.  I am torn and still trying to sort it out - maybe we give him $5 a week to use however he wants and deduct it from the leftover fun money.  Wondering what other families do - I have searched the archives, but wanted to bring this up again.  Hope thats okay.<br/>\n&gt; <br/>\n&gt; Susan<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Allowances","postDate":"1370702316","msgId":49819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzA3MDIzMTYuMTIxNDkuWWFob29NYWlsTmVvQHdlYjE4MjIwMy5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtvdG9iNSs5aGxjQGVHcm91cHMuY29tPg==","referencesHeader":"PGtvdG9iNSs5aGxjQGVHcm91cHMuY29tPg=="},"prevInTopic":49818,"nextInTopic":49820,"prevInTime":49818,"nextInTime":49820,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"  ","messageBody":"<div id=\"ygrps-yiv-540142410\">  <br/>\n&lt;&lt;&lt;&lt;&lt;We did them in the past but as soon as Noah (then 4 or 5) had cash in his hands, and went to a store he was buying whatever he could for that amount, &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIsn&#39;t that the point of having an allowance? That he can buy whatever he wants however he wants?<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;but then a week later wishing he had saved it for something bigger. &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nHelp him. Save it for him. Open  a saving account and place his allowance in it every month/week. Or have a jar at home and do the same. Or write the amount in a ledger/book . That is what partners do.  He asked you to do it for him .<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;So then he asked us to keep his allowance because he wasn&#39;t able to save it so we stopped allowances and went with a system of taking whatever fun money we had in the budget and making a family decision on what to buy.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nSO you did not  do your end of the bargain. He asked you to save his money and you decided to do something else. His allowance should not be used for  family stuff. Or if you were using his money maybe tell him that was from his money? <br/>\n<br/>\n &lt;&lt;&lt;&lt;&lt; It was working, is sort of working, but the place where it seems to me not to be working is when Noah, now 6, is asking how much money HE has.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nOOps! Of course he is. You said you will save it for him :)<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; I am torn and still trying to sort it out - maybe we give him $5 a week to use however he wants and deduct it from the leftover fun money.  Wondering what other families do - I have searched the archives, but wanted to bring this up again.  Hope thats okay.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt really does not matter what other families do. Fun money is not the same as allowance. You decided to give him an allowance and he asked you to save it for him. You did not. You make a mistake. If you can give him the money you were supposed to save it I would do that. If you cannot. I would be honest and say you all used it for &quot;fun money&quot; and you apologize you should have told him and worked it out prior.<br/>\n I also think this maybe a really good link for you to read:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcost\">http://sandradodd.com/unschoolingcost</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":295946856,"authorName":"virgo.vegan","from":"&quot;virgo.vegan&quot; &lt;virgo.vegan@...&gt;","profile":"virgo.vegan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Allowances","postDate":"1370645669","msgId":49818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtvdG9iNSs5aGxjQGVHcm91cHMuY29tPg=="},"prevInTopic":12062,"nextInTopic":49819,"prevInTime":49817,"nextInTime":49819,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":"We are in the process of revisiting allowances again in our family.  We did them in the past but as soon as Noah (then 4 or 5) had cash in his hands, and went","messageBody":"<div id=\"ygrps-yiv-2060957322\">We are in the process of revisiting allowances again in our family.  We did them in the past but as soon as Noah (then 4 or 5) had cash in his hands, and went to a store he was buying whatever he could for that amount, but then a week later wishing he had saved it for something bigger.  <br/>\n<br/>\nSo then he asked us to keep his allowance because he wasn&#39;t able to save it so we stopped allowances and went with a system of taking whatever fun money we had in the budget and making a family decision on what to buy.  It was working, is sort of working, but the place where it seems to me not to be working is when Noah, now 6, is asking how much money HE has.  I am torn and still trying to sort it out - maybe we give him $5 a week to use however he wants and deduct it from the leftover fun money.  Wondering what other families do - I have searched the archives, but wanted to bring this up again.  Hope thats okay.<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Allowances","postDate":"1145146286","msgId":12062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxczIzZStjNTNqQGVHcm91cHMuY29tPg=="},"prevInTopic":12006,"nextInTopic":49818,"prevInTime":12061,"nextInTime":12063,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":" don t mind being disagreed with as long as my opinion is respected. Having someone attack my opinion and being told that I am wrong simply because I don t","messageBody":"<div id=\"ygrps-yiv-1537898940\">&quot; don&#39;t mind being disagreed with as long as my opinion is respected.<br/>\nHaving someone attack my opinion and being told that I am wrong simply<br/>\nbecause I don&#39;t practice their type of unschooling isn&#39;t fair.&quot;<br/>\n<br/>\nNobody is attacking anybody. You&#39;re being questioned. Your ideas are<br/>\nbeing discussed. #2 of the list guidelines (under &quot;welcome message&quot; in<br/>\nthe Files section) is very specific that you should not post about<br/>\nsomething unless you&#39;re willing to have it being discussed.<br/>\n<br/>\nThis list is to help folks embrace unschooling in ALL areas of life.<br/>\nThis list is about respecting children as equals in this game of life<br/>\nand being their partners in this journey. This list will remain true<br/>\nto it&#39;s purpose.<br/>\n<br/>\nThat being said, there are folks at many different stages in this<br/>\njourney. All are welcome. All will take what they choose from this<br/>\nlist, nothing more, nothing less. Isn&#39;t personal choice powerful?:)<br/>\n<br/>\nJust because all are welcome here, doesn&#39;t mean we think all ideas are<br/>\nequally valid. If you&#39;re prepared to defend coercion, forced chores,<br/>\nfood controls, punishment or anything else contrary to RU, it WILL get<br/>\ndiscussed....guaranteed. <br/>\n<br/>\nIf you aren&#39;t comfortable having your words examined, it&#39;s ok to just<br/>\nread and not post as much. It&#39;s ok to quietly learn, it&#39;s ok to<br/>\npost....but know that your words are up for discussion if you choose<br/>\nto put it out here at a public list.<br/>\n<br/>\nI can&#39;t respect opinions I think are not healthy for unschooling or<br/>\nlearning or relationships. I respect your right to hold those<br/>\nopinions, but obviously I think some opinions have more validity than<br/>\nothers.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Allowances","postDate":"1145119805","msgId":12006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxcjg3dCtrdm5jQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":12062,"prevInTime":12005,"nextInTime":12007,"topicId":12006,"numMessagesInTopic":0,"msgSnippet":" I want her to realize that she has responsibilities and obligations as a member of a family (helping with chores) and I don t believe children should get","messageBody":"<div id=\"ygrps-yiv-180396906\">&quot; I want her to realize that she has responsibilities and obligations<br/>\nas a member of a family (helping with chores) and I don&#39;t believe<br/>\nchildren should get paid for these.   However I also don&#39;t want to<br/>\nteach her that she gets money for nothing.&quot;<br/>\n<br/>\nMy kids don&#39;t get paid for helping out around the house, unless I<br/>\nreally need help and am willing to pay for it!:) Usually, they help<br/>\nbecause I ask for a bit of help, or they just offer freely.<br/>\n<br/>\nMost unschooling families have a parent home with the children. What<br/>\nif the wage earner said &quot;I don&#39;t want to &quot;teach&quot; you that you get paid<br/>\nfor nothing&quot; in relation to what you choose. What a child chooses to<br/>\ndo is important work for the child (play IS their work). What we<br/>\nchoose in life is important to us. Should the wage earner choose what<br/>\nis worthy of pay or not? I think the wage earner should happily<br/>\nsupport everyone in the family because everyone has different roles.<br/>\n<br/>\nThe wage earners role is to earn the money. The children&#39;s roles are<br/>\nto be KIDS! If a child is not learning about household tasks as they<br/>\ngrow, it certainly isn&#39;t because a parent doesn&#39;t require it. It&#39;s<br/>\nmore likely that they aren&#39;t ALLOWED to help and be honored for<br/>\nhowever they help.<br/>\n<br/>\nFrom a very young age my children have wanted to be involved in<br/>\nwhatever I&#39;m doing. Sometimes it&#39;s messier, sometimes it takes longer,<br/>\nbut like ALL of their learning I support them as they figure it out.<br/>\nWilling helpers abound if you simply support them and honor their<br/>\nmethods of help.<br/>\n<br/>\nI ask my children to help sometimes...not often. Usually what they&#39;re<br/>\ndoing is more important than household tasks.:)<br/>\nIf a person can&#39;t see the difference between a request and a<br/>\ndemand...well, we&#39;ve got a lot of discussing to do here!<br/>\n<br/>\nA request means the other person has a CHOICE in the matter. It means<br/>\nif my child says &quot;no Mom, I can&#39;t help with that right now&quot; I honor<br/>\nthat without shame or guilt. Sometimes they&#39;ll say &quot;yeah, let me<br/>\nfinish this&quot; or something. That&#39;s ok. They can choose to opt out<br/>\ncompletely also.<br/>\nThat&#39;s a request.<br/>\nA requirement means they have no choice in the matter. That&#39;s not the<br/>\nbest thing for relationships and unschooling is all about the<br/>\nparent/child relationship. If my dh &quot;asked&quot; me to do things I knew<br/>\nthere was little or no choice about, I&#39;d really resent the hell out of<br/>\nhim!<br/>\n<br/>\nA person can&#39;t make healthy choices if there is no choice.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":49827,"nextTopicId":49807}}