{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":95670547,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;sherri--lee@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Digest Number 138","postDate":"1091856862","msgId":2606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBJMjIwMDcxREE1Qk1SQGwtZGFlbW9uPg==","inReplyToHeader":"PDIwMDQwODA2LjA2NDEyMS41MjkuNjI1QHdlYm1haWwwNS5ueWMudW50ZC5jb20+"},"prevInTopic":2580,"nextInTopic":0,"prevInTime":2605,"nextInTime":2607,"topicId":2580,"numMessagesInTopic":0,"msgSnippet":"Hi Ren, Thank you for this. After reading this and the other responses, I can t tell you how my attitude has changed and in what seems like such an easy way. I","messageBody":"<div id=\"ygrps-yiv-181271284\">Hi Ren,<br/>\n<br/>\n <br/>\n<br/>\nThank you for this. After reading this and the other responses, I can&#39;t tell<br/>\nyou how my attitude has changed and in what seems like such an easy way. I<br/>\nfeel more free to express an interest in something without feeling any<br/>\nfurther responsibility to it.<br/>\n<br/>\n <br/>\n<br/>\nMy mom is here visiting, and we were talking about my college diploma. I<br/>\nstarted it in 1981 went till 1983 and due to too much enjoyment of life free<br/>\nfrom the limits and rules of my mom, I didn&#39;t do so well and ended up not<br/>\nfinishing. Well when I was sick and on disability, they wanted to retrain<br/>\nme, so instead of starting something new I looked into finishing this<br/>\ndiploma. It was something I wanted to do, meant a lot because it was very<br/>\nclose to my fathers field, he had paid for the first incomplete effort and I<br/>\nwanted to finish it for me but also for him. So I looked into it and<br/>\nfinished it and in 1996 graduated. So 15 years to do a 2 year diploma:-) Of<br/>\ncourse during that time, I had three careers, lived in a couple of foreign<br/>\ncountries and did a bunch of other stuff that was pretty exciting.  So mom<br/>\nand I were talking about it and I made a comment that this month was my last<br/>\npayment on my student loan. And somewhere in the conversation I commented on<br/>\nhow pleased I was that I had finished it and she said &quot;it&#39;s just too bad it<br/>\ntoo you so long&quot; And I looked at her and said &quot;why? What difference does it<br/>\nmake how long it took?&quot; And I felt so pleased with myself to be able to say<br/>\nthat to her.<br/>\n<br/>\n <br/>\n<br/>\nThat is because of this conversation.<br/>\n<br/>\n <br/>\n<br/>\nLast night I heard the word &quot;yurt&quot; for the first time. had to look into it<br/>\nand spent an hour looking at them on the web. Now I know about them and I<br/>\ndoubt I will spend a lot of time looking into them anymore. but it is one<br/>\nmore bit of info. This unschooling road is pretty cool.<br/>\n<br/>\n <br/>\n<br/>\nSherri-Lee<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: Ren [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>] <br/>\nSent: Friday, August 06, 2004 6:41 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Digest Number 138<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n&quot;So my next question would be how do I start giving myself permission to<br/>\njust<br/>\nDO something that intrigues me without proof of my long term interest?&quot;<br/>\n<br/>\nAs Nike says &quot;Just DO It&quot;<br/>\n<br/>\nSeriously though, if I get intrigued with something, I try to act on it<br/>\nwhile the interest is there. After I intensely explore something (sometimes<br/>\nfor a few days, sometimes for months) I&#39;m usually done with it for a long<br/>\ntime. In this way, I&#39;ve given myself a damn good liberal arts education,<br/>\nwithout college!:)<br/>\n<br/>\nLet&#39;s see, I have supplies for altered books and two books that have been<br/>\nstarted and put on hold for a while....I&#39;ll get back to them when I&#39;m ready.<br/>\nI keep a lot of art supplies around for all kinds of projects, art is one<br/>\nconstant in my life, but the projects and interests levels change a lot.<br/>\nAs a writer, I usually have several writing projects in limbo...when I get<br/>\nstuck on one, I can move to another (see, being neurotic is GOOD).<br/>\nLately, my obsession has been philosophy. I&#39;ve been reading stuff on Plato,<br/>\nSocrates and other philosophers...some of it too heavy and makes my head<br/>\nhurt, but I&#39;m fascinated nonetheless. A study of Semiotics led me to a great<br/>\nseries of pro-tv studies...very cool.<br/>\n<br/>\nI have an ongoing interest in wines and plan to take a class soon.<br/>\nTaking a short course on something can be a great way to satisfy an interest<br/>\nif you aren&#39;t sure how to dive in on your own (rarely a problem for me).<br/>\nI always have other countries or time periods snag me, but a steady ongoing<br/>\ninterest in medieval times has led to a lot of fun... I haven&#39;t attended an<br/>\nevent or re-enactment in over a year, maybe I will again when I feel like<br/>\nit! I&#39;ve gotten obsessed with authentic medieval food and after reading for<br/>\ndays I did a meal at home, we all dressed up in costumes and had dinner.<br/>\nThen I was done with medieval food for a LONG time.:)<br/>\nI think it&#39;s really beneficial to have many interests...you know how many<br/>\npeople you can connect with in this life, by understanding and having some<br/>\nknowledge of MANY things? It&#39;s cool. I can have semi-intelligent<br/>\nconversations with people from many walks of life. I LIKE my neurotic self.<br/>\nlol<br/>\n<br/>\nSo next time the urge strikes Sherry, just go for it! Giving yourself<br/>\npermission is very freeing. And if the materials sit unused, don&#39;t despair,<br/>\nyou never know when someone else will need it, or you will get excited<br/>\nagain. It&#39;s better to have the materials on hand when you&#39;re inspired.<br/>\n<br/>\nI had a Vermeer calendar that had sat for about a year, gathering dust with<br/>\na bunch of other art calendars (I bought on sale to have examples of the<br/>\nartitsts work on hand). We watched &quot;Girl with the pearl earring&quot; one night<br/>\nand boy was I glad we had that calendar and all my art books. We looked at<br/>\nthe real pictures Vermeer did, versus the ones they used in the movie. It<br/>\nwas really great.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n                 <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129b7d564/M=295196.4901138.6071305.3001176/D=gr\">http://us.ard.yahoo.com/SIG=129b7d564/M=295196.4901138.6071305.3001176/D=gr</a><br/>\noups/S=1705081972:HM/EXP=1091886119/A=2128215/R=0/SIG=10se96mf6/*http:/compa<br/>\nnion.yahoo.com&gt; click here<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=\">http://us.adserver.yahoo.com/l?M=295196.4901138.6071305.3001176/D=groups/S=</a><br/>\n:HM/A=2128215/rand=707574868&gt; <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*\tTo visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n*\tTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*\tYour use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Digest Number 138","postDate":"1091799632","msgId":2580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODA2LjA2NDEyMS41MjkuNjI1QHdlYm1haWwwNS5ueWMudW50ZC5jb20+"},"prevInTopic":0,"nextInTopic":2606,"prevInTime":2579,"nextInTime":2581,"topicId":2580,"numMessagesInTopic":0,"msgSnippet":"So my next question would be how do I start giving myself permission to just DO something that intrigues me without proof of my long term interest? As Nike","messageBody":"<div id=\"ygrps-yiv-678280343\">&quot;So my next question would be how do I start giving myself permission to just<br/>\nDO something that intrigues me without proof of my long term interest?&quot;<br/>\n<br/>\nAs Nike says &quot;Just DO It&quot;<br/>\n<br/>\nSeriously though, if I get intrigued with something, I try to act on it while the interest is there. After I intensely explore something (sometimes for a few days, sometimes for months) I&#39;m usually done with it for a long time. In this way, I&#39;ve given myself a damn good liberal arts education, without college!:)<br/>\n<br/>\nLet&#39;s see, I have supplies for altered books and two books that have been started and put on hold for a while....I&#39;ll get back to them when I&#39;m ready. I keep a lot of art supplies around for all kinds of projects, art is one constant in my life, but the projects and interests levels change a lot.<br/>\nAs a writer, I usually have several writing projects in limbo...when I get stuck on one, I can move to another (see, being neurotic is GOOD).<br/>\nLately, my obsession has been philosophy. I&#39;ve been reading stuff on Plato, Socrates and other philosophers...some of it too heavy and makes my head hurt, but I&#39;m fascinated nonetheless. A study of Semiotics led me to a great series of pro-tv studies...very cool.<br/>\n<br/>\nI have an ongoing interest in wines and plan to take a class soon.<br/>\nTaking a short course on something can be a great way to satisfy an interest if you aren&#39;t sure how to dive in on your own (rarely a problem for me).<br/>\nI always have other countries or time periods snag me, but a steady ongoing interest in medieval times has led to a lot of fun... I haven&#39;t attended an event or re-enactment in over a year, maybe I will again when I feel like it! I&#39;ve gotten obsessed with authentic medieval food and after reading for days I did a meal at home, we all dressed up in costumes and had dinner. Then I was done with medieval food for a LONG time.:)<br/>\nI think it&#39;s really beneficial to have many interests...you know how many people you can connect with in this life, by understanding and having some knowledge of MANY things? It&#39;s cool. I can have semi-intelligent conversations with people from many walks of life. I LIKE my neurotic self. lol<br/>\n<br/>\nSo next time the urge strikes Sherry, just go for it! Giving yourself permission is very freeing. And if the materials sit unused, don&#39;t despair, you never know when someone else will need it, or you will get excited again. It&#39;s better to have the materials on hand when you&#39;re inspired.<br/>\n<br/>\nI had a Vermeer calendar that had sat for about a year, gathering dust with a bunch of other art calendars (I bought on sale to have examples of the artitsts work on hand). We watched &quot;Girl with the pearl earring&quot; one night and boy was I glad we had that calendar and all my art books. We looked at the real pictures Vermeer did, versus the ones they used in the movie. It was really great.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]}],"prevTopicId":2603,"nextTopicId":2555}}