{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":408744140,"authorName":"alisawinder","from":"&quot;alisawinder&quot; &lt;alisawinder@...&gt;","profile":"alisawinder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling-to-unschooling-to-eak - my son&#39;s question....","postDate":"1315247539","msgId":47206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0MzRqaitsMG52QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0MmZjMStqanBzQGVHcm91cHMuY29tPg=="},"prevInTopic":47205,"nextInTopic":0,"prevInTime":47205,"nextInTime":47207,"topicId":47198,"numMessagesInTopic":0,"msgSnippet":"Thank you for that...everyone has been so helpful - I ve replied to Joyce aty length and didn t think I d clog everywhere - the points you make have helped me","messageBody":"<div id=\"ygrps-yiv-695069651\">Thank you for that...everyone has been so helpful - I&#39;ve replied to Joyce aty length and didn&#39;t think I&#39;d clog everywhere - the points you make have helped me see &#39;separation&#39; but also not to be fearful.<br/>\n<br/>\nChoices, choices and choices with the freedom to make the choice that suits you at that time :) - changing minds is cool too :) which although the poor kids went to school we do believe in that! (why did we ever do it?!)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vickisue_gray&quot; &lt;vickisue_gray@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I see being an unschooler slightly different then just a defining line between &#39;going to school&#39; or &#39;doing school&#39; vs &#39;doing nothing that resembles school&#39;.<br/>\n&gt; <br/>\n&gt; For my family, we embrace the term &#39;unschooling&#39; and more so &#39;radical unschooling&#39; more as a concept that enables our children to have choices and the information needed to make informed choices.  Unschooling [imho] is having the freedom to find ones own path and do which works best for a happy and fulling life.  <br/>\n&gt; <br/>\n&gt; Some people thrive in attending classes and learning from an instructor. Recently my son started taking karate lessons.  Taking these &#39;classes&#39; doesn&#39;t make him &#39;no longer an unschooler&#39;.  The fact that he was able to have the option and decide if he would or wouldn&#39;t take the class, actually makes him more of an unschooler.  He knows that he can continue as long as I have employment [money is a factor] and he knows should he really decide against it, he can stop.  Freedom.  That&#39;s what unschooling means to us.  The right for a young person to choose for themselves.  <br/>\n&gt; <br/>\n&gt; Vicki<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":408744140,"authorName":"alisawinder","from":"&quot;alisawinder&quot; &lt;alisawinder@...&gt;","profile":"alisawinder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling-to-unschooling-to-eak - my son&#39;s question....","postDate":"1315247230","msgId":47205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0MzQ5dStqNWkyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENEMEExNjRELTc4MkEtNEEwRS04RkM4LUJCMDAwMkJDN0FFMkB2ZXJpem9uLm5ldD4="},"prevInTopic":47202,"nextInTopic":47206,"prevInTime":47204,"nextInTime":47206,"topicId":47198,"numMessagesInTopic":0,"msgSnippet":"Thank Joyce.. Ironically today whilst I was at work, Leon was on the computer and when looking through my bookmarks....he found your website (he s already been","messageBody":"<div id=\"ygrps-yiv-81791502\">Thank Joyce..<br/>\n<br/>\nIronically today whilst I was at work, Leon was on the computer and when looking through my bookmarks....he found your website (he&#39;s already been &#39;flicking&#39; Sandra Dodd&#39;s big book).<br/>\n<br/>\nAnyhow - he said to me (mid hug and rather swiftly in his Aspy way) &quot;You know what. I know maths. I use it all the time. Perhaps I&#39;ll do an exam if/when I  need it, like if I want to do a specific thing at Uni , or if it&#39;s useful. You know that I know. The boys know I know. Wew just do it, don&#39;t we, like a third of something, or 10%, or VAT, or stuff, or patterns, or symmetry in leaves. If that lady askd me I&#39;m gonna tell her just what I told you. I&#39;m learning about me, and that&#39;s more important. It&#39;s back to how we used to do stuff - we just &#39;do&#39; it: you make it happen but we don&#39;t &#39;really&#39; notice you doing it - unless I really hunt for the clues!&quot;<br/>\n<br/>\nSo there we have it - need I have asked the question? Probably not, the answer arrived all on its own.<br/>\n<br/>\n More importantly Leon has answered something for himself and the boost its given him is amazing: tonight he sat &#39;proportioning&#39; (his saying) his dinner - something he always used to do prior to school but after being teased relentlessly had stopped.<br/>\n<br/>\nTo us, that was a good sign - comfortable again.<br/>\n<br/>\nSo, basically just thought you might like to know..<br/>\n:)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] De-schooling-to-unschooling-to-eak - my son&#39;s question....","postDate":"1315228824","msgId":47202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENEMEExNjRELTc4MkEtNEEwRS04RkM4LUJCMDAwMkJDN0FFMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo0MGIyaSsyNTI5QGVHcm91cHMuY29tPg==","referencesHeader":"PGo0MGIyaSsyNTI5QGVHcm91cHMuY29tPg=="},"prevInTopic":47201,"nextInTopic":47205,"prevInTime":47201,"nextInTime":47203,"topicId":47198,"numMessagesInTopic":0,"msgSnippet":"... I think it helps to see unschooling as a philosophy, a way to help someone live a certain way, rather than a club where people can be granted or stripped","messageBody":"<div id=\"ygrps-yiv-797367742\">On Sep 4, 2011, at 1:04 PM, alisawinder wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s worried that if he wanted to do an exam it stops him being an  <br/>\n&gt; unschooler<br/>\n<br/>\n </span></blockquote>I think it helps to see unschooling as a philosophy, a way to help  <br/>\nsomeone live a certain way, rather than a club where people can be  <br/>\ngranted or stripped of the label &quot;unschooler&quot;.<br/>\n<br/>\nThe first is a personal relationship with an idea. A philosophy is a  <br/>\ntool for someone to use to help them do what they want to do.  <br/>\nSpecifically, the unschooling philosophy is a tool to help a parent  <br/>\ncreate a rich, supportive environment where her child can explore his  <br/>\ninterests and stumble across new potential interests.<br/>\n<br/>\nIn my mind, young kids of moms who are using the unschooling  <br/>\nphilosophy aren&#39;t unschooling. They&#39;re living life and learning in  <br/>\nways that are natural to humans in an environment that supports that.<br/>\n<br/>\nIt makes me squirmy when people say they&#39;re unschooling themselves  <br/>\nbecause I see unschooling as creating an environment for someone else.  <br/>\nWhen someone&#39;s &quot;unschooling themselves&quot; they&#39;re not creating an  <br/>\nenvironment. They&#39;re doing what interests them. They&#39;re living life.<br/>\n<br/>\nI would say that wanting to take an exam to prove (to self or to  <br/>\nothers) that someone can do a subject as it&#39;s taught in school is  <br/>\ngetting into a gray area that doesn&#39;t help someone understand what  <br/>\nunschooling is.<br/>\n<br/>\nTaking taekwon do classes, testing for belts isn&#39;t a classroom version  <br/>\nof something that exists in real life. If someone wants to learn  <br/>\ntaekwon do, they need to learn from someone who has the knowledge and  <br/>\nskills to pass it on. Same with ballet. Neither is knowledge people  <br/>\ncan pick up from living life. (Unless someone&#39;s growing up in a  <br/>\ndojo! ;-)<br/>\n<br/>\nOn the other hand, fighting and dance and painting, which embrace a  <br/>\nwide range of ways to go about them, can be picked up from real life.  <br/>\nIf someone wants to refine their skills and knowledge in a specific  <br/>\ndirection  they&#39;ll need a more formal approach.<br/>\n<br/>\nBut math. Math is part of real life. It can be learned by living life.  <br/>\nSchool math, on the other hand, isn&#39;t just a classroom version of real  <br/>\nlife math. I wouldn&#39;t even call it a specific kind of math as ballet  <br/>\nis a specific kind of dance. School math is like a shadow cast by  <br/>\n(real world) math but is studied and treated as though it were the  <br/>\nthing casting the shadow. It&#39;s assumed that by studying the shadow  <br/>\npeople will come to understand the thing casting the shadow. But if  <br/>\nthat does happen, it&#39;s not because of school math. It&#39;s because that&#39;s  <br/>\nhow someone&#39;s brain is wired. Most people just find the shadow  <br/>\nconfusing and wonder why they&#39;re studying it. Some find the shadow  <br/>\nfascinating (I did) but don&#39;t grasp how it relates to what&#39;s casting  <br/>\nthe shadow. (Because of how school math is taught, the connection  <br/>\nisn&#39;t necessary.)<br/>\n<br/>\nHis desire to pass the test really isn&#39;t unschooling or not  <br/>\nunschooling. *Why* he wants to pass the test is more telling. (There  <br/>\nmay be multiple reasons.) What won&#39;t help him is looking for  <br/>\nunschooling reasons to take the test. What will help him is to drop  <br/>\nthe question of whether it&#39;s unschooling or not and examine why he  <br/>\nthinks it&#39;s important to pass the test. In what ways will he be a  <br/>\ndifferent person if he passes or doesn&#39;t pass? How will his view of  <br/>\nhimself change if he passes or doesn&#39;t pass? Why? Will it be important  <br/>\nfor other people to know he passed? Why? Will he be able to pass and  <br/>\nnot tell anyone?<br/>\n<br/>\nI&#39;ve written a bit about how school math and (real life) math aren&#39;t  <br/>\nrelated:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a> (down the left hand side under Math)<br/>\n<br/>\nIt might help him see that meeting school milestones doesn&#39;t have much  <br/>\nto do with competency in skill in real life. It&#39;s just about school.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"vickisue_gray","from":"&quot;vickisue_gray&quot; &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling-to-unschooling-to-eak - my son&#39;s question....","postDate":"1315225793","msgId":47201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0MmZjMStqanBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0MGIyaSsyNTI5QGVHcm91cHMuY29tPg=="},"prevInTopic":47199,"nextInTopic":47202,"prevInTime":47200,"nextInTime":47202,"topicId":47198,"numMessagesInTopic":0,"msgSnippet":"I see being an unschooler slightly different then just a defining line between going to school or doing school vs doing nothing that resembles school . ","messageBody":"<div id=\"ygrps-yiv-901444137\">I see being an unschooler slightly different then just a defining line between &#39;going to school&#39; or &#39;doing school&#39; vs &#39;doing nothing that resembles school&#39;.<br/>\n<br/>\nFor my family, we embrace the term &#39;unschooling&#39; and more so &#39;radical unschooling&#39; more as a concept that enables our children to have choices and the information needed to make informed choices.  Unschooling [imho] is having the freedom to find ones own path and do which works best for a happy and fulling life.  <br/>\n<br/>\nSome people thrive in attending classes and learning from an instructor. Recently my son started taking karate lessons.  Taking these &#39;classes&#39; doesn&#39;t make him &#39;no longer an unschooler&#39;.  The fact that he was able to have the option and decide if he would or wouldn&#39;t take the class, actually makes him more of an unschooler.  He knows that he can continue as long as I have employment [money is a factor] and he knows should he really decide against it, he can stop.  Freedom.  That&#39;s what unschooling means to us.  The right for a young person to choose for themselves.  <br/>\n<br/>\nVicki</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: De-schooling-to-unschooling-to-eak - my son&#39;s question....","postDate":"1315163658","msgId":47199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0MGltYStpaWl0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0MGIyaSsyNTI5QGVHcm91cHMuY29tPg=="},"prevInTopic":47198,"nextInTopic":47201,"prevInTime":47198,"nextInTime":47200,"topicId":47198,"numMessagesInTopic":0,"msgSnippet":"... **************** Nope. If he wanted to go back to school, then you could argue that he s no longer an unschooler - but even if he wanted to get a tutor","messageBody":"<div id=\"ygrps-yiv-634250013\">&quot;alisawinder&quot; &lt;alisawinder@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Anyhow. Our eldest has asked if he can do a GCSE in Maths....<br/>\n&gt; Since then he&#39;s asked if it&#39;s ok or if it stops him being an unschooler.<br/>\n </span></blockquote>****************<br/>\n<br/>\nNope.<br/>\nIf he wanted to go back to school, then you could argue that he&#39;s no longer an &quot;unschooler&quot; - but even if he wanted to get a tutor or take a class to help him pass a test, that&#39;s different. If there&#39;s a line (and it can be argued all sorts of ways) its school. <br/>\n<br/>\nSome unschoolers are required to take tests every year! Maybe not where y&#39;all live, but in parts of the US that&#39;s true and maybe in some countries on the continent - heck I don&#39;t think homeschooling is Legal in all European countries, although I&#39;m not sure of the details. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":408744140,"authorName":"alisawinder","from":"&quot;alisawinder&quot; &lt;alisawinder@...&gt;","profile":"alisawinder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"De-schooling-to-unschooling-to-eak - my son&#39;s question....","postDate":"1315155858","msgId":47198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0MGIyaSsyNTI5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47199,"prevInTime":47197,"nextInTime":47199,"topicId":47198,"numMessagesInTopic":0,"msgSnippet":"...has stumped me - any advice gratefully received. This may be a long post: without background it may be tricky to help us, so thought this best. Back in May","messageBody":"<div id=\"ygrps-yiv-295108164\">...has stumped me - any advice gratefully received.<br/>\n<br/>\nThis may be a long post: without background it may be tricky to help us, so thought this best.<br/>\n<br/>\nBack in May we made the decision to de-register our children.  In fact we&#39;d wanted to for ages but kept finding excuses - there&#39;s no other way to put it - plenty of excuses, well, mostly fear?!<br/>\n<br/>\nSo, our first 3 have all been in school. Our eldest &#39;til his 1st year in secondary. <br/>\n<br/>\nAnyhow, having spent ages looking at what would work best for us, unschooling was the most obvious and logical choice.  <br/>\nFitting in the &#39;school&#39; way had never worked for us or for our children - too narrow and without the values we&#39;d spent years instilling. (That&#39;s not meant to sound nasty - I spent years teaching &#39;basic skills&#39; in specialist units)<br/>\n<br/>\nSo, after the most amazingly inspiring evening with Sandra Dodd (thanks to another wonderful unschooler) we began our deschooling.<br/>\n<br/>\nSandra did say to allow one month for each year, so we knew that although things were happier, more relaxed, more like permanent summer holidays(!) we have been awaiting any blips..<br/>\n<br/>\nIn fact I cannot easily explain the extent of the joy that now flows from our children - the willingness to &#39;be&#39; finally returned. Mutual respect. All the &#39;things&#39; that unschoolers are lucky enough never to have lost.<br/>\n<br/>\nAnyhow. Our eldest has asked if he can do a GCSE in Maths. He &#39;WANTS&#39; to do this. He says he wants to see if he can do it.  He &#39;wants&#39; to know if he can achieve. (Which may be because he was left to his own devices at school as he &#39;knew too much&#39; - no work ever marked, nor the same work as his peers and so he feels unrecognised?)<br/>\n<br/>\nNow, my first instinct was to say, &quot;Of course, that option is always there for you, you can do that if you wish. We don&#39;t mind either way, we&#39;d just like you to do what interests you and makes you happy&quot; ( I even went as far to say that I&#39;d happily investigate where it could be done, how much but even if paid for he could still change his mind -  is that wrong?)<br/>\n<br/>\nSince then he&#39;s asked if it&#39;s ok or if it stops him being an unschooler. <br/>\n<br/>\nI tried saying that if any person, unschooler or not, chose to play and play an instrument and then thought it might be nice to try for a formal qualification that that would be fine.  It doesn&#39;t change them as a person. Just that his interest is Maths and not an instrument is ok too(??).<br/>\n<br/>\nHe&#39;s worried that if he wanted to do an exam it stops him being an unschooler and that he couldn&#39;t possibly be a member of any groups.<br/>\n<br/>\nI&#39;ve tried reassuring him that even without taking an exam he&#39;s more than capable and doesn&#39;t need to prove anything to anyone. I said this as we&#39;re sure this exam &#39;want&#39; is because he feels he needs to prove things to family who disapprove of unschooling. (Also the EHE officer was referred to us as Leon was &#39;removed&#39; from school (as they couldn&#39;t cater to his needs without funding) and this officer told him she wanted to see progress from what was detailed in the reports collated from school on all 3 of them)<br/>\n<br/>\nWe just don&#39;t know where to go from here and would love some pointers.<br/>\nWe have to be so careful in what we say because of his black and white/literal interpretation and how he becomes very &#39;stressed&#39; easily.<br/>\n<br/>\nIronically a friend said we should just move! unfortunately that isn&#39;t any option at the minute...so all help gratefully read/listened to.<br/>\n<br/>\nThank you all very much</div>","specialLinks":[]}],"prevTopicId":47193,"nextTopicId":47203}}