{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] restless","postDate":"1138230558","msgId":9654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjUyMDA2MjMwOS4yODQ1OS40M0Q4MDUxRDAwMEVGMUM1MDAwMDZGMkIyMjAwNzM3NDc4MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":9486,"nextInTopic":0,"prevInTime":9653,"nextInTime":9655,"topicId":9486,"numMessagesInTopic":0,"msgSnippet":"... homeschooling then unschooling this year. Before now both girls were in  privet school and daycare pretty much their whole lives. You ve still got quite","messageBody":"<div id=\"ygrps-yiv-959879909\"><blockquote><span title=\"ireply\">&gt;&gt;my two girls Courtney 12 and Tasha 9. We  started<br/>\n </span></blockquote>homeschooling then unschooling this year. Before now both girls were in  privet school and daycare pretty much their whole lives.&gt;&gt;<br/>\n<br/>\nYou&#39;ve still got quite of bit of deschooling to get through I would think. That&#39;s probably what you&#39;re interpreting as restlessness. Your girls have got to get used to managing their own time and even their own thoughts. They&#39;ve gone from a very scheduled life to one that&#39;s more free flowing. That takes some getting used to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Last night she said  she wanted to make a hot air balloon. I asked if she knew how or wanted more info on them. &quot;no I just want to make it. and ride in one&quot; I said I think  they have ride in summer and we could look into that and she was happy with  that.&gt;&gt;<br/>\n<br/>\n </span></blockquote>This sounds great! There are slso websites (I&#39;m sure) to play around with making a smaller version of the hot air balloon. Maybe you could find some fun books  to strew around that include ballooning. The key is to have fun with it and let her pursue these ideas as far as she wants to. It&#39;s NOT going to look like school. She may dabble with hundreds of ideas before she picks one to delve into more deeply.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I asked if she&#39;d be learning about hot air balloons if she rode in one.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Why did you think to ask that? If one of your friends said she was taking a hot air balloon ride, would you ask her the same question? Probably not. It&#39;s more likely that you&#39;d want to know how she decided to pick that activity, or where she was riding, or what she hoped to see and experience.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;Mom I NEVER what to do ANYTHING where I KNOW I&#39;m learning  something.&quot; I just sat a bit blind sided and had no idea what to say to that.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I would just nod my head and tell her &quot;I know what you mean!&quot;  It sounds like she&#39;s rebelling at the idea of being taught or of someone else trying to direct her learning. She doesn&#39;t want anything that even remotely resembles school. That&#39;s okay. That&#39;s good. She wants to own her learning experience. It&#39;ll take time, but she&#39;ll find her passions again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Thank you all for reading any advice would be welcomed...&gt;&gt;<br/>\n<br/>\n </span></blockquote>Relax. Breathe. Bring home some good movies. Make some popcorn and enjoy your time together. Go to places you&#39;ve always wanted to try. Eat food you love. Talk. Laugh. Have fun. Give yourselves time to deschool a bit more because each time you ask about what she&#39;s learning, you&#39;re slowing up the process.<br/>\n<br/>\n<br/>\n--<br/>\n~Mary, unschooling mom to Conor (16) and Casey (11)<br/>\n<br/>\n&quot;Just today I&#39;m going to be utterly present for my children, I&#39;m going to be in their world (not just doing my own thing while they do theirs), I&#39;m going to really hear them, I&#39;m going to prepare myself to be present starting right now.&quot;<br/>\n                            ~Ren Allen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":214661749,"authorName":"houstonjoyce1111@aol.com","from":"houstonjoyce1111@...","profile":"elizabethb1940","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"restless","postDate":"1137874465","msgId":9486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5LjY4MjIxMTc2LjMxMDNmMDIxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":9654,"prevInTime":9485,"nextInTime":9487,"topicId":9486,"numMessagesInTopic":0,"msgSnippet":"Hello all... I ve been lurking for a bit and wanted to say hello and ask  for some insight into some issues our family is having.  There are 4  of us all ","messageBody":"<div id=\"ygrps-yiv-1333816658\">Hello all... I&#39;ve been lurking for a bit and wanted to say hello and ask  for <br/>\nsome insight into some issues our family is having.  There are 4  of us all <br/>\ntogether - me, my husband (second marriage not the biological father  not that <br/>\nthat matters really) and my two girls Courtney 12 and Tasha 9. We  started <br/>\nhomeschooling then unschooling this year. Before now both girls were in  privet <br/>\nschool and daycare pretty much their whole lives. I worked full  time as an <br/>\naccountant up until two years ago and I remarried 11/11/04.  I left my first <br/>\nhusband in July 2002 he was an extremely abusive man and the  girls have not seen <br/>\nhim or spoken to him since 02 and have not desired to. <br/>\n <br/>\nOk to way to much info... sorry...<br/>\n <br/>\nOur issue has really been what to do with our time. And its been a  huge <br/>\nstruggle with Tasha. We have no limits on food or TV or bedtime. She&#39;s  very <br/>\nassured and will tell you most the time what works and what doesn&#39;t. &quot;no  mom I <br/>\ndon&#39;t want to play a game right now but I love you&quot; :) But she is restless  a <br/>\nlot. She gets board or discouraged often. We were on the road most of the  summer <br/>\nso when she got out of school we travailed for several months. (as a side  <br/>\nnote if anyone here is from Louisiana - I think that area is one of the most  <br/>\nbeautiful places I&#39;ve ever seen in my life) <br/>\n <br/>\nNow that we are home things have changed a lot. She never wants to play in  <br/>\nher room anymore - or really be anywhere I&#39;m not or dh or sister isn&#39;t. I  <br/>\ncan&#39;t remember when she slept in her own bed last witch is fine - she&#39;s either  on <br/>\nthe couch or with us. Its just she can&#39;t seem to &quot;get into&quot; anything. Very  <br/>\nseldom will she do one thing besides maybe TV or computer (witch more often <br/>\nseem  a last resort to her) for more then an hour at most. Again its not that its <br/>\nthat  it seems she can&#39;t find anything fun or of interest and she gets board <br/>\nor  frustrated. We have tons of books and crafts and kits and games and <br/>\nanything she  suggest that we can afford and find we try to give to her. It seems <br/>\nI&#39;m always  saying things like - you know I&#39;m here if you&#39;d like to do something <br/>\nor making  suggestions. Its just several times a week we seem to hit these <br/>\nroad blocks and  I have no idea how to handle them.<br/>\nSo here&#39;s a specific example. Earlier in the week she decided to &quot;be like a  <br/>\nmole&quot; she was going to dig a vast system of underground tunnels. <br/>\nShe decided this at about 10pm. We live just outside of Seattle and were in  <br/>\nthe middle of 20 some odd days of &quot;consecutive measurable rainfall&quot; so it was  <br/>\nvery cold and wet.<br/>\nSo the conversation went something like this<br/>\nTasha: Can I dig a tunnel in the back yard<br/>\nMe: yes of course - where are you thinking (and something about please  don&#39;t <br/>\ndig up the garden)<br/>\nT: in the back corner to start<br/>\nm: ok - do you need help or a flashlight its very dark<br/>\nt: no<br/>\nabout a half hour later she comes back dressed to the hilt very wonderfully  <br/>\nin knee pads and bike helmet and other &quot;gear&quot; and &quot;protective wear&quot;.<br/>\nT: I&#39;m going now<br/>\nm: ok let me know if you need something<br/>\nabout 3 minuets later she come in<br/>\nt: its raining and to wet and cold and dark<br/>\nm: maybe you can go at it again tomorrow<br/>\nt: no I can&#39;t <br/>\nm: why<br/>\nt: it illegal<br/>\nm: oh... did you make that law?<br/>\nt: yes<br/>\nm: then you could change it right?<br/>\nt: yes but I don&#39;t want to and now I can&#39;t ever dig a tunnel<br/>\n <br/>\nAt this point because we have had many similar conversations I know  she has <br/>\nshut off. And it is at this moment I have no idea what to do. If I make  <br/>\nsuggests or say much of anything she gets more upset. Sometimes it will last for  <br/>\nan hour sometimes a few days. Its like this restless energy just builds all  <br/>\naround and I&#39;m completely at a loss. I feel we say yes far more then no. But it  <br/>\nis any form of no that can set her off and get her upset. Like she&#39;ll want to <br/>\ngo  to the park at 1am its closed and when I explain that she says &quot;see there <br/>\nis  nothing I can do&quot; <br/>\nNot everyday is like this but it seems like most are at least in some way.  <br/>\nWe talk about it and how if we run into an &quot;I can&#39;t&quot; ( like I can&#39;t drive or  <br/>\nrule the world or build a huge chicken robot) that maybe we can find ways  to <br/>\nturn it into &quot;I can&quot; but she says it will take to much work. <br/>\n <br/>\nOk I&#39;m having a hard time explaining this. I guess I feel the gist is when  <br/>\nshe gets an idea if it doesn&#39;t have immediate pay off then she drops it and <br/>\ngets  upset. Like building a huge robot she has no desire to read or talk or <br/>\nresearch  robots or anything she just wants to build one right this moment. This <br/>\nturns  into &quot; I don&#39;t know how so I can&#39;t or I don&#39;t have the money it might  <br/>\ntake&quot;<br/>\nWhen I suggest lets look at all the things we can do - she says &quot;I  know all <br/>\nI can do mom and I just don&#39;t want to do any of that&quot;. I feel like we  have <br/>\ntried to approach it from many angles - but nothing works. She still seems  <br/>\nrestless most the time.<br/>\nLike I said it isn&#39;t always like that - but I just worry and can&#39;t figure  <br/>\nout how to help her find her passions and interests. When I ask what it is  she <br/>\nwants she will say something like &quot;I&#39;m going to rule the world&quot; but she  won&#39;t <br/>\ntalk about how to go about that or anything. <br/>\n <br/>\nIt is like she has this resistance to any effort or &quot;learning&quot; I know that  <br/>\nsounds horrid but I feel like that. I&#39;m not trying to speak negatively of her  <br/>\njust how I feel about it and what it seems from mpov. Last night she said  she <br/>\nwanted to make a hot air balloon. I asked if she knew how or wanted more  <br/>\ninfo on them. &quot;no I just want to make it. and ride in one&quot; I said I think  they <br/>\nhave ride in summer and we could look into that and she was happy with  that. I <br/>\nasked if she&#39;d be learning about hot air balloons if she rode in one.  &quot;Mom I <br/>\nNEVER what to do ANYTHING where I KNOW I&#39;m learning  something.&quot;<br/>\nI just sat a bit blind sided and had no idea what to say to that. I  think <br/>\nmaybe some of it is just adjusting to not being in school and testing the  <br/>\nboundaries of her world... still I don&#39;t know how to help her. It pains me to  see <br/>\nher frustrated, restless or upset. I feel very overwhelmed and  frustrated. <br/>\n <br/>\nThank you all for reading any advice would be welcomed...,<br/>\n <br/>\njoy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9594,"nextTopicId":9648}}