{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: newbies questions and other stuff","postDate":"1088598080","msgId":1258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNidWI4MCtncjNjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PElORU5MQU5QUENKSEFJUE9NRklPQ0VBQkNIQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+"},"prevInTopic":1247,"nextInTopic":0,"prevInTime":1257,"nextInTime":1259,"topicId":1237,"numMessagesInTopic":0,"msgSnippet":"... him.  This ... (at school ... ****** Great post, Krisula. Reading to Laurie was how she learned to read. We snuggled together on the couch or the bed and I","messageBody":"<div id=\"ygrps-yiv-470473199\"><blockquote><span title=\"ireply\">&gt; Instead of making him read - snuggle on the couch and read to <br/>\n </span></blockquote>him.  This<br/>\n<blockquote><span title=\"ireply\"> &gt; *will* help his reading and will also help him in many other ways <br/>\n </span></blockquote>(at school<br/>\n<blockquote><span title=\"ireply\"> &gt; and otherwise).  It could also be good for family togetherness.<br/>\n&gt; <br/>\n&gt; -Krisula<br/>\n<br/>\n </span></blockquote>****** Great post, Krisula. Reading to Laurie was how she learned to <br/>\nread. We snuggled together on the couch or the bed and I read aloud <br/>\nto her for 3-4 hours a day. She never asked what a word was nor did <br/>\nI point out words to her, yet when I finished reading the Little <br/>\nHouse series, she picked up the first one and started reading. She <br/>\nseldom seemed to be watching the pages yet she knew all the words. <br/>\nShe was seven and I was told it was 6th grade level books. Reading <br/>\nis still her passion. She&#39;s preparing to leave home in a month to <br/>\npursue her PhD and the first thing she said has to go into the Uhaul <br/>\nis her bookcases and books. <br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":154422553,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisulam@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: newbies questions and other stuff","postDate":"1088523271","msgId":1247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElORU5MQU5QUENKSEFJUE9NRklPQ0VBQkNIQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+","inReplyToHeader":"PDEwODg0ODA2NjYuMTc3Ni4xNDEyOC5tMjFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":1244,"nextInTopic":1258,"prevInTime":1246,"nextInTime":1248,"topicId":1237,"numMessagesInTopic":0,"msgSnippet":"... really struggling with reading.  PS was his mom s idea and we ve had to go along.  I ve been doing what I call supplemental homeschooling with him from","messageBody":"<div id=\"ygrps-yiv-1653561439\">Beth Wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m a stepmom to a PSer.  He was not ready for formal education and is<br/>\n </span></blockquote>really struggling with reading.  PS was<br/>\nhis mom&#39;s idea and we&#39;ve had to go along.  I&#39;ve been doing what I call<br/>\n&quot;supplemental homeschooling&quot; with him from about the last quarter of school<br/>\nand now<br/>\ninto the summer.  He&#39;s completely willing to sit down with me and practice<br/>\nreaders if I suggest it but it&#39;s not something he wants to do (meaning he<br/>\nhates it<br/>\nbut I don&#39;t have to force or require him to do it).  He&#39;s also willing to<br/>\npractice a basic handwriting curriculum but doesn&#39;t ask to do it himself.<br/>\nThose<br/>\nare the two main areas he needs help with - handwriting and reading.  So<br/>\nhere&#39;s the question:  Do I let go of trying to help him &quot;keep up&quot; in PS and<br/>\njust<br/>\nlet him be himself while he&#39;s with us (which is half time)?  Or do I try to<br/>\nhelp<br/>\nhim keep up even though it means encouraging him to do things he doesn&#39;t<br/>\nwant<br/>\nto do? &lt;&lt;<br/>\n<br/>\n<br/>\nMaybe you could help him without the activities you describe are frustrating<br/>\nhim.  As was already suggested, it might help him a lot to just not have to<br/>\ndeal with all that stuff when he&#39;s with you guys ;) But, if you&#39;re looking<br/>\nfor ways to help him learn to read and write, and also things you can do<br/>\nthat add to his feelings of personal peace when he&#39;s home with you maybe<br/>\nthis list could give you some ideas.  I&#39;ll start.<br/>\n<br/>\nInstead of making him read - snuggle on the couch and read to him.  This<br/>\n*will* help his reading and will also help him in many other ways (at school<br/>\nand otherwise).  It could also be good for family togetherness.<br/>\n<br/>\nMy ds had a great time playing reading blaster and he loved it so much while<br/>\nhe was into it he didn&#39;t play anything else for a while.  (Unschoolers on<br/>\nthis list will undoubtedly have other video game recommendations that are<br/>\nless overtly edu.)<br/>\n<br/>\nAnything that develops fine motor is bound to help with writing.  Playing<br/>\nball, board games, sewing, painting, building models, you don&#39;t have to sit<br/>\ndown and have him do a handwriting workbook to be helping him.<br/>\n<br/>\nIf you had the privilege of having him all the time you&#39;d do things<br/>\ndifferently of course so why not indulge yourself in that fantasy for a half<br/>\nan hour and think through what it would look like.  Then use the ideas that<br/>\ncome to inform your present predicament?<br/>\n<br/>\nSeems to me the idea that you&#39;re not worried about where his reading and<br/>\nwriting level is at the moment but you just love and cherish him right now<br/>\n&quot;just how he is&quot; is going to be way more valuable to him than the extra<br/>\npractice.  When this stuff passes you want him to come out of it knowing he<br/>\nfelt loved and valued in your home and without all the very destructive<br/>\nfeelings he must have of not measuring up or being bored of forced or<br/>\nwhatever.<br/>\n<br/>\nLove and cherish,<br/>\n<br/>\n-Krisula</div>","specialLinks":[]},{"userId":168046064,"authorName":"Kimberly Fry","from":"Kimberly Fry &lt;kimber_fry@...&gt;","profile":"kimber_fry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] newbies questions and other stuff","postDate":"1088478928","msgId":1244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjI5MDMxNTI4LjQ1ODYxLnFtYWlsQHdlYjYwODAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFjYy4yNDk5YTc1YS4yZTEyMTM3NkBhb2wuY29tPg=="},"prevInTopic":1243,"nextInTopic":1247,"prevInTime":1243,"nextInTime":1245,"topicId":1237,"numMessagesInTopic":0,"msgSnippet":"... readers if I suggest it but it s not something he wants to do (meaning he hates it but I don t have to force or require him to do it).  He s also willing","messageBody":"<div id=\"ygrps-yiv-1350392563\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Bethryco@...\">Bethryco@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;A few troubles... as I&#39;ve mentioned before, I&#39;m a stepmom to a PSer.  He was not ready for formal education and is really struggling with reading.  PS was his mom&#39;s idea and we&#39;ve had to go along.  I&#39;ve been doing what I call &quot;supplemental homeschooling&quot; with him from about the last quarter of school and now into the summer.  He&#39;s completely willing to sit down with me and practice <br/>\n </span></blockquote>readers if I suggest it but it&#39;s not something he wants to do (meaning he hates it but I don&#39;t have to force or require him to do it).  He&#39;s also willing to practice a basic handwriting curriculum but doesn&#39;t ask to do it himself.  Those are the two main areas he needs help with - handwriting and reading.  So here&#39;s the question:  Do I let go of trying to help him &quot;keep up&quot; in PS and just let him be himself while he&#39;s with us (which is half time)?  Or do I try to help him keep up even though it means encouraging him to do things he doesn&#39;t want to do?  I&#39;m really struggling with this.  I feel like since he&#39;s so young, maybe he needs to learn what PS is about and that he needs to keep up to *their* standards (even though I completely disagree with it all) or else it will continue to be a major problem for him.  I feel like letting it go would be doing him a disservice since PS is where he has to be at this point (he&#39;s got a long way to go before legal age to drop out).  KWIM?  Any<br/>\n advice would be appreciated.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI didn&#39;t catch his age, so you may need to adjust this a little bit.  Since he&#39;s in PS, I&#39;d help him as much as possible while making it more fun and games.  <br/>\n<br/>\nPeggy Kaye has a good book called &quot;Games for Writing: Playful Ways to Help Your Child Learn to Write.&quot;  Other ideas for writing: a marker board with dry erase markers, drawing and coloring activities, sewing (burlap -- draw simple picture and outline with yarn using large plastic needle), cutting shapes or even playdough with plastic scissors,  Legos, Kinex, any activities using &#39;fine motor skills&#39; will help.<br/>\n<br/>\nPeggy Kaye also has a book for reading called &quot;Games for Reading: Playful Ways to Hellp Your Child Read.&quot;  Lots of the newer video games have printed dialogue from the characters sometimes as help screens and sometimes just as directions.  Online games are also good.  Neopets (www.neopets.com -- I think) is popular with younger kids and is a fun way for him to practice reading.  <br/>\n<br/>\nHank the Cowdog series of books is funny and a good read aloud.  If you stop at a really good spot he might want to try it on his own.  Might not.  Read aloud to him with him sitting next to you.  You might be surprised to find him following along.  <br/>\n<br/>\nThere are some word magnets that you can both use to write funny sentences on the refrigerator (or get some magnet strips and make your own).<br/>\n<br/>\nAnother great use for the dry erase markers is messages to each other on the bathroom mirror!<br/>\n<br/>\nThat&#39;s all I can think of off the top of my head.  Hope it helps.  <br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail Address AutoComplete - You start. We finish.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] newbies questions and other stuff","postDate":"1088476538","msgId":1243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDFjYy4yNDk5YTc1YS4yZTEyMTM3NkBhb2wuY29tPg=="},"prevInTopic":1240,"nextInTopic":1244,"prevInTime":1242,"nextInTime":1244,"topicId":1237,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2104705398\">&lt;&lt;&lt;&lt;He&#39;s completely willing to sit down with me and practice <br/>\nreaders if I suggest it but it&#39;s not something he wants to do (meaning he<br/>\nhates it but I don&#39;t have to force or require him to do it).  He&#39;s also<br/>\nwilling to practice a basic handwriting curriculum but doesn&#39;t ask to do it<br/>\nhimself.  Those are the two main areas he needs help with - handwriting and<br/>\nreading.  So here&#39;s the question:  Do I let go of trying to help him &quot;keep<br/>\nup&quot; in PS and just let him be himself while he&#39;s with us (which is half<br/>\ntime)?  Or do I try to help him keep up even though it means encouraging him<br/>\nto do things he doesn&#39;t want to do?  I&#39;m really struggling with this.  I<br/>\nfeel like since he&#39;s so young, maybe he needs to learn what PS is about and<br/>\nthat he needs to keep up to *their* standards (even though I completely<br/>\ndisagree with it all) or else it will continue to be a major problem for<br/>\nhim.  I feel like letting it go would be doing him a disservice since PS is<br/>\nwhere he has to be at this point (he&#39;s got a long way to go before legal age<br/>\nto drop out).  KWIM?  Any advice would be appreciated.&gt;&gt;&gt;&gt;<br/>\n<br/>\nTwo thoughts:<br/>\n<br/>\nHave you talked to him about whether &quot;keeping up&quot; and their standards is<br/>\nimportant to him? Maybe he just needs a chance to express his frustration<br/>\n(if any) with public school in a safe place. Has he asked you for &quot;help&quot;?<br/>\nWould the help he really wants be along the lines of maintaining a sense of<br/>\nhis own self-worth when surrounded by the atmosphere of &quot;not good enough&quot; at<br/>\npublic school?<br/>\n<br/>\nIf he is struggling with reading perhaps it is because he is not interested<br/>\nin the subject matter of the books they use - a sign of great discernment.<br/>\nMy suggestion is to help him find out stuff that interests him, and offer<br/>\nbooks about that along with all the other materials. For example,<br/>\nunschooling families have many stories of their children learning to read<br/>\npainlessly from needing to read the instructions to their computer games.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] newbies questions and other stuff","postDate":"1088474360","msgId":1240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVGTUNOQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDFjYy4yNDk5YTc1YS4yZTEyMTM3NkBhb2wuY29tPg=="},"prevInTopic":1237,"nextInTopic":1243,"prevInTime":1239,"nextInTime":1241,"topicId":1237,"numMessagesInTopic":0,"msgSnippet":"... From: Bethryco@aol.com [mailto:Bethryco@aol.com] Sent: Monday, June 28, 2004 8:36 PM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics]","messageBody":"<div id=\"ygrps-yiv-1458038988\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Bethryco@...\">Bethryco@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Bethryco@...\">Bethryco@...</a>]<br/>\nSent: Monday, June 28, 2004 8:36 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] newbies questions and other stuff<br/>\n<br/>\n<br/>\n&quot;Also, I saw someone mention a nonviolent communications list.  Can you<br/>\nshare<br/>\nthat list with me?  Thanks.<br/>\n<br/>\nBeth&quot;<br/>\n<br/>\n<br/>\nHi, Beth,<br/>\n<br/>\nInfo on the NVC parenting list can be found at at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cnvc.org/egroups.htm#parenting\">http://www.cnvc.org/egroups.htm#parenting</a><br/>\n<br/>\nCheers,<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":91534698,"authorName":"Bethryco@aol.com","from":"Bethryco@...","profile":"bethryco","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"newbies questions and other stuff","postDate":"1088469366","msgId":1237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYy4yNDk5YTc1YS4yZTEyMTM3NkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":1240,"prevInTime":1236,"nextInTime":1238,"topicId":1237,"numMessagesInTopic":0,"msgSnippet":"To first answer the questions to newbies (I am one): I came to unschooling (am still coming actually) through attachment parenting.  My ds 17mos. is very","messageBody":"<div id=\"ygrps-yiv-1353263793\">To first answer the questions to newbies (I am one):<br/>\nI came to unschooling (am still coming actually) through attachment <br/>\nparenting.  My ds 17mos. is very strong and I follow his lead in everything so far.  It <br/>\nseems natural that I would continue that with him.  Besides, I don&#39;t think he <br/>\nwould go for it AT ALL if I decided to sit him down someday in the future and <br/>\n&quot;do school.&quot;  I think he&#39;d laugh at me.  <br/>\n <br/>\nI found this list through a local unschooling list (Minnesota).  <br/>\n <br/>\nThis list has been great and so very helpful for me.  I&#39;m coming to <br/>\nunschooling because I know in my heart it&#39;s what I need to do with DS, but was so very <br/>\nhesitant to give up control and trust.  I&#39;m definitely moving in the right <br/>\ndirection.  I hope it will become a lifestyle (I know it will because I can <br/>\nalready feel the changes in my thinking on so many different subjects).  <br/>\n <br/>\nI was also happy to see the posts about coerciveness, chores, etc.  I know <br/>\nI&#39;ve been a bit coercive in the past but have been making an effort with <br/>\nstepson.  We&#39;ve done family meetings where I share my needs related to housework and <br/>\ngetting help and my DH and stepson let me know what they are willing and able <br/>\nto help me with.  So I don&#39;t have to be coercive.  It was amazing when we <br/>\nstarted the meetings.  I didn&#39;t have to &quot;require&quot; anyone to do anything.  They <br/>\nwanted to help me so I wouldn&#39;t be a stressed out mama.  No one likes me when I&#39;m <br/>\nlike that!  ;-)  I&#39;m still working on it, but for the most part all I have to <br/>\ndo is ask and stepson is so willing to be helpful (whether it be around the <br/>\nhouse or with his brother).<br/>\n <br/>\nA few troubles... as I&#39;ve mentioned before, I&#39;m a stepmom to a PSer.  He was <br/>\nnot ready for formal education and is really struggling with reading.  PS was <br/>\nhis mom&#39;s idea and we&#39;ve had to go along.  I&#39;ve been doing what I call <br/>\n&quot;supplemental homeschooling&quot; with him from about the last quarter of school and now <br/>\ninto the summer.  He&#39;s completely willing to sit down with me and practice <br/>\nreaders if I suggest it but it&#39;s not something he wants to do (meaning he hates it <br/>\nbut I don&#39;t have to force or require him to do it).  He&#39;s also willing to <br/>\npractice a basic handwriting curriculum but doesn&#39;t ask to do it himself.  Those <br/>\nare the two main areas he needs help with - handwriting and reading.  So <br/>\nhere&#39;s the question:  Do I let go of trying to help him &quot;keep up&quot; in PS and just <br/>\nlet him be himself while he&#39;s with us (which is half time)?  Or do I try to help <br/>\nhim keep up even though it means encouraging him to do things he doesn&#39;t want <br/>\nto do?  I&#39;m really struggling with this.  I feel like since he&#39;s so young, <br/>\nmaybe he needs to learn what PS is about and that he needs to keep up to *their* <br/>\nstandards (even though I completely disagree with it all) or else it will <br/>\ncontinue to be a major problem for him.  I feel like letting it go would be doing <br/>\nhim a disservice since PS is where he has to be at this point (he&#39;s got a <br/>\nlong way to go before legal age to drop out).  KWIM?  Any advice would be <br/>\nappreciated.<br/>\n <br/>\nAlso, I saw someone mention a nonviolent communications list.  Can you share <br/>\nthat list with me?  Thanks.<br/>\n <br/>\nBeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1239,"nextTopicId":890}}