{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Quick reminder: list guidelines","postDate":"1238096048","msgId":39131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxZ2xiZytqczFwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":39130,"nextInTime":39132,"topicId":39131,"numMessagesInTopic":0,"msgSnippet":"The guidelines are something that goes out to all our new members upon joining. After trying to explain meta-discussion off list, I decided this might be a","messageBody":"<div id=\"ygrps-yiv-1067644237\">The guidelines are something that goes out to all our new members upon joining. <br/>\nAfter trying to explain meta-discussion off list, I decided this might be a good time to remind everyone of the list guidelines, which are included in the standard welcome letter. There seems to be some confusion about the purpose of the list, so I&#39;m also posting the list description:<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nA list designed for those new to the philosophy of unschooling. Ask experienced unschoolers all those niggling questions, and find out how unschooling works in real families.<br/>\n<br/>\nIf you&#39;re familiar with John Holt&#39;s work, but unsure of how to begin or what an unschooling day really looks like, this is a place for you to discuss,question, ponder and become deeply familiar with natural learning and how it affects our entire lives. From parenting issues to learning from the whole wide world and beyond, come explore the issues that unschooling families have dealt with in the past and how to get beyond &quot;school-think&quot; to a joyful unschooling lifestyle!<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\nDear new member,<br/>\n<br/>\nWelcome to the unschoolingbasics list. We look forward to sharing information and ideas with you, but first, we ask you to look over our posting and list guidelines:<br/>\n<br/>\n1) No discussions will be allowed about posts. This is called a &quot;meta-discussion&quot; (discussing the discussion) and posts analyzing another person&#39;s post or posting style will be rejected and the member put on moderation. If there is something about a post that bothers you, stick to discussing the ideas presented, rather than the post itself.<br/>\n<br/>\n2)  Please only post issues/topics that you are open to discussing. If it&#39;s in your message, it&#39;s open to discussion.<br/>\n<br/>\n3)  Try to change the subject line if the topic changes. This will help us all access archives and utilize the discussions more effectively. Also, trim your posts to avoid a message that takes up too much room. It&#39;s difficult to read through them.<br/>\n<br/>\n4) All new members will be moderated in order to prevent spam from reaching the list. We try to remove members quickly, but please be patient. It&#39;s also a chance for you to get a feel for the &quot;culture&quot; of the list.<br/>\n<br/>\n5) This list supports AP styles of parenting, which include no spanking or punitive methods.  If you are interested in learning methods of parenting that do not involve punishment and hitting, this is a wonderful resource. We love helping families find more positive ways of relating.  If you are interested in defending punitive styles, this might not be the best list for you.  Many of us have used these methods in the past and found new and better ways of relating to our children. While you will find support if you&#39;re interested in learning new methods, you will also find some pretty strong opinions if you believe punitive/controlling parenting is best.<br/>\n<br/>\n6) If you post something that the owners or moderators know will be inflammatory, we will offer to post it for you, without your name attached. That way, newer members can read the responses and decide if they want to participate in the discussion without feeling that they&#39;re being personally attacked. Remember, this IS a discussion list and we love to question and discuss!:)<br/>\n<br/>\n7)This is a secular list, meaning that anyone of any religous persuasion (or none at all) is welcome here. We understand that the topic of religion may surface and that is acceptable, but we do not allow preaching or religious debates of any kind. We are a diverse list and we ask all members to simply respect the fact that our list represents many different belief systems. We are all here to discuss unschooling and how it applies in all of our lives.<br/>\n<br/>\nAlso, if you visit the actual site, we are adding information and resources under the &quot;links&quot; section. Book recommendations, blogs and websites will be linked for you to access.<br/>\n<br/>\nFeel free to upload pictures of yourself and family at the &quot;photos&quot; section if you wish. Sometimes it&#39;s nice to have a visual of the folks we talk with daily.<br/>\n<br/>\nOne last thing:<br/>\nIf you have questions, problems, comments or compliments (yeah, we love those:), please feel free to write the list owners~ Kelly Lovejoy or Ren Allen, or the moderators~ Rue Kream or Deb Lewis. If you send an email to &quot;list owners&quot; we will all receive it.<br/>\n<br/>\nSo welcome! Let&#39;s get talking....<br/>\n<br/>\nRen and Kelly</div>","specialLinks":[]}],"prevTopicId":39119,"nextTopicId":39147}}