{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reprogramming my subconscious mind for unschooling","postDate":"1343940966","msgId":48873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2ZXBoNis1dmNlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2ZHU2ZCt0cjFwQGVHcm91cHMuY29tPg=="},"prevInTopic":48872,"nextInTopic":0,"prevInTime":48872,"nextInTime":48874,"topicId":48639,"numMessagesInTopic":0,"msgSnippet":"... I love stories like that - aha moments and snapshots of people learning new things. Sandra s site has a whole page of collected typical day stories - not","messageBody":"<div id=\"ygrps-yiv-1245941431\">&quot;so_much_2_learn&quot; &lt;mrstiffanyjudson@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Well, I learned that my children are great in the kitchen. I learned<br/>\n&gt; that they are wonderful parents (two their two dolls) and excellent<br/>\n&gt; hostesses. I learned that they aren&#39;t looking for a half-hour event or<br/>\n&gt; something spectacular to teach them, just a few special moments with<br/>\n&gt; mom. I learned that they learn from interacting with me.<br/>\n<br/>\n </span></blockquote>I love stories like that - aha moments and snapshots of people learning new things. Sandra&#39;s site has a whole page of collected &quot;typical day&quot; stories - not really typical, more like snapshot moments:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\none of my favorites is Sandra&#39;s own - a nice picture of how those snapshots often rely on a hundred other tiny connections you barely remember:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/day/presidents\">http://sandradodd.com/day/presidents</a><br/>\n<br/>\nwhich makes for a good lead-in to the &quot;how learning works&quot; page, since that&#39;s all about connections:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a><br/>\n<br/>\nRead those for inspiration not as a guage by which to measure your own family ;) Learning is both ubiquitous and miraculous - all of us, kids and adults, are busy making connections all the time. As parents, we get to exert some influence over those connections, but often not in the way we think. We don&#39;t get to choose which connections our kids make and how, but we do get to create an environment of warmth and lightness (or drudgery and dissaffection) to which our kids can&#39;t help but connect. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":482666489,"authorName":"so_much_2_learn","from":"&quot;so_much_2_learn&quot; &lt;mrstiffanyjudson@...&gt;","profile":"so_much_2_learn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reprogramming my subconscious mind for unschooling","postDate":"1343912973","msgId":48872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2ZHU2ZCt0cjFwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyb3BzZStxOWJkQGVHcm91cHMuY29tPg=="},"prevInTopic":48646,"nextInTopic":48873,"prevInTime":48871,"nextInTime":48873,"topicId":48639,"numMessagesInTopic":0,"msgSnippet":" Intellectually and consciously I `get unschooling, I love it, I think it is right for me and my children but.... I m running off old  `expectations of","messageBody":"<div id=\"ygrps-yiv-535233091\">&quot; Intellectually and consciously I `get&#39;<br/>\nunschooling, I love it, I think it is right for me and my children<br/>\nbut.... I&#39;m running off old  `expectations of society&#39; and my own<br/>\ninternal judge.&quot;<br/>\n<br/>\n<br/>\nHi All. WOW! I can not believe how my personal thoughts were summed up<br/>\nin that sentence above, written by a member of this group.<br/>\n<br/>\nI have three children, ages 13, 7, and 2. Since birth I have been trying<br/>\nto find ways to teach them to advance their intelligence. I have<br/>\nstruggled between mimicking what I&#39;ve seen done by other homeschooling<br/>\nfamilies, what is idealized as public schooling, and even the various<br/>\nlayers of unschooling.<br/>\n<br/>\nThere are periods that I unschool, using no schedule, no texts, nothing<br/>\nbut the children&#39;s desire. I see my children&#39;s eyes brighten and we are<br/>\nall learning -together- happily. Those periods are often quickly put<br/>\naside by my own pressuring of &quot;but what if, and when will, and they<br/>\naren&#39;t&quot; that I&#39;ve set up by focusing on other families and where their<br/>\nchildren are at in life. This period is followed by my children<br/>\nresistance to my next &quot;big scheme&quot; to enlighten them and advance them to<br/>\n&quot;their appropriate intelligence level,(based off my focus on other&#39;s)&quot;.<br/>\nThis period, too, is quite short as not one of us has any patience for<br/>\ntext book learning and so we discard them and head back into<br/>\n&quot;unschooling&quot;.<br/>\n<br/>\n<br/>\nFor thirteen years I&#39;ve followed that cycle, the two oldest children<br/>\ngrowing further and further away from their love for learning. I don&#39;t<br/>\nunderstand why they just want to &quot;do school&quot; and be done; I homeschool,<br/>\nwe&#39;re supposed to love to learn, right?<br/>\n<br/>\n<br/>\nComing to this web-group I&#39;ve learned so very much from just this one<br/>\nthread that I&#39;ve read.<br/>\n<br/>\nYesterday was my first step. I put the play kitchen and it&#39;s accessories<br/>\ninto our actual kitchen. As I prepared dinner I discussed aloud with the<br/>\ntwo younger kids what I was doing and they mimicked at their toy area.<br/>\nThey added this and that of their own, deviating away from the route I<br/>\ntook - it was wonderful! They put together a make shift table and sat<br/>\ntwo dolls there to eat what they&#39;d prepared. Though I did not make a<br/>\ndesert last night, they did. As I washed dishes and cleared the<br/>\ncounters, the kids were prepping and serving desert to their two dolls<br/>\n(and a special one for me also) and then they cleaned up their play<br/>\nkitchen.<br/>\n<br/>\nIn the past I&#39;ve been reluctant to play with them in the toy kitchen.<br/>\nI&#39;ve relied on the 7 year old to play with the 2 year old. I assumed<br/>\nthat purchasing the toys was enough involvement. My 7 year old would<br/>\nsometimes play with it; the younger one used it as a climbing post.<br/>\nAfter any use of the kitchen it was a very messy area. It had gotten to<br/>\nthe point that I&#39;d gathered the dishes and food into a bucket and placed<br/>\nit on a high shelf, leaving them with only a few items left to play with<br/>\nin the toy kitchen.<br/>\n<br/>\nLast night I did not have to ask either of them to clean up the toys,<br/>\nthey did so naturally as I cleaned the kitchen.<br/>\n<br/>\nWhat I gathered from this small step was that learning comes with<br/>\nchange. If I continue to open myself to new opportunities, I will<br/>\ncontinue to gain new information. Last night I allowed the children and<br/>\nmyself to experience play in a different room, in a different manner and<br/>\nwe received a different outcome. It was so rewarding to allow change.<br/>\n<br/>\nPreviously I might not have looked at playing in the toy kitchen with<br/>\nthe children as a &quot;learning&quot; moment. There was no text book, no<br/>\nschedule, no previously thought out and prepared lesson, nothing to<br/>\n&quot;test&quot; their understanding and of course no grade system by which to<br/>\njudge their experience; how could it be school.<br/>\n<br/>\nWell, I learned that my children are great in the kitchen. I learned<br/>\nthat they are wonderful parents (two their two dolls) and excellent<br/>\nhostesses. I learned that they aren&#39;t looking for a half-hour event or<br/>\nsomething spectacular to teach them, just a few special moments with<br/>\nmom. I learned that they learn from interacting with me.<br/>\n<br/>\nJust this morning they awoke with a new spirit. They even managed to<br/>\nrope the 13 year old into playing with them, being the puppets; oh<br/>\nboy!!!<br/>\n<br/>\nI appreciate the insight that was used and the comments given. I have<br/>\nlonged for straight forward advice and an outlet in which I can fully<br/>\nreveal myself with out ridicule for having fault, misunderstanding and<br/>\nmis-education.<br/>\n<br/>\nThank you for opening up in the manner that you did.<br/>\n<br/>\nLearning more with each small step,<br/>\n<br/>\nTiffany<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":189329832,"authorName":"irienatural77","from":"&quot;irienatural77&quot; &lt;onelovelivity@...&gt;","profile":"irienatural77","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reprogramming my subconscious mind for unschooling","postDate":"1340241005","msgId":48646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpydHM5ZCttNzY1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzNTRCMkUyLTdENkEtNDU1NS05MzJBLTkxMTBGMEQ2Mjg4Q0B2ZXJpem9uLm5ldD4="},"prevInTopic":48643,"nextInTopic":48872,"prevInTime":48645,"nextInTime":48647,"topicId":48639,"numMessagesInTopic":0,"msgSnippet":"Wow! Thank-you so much for your kind and considered responses - it really helped. Even today was different already, I spent some time reading some of the","messageBody":"<div id=\"ygrps-yiv-1092680950\">Wow! Thank-you so much for your kind and considered responses - it really helped. Even today was different already, I spent some time reading some of the resources last night and our energy flowed much better with my focus shifted. I love the ideas to try small steps, be okay with making mistakes and just keep trying different choices. There are many more ways I can set myself up for successful days (getting more sleep would be one of them) I also know that I have a harsh internal critic and probably need to be much kinder and loving to myself in this process. It was great to share what I was feeling and have the input - thank-you</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reprogramming my subconscious mind for unschooling","postDate":"1340112086","msgId":48643,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNTRCMkUyLTdENkEtNDU1NS05MzJBLTkxMTBGMEQ2Mjg4Q0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpyb3BzZStxOWJkQGVHcm91cHMuY29tPg==","referencesHeader":"PGpyb3BzZStxOWJkQGVHcm91cHMuY29tPg=="},"prevInTopic":48642,"nextInTopic":48646,"prevInTime":48642,"nextInTime":48644,"topicId":48639,"numMessagesInTopic":0,"msgSnippet":"... Make it not your work time. :-) Changing takes not just one change but also all the supporting changes that make it work. Prepare so your work isn t","messageBody":"<div id=\"ygrps-yiv-679781768\">On Jun 18, 2012, at 10:58 PM, irienatural77 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I vacillated between being relaxed and in-the-moment and totally frustrated and wanting them to just get to bed NOW! Evenings are my work time<br/>\n<br/>\n </span></blockquote>Make it not your work time. :-)<br/>\n<br/>\nChanging takes not just one change but also all the supporting changes that make it work. Prepare so your work isn&#39;t hanging over your head in the evening.<br/>\n<br/>\nGet up early. Hire someone or exchange kids with someone on a regular basis so you have a few  hours so you can get it all done in a chunk. Think outside the box for new solutions :-) Perhaps several solutions since one might not get it all.<br/>\n<br/>\nIf you find yourself in a jam more than once, plan ahead, get things out of the way and settled before they become a problem. Be proactive rather than reactive.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I realise that I need to work on grounding myself at a really deep level <br/>\n<br/>\n </span></blockquote>That sounds like setting too lofty of a goal. You&#39;ll feel like you&#39;re failing until you reach that. And with small children, it&#39;s not likely you&#39;ll be able to any time soon.<br/>\n<br/>\nTake small steps. Each time make a choice that&#39;s more connected, more peaceful.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how do I reprogram my subconscious<br/>\n<br/>\n </span></blockquote>There isn&#39;t a short cut to getting rid of baggage. Shift your way of doing and the thinking will follow.<br/>\n<br/>\nAs for books<br/>\n<br/>\nRue Kream&#39;s Parenting a Free Child<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechild.info/\">http://www.freechild.info/</a><br/>\n<br/>\nand one thing you can read right now is:<br/>\n<br/>\nScott Noelle&#39;s Daily Groove<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.enjoyparenting.com/dailygroove\">http://www.enjoyparenting.com/dailygroove</a><br/>\n<br/>\nThey&#39;re short and practical parenting practices you can do each day.<br/>\n<br/>\nYou can also read:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joyfullyrejoycing.com/\">http://www.joyfullyrejoycing.com/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my apologies for being more an asker of questions<br/>\n<br/>\n </span></blockquote>The question askers are as valuable as the answerers. Without people willing to put themselves out there to have their situations analyzed, there wouldn&#39;t be anything to answer! :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reprogramming my subconscious mind for unschooling","postDate":"1340108566","msgId":48642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpycHF1bStsZ3BsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyb3BzZStxOWJkQGVHcm91cHMuY29tPg=="},"prevInTopic":48640,"nextInTopic":48643,"prevInTime":48641,"nextInTime":48643,"topicId":48639,"numMessagesInTopic":0,"msgSnippet":"... *************** If you try to turn unschooling on and off like a faucet, it s not going to work. What happens five minutes before, an hour before, and","messageBody":"<div id=\"ygrps-yiv-1415919631\">&quot;irienatural77&quot; &lt;onelovelivity@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; For instance this eveningmy children didn&#39;t want to go to bed at the usual time so after trying to insist I remembered a post I read yesterday about unschooling and sleep and decided to let them get up and play.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIf you try to turn &quot;unschooling&quot; on and off like a faucet, it&#39;s not going to work. What happens five minutes before, an hour before, and yesterday are all part of the moment - in very real, tangible ways, especially when it&#39;s late and you&#39;re tired and have a lot to do ;) Planning and expectations make a big, big difference. <br/>\n<br/>\nThat&#39;s not so much a conflict between your conscious and subconscious, as a matter of experience and practice. To some extent, for some families, unschooling involves a good bit of lifestyle change as you learn to work around the natural rhythms of your family rather than impose a schedule. Maybe that&#39;s what you mean by subconscious resistance - you&#39;re reluctant to change. That&#39;s normal, but the ability to adapt goes a long way toward making parenting easier - not just unschooling or gentle parenting, but any kind of parenting. Kids change and situations change.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;There are many more things that happen like this and sometimes the simplest decisions seem overwhelming<br/>\n </span></blockquote>**************<br/>\n<br/>\nThis is the single worst thing about parenting reactively - it sets you up to be overwhelmed, and when you&#39;re overwhelmed it&#39;s hard to Learn. Part of the problem, I suspect, is you&#39;re hung up on wanting to do the Right Thing, get the &quot;right answer&quot; if you will. That&#39;s a deschooling thing combined with a sort of modern parenting pressure which has grown out of (imo) a superabundance of schooling. People parent like it&#39;s a test - and as a result don&#39;t learn as much about parenting. <br/>\n<br/>\nLearning involves mistakes. That&#39;s one of the really horrid things about school is that it accustoms you to the idea that &quot;no mistakes&quot; is somehow a good thing. Mistakes are calibration, they&#39;re at least half of how learning works. <br/>\n<br/>\nInstead of trying to reprogram your subconscious, make more choices. Maybe make faster choices - pick something out of your set of options and try it. See if its a mistake. Then you&#39;ll know to cross it off the list for next time! Tada! Life gets easier ;) More often you&#39;ll find that some things help some of the time, but not all the time - that&#39;s okay. The goal isn&#39;t to find perfect solutions, because people and situations change. The goal is to learn what sorts of things help and what sorts of things don&#39;t. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; p.s my apologies for being more an asker of questions that a contributor on this list.<br/>\n </span></blockquote>**************<br/>\n<br/>\nI&#39;m so grateful to all the people who ask questions, I&#39;m a lousy questioner! Questions drive this list and others like it. When no-one asks a question, the list gets very, very quiet.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reprogramming my subconscious mind for unschooling","postDate":"1340093203","msgId":48640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDAwOTMyMDMuMzQ3MzMuWWFob29NYWlsTmVvQHdlYjg3MzA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpyb3BzZStxOWJkQGVHcm91cHMuY29tPg==","referencesHeader":"PGpyb3BzZStxOWJkQGVHcm91cHMuY29tPg=="},"prevInTopic":48639,"nextInTopic":48642,"prevInTime":48639,"nextInTime":48641,"topicId":48639,"numMessagesInTopic":0,"msgSnippet":"Start small and work out. Don t worry too much about your subconscious mind holding your conscious decision making back, instead just work to be kinder and","messageBody":"<div id=\"ygrps-yiv-1030106506\">Start small and work out. Don&#39;t worry too much about your subconscious mind holding your conscious decision making back, instead just work to be kinder and more connected in the moment. Figure out the little things that help you feel connected to your children. If you find yourself reaching in your mind for lists of things to do, pull back, redirect, smell a child&#39;s head, touch a back, kiss a neck, elicit a giggle, whatever it takes to connect to them again. The more times you reconnect, the easier it will get to connect each time. The more times you turn aside from lists the less you will turn away in the first place. It takes practice. It takes time and effort and energy. It isn&#39;t a mental thing, it is more a kinetic thing, it is more a muscle that needs flexing than it is a kind of thinking that once you get it right you will always be right. You will continue to get it wrong. I had to move from distraction to attention just a few minutes ago. But it<br/>\n is much easier for me to know that I need to do it and do it than it was when I first was trying to pay attention to Simon and Linnaea and not the other things that I felt pulled by. <br/>\n<br/>\nDon&#39;t worry too much about what other people will say. Don&#39;t talk about it with other people until you feel sure enough of yourself and your choices to be safe when questioned. Don&#39;t push yourself into a position of explaining something that you can&#39;t yet put into words. Go from the first step to the second and then the third and get to a point of really knowing the path, really understanding how to walk unschooling before you start talking about it. I still don&#39;t talk about it with people who may question my authority and I&#39;m incredibly confident that what I&#39;m doing is what I want to be doing. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":189329832,"authorName":"irienatural77","from":"&quot;irienatural77&quot; &lt;onelovelivity@...&gt;","profile":"irienatural77","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Reprogramming my subconscious mind for unschooling","postDate":"1340074702","msgId":48639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyb3BzZStxOWJkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48640,"prevInTime":48638,"nextInTime":48640,"topicId":48639,"numMessagesInTopic":0,"msgSnippet":"Whilst doing some self-reflection recently I m realizing that there are conflicts between my subconscious and conscious mind with the effect of making many","messageBody":"<div id=\"ygrps-yiv-1135425661\">Whilst doing some self-reflection recently I&#39;m realizing that there are conflicts between my subconscious and conscious mind with the effect of making many goals and desires that I say I want, an unattainable reality  unschooling being one of them. Intellectually and consciously I `get&#39; unschooling, I love it, I think it is right for me and my children but subconsciously I&#39;m running off old subconscious programming and mental chatter filled with the `expectations of society&#39; and my own internal judge. With such a divide, my approach is not consistent and I feel both me and my children are often confused with just what is going on! <br/>\n<br/>\nFor instance this eveningmy children didn&#39;t want to go to bed at the usual time so after trying to insist I remembered a post I read yesterday about unschooling and sleep and decided to let them get up and play. But I vacillated between being relaxed and in-the-moment and totally frustrated and wanting them to just get to bed NOW!  Evenings are my work time and I&#39;m a single Mama at the moment while my partner is away so it seems like there is so much more to do. So I was not being present with them because all I could think of was my huge to-do list and how they were taking up my time. But then I wanted to be more attentive and enjoy the time together/felt guilty because I was letting them stay up but still trying to carry on what I needed to do.  There are many more things that happen like this and sometimes the simplest decisions seem overwhelming because I am weighing them up on an imaginary scale where there are various opinions, approaches, my deepest desires and subconscious ideals about `good&#39; parenting<br/>\n<br/>\n<br/>\nI&#39;ve been fairly unconventional my whole life and make many choices on my parenting path that I know are right for my family and don&#39;t worry about what others may think. However on some level I `m scared to totally trust in the unschooling approach, which I see as connected parenting, with the feeling of constantly defending myself with so many people to tell me I am getting it wrong. Because this life is so different from anything around me I realise that I need to work on grounding myself at a really deep level for our lives to flourish so in essence my question is how do I reprogram my subconscious with regards to whole-life, connected, unschooling parenting? Are there particular books/resources that I should just read until I&#39;m saturated or is there another way? Phew!<br/>\n<br/>\nThanks<br/>\n<br/>\np.s my apologies for being more an asker of questions that a contributor on this list. I am still in quiet awe of all the wisdom I read in the posts that I don&#39;t feel I have yet to make a contribution.</div>","specialLinks":[]}],"prevTopicId":48871,"nextTopicId":48790}}