{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":183936453,"authorName":"Amber Kelley","from":"Amber Kelley &lt;kelleysvt@...&gt;","profile":"kelleysvt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to force a child to eat","postDate":"1131552492","msgId":7639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMTA5MTYwODEyLjc4OTA4LnFtYWlsQHdlYjUzNzA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExMzE1NDk5NzcuNDE4LjQ5NjcubTIwQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7638,"nextInTime":7640,"topicId":7639,"numMessagesInTopic":0,"msgSnippet":"well - in my experience (as a child - not as a parent).  I just learned that my parents would hold out as long as I did.  It was a battle of the wills.  I","messageBody":"<div id=\"ygrps-yiv-1584671805\">well - in my experience (as a child - not as a parent).  I just learned that my parents would hold out as long as I did.  It was a battle of the wills.  I remember having bowls of cereal milk (which I STILL hate to this day!) left in the fridge for my dinner, etc.  I&#39;ve changed my eating habits over the years to adjust to that by either taking less milk or having another bowl of cereal to finish sopping up the sugary sweet milk - YUCK!<br/>\nI don&#39;t generally force foods on my kids.  I DO expect them to *TRY* everything before they say they don&#39;t like it.  But I don&#39;t force them to eat stuff they don&#39;t like.  <br/>\nI *HAVE* (on just two occasions that I can think of... many years ago) made them eat food that they had spoiled by pouring on too much salt, pepper, ketchup, etc.  and the only reason I did it then was because it was becoming a habit (i.e. they were doing the same thing over and over again).  My younger son would oversalt his food and then throw it away and look for something else or ask for another dish of the same.  One day I made him eat a bowl of mac & cheese he had oversalted - I felt really badly about it afterwards.  Now he&#39;s a bit more cautious about pouring on the salt - although he still uses too much for his own good (salt on boxed mac & cheese - YIKES!!!! can you say SODIUM overload!!).  Not my shining moment and not something I&#39;d suggest for others to do.  I suddenly got that &quot;I&#39;m turning into my father&quot; feeling.  <br/>\nNowadays I just occasionally mention that eating too much salt can cause health problems when you get older - but I don&#39;t forbid him or limit him.  We all have our own tastes and I wouldn&#39;t want to be forced to eat some of the foods they like.<br/>\nAnyways - just my perspective.  The only way to *MAKE* a child eat is to intimdate them by outwitting or outlasting them.  In my opinion it&#39;s just not worth the time and frustration.  Of course my kids eat pretty well anyways - they still like soda and sweets and we always have some around, but I try to encourage moderation and offer alternatives (and educate them about healthy eating).  As long as they are getting what they need to live and not having chemical reactions...<br/>\n <br/>\nAmber<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n Yahoo! FareChase - Search multiple travel sites in one click.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":7437,"nextTopicId":7590}}