{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":24,"messages":[{"userId":203987984,"authorName":"Maggy Alonso","from":"&quot;Maggy Alonso&quot; &lt;MaggyAlonso@...&gt;","profile":"earthwurmbaby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1140065374","msgId":10026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNTQwMWM2MzJiNCQ2MjJiMTMxMCQwMjAyYThjMEBNQUdHWTI+","referencesHeader":"PGRzcXNhNCs5NDV0QGVHcm91cHMuY29tPg=="},"prevInTopic":9990,"nextInTopic":0,"prevInTime":10025,"nextInTime":10027,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"Wow, this really hits home with me!  A family in our neighborhood lost a 9 yo son last year to leukemia.  His mother told me once that she wishes his bike","messageBody":"<div id=\"ygrps-yiv-937649976\">Wow, this really hits home with me!  A family in our neighborhood lost a 9 yo son last year to leukemia.  His mother told me once that she wishes his bike would still be outside blocking her car like it used to be.  She wished she hadn&#39;t yelled at him about it......<br/>\n<br/>\nI don&#39;t know Diana but I will keep her and her family in my thoughts and pray for Hannah&#39;s recovery.<br/>\n<br/>\nMaggy<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Ren Allen <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Monday, February 13, 2006 4:05 PM<br/>\n  Subject: [unschoolingbasics] Life without chores<br/>\n<br/>\n<br/>\n  Gawd, that last post I wrote was timely in an awful way.<br/>\n<br/>\n  I just went over to UD and read that Diana Jenner (hahamommy) just<br/>\n  found out that her daughter Hannah has luekemia. They were visiting<br/>\n  Kelli Traaseth&#39;s family when she started getting nosebleeds and<br/>\n  feeling sick.<br/>\n<br/>\n  Anyhow, they just got the diagnoses and the docs want to start chemo. <br/>\n<br/>\n  When you&#39;re picking up after your children this week, just be thankful<br/>\n  you aren&#39;t in the hospital watching your child suffer from chemo<br/>\n  treatment. Ok, I&#39;m crying now. Need to find a way to channel postive<br/>\n  energy to Diana....whom I adore.:)<br/>\n<br/>\n  Ren<br/>\n  learninginfreedom.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS Secondary school education  Graduate school education  Home school education  <br/>\n        Graduate school education online  High school education  Middle school education  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    a..  Visit your group &quot;unschoolingbasics&quot; on the web.<br/>\n      <br/>\n    b..  To unsubscribe from this group, send an email to:<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c..  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":165509949,"authorName":"Andrea","from":"&quot;Andrea&quot; &lt;andrealynn@...&gt;","profile":"tobinsmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Life without chores","postDate":"1139949857","msgId":9990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzIwMWM2MzFhNyQ2ZmNkZGUyMCQwMjAwYThjMEBXdW5qbz4="},"prevInTopic":9984,"nextInTopic":10026,"prevInTime":9989,"nextInTime":9991,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"I believe that we always have choice.  You can choose to let the dishes go. But you have made a bigger choice to honor the value of order in your environment.","messageBody":"<div id=\"ygrps-yiv-120191949\">I believe that we always have choice.  You can choose to let the dishes go.<br/>\nBut you have made a bigger choice to honor the value of order in your<br/>\nenvironment.  Within that bigger choice/goal, is doing the dishes.  For me,<br/>\nthese are some things that have helped me deal with choices regarding<br/>\nchores:<br/>\n<br/>\n <br/>\n<br/>\n*\tFlyLady.com<br/>\n*\tKeep your mind on the bigger goal (and stay aware of thoughts that<br/>\nlead you down the road of energy depleating negativity, and have ready made<br/>\naffirmations that help turn them around.  (i.e.  When my house is in order,<br/>\nI have room in my mind for more creativity.When my dishes are done, I feel<br/>\ngreat.When I am accomplishing my goals, I know that I can do anything I set<br/>\nout to do.you find what works for you.)<br/>\n*\tKnow that you are setting a great example.  When your kids see how<br/>\nyou feel when you&#39;ve accomplished something that might not have been so fun<br/>\nat the time, but ultimately helps you achieve your ideal, they are inspired<br/>\nand what a great role model you become.  When I am in this positive space,<br/>\nmy son often is inspired to join in on his own.  Nobody gets nagged or<br/>\ncoerced, and we both have amazing feelings inside!  <br/>\n*\tTry to focus less on words like maid and resentment, and start doing<br/>\nthese things for you and your own piece of mind.  This is your value.  Some<br/>\npeople are perfectly fine with a messy house, and you might be living with<br/>\nthem.It&#39;s so tricky when values clash.Non-Violent Communication has really<br/>\nhelped me in my communication about these very issues (You can google it).  <br/>\n<br/>\n <br/>\n<br/>\nHope this helps!<br/>\n<br/>\nAndrea<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Life without chores","postDate":"1139922176","msgId":9984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMi40ZDAxYzQxYi4zMTIzMmYwMEB3bWNvbm5lY3QuY29tPg=="},"prevInTopic":9983,"nextInTopic":9990,"prevInTime":9983,"nextInTime":9985,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"... and ... so much the dishes per se but that you need a clean and serene place, pick a place and clean it, put some nice candles there, maybe some light","messageBody":"<div id=\"ygrps-yiv-1957287147\">--- In  &quot;Lisa H&quot; &lt;Lmanathome@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; OK, so what if you don&#39;t want to......<br/>\n </span></blockquote>and<br/>\n---In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>,<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:soggyboysmom@...\">soggyboysmom@...</a> (Deb) wrote:&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;And, if just needing a tidy spot is what you&#39;re needing - it&#39;s not <br/>\n </span></blockquote>so much the dishes per se but that you need a clean and serene <br/>\nplace, pick a place and clean it, put some nice candles there, maybe <br/>\nsome light reading and a comfy chair or cushion, maybe a portable <br/>\nradio or CD player, and when you feel out of sorts and overwhelmed, <br/>\ngo there. Yeah, the dishes and all will still be there in 20 minutes <br/>\nor 30 minutes, but you&#39;ll have recharged your own self.<br/>\n--Deb&lt;&lt;&lt;<br/>\n<br/>\n******I couldn&#39;t agree with you more Deb. We have a loveseat type couch (I <br/>\nthink it&#39;s called a setae?? :o) at the table in our dinning rm. with a throw and <br/>\nlots of BIG pillows on it to relax and get comfy on.  I sit at it A LOT to <br/>\nread, and veg. There is nothing like lighting some candles, putting on some <br/>\nBilly Holiday, getting a hot cup of tea or a glass of wine, a good book and <br/>\ncuddling up there for some peaceful time. <br/>\n<br/>\nThe kids LOVE it too! So does company, whoever comes for dinner always calls <br/>\n&quot;dibs&quot; on the couch!<br/>\n<br/>\nNancy<br/>\ncheck out my art at!<br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.picturetrail.com/nancysart&quot;\">http://www.picturetrail.com/nancysart&quot;</a>&gt;PictureTrail&lt;/A&gt;  or <br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://carverscompanion.com/Ezine/Vol9Issue3/KMenendez/KMenendez2.html&quot;\">http://carverscompanion.com/Ezine/Vol9Issue3/KMenendez/KMenendez2.html&quot;</a>&gt;Woodcarver On-Line Magazine, Pyrography News, No. 34&lt;/A&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Life without chores","postDate":"1139915129","msgId":9983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzc2RocStsbWh2QGVHcm91cHMuY29tPg=="},"prevInTopic":9982,"nextInTopic":9984,"prevInTime":9982,"nextInTime":9984,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"there will be time for that...for me...my dds are only this age once ...but this idea is not sitting well right now and the antithesis of this thought is not","messageBody":"<div id=\"ygrps-yiv-1835531944\">&quot;&quot;there will be time for that...for me...my dds are only this age<br/>\nonce&quot;...but this idea is not sitting well right now and the antithesis<br/>\nof this thought is not serving me well either.  I am feeling selfish<br/>\nin having desires outside of the needs of my family.&quot;<br/>\n<br/>\nAh, but maybe some of that discontent is your heart&#39;s voice speaking<br/>\nto you on a very deep level. Funny...I just finished up a very short<br/>\narticle on the call to creativity and parenting. On the surface, these<br/>\nworlds seem to collide, but with some examination we find that they<br/>\nare connected and parenting is actually fodder for creative expression.<br/>\n<br/>\nIt takes quite a bit of mindfulness and creativity to swirl OUR<br/>\ninterests and passions into the mix of parenting at first, but with<br/>\ntime, you&#39;ll find a natural ebb and flow to it all. I don&#39;t think<br/>\nignoring our passions helps us be better parents...in fact, we<br/>\nwithhold the very best parts of ourselves by doing that.<br/>\n<br/>\nIt doesn&#39;t mean we can pick up every interest without real life<br/>\nlimitations. BUT, there are ways to pursue the things you love, and<br/>\nnot cheat the kids....truly. Maybe you could post about some of the<br/>\nthings you feel you&#39;re ignoring, some of your inner urgings that<br/>\nyou&#39;re having a difficult time honoring. Only post if you feel<br/>\ncomfortable with that. I&#39;m just thinking some creative brainstorming<br/>\non ways to pursue those inner stirrings, while meeting the needs of<br/>\nyoung children, might help you see more possibilties. <br/>\n<br/>\nThat may very well help take care of some of those resentments about<br/>\nthe house too?  And maybe it&#39;s time for a good heart to heart with<br/>\nyour partner, who seems to be heaping on extra feelings of inadequacy<br/>\nby being nasty over the cleanliness? I know my dh needs a reminder<br/>\nevery so often, that the messes aren&#39;t worth being grumpy over.:)<br/>\nI try to do it sweetly, but sometimes I just let him know he&#39;s making<br/>\nme feel stepped on. We truly don&#39;t SEE the stuff he does...totally<br/>\ndifferent levels of comfort with mess.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139902353","msgId":9981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNi1EQVYxNjIzMEM3RTBDOTlDQUQ2QzEwMERGRDEwNjBAcGh4LmdibD4=","referencesHeader":"PGRzcXJnYStuZW41QGVHcm91cHMuY29tPg=="},"prevInTopic":9980,"nextInTopic":9982,"prevInTime":9980,"nextInTime":9982,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1117290026\">&lt;&lt;  If I want to shift perspective, I use death as my cornerstone. Maybe<br/>\nit sounds strange, but it doesn&#39;t bother me to think about death...I<br/>\nponder serious issues a lot.  &gt;&gt;<br/>\n<br/>\nNot strange at all.  This has been a benchmark for me as well.  There was a time that i felt perfectly at peace should i die.  I felt fulfilled in my life.  Now i am feeling like there&#39;s a part of me that hasn&#39;t/isn&#39;t having a chance to be realized and i want that part to have a chance to live before dying.  this is part of the rising resentment.  not being content with the moment, the now.  How does the song go...&quot;it&#39;s not about having what you want but wanting what you have.&quot;  <br/>\n<br/>\nPerhaps my restlessness is connected to the car accident this past fall.  i feel the vulnerability of life and that while i am still here and there is still more i want to do - yes accomplish...outside of and beyond my children.  I&#39;ve always said &quot;there will be time for that...for me...my dds are only this age once&quot;...but this idea is not sitting well right now and the antithesis of this thought is not serving me well either.  I am feeling selfish in having desires outside of the needs of my family.  <br/>\n<br/>\n&lt;&lt;If my child was gone next week, what would really matter? The mess I&#39;m<br/>\ncleaning up, or the atmosphere of my home? If *I* was gone tomorrow,<br/>\nwhat would matter?  Thinking about these things helps me shift<br/>\nperspective very quickly. I&#39;ve lost enough friends and loved ones in<br/>\nlife to really value LIFE!&gt;&gt;<br/>\n<br/>\nThank you for this reminder.  I really don&#39;t want my kids to remember me as a neurotic angry parent.<br/>\n<br/>\n&lt;&lt;I think it&#39;s easy to get bogged down in that resentment we&#39;ve been<br/>\ntrained with. But that&#39;s exactly what it is...programming. We&#39;ve been<br/>\ntaught that chores are something to grumble about, rather than be<br/>\nthankful for. We&#39;ve been taught negative feelings in association with<br/>\nthose tasks. It&#39;s not necessary though.&gt;&gt;<br/>\n<br/>\nOh so true.  My mothers generation were women who revelled in the opportunities outside of the home - to be more than &quot;just a housewife.&quot;  Totally diminishing the value of sahm&#39;s. This has been an off and on again struggle for me since my first dd was born and chose to stay home.  My mom once said to me &quot;you have to do something other than being home with your child(ren), just to stay interesting.&quot;  <br/>\n<br/>\n&lt;&lt;I talked about this in my &quot;unschooling a tribe&quot; talk in St. Louis.&gt;&gt;<br/>\n<br/>\nOh Ren, your talk was so inspirational.  I came away wanting to have another child.  But i am too far removed from the spirit of that talk and back to feeling very limited in my ability to be at peace with the choas of childrearing to consider having a third.<br/>\n<br/>\n&lt;&lt; I can report<br/>\nthat the intitial feeling of revulsion is not all that bad, and if I<br/>\nstay with it, breathe with it, and permit myself to just feel it, it<br/>\nactually goes away within a second or two.  I have also noticed that<br/>\nit is the sense of betrayal, of being thwarted in my wishes, that<br/>\nmakes me mad much more htan the cat food itself.  So, I discover, it&#39;s<br/>\nnot really the cat food by itself that is the source of my anger. <br/>\nIt&#39;s that I&#39;m not feeling listened to and respected.  Very different<br/>\nfrom the cat food. Aha!&quot;<br/>\n<br/>\nRecognizing where the anger is really stemming from is hugely helpful.<br/>\nIt takes a lot of self examination and taking responsiblity for our<br/>\nown emotions. &gt;&gt;<br/>\n<br/>\nYes yes and yes.  Thank you so much Ren for sharing this. <br/>\n<br/>\n&lt;&lt;Chores would be absolutely minimal if we lived<br/>\nalone...but that&#39;s not the life we chose, and we&#39;d be pretty torn up<br/>\nif that&#39;s what happened to us. Household tasks are a sign of wealth.<br/>\nYou aren&#39;t living in a tent, freezing in the mountains of Pakistan.<br/>\nYou aren&#39;t being shot at every day, you have food and shelter. Having<br/>\nthe good things means a certain amount of work to go with it...enjoy<br/>\nthe good life!!:)&gt;&gt;<br/>\n<br/>\nAh the attitude of gratitude reminder.<br/>\n<br/>\nThat is why i need these lists.  As hard as it is to admit, sometimes I just don&#39;t feel very good at living life the way i want to live life.   <br/>\n<br/>\nWith much gratitude...thanks for the compassionate responses and gentle reminders from everyone.<br/>\nLisa.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196090915,"authorName":"jnjstau@direcway.com","from":"jnjstau@...","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139886764","msgId":9980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0Zjk3Nzk1NGY4ZjU2LjU0ZjhmNTY1NGY5Nzc5QGRpcmVjd2F5LmNvbT4="},"prevInTopic":9979,"nextInTopic":9981,"prevInTime":9979,"nextInTime":9981,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":" This is such a major thing that I wanted to post it again.  I m by no means a clean freak but I do like","messageBody":"<div id=\"ygrps-yiv-902683968\">&lt;&lt;It&#39;s that I&#39;m not feeling listened to and respected&gt;&gt;<br/>\n<br/>\nThis is such a major thing that I wanted to post it again.  I&#39;m by no means a clean freak but I do like a bit of order in the house (not sticking to the kitchen floor, being able to at least see the carpet, being able to find the ringing phone).  We stay real busy doing things we love and it tends to fall to me to stay on top of &quot;chores&quot; and &quot;schedules&quot; (like when to go to the feed store, sign up dates for activities, etc.)<br/>\n<br/>\nIt is easy to get overwhelmed and have things fall through the cracks.  I used to get angry, thinking &quot;Can&#39;t they see?  Surely they know?  How dare they ignore....&quot;  Eventually, I realized that *I* wasn&#39;t communicating my needs to my family.  Of course, I wanted everyone to be happy and I would get so busy helping everyone that I would start to slip on the things *I* needed, then I would be angry that nobody could read my mind and know exactly what I needed.<br/>\n<br/>\nI came to realize that while I &quot;get&quot; reading the needs of other family members, jumping in to help out, seeing what needs to be done....the rest of the family just doesn&#39;t &quot;get it&quot;.  Reading those needs is my gift to my family.  They each have many gifts for me, but just knowing my needs isn&#39;t one of them.  So I have become more mindful of myself, of my inner state....I still love helping my family but when I am reaching &quot;melt down&quot;, I put the brakes on, verbalize the problem and ask for help.  And you know what?  99% of the time I get it.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nDate: Monday, February 13, 2006 2:51 pm<br/>\nSubject: [unschoolingbasics] Life without chores<br/>\n<br/>\n&gt; &quot; But i am currently in a state of mind where i want my house in order<br/>\n&gt; and resent the hell out of feeling like the maid and cook for everyone<br/>\n&gt; else. &quot;<br/>\n&gt; <br/>\n&gt; Just see it as a choice. You&#39;re choosing to feel like a maid and<br/>\n&gt; cook...it&#39;s really that simple. Nobody is making you do those<br/>\n&gt; activities, you could stop today. You chose a family, you choose to<br/>\n&gt; help them get nourishment and have a nice environment, they aren&#39;t<br/>\n&gt; forcing it upon you.<br/>\n&gt; You desire more order than others in the family unit, so you provide<br/>\n&gt; that order.:)<br/>\n&gt; <br/>\n&gt; It&#39;s really all choice.<br/>\n&gt; If I want to shift perspective, I use death as my cornerstone. Maybe<br/>\n&gt; it sounds strange, but it doesn&#39;t bother me to think about death...I<br/>\n&gt; ponder serious issues a lot.  <br/>\n&gt; If my child was gone next week, what would really matter? The mess I&#39;m<br/>\n&gt; cleaning up, or the atmosphere of my home? If *I* was gone tomorrow,<br/>\n&gt; what would matter?  Thinking about these things helps me shift<br/>\n&gt; perspective very quickly. I&#39;ve lost enough friends and loved ones in<br/>\n&gt; life to really value LIFE!<br/>\n&gt; <br/>\n&gt; I think it&#39;s easy to get bogged down in that resentment we&#39;ve been<br/>\n&gt; trained with. But that&#39;s exactly what it is...programming. We&#39;ve been<br/>\n&gt; taught that chores are something to grumble about, rather than be<br/>\n&gt; thankful for. We&#39;ve been taught negative feelings in association with<br/>\n&gt; those tasks. It&#39;s not necessary though.<br/>\n&gt; <br/>\n&gt; I&#39;m trying hard to end that pattern in this family!  Just because<br/>\n&gt; chores had a negative connotation for me, doesn&#39;t mean they have <br/>\n&gt; to be<br/>\n&gt; for my children. Nor do I have to choose to continue in that <br/>\n&gt; paradiagm.<br/>\n&gt; I talked about this in my &quot;unschooling a tribe&quot; talk in St. Louis.<br/>\n&gt; Chores seem to come up a lot at the lists, but especially for big<br/>\n&gt; families. I read an excerpt that I absolutely LOVE, from &quot;Wherever you<br/>\n&gt; go, there you are&quot; by Jon Kabatt-Zin:<br/>\n&gt; <br/>\n&gt; He talks about the feelings of anger that cat food dishes in the sink<br/>\n&gt; had caused for him and how he started dealing with those feelings,<br/>\n&gt; that often led to an irritated discussion or other methods of<br/>\n&gt; funneling his frustration:<br/>\n&gt; <br/>\n&gt; &quot;I have taken to experimenting with my reactions at the kitchen sink<br/>\n&gt; by watching them very closely without acting on them.  I can report<br/>\n&gt; that the intitial feeling of revulsion is not all that bad, and if I<br/>\n&gt; stay with it, breathe with it, and permit myself to just feel it, it<br/>\n&gt; actually goes away within a second or two.  I have also noticed that<br/>\n&gt; it is the sense of betrayal, of being thwarted in my wishes, that<br/>\n&gt; makes me mad much more htan the cat food itself.  So, I discover, it&#39;s<br/>\n&gt; not really the cat food by itself that is the source of my anger. <br/>\n&gt; It&#39;s that I&#39;m not feeling listened to and respected.  Very different<br/>\n&gt; from the cat food. Aha!&quot;<br/>\n&gt; <br/>\n&gt; Recognizing where the anger is really stemming from is hugely helpful.<br/>\n&gt; It takes a lot of self examination and taking responsiblity for our<br/>\n&gt; own emotions. Chores would be absolutely minimal if we lived<br/>\n&gt; alone...but that&#39;s not the life we chose, and we&#39;d be pretty torn up<br/>\n&gt; if that&#39;s what happened to us. Household tasks are a sign of wealth.<br/>\n&gt; You aren&#39;t living in a tent, freezing in the mountains of Pakistan.<br/>\n&gt; You aren&#39;t being shot at every day, you have food and shelter. Having<br/>\n&gt; the good things means a certain amount of work to go with it...enjoy<br/>\n&gt; the good life!!:)<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":93680970,"authorName":"mybrowning@aol.com","from":"mybrowning@...","profile":"sbfreekids2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139885575","msgId":9982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMi4xMmY5OTkxOC4zMTIyYTAwN0Bhb2wuY29tPg=="},"prevInTopic":9981,"nextInTopic":9983,"prevInTime":9981,"nextInTime":9983,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/13/2006 8:10:20 AM Pacific Standard Time, kbcdlovejo@aol.com writes: They re  not chores. They re what you do because you *want* to. Hi,","messageBody":"<div id=\"ygrps-yiv-438379172\">In a message dated 2/13/2006 8:10:20 AM Pacific Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\nThey&#39;re  not chores. They&#39;re what you do because you *want* to.<br/>\n<br/>\n<br/>\nHi, I&#39;m new here and I want to say that of course we always  choose our <br/>\nperception of everything at every opportunity.  Our  children also have the choice <br/>\nto make this shift too!  It&#39;s as easy or  challenging for them as it is for <br/>\nus.   They have the option to view  chores as drudgery or choose to enjoy caring <br/>\nfor their things and contributing  to the family responsibilities as well.<br/>\nMichelle<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139883527","msgId":9979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCMDZCMERELTMyQUUtNDg0NS1CNjk1LUI0QjQ1OTQzODI5Q0BkaWVyYXVlci5uZXQ+","inReplyToHeader":"PEJBWTEwNi1EQVY0RTk4QTA5NzM5RkVDOTBDRjc1RUJEMTA3MEBwaHguZ2JsPg==","referencesHeader":"PGRhLjM1OTAzZjI0LjMxMTVmZWI0QHdtY29ubmVjdC5jb20+IDw4QzdGRUNFQUFEMDE4NEItOTY4LTExOTQxQG1ibGstZDQ0LnN5c29wcy5hb2wuY29tPiA8QkFZMTA2LURBVjRFOThBMDk3MzlGRUM5MENGNzVFQkQxMDcwQHBoeC5nYmw+"},"prevInTopic":9977,"nextInTopic":9980,"prevInTime":9978,"nextInTime":9980,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"... I have been there, Lisa, and I hope you can hear my compassion! It has been years of struggle for me. I still don t like doing housework, but I m in a","messageBody":"<div id=\"ygrps-yiv-1992033915\">On Feb 13, 2006, at 3:02 PM, Lisa H wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OK, so what if you don&#39;t want to.  There was a time that i could  <br/>\n&gt; leave dishes in the sink and a mess around the house until i wanted  <br/>\n&gt; to do the task.  But i am currently in a state of mind where i want  <br/>\n&gt; my house in order and resent the hell out of feeling like the maid  <br/>\n&gt; and cook for everyone else.<br/>\n<br/>\n </span></blockquote>I have been there, Lisa, and I hope you can hear my compassion! It  <br/>\nhas been years of struggle for me. I still don&#39;t like doing  <br/>\nhousework, but I&#39;m in a really good routine with it now (God Bless  <br/>\nFlylady, All Hail Flylady). What I finally had to do was affirm the  <br/>\nfirst half of the statement you made (for me, not for you!) --&quot;I want  <br/>\nmy house in order&quot; and try to let go of the second half of it.<br/>\n<br/>\nI love Flylady b/c except for dishes, her system takes me AT MOST an  <br/>\nhour a day, most days less than half an hour. And it really has  <br/>\nhelped make the house feel cleaner and more orderly<br/>\n<br/>\n. And the change in my attitude has helped my family--when the house  <br/>\nwas feeling overwhelmingly chaotic to me a few months ago, I cleared  <br/>\noff the mantel and then asked everyone not to put anything on it  <br/>\nagain, so that I could have one clear space in the house. After some  <br/>\nnegotiation, we agreed that my 4 y.o. could put up to two treasures  <br/>\nin &quot;hiding places&quot; behind the clock and pictures up there. My partner  <br/>\nagreed that he would not set anything there at all (he tends to set  <br/>\nthings down and leave them literally for years sometimes). Because I  <br/>\nasked nicely--not &quot;I work and I work and I work and this place is a  <br/>\npit and G-dDAMN it the next person who sets something on the mantel  <br/>\nis going to lose it!&quot; but &quot;I would love to have one clear space in  <br/>\nthe house to rest my eyes. Will you help me?&quot;--they responded really  <br/>\nwell.<br/>\n<br/>\nOne important piece for me about letting go of the resentment was  <br/>\nflipping things around in my mind and realizing that, by expecting  <br/>\nthem all to live up to my standards and resenting them when they  <br/>\ndidn&#39;t, I was giving up all my power over my environment. I wanted an  <br/>\norderly house and because I could not control the behavior of my  <br/>\nfamily members, I couldn&#39;t have it. When I start to feel resentful  <br/>\nthat I&#39;m the one picking up and running the vacuum and washing the  <br/>\ndishes for the third time today--I remind myself that I am exercising  <br/>\nmy power over my environment, to create an orderly home for myself,  <br/>\nand that this is a gift for myself. A gift I give me.<br/>\n<br/>\nThe outside can look the same--I&#39;m still the one running the vacuum!  <br/>\nBut inside, instead of seething, I&#39;m thinking, &quot;I have the power to  <br/>\nmake my house the house I want it to be, a house I can be comfortable  <br/>\nin.&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And all the while, my beautiful family yesterday served me  <br/>\n&gt; breakfast in bed in appreciation of all i do - boy do i feel like a  <br/>\n&gt; jerk.<br/>\n<br/>\n </span></blockquote>You&#39;re not a jerk! Breakfast in bed is such a nice thing for them to  <br/>\ndo for you. I will say that the less cranky and resentful I have  <br/>\ngotten about the housework, the easier it gets for my family to give  <br/>\nme these kinds of gifts. Just the other day, my 4 y.o. suddenly piped  <br/>\nup as he was working on a project, &quot;Mama, as soon as I&#39;m done here  <br/>\nI&#39;ll be able to help you with your chores.&quot; And he did.<br/>\n<br/>\nGood luck, Lisa. I think most of us have been where you&#39;re at...at  <br/>\nleast, I know I have. I don&#39;t visit there as often as I used to, but  <br/>\nI do still take the occasional vacation there! I just get out of it  <br/>\nquicker now.<br/>\n<br/>\nSu<br/>\n<br/>\np.s. A practical tip that saved our relationship back pre-kids but  <br/>\nwhen my partner and I were sharing a house with a friend who is Chaos  <br/>\nPersonified was to put a basket for each family member in the corner  <br/>\nof the living room. Anything that was in my way, I could just toss  <br/>\ninto the person&#39;s basket. This made it easy for me to clean up the  <br/>\ncommon space for my own comfort, without making me responsible for  <br/>\ndealing with their stuff. And our agreement was that if the baskets  <br/>\ngot too full to put more stuff in, I could give 48 hour notice to  <br/>\nhave it cleaned out, or I could bag the stuff up and trash it (I  <br/>\nwouldn&#39;t do that with kids; and I never had to do it with the grown- <br/>\nups, either, though I did have to give 48 warnings once or twice). It  <br/>\nseems like a simple thing but it was a breakthrough for us that made  <br/>\na big difference.<br/>\n<br/>\nMy version of this now is that if there are a lot of toys all over  <br/>\nthe living room, I don&#39;t try to sort them into their appropriate  <br/>\nstorage places. I just work from one end of the room to the other and  <br/>\nthrow them all into a laundry basket. It gets the room clean enough  <br/>\nto do the sweeping in just a couple of minutes, and I can either sort  <br/>\nthe stuff out later when I&#39;m feeling like it, or ask my partner to  <br/>\nwork on it.</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139865169","msgId":9977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYxMDkxRjAwN0IyM0YxNDIzRTBGMTI5RDMwNzBAcGh4LmdibD4=","referencesHeader":"PEJBWTEwNi1EQVY0RTk4QTA5NzM5RkVDOTBDRjc1RUJEMTA3MEBwaHguZ2JsPg=="},"prevInTopic":9976,"nextInTopic":9979,"prevInTime":9976,"nextInTime":9978,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"I ve been feeling very much the same way lately.  chores aren t my choice..\n they re a have to .  i m fine with not doing them until i want to... but\nmy DH","messageBody":"<div id=\"ygrps-yiv-392987762\">I&#39;ve been feeling very much the same way lately.  chores aren&#39;t my choice..<br/>\n they&#39;re a &quot;have to&quot;.  i&#39;m fine with not doing them until i want to... but<br/>\nmy DH isn&#39;t happy if i don&#39;t do them and he is very nasty to me about it...<br/>\neven though i&#39;m the one who makes the money to pay the bills.  hmmm....<br/>\nanyhow.... i guess this will work it&#39;s way out, one way or another\r<br/>\n\r<br/>\nLesa\r<br/>\n \r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: Lisa H\r<br/>\nDate: 02/13/06 13:55:13\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: Re: [unschoolingbasics] Life without chores\r<br/>\n \r<br/>\n\r<br/>\n\r<br/>\nOK, so what if you don&#39;t want to.  There was a time that i could leave<br/>\ndishes in the sink and a mess around the house until i wanted to do the task<br/>\n  But i am currently in a state of mind where i want my house in order and<br/>\nresent the hell out of feeling like the maid and cook for everyone else. <br/>\nNeedless to say i am not liking myself much these days because i am<br/>\nexhibiting such anger. I am feeling this overwhelming need for order in my<br/>\nenvironment. And thus this is taking precedence over doing other things with<br/>\nmy kids.  Along with the feeling that whatever i am doing it just doesn&#39;t<br/>\nseem like enough.  Something is very off kilter here...wonder if it&#39;s<br/>\nhormonal.\r<br/>\n\r<br/>\nAnd all the while, my beautiful family yesterday served me breakfast in bed<br/>\nin appreciation of all i do - boy do i feel like a jerk.\r<br/>\n\r<br/>\nI could use some compassionate replies.\r<br/>\n\r<br/>\nLisa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Life without chores","postDate":"1139864708","msgId":9976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzcXNhNCs5NDV0QGVHcm91cHMuY29tPg=="},"prevInTopic":9975,"nextInTopic":9977,"prevInTime":9975,"nextInTime":9977,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"Gawd, that last post I wrote was timely in an awful way. I just went over to UD and read that Diana Jenner (hahamommy) just found out that her daughter Hannah","messageBody":"<div id=\"ygrps-yiv-611611114\">Gawd, that last post I wrote was timely in an awful way.<br/>\n<br/>\nI just went over to UD and read that Diana Jenner (hahamommy) just<br/>\nfound out that her daughter Hannah has luekemia. They were visiting<br/>\nKelli Traaseth&#39;s family when she started getting nosebleeds and<br/>\nfeeling sick.<br/>\n<br/>\nAnyhow, they just got the diagnoses and the docs want to start chemo. <br/>\n<br/>\nWhen you&#39;re picking up after your children this week, just be thankful<br/>\nyou aren&#39;t in the hospital watching your child suffer from chemo<br/>\ntreatment. Ok, I&#39;m crying now. Need to find a way to channel postive<br/>\nenergy to Diana....whom I adore.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Life without chores","postDate":"1139863882","msgId":9975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzcXJnYStuZW41QGVHcm91cHMuY29tPg=="},"prevInTopic":9974,"nextInTopic":9976,"prevInTime":9974,"nextInTime":9976,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":" But i am currently in a state of mind where i want my house in order and resent the hell out of feeling like the maid and cook for everyone else.  Just see","messageBody":"<div id=\"ygrps-yiv-2134743840\">&quot; But i am currently in a state of mind where i want my house in order<br/>\nand resent the hell out of feeling like the maid and cook for everyone<br/>\nelse. &quot;<br/>\n<br/>\nJust see it as a choice. You&#39;re choosing to feel like a maid and<br/>\ncook...it&#39;s really that simple. Nobody is making you do those<br/>\nactivities, you could stop today. You chose a family, you choose to<br/>\nhelp them get nourishment and have a nice environment, they aren&#39;t<br/>\nforcing it upon you.<br/>\nYou desire more order than others in the family unit, so you provide<br/>\nthat order.:)<br/>\n<br/>\nIt&#39;s really all choice.<br/>\nIf I want to shift perspective, I use death as my cornerstone. Maybe<br/>\nit sounds strange, but it doesn&#39;t bother me to think about death...I<br/>\nponder serious issues a lot.  <br/>\nIf my child was gone next week, what would really matter? The mess I&#39;m<br/>\ncleaning up, or the atmosphere of my home? If *I* was gone tomorrow,<br/>\nwhat would matter?  Thinking about these things helps me shift<br/>\nperspective very quickly. I&#39;ve lost enough friends and loved ones in<br/>\nlife to really value LIFE!<br/>\n<br/>\nI think it&#39;s easy to get bogged down in that resentment we&#39;ve been<br/>\ntrained with. But that&#39;s exactly what it is...programming. We&#39;ve been<br/>\ntaught that chores are something to grumble about, rather than be<br/>\nthankful for. We&#39;ve been taught negative feelings in association with<br/>\nthose tasks. It&#39;s not necessary though.<br/>\n<br/>\nI&#39;m trying hard to end that pattern in this family!  Just because<br/>\nchores had a negative connotation for me, doesn&#39;t mean they have to be<br/>\nfor my children. Nor do I have to choose to continue in that paradiagm.<br/>\n<br/>\nI talked about this in my &quot;unschooling a tribe&quot; talk in St. Louis.<br/>\nChores seem to come up a lot at the lists, but especially for big<br/>\nfamilies. I read an excerpt that I absolutely LOVE, from &quot;Wherever you<br/>\ngo, there you are&quot; by Jon Kabatt-Zin:<br/>\n<br/>\nHe talks about the feelings of anger that cat food dishes in the sink<br/>\nhad caused for him and how he started dealing with those feelings,<br/>\nthat often led to an irritated discussion or other methods of<br/>\nfunneling his frustration:<br/>\n<br/>\n&quot;I have taken to experimenting with my reactions at the kitchen sink<br/>\nby watching them very closely without acting on them.  I can report<br/>\nthat the intitial feeling of revulsion is not all that bad, and if I<br/>\nstay with it, breathe with it, and permit myself to just feel it, it<br/>\nactually goes away within a second or two.  I have also noticed that<br/>\nit is the sense of betrayal, of being thwarted in my wishes, that<br/>\nmakes me mad much more htan the cat food itself.  So, I discover, it&#39;s<br/>\nnot really the cat food by itself that is the source of my anger. <br/>\nIt&#39;s that I&#39;m not feeling listened to and respected.  Very different<br/>\nfrom the cat food. Aha!&quot;<br/>\n<br/>\nRecognizing where the anger is really stemming from is hugely helpful.<br/>\nIt takes a lot of self examination and taking responsiblity for our<br/>\nown emotions. Chores would be absolutely minimal if we lived<br/>\nalone...but that&#39;s not the life we chose, and we&#39;d be pretty torn up<br/>\nif that&#39;s what happened to us. Household tasks are a sign of wealth.<br/>\nYou aren&#39;t living in a tent, freezing in the mountains of Pakistan.<br/>\nYou aren&#39;t being shot at every day, you have food and shelter. Having<br/>\nthe good things means a certain amount of work to go with it...enjoy<br/>\nthe good life!!:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Life without chores","postDate":"1139862627","msgId":9974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzcXE5MytncHBpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEwNi1EQVY0RTk4QTA5NzM5RkVDOTBDRjc1RUJEMTA3MEBwaHguZ2JsPg=="},"prevInTopic":9973,"nextInTopic":9975,"prevInTime":9973,"nextInTime":9975,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"... Find alternatives. Paper plates and plastic utensils, at least for the majority of meals maybe (do breakfast and lunch on paper and then dinner with","messageBody":"<div id=\"ygrps-yiv-1610235650\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lisa H&quot; &lt;Lmanathome@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; OK, so what if you don&#39;t want to.  <br/>\n </span></blockquote>Find alternatives. Paper plates and plastic utensils, at least for <br/>\nthe majority of meals maybe (do breakfast and lunch on paper and <br/>\nthen dinner with regular plates and cutlery, pots and pans). Do bulk <br/>\ncooking so all you&#39;re doing is re-heating things in microwaveable <br/>\ncontainers that are single serving so they can heat and eat in one <br/>\ncontainer. We like having our double sink so that one person can <br/>\nwash and one can rinse and one can stand off to the side to dry and <br/>\nstack/put away - then it becomes a family thing rather than someone <br/>\nin &#39;exile&#39;. I&#39;ve found that what helps me a lot is having an orange <br/>\noil scented dish soap - of all the scents out there, this one leaves <br/>\nme feeling more energetic and perky than when I started! Music <br/>\nplaying helps too - my feet and butt can dance while the rest of me <br/>\nwashes (DS gets a kick out of half of Mommy dancing). Hire a <br/>\nteenager (if you&#39;ve got one handy, great if not look to the <br/>\nneighbors) who can come over maybe 4 afternoons per week to tackle <br/>\nthe dishes. This is just a tidbit to get ideas started - brainstorm <br/>\nwith your family how to tackle the situation. If you think it&#39;s <br/>\nhormonal, or seasonal, or whatever &#39;this will pass&#39; situation, let <br/>\nthem know that - &quot;Hey guys, right now I&#39;m feeling a need for a bit <br/>\nof extra help with the dishes (laundry, dusting, whatever). How can <br/>\nwe work it out?&quot; Since my DH is the at home parent, he&#39;s usually <br/>\ntackling the dishes. If he&#39;s at it when I get home from work, I&#39;ll <br/>\noften stand behind him and give him a back rub while he works. Or, <br/>\nwe&#39;ll trade off - he does some, then he takes a break and I do some, <br/>\nand so on - back and forth together until it&#39;s done (note that my DH <br/>\nhas a seriously damaged hip joint so standing still for long <br/>\nstretches is a real issue for his back).<br/>\n<br/>\nAnd, if just needing a tidy spot is what you&#39;re needing - it&#39;s not <br/>\nso much the dishes per se but that you need a clean and serene <br/>\nplace, pick a place and clean it, put some nice candles there, maybe <br/>\nsome light reading and a comfy chair or cushion, maybe a portable <br/>\nradio or CD player, and when you feel out of sorts and overwhelmed, <br/>\ngo there. Yeah, the dishes and all will still be there in 20 minutes <br/>\nor 30 minutes, but you&#39;ll have recharged your own self.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139861441","msgId":9973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NC41NzM2ZWI1LjMxMjI0MWMxQHdtY29ubmVjdC5jb20+"},"prevInTopic":9972,"nextInTopic":9974,"prevInTime":9972,"nextInTime":9974,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"Hello Kelly, Oh I know how right you are! Those chores like laundry, dishes, vacuuming, etc., are really a blessing to us all. I cannot begin to tell you how","messageBody":"<div id=\"ygrps-yiv-766370395\">Hello Kelly,<br/>\nOh I know how right you are! Those &quot;chores&quot; like laundry, dishes, vacuuming, <br/>\netc., are really a blessing to us all. I cannot begin to tell you how <br/>\nunschooling is beautifully changing our lives. I always dreaded seeing our girls <br/>\ndisappear for the whole day, being with hundreds of people all day long, every day <br/>\nwho really could give a sh... about them. Having them AND their &quot;messes&quot; all <br/>\nday is wonderful!<br/>\n<br/>\nThanks for your much needed comments!<br/>\nNancy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139860934","msgId":9972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNi1EQVY0RTk4QTA5NzM5RkVDOTBDRjc1RUJEMTA3MEBwaHguZ2JsPg==","referencesHeader":"PGRhLjM1OTAzZjI0LjMxMTVmZWI0QHdtY29ubmVjdC5jb20+IDw4QzdGRUNFQUFEMDE4NEItOTY4LTExOTQxQG1ibGstZDQ0LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":9968,"nextInTopic":9973,"prevInTime":9971,"nextInTime":9973,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"They re what you do because you *want* to. ~Kelly ********** OK, so what if you don t want to.  There was a time that i could leave dishes in the sink and a","messageBody":"<div id=\"ygrps-yiv-210992414\">They&#39;re what you do because you *want* to.<br/>\n~Kelly<br/>\n**********<br/>\n<br/>\nOK, so what if you don&#39;t want to.  There was a time that i could leave dishes in the sink and a mess around the house until i wanted to do the task.  But i am currently in a state of mind where i want my house in order and resent the hell out of feeling like the maid and cook for everyone else.  Needless to say i am not liking myself much these days because i am exhibiting such anger. I am feeling this overwhelming need for order in my environment. And thus this is taking precedence over doing other things with my kids.  Along with the feeling that whatever i am doing it just doesn&#39;t seem like enough.  Something is very off kilter here...wonder if it&#39;s hormonal.<br/>\n<br/>\nAnd all the while, my beautiful family yesterday served me breakfast in bed in appreciation of all i do - boy do i feel like a jerk.<br/>\n<br/>\nI could use some compassionate replies.<br/>\n<br/>\nLisa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139846825","msgId":9968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0ZFQ0VBQUQwMTg0Qi05NjgtMTE5NDFAbWJsay1kNDQuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGRhLjM1OTAzZjI0LjMxMTVmZWI0QHdtY29ubmVjdC5jb20+","referencesHeader":"PGRhLjM1OTAzZjI0LjMxMTVmZWI0QHdtY29ubmVjdC5jb20+"},"prevInTopic":9775,"nextInTopic":9972,"prevInTime":9967,"nextInTime":9969,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"... From: barndogzzz@wmconnect.com Or, I guess I have to start pretending that, Gee, I LOVE doing these dishes, THANKS! kids for leaving them for me to pick","messageBody":"<div id=\"ygrps-yiv-979877140\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barndogzzz@...\">barndogzzz@...</a><br/>\n<br/>\n Or, I guess <br/>\nI have to start &quot;pretending&quot; that, Gee, I LOVE doing these dishes, THANKS! <br/>\nkids for leaving them for me to pick up! lol I am kidding here, <br/>\n <br/>\n-=-=-<br/>\n <br/>\nI realize you were kidding---but it is NOT about just &quot;pretending&quot; that you love the dishes or love washing <br/>\nthe dishes. It&#39;s about that paradigm shift--it&#39;s about REALLY, TRULY MAKING that change! To see dishes as <br/>\na good part of your life. Too see laundry as meaningful and wonderful. To know---in your heart---that <br/>\ncleaning up after your family is a gift you can give them because you love and respect them. <br/>\n <br/>\nIt&#39;s about changing the way you feel inside. That inside feeling will give you a &quot;glow&quot; on the outside and <br/>\nchange the way what you&#39;re doing is preceived by others. I can&#39;t tell you what a HUGE difference this makes!<br/>\n <br/>\nThink about how you would feel if you didn&#39;t have that little t-shirt to fold or if you didn&#39;t have good <br/>\nfood to eat or a living room floor to vacuum. It CAN change your life! AND the lives of those around you!<br/>\n <br/>\nThey&#39;re not chores. They&#39;re what you do because you *want* to.<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157089938,"authorName":"S Drag-teine","from":"&quot;S Drag-teine&quot; &lt;dragteine@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Life without chores","postDate":"1139067605","msgId":9775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGIwMWM2MjlhMSQ0NWNkOGM1MCQyNDUxZjdhNUBob21lY3B1MjAwNjAxMD4=","inReplyToHeader":"PDM4OUQwMzJDLUI1N0MtNDY3NS04NjNFLTQyMjRFQUFGOTcwQkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":9768,"nextInTopic":9968,"prevInTime":9774,"nextInTime":9776,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"I gently remind my son when I give him something Where does this go when you are done? Now, that if someone said that to me - I would probably be sarcastic","messageBody":"<div id=\"ygrps-yiv-261003578\">I gently remind my son when I give him something &quot;Where does this go when<br/>\nyou are done?&quot; Now, that if someone said that to me - I would probably be<br/>\nsarcastic with them. I see I need to pick better words. If I am heading to<br/>\nthe kitchen I grab a handful of whatever and take it to the kitchen or the<br/>\nlaundry or the trash and from that my son (and surprise my husband!) has<br/>\nbegun to do the same thing.<br/>\n<br/>\nShannon <br/>\n<br/>\n~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~ <br/>\n<br/>\n<br/>\nI&#39;m glad we switched! <br/>\nWe are now safer and healthier, using toxic-free products and saving money,<br/>\ntoo.<br/>\nCall (212) 990-6214 for a 10 minute prerecorded presentation or contact me<br/>\ndirectly.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Pamela Sorooshian<br/>\nSent: Friday, February 03, 2006 8:49 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Life without chores<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *****Pick up the dishes and give them a kiss, ask them if they need<br/>\n&gt; anything else to eat.<br/>\n<br/>\n </span></blockquote>I thought Ren meant to give the dishes a kiss. Sounds about right to  <br/>\nme because one of the most important pieces of advice I&#39;ve received  <br/>\nfor changing my own attitude has been to slow down and appreciate  <br/>\nthings like the dishes. Sandra Dodd talks about how she loves this  <br/>\nplate or that bowl. I have dishes I really dislike - I have plates  <br/>\nthat I don&#39;t like to eat on. No wonder I get no satisfaction from  <br/>\npicking them up, rinsing them off, putting them in the dishwasher,  <br/>\ntaking them out and putting them away. And, if I so actively and  <br/>\nopenly dislike housework, why would the kids want to join in!<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links</div>","specialLinks":[]},{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139058102","msgId":9768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRhLjM1OTAzZjI1LjMxMTVmZmI2QHdtY29ubmVjdC5jb20+"},"prevInTopic":9767,"nextInTopic":9775,"prevInTime":9767,"nextInTime":9769,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"****Oh boy, it sure DID sound like that! Oops. It should have said  pick up  their dishes, give your kids a kiss.... Oh well. **** Boy, I m glad you","messageBody":"<div id=\"ygrps-yiv-1855505172\">****Oh boy, it sure DID sound like that! Oops. It should have said &quot; pick<br/>\nup  their dishes, give your kids a kiss....&quot; Oh well. ****<br/>\n<br/>\nBoy, I&#39;m glad you clarified that Ren, cuz I really do hate my dishes and <br/>\nkissing them   just didn&#39;t sound that appealing to me! <br/>\nNo, :o) I did give my kids a kiss AND I picked up the ugly dish too! :o)<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139057844","msgId":9767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRhLjM1OTAzZjI0LjMxMTVmZWI0QHdtY29ubmVjdC5jb20+"},"prevInTopic":9764,"nextInTopic":9768,"prevInTime":9766,"nextInTime":9768,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"Hi Pam! I have dishes I hate too, the ones in the living rm. layin around that the kids left there! :o) Guess I need to buy NEW dishes. (just kidding) Or, I","messageBody":"<div id=\"ygrps-yiv-1121788588\">Hi Pam!<br/>\nI have dishes I hate too, the ones in the living rm. layin&#39; around that the <br/>\nkids left there! :o) Guess I need to buy NEW dishes. (just kidding) Or, I guess <br/>\nI have to start &quot;pretending&quot; that, Gee, I LOVE doing these dishes, THANKS! <br/>\nkids for leaving them for me to pick up! lol I am kidding here, I wouldn&#39;t and <br/>\ndidn&#39;t want to just &quot;join in&quot; with my Mom either when she was cleaning and <br/>\nseemed so miserable doing it, why would I WANT to do something that seemed so <br/>\ndaunting?!! Very good point Pam, now I just have to learn to love house <br/>\ncleaning...lol! that aint gonna happen! But I can be more appreciative for what I have <br/>\nhere and just enjoy my kids and the fact that they are here with me now.<br/>\n<br/>\nWe have quite a few animals around here and they are not always easy to care <br/>\nfor, especially in the winter! But, I love them, love being outdoors, and I <br/>\nlove those kind of &quot;chores.&quot; Funny, my kids also love all those things and <br/>\nusually don&#39;t give me a too much of a hard time doing them or helping me do them! <br/>\nmmmmm..........and duh! On my behalf! It starts with ME! <br/>\n<br/>\nNice talking with you Pam, and thanks!<br/>\nNancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Life without chores","postDate":"1139020345","msgId":9764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzMTNucCsxY3Q1QGVHcm91cHMuY29tPg=="},"prevInTopic":9762,"nextInTopic":9767,"prevInTime":9763,"nextInTime":9765,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"I thought Ren meant to give the dishes a kiss. Oh boy, it sure DID sound like that! Oops. It should have said  pick up  their dishes, give your kids a","messageBody":"<div id=\"ygrps-yiv-1788959311\">&quot;I thought Ren meant to give the dishes a kiss.&quot;<br/>\n<br/>\nOh boy, it sure DID sound like that! Oops. It should have said &quot; pick<br/>\nup  their dishes, give your kids a kiss....&quot; Oh well. <br/>\n<br/>\nI bought brand new dishes when we moved to this house. I wanted a set<br/>\nI LOVED, and I have to admit it makes dish washing more pleasant.:)<br/>\nMaybe I&#39;ll go kiss them goodnight now....it&#39;s time to clean the kitchen.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139017740","msgId":9762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4OUQwMzJDLUI1N0MtNDY3NS04NjNFLTQyMjRFQUFGOTcwQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDM2LjJkYWE5ZjEuMzExNTM2MmFAd21jb25uZWN0LmNvbT4=","referencesHeader":"PDM2LjJkYWE5ZjEuMzExNTM2MmFAd21jb25uZWN0LmNvbT4="},"prevInTopic":9759,"nextInTopic":9764,"prevInTime":9761,"nextInTime":9763,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"... I thought Ren meant to give the dishes a kiss. Sounds about right to me because one of the most important pieces of advice I ve received for changing my","messageBody":"<div id=\"ygrps-yiv-1818489088\"><blockquote><span title=\"ireply\">&gt; *****Pick up the dishes and give them a kiss, ask them if they need<br/>\n&gt; anything else to eat.<br/>\n<br/>\n </span></blockquote>I thought Ren meant to give the dishes a kiss. Sounds about right to  <br/>\nme because one of the most important pieces of advice I&#39;ve received  <br/>\nfor changing my own attitude has been to slow down and appreciate  <br/>\nthings like the dishes. Sandra Dodd talks about how she loves this  <br/>\nplate or that bowl. I have dishes I really dislike - I have plates  <br/>\nthat I don&#39;t like to eat on. No wonder I get no satisfaction from  <br/>\npicking them up, rinsing them off, putting them in the dishwasher,  <br/>\ntaking them out and putting them away. And, if I so actively and  <br/>\nopenly dislike housework, why would the kids want to join in!<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores","postDate":"1139006506","msgId":9759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2LjJkYWE5ZjEuMzExNTM2MmFAd21jb25uZWN0LmNvbT4="},"prevInTopic":9755,"nextInTopic":9762,"prevInTime":9758,"nextInTime":9760,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"***My childhood taught me that chores sucked. made my Mom yell*** Oh, that was my childhood big time! (my Dad mostly)! ***It sounds like you ve figured that","messageBody":"<div id=\"ygrps-yiv-400637192\">***My childhood taught me that chores sucked.<br/>\nmade my Mom yell*** <br/>\n<br/>\nOh, that was my childhood big time! (my Dad mostly)!<br/>\n<br/>\n***It sounds like you&#39;ve figured that out and want to get somewhere new,<br/>\nbut what you need to do first, is just accept where you are right now.*****<br/>\n<br/>\nWow, I sure do want to get to somewhere new! Nice of you to say that, that is <br/>\nexactly what I need to do. Accept it and then move on to a better place. <br/>\nAnd....<br/>\n*****simply LIVE it yourself.****<br/>\n<br/>\n*****Pick up the dishes and give them a kiss, ask them if they need<br/>\nanything else to eat.  Start seeing the tasks as a blessing, because<br/>\nthey really are. It&#39;s hard to remember that at times, but if you shift<br/>\nyour thinking, you&#39;ll be able to see the mess as a huge gift.****<br/>\n<br/>\nEvery bit of mess is evidence of healthy, happy kids. They aren&#39;t in<br/>\nthe hospital, they are alive and learning and growing. That&#39;s HUGE.****<br/>\n<br/>\nBut when I back up and look at how I approach the task,<br/>\nasking myself &quot;am I acting in such a way that my child would WANT to<br/>\njoin me?&quot; it helps me slow down and see the truth of the moment.**** <br/>\nOh wow, what a great thought Ren!<br/>\n<br/>\nI could hug you Ren, thank you. Here I am, writing you back, putting little <br/>\nstars by all the things that you&#39;ve said that I really appreciate hearing, <br/>\nthings that really hit home, things I NEEDED to hear...heck, I should have just <br/>\nput stars by the whole darn post! &lt;BG!&gt; I am saving this, printing it off and <br/>\nusing it as my book marker in whatever book I happen to be reading. (I read a <br/>\nlot, so it will always be with me) and when I need a little shove in the right <br/>\ndirection, I&#39;ll have it there to read, again and again.<br/>\n<br/>\nThis is an awesome group,<br/>\nThanks again Ren!<br/>\n<br/>\nTake care,<br/>\nNancy<br/>\ncheck out my art at!<br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.picturetrail.com/nancysart&quot;\">http://www.picturetrail.com/nancysart&quot;</a>&gt;PictureTrail&lt;/A&gt;  or <br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://carverscompanion.com/Ezine/Vol9Issue3/KMenendez/KMenendez2.html&quot;\">http://carverscompanion.com/Ezine/Vol9Issue3/KMenendez/KMenendez2.html&quot;</a>&gt;Woodcarver On-Line Magazine, Pyrography News, No. 34&lt;/A&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Life without chores","postDate":"1139004311","msgId":9755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzMGsybitnZ2RzQGVHcm91cHMuY29tPg=="},"prevInTopic":9744,"nextInTopic":9759,"prevInTime":9754,"nextInTime":9756,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"Over the yrs. we have gotten into such a bad habit of looking at what  should be just plain & simple kindness like helping around the house as a BIG","messageBody":"<div id=\"ygrps-yiv-433308051\">&quot;Over the yrs. we have gotten into such a bad &quot;habit&quot; of looking at<br/>\nwhat  should be just plain & simple kindness like &quot;helping around the<br/>\nhouse&quot; as a BIG  CHORE instead of what Danielle just decried in this<br/>\npost.&quot;<br/>\n<br/>\nI SO deeply understand!!!  My childhood taught me that chores sucked.<br/>\n They were something that made my Mom yell, that caused stress, that<br/>\nyou complained loudly over and grumbled under your breath if not. YUCK.<br/>\n<br/>\nWhat I have learned (and not very quickly sometimes) is that things a<br/>\nparent avoids or acts stressed out over, a child is very SMART to<br/>\navoid!! duh.<br/>\nIt sounds like you&#39;ve figured that out and want to get somewhere new,<br/>\nbut what you need to do first, is just accept where you are right now.<br/>\n<br/>\nThat might sound strange, but instead of looking at this lovely flow<br/>\n(and comparing your family to another family, which can discourage as<br/>\nwell as encourage) that others talk about, simply LIVE it yourself.<br/>\n<br/>\nPick up the dishes and give them a kiss, ask them if they need<br/>\nanything else to eat.  Start seeing the tasks as a blessing, because<br/>\nthey really are. It&#39;s hard to remember that at times, but if you shift<br/>\nyour thinking, you&#39;ll be able to see the mess as a huge gift.<br/>\n<br/>\nEvery bit of mess is evidence of healthy, happy kids. They aren&#39;t in<br/>\nthe hospital, they are alive and learning and growing. That&#39;s HUGE.<br/>\nYes, we need help when we live with many people. I really NEED help<br/>\nsomedays. But when I back up and look at how I approach the task,<br/>\nasking myself &quot;am I acting in such a way that my child would WANT to<br/>\njoin me?&quot; it helps me slow down and see the truth of the moment.<br/>\n<br/>\nThe truth that household tasks are secondary to relationships. That I<br/>\nget one life and I (and my children) are not going to be on this earth<br/>\nfor very long.  What do I want to leave behind? What do I want to take<br/>\nwith me?  That&#39;s important stuff.<br/>\n<br/>\nAnd as you approach these tasks with gratitude and joy, your children<br/>\nwill begin to see that change and join in. Maybe not today, maybe not<br/>\ntomorrow, but until they do, you&#39;re building a better environment in<br/>\nwhich that can take place.<br/>\n<br/>\n&quot;Smile and the world smiles with you.&quot; (can&#39;t remember who that quote<br/>\nis from right now).<br/>\nI have noticed that just ME, just little &#39;ol ME, can completely affect<br/>\nevery person in the household. My joy or my irritation can set off a<br/>\nripple affect that is noticeable. One person can shift the mood of the<br/>\nhouse by simply BEING the change they wish to see. I know that is so<br/>\ncliched, but it&#39;s TRUE.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":157089938,"authorName":"S Drag-teine","from":"&quot;S Drag-teine&quot; &lt;dragteine@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Life without chores","postDate":"1138993257","msgId":9744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2IwMWM2MjhmNCQyYjI1OGJkMCQ1OTUzZjdhNUBob21lY3B1MjAwNjAxMD4=","inReplyToHeader":"PGRzMDY5bitmZ2JuQGVHcm91cHMuY29tPg=="},"prevInTopic":9743,"nextInTopic":9755,"prevInTime":9743,"nextInTime":9745,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"Yes, this is much the way that we try to run our household. It doesn t happen over night and some days nothing gets done but it works most the time. I don t","messageBody":"<div id=\"ygrps-yiv-144900613\">Yes, this is much the way that we try to run our household. It doesn&#39;t<br/>\nhappen over night and some days nothing gets done but it works most the<br/>\ntime. I don&#39;t look for perfection and I reward anything done even if it is<br/>\nonly with a hug and kiss.<br/>\n<br/>\nShannon <br/>\n<br/>\n~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~ <br/>\n<br/>\n<br/>\nI&#39;m glad we switched! <br/>\nWe are now safer and healthier, using toxic-free products and saving money,<br/>\ntoo.<br/>\nCall (212) 990-6214 for a 10 minute prerecorded presentation or contact me<br/>\ndirectly.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Ren Allen<br/>\nSent: Friday, February 03, 2006 1:10 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Life without chores; was 4y.o. potty stuff<br/>\n<br/>\nThe idea of &quot;teaching&quot; responsibility and how children learn to be<br/>\nresponsible when parents don&#39;t make them clean up after themselves is<br/>\na good topic to explore.<br/>\n<br/>\nIt&#39;s hard to explain this concept, when people only have an email list<br/>\nand can not see it in action.  I think parents can do things to rob <br/>\ntheir children of the ability to become responsible, but I don&#39;t<br/>\nbelieve making children clean up after themselves leads to more<br/>\nresponsibility....it can possible lead to resentment though.<br/>\n<br/>\nHere&#39;s a post I&#39;m swiping from the AU list, that Danielle Conger<br/>\nwrote. I thought she explained this so perfectlyl (as usual) and<br/>\nwanted to share it over here (hope you don&#39;t mind me swiping the whole<br/>\nthing Danielle!) :)    Ren<br/>\n<br/>\n<br/>\nDanielle:<br/>\nI&#39;ve been meaning to write about this topic here--some of which I posted<br/>\nat UD, some of which is new. Not requiring chores or creating an<br/>\natmosphere of &quot;it&#39;s your mess, you be responsible&quot; has resulted in an<br/>\namazingly cooperative household and genuine offers of help. Each of my<br/>\nkids do different things at different times and to different extents and<br/>\nall of it is welcomed when it comes, and I&#39;m noticing some really<br/>\namazing growth.<br/>\n<br/>\nRecently, the girls have been into helping me cook. The other day, they<br/>\nchopped potatoes and onions (Em learned about chopping onions and plans<br/>\non choosing potatoes next time! *g*), they&#39;ve been scrambling their own<br/>\neggs, making their own oatmeal (Em showed Sam how to do his), chopping<br/>\nand steaming vegetables and helping make pasta and rice. They certainly<br/>\ndon&#39;t do this every time I cook, but I always welcome them when they<br/>\nask. For a long time, they liked helping make pizza dough, cookies and<br/>\nbread, but then they got bored with that.<br/>\n<br/>\nTwo weeks ago, I asked the girls to help me in their room, which had<br/>\nbecome *very* messy and completely un-navigable--pretty much everything<br/>\nin there was on the floor. I asked them to let me know when they were<br/>\nready to tackle it.  Jules decided she was ready at some point in the<br/>\nafternoon and came and got me, but Em didn&#39;t feel ready. I asked her if<br/>\nshe felt like sitting on her bed and keeping us company, which she did.<br/>\nI did much of the work, which I usually do, but Jules helped a lot,<br/>\nwhich she usually does and Em ran a few errands here and there--taking<br/>\ncups to the sink and dirty clothes to the laundry. I ended up diving<br/>\ninto lots of their bins and asking them to help me sort through stuff<br/>\nthey no longer wanted. We also reworked their clothes baskets to create<br/>\nmore room--really an all day affair.<br/>\n<br/>\nAt the end of the day, I asked them to do me the favor of keeping the<br/>\nfloor cleaned up until tomorrow so I could run a vacuum. They asked why<br/>\nI didn&#39;t just run the vacuum now, so I told them I needed to get Sam&#39;s<br/>\nroom cleaned up first and just didn&#39;t have the energy. They were fine<br/>\nwith that, and we went about our evening--dinner, playing and finally<br/>\ncurled up in our room to watch a movie and fall asleep.<br/>\n<br/>\nAs everyone else was falling asleep, Em, my nightowl, got up and cleaned<br/>\nand organized her brother&#39;s room (a much more straight-forward job than<br/>\ntheir room!). It was a gift to him and a gift to me--all freely given. I<br/>\ndoubt she would have felt so generous if I&#39;d made her clean her room<br/>\nwith us earlier that day because it was *her* room, and I&#39;m not sure she<br/>\nwould have thought to do it if I hadn&#39;t been modeling that kind of<br/>\ngenerosity for her most of her life.<br/>\n<br/>\nJust last night, the girls decided to clean their room and the living<br/>\nroom because their grandpa is coming down for the weekend to help us<br/>\ndrywall the basement. Em looked around for her &quot;Jagged Little Pill&quot; CD,<br/>\npopped it in, and proceeded to clean much of the room by herself,<br/>\nhappily. The girls straightened the living room, put the games they&#39;d<br/>\nbeen playing away, straightened up their bathroom, and Sam cleaned up<br/>\nhis room. No one had been asked to do any of this. I hadn&#39;t mentioned<br/>\nanything about cleaning up, though they know I often do before someone<br/>\ncomes to visit. But because I don&#39;t make a big deal out of it, because I<br/>\nalways ask for their help and take what they&#39;re willing to give<br/>\ncheerfully, because I don&#39;t require they take responsibility, they seem<br/>\nto be happy to step up and take responsibility.<br/>\n<br/>\nSo, I figure we&#39;re doing something right.<br/>\n<br/>\n--<br/>\n~~Danielle<br/>\nEmily (8), Julia (7), Sam (5)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Life without chores; was 4y.o. potty stuff","postDate":"1138990199","msgId":9743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzMDY5bitmZ2JuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":9744,"prevInTime":9742,"nextInTime":9744,"topicId":9743,"numMessagesInTopic":0,"msgSnippet":"The idea of teaching responsibility and how children learn to be responsible when parents don t make them clean up after themselves is a good topic to","messageBody":"<div id=\"ygrps-yiv-2073256774\">The idea of &quot;teaching&quot; responsibility and how children learn to be<br/>\nresponsible when parents don&#39;t make them clean up after themselves is<br/>\na good topic to explore.<br/>\n<br/>\nIt&#39;s hard to explain this concept, when people only have an email list<br/>\nand can not see it in action.  I think parents can do things to rob <br/>\ntheir children of the ability to become responsible, but I don&#39;t<br/>\nbelieve making children clean up after themselves leads to more<br/>\nresponsibility....it can possible lead to resentment though.<br/>\n<br/>\nHere&#39;s a post I&#39;m swiping from the AU list, that Danielle Conger<br/>\nwrote. I thought she explained this so perfectlyl (as usual) and<br/>\nwanted to share it over here (hope you don&#39;t mind me swiping the whole<br/>\nthing Danielle!) :)    Ren<br/>\n<br/>\n<br/>\nDanielle:<br/>\nI&#39;ve been meaning to write about this topic here--some of which I posted<br/>\nat UD, some of which is new. Not requiring chores or creating an<br/>\natmosphere of &quot;it&#39;s your mess, you be responsible&quot; has resulted in an<br/>\namazingly cooperative household and genuine offers of help. Each of my<br/>\nkids do different things at different times and to different extents and<br/>\nall of it is welcomed when it comes, and I&#39;m noticing some really<br/>\namazing growth.<br/>\n<br/>\nRecently, the girls have been into helping me cook. The other day, they<br/>\nchopped potatoes and onions (Em learned about chopping onions and plans<br/>\non choosing potatoes next time! *g*), they&#39;ve been scrambling their own<br/>\neggs, making their own oatmeal (Em showed Sam how to do his), chopping<br/>\nand steaming vegetables and helping make pasta and rice. They certainly<br/>\ndon&#39;t do this every time I cook, but I always welcome them when they<br/>\nask. For a long time, they liked helping make pizza dough, cookies and<br/>\nbread, but then they got bored with that.<br/>\n<br/>\nTwo weeks ago, I asked the girls to help me in their room, which had<br/>\nbecome *very* messy and completely un-navigable--pretty much everything<br/>\nin there was on the floor. I asked them to let me know when they were<br/>\nready to tackle it.  Jules decided she was ready at some point in the<br/>\nafternoon and came and got me, but Em didn&#39;t feel ready. I asked her if<br/>\nshe felt like sitting on her bed and keeping us company, which she did.<br/>\nI did much of the work, which I usually do, but Jules helped a lot,<br/>\nwhich she usually does and Em ran a few errands here and there--taking<br/>\ncups to the sink and dirty clothes to the laundry. I ended up diving<br/>\ninto lots of their bins and asking them to help me sort through stuff<br/>\nthey no longer wanted. We also reworked their clothes baskets to create<br/>\nmore room--really an all day affair.<br/>\n<br/>\nAt the end of the day, I asked them to do me the favor of keeping the<br/>\nfloor cleaned up until tomorrow so I could run a vacuum. They asked why<br/>\nI didn&#39;t just run the vacuum now, so I told them I needed to get Sam&#39;s<br/>\nroom cleaned up first and just didn&#39;t have the energy. They were fine<br/>\nwith that, and we went about our evening--dinner, playing and finally<br/>\ncurled up in our room to watch a movie and fall asleep.<br/>\n<br/>\nAs everyone else was falling asleep, Em, my nightowl, got up and cleaned<br/>\nand organized her brother&#39;s room (a much more straight-forward job than<br/>\ntheir room!). It was a gift to him and a gift to me--all freely given. I<br/>\ndoubt she would have felt so generous if I&#39;d made her clean her room<br/>\nwith us earlier that day because it was *her* room, and I&#39;m not sure she<br/>\nwould have thought to do it if I hadn&#39;t been modeling that kind of<br/>\ngenerosity for her most of her life.<br/>\n<br/>\nJust last night, the girls decided to clean their room and the living<br/>\nroom because their grandpa is coming down for the weekend to help us<br/>\ndrywall the basement. Em looked around for her &quot;Jagged Little Pill&quot; CD,<br/>\npopped it in, and proceeded to clean much of the room by herself,<br/>\nhappily. The girls straightened the living room, put the games they&#39;d<br/>\nbeen playing away, straightened up their bathroom, and Sam cleaned up<br/>\nhis room. No one had been asked to do any of this. I hadn&#39;t mentioned<br/>\nanything about cleaning up, though they know I often do before someone<br/>\ncomes to visit. But because I don&#39;t make a big deal out of it, because I<br/>\nalways ask for their help and take what they&#39;re willing to give<br/>\ncheerfully, because I don&#39;t require they take responsibility, they seem<br/>\nto be happy to step up and take responsibility.<br/>\n<br/>\nSo, I figure we&#39;re doing something right.<br/>\n<br/>\n--<br/>\n~~Danielle<br/>\nEmily (8), Julia (7), Sam (5)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]}],"prevTopicId":10024,"nextTopicId":10014}}