{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] was: help re. bullying ..now---how about \tbullyting amongst family members??","postDate":"1238629725","msgId":39229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAxMTY0OG41MTk3YmU2OG0yZDJkM2ViZWM1OTRhNGY4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdxdGprais0bWgzQGVHcm91cHMuY29tPg==","referencesHeader":"PGdxdDQxNSt1M2pmQGVHcm91cHMuY29tPiA8Z3F0amtqKzRtaDNAZUdyb3Vwcy5jb20+"},"prevInTopic":39221,"nextInTopic":0,"prevInTime":39228,"nextInTime":39230,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"My younger sister (30 yrs old-so not a child) has always been my bully..and it came to a point where she has crossed the line with how she spoke and what she","messageBody":"<div id=\"ygrps-yiv-72804958\">My younger sister (30 yrs old-so not a child) has always been my bully..and<br/>\nit came to a point where she has crossed the line with how she spoke and<br/>\nwhat she said to me in front of my kids ( 5 and 3 1/2) she also threw a cup<br/>\nof water in my face in front of them as well while they were watching this<br/>\nunfold crying.I then picked them up and we left the family event at my<br/>\nparents house.<br/>\n<br/>\n*** You have gotten some good comments so far. I think this was a great<br/>\nmove.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nthis is all due to her not approving of my choices ,Im lots of things that<br/>\nshe doesnt approve of or agree with..I am not the corporate type and she<br/>\nis...I recently became a raw vegan and a raw foods chef..I have lost over 50<br/>\npounds so far but I am still about 100 lbs overweight so in her eyes that<br/>\nmakes me lots of negative horrible things...I like to be inside alot and<br/>\nwith my family...and I am now homeschooling..so she just let it rip on me..<br/>\n<br/>\n***She doesn&#39;t get to do that. You have no obligation to allow her to hurt<br/>\nyou or your kids. You get to be *you* and you deserve support and<br/>\nunderstanding. Whether someone agrees with you or not.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI posted this to another board Im on..and a comment triggered something<br/>\nwithin me..I always was asked to keep the peace with my family and say Im<br/>\nsorry to her even when I felt I was wronged by my sister or disresepcted by<br/>\nher(hung up on numerous times because she didnt want to hear my thoughts on<br/>\nsomething,or even physically hit when we were younger,or her yelling at me<br/>\nand hanging up on me 2 days after I lost a baby at 16 weeks and told to get<br/>\nover it because I had 2 girls and I should be happy)....all in order to keep<br/>\npeace for my familys sake but at what expense..it was to my own. I became<br/>\nthe bigger one physically for what I was emotionally being asked to do as<br/>\nwell. I really agree with this and it was like a lightbulb moment.<br/>\nshe has been my bully for a long time..so when I left the house the other<br/>\nnight .that was huge thing for me to do.<br/>\n<br/>\n***It sounds like you are finding out a lot about yourself. I found that my<br/>\nunschooling journey brought (brings) up so much for me as well. I was abused<br/>\nas a child and I am still working through it. Being good to myself and<br/>\nraising my kids with love, respect and kindness really helps. I get to my my<br/>\nchildren&#39;s mother and not my parent&#39;s child. I take care to support the<br/>\npeople in my life and choose to surround myself with people who support me.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nlets just say Im the bad one now because I left and Im expected to still<br/>\ncome over to family functions because it isnt fair that they (my sister and<br/>\nher husband) lose out on seeing the girls.<br/>\n<br/>\n***Do you think that being around your family is the best thing for your<br/>\nchildren? Do you children want to be around them? Are they a support system<br/>\nfor the work you are doing right now?<br/>\n<br/>\nHave you asked your children how they feel and what they think?<br/>\n<br/>\nI think the book Raising Our Children, Raising Ourselves might be helpful to<br/>\nyou and what you are going through.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI dont agree with this..just because someone is family and blood does that<br/>\ngive them the right to hurt us and belittle us in front of the ones we love<br/>\nand if we go back into the fire isnt that like saying its okay to keep doing<br/>\nit to me and now you can impose your negative beliefs about me and my<br/>\nlifestyle on my girls as well.<br/>\n<br/>\n***I totally agree with you. Ren said it, you answered yourself.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=--=-=-=-=-=-=-=-<br/>\n<br/>\nIm so confused because in my heart I need to be away from sister and the<br/>\ndrama she causes me yet by doing so .this will cause even more drama that I<br/>\nwill be forced to take the blame on causing upon my parents and grandmother<br/>\n(jewish gult)-yet they dont seem to see this has hurt me so much and in so<br/>\nmany ways over the years.<br/>\n<br/>\n***I no longer talk to my father, except on a rare occasion. I needed to<br/>\nhave many long deep conversations with my mother to heal our relationship<br/>\nand allow her space in our lives. I chose to stand up for my kids and their<br/>\nneeds. I allowed them to have their drama, I didn&#39;t take it personally. I<br/>\ndidn&#39;t need them. They needed me. I have their grandkids.  I get to say how<br/>\nthey are raised and I get to chose who is part of their lives, with respect<br/>\nto their needs. Your kids are old enough to talk about their needs and<br/>\nthoughts pertaining thier relatives.<br/>\n<br/>\nDo they feel good around them? Do they feel comfortable and enjoy their time<br/>\nwith them?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=-==--<br/>\n<br/>\nFaith<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"(For Ren)  Re: Please help re. bullying (sorry - long), Part 3","postDate":"1238581025","msgId":39221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdmV2MStoaHJiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEREMEI1MzExMzgwQTQxRTFBN0EyNjQyMUMyQzhDRURFQHJvYnlQQz4="},"prevInTopic":39220,"nextInTopic":39229,"prevInTime":39220,"nextInTime":39222,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"I m sort of jumping in to this conversation late but I wanted to discuss the bullying. My 10 year old, Skylar is small, and a wrestler.  Wrestling tends to","messageBody":"<div id=\"ygrps-yiv-373263769\">I&#39;m sort of jumping in to this conversation late but I wanted to discuss the bullying.  <br/>\n<br/>\nMy 10 year old, Skylar is small, and a wrestler.  Wrestling tends to attract some bully-types.  They think they can join the wrestling team and &quot;kick some a$$&quot;.  They soon find out that this isn&#39;t the case and take to bullying their team mates.  At the beginning of the season we had some issues with one other child especially.  The child punched Skylar in the stomach right before a tournament match and he ended up doing uncharacteristically poor and lost.  After practice once, the child tried to punch Skylar in the face outside the building.  <br/>\n<br/>\nTalk with parents and coaches.  <br/>\n<br/>\nAsk your child to stick by you and if he forgets, stick close by your child.<br/>\n<br/>\nAsk the other child yourself to stop doing what he&#39;s doing.<br/>\n<br/>\nIf your child is being bullied at a homeschool group, find out if he even wants to go anymore. Make sure your not forcing him into a situation he doesn&#39;t want to be in.   <br/>\n<br/>\nAsk your child what he needs from you.  Open communication is what got us through the first few weeks.  Skylar was pretty clear what he wanted me to do.  <br/>\n<br/>\nI don&#39;t think there are perfect solutions to bullying, as you can&#39;t control others but you can be mindful of the situation and make choices based on what you know.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;hunnybunnies5@...&gt; wrote:<br/>\n<br/>\nTHE BULLYING SCENARIO MY SON WAS EXPERIENCING WAS TAKING PLACE IN A SCHOOL<br/>\nSETTING. BULLYINGEVEN OCCURS IN OUR LOCAL HOMESCHOOLING GROUP. IT WOULD BE<br/>\nVERYHELPFUL TO KNOW THE BEST SOLUTION TO THIS PROBLEM, AND I THINKUNSCHOOLERS,<br/>\nWHO PRACTICE PEACEFUL PARENTING WOULD HAVE THE BESTANSWER. THAT&#39;S WHY I DECIDED<br/>\nTO ASK THIS GROUP FOR ADVICE. </span></blockquote></div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] was: help re. bullying  ..now---how about bullyting amongst family members??","postDate":"1238564408","msgId":39220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjEwMWM5YjI4YyQ2MDJmY2EwMCQzYWZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PGdxdGprais0bWgzQGVHcm91cHMuY29tPg=="},"prevInTopic":39216,"nextInTopic":39221,"prevInTime":39219,"nextInTime":39221,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"Marcy Going back to the family at this stage would be like going back to public school. They need you for their scape goating. They can t heal from their","messageBody":"<div id=\"ygrps-yiv-69095819\">Marcy<br/>\n<br/>\nGoing back to the family at this stage would be like going back to public school. They need you for their scape goating. They can&#39;t heal from their lovelessness if you keep providing the addictive substance of your presence. But it is not about them. It is about you and your girls and about you finding the power within to stand up for your right to be respected.<br/>\n<br/>\nSometimes it looks to me that family is our worst enemy.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: was: help re. bullying  ..now---how about bullyting amongst family members??","postDate":"1238536403","msgId":39216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdTNjaisxbXZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxdGprais0bWgzQGVHcm91cHMuY29tPg=="},"prevInTopic":39214,"nextInTopic":39220,"prevInTime":39215,"nextInTime":39217,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"~~I dont agree with this..just because someone is family and blood does that give them the right to hurt us and belittle us in front of the ones we love and if","messageBody":"<div id=\"ygrps-yiv-1950804820\">~~I dont agree with this..just because someone is family and blood does that give them the right to hurt us and belittle us in front of the ones we love and if we go back into the fire isnt that like saying its okay to keep doing it to me and now you can impose your negative beliefs about me and my lifestyle on my girls as well.~~<br/>\n<br/>\nYou just wrote out your own answer.:) Funny how that works eh? I find my own answers so many times by just sitting down and writing...the process of putting the words down can really expose stuff we already know is true.<br/>\n<br/>\nSo....I just can&#39;t say enough to protect yourself from toxic people, family or not. It sounds like your sister has a lot of hurt inside that she takes out as anger. You don&#39;t need to give her permission to use you as her punching bag though!  In healthy relationships, people give each other space to be different.<br/>\n<br/>\nIf you need strength to stand up to her and your family, just picture them doing it to your children, because they ARE hurting your children every time they do this to you. I hope you can find peace and a  peaceful way to protect yourself.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":135282288,"authorName":"Marcy","from":"&quot;Marcy&quot; &lt;sweetpackages@...&gt;","profile":"sweetpackages","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"was: help re. bullying  ..now---how about bullyting amongst family members??","postDate":"1238520275","msgId":39214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdGprais0bWgzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxdDQxNSt1M2pmQGVHcm91cHMuY29tPg=="},"prevInTopic":39210,"nextInTopic":39216,"prevInTime":39213,"nextInTime":39215,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"... Im new to unschooling and the group..and wanted to ask opinions on the bullying issue when it comes to family members as well. My younger sister (30 yrs","messageBody":"<div id=\"ygrps-yiv-367545379\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; &lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So if you&#39;re talking about someone picking on another person repeatedly, no we don&#39;t deal with that. <br/>\n<br/>\n<br/>\n </span></blockquote>Im new to unschooling and the group..and wanted to ask opinions on the bullying issue when it comes to family members as well.<br/>\nMy younger sister (30 yrs old-so not a child) has always been my bully..and it came to a point where she has crossed the line with how she spoke and what she said to me in front of my kids ( 5 and 3 1/2) she also threw a cup of water in my face in front of them as well while they were watching this unfold crying.I then picked them up and we left the family event at my parents house.<br/>\n<br/>\n this is all due to her not approving of my choices ,Im lots of things that she doesnt approve of or agree with..I am not the corporate type and she is...I recently became a raw vegan and a raw foods chef..I have lost over 50 pounds so far but I am still about 100 lbs overweight so in her eyes that makes me lots of negative horrible things...I like to be inside alot and with my family...and I am now homeschooling..so she just let it rip on me..<br/>\n<br/>\nI posted this to another board Im on..and a comment triggered something within me..I always was asked to keep the peace with my family and say Im sorry to her even when I felt I was wronged by my sister or disresepcted by her(hung up on numerous times because she didnt want to hear my thoughts on something,or even physically hit when we were younger,or her yelling at me and hanging up on me 2 days after I lost a baby at 16 weeks and told to get over it because I had 2 girls and I should be happy)....all in order to keep peace for my familys sake but at what expense..it was to my own. I became the bigger one physically for what I was emotionally being asked to do as well. I really agree with this and it was like a lightbulb moment.<br/>\nshe has been my bully for a long time..so when I left the house the other night .that was huge thing for me to do.<br/>\n<br/>\nlets just say Im the bad one now because I left and Im expected to still come over to family functions because it isnt fair that they (my sister and her husband) lose out on seeing the girls.<br/>\nI dont agree with this..just because someone is family and blood does that give them the right to hurt us and belittle us in front of the ones we love and if we go back into the fire isnt that like saying its okay to keep doing it to me and now you can impose your negative beliefs about me and my lifestyle on my girls as well.<br/>\n<br/>\nIm so confused because in my heart I need to be away from sister and the drama she causes me yet by doing so .this will cause even more  drama that I will be forced to take the blame on causing upon my parents and grandmother (jewish gult)-yet they dont seem to see this has hurt me  so much and in so many ways over the years.<br/>\n<br/>\ndoes this make sense or am I rambling or a little of both,lol<br/>\nI would love some thoughts on this..because honestly I never thought this would all cross over to my thinking about family relationships but I guess how could it not.<br/>\nthanks<br/>\nmarcy</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] (For Ren)  Re: Please help re. bullying (sorry - long), Part 3","postDate":"1238514022","msgId":39209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1NTIwNi4xNzQxOS5xbUB3ZWIzNjkwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39205,"nextInTopic":39210,"prevInTime":39208,"nextInTime":39210,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"... We had a family in one of our homeschooling groups who s daughter was a bully, and would coerce the smaller kids into also bullying, picking on one kid. ","messageBody":"<div id=\"ygrps-yiv-1735768703\"><blockquote><span title=\"ireply\">&gt;&gt;BULLYINGEVEN OCCURS IN OUR LOCAL HOMESCHOOLING GROUP.  &gt;&gt;<br/>\n<br/>\n </span></blockquote>We had a family in one of our homeschooling groups who&#39;s daughter was a bully, and would coerce the smaller kids into also bullying, picking on one kid.  I made a point of tellilng her that I knew what she was doing, and we soon enough stopped attending groups that that family attended....most other families also did, so now we laugh that we all banded together to escape that other family.  Sadly, this was a family who claimed to be &quot;unschoolers&quot; but nothing was further from the truth.  Getting away from bullies is *my* best way to deal with them--I don&#39;t need to make them sorry or get through to them, I just need to protect myself and my family from them.  <br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":267621540,"authorName":"Brenna Shugarts","from":"Brenna Shugarts &lt;bshugarts@...&gt;","profile":"bshugarts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] (For Ren)  Re: Please help re. bullying (sorry - long), Part 3","postDate":"1238506300","msgId":39210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMTgyMC40NTI4Mi5xbUB3ZWIzMzUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39209,"nextInTopic":39214,"prevInTime":39209,"nextInTime":39211,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"Ren, that was a beautiful description! I have had that jumbled up in my head for so long.....thanks for putting it all into words. I am","messageBody":"<div id=\"ygrps-yiv-1171807763\">Ren, that was a beautiful description! I have had that jumbled up in my head for so long.....thanks for putting it all into words. I am homeschooling/unschooling 2 girls ages 11 & 12. they were in school early in life & we had a strict set Curr for 2 yrs. they fought me so much the last yr. I then decided to go the easier approach learning on the comp (free world) & some times unschooling.  I have to admit that I take my girls to work all the time(not 40 hr week) & some days we do nothing at all pertaining to school. I have found that they will take it upon themselves to google things that they are interested in. My oldest reads 15 to 20 books a week. This week she checked out 26 at the library!!! She is so smart & I am so happy that I have taken the initiative to not be scared & home-schooled/ semi-unschooled my girls. Thanks again for clarifying!  Brenna<br/>\n<br/>\n<br/>\n<br/>\nreputation is what men & women think of us. character is what God & the angels know of us.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Tue, 3/31/09, Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nSubject: [unschoolingbasics] (For Ren) Re: Please help re. bullying (sorry - long), Part 3<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Tuesday, March 31, 2009, 8:58 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~~BULLYINGEVEN OCCURS IN OUR LOCAL HOMESCHOOLING GROUP. ~~<br/>\n<br/>\nNot in ours.<br/>\nI&#39;ve not dealt with bullying at any of our gatherings and I&#39;ve been hanging out with unschoolers for a very long time.<br/>\n<br/>\nBullying is different than children having a disagreement, or difficult time socially. The only bullying I&#39;ve watched happen is when there are schooled kids on the playground at our park days and sometimes our kids get some of it directed at them. Within our group I&#39;ve had the kids come to blows, something that is dealt with gently and respectfully without blame and the kids are right back to being friends in a pretty short time.<br/>\n<br/>\nSo if you&#39;re talking about someone picking on another person repeatedly, no we don&#39;t deal with that. <br/>\n<br/>\nAs far as school being damaging, even in a situation where you think you&#39;ve found an &quot;ideal&quot; school. Ask yourself the ways you could support your child directly with that same money you&#39;re giving over to a school, with all it&#39;s buildings and staff and materials your child may or may not care about. LOTS of money spent that you get no say-so over.<br/>\n<br/>\nWhy? Do you really think they can provide a better learning experience than wherever your child&#39;s interests can lead?<br/>\n<br/>\n~School is harmful because it teaches you that you need to be taught in order to learn.<br/>\n~It takes away freedom of choice (no, you can&#39;t go build mud pies during lunch, even at a Montessori)<br/>\n~It leaves you at the mercy of other people&#39;s ideas about learning and how to spend your time<br/>\n~It slowly errodes most people&#39;s confidence in whatever they love/are interested in<br/>\n~It takes a lot of time away from family<br/>\n~It takes a lot of money (in your case) away from personal interests<br/>\n~It makes people lose touch with their inner guidance, because other people are dictating your day.<br/>\n<br/>\nTalk to Kelly Lovejoy about how damaged her son Cameron was, upon leaving a top-notch private school. It took him two years of hiding out at home and playing video games to recover. Unschooling was very healing for him.<br/>\n<br/>\nI don&#39;t have much time this morning...I&#39; ll expand more later. I&#39;m sure you&#39;ll get loads of good input on how school is harmful.<br/>\n<br/>\nRen<br/>\nradicalunschooling. blogspot. com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"(For Ren)  Re: Please help re. bullying (sorry - long), Part 3","postDate":"1238504293","msgId":39205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdDQxNSt1M2pmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEREMEI1MzExMzgwQTQxRTFBN0EyNjQyMUMyQzhDRURFQHJvYnlQQz4="},"prevInTopic":39202,"nextInTopic":39209,"prevInTime":39204,"nextInTime":39206,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"~~BULLYINGEVEN OCCURS IN OUR LOCAL HOMESCHOOLING GROUP. ~~ Not in ours. I ve not dealt with bullying at any of our gatherings and I ve been hanging out with","messageBody":"<div id=\"ygrps-yiv-498004989\">~~BULLYINGEVEN OCCURS IN OUR LOCAL HOMESCHOOLING GROUP. ~~<br/>\n<br/>\nNot in ours.<br/>\nI&#39;ve not dealt with bullying at any of our gatherings and I&#39;ve been hanging out with unschoolers for a very long time.<br/>\n<br/>\nBullying is different than children having a disagreement, or difficult time socially. The only bullying I&#39;ve watched happen is when there are schooled kids on the playground at our park days and sometimes our kids get some of it directed at them. Within our group I&#39;ve had the kids come to blows, something that is dealt with gently and respectfully without blame and the kids are right back to being friends in a pretty short time.<br/>\n<br/>\nSo if you&#39;re talking about someone picking on another person repeatedly, no we don&#39;t deal with that. <br/>\n<br/>\nAs far as school being damaging, even in a situation where you think you&#39;ve found an &quot;ideal&quot; school. Ask yourself the ways you could support your child directly with that same money you&#39;re giving over to a school, with all it&#39;s buildings and staff and materials your child may or may not care about. LOTS of money spent that you get no say-so over.<br/>\n<br/>\nWhy? Do you really think they can provide a better learning experience than wherever your child&#39;s interests can lead?<br/>\n<br/>\n~School is harmful because it teaches you that you need to be taught in order to learn.<br/>\n~It takes away freedom of choice (no, you can&#39;t go build mud pies during lunch, even at a Montessori)<br/>\n~It leaves you at the mercy of other people&#39;s ideas about learning and how to spend your time<br/>\n~It slowly errodes most people&#39;s confidence in whatever they love/are interested in<br/>\n~It takes a lot of time away from family<br/>\n~It takes a lot of money (in your case) away from personal interests<br/>\n~It makes people lose touch with their inner guidance, because other people are dictating your day.<br/>\n<br/>\n<br/>\nTalk to Kelly Lovejoy about how damaged her son Cameron was, upon leaving a top-notch private school. It took him two years of hiding out at home and playing video games to recover. Unschooling was very healing for him.<br/>\n<br/>\nI don&#39;t have much time this morning...I&#39;ll expand more later. I&#39;m sure you&#39;ll get loads of good input on how school is harmful.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":346820406,"authorName":"hunnybunnies5@verizon.net","from":"&lt;hunnybunnies5@...&gt;","profile":"shelleydaez","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"(For Ren)  Re: Please help re. bullying (sorry - long), Part 3","postDate":"1238496379","msgId":39202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREMEI1MzExMzgwQTQxRTFBN0EyNjQyMUMyQzhDRURFQHJvYnlQQz4="},"prevInTopic":0,"nextInTopic":39205,"prevInTime":39201,"nextInTime":39203,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"... ...school is unnecessary and harmful even when things seem to be going smoothly.SO GOOD TO HEAR THESE WORDS.  IF YOU HAVE THE TIME, REN, COULD YOU TELL ME","messageBody":"<div id=\"ygrps-yiv-401635288\"><blockquote><span title=\"ireply\">&gt;&gt; take your kid out of school. Forever. What other point of view would you<br/>\n&gt;&gt; expect to hear at an unschooling list? I&#39;m not sure what you want here.YES, I GUESS THE LENGTH OF THE POSTS I HAD SENT OBSCURED MY REAL PURPOSE FOR WRITING -- TO LEARN HOW UNSCHOOLERSDEAL WITH BULLYING.  BULLYING IS UNIVERSAL AND HAS BEEN AROUND FORCENTURIES EVEN BEFORE SCHOOLS WERE CREATED.  IT JUST SO HAPPENEDTHAT THE BULLYING SCENARIO MY SON WAS EXPERIENCING WAS TAKING PLACE IN A SCHOOL SETTING.  BULLYINGEVEN OCCURS IN OUR LOCAL HOMESCHOOLING GROUP.  IT WOULD BE VERYHELPFUL TO KNOW THE BEST SOLUTION TO THIS PROBLEM, AND I THINKUNSCHOOLERS, WHO PRACTICE PEACEFUL PARENTING WOULD HAVE THE BESTANSWER.  THAT&#39;S WHY I DECIDED TO ASK THIS GROUP FOR ADVICE.<br/>\n&gt;&gt; Without any of the problems you outlined, I&#39;d say take your kid out of school<br/>\n&gt;&gt; anyway. This list exists to help people see how school is unnecessary and<br/>\n&gt;&gt; harmful even when things seem to be going smoothly.EVEN IN A GOOD MONTESSORI SCHOOL?  IF YOU CAN, I WOULD GREATLYAPPRECIATE IT IF YOU COULD ANSWER THIS QUESTION.  I DON&#39;T MEAN TO BE ANNOYING.IT&#39;S JUST THAT WHEN I&#39;M IN MY SON&#39;S SCHOOL, THEY ALWAYS HAVE ME THINK OTHERWISE.<br/>\n </span></blockquote>...school is unnecessary and harmful even when things seem to be going smoothly.SO GOOD TO HEAR THESE WORDS.  IF YOU HAVE THE TIME, REN, COULD YOU TELL ME THE REASONS WHY -- EVEN IF ONLY BRIEFLY.  I JUST NEED TO HEAR THEM OVER AND OVER AGAIN UNTIL IT GETS INGRAINED IN MY BRAIN.IF YOU DON&#39;T HAVE THE TIME (WHICH I TOTALLY UNDERSTAND), COULD YOU SEND ME A LINK TO AN ARTICLE OR WEBSITE THAT WOULD?  THANKS FOR TAKING THE TIME TO READ THROUGH MY POSTS -- I DO APPRECIATE IT.SHELLEY<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39183,"nextTopicId":39184}}