{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":209676473,"authorName":"joanne","from":"&quot;joanne&quot; &lt;oh.kneel@...&gt;","profile":"kc2ark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [Norton AntiSpam] [unschoolingbasics] Detoxing","postDate":"1130716323","msgId":7301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYjYwMWM1ZGRhYyRlZGIzZTNiMCQ2NDAxYThjMEBKb2FubmU+","referencesHeader":"PGRqdXJtOSsyN3FlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7300,"nextInTime":7302,"topicId":7301,"numMessagesInTopic":0,"msgSnippet":"Hi Ren,  Thank you for celebrating the volcano with me.  You were one of the few to also see it as cool!  It took me a while to let go but when I did , boy was","messageBody":"<div id=\"ygrps-yiv-133682687\">Hi Ren,  Thank you for celebrating the volcano with me.  You were one of the few to also see it as cool!  It took me a while to let go but when I did , boy was it awesome!!<br/>\n<br/>\nIt was helpful to hear that your child has a similar characteristics. <br/>\n<br/>\n***I have a four year old that is VERY high energy, VERY independent and<br/>\nVERY destructive at times.  It sometimes means a physical restraint of<br/>\nsome kind, which these days involves picking him up and holding him<br/>\nuntil I can be sure it is safe to put him down.<br/>\nWhen I&#39;m holding him and talking to him, he is more likely to really<br/>\nhear me. <br/>\n<br/>\n***Or is he simply feeling he can<br/>\nignore you because you aren&#39;t trustworthy?****<br/>\n<br/>\nYes, regrettably Ihave been inconsistant.<br/>\n<br/>\n***If he isn&#39;t sure what kind of response he&#39;ll get, he&#39;s lacking trust.<br/>\nSo this could be some transitional stuff, but you might need to set<br/>\nbetter personal boundaries.***<br/>\n<br/>\nBoy, was that a poweful way to frame things! Thank you so much for that insight.<br/>\n<br/>\n***I have a feeling he&#39;s just testing out this new freedom and trying to<br/>\nsuck up every moment because he fears it might be taken away.***<br/>\n<br/>\nAs I have been reading different posts and challenging myself, I have also come to think this may be it also.<br/>\n<br/>\nIs he keeping anyone awake?<br/>\nIs he doing anything harmful?<br/>\n<br/>\nHe is quiet and he is just watching movies.  He wakes us up if he needs help changing a movie.  Recently I have thought that I might lay down in the room with him where he is wathcing the movie as he does ask for me to stay (when I am tired and need to lay down) and I think we are both missing our snuggling time.<br/>\n<br/>\n***Tell us more about how you eased into radical unschooling and whether<br/>\nor not you made some sort of announcement that there were no rules.***<br/>\n<br/>\nI did this all wrong.  I felt badly for having him in full day school for two years (special needs programs).  We had told him that there were other ways to go to school and after six days of kindergarten he didn&#39;t want to go anymore.  As I continued to read more, one day I just told him that we had decided to let him stay up if he wanted to, that we weren&#39;t going to decidee for him when he had to go to bed anymore.  We didn&#39;t discuss it but stopped forcing him to eat with us or at a given time. (We contiued to invite him but then would not make an issue like we had in the past.) He has been thrilled and even though we did it too fast we have been consistant and have not taken it back.  We have asked a couple of times if maybe it wasn&#39;t<br/>\nworking out and if we should talk about doing things differently (after posts suggesitng that we had either gone too fast or should not allow a five year old up alone) But he has alwasy insisted that he wnats to continue it the way it is and we have allowed things to remain with this new freedom.<br/>\n<br/>\nThanks for your support in my new journey.  Joanne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":7300,"nextTopicId":7303}}