{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":139136574,"authorName":"jeanettec_99","from":"&quot;jeanettec_99&quot; &lt;jeanettec_99@...&gt;","profile":"jeanettec_99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"5 year old Wanting friends","postDate":"1206635167","msgId":31333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZzZ2hxdis4N2QzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":31332,"nextInTime":31334,"topicId":31333,"numMessagesInTopic":0,"msgSnippet":"I have a five year old (my oldest) that keeps saying that he wants a five year old friend.  He has lots of kids to play with from our preschool co-op that","messageBody":"<div id=\"ygrps-yiv-1004556777\">I have a five year old (my oldest) that keeps saying that he wants a<br/>\nfive year old friend.  He has lots of kids to play with from our<br/>\npreschool co-op that meets 2 times per week and about 8 friends in our<br/>\nneighborhood that he plays with in the afternoons.  The trouble that<br/>\nhe sees is that none of them are five, even though many of them are<br/>\nwithin days of turning five.  His other complaint is that none of them<br/>\nlike the things that he LOVES: Star Wars, LEGOS, video games, movies.<br/>\n My DH and many relatives play all of these things with him.<br/>\nI think that he really wants a buddy to do the things that he loves<br/>\nand someone that &quot;gets&quot; him (he likes having serious conversations,<br/>\nbut he also has a great sense of humor and loves to be silly). Most<br/>\nkids that we&#39;re around are nothing like him except maybe similar in<br/>\nemotional levels.  I don&#39;t think that he always needs to be around<br/>\npeople just like him, but one similar friend would be nice. <br/>\n<br/>\nThe other day my husband insisted on visiting a school to be sure that<br/>\nunschooling was the best thing for Braeden.  His concern is that since<br/>\nBraeden is so social that maybe he&#39;d be happier in a school.  We<br/>\nvisited the school and to my GRAND surprise Braeden LOVED it.  It was<br/>\na Montessori school and after the 10 minutes we were out of the room,<br/>\nwe went back in to see Braeden leading a pack of kids around the room<br/>\nshowing them the Egyptian statue and teaching them about Egypt.  All<br/>\nday he kept saying, Mom I&#39;m so HAPPY! and singing &quot;school, school&quot; to<br/>\nthe Star Wars tune and said &quot;now I&#39;ll be like a normal five year old<br/>\nbecause I&#39;ll go to school&quot;.  I really want to do what Braeden wants,<br/>\nbut I don&#39;t think that school is the best option for him and that the<br/>\nfriends are the real issue.  <br/>\n<br/>\nI love unschooling and all that it has given our family-a chance to<br/>\ntravel, unique, strong, opinionated, loving, intelligent, fun kids and<br/>\na chance to really know my kids.  I just can&#39;t come up with any other<br/>\nideas to help him meet friends.  He is not interested in any kind of<br/>\nclasses where he might meet other children.  I think that what he<br/>\nliked about these children was that 1. they were mostly five 2. many<br/>\nof them were highly verbal and thoughtful(as he is) 3. they were<br/>\nwilling to listen to what he had to say 4. some were boys (but who<br/>\nknows if they share the same interests).  No one else that he plays<br/>\nwith meets these &quot;requirements&quot;.  It doesn&#39;t seem like it would be so<br/>\ndifficult to find children like this, but we have really struggled!! <br/>\nFirst I need more ideas on how to meet better friends for him, second<br/>\nI need ideas to encourage him to try new activities and third I need<br/>\nthoughts on letting him try school even though it will be difficult<br/>\nfinancially and I don&#39;t think it&#39;s a good fit.<br/>\n<br/>\nThanks for any insight!!<br/>\nJeanette</div>","specialLinks":[]}],"prevTopicId":31254,"nextTopicId":31293}}