{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":265202862,"authorName":"Tina Layne","from":"Tina Layne &lt;tinalayne@...&gt;","profile":"tinalayne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A question for all of you","postDate":"1151647500","msgId":15097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjMwMDYwNTAwLjc2NzEzLnFtYWlsQHdlYjM3MjA4Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15096,"nextInTime":15098,"topicId":15097,"numMessagesInTopic":0,"msgSnippet":"Hi there, I ve been doing my best to unschool for a couple years, seriously for about a year.  I still have moments, I still have flaws.  But I am trying.  I","messageBody":"<div id=\"ygrps-yiv-1734523069\">Hi there,<br/>\n   <br/>\n  I&#39;ve been doing my best to unschool for a couple years, seriously for about a year.  I still have moments, I still have flaws.  But I am trying.  I think I goofed up badly today.<br/>\n   <br/>\n  Today something happened that hasn&#39;t come up before, and I instinctively went back to a traditional answer that my mom used on me.  Now, I want to take it back, and I know I can- my dd is 13 and will understand &quot;Mom was a boob&quot;.  I plan to talk to her as soon as I finish here- she&#39;s in the shower at the moment- but I don&#39;t know what to say besides &quot;Mom was a boob&quot;.  I don&#39;t know what will &quot;make it right&quot;.<br/>\n   <br/>\n  DD usually stands by her guns, but she met this new friend and for whatever reason dd hasn&#39;t been able to say &quot;You have to wait&quot;.  The new friend wants her to spend the night. I want to meet this new friend, and I want dd to be able to stay longer than 6am which means she&#39;d have to wait till Fri of this week.  We talked about this and dd was okay with it.  <br/>\n   <br/>\n  I don&#39;t know if dd just really wanted to go more than she let on, or if she really can&#39;t say &quot;Later this week&quot; to this new friend, but since Sunday these two have daily- and 2 or 3 times each day at the worst moments possible usually- come and asked me &quot;what about today?&quot;  Neither wants to have dd leave at 6am so they know later this week is best, but dd continues to try to weedle a better deal with the friend over her shoulder looking at me expectantly.  I even got asked if we could change some of our appointments, which was not possible, unfortunately as they were all medical appointments.  <br/>\n   <br/>\n  Tonight, I lost my patience and said &quot;If you don&#39;t stop harrassing me, I&#39;ll tell you no forever!&quot;<br/>\n   <br/>\n  Ouch.<br/>\n   <br/>\n  My kids ask if there&#39;s anything going on to keep them from going someplace- they don&#39;t ask if they are allowed to go someplace.  Like, &quot;when&#39;s dinner?  I want to go with Whitney to the store- do I have time?&quot;  They don&#39;t ask &quot;Will you let me go?&quot;  or they will ask, &quot;Do we have anything going on today? Is there time for me to go with Sammy to the pool?&quot;  So, to tell her &quot;I&#39;ll tell you no forever!&quot; doesn&#39;t even make sense! But I did feel harrassed- or now that I think on it, maybe just harried.  But at the moment I did feel pushed into a corner.  Probably because I was sore and tired from the gym and hungry so my blood sugar was low, and I was cranky. <br/>\n   <br/>\n  I tried to explain on Sunday, Monday, Tuesday, and yesterday why I like to meet the kids&#39; friends, and why leaving a friends house at 6am is usually not a fun or good idea for dd, the friend, or the parents of the friends. Also, dd is very cranky without certain amount of sleep, and she admits this freely. She doesn&#39;t like having friends over to our house who won&#39;t sleep at a decent hour, even.  I basically repeated myself daily, and what I was saying wasn&#39;t anything new.  My concerns over new people and her health and welfare the following day has always been understood but this time it&#39;s like dd just didn&#39;t &quot;get it&quot; which was why this was such a new experience, and I didn&#39;t handle it well at all. <br/>\n   <br/>\n  My question(s) are:<br/>\n   <br/>\n  How do I explain to dd that I felt harrassed without being so harsh?<br/>\n  How do I explain to dd that I don&#39;t know this friend all that well, and dd was acting really out of character around her and that made me uncomfortable?  <br/>\n  And, this just came to me, am I not trusting dd&#39;s ability to pick good friends so that&#39;s why I feel such a need to be sure the new people are okay?<br/>\n   <br/>\n  Thanks guys!  <br/>\n  Tina- Hawaii<br/>\n<br/>\n<br/>\nLayne Family Blog:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://threekeys.blogspot.com/\">http://threekeys.blogspot.com/</a><br/>\n<br/>\n \t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Everyone is raving about the  all-new Yahoo! Mail Beta.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":14771,"nextTopicId":15021}}