{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and nvc","postDate":"1239873618","msgId":39598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzNnQ4aSs5cHVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzMm51ZCtyOTk5QGVHcm91cHMuY29tPg=="},"prevInTopic":39558,"nextInTopic":0,"prevInTime":39597,"nextInTime":39599,"topicId":39542,"numMessagesInTopic":0,"msgSnippet":"... I definitely think it is a tool that can be used at will, or internalized if you get that proficient at it.  It really can work for you if you are agitated","messageBody":"<div id=\"ygrps-yiv-1325302753\"><blockquote><span title=\"ireply\">&gt; I was reading the other threads about this and wondered how nvc relates or interacts with unschooling?<br/>\n&gt; <br/>\n&gt; Is it simply a tool, which a family may or may not choose to use?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I definitely think it is a tool that can be used at will, or internalized if you get that proficient at it.  It really can work for you if you are agitated or angry, to help you figure out why you feel the way you do.  It can also help if you see frustration or anger in your child, to help you put on &quot;giraffe&quot; ears (sincere and deep listening from the heart) and find out what is going on inside and be able to find a way to meet the child&#39;s needs - honestly - not manipulatively as some people here might be thinking.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If an aggressive verbal stance and judgemental communication was a problem in a family, would nvc be more useful then?<br/>\n&gt; <br/>\n </span></blockquote>I believe it is definitely helpful then.  Aggression comes from fear - fear of not having your needs met.  When you use NVC effectively, you are figuring out the violence you do to yourself when you don&#39;t meet your own needs or honestly address your own fears.  When you can acknowledge what is deeply troubling you, you can then figure out that there is another way to meet your needs without forcing others to meet them, or blaming others for your own issues.  NVC can help you do the deep soul searching to let you say &quot;you&#39;re okay and I&#39;m okay and can I meet your needs and can you meet mine, and, if not, okay, now l&#39;ll figure out what else to do.  It is all about understanding that we all have choices - no right or wrong, no bad or good.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Aside from whether or not there is any intrinsic value in nvc, what are the real life benefits (if any) for the children?  I mean, other than the adult thinking to themself, I&#39;m doing the right thing cause I&#39;ve got this nvc down to a &quot;T&quot;, what is the real benefit to the people on the receiving end of it?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Boy, a LOT!  I have dissolved tantrums of my own kids, though they never had many.  And, I&#39;ve dissolved total strangers kids tantrums - just by really listening to them and understanding why they are having a melt-down and acknowledging that.  Then, after understanding, finding solutions to meet their needs - redirecting their anxiety to help them figure out exactly what they want and focus on that and then be able to act on it.  Even a two year old can acknowledge they are hungry or want to play or whatever, and then are able to indicate to their parent what they want and then what else they want.  It helps the parents not just try to stop the tantrum, but also to meet their child&#39;s need.<br/>\nIt also works for teenagers and adults!  It really is about listening from the heart - if you can get past what most people call baby-talk.  You really can progress to natural speaking if you understand the heart of it.<br/>\n<br/>\nThis doesn&#39;t mean it can&#39;t be manipulative.  Obviously others on this list have pointed out my own hypocrisy.   But, like any tool, it can be used to your benefit or your demise.  But, you wouldn&#39;t blame a hammer if it was used to kill someone.  It is still a good tool.  It just needs to be used the way it was intended.  It is not the end-all, it is one of your tools in your toolbox - mostly to help you understand youself and why you feel the way you do, and understand others and try to see past what you assume they mean to what they actually need and want.<br/>\n<br/>\nIn our family, the kids now know to point out when any of us say &quot;should&quot;.  That is a sure sign of judgment - either toward someone else or toward yourself.  If you are saying, &quot; I should have done this or that&quot; you are judging yourself and making yourself miserable.  You can substitute &quot;could&quot; for any &quot;should&quot; and find out that suddenly you or someone else actually has a choice with no judgment attached to the outcome.  I&#39;d say that is certainly unschooling and certainly how we want to interact with our children.<br/>\n<br/>\nOf course, as you have helped me figure out, you can say &quot;could&quot; and really mean &quot;should&quot; if you force the &quot;could&quot; in your direction.  It all is a matter of really listening to the heart.<br/>\n<br/>\nRemember - I am no expert.  And, any technique can be misused.  But, I believe NVC is very compatible with consensual living and unschooling.</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] unschooling and nvc","postDate":"1239752662","msgId":39558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwNDE0MTY0NGk2ZDBhMzI5ZG0zNzIxNjdmYzAyZDJiNTY4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdzMm51ZCtyOTk5QGVHcm91cHMuY29tPg==","referencesHeader":"PGdzMm51ZCtyOTk5QGVHcm91cHMuY29tPg=="},"prevInTopic":39547,"nextInTopic":39598,"prevInTime":39557,"nextInTime":39559,"topicId":39542,"numMessagesInTopic":0,"msgSnippet":"I looked at NVC for ideas, when I was working hard at leaving my familial knee-jerk reactions and in that limbo place of not knowing what to put in their","messageBody":"<div id=\"ygrps-yiv-1242186494\">I looked at NVC for ideas, when I was working hard at leaving my familial<br/>\nknee-jerk reactions and in that limbo place of not knowing what to put in<br/>\ntheir stead.<br/>\nI certainly think that NVC can be a step towards *more* peaceful<br/>\ncommunication, I honestly feel it&#39;s a step, not a place to hang out<br/>\nforever.  I feel the same way about the &quot;How to Talk so Kids will Listen&quot;<br/>\nbook - They both seem stilted and scripted and not (for me) in any way<br/>\nauthentic.<br/>\nAgain, though, they are both amazing tools that *can* lead to a peaceful<br/>\nevolutionary step in parenting.  There&#39;s an internalization necessary that I<br/>\njust missed ;)<br/>\nOnce I found Sandra Dodd&#39;s Peaceful Parenting talk (with Richard<br/>\nPrystowsky)-- now called Parenting Peacefully -- I discovered I no<br/>\nlonger needed to<br/>\nseek a script, the advice I found therein replaced any big clunky unweildy<br/>\ntools I&#39;d been looking at.  It&#39;s here -- for FREE -- to listen or download:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a> It&#39;s at the bottom of the page,<br/>\njust after my testimonial ;)<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\nOn Tue, Apr 14, 2009 at 12:25 PM, amflowers71<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eurochamp99@...\">eurochamp99@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was reading the other threads about this and wondered how nvc relates or<br/>\n&gt; interacts with unschooling?<br/>\n&gt;<br/>\n&gt; Is it simply a tool, which a family may or may not choose to use?<br/>\n&gt;<br/>\n&gt; If an aggressive verbal stance and judgemental communication was a problem<br/>\n&gt; in a family, would nvc be more useful then?<br/>\n&gt;<br/>\n&gt; Aside from whether or not there is any intrinsic value in nvc, what are the<br/>\n&gt; real life benefits (if any) for the children? I mean, other than the adult<br/>\n&gt; thinking to themself, I&#39;m doing the right thing cause I&#39;ve got this nvc down<br/>\n&gt; to a &quot;T&quot;, what is the real benefit to the people on the receiving end of it?<br/>\n&gt;<br/>\n&gt; Have had a little look on some of the nvc websites but couldn&#39;t find what I<br/>\n&gt; was looking for.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] unschooling and nvc","postDate":"1239745734","msgId":39547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZTUwNGQyLjFlMDc4ZTBhLjcyOWUuNzU2MkBteC5nb29nbGUuY29tPg==","inReplyToHeader":"PGdzMm51ZCtyOTk5QGVHcm91cHMuY29tPg==","referencesHeader":"PGdzMm51ZCtyOTk5QGVHcm91cHMuY29tPg=="},"prevInTopic":39542,"nextInTopic":39558,"prevInTime":39546,"nextInTime":39548,"topicId":39542,"numMessagesInTopic":0,"msgSnippet":"My biggest learning from NVC is the definition of violence itself:  the imposition of one s will on another. It s an extremely simple definition, and yes it","messageBody":"<div id=\"ygrps-yiv-365044858\">My biggest learning from NVC is the definition of violence itself:  the<br/>\nimposition of one&#39;s will on another.<br/>\n<br/>\nIt&#39;s an extremely simple definition, and yes it fits extremely nicely with<br/>\nunschooling.  NVC also says that No is always a valid response from the<br/>\nother, for example, which fits perfectly with radical unschooling thought.<br/>\nSo if parents use this technique willingly and compassionately with each<br/>\nother, I could see it being something the kids might choose to try also.  If<br/>\nparents speak to their children using NVC language and ideology as a means<br/>\nof self-revelation and connection, with no agenda for &quot;molding&quot; the child,<br/>\nit could be really fun and helpful to unschooling.<br/>\n<br/>\nI found NVC a few years ago, read a few books about it, etc.  At the time, I<br/>\ngot really passionate about it and wanted &quot;Us&quot; to do this.  So it was yet<br/>\nanother way I tried to control things, to get everyone (meaning, my wife) to<br/>\n&quot;talk nice&quot; and reveal the feelings and needs that were driving our<br/>\nconversations.  Today, I realize that as soon as I say anything similar to<br/>\n&quot;say it this NVC way&quot;, I&#39;m being coercive and controlling and am<br/>\ndisconnected from myself, my family, the universe, etc.  Used in this<br/>\nunconscious way, to get others to change how they talk and act and make<br/>\nchoices, it&#39;s as coercive and dis-connecting a tool as the leather belt my<br/>\nfather used to control his kids.<br/>\n<br/>\nI still use the intent, philosophy, and general flow of NVC syntax quite<br/>\noften, but mostly internally to organize my own thoughts.   -=b.</div>","specialLinks":[]},{"userId":348735811,"authorName":"amflowers71","from":"&quot;amflowers71&quot; &lt;eurochamp99@...&gt;","profile":"amflowers71","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"unschooling and nvc","postDate":"1239737101","msgId":39542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzMm51ZCtyOTk5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39547,"prevInTime":39541,"nextInTime":39543,"topicId":39542,"numMessagesInTopic":0,"msgSnippet":"I was reading the other threads about this and wondered how nvc relates or interacts with unschooling? Is it simply a tool, which a family may or may not","messageBody":"<div id=\"ygrps-yiv-1177681877\">I was reading the other threads about this and wondered how nvc relates or interacts with unschooling?<br/>\n<br/>\nIs it simply a tool, which a family may or may not choose to use?<br/>\n<br/>\nIf an aggressive verbal stance and judgemental communication was a problem in a family, would nvc be more useful then?<br/>\n<br/>\nAside from whether or not there is any intrinsic value in nvc, what are the real life benefits (if any) for the children?  I mean, other than the adult thinking to themself, I&#39;m doing the right thing cause I&#39;ve got this nvc down to a &quot;T&quot;, what is the real benefit to the people on the receiving end of it?<br/>\n<br/>\nHave had a little look on some of the nvc websites but couldn&#39;t find what I was looking for.</div>","specialLinks":[]}],"prevTopicId":39538,"nextTopicId":39592}}