{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":410771768,"authorName":"ejemama","from":"&quot;ejemama&quot; &lt;ejemama@...&gt;","profile":"ejemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do I make this work?","postDate":"1251388869","msgId":41150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3NmFrNSs1Ymo0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg3NDE0ZCtsbGpzQGVHcm91cHMuY29tPg=="},"prevInTopic":41139,"nextInTopic":0,"prevInTime":41149,"nextInTime":41151,"topicId":41132,"numMessagesInTopic":0,"msgSnippet":"Thank you all for your replies. Definitely have me thinking, for sure. The degree I m interested in is a Master s in Architecture, which I would do online (we","messageBody":"<div id=\"ygrps-yiv-346366139\">Thank you all for your replies. Definitely have me thinking, for sure. The degree I&#39;m interested in is a Master&#39;s in Architecture, which I would do online (we live in China, so not any other options).. so not really something that can be done without a degree. I&#39;m accustomed to being a night person, staying up to 1 or so to get volunteer work done on the computer - I&#39;m a director for an animal rescue org here.<br/>\n<br/>\nJust reading all of your responses made me think about why it is that I&#39;m wanting to do this, and part of it is just wanting to contribute more to my family financially - plus, i live with the fear of losing my husband - for any number of reasons. I guess I fear for that because we rely on him so much to earn money, that I&#39;m just afraid if he lost his job, or we lost him, or any number of unforeseeable things were to happen, that I wouldn&#39;t have the skills to take care of our family then.<br/>\n<br/>\nI know that it is fear based, but it is also me just wanting to be prepared. I&#39;ve taught myself some other skills (graphic design, teaching yoga..) so I should not be so quick to brush those away. I have been dreaming of going back to get my Masters, partly because I love the experience of being around others (physically or virtually :) who are passionate about doing the same thing, learning, and working to a finite goal. I know I could get a job doing anything to make some ends meet if I were in that situation, but I just would rather be more prepared to do something that I love doing... <br/>\n<br/>\nI had my first daughter when I was very young, 20 (10 years ago), so I guess it&#39;s a lot of un-lived stuff I&#39;m dealing with. However, I have found that opening up to unschooling over the last year has helped me to rediscover some of my own passions, and be in that place where I&#39;m around others who are passionate and learning: my kids! maybe it&#39;s just the part of me that fears it may all just be too good to be true.<br/>\n<br/>\n... re-reading now, and trying to not go back and delete the parts that are too honest... but I can see just from writing this that a lot of this is fear based. But not all of it. It&#39;s also that part of me that I gave up when we had kids that I need to find a way to take care of. It&#39;s also in part a desire to be respected (oh, my ego). It&#39;s also a desire to see my ideas grow into something I can walk through. <br/>\n<br/>\nI have a lot to think about, and I truly appreciate all of your time that you have spent replying to me already. I can see in my own words some answers<br/>\n<br/>\neje<br/>\n(Leah 10, Ava 5)<br/>\n<br/>\nPS. I have got to remember to breathe!</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do I make this work?","postDate":"1251313613","msgId":41139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3NDE0ZCtsbGpzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4ODM4Ny45MjE4Mi5xbUB3ZWIzNjkwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":41138,"nextInTopic":41150,"prevInTime":41138,"nextInTime":41140,"topicId":41132,"numMessagesInTopic":0,"msgSnippet":"... My thoughts were along the same lines.... If a dream/desire/passion is SO limited that it needs a $60,000 degree, I suggest it s not necessarily a true","messageBody":"<div id=\"ygrps-yiv-604335374\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, The Coffee Goddess &lt;hoffmanwilson@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; As a person who&#39;s a business owner that has NOTHING to do with my college degree, having been married to and currently married to men who also have great jobs that have NOTHING to do with their degrees, my question for you is--Why do you need this degree?  Most jobs are accessible in ways other than the standard degree program--just wondering if you have checked out other options that may work better for you AND your family and still get you the career or outlet you want in your field....<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>My thoughts were along the same lines....<br/>\n<br/>\nIf a dream/desire/passion is SO limited that it needs a $60,000 degree, I suggest it&#39;s not necessarily a true passion. Passions can be explored in a number of ways...it&#39;s something you do because you love it, not because you&#39;re going to make money or get a degree or even pursue full-time necessarily (though that can be part of it). You do it because it&#39;s inside you and you don&#39;t feel whole without it.<br/>\n<br/>\nI&#39;ll give some examples...<br/>\nI love the human body and medicine. I&#39;ve studied herbs since I was a teen, I read anatomy books, I learn, learn, learn all the time about it because I&#39;m fascinated. It&#39;s just THERE, that passion. Lives with me, in me, around me. <br/>\n<br/>\nI will probably never be a doctor or nurse. I will not pursue a degree (though I could) and I won&#39;t make my living doing this thing. But I&#39;m still learning about it and doing things that satisfy the desire. <br/>\n<br/>\nI could choose for it to take many forms...an herbal medicine class, a biology class, or just simply learning it on my own as I always have. I could start a discussion group or many other things to keep this passion alive and nourished. If your interest has ONE form (get a degree) I suggest you are seeing your interest through a very narrow frame work.<br/>\n<br/>\nYour kids grow up fast. Trust me (My oldest child is engaged to get married next year). You will never look back on their childhood and wish you&#39;d spent less time with them. NEVER.<br/>\n<br/>\nAs a working parent I long for more time at home (making it happen in baby steps currently) and I can&#39;t imagine choosing full-time anything away from my babies if I thought I had better choices. <br/>\n<br/>\nSchool is a narrow way to view the pursuing of a passion. How can you nourish and honor your needs without school? What would you do with this desire if school did not exist? If making money at the passion was not the point? How can you include your children in the pursuing of this thing? So many questions but we need more details from you at this point.:)<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How do I make this work?","postDate":"1251308083","msgId":41138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4ODM4Ny45MjE4Mi5xbUB3ZWIzNjkwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGg3MTJhcCthMmxyQGVHcm91cHMuY29tPg=="},"prevInTopic":41136,"nextInTopic":41139,"prevInTime":41137,"nextInTime":41139,"topicId":41132,"numMessagesInTopic":0,"msgSnippet":"As a person who s a business owner that has NOTHING to do with my college degree, having been married to and currently married to men who also have great jobs","messageBody":"<div id=\"ygrps-yiv-1008040355\">As a person who&#39;s a business owner that has NOTHING to do with my college degree, having been married to and currently married to men who also have great jobs that have NOTHING to do with their degrees, my question for you is--Why do you need this degree?  Most jobs are accessible in ways other than the standard degree program--just wondering if you have checked out other options that may work better for you AND your family and still get you the career or outlet you want in your field....<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"jfetteroll","from":"&quot;jfetteroll&quot; &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do I make this work?","postDate":"1251288458","msgId":41136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3MzhpYStjOGJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg3MTJhcCthMmxyQGVHcm91cHMuY29tPg=="},"prevInTopic":41133,"nextInTopic":41138,"prevInTime":41135,"nextInTime":41137,"topicId":41132,"numMessagesInTopic":0,"msgSnippet":"... You may want them to see you contributing and following a dream but what they ll actually see is Mommy has decided something else is more interesting and","messageBody":"<div id=\"ygrps-yiv-697129160\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;ejemama&quot; &lt;ejemama@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I want my daughters to see me contributing to the family, and to see me doing<br/>\n&gt;the things that I dream, too.<br/>\n<br/>\n </span></blockquote>You may want them to see you contributing and following a dream but what they&#39;ll actually see is Mommy has decided something else is more interesting and important than being with them. The more what you choose to do takes from them, from their time with you, the louder your actions will say something different than what you intend.<br/>\n<br/>\nIf you take a course one night a week, for instance, and still find ways to meet their needs rather than telling them no, you can&#39;t you have school or homework to do, the more accepting and understanding they&#39;ll be.<br/>\n<br/>\nIs there volunteer work that&#39;s similar that you could all do together? Or sell Osbourne books if you want to bring in some extra money?<br/>\n<br/>\nHow about trading and bartering for services?<br/>\n<br/>\nI can guarantee your kids don&#39;t want to trade time with you for lessons. They may want both! :-) but lessons and things aren&#39;t a substitute for being with loved ones. What if your husband decided to get a second job that kept him away evenings and much of the weekends so you could go on fancy vacations? Would that feel like a great trade? Would it feel warm and squishy that he was contributing so much more to the family?<br/>\n<br/>\nYou might want to draw them more into the family finances, what goes to groceries and utilities and savings and so forth and what&#39;s left over for the other things. They may come up with creative solutions you wouldn&#39;t have thought of :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do I make this work?","postDate":"1251244934","msgId":41133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3MXUyNisxZWdvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg3MTJhcCthMmxyQGVHcm91cHMuY29tPg=="},"prevInTopic":41132,"nextInTopic":41136,"prevInTime":41132,"nextInTime":41134,"topicId":41132,"numMessagesInTopic":0,"msgSnippet":"... *************************** We used to have an emergency fund, until a series of small emergencies came along and ate it. Now we re slowly rebuilding","messageBody":"<div id=\"ygrps-yiv-1517588205\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;ejemama&quot; &lt;ejemama@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I am hesitant to take a loan for myself for fear of not having money for travel, kids needs, college if they want to go... Also, we don&#39;t have this great &quot;emergency fund&quot; that everyone is talking about now, but we also have no debt.<br/>\n </span></blockquote>***************************<br/>\n<br/>\nWe used to have an emergency fund, until a series of small emergencies came along and &quot;ate&quot; it. Now we&#39;re slowly rebuilding that, but we still take some time and money to do a little travelling and do things that we want to do. Its not really possible to second guess the future. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want to go back to school (well, to get a degree that will take 3 years to complete and costs about $60000) but, having 2 daughters (10 years & 5 years old) <br/>\n </span></blockquote>*************************<br/>\n<br/>\nCan you wait a few more years? Until your kids are a little older, I mean? Older kids take less of your time and energy, directly, so you&#39;ll have more options in a few years. In the mean time, can you take any of the coursework online?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Not wanting to be selfish, and putting our family in debt.<br/>\n<br/>\n </span></blockquote>I guess the big question, there is Why do you want this degree? Is it for your own pleasure/enjoyment? I&#39;m not asking that as a way to put it down as &quot;selfish&quot; but it can change whether or not you actually Need to pursue an actual degree. There may be other avenues for you to pursue the same interest, or something close, without going to school. If you have a specific career in mind and it requires a degree, that&#39;s a different issue. It may be helpful, in that case, to look into any kind of work you can do for a couple years (part time, volunteer...I have no idea what you want to do so this is pure speculation) that&#39;s in the same field. Doing that A. gives you a taste of the work so you don&#39;t go down a blind alley with the degree and B. looks good both on a college aplication and a future resume. <br/>\n<br/>\nPersonally, I don&#39;t think selfishness is a Bad thing necessarily, but there are sometimes ways to eat your cake and have it, too.<br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":410771768,"authorName":"ejemama","from":"&quot;ejemama&quot; &lt;ejemama@...&gt;","profile":"ejemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How do I make this work?","postDate":"1251216537","msgId":41132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3MTJhcCthMmxyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41133,"prevInTime":41131,"nextInTime":41133,"topicId":41132,"numMessagesInTopic":0,"msgSnippet":"Hi, I ve been thinking about writing this post for a few months now. Not entirely related to unschooling, but then again it is. I just want to know if anyone","messageBody":"<div id=\"ygrps-yiv-243711012\">Hi,<br/>\nI&#39;ve been thinking about writing this post for a few months now. Not entirely related to unschooling, but then again it is.<br/>\n<br/>\nI just want to know if anyone has any suggestions for balancing your own needs/wants with that of your children. I want to go back to school (well, to get a degree that will take 3 years to complete and costs about $60000) but, having 2 daughters (10 years & 5 years old) I am hesitant to take a loan for myself for fear of not having money for travel, kids needs, college if they want to go... Also, we don&#39;t have this great &quot;emergency fund&quot; that everyone is talking about now, but we also have no debt.<br/>\n<br/>\nSo the holdups are 1. money, 2. time (and energy not spent being with my kids), though I feel like quality time spent being present with them is more powerful than being together all the time... 3. Not wanting to be selfish, and putting our family in debt.<br/>\n<br/>\nI want my daughters to see me contributing to the family, and to see me doing the things that I dream, too. They have some very expensive interests (horseback riding, for one) and I just don&#39;t see how I can make it all work. We&#39;ve asked their grandparents to give horseback lessons as birthday gifts, so that may help solve that.<br/>\n<br/>\nI guess I&#39;m just stuck. Can anyone offer a gentle nudge or a slap in the face?</div>","specialLinks":[]}],"prevTopicId":41143,"nextTopicId":41120}}