{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":80776775,"authorName":"Kelly Nishan","from":"&quot;Kelly Nishan&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: deschooling & family bed","postDate":"1218724592","msgId":35385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4MWZ0ZytlaXNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4QTM2RDhFLjQwMTAwMDBAZ21haWwuY29tPg=="},"prevInTopic":35377,"nextInTopic":0,"prevInTime":35384,"nextInTime":35386,"topicId":35373,"numMessagesInTopic":0,"msgSnippet":"Hi Robin My daughter slept with me on and off until she was 11 or 12.  Most of the time it was just the two of us so couple time wasn t really an issue.  If I","messageBody":"<div id=\"ygrps-yiv-1336200307\">Hi Robin<br/>\nMy daughter slept with me on and off until she was 11 or 12.  Most of <br/>\nthe time it was just the two of us so couple time wasn&#39;t really an <br/>\nissue.  If I had a partner at the time coupling was done at his house <br/>\nor when she wasn&#39;t home.  We did have a 2 year period that I lived <br/>\nwith boyfriend.  Most of that time her bed was in our room because his <br/>\nson also moved in with us.  SHe was 5-7yo during that time.  It was <br/>\ngood arrangement for us because she was close enough to me to feel <br/>\ncomfortable and if she needed to she could crawl in for a cuddle then <br/>\nwould go back to her bed.  Maybe that would work for you if you <br/>\ngranddaughter was ok with it.<br/>\nKelly</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] deschooling & family bed","postDate":"1218717151","msgId":35377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODE0MDUzMnA3ODM1MTQ4M3diNjIzZWU3NWJjMjc2ZGViQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDIyNzE4MTY0LTA1NUYtNDM5RS05MjZCLUFDRTg3MTQ3MEFBMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDQ4QTM2RDhFLjQwMTAwMDBAZ21haWwuY29tPgkgPDIyNzE4MTY0LTA1NUYtNDM5RS05MjZCLUFDRTg3MTQ3MEFBMUB2ZXJpem9uLm5ldD4="},"prevInTopic":35375,"nextInTopic":35385,"prevInTime":35376,"nextInTime":35378,"topicId":35373,"numMessagesInTopic":0,"msgSnippet":"I don t personally have experience to relate, but I have the example of friends of ours.  Their daughter slept with them until she was 11.  As she had from","messageBody":"<div id=\"ygrps-yiv-487370687\">I don&#39;t personally have experience to relate, but I have the example of<br/>\nfriends of ours.  Their daughter slept with them until she was 11.  As she<br/>\nhad from birth.  My impression of her then (14 years old) was a very<br/>\nself-determined confident child and now she&#39;s about 21 or 22.  I didn&#39;t know<br/>\nuntil she was 14 that they had ever co-slept.<br/>\n<br/>\nThe family bed is a microcosm representing all of a child&#39;s life.  First<br/>\nthey leave the family bed, then the family home, sometimes the hometown, or<br/>\neven the country.  Similarly, a child learns to walk, to run, to ride a<br/>\nbike, scooter, skateboard and so on, to drive and travel off.<br/>\n<br/>\nNothing to be in a hurry about.<br/>\n<br/>\nWith the attachment parenting/ unschooling thought, the basic idea is to be<br/>\navailable all through a child&#39;s life so that the child can venture out from<br/>\na secure base.  If parents make the decision when a child is to venture out,<br/>\nthen the child will be insecure and will cling more desperately.  If child<br/>\nmakes the decision when to venture out, the child will feel welcome and at<br/>\nhome, and will be able move on, sometimes (maybe frequently ;) before<br/>\nparents are ready.<br/>\n<br/>\nFrom what you have written it sounds to me like living with her mother is<br/>\nscary.  You are who she knows and trusts but if you push her out, she will<br/>\nlikely think that she can can&#39;t trust you, that you&#39;re not supportive of<br/>\nher, that you don&#39;t want her.<br/>\n<br/>\nHer birth mother has decided she wants her kids to live with her<br/>\neven though they have lived with my partner their whole lives and we<br/>\nhave had sole physical and legal custody for the past five years.<br/>\n<br/>\nQuestions to ponder for yourself, and not anything I want answers for:  Is<br/>\nthe mother&#39;s decision about seeking custody?  How much leeway do you have to<br/>\nsupport the child&#39;s decision in all this?  How about visiting rather than<br/>\nsuddenly moving a child at the age of 9 to a mother she has little or no<br/>\nrecollection of?<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] deschooling & family bed","postDate":"1218707061","msgId":35375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyNzE4MTY0LTA1NUYtNDM5RS05MjZCLUFDRTg3MTQ3MEFBMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ4QTM2RDhFLjQwMTAwMDBAZ21haWwuY29tPg==","referencesHeader":"PDQ4QTM2RDhFLjQwMTAwMDBAZ21haWwuY29tPg=="},"prevInTopic":35373,"nextInTopic":35377,"prevInTime":35374,"nextInTime":35376,"topicId":35373,"numMessagesInTopic":0,"msgSnippet":"... I think the biggest help will be a shift in perspective from night time being couple time. It s certainly *convenient* then but it s not the only time it","messageBody":"<div id=\"ygrps-yiv-1271849636\">On Aug 13, 2008, at 7:26 PM, Robin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have accepted her need and desire to have family to sleep with  <br/>\n&gt; and am<br/>\n&gt; content with that, but my partner is less committed and would kind of<br/>\n&gt; like to have the bed to ourselves (especially for couple time).<br/>\n<br/>\n </span></blockquote>I think the biggest help will be a shift in perspective from night  <br/>\ntime being couple time. It&#39;s certainly *convenient* then but it&#39;s not  <br/>\nthe only time it can happy. It&#39;s funny but when I first started  <br/>\nreading about the family bed most of the posts were from couples with  <br/>\nlarge families. They were obviously finding *plenty* of time for  <br/>\nsnuggling outside of night time! ;-)<br/>\n<br/>\nA question to ask, to put it in perspective, is &quot;Is your grandchild&#39;s  <br/>\nfear and discomfort a worthy trade for the convenience of couple time  <br/>\nat night?&quot;<br/>\n<br/>\nMy daughter was with us until she was 14, I think. And the reason she  <br/>\nmoved out at that age was to be with the ferrets that moved into her  <br/>\nroom. ;-)<br/>\n<br/>\n(Which, combined with her problems sleeping over at friends&#39; houses,  <br/>\nwould certainly sound alarm bells in most conventional parents that  <br/>\nshe&#39;d never be independent. Yet the next summer she flew halfway  <br/>\nacross the US for a 2 week car design camp at a college in Detroit  <br/>\nand never had a moment&#39;s homesickness.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"deschooling & family bed","postDate":"1218669966","msgId":35373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4QTM2RDhFLjQwMTAwMDBAZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":35375,"prevInTime":35372,"nextInTime":35374,"topicId":35373,"numMessagesInTopic":0,"msgSnippet":"We are just starting to deschool after homeschooling for about 2 years. We are also an unusual family, in that I didn t join until the youngest was almost 3yo.","messageBody":"<div id=\"ygrps-yiv-1879861037\">We are just starting to deschool after homeschooling for about 2 years. <br/>\nWe are also an unusual family, in that I didn&#39;t join until the youngest <br/>\nwas almost 3yo. She immediately bonded with me (even with her mentally <br/>\nill mother still living with the family) but there were issues with how <br/>\nthe birth mother was handling bed time, especially for the youngest. She <br/>\nwould single her out and put her to bed early (pretty much everything <br/>\nthe toddler did annoyed her) at the other end of the house in her <br/>\n&quot;sister&#39;s bed&quot;. The sister was sleeping with grandma until I came along <br/>\nand needed the spot: then the older dd slept in the lower bunk in the <br/>\nkids room and the youngest slept in the living room with the mother. <br/>\nWhen either girl was scared in the night they walked by their mother and <br/>\ncame to grandma and me (the youngest actually had to walk around her <br/>\nmother to come to our door).<br/>\n<br/>\nWhen we moved out with the kids, the girls were 4 and 6. They slept in <br/>\ntheir own room in bunk beds although it took some convincing to get the <br/>\nyoungest to sleep in her own bed (we weren&#39;t unschooling and had never <br/>\nheard of attachment parenting at that time--we just wanted our privacy <br/>\nand to not be elbowed in the night!). The youngest was never really <br/>\nhappy sleeping alone and when we rearranged the house so the girls each <br/>\nhad their own room they started sleeping together in one bed. This has <br/>\ncontinued to our most recent move, where they again have their own rooms <br/>\nand the dd11 doesn&#39;t want to sleep with her younger sister anymore, SO <br/>\nthe 9yo dd has recently returned to our bed.<br/>\n<br/>\nThere&#39;s also a lot going on in her life at the moment that&#39;s upsetting <br/>\nher. Her birth mother has decided she wants her kids to live with her <br/>\neven though they have lived with my partner their whole lives and we <br/>\nhave had sole physical and legal custody for the past five years. This <br/>\nis deeply upsetting them. This is especially hitting the youngest <br/>\nhard--she doesn&#39;t even remember living with her mom.<br/>\n<br/>\nI have accepted her need and desire to have family to sleep with and am<br/>\ncontent with that, but my partner is less committed and would kind of <br/>\nlike to have the bed to ourselves (especially for couple time). I&#39;m <br/>\nhoping that dd9 is just needing the comfort and reassurance of the <br/>\nfamily bed at least partly because she was forced out before she was <br/>\nready earlier but has anyone had a similar experience of an older child <br/>\nsleeping with parents? I realize writing this that I am more goal <br/>\noriented than I realized--I say &quot;family bed&quot; but I still think &quot;our bed&quot; <br/>\nand want to know what to do to &quot;get her out of it.&quot; Yuck! I need to see <br/>\nthis in a new light somehow.<br/>\n<br/>\nI did have the feeling a few months ago of realizing that even the <br/>\nyoungest would be &quot;too old&quot; (my thought at the time) to want to sleep <br/>\nwith us soon and I cherished her sleeping with us but that feeling has <br/>\nbeen hard to sustain.<br/>\n<br/>\nI would appreciate any thoughts others had that might help me understand <br/>\nthe family bed concept and how my partner and I could be more <br/>\ncomfortable sharing our bed with our growing daughter. The web sites I <br/>\nfound on the family bed all talk about toddlers (which I regret I didn&#39;t <br/>\nread when the kids were younger!)<br/>\n<br/>\nThanks in advance!<br/>\nRobin<br/>\n-- <br/>\nThink you can&#39;t afford solar--Think Again! check out:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jointhesolution.com/livinggaia\">http://www.jointhesolution.com/livinggaia</a></div>","specialLinks":[]}],"prevTopicId":35367,"nextTopicId":35391}}