{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":218723865,"authorName":"taliasafa","from":"&quot;taliasafa&quot; &lt;taliasafa@...&gt;","profile":"taliasafa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is 2 too young..","postDate":"1159230728","msgId":17593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVmOXNlOCtvYTcwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg=="},"prevInTopic":17518,"nextInTopic":0,"prevInTime":17592,"nextInTime":17594,"topicId":17507,"numMessagesInTopic":0,"msgSnippet":"I am struggling with the usual 2 yr old struggles and finding ... My son (2.75 years old) has always been hard to get clothes on and off of or to keep on. He","messageBody":"<div id=\"ygrps-yiv-110977674\">I am struggling with the usual 2 yr old struggles and finding <br/>\n<blockquote><span title=\"ireply\"> &gt; myself in the &quot;do this or we cant do this&quot; for example... put your <br/>\n&gt; clothes on so we can leave..and finding that I repeat a million times <br/>\n&gt; and become impatien using the &quot;fine well stay home&quot;but of course we go <br/>\n&gt; with me finally getting him dressed etc...How do you work with those <br/>\n&gt; basic topics daily<br/>\n<br/>\n </span></blockquote>My son (2.75 years old) has always been hard to get clothes on and off<br/>\nof or to keep on. He used to cry horribly when we would put things<br/>\nover his head and I would often avoid it with button-down shirts. Now<br/>\nhe still says &quot;no&quot; oftentimes if I ask him if he wants to put<br/>\nsomething on. I usually don&#39;t ask him and most of the time I say, &quot;Can<br/>\nI ask you a question? (to get his attention) What color is my shirt?&quot;<br/>\nor &quot;What did we do today?&quot; or some other question to get him thinking<br/>\nabout something other than the shirt going over his head or pants<br/>\ngoing on. He still likes to take his pants and underwear off<br/>\ncompletely when he uses the bathroom and flick them away with his foot<br/>\nor hand. Then I leave him alone for a while and he may or may not let<br/>\nme put them back on. If I have some good reason to put things on he<br/>\nwill also consent, like, &quot;So and so is coming to the door. They don&#39;t<br/>\nlike it when you don&#39;t have underwear on or they don&#39;t want to see<br/>\nyour penis.&quot; He is so excited when people come over that he will do<br/>\njust about anything if I can get him to stand still. I also might my<br/>\nson, they where you are going they will expect such and such clothing<br/>\nor something. Or I talk about what picture is on his shirt and how<br/>\nneat it is as I am putting it on him. He loves small balls, so<br/>\nsometimes just putting a marble or small ball in his hand will<br/>\ninterest him enough to not think about me dressing him.<br/>\n<br/>\nI have also done the &quot;dress when we get there or &quot;dress in whatever<br/>\nelse we need to get on when we get there in the car&quot; thing. I usually<br/>\ngive him a bath at night (but sometimes not, if I know he will fuss<br/>\nbecause he is too tired--bath time is a whole other set of avoid the<br/>\nstruggle games) and often dress him in comfortable street clothes. The<br/>\ntemperature in our house can change drastically from the day to the<br/>\nnight (it is still under construction), so that hasn&#39;t been so common<br/>\nrecently. His pajamas will come off in the morning easily because he<br/>\nwill need to use the bathroom and because he knows he feels hot. He<br/>\nwill then walk around half dressed for a while. He has not yet been<br/>\nable to put on his own clothes and he isn&#39;t really interested or he<br/>\nfinds it frustrating enough not to want to work on it.<br/>\n<br/>\nI will close with sharing one of the playful things I do with him to<br/>\nget him to stop being &quot;no, no, no&quot; about doing something in the<br/>\nmoment. Sometimes I will ask him something like, &quot;Do you want to put<br/>\non these pant or should I&quot; and I proceed to attempt to put the pants<br/>\nmyself and he will say, &quot;No, I want to put them on.&quot; Depending on how<br/>\nhe feels he could be laughing or be a bit pouty about it until he<br/>\nlightens up. And I might play with him a little more and say, &quot;Oh, are<br/>\nyou sure? I think they will look really nice on me&quot; until he is<br/>\ndemanding to have them put in HIM. Or maybe I will say, &quot;Do these<br/>\npants go on your head or do they go on your legs&quot; and I put them on<br/>\nhis head and he says, &quot;They go on my legs&quot;. I just basically make him<br/>\nforget about his struggle that keeps us from doing something and he<br/>\ngets in a better mood. I might do this with food and ask if it should<br/>\ngo in his ear or mouth or accidentally miss his mouth a few times. I<br/>\nplay the &quot;boob&quot; and he feels good about knowing the way things should<br/>\nbe because I am so silly and don&#39;t have a clue. <br/>\n<br/>\nOr naps...never wants to but once we go to hhis room and read <br/>\n<blockquote><span title=\"ireply\"> &gt; and I say goodnight he sleeps...thanks for the ideas! Natalie<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We have had not much success with naps even when he is obviously<br/>\nneeding one and exhausted. I just can&#39;t make him go to sleep so, we<br/>\neither have a few attempts at trying to sleep or he sleeps. My son<br/>\nwill sometimes calm down even in the middle of the night when he is<br/>\nupset, if he has a marble put in his hand. Maybe you have some small<br/>\ninteresting (but doesn&#39;t require a long term engagement) thing and put<br/>\nit in his hand as you pick him up, hoping it will tear him away from<br/>\nwhatever else he was doing, and talk about it as you walk into the<br/>\nbedroom. Then once you are there you interest him in a favorite book.<br/>\n<br/>\nHope this helps!<br/>\n<br/>\n_talia</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Is 2 too young..","postDate":"1158842783","msgId":17518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVldTFpditiYTlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg=="},"prevInTopic":17517,"nextInTopic":17593,"prevInTime":17517,"nextInTime":17519,"topicId":17507,"numMessagesInTopic":0,"msgSnippet":"Give yourself plenty of time and give him plenty of help if there is a valid time constraint (external appointments for doctor, dentist, meeting Dad for lunch,","messageBody":"<div id=\"ygrps-yiv-944531950\">Give yourself plenty of time and give him plenty of help if there is <br/>\na valid time constraint (external appointments for doctor, dentist, <br/>\nmeeting Dad for lunch, whatever). Also, make sure YOU are rested, <br/>\nfed, dressed, prepared to leave BEFORE even starting to dress, feed, <br/>\netc your 2 yr old. At the very least, do it together. I know that <br/>\nfor me, if it&#39;s a first thing in the morning thing, I need to <br/>\nshower, eat and get myself together before I can interact with DS <br/>\n(who is now 8) on a reasonable level. If I&#39;m hungry, still bleary <br/>\neyed from just waking, etc. I can quickly get grumpy and lose <br/>\npatience. So, I just plan in time to get myself stable before moving <br/>\non to DS (who sometimes still wants me to help him dress or undress, <br/>\nso I do - that&#39;s something to note I suppose - just because a child <br/>\nCAN do something doesn&#39;t mean we have to require them to always do <br/>\nit, and this especially applies to the things &quot;they&quot; say kids <br/>\nare &quot;supposed to&quot; do by themselves by x age). BTW DS still prefers <br/>\nto sleep nekkid so we rarely have the out of clothing-into pjs-out <br/>\nof pjs-into clothing situation - he just gets nekkid, sleeps, then <br/>\ngets dressed when/if he chooses in the morning (as mornings get <br/>\ncooler it&#39;s more likely, the gameroom in the basement gets chilly - <br/>\nthough sometimes he just curls under a blanket with just his arms <br/>\nout to hold the controller). <br/>\n<br/>\nPlaying games can help too - I remember vividly one time when he was <br/>\nabout 3 and I was pajama-ing him for bed (it was the dead of winter <br/>\nhere in New England) and I played &quot;fish&quot; with him - he crawled <br/>\naround on the floor and I dangled a bit of yarn down from the couch <br/>\nI was on. He &quot;bit&quot;(grabbed with his hands) on the yarn and I&#39;d &quot;reel <br/>\nhim in&quot;. Sometimes he&#39;d get away. Then one time I really &quot;caught&quot; <br/>\nhim and scooped him onto the &quot;boat&quot; (couch). Then I started peeling <br/>\noff his day clothing and talking about &quot;cleaning the scales off the <br/>\nfish&quot; and a little belly tickling for &quot;cleaning the inside of the <br/>\nfish&quot;. Then I &quot;dipped him in breading&quot; (putting the pjs on) and <br/>\nscooped him up and &quot;into the pan&quot; (his bed). Then a bit of belly <br/>\ntickling again as I pretended to &quot;eat&quot; this tasty &quot;fish&quot;. All <br/>\nthrough it was relaxed, casual, lots of giggling and being silly.<br/>\n<br/>\nRelaxed is really important for us - if we start to rush, DS feels <br/>\nthe tension and reacts to it. <br/>\n<br/>\n&quot;do this or we can&#39;t do that&quot; but then you end up dressing him and <br/>\ngoing anyhow - lots of energy involved (negative energy). Why not <br/>\njust say &quot;Let&#39;s go to the park. Here are your clothes, let me help <br/>\nyou get dressed&quot; and go ahead and do it and go - no repetitions, <br/>\nwarnings, threats, stresses. Maybe even talk about what he wants to <br/>\ndo when you get there -AS you are dressing him.<br/>\n<br/>\nAnd keep the days simple as much as possible. We found that any more <br/>\nthan about 2 or 3 &quot;doings&quot; in a day was too much for DS. A &#39;doing&#39; <br/>\nmight be 2 or 3 hours at park or a 10 minute drive to the ATM and <br/>\nback to, so it wasn&#39;t so much how long it was but rather just <br/>\nthe &quot;doing&quot;, going, scheduling of it that got to be too much. At 2, <br/>\nkids really don&#39;t need a &quot;full&quot; schedule - they mostly need lots of <br/>\nparent-time with free time to explore - and it need not be <br/>\nanything &#39;big&#39; to explore - a stepstool, a sink, a cheap battery <br/>\npowered toothbrush and a paper cup can be hours of play (BTDT).<br/>\n<br/>\nNexst time you are about to say &quot;Do this or we can&#39;t do that&quot;, stop <br/>\na minute and see if that is actually true. There are not a lot of <br/>\nthings that have that exact either/or situation. For things that do, <br/>\nthen it&#39;s not a &#39;threat&#39; it&#39;s a statement of fact - for instance, DS <br/>\nlearned early on that if he wanted to go INTO the mini-mart, the <br/>\ngrocery store, a restaurant, he was required to wear shoes (they <br/>\neven have signs on the doors to that effect). No shoes, no going in. <br/>\nBut, there were alternatives too - go through a fast food drive <br/>\nthru, order a pizza to the house, stay home with Daddy while I went <br/>\nto the grocery store (or vice versa), etc. Even at toddler age, you <br/>\ncan brainstorm ideas. As someone said already, too many choices -at <br/>\nonce- can be overwhelming BUT if you work it through one step at a <br/>\ntime it can be doable &quot;Let&#39;s go to the market and get <br/>\nmarshmallows ... gotta have shoes for that ... don&#39;t want sneakers? <br/>\nok ... hmm what about these sandals or these water shoes? would that <br/>\nbe more comfortable? ... none of that huh? so what can we do? the <br/>\nmarket requires shoes when we go in (possible additional comments <br/>\nmight include &quot;those floors are pretty grubby, I wouldn&#39;t want to <br/>\nget that on my toes&quot; or whatever in line with the market&#39;s policy on <br/>\nshoes). So, we want marshmallows but you don&#39;t want shoes ... how <br/>\nabout you stay here with Daddy and I&#39;ll go get some really fast? (or <br/>\nvice versa or if one parent is already out of the house and has a <br/>\ncell phone a quick call can handle it - &quot;Hey DH, can you stop and <br/>\nget some marshmallows on the way home? Thanks&quot;)<br/>\n<br/>\nOkay long and rambling...sorry. <br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Is 2 too young..","postDate":"1158841941","msgId":17517,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwN0E3NDBELTBEQTktNDlGRS1BRjBDLTNCMzQ1QTM4MDZEN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg==","referencesHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg=="},"prevInTopic":17516,"nextInTopic":17518,"prevInTime":17516,"nextInTime":17518,"topicId":17507,"numMessagesInTopic":0,"msgSnippet":"... I didn t start at birth. Though admittedly Kathryn was an easy baby and I only had one so it made it easier to say yes rather than no. ... It helps a lot","messageBody":"<div id=\"ygrps-yiv-940892071\">On Sep 20, 2006, at 5:48 PM, neamonn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am wondering how many of you sarted this process at<br/>\n&gt; birth..<br/>\n<br/>\n </span></blockquote>I didn&#39;t start at birth. Though admittedly Kathryn was an easy baby  <br/>\nand I only had one so it made it easier to say yes rather than no.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am struggling with the usual 2 yr old struggles and finding<br/>\n&gt; myself in the &quot;do this or we cant do this&quot;<br/>\n<br/>\n </span></blockquote>It helps a lot to not see respectful parenting as a way to get a  <br/>\nchild to do what you want or create a more compliant child who sees  <br/>\nthe world through your understanding.<br/>\n<br/>\nIt helps a lot to see respectful parenting as a way of forging a  <br/>\nbetter relationship between you two. To become his partner in his  <br/>\nexploration of the world rather than his adversary or molder.<br/>\n<br/>\n*As a side effect* of being more respectful, of respecting their  <br/>\nexpressions of frustration and requests as being important to them we  <br/>\nbecome people our kids respect. When they&#39;re confident that we put  <br/>\nmeeting their needs at the top of our list then we become people our  <br/>\nkids want to do things for.<br/>\n<br/>\nBut at 2, yes, he&#39;s too young to see why you place importance on the  <br/>\nthings you do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; for example... put your<br/>\n&gt; clothes on so we can leave..<br/>\n<br/>\n </span></blockquote>To him the &quot;need&quot; to put on clothes in order to go somewhere is  <br/>\nridiculous. Rather than setting your goal as getting him to  <br/>\nunderstand why *you* think it&#39;s necessary and, therefore, he should  <br/>\ntoo, try to see it from his point of view. How could your husband get  <br/>\nyou to bake a cake from scratch before you can go on vacation? How  <br/>\ncould he get you to understand how &quot;necessary&quot; and &quot;important&quot; it is?  <br/>\nWould getting angry at you help? Would leaving it up to you help?  <br/>\nWould angrily slamming around the kitchen doing it &quot;for you&quot; help you  <br/>\nunderstand? Would it make you want to bake a cake before you went on  <br/>\nvacation next time? Would it make you ever want to bake a cake?<br/>\n<br/>\nHis reactions make perfect sense when you see the world through his  <br/>\neyes. You can&#39;t make him see from an adult understanding. That comes  <br/>\n*naturally* as adulthood comes. We don&#39;t need to train it into them!  <br/>\n(But we can do things to make kids anxious to leave home so they  <br/>\ndon&#39;t have to abide by ridiculous rules that make no sense.)<br/>\n<br/>\nIn the meantime you can see it as something that&#39;s important to you.  <br/>\nYou can find ways (as others suggested) of making it less annoying  <br/>\nfor him. My daughter slept in her t-shirts and sweat pants so she was  <br/>\nalways ready to go :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and finding that I repeat a million times<br/>\n<br/>\n </span></blockquote>Which is an answer to your question of whether he&#39;s too young. You  <br/>\nshouldn&#39;t be asking us! ;-) He&#39;s already answering your question for  <br/>\nyou.<br/>\n<br/>\nProbably the most important &quot;lesson&quot; of respectful parenting is  <br/>\nlearning to *listen* to our kids. To hear what they&#39;re trying to say  <br/>\nto us rather than tuning in just enough to check if they&#39;re actions  <br/>\nand words indicate they&#39;ve understood and agree with what we&#39;re  <br/>\ntrying to get them to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but getting ready before we are too late is<br/>\n&gt; rough!!<br/>\n<br/>\n </span></blockquote>Raising kids *is* rough. It&#39;s less rough if we see that what we do  <br/>\nfor them is our gift to them. A gift that we want to give them and  <br/>\nprovide for them because we love them, not because we want or expect  <br/>\nit to be appreciated.<br/>\n<br/>\nIf we want to create a gourmet meal from scratch that will take 2  <br/>\nhours to prepare we should not plunk it down and expect them to  <br/>\nappreciate the 2 hours of work that went into it. It should be a gift  <br/>\nfree of strings. It should be given because we *want* to do it,  <br/>\nbecause that&#39;s how we wanted to spend that 2 hours.<br/>\n<br/>\nYou&#39;re giving him the gift of out of the house activities. Part of  <br/>\nyour preparation for the gift will be preparing him as gently as  <br/>\npossible. (We wouldn&#39;t want gift givers to make us jump through  <br/>\ntortorous hoops to get the gift they wanted us to appreciate!) Your  <br/>\npayback for your effort will be his enjoyment. Watch for it and revel  <br/>\nin it. :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Is 2 too young..","postDate":"1158840010","msgId":17516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzYwMWM2ZGQ3NSQ3ZDg1MmRmMCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg=="},"prevInTopic":17514,"nextInTopic":17517,"prevInTime":17515,"nextInTime":17517,"topicId":17507,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1497599528\">&lt;... put your <br/>\nclothes on so we can leave..and finding that I repeat a million times <br/>\nand become impatien using the &quot;fine well stay home&quot;but of course we go <br/>\nwith me finally getting him dressed etc...How do you work with those <br/>\nbasic topics daily..because I will ask him if he wants to to A, B C <br/>\nand he always says yes..but getting ready before we are too late is <br/>\nrough!!&gt;<br/>\n<br/>\n <br/>\n<br/>\nWhy not just dress him to begin with?  He�s two years old.  Just because he<br/>\nCAN dress himself doesn�t mean he should have to.  Trust me, you won�t be<br/>\ndressing him when he�s 18 still.  And why not just go lie down with him for<br/>\nsome quiet time when he�s tired?<br/>\n<br/>\n <br/>\n<br/>\nAngela S.<br/>\n<br/>\nHYPERLINK &quot;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\nLife Is Good!<br/>\n<br/>\n<br/>\n--<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.405 / Virus Database: 268.12.4/449 - Release Date: 9/15/2006<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.405 / Virus Database: 268.12.4/449 - Release Date: 9/15/2006<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280005589,"authorName":"Solé","from":"=?ISO-8859-1?Q?Sol=E9?= &lt;solelokuai@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Is 2 too young..","postDate":"1158823486","msgId":17514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxQkNDMTNGLUIwRDYtNEI2Ny04MzlFLUJFMDVCQTZDMUI1RkBnbWFpbC5jb20+","inReplyToHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg==","referencesHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg=="},"prevInTopic":17513,"nextInTopic":17516,"prevInTime":17513,"nextInTime":17515,"topicId":17507,"numMessagesInTopic":0,"msgSnippet":"Hello Natalie, I think what helps is doing things together. I don t mean you help him dressing – that too – but I mean YOU get dressed. Don t get dressed","messageBody":"<div id=\"ygrps-yiv-1789770926\">Hello Natalie,<br/>\n<br/>\nI think what helps is doing things together. I don&#39;t mean you help  <br/>\nhim dressing – that too – but I mean YOU get dressed. Don&#39;t get  <br/>\ndressed before he wakes up... he probably sees you in your normal  <br/>\nclothes when HE goes to bed, and when he wakes up you are again in  <br/>\nclothes – so he might not understand that you DO change clothes in  <br/>\nbetween. Why should he change clothes? Another thing is that for a 2  <br/>\nyr old, it might seem arbitrary to have put a t-shirt and trousers  <br/>\nOFF to put others on. For such a young child the &quot;pyjamas&quot; are just  <br/>\nanother pair of t-shirt and trousers, I guess. So maybe you could  <br/>\nfind pyjamas which look like... training pants? So you can just go  <br/>\nout in these, change when you bathe him or on another occasion. Or  <br/>\nuse training pants as pyjamas. Or don&#39;t use pyjamas! Or let him go  <br/>\nout in pyjamas – I have read several times here that their youngest  <br/>\ngo out in pyjamas :-) Or naked and clothe on the way. Maybe he just  <br/>\nwants to do it for once, and then never again :-) It may sound  <br/>\nawkward to you but think about it, actually it&#39;s only YOU who wants  <br/>\nhim to get dressed, not him. So either you let him do what he wants,  <br/>\nor you find ways which could possibly suit you both. Although I  <br/>\nwasn&#39;t unschooling at the time, when my daughter was younger, we  <br/>\nwould always dress together and make it a game (she always won). We&#39;d  <br/>\npick clothes together, and now, unschooling, I would let her pick my  <br/>\nclothes and I&#39;d pick hers – or she&#39;d pick all, or we&#39;d pick together.<br/>\n<br/>\nMy son is 1 now and I don&#39;t have these &quot;problems&quot; yet, but I have  <br/>\nbeen thinking a lot about it because at this age, we can&#39;t seem to  <br/>\nreason with them and explain why they&#39;d have to put anything on or  <br/>\nbathe or eat or do whatever. So i#ve been trying to see it from their  <br/>\nperspective and I&#39;ve been thinking of ways how I&#39;d do it. And if I  <br/>\nlook back, the things which worked best until now (even not  <br/>\nunschooling, I should have found out way earlier that things work  <br/>\nbetter this way), is when we did things together. Go sleeping  <br/>\ntogether, bathe together, clothe together, eat together, play  <br/>\ntogether, clean up together. So then you won&#39;t have to &quot;make him&quot; do  <br/>\nanything, he&#39;ll just copy you, because he wants to be like mom, or  <br/>\nwants to do things which &quot;Goddess&quot; mom does, or just wants to be  <br/>\nhuman – you are showing him how to be human. You shouldn&#39;t try to  <br/>\nmake him to be a child, just show him how you do it :-) Probably not  <br/>\ninstantly, but I&#39;m sure after a while he will just join in.<br/>\n<br/>\nSo when you want to go to sleep, don&#39;t say, You have to go to sleep  <br/>\nnow, but just start putting on your pyjamas yourself, start laying  <br/>\ndown yourself, start going to the bedroom (does it have to be the  <br/>\nbedroom?) yourself, start reading a book yourself, and if he&#39;s really  <br/>\ntired and cuddly, he&#39;ll come and join you. If you think he should  <br/>\nbathe, just go and bathe yourself – he&#39;ll see you having fun in the  <br/>\nbathtub and he can either stay out or come hin – just don&#39;t expect  <br/>\nhim to do so and don&#39;t link consequences to what he does. If he  <br/>\ndoesn&#39;t bathe - so what? if he doesn&#39;t sleep – so what?<br/>\n<br/>\nYou don&#39;t have to do big plans (we&#39;ll gonna do A, then B, then C, but  <br/>\nbefore you &quot;have to&quot; do X), because of of course he&#39;ll want to do A,  <br/>\nB and C instantely and maybe simultaneously :-D Everyhting will be  <br/>\nmore exciting than X, so just start doing X if it is really  <br/>\nnecessary, but don&#39;t use A, B and C as a &quot;reward&quot; for doing boring X.  <br/>\nMake X  fun or don&#39;t do it, and do A when it&#39;s time to do A, don&#39;t  <br/>\neven talk about A, if possible :-) Somewhere I read about an approach  <br/>\nwhich I liked a lot. Don&#39;t plan or say you can do A, B or C – just  <br/>\nsay &quot;we&#39;ll do A&quot;  and do it. If the child is OK with it, then just do  <br/>\nit. If the child says &quot;no, but I want to do B&quot;, then say &quot;OK, then,  <br/>\nlet&#39;s do B&quot; and do that instead. Somehow you just use all the  <br/>\ninformation you have about things he likes to do and needs to do and  <br/>\ncombine it to make the best choice for him. As soon as he is ready to  <br/>\nmake his own choices he&#39;ll let you know and THEN you just accept this  <br/>\nnew choice, and later you can gibe alternatives, when he can handle  <br/>\nthem. (Not this was another subject but somehow I thought of it...) I  <br/>\nrealized only too late that I was, in my quest of trying to be a good  <br/>\nparent, giving too many choices to my too young child, who couldn&#39;t  <br/>\nhandle it.<br/>\n<br/>\nNow this may sound impossible at times - maybe he&#39;ll ASK what you&#39;ll  <br/>\ndo next or it won&#39;t work at the beginning. These are just suggestions  <br/>\nand I&#39;m a newbie anyway so I might be wrong and maybe I&#39;m assuming  <br/>\nwrong things. I think the important thing is that you try to see  <br/>\nthings from HIS perspective, so you can understand his motivations  <br/>\nand understand *why* he doesn&#39;t want to do things that you think are  <br/>\nimportant. Then you can be creative and find ways to approach the  <br/>\n&quot;problem&quot;, adressing the reason for his behaviour, not the behaviour  <br/>\nitself.<br/>\n<br/>\nGreetings<br/>\nJohanna<br/>\n<br/>\n<br/>\n<br/>\nAm 20.09.2006 um 23:48 schrieb neamonn:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hello, I just joined the site..and was given the Joyfully Rejoicing<br/>\n&gt; site to get me started,,,thanks to all of you who introduced me to<br/>\n&gt; this site..I am wondering how many of you sarted this process at<br/>\n&gt; birth..I am struggling with the usual 2 yr old struggles and finding<br/>\n&gt; myself in the &quot;do this or we cant do this&quot; for example... put your<br/>\n&gt; clothes on so we can leave..and finding that I repeat a million times<br/>\n&gt; and become impatien using the &quot;fine well stay home&quot;but of course we go<br/>\n&gt; with me finally getting him dressed etc...How do you work with those<br/>\n&gt; basic topics daily..because I will ask him if he wants to to A, B C<br/>\n&gt; and he always says yes..but getting ready before we are too late is<br/>\n&gt; rough!! Or naps...never wants to but once we go to hhis room and read<br/>\n&gt; and I say goodnight he sleeps...thanks for the ideas! Natalie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Is 2 too young..","postDate":"1158813014","msgId":17513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA5MjAyMTMweTM4YmZhMmJldmVlYWIzOWE4M2ExNzUwMTBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg==","referencesHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg=="},"prevInTopic":17507,"nextInTopic":17514,"prevInTime":17512,"nextInTime":17514,"topicId":17507,"numMessagesInTopic":0,"msgSnippet":"... Does he need to be dressed to go out?  Are you wanting him to accomplish this task himself?  You state that you finally dress him yourself, so why not make","messageBody":"<div id=\"ygrps-yiv-769171183\">On 9/20/06, neamonn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:neamonn@...\">neamonn@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hello, I just joined the site..and was given the Joyfully Rejoicing<br/>\n&gt; site to get me started,,,thanks to all of you who introduced me to<br/>\n&gt; this site..I am wondering how many of you sarted this process at<br/>\n&gt; birth..I am struggling with the usual 2 yr old struggles and finding<br/>\n&gt; myself in the &quot;do this or we cant do this&quot; for example... put your<br/>\n&gt; clothes on so we can leave..and finding that I repeat a million times<br/>\n&gt; and become impatien using the &quot;fine well stay home&quot;but of course we go<br/>\n&gt; with me finally getting him dressed etc...<br/>\n<br/>\n </span></blockquote>Does he need to be dressed to go out?  Are you wanting him to<br/>\naccomplish this task himself?  You state that you finally dress him<br/>\nyourself, so why not make a game out of it (if being dressed is<br/>\nimportant to  you) and work with him to get dressed?  How much shorter<br/>\ntime would you spend on the getting dressed part if you were actively<br/>\nparticipating rather than begging, coercing, and demanding that he get<br/>\ndressed?<br/>\n<br/>\n<br/>\nHow do you work with those<br/>\n<blockquote><span title=\"ireply\"> &gt; basic topics daily..because I will ask him if he wants to to A, B C<br/>\n&gt; and he always says yes..but getting ready before we are too late is<br/>\n&gt; rough!!<br/>\n<br/>\n </span></blockquote>He&#39;s TWO!!  He&#39;s still a baby. Of course he wants to do all these fun<br/>\nthings, but time is very meaningless to him.  Either work with him to<br/>\nget out the door quicker or reevaluate the importance of being fully<br/>\ndressed.  Or bring his clothes with you and dress on the way or once<br/>\nyou get there.  There are LOTS of ways to work around this so that<br/>\neveryone is happier than your current scenario of a tired frustrated<br/>\nmom and a frustrated anxious little guy!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Or naps...never wants to but once we go to hhis room and read<br/>\n&gt; and I say goodnight he sleeps...thanks for the ideas! Natalie<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Does he have to go to his room to nap?  Does he *need* a nap or maybe<br/>\njust some quiet play, a relaxing movie, some music and a book time?<br/>\nIt&#39;s hard for him to understand at this age that life will continue or<br/>\nstill be there when he wakes up.  He probably feels like he is missing<br/>\nout on SO much when he is asleep.<br/>\n<br/>\nIt&#39;s never too soon to start unschooling!  Sit back, relax, throw out<br/>\nas many clocks as you can and enjoy your little boy!  At 2yo they<br/>\nusually don&#39;t need nor really want much more than mom.  Playgroups<br/>\ngenerally are very stressful for our little ones and many times they<br/>\nare overwhelmed by all the &quot;big things&quot; there are to do even when they<br/>\nseem fun.  Schedule less, find out what his passions are and you may<br/>\nfind that you are doing more, but it is more what he is interested in<br/>\nand what he wants to do!  Perhaps even then the struggles for dressing<br/>\nmay diminish (or you will get used to seeing him half dressed)  :)<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":283255777,"authorName":"neamonn","from":"&quot;neamonn&quot; &lt;neamonn@...&gt;","profile":"neamonn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Is 2 too young..","postDate":"1158788895","msgId":17507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlc2N1dis0dmFiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":17513,"prevInTime":17506,"nextInTime":17508,"topicId":17507,"numMessagesInTopic":0,"msgSnippet":"Hello, I just joined the site..and was given the Joyfully Rejoicing site to get me started,,,thanks to all of you who introduced me to this site..I am","messageBody":"<div id=\"ygrps-yiv-679864482\">Hello, I just joined the site..and was given the Joyfully Rejoicing <br/>\nsite to get me started,,,thanks to all of you who introduced me to <br/>\nthis site..I am wondering how many of you sarted this process at <br/>\nbirth..I am struggling with the usual 2 yr old struggles and finding <br/>\nmyself in the &quot;do this or we cant do this&quot; for example... put your <br/>\nclothes on so we can leave..and finding that I repeat a million times <br/>\nand become impatien using the &quot;fine well stay home&quot;but of course we go <br/>\nwith me finally getting him dressed etc...How do you work with those <br/>\nbasic topics daily..because I will ask him if he wants to to A, B C <br/>\nand he always says yes..but getting ready before we are too late is <br/>\nrough!! Or naps...never wants to but once we go to hhis room and read <br/>\nand I say goodnight he sleeps...thanks for the ideas! Natalie</div>","specialLinks":[]}],"prevTopicId":17380,"nextTopicId":17580}}